{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8KjXmpI9Cco1_OWkFsB7_w", "review_id": "c7kzSCqtBUaxSE_ErGf9Fw", "text": "Front desk gets 4 starts\n\nHowever, if you're looking for a good night of sleep, you may not get it.  The refrigerator made a lot of noise at night every time the compress kicked on.  Likewise with the air conditioner.  If you didn't bring a hair dryer, you'll have to get it at the front desk.  There's a sofa bed but no extra pillows nor blankets.", "business_id": "zgy27FSnvwdINfk5cXBIyQ", "stars": 3, "date": "2014-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WDS-ANF6Hru-EAwydTXk_Q", "review_id": "lTWXLwGxPSVqsfpo-yxu1Q", "text": "This was the worst hotel that I ever stayed in. my hubby and I  took the smoking room and it stunk sooo bad that I wanted to throw up. I was afraid to sleep in that nasty bed. in the morning at 5am I wanted to leave the room cuz smell was sooo gross that woke me up! I felt so dirty that I took two showers AT Other HOTEL. I never thought that I will have nightmares bcz of bad and stinky hotel.", "business_id": "nvrXLcmknaYuiGRquWhwIQ", "stars": 1, "date": "2013-11-17", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "dapbOj1WwSchUr-7V63IBg", "review_id": "cv788RhnktsEAX_O7YYa6A", "text": "I don't even really know where to begin with this review. I guess the most sensical thing to do with such a nonsensical transit system is a pros and cons list. (If nothing it will be the quickest and least painful for me and for you, my dear sweet reader.)\n\nPros -\nIt is rare to find I can't get a bus to a place I want to go. Truth be told I don't leave the city a whole lot, but anytime I want to get somewhere with some leg work I can find a bus to take me where I want.\n\nMy morning bus (especially the insanely early 5am 86 from Bloomfield to work and the gym downtown) is almost always on time. \n\nCons - \nIt's a known fact that the last 54 from the Southside to the East End/Oakland/Etc rarely to never comes and the \"last one\" is NOT late enough to be considered an after the bars options to get home.\n\nIt's pretty common for the buses to either be a full 15 min early or 10 min late.\n\nI've seen more than one person pee themselves.\n\nI've had a bus driver just plain ignore my request for a stop and then ignore ME while I'm telling them as much.\n\nPACKED buses and constantly cutting routes and trips.\n\nDirty buses. I've seen a dirty diaper or two.\n\nI don't own a car so it's really my only mode of transportation since we can catch cabs here like in a normal city. I'd be lost without it, but it could be much much much better.", "business_id": "1n0n_-Iz0e3iVpH8sereiA", "stars": 2, "date": "2011-11-28", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "6kJ9OXgotJzYBdWWTOjpCg", "review_id": "s_PO0bzsfdCjtO1Z8kJSGQ", "text": "July meant wedding season back home in Pennsylvania again, so off to Amish country I went.. with the brand new boyfriend in tow. Love me, love my cow tipping roots. That's the rule. And I'm all for anything that makes me look like less of a bitter, cynical, spinster... even if that means I have to drag my disgruntled boy toy 3,000 miles across the country. No kittens and doilies here, my friend!  I like boys and they like me!\n\nI pricelined this puppy for $75 per night, which is a cost savings of $200 off of their regular price. Who in the world spends $300 to spend a night in Pittsburgh!? That's crazy talk. I've said it before and I'll say it again... I strongly encourage anyone that travels to use Priceline's \"Name Your Own Price\" feature in order to score some amazing deals on hotels. Trust Captain Kirk. He knows what's up. http://www.priceline.com. It's super easy to do in downtown Pittsburgh because there are so few four star hotels and they are very, very rarely full. Ditto for using it for rental cars. Airplane tickets.. hmm... not so much, unless 4 connections and 5 hour layovers don't bother you. Anyway...\n\nThe location is great, especially if you are a theater or sports fan. We checked in at night, so we got to see the lights on PNC Park across the water.  Our room service order was a combination of cluster-F and comedy of errors. I believe there were a total of 3 errors for a simple breakfast order. Jeez Louise.  The room itself was super tiny... like European tiny (in the 200 sq. ft. range)... which we hadn't expected, but it was still worth it for what we paid. The lobby was historically beautiful and opulent. The valet parking is slow and pricey, and they just use the public garage across the street but charge double for it. I liked the Omni better (Pricelined for $80 a few days later), which I'll review next.", "business_id": "A38wziZJdYoijhC5S6uWCQ", "stars": 3, "date": "2007-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BKc9Qq6SUfFb1Gc33wcvXQ", "review_id": "V-ncdedp4KBKUdHzTRfILw", "text": "I've spent a least four stays here for work. I love the location in downtown Pittsburgh, overlooking the river and the bridges  (last time, I was able to watch a Pirates game at PNC from my room!)  Renaissance Hotels are my favorite marque after JW Marriott and my room was excellent for under $200. Also, the hotel restaurant, Braddocks is really terrific.", "business_id": "A38wziZJdYoijhC5S6uWCQ", "stars": 4, "date": "2014-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "xfuDXvtWsJSRQlu5zjJKCw", "review_id": "Lny79OuykDPYx1uTk44uIw", "text": "Marginal at best for the money. The whole place really does not seem up to the standard of other Westin properties I have stayed at.", "business_id": "bWWrrsPWuoHuAGUCgH8Tyg", "stars": 2, "date": "2012-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RDSlNrbAMVu-7WpVhKznvw", "review_id": "YYLcYRQJPUfMgI5sp89ceA", "text": "I would not stay here, it's not worth the money they charge. Going through other reviews (here and on other sites), it seems some of the issues I had were not new or happening for the first time; this to me indicates they don't have the willingness or resources to maintain their rooms properly.\n\nIn order of appearance, here are the issues I had during my two night stay:\n\n- The minifridge had a former guest's leftovers still in it\n\n- The TV would sometimes not work-- rather, only the sound would work, but the screen would remain black. I'd have to turn it off and on again and that would do the trick usually\n\n- Their HVAC system was fairly loud IMO\n\n- Each side of the bed comes with a nightlight with an integrated power outlet. The power outlets were, in my opinion, shoddily installed; which meant that after plugging in my phone charger and leaving it on for the entire night, my phone did not fully charge. I discovered the only way to get it to charge was to manually hold the charger against the outlet, which I can do for a few minutes but after a while... it gets old. I didn't have problems plugging my charger in any other outlet, just the ones by the bed.\n\n- Yellow/brownish water! My room came with an awesome jacuzzi. Following instructions, I filled the jacuzzi with water, only to discover the water was yellow. First I thought the lighting in the room might be making it *look* yellow... but no, the water was actually quite yellowish/brown. I compared a glass of water taken from the jacuzzi to one taken from the sink area and the difference was noticeable. So if you do stay here, be on the lookout for the color of your water. But, not all jacuzzi hope is lost: I emptied the jacuzzi and re-filled it and the water looked more clear the second time. Hooray!\n\nSo those were the bad things. Now for the good:\n\n- Great customer service. The front desk was always very nice and polite and they had no problem with quickly getting me a blanket moments after I requested one (I felt cold in the room)\n\n- Convenient shuttle service. It only moves within a few miles of the hotel (so it won't take you or pick you up from the airport, unfortunately) but it was free, super useful to get around the city, and the drivers were friendly and knowledgeable about the area\n\nI should note that none of the problems I had were insurmountable (though yellowish water and strangers' leftovers are off-putting) and had it happened at a different price point, the customer service would have made up for it. But having paid $500 to stay there for 2 nights, I was pretty disappointed.", "business_id": "DiPbxquQQHSgz123I27Drg", "stars": 2, "date": "2015-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "T_wjLgPOPXry7Bea4MzoVQ", "review_id": "Zk18h-nT_1qOhHKnJE94NA", "text": "Somewhat dated...REALLY large and easy to get lost -- multiple towers with multiple levels.  If you can think of a labrynth, then you will understand what I mean about this hotel.   The rooms and the service were really nothing spectacular.  Parking can be somewhat of a hassle if you don't know where to park -- there are three different areas on three different levels of the mountain.\n\nBeware of the room service as well.  I like tea before my coffee and would get a cup from room service.  They charge for the tea.  They add tax.  They add a hotel service charge.  They add a hotel delivery fee.  And then there is the gratuity line that is added in.  WHAT?  Don't add anything to the gratuity line...that is what the delivery fee and the hotel service charge is for.  Starbuck is half the price after all of the additional fees and it is right around the corner.", "business_id": "U12GISjtUQ7j9KMJ0nfnDQ", "stars": 3, "date": "2009-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S49ffO4tm9YN7R851gBN2w", "review_id": "wIf5ZlWmUp7dGa4NImuCcA", "text": "We stayed at a hampton inn in concord one night, then this hampton the next night. This one was so much better, except for the room we were in. 602 made us both sick, it had a mold or something. The front desk was very courteous in moving us when this was mentioned and the 2nd room was very nice. Breakfast was delish. And the hotel is located in a very nice area, right next to southpark mall and right down the road from carowinds :)", "business_id": "59HuAvV6cPuVqaDL3yoFxA", "stars": 4, "date": "2010-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zDYarh6wvemkHw8Y-4wLDQ", "review_id": "c7KURGVWg3jgxwkobwyDJA", "text": "I had such high hopes! The person who greeted me was wonderful and took care of my large bag and car. But my room is outdated and smells like there has been a massive leak. In the hall there are mops and vacuums. Not a good sign. Is it tomorrow yet when I get to check out? This place is not worth the price!", "business_id": "fJ72j9pRjLcRzBA_EhB4-g", "stars": 1, "date": "2013-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Xd_gK-S3bep9iJAJKZonSg", "review_id": "Oin9wSM2gl-iciLjDYjQHg", "text": "Stayed here for about 3 days since there was a conference going on.\n\nI would say it is in a pretty nice location.  Located at the end of Uptown (?), I did walk up Tryon and College St. a bit to check out the rest of the Uptown area, and it was no more than 10-15 minutes walking to the different restaurants.\n\nFor a Westin, it is one of the newer ones I've been to.  Westin really knows how to design their lobby and create a spacious setting.  The lobby is relaxed and oddly welcoming, which you can't really say about a lot of hotels.\n\nThe staff was courteous and we checked in with no problem.  The rooms were a nice surprise as it is fairly spacious.  All the usual amenities are there, such as internet, LCD TV etc, and who doesn't love the Heavenly bed and the shower heads??  Although one thing I didn't like was definitely the lack of a mini-fridge.  They only had the mini-bar fridge and you have to request a key to unlock it.  Even after you do unlock it, there's no room for you to put anything there, and I was too afraid of getting charged if anything was moved.\n\nInternet does cost around $13 a night, which is fairly high, but at this point, I've accepted the charges for internet is an expense I will be paying.\n\nThe gym at this Westin is amazing.  The gym is connected to the pool with a \"refresh area\" after you swim.  The gym itself is quite big, especially for hotel standards!  Bikes, elliptical, plenty of treadmills, and a few weight-training machines.  All the cardio machines have their own TV and if you have your headphones, you can just plug it in.  Even if you don't have headphones, they have disposable headphones there that you can use for free!  They also provide fresh towels, as well as water dispensers.  I definitely took advantage of the gym while I stayed there.\n\nAs for the conference space, it does a pretty good job, with plenty of meeting rooms and ballrooms.  Of course, the conference i was attending only had several hundred of people, which isn't that big for a conference.  Caterting was done right near the escalators.\n\nI didn't eat the restaurants on location since most of the meals were taken care of by the conference but I did check it price... and I would definitely venture out and explore the city a bit.  For the same price, I could probably check out a nice steakhouse around the area.\n\nWould definitely try to stay here again next time if I'm able to visit Charlotte again!", "business_id": "4nFqPL-glgDm9v7bZptskQ", "stars": 4, "date": "2011-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_rFtzdIrlhVz-ZtcBsfbsw", "review_id": "RqUIzy2AI9NI-6S9wD8bIQ", "text": "Big box hotel.\n\nWent to the bar for a glass of wine---unbelievable.  The bar was out of pinot noir, merlot and malbac.  Basically what was some dubious cab.  The bar was understaffed for the big convention that apparently was in the hotel.\n\nWe put a door hanger our for breakfast (yogurt and coffee) to be delivered at 7.  At 8 am and two phone calls, still no coffee.  No apologies.   First phone call at 7:35 we were told it was on its way.  Second phone call at 7:50, they are sending it up \"right now.\"\n\nThe carpet in the room is very stained and worn (staring at it as I type and wishing I had flip flops to I would not have to walk on it).  \n\nBig box, impersonal hotel.  The views are not worth it.\n\nPS....8:30 and still no coffee or breakfast.  Time to check out and never come back.  Will upload photos in another review.", "business_id": "4nFqPL-glgDm9v7bZptskQ", "stars": 1, "date": "2015-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "vsiQmP-XXKZqDETydzbW4A", "review_id": "XWc_1LzpQWOIpIZap-qNPQ", "text": "Great first impression.  Lobby looks very clean and nice, staff are friendly, the hallway on the 8th floor is bright, clean and feels cool, not warm and muggy like some hotels.  \n\nThe rooms are very nice and contemporary, with nice clean corners.  The bathroom is clean, one of the best I've seen.\n\nThe AC has a motion sensor which is annoying, I was able to get the staff to bypass it and I was able to get the temperature down to 60.  Which feels very pleasant.\n\nGot my warm cookie, breakfast coupons and free Internet for being a diamond member.\n\nI never tried breakfast, even though I had free breakfast coupons I was simply too lazy to wake up early enough to try it.\n\nThe gym was nice, they had free weights, 2 treadmill (one was broken) and 2 elliptical machines.\n\nParking was in a parking structure that requires your hotel card or pay as you go.\n\nI would recommend this hotel.", "business_id": "IYNZXcNVXiCVavCrplXPlQ", "stars": 5, "date": "2013-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1TFI1ZvdBOHXfRypqJihEA", "review_id": "0geb5O40L89RJjb1XhR76Q", "text": "We booked here specifically because of the free shuttle,  only to find out that the 3 mile radius comes with unwritten stipulations as to where they're willing to take you.  We were refused any destinations on North Davidson (so don't even think about trying to get to Revolution pizza, or Growlers for their phenomenal house made sausages).  This also excludes any of the craft breweries within the 3 mile radius.   We were given the excuse that traffic is too heavy, they're located in dangerous neighborhoods & they have ordinances against public shuttle services (seriously??).  Funny that our taxi was only one of a line of busses and vans picking up and dropping off patrons at NoDa.\n\nAs for the accommodations themselves,  it is your typical Hampton, nothing fancy.  The bed was comfortable but the ac/heat runs of a wall thermostat straight out of the 60's.   The room was either too hot or too cold and the unit was not able to maintain a consistent temperature.  The breakfast was mediocre and the area where it is set up is very congested. People crowd around the waffle irons, making it impossible to access the toaster or pastries.\n\nI really would not recommend staying here unless there was nothing else available.   There are many far nicer hotels for the same price within a few block radius,  and we will definitely stay at one of those when we are in Charlotte again.", "business_id": "ShPDadyMMhRphFZApeG8-Q", "stars": 2, "date": "2013-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UopyPna6Cm0JjuiFCibkYg", "review_id": "c3829fTWeooGOlAgWp-rYw", "text": "This hotel is located in the heart of Downtown Charlotte, across from a decent-sized shopping area. \n\nThe rooms were fine, but the walls were a touch thin.\n\nThe hotel staff were friendly, helpful and professional.\n\nMy room was just fine, clean and well-appointed, outlets for all your electronics where they need to be. \n\nValet parking was great; I never had to wait for my car beyond when I requested it for. All of the valet staff seemed to have high morale; I know this is a strange comment but I found it so refreshing I had to mention it here.", "business_id": "QThlnQ7AvzZwXHKD5DjdCw", "stars": 3, "date": "2013-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "J0h_oB2VEhMTlcqKmspjWQ", "review_id": "mG1jKoQRbJbNREQk8eDpAQ", "text": "To Amtrak, I give 5 stars for providing a needed service to those who ride the rails.  For the station in Charlotte, I give 3 stars.  Parking is atrocious and the taxi cabs keep you from picking up your passenger in front of the station.  This is a big problem for our seniors!  The station is always clean but when it is crowded, which is usually is when a train is either leaving or arriving, it's ridiculous.  When comparing our station to others I have visited, ours is accommodating, but old as h-e-xx!  The benches are truly old school.  Furniture made today should hold up as well!  On my last visit, I had to park in the grass and it was a bit wet from a recent rain.  However, my passenger arrived safely and received great service during the ride in business class (of course).", "business_id": "3lr10jxwg-ObDwtCKxEBgA", "stars": 4, "date": "2012-10-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 3}, "user_id": "q6hiZCOlvZ-JWY5alt4aiw", "review_id": "L2wG4rq3nuO9srZ_1F1Ttg", "text": "What a charming airport. I'm not kidding.  You can plug in your laptop and work  ... in a rocking chair!  The cashiers say \"God bless.\" And I watched a friendly volunteer chaplain greet a woman with a camo backpack, to tell her all about the airport USO.  \n\nAnd don't miss the NASCAR shop!", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 4, "date": "2009-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2QgLdznnVc0GB1D1Dj8FYA", "review_id": "Dt1V1x52olqrhsynG_FLpg", "text": "I like layovers at CLT. I actually wish I could have them here instead of some other airport that shall remain nameless...::coughATLcough:: \n\nI've only had layovers, but from what I could tell, the airport is not that big. But medium airports are definitely not bad in my book. It is actually very welcoming, especially when they have as good amenities as CLT. So where CLT lacks in size, it definitely makes up in character. \n\nThere are rocking chairs all around the airport, which is great to just sit and break from the hustle and bustle of travel. It is very clean and bright with natural light. It kind of adds to the pleasant, relaxing mood. There are delicious food options and cute shops to browse. \n\nFlights typical depart on time and connecting luggage makes it to its final destination. \n\nFor an airport, it has a relaxing vibe which is much appreciated :-)", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 3, "date": "2010-11-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "LuUL0Qcs7SCbox4NRYnB_g", "review_id": "J8YTjb_sYYuY7rAKPwrwLQ", "text": "This airport is almost TOO big. Make sure you give yourself LOTS of time to get to your gate if you have a layover. I'm not sure why they separate US Airways (I landed in C and had to run to E) but its frustrating and I'm sure a lot of people miss flights.\n\nThey have a ton of food options, singing bathroom attendants, and shuttles for older people who can not walk the extremely large airport!", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 4, "date": "2011-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8sOjFz864y9QLvTkJvCoMA", "review_id": "d7_Fzgy-XDjPGuZhkSbAQg", "text": "As a North Carolina native now living in DC, I come through Charlotte Douglas pretty frequently.  I've never had a problem in this airport, but don't like the hub and spoke layout.  If you land in one Terminal and have to get to another quickly, you better pick up the pace, as there is no train between terminals.  There's plenty of shopping, restaurants, and bars, but the layout makes it less than convenient to get to what you want.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 3, "date": "2012-09-01", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "2i9Rbvt3rmksJVHBxtZbuw", "review_id": "5wiNvM5kPJj1Te83XNZvMA", "text": "If there's one thing that NC gets right it is definitely hospitality. Next to SFO, this is my favorite major airport .  Although large and very busy, the layout is spacious and spread out.  I never feel like I'm packed like a sardine in a can like I do connecting through Atlanta.  There are plenty of seating and electrical outlets to charge electronics.  Rocking chairs adorn the airport throughout, many placed near windows for some good ol' southern comfort.  Many of the shops are high-end, and even a nail &spa parlor is situated near the jewelry store.  Bathrooms are always maintained, cleaned and oftentimes travelers are greeted by bathroom attendants.  And yes folks, sometimes  a pianist serenades travelers on his grand piano as they pass through the food court to an opposing terminal.  The best part---FREE wifi.  In an era when traveling with comfort is going into extinction I appreciate your classiness Charlotte.  You've earned the nickname Queen City at least in my book.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 4, "date": "2012-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7vqTaTgF5eHRs_juoCug5g", "review_id": "lmuEm4ZoslrAl2wxhZ9XfA", "text": "This is one of my favorite airports. It's warm and fuzzy with it's rocking chairs. It's big... but not a zoo. Easy to navigate and a great airport to layover in in between flights!", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 4, "date": "2013-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bF2IRlw3v0SCs9cdz0hXDw", "review_id": "TmOD0ccgWY-W8b1jJ2U4ZA", "text": "Dear Airport:  I've never been inside you, but let me tell you how much you suck on the outside. You suck a lot. Is this entire place under construction??? Oh, yes... yes, it is. Did a nuclear bomb take out short term parking? The roads leading in and up to the terminal are a confusing, cone-zone maze and are also under construction. The construction appears to be under construction. Hate you.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 1, "date": "2013-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QeuXZPhx3NVKd54EhCHQcw", "review_id": "1kgfFgwtKJGbFa1n_1AKuA", "text": "A bit dark in the evening. Could use more signage. Customs can take a while, so don't try to cut your flight too close.  Staff is friendly and foods are overpriced. Otherwise, no complaints so far.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 3, "date": "2013-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pnLmKLhdobt0xZqV9Qw28g", "review_id": "Kjh6JWF-Scwp6OMyg-PaZA", "text": "This is by far one of the warmest and most crowded airports I've been to.\n\nI'm not sure how big this airport is, but after taking a stroll throughout the whole facility, I saw that every terminal was bustling with people. Seats were filled up and many people were standing up while waiting for their flight.\n\nRestrooms are fairly clean -- I like how there are attendants there ensuring that the sinks were dry and that there are paper towels in every dispenser. Hey, they even have a basket of candy there, too. I'm surprised some US airports have that -- I usually see attendants in overseas airports.\n\nMost of the airport staff members are friendly. Shop owners were also friendly to talk to while shopping for a few things. The selection of restaurants, however, isn't too great. Then again, if your layover isn't too long, that shouldn't be too big of an issue.\n\nThere's free WiFi but it takes forever for me to connect, whether on my iPhone or my Mac. Also, this airport needs more charging stations; there aren't enough to go around for the thousands of people who go through the terminals.\n\nAnd YES, as Skye A. mentions, PLEASE turn the damn AC on in EVERY terminal! It sucks when you get in an argument with the Sbarro cashier -- it sucks even more knowing that the heat is adding to your frustration!", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 3, "date": "2014-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_0N_zpFmGIspFZfZr2gmmQ", "review_id": "qHsP9w_1Ezs85KZzNnbkZA", "text": "I like this airport so much that I moved here! They did this one right - parking, food, security, rocking chairs and the easy layout. My only other favorites are Long Beach and San Jose.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 5, "date": "2014-10-12", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 1}, "user_id": "pkWLZZvUnSdlsjeLO8Lt8g", "review_id": "pzjJHY8xRRJyyVZt5ACIdQ", "text": "Get ready to walk or run, whichever. I have flown in and out of CLT about 1000 times, usually on a connection. CLT is very large, and you will use about 10 moving sidewalks, and escalators. They do have nice rocking chairs spread throughout, however I doubt you will have time to lavish the slow life. The food is okay at best, mostly fast food, as all airports. \n\nThe 2 stars for me comes from the massive delays on the runway. You WILL sit on the airplane in a big huge line waiting to take off, or you will wait for an open gate for your plane to park. That gets annoying. In addition, the runways are really long, so it makes for a LONG taxi. \n\nI always joke and say when you are flying from CLT you will feel like the plane is driving to the destination not flying.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 2, "date": "2014-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KYIkS9WKhesgkMFkMpPENw", "review_id": "qZ1-KC-6ptLuRctnNa9DYA", "text": "Great airport. Small size but volume of traffic is not intimidating (flying on a Saturday with a 3 hour layover). \n\nStaff is courteous and there are attendants at every bathroom so it is quite clean and feels more upscale than almost every other airport. \n\nDoes enough to build a pleasant experience. \nTheir general concourse piano player could use so tuning up though.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 4, "date": "2015-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2IIyGTOZ3nsuq9Bns7W4ww", "review_id": "OCUICMaD2SW7DYX24ivRag", "text": "Very convenient terminal, with fast access to car rentals. The only thing I found missing was a Chick-Fil-A.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 4, "date": "2015-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pEiFlx4udVr9UUkd4LWlvA", "review_id": "3ZJXWp9k6Uwv4fRuhDOTHw", "text": "For the love of god, don't stay at this hotel.... it was gross, old, and lots of shady ass people coming in and out of the hotel. My hubby booked this hotel after seeing good ratings on trip advisor (ALL LIES!!!) we thought, wow good reviews and very low rate, so we booked for two nights. We get to check in and already we see (probably a hooker and her dealer) arguing with the front desk people because they couldn't get a room and leave. Then my husband goes to check in and they ask for his id... here is when I should've said \"hey- we should leave they are obviously running a criminal check or something on your id\"----fyi, that is a bad sign for any hotel!!!\nBut we drove a long way and needed a place to stay in Charlotte. \nWe got into our room, gross and nasty. Mold in the bathroom, bedsheets smelled like smoke, and the door to our room had the wimpiest lock, and anyone could've broken in because the door barely closed all the way. Let me say we were so worried that we pushed a table against the door before we went to sleep- although major lack of sleep! People next door sounded like meth addicts up all night partying. \nWe checked out right away in the morning. The hotel clerk said that they couldn't refund us for the extra night we already booked because we did it through trip advisor. Whatever, we just wanted to get the hell outta there, lesson learned and money wasted!\nPlease don't stay here, I know it seems like a good deal online, but if you're going to stay in Charlotte- spend more money on a nicer hotel!", "business_id": "_JGqL8Cyqmph3dZeiLl4tA", "stars": 1, "date": "2013-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DAt_JiufQDhFcQg7mDi_zA", "review_id": "jOd0Pz713SkK2otgBycJfg", "text": "I had a Gold reservation but arrived to find my name was not on the board. I waited in line with a dozen other livid Gold members and was then offfered a mini-van or to pay extra for an upgrade. If I gould give Hertz a zero I would.", "business_id": "eThu9hCL8NOjOxswQ-cFSg", "stars": 1, "date": "2013-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8L9S0pAJ092wXJkMbrfHSg", "review_id": "866F0t8U7hSz16I0bdICJg", "text": "Reserved a car. They tried to get me to upgrade twice. Then after I didn't take the bait, they notified me they didn't have my car. Then said come back in 20mins.", "business_id": "eThu9hCL8NOjOxswQ-cFSg", "stars": 1, "date": "2015-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VkkQcJnPnE6p-NvkwgRRnQ", "review_id": "AHsOpljIczJmXi6Eb-xLXQ", "text": "I always rent from this location due to proximity of work and our contract. I have rented from other locations in the near area, but always come back to National. I like their rates, rewards and the fact that I always have a full tank of gas when I pick up the car. The staff is very friendly and professional and the choice of cars regarding quality are tops. Always clean. The only downside is the location at the airport and having to pay for parking, take the shuttle. I  sometimes cheat and walk from the parking garage, although it is not safe.", "business_id": "t8Dz2luOZ-4NhT8DPxFdqQ", "stars": 4, "date": "2014-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oPDBcQGPERsIEB1WCfe_0Q", "review_id": "9iuRqj9ALz9j91lZ3m6J9Q", "text": "At the end of July I contacted the 800 reservation line at Alamo to make plans for a car rental from August 6-August 13 at the Charlotte airport location. I was going to be using my Hilton Honors points to secure this car, and was told by Hilton that BEFORE I took points from my bank to make sure that this location accepted points as payment, as some locations do not, and to make sure there were no blackout days. your 800 reservations team told me to contact the airport location to confirm that they would accept pmt with points, which I did, and was told there are no blackout days for this program. They said go ahead and retrieve your code necessary from hilton and call us back to reserve. \n\nI got the necessary code from Hilton the following Monday and called the 800 #, but was told to call the location to secure thew reservation since I would be using points. I then called Charlotte lonely to be told they don't make reservations there, call the 800 # again.....\nSo I called back to the reservation line and was told that while Charlotte accepts the points program and there are no blackout days, they had reached the limit of the # of reservations allowable under that program for the day and would not make my reservation. They sent me to an escalation dept where I takes to a gentleman named Norman.  He was pleasant, but of no use..... He said he wild pass my info to a supervisor and ask that they call.  I waited.....\nI called corporate in St. Louis and asked for someone that could assist me, only to get \"Norman\" again. He said I had to wait for a call. No one else would help me.    A few days later I get a rude call from Angie at the Charlotte location - she left a voice mail that said she can't help me, call the reservation line.  So once again I called the 800# ad  spoke to a very nice girl, maybe Lakresha??  African American girl that was the most pleasant person to work with. She tried everything she cod to get me a car close to the dates I needed, with my points , but to no avail.  \n\nSo I ended up paying for a rental, $240.00 that had not been budgeted for, and I've lost 70,000 points with Hilton and got NOTHING for it but a disgusting run around from Alamo. \n\nI fell was dealt with very unfairly and not given the true restrictions behind using Alamo for my rental. I confirmed no black out days and then given the surprise \"But......\nI would never have risked this transaction had I been told that a rental may still not be possible.   \nAfter emailing customer service and getting an incident number assigned to me I was told:\n\n\" I completely understand your frustration. I have document this email thoroughly and will do my best to get you the resolution you deserve. I have also forwarded this email and your contact information directly to the Regional Customer Service Department for Charlotte. They will reach out to you within the next 3-5 days. Your Incident ID number regarding this issue is: 20521478. again I apologize for the inconvenience this has cause you. If you have any additional questions, comments or concerns please feel free to reach out to me and I will aid you in any way I possibly can.\"\n\nWell, weeks later I have no phone call, and more emails that blame me for not booking far enough in advance, missing the entire problem of their sales people not stating the policy, IN FULL, for renting a vehicle using Hilton Honors points. \n\nNever EVER again. Stay away from this group of companies.", "business_id": "xr0tU-S2z-X6rCOLMX18sw", "stars": 1, "date": "2014-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 2}, "user_id": "JcJwC-NxaVJ6xUTYpC9AMw", "review_id": "P20b-0teolPlhqm29T8PLw", "text": "This place is promoted as a 3-star hotel.  All hotels are not the same.  All cities are not the same.  When traveling from one region of the country into another adjust your expectations accordingly.  If you are coming from the NY or SF/LA area into Charlotte then your expectations for a 3 star hotel according to the ratings need to be adjusted.  This hotel is billed on-line as a 3 star hotel.  It is a 2 star hotel at best.\n\nThe staff is friendly, helpful and very accommodating.  The hotel itself is in need of a serious upgrade to make it to 3 stars.  The walls in the room show signs of serious water damage with cracks in the plaster and peeling paint and wallpaper.  The TV is outdated and old.  The number of channels is limited.  The plumbing system needs some serious attention.  There were two temperatures...freezing cold or scalding hot.  The medium temperature selection resulted in a water flow akin to a trickle.  With other hotels in the same 3-star category such as the Hilton, Hyatt and other top names downtown, don't get suckered into this location by the airport.", "business_id": "g42cM7kIBsP1o3VBkLtHuQ", "stars": 2, "date": "2007-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "do-fO-EruYVP_FQPMNWmZg", "review_id": "hHl3bA5oj7C6mKyGcsTTYA", "text": "I attended an event this past weekend in the Lakeview Room.  Due to the weather we booked a room and checked in around 5:00.  Check-in was easy, but upon arriving in our room it was nice, but one disappointing thing, they did not provide a blow dryer. I used to bring mine to every hotel, but most hotels I stay in recently provide one. The one time I decide not to, they don't provide.  I was able to call the lobby and have one brought up to me.\n\nThe event started at 7:00 and upon entering the Lakeview room, it was very outdated.  Although it has a great view of the lake outside, the carpet, seating and overall look of the room could definitely use a makeover.  A buffet was set up along one wall and unfortunately the food was SO disappointing I could not eat too much.  The serving dishes did not seem to remain hot so everything served, from stuffed mushrooms, chicken, to pasta was all cold. And, everything didn't have any flavor.  There was, however, a chicken and waffle station set up in one corner, which was cooked to order so that was at least warm, but was okay.\n\nAfter the event we went to the hotel bar, which had a good crowd.  However, they seemed to run out of several wines we requested and the service was slow.\nI did however sleep very well and enjoyed the breakfast brunch that was set up in the lobby Sunday morning and was ony $12.99.\nOverall, it was a nice stay, but definitely outdated and the food could definitely use some work.", "business_id": "CN6AB-R4OLsKxFhQ1Kk68g", "stars": 3, "date": "2015-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XYrwe2BoYT8ScVwpqZuTrw", "review_id": "xs_mhJKjAK4MvrlhJCgPTw", "text": "Do not trust this days in. Note on wall saying no refund after 15 mins but out of site so you don't see and takes that long to drive around to room walk up stairs and see the state of the room. No refund given. Rude and unprofessional. \n\nThey take your money.  You don't get to see the room. I asked for non smoking. All I got was a smoking room. Went back and changed and got another smokers room. Came back and got shown a sign on the wall to the side\n\nOUT OF SITE TILL THEY SHOW YOU NO REFUND AFTER 15 mins.  Do not trust this days in. They stole my money. The room is not worth 58 bucks. It's not worth 30 bucks. Ramada hotel Charlotte airport and conference center and for 10 bucks more it's like going from a dumpster to a royal palace. \n\nTake my word. Don't waste your time or money.  And if you don't believing me ask if you can see a room before paying. And I bet they will refuse cause the photos look nothing like the rooms.  Trust and go elsewhere. I lost money. No refund and I have to wait till the money hits my bank and then I get it back but as I am leaving the USA. Well that will take time.  So don't take my word. If they don't let you see. Go else where. Why would they say 15 mins lose refund. Simple. It's that bad!!!!!!!!!! Unprofessional when owner says go to hell to a customer asking for refund!!  I won't even give it one star if I could but I have to", "business_id": "EazMTR-bLp8DQgMfUqQMoA", "stars": 1, "date": "2014-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sFu-A2WTXKBiEDvjRvezYA", "review_id": "pJZ1D4n99xYeA2obBoJ9dg", "text": "We have exhibited at a conference at this hotel every year.  It is so nice to see familiar faces behind the checkin area. Patrick Cady & John Polnow made our check-in smooth & easy (unlike the last two hotels where we stayed). The beds are very comfortable. The atrium off of the lobby is beautiful and an excellent space for vendors.  The tables in the exhibit area had been set up exactly as we had requested.  I was so impressed with the management. Kurt Peterson made  himself available to us throughout our stay. Sometimes it seemed like he was here 24/7. Staff really seemed to respect him. Another manager that we really like is Keola Shimooka.He remembered us from previous years.  Today I learned that Lamont & Mark, the gents who set out the food for breakfast & breaks have been at this hotel close to 20 years. They are always smiling. I generally provide less detail but we had such a poor experience last week in Baltimore with staff - from check-in through checkout.", "business_id": "ckLRf3lYn9DxmNxd-mu2yA", "stars": 5, "date": "2015-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "39q5qn63EzwgcZmDbLtBIw", "review_id": "ldD5YvABnAJPWMGCg19Q_Q", "text": "Always on time, great service, clean green cars, and they are a co-op! I only use Union Cab, and have never been disappointed. They are super flexible, and I can order cabs online and on my phone.", "business_id": "5TQQy_x_ArR3_5L5L0fFVQ", "stars": 5, "date": "2014-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p5esRZk_c9vC6zXdtmvyMQ", "review_id": "NTVdliJVusaSs2Z_1FQaTQ", "text": "The room had big stains on carpet. The free wifi was completely unreliable and cut off every five to seven minutes.  The tub drain did not work and couldn't be a new issue. This was better than the first room in which they tried to put me which smelled like there was a sewage issue. I told them the room smelled unfortunate and that I had a cold, so it must be bad. They did move me without a problem.  The service was good other than the fact that the early morning guy couldn't be bothered to get off the phone even for a second. Stay elsewhere if you have a choice.", "business_id": "Hh5lyZtOrS5LKk4YCgj8Kw", "stars": 2, "date": "2014-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "89BrjhKMvd1S1ME_-rWdnw", "review_id": "6p2Jfu9jwj4TvKxMttvxXQ", "text": "Very nice Hampton Inn with a friendly staff. Nice pool and fitness area. The breakfast was standard breads, fruits, cereal, eggs, bacon, juices, etc. Special Diamond parking. Pantry sells food, wine & beer until 9 pm. \nThe room itself had a nice desk/ work area with a large flat screen TV. The bathroom was clean. Bed was comfortable. You won't be disappointed staying here.", "business_id": "HYFwjbK7HbvzENF44ACfdA", "stars": 4, "date": "2015-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hToSCVEg2CfejHYst9cRhA", "review_id": "5Np4GVfrgLD7tftHGl7Ijw", "text": "This place is what I expect from a Marriott. The staff is friendly, the rooms are up to date, and the stay was perfect. \n\nTo start with, I had a king room with a pull out couch. The TV location makes it so it is better to watch TV from the couch, but it does pull out if you want to watch from bed. There is also a small fridge, desk, and coffee maker. The bed is very comfortable being not too soft, not too hard, but just right. \n\nI also checked out the gym which has 2 treadmills, elliptical, and stationary bike. They also have some free weights and a water fountain. The nice this is each TV has its own TV with a full breadth of channels. There is also a moderate size pool that was tempting to jump in. \n\nThe most unique thing about the hotel is that there are two separate elevators, one for each side of the building. Smart idea. \n\nOverall nice hotel that is up to date and has multiple amenities. Good choice while staying in east Madison.", "business_id": "CNvF4BsuFEfC-0Ol4cAD3w", "stars": 4, "date": "2014-11-21", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 0}, "user_id": "47O4htgjIeTTv6cJ-kgRxA", "review_id": "M2I_YKXFRa7qycPDhq7IfA", "text": "My fiancee and I have been putting off going back to see the University of Illinois campus for a while now. We saw that Super 8 was having a crazy anniversary sale on rooms where if you booked online on a certain date and time, your room would only be $8.88. We decided this would be the perfect oppurtunity to head down to Champaign so we tried to book the room and got it.\n\nThis is the point where I tell you if I had paid any more than $8.88, I would have felt ripped off. The room smelled very weird (that smell that makes you think someone could have died in there but they used enough chemicals to kill every last skin cell), the bedding was very itchy, and the shower curtain didn't even have any plastic liner to keep the water in the tub. The only positives (the reason it gets two stars instead of one) were that there was good pressure in the shower and the location was not bad. Honestly though, unless it is a crazy deal like we had, there are better hotels in the area. There is even a nicer Super 8 near Lincoln Avenue.", "business_id": "nYb3nMwhVsmc-hQRXRU4Sg", "stars": 2, "date": "2008-09-05", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "mCShrTt9aMtDCssz9t-jJA", "review_id": "8kLm-6OETbNa8J7cokZehw", "text": "This motel deserves 0 stars! The receptionist was smoking outside and didn't come in until she was done with her cigarette. The entire lobby smelled like smoke and was very rude when we checked in and asked for a non smoking room. I also went down to ask for\nMore towels and she gave me so much attitude. The rooms were disgusting and dirty. I did not feel safe in this hotel. I would never stay here again!!!!!!!!", "business_id": "KyXO7gXGVdpPJ1enxIf3Ig", "stars": 1, "date": "2011-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Nb6d2_akGRPe8cRnxgC3Bw", "review_id": "87BvS52d51KpOl8h-yPGBw", "text": "If you are a lover of historical places and supernatural haunted stuff, then this is the hotel for you.\n\nThe Hotel San Carlos has been around since 1928 just when the Great Depression was starting. To think it survived all that and is still around today just shows that this hotel knows what it's doing. On every floor, they have a little bit of history that happened to the hotel. My friend and I stayed on the 7th floor and our little bit of history was the whole Miranda rights started.\n\nWhen it was time to check out, we told the concierge that we were in room 721, and she told us the haunted room was right next to us (room 720). Next time we go there, we will try to request that exact room.\n\nThe hotel room itself is updated but still has that nice \"old school feel.\" The bathrooms were a tad bit small but the bed was very comfty. The rooms aren't spacious and huge but I feel the not so large room gives it a more intimate feel. The furniture really helps make it feel like you are staying in that hotel back in the good old days.\n\nThe Hotel San Carlos will always be my first choice of hotel now. There's so much history and it's pretty cool to think you walked in the same lobby that Marilyn Monroe and so many other stars walked through.", "business_id": "_yfprBETaYgySkKyl8ZWMQ", "stars": 5, "date": "2014-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Xw8hfSofOz01x1n5aQmkvw", "review_id": "Icrw8MWh-_Kw1TemvqbOlg", "text": "Worst front desk staff ever. I books my room in July for a conference in Oct, and only upon arrival was I told that they moved me to Fairfield Inn. HORRIBLE", "business_id": "Lt-dQ0kUWFm0nDgLwdEo_g", "stars": 1, "date": "2014-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lQocmg4jMlNRxFEOknZKhg", "review_id": "kFb2fmFXlxYsZNx07JJiig", "text": "The first thing I noticed while walking into the bathroom was the EXTREMELY dusty vent. Other than that- Very welcoming staff, they always have hot coffee, hot cider, ice cold lemonade, and cookies in the front lobby. Too bad the place was too dusty to try any of the food and drinks.", "business_id": "CfzoA3TQ8YQcFTOncJFbQQ", "stars": 1, "date": "2015-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mB27RgWbkfCPkuJYjmq6oQ", "review_id": "XsTQ8X21Z4snpTVuH7fG-A", "text": "I am not a frequent YELP user.  Enterprise had sent me an email asking for a review, I usually use Trip Advisor.  Booked a reservation and arrived when I planned.  The vehicle was ready, but it smelled like someone had smoked in it.  I was upgraded because it was the only other vehicle available.  Nice.  Thanks.", "business_id": "f1H9fcDsYl_U-nI8E4y5CA", "stars": 4, "date": "2015-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nBYNw8wsomh9LOdgkYfQUQ", "review_id": "GYJBbh_MJzzowMSuW80LCQ", "text": "The lobby and staff were great.  The pool area seemed very nice.  The restaurant staff were awesome. The room was clean and laid out nicely.  Why three stars....the bed was very uncomfortable. The neighborhood was sketchy at best.  If you business dealings take you within walking distance then alright.", "business_id": "KQzpjBmnAMXPqipeWTKG0w", "stars": 3, "date": "2015-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NNdfPF-UhvLB8FxbsuSC5A", "review_id": "yYT89Xj7K27aAGvnHdf3Hw", "text": "Very expensive hotel, but very good service overall.", "business_id": "HLQUH1VAw4KbSV-IhxOPEw", "stars": 4, "date": "2014-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YQsrtqckikRqtWYJJnD2ww", "review_id": "er3kAj9zq3eIsMSBJ63JYg", "text": "We had really high hopes for this hotel, and although it has some nice features like fish in the lobby and a nice patio/balcony, I have to say that these 25-30 bug bites that have had me up scratching since 2 am have over-shadowed just about everything. If these are mosquito bites, word to the wise: USE REPELLANT if you stay here. The hotel does not have anything to put in the room for mosquitoes. With the excessive rain they had here in 2014, the mosquito population is out of control!! I do not see evidence that we have bed bugs but I could be missing something. I just can't wait for hubby to get up so we can go home.", "business_id": "FQudBiBiz9bGQLF_kK8UCg", "stars": 3, "date": "2014-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "h9d3VW5RTJymoFoLnN60_w", "review_id": "6kr9gPlmSp1Gu97nir0Znw", "text": "Beautiful grounds, great rooms and the restaurant is excellent!!! It's our favorite place for brunch. The room we stayed at was great and the bed was so damn comfortable that  we woke up in the middle of the night to comment on how comfortable the bed was!!\n\nThe spa was OK, unfortunately my therapist kept talking and talking and talking and I was a wuss (yeah, I know...) and didn't told him to please just....shut up! \nThe pool area is tiny, so if you're interested in more of a pool scene, this is not the place.\n\n4.5 but I'll round up because of the best bed ever!!", "business_id": "rLAeltELaGdQKh_LYIllEA", "stars": 5, "date": "2009-09-27", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "JM86y_TaM7PhNy5DiFlzPA", "review_id": "DRtvXAtU-KXFbBougSi1HA", "text": "We came here for a romantic three-night getaway on our anniversary and stayed in a very spacious Alvadora Villa right outside the spa. Valet service promptly greeted us upon arrival. Those guys were great. I appreciated them always asking, \"Will you be needing your vehicle shortly or should we park it in the garage?\" Plus, they were always speedy about getting our car for us when we phoned them from our room. The front desk clerks were pleasant and there was always delicious complimentary Royal Palmer (aka Arnold Palmer + Grenadine) in the lobby.\nAfter setting our things down in our room, we took a late night tour of the resort. Wow! Absolutely gorgeous resort! It's a decent sized resort yet has a small Mediterranean-style feel to it. Since we were hungry, we stopped by T.Cook's Lounge. There was live jazz music and the food was delicious. Be sure to order a Moscow mule.\nThe following morning, we went to the pool. All the pool servers were extremely attentive. As soon as we walked up to the chairs we wanted, they laid towels down for us and brought out large glasses of iced water. Talk about amazing service! The pool food was good, not great, but we didn't expect too much when it comes to poolside food. The pool area was very quiet and relaxing. Highlight of hanging at the pool? I got stung by a bee in the armpit as I was sunbathing on the pool float bed. Went from relaxed to freak out mode. Awesome! That would only happen to me. After much relaxing in the sun, we went for a hike on Camelback Mountain. Definitely a must. The scenery from up there is pretty cool.\nThat evening, I managed to break the on/off handle to the bathroom shower as I went to turn it off. And I tell ya, that water came rushing out and pinned me to the wall! As I screamed for help, my significant other yelled out from the loo to see what was going on. It was Dra-matic like only something that would happen in a movie!  Luckily, their maintenance guys responded very quickly and took care of the issue. Oops!\nAll-in-all, we had an amazing and relaxing time here. I'd highly recommend staying here while visiting the Phoenix area. You won't regret it.\nThings we loved about Royal Palms Resort & Spa:\nGratuities were included in the resort fee.\nAmazing service from everyone. We were greeted with smiles by all employees everywhere we went on property.\nThis would be a wonderful place to host a wedding.  Hint, hint, wink, wink.\nThey had cute resident bunnies hopping around property.\nLive music at T.Cook's.\nSteam shower.\nPrivate outdoor shower.\nVery spacious rooms and clean room.\nFree WiFi.\nComplimentary Royal Palmer (aka Arnold Palmer + Grenadine) at the front desk.\nSurrounding scenery.", "business_id": "rLAeltELaGdQKh_LYIllEA", "stars": 5, "date": "2013-10-08", "type": "review"}
{"votes": {"funny": 4, "useful": 6, "cool": 6}, "user_id": "RHkNDoCY2jwvUIoz8anmFw", "review_id": "qBd1Cdq2yMpSjKTzGV7AGg", "text": "Good mid range hotel at an affordable price and convenient location.\n\nStayed here for a few days in Sep '13.\nThe rate was a tad over $90 after tax and other miscellaneous fees.\n\nAlthough I wouldn't go far to say it's a steal, I found it to be a reasonable value considering the nicer location and comfort of the room.  Its not perfect, but its certainly good enough an option to have me reconsider a return visit in the near future.\n\nThings I liked about the hotel;\n\n- Helpful and friendly staff.  Everyone was accommodating and extraordinarily cheerful.\n- Good location.  Its a fairly central location very close to the 54 fwy, and not too far from the 10 fwy.  It took me around 15-20 mins to get to Scottsdale.  There are many good restaurants within 10-15 mins drive.\n- Good noise isolation.  I stayed on the second floor and found it to isolate noise from the outside and rooms next to me well.  I didn't hear any noises from my neighbors next to my room or on the first floor.  There is some outside noise, but it's muffled well, especially when the AC is on.\n- Clean rooms.  Never once did I get the impression the bed-sheets, carpet, towels, or bathroom was unclean.  Maid service was immaculate after cleaning.\n- Comfortable beds.  As another reviewer mentioned, the mattresses are softer.  I actually prefer firmer mattresses, but I slept well regardless.\n- Good showers.  Despite being older, I found the shower pressure to be adequately strong, if not better than most hotels including some that are higher end.  Water temperatures were hot enough, something that sadly isnt always the case.\n- Plentiful parking\n- Free Wifi included with cost of room\n- Good other amenities.  I liked how there was a complementary fridge and microwave.  The are older units, but nonetheless work just fine.  A/C works great with getting the room cold.  It is a little noisier however.\n\nThings I didn't care so much for.\n\n- Musky smell.  I also noticed another reviewer mentioned this and I can confirm its the case.  Fortunately either my sense of smell got used to it quick, or the A/C cleared it up.  Not a big deal for me.  \n- Rooms could benefit from a make-over.  The room I stayed in did seem a bit older and decrepit looking.  As a single guy, it's a non issue.  Just be wary of staying here is your preferences dictate otherwise. \n- Toilet paper is pretty low grade.  I know I'm nitpicking here, but bring your own if it's important to you.  Its not exactly sandpaper, but it is thin and coarse.\n\nOverall this branch of Best Western delivers a good option for lodging.  Recommended.", "business_id": "6Ckmrpp6OW1pJ-3Pjg7VaQ", "stars": 4, "date": "2013-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9qrey_kl_L6Jn7o2D67xeQ", "review_id": "-ArzKfpIJb95kMBuDcqz1Q", "text": "embassy suites are always pretty good. our bedroom was big, bathroom decent and we had a living room nice sized with desk area, plenty closet space, fridge-coffee maker, ironing station, and a patio. very scenic golf course. complimentary breakfast every morning. complimentary happy hour with snacks. computer place that i used to go online. gift/convenience shop. light up hot tub at night stays open pretty late along with pool. hotel service cleaning was very well done. two big flat screens. i stayed here a couple weeks and enjoyed my stay.", "business_id": "sOa-OpRFi1OVU7CC6Hwoig", "stars": 5, "date": "2015-09-27", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 4}, "user_id": "e-80Kq91REJu2WnuZPwYAQ", "review_id": "nQuhJgIHz0p3iBFPWI6yWw", "text": "I'm a hHonors member and try to stay at Hilton properties when possible. This was a very nice Hilton property. Cleanliness is extremely important to me and this one passes muster. I am one of those people who normally throw the duvet off immediately but the level of overall cleanliness at this property made me comfortable with using it. Spacious rooms and very comfortable. The balconies are very spacious with a couple of chairs.  Upon check in, the staff member was really friendly. His customer service really shined through and made me felt like a vip. I forgot his name but he was from Maryland. He even handed me a welcome candy bar with a personalized card on it. I was impressed with this level of detail. Great stay!!!!!!! It's an airport property but you don't hear the planes.", "business_id": "KnRRMCqQQqlyMphif6cTaA", "stars": 4, "date": "2015-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "qWRqhzmzvipBwpXx1T-MEQ", "review_id": "xg92OyzMSwFwfPB-XHWjRQ", "text": "So I needed a cab in order to get to work today. When I called, I was on hold for a few minutes and then a woman picked up the phone. I scheduled a pick up and gave my address, and asked for an ETA. The woman then said, \"Yes, I have an ETA.\" I said, \"Okay... Can I please have the estimated time?\" The woman didn't answer and when I said, \"Hello?\" She replied with \"I'm here.\" So I again asked for an ETA and she responded with \"The driver will be there in 5 to 20 minutes\". The woman then promptly hung up on me. So I finished getting ready and waited outside.\nI saw the cab pass me twice and after trying to flag them down, I called the cab company again. Another woman answered and recited my address, and it was incorrect. I gave my correct address and again waited about 15 minutes for the cab to arrive, which made me about 10 minutes late for work. \nThe only saving grace, and why they got 2 stars, is the cab driver I had. He was very professional and nice, chatty but not overly so. He even asked me the best route to get where I was going. \nBecause of the unprofessionalism of the first dispatch person I spoke with (she didn't even confirm my address or call back number) I am not sure I'll be using Discount Cab in the future.", "business_id": "6InaHoU8KNlDeGP48RqzBg", "stars": 2, "date": "2014-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NiKP2TA4n2ywN991Bte14Q", "review_id": "muNdRNFL5K7lM-zErKcMvQ", "text": "Compared to my other experience with a cab company in Phoenix, the AAA Yellow Cab was like the heavens parting and saving me. (See clean air cab for the traumatic story of before).\n\nNot wanting a repeat of our frightening first night in Phoenix we decided to go with a cab company we actually  recognized and I'm so glad we did. When they arrived they came into our hotel lobby to find us and called out my name, I'm glad they did because I was expecting a yellow cab and it was a white cab with \"AAA Yellow Cab\" written on the side. I didn't even know they were the same company!\n\nThe driver knew the area we were going to, asked for the address before starting the meter and plugged it into the GPS. We got there with no trouble, the cab was clean, the driver and his co-driver (who I think was in training) were polite and told us random facts about Phoenix as we were driving as soon as they found out we were from out of town. \n\nTheir credit card machine wasn't working yet but they did have a hand CC machine to take them. Although it was a little more expensive than other companies, the money was worth it for my safety and sanity!!", "business_id": "jn9jfsdyQhfI6Gxp07AbYw", "stars": 4, "date": "2010-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6OLiw0Da8Ftr5SZKDCPjpg", "review_id": "yktdZCTXZ_Q7Ygl0QLI0SA", "text": "After calling them 4 times and getting hung up on, I finally got to order a cab...an hour passed, they said another half hour, then another hour passed...i cancel the cab which never showed up.  When I finally found another solution and we were on the road, one of their cabbies cut us off and slammed the breaks.  We luckily avoided an accident, but the same cab (#488) took off and must have been doing 60 on a 35.  Garbage service from a company that hires unsafe drivers.  Never again.", "business_id": "3hUw4RmFFdOn7Ix81n5Sag", "stars": 1, "date": "2015-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QFtHl1_Rlf1ZjeXsFwJyPg", "review_id": "z-L-SWW091av-MY9vgMK5w", "text": "I wanted to like Budget, I really did. We had a prepaid reservation, which should have expedited things. Nope. Because it was a \"busy day\" and they only had one person handling where you could normally go for that, we were handed an old-school number and told it would be 25 minutes; we'd be waiting in line behind antyone who happened to come in. Seriously, Budget? Your competitors have check in kiosks where you can get in and out quickly. I get that it's busy; that means you gear up and staff accordingly or use technology to speed things up. Sorry, you lost me with this one.", "business_id": "FYCVF_1qYm3x5DYCbmmK1g", "stars": 1, "date": "2014-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "5E193w76Qlhoi1gkyakW2A", "review_id": "8oRlHHgqa8iTh-SZkSQV1Q", "text": "I've travelled out of this airport for quite a few years now, and it wasn't until a recent trip that took my through Jersey that I came to truly appreciate Sky Harbor.\n\nBeing the hub for one of the largest and fastest growing cities in the nation, I am suprised I haven't experienced more delays than I have.  The only times I have experiened a noticeable backup at security is when it is to be expected (holiday weekends and such) and even then I have been suprised a time or 2 at how efficient it was.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 5, "date": "2007-10-04", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "wNTZMYPQRZAx645BuhdTyQ", "review_id": "yXCKvu9OKxtHCLMSz721tg", "text": "When I was 16, we moved from San Jose to Mesa.  Being an uprooted confused teen ager at the height of his angst, I didn't really fit in at first.  But, as with all relocations, I met new friends and they had interesting ways of passing the time.\n\nHere's me waxing nostalgic, as well as dating myself:\n\nIn high school, we used to drive to the airport and play Pictionary in the terminals.  Like, cross-legged sitting on the carpet in the middle of the airport.  Or, we would run around the airport playing hide-and-seek, or tag.  Those were the days of the Old Republic, when everything wasn't so paranoid and regulated.\n\nToday, the airport is mostly remodeled inside.  There's decent food and a little too much shopping.  It looks nice though; they spared no expense.\n\nMy favorite thing is in the terminals, there are birdhouses high up in the rafters, and little finches living in the airport.  All these little birds flying around in the terminal...it was almost surreal.\n\nAll in all, a good travel experience.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2009-10-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "in8F1VdUbEe9NYvkGQ_R2w", "review_id": "CPnVHspIkHDU3Q-_7WAoJQ", "text": "Wow.. talk about a mess.  I recently had the ...joy or something like that... to fly in, cart a number of friends around, and fly out of this airport.. \n\nWhen I landed the first thing I noticed was the fact that the airport looked like it hadn't been updated since about 1992.. I was waiting for someone to pull out a huge cell phone to make a call.. it was also about 85 degrees inside.. hello AC? \n\nMy next encounter with this lovely place was picking up my friends, as long as you fly United or Continental I've got no complaints, because they are located in Terminal 2 (where the hell is terminal 1?  it goes 2, 3, 4) but if you happen to fly into one of the other 2 getting to and from them is a mess.  \n\nOne day I had to drop a person off at 3, then go back to 2, and finally end at 4.  I think I looped the airport 18 times to try and find the correct route to do this..\n\nThe only positives I've got about this place are the free Wi-Fi, a billion food options, and the ease of security.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 2, "date": "2010-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IgXUM_WyCgqyzA01mN5HKg", "review_id": "bQgDV8P5CX3KbsWk7OrS2w", "text": "I always connect here because I fly US Airways from Las Vegas.  But everytime I have a stop over here, other than a major back track to the Bay Area, I don't really mind coming here because it's a well maintained airport. It might look old but it is always clean. \n\nI'm only here about 1 or 2 hours at a time but I can't help but notice all these restaurants in here, if you're hungry and don't mind 'airport prices', never fear selection is here.  \n\nAlso be prepared to walk close to a mile to your connecting flight.  There's LONG hallways here. Don't worry, they have standing walking escalators.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2010-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ygda3eaZvqGTguTJLTZp5A", "review_id": "WGu_CRNoKrpLrrfBXHGbqA", "text": "One of the better airports I've been to. It's never busy traffic wise. easy to get dropped off, and easy to pick people up. The directions make sense, it's easy to loop around, and the officer people don't scream at you to keep moving.\n\nThere are a good amount of restaurants and shops in all the terminals and there is free WiFi everywhere. The only downfall is that the people who come in and out of this airport are...older...and security takes way longer than it should. I'm not going to knock a star off for that cause it's not the airports fault...but would it be illegal to have different lines for the senior citizens?!", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 5, "date": "2011-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FgauKBp6w-_8hOY1CRYMoA", "review_id": "zBrz4UueVtnuYJVZQ_67Tg", "text": "Straight forward to get in and get out of the airport. The airport seems to be constantly updating certain areas each time I stop by!", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2011-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lkJwL7ryg92FMIVJ7y634A", "review_id": "wbTctRQJ6n5pS62uDi6QNQ", "text": "I've had a number bad experiences through Sky Harbor but mainly due to the airlines and delayed flights causing missed connections at Sky Harbor.  The airport itself is decent.  The biggest thing I believe to pay attention to is what terminal you come into and have to leave out of if you are coming through in a layover.  The distance between the terminals is pretty long if you're in a rush.  If your originating or finishing at PHX then everything seems to go pretty smooth.  I do like the Blue Burrito for food and the renovations over the last several years have helped.\n\nAnother thing to note is the distance of the rental car center facility from the airport terminals.  Make sure you add an additional 30 minutes for car pick up and 30 minutes for return on departure.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2012-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e5vgFpzyEyjjjfG1zyu5Xw", "review_id": "sUYjByFPOzslKeZDWEJTPA", "text": "Waited at the gate on the plane for a half hour because we arrived early. What? One concourse, 8pm, 50 hungry people, one eatery, on a Friday evening makes a grumpy traveler-plus, I had to search around for a bit to find a screen to find where my connecting flight was. -Not my favorite airport.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 2, "date": "2012-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Nl8kUgXO4zbnuWa7hm_aWA", "review_id": "iRlXatKDzzYqpQlT9FGxGw", "text": "OK airport. Layout is fine - food choices vary across terminals; in mine, not great choices. Clean & bright. Conveniently located to suburbs around Phoenix. It works -", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2012-11-21", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "zeCW2mgLhKv72XUg8GSMpg", "review_id": "x9m6-WJ25NDjSuiGZFLKbg", "text": "For never actually spending time in Phoenix, I spend so much time in this airport.  When you live in and are flying out of a small town that nobody has ever heard of, it's a chore getting home to Hawaii for me. Phoenix is always my layover or one of my layovers. I always feel like I've ran a marathon by the time I'm at my next gate. It's so spread out and huge and just my luck, I always need to be at the opposite end of where I'm at to catch my connecting flight.  Those people mover things do help though, until people decide to stand on it because legs are overrated. That's just lazy, come on!\n\nSomething I'll remember forever; I was so thirsty so I went to a Starbucks in my terminal.  I ordered a black tea.  When the lady called my name and gave me my drink, I was in such a hurry..I grabbed it and went on my way to board. I never took my first sip until seated on the plane.  Ahhh, finally relaxation time.  I take a huge sip expecting deliciously fresh brewed iced tea, and NOPE. Pure black iced coffee. Not even a hint of cream or sugar. The guy in front of me is lucky I didn't spit it out. Did I mention that I'm not even a coffee drinker? My husband had a huge laugh.  Haha, I guess. Lol.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2013-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "T47zJqd34jkS3jgUFhSm9A", "review_id": "zaqssNnksQ_4xzRwA5c-Gg", "text": "The airport was easy to navigate and clean. no gum on the floor. had to rock my jacket as the airport had some kicking AC going on. the people were nice", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2013-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "a8PFo6a99qzHQmlX6hJluA", "review_id": "Ya-ZqCkWAONWieYAdYWHUw", "text": "I have flown into Phoenix 3 times, two with connections to Flagstaff via US Airways Express. This airport is easy to navigate around, everything is clearly marked. The lines for security weren't too bad. There aren't a lot of food choices in the A terminal where US Airways flies into. Terminal D where I was for Southwest was really small. There isn't alot of plug-ins or seats for that matter. Wifi was really really slow.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2013-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "UxIh474qV8VHAepYNBXZjA", "review_id": "IFJJMfXy6q-1bFaVQis6DQ", "text": "Every single crew member I passed from check in to baggage claim asked how I was doing and wished me a good day and happy travels. The agent working the security desk was very funny and inviting and it took the frustration out of the long check in process. Also, a nice selection of restaurants and shops. Bathrooms were clean and there were plenty of outlets to charge my phone. I wouldn't mind flying in or out of this airport again in the future.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 5, "date": "2014-09-08", "type": "review"}
{"votes": {"funny": 8, "useful": 13, "cool": 11}, "user_id": "QJY3sifZysSjYW3cJeB0hQ", "review_id": "TAsCrIVpiznavz00VDxXoA", "text": "As far as major American airports go, Phoenix Sky Harbor (PSH) is an amazing place.  Clean, modern, well maintained and easily accessible.\n\nI often fly through PSH because of my love affair with the 'heart' airline a/k/a Southwest.  It's one of SW's hubs and for good reason.  With the beautiful Arizona weather and large, modern airport it makes for a great option.\n\nThere is, of course, some walking to be done as with any huge airport in a major city.  However, PSH accommodates the lazy with moving walkways.  Yes, I admit I'm the guy power walking on the left side.  Makes you feel like a fast forward cartoon!\n\nDespite the size of the facility it's immaculate when compared so some of the aging monoliths in other cities.  You won't find disgusting carpets or worn out chairs.  Everything feels modern and clean for such a high traffic airport.  Even the restrooms are spotless and taken care of.\n\nOne of my favorite features on PSH is the abundance of charging station for travelers with hungry electronic toys.  Nothing more annoying that having your phone at 3% with no plugs in sight.  That's never and issue at PSH.\n\nOverall, PSH is a great airport.  One of my favorites.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2014-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "d42T37_3iMNRrIbi1gq2_Q", "review_id": "PrwOV3I3Hj4mCMTHyXyXmw", "text": "I need to update my review of Phoenix Sky Harbor.\n\nI recently came here again after a 4-year hiatus.  This place has improved by leaps and bounds since 2010.  The terminals still make no sense but there are more food options (also not expensive) and security is a breeze.  They are trying out an \"old-school\" way of going through security where you don't have to remove electronics and/or liquids from your carry-on.  You also don't have to remove your shoes!  I was one of the lucky people randomly chosen to have their hands wiped down and tested on some sort of machine (they allowed me to get on my plane so I guess I was clean?).  The security line only went slow because people were unsure of going through security with their feet covered with footwear.  Overall, still not the best airport but also not the worst.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2014-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yl-BOZHab0bsGHBKpCcMag", "review_id": "YPmJjd5i_I7B-pBrpHKUoA", "text": "made my connection without fuss, and had a beer at a place I can't remember the name of, but it was a local brewery I think.  Good beer.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2014-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-S1uXum9py9vq2NXWkHK7w", "review_id": "WgU88ASG5riseTgZycfJeg", "text": "Great in and out!  I have been to a few airports but this is well set up.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2014-11-12", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "ExnSmM-MrblLAyGMHOrqsQ", "review_id": "5gwE7_rZuu_gKsNHvAbhNw", "text": "WiFi is insufferable.   Free.   Cool.   But you can't get on.   Why can't WiFi be easier at US airports.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 2, "date": "2015-09-09", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 1}, "user_id": "R9tMFVcVjd0IN3vAvit-5g", "review_id": "afKkUZWKAawtU3aY6RJ2dw", "text": "if you take a rental car you have to ride a shuttle that takes 8\" to get to the car rentals. when returning, you need to know the terminal so you can get in the right bus.\n\nI had tsa precheck which saved me at least 10\". you can carry an empty water bottle which can be filled with a filtered water station next to the bathrooms.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2015-10-02", "type": "review"}
