{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y9xFfMQ7-1UQJc4VYy8q8A", "review_id": "dYK7j2i-EtPLr2tvdIvGWg", "text": "I got the normal gyro and the girlfriend got mildly adventurous with the buffalo chicken gyro.\n\nMine was STUFFED with meat to the point where there was hardly anything else on it, which was good enough for me, though I can imagine some people might want more tzatziki/onions and such. \n\nHers was \"meh,\" the one thing she said about it was \"Well, it's not really a gyro.\"\n\nFairly cozy and diner-esque on the inside", "business_id": "PSlOtPIo28BvWOzdLmRRRQ", "stars": 4, "date": "2015-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ei7ootM9QUDHeB1OJIkfIw", "review_id": "aTuE643ZwEymm6Z7Y6J1vA", "text": "This was probably the worst Gyro I have ever had.  Even the frozen ones sold in supermarkets are better than this.  Extremely dry, tasteless, and obviously not fresh as I watched the woman cut from the very top of the thin spindly piece of meat left and then microwave it before serving me.  I will never go back to this place nor will I recommend it.   Stay away, Gross and distasteful", "business_id": "PSlOtPIo28BvWOzdLmRRRQ", "stars": 1, "date": "2015-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WhnI9-GACnRBBxw4T_8raQ", "review_id": "a2BOR_ZYwajkyjZLy8hnCw", "text": "I'm originally from Pittsburgh and was in for a visit this past week.  My fiancé and I stopped in Knossos tonight before out departure, was craving a gyro.  I went with the Buffalo chicken dip, which was fabulous.  Stephanie, who was very friendly and knowledgeable of the menu was great.  She truly helped out with our dining experience.  We also had couple gyros, to satisfy my craving!   Next time we are back in the burgh we will for sure swing by!  Hope to see Stephanie again, she was awesome!", "business_id": "PSlOtPIo28BvWOzdLmRRRQ", "stars": 5, "date": "2015-09-23", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Iseb_IvqOEfY_p1m9OwTrw", "review_id": "Gt0ReIk1l-fATS7Xk3jNNQ", "text": "This place is the ultimate two star. If you have a craving for a cheap gyro downtown at night in Pittsburgh, this is the place to go. Unfortunately, Mike & Tony's closes by 6pm. You won't get good service, you will get frozen french fries tossed in the deep fryer served in disappointingly small portions. You will have to scrounge around for a bottle of ketchup and hot sauce. However, the gyro meat is freshly cut off the spit, and the over-stuffed sandwich is a good deal at $4.30. \n\nOverall, there aren't that many cheap places open at night downtown, so go here if you're stranded and can't stand the thought of another Sammy's corned beef sandwich. Otherwise, hold out for one of downtown's great lunch spots.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 2, "date": "2008-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Co3ydbwnDC8KOtCM2f2BKg", "review_id": "sNrrknIixUDZyZvbuQcqHg", "text": "I can't believe this place got a bad rating!!! Sure, it's not a 5-star restaurant, but you can't beat the price or the food!!!\nWhy would you order french fries at a Greek restaurant? I want everyone to disregard the previous bad rating about this place. \nI live about a block away from Salonika's, and I absolutely love it. The first time I went in, I noticed that it was rockin while every restaurant nearby was empty. Very good sign, trust me!!\nSure, there are no waiters. You order at the front counter and linger around until your food is ready, but I've never had to wait more than a few minutes. \nThe food is absolutely amazing!!! And cheap!!! My boyfriend loves the chicken with pasta, which is exactly what it says it is: pasta with chunks of chicken. It is lightly seasoned, but no heavy sauces. And it's amazingly filling. \nI always get the Greek salad or the pastitsio. The greek salad comes loaded with onions, feta, olives, and jalapeno peppers that are marinated in some kind of garlic marinade. And there is always enough dressing!!! Homemade dressing at that. \nThe pastitsio is definitely an acquired taste. It's like a greek lasagne, but without cheese. It consists of a large layer of very spiced beef, then layers of noodles and a cream sauce. \nI bring a lot of friends to Salonika's when they trek downtown to hang-out with me, and EVERY SINGLE PERSON I have introduced to this place absolutely LOVES IT!!! I usually make them get a gyro, and I can't tell you how many of my friends will go back up for another one because they are so good. The gyro meat is fresh, in fact they carve it right there. \nThere is also a bar in the back of the restaurant. I kind of wish it wasn't there because it attracts some \"unsavories\" and takes away from the atmosphere in the restaurant. But you can't win them all.\nKeep in mind that this is a cash-only establishment, so hit the ATM on the way. \nYou will not be disappointed with this place. This place is really a gem!!!", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 5, "date": "2009-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "q7MrNVt1FE23rwtWmPYWHg", "review_id": "Pn9lqGdIUJErf1EghvCpAQ", "text": "You get what you pay for. Cheap gyro combo = cheap tasting meal. When stepping into the restaurant the first thing I noticed were glass cases storing food. It had the feel of a cafeteria or at best a deli at a gas station convenient store. Not feeling adventurous I got the gyro meal, which is a good deal. The fries were cooked to perfection, but lacked flavor. I had to dump salt on them, which is never a good thing unless you as for unsalted fries. The gyro itself was mediocre. The ingredients inside were fresh and made to order, but I did have to use a knife and fork to eat it as the pita was just a bit too small of the large mass of the contents. The slice of chocolate cake, while a descent size, was rather tasteless. The icing was pretty good, but the cake itself had almost no flavor, perhaps freezer burn. It did seem as if the cake had been frozen. I also felt like the harried girl taking orders behind the counter was overworked. She apparently had no time to take a wet cloth the the tables. I kind of felt bad for her. \n\nOverall, I'd go here if I worked a block away and only had a half hour lunch break. Quick and cheap as a fast food joint, but not delicious enough as a dinner.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 2, "date": "2011-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "So32N7bSbUd1RwhFtI6jTQ", "review_id": "1tvypvE217DtHNOc1ttzeg", "text": "Salonika's is like a best friend. All ways there when I need it. There have been many a long and stressful work day that has been turned around by the great service and attentiveness of the staff. The night staff is always quick with a smile and conversation, which goes a long way for me,  since I'm usually alone which can be awkward. \n\n The lunch service can be a bit hit or miss probably because it gets really really busy during lunch , but their late night service is much better.  \n\nI go to Salonika's no less then 3 nights a week.  The bartenders are super friendly I even consider Brain the night bartender a friend. \n\nThere are other upscale places to eat and drink in the vicinity but if cheap eats and drinks  and friendless is what you're looking for you can't go wrong with Salonikas.\n\nAlso please be aware they are now serving Mimosas!  Which are super yummy and served in a martini glass with a twist of orange!", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 4, "date": "2012-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5nN7WTMXhww65BRgY2SJOA", "review_id": "qsSHTwenn3HAqTSXfv_Ixw", "text": "Great food, fast service and the price is right. Perfect stop for a quick lunch in the downtown area.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 4, "date": "2013-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "PK-DziFgaYa52bP2Axz9Mw", "review_id": "97L050_BmoaCeSvEwFatyg", "text": "This place has one of the best Gyro's around..... They are cheap and Delicious......  The only thing I wish was that they took credit/debit cards.  If you want something that is fast and well worth the money I would recommend this place..... I have come downtown just to eat here. LOVE LOVE LOVE the GYROS!!!!!!!!!!!!!!!!!!!", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 5, "date": "2013-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iltdmBGrWNADJG7IEmqWxQ", "review_id": "lNR9huo6B6IN-r9Hbx_zzA", "text": "Love this place always come for the gyro made the traditional way.  Small cafe very clean.  If you wanted to watch a game they have a 55 inch flat screen.  Always busy the Line literally out the door.  Not pricey in the 3-12 range", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 5, "date": "2014-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iw6elpU1p_BHg6eo4_HhEA", "review_id": "DnyOlbdt9ImGW1nRLVeCmg", "text": "I have been here several times in the last year. The food is average...kind of fast-food-like. It sits in the warmer cases, and looks \"crusty\". The gyros are average, not as good as the ones at the South Side gyro restaurant, by any means.  The salads are from a bag of pre-chopped lettuce, and not \"fresh\" or interesting. \n\nBut in order to enjoy the average food, you have to get past the really rude food wait staff.  The bartenders seem to be OK, the clientele in the bar seem to be regulars, and it is a \"cheap drink\" attraction to some downtown locals. \n\nThe staff that serves the food, and takes the orders are out of this world rude. There is one that wins the prize for insulting the customers, and after having endured her, I will never, ever return. Owners should know how they are being represented at the front register. The man that cooks and plates the food is oblivious, or just is used to hearing her speak to people with such a lack of respect, that he is just deaf to it. \n\nGo somewhere else. It is cheap food, and you get what you pay for. I would pay twice as much, to feel like the staff gave a crap that I was there supporting their jobs.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 1, "date": "2014-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QSQa6kNWhkKVJf10FP5hTQ", "review_id": "bK-HmEIgNR4sXiXOXjKYQQ", "text": "This is a local dive bar and be prepared to find some interesting characters. That being said I ordered a gyro with the lemon fries. My sandwich was excellent! The pita was fresh, the meat was juicy and flavorful, the sauce and toppings were a perfect balance. The lemon fries were good but I would prefer them to have been more crispy and less grease. I ordered shock top which was on tap. I was so pleased because it is a seasonal beer. The place is clean but I would never take my kids. The bartender will talk your  ear off but was a nice person with a little crazy added on. I felt like being in a \"just got out of jail\" commercial with everyone coming in to buy a 40 from the beer cooler. If I am ever back in town and plan on going to a game I will grab a sandwich from here for sure!", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 4, "date": "2015-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "v9s5BpJsVQYB44D7jPu6-A", "review_id": "m0LObxiA_JZcSIpnwSGUOw", "text": "Our FAVORITE RESTAURANT in Pittsburgh - we come here every time we are in town. Best hummus in the tri-state area!  The lamb is GREAT! Actually, I haven't had anything here that wasn't great! Christos remembers us everytime we walk in the door.  We have our own special table right by the kitchen and talk with him while we eat. The baclava and the Jackie O cake are to die for.  Don't pass up the grape leaves and the homemade wine. We always buy extra food to take home.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 5, "date": "2008-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7ffOjgAG5au2IyZGLajsmg", "review_id": "WTAweECWSwgq3SppMTw71w", "text": "Fast, friendly service of solid comfort food at a price that won't break the bank. It's good for pre-theater/concert dinners, especially if you want something that's not too fussy.\n\nThe food is fine, though perhaps not as out of this world as the gregarious owner would like you to believe. My moussaka was a tad on the bland side, but it was piping hot and hit the spot on a cold night. The desserts were definitely the highlight. My companions report that the homemade wine was also surprisingly good.\n\n3.5 stars", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2009-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4B5y6hM_JcQTTcNBZvKWBQ", "review_id": "jszo6AzyNtBdIkFuRXv1Ig", "text": "This place looked hopeful for authentic Mediterranean but the food just didn't live up to any expecation. Do yourself a favor and go next door to Cafe Milano.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2010-09-03", "type": "review"}
{"votes": {"funny": 4, "useful": 4, "cool": 2}, "user_id": "nS-iV5EUzdz8_nQVMxF1yQ", "review_id": "n6zkqXGNItEjgSl7YpLAxg", "text": "This place was really gross.  There was no one around when we went in, but we were starving.\n\nThe food wasn't fresh, the dishes were dirty, and I felt like I was going through Pan's Labyrinth to get to the bathroom, which was pretty far away, seemingly in another dimension.  It was almost an adventure.\n\nThere was old black slimy greens in my salad, but at least the watermelon in the salad was good!  I'll give them that!  The olives were even disgusting--how do you mess up olives?  The spanokopita was limp and oily and devoid of much phyllo.  And there were copious bugs flying around our food the whole time we dined.  \n\nWhen we paid, the cashier asked how much of a tip we wanted to leave, and added it directly to the bill  instead of giving us the opportunity to leave our own tip or write it on the restaurant receipt.  The bill was way too high.\n\nIf you really hate someone, you should take them to this restaurant.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2011-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Delkp6rfwHAmSx7PNWDjbg", "review_id": "3CxXuDLkEYEpaw_uhgp_zg", "text": "I crave the Jackie O cake, a must have!!!!", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2012-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UxLpu7cS6o7adHcu3jhmKw", "review_id": "dG0_XoUNgluT5dO2BoKMuw", "text": "The food here is authentic and tasty and the place itself is a gem of kitch. Do not go here if you want a fine dining experience. The servers are odd, but that's part of the experience. The dining room may be cluttered with old photos, objects representing Greek culture and other oddities, but again that's part of the charm. The food is really, really good and I believe it is very well priced for what you get. \n\nThey also have this amazing soup that seems to have magical powers when it comes to curing a cold. Fabulous!", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 4, "date": "2012-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5wTVzr3SyZzpiu-U_Yim6A", "review_id": "rrPRV7n6EFBHgEn49neYsA", "text": "Christos is a cute little place. It's been there for 38 years and I think that it hasn't changed much over the duration.  Sure the place is kitschy, but that's part of the charm.  The antiques and old photos were interesting to me, and there's some nice pieces there. The service is friendly, down to earth, and warm.\n\nThe owner showed me an award for the \"Jackie Onassis cake\" from 2009.\n\nWhile I want to love this place, the food is sub-par.  While the hummus was good (indeed thin as mentioned elsewhere) the Hercules special(lamb, beef, beans over rice) was just so-so.\n\nI want to see this place continue to succeed, but the food quality needs to be turned up a notch if that's going to happen.\n\nI'm rating 2.5 stars, but rounding up for the reasons mentioned.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2012-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5qx1_UsVr6fW3hetX_rCsA", "review_id": "d31YnJuQAmO4fm3ME3nEHQ", "text": "I really enjoyed Christos! We went to Christos after a show at the Benedum Center and again before a baseball game. The setting is a very cute little greek place, it's a small place. The people that work there/own it are very nice and really want you to enjoy the food, They do stand outside of the restaurant giving menus to try and get you to eat In there, but we did end up trying it and we liked it! The owner told us a story that he actually has cooked food for Jackie O on a cruise ship.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 4, "date": "2014-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5A__s1jIvHoCeKLDbx30cQ", "review_id": "y4GRaRohaW5QmL82JIw0XQ", "text": "Tasteless food. Too slow service. Was waiting for my check about 15 minutes. Dishes were as an ex-USSR buffet taste. Annoying waiter.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 2, "date": "2015-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e7lJwGbdJsrFziQoXKNJ6w", "review_id": "TUln4LB8zxBq7cH0pOiZCg", "text": "Many of the reviews for Christos accurately reflect my experience today. I truly enjoyed the decor, the food tasted good, and it was inexpensive. My lunch was under $7. I had the gyro platter.\n\nThe waiter, who I assume is part of the family, was a bit creepy and kept asking if I wanted something additional like soup. When it came time to pay, I had to walk to the back and get his attention. He then called for another guy, also creepy and who I think is also part of the family, and he figured my bill by looking at my empty plate that was still at my table (which was at the front near the windows.)  He was suspicious that I didn't have more to eat.  At this point I was finding it humorous.\n\nI am glad I went. It was an interesting experience that I won't soon forget.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 4, "date": "2015-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "5wTVzr3SyZzpiu-U_Yim6A", "review_id": "42NVmCULy2ADHctp2d6FDA", "text": "Great place for lunch!\n\nThe reviews on yelp don't do this place justice.  The food coming out of the kitchen looked great --- especially the gyro's and french fries.\n\nI opted for the Quad-S (my term not theirs) Summer Sensation Salad with Salmon.  Big salad, not skimping on the ingredients, and nice piece of fish on top.\n\nI'll definitely be back. (once I finish my tour of lunch spots in Pittsburgh, I'm on about #45 without repeating)\n\nPlenty of seating, and they move you through quick despite the lines....", "business_id": "AH1PrZQDIdjpKgy1z8XxUg", "stars": 5, "date": "2012-10-01", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "1DUi6pRYXDT1oDFKCMsdzQ", "review_id": "ZxDh8grEIvoAwwIux5DUlw", "text": "so, i go in and order a gyro (yee-ro - you know, how you're supposed to say it).  the server goes you mean a 'jai-ro?!' (as in gyroscope), in a very loud kind of condescending voice.  i said, no, i mean a 'yee-ro'.  as if she didn't know what i was talking about anyway!\n\nwith the greek authenticity of the place seriously in question, i should've walked away then, but i was really hungry and didn't have a lot of time for lunch.  it was just average, nothing special.  again, i've been spoiled by NYC.  besides, i think it's a good policy to not eat where they can't properly pronounce what they're serving.", "business_id": "AH1PrZQDIdjpKgy1z8XxUg", "stars": 2, "date": "2012-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gwnVSev8aNLvMArs3WTfFw", "review_id": "jW0n-IevyYMRf9lEeDE_Iw", "text": "I decided to try this place after reading on Yelp how good it is.  This is no Mike and Tony's or big greek gyro in Market square.  I won't be back.  They only take cash. The workers are not Greek chefs and are very condescending.   The gyro sandwich for $5 was OK at best.  They threw some tomatoes on it. The sauce could be better.  The fries for $2.50 were undercooked.  I asked for ketchup and was told to find a table with a bottle.  We are talking a plain bottle with mystery ketchup. It was definitely not Heinz which is a sin in Pittsburgh!   I had to hunt silverware and straws.  You would think they would give them to you with the meal.  \n\nThey charge about $2 for a drink with no free refills.  They put a sign that said refills are 50 cents and if you take one without paying you are stealing and subject to prosecution.  You can also get a drink from their cooler for $1.  They are no-name juices or water like you might find in a dollar store for 25 cents or less.  \n\nTables were not very clean.  I was surprised at the number of patrons.  This place is definitely regularly visited. They have daily specials, but the #1 item on my list is quality and taste of food.  They get a C from me.", "business_id": "AH1PrZQDIdjpKgy1z8XxUg", "stars": 2, "date": "2012-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MA713-m2wv51bww8LN2fSA", "review_id": "Rh0FUM_WGH_MLbZbzm7ANA", "text": "Very reasonable daily specials, and large portions, of tasty fresh prepared food.  Not the most gourmet experience out there, but a fantastic value, and reliable consistent experience without a long wait.  I particularly recommend the grilled chicken salad (Bangin' homemade greek and ranch dressing) and gyro's.", "business_id": "AH1PrZQDIdjpKgy1z8XxUg", "stars": 4, "date": "2014-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hh7tDAgx-mYZwZlFjMm4vQ", "review_id": "rzCpMaB8EmP5ap3Vnl8JLQ", "text": "Zorba's is just \"okay\" in my opinion. Some people love it and I just don't understand. The salads are good, but the chicken gyro was unimpressive...kind of bland and the chicken was really dry. I haven't gone back since I found Madonna's right down the street - which in my opinion is money better spent.", "business_id": "AH1PrZQDIdjpKgy1z8XxUg", "stars": 3, "date": "2014-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t50BZz8ujWIfWw2WGjNwDQ", "review_id": "NzJLUhNwOiHGJI6eXh-CNw", "text": "The best gyro that I've had in Pittsburgh. The amount of meat on the sandwich varies quite a bit. All depends on who's making the sandwich. The younger gentleman makes a small gyro consistently while the lady who does the majority of the cooking makes a huge gyro. This really affects the taste and consistency of the gyro. The more meat the merrier...stay hungry my friend!", "business_id": "AH1PrZQDIdjpKgy1z8XxUg", "stars": 4, "date": "2015-09-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Yvn7DHj7o7sSCH2rNH74Mw", "review_id": "ED7N3S73rvmL90iIlIWYlw", "text": "Mike, the owner/cook, is awesome and the food was delicious.", "business_id": "cH8I7JgPXcrcutT1a3YrjQ", "stars": 5, "date": "2012-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2UC3rwRm6swuNFt_GhKOhw", "review_id": "No6woowsL8Mu6TfqL0mWXg", "text": "So happy we found this little gem! My friends and I had delicious food and great service. When we arrived, they had the lights in the dining room turned off but were more than happy to accommodate us to eat-in. The best part of our experience was the service. Our server was the owner, who told us she runs it with her husband, who is Greek. She was wonderful and took the time to chat with us and explain any questions we had about the menu. \n\nWe started with hummus, grape leaves and spanakopita to start. A few of us tried the Greek iced tea which is sweetened with cloves and cinnamon. It was VERY strong and I enjoyed it much more when I watered it down a bit. A very unique flavor and I would definitely give it a try if you are a tea drinker. We decided to split 2 dinners between the 4 of us and after the appetizers, it was more than enough food. The falafel platter with fries was ok, but the souvlaki plate with rice was definitely my favorite! We finished the evening with tiramisu and baklava, both were delicious. I was so full after our entrees, but seriously could have devoured 5 plates of that baklava. \n\nWe had a large, great dinner for 4 which only cost around $60. If you like Greek food, give this place a try!", "business_id": "cH8I7JgPXcrcutT1a3YrjQ", "stars": 4, "date": "2013-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f-hFB7HYlT-ibnc8OVP8PQ", "review_id": "W3jq9LWrAvqlU5oTsMVZWQ", "text": "The food is amazing. Fresh, made to order and yummy. It's a family place with seating for 20 or so and they do take out.  The gyros and souvlaki were very authentic.  Loved it", "business_id": "cH8I7JgPXcrcutT1a3YrjQ", "stars": 5, "date": "2013-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jp5lBxgdCpDRhSeEuRK_kA", "review_id": "CadVuFtnqBf6u3BUt_TKbg", "text": "Showmars on 3rd delivers solid food, not great but they do a pretty decent job on meat and 2 veggies and the fish or chicken pita's are definitely worth a try......and on your 'cheat' days enjoy a milkshake if you dare:-)", "business_id": "ASwN3Ih0Eh1oH0npLbzVjA", "stars": 3, "date": "2011-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UpdAuxn_6oxYpSsMowmgbA", "review_id": "GBHR1_Cqb-VYQGILg6SCtw", "text": "I was with a group of 4 and we ended up at this location right before closing. The staff was very nice even though we showed up about 10 minutes before closing. We were with a lady who lived in Charlotte for a long time. She insisted we must have the sweet tea...makes sense because sweet tea in the real South is what I call diabetic coma sweet and just how I like it. The sweet tea did NOT disappoint...matter if fact I drank ALOT of it. We joked with the lady that she should just leave the pitcher. Lol. She thought we were crazy...we were...crazy for sweet tea \nFor my actual food I had the original pita burger...a burger served in a pita with some kind of greekish sauce (I think). What ever kind of sauce it was it was good. The fries that came with it were just basic and seasoned with salt. Maybe seasoning salt would add a little flair and taste. The onion rings were cheap and just okay. To me they taste as if they didn't have any seasoning. \n\nOverall we received exceptional service, especially since we came before closing, good food at a great price, and awesome sweet tea!", "business_id": "ASwN3Ih0Eh1oH0npLbzVjA", "stars": 4, "date": "2013-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4G68oLRY3aHE5XUt_MUUcA", "review_id": "-L1CoEQi46MIb2pvNXQq-Q", "text": "Might not be the easiest location to visit or see, but it's a good option because of the people that work here.  Tucked away across a parking lot and underneath an overhand is this Showmars location, but there are a lot of regulars that frequent this place.  The servers and folks running the register are super nice and they recognize you, call you by name, and ask how your work day is going.\n\nI take my lunch around 1pm so WAY after the lunch rush, but I can imagine this place being super busy.  There are a lot of tables and booths to sit at and the food comes out fast - with daily specials.\n\nSuper affordable and predictable, you can have you food in front of you pretty quickly - especially if you are trying to do a quick lunch.\n\nNow, this place is pretty practical if you work Uptown and can walk here for lunch.  Probably not a place to drive to since you would have to pay for parking somewhere... even if you park on the street at a metered spot.", "business_id": "ASwN3Ih0Eh1oH0npLbzVjA", "stars": 4, "date": "2014-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G467Ov1mgNFCQoCfiJmj5w", "review_id": "JEVgsPOhupfShrFCNbxeZw", "text": "The only reason this place gets a 5 star is because the of the burgers. They are really yummy like having a burger at your buddies bbq party. As for the rest of the food. Its terrible. The fries are frozen even though the seem to want to brag about the fact that the burger meat is never frozen. Then why not do the same with your fries. Anyway if you go here only order burger.", "business_id": "ASwN3Ih0Eh1oH0npLbzVjA", "stars": 5, "date": "2015-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NUsTXXWbgFhLSQSY2JLsKA", "review_id": "DO1UtVtbdJ2HzqvTaceLbg", "text": "Good food, but poor service at this particular location. I've gone here for lunch on several occasions over the past few weeks and have encountered multiple problems from the same lunchtime staff, both in terms of service and attitude. A shame. I'll continue to frequent other locations, just not this particular one.", "business_id": "ASwN3Ih0Eh1oH0npLbzVjA", "stars": 1, "date": "2015-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nTaDkA9THXCO_28F_GW8AA", "review_id": "7JKVgliiGOK2Q-9TQxofVg", "text": "Ate here two years ago and we simply had to go back there for breakfast again. Unfortunately it didn't stand up to our foodie memory. \n\nCoffee was weak and the waffle was nasty. Seems like they over sprayed or over oiled the waffle iron and it soaked into the waffle. White sausage gravy wasn't good at all. Perhaps we should have stuck with Greek inspired good. \n\nThe table top was dirty and sticky. Wonder if it was ever wiped down or washed. Yuck!!  \n\nNot sure we'll return.", "business_id": "ASwN3Ih0Eh1oH0npLbzVjA", "stars": 3, "date": "2015-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Zwsq31eNUo2HpdkV2h9aig", "review_id": "6kZ9WNP-tdK61EBrbDwMnQ", "text": "I really only go to Showmars for the pitas, but they do have a good variety of quick food. I wouldn't go so far as to call it fast food, considering it takes a couple minutes for them to bring your food to your table. They're a Greek themed restaurant, but really have a good variety of options. It's a quick little stop for some good, cheap food. It is a chain restaurant though so you're gonna get the same stuff at every location.", "business_id": "8PsQqhrAH5uqJ7HODOmXYg", "stars": 3, "date": "2008-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "Ul93T_U5jDh1FIIpiiTxuw", "review_id": "UA33pobCpfhRnDNOe8u6Ww", "text": "Here's a novel thought: when you get tried of waiting in line for a table at some of Charlotte's more well-known breakfast spots and you come to the realization that $10 for a couple of eggs and hash browns is a little too steep, come on down to the heart of Elizabeth and get with the program.\n\nThis is as close to a neighborhood diner as you can get.  Very recently renovated inside, the light and color scheme is much brighter across the range of booths and tables that fill the space.  While there is a menu on the wall and a take-out counter, breakfast is table service and the truly Southern ladies who wait the tables will welcome you in and invite you to pick your own table.  I've never had to wait and I kinda like being able to pick out my own digs- is it a window kinda day, or do I want to bury into the back corner?\n\nMenus are on the table and they have all the regular breakfast staples.  Omelets, waffles. eggs your style, hasbrowns, and all the usual breakfast meats. While I usually skip the meat, I do appreciate the fact that turkey sausage is always an option.  Service is speedy and the ladies who constantly walk around will make sure your drink never goes empty or that your coffee always stays refreshed- no matter if they took your order or someone else did.  Now that's some customer service.  \n\nAnother thing I really like is that they recycle newspapers from earlier guests.  I can usually find several whole local papers stacked up in a central location to be read and returned as \"community paper.\"  I can get caught up on the affairs of the day and pass it on.\n\nWhat you'll really love here is that the prices are so easy on the wallet.  When both my wife and I can have a full breakfast for under $12, with tip, then I am amazed.  Try to find breakfast for one for under $12 at some of the \"other breakfast places\" around town- their biscuits may fly, but they will weigh your pocketbook down!\n\nNow this place, like all other Showmars, serves a lunch and dinner with plenty of Greek staples, including a pita burger.  I'll save that review for another time.  Just know that this location in particular has plenty of local color and the breakfast is a nice, relatively undiscovered gem of a breakfast spot right in the shadow of uptown.", "business_id": "8PsQqhrAH5uqJ7HODOmXYg", "stars": 4, "date": "2010-11-11", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "ts7EG6Zv2zdMDg29nyqGfA", "review_id": "V-PAoBrxtS1fJj2TM78J0Q", "text": "Always have been a fan of Showmars but never tried the breakfast there.  I wasn't dissappointed at all!  I had a turkey sausage, egg and cheese sandwich and loved it.  Along side of that I had a bowl of grits made perfectly.\n\nThe service at almost every Showmars is what I think really sets it apart from other chains.  It's always friendly and I feel like they are eager to please.  Not for nothing, the stores are almost always very clean.\n\nIt doesn't take a lot for me to be impressed but Showmars does it for me if I'm looking for something as close to fast food as I feel like getting without the terrible food of a typical fast food joint.", "business_id": "8PsQqhrAH5uqJ7HODOmXYg", "stars": 4, "date": "2012-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "M-TwsqjrGVH9-qyw2KcvdQ", "review_id": "UL90lGZnpCQQoHMfZXVu7Q", "text": "I can't believe I haven't written a review for here! This is my weekend breakfast joint. And it's a solid one. My fav: $4.99 Country Breakfast (2 eggs, bacon or sausage, and a biscuit covered in yummy gravy). A much more affordable option than John's and the likes. During breakfast time, this is more a \"full service\" place. Just take a seat and one of the ladies will stop by to take order. This one waitress somehow remembers me (or rather my odd way of drinking coffee... which is to half and half it with hot tea, topped off with creme and sugar) and is super sweet every time she sees me. You can always find some newspaper to read as well on the bench by the door. On a nice day, outside seating is quite enjoyable.", "business_id": "8PsQqhrAH5uqJ7HODOmXYg", "stars": 4, "date": "2014-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pvOHPAFswbeOvZSHUmZjcA", "review_id": "jhJALgPnfSbw0MhvNMDUvg", "text": "Pleasantly surprised!  1st time to Showmars.  The flounder is excellent!  We immediately received a warm welcome upon entering the restaurant. The food came quickly!  It was well prepared and delicious.  On my next trip to NC I will definitely stop here.", "business_id": "8PsQqhrAH5uqJ7HODOmXYg", "stars": 5, "date": "2014-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PyXURLPCTun3XRAuq4Ov_w", "review_id": "W5AgUkTgcMjAWjgbAdtz7Q", "text": "Very slow \"servers\". Constantly forgetting things. Anything I have ordered always comes out cold. The bald manager is not a very nice person also. The parking lot is small, barely wide enough to get your care into.", "business_id": "8PsQqhrAH5uqJ7HODOmXYg", "stars": 1, "date": "2015-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7EEvGr-7r4n9yqcwyBAWmA", "review_id": "SSv8NhO8vbPoezKg29-LSQ", "text": "Order/Food:  You can't go wrong with anything on the menu!  They always have a daily special that is a good deal.  Our favorites are: Chicken Pita, Grilled Chicken Chef Salad, Greek Salad, Fish Sandwich, and to splurge the Pita Burger (Watch out this one has a LOT of calories).\n\nAtmosphere:  You order at the front and the staff brings the food out to you.  Sometimes the service can be slow (You might get your food before your drinks) but overall really happy with this location.  Stay away from Monday nights  unless you have children because the balloon guy is there and its kid central!", "business_id": "8PsQqhrAH5uqJ7HODOmXYg", "stars": 4, "date": "2015-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "10dhZs996tBtJq2nd_mcRg", "review_id": "3Uf_RRncd7IrRHScLlg8Dw", "text": "No frills, cafeteria style diner, which totally works as they feed hundreds of near by workers. \n\nOnly disappointment was having breakfast end at 10am - Everyone knows breakfast is the best meal at places like this.", "business_id": "crKd3Kf3YYP8znwoMvcA-g", "stars": 3, "date": "2011-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0dlU2ix_Ctuq41XzjH9TBg", "review_id": "mA9Ublesr0tr3lGLl7hx5Q", "text": "Good food. a little pricey for what you get. my main concern is the old guy working the grill. he never wears gloves. everyone else does but he never wears them. its gross.", "business_id": "crKd3Kf3YYP8znwoMvcA-g", "stars": 3, "date": "2015-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "O12CQOZL8PRUiv5y_TWT0A", "review_id": "wG8OVGEVg6FEmPUTTEIKmA", "text": "I was in Charlotte on a business trip, and decided to give Niko's a try since it was so close. I ordered the Grilled chicken Greek salad, and it was delicious! Well done Niko's well done!", "business_id": "crKd3Kf3YYP8znwoMvcA-g", "stars": 4, "date": "2015-10-30", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "0hdkW5qaQs4gTiUnRdadqA", "review_id": "T5eHZlLYQEmu3FYAfRrQlw", "text": "Fried Okra and Sweet Sweet Tea!  That's all you really need to know, well at least for me that was really the only things on the menu that I could eat.  This place is big on burgers and chicken sandwiches.  My friend said that his burger was extra juicy with a meaty tomato stacked on top.  Carnivores love it!  The fried okra was great, a staple southern side, and the sweet tea is very sweet.  If you are from the north, don't mess with it start with something a little more bland.  I like my sweet tea to taste like sugar water and lemons.  This is a good place to go for a quick lunch.", "business_id": "M89wkxqAcXuVMtWh91BIjg", "stars": 4, "date": "2008-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "M-TwsqjrGVH9-qyw2KcvdQ", "review_id": "4QBy2M9Pxr0MLKrNpZTSbA", "text": "Never even heard of this place, but apparently this is a popular joint for airport employees and Air Force workers across the street. It's another hole in the wall burger/sandwich place (I love them!). It looks a little dumpy on the outside, which never scares me off. The inside was just as bad looking, can we say tacky all the way? What they lack in decor, however, they make it up with low prices and big portion of food. My gyro was $4.75 and came with a side. It was good too, the slices of gyro was still warm, stuffed in a soft warm pita with plenty of lettuce, tomato & onion and tzatziki sauce. The tzatziki sauce was a good compliment to the sandwich instead of being a distraction (sometimes they are too tart or garlicky or herby). The onion rings were the typical frozen corn meal ones, so I say stick with fries instead... why can't I be pleasantly surprised with beer batter ones?!  \n\nAll in all, this is a great cheap place to eat near the airport even for a non airport area employee like myself.", "business_id": "M89wkxqAcXuVMtWh91BIjg", "stars": 4, "date": "2013-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "deawd7Iic_07CsYoBfzA2A", "review_id": "5-XzKEoaXiHyJRdxwYcOAg", "text": "This is a well kept secret, serving size is awesome, flavors on point, great sweet tea.  This is spot of the flight crew,etc.  I discovered this space will with USAir.  You gotta go.", "business_id": "M89wkxqAcXuVMtWh91BIjg", "stars": 4, "date": "2014-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "udomMc3zBW8IFxJstNaBmg", "review_id": "or1EXd-yylDI7vXjK9DRBg", "text": "I usually go to another showmars consistently, but I was in the area so we stopped in. The place was clean and the employees were very friendly. Showmars is also a 2nd amendment friendly restaurant which is great! Food came out hot and fresh and I was very happy with our waiter.  I will go back to this location soon.", "business_id": "Lw-01HQDswygHvAZfwkpxA", "stars": 5, "date": "2013-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uc4QurS1XrvyiIpne2IbhA", "review_id": "EY4KGFUwiRKS6jD968L0-w", "text": "Food is always hot and fresh. Love the variety on the menu. I've tried burgers and other things from here without any issues.", "business_id": "Lw-01HQDswygHvAZfwkpxA", "stars": 4, "date": "2015-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1bOrK1JhfXYoMJqPLWFg8Q", "review_id": "bVspxRJQ4vq7tJaMfJGGNg", "text": "***NOW CLOSED***\n\n\nI've been here twice and no complaints. Brought it home when my mom was visiting and she loved it.  The marinade on the chicken is wonderful.", "business_id": "6-jlUgqp0Mv3PUzMGjrb0A", "stars": 4, "date": "2010-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fE8ByxyKQ5Br7Y9I4jUwBQ", "review_id": "K5VrsL34vj-Q-f9VSuH35A", "text": "Good food. Will fill you up for about $12", "business_id": "6-jlUgqp0Mv3PUzMGjrb0A", "stars": 4, "date": "2012-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ITwewV_k1EcFgxfWNlssqQ", "review_id": "bL0zhcPG0BiWZXf4kwhKMQ", "text": "Showmars serves up deliciously unhealthy food. I usually get a cheeseburger or some kind of pita wrap there. This particular location has really friendly employees. I went to Showmars one day with two friends who go there A LOT. The employees recognized my friends and knew their regular orders. I like how Showmars employees bring your order to your table and return to offer you drink refills. The food is really cheap too. There aren't many places in uptown that you can get a $6 lunch.", "business_id": "bffCUYaQ4FejTfu_xFwjyQ", "stars": 4, "date": "2008-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kDYpTc-yc8UAxCs_LhX1yA", "review_id": "QN0_UBXwUJXaLBF3kZpdZQ", "text": "I'd never heard of Showmars before I moved to Charlotte, so it must be a semi-regional phenomenon. I've always heard good things, though, so I decided to check it out recently. \n\nThe reviews were right: this place is pretty good. You're not getting all that much in terms of ambiance: it's formulaic and kinda cheesy inside; it's what you'd find at Applebee's or Chili's, which makes sense since this is a semi-chain. \n\nHowever, Showmar's menu is extremely extensive. You can literally get whatever you're craving here, and I do mean anything, from burgers to pasta. And it's all pretty affordable--really affordable, actually. Good for a quick lunch or quick dinner, on the cheap.", "business_id": "bffCUYaQ4FejTfu_xFwjyQ", "stars": 3, "date": "2008-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "cxTh9xxqbs-m8Paq6jAumg", "review_id": "5KujliMcOzhGh82rFlmoGQ", "text": "When in doubt, go to Showmars. That's my motto for lunch time during the week when I have no clue what I want. The cashiers are very peppy and you can eat there or carry out and they turn around the orders really quick. I love that they have multiple specials each day (Chicken Salad Pita with fries for $5.99 on Thursday, Gyro and Fries for $5.99 on Fridays) and their gyros are absolutely amazing--who knew? They have a pretty extensive breakfast menu as well and can't go wrong with the french toast. They close around 4P on the weekdays so if you're looking for a Showmars dinner, check another location!", "business_id": "bffCUYaQ4FejTfu_xFwjyQ", "stars": 4, "date": "2010-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nHsj0cHOiroAsmDfF50BtA", "review_id": "kL1Y1G_maQWWDeP97Utjgg", "text": "I've been to Showmars a couple of times during my lunch break with co-workers.  It's casual, reasonably priced, offers good food, and the service is very quick.  No sooner than we've ordered at the counter and sat down, someone's bringing our food out to us. \n\nI usually always order the gyro (\"yee-roh\") pita sandwich.  Why?  I'm at a Greek-owned restaurant.  Of course I'm going to go with one of their specialties!  Plus, few places offer gyros...and I LOVE 'em!   I just try not to think of the lambs that were slaughtered so I could enjoy them rolled up in a tasty pita, dripping with tzatziki cucumber sauce.  The fries that accompany the pita are always very flavorful, too.  They're not your average french fry; they have a little spice to them.  \n\nMy co-worker always orders the fish sandwich.  Why?  The menu says it's the \"best fried fish filet sandwich\" and he swears by it.  Go figure.", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 4, "date": "2008-11-30", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "8N481iGgsUYA1-TtESOntw", "review_id": "4S2qwewUjeTZ-M-K524VFw", "text": "Always on the look out for a good Gyro! So I found this place on yelp and it was right down the street from the office in Charlotte. Huge place, not many people, strange vibe, very cafeteria type place. The cook was hitting on the cashier and chatting her up for about 5 minutes before she was able to take my order, interesting.......\n\nThe food! The french fries were excellent, the side salad was great, the Gyro left much to be desired!", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 3, "date": "2011-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oTZ2SuhCU0NvhoctjCRtiw", "review_id": "a17_VFh5MwHMjiZsxMqPQA", "text": "Since moving to Charlotte, my family has eaten out more in any given year than we ever did back home. Maybe it's because this city is overflowing with places to fill your belly and even though we do get home cooking around here, it's just been all kinds of fun to sample the local goods.\n\nWe are loyal Showmars customers. The food is decent and similar to what we'd cook at home: comforting and no surprises.\n\nI like meeting my husband here for lunch (he loves the fried fish sandwich smothered in tartar sauce), taking my daughter here for a bite when we're done at the library, or going for dinner when we're all in the mood.\n\nMy daughter loves the chicken strips meal with fries. Or the grilled cheese with fries.\n\nI'm partial to the fried fish sandwich, the Calabash shrimp meal, the grilled chicken sandwich, and the sweet tea.\n\nRefills included with all drink orders, friendly and on-point wait staff, efficient cashiers.\n\nAnd this place has ALWAYS been clean, no matter what time we've gone in. \n\nAll Showmars locations are closed on Sundays.", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 4, "date": "2011-11-28", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "CDhv0TaqqQSoB-9zSZXTkg", "review_id": "hsOk7BprggLFdRZb3KrOjQ", "text": "Was introduced to this greek fast food chain by my coworker. It reminded me a lot of California's Daphnes chain. Was overwhelmed by their extensive menu, and they seem to be known for their burger in a pita (forgot what it's called). However, I was craving gyro meat, so got the gyro dinner plate which came with a side salad, pita, gyro meat, sauce, french fries, and a drink! It was about $10. Very quick in service, and I had 2 boxes to take with me to go! Tons of gyro meat, but it was a bit dry. Their pita is really good, I think they fry it, giving it that extra yumminess. I ended up making my own gyro with the veggies from the salad. Their fries were the crinkle cut kind, and it was good, but way too much! I couldn't even eat half my meal!\n\nThey have the special ice, which they put a ton of, which means getting a refill when you pick up your food! Staff are all very friendly and courteous as well. Casual greek food.", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 3, "date": "2012-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iEnvH0oOuFm_UuKWSRigrA", "review_id": "y4k39VhhixQAUfZ9oYK3Qg", "text": "Food is it great it's Showmars at least they can't screw that up.  Service is poor especially for pick up orders.  If you call ahead they will put you on hold until you drive to the restaurant.   Never had a problem calling in orders at any other Showmars.", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 1, "date": "2014-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5C_hfmIzQxVWrBRR_aDGnA", "review_id": "oNLYWWTfJXnWtoUegK9wGQ", "text": "Very unhappy precooked cold food and when I approached the Mgr he was like o well.\nThis is a once and done place to eat!", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 1, "date": "2015-10-16", "type": "review"}
{"votes": {"funny": 3, "useful": 0, "cool": 0}, "user_id": "2-uR7a5losM7P_PAZdws3A", "review_id": "NAGOg52WYQtDNgkirm1-uQ", "text": "This is one of those places that you wouldn't think might be kind of questionable, but is actually pretty nice.  It's right next to a gas station which doesn't help with that image, nor does the parking situation. but once you get inside it has the atmosphere of a neighborhood diner.  The food was very well done, very fresh and tasty.  The chicken club was very good, with the cheese melted all over it.  The only thing that could have really been improved upon was the service.  The girls looked bored and like they didn't really want to be there.  But then again they also looked like they were in high school, and trying to make teenagers happy is a pointless effort.", "business_id": "_naNO-mZQjTav4iLf5TFmA", "stars": 3, "date": "2008-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HxxPa0ZvrqU6JlcLJGbxtg", "review_id": "m1JGhA2LbCkbM_crwmG75A", "text": "The fried chicken livers are so tender and good. The chicken is pretty good.\nThis place I need to visit more to try other things on the menu. The lemon cake was moist and tasty. I had inquired about it and when I got home there was a piece of lemon cake in my bag free of charge. The nice lady at the register was nice and friendly.", "business_id": "_naNO-mZQjTav4iLf5TFmA", "stars": 4, "date": "2013-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HANb8-8InWnju-XzBQQSBw", "review_id": "s7WJTizC6OwxuUIk9kmi8A", "text": "Grab decent sandwiches and gyros, and enjoy live music if it's scheduled.  I was addicted as a student and still enjoy stopping in when I visit C-U, but it's a simple joint.  Right on campus near the quad.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 3, "date": "2005-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "sUrU9l3_f1iWYZdLmop0Rw", "review_id": "PMCzK2ZGNLdK-ZnPzIqvCQ", "text": "Great Greek food including awesome Gyros!! They also have live music here a lot which is a great escape from doing your homework!  This place gets busy as lunch because it's right by the quad!", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2005-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "lLmnsl9jR4Sx5vVGlw0IdA", "review_id": "wPA7OsNYVEvZ45tnGuamjg", "text": "The gyros were pretty good, but their fries came with this amazing sauce.\n\nIt was a delish combination of honey mustard but smelled and tasted like there was bacon in it.  I'm not sure what exactly it was but we couldn't stop dipping our fries in it - so good!", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2006-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "-C93MHl3n-O_5KU_zGjEgQ", "review_id": "u5J6WvZ-zoAF8Lmj4af7Mw", "text": "Gyros, tzatziki, fries, and friendly cooks and cashiers make this place a must-go.  My parents graduated from the U of I in 1981, and Zorba's was there back then!  Considering the relatively high turnover rate of Campustown restaurants, I think that's pretty impressive.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2008-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kwQ7FNfDJ8Jz27EU-_wg0g", "review_id": "jqR0Z6JZ_aOdq85mvylbQg", "text": "The food is relatively good. The fries are the best. What I eat most from here are the gyros which I think they are stingy on the amount of meat you get for the price that you pay, but hey it could just be me. It's an ok restaurant, check it out!", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 3, "date": "2009-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0YlyigoFd3dNepDvNr3sVw", "review_id": "ogDSQwQBVFk5ZLUgU_1BBw", "text": "This place is fantastic. Everything from their gyros to hummus to fries are all on point. Live jazz is great (I forget which nights) and their special deal on Tuesdays makes this a great lunch spot on Green Street. This place definitely exceeds expectations in Chambana, and I hope it continues to thrive!", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2010-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "KJZftTc-ct3fT4shisBb9Q", "review_id": "uUd4wzqV0BUz-z30XCJY7w", "text": "I think it says something that my friend has searched far and wide throughout all of Chicago and failed at finding another gyro place as good as Zorba's in Champaign.\n\nThroughout my 4.5 years in Chambana, never once did I have a less than spectacular meal here. Both their chicken and original (I believe it is a mix between beef and lamb) gyros are mouth-watering. I was afraid that the lamb would have that weird gamey taste, but it only made for a more complex flavor, which I totally didn't expect. \n\nThey have a great selection of sauces that I am guilty of drowning my gyros in. Their fries are made to order and come out piping hot and are even more delectable with a dipping sauce concoction of my own (made by combining their honey mustard and cucumber sauces - must try). What I found surprising is that no one knew about their unlimited and FREE toppings list. You can get a whole assortment of other toppings on your gyro all at no charge!\n\nTwo years ago, they started catering to the drunk, after-bars crowd on Fridays and Saturdays. However, those gyros are a fraction of the size and a fraction of the goodness of their regular ones. So I'd stick to One World to fulfill that drunken craving if I were you...\n\n*Also, I don't know if anyone else has noticed this, but I always come out of the restaurant smelling like I've dipped myself in frying oil. I'm thinking that their made to order fries has something to do with it.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2010-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BvGV9lMMUmB5hLWkNlY3vw", "review_id": "OOXnDfADNDnvzNkZ_MLPxA", "text": "I absolultely LOVE gyros so this is a no-brainer for me. I feel like this place is a staple of quick, delicious campus food. It's pretty much a total hole in the wall, but it's totally Illini, everything about the decor just screams it. Not to mention the gyros are bomb. Go if you haven't already!", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2010-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_pk6Q_8ecI4AL_voX2dGYw", "review_id": "zyI6MHoCubgFZ6myzaCHRA", "text": "Awesome place! Great gyros and mushrooms!", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2011-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GsfC3nKxfT5XoCZ_ARwQ3A", "review_id": "Mekqg_flIlvVUCtKO3q0sQ", "text": "Well bellow average Gyros. Soft, tasteless pitas with bland meat and sauce. Seriously, turn the corner onto Wright street and step into Wonderdogs for an absolutely fabulous Gryo. Not the best I've ever had, but easily the best in town.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 2, "date": "2012-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "d1I7WgowWgblUJ9uWgRn6A", "review_id": "vizGStEIM6JR6IN3ZFFUtA", "text": "Finally made it to the store, having always enjoyed their gyros at Taste of Champaign.  I'm sorry we waited, the food in the shop is even better!", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2012-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8oJRVNV3Bi3VHAuI1Su7-A", "review_id": "baJaNx_KlxdRqgfh1JeKRw", "text": "Fine times i have had here the fries sometimes are subpar and thats why three stars because how can you mess up frozen fries but they manage to so maybe take a look at your product or prep, gyros taste great to me.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 3, "date": "2013-11-30", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "fDXALtk5kBuQgUD5GLkrhg", "review_id": "qIdTCw-g8Ws0qDWT5TKNNA", "text": "Not a gyro expert but this was the most tender gyro I've ever had. Didn't know a gyro could achieve the melt in your mouth consistency. I usually am hungover when i eat gyros, but I was not hung over when I ate this. I almost want to binge drink so I can eat here the next day. Good stuff.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2014-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s8Ni-6g50Ld5aA2YgYDrcQ", "review_id": "GumszcrzuuLHqHcfDqd7zw", "text": "The salad doesn't have enough cheese!", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 1, "date": "2014-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XzIKZTb4I-7wW4BjKwV2Mw", "review_id": "WUGfZT2H37MAUTPg0M3HVA", "text": "After my horrendous experience with Niro's I was optimistic that Zorba's might have a better gyro.\n\nThe store is right on Green street and impossible to miss walking by. Inside is pretty cool, open style kitchen and lots of indoor seating. The menu is on the counter where you order, which could be problematic if you are like me and take 5 minutes to look at a menu and there are people behind you!\n\nI decided on a 4oz gyro and mac and cheese bites. My name was taken and I was called when it was ready. Interestingly enough, you also pay right when your food is ready, which was different, but I liked it!\n\nI dashed home and unwrapped everything, anxious to try it. My gyro was actually pretty small and almost resembled a taco in size and shape. I did think that this gyro was really on point though. The meat was thicker, flavorful, not too greasy and of a good consistency. The tzatziki was really good, too! Kind of creamy but not too yogurt-y or watered down like some places. The mac and cheese bites were also surprisingly good. Usually these are just dry pieces of mush but on the inside they were warm, gooey and tasty! \n\nOverall I would definitely say the Zorba's has the best gyro in the CU area, but I still need to try more places.\n\nThe only thing I did not like was the portion/price. My gyro was not very big, I probably could have ate 2-3 of them. However, quality over quantity any day of the week and this was one tasty gyro that would really give my suburban favorites a run for their money.\n\nI'll be back to try more!", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2014-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f1a9KwsObpE54Yp9A1fVoA", "review_id": "OtMh6zfSlAAUF1dAFcsacQ", "text": "Restaurant review:\nLook for gyros in Champaign, you can choose Niro or Zorba's as the most popular restaurants around, but on my recent lunch visit I was not that impressed. This location is right in the middle of campus and is super busy during lunch hours. We arrived before the rush and easily found a table, but if you come late, good luck. There is no large menu on the wall, but rather a menu at the table where you order which is sort of annoying as you can hold up the line if you are waiting to order or the menu along the wall. There are daily specials which is posted on the sign outside. Today Tuesday was dollar off classic gyro or 1/2 price fries. Other than that the combos are about 7-8 dollars a pop. This is where it falls short. The fries that come with the combo is a very small portion. I can't imagine that it is just a small helping of fries on a little serving basket. Usually that is a highlight when you go to gyro restaurants because it adds to the grease appeal. Additionally, they are quite stingy with the meat, i.e. they actually weigh and measure how much gyro meat you are getting. I have never been to one where you can get 4 different sizes of gyro meat. Overall a little disappointing. I can't say the large was very filling for me.. but who knows. One plus is that they have a dispenser for yogurt sauce so you can douse your gyro to your heart desire. \n\nPro: fast service, self service no need to tip\n\nCons: limited seating, very small fries portion, personally the gyro sizes that are measured seems a little stingy come on...\n\nHidden gem:\n1. You can use the belly card to earn points toward free items\n2. Daily specials\nMonday- Medium gyro, sm greek salad, pepsi 8.25, large greek salad and pepsi 6.25\nTuesday- 1 dollar of gyro and 1/2 price fries, 1 dollar off veggie sandwiches\nWednesday- 1/4 lb beef hot dog, fries, and pepsi 6 dollars\nThursday- BBQ pulled pork, fries, pepsi 7 dollars\nFriday- Fish sandwich, fries, pepsi 7.50", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 2, "date": "2014-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "e3MngJ-9Sb1Kq12hXZ-zKw", "review_id": "Ur9RwkTSr8QvVeYuMQhB7w", "text": "I am mexican...and I know mexican food.\n\nFood here is greasy and old.\n\nI was there three times while at a conference at the convention center...I stayed the night at the Hyatt during the time.\n\nI ordered Chicken Flautas and the plate came with rice and beans.  The rice was dry and looked as if it was at least 2 days old..left in the open air..the top of it was dry crusty...yuck.  I felt the food was slopped on my plate and it was VERY greasy.  Place is very casual..but the carpets are REALLY dirty and smelly...almost as if someone urinated in the dark corners...this place converts to a night club on certain nights..so maybe thats why the place smells like spilled drinks and vomit and urine in the dark corners.....\n\nDrinks were delish.... the Bartender Pamela is a sweetheart and the only reason I gave this place a 2nd and 3rd chance...I mainly went there for the free appetizers and sat at the bar and talked to Pamela while she served me yummy sweet drinks!  You can't get a bartender like her ANYWHERE!! just wish the food was better!", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 2, "date": "2008-11-19", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "tDD9jKSahgku1MQYJ5E7xw", "review_id": "mzQ0fOnij4i1yXEOoPDjPw", "text": "I went out to Matadors with my friend Sara on a Sunday night. Walking into Matadors is like walking into a super Wal-Mart at 2am; empty, Large and impressive. There was more staff standing around than patrons. We sat at the bar and I whipped my computer out to start my meeting and ordered an ala Carte seafood burrito and a bottle of beer. Sara's attempt to sober up with water is acknowledged and ridiculed for a few seconds I get into my meeting and the food comes. The seafood inside of the burrito was not really seafood at all. Sara describes the mash inside the wrapped tortilla as consuming half cooked sea monkeys. The only saving grace on this boring tasteless plate was the refried beans. Soft and cheesy, the beans saved the day. I order another dos equis lager and put my attention back to my online meeting. From the corner of my ear I hear the twinkling keys of the old time piano in the corner. I look up to see Sara stroking the ivories in the dark corner of the bar. She is on the phone with her mother excited she can remember a tune played when she was a child. We leave Matadors with... \"Let's blow this taco stand\"... The bill was less than $30 bucks.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 2, "date": "2009-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "DhrDFWCdDhkKmZDJn75muQ", "review_id": "-WBtfZelDkWHJIVvOS1nQw", "text": "I've only ever had breakfast here so I can't speak to the rest of the menu on any given day.  That being said this was the 3rd time.  I love their Chorizo and eggs, flavors o'plenty.  Yes I am a fan and will continue to be.  The place is very clean and the servers gave me all the attention I could possible stand.  Parking as with any downtown eatery could be a little problematic but quite doable if you allow enough time.  This is one of those favorite places that you go to again and again when your coming from out of town and you don't want to eat at a chain establishment and want some local fair... I travel a fair amount an you can't get a breakfast like this in the mid-west or back east.  It's always truly enjoyable.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 4, "date": "2009-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QzBwdhtjO-8trteJdwaJzw", "review_id": "AkMJEOQr2WROvcW0QI4wsg", "text": "This place would be out of business if it were not located next to 3 hotels and the convention center. It is not completely horrible, but I would recommend walking a few blocks up to Arizona Center complex where they have 3 or 4 different choices. If you are staying at the hotels and need some quick take out, sure this place will work (across the street). But if you are on vacation and planning a sit down dinner, don't waste one of your few vaca nights here.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 1, "date": "2009-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RAWy3YCE-jwfyuGvwzUaqQ", "review_id": "gnFOrHQfRq_QwQYDKKN_Xg", "text": "I like the Matador. The food is not Gourmet, but everyone in our group enjoyed it. The prices are reasonable ($10-12 entree and sides). Some of the wait staff is a but slow, but the place is enjoyable and if you are not in a hurry, just sit back and enjoy. It is actually Greek owned and the Shrimp a-la-Mike is an amazing dish that I have cravings for. I usually order the Combination Mexican plate. The bar is rather eclectic. The patio is great when the weather is nice. Park in the Garage (enter on 2nd. Street off Adams) and get them to validate and it is only a couple bucks. I hope my review helps you see there are issues, but also it is a place that I look forward to going to just know what to expect and you will enjoy it.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 3, "date": "2009-11-27", "type": "review"}
{"votes": {"funny": 4, "useful": 3, "cool": 0}, "user_id": "S3bvMOL50vgS_8-TtlGi4w", "review_id": "S5usVpXrMtemMF0U8n_AsQ", "text": "What's a matador? \nNothing fella I just don't want to open up because the food behind me is horrible.\n\nSeriously the food is really bad.  We live in AZ.  How can a Mexican restaurant get Mexican food so wrong?  Should my beans be orange?  I got the chilli verde burrito enchilada style and the beef was a disgusting color of salmon and didn't taste any better than it looked.\n\nService was great.  I was served promptly and and my food came out quickly.  That is the only reason for the two stars.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 2, "date": "2010-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IajbWwj6l-KHrfSEwZBLgw", "review_id": "CHu5OXaGHoqbCOfF9ztCgg", "text": "I was in the area on my way to the convention center when I stopped in for some lunch.  Place is only a half a block from the convention center so location was awesome! I know the place seems to be geared for Mexican cuisine, but their menu was a little all over the place.  They have sandwiches, Mexican food, and Mediterranean food.  I went with a grilled cheese sandwich, why not.  It was a huge grilled cheese on sour dough bread nice and buttery with a huge side of seasoned fries. It was soo good! I asked for a side of ranch and it was yummy!  I don't eat downtown to much but if I go to another convention I'll sure stop in for another grilled cheese.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 4, "date": "2010-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7kNPTNDDwZAKJyxkomuimA", "review_id": "Nqz2aU09SfRBxyExrHCVcA", "text": "I have been going to the Matador since I was in grade school. They have consistently good no-frills Mexican food and I much prefer it over the chain locations that are around. It's a nice large location downtown and has been renovated since many of the reviews on here were posted. Yes, the service has been slow from time to time over the years but I haven't ever had any more trouble here than at most other restaurants. It's a locally owned family business that has been in the family for over 30 years. If you're looking for something gourmet, then this is not your place. If you are looking for the Mexican version of comfort food, give it a try!", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 5, "date": "2011-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j2pYTMEap8EbnSzPUCutDg", "review_id": "Jr08uTn9CPeeFl8tN7YmSA", "text": "I have eaten at the Matador since the 80s and the food has been consistently good.  I like the large downtown location - it's convenient and there's room to meet up with all of your friends before or after an event.  The full service bar is great - really old-fashioned with lots of wood.   Love the salsa (both kinds!) and the service has always been acceptable - sometimes a bit slow when they are busy, but if you have a deadline, they are happy to hurry your order along.  Great food, friendly service, and a convenient location - what more can you ask?  I even had the Matador cater my daughter's bridal shower - awesome!", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 5, "date": "2011-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xrnAYMBODPFoYc7FFAbVQw", "review_id": "8EDw_OtvXHb2mL7WA-UoBQ", "text": "Service was very good. Atmosphere relaxing. Food tasty and reasonably priced. Located conveniently by Symphony Hall.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 3, "date": "2012-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 3}, "user_id": "4_YfcfHkCem1onJFkItxjA", "review_id": "d3UBYeFkwJMhXQSybbm1BA", "text": "I don't make it to Grand all that often, so when I see the Paisley Violin it's usually on a First Friday when it's packed like a sardine can with cafe-goers mixing, mingling and watching a live band perform on stage.\n\nImagine my surprise on a recent Friday (not a First Friday) night for a show when there were only 5 or so people there.  Once the show wrapped up, it was back to kick ass deep 80s cuts (think Thompson Twins song from Sixteen Candles and Joe Jackson) from RadioNigel.com playing in the background.\n\nThe ambiance is a truly metro cafe - something many local coffeehouses are lacking. The feel inside is very bohemian chic with its moody lighting and eclectic look.  Random bric-a-brac abounds here - everything from fish tanks to a bird cage, for sale I think. It's more of a European caf / art gallery / live music venue than a coffeehouse.  Bathrooms are kind of rough around the edges - if you can hold it, you're better off.\n\nThey serve a variety of coffees and tea and light fare like sandwiches, salads - lots of veggie options, btw.\n\nI had the mandarin spiced ice tea with a Venice Violin panini with dried Italian salami, provolone, veggies, pepperocini, olive oil, balsamic vinegar, and Dijon mustard on a sourdough baguette. Nothing to write home about, but the food was pretty good.  \n\nI really dug the vibe at Paisley Violin, I'll be back for sure - just not on a First Friday.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2007-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FaIl5hn9UFz_x-K1e_pYMA", "review_id": "w4GrqZMWvGQAR77xFUlMlA", "text": "An odd looking place with an even odder name serves up some good dishes of mixed cuisine but at a price that's higher than comparable places.\n\nPaisley Violin is architecturally interesting from its cabanas that surround the entrance to its bar/restaurant/music venue feel on the inside. \n\nI was there when the place broke out a mango flavored iced tea which was outstanding, but served in children's sized glasses. Shortly after our server walked away I was ready for another refill. \n\nFood was quite good, but as I've mentioned, I can get very similar cuisine in the East Valley for far less money. \n\nI'd like to think I'm paying for the unique atmosphere and ambiance, but I've never been there for live music. I could see it being a pretty good date place at night. \n\nThat might bump it up to four stars for me, but judging it strictly for lunch the price vs portion and quality sticks Paisley at a three.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 3, "date": "2008-09-19", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "oIVsVM8H273aoT1JUmsDIg", "review_id": "-mAibDWoDRpUKFwd5p6y0A", "text": "Just a quick update to let people know that they now serve alcohol! Woohoo! They got their liquor license six weeks ago -- after a tedious process, they said -- and now have a full menu of wines and other libations (Beer and Sake that I know of).  So, next time you want to cruise downtown to listen to some great live music, have some fantastic grub and enjoy the cool atmosphere, you can do so with some wine and beer too!", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 5, "date": "2008-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 3}, "user_id": "A_O8wZOsMTPwyeYA4-Rsow", "review_id": "hZKJ6AYt0eCEA4f4af5Rog", "text": "WOW! I LOVE this place and I can't believe it took me this long to check it out.\n\nThe interior is incredibly original and equally funky and cool. The menu is mostly sandwiches of which are not may favorite ... but they have a great beer selection and it's a super cool place to hang out.\n\nBig ups!", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2009-09-10", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 4}, "user_id": "mXUGqzUsJcx___b0y72BZA", "review_id": "MOdYBMoBFvYxsSs0m5X74Q", "text": "What a night. The first time I tried Paisley was the night of the first Grand Ave Festival. The place was hoppin. My date and I seated ourselves and it took awhile for us to be helped. This is just one thing out of a myriad of other reasons I should only give Paisley 1 star. \n\nThey get 4 stars because the one girl who was helping us was trying to handle the entire restaurant. And we were informed the one girl cooking all the food had been doing it 12 hours straight. With this in mind, we were quite impressed by the level of service. \n\nAnother winning point was the ambiance of the place. My date remarked a number of times about how cute it is. She's right. This is a great date place. Low light, lots of art and decorations to look at, great live music to listen to, and not so loud that we couldn't carry a conversation. We had a great time. \n\nThank you Paisley Violin. We'll be back.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2009-09-29", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 0}, "user_id": "8h5EXsiEuK5_igQ0cgxPZQ", "review_id": "fGpmjWNK_8nIJDrkN16NNA", "text": "We had just played a show down the road at PHiX for the 1st annual Grand Avenue Festival.  This is a festival organized by the businesses on Grand Avenue.  The paisley Violin is one of those businesses.\n\nThat said, we came in and struggled to find a seat for the six of us.  Several 2 or 3 people groups at 6 people tables.  So we all squeeze onto one round table meant for 4 at the most.  Strike one - wait staff should shepherd small groups to small tables.\n\nOur waitress finds us after a 5 minute wait and takes our beer order.  Many of us order the same beer.  One person orders a very common mixed drink comprised of Cola and Whiskey. The waitress has no clue what it is - replying with \"What's that?\".   Funny, but a bit of a clue about how our epic 2.5 hour dinner will go.  \n\nA larger table freed up, so we took it.  I guess wait staff hate cleaning tables that have people on them, cause she left a big pile of crumbs laying for us to snack on.\n\nThe next round of drinks, they were out of our new favorite beer because they must have a small fridge, so some of us walk outside to look at the beer list, since the waitress doesn't know them.  Those who walked outside got their drinks ordered.  10-15min later, a new waitress asks us if she can get us something.  Yes!\n\nThe music was nice, and the musicians were very courteous and concerned with the volume - our band could take notes on that.\n\nI ordered the gyro.  I've had about 20 different Gyro's in my life.  This was more like a salad burying a couple very thin slices of meat.  I'm not a meat maniac, but they sure did skimp for some reason.  This new concept of saladwich was good, but not really what I ordered.  Also got the seafood chipotle soup which was interesting and tasty.\n\nThey must have been out of beer, because they didn't come by for any more drink orders.  \n\nHopefully the owners of this place will learn to stock up on wait staff and beer for special events.  \n\nAnother review said that the waitress had been on for 12 hours.  She was somewhat incompetent, but I fault the owner/manager for lack of preparedness.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 2, "date": "2009-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "HP_xZYNC5XK-VyNrnHbtRQ", "review_id": "R5Z9Dm3jgGgCUthS7c_iyQ", "text": "So the past week I've been ordering lunch here nearly everyday. I just love the food.\n\nEverytime I've gone here the food is spot on. A few of my fave sandwiches are The Royal, which is a roast beef sandwich with melted mozzarella, celery, lettuce with aioli sauce served on a yummy baguette.\nThe Champs d'Elysee is also yummy. The sandwich has red peppers, artichokes and spinach. It's a bit creamy with the cream brie and aioli sauce, but tasty. \n\nThey usually have a different home made soup everyday and most of the soups I have tried are always very good.\n\nI'm a fan of the Paisley and I hope more people discover this place. Anytime I'm in there, the place is sparse on people and I don't understand why.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2009-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1mPTt-Wdqk886_sbjO3_4w", "review_id": "kzv0V8oAY1x6UwpqnT0hvQ", "text": "Just had an awesome \"eggwich\". Great service and a really cool vibe. Can't wait to come back to check out the patio in the evening for a drink.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 5, "date": "2009-10-11", "type": "review"}
{"votes": {"funny": 3, "useful": 6, "cool": 5}, "user_id": "Lp_Ykqfbv5Q-oyGYlMGJRg", "review_id": "AzNdgBjrt7NqNnvHqMAUxg", "text": "After numerous attempts to find a place to go to open at 11 for lunch (Lalibela, Bacchanal, etc), we headed to Downtown for Paisley Violin.  This place is not located in a cookie cutter neighborhood, but this place is worth a visit!\n\nWe service was a little slow, even though we were the only ones in here, but the food most definitely made up for it.  We had the Mediterranean platter and the cheese plate.  Take note My Florist Cafe, this is how you do a cheese plate...\n\nThe Mediterranean platter was overflowing with hummus, tzatziki, baba ganoush, olives, dolmas, etc.  I love, love, love dolmas!  And these were amazingly fresh and I was pissed that my guy all the sudden decided to like them.  The hummus was spicy and had some chickpeas that weren't completely blended, which added a nice consistency.  Everything else of that cutting board was delicious, and I love their little panini pressed pitas!\n\nThe cheese plate was also delicious, serving a cranberry stilton, brie, feta, and a semi-hard cheese I couldn't identify.  We wanted to stay and have a sandwich, but we were already full from the two appetizers.  So my guy opted for a Kiltlifter while I had their pumpkin cake.  I wish it wouldn't have come straight out of the fridge, but it was delicious.  The cream cheese frosting and the dense pumpkin cake was a sweet way to end our lunch.\n\nI wish I wasn't leaving AZ in a month, because I would make myself a regular here.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2009-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HY9qpAamqLXFoa7xMwNntg", "review_id": "cC5EhKj0lMWNh9RxT6aKcA", "text": "now that i live within walking distance of the paisley, it's become an addiction.  i would describe them as a catch all place for beer, wine, coffee, and food.  quite random inside actually, with all of the bikes and flags and the muddy fish tank (bleh, really guys?)...\n\nlots of good wines and the beer selection is random and changes often...what i really come here for though is the food..lots of vegetarian options..my favorite would have to be the veggie burger...served panini style and made of brown rice and delicious veggies you seriously can't go wrong...their el greco sandwich is killer as well, if you're a meat eater, and it's served on this delicious toasted sourdough bagette.  their pasta salad is spot on too, i always get that as my side.\n\nstaff is friendly, your typical grand ave crowd can be seen here..randomness at it's finest...nice outdoor patio area, can't wait for the weather to cool down and enjoy some delicious brew and a tasty sandwich.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2010-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aRgTBYbG-eZipFRIipGlrA", "review_id": "JVoPK0aYG7KSOVzIJ5PfMw", "text": "This is an outer arts district staple in the Valley. The neighborhood is spooky if you don't know the area, but it is worth the possibility of having your car vandalized to stop in. Great live performances, mellow guitar, etc. and fantastic food. Hummus plate, Mm. Greek salad, yum. Cheesecake, yes please. The service is European style so expect to wait and wait some more. Seat yourself inside or out on the lovely patio.\n\nAcross from a fun locally-owned boutique you can stop by if you're there earlier in the day. \n\nI stocked up on the 70% off gift certificates for this little gem of a place at: http://www.citydeals.com/deals-merchant-Paisley-Violin-Cafe-Phoenix-AZ-LOC41462852.html?id=2852\n\nYou can thank me later. I'll probably be at the table next to you.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2010-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "khPlizt3ava1xkbtAxHQnw", "review_id": "a7dkFh6vTllx38EelYoFzA", "text": "This place has a great atmosphere. The patio is awesome and they place live music. The food was delicious and they had tons of healthy options. So why not 5 stars? The service was pretty bad. I ordered wine and asked for water with it. Then I asked again, and again. But it never came. I also ordered my meal with no tomatoes and they put them on. My friend ordered her sandwich with no mayo and they put it on too. So just plan to be there a while and don't be too picky and you'll love it!", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2010-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z24kr7bMK7uvOhoOgDvzOA", "review_id": "sGHx27MjhV3FY0D02X8l1Q", "text": "The BF and I met up with a friend for dinner on a Friday night around 7 PM.  It was when First Fridays were going on, so it was busy when we arrived (but not too crowded).  The ambiance makes the place feel like a local dive bar, which we didn't mind.  It seems like the kind of place that you can drop into for a cocktail on a nice Saturday afternoon.  But...\n\nThe menu looks like it was written by a kid in the first grade.  Some people would find that charming, but we found it a bit trying.  Also, it was written on one piece of white paper.  There were NO descriptions of any of the food.  So we had to ask the wait staff about the items we were interested in, which would have been fine, but...\n\nThe wait staff.  Hmph. A bit slow.  And totally unknowledgable.  They didn't know what was in the items.  We asked, and then items showed up with things on it that we were not expecting (and didn't like).\n\nThe food was NOT GOOD.  I ordered the shawarma.  It was TERRIBLE.  No flavor at all.  The chicken was boiled and had no seasoning.  The tahini sauce had no flavor at all.  I asked for some taztiki sauce to see if it would help.  It did not.  It was the WORST shawarma I have ever had.  However, the potato salad was tasty.\n\nThe BF had the lamb gyro which he said was nothing special (very average).  And my friend ordered the italian sandwich, which he liked.  For the price of the food, everything should have tasted better.\n\nDrinks were expensive.  A rum and coke in a place that looks and feels like a dive bar was $7.  SERIOUSLY?  Wow.  Unless you go during happy hour, the prices don't seem worth it.  They did have a good beer selection, and all of those (besides the super cheap ones) were $5 each.  That seemed reasonable.\n\nFinally, the music.  Ugh.  They had this guy with a guitar get up and sing/play.  He was terrible.  And it was SO LOUD we could barely hear each other.  Plus the table behind of us of older hippies were doing shots and whistling at the end of each song.  Getting rowdier and rowdier.  Great for them that they were having a good time.  Sadly, it just wore us out.\n\nI doubt I will return to this place.  And if I do, it will be for one drink, during happy hour, on a day when I can sit outside.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 1, "date": "2011-09-03", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "b4C9E7vTJrOdkJQA86xYSg", "review_id": "B0IEcIkrMTS0Q3h1DmKUnA", "text": "When  I feel like eating healthy this is where I go.  I love the mediteranean tuna pita.  I have tried numerous things on the menu including the chocolate cake (yummy).  I have never been disappointed with anything i ordered and the staff is always very nice.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2007-10-03", "type": "review"}
{"votes": {"funny": 16, "useful": 15, "cool": 12}, "user_id": "C8ZTiwa7qWoPSMIivTeSfw", "review_id": "0ShLt6bFRnIxMu5ZDIzn0g", "text": "I SOOOO wanted to love this place as it is cute as a bug's ear. Not that I'm saying there's bug's here,  I just think it's a lovely, modern clean space, with lots of light. My friend was craving the Greek pita. \"OMG...it's soooo good, you have to go get us some.\" So, I get our to go pitas (chicken, lettuce, feta and tomato), certainly not inventive, yet it sounded like it would hit the spot. \"OMG....the side pasta is sooooo good, you have to get that.\" Fine. Two Greek pitas both with pasta sides to go. Oh, and the chocolate cake. He said to get the chocolate sheet cake. Well, let me just say kiddies, the pita was dry, dry, dry. Sauceless and dry. Did I say it was dry. Chicken was dry. Pita was dry. It totally fell apart. And then so did I. Dry. Dry I say. Pasta side was actually quite good, all 2 oz. of it. BUT THE CAKE...OH MARY....THE CAKE! Truly a slice of chocolate heaven. I will go back and try some other items. Staff was friendly. I liked the space. Cake was, cheap, like a penny or something.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2007-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "MrPOzC4Fz_xEwJkA051V8g", "review_id": "33Ee_z1dyYxaygd9_5n9NA", "text": "I really want to like Zoe's Kitchen. I do. I really, really do. \n\nI have been to Zoe's more than 5 but less than 10 times, and yesterday was my last visit, unless I want to stop in for some limeade and chocolate cake. \n\nI have tried MANY things at Zoes, and I try to listen to what others like .... I don't like their bread at all, so every sandwich I've had has been bad. The quesadilla is OK, but I'm not a big fan of flour tortillas. The chicken roll ups (I think that's what it's called) that I had yesterday (after a good friend's recommendation) were kind of soggy and yuck-o. I don't like the pasta salad .... or the potato salad ... or their slaw .... or cold rice .... \n\nDo you see my challenge here? The decor is adorable, and I really want to love the place, but I think I've paid my very last visit to Zoes. \n\nSo, so sad!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 1, "date": "2007-11-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "XM6M-WWbCAeLy83jrABkcA", "review_id": "QCxL8Fpd2FCHyDeIcJGtrQ", "text": "Decent Lunch spot. The food is consistent as well as the service. I like that they have 3 ice teas to choose from: Regular, Sweet, and Green. I can't say that I crave the place, but it is a nice place to go if you don't want fried food or smell of Subway. My favorite is the pimento cheese sandwich with turkey added to it. It might be a bit weird for most but when I am \"hankering for hunker'n\", it hits the cheese spot.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2008-09-07", "type": "review"}
{"votes": {"funny": 5, "useful": 8, "cool": 7}, "user_id": "HOleI3jz1MLNUJ6cc1x0Pw", "review_id": "cRpamxksw8NVfgSXPFLqJg", "text": "From the street, my husband and I thought Zoe's Kitchen would be like Panera - that is, we thought it would serve fast, flavorful, and good-quality lunch fare. None of these adjectives turned out to be an accurate descriptor. In fact, the food at Zoe's kitchen took 30 minutes to come out and was disgustingly bland and in a few cases, quite gross. \n\nWe stopped in for lunch last week. The place was packed, but the line to order moved quickly, so we incorrectly assumed that we would also get our food quickly. More on that in a second. In terms of the menu, we were shocked at how uninteresting the menu options seemed. Even though the menu was decently sized and we are open to lots of different types of food and flavors, we found ourselves completely unable to choose and not drawn to any individual option. \n\nEven though I'm not a vegetarian, I prefer lunch sandwiches with no meat, so I was also quite irritated that the only vegetarian sandwiches were the grilled cheese and grilled feta. This is 2008, and the non-meat options at a lunch spot should be more imaginative than cheese slapped on some bread. In the end, I still ended up ordering the grilled cheese (nothing else sounded good!) and my husband selected the Greek Chicken Marinara. \n\nWe sat down at the table, displayed our number card, and just waited. And waited. And waited. After literally waiting for 25 minutes, I checked in with the assistant manager who was manning the pick-up counter. She went into the kitchen, checked on our order, and said it would be just a \"few more minutes.\" She even had a server bring us two slices of chocolate cake as some sort of  token of their sympathy, but it was super-dry and totally gross. Thanks, but no thanks. I'm just glad we didn't pay $2 for each slice!\n\nIt wasn't until 10 minutes later when I lost my patience and told the same server that we wanted our food immediately that we finally received it. We have a higher-than-average awareness of the difficulties of working in food service, but we found it un-acceptable that a non-full-service restaurant would take 35+ minutes to bring us two sandwiches. If they can't handle the catering, to-go, and eat-in order volume, they should hire more staff members. \n\nAs if the slow service wasn't painful enough, my grilled cheese was completed charred (literally burned and black). After one bit of the accompanying slaw, which was soaked in mayonnaise and soggy, I  immediately walked back to the assistant manager, handed her the plate, and asked her to refund me for my plate. To her credit, she complied, but the wait had already been so egregious that I wasn't about to just write the long wait and gross food off and decide to return. \n\nMy husband's Greek Marinara was not as terrible but was still bland and completely un-memorable. The bread was a plain roll, the chicken breast strips were formed and tasted totally processed, and the \"Greek\" marinara tasted like Prego. The only tasty part of his meal was the side of bagged chips!\n\nI guarantee you that we won't be back to Zoe's Kitchen. We are huge fans of fast, casual, and fresh lunch food, but we found the food at Zoe's to be anything but.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 1, "date": "2008-09-23", "type": "review"}
{"votes": {"funny": 5, "useful": 8, "cool": 5}, "user_id": "SBbftLzfYYKItOMFwOTIJg", "review_id": "wb-S6BaxbXKXIlPmjy3RfA", "text": "I went here despite Yelpers telling me not to bother.  What did I get?  An overpriced, bland sandwich, confusion at the menu, and feeling awkward in the location.  \n\nIt's an uppity cafeteria that makes you want to believe that their food is good for you, but it's not. Don't make the same mistake I did!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 2, "date": "2008-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QwO4LVCiPZZdg5URrQfYpw", "review_id": "3pl3dN1UP9yc_W-CTnjdbQ", "text": "This place saddens me. It is a void. It has a sterile atmosphere. The sandwiches were dry and not very good. The prices were high. The only reason that I went was because they handed out coupons in my neighborhood. If I had to say something good about this place, it would be that it is clean.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 1, "date": "2008-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bXJ9U9e_zn8K1xKwqTArzw", "review_id": "GB0uKv85Cgv9ViwdbzstqA", "text": "Very nice restuarant, clean, good food, and great service. And did i mention, the guy who helped up was gorgeous! It's directly across the street from My Florist on McDowell, which in my opinion is a great area that i hope will continue to keep building up great new stores and restuarants. Nothing bad to say. Great patio right on the street definately a great place to eat right now when the weather is perfect.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2008-10-27", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "OTQnCVQOlg9b5Frwj2H9sQ", "review_id": "1VYUc94aGbf_rVbET-YKSg", "text": "The Gruben is really delicious. I'm not a fan of Rye bread so I get it on a sesame roll.   I've had the Greek Pita a few times and like others have said, the chicken is very dry.  The \"sauce\" they put on the table (a greek dressing like substance) can almost make up for dryness of the chicken but not quite.  I considered giving them an extra star because there's a dude named Yoder that works there who I pretend is a Zen like sandwich master from the Dagobah system who holds the secret recipe to the delicious slaw they put on the Gruben.  \n\nIt's a bit of a cluster-F at the drink/napkin area...too tight in there for people but the fact that they have Diet Dr. P in the fountain makes up for it.  Like Nicole T, I'm a sucker for the DDP.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2009-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "dUrVJl5qi2CJWff7s8HJNw", "review_id": "DX24NS69i_jRnYSjQHr14w", "text": "Zoe's Kitchen is great for a quick bite.  It was nice and quiet around dinner time.  I sat, ate my chicken roll ups and read the New Times. They were delicious.  The dipping salsa is to close to Pace.  That is my only beef with the dish.   My side was the pasta salad.  Wonderful.  I was wondering where to go for dinner for one.  I didn't want fast food and I didn't want to have to tip a waiter plus I wanted healthy food.  Zoe's delivered.  My bill was around eight dollars.  Who's a happy camper? (me) The hibiscus tea was very good.  I went for a refill.  All in all Zoe's is a satisfying option for your taste buds and your wallet.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2009-11-04", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "7W4egS-WyR0hRHMfQtPEOQ", "review_id": "hE9PrOZjt_XsMPvg3ujDVg", "text": "I eat here at least once a week. Service is always good and food is consistent. The dressing is amazing!! Couple reasons for 3 stars--a bit overpriced. I should think more about spending $11 on lunch, but I usually don't bother. The second reason for 3 stars is that without the yummy dressing, the food is a bit bland. I always order the tuna sampler, which is great, but maybe because of the dressing. The tuna is a bit bland, and, as another reviewer pointed out, I could make the same tuna for $0.69 at home, with low cal mayo. The dressing can be purchased at Zoes, so if I become less lazy, maybe I will buy dressing there and pack my tuna from home...", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2010-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PNS9z4aFDbfhpIsHCfNvNg", "review_id": "Y5AeBvjEuiJAcz5JU5ZoFw", "text": "If you're looking for a quazi-healthy, fast casual lunch spot, Zoes is your spot. It's easy and great for a work week lunch. It's nothing that exciting from an ambiance perspective but the food is good (not great), it does the trick and won't break the bank.  \n\nI usually get the chicken salad sandwich which carmelized onions. My girlfriend always gets the protein plate which looks good too. Plus, every item comes with chips and a side of your choice (slaw, potato salad, pilaf, etc.)\n\nMy favorite part about Zoe's you ask? That Diet Dr. Pepper is part of the soda fountain selection. Divine.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2010-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "gcyEUr4DXcbjnGRAWFtfAQ", "review_id": "-4mXl1yJDUCvfSYc0WBGMg", "text": "This is my Go-To Spot for lunch. The food is always great, service even better and the prices just perfect.  \n\nI usually get the mediterranean  (sp?) tuna pita . it's a great soft pita filled with tuna, onions, capers and tomatoes. The tuna's mixed in with this oil and vinegar mixture, totally awesome! I sometimes will get the Greuben, which is a grlled reuben made with turkey and their home made slaw with feta!  My all time fave meal there is the Power Protein Plate, which is grilled chicken served with caramelized onions and a huge heap of the slaw!\n\nThey also have great sides like killer potato salad, pasta salad and the aforementioned slaw. If you're looking for a great pretty healthy spot to get lunch, check it out!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 5, "date": "2010-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kI1MoLcExqwmK7wcT5Vy1w", "review_id": "1vwaHenaX_JIf3X_vdSr5A", "text": "I crave Zoe's when I'm in the mood for something light and fairly healthy. I love their chicken salad and tuna salad. Both are pretty much just meat, mayo, and salt/pepper/spices, I think. No onions and no mustard make me a happy chicken/tuna salad eater! I also love their pimento cheese, feta slaw, and potato salad. The chocolate cake, though, is what hooked me onto Zoe's in the first place. It is basically a Texas sheet cake - moist, not too overpoweringly chocolatey, with that boiled fudge frosting that soaks in and seals in the goodness of the cake. {Droooool}", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 5, "date": "2011-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KA-GVrDP0huPS7zs5tmS1Q", "review_id": "zv7ZbN_UZYhuP8Y7KFeFfw", "text": "Good place for something quick and healthy.  I'm a fan of the pasta salad--it's light and tasty!\n\nSo glad i live near both locations in central phx--so can do when i feel the urge:)", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2011-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7W4egS-WyR0hRHMfQtPEOQ", "review_id": "C7DGcARIfSo4k6_BhPVVrw", "text": "What happened to this place? I used to go here quite often, but I am thinking twice before returning. I waited to update this review until I had 3 negative experiences because I wanted to give Zoe's the benefit of the doubt, but things have not improved. First off, there has been water covering the floor of the left side of the restaurant the past 3 times I have been there. I think they have a leaky roof, but it has been weeks, maybe even months, and there is still water. This is hazardous and just plain disgusting. Also, the restaurant is just dirty. I had to ask to have 2 different tables wiped down, and the crumbs from the table were wiped onto the chairs. There were 5 of us in for lunch last week, and every chair was covered in crumbs from the previous diners. So gross! I am sad this place has gone downhill; Zoe's has always been a staple for my friends and me, and now we will have to find a replacement.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 1, "date": "2012-09-11", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "7W4egS-WyR0hRHMfQtPEOQ", "review_id": "foAzhJyVIeh_TF4EnDb7Iw", "text": "The reason I Yelp is for entertainment and because I use the reviews from others to choose where I spend my money, so I like doing my part by sharing my own experiences. My intention is not to get free stuff. Ever. I rarely write negative reviews, and the reason I wrote a negative review for Zoe's was because I believe the conditions of the restaurant were a health risk. That being said, here is my update. So one of the managers from Zoe's asks for my phone number so he can find out more information. I give it to him, willing to share my experience. He calls me, hears me out, and apologizes. Then he asks for my address so he can send me a gift certificate. Unnecessary, I tell him, but nice touch. So I give him my address. Now, 2 weeks later, nothing. I messaged the customer service person who had contacted me initially just to let her know the gift card had not arrived. Just pretty surprising the level of poor management. I am no longer wondering what happen to Zoe's because it is pretty self evident.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 1, "date": "2012-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "y95dtvER8eGRLcsRoursgg", "review_id": "2SkpwARc5UShYJkcAx7w5w", "text": "I was pretty excited to try this place.  I love quick, healthy food.  I was disappointed.  My cole slaw was super soggy and loaded with mayo.  I asked for no mustard on my club pita and it had mustard.  The pita was hard around the edges.  \n\nI am willing to give it another try.  Or maybe another location.  It could have been just a rare bad day.\n\nThe service was friendly.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 2, "date": "2012-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ypz7hxOCnrg8Y8vxHJU-sQ", "review_id": "9GJnCoOL7-aZNuzEd8RSdA", "text": "Not bad, but not the best.\n\nI had been wanting to try Zoe's because I adored their logo and sign font outside their restaurant. Great color scheme. The interior was cute to match and even had local artists' works propped up on ledges which was nice to see the local support. I couldn't figure out if this was a chain or locally owned because it looked borderline corportate inside but had a lot of \"we support local\" types about. \n\nAs a first-timer I asked the counter girl her suggestion and she (and the woman behind her) were kind enough to offer up good suggestions. I order Zoe's Club Pita with pasta salad for $8. I walked away but doubled back to ask if it had come with a drink, the counter girl said no but gave me a drink anyway... uh, hello, so nice!\n\nI'm glad I took the workers suggestions because the pasta salad was AMAZING! A generous portion of feta cheese and tomatoes was delightful, my only complant was there wasn't enough. I wanted more!\n\nMy sandwhich on the other hand was a different story. The pita pocket had huge hole in it making it tear and really difficult to handle. The meat wasn't positioned all the way into the pocket and most of it was falling out the top. It was like three slices of ham had been wrapped around huge slices of grilled chicken and shoved into the pita. I was pretty sad to see this. I ate the whole thing and although it was tasty, it wasn't easy to keep altogether.\n\nI really appreciated the counter girl's kindness in giving me a drink but the status of the sandwhich was enough to probably deter me from returning. Which is too bad because I love that they support local so much. Maybe I should have had a salad.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 2, "date": "2012-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6WJHk3E4PLt0-EXakw5Kdw", "review_id": "0Zxwfhdgkl8xGbIjvxhwPw", "text": "Maybe I've just been lucky - I've always had great experiences at Zoe's.  The albacore tuna pita is great, as is the Greek chicken pita.  Today I had the Chicken pita pizza - amazeballs!  Also, the marinated slaw is to die for - huge chunks of feta cheese.  The service is always fast and friendly, and the food is always fresh.  It's a great lunch spot, if you can find a parking spot ;-)", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2013-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wN05bLB486m30Zd-X7BhuQ", "review_id": "BGMz3qVcsOsUZJnLJBfXXg", "text": "They remembered I ordered the Gruben every time I come here, impressive", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 5, "date": "2013-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "M_ANCS3xO0F5B0CwrpWcCA", "review_id": "CcbRK7waQqQi-TsAnfPddA", "text": "This is one of my favorite places to go for lunch. The food is delicious and not too pricey and I love the fact that it is healthy. One of my favorites is the Lean Turkey Pita. I just love their slaw. There is no maynnaise - just green onions, feta cheese, and their terrific greek dressing. They also have great pasta salad and their chicken roll-ups are fantastic. You absolutely have to get a piece of their chocolate cake as well. It reminds me of my mom's Texas Sheet Cake and it's so good! They also have dinners to go that are amazing.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2013-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aO329d_8MRPs2iEisEi-Iw", "review_id": "CGKK1pScQILMGN4O1FZ1-A", "text": "Their greek chicken pita is my favorite lunch dish.  And you need to add some of their house vinegar & oil.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2013-11-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "JIHbz6V2TJ6ho0yUaBsckQ", "review_id": "k7Su0jVMtOYxsgvkCaOalw", "text": "This was my first time being there. The smell of the place was kind of stinky. The lady took my order and seemed like she was in a rush (there were no lines).\n\nI got my food and drink. The milk tasted bad so I took it back up there and the lady was really rude about it.\n\nI ordered the steak kabobs with roasted vegetables and potatoes. The steak itself was tasty. Juicy. Flavorful. The vegetables were old, and the potatoes were soggy and flavorless. \n\nIt's good to try new things so you know not to go there ever again :)", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 1, "date": "2013-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BFRoUfAdeYyvITqZ8QhWfA", "review_id": "LT1Mk5OHAw4k5EgSq-5UQQ", "text": "The Chicken Dinner meal is so good!  I find different friends to go there with since I go often and always get the same meal.  I don't want people to think I'm weird by wanting to eat at the same place w/same meal all the time.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2013-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jAO9zgmbTXk4LaTxdSP_TA", "review_id": "uncOpTzFlNU0pgOLLY1MOw", "text": "Lots of really great choices on the menu.  If I had to design the perfect menu, it'd be pretty close to this.  When I get back to serious weight loss, I'll be coming in here a lot.  Lots of salads and meals that are low on carbs and heavy on veggies and meat.\n\nThe beef they use is not good though.  The beef kabobs are really, really chewy.  I grew up with cheap beef and it is my style, but I know a lot of people would be very disappointed.  Learn how to do beef better.  I'm sure you've already lost customers with that stuff.  I'll get the chicken next time.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2014-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WbcmyPVb8DioK2l9r8kDXg", "review_id": "occ_-nYKY7KQiaeZfXalKw", "text": "This was my first time at Zoës Kitchen.  They are right next to the popular yellow building that sells/rents costumes all year-round.  We happened to come in on Saturday (Halloween) and even though there seemed to be a lot of traffic on the outside, the restaurant had nobody in line and only two tables seated when we walked in. \n\nThe food was good.  Simple entrées with lots of flavor.   I've been told that they have a pretty good turnaround on getting the food out to you during the week.  As they should if people are in there during their short lunch breaks.   It's possible that they were short on staff for this particular Saturday because we waited over 15 minutes for our food before they brought it to our table.  The portions don't look big but are very filling.  I couldn't finish my meal.\n\nWe didn't have trouble finding a parking spot.  There was a Security officer making sure that only cars that parked in their small lot were going to the restaurants next to them... Zoës Kitchen, Chipotle, and Five Guys. \n\nI will visit again.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2015-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fJ_FMbSeNm9wVOOODRDNBw", "review_id": "WT8KlpCz_dbea498oPeyKg", "text": "Zoes always comes through! Delicious and healthy options. It's my go-to on a Monday after I've had a junk food weekend! \n\nAnd I have to say that while the people who work there may not seem as polite, they always fix any concern that you might have with your meal. And that is suuuuper important!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 5, "date": "2015-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "7jRJldamvbBZxRw-Y6xjUg", "review_id": "TYvHtJ65WACKGxBcQHyTjQ", "text": "I have been here 2 times. Each time I have been greeted with smiles and great food.\n\nMy last visit had me trying the trio of hummus, which was very good. Greek salad is very refreshing to say the least. I think the only downside was there was not much in the way of parking, had to walk around the corner from my parking in the housing area behind them.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2015-11-27", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 4}, "user_id": "E5QyEU6FCQwnTys0S73zNw", "review_id": "8wjeMjk84anes0a0QxeLxg", "text": "oh alas my Athenian Express our relationship was cut short by your niche ours of operations. as you see my dear. i only live downtown. so our short lived affair can only be just that. short. your Gyro Picado was tasty and you carried the heat that i enjoy in my relationships. the 4lbs of french fries were lovely, crisp, but waaaay too many. i truly appreciate your abundant portions, but i do not feel a need to gorge myself on your bounty.\n\nok lame love poems aside. this place is a great little greekish noshery. the patty melt my friend got looked awesome, we can more or less confirm the pre-formed patty observed by another yelper. but it was still grilled to perfection, sporting American cheese as by friend likes it was also a gold star.\n\nshe works in spitting distance to this place. unfortunately i work in Tempe. i was off on PTO today so figured would get lunch together. oddly enough another good friend was having lunch there too...great minds think alike they say..i concur.\n\natmosphere is typical sit down with some Chicago sport memorabilia on the side. GO CUBBIES!!!\ni would certainly be here more...if not for the hours of operation.  this downtown area needs to pick up on the weekends so places like this will have a reason to be open on the weekenders. alas..i don't' think that will happen anytime soon. till then Athenian. i love your lunch.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2008-09-02", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "_kOY5cdtI73oFMPK6OFMgA", "review_id": "FcD6nPguqVsNhx4Zoo4Y4Q", "text": "One of my favorite lunch spots.  Again, a family owned restaurant that I absolutely love!\n\nThis is the best Greek in town!  It is authentic, inexpensive and tasty.  It makes that Big Fat place look like Olive Garden. \n\nMy favorites are the gyro feta pita, the hummus, chicken picado pita (add feta), the french fries are probably the best ever, the dolmades are little bites of sunshine.  The portions are huge and they are always generous with the feta (and the onions - who eats that many onions anyway?!).  The onions are easy to pick off though...\n\nThey have the best fruit salad bowl I've ever had!\n\nThe owners and the staff are the best!  I just wish that I could convince them to open for dinner and for the weekends.  \n\nPlus, I always feel safe with all of the cops who eat there!", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 5, "date": "2008-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "XBHJCDzNh--mBhJkzyM_iA", "review_id": "T2karb2XaS9AxdPKh7Anjg", "text": "Um, yum!  This place is a great spot for lunch if you work in the downtown, mid-town, uptown Phoenix area.\n\nI chose a hamburger and fries, even though I love gyros, but it was one of those days where a burger and fry were just needed for me to continue with my day.  \n\nThe environment is a large open area of basic tables and chairs, it looks like it gets really busy around lunch time so maybe not the best kept up dining room but people move through pretty quickly. \n\nThe menu is MASSIVE-- we are talking, they have pretty much anything to satisfy your hunger.  They even had a variety of low carb options which is a big menu choice these days.  ( i really need to get back to low carb)\n\nStaff is really nice.  We'll be back without a doubt.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2009-09-06", "type": "review"}
{"votes": {"funny": 13, "useful": 16, "cool": 14}, "user_id": "vhAn390OgR1H4DwacJdc7w", "review_id": "NakAXx-nYP7tORjLMKBogQ", "text": "So Dallas G and I were thinking of a lunch spot.  I suggested Cibo, Matt's, or Valley Pizza, and he thought of Focaccia Fiorentina.  I thought FF sucked the first time I went there but was willing to give it another try. But when we got there ol' Dally had a \"better\" idea and suggested Athenian Express.\n\nAs we pulled in, some unacceptably angry looking woman glared at him for a reason that will presumably remain unknown to us.  (Please enjoy my multimedia Yelp.)\n\nhttp://twitter.com/spirit_fingers/status/5209414090\n\nIn retrospect, I think she was our guardian angel trying to scare us off.  Inside, the place looks quaintly divey.  I asked if anything was so much better than the gyro that I should get it instead, and was told that the gyro is the way to go.  Feta or no feta?  I wondered if it was an avalanche of feta or just a sprinkling.  He puts a lot on there.  Fine, no feta.  I get the potato salad with it, and an order of spanakopita--which I ordinarily love.\n\nWe sit outside.  The spanakopita arrives.  It has little cheese and is not flaky.  Tastes kinda like shit.  Served with crappy tzatziki, which I don't think is the appropriate side for spanakopita but whatevs.\n\nhttp://twitter.com/spirit_fingers/status/5209643122\n\nNext, my gyro arrives.  The gyro meat is covered in three slabs of tomato and a mountain of onions.\n\nhttp://twitter.com/spirit_fingers/status/5209752658\n\nAs you can see, at this point I'm fearing the worst.  Look, I like onions and all, but when you leave fresh onions out in the air for too long they become veeeerrrry rowdy.  Like so rowdy that eating one would be enough to burn your mouth and render you a pariah.  So all that's left of my gyro is three slices of \"gyro meat\" and tomatoes.  And the little side cup of tzatziki that is only filled a third of the way.  The gyro meat tastes like... nothing.  I am underwhelmed.\n\nI move on to my side of potato salad.\n\nhttp://twitter.com/spirit_fingers/status/5209805283\n\nNormally mustard potato salad has a pastelish yellow hue, but this one looked like it could be seen from space.  Whatever it was, it was odorless and flavorless, so I can only assume it's some undetectable poison like polonium-123.  If I die, I leave my rapier-like wit and boundless charisma to my son, Samir.  You all can fight over the rest.\n\nAnyway, the restaurant pretty much blew.\n\nhttp://twitter.com/spirit_fingers/status/5209947387\n\nI'm not an arsonist, it was a joke, relax.  But not as big of a joke as Athenian Express, which must have suffered a precipitous decline in quality if even Dallas G (and his notoriously low standards) ever liked it.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 1, "date": "2009-10-27", "type": "review"}
{"votes": {"funny": 11, "useful": 11, "cool": 11}, "user_id": "oC0kwGvgaAeT3ZIxdxTcJA", "review_id": "eeasChiu_6QEzsGNwrzuhw", "text": "Every day that Richard Z is in my hood, I play emotional Russian roulette with our lunch spot. Is he gonna hate it? Is he going to order the wrong item and blame me for the rest of the day? Should we go with the tried and true. Should we try a new locally owned small business gem and raise Phoenix out of the fiery ashes of its universal assessment as the smallest of the big cities? The guy's a real Nazi about his sustenance. \n\nSo today, as we're walking to Focaccia Fiorintina, where we just should have gone to begin with, I'm like, \"OH! Do you like gyros? Your last name is Greek. Let's go to Athenian Express!\" \n\nWell, that was stupid. I really really really hate ripping on mom and pop shops. I hate giving two star reviews to family owned restaurants. But damn... You made me look like a REAL arsehole, Athenian Express. \n\nPoor Richard Z has been lamenting about how empty he feels all afternoon. And being the people pleaser that I am, well, I'm just devastated. \n\nThe lady that took our order, no doubt a solid and very decent human being, was unwilling to play along with any banter whatsoever. For two extroverted numbskulls like us, it just takes a little bit away from the charm.\n\nAnd the spanikopita arrives... I find it too spinachy. He finds it too bready. Just goes to show you can't please everyone, or in this case anyone. \n\nMy sandwich was literally inedible. Not because of the taste. I picked it up and the whole thing fell right apart. My tray looked like a murder scene. Ketchup, who for so long suffered as the understudy in this WAY off Broadway spectacle, played the part of my disappointment. \n\nWhen I asked @spirit_fingers about his meat, he said, and I quote, \n\"It's not offensive.\" \n\nI remember liking this place in my past life. Today, it was not good.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 2, "date": "2009-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f3LA83yEEBMj9q92H28O7w", "review_id": "m9tXZykPpeQSJ27FJIUElw", "text": "Great for hangovers during the world cup.  Quite tasty but nowhere near the best.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 3, "date": "2010-09-08", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "zing3W2AVxcHwmBHid-Fcg", "review_id": "Ain-0SFS0nC9u-YBKIAw6g", "text": "Oh, Athenian Express. You were so promising, alluring, and tempting when I walked in the door and yet, so disappointing.\n\nThe bad:\n- Awful gyro meat. This tastes like the gyro meat at Crave sandwiches, which we all know isn't real gyro meat. \n- THREE slices of gyro meat. THREE. I took a picture to prove that it literally only came with three slices. Whichever reviewer said that their sandwiches were bigger than a Kronos lied and lied mercilessly. Seriously, who gives three slices of meat?\n- The sauce was mediocre. It's homemade, but that doesn't mean it has to be mediocre. \n- Fries aren't anything special. They taste like fries that come in a bag, no special seasoning or anything. \n- Cubs fans. Enough said. \n\nThe good:\n- I ordered fries, which I got, but they also gave me fruit. I don't know why, but this saved the review from being one star because the fruit salad had mango AND orange in addition to melons and strawberries.\n- Fast service. Damn fast. Maybe too fast since they gave me so little meat.\n\nOverall:\nI was so excited to go here because I only get gyros on a special occasion. Well hot damn, I won't go back. I'm going to stick to George's Famous Gyros on McKellips in Tempe where not only are they not Cubs fans but they use real gyro meat.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 2, "date": "2010-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p4nM3nMNFDqrFTh4fRsFzA", "review_id": "_sFFDiBfLLo6DC-ckIFz8g", "text": "I love Greek food and found George's Athenian Express through a non-New York friend (from Chicago).\n\nI immediately found the place to go for Greek food at excellent prices and good portions!\n\nNever get enough of the Gyro!", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2011-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "7W4egS-WyR0hRHMfQtPEOQ", "review_id": "cgzsnrOmW2zX4hTB6FFJQw", "text": "This place it hit or miss for me. I have always ordered the feta gyro and either fries or a small Greek salad. Why is the soda machine always broken? Makes me wonder what else is broken and not fixed in the kitchen. I ate here for the 5th or 6th time on Thursday. The gyro is excellent, but the fries were overcooked and the oil didn't seem very fresh, as the fries had a brownish, oil soaked feel. I will return for the gyro, but I may skip the fries and stick to the salad.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 3, "date": "2011-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a09ENYogqRn0sQ8J2D_rng", "review_id": "iXrn5lGemAih7gl8XyRxRA", "text": "My baby turned me on to this place.  I love it so much. Such a good place to eat", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 5, "date": "2012-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_tBu-2i9uT6LFxh-TyEOHA", "review_id": "ygVApLq3sbc_U-Y9zFWRdQ", "text": "Affordable and good.  Clean restaurant.  Will return.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 3, "date": "2012-09-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "1rwtkywcms6ej0Wmcxm1Nw", "review_id": "l2mP29_SFZkieLDhloe_KQ", "text": "The best lunch in Downtown Phoenix. I always get the gyro picado with feta cheese. But great salads the offer a healthy, low fat & carb options. If you are in the area I highly recommend.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 5, "date": "2012-11-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AZuecYaQ7aVpt3mXxmCcSw", "review_id": "5iyuWIxaZCFZLQeObeQITw", "text": "Express my ass, I stopped in this place today for lunch (to-go might I add) and ended up waiting almost 40 mins for chicken souvlaki and fries...I told them my lunch was over by the time they handed me my to-go bag no apology, complimentary drink, discount NOTHING....only to add to it being mediocre greek food. Save your time & money and go elsewhere.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 2, "date": "2013-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BjuCl6xzbj8mB2GiCklq6g", "review_id": "IxdyW0CWQMb3mlH7ZsisUQ", "text": "I like it!  The chicken pitas are tasty. I've only gone for lunch since I work downtown, but I always enjoy the food.  Try ordering the hummus too!  I just wish they stayed open late at night.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2013-11-19", "type": "review"}
{"votes": {"funny": 3, "useful": 6, "cool": 2}, "user_id": "xgrNgHOs8F5JvEX38IeCJg", "review_id": "v-W5B0uePfezeydzpWMczw", "text": "I'm on a Greek rampage. I was told that Bacchanal is THE PLACE to go. I have to say.. I am dissapointed. My friends and I arrived, sat in the back corner or an 80's themed restaurant. Oh- that wasn't a theme? Unless the food speaks for itself, I would opt for a remodel.\n\nThe food does not speak for itself.\n\nI ordered the vegetarian moussaka:\nVEGETARIAN MOUSSAKA  15.00\nSlices of eggplant and potato layered with zucchini, spinach and feta cheese, topped with béchamel cream and parmesan cheese\n\nI have to say, the actual moussaka was delicious, but it came with vegetables that I swear were straight from a can. Mushy... tasteless.\nIt was a little while ago, so I can't recall what my co-adventurers ordered, but I do remember the look on their faces when the belly dancer came out. It was more of a squint since the dancer was so far from us- all tucked in the back corner like lepers.\n\nReservations are recommended for optimal belly dancer viewing... but...\n\nSome would argue that you wouldn't really  want to be that close.\n\nWe arrived on a night when a good portion of the restaurant was reserved for an engagement party- a woman named Athena was getting married. Appropriate? Anyway, the whole entertainment side was catered to that party and my guests and I had the distinct feeling that we were crashing My Big Fat Greek Enagagement Party.\n\nNext time, I would suggest reservations and some social lubricant in the parking lot before entering, preferably from an ouzo bottle in a paper bag.", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 3, "date": "2008-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "zigHnwA0FSGPGUE59lLFzA", "review_id": "vobgySm0oMWQJTSt5kHt6g", "text": "This place is great for a big group of people. We originally thought we were going to have 6 people. We ended up having 11 by the time everyone showed up. The staff was more than happy to accommodate us. The Kota Athenian chicken is very good. The price range is moderate. All in all a fantastic place.", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 5, "date": "2008-10-27", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "Pl4fs0QWR8FbnVNCzqF9lg", "review_id": "kW99ou1rgbj2FnzMGYh7NA", "text": "Best Greek food I had in Arizona and excellent entertainment.\n\nThe dolma's were the best I've had, their version of Babaganoush was very good and they had many lamb-based dishes.\n\nThe entertainment was great. Live music, belly dancing, greek-style fun, broken plates, and dancing.\n\nSince I had the sampler plate I can tell you that if you're vegan, vegetarian or any other wacko thing like that, you might not enjoy the food here (Greek Lasagna?....really?) Also, the chicken was no good but I don't really like chicken anyway.", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 5, "date": "2009-10-18", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "PShy2RYNadDUhJf4ErOJ7w", "review_id": "C1Juh1MTbzi0AOe2hqj2sA", "text": "I have a secret.\nI don't like greek food.  At all.  I hate olives, feta cheese, gyros, etc.\n\nI brought my mom here for her birthday, and it was GREAT!\n\nThe entertainment was AWESOME and family friendly.\nEveryone in the place was laughing and having a great time.  \n\nMy family very much enjoyed the greek food too.  \n\nThis is where everything birthday/special occasion should be celebrated.  Hands down.\n\nOPA!", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 5, "date": "2009-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "uTyIIbOvXH_XZw7OEiTiNg", "review_id": "M6nmrFuJjmkVkxwm-qhDyw", "text": "Unlike my sis, Sarah M., who doesn't like greek food,  I love greek food and this place did not disappoint.  Not only was the food great but it felt like we were invited to a family party rather than eating at a restaurant.  Loved the music and the dancing and how everyone was included.  My 11 year old was invited to dance more than once and she had a great time.  I highly recommend going for a late dinner and staying for the entertainment.  Be willing to join in and you will have a blast!", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 5, "date": "2009-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "why2I12KmPks4g-1XNrNGA", "review_id": "weUutgDfwk0gWTVeHAR9_Q", "text": "3.5. It was very quiet when we went, no dancers or band. The food and service were great- the one exception being the salad. It had too much dressing. The feta was delish- very subtle. \nI had the moussaka- it was very tasty! Decent portions size, along with potatoes and vegetables. They are not stingy with the bread either, which is a rarity. My companion had the chicken with lemon and artichoke, it was good, but I preferred my moussaka.\nWould I go back? Absolutely. But next time, Id like to see the dancers!", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 4, "date": "2010-09-10", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "_uL7OiQSfNsCd60DrAf7qQ", "review_id": "wy_U4gKAeo-Pyi9HqwOtLQ", "text": "Giving a place a 5 star review is serious business. I would give them 10 stars if I could. Best dining/outing experience I have had in awhile. One can go out to a place sit, order, eat, pay and leave at just about anywhere, but where is the fun in that? Bacchanal is a one of a kind dining event that I predict will be on my frequent dining list in days to come. \n\nGeorge, the owner, greeted us as soon as we walked in the door. We noticed it was especially busy, come to find out it is a woman's 90th birthday. 90! She was awesome too....side note - at 90 years old she put the whole party together - e-vites and all and roused a crowed of 75 close friends and family to party with her. She is my idol! \n\nWe got a great table over looking the festivities, great view of the band and dance floor. We then met Taso, George's son, who took great care of us the entire night and quickly brought our first of two bottles of wine. Yadda yadda yadda.... everything was great there on out. \n\nI had the Souvlaki Eilian (sp) - lamb skewer with rice potato and veggies. The rest of my party had the Greek style lasagna, veal and a different lamb dish. Oh and we also started with the flaming cheese, and lemme tell you, cheese on fire is awesome! Perfectly greasy and yummy! All were awesome. Then of course came the Ouzo shots and plates for breaking... OPA! \n\nThe band was perfectly Greek, we were graced with two different belly dancers, one of which is in the Ginus Book for flipping quarters of on her belly one by one. Don't ask, you just have to go check her out. Pretty impressive! Then we all danced. \n\nAll and all we had a more than great time. Thank you so much to George and Taso for making it fab, we will be back for sure!", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 5, "date": "2010-11-08", "type": "review"}
{"votes": {"funny": 5, "useful": 5, "cool": 4}, "user_id": "YzNZNgpOy9tthDnczS_ajg", "review_id": "EhXL3_ufQq3K7ddzeyD7Qg", "text": "This place was, in a word, AWESOME. For those who don't know, one of my favorite places in THE WORLD is Sammy's Roumanian Steakhouse in Manhattan.  This place actually reminds me a LOT of that place, which is great to have right in my neighborhood (not to mention right next to my favorite strip club, but that's another review).\n\nCame here with a group of ladies on Saturday night, and we had so much fun. I mean, how many items need to be delivered to your table ON FIRE before you start having a good time?  Hint: It doesn't take many. However, our mid-twenties asses were put to shame by the biggest party animal of the night, 90 Year old Mildred. This chick was celebrating her birthday with 75 of her closest friends and was scooting around that place with a vengeance. It was incredible. According to the wonderful owners we chatted with, she E-VITED her guests.  Yes, a 90 year old woman learned how to E-VITE specifically to invite 75 friends to Bacchanal.  That may not be entirely accurate, but I wouldn't doubt it.\n\nI had the Veal Bacchanal, Aimee H. had the lamb skewer, and our two friends had the Greek Lasagna and the Lamb Shank.  My veal was very good, but the Lamb Shank that I tried was incredible! Like fall off the bone tender. But it was huge, and I was filling up on wine and ouzo, so I was satisfied with my bites.\n\nReally though, the experience itself is worth five stars. Yes, the food isn't inexpensive (around $15-$20 for an entree...but they have a gyro plate for $10 as well), but they could have charged $5 at the door for the entertainment alone. Belly dancers, a live band, freaking throwing plates on the ground! Obviously, the way to any girl's heart is condoned destruction of property, so they did a great job recognizing that.\n\nOkay this is a long review, but go when they have the belly dancers and band, get the lamb and some ouzo shots, and throw some plates on the ground. If you don't have a good time, you should maybe re-evaluate your definition of \"good time\". That is all.", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 5, "date": "2010-11-09", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "qpplec-ajubZNLQrp8pa0g", "review_id": "UKyRBchzC6StFkVSFdk4mg", "text": "Bacchanal must be greek for spectacular.", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 4, "date": "2010-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "MXrc-BGk8PmHuLmOfojkEw", "review_id": "JnNZJWlrRR10Nqic-t9vDQ", "text": "I'd been to Bacchanal several times in years past. It was tons of fun. Good food and an outstanding atmosphere -- belly dancing, live music and the best part -- you can break plates. So, I planned my boyfriend's birthday dinner to be there last night. \n\nI called 2 weeks ago to make the reservation for 15 people. I called again on Tuesday, Oct. 25 to confirm. They said 'see you then!' \n\nWhen my party of 15 arrived to a dark, deserted parking lot, we were perplexed and I was embarrassed. A big pink sign tacked to the door explained:\n\nSorry we are CLOSED for Problems Forced The Remodeling Oct  25 - 31\n\nWhich begs the questions: If the restaurant was already closed on Oct. 25,  why did they confirm my reservation when I called Oct. 25? And why didn't they call me to cancel my reservation? \n\nI'm seriously disappointed and sad that a place I would once have given 5 stars is now barely worthy of 1.", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 1, "date": "2011-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "0VfJi9Au0rVFVnPKcJpt3Q", "review_id": "MU9fSdeIS3HFFB3ChO5KIQ", "text": "My favorite Greek restaurant in town. A true authentic Greek bar. The owner personally greets all patrons. She is wonderful. The bar is truly Mediterranean. Don't pass up the rotisseries. They all rock.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2009-09-17", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 2}, "user_id": "2XCsVpAMsGUykrM-BBFEXA", "review_id": "wnQvu7jl0LTscXbPFk5E1g", "text": "Perhaps I was possessed.  Perhaps I was having a moment of Hellenic pride.  Maybe I wanted to feel like I was on the island of Chios smelling the marina and humming along with all the traditional anthems.  Perhaps I was hoping to break a few plates after toasting a wonderful plate of desperately sought out seafood in the desert.  I am not sure what it was that night I simply had to have Greek food. I had a dream is more than an ABBA greek tribute.  But here is my reality...\n\nHaving recieved awesome directions not thanks to my Garmin which placed the restuarant to the right versus the left off 19th and Camelback, but from the owner's wife, I pulled into an empty Tuesday night parking lot about an hour and a half before closing.  Perhaps this was my very first mistake but with this economy, I realized that the place might have been hurting more than my yearning for horiatiki and tzatziki.  Still, the women's voice was alluring and authentic and promising.\n\nEnter stage left, a host.  Truly, I thought  that I was part of an elaborate prop set for what would be a Greek tragedy.  The place is certainly capable visually of transporting you to Ellada.  The place was also as barren as an off season tourist trap near Plakka.  The two other people there seemed to be regulars.\n\nI admit that I was VERY impressed with the menu.  Again promising.  I went ahead and ordered Ktopodi traditional and kalamarakia.  Homemade bread that was made the last time the restaurant was full appeared at the table with sweet butter that was also frozen at that same time.  A wine list featuring more Greek wines than anyplace else was also promising, but I knew I would have a long drive back and well, you know me and that speeding thing on Interstate 17...I digress...\n\nAfter waiting for almost 25 minutes, I got one tentacle of  what must have been the world's smallest octopus and that octopus was suffering from anorexia.  It was camoflauged in a sea of fava bean paste to give it a fuller appearance.  It was dry and not tasty.  To be more clear... imagine a child's finger being grilled and placed in front of you after being dehydrated.  Yea.  That is what it was like.\n\nThe salad was fair.Meek, but fair.  Nothing to really yelp about.  The kalamarakia were horrid.  I think they were anything but fresh as they were laden in overly fried onions and sopping in oil with the breading stripping away.  I must have been desperate for the fruit of Poseiden to be enticed in any way to put a forkfull of this stuff in my mouth.  It was the absolute worse that I have ever experienced.  Hands down.  \n\nI am certain from the many posted accolades all over the walls of the place, that the GreekFest was indeed great.  But its day has come and gone and its legendary service and cuisine is all but a page of mythology.  I was extremely disappointed.  I am only giving two stars because the server was ok and the setting and music was so authentic.  I can only beg the Marvrides to consider a return themselves to their heritage of excellence that seems now so far away.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 2, "date": "2009-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6u_JYePyYlIKOCZ4hVXfRg", "review_id": "nb3TuiLm5gOFx8uY5RJ0Vg", "text": "We ordered in from Greekfest yesterday and I was underwhelmed.\n\nMost notably, they delivered quite possibly the worst Avgolemono soup I've ever ingested in my life.  It was pretty bad.  The rest of the food was ok but very pricey given the portions.\n\nI'm crossing them out.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 2, "date": "2010-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iOsJNHpuRyvhoGp-gniSMA", "review_id": "EmJUBgOZi-Dkvs3kfz1yQA", "text": "The decor of Greekfest was great and really gave the feeling of being in a restaurant on one of the Greek islands.  We had the Spanakopites and Arnopites for appetizers and they were wonderful.  Then for dinner we had the Ravioli dish and the stuffed chicken breast dish and they too were out of this world.  Then for dessert, we had the Baklava which is a must for any Greek restaurant and Greekfest's Baklava was really really good.  Overall we had a great experience and can't wait to go back to try other dishes on the menu.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2011-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IVuTqZSQ-DHemW7gNazGNw", "review_id": "oKyszD6fQ6jfogD9eNLTAA", "text": "We've now been to Greekfest a half dozen times. Basically any time we go through Phoenix. The food is authentic and everything is homemade. The place is a bit pricey, say $40 per person but very good. We have had most everything on the menu by now and it's all good. As others have posted, you can't go wrong with the lamb.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 4, "date": "2011-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "z9W0RuEBU7bX9gNT7UAj4A", "review_id": "of2KS8W32al9RHGs6jLImA", "text": "I actually give this place 0 stars. food-wise, our meal was alright but service was pretty slow. after dinner we ordered tiramisu for dessert. after our server brought it out, we started to eat it, expecting it to be delicious, but no! the first thing we noticed was the disgusting bitter taste and then we took a closer look at the cake. right away we realized the cake was moldy! and I don't mean a little moldy - it was chock-FULL of green mold!!! of course we had already taken a bite because we were not expecting that, so we just started spitting it out like crazy, but could not manage to get the horrible taste out of our mouths. we told our server and he did not believe it at first so we insisted the cake was moldy. he took it away and brought us a fresh tiramisu, which we no longer had an appetite for. the owner came to talk to us when he casually apologized and did not offer to compensate by reducing any part of our bill. the only thing he did for us was give us some free biscotti, which we weren't the least bit interested in. on the bill we were charged for the full meal including the dessert. obviously NEVER going there again! and from now on when dining out we ALWAYS carefully inspect our food before taking the first bite!", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 1, "date": "2012-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DAekINb-8S_f-5hOMkEFzQ", "review_id": "XKyBAL-GKxMouIWYh_zUyw", "text": "Had a really nice dinner. The shrimps were amazing!", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2012-11-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "CEW2upzTvsSR3FRp2N2qlQ", "review_id": "qb2XGYx5-TfZdEx4J0JYBw", "text": "The best Greek food this side of Greece... enough said about food! The Waiter Dwayne gave exceptional service! I even personally met the owners, Tony & Susan who were most gracious! I highly recommend it if you are looking for a delicious Greek food experience in Phoenix", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2013-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "Lgk9-0gJRPGCARtzpF2Fkg", "review_id": "d3dgZgUocgXRz_rDO2PPBw", "text": "This is the best Greek restaurant we have found in the area.  Just a warning that the menu on Yelp is not accurate.  We specifically came here because the menu (on Yelp) showed that they had Kolokithakia Skordalia (which no other Greek restaurants in the area seem to have).  However, it was not on the menu in the restaurant.  But... they agreed to make it for us, and it was excellent!  Everything was delicious, and the owner was very friendly and service was great.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2014-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "tDGOpaWUKuxFh18mAVwIYw", "review_id": "YXLA1dpD-TcM2haX-AX1IA", "text": "There is a reason this restaurant has been voted the \"Best Greek Restaurant in Phoenix\" for 23 years. It is wonderful! Phoenix has a pretty vibrant (and highly competitive) restaurant scene with many excellent options. It's unfortunate that many of our long-standing establishments are overlooked by those trying to patronize the latest trendy restaurant. \n\nWe made reservations, but sadly they really weren't needed.  The entire time we were there, there were only 2 other tables of customers. Greekfest doesn't have the best street visibility, so perhaps that is why. Or, maybe it was just an off night or perhaps we were there too early in the evening. The décor has a definite Greek island influence, white and blue and very crisp feeling and we were warmly welcomed and seated.\n\nOur server came over and welcomed us, asked if we had any questions, and took our drink order. The Greeks have had 3,000 yrs. to perfect their culinary expertise, and Greekfest prides itself on theirs. The menu is almost overwhelming, and then there are the specials! Our waiter rattled off several specials, all of which sounded scrumptious! Decisions, decisions. I don't think you could go wrong with anything (unless you don't like eggplant like me).  We started with the Trypoites (Greek cheeses & herbs in phyllo). Off to a great start as they were yummy. Entrees included the lamb shank special which was melt-in-your-mouth delicious - perfectly prepared. Ditto for the lamb souvlaki! Our waiter suggested a Greek red wine (Amethystos) to accompany our meal. Never had a Greek wine before and was pleasantly surprised. The portions were so generous, there was no room for dessert. Next time for sure!\n\nOur experience at Greekfest was wonderful from the moment we walked through the door. The staff are friendly and knowledgeable; they sincerely act as if they are welcoming you into their home. Very nice, authentic ambience.  Most importantly...the food was awesome! That's what we want when we dine out, right? \n\nDo not, do not - drive by this place when you want authentic Greek food. This is a great spot for two, four or fourteen. Support this local restaurant instead of a national chain - taste the difference!", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 4, "date": "2014-11-12", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "ZrpsUVbEkuzhCqRfjM3pGw", "review_id": "fbc6ZjUPCAhDqVwvo0W7vA", "text": "It was totally empty to begin with but that's okay went in for lunch with my daughter we were excited to try a new Greek restaurant! And we ordered several different dishes to share and one by one they got worse and worse we both think the health department needs to be contacted there was rancid walnuts in our salad the oil and vinegar bottle was covered with hair and dust like its been sitting for ever I have no idea what they do in that kitchen but it was disgusting to stay the very least! We started looking around and it  was very very dirty...  We had to send back even the salad which smelt like dirty sponges maybe they dryer the lettuce leaves off with a used wet towel in the kitchen...  it was so gross .We will never go back cannot even imagine that they're even still open!!!! :(\nEXTREMELY  DISAPPOINTED! !!", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 1, "date": "2015-09-30", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "xCN6tqKz5bDIfoSX6syTag", "review_id": "6OPjLceWIxKOSorC53PBrg", "text": "Wow I feel sorry for this place. I went in on a Thursday night for a quick salad. The place was empty, only one other table. I got a greekfest salad. It was small had one olive and one onion slice and 3 pics of lamb meat for 12 bucks. \n\nI even got charged for the pita bread and tzitki sauce.\n\nWow out the door for 20 dollars. Definitely won't be back.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 1, "date": "2015-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "4DsUW5yuIkUcZ9Eu7p7EuA", "review_id": "KfAp-78DNe4rzMHQtRaVEg", "text": "I have eaten here for lunch three times recently and have been impressed each time. They have great salads and affordable prices for lunch. They also have some pretty decent appetizers on the menu.There is construction going on in the area and they're not easy to see from the street but they are definitely worth the trip.\n\nI love the Decour of this restaurant. Very beautiful interior makes you feel like you are in Greece. Definitely looks like an upscale restaurant with pretty reasonable prices. They also have a full bar in the restaurant.\n\nWhen I was there they were not very busy for lunch. Service was very quick and friendly. Every time I went there to eat the owner came out to make sure everything was good.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 4, "date": "2015-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w2-LYY74W16RXCUYJa86MQ", "review_id": "P8I1_ES8hG7lfkVg_-m25w", "text": "Was in the mood for some Gyros and Yelp reminded me of this place just down the street. This place didn't disappoint! HUGE portions, delish food, (especially the pita), and super friendly people. Will definitely be going back :)", "business_id": "bxpzP73A7gauvxFEyd_8xA", "stars": 4, "date": "2009-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L-Ozz_VcyF8SIZmqkj8kAg", "review_id": "Km4OULqFuScZNIkw-dMC4w", "text": "Best gyros in Phoenix period. The hummus is really good, too.  I love greek food and these are the best gyros out here.  The pitas and the meat are the best I've tasted out here.  Some places give you the preccoked presliced no tasting meat, and others load their sandwiches with tons of lettuce and tomatoes with no meat.  This place piles on the meat.  Special note: If the wife makes your gyro be prepared for biggest meat gyro you've ever seen, but the husband makes a better gyro giving you a better balance of meat and toppings.  \nUnfortunately, I can't review the rest of their meals because I can't get past ordering the perfect gyro.  If it's not broke, don't fix it.", "business_id": "bxpzP73A7gauvxFEyd_8xA", "stars": 5, "date": "2010-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 3}, "user_id": "d0wJVf7Gv7v1B-HHYhxZtQ", "review_id": "Is-L_4z9lI0B6IjQk_moBQ", "text": "I think the owners changed..  The price is kind of high now and the gyro is not as good it seems.  Not enough sauce maybe?  The fries are ok, but the seasoning is not very even.  They have a frequent flyer's card - I think if you buy 10, you get 1 free.  Maybe I'll check in on them again because I think the husband and wife team was just starting out when I went.", "business_id": "bxpzP73A7gauvxFEyd_8xA", "stars": 2, "date": "2010-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YHsXC1pBglfXQNhVN_weFw", "review_id": "XnOA0ahK2ZWKfIY0fFMJYQ", "text": "Steve is a great guy but the gyros and fries fall short of OK let alone great.  First off the gyros always sliced so thin that it quickly burns and curls on spit when cut. That Would put you out of business in Chicago. Next the toppings are weak and need to be improved. The pita is ok but not worthy of my mouth or money. Now the fries, come on guys these fries are greasy and no flavor Steve turn the temp on the fryer to 350 and they will fry properly.  Stop giving us greasy fries they suck buddy.  Gyros needs to be flavorful and juicy you know that, but many places here have no idea how to make that happen.  I wish I could have a gyros like central gyros or costas gyros back home. Your sauce is good but that's just not enough to earn more stars.  I will submit this to the AZ papers as well maybe just selling the business would be best.  The gyros here should be free.  Come Steve better gyros for all is needed.  I mean dry and burnt just doesn't work man. I will be watching this place and informing others if things improve.  Peace.", "business_id": "bxpzP73A7gauvxFEyd_8xA", "stars": 1, "date": "2010-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s5s22KVxhiaiJ6qrBQ58hw", "review_id": "TDsvbS1uUaK4JkA-qSD_Nw", "text": "Hands down the best Gyro in Phoenix. Customer service is always great and the people that own it are super nice. The meat is piled high and its nice and thick and a little crispy. Perfect! Only downside is parking is a little bit of a pain and the 7 pm closing time.", "business_id": "bxpzP73A7gauvxFEyd_8xA", "stars": 5, "date": "2010-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hDANOMKLeEqwzytjxAuZWg", "review_id": "fWZM9YCIiH9GmGG7tFhCJg", "text": "I loved coming to this place for lunch when I worked down town. The gyros were good. The best in town? I think not - I much prefer Papa's Gyros which are more flavorful. I love their fries though! The service is quick and friendly. Parking can be a pain though.", "business_id": "bxpzP73A7gauvxFEyd_8xA", "stars": 4, "date": "2010-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_ju0P_eGbCYI43Pj3BTckQ", "review_id": "z7VXk9huIcy-B9YOd6n3Uw", "text": "It's okay. But better gyros are down the street at Z's Greek.", "business_id": "bxpzP73A7gauvxFEyd_8xA", "stars": 2, "date": "2012-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "TFoC8qQCI2VfQe3rB0Q0ng", "review_id": "aI4AmgbqOh1ALonZ1VAP6g", "text": "I tried this place for the first time since I have been working in the area for 6 months.  Loved it!  I got the special, Chicken Cesar wrap and it was great!  The chicken was hot and the lettuce was cool, and not too much dressing...A simple dining choice that has good quality.  I will definitely return!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2008-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "g6rlp5No6GjEDXkrjvg1kQ", "review_id": "8UujrPwP3JA0f_xBIhxTrw", "text": "We ordered in for work and it turned out great. The Gyros are not overloaded with Tzatziki sauce, just the right amount..but my favorite the Greek fries. Holy crap, they were nothing less than awesome. A Lemony kick with a smattering of feta...so good. we will definitely go back!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2009-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HvaVgP0S0dFaCbBDIQIkag", "review_id": "QrrqrkEYHopR7OjhfIFF_g", "text": "I got takeout here today and was not disappointed. The soup of the day was Mushroom Brie Bisque...I mean, how could you go wrong with those ingredients?? It was  everything I hoped for: creamy, savory, luscious, yummy. I wish I'd gotten a bowl instead of a cup. \n\nI also got an order of dolmades. Usually dolmades are cold and often very dense and \"rice-y,\" which can be a turn-off for me. These were warm and almost saucy inside, and served with a warm tangy lemon-cream sauce. Delicious.\n\nAnd there was plenty of warm oiled pita bread, nice and moist to sop the dolmades sauce up.\n\nI'll definitely be back!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2009-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "WquqU5s77m7O3-DpkZErYg", "review_id": "QcjqLaIWtp0PmhMKdbAxqA", "text": "This is a solid Greek establishment in the Phoenix area for the lunch crowd.  It's not the absolute best greek food/gyro shop I have ever had, but considering the comparison is with Gyro's on the Island of Santorini, its probably pretty good.\n\nFirst off, stay away from anything on the menu that does not contain the words Spartan and Club.  There you go, now you know what to order.  The Spartan Club is magic in your mouth.  It is two pieces of gyro bread with gyro meat, chicken, lettuce and tomato. Grab some sriracha and spice it up a bit, and there isn't a better combination.  If this beast of a sandwich (dare you to eat a whole one), isn't enough for you, order some of the Greek fries.  They come topped with Feta and Garlic sauce.  They are super as well.\n\nThe only reason that Cyprus Pita does not get the five star rating is that this is all that I have one the menu.  I have had a few other menu items, but I don't venture out of these two any more.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2009-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mqELWLgzXtcQDCxY60Xkyg", "review_id": "MMSf94yGGi8i6jTvpnaOSA", "text": "I ate at Cyprus Grill last night. I have not eaten here for a while due to service. For years the food is always great but the service was not warm and friendly. However I did take out this time. The lady who took my order was very friendly. She was the same person who rang up my order when I picked it up. She was very pleasant and friendly in person as well. I ordered the Chicken Souvlaki Pita. It was fresh and ooooh soooo Yummy. I really have always been impressed with the food. The restaurant was packed and the patrons seemed happy. You can't beat good Greek food that has great pricing....", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2010-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lGttdkKbAeguLNH7c66hQQ", "review_id": "YU2aOseuZdZiYMSAnJzD-w", "text": "Stopped here for a bite after shopping.\n\nFriendly staff, quick service, and reasonably priced.  We shared the bruschetta and hummus.  Then I had the chicken breast pita.  Everything tasted fresh.  The pita bread was warm and soft.  The hummus had great flavor and not drenched in extra oil.  The bruschetta was so simple and yummy, fresh tomatoes over a pesto with a sprinkle of parm on top.\n\nIt was just enough food and really hit the spot.  If I lived here I'd love to come back for another meal. I loved the open air setting, friendly service and great food.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2010-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5_JuHOYNL3skhzxZzPESSQ", "review_id": "D8Ivo7ehw5alAY2piWwYYQ", "text": "Stopped in for a quick lunch. Gyro pita wrap with Greek salad. Service was quick and friendly. Food was tasty and well made. \n\nAs always, a good experience.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2010-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jvwnIG5wEjdOsqkYJgN29A", "review_id": "Ns8YhVoYRE5Cau3szBS1Iw", "text": "Disappointing.\n\nPrices slightly higher than the quality of the food and dining experience should dictate.  Food wasn't terrible, but not good or great.\n\nFood below was for two adults and two smaller children.\n\nHad the vegetarian Appetizer ($11).  It had two sauces, a small stack of pita corners, three fried balls (best part), and two HOT grape leaves (they weren't bad hot, just always had them cold before).  Just okay.  My wife and I love hummus usually, but neither of us cared to finish this.\n\nMy wife and I both really wanted lamb for the main course.  I mean, that's what Greek is all about.  But when we tried to order, we discovered they were all out.  Strange.  I probably would have changed restaurants but we'd already ordered appetizers and drinks at that point.  But that's okay.  Restaurants run out of things.  My wife tried a Gyro meat platter $11, and I tried chicken souvlaki $12.\n\nMy chicken was low quality chicken, fatty, and kind of nasty.  Two tiny skewers.   Probably $.75 worth of chicken.  Rice was mushy, and I couldn't stomach more than a bite or two.  Salad was decent, but just a greek salad.\n\nOrdered a couple glasses of wine, which were warm and tasted like they were turning.  Should have sent them back but didn't.\n\nOrdered the Baklava desert.  It was like a 2\" square type of piece, tasted like I could have bought it next door at Trader Joes.  I expected better/more that I could at least offer four bites to the four people at the table.\n\nDamage, $55 bill plus tax and gratuity.  \n\nHonestly, I wouldn't have paid $20 for it if I could have done it again.\n\nIf you go here, get a cheap sandwich or a salad.  They look decent and fairly priced.  This is probably a good to great lunch spot for a quick bite.  Just don't go here and  expect a nice big meal.\n\nMyself, I doubt I'll be back.  If I do, I'll come back for a quick lunch and order a large greek salad topped with something ($12).  Just too many amazing dining opportunities in Phoenix.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 2, "date": "2011-09-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "JffajLV-Dnn-eGYgdXDxFg", "review_id": "Prb3Kn4sg6TLlUq3ULERVA", "text": "I've eaten here a few times now, and it's a okay. It's a fast casual diner that serves Greek style food.  You order and pay at the counter, they give you a number for your table, and when the food is ready, they walk it out to you.\n\nThe first time I ate here, I carried out a Gyro, and it was awesome.  Tasty, hot, and really hit the spot. The second time I ate here, I got the brusetta.  I didn't like it all that much, and don't know that I would order it again.\n\nthe reason I didn't like it was because of the following.  A) to many tomato's on the brucetta, and they were cold! B) Bread was warm, and to soft.  C) not my style of brusetta.  I like brusetta to be on toasted french bread, and have it be warm all around.  This wasn't.\n\nNext time I eat here I think I'm going to stick with the Gyro since it was so tasty.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 3, "date": "2011-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RBUnZVi666z4JdBfUMkssQ", "review_id": "n4pgMZmTAgg2rLKVEc2yew", "text": "This little place is Deeeelightful! The falafel is truly homemade and the gyros have cucumber! Loved the flavored fries as well, greek and pesto, both yum-tacular! My husband n I will definitely be back, they better get used to seeing these smiling mugs! :D", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2011-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "myqNiZDq6XzJerk8uXkw1A", "review_id": "WMqZCKdxwA1rsnxGyOVaLg", "text": "The food here is fresh and fairly tasty, with decent-sized portions - however, don't believe the hours they list on their website. According to the site, they're open till 10. One night, we drove over only to be told they were only doing to go service that night (which was a bummer, since they screwed up my bachlava and we didn't realize it till we got home). Two other times I've called ahead and been informed they were closing at 9 or even 8. Last time, we ate on the patio, which was lovely, albeit a bit dark. Two guys walked in to be seated and the waitress let them know they were actually closing. When the men expressed confusion, since the site listed 10 pm, the waitress said, \"Well, we don't HAVE to close right now, you can still come in and eat...\" (while she continued stacking chairs up on tables). Nobody wants to feel unwanted, guys - pick your hours and update your website.\n\nThat said - the Greek fries are delicious if you love feta (and boy do we love feta). The seasoned rice is buttery and herby, the salads are fresh and generous, and the meat is generally a bit overcooked but still seasoned well. My husband is on a strict gluten-free diet and has no trouble eating here.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 3, "date": "2011-10-25", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "lswvZjM9RUNmmJAwQlAJ0w", "review_id": "PHFUsctyvXzzv1qRCWWcdw", "text": "We definitely enjoy eating here.  What we DO NOT enjoy is being called \"guys.\"  My wife and I are both well-beyond 60, and DO NOT enjoy that level of casualness from anyone.  The dark-haired waitress, dressed mostly in black,  kept asking \"are you guys\" this and \"are you guys\" that.  If I had a dollar for every time that she did I could have paid for dinner.\n\"YOU\" is both a singular AND plural word.  \"You all\" would be OK; ditto \"you folks.\"  But 86 \"you guys\" --or worse, \"youse guys.\" --JDH", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2011-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FUVASu5zDmcRyNU20ZEk7Q", "review_id": "Lx-JIDIR8qXjZvrgLrL0HQ", "text": "This is a lovely place! The food is tasty and reasonably-priced, and the vibe is great.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2012-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bGjGAC_emJT3hWySi05QXQ", "review_id": "HaKNcKYRWvBmGjN3JXcSjA", "text": "Wow, I have become a huge fan of this place!  They have the best Chicken walnut salad and calamari.  The service is ALWAYS amazing!  My favorite healthy treat after a workout.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2012-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qMD19RQYvhsqTYir3vlARQ", "review_id": "zmOWyp12i-WfbqUeqF8iYQ", "text": "It was a little difficult to find, tucked into a shopping center. Look for Trader Joes - it's nearby. \n\nThe spinach and artichoke dip is AMAZING!  I think the best I've ever had!  I got the lamb gyro - I wish I had gotten the falafel though.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2013-09-12", "type": "review"}
{"votes": {"funny": 1, "useful": 7, "cool": 5}, "user_id": "vwLmvuSyt2qervMRFennHw", "review_id": "duAb_S9ttJkkNG0nFnuM6Q", "text": "My wife and I came here for lunch. This is a great place if you want to eat healthy. It is located in the Town & Country Shopping Center. I haven't been to the Town & Country Shopping Center in 15 -20 years.\n\nWe were greeted by our waitress Rachel. She took our beverage order and allowed us time to look over the menu. We decided to start off our meal with an appetizer of Spinach and Artichoke dip. It was outstanding. \n\nFor our entrée I got the chicken Souvlaki Dinner / kebab plate, which came with a generous amount of tender and flavorful chicken breast on two skewers. It was served with rice, pita bread and a Greek salad. The salad consisted of chopped cucumbers and tomatoes with a generous amount of feta cheese.  I also got a side of dolmades. The grilled chicken was moist, and tender. I was able to cut it with a fork. It was surprisingly good. In fact it was much better than some Mediterranean restaurants I've tried. The Dolmades were excellent. Plus the Tzatziki sauce was superb.\n\nMy wife Carol got the Pork Souvlaki Dinner / kebab. It also came with a Greek salad, rice and pita bread, which she enjoyed. I tried some of the pork and it was delicious. Tender pieces of pork on a skewer marinated and grilled to perfection. Both dishes had lots of flavor.\n\nFOOD: The food is deeeelicious AMAZING delicious . When I say \"amazing\". I definitely mean it.  PRICE: Very reasonable.You get a lot of food for the price. SERVICE:  The service was superb.  AMBIANCE: Low key, nothing fancy, but comfortable.   CONUSION: If you're looking for a fancy restaurant with fancy service...then forget it. If you are looking for amazing Middle Eastern food and absolutely friendly service...welcome home. What a wonderful experience. RETURN  FACTOR: 100%\n\n************************* What does my OVERALL rating mean?*************************\n\n5 stars -Highly recommended.  I would be willing to drive out of my way to this business. It is that good. This place represents their industry or cuisine very well! \n4 stars - Highly Recommended. I would frequent this business. \n3 stars - Not that good but not that bad. Just average. I wouldn't mind going again if a friend or family member wanted to go. \n2 stars - I would not recommend this establishment to friends or family. \n1 stars - DO YOURSELF A FAVOR AND DO NOT patronize this business. I would RUN AWAY from this place and you should too! DON'T WAST YOUR HARD EARNED MONEY AT THIS ESTABLISHMENT!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2013-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DGTip0-KD3Rr39Oafz3ncg", "review_id": "enNNvDkG8d329i8i90gCZw", "text": "My 4 star rating is based off of my usual order, which is the Chicken Caesar Wrap (not to be confused with the chicken caesar PITA - you wanna get the WRAP because they use the thin lavash bread.)\n\nI always get dressing on the side, although their caesar dressing tends to be lighter than most I've had anywhere else.  \n\nPlease do yourself a favor and order this if you have never had it.  And eat it when it's hot - the perfectly thin lavash bread is crispy and chewy and I promise you they do not skimp out on the ingredients - the inside is brimming with perfectly grilled chicken breast, lettuce and croutons.  \n\nThey also have wheat lavash if you're trying to be all like, healthy and stuff.  \nAnd the girls who are usually at the counter are always sweet and gracious.  As if the hot az weather + lunch traffic doesn't make me want to punch babies already... it's just a nice change :)", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2013-10-02", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "GPI930zIvXhi5I0gvkAa7Q", "review_id": "coTFVkzNCYQnY2Ac6Y0YLQ", "text": "I've had a gyro hankerin' for months and Cyprus Grill did not disappoint. In fact, I was so pumped about it that I went into work and shared the good news and one of my co-workers ended up going on their lunch break.\n\nI went in around 1pm on a weekday and ordered a gyro pita with fries. There were a few other customers at the time and I ended up waiting less than 10 minutes for my order. Not bad. After I placed my order I regretted not getting greek fries, but when my food came I was not disappointed. The fries were excellent how they were and both them and my gyro were fresh. Next time I may get a side of tzatziki only because I like my food a little saucier than it came, but I have no complaints. \n\nThere was one girl working behind the counter taking orders and when I waited I noticed that she must also clean the dining room. Since it was after the lunch rush, there were a few tables that needed to be bussed but she was still busy with orders. It would have been nice if she had some extra help.\n\nThanks fellow yelpers for coming through on this one. I work in the Town & Country area, but because I don't pass this part of the mall I would have never realized that it was here.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2013-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GioHSTR_ypwUnYQarp2ymA", "review_id": "DYVlI7vfQOf5n1D8W2eoSg", "text": "One of my favorite places for Greek good. Chicken pita sandwich is delicious! I'm in love with the their Greek fries!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2013-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Xe3roFVZWGe1ABkuhN9UCg", "review_id": "l3z5CdGGJxQwwIQP9FinQA", "text": "The Greek fries are good. Ripe salad was ok. Veg wrap was a oversized tortilla with bigmac sauce and a 1/4 cup of veggies. Gyro pita was dry so tried to cover up with taziki sauce but it wasn't that good and kind of thick.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 2, "date": "2013-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nwZZVUv0t-Dr5ockZ32AGw", "review_id": "OR-Lb_KNopC8V90eWKJ5ZA", "text": "I love Cyprus Grill, we order for the whole salon at least once a month. \n Greek fries good stuff", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2014-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "CVssZgB_DM2KncaDgu2Uyw", "review_id": "wPov2aU_Zo_oF_ZFfJv5Yw", "text": "Today marks my second time visiting Cyprus Grill.  I must admit I was a fan after my first visit.  The first time I thought I'd stick with the basis and ordered the gyro.  I told the really nice lady behind the counter this was my first visit and she insist I try the Greek Fries.  man I'm glad I did!  Portion are just right, perfect about every everything.  I really, really like the fact that the gyros are made with roasted beef and lamb.  Yumm!\n\nToday for lunch I tried the chicken soulaki with a side greek salad.  Just as yummy.  I couldnt finish the entire meal the first time, the chicken and salad obviously was a lot lighter.  Filled me up without feeling stuffed or hanging leftovers.\n\nI'm a fan!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2014-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uj94uvIwTrhE72OyTcPKAQ", "review_id": "mDaSiRuu-wEGkPz6fILhyw", "text": "Was craving a gyro and decided to give this place a try. Had a couple gyro sandwiches and Greek fries (I was starving don't judge me) the fries were good not as good as everybody on yelp was saying but good. The sandwiches were pretty damn good. The servers were nice and it was fast. I'd definitely go back", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2014-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uCKjpv_mGn5fscJ4_oNySQ", "review_id": "WNckaJc2ZPdl6PW44KEB5Q", "text": "Tried to go, they were closed an hour early with employees outside drinking. Not impressed.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 1, "date": "2014-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a9b19C2CQefpbcS9JJBa9A", "review_id": "D32vB43HVOxSCQl3kpe-og", "text": "CLOSED!! :( So sad this great little place is closed.", "business_id": "cvb__rYMkj4BMhC3p_FB3Q", "stars": 4, "date": "2013-10-03", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "HOleI3jz1MLNUJ6cc1x0Pw", "review_id": "vXP9nPMzpXUnJnsEpc_l0Q", "text": "I have to fall somewhere in the middle on this place. Elie's gets high marks for being a family-run establishment and for having super-friendly and likeable service, but  it falls a little short in the food department. \n\nI can walk to this place from my work, so I decided to do just that one day last week. Alicia B was definitely right when she said that this place is \"dinky\" - the flooring is old, the tables are dingy, the bathroom is passable, and the \"decor\" consists of a few potted plants and some framed stock pictures of Greece. I might forgive the extreme lack of atmosphere if I felt that the prices were reasonable, since that would mean that the owners were skimping on style in order to provide a high-quality product. \n\nUnfortunately, the food doesn't quite deliver, especially given the high prices. I really wanted to order one of the vegetarian combo plates, but the cheapest one with falafel (plus hummus) was $7.85! That is really steep, in my opinion. If I had wanted to add baba and tabouli, it would have run me $9.10. Because this felt high, I ended up getting the falafel sandwich for $5.59. It only came with lettuce, tomatoes, and tahini sauce, so I ended up adding green peppers for $.45 (a bargain compared to the $.99 they charge to add tomatoes). \n\nI waited 10-15 minutes for my food, which I understand given that there was a steady flow of eat-in and take-out customers. When the sandwich did arrive (with a smile from the again very friendly owner), I enjoyed it because I was starving, but again, wasn't all too impressed. The pita was very large but very dry, and it definitely could have stood to be more moist. Similarly, I found the falafel overly dry and crumbly. The tahini sauce was decent but not as subtle as some I've had in the past. \n\nFor $8 or so, I got a filling falafel sandwich and a large Diet Coke. I definitely prefer the $2.99 falafel sandwich at Al-Hana, although the uber-convenient location of Elie's may mean that I return a few more times. I will definitely update if I go back and try something more on-point.", "business_id": "ejfy33R1avFm7oygL34uQg", "stars": 3, "date": "2008-11-17", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "mMSWtsCiMkzGtd1aMhh5VQ", "review_id": "vKsat6ZIAfp68h17pZ8lKg", "text": "This is a small place that clearly show the love of the owners.  I found it to be spotlessly clean despite having older furnishing and decor and the food is made one order at a time.\n\nThat means it's a dollar or two more than the chain places like Shlotskys and Subway that're on the other side of Thomas Road, but the quality of the ingredients is like, 200% better.\n\nNext time I need a fix of good Greek / Eastern mediteranean food I will be back for sure. Their tzatziki is just perfect - cooling, yet hot at the same time from generous amounts of garlic.\n\nThey do commercial catering too, so if you're looking for a office lunch that's different, definitely give them a try.\n\nAnd don't forget CASH ONLY means no debit cards! BTW That's a shout out for the dude who came in behind me who said \"what, not even debit cards?\"", "business_id": "ejfy33R1avFm7oygL34uQg", "stars": 4, "date": "2010-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "OmkjKahBeUd0xb_d9ljCxQ", "review_id": "_lZfw3fgJmVcl75l2LHPBg", "text": "Wow -- what a find!  We thoroughly enjoyed our leisurely Saturday lunch at Elie's.  The food was delicious and filling, and he owner / chef was friendly and nice to talk to.  We had the chicken gyro with feta and the classic beef gyro.  The roasted veggies on the gyros added flavor and nutritional content.  The pitas were extremely soft and fluffy.  You must try the hummus -- it's homemade and fresh with a bit of lemony taste to it.", "business_id": "ejfy33R1avFm7oygL34uQg", "stars": 5, "date": "2011-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "2JelnbQWLLw8oH0p8dNO_g", "review_id": "rFbNTNfpk3Bgm4z63qqTgw", "text": "Just about now you are wondering are these reviews for real.well they are the food is first rate. It was just delicious. The brother and sister that run it are proud of their business and they have a right to be the food is first rate. They have been in the food business for 30 years and they care about what they do. They shop everyday themselves no deliveries because they are so particular about the food they serve. The place is super clean and they have an outstanding inspector rating. Best of all their 90 year old mother was still working taking pride in what she does not because she has to because she wants to. I am sorry we did not get here sooner, don't be sorry yourself go have some of their food.", "business_id": "ejfy33R1avFm7oygL34uQg", "stars": 5, "date": "2013-10-18", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "uDa5XWxHEpetG6Io2A1p-w", "review_id": "lIoUcqFzlPoghEOlvfFnQA", "text": "Tired of big chain restaurants while visiting Phoenix for an annual conference, I trusted reviews on Yelp and found my way to Elie's Deli. I am eternally grateful that I did. This little unassuming small shop might serve the best gyro I've ever had.... And believe me, I've had a ton of gyros. It's one of my favorite sandwiches. \n\nSince it was my first time here, I went with the beef gyro lunch combo. They also serve chicken. Nedda (sister to Elie) was sweet and included a side of her delicious made-from-scratch-daily hummus and pita quarters. All of the food was quickly prepared by Elie in the kitchen and it was served so fast I hadn't even had time to take two bites of the tasty salad Nedda have me as the side to my combo. It's incredible how such simple food can be elevated by super fresh ingredients and the deft hand of a cooking master. Both of these things are found at Elie's Deli and it shines in their food. \n\nYou also know a restaurant is special when the owners know most customers (who walked in during the duration of my visit) and call them by name, inquire about families and work, tell jokes and laugh together. Elie came out from the kitchen and chatted with everyone in the dining room for a few minutes and brought people's lunches out from the back himself. That kind of personalization transforms a simple lunch into a community experience. \n\nAnd to be clear, the menu is much more extensive than Mediterranean food . You can dine-in or take-out. They have American style deli sandwiches and burgers too...some things I'll have to try the next time I come to Phoenix. Maybe. If I don't get the gyro again.", "business_id": "ejfy33R1avFm7oygL34uQg", "stars": 5, "date": "2013-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kJyR4gT1pfCcNjEY9-YMoQ", "review_id": "P4gto3wxalZkcUwlQNcx6w", "text": "Great lil mom and pop joint had the chicken gyro and salad. Salad was fresh and crisp gyro was tasty", "business_id": "ejfy33R1avFm7oygL34uQg", "stars": 5, "date": "2013-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hcctCQy3bdZMezrUKkZLtA", "review_id": "L6HzgOYIhBmrn9exQ8atCw", "text": "We stopped here after my fiance picked me up from the airport since I had the usual exhaustion/hunger combo that, for some odd reason, always comes with traveling. It was a little late in the evening so I thought I was going to have to settle for fast food. However, Saba's was in the same plaza and it happened to still be open. When we went inside the place was empty and the hostess said that they were only taking to go orders at that time. It was disappointing for only a split second because we decided that it would be even better to veg out on our couch...thus satisfying both the hunger and exhaustion aspect.\n\nWe were pleased with the menu choices which took us a bit of time to decide. We both went with combo plates so we were able to taste a variety of gyros, shawarma, falafel, babaganoosh, hummus, rice and pita bread. Once we arrived home and plopped ourselves onto the couch with our very full and heavy to go boxes we dived in and proceeded to enjoy some damn good food. I had to stop myself from devouring the entire thing so that I could have leftovers for lunch the next day...which btw were just as delicious.\n\nThe fiance and I have decided that we are definitely going back whenever we have the craving and will probably take our friends/family there when they come visit.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 4, "date": "2010-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IFU6edSjsMNFRzp_E34pYA", "review_id": "H1C5qcS4vsamAAVEN62_jQ", "text": "If you're looking for the best falafel in PHX this is the place to go.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2010-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Oba6VjQT4Tv1n_hqP-XDCw", "review_id": "-fnsfrkVYzVGnCHnTteRmg", "text": "Their bruschetta is by far my favorite of any place I've ever tried it at. Their lemon rice soup is just as good, and the atmosphere is so cozy and cute, at least at this location.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 4, "date": "2011-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l2sXKm5odDH92zxjCWD-kw", "review_id": "8J3ylzYz3JUZHmxPPcnu9g", "text": "A great place to get takeout. The restaurant itself is nothing much- not a ton of atmosphere. They do, however, have great gyros. Their \"world famous\" gyros are only $5 each. They always taste fresh and they are filling. I also recommend their spanikopita and baklava (the walnut one). Their appetizer hummuses are not worthwhile.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 4, "date": "2011-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "nP2HH7Qe5UtSsjeEH3NZuQ", "review_id": "DR2llSgAArXTaxTiF4HiyQ", "text": "Excellant lamb shank that falls off the bone. I have also had their gyro and is spot on. I little small so you might have to wait on peak times.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 4, "date": "2012-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "AQg9sUF1kMfrOn9FucpCPQ", "review_id": "KhIoejVwR4BOsleIdKiXhA", "text": "I've revisited this place at least three more times for lunch and can confirm my initial impressions are not a fluke.  Excellent service and food!", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2012-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "H4143JZDXy4IZCwZCtEP4A", "review_id": "6k8i_p70pnRDugrbBVqNVQ", "text": "Good 5$ gyro special. Love the fact they have outside seating", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2012-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GvS3UuT9eMhRbezORQiWIg", "review_id": "vcdqRFWTjUSufpt_JcO-hw", "text": "One of the gyros I've had in a long time!", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2012-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yN7AfhOjLelYq-HXMSmP9w", "review_id": "TwaadGSUm96cmJbw8oQELg", "text": "I crave this place and drive from Peoria to eat here every chance I get. Baba Ghannouj is outstanding. I have been coming here for over 10 years.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2013-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-UDZu8sGloFIAIeFBvqK_g", "review_id": "hpslVuhpvo1PbG4LLbiyEA", "text": "Best Mediterranean food ever!  I had the steak pita ($7.95) and both soups (red lentil and lemon rice).  I am seriously hooked.  The soups were amazing. The steak was really good quality.  I didn't expect that for the price and for being in a pita.  The hummus was awesome. The staff was friendly, too.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2013-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6Ol6FsFpOr94qCwWmKKZ0g", "review_id": "AN4emOVLvd7ZpQtOkZ7MIw", "text": "Their food is good but their service is so poor I'm never coming back.\n\nTonight was the last straw. I placed an order to pick - up, arrived to get my order and, after waiting 10 minutes and ringing up my order, they finally told me the food I ordered was unavailable. They did refund my money.\n\nThat's the third time that's happened to me in the past six months. It's the last time.\n\nI used to eat here twice a week. A family runs this place. The old man is grumpy and distant, the daughter seems to go through the motions. The son is friendly, courteous and on top of his game...unfortunately, he can't be there all of the time and the rest of the staff doesn't know how to provide even mediocre service.\n\nIt's hard to give your money to people that just don't seem to care.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 2, "date": "2013-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZNBZzjvG3R5NBwnpKogsng", "review_id": "L50VPuLar8AKv3GYKer1cA", "text": "May well be the BEST falafel in town. Definitely the best I've ever had in the Phoenix metro. All homemade from dry, raw garbanzo and fava beans, family spice mix, etc. The spicy buffalo hummus is great as well!", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2013-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hr-8YBs0xbVdlkHWiIa7kg", "review_id": "BhB2q3X_BA-thEXYTlFDyw", "text": "Fantastic Mediterranean food - I had the chicken shawarma and steak kabob, both were delicious. The baba and hummus were some of the best I've had, and the portions were large. Eating the leftovers tonight. I'm always on the lookout for good shawarma, and this place more than met my expectations.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2013-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "12IboY_kqCaaA1Lok5hsVg", "review_id": "8EjJz-Hht-0k-jpVjy0E6g", "text": "Got the gyro, a little peppery but overall very good. Food came out fast and with the sale on their original gyro the price was more than fair.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 4, "date": "2013-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V3LFcJ2Xk3Ol-rvgCqRY-Q", "review_id": "8TyAIeU8gKR1wGhGOD0ODw", "text": "Stopped for a quick gyro to go, not bad but the cucumber sauce had overpowering garlic added, very bitter and bad taste left in my mouth for hours!\n\nGirl at the register was stunningly beautiful, will return for another try!", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 3, "date": "2013-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kSyETvyqGhEVwNWbCrIX7Q", "review_id": "Qa3sd4El7XQLcIe7o9eeOw", "text": "Service good, we had hummas, gyros, spiced date crumble.... all real good... need to try the flamming cheese next time!...  messed up on a few tables bill.. including ours but got it fixed.  I liked it. . .  my guest was on the fence.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 4, "date": "2013-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XGhnQZppqtycG_aU224_2Q", "review_id": "tz_eRLZAQSdQmjaBHZlp4w", "text": "Great family restaurant. Great service, great prices. They serve generous portions, and very good gyros!", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 4, "date": "2014-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "80gekOIPEZf-LwM6VR8Huw", "review_id": "rsc_LhdMI_ZOXViluIIe2w", "text": "Have been coming here with the family for 20 years.  Family owned and always delicious. I like their mint iced tea and fattouch salad. The sleepy gyro is always great too. My dad loves the falafel pita and my aunt comes all the way from Chicago to have their spicy feta fries.   Try it out!", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 4, "date": "2014-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2PO3T0R0USryRYTdPm1WRQ", "review_id": "0TAPhwZA0493n3z2FcHbkQ", "text": "Terrible food and over priced. I'm happy to pay for just about any price for quality food but $10.51 for a chicken shawarma pita that contains mostly lettuce and yogurt sauce!  I give them minus one star....\nDon't go here unless you want to overpay, leave hungry and have subpar food.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 1, "date": "2014-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "n2NFaYz4lL40wwsWFd05wg", "review_id": "cB3KYVqrIGxm3Oydvso8zQ", "text": "This place was not what I expected, but it definitely has some flavorful bite-worthy menu items. Giving it some flare from and setting it apart from your typical Greek spot. \n\n *** Must Try ***\n\n\n\n* Steak Pita: Tender angus beef it's ridiculously good and melts like butter \n\n* Grandmas Meat Dolmas: Stuffed with rice, pine nuts, and fresh herbs \n\n* Red Lentil Soup: Not just your typical Greek lentil soup, they add a little kick making a delicious subtle spicy tomato herb  soup \n\nBon Appetite", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 4, "date": "2014-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VEzLvdCOlsE1GR3anBomGQ", "review_id": "i4VrY6b454-rUs6iMcKp9Q", "text": "One of my personal favourites!\nThe grilled veggie pita and the lemon rice soup are particularly good. \n(The vegetables aren't grilled all that well of late -  so do request for the vegetables to be grilled well,  should you like them that way)", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2014-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WXIcLzcemt_N5J_QsuSqPA", "review_id": "_HdoXgwIP7_V6GK_cU54sg", "text": "Loved the food. Best Mediterranean cuisine in Phoenix. Great service great taste. Lot of options for vegetarians too!!!", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2015-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tmXPFYLUMQSgUdXGbj1MZA", "review_id": "kupcpLv4Rjz8CJ1VooEyqQ", "text": "OMG. Everything here is fantastic! Nice, quaint environment, friendly and helpful staff, and awesome food. A great place to have a quick dinner and a glass of wine. We love it!", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2015-09-06", "type": "review"}
