{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "-u91UNssob3wy6rTu7CYxg", "review_id": "A3_S3iVUGiPokFnrbA10sw", "text": "Worst parking lot in Pittsburgh. Bring popcorn to watch middle-aged, self-important mouth breathers gun their BMWs at one another to illegally park in the handicapped spots .If one didn't know better, one could mistake the parking lot drama for a permanent, outdoor performance art installation (allbeit an extraordinarily douchey one). Snotty clientele, over priced prepared items, no longer have a monopoly on ANY product in Pittsburgh. That being said, they do have a great selection of produce, probably the best in Pittsburgh, but you'll pay dearly for it. 1 very large, organic, honeycrisp apple you ask? Try $5, for real. If you want to sum up Whole Foods, just remember it's a place where you can literally spend $5 on an apple. Also, the CEO John Mackey voted for MItt Romney (http://www.nytimes.com/2013/01/20/magazine/john-mackey-the-kale-king.html?_r=0), so if you think you're shopping in a mecca of neo-progressive, pre-utopian bliss, think again.  Waste of time AND money overall.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 2, "date": "2010-11-06", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "iSJLdur495--oPDE0b1Vpw", "review_id": "412fVoWC9LbmmeycvBpYPg", "text": "Yes I am a fan and yes I am Shadyside yuppie. Judge me if you want. \nI love everything about WF and it is my go-to grocery store. I try not to give my business to GE. WF's hot bar has fed me many many dinners, in exchange for money of course. However, that is what I call money well spent. I agree with the other reviewers that the parking lot can be a little crazy, but I live around here, and it's the norm. I am just glad that there is a huge double decker parking lot. Also, you can always park farther away and not have to deal with the mess. It's good for health! The produce is fresh and for regular grocery you have a wide variety of healthy choices. The cherry on top is that the staff is always friendly, super helpful and happy!", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 5, "date": "2011-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6d_pkl9xS8njBmA0CT3Y0w", "review_id": "PfgFAyTQnCy5AQQzAo2Epw", "text": "Now with two new bee hives along the rail line as of July 2012 managed by burgh bees of Pittsburgh", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 5, "date": "2012-09-02", "type": "review"}
{"votes": {"funny": 4, "useful": 1, "cool": 1}, "user_id": "2Tn2rU-BDlwSaZRkjKoL8Q", "review_id": "ym8k2x6CncHqAYUwHO2HbA", "text": "NO WI-FI.  Just FYI.  \n\nWhen I lived in Cleveland and my first (truly terrible) apartment had no wi-fi Whole Foods was my second home...I would buy a little sampler of buffet foods and salads, a coffee, maybe a vegan cookie, and park myself at a booth for an hour (or more, let's be real).  After I taught a yoga class.  I know, I know, I'm such a white liberal yuppie, it's painful.\n\nAnyway, so when the internet went out at my Pittsburgh home I trotted off to Whole Foods, bought some food and a coffee...and asked about the wi-fi.  \"We have it,\" said Cashier #1.  \"It's probably just under \"Whole Foods.\"\"  \"We have it,\" said Cashier #2, \"but I don't know the password - ask customer service.\"  \"We don't have it,\" said Customer Service, \"go to Starbucks.\"\n\nBelieve it or not, Starbucks is letting me drink my coffee & eat my vegan cookie and didn't make me buy anything.\n\nNO WI-FI.  Otherwise, this Whole Foods is pretty good.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 3, "date": "2012-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9qb5QEk7HyhGG3hVJCMDOg", "review_id": "N-y0iIXo25S2V2OLWJo91Q", "text": "I love shopping here. The staff is really nice, no attitudes. Even the other shoppers are kind. It's always nice. Thanks to everyone for making Whole Foods a nice shopping experience.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 5, "date": "2012-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E62SZVU_FsbCYaVnMRs4TA", "review_id": "TPzWBWrZcnb7jKFfMhrMSA", "text": "Whole foods!! What a great idea. Foods that are natural and organic and wholesome to bet. This store offers a lot of brands and varieties of food. More than the national brands. \n\nI love how when you first walk in the store, your automatically thrown into the produce section no questioned asked. The store is practically laid out to help you make the best food purchasing options available.\n\nThey have more organic foods than any other store i've seen. Everything looks so fresh and plentiful. They also have conventional (non-organic) items that are usually shipped locally and not from across the country. Tons of options from Bok Choy to avocados to seasonal fruits. They have a fresh seafood counter and a meat counter with ratings on the meat from one to five. There is also a deli counter with fresh pasta salads and side dishes made in store. \n\nI recently started a gluten free diet and this store meets all my needs from bread, buns, cereal, crackers, basically all the common wheat products. I've substituted out a lot of wheat products like flour and instead use rice flour, regular milk for almond milk, things like that.\n\nMy favorite part of the store is there hot foods and salad bar. They make all their dishes in the store and sell them for $8.49lb. The hot dishes are amazingly good. The last time i went i had green beans with red peppers, cajun sweet potato wedges, sauteed mushrooms, curry tofu and purple cabbage. Man was it delicious!!!! Plus the salad bar has over 40 options to put on top of the salad!. With so many choices including the bakery, how can you miss out on this great place. It caters to average diets and changing diets too!!!", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 5, "date": "2013-09-27", "type": "review"}
{"votes": {"funny": 11, "useful": 20, "cool": 18}, "user_id": "pKh4Pc96YbOg-6hBOOajAA", "review_id": "eKWJd454IVXKoLfk_emRoQ", "text": "Not counting price I like this store and the service. \nMy favorite, a fellow I call Scotsman the meat counter man. I don't know if this gentleman is from Scotland or not, but his language reminds me of one I know. But the key distinguishing factor for him is his superb service and great attitude. He is just  short of your personal butcher. He takes his time with you, and he does not rush you on. Listens, gives advice and is extremely helpful. When necessary he will look in the back to satisfy your request . He alone could keep me coming back. Oh, and also the meat counter is excellent overall. Great selection,  and good cuts.\nWhat else, well the cheese section is outstanding, the prepared foods are plentiful and tasty. I like the baked goods also. Another nice feature is you can eat right there, which I do sometimes so I don't food shop when starving, which always costs me more somehow.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 5, "date": "2013-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qkVi1ego30vr8P4UWi1tHg", "review_id": "DAFXrB5fyZypCb-XrkyAcQ", "text": "The produce here is always fresh, the cookies by the pound are delicious (especially the caramel wafers!) and they are a much more comprehensive grocery store when compared to Trader Joe's. \n\nI would avoid going here in the afternoon on weekends though...too crowded.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 4, "date": "2013-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "NAuxIS2u6eaC175SbE7TcQ", "review_id": "T4_9lPfnwl-EwjlksjuFog", "text": "This is a very well stocked Whole Foods in Pittsburgh. I am quite fond of their vitamin and natural beauty section, it's not something you'll find in every grocery store. Their prices on Garden of Life vitamins are the best I've found in the city.\nYou walk in to their lovely produce section. I really like the way the fruits and veggies are stacked, it's different. \nThe staff is super helpful and will walk around the store to find the answer to your questions.\nWe often find ourselves there at lunch time visiting their hot foods and salad bar. The prices are fair for high quality foods.\nThe one awful thing about this location is the parking lot. There is not enough spots close to the building, and no one wants to walk all the way from the garage when there's nowhere to put your cart after you load your things! And the drivers! Oh, the other drivers. They will wait f-o-r-e-v-e-r for someone to vacate their spot. No matter that they're stopping traffic out on the road! I always have to psyche myself up to go there and deal with the parking situation.\nBut when I go, it's well worth it.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 4, "date": "2013-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aJf2Efw3pilH26zmSn2lPw", "review_id": "K4ZxPgSFMgNKBsTxiwn5Sg", "text": "Just wanted to write a review based on my experience today.\n\nEverything I went for was in stock today (which doesn't always happen). The place was crowded, as usual, but the line went fairly quickly. On my way in, I saw a $5 fish sandwich with creamy coleslaw advertised outside. Three guys were there cooking. Looked and smelled delicious, so I paid inside with my groceries. When I came out, I told the guys I bought one. They were really nice and asked me what kind of bread I wanted and what I wanted on the sandwich.\n\nSome lady that was \"in a rush\" was upset her sandwich wasn't ready when she came out (but they explained the fish was cooked, but they couldn't set up the sandwich without knowing what bread or toppings she wanted). Just watching the way they dealt with this customer was great for me. The guys were so friendly and patient.\n\nAlso, the sandwich was delicious! The coleslaw was also awesome! Yay! I am so happy I stopped by when I did.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 4, "date": "2013-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "C3MHaW2n0GBi5l5TcZuZPA", "review_id": "enWLsxACY6BciN1nJO9Ehg", "text": "My expectations for Whole Foods Market had been established as was growing up in the DMV (D.C., MD, VA) area. Thus, very fresh produce, high-quality meats, diverse cheeses, expansive bulk section, novel food items, exceptional food bars, and excellent customer service were essentially a given. On the other hand, I also expected parking difficulties, even at stores with multi-story garages.\n\nThe Whole Foods Market in Pittsburgh is not much different from those in the DMV area. However, the parking is horrendous! Really, a medium-size private parking lot for the only Whole Foods Market in the Pittsburgh area right along a congested major road? Let me say that Whole Foods Markets in D.C. are also close to major roads, but they at least have underground or aboveground garages and fairly decent road infrastructure to accommodate for the influx and outflux of shoppers. I would love if the Pittsburgh store can build a garage of some sort (I'm not counting the garage next to the Starbucks and Walgreens) with smooth entry and exit so as to prevent a mini-gridlock along Centre Avenue.\n\nParking situation aside, the Pittsburgh store does live up to my expectations established from the DMV stores. You will rarely find a bad apple (no pun intended), and the store usually keeps shelves stocked (except when there is a major sale or promotion going on). Now, if only its prices and my budget could meet halfway so I could frequent this store more--via bike or my own two feet.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 3, "date": "2014-09-14", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "dlYoo0XYiHrp7LDCfROtiQ", "review_id": "cvHhisK3xWCb65K4aadjQQ", "text": "I seriously don't know where to begin. Oh yes, I shall start. Ladies, DO NOT ever go there hungry, or on your period that has your horns out due to the most beautiful thing we get \"cramps\". First off the parking will make you want to rip your steering wheel apart, and throw it at the person ahead of you that got the last parking space. Parking is MADNESS!!\n\nThen after you find a parking spot from doing bumper cars with other non-driving asses. Here comes another traffic jam (carts, and people). The space in there is one big box. Geez Louise. \n\nI cringe when I have to go there to get an item that only WF carries. But I like how they trap me with their delicious fruit and vegetable display as soon as you walk in. It's a war zone in that area. I can understand organic being more expensive than conventional, but why oh why is their conventional JUST AS expensive as their organic? REALLY?!?! So every time they get me with their fruits, veggies, and the only place that I have found to sell skinless drumsticks, along with 2 or 3 more items. My bill is ALWAYS 90.00!! OMG!! I only got 1 bag of groceries!! The fruit that sells by the pound be like 8 to 9 dollars. I just can't. \n\nOn a more positive note. The employees. They have always been so great to me. Always greet me with a smile, and if I have an item that has a coupon, they go out of their way to get the coupon so I can save (lol at save) oh my haha. But yeah, the employees must be getting paid good, because they smile, and always happy to help me.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 3, "date": "2014-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KOrggEZ4aa7JzVIuY-Zgkw", "review_id": "I1lDdLANc-2wbEoGaO951g", "text": "I will start by saying this review is for the hot bar and I must of gone at an off hour for the hot bar and by that I mean during the dinner rush before they replenished it. I would say everything I got from the salad bar to the hot bar was good apart from they had run out of soup/special of the day and the chicken was beyond dry, the time I spent in the dessert was a wet oasis compared to the chicken. I just feel that for the price I paid it was not worth it. I have been to a smaller whole foods with a better hot bar and to the one in New York City and remember it being great. I only give this one 3 stars because the Mac n cheese and vegan tofu loaf was rather good. But I must repeat myself about the price. For what I got it's way to much. It's hard to justify paying that much when I could make it for 1/5th the price at home. Now I know I don't have to cook or clean and that's the point of eating out but I could also go to trader joes get a few frozen meals and eat for over a day for the price of one hot bar meal from whole foods.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 3, "date": "2014-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lAqoz5QTFxp3GDfpq0McRQ", "review_id": "0f2dBsqCrCIvqBBTIYKj3w", "text": "I know what Whole Foods has done for the area and for that I'm forever grateful.  They came into a dicey neighborhood and brought their awesome healthy food and fun staff and East Liberty blossomed around it.  \n\nBut that parking lot.  Good Lord it's like playing bumper cars.  And from the YouTube video where the guy sings, \"It's getting real in the Whole Foods parking lot\" I realize that Pittsburgh's Whole Foods is not special - this is a common problem.  Small spaces, not enough parking, too many people driving through fighting for a spot, yeah, it's a mess.\n\nIt's almost always crazy busy in here.  I believe I'd come more often if the shopping experience was calmer.  But because of the insanity of the parking lot and the hectic shopping (people everywhere bumping into each other)  that takes place inside, I truly limit my shopping here.  To like once a year. But when I do venture in I think they have a fab hot food section and great sushi.  Some pretty tasty baked goods as well.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 3, "date": "2014-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j2UOrL-m5tvtqKXV4-RkYw", "review_id": "b7P5nd_h0pPRXgen24iqKA", "text": "Yes, the parking lot in crazy. Yes, the prices are outrageously high (it's not called Whole Paychecks for nuthin'). Yes, the store is small and usually crowded and the majority of the people who shop who here completely unaware they are NOT the only people on the planet. All those things aside, I love Whole Foods. Most of the issues can be handled by slight changes in habit. For instance, park farther away instead of circling the GD parking lot for the closest spot!!! I get so sick of people complaining about that damn parking lot when all you have to do is park by Walgreens and walk. Seriously, the walk won't kill most of us. Stop being lazy. (Sorry, for the tirade; that's a pet peeve of mine). \n\nThe produce is fantastic, always. And not just the organic stuff either. The regular pesticide-laden produce is great. The quality of the meat department is second to none. Now, the bakery is a little 'Eh' for me. The muffins and cookies and cakes always look De-Lish!, but they aren't. Usually to dry or dense or flavorless. It really doesn't matter because the star of the show is...\n\nThe HOT FOODS BAR. The quality and taste of most of the hot foods/prepared foods bar is unbeatable. I lovelvoelove the breakfast bar. My dream weekend starts with waking up and taking a nice long walk, stopping for coffee then heading on to WF to pick up Eggs Rancheros Burritos and Sausage patties from the breakfast bar. I may get creamed by a bus the second I leave, but I will die happy. \n\nSome of my other favorites are a Vegan General Tso's \"chicken\" that has the BEST real chicken texture. It's really good! The mozzarella pasta salad, Sicilian cauliflower and the egg rolls which are seasonal. Don't forget to check out the packaged hot foods across from the salad bar; same stuff but pre-packaged. \n\nAs a note though, the chicken fiesta soup is nooooot good. Bland with a capital B! In general the soups are hit or miss, but a real hit is the triple squash or Butternut squash, something like that. It's next to sushi. It's very good", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 4, "date": "2014-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8qjdFatMwwMNgXXUE3ueLw", "review_id": "ohIiuCxRuqQ9hKDEO0CEaw", "text": "I don't shop at Whole Foods that often since it isn't that close to me. There's a Shop n Save a block from my house, so I buy most of my food there.\n\nOne thing about Whole Foods is they specialize in fresh fruits and vegetables.  Their produce is definitely impressive. All of the oranges, lettuce, berries and bananas peppers are perfectly ripe.  They never have spoiled or bad fruit.\n\nThe pastry section is definitely worth checking out.  They have fruit tarts and a lot of different flavored cheesecakes and cannolis.\n\nWhole Foods seems more expensive than Aldi but less expensive than Giant Eagle.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 4, "date": "2014-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p8XfSXyRgjuhF1VFtswRCA", "review_id": "u5LbfFBuH5QBHa0CpeKDHA", "text": "I drive 30 min to go to this particular Whole Foods.  The employees are top notch!  Even when they are busy stocking shelves they never mind helping out the customer.  Even taking time to walk you to the particular item that you've asked about!  I feel some of the prices are better than other local grocery stores.  I really appreciate the explanation of how they label their meats.  I probably get most of my toiletries, meat, and veggies from Whole Foods!!  Can't wait for the South Hills location!!!", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 5, "date": "2014-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-lOEWM9zb-TzsvT4J1tdkQ", "review_id": "rnaqH4MdZuAgDZe9hS98xw", "text": "As a vegan (since 2008) we are a regular at whole foods. It's convenient since we live in Lawrenceville. My one and biggest complaint is that they need to carry more (if not all) organic produce. Not this \"conventional\" garbage. Other than that they have a huge variety of products and grocery items to choose from. Staff is always friendly and helpful.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 4, "date": "2014-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "MSuyK2p8G9hEqyWf5IgnYQ", "review_id": "-aH7MhKH-RTcQ7pBs07ZEA", "text": "I have such mixed emotions about whole foods. I first visited whole foods in February of this year.. In my opinion, it is a little overwhelming at first and here's why. Like most People in the US, I was brought up on all of the \"typical\" mainstream American food brands. So when I walked into this place and barely recognized any brands, it was slightly overwhelming. It took a little research and I still do some research on some products before making a trip. I recommend going online and checking their coupons before making a trip - I tried a bunch of new products that way. I have also googled \"best snacks at whole foods\" to get some more ideas of what to try. \n\nNow here's the sucky part- overall, whole foods is pretty overpriced. BUT I will say that it is not ENTIRELY their fault. They sell higher quality products than your average grocery store. Mostly all of their products are made with the best ingredients and are often organic and gmo free. They are vegan and vegetarian friendly and have tons of options for people with allergies. If companies are spending more money on better ingredients , they are going to have to sell their products for a higher price. \n\nHaving said that, tazo tea for $4 a box is not a sale. I went a couple weeks ago and saw the sale price advertised, did a quick google search and realized target sells their tazo tea for $3.50 NOT on sale. Needless to say I took the trip down the street and saved myself some money for the tea. I also recently wanted to purchase kale chips that I heard so much about (brand is called brad's raw and the flavor was vampire killer)... Until I realized they were $9 for 2 oz ! You can get fresh kale for less than half the cost! \n\nAlthough whole foods can be expensive they aren't ALWAYS that bad. My favorite yogurt, wallaby organic yogurt, is sold here. On a normal day, it cost $1 each. A couple days ago, they were 89 cents each- not bad for organic yogurt. They also have an amazing selection of uniquely flavored chocolates and they are pretty reasonably priced. Justin's organic peanut butter cups are incredible! \n\nThe customer service has  always been awesome in this particular location. I hear that whole foods is very willing to take back anything that you don't enjoy , as long as you have your receipt. \n\nas other yelpers have said- the parking sucks in this location, it's a nightmare. So keep that in mind before you visit. \n\nOverall, when I want to treat myself a little, I come to whole foods.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 3, "date": "2014-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zJQ9S8kZzVEKARfGke7xJA", "review_id": "A-14PE1JjmP5ek3iCKy-hw", "text": "I've been to many whole foods market particularly in CA. I was really excited having a Whole Foods market near my apartment; however, I am really disappointed with this location. The deli (pre-made/salad bar/hot bar) selection is limited and the food is subpar. The parking lot is teeny tiny. If I had a choice, I would go to the Wexford location.  Definitely should stop by if you're in the area.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 3, "date": "2015-10-01", "type": "review"}
{"votes": {"funny": 11, "useful": 13, "cool": 15}, "user_id": "bhZ13wN_5lQrKX278AP_aw", "review_id": "u8Sp4hjbETvE8h858AYC4A", "text": "When I travel for work, I often stop at Whole Foods to pick up prepared meals.  I know that I will get a good lunch or dinner, and the price is comparable to most upscale fast food options.    A few weeks ago I was really sick and came in to pick up a cold remedy, lunch, and orange juice.  This Whole Foods is just not quite up to the national standard.\n\nFirst, this Whole Foods is fairly small, but the parking situation is a disaster.  There is not adequate parking, and the kind of people who shop at this particular Whole Foods are the worst people ever.  People will try to run you over in the parking lot to get the last spot.  It's actually pathetic.\n\nThe store is set-up a bit odd, and the employees aren't particularly friendly here.  I felt like I was begging someone to find Sambucus, which just isn't fun when you don't feel well.  However, the cashiers were up to par.\n\nThe biggest kick in the face was the prepared foods section.  At 11:00 AM on a Thursday there was no prepared food set up.  No soup, no entrees.  Just some leftover Oatmeal that had hardened from breakfast and the name tags for the prepared food that would eventually come out.  There are only two small serving stations as well, and a lot of my favorite options were missing, like the mac and cheese.\n\nIf you are just looking to do standard grocery shopping here, then this Whole Foods is just fine.  The grocery selections were pretty standard, and the aisles are wide enough.  This Whole Foods is a big step up from the gross Market District down the street, but the standard is pretty low here as well.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 3, "date": "2015-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yJfGsmy3QzRZeNSIAzdO-A", "review_id": "-i_cI8LepRVsuh1WUtt-6w", "text": "I've read some critical reviews, mostly from others who report coming from more fabulous locations. I live an hour outside of Pittsburgh where Giant Eagle is the only option, and so a trip to Whole Foods is like a visit to the Mother Land, with amazing organic options like sprouts (unheard of where I live). I love love love this Whole Foods and look forward to going, whenever I can get there.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 5, "date": "2015-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4bv6vMepFUDbmga5p6k8Yw", "review_id": "-7PdrKBhHQ_ZSMjMWixkwQ", "text": "Meatless Monday is a great way to raise awareness about vegetarian or vegan diet, which also happens to be the least arduous way to reduce your carbon footprint, save water, prevent ecological pollution, and reduce deforestation, because it requires so much energy to raise animals for food. When we can simply, and deliciously, I might add eat what they eat. 1 pound of ground beef requires 550 gallons of water. I was there on Monday and I had a really good feature dish, with pink rice from Madagascar and tofu, marinated in a ginger orange dressing (delicious) served with kale, carrots, pumpkin seeds, red & green onions, and a coconut yogurt dressing. The young chef was very nice and knowledgeable, and quite comfortable, talking while making my dinner. I paid for it, blessed it, thanked all who made it possible, ate, and it was awesome!  I went back to thank and compliment the chef. He seemed grateful. Then I got a few groceries I needed and left. Thanks to cool chef, and Whole Foods team! I'll be back soon enough!", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 5, "date": "2015-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TpLA3XSBxKXIfvE4ZCcQcw", "review_id": "rO7yfEYkizNE4ydXzI47Aw", "text": "I, in theory, love Whole Foods. I love the produce selection, the cheeses, and the meats. The hot bar is lovely and the bakery pretty good. When I moved to Pittsburgh, I was elated to finally have a Whole Foods I could shop at! \n\nBut the experience is just... unpleasant. Humans in BMW's/Audi's/beat up subarus have turned into vultures, circling... waiting... for the next spot to open up in the impossibly tiny lot. There are no words to describe the anguish of being stuck behind one of these vultures stalking a shopper with a full grocery cart, only to see a spot just ahead, that someone else pounces on while you helplessly look on. It sounds trivial and I get that this is a city, but is this what one really wants to deal with as they are trying to run errands on their day off when there are other, less stressful options near by? \n\nAnd, you know, I think the trauma of trying to find a parking spot remains with the shoppers long after parking their car because people the atmosphere is kind of stressful inside as well. The jockeying for the shortest line in the check out, the pushing people out of the way for the last organic horseradish root... it's about the same as any other urban grocery store but after the parking! Knowing the dangerous gauntlet I must run to get back to my car with my groceries! The prices! It's just not worth it. \n\nAnd I'd be willing to forgive all of this if it were an above average Whole Foods, but it's not. This brings me, at last, to the turkey. I called ahead in late October TWICE to make sure the turkey I ordered would be fresh for Thanksgiving. It was supposed to be fresh. It was labelled fresh. But it was frozen. If I'm going to pay 60 bucks for a bird, it really should come as labeled and advertised. I don't need the stress of hoping my bird will thaw before the big day (spoiler alert... it won't). Especially not after the parking lot.\n\nEDIT: Well, customer service was awesome and they refunded my frozen turkey. I amend to 3*... thanks customer service!", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 3, "date": "2015-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Xc3cunuZI5XGmz8Xhthdvg", "review_id": "EmReW1ysIhpXhgUsPayiuA", "text": "On our way back from DC to Chicago yesterday, we stopped off here since my friend swore by it. One of the best co-ops I have ever been to. They have such a huge selection of products. If you are looking for vegan cheese, this place has a humongous selection including Sheese, which my bud says is really hard to find. They carry my beloved Temptations soy ice cream even in chocolate chip cookie dough. Nummers! I grabbed delicious produce, a spinach and feta & olives-zaatar pie made by Najat's Cuisine, a STILL WARM ginger cookie made there, a raspberry ginger beer, and I'm sure I am forgetting something. I would come here all the time if I lived in Pittsburgh. Their hot food looked good, but I wanted something to grab and go.\n\nFunny thing, in the time that we were there, three people commented that they really liked my tattoos. Then the cashier said he liked my Obama button. I love this place!", "business_id": "-iVcmhjfq79QoTWzrb6pKg", "stars": 5, "date": "2008-09-30", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "p1dOksOeJa2PgZ5RSPNdcw", "review_id": "UY-UfsLAqym2jFRIdcwEmQ", "text": "Just moved here from Baltimore and ran across this place.  Love it!  Watch yourself at the hot bar.  There's no scale (should be).  Your mea l(of veggies, tofu and kale) could end up costing $20 easily.  I usually grab a hot meal and play on my computer 1-2 hours.  Love the carrott juice with ginger YUM!  A small is $4.30 ouch!  Just found out they won't charge you for bags if you bring your own....COOL!", "business_id": "-iVcmhjfq79QoTWzrb6pKg", "stars": 4, "date": "2010-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "p1dOksOeJa2PgZ5RSPNdcw", "review_id": "7rmt7zCaq-wYZ9LrJW2pVQ", "text": "Ooooppss...update time.   Got the regular (steamed spinach and lasagna) from the hot bar on my way to work.   So, I'm on my dinner break sitting, chatting it up with a co worker while eating.  I see something white in the spinach just before putting it in my mouth.  WTF is that!  OMG, it looks like one of those fat ass worms we'd  pluck from the greens in my grandma's garden.  I threw the fork down and my co worker says...\" you're seeing stuff.\"  Um NOT!  I sat there digging through the spinach determined to find that damn worm.  Thirty minutes later  SHAZAM...found it. Ugh, my coworker spread open the spinach leaf.  EEEkkkk, it was bigger and fatter with black spikes poking out.  FUCK!  Call the manager at Co-op and he says...\"Bring it in for a refund, thanks for being so nice about it...We usually just see worms in the fruits.\"  Geez, thanks for that lil tidbit.    This happened last week around the Sept 14, 2010.  Guess that means it's really organic, huh?", "business_id": "-iVcmhjfq79QoTWzrb6pKg", "stars": 2, "date": "2010-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JbpkMEZab8cbshTDXy1OAQ", "review_id": "KYO2Z3dFKAsuktWBZQPwMQ", "text": "this is one of the best health food stores i've ever shopped at. the prices overall are pretty good in terms of the size and type of the store. plus there are regularly sales which help make the prices easier to swallow. the bulk and pre-made food sections are really wonderful, and there is always a good selection of local produce. \n\nthe staff is knowledgeable and very friendly and they give a 10cent coupon for bringing your own bags.", "business_id": "-iVcmhjfq79QoTWzrb6pKg", "stars": 5, "date": "2010-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "k_MOe2ZPz8PrAP5EY3vrZQ", "review_id": "JTBN95lj1R0QRneOvcw80w", "text": "I really love this little place. The hot bar is almost always completely wonderful. I especially love the breakfast/brunch on weekends, it's one of my favorite meals. The potatoes and garbanzo bean patties are amazing.\n\nThe prices are pretty much in line with any smaller heath and local food oriented grocer. I can usually count on them to have specific items that Whole Foods is sold out of and sometimes at a better price. Plus, the Co-op hot bar is a million times better than the Whole Foods hot bar - quality over quantity all the way.\n\nShort lines, great staff, good for Pittsburgh.", "business_id": "-iVcmhjfq79QoTWzrb6pKg", "stars": 4, "date": "2010-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "uNEUDSbFeNL_-ReWEz0PkQ", "review_id": "hg3qqYN8Rcu4UKj4li7i4g", "text": "It's disappointing that you got lukewarm service, Erina.  I've had pretty consistently good vibes (har har--get it?--hippie reference) there from the staff, who've been enthusiastic about helping me find what I need.  Hands down, this place beats Whole Foods for price and general atmosphere, and their salad and hot bar is my go-to when I don't feel like cooking.  Absolutely GREAT bulk section with a wide variety of grains, legumes, and pastas.  Killer cookies and baked goods.  \nOn the other hand--if I lived on my own, I could do all my shopping here.  But, since I don't--I can't.  It's tough to stock a household kitchen solely from the EEFC--I mean, I can't really afford to regularly buy $15 laundry detergent.  \nRealistically, the Co-op can't serve most of us for one-stop shopping.  But it's worth it to put down a few extra pennies for potatoes or juice to support a genuinely community-oriented business.", "business_id": "-iVcmhjfq79QoTWzrb6pKg", "stars": 4, "date": "2010-11-16", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "Iez-mXKbRjv4sZTPKkXSVA", "review_id": "F1OAhUfRyIBDHaUyiyjClA", "text": "Yes.  I love the co-op.  It's one of the very few places in Pgh I've been able to find unpasteurized juice, besides my own counter top.  Because my counter top contains a juicer, which is awesome, but such a pain to clean.\n\nI love getting lunch here.  The onion Parmesan soup is amazing.", "business_id": "-iVcmhjfq79QoTWzrb6pKg", "stars": 5, "date": "2012-09-19", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "O-BUW_59T1yXYXMYdDW23Q", "review_id": "WJXrtBYDG8CrouTmmraavA", "text": "The best grocery store I've been to. Lots of organic fruit and veggies, bulk bins for as far as the eye can see, and if you can't find a type of granola you like then you should give up on granola.\n\nThey basically have everything you need, and you don't have to shop at the chain stores.", "business_id": "-iVcmhjfq79QoTWzrb6pKg", "stars": 5, "date": "2012-09-28", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "P0OyIE-YyLs7YqzEq-376A", "review_id": "fEJcX4GYmhzDmeHa1bKcKQ", "text": "I was visiting Pittsburgh and looking for a throat spray called Singers Saving Grace. Whole Foods didn't have the item in stock but East End Co-Op did! Also, had a smoothie while a shopped. \n\nWhat a great find!", "business_id": "-iVcmhjfq79QoTWzrb6pKg", "stars": 5, "date": "2012-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5gGq73p291r7MPrnMCuQ8g", "review_id": "AZtiUDB2lvDbJXM13cTl5w", "text": "The East End Food Co-Op is a great place to shop and somewhere I frequent reguarly. They have a full selection of products but add a different local flare to things! I find their produce is always fresh and they have a great selection of organic fruits and vegetables as well.\n\nOne of my favorite parts about the East End Food Co-Op is The Co-op Café. They have a variety of soups, entrees and sides to choose from plus a great salad bar. Whether I have time to sit down and enjoy my meal or take it to go they have a little bit of everything and it's all FRESH! This is one of my favorite places to shop!", "business_id": "-iVcmhjfq79QoTWzrb6pKg", "stars": 4, "date": "2013-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "_5DehTLyFIH5kQv18Iv_qA", "review_id": "oaHRRIYdCghklSalIWmb1w", "text": "Forget Whole Foods when you have East End Cooperative! Honestly, this is quite possibly one of my favorite coops. They make some amazing deli items...so amazing that I went back twice during my visit to PA. I was only expecting to have a few options in the prepared food section, but the vegan options were plentiful. Their mock tuna salad was impressive, made with tvp, vegenaise, and spices. The potato salad was creamy and exceptionally delicious. And the vegan pasta salad was also impressive. Generally most grocers fail in this department, but East End excels by leaps and bounds. I can't believe how tasty their store-made food was. The prices were also very reasonable, if not low. If I lived in PA, I'd join their coop and would go there frequently.", "business_id": "-iVcmhjfq79QoTWzrb6pKg", "stars": 5, "date": "2013-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yMZt1894jh7W1NJsg3xBig", "review_id": "YBJPaHr2RipqXUpaQLDg1w", "text": "Great selection, tasty salad bar.", "business_id": "-iVcmhjfq79QoTWzrb6pKg", "stars": 5, "date": "2013-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6rR83Un71x8KWnW9-oJfqA", "review_id": "NuPppLhtkG9OTcUrHPk0tg", "text": "They have a great selection of products considering their size. I would give them 5 stars but they carry bottled water--which confuses me. If they are really passionate about protecting the environment and resources, they should not be selling bottled water, regardless as to how it is sourced.", "business_id": "-iVcmhjfq79QoTWzrb6pKg", "stars": 4, "date": "2014-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ulBPsvKRu42CGJ0_7JS6Qw", "review_id": "pIgDxNcag2Cf8WeLWItiEg", "text": "The co-op is great!  When we had to put our children on a diet free of gluten and dairy, we were lost -- until we found the East End Food Co-op. That was 10 years ago and I've shopped there weekly ever since. It provides for all of our gluten-free, dairy-free needs - and even allows the opportunity to purchase in bulk as a member. I also love buying grains, beans, etc. from the bulk bins, fair trade products and many daily food items like cereals, nut butters, snacks, etc. They now stock meat/poultry from local farms and specialize in Vegan options. Also, have to mention the awesome produce section, stocked mostly from local farms.", "business_id": "-iVcmhjfq79QoTWzrb6pKg", "stars": 5, "date": "2014-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UdgQPhUlHrPWO7x6gwKqtA", "review_id": "FMddX-uzQef_KtE1TW_0yQ", "text": "Great grocery store -- way better than going to Whole Foods. The vegan choices are plentiful in the store and the cafe. Also, CHAO CHEESE IS HERE!", "business_id": "-iVcmhjfq79QoTWzrb6pKg", "stars": 5, "date": "2015-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NkfoKqA0YR2kBCQyYF_ASg", "review_id": "L95Ov5j8yV3F_Rm5pRRVpg", "text": "The sandwiches are great, as are the bakery items. The sfogliatelle is spot on.", "business_id": "imzKM9-mgN1Yk_RIXx3IgA", "stars": 5, "date": "2013-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9jgsCwQR_3gzli7X5E9aTg", "review_id": "FCYyNA9buB5ZZ0zj6GCGjw", "text": "I was treated extra special today at Jimmy & Nino Sunseri's in the Strip\nThank you so much, I feel great!", "business_id": "imzKM9-mgN1Yk_RIXx3IgA", "stars": 4, "date": "2013-10-26", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "2rSeth60_CuWN3ZJ4k41lg", "review_id": "K3GAK2Rtjm7Zs7dfP4aoSw", "text": "I always had a good experience eating here for lunch.  Yea it is a bit run down, but name some in the strip that aren't?  They have $5.00 lunch specials and Jimmy was always very nice and the huge stogies in his mouth just took me back.  Funny.. Highly recommend.", "business_id": "imzKM9-mgN1Yk_RIXx3IgA", "stars": 5, "date": "2013-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "RjTEKl_vizX3CpIecS6FRg", "review_id": "klniYfHNnJNhK5QeAyAQHA", "text": "Pittsburgh Bound!  Part X\n\n(For Part IX, go to: http://www.yelp.com/biz/stamoolis-brothers-company-pittsburgh?hrid=8hA8rRHss2PRlroWujzT_Q)\n\nThe Sunseri name is famous in Pittsburgh, and although their small alcove of Italian meats and bread is one of the smaller storefronts in the Strip, their pepperoni bread is melt in your mouth, filled with great mozzarella cheese.  I grabbed a loaf and we picked at it while we walked around.  My mom and I inhaled half of it without blinking an eye.\n\nIf you are going to get a loaf of Sunseri's pepperoni bread, I would suggest not doing it on an empty stomach.\n\n(For Part XI, go to: http://www.yelp.com/biz/primanti-brothers-pittsburgh?hrid=k97SGRvnhBMrHzqofs1WNg)", "business_id": "imzKM9-mgN1Yk_RIXx3IgA", "stars": 4, "date": "2014-09-03", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "Qs5dcst13DnQJwaBcR4VGg", "review_id": "TjYNh1GbOpUEF3sEtY4TYQ", "text": "This place is the deli you have always dreamed about.  The sights, the smells, the tastes...  Delicious!  The fresh bread is amazing, the stuffed pizzelle's are very good and my wife thinks they have the best cannoli's in Pittsburgh.  Stop in & talk to Jimmy and ask him about Stella the parrot.  This place is a 'must-see' every time we're in the strip.", "business_id": "imzKM9-mgN1Yk_RIXx3IgA", "stars": 5, "date": "2015-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "no5l58Gl30O0ceXGeim06g", "review_id": "V9shTqOCwoIn0lbqYWr-cQ", "text": "The best cannoli, hands down! The ricotta is super fresh, it is incredibly flavorful, and they wait to fill the shell until you order it. Whenever we are in Pittsburgh, I insist we stop by! Today, I also got the atomic pepperoni roll which was incredible! Super fresh and flavorful dough. It has a peppery spread with the pepperoni on the inside. The bread became a little wet on the bottom, but is very good after being toasted! Love this place and the history it embodies from the Strip!", "business_id": "imzKM9-mgN1Yk_RIXx3IgA", "stars": 4, "date": "2015-11-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "mXJS_e-zR68eExLhMrxJPA", "review_id": "pL4AZw3vIeDIOM31hZWbBw", "text": "I use this place for my personal and business needs . Great location and huge selection of candy and tabacco . Buy in bulk or individual items. The employees are genuine and have that no bs attitude that I love .", "business_id": "8BUJXN2fU15kclyTA3KhAw", "stars": 5, "date": "2010-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EeOBT-RohoF3yWAG36dTDw", "review_id": "6YJmev7dcEMVloXCmp82pw", "text": "I come here specifically for boxes of Now and Laters to recall my childhood. They have a great selection of candy and have some rare old school production candy .... Candy Cigarettes any one? A lot of people seem to come here for their cigarettes. I think they also have hard to find brands of smokes. If you have a need for for big packages of candy, stop by fort pitt before the other places.", "business_id": "8BUJXN2fU15kclyTA3KhAw", "stars": 5, "date": "2013-11-04", "type": "review"}
{"votes": {"funny": 4, "useful": 1, "cool": 1}, "user_id": "Wj_qVEYRdQiRNyskyRGSCg", "review_id": "afQnHq3nP90N9F138vu3-A", "text": "This place has been on my mind because I love sea salt and I like dark chocolate and this is one of the only places I know where one can find dark chocolate with sea salt.  They have every kind of chocolate you can think of here.  I think this is a great place to pick up a nice gift, chocolate makes a great gift because who doesn't need some gourmet chocolate to eat or to share with guests.\n\nI was in Mon Aimee last year buying a birthday gift for someone who likes chocolate and this woman walks in and asks \"where's Geno's?\" both the shop keeper and I are totally baffled by this question, but the woman insists that there is a restaurant named Geno's near by.  She finally says cheese stake and food network and I realize she is thinking of Geno's in Philadelphia.  It was pretty funny.  I told her she had the wrong city but that we had something better, and pointed her in the direction of Primanti Brothers, which is just two blocks away from the Mon Aimee.", "business_id": "gFT2yXDXJ1qfuGOSfSU5Bw", "stars": 4, "date": "2008-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "IrEPZ_OUPBgX-IMU1R3LaQ", "review_id": "r-fvUaMlk1TUHrx4oYD8Ng", "text": "The selection is pretty vast -- European, upscale specialty brands (up to $24 for a 3 oz bar!), bulk malt balls in 3 flavors that are wonderful, house-brand hot chocolate mix, and lots more. It's fun just to browse around and know all these choices exist.", "business_id": "gFT2yXDXJ1qfuGOSfSU5Bw", "stars": 4, "date": "2009-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-EQLnldd84cQOPZnfZcjEQ", "review_id": "Oj1C0cV6obs3pDz8S9ClyQ", "text": "In terms of having lots of chocolate varieties and being a fun store to explore, I'd give it 5 stars. I had a lot of fun exploring this store. The prices are a bit too much, especially when I can get some of the same brands at World Market for less, so I'd knock my rating to 4 stars. I ended up buying several of the small sample sizes so as to be able to try more for my money.\n\nHowever, one of the employees was so rude that I'm going with 3 stars. This particular worker walked around with a scowl on her face-not sure why, how can you be that upset while working in such a neat place? Later she was sitting on the ground trying to move some box under a cabinet and loudly saying \"excuse me\" repeatedly to a customer standing by the cabinet who was unaware of the employee on the ground. When the customer finally realized she was the one being spoken to she apologized, but this said employee just moved the box and walked away. \n\nMy husband and I were visiting from out of state and I was exploring the area during his job interview. Since he wasn't able to be there with me I wanted to take a picture to show him this store. I also wanted to send it to a friend who is moving to the area soon. I had already made my purchase and was standing by the front door with my camera. This same employee yelled rather rudely from the back of the store that no pictures were allowed. Maybe people have stolen their business idea based on pictures taken of their store. I didn't realize it was such a secretive place. I had walked into the store so excited and walked out with a negative feeling. \n\nThankfully the other two older woman working were very helpful and polite.", "business_id": "gFT2yXDXJ1qfuGOSfSU5Bw", "stars": 3, "date": "2013-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8rCLmqXdG1V4qCRMJJTr_Q", "review_id": "79EzFBLWLytoYo7-N1CA2g", "text": "Aside from having an incredible assortment of chocolates, they make the best spicy hot chocolate EVER!  You have to ask them to make it, but it is delicious...yum!", "business_id": "gFT2yXDXJ1qfuGOSfSU5Bw", "stars": 5, "date": "2015-10-28", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 3}, "user_id": "hEk0VssowoyeEF2R0ZB-7w", "review_id": "9SGhwXCH0lLKoThoJAiiaA", "text": "I shop in the strip all the time.  I come to Stamoolis for a few things:  feta, stuffed grape leaves, and olives.  They have lots of Greek items, so if that's your thing, you should swing through.\n\nThey have something like 8+ different types of feta (French, Bulgerian, Greek, Greek Barrel, etc.) I didn't know there were that many different types until I came here.  The stuffed grape leaves are my bench mark for grape leaves.  Dilly, lemony, a bit sour, stuffed with rice...I love these things here.  I also get my olives for dirty martinis here...pick out your olives, get them weighed, and then fill up your container with brine and...voila! the best dirty martini brine you can find, for practically free.\n\nThey also have a relatively extensive cheese selection, albeit nothing as compared to Penn Mac.  It's definitely cheaper than Penn Mac though, so if you're looking for smaller quantities, or some more common cheeses, check here first.", "business_id": "tyXvO1G2qK3MUfaap30auw", "stars": 5, "date": "2011-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5LHF0M4yDwo8jABqQrPDcA", "review_id": "IoMAFPB4RJSKgNQtd_iNKg", "text": "Great place. I prefer the cheese here over Penn Mac any day! Plus, the french feta is to die for!", "business_id": "tyXvO1G2qK3MUfaap30auw", "stars": 5, "date": "2011-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JfnlQVCV6GOe59N7eODNhg", "review_id": "niEVoWc8d4qHQiK4Xp5kQw", "text": "I can only comment on the samples that I've had there and the dips that got because of them. The spicy feta dip is delicious and we love their pita chips!\n\nGood selection of products (lots of fresh cheeses, olives, and the like) and knowledgeable staff.", "business_id": "tyXvO1G2qK3MUfaap30auw", "stars": 4, "date": "2012-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "9Ify25DK87s5_u2EhK0_Rg", "review_id": "RUgDUISWTzsM5F1cvaxIFg", "text": "Stamoolis is quickly becoming my favorite place in the Strip District.  I often stop in for things like their amazingly delicious hummus or tabouleh, always at unbelievable prices.  \n\nOn my most recent visit, I noticed a sign promoting gyro kits for $12.50.  This included a pound of precooked and frozen gyro meat, pitas, sauce and two bottles of soda.  What an amazing deal!  I thoroughly enjoyed the gyros and even used some of the meat to make Greek omelettes (with some feta and spinach).  \n\nI've never been disappointed by this place.  I was once in another Strip District store looking for Greek inspired seasoning and found it, but skipped it because it was so expensive.  Fast forward to Stamoolis Bros where I find packets of seasoning for just a couple bucks.  In fact, with each new visit I discover something I haven't noticed before.  No matter what I try, it's always fresh and delicious.", "business_id": "tyXvO1G2qK3MUfaap30auw", "stars": 5, "date": "2012-11-23", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "lvXyx043PaY6_JBQVZj-Zg", "review_id": "WhbfX3NybE381scnNM1qkg", "text": "I stop here every time I am in the Strip.  Authentic Greek grocery.  Do not pass up their stuffed grape leaves or the freshly made Babaganous & hummus.  They have great cheeses and a variety of dried lentils and spices.  You will find something delicious here, I promise you that.", "business_id": "tyXvO1G2qK3MUfaap30auw", "stars": 4, "date": "2013-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "RjTEKl_vizX3CpIecS6FRg", "review_id": "5Of_0ljivxbd5Wlp6rCtlw", "text": "Pittsburgh Bound!  Part IX\n\nI moved to Atlanta in December of last year from Pittsburgh and had yet to be back.  Virtually every Labor Day weekend of my entire life was spent in Pittsburgh with my parents, as my birthday falls within the window.  I promised my folks that I would make a long weekend out of it, and head on home.  The following reviews are a step-by-step account of the long weekend.  Enjoy!\n\n(For Part VIII, go to: http://www.yelp.com/review_share/1uvcySLWM75MzlLM12F8dA/review/6ht1cyxYCAKExjg_Tc_HwQ?fsid=s1rEBoNOZ5ycTbDCtvJrzA)\n\nStamoolis is loaded with Mediterranean and Greek staples that you can't find at the average grocery store.  Even though they have a ton of great oils and vinegars, Greek cheeses, specialty spices, meats, and sauces, I rarely ever buy much here only because I never cook Greek food.  I do however love the premade dips they always have for sale.  I always pick up a few when I'm there, but their Asiago cheese dip is out of this world and great to serve as an appetizer with pita chips or vegetables.  \n\n(For Part X, go to: http://www.yelp.com/review_share/F9IJ3EddoyW89O0DFikPTQ/review/D5UPfn_UbOm4iqfWgSRygw?fsid=X4Q_wJ-wTj91tUUZ_DA3Eg)", "business_id": "tyXvO1G2qK3MUfaap30auw", "stars": 4, "date": "2014-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oKX-QfUJAGekWrlyxdUJJg", "review_id": "eLPLI4r0YvEb7EgukY7rOA", "text": "I wish I lived close to this store. Unfortunately we don't have anything like this in the Phoenix area.\nI could write a ton of stuff about their selection. Wonderful choices, amazing prices, helpful staff and Chocolate Baklava.\nI wish I had more room in my suitcase when I left town. \nI will be back next year looking for more goodies to take home.\nTake your time looking around, you'll find lots to love and try for the first time.", "business_id": "tyXvO1G2qK3MUfaap30auw", "stars": 5, "date": "2014-10-29", "type": "review"}
{"votes": {"funny": 6, "useful": 4, "cool": 2}, "user_id": "AFNTPG5UmvJMuyWM7IPlPQ", "review_id": "HPge_HHujWILw1hwzwPmCA", "text": "Hooray for the Vikings.  Sure they might have looted and pillaged their way across Europe and spawned plenty of bad death metal bands, but in the grand scheme of things that's pretty minor. \n\nWhy? Because without a little genetic mutation spawned in Scandinavia that allows adults to continue consuming dairy all their lives, I'd have to avoid the amazing cheese section that Penn Mac has and would be stuck eating some funky soy based cheese or *gasp* having to do without and that would be a sad day indeed.\n\nWith enough cheeses to make Wallace & Gromit happy, you are bound to find what you are looking at Penn Mac.   And if you don't know what you are looking for the cheesemongers are great in helping you find your whey.\n\nIf that was all Penn Mac had it would still be a required shopping destination, but they have so much more.  Their deli is just as amazing with the best Prosciutto di Parma you can buy.  And If you can't find the olive oil or other Italian ingredients you need here then the only place you are going to find them is back in Italy.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2006-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "bD8d_OiLfZZ1aPMbSVyWlw", "review_id": "jV37dv3GiPskB0acDCHXEw", "text": "Lotsa things to choose form from their extensive prosciutto selection straight from Italy, noodles out the ears, sauces and authentic seasoning/spices for you use and delight. Definitely a great place to go for specific ingredient shopping.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 4, "date": "2006-10-10", "type": "review"}
{"votes": {"funny": 5, "useful": 5, "cool": 3}, "user_id": "0xIQG-NrqMx5id6yJpQp8Q", "review_id": "IaQkERUXkvnUT5KPdAOhJQ", "text": "I walked into Penn Macaroni Co knowing I knew absolutely nothing about cured meats and cheeses.  I've always been intimidated by specialty shops b/c there are always giant lines with people who look impatient and want to just grab what they need and head out.  I decided to swallow up my fear and head inside with the intention of walking out knowing more than when I walked in.\n\nI headed to the cured meats section in the deli room and kinda just stood back staring at all the beautiful meats.  When one of the deli guys was free and asked me if I needed help, I flat out told him \"I know nothing about anything in this room.  But I want to learn.\"  And he was like \"I got just what you need\" and brought out some samples for me.  He went on to explain them to me and what kind of cheeses to pair with stuff.  After I picked out my meat, I was heading over to the cheese counter when he kinda called me out and was like \"I'm not done with you yet!\" and handed me butcher paper with even more cured meats and cheeses to try out.  He also told me I have to feed my friend more b/c she looked too skinny, =P.\n\nI love going into a store where I get individualized attention by someone who actually cares about what he or she is doing and is passionate about his or her job.  It just makes you walk out with a smile on your face.\n\nI plan on heading back every other week to get a new pairing of meats and cheeses and hopefully one day my palate will be super sophisticated, haha", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2009-10-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "hEk0VssowoyeEF2R0ZB-7w", "review_id": "uZDSfP3cJRvlXimh5WvMFQ", "text": "I love this place.  Produce is cheap, but good quality.  The cheese/deli area...holy sh*t.  I was in Europe this summer and their selection rivals some Parisian cheese shops.  Prices are unbelievably low, too!  Lots of bulk spices & grains, homemade pasta, self-serve oil & balsamic...you need to start shopping here if you're not already.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2009-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "10dhZs996tBtJq2nd_mcRg", "review_id": "QRz8yb1mVpZB0KBBS4T9Lw", "text": "four stars for a fine cheese purveyor that doesn't smell like dirty feet covered in barf, after eating mexican.\n\npenn mac has a huge selection of cheeses from around the world, and the 'cheese people' are extremely knowledgeable and willing to recommend and sample.\n\nalmost everything else italian is available here, from fresh pasta, olives by the barrel and homemade sausage.\n\neven if you're not going to buy anything it's worth a walk through to enjoy the sights and smells.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 4, "date": "2010-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "fPHkuVye-RlFgxzmgrCKtQ", "review_id": "MNVSoFG8GuTev_Zi-L4Qqw", "text": "They sell Kinder Bueno bars. If you have ever been to Italy, you would know how awesome that is.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2010-10-14", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "hEk0VssowoyeEF2R0ZB-7w", "review_id": "o3I7ec5ZNr3T2gVnB1ruGQ", "text": "I read my previous review.  It was short & sweet, but perhaps too short.  I want to emphasize how much I really, really, really love this place.  Every time I get stuck going to Giant Ripoff Market District, I realize how much those rat bastards overcharge for everything.  Penn Mac is so damned cheap for cheese, I can see why people come from all over the place to get it here. FYI...my favorite new cheese is Fleur Vert...it's seasonal, but a game changer of a goat cheese.  I paid $14.49/lb for it.  Giant Ripoff wanted $22.99.  Jerks.  Also, make sure to buy ricotta here...it's freshly made!  Be forewarned...you have to buy your cheeses in 1/2 lb increments.  They like me, so when I ask for a small 1/2lb, I can sometimes get lucky.  \n\nSeriously, go here for cheese, fancy meats (they have frickin' Iberian jamon...good luck finding that elsewhere) and random Italian things.  I wouldn't say the prices on everything else is as cheap as the cheese counter, but I heart it here and am sad that they're not open during normal working people hours(i.e. after 5pm on weekdays.)", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2011-09-06", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "rL7tj-6DtdzGpwC6WW1umw", "review_id": "6m92eAkOfLms0lkigDk73A", "text": "Penn Mac is a fun shopping experience. I used to do a lot of my weekly shopping here, but now that I live in the North Hills I've got that can't-cross-the-river syndrome and I only get there every other week or so. It's miles above a Market District, though, in terms of entertainment value and pricing.\n\nThe cheese counter is pretty good. It's not the most amazing selection ever, but it's great for Pittsburgh. For example, they don't carry a variety of aged cheddars or Stiltons, opting instead to offer one or two basic and many flavored versions (with apples, with onions, etc.) They do let you sample, which I recommend; like another reviewer, I've gotten over-old blue cheese here once or twice. They've always enforced the half-pound minimum for me. The fresh mozzarella is great, and I can't resist it when tomatoes are in season. I hate to even mention it, but one time I got home and found... well, a hair in my mozzarella. It put me off for a few weeks but seems to have been a one-time incident (and no, I never brought it up to them).\n\nThe deli has fantastic prices and does proper thin slices, nicely laid out on paper sheets so it doesn't stick together. Daniele prosciutto is amazing, and the domestic is pretty good at a great price. Iberico and Serrano jamon? Yes please.\n\nService at both the cheese and deli counters can take a pretty long time if you go on a weekend. However, I've been able to walk right up on weekday afternoons, and the weekend logjam is kind of fun once in a while.\n\nIn the same room they have the amazing olive bar. I pretty much only buy olives in the Strip. I know the Iggle has an olive bar, but everything I've ever bought from one tastes off in a way I can't put my finger on. Castleventrano olives (a bright, clear light green) are amazing: buttery and briny and fruity with a firm texture. Cerignola are good, and the various stuffed olives on offer are nice if you don't feel like dealing with pits.\n\nI haven't really bought many of their bulk goods aside from Jordan almonds, to which I am shamelessly addicted. They have a variety of pretty colors, as well as the \"seconds\" which aren't as shiny but taste great anyway.\n\nI love the selection of anchovies, tuna and tomato products in the dry goods area. They also have a good variety of hot sauces, though I can't say I've ever seen Pickapeppa there. Full range (I think) of Dave's Insanity, and lots of other brands as well. Important: They do sell Blennd concentrate, which you can also pick up at the Iggle. I have fond childhood memories of drinking Blennd at the KMart cafeteria growing up. I introduced my Michigan-born husband to it and he never visits Pittsburgh without getting Blennd at least once. (You can also get it premixed and cold at Wholey's, FYI.)\n\nIn the next room you'll find baccala (yum), pour-your-own olive oils at a reasonable price (not a huge selection, but the Spanish is fruity and a good everyday sort of thing at $4.99/12oz). I pretty much never buy bread here, opting to hit up the double rustic baguettes at Mancini's instead. The anise love knot cookies are great.\n\nThe last room has produce, normally at a good price but not the best selection. They do have fresh figs in season, thank God. I have to admit I've never tried the fresh pasta, since that's one of those things I just make at home. I should probably remedy that so I can offer an opinion on it. They sometimes have refrigerated and ready-to-go San Pelligrino Chinotto, a bitter soda that comes in a pretty bottle you can use as a small vase afterwards.\n\nCheckout is straightforward and efficient, but you will be in line for a while if you go on a weekend. It's nuts, just like everywhere else in the Strip. If you can, visit all the shops both on a weekday and on a weekend to enjoy two totally different experiences.\n\nThey do have a small parking area behind the store on Liberty, with which I wish you good luck on a Saturday. Otherwise it's street parking, but there's a ton of that, and walking past and through the other shops in the Strip is so much fun it shouldn't matter anyway.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 4, "date": "2011-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HwqAGCDK9dKZM4lCdrYbvg", "review_id": "xJgo_BcYfRz-dgtCZtXF0g", "text": "Definitely my favorite place in the strip. I always buy cheese (she calls you \"dearheart\" and it even says it on the sticker, lol), olive oil, fresh bread, homemade pasta, and homemade sauce here. So great. I always try to check out in the line with the guy who has a picture of his cat too. My wife and I like to talk about cats with people. :/", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2011-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "pb-v4zMXSnJ5AnblhBkWCQ", "review_id": "BvPA5R4AxejNsXyeHnGXQQ", "text": "Let me count the ways I love this place.\n\n1. The cheese room. A huge bustling room where everyone is scrambling to get different cheese from all over the world. Need I explain more?\n2. The pasta made on-site. Pick up half a pound of wild mushroom linguine and your dinner guests will be impressed.\n3. Serve yourself olive oil. I can be a snob when it comes to certain food things, but olive oil? I didn't even know you could be an olive oil snob! There are kegs of different olive oils that you bottle yourself. They're so good.\n4. Spices by the pound. It's more economical, saves on packaging, and it's just a whole lot more fun to dump a quarter pound of red pepper flakes of paprika into a bag!\n5. Their pasta sauces. So many different goodies made on-site! \n\nThis is one of the places I take people when they visit me. Some people look at me like I'm crazy for taking them to a grocery stores, but then there's the others that understand the magic of this place!", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2011-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "cRBoaRlYfqqQVZR4KKs-Xw", "review_id": "I2b0uMwD9EEIb2P5YlUY2A", "text": "As lover of all things food, Penn Mac has it going on. Their selection is incredible and the prices are fairly inexpensive. You must visit if for no other reason than the cheese counter. Carol has worked for Penn Mac for as long as I can remember. Ordering cheese while being addressed as \"Dearheart\" is an experience unto itself. If cheese is not your thing, check out the olive bar.  \n\nI always stop by to pick up spices, pasta and cheese when I'm in town. I grew up shopping at Penn Mac regularly so perhaps there's even a bit of nostalgia in it for me. Either way, the shop has lots to offer. Best of all, they have online ordering. When I get really homesick I can order some Isaly's chipped chopped ham and pierogies.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2012-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "JfnlQVCV6GOe59N7eODNhg", "review_id": "zgxaiT9LtzSBvN8_IVGTpg", "text": "Can't beat the selection!!!!! There's nothing to dislike about this place besides the lack of samples. \n\nVariety, freshness, and quality are all two thumbs up!", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2012-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "JVkuW-Vf8qF447AZXyWVfw", "review_id": "ZBe9L449KHA9sUKiBGTwkQ", "text": "The cheese counter and \"Dear Heart\" really are treasures.  They have all manner of fancy aged gruyeres, tons of olives, and even some sort of disgusting concoction called \"pepperoni cheese\".  In any case, the place is all kinds of old-world beautiful.  Shelf after shelf of yummy goods, Italian imports...yum.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 4, "date": "2012-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "od10E5o-7_c88yeTpOcWiA", "review_id": "D6dtHSBa6plvmysHI7w1Fw", "text": "We visited this store on after a tour of the Strip District and we loved it! They have hundreds of varieties of cheese and the people behind the counter were very helpful and informative. The history of the district and of this store makes it all the more worthwhile to visit. As an added bonus, the four year old sharp cheddar we got is the best cheese we've ever had.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2012-10-22", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "PRsM-yC9MhpiCS9lm9SPMA", "review_id": "eWlIH2vgmRjn3S16t75lIg", "text": "A Pittsburgh version of DeBruno Brothers in Philadelphia, Zabars in NYC.  On entry, you are immediately hit with food smells.  They have everything for your charcuterie and pasta needs.  Cheeses, cured meats, breads, home made pasta.  I wanted everything there.  Don't go hungry (or do ;)  Very reasonable prices.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2012-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hLrg5m7_3XsYwyKo5HHrXg", "review_id": "nbAWBW-GrpvqikhORo9epA", "text": "Penn Mac is one of my absolute favorite shops in the Strip District. They have such a great selection of cheeses, pasta noodles, and sauces. It's not possible for me to leave without at least two pepperoni rolls.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2013-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QLiWMRXvgqws9QtS68tXJA", "review_id": "t4zy50jpDvgxb8miqKw2Sg", "text": "This place seems like an Italians dream. This place has the freshest mozzarella cheese I have ever had. It is still in the water bath when you buy it. They also have fresh homemade pasta that is also to die for. They have so many cool things that nobody else carries it is just neat to walk around and check out. They have every kind of olive you could ever think of, and in bulk too. You can buy all different kinds of olive oil from a self serve kettle. You just simply have to stop here if you are in the area.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2013-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "D2Hwqta3doOqbgVh-6Rs8g", "review_id": "JuvPlrQtf5-8UVJqpC3nJg", "text": "I just love to visit this store. As you enter the store you can feel the Italian vibe. We purchased the best olive I have ever had. I discovered fresh mozzarella yum! I just made the homemade pasta for dinner. The black pepper linguine was so good. I need to go back for more real soon. It is a great place to find wonderful gifts for all occasions.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2013-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "NDeHruJYG1VxhqnRSPsjmA", "review_id": "XkN_Ow8ZsQTkEKs61FaZ7g", "text": "A must-see in Pittsburgh. As a West Coast dude, I don't get to see many places like this. Just fantastic.\n\nTheir shipping operation is also exceptional.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2013-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "RjTEKl_vizX3CpIecS6FRg", "review_id": "uRRfzp0safZMuKQElKkvgg", "text": "Pittsburgh Bound!  Part VIII\n\nI moved to Atlanta in December of last year from Pittsburgh and had yet to be back.  Virtually every Labor Day weekend of my entire life was spent in Pittsburgh with my parents, as my birthday falls within the window.  I promised my folks that I would make a long weekend out of it, and head on home.  The following reviews are a step-by-step account of the long weekend.  Enjoy!\n\n(For Part VII, go to: http://www.yelp.com/review_share/hsRjct8UiUHU54B983GmcA/review/5q1GTAV1pUIq_BgCnNNY-A?fsid=oxxZiKVdfoPZvy9nBFr2AQ)\n\nPenn Mac, as it's locally known boasts the best Italian grocery store outside of Italy.  Established in the 1940's, Penn Mac is famous for their cheese selection with hundreds of choices.  I always leave with a small tub of their fresh mozzarella which is made daily and goes perfect with a little basil and cherry tomatoes.  The employees working the cheese counter have all been there for years and are very knowledgeable.  If you're lucky, you'll hear Carol affectionately refer to each customer as \"Dearheart\" as she offers up suggestions and samples to ensure that the customer gets exactly what they're looking for.\n\nThe balsamic and olive oil selections are just as impressive as are the fresh pastas, local breads, olives, and Italian cured meats.  I can't remember a time I've gone to Penn Mac without buying something that I had no intention of going home with.  On this trip, I picked up a few pastas that I can't find at home as well as an aged balsamic that I hope makes its way back to Atlanta without exploding in my luggage. \n\nIf you need any off-the-wall Italian ingredient that you can't find anywhere, I guarantee that Penn Mac not only regularly carries it, but probably has 12 different varieties to choose from.\n\n(For Part IX, go to: http://www.yelp.com/review_share/EnJS6OeeknzOjVUX6RYwlQ/review/8hA8rRHss2PRlroWujzT_Q?fsid=D3ZAe8-bG1Zz-raxtTTr8Q)", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2014-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "g1sfETlFwg7sKDihstdC3A", "review_id": "BfNTOC_KGDy7xwJMb80m0g", "text": "This along with the Strip District in general, might be one of my favorite places ever! PMC has been around forever and there's a good reason why...they have an incredible collection of imported meats and cheese and other Italian specialty items. Going here is an experience, but you have to be in the mood to wait in one because it's always busy! This is my favorite place to go when I come home to Pittsburgh for visits!", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2014-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "hru2IDwSyN61sgWPtJw_hA", "review_id": "iLr2hCroh9IcKnuw0G6xwg", "text": "I love this place!  They have everything and bc I currently am working in the Strip Dist I love being able to walk in there and pick up stuff for dinner on my way home.\n\nI would never, ever come here on the weekend bc I love myself far too much for that.\n\nThis place is always packed.  I like the cheese area but I never know what to get and so I've never bought cheese here.  But they have fresh pasta you can buy in the front of the house, and they've got great specialty items.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 4, "date": "2014-09-16", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "gEuGe2By1e9G3ZKXuMGzrw", "review_id": "Hx0RVS5imEvzmIZC74xPaA", "text": "Pennsylvania Macaroni Co. (or Penn Mac to the locals), is a favorite shop of mine in the Strip. With delicious but affordable food, it's a great stop for necessities or simply browsing. \n\nPenn Mac has a full array of groceries, and it's easy to get legit shopping done here. The bulk foods (dried fruits, nuts) are a steal by the pound, and I get help but grab one each time I visit. \n\nBeyond the bulk section is the amazing meat and cheese counter. This is straight up a cheese lover's dream. The variety is wonderful, but the staff makes the experience even better. There are a lot of characters behind that counter, and they are so helpful. \n\nPenn Mac has an insane variety of pastas available (natch, for an Italian grocery), and the best imported treats. Browsing through the aisles takes me back to the vacation I took to Italy, where I consumed entire pizzas by myself.    \n\nIn the back, Penn Mac has a lovely selection of fresh Bread Works bread and other local vendors. The produce section is adequate, which does the trick--because who is going to Penn Mac to buy lettuce? Shame on you, eat some prosciutto instead. \n\nWhen I get to check out, I'm always stunned by how much I didn't spend! Since it's wholesale, you get quite a bang for your buck, so don't hesitate to grab a few extra treats.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2014-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lDMJVkqxHpjJdHEtfQu3SQ", "review_id": "pC71zLlYeWi4PwvBSQviBQ", "text": "This was my first visit to Penn Mac and I was blown away by the selection. They have everything from cheese to fresh pasta to produce to kitchen equipment. Noteworthy items include the mozzerella di bufala and the fire-roasted tomatoes.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2015-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uvXs09fVId2GarZVJq-DMg", "review_id": "ABJBIdqWsXdNpkXCy8-2gQ", "text": "I stop by here every time I'm in the Strip to grab some cheese and olives. I've gotten so many cheeses from here that the workers have recommended (they somehow knew EXACTLY what I want from the vaguest description of me not exactly knowing what I wanted). So many cheeses to choose from. I just bought some pepperoni cheese over the weekend that I'm struggling to not devour in one sitting. \n\nThere are plenty of bins of different kinds of olives to choose from. I basically have to take orders from my family and boyfriend before coming because they HAVE to have some of their olives! Ha! \n\nPlus side, plenty of spices, legumes, pastas, oils, vinegars, fresh breads and produce to choose from also! And of course everything is at a great price :)", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2015-09-25", "type": "review"}
{"votes": {"funny": 9, "useful": 11, "cool": 14}, "user_id": "bhZ13wN_5lQrKX278AP_aw", "review_id": "7xyfJut-PcmBU2H1gsNuiw", "text": "Considering I left a job in the Strip District a few months ago, it is quite unfortunate that I just tried Penn Mac out recently.  This place is usually pretty crowded, but it's only because the food quality is so high.\n\nPrior to actually going myself, I had sampled a few cheese from here.  All of them were delicious.  I also came here occasionally to buy things for work, which led to some exceptionally interesting purchases, none of which were edible.  But I finally decided to pick up some frozen pasta for quick meals after class.  After sifting through a bunch of raviolis, including lobster and crab, I finally settled on the cheese manicotti ($7.99).  The package contained 8 tubes, which seemed like a steal.  The manicotti are delicious and only take 20 minutes in the oven!  Super convenient for after work or school.\n\nThe people that work here are nice, and they take credit cards!  A win in my book.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 4, "date": "2015-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HmKmTSvTRa8b8dfv0Ns92A", "review_id": "0EbqmUv2brHwkxoz2FPGyA", "text": "This is Suncha fun place to visit when you're at the strip district in Pittsburgh. Definitely go into the area where you can order meats and cheeses at the counter. Look up to see all the many many many many many types of cheeses on the chalkboard sign. You find a lot of unique things here, some important things, dried salted fish, fresh made pasta, fresh made breads, you can fill up a bottle of olive oil or balsamic vinegar.  They also have a variety of pasta flour and bread flour and pizza flour and a produce section. When you first walk in there are a lot of things you can buy in bulk like nuts and spices. \n\nAlways stop here when in the area!", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2015-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G7H88rOYTaYQNb2vHEp3FA", "review_id": "ndjnx_i6nnuPVVuiv3r6Tw", "text": "This place has everything that  this Sicilian girl is looking for. Love the fresh meats, cheeses and olives. The staff is so friendly and helpful. Definitely a place to visit when in the Pittsburgh area!", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2015-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "no5l58Gl30O0ceXGeim06g", "review_id": "hvvcxvdP7VIoQQK9k50vwQ", "text": "Hands down the best cheese selection! Amazing prices for the quality. They are very knowledgeable about the product, which is also helpful when choosing! \n\nHuge selection of Italian goods both local and imported. Tons of olive oils and balsamic to choose from. Many different types of pasta, both dry and fresh. Bacalao and other specific specialities that would be hard to find other places.\n\nThey have complimentary parking in back. Love this place!", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2015-11-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "C3MHaW2n0GBi5l5TcZuZPA", "review_id": "9QmsGU7Sqvj6yzSsZb7TFg", "text": "This store is food enthusiast's paradise! They seem to have anything a cook needs: baking equipment, espresso machines, pizza stones, various brands of pots and pans, cookbooks, pantry items, dishware, and more. A food enthusiast myself, I moved to buy one of everything. Alas, my tiny kitchen and my meager budget proved to be the brick wall between me and all the shiny gadgets. (Mental Note: Move to a home with twice the kitchen size--and learn to save money).\n\nAnyways, the employees are very nice and helpful. They seem to know the best uses for each gadget as well as some good tips on how to cook and bake certain foods. They also told me that they hold cooking classes occasionally. While I held off on signing up, others may be interested in trying them out.", "business_id": "QlHQzegL2Ew3z5YgK0ZeOw", "stars": 4, "date": "2014-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pE01PiSYOMDoZni6xBAoRA", "review_id": "pcTaSkHkNGpDZjlTXSh_qQ", "text": "I stopped in on Tuesday evening to find a gift idea for a friend's Birthday. From the time I walked in the store, which was bustling, I found the associates to be very friendly and helpful. Renee in particular helped me put 3 different ideas together. They were all 3 so great, I couldn't decide! I ended up getting the cider, mulling spices, mug, etc. She packaged it so nicely for me, too. What a great experience. I'll definitely be back!", "business_id": "QlHQzegL2Ew3z5YgK0ZeOw", "stars": 5, "date": "2015-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "n4xVaxhGspdwcj0TTMfCuA", "review_id": "t3bsenY03YgW-k8eG48DYg", "text": "Small selection. Yelp should label this as a small Japanese store. There is not much other Asian food and it's very tiny. They had great things but I was looking for more Chinese things, not so much Japanese groceries.", "business_id": "fzpRf9YEyoSYM4MMpiFUbg", "stars": 3, "date": "2015-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_NsviH0RBenA2R0U-3Ka0A", "review_id": "w2wF5PQpSw6nYpRL89coTw", "text": "Great service.  They recognize and appreciate repeat business.  Orders are always taken correctly with personalized service.  One of the perks of working uptown!", "business_id": "5dn_3KLiTl2vVe8O91pJ6g", "stars": 5, "date": "2015-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Zwsq31eNUo2HpdkV2h9aig", "review_id": "Odb9jGRPRXnCAuI7a7QfZw", "text": "Reid's is a local grocery store, with a little cafe attached. If I were to work in the area, I'd probably frequent this place quite often.\n\nThe prices did seem a little pricier than your normal grocer, but you'd kind of expect that from this location. It's located on the bottom floor in 7th Street Station parking garage & borders the light rail. They have several sets of tables & chairs for eating lunch on a nice day.\n\nI did a quick walk through the store & this really is a full grocery store, having everything you'd need on a shopping trip. They may not have a huge variety or assortment of things, but they have every type of item you'd find in your local large grocer. Also, they have a large wine selection, 2 aisles worth. I'm no wine connoisseur, but they seemed to have a good selection from low end to high end.\n\nReid's is really a nice little, local grocer that has all of your needs in the food department. They also serve up some lunch but I haven't had any so I can't speak to that. If I were to work uptown, I'd definitely check this out more often & pick up some goodies here.", "business_id": "Ak6ThDexfSFwoajgOpio8g", "stars": 3, "date": "2008-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "8ED8BPCXKXZnGsVMyl5Bhw", "review_id": "jR5q7Eme3ftYOJ1PRXQVwA", "text": "It's a little snooty and fancy, but if you're in the mood for snooty and fancy, it's the place to be. The little cafe is a great place to stop for lunch if you work in the area. When I'm working uptown, it's one of the places I hit up most frequently. It's nice to sit outside and watch the crowds bustling by. \n\nThe hot bar is nice. I always spend too much money, but it's good food. \n\nIt's also kind of nice to be able to pick up some fancy-pants groceries while stopping in on a lunch break. I like looking forward to dinner while I'm at work, and stopping at Reid's always means that there will be something promising to look forward to.", "business_id": "Ak6ThDexfSFwoajgOpio8g", "stars": 4, "date": "2008-10-21", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "K5dxGhJ99TmS6La6krwkcg", "review_id": "LrrVsbGC7wro-sdnAOfRxQ", "text": "this place is fun because it is on the light rail line.   things here do tend to be expensive, but i will say the sushi is yummy and normally priced.  the tizerts cakes are so delish i would eat them until i died.", "business_id": "Ak6ThDexfSFwoajgOpio8g", "stars": 4, "date": "2008-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ITwewV_k1EcFgxfWNlssqQ", "review_id": "YdXu1SaXiZ2jw9kUWqw6OQ", "text": "If you're searching for specialty foods, check out Reid's at Seventh Street Station. They've got a great selection of wines as well. Their cafe also a good option for lunch if you work nearby. \n\nI'd suggest having a glass of wine there and sitting outside, watching the light-rail train go by. If you're not usually uptown much, you might not think to go to Reid's. But if you shop there, they validate your parking stub for Seventh Street Station, eliminating one of the hassles of going uptown.", "business_id": "Ak6ThDexfSFwoajgOpio8g", "stars": 3, "date": "2008-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PhIlD6Iz1AShd5tv2F_wPQ", "review_id": "CfhmWp1zWTrdq4jXAnIpMQ", "text": "If you're used to the \"right coast\" or \"left coast\" locations of this place, you'll be sadly disappointed by Charlotte's offerings. Super small, minimal selection, and their pastry items tend to run on the stale side of  \"a day old.\"", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 2, "date": "2010-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cxTh9xxqbs-m8Paq6jAumg", "review_id": "y_jJ2Mvw9AV3oVsdJGKN0A", "text": "When I moved here, I was shocked to see there was a few locations in Charlotte after only knowing it from visiting NYC. I love just wondering around in there and seeing what creative sauces, desserts, sushi, prepared meals, etc. they have. My parents love Dean and Deluca and demand we go each time they to visit and we often go there for free samples but were disappointed this last time (Lavor Day Wknd) b/c they didn't have any out, whats up with that? \n\nWhile their stuff is pricey, it's worth the splurge every now and then. We all deserve something nice (and tasty) right?", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 3, "date": "2010-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "whKpnugMnWTz3UjlrN71yg", "review_id": "x5_FOM20WUbltCERYJwjyw", "text": "I love this Dean & Deluca. It has everything you could want, including an outdoor area for relaxing! If you go here knowing it's going to be on the pricey side, then you'll be fine. Make sure to order from the deli; whether hot or cold, they'll serve it to you with class. Sushi, salad, sandwiches, desserts, coffee, treats, etc, etc. I find myself stopping here frequently before movies at Phillips Place. Somehow always need a bag of treats before heading to the movie. Haven't purchased the meat/fish yet as it's a little pricey for me, but if I'm there for some unique eats and drinks, it works perfectly for me. \n\nThis is one chain that I'm a fan of :)", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 5, "date": "2010-09-15", "type": "review"}
{"votes": {"funny": 8, "useful": 2, "cool": 3}, "user_id": "lpZtfD-vCqUER1yGKEvUPw", "review_id": "GYeZpJ2KKUKlZjWisWH3zg", "text": "An ode to my dear Dean & Deluca,\n\nOh Dean how I adore thee,\nAnd your $6 bag of tiramisu caramels, how I wish they were free.\n\nI like to visit you before I head into a movie,\nAnd smuggle in a chai latte, that's super duper groovy. \n\nYou are a chain but I don't mind too much,\nBecause you continuously offer me a filling, tasty lunch. \n\nYes you're expensive but I love your free snacks, \nI sometimes pretend it's a buffet and initiate my attack. \n\nI know I'll be back to partake in some eats,\nAnd probably leave with a bag full of treats.", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 4, "date": "2010-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iw71Q7AwGWfBvULvWcKuwA", "review_id": "QOKp1PqM7xqYuQqSgqhg5A", "text": "Oy! Sensory overload.  Be careful or you might hurt yourself trying not to pass out from all the yummy choices or destroy your budget after you discover this place~", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 4, "date": "2010-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rszYNOIwAp6zg7CugbOsvw", "review_id": "-wx-eIml7Bo0LQyaLN0HaA", "text": "Love D&D but not the prices! Wait till Whole Foods Market arrives area markets will really be hit. D&D will have to make some changes.", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 3, "date": "2011-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tNxrmaERbaEQpSnboMuGcw", "review_id": "j83HPDdByTYc1nVL0g9HCw", "text": "Bought cheese, breads, and Pate, and Apple Turnover!! Gosh, this place is awesome!! the cheese were awesome!! Bread, fresh and piping hot! Pate, Gah!!! So Yummy!! and the Apple Turnover was delicious ( It tasted like apple pie, but it has bit of cinnamon which remind me of christmas) so it and happy day for me!!", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 5, "date": "2011-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2DomT9E-JEBBoGi127f00A", "review_id": "uehLzUnc6mlwTPCm9IFD8A", "text": "Cons - yeah it is crazy expensive here. But then again consider the location.\n\nPros - we've been a few times for the sandwiches. The Ham & Brie is awesome (and pretty stacked) and runs for $7.75. I have also tried the Italian - it is also pretty stacked and yummy, more like a Jersey Mike's price at $9.50.", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 4, "date": "2012-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PM2jXrlVzik1jDwwahLJJQ", "review_id": "nuKx9b2cPWGw7OEdy6k1fw", "text": "Very cool place!\n\nI love the new wine seating section they added! And that you have the opportunity to sit outside and enjoy some wine and food.\n\nThe shopping side is so unique, I love just walking through and seeing the new options they have, it's a lot of great things that you cannot find in your local grocery store.\n\nI love the sandwich and meal options they have, they are all prepared fresh and out for you to see while being prepared. \n\nAgain, just like other reviews stated it can be a bit pricey but since the items are so unique and freshly made in my opinion they are worth the few extra bucks!", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 4, "date": "2012-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Dq4EyXBVZs3qtXCJG7OXFg", "review_id": "vuT7UyDeI4Qx6zm1PxDTqQ", "text": "We stopped by after a movie matinee. The atmosphere is nice and the food is good, the service is just ok. It look several minutes to be greeted after we sat at the bar. We ordered the tuscan beans with crostini and the calamari.  Both were good. I don't know if the wine pour was a usual for them, but it was generous. It's a nice spot to hang out and for light fare.", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 3, "date": "2013-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dlwI0b45ia67-Yp4oMG8Pw", "review_id": "xJayjChOK0FJzy-Z2kyRDg", "text": "I love D & D.  Everything is always delicious and fresh.  It's your one stop for movie snacks, a quick bit before you catch the latest Ryan Gosling flick or just a chill evening on the patio with friends and a bottle of wine.  D & D has a lot to offer from sandwiches and salads to massive brownies and lattes. I like going to Dean & Deluca when I want really good food without the fuss.  Just pick what you want at one of the counters, pay for it at the register and your done! \n\nD&D also serves a pretty decadent breakfast.  I went for brunch the past Sunday.  The chocolate chip pancakes are amazing, packed with dark, milk and white chocolate and cooked to just crispy perfection.", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 5, "date": "2013-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "OXWWC30x-1Ee0B6hXLLZfw", "review_id": "ydAACl77syP0WCONySE-kQ", "text": "North Carolina has 3 D & D and Chicago has zero? I love the grocery store attached to this place If I didn't just go nuts at Dillard's, I would have had room in my bags. We were there for a late dinner. I actually thought they were closed as it was just before 9. We started with a bottle of Parcel 141. I ordered the Chilean Seabass. Very light and flaky with a mild buttery taste. The server was on top of us for the whole meal. Aces to this place, as well as the eclectic mellow atmosphere. Very relaxing. We took a bourbon pecan pie and key lime to go as we had already eaten more than enough. Or was that drinking I was thinking of? Great place. Would love to go back!", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 5, "date": "2013-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "IUATSzz-kFcT38DoqhSs8w", "review_id": "OIyExNrW3SBVuwvR7wPKSQ", "text": "A friend here said you must go here. Well that was some good advice. Nice size bar and plenty of tables spread throughout. Atmosphere very nice, they had 2 folks playing music that was a good mix and enjoyable. Started with a bottle of wine. I went for the scallops. They were delicious, quite large and full of flavor. Our server was top notch. Very attentive and kept the wine glasses full. They also had a full market attached to the place. All kinds of goodies to be had. we took some pies for the road. I had the pecan and was eating it on the plane, wanted to tell the pilot to do a fly by. I want more. We need this in Chicago. This is a must stop if you are in the area.", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 5, "date": "2013-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m27rK1i6q5FsvqIthu-YZw", "review_id": "b0EhLM041zt_NQYeNiqQNA", "text": "The selection of wine is both tasteful and extensive. I only had a small Asian salad however it was one of the best I have ever had everything was fresh crisp and delicious.", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 5, "date": "2014-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eJ4j5LqkdpyQKXO00Mw4Tw", "review_id": "qt7Lf-uQ4Og4_oWvYF-JwA", "text": "Got an amaxing roast beef sandwich from the sandwich bar - made to order.  Coffee was excellent as well.  Looking through their market section & had a question - Brittany was just walking by but was quite helpful.", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 5, "date": "2014-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kzTw297vLneC9KgZv92MwA", "review_id": "tb5GIJZtmgNH58DgvDF4jA", "text": "There is more candy and sweets here than you can possibly eat by yourself, so bring a friend (or two)!!  The location is one of the best I've seen. It is in a very upscale neighborhood and isn't littered with people who are discount shopping.  They have some really great selections for lunch and dinner.  I'd recommend the 3 selection dinner box for 14 dollars. It is the best price for for the amount of food you get. Be aware that you can sample any of the food on the line!!  Just ask!  The place is very clean and has three options for dining.  You can eat outside, inside in a more cafeteria type setting, or in the more formal restaurant area.  There is more wine and beer here than you can possible imagine!  You can even buy single bottles of beer to have with your dinner if you choose.  The coffee is fantastic and the wine is even better.  Don't forget to grab some deserts when your done eating.  \nOh, they also have a large shopping area filled with kitchen items and food preparation supplies.  My fav part is their olive bar!  It rivals Harris Teeter!   Stop in for the best experience you can hope for with food!!  Cheers!", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 4, "date": "2014-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ezv29DIjbGc5eONxRMnUYQ", "review_id": "9abJOY-hx1k5lEzl8iraug", "text": "Charming upscale cafeteria-like cafe with speciality foods for purchase and wide variety of salads, sandwiches, pastries and drinks. If you're not in a hurry you can also sit in the wine room or espresso bar! I come here often for the \"create your own salad\" with fresh and filling ingredients!", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 5, "date": "2015-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gKgJiLBeMXNDvo2C0aMlNA", "review_id": "UEuQuyTpyuAchPM8IxUHWQ", "text": "Really cool place has a separate dining area with a separate menu but they have tons of options plus several free samples throughout store. They have great pastries and candies plus dips wines and pretty much something for everyone. You could spend a ton of time just walking around and looking at all the great items. I had a chicken caesar which was solid. Being from out of town its a cool place to bring guests and just a great experience. If visiting Charlotte I highly recommend stopping by.", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 5, "date": "2015-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0u0p6DlVw9-IiJGgN36prg", "review_id": "LVoYs5MsV95x3eIRL42g4Q", "text": "I have always loved Dean and Deluca. Their food is delicious and fresh and they have a lot of options. I typically get the medium salad with chicken which is $10.50/lb and mine usually comes out to around $11. Last night I got a salad here and when I went to check out the salad was $20!!! The guy put SO MANY toppings on it and then he also gave me six salad dressings.. SIX! I specifically told him this was a for here salad for me but he packed everything in there so tight my salad was two pounds. I was in such shock at the register that I paid for the salad but could not believe this. I have never had a salad that packed in there before, its like he was trying to make it cost more and I was pretty upset. I definitely should have spoken up while I was there but I just want everyone to be aware that the salads price can absolutely sneak up on you. Like I said, this has never been an issue with the same size salad at any other location, I was pretty disappointed as I did not plan on spending that much money on a salad. Of course, the salad was delicious and I could have saved half of it but I was on my way out for the evening and had nowhere to store it. I have learned my lesson.", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 3, "date": "2015-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Gytx3GVnY2wZ1XpQe7HcbA", "review_id": "j_siVom8hMIRJMG9mXdPrw", "text": "Great service and selection. Have used Munchees several times for party supplies.", "business_id": "JrlQeSad3Dzf2IV8umZ9ow", "stars": 5, "date": "2015-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8ED8BPCXKXZnGsVMyl5Bhw", "review_id": "AKeaveHMvhppcn3jGTyCCQ", "text": "Charlotte needs more stores like the Home Economist! It's a little pricey, but overall, they are a great source for all your hippy food. They have a great selection of bulk items, and it just feels good to go somewhere that isn't huge and ickily corporate. \n\nHome Economist also tries to contribute to Charlotte's culture of wellness by offering seminars, which are often free. They include food sellers, often local, and holistic health care providers in the area, and the best part is the free samples!\n\nI was vegan before I moved to Charlotte, and once I found the Home Economist, I realized I could go back. I haven't made the leap yet, but it's good to know this place is there.", "business_id": "I3oqfVYgp9_xCMXnGUsmHg", "stars": 4, "date": "2008-09-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "tm_HvdZmUMGht1-xjGQF7Q", "review_id": "6uU3FNP5UHTtwDRWmb0w9Q", "text": "I swung by this HHM as it's closer to my house than the South End location. It is much smaller and in kind of a strange spot for what they are selling, but you can't beat convenience. \n\nI am a fan of HHM overall as the stores sell healthy food at a somewhat reasonable price. Not sure I'd purchase perishables here as I wasn't getting a really clean vibe, but it was fine for the tomato paste and dog food/treats that I went in to buy. The cashier was honestly very slow; I ended up waiting way too long as the woman in front of me had a total of six items (although she did write a check - maybe the cashier was in shock at seeing such an antiquated payment method and thus the holdup? Who knows.) \n\nUltimately, if going for a ton of items, I'd recommend hitting up the location on South. If running in for a quick ingredient or two, the Independence location was fine. Although I wouldn't go after dark.", "business_id": "I3oqfVYgp9_xCMXnGUsmHg", "stars": 3, "date": "2011-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s9I4KMcrHKki44g_eTrYqQ", "review_id": "s26GOtHSbnSMKy4iXs-bPQ", "text": "As the other reviwers have commented, this store is a lot older and dingy-er than the South Blvd. store...and echoing Cathy, I wouldn't want to shop here at night.  Still, it's nice to have this store as an option. Also, I have found some really good stuff on sale at this location. \n\nIn addition to the vast vitamin/supplement selection, I like their vast selection of bulk spices, pet food items, and health & beauty items. This store has a pretty decent wine selection as well. \n\nIt would be nice if HHM would open a store somewhere out on the I-485 perimeter between Pineville & Matthews. I  believe that this area can support several more healthy stores.  Even though consolidation through mergers & acquisitions is the name of the game in corporate America these days, competition is certainly good for the consumer!", "business_id": "I3oqfVYgp9_xCMXnGUsmHg", "stars": 3, "date": "2011-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "-_1ctLaz3jhPYc12hKXsEQ", "review_id": "G7euDmmnmtDNZfKxCwhjyg", "text": "I actually wondered for a while what was up with this store - I mean really, what is a Home Economist?  Do you get your own personal Alan Greenspan?  And yes, I have been a resident of Charlotte long enough to remember that was the name of the place before they changed it.\n\nReally I cannot say if Healthy Home Market is all that much better name-wise, but at least you do not expect some stiff coming over to invade your place.\n\nThe store itself is not much to look at.  Or be inside.  And the parking lot is only decent if you compare it to the one outside the Asian Corners.  As has been mentioned many times, the South Boulevard version is vastly superior in just about every respect, yet the new location near the Matthews Wal-Mart is strangely modeled after this store, being on the small side.  So obviously they think there is something for it.\n\nAs to the inside, it is actually a cool little space.  It is strangely reminiscent of a grocery you might find in the downtown of a large city, with stuff crammed everywhere - though the product is decidedly funky, and you can get all sorts of things you might not find at most places.  Many spices available by the ounce/pound/whatever weight you choose, and oils and honeys as well.\n\nI would also echo that they are excruciatingly slow, but it is definitely worth a peek if you want something out of the ordinary.", "business_id": "I3oqfVYgp9_xCMXnGUsmHg", "stars": 3, "date": "2011-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hDcRLRPJD3cU3q6-9a88jw", "review_id": "WLRzevxhDHzudZUrA9oBxg", "text": "This used to be a good place to go to. However, they have let themselves go downhill. The people are quite possibly the rudest I have ever met. I have not met anyone there with a personality yet. The only reason I went there is because it was closer than the one off Sardis Road. But the Sardis location will get all my business from now on. I am very sure that they could care less about one disgruntled customer, and that is fine with me.", "business_id": "I3oqfVYgp9_xCMXnGUsmHg", "stars": 2, "date": "2013-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Hubnerc_hJyF-0vFQ-Jsng", "review_id": "6R7ojWiUbYdczuf2lOGxeA", "text": "Organized!\nTuesday before Thanksgiving and it's packed but the line NEVER stops moving!\nLocation on Cherry Rd in Rock Hill said 45min wait...not here!\nSample of Turkey whole you wait yum.\nHelpful and informative employees.\nCustomers sharing coupons their not going to use!\nGreat experience A+ location", "business_id": "kCFGPmD5fP8YsmSTPjaCyw", "stars": 5, "date": "2014-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uc4QurS1XrvyiIpne2IbhA", "review_id": "HmDR9zhK4TsUAgvH47jlVg", "text": "Came here for a to go order for lunch. I got a ham sandwich and potato salad. Ham was melt in your mouth. Potato salad was ok, nothing spectacular. Restaurant was really clean!", "business_id": "kCFGPmD5fP8YsmSTPjaCyw", "stars": 4, "date": "2015-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Yhlx0ob3UDz2PcJRat2QgQ", "review_id": "-t6_onYNhrGq9ZZoeEr4nw", "text": "Meat is good. Bit pricey for the very fatty cut of short ribs that we got. Your store is very clean and your staff is very friendly. Will still try you again the next time we need to buy a large quantity of meat and will update this review as appropriate on terms of quality vs. price.", "business_id": "npz4zgFXOjmRrAe_rV0Vfw", "stars": 3, "date": "2015-10-30", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "DLmoYnzCUz1Z0EnJT1NPqQ", "review_id": "dvoc6pyf4kqWyV--K9n4Ig", "text": "It's very out of the way if you live on the east side, but UW Provision is great if you have a chest freezer. It's basically a meat shop where you can get bulk quantities of meat for cheap. If there's a specialty meat (like goat) or cut you want, you can even call ahead and they can prepare it for you (within reason). Check their website for weekly specials. I recently got 20 lbs of pork shoulder there for $1.29/lb.", "business_id": "npz4zgFXOjmRrAe_rV0Vfw", "stars": 4, "date": "2015-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cUyEbaD9hdjQRSbSymKv6w", "review_id": "7Bs7tjxACorE6qftpSlN0Q", "text": "When I was younger, my aunt and uncle and cousins lived in Kenosha, WI.  We would drive up a few times a year to visit them, and after 2 hours of peering out the car windows along 94, my brother and cousins and I would be dying to get out of the car at any of the attractions along the way--Six Flags, the outlet malls, or any of the many cheese shops that announced your arrival to Wisconsin.  \n\nWhen I went skiing with friends at Cascade Mountain last winter, years of unfulfilled longing swept over me and I demanded that we stop at one.  The one we selected was the Mousehouse Cheesehaus, chosen mostly for it's cute sign and awesome name.  Being a lover of all things dairy walking in, I beelined for the cheese counter, demanding samples of anything and everything.  Oh my!  Anything from a basic, kid friendly American to a 15 year aged Cheddar, to their own special haus cheese.  I probably walked out with a good 2 lbs of various cheeses (and am still wondering how those seemed to add 10 lbs to my figure, but that's another story).  In addition, there were the usual Wisconsin knick knacks, including many types of beers, wines, and other kitsch-y stuff like ashtrays and bottle openers.  The woman working at the counter didn't seem too charmed by my friends and I, but I'm sure I would tire of travelers demanding cheese nibbles after a while, myself.", "business_id": "jpxlSFhdrtbNyxS6vB036A", "stars": 4, "date": "2008-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "3H4yFsz7SO4mZpa_cXKEFQ", "review_id": "RtEl3WefM8RWXFtK4g8JyQ", "text": "Was very disappointed at my recent experience at the mousehouse!!! I have been there before and they had always been so nice not the case this time the lady talked down to us about the difference of white and yellow cheddar and just seemed over all bothered by our presence.  So needless to say we didn't ask for a single sample.  Next time we will not going back.", "business_id": "jpxlSFhdrtbNyxS6vB036A", "stars": 2, "date": "2011-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eOLeiz-4SQZEscz5PjAxdQ", "review_id": "PvCJolLtHHwkskBoHcqiSg", "text": "SO happy we stopped here. Wisconsin cheese, wine & beer...perfect for dinner!!! We tried about 10 cheeses and fudge. ..they were all so good.The dark chocolate caramel salted fudge was delicious. Glad we stopped here and so will you. :)", "business_id": "jpxlSFhdrtbNyxS6vB036A", "stars": 5, "date": "2013-10-29", "type": "review"}
{"votes": {"funny": 3, "useful": 6, "cool": 4}, "user_id": "1Q1aN2dwn8TQvUy1QR6mqA", "review_id": "FphvruoItJj6rQM6HKUpmw", "text": "How to spot a cheese addict:\n\n1- You've spent over $70 on cheese here multiple times without flinching. \n2- You have 9 Tupperware containers of cubed cheese in your freezer.\n3- Your fiance kicked your veggies out of the vegetable drawer and made it the dedicated cheese drawer because it's the biggest.\n4- Your fiance named his childhood dog after cheese when he was a youngin' (\"Colby\").\n\nCheck, check, check, and check.  I love cheese as much at the next guy, but M is seriously addicted to the stuff. It blows my mind how much cheese he eats!  So obviously Mousehouse is his Disney World, and on our way back from Hayward, we of course had to stop here to stock up.  And by stocking up, I mean that we filled a cooler with a variety of cheeses you can't find in your local store. And I will admit that this wasn't the first time we filled a cooler with cheese.\n\nThe inside is a decent size, but it fills up fast so it doesn't take long for claustrophobia to kick in. They let you sample any cheese you'd like before purchasing, which is freakin' awesome! \n\nThe employees are friendly and helpful, which is always appreciated when you're getting elbowed and stepped on by other cheese addicts scrambling to get their fix with a sample slice. A little bit of cheer can (sort of) help you forget about your toes getting smashed.\n\nThey also carry quite a selection of craft beers, and of course fudge, knick knacks, and other Wisconsin-y items. So if you forgot to grab a souvenir elsewhere, you can pick up some postcards, shot glasses, and the like. If you're hungry for more than cheese samples, they do make sandwiches or offer pre-made ones.\n\nSo, we ended up buying ten different kinds of cheese, and with the fancy schmancy check-in offer, I saved 10%.  \n\nChicken soup is one of our favorites; it tastes exactly like the soup.  The Ghost Pepper cheese was fabulously spicy as anticipated. I didn't really care for the Taco Cheese, Raspberry Chipotle Cheddar or Pizza cheese; the flavors weren't what I expected. \n\nTomato & Basil Cheddar, Buffalo Wing, Salami Colby, Cheddar with Bleu Cheese, Green and Black Olive, Horseradish and Chive, and Beer Cheddar were our favorites this time around. The curds are delicious but you can find them anywhere in Wisconsin. The Whips were interesting; it was our first time trying them but we didn't purchase any.\n\nWe once drove here just for cheese. Seriously. We weren't on our way up north or had other plans. We literally drove from Naperville to Windsor just to get cheese for M. \nHis mother commented on our freezer, stating that we could build a \"cheese-gloo\" out of all the bricks of cheese. I laughed at the thought, and without missing a beat, M said \"No, that wouldn't work. I would eat myself out of house and home.\"  And I wouldn't doubt that for a second.", "business_id": "jpxlSFhdrtbNyxS6vB036A", "stars": 4, "date": "2014-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iv_AW8CjIBT6anq8bUUrcg", "review_id": "cE1uiWYaikiQCxoZlo5urQ", "text": "We just stopped here. We received excellent service and the bathrooms were clean. The cheese curds are yummy. We also bought some fudge and some honey sticks. It is conveniently located and very cute. I only wish that they cold have fried up some curds for me. Great little shop!", "business_id": "jpxlSFhdrtbNyxS6vB036A", "stars": 4, "date": "2014-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NgdiSiaALlJKarcVgEH9xw", "review_id": "fXNxI3jyoT_sTbJdJba0tA", "text": "SO WORTH THE STOP.  I love places like this.  I always want to sample local things (and buy) when I travel.  I made the mistake of not renting a car for a quick business trip to Madison, but the shuttle driver at my hotel wasn't busy and actually drove me here and waited while I sampled, browsed, and purchased.  The cheese is first rate, and the employees are very friendly and helpful.  Bonnie made me  a delicious sandwich on marble rye and gave me a generous sample of highest end cheese available in the place - a 10-year aged cheddar.  I ended up preferring the 7-year, and also cheese curds, a \"Butter Swiss\" and their own special formula of Jack.  And the cheese spreads are absolutely delicious.  If you think that the \"cheese spread\" you buy in the grocery store in the plastic containers are the real deal, you haven't tried the real deal.  Creamy, \"real\" ingredients, and super flavor.  Luckily, I had a lot of room in my suitcase for the return trip, because I stocked up for the fall and the holidays.  I hope work takes me back to Madison and I will definitely return to the Mousehouse!  :-)", "business_id": "jpxlSFhdrtbNyxS6vB036A", "stars": 5, "date": "2015-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NNiWo3wXygJYdw_Owe7K2A", "review_id": "9s0A4gXq9OVoEVeXBQt8SQ", "text": "The Yelpers did not steer me wrong on this one.  We were looking for a cheese place to visit on our way out of Wisconsin, and the reviews looked good.  Every single thing we purchased has been delicious!  The cheese was awesome.  Husband ended up with a garlic summer sausage to take to a family event.  As he sliced it at home, he tried it...and elected to keep it at home for himself.  \nWe don't make it to Wisconsin often, but I am definitely going to take advantage of online ordering.", "business_id": "jpxlSFhdrtbNyxS6vB036A", "stars": 5, "date": "2015-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gNZGVARhifWhydJ5Rl1Ghg", "review_id": "11SyeZVceIlB_qYxKM8k2A", "text": "This place is such a little gem! The staff is amazingly friendly and helpful. There is plenty of neat stuff to look at when you walk around. Even better, there are plenty of things to taste and sample as well! There was tastings of meat, about 10 different cheese spreads. You can also taste any of the cheeses and all the fudges. The gentleman behind the counter actually encouraged me to try all the fudges!\n\nI left with cheese curds, 2 cheese spreads, and 3 different kinds of fudge and some tasty Wasa crackers. \n\nAmazing place!", "business_id": "jpxlSFhdrtbNyxS6vB036A", "stars": 5, "date": "2015-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mC2uzlxl5WYtQlCh2j4S6w", "review_id": "lbJwpJaZU42tioINWZp0Lw", "text": "This is a really cool place. They make their cheeses and fudge in house and you can sample them all! Best cheese you've ever tasted. Staff is knowledgeable and friendly.", "business_id": "jpxlSFhdrtbNyxS6vB036A", "stars": 5, "date": "2015-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "HyPHusWfqy41wKs36OQkjA", "review_id": "WODFiCdXmAq06Dtd7sP7Tg", "text": "i'll admit, i haven't been to jim's meat in over a year.. \n.. but i don't exactly live very close to it any more so i have to claim laziness.\n\nhowever, back in the day, we used to go to jim's ALL THE TIME.\nmy best friend had jim's meat programmed into his phone.\nnot only do they have fresh and quality meats (once, we got these chicken cordon bleu -- ham and swiss wrapped in chicken breast -- there that we took home, grilled and LOVED), but they also have prepared food, like amazing cheeseburgers and brats!\n\nwould definitely recommend going there if you're even remotely in the neighborhood.\n\noh how i miss jim's.", "business_id": "WxfedycTcbQO_GuXHo9Ypw", "stars": 4, "date": "2008-09-02", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "QCg5CRze-wwMO5HerI9dYg", "review_id": "g29Iy7cnyrcHX6KNJCR-3Q", "text": "Directions:\n\n1. Go to Jims.\n\n2. Get a package of gyro brats.\n\n3. Purchase gyro sauce and buns.\n\n4. Enjoy, rinse, repeat.\n\nSoooooo goooooood!  Every time I'm in town, I try to make the trip and grab a pack to bring back home.", "business_id": "WxfedycTcbQO_GuXHo9Ypw", "stars": 4, "date": "2010-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p9qRsR26m_H6kUbtqX_BJQ", "review_id": "dP7crKC5kuxmKorx8We-lw", "text": "Love this place and the people that run it. They're just an old school neighborhood meat market.  Burgundy steaks are the best. Great deals ALWAYS!!!", "business_id": "WxfedycTcbQO_GuXHo9Ypw", "stars": 5, "date": "2014-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "j94qbZMCz4b4pbgm1U4PVQ", "review_id": "qSXWMzw8q8535NKcM45_pA", "text": "Jim's completely rocks! John (part owner & tall, friendly guy behind the counter) will take time to talk with you about your wants & needs, and will special order anything you wish. I say this because he did it for me many times over the years that I lived walking distance from the store. Their fresh, Amish turkeys are the best you can get for Thanksgiving. You do need to order those in advance, however. If you don't see what you're looking for in the display case, just ask. He would custom cut a chunk of center sirloin for me - he always had a primal in stock, not frozen. \n\nHe would let me hang out in the lobby and talk meat on Saturday mornings, between customers. I wanted to help out behind the counter, just to learn from the team, but they hire young people to work the counter, and I couldn't take a job as a hobby that someone else needed to get thru school, etc. \n\nLong story short - If you like/love meat, but can't tell a ribeye from a strip, this is the place to go. They will help you make a decision, and how to treat the meat if need be. \n\nRemember - the only stupid question is the one that never gets asked. You needn't worry that you will be looked down upon if you ask a novice grilling question. This is not a pretentious boutique. It's a friendly, helpful business that truly values your business, and they will help you make some killer meat!", "business_id": "WxfedycTcbQO_GuXHo9Ypw", "stars": 5, "date": "2014-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "QUdwTtmfY9wIcluOr-21xw", "review_id": "hyjTgE4wzuk2jnlWP-yaCw", "text": "Great selection of meats and sides. They also have a fryer for takeout food. So far we've tried their stir fry pork, chicken broccoli cheese patties, chicken kabobs, and other items that I can't remember at the moment. They are very nice and treat customers well. They'll answer any questions you have. Many times they have specials (brats or kebabs at $1 apiece). We are so lucky to have them right down the street. I can pick something up and tell my husband to start the grill and we're ready to go in minutes!", "business_id": "WxfedycTcbQO_GuXHo9Ypw", "stars": 5, "date": "2015-09-25", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 7}, "user_id": "O74GtUxBpnUBmMC4zZp60A", "review_id": "-2aX64zHbA7z-54WuBLgGw", "text": "I was looking for some gator meat last week, and Jim's was the only place that had it. \nI originally went just for the meat, but after spending ten minutes there, I've been back twice since for all my meat supplies.\nOne of the guys behind the counter talked about the great meats they had, but also gave me some good ideas on how to deal with the gator tail for best cooking. I ended up frying it, but next time, I'm definitely giving it a try.\n\nThey also have some great prices and a huge variety, combined with great service. Without a doubt, I'll be here weekly for all my protein needs.", "business_id": "WxfedycTcbQO_GuXHo9Ypw", "stars": 5, "date": "2015-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "GEhwvEFLETXwLr_xhCnX5A", "review_id": "Ct7n8-BsTttRiGe4CISsdw", "text": "Only been there once and been wanting go back again soon. We used to go to that side of town once a month and I would wonder about this place with my husband's name. So one day, stopped there to see if they have anything quick to eat. Fresh sandwiches were great....made the way we wanted. The place was clean and very friendly. Too bad,found it after I no longer live on that side of town.", "business_id": "LWmlH8MwUnwMWN5Ma8utnQ", "stars": 5, "date": "2008-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-hwN2juKYn-KTxa2WBYLnw", "review_id": "_2Wkv-v65CimFiBsCOlBdw", "text": "Overall I was unimpressed.   Nothing really that exciting here.   I am looking elsewhere.  \nFor those who are concerned about where their meat comes from you should be aware that their chicken is inexpensive but it is from Gold n Plump and Purdue.   I don't know where their beef is from.\nThe shop is nice but much smaller than I expected.  About half being a regular convenience store.   The meats are nicely displayed and they are well staffed.", "business_id": "LWmlH8MwUnwMWN5Ma8utnQ", "stars": 2, "date": "2011-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "t4I4CXtBkGh8sgDgM2bQDA", "review_id": "YeE_vrZMhtv4fWFoOpfzlQ", "text": "I stop here for the meats and fresh made sandwiches. It is a convenience store with a very nice meat case. There are reviews on here complaining that they don't have an actual butcher shop. There are not that many around anymore so deal with it or butcher your own. Burgundy Pepper Steaks are marvelous. I tried to marinate my own, but have not been able to match these. Reasonable prices.", "business_id": "LWmlH8MwUnwMWN5Ma8utnQ", "stars": 5, "date": "2014-11-07", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 5}, "user_id": "ZPWpo_enQtNt5rWod7WELg", "review_id": "TmcbP3LnSXWjnapERTZCDw", "text": "Every single thing is delicious here. I go here for my monthly freshly made deli sandwich for lunch. I almost always get the honey ham and Swiss on a croissant with green leaf lettuce, fresh, red, thinly sliced tomatoes and perfect mayo. Their pre-made salads and sandwiches are creative and fresh too. Great breads, fresh cheeses, oh and Babcock Hall ice cream!!", "business_id": "LWmlH8MwUnwMWN5Ma8utnQ", "stars": 5, "date": "2014-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "16fUoxbABxFICJuVNxvI1g", "review_id": "9WXPahsjB1KyeFwZBCGO_g", "text": "Burgundy pepper steaks and stuffed chops are the best! Ken's is a solid place to go for local goods.", "business_id": "LWmlH8MwUnwMWN5Ma8utnQ", "stars": 5, "date": "2015-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BvGV9lMMUmB5hLWkNlY3vw", "review_id": "02_y35OdHdyNXOtsDQ0M3g", "text": "My dad always used to come in here to get our Valentines Day chocolates as kids and I occasionally remember going in with him. Turtles ftw!", "business_id": "cMJL8kZOF0VsYMhM2DKkBw", "stars": 3, "date": "2012-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "ZMp_SSu_ESiGOV7jwxUmtQ", "review_id": "hrLH5IAsyahT6pZ9RKWitQ", "text": "I first went looking for a good butcher shop after getting sick of the poor quality meat found in grocery stores. Every piece of meat I've had here has been delicious. They also have fish and some interesting game meats, though I haven't tried either.\n\nYou can also get some lunch food here. If you are lucky enough to go by when they are smoking some meat in their outdoor pig-shaped grill, the smell is intoxicating. \n\nTheir deli selection is small, but I find they have everything I need. The people here are very friendly, and you'll notice the same people working most of the time. It has a very nice local feel that beats going to a grocery chain hands down.", "business_id": "niK-GkBZ_RIFscfy-nH1rg", "stars": 5, "date": "2007-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wtsl05RJj5f6YBDQPEwP2w", "review_id": "iJ-P8yu6375HmjJFIW6yKw", "text": "Why did it take us so long to discover Old Time? It is amazing, I will never buy meat or fish at the supermarket again! I particularly like the knowledgeable staff, the smell of BBQ, and the extensive range of high quality products they sell. The best beef I have seen outside of Texas and New Zealand!", "business_id": "niK-GkBZ_RIFscfy-nH1rg", "stars": 5, "date": "2008-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4YSr2lR8i4sVywgi-Y1CLw", "review_id": "DUALtRfycy2fe3PQa5ozMw", "text": "Knowledgeable, friendly staff.  Sirloin patties and the twice baked potatoes are my go-to choices here.  Will make a special trip for them.  Good stuff.", "business_id": "niK-GkBZ_RIFscfy-nH1rg", "stars": 5, "date": "2013-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_zMf23RHZlIQl-6YBE4M6A", "review_id": "rzDuhODFRyqnq68dUlr2sg", "text": "This place is the best.  The customer service is fantastic, the quality is terrific, and the prices reasonable.  If you need meat there is no better place in the area.  We do not buy much meat but when we do it is only from Old Time Meat and Deli!", "business_id": "niK-GkBZ_RIFscfy-nH1rg", "stars": 5, "date": "2014-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TpLA3XSBxKXIfvE4ZCcQcw", "review_id": "ZqihZc2d3sOInud26n62Mg", "text": "It's so nice to have a locally owned butcher. The customer service is outstanding and the prices are affordable. \n\nMy favorites: \nAmish turkeys for thanksgiving (pre-order)... free range, affordable (for free range), and delicious! \nFresh ground beef for very juicy burgers\nFresh sausage, especially the kielbasa which is heaven", "business_id": "niK-GkBZ_RIFscfy-nH1rg", "stars": 5, "date": "2014-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "JgHGyWS2emyHq6aq144SLQ", "review_id": "IxXzFJNc0wKZjGrcVs7VuQ", "text": "I use this when I can't get to the Meat Science Lab. \n\nI've tried their ground chicken for some Mediterranean kebabs and found they only sell it frozen. That was a bit of a bummer, but when it was thawed it was a creepy chicken paste, nothing like I've ever seen.\n\nThey do have a good selection of meat in the deli case as well as some marinated items. When items are on special, they have some pretty great prices.", "business_id": "niK-GkBZ_RIFscfy-nH1rg", "stars": 4, "date": "2015-09-01", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "kRqk2li5lEm8R2EcYDrXBQ", "review_id": "FuT_zutYY_Cw7O6ESsMyQA", "text": "Super friendly people at this meat shop! Everyone is very helpful and they have such a wide variety of items. They also offer Boar's Head deli meats which are delish! I like that they also have some already made items like pork stuffed with wild rice and a large variety of marinated chicken breasts. Yummy!", "business_id": "niK-GkBZ_RIFscfy-nH1rg", "stars": 5, "date": "2015-10-16", "type": "review"}
{"votes": {"funny": 7, "useful": 9, "cool": 9}, "user_id": "BSI42r_Q2NmDeYU-rf12nA", "review_id": "JWMI28muI5IQCwC--x2GjA", "text": "Apparently I came for opening weekend of their new store. People were outside munching on food, a few gentlemen were playing guitar and violin and the store was busy with people. Hmmm.. I decided to investigate. This store relocated to Lincoln Square in to a new space. The deal is, you become a member, pay a fee, help out the store and you get a discount on your shopping. They have a variety of products, from shampoos, to laundry detergent, (bring your bottle to fill up!), to a variety of your usual supermarket products, bulk items and even some premade food items as well. Hence why people were munching outside. Some really friendly staff members, but I heard one gentleman behind me bitch up a storm about only two registers. I can see how that might be a problem... but I also think that man needed a time out to take a nap, because he seemed a little cranky.\n\nI applaud their effort and what they are trying to do, keeping prices down, help locals and provide some healthier food. Since I don't live in town, I didn't get a membership, however, I do hope they have continued success.", "business_id": "Q9eZS4qDdJo1ker0w3wnMg", "stars": 5, "date": "2008-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "irnzN5lDB32mVrSPiPw7nw", "review_id": "_2HET_xyAChSIX54I1RR5Q", "text": "A clean, bright store with the best organic food prices you will find anywhere in the C-U area. You can become co-owner for a $60 investment buy-in. Sweet! I could co-own a store!", "business_id": "Q9eZS4qDdJo1ker0w3wnMg", "stars": 5, "date": "2009-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IYZlG7UxayDAz9BKXRFQEA", "review_id": "iV1wMu12dAWa-oAA125-Bg", "text": "I really like this little store!  It's really new and clean which is nice.  I don't usually buy produce or anything here because I think it's a bit pricey.  However, this is the place to go if you need any weird or organic ingredients that your typical grocery store doesn't carry!  I have bought bulgar, steel cut oats, wheat germ, raw unsalted pumpkin seeds and other random ingredients here, and they are well priced because you only have to buy what you need.  I love this little store, it always has the odd ingredient that I can't find anywhere else!", "business_id": "Q9eZS4qDdJo1ker0w3wnMg", "stars": 5, "date": "2009-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SpKVX3rt892E-BrL-yeqiw", "review_id": "Bhx-TSGvqEdjBmUvr0uxHQ", "text": "CG is pretty expensive, but it provides a number of quality items in a relatively small space, all the workers are really friendly, and I've always been satisfied with any groceries I've picked out here.  Great stop.", "business_id": "Q9eZS4qDdJo1ker0w3wnMg", "stars": 4, "date": "2009-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "2Ld0xcxVUOoHGz748PM0BA", "review_id": "kJNOPoNsPF8fIUlLJU1btA", "text": "Common Ground gets a lot of flack for being expensive, but really it's only expensive if you're comparing Common Ground's organic items to the conventional items at Schnuck's or Meijer - and several time I've noticed Common Ground's organics were actually priced cheaper than those at the chain stores. You also have to consider the fact that Common Ground is a small, independent grocery store that has to have a higher margin in order to survive - and it tries its best to 'practice what it preaches' in it's business practices, from biodegradable, american-made produce bags to decent employee wages. All those little ethical steps cost money - and since the co-op is community owned, ultimately the money you spend there is going back into the community, rather than in some corrupt CEO's pocket, and that's always a good thing.\n\nApart from my price-justification rant, this is the most awesome grocery store in town. Great deli with vegan options everyday and beautiful produce - often local and organic - that you can't find anywhere else.", "business_id": "Q9eZS4qDdJo1ker0w3wnMg", "stars": 5, "date": "2009-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "loVh5KG1oSlB00bHOO6f3A", "review_id": "OELnLLqFRQhhXolJFJytpw", "text": "Common Ground is everything a coop should be.  The people are great, there is a wonderful community of shoppers/owners, the selection is more than adaquate, and the atmosphere is just perfect.  There are lots of great classes to take advantage of, a nice selection of local produce (best in town next to the farmer's market), and the seasonal displays at the front are really nice.\n\nI also love the fun events held there like the annual seed swap and the occasional music performance on the patio.  I highly recommend taking full advantage of this coop, it's much more than a grocery store.", "business_id": "Q9eZS4qDdJo1ker0w3wnMg", "stars": 5, "date": "2010-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "aFih08FtLzazxbSVvrcMzQ", "review_id": "4kV7YHpU5AiagIUxZw1YFQ", "text": "Common Grounds selection seemed very average.  The did have some local vegetables for sale, but the fruit came from California, New Zealand, and Chile.   We've been here once, but on the next visit to Urbana, we'll try another healthy food store.  The staff was very friendly and sociable, so that's good.   2.5 stars, actually.", "business_id": "Q9eZS4qDdJo1ker0w3wnMg", "stars": 2, "date": "2010-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4EEqDHL5Hn8JE6pFWRmBiQ", "review_id": "PnxtXZfpi-F-erIOXUw6mQ", "text": "My husband and I live near Chicago,, where Whole Foods stores abound.  We're quite spoiled.  We unexpectedly found ourselves about 35 miles north of Urbana for a week.  What to do about food?  I checked reviews of organic food stores online and this seemed to be the place to go.  I set my GPS for the address listed on the website, which was not a good idea.  If you go there for the first time, come in off Vine Street - the address the website gives will have you walking three blocks inside through a mall, and that's if you can find parking anywhere near.  Then you will go out the way you came, and drive 3 blocks to the Vine Street parking lot.\n\nThat said, this place is a gem, thus the 5 star rating.  It has the best that Whole Foods has to offer.  They list the farms their produce comes from, which I found charming. The staff is very friendly and helpful.  You might not find the brands you like, but you will find what you need.  The prices are reasonable, considering there isn't that much organic in town.  I was especially happy to find fresh almond butter in bulk, not to mention beans and grains.  The price range, in my opinion is moderate, as organic grocery stores go.  Happy shopping!", "business_id": "Q9eZS4qDdJo1ker0w3wnMg", "stars": 5, "date": "2010-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YTll4LTysQ6CTeIIFQSctw", "review_id": "-IHd4K4B9S1A8AAZQS6ZGw", "text": "The store is becoming a very very awesome place to shop!!! I must say. I shopped here one year ago for couple of times. It was a good place, but now it is just pure awesome. i decided to become an \"organic\" vegan in early October. So, i really need to find some vegan food that are are to find in normal grocery store. I went there 11/8. The expansion is great. They have more spices, an awesome tea selection and many other changes. Oh, they start to have a salad bar, which is so appealing. They provide fresh side dishes and salads. \nI love their expanded selection for spices.The bulk area just become my favorite part. The fresh produce is on the more expansive side. But, they all locally grown or organic. We all know living healthy in an organic life is very expensive here. It's not their's fault.", "business_id": "Q9eZS4qDdJo1ker0w3wnMg", "stars": 5, "date": "2012-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bd1YoUtW4Hk68pW3J4hXYQ", "review_id": "iDYbZZQTi_yN53dTcz-0vQ", "text": "I'm so glad I found a co-op near Champaign! They have all the products a vegetarian health-nut could dream of. And the employees are not just friendly, but they're knowledgable on all of their products. I even got a recommendation of one employee's favorite Kale. I plan to do all of my grocery shopping here from now on. \n\nThey even have wine!! :)", "business_id": "Q9eZS4qDdJo1ker0w3wnMg", "stars": 5, "date": "2013-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3NU4UJWlsVIl6kSYouaFxA", "review_id": "EnyNaXfJsNP3O3qApELNGw", "text": "I like this place, and the concept behind it, but I find myself only buying one or two little things at a time because the prices here are way beyond what an ordinary student can afford. Generally, the produce prices makes buying fresh food here unrealistic, like 10$ peppers, and they blatantly raise prices on fair trade, organic, cruelty free products by a huge percentage; Meijer has a lot of the same beauty and household products for 40% less for instance. But they are unique, local and have a better selection of the more \"conscientious\" items I like to buy so I keep coming back.", "business_id": "Q9eZS4qDdJo1ker0w3wnMg", "stars": 3, "date": "2015-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "dbI2v-YW32u0j7sAxD6qkw", "review_id": "QGDPyzR2fEMYEjnz93g-mg", "text": "Great products! Organic foods and products at a reasonable price. Nice environment. I particularly like their fruits, vegetables, and bulk items.", "business_id": "Q9eZS4qDdJo1ker0w3wnMg", "stars": 5, "date": "2015-09-12", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "JM9mU9WKzOxCvlsIXbBjqw", "review_id": "zgmVcMB30nA3DPvANOv9Zw", "text": "I think most things here our overpriced and sub-par quality. I do appreciate a few things from this store, including their vegan marshmallows and fresh ginger candy. We are members solely for that reason. The membership is not a good deal financially, but a way for us to say thank you for offering these specialized items to the community. We would otherwise have to buy those two items online. For all other supplies, Strawberry Fields is a closer alternative and similarly priced.  I like that the Co-op offers cooking classes, but there are rare options for vegetarians or vegans.", "business_id": "Q9eZS4qDdJo1ker0w3wnMg", "stars": 2, "date": "2015-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "8O97RbJ486J3qQVOq98Obg", "review_id": "KDVcdknvYP7jN28jwiwOgw", "text": "This is a great place to get organic & natural foods & products. They also have a large bulk section for staples like grains, seeds, dried fruit, granola, etc. The hours are very convenient & the location is right in Lincoln Square where there is plenty of parking for both cars & bikes. It's a nice & adjacent stop from the weekend farmer's market. The co-op has a classroom/art gallery for seminars and relaxing/dining when the seminars aren't in session. There are outdoor dining areas, which are great when the weather's nice. I do have a habit of stopping by to have a coffee & scone before I pick up groceries. The place is laid back & clean. It's consistently an enjoyable experience.", "business_id": "Q9eZS4qDdJo1ker0w3wnMg", "stars": 5, "date": "2015-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pYt8vLzszegpqyl0ufeQaw", "review_id": "pATxWllTQQU03ccdPI7q2w", "text": "Best little coop in the Midwest!!!  And of course I am not prejudiced because it is in my hometown - really!  Been a member since the 80's and proud to see how it has grown up and become such a vibrant place and hub of our community.", "business_id": "Q9eZS4qDdJo1ker0w3wnMg", "stars": 5, "date": "2015-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "00P4xh_HkxbZ9YzH8psfXw", "review_id": "pvqtrfyBGlLGpverfQNGYw", "text": "If you are looking for more commonplace ingredients, I would look elsewhere.  BUT, If you are looking for foods or hard-to-find ingredients from the Middle East/Mediterranean countries or Europe, this is a great place to go!  The prices are reasonable, and they have a very extensive cheese and olive selection at the deli counter.  There is a large variety of canned goods including pickled vegetables, jams and preserves, dried fruits and nuts, grains and legumes, spices (including bulk), teas and imported chocolates, rose (and orange blossom) water and pomegranate syrup, ready-to eat curries, imported olive oils and a freezer section.  I would say there is an emphasis on fresh/frozen Middle Eastern or Indian foods, and on canned European foods.  All in all, a very interesting shop, very fun to look around if you want to try something new!  Also, there are weekly sales (Saturdays I believe) on their cheeses.", "business_id": "qSwb2VJNzCKfY4FvqJM4eQ", "stars": 5, "date": "2009-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1YPTJgdCvyM7qbk461aNUg", "review_id": "aPl-slbXGCUlSmhn_85hUQ", "text": "This store has been bought out by the people who own Bombay restaurant, and is primarily an Indian grocery now. I really miss Euro Mart.", "business_id": "qSwb2VJNzCKfY4FvqJM4eQ", "stars": 2, "date": "2010-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Ujrg8-TO4r55Yh8QkC0DEQ", "review_id": "6hfCMrOlDYfh9bJ6XLr3HQ", "text": "Help, I'm addicted.  The Natural Gourmet (NG) deli has the BEST authentic Thai curry anywhere in town!  Order it with an egg on the side and you'll know what I mean.  They don't hold back on the spice, so if you don't like to walk on the spicy side, definitely ask about milder menu options.\n\nFor the relatively small storefront NG has a great selection of bulk foods, vitamins, teas, gluten free paraphernalia, snacks, drinks, cleaning products, etc. You won't miss big chain natural food stores once you visit this place!  Go out and support this wonderful locally owned business.", "business_id": "KFbxRthy3tKt-oi1Jp7XdQ", "stars": 5, "date": "2013-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "N4JX0lJ92GoO87qhLSipOA", "review_id": "vCtg6L74hmJtvF0YwOPBvA", "text": "They know their supplements and food in and out. They carry the best brands in the industry. This is my goto spot for my health as they have always been their for me when I needed them most.", "business_id": "KFbxRthy3tKt-oi1Jp7XdQ", "stars": 5, "date": "2015-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "irnzN5lDB32mVrSPiPw7nw", "review_id": "1PtOiTB1SqDuwTKluiU5Sw", "text": "I don't think they like white people. I went there once, and the women who were working there stopped what they were doing and just stared at me as I browsed, glaring, and pointing at me and saying things to each other in another language. There was another woman shopping there who was Asian and they didn't do the same thing to her.  It was kind of offensive, but whatever.\n\nThey have good, cheap produce and lots of imported canned and boxed food.", "business_id": "BnHVssX00VthoSNsMVO51g", "stars": 3, "date": "2009-09-07", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 1}, "user_id": "urDog6OhPoNKPJFUDob7AA", "review_id": "sd4szhMBxXcpRyp2W9CZCg", "text": "The first thing one notices about this grocery store is that it looks more like a crack-house from the outside than anything.  Actually, I'd passed it many times before without knowing it was actually a grocery store!\n\nInside, it's not much better in that it's pretty dark, musty, and just makes me feel dirty. \n\nTheir aisles are narrow and things are somewhat organized and categorized, and despite the fact they probably have the most variety of all the Asian grocery stores, you'll probably spend a lot more time looking for what you want than anything else.\n\nPrice-wise, they're okay, but I don't know if they take credit cards or not... I get the feeling that they may not. \n\nTo summarize:\n\nPros:  Lots of variety, relatively inexpensive\nCons:  Dirty, can be difficult to locate what you're looking for\n\nThis is the Asians' Asian grocery store.", "business_id": "BnHVssX00VthoSNsMVO51g", "stars": 3, "date": "2009-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "LBvI6vU-vTrfjH0IQQVsMg", "review_id": "zgzU32j0z_lhUgb1r6my3g", "text": "Extremely dilapidated, inside and out, but the shelves and boxes are a treasure trove of cheap, fresh eats. Employees are friendly and will help carry heavier purchases (like sacks of rice) to your car.", "business_id": "BnHVssX00VthoSNsMVO51g", "stars": 4, "date": "2010-09-24", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "BgufyyNv3vLxYM6iI0Laog", "review_id": "hpryCgvkkHLHryLt1D8cpA", "text": "Far East is simply the best one-stop shop for S.E.. Asian food In Champaign-Urbana. Keep your eyes peeled or you'll miss it as you drive by! Fresh vegetables the likes of which you will never see in other grocery stores! A vegan owner who stocks as many meatless items as she can! Aisles that are SO SMALL because they have SO MANY things available! REMEMBER TO BRING CASH. They accept no other forms of payment. A delightful place with wonderfully polite and helpful owners and employees.", "business_id": "BnHVssX00VthoSNsMVO51g", "stars": 5, "date": "2011-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "ncZxFHnFa9c_9Y33bVzKLg", "review_id": "BXSbhGW66_dhoEtmTlMfbg", "text": "Absolutely my favorite Asian market in C-U. Good for staples like big ol' bags of rice and frozen dumplings as well as for stranger stuff like yellow bean paste and tamarind juice. \nThe family who runs the store is always helpful when I need assistance navigating their packed aisles. The owner is vegan and she's been stocking more and more faux meat products which is AWESOME! Their fresh food section has been getting better and better with each visit, too.\nCash ONLY, don't forget! And they look a little uninviting with the concrete exterior and tiny house-door but inside it's a wonder land.", "business_id": "BnHVssX00VthoSNsMVO51g", "stars": 5, "date": "2011-09-04", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "OIsiWVC3p8gDZ8rP-bdFVw", "review_id": "_MuomhXFQu5CvPyukjEfcQ", "text": "Far East is very close to my sister's apartment.  When I helped my parents move her in I said to them, \"what's with that creepy crack house back there? Are you sure this is a safe street?\"  My sister nodded in agreement and gave a funny look.  My mom said \"it's an Asian market, they probably have THE BEST produce around.\"\n\nWell, mom knows her stuff.  Yes, it's creepy from the outside.  Yes, it's a little weird smelling when you first walk in.  But the produce and authentic Asian things are SPOT ON.  I bought produce and drove it home to Chicago.  That's how good it was.\n\nThey also have all of the condiments your at-home-Asian-cooking-heart desires.  Curry pastes, chili sauces and oils, sriracha, marinades... you can cook Asian food every day for the rest of your life.\n\nLet's not even start on the candy.  Yan Yan.  Pocky.  KOALA YUMMIES.  I die.\n\nCASH ONLY so be prepared for that.\n\nI wish I lived in between Far East and World Harvest!", "business_id": "BnHVssX00VthoSNsMVO51g", "stars": 4, "date": "2012-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "51Y4XFOJcGj-5XWBRUSySA", "review_id": "MXXmqJsCp6P_tkYv4dCkqQ", "text": "Great place to get Asian Food!", "business_id": "BnHVssX00VthoSNsMVO51g", "stars": 5, "date": "2013-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "FEdf0Lh9F7TxCV1Xct75jA", "review_id": "tioHXdkrjSKTPUQ1o96hIw", "text": "Really don't recommend to shop in this store. Lots of foods are expired and still on the shelf for sale.", "business_id": "BnHVssX00VthoSNsMVO51g", "stars": 1, "date": "2014-09-26", "type": "review"}
{"votes": {"funny": 4, "useful": 1, "cool": 1}, "user_id": "47O4htgjIeTTv6cJ-kgRxA", "review_id": "rx9kLMmcjB7u9sbRjAzLag", "text": "Moonstruck is definitely not my cup of tea. The prices are outrageous, the selection is not great, and they are probably the only coffeehouse type place that does not have wifi by now. It is just too snooty for the common student looking to get a beverage or something sweet.\n\nOh and as I type this, I just remembered that the last time I was pulled in there by my fiancee because she \"had to have something sweet\" I went to sit down in one of the big chairs to wait for her and there was melted chocolate all over it. Not cool.", "business_id": "31LKw0AjFdCvGH2fIE0cwQ", "stars": 1, "date": "2008-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "HJZfQadmdoa9qsZ4R1xEGQ", "review_id": "X70KSMqKrn-WzIQmdhsIDw", "text": "Moonstruck is a mixed bag of goodies for me.  On one hand, they have some amazing drinks, especially their hot chocolates.  On the other, though, everything they offer is pretty expensive, don't even get me started on their chocolate prices.  A lot of the times, their drinks are so sugary or...something...that if I don't brush my teeth immediately afterwards (particularly the tongue), it'll start hurting within several hours, so bad combo if you are pulling a desperate all-nighter studying.\n\nOh, and no wi-fi.  They do have a very nice second floor, though.  But still, no wi-fi.  Are coffee places even allowed to not have wireless anymore?", "business_id": "31LKw0AjFdCvGH2fIE0cwQ", "stars": 3, "date": "2008-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "AGOmxrO-YUnltljd0SI08g", "review_id": "VQAdV1MXbLxNZH8hydhn6Q", "text": "Bittersweet review.. I loved Moonstruck!!!!  I really missed having a chocolate cafe around when I left Champaign.. I loved the dark chocolate circles resting on the pillow of whipped cream floating on a dark chocolate heaven of delicious creamy liquidy chocolatey goodness.  I also loved the times when I was able to indulge in an expensive bite of a chocolate truffle (especially loved that dark chocolate truffle shaped like a cute little dog).  I had discovered there was one in San Francisco, and only got to go there once.. and now, none of the Moonstrucks exist!!!!  I guess you can only truly appreciate things when they're gone.. Moonstruck, I loved you so, and I will always hold you dear in my heart.", "business_id": "31LKw0AjFdCvGH2fIE0cwQ", "stars": 4, "date": "2008-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "sleEMt44E1StWrjz3mcujQ", "review_id": "pv74Jc6jXWRV1aRM8yuv4A", "text": "I probably would have given moonstruck threeish stars when it was open, but I can't give it any stars any more because it's closed!  That seemed kind of sudden!  I wonder what happened / what is going to go in there instead.  Panera pleeeaaasssseeeee.", "business_id": "31LKw0AjFdCvGH2fIE0cwQ", "stars": 1, "date": "2008-10-25", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "IYZlG7UxayDAz9BKXRFQEA", "review_id": "7xLkb2tPfHUJZHcjq6q6Kg", "text": "What?????  Moonstruck is closed?????????  That was my favorite date place ever!  Their vanilla icecream sundaes with chocolate fudge are to die for... no joke!!  I will never find a place that even comes close to how amazing their sundaes are when I'm on my cute lil dates with my boyfriend.  I never want to go on another date again =(", "business_id": "31LKw0AjFdCvGH2fIE0cwQ", "stars": 5, "date": "2008-10-30", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 3}, "user_id": "eBFm-lABQiKpaUcPDfYOgA", "review_id": "WB7M8ybs76FcL4z4DIdGKQ", "text": "This is my favorite Mexican lunch destination downtown. I've started coming here once or twice a week because they have a huge, cheap, and pretty interesting menu as well as a great bakery.\n\nThe one star off is unfortunately for the main course there. There has always been something a little off in everything I or someone else gets there when I've gone. They have great freshly made tortillas, but the filling for the Vegetarian is pretty bland if you ask me. A friend got a Carne Asada burrito and he said the meat was pretty fatty. They have an interesting selection of tamales but they've all been kindof bland as well. The tacos have always been the best, but it's pretty hard to screw up a taco.\n\nBut they have a whole bunch of unexpectadly weird dishes for a cheap counter service Mexican place like Potato tortas and aforementioned large tamale selection including fruity tamales that make it so you can have something different every time you come. \n\nBut my favorite part is getting something from the bakery after the meal. Check out the pic on their website of their selection, it is very impressive. The highlight for me is the carmel filled churros, which when served fresh, will make you see God.\n\nThey have  a cool market with hard to find tools to make your own Mexican feast, a meat counter, and rockin' Horchata too.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 4, "date": "2007-09-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "VBEbhE0ISjg6xowGNiGmgQ", "review_id": "FT4AOlDbHeOLAzX4GwzvFA", "text": "Cool place, great for a weekday lunch (as long as you don't mind smelling like Mexican food for the rest of the day).\n\nThe taco is the best I've had in Arizona, and the super-nachos are so big, it's kind of embarrassing to walk through the restaurant with them.\n\nAlso - the bakery is excellent! You can visit twice a week for a year and try something new each time. The stuffed churros are particularly delicious.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 4, "date": "2007-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 5}, "user_id": "mF3VUdKq6kR-MXaFaRfzQg", "review_id": "Nzd4N-RQMHo3JCsmODjrjg", "text": "The key here is to go in when they open their ovens baking some of their excellent pastries. I never leave without getting a freshly baked crossiant or churro. My wife introduced me to La tolteca and we have been making regular trips back ever since. We started out with breakfast burritos on weekend mornings and I have now fit it into my drive home from golfing for some tacos. Both of the aforementioned are excellent. \n\nIt is really hard to find authentic homemade Mexican food and this place does it perfectly. I was convinced when I had my Mother-in-law's homemade rice and tacos that it was the best their was. I am not saying that Tolteca is better but it actually tastes close to the same. \n\nA little hint: Once it cools down a little bit, fall and winter months, they have a huge charcoal grill setup in the parking lot on weekends. You can get cooked whole chickens and full racks of ribs for around 8 bucks. They also cook fresh green chiles. A great alternative on game days when you don't have time to setup the grill before the game starts. Just run down and pick something up fresh off their grill!", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2008-09-02", "type": "review"}
{"votes": {"funny": 10, "useful": 2, "cool": 4}, "user_id": "g84VjttN28PWiv_WtdhnSQ", "review_id": "_ck8yGoIEgZY6exQ90IKWw", "text": "Words cannot express my love for La Tolteca. Well, not English words and I no habla Espanol. But I'll try...\n\nSUPER NACHOS MOTHERFUCKER!!!\n\nNacho cheese, tons of cilantro, chicken, beef, beans, onions, tomatos, salsa, more cheese piled into a HUGE box. A huge box!\n\n............................................................................... THUD\n\nI just passed out.\n\nAlso great everything else. and cheap as hell. Like pesos cheap.\n\n!ah dios mio!", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2008-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Z1lPtIHU7bRoIvuVa01H5w", "review_id": "zvKVIxubZ6iNoOnZqZNehQ", "text": "Atmosphere inside is kinda like a Mexican version of Chompies -  good sized counter restaurant flanked by market and bakery, oozing ethnic energy.  More intimate (and less overwhelming) than Ranch Market; a plus for tentative gringos like me.  \n\nIt's a lengthy and fun menu to pore over and the place is airy enough that no one glares at you if you take extra time figuring out what you want, before stepping in line to order. My carne asada torta was really satisfying, smeared with guac, grilled onions and juicy beef on a nice, crunchy roll. My kid didnt get too excited about his chicken enchiladas - just average he said.  Next time we'll try something a litle more exotic, maybe grab something from the bakery. \n\nTo be frank, I wasnt real comfortable in the neighborhood outside. Cant say if that's objectively reflected in crime statistics, and nothing bad happened to us, but there's a slew of chop shops and homeless/marginal looking types milling around and I spent part of our meal worrying about the semi-hidden laptop back in our car. We went Friday at 2PM, a fairly quiet hour, and maybe the vibe is busier - and safer - on weekends or at noon. \n\nHate saying that, cuz La Tolteca's a cool place worth visiting, and the surroundings obviously arent their fault, but next time I might take the bus,  \"travel light\" as they say, and enjoy the entire experience a little more.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 3, "date": "2008-11-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "4mRx2noRJ1FFRPlzSVEEdQ", "review_id": "5mAA3vuj8dtF5UcZCK54OQ", "text": "One of my favorite lunch places. Smoke from the grill fills your nose (and lungs) as soon as you walk in the door. Mmmm, grilled meat. The carnitas are always good at this place and the grilled shrimp tacos rock. The Mexican pizza is what it's all about; chicken or beef, it's piled high with lots of good stuff.\n\nIn addition to the freshly cooked food, La Tolteca has an extensive selection from the bakery. Tons of sugary goodness. There is also a small market with some fresh veggies and a butcher shop, including roasted chicken, ribs and carnitas.\n\nIf you eat there, be sure to check out the murals on the walls.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 3, "date": "2008-11-25", "type": "review"}
{"votes": {"funny": 5, "useful": 4, "cool": 2}, "user_id": "--65q1FpAL_UQtVZ2PTGew", "review_id": "LFWEeRH0I_6LydPupVthlw", "text": "Okay, so because I'm so excited to have eaten here, and I want to use obscenities to describe the deliciousness, I have decided to replace any PG-13 words with PG words. And....\n\nThis place was flippin' good! I mean, gosh darn! How the heck did they just do that? Each bite made whoopee to my taste buds and stayed around afterwards to cuddle! It's not everyday that I find a restaurant that I absolutely want to be a regular at, but La Tolteca is a restaurant that I can see myself having a healthy relationship with, and, if I'm lucky, possibly growing old with. I'm all for market-style restaurants, and La Tolteca seriously nailed it!\n\nOkay, now that that's out of my system, here's what I tried: I tried the chips and salsas, huevos rancheros and the chilaquiles. The chips were fresh as can be (still warm in the bag), and the salsas...oh the salsas...they were all great, but the stand out had to be the habanero. It was definitely one of the best salsas I've ever had, and my girlfriend considered it the best she had ever had. That's not to be taken lightly because we eat salsa almost religiously. Because my girlfriend got the chilaquiles, I went with the huevos rancheros. They were piping fresh and everything one would expect. The second I cut open the yolk of the egg and saw the yellow and red run together, I knew I was in for a treat. The flavors of that mixed with beans and a little rice were really great! For those of you that have had good huevos rancheros before you'll know what to expect. Alright, and lastly the chilaquiles. In all seriousness, these were the best, and I mean the BEST chilaquiles I've ever had! I'm not sure exactly what was going on in the kitchen, but I suspect a tiny sprinkling of crack right before it was served to us, but that may have just been the garlic. Either way though, it was phenomenal! Every single bite made me so happy, and even after everyone was full at the table, we still managed to pick away at it until it was completely consumed.\n\nEvery person reading this needs to do themselves a favor and endure the trip to Central Phoenix for this place. If you love Mexican food (especially chilaquiles), La Tolteca should not disappoint in the slightest.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2010-09-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "o_hE7YEoqz_NqAzkLUenyg", "review_id": "JPt0eyNLFBmUEIqiBOQp7w", "text": "Someone recommend this place for my trip to Phoenix, so I thought I would give it a try. \n\ncarne asada burrito\nFish tacos\nSuper Nachos\n\nI'm kicking myself for not yelping this place first and checking out the famous items. Upon arriving the location I was totally overwhelmed by the menu, people and the bakery/market. I'm not use to seeing this back in Cali. I was somewhat in a trance and didn't realize what I was ordering until after I got my food. I wish I put more thought into it. Don't get me wrong, the food was good but I wished I got something else. \nMy only complaint was that my carne asada burrito was more tortilla and beans then meat.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 4, "date": "2010-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0LuN0DGTCkzpjAD3NyNN8w", "review_id": "lzeyxhDbKY-zV19e2sPCYQ", "text": "Places like this are the highlight of living in Arizona. Good access to cheap, delicious and authentic Sonoran food. I tried Chilaquiles here for the first time and they were amazing!! The horchata was pretty run of the mill but the empanadas were fantastic! \n\nI also really like the market they have. A really great place to have in the neighborhood.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2010-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Iycf9KNRhxvR187Qu2zZHg", "review_id": "H74KJByESDDQ_iYlRwTNfg", "text": "My Dad and I went to get some latin food.  I have been before so I knew what to expect.  This place has really good authentic food at a really good price.  \n\nI got the Posole which was excellent and a huge portion and I got a beef tamale.  I also had the cantaloupe drink and it was awesome.  \n\nIf you haven't been you gotta check this place out.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2010-10-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "VlqFUnyvNK5TAwdIllGYdw", "review_id": "52fnxFdFkIIhXd7uR_ngyw", "text": "If you are looking for great authentic Mexican food, with the mindset of not having to roll out the cash, check out La Tolteca.  It is located in central phoenix and provides a lively atmosphere.  It is unique outlook, having the tri-fecta of restaurant, bakery, and market; it provides everything you need for a good breakfast, lunch, and/or dinner experience.  Once famous for its \"super burrito\" eating time challenge, in which eating 3 \"super burritos\" in 3 minutes would win 300 dollars, the \"super burrito\" remains its main attraction.  So whether you are looking for a new taste or an authentic one, and want to do it while saving money, come and visit La Tolteca Restaurant.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 4, "date": "2010-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "INevu6OWYEOI2q4zD3UCFA", "review_id": "w95_L-rizg0Knofaq-GPiw", "text": "I thought it was okay.\nMy food came really wrong.\nI really liked the chips.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 3, "date": "2010-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "-OMlS6yWkYjVldNhC31wYg", "review_id": "av8sH8T8flbgPVoVejwFRA", "text": "I love that I have a slice of Mexico in walking distance from my apartment.  I always get the exact same thing at La Tolteca.  Chicken enchiladas with rice and beans.  Green sauce.  No lettuce.  With a side of the tomatillo salsa.  I should probably try something nice, but if it ain't broke, then why try and fix it.\n\nWhat's great about La Tolteca is that it is a to go place, a sit down restaurant, and a bakery.  It's festive and inviting inside even if the Van Buren surroundings sometimes aren't.  \n\nSo to summarize: authentic, affordable and delicious Mexican food.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2010-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "tQ5wiJ9TGUbmIqnO4-njWg", "review_id": "RHkOqllo1JOxeyjAkdk-oQ", "text": "La Tolteca is one of those Mexican gems in Phoenix that I get worried about too many Gringos (hey, I know I am one of them) finding out about.\n\nCheap, tasty. It is a seat-yourself eatery and small market combined with a bakery. I like that they have a decent selection of baked goods, but there are a few local panaderias that do it a bit better. HOWEVER, their salsa bar is top notch and their food is delicious. I personally love La Tolteca because it is one of the only places in the valley that regularly has green corn tamales available. The staff is always very pleasant, and the food is always good.\n\nThis place does get pretty hectic at meal times and on weekends, but the seating area is rather large. Sometimes the service gets a bit backed up, but honestly, it just adds to the lively feel of the place.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 4, "date": "2011-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DghMl81bONCh5ELnrgn4Fw", "review_id": "_w7cOBX0ENmdVKeOK2CZEQ", "text": "Service is fairly decent. Don't expect to hear \"can I help you here\" but a \"what do you need\" look. The food is a little above average. Serving size is large, guacamole is fresh, tortilla's are warm & flan is delicious. I recommend the fish taco's, the chile relleno burro and calling in your orders.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 4, "date": "2011-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "sWtIduPNp6MtUPrGnDcb8Q", "review_id": "-70Qy0NxVLmIU_V8BYqChQ", "text": "I love the legit places in the downtown neighborhood that have seen it through all of the transitions and still are respected and are staples in the community. La Tolteca is one of those Phoenix restaurants that has been there for decades. My grandmother used to buy her corn husks from them to make tamales, which is so amazing to me. \n\nI first went here for a burrito and fell in love with it's legitimate Mexican street food taste, and it filled me up and made me happy! The atmosphere is festive. You order at the counter, gaze at the bright colors surrounding you, and watch the wide array of people eating and talking. It's festive! There are no frills here, it is just simple and delicious. I have been back for the huevos rancheros and love the runny eggs and beans and fresh tortillas, aye! So good. I will keep supporting their authentic menu and spreading the word!", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 4, "date": "2011-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HpxGTDm60d9JapjN36JFSQ", "review_id": "82chWvbSE1dJCIDlqfwOGw", "text": "This has to be the most ghetto and disrespectful dive I've ever been to. I usually don't play the race card, but unless you are a Spanish speaking Latino you will not be treated well by the staff.\n\nAs soon as I walked up to the counter, a pregnant cashier rolled her eyes and asked dully what I wanted. I couldn't pronounce the name of the combo I wanted but I blurted out the number associated with it and it had a picture. She looked over her shoulder at one of her associates and said something. The only words I caught were \"token gringo customer.\"\n\nThey shared a giggle.  They were speaking in that half-assed Spanish that has a little English mixed in. Suffice it to say I was offended and promptly cancelled the order. I have not returned since then", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 1, "date": "2012-09-04", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "nN3Ym_sgqI5EQuC4AIJprA", "review_id": "O6_FzyCtiRWQknLtE-SBGg", "text": "With 4 stars on yep I was hoping for a tasty breakfast but after a long wait I got a plate of overcooked eggs, weird tasting greasy bacon, completely undercooked potatoes (how hard is it to cook taters until they are brown?) and the toast they served tasted just like the greasy grill, terrible. It was all really inedible as was the Menudo that my girlfriend ordered. Disgusting. Also people are in there at 10am drinking large beers, very weird place. Is it a restaurant, store, bar? Not sure.. I am sure it sucks though and I will never go back.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 1, "date": "2012-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nDztQkdW7-gypP7GEFucQg", "review_id": "wXq6IblkYg6MxoyuOOM2dQ", "text": "If you want true Mexican food at a very reasonable price, and your plate not just full, but spilling over with spicy delights, this is THE place! I will definitely come back here!", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2012-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "i0A-c2yoHySmFhRV2sDR1g", "review_id": "git4_N9M1tquE4W9TS1IXw", "text": "This place has the best street tacos in Central Phoenix. I generally come here for lunch and order the tacos but they have lots of other great stuff. They also have a store here where you can get soda, beer, snacks, etc. They have a really good bakery here also. They do all their grilling over wood and the food has that great flavor. I sometimes get chicken and ribs to go from here and it is always really good. This place has been in Phoenix a very long time, I know I have been coming here for over 15 years and I will keep going back!", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2013-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y5m29ud-52jT2y4Xt6WGKA", "review_id": "W6QLc27uDQcx3llYLz8lpg", "text": "La Tolteca is outstanding. Passing through PHX and a friend (and frequent visitor to AZ) told me I need to stop here. He spoke truth. \n\nGet the chilaquiles! Get them. \n\nWe also had tacos de papa, and caldo de camarones...the latter was awesome too, delicious broth and packed with shrimp. The salsa bar had grilled jalapeños & habanero salsa we couldn't get enough of. \n\nI'll be back to La Tolteca. Five stars no hesitation.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2013-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0tfE1NWvtCOWhJ-UXdZJMg", "review_id": "d9kFSxkXjrwaOlUqU1JuNw", "text": "Good authentic Mexican food and panaderia. The price of the platters was slightly higher ($7-10  a plate) than I expected but the flavor and quality reflected that.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 4, "date": "2013-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2CG5Yx6i0-QrIZXu4Rtj1A", "review_id": "zKikTnvz2J3Z-R_giKbB4w", "text": "Soooo disappointed - been going here for years for the guacamole salsa, and tonight we find it's no longer there.  On top of that, the shrimp burro which is my all-time favorite now comes full of green and red peppers and onions and very few shrimp.  The menu does not say anything about green and red peppers, and when we went back up to the counter, we were told the menu has changed even though the changes are not noted on the posted menu and they weren't happy that we didn't like the changes.  After all these years of going there - not again!!!!!", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 1, "date": "2013-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "azzUC9-iKKz452R6u_ezLg", "review_id": "6KpV2g0aOVTD4Dn70ciorA", "text": "In 3.5 years I have eaten here at least 50 times. I have never had a bad meal \n\nTo say that I love this place would be an understatement. La Tolteca has the best casual Mexican food in AZ. Maybe in the entire nation. \n\nFirst of all everything is made in house. Try the Fish Tacos, they are off the hook amazing and so inexpensive that they blow my mind. Grilled Mahi Mahi, fresh corn tortillias, crema, cabbage, cotija cheese. A winner.\n\nThe Tacos de Papa are addictive. \n\nThe Ceviche Tostada is something that I dream about. \n\nIf you are into burrito's check this place out, awesome big rolls of home cooking. \n\nThe Carne Asada is delicious and so is the roasted chicken. OH MY GOD. \n\nTry the Elotes, all the grilling is over mesquite charcoal imported from Mexico. This is where I fell in love with grilled corn. You will thank me. \n\nThe bakery is loaded with delicious sweets. Take home a box of treats.\n\nI love you La Tolteca. Thank you for making my life so much nicer and saving me crom mediocre food!!", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2013-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0Or4llmCY1KYB64B067ZFg", "review_id": "idmqKQBAvaX4TOm6J5jV2Q", "text": "Great fish tacos, fresh baked tortillas, good salsa, and chilaquiles and a michelada are the perfect hangover cure.  Just nene to have more consistent hours and quicker service at the register.  Usually quick, but one time it took 20 mins to order.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 4, "date": "2014-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MNfOCJZsbtMbnDlvJ1LKeQ", "review_id": "NeABJ9xKXVqujVkJtk3qJw", "text": "I have been coming to this place for as long as I can remember. I like having the torta cubana here. I wish they still had the ice cream tho...", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2014-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CUqse8ltC31lKuqH_X4u9A", "review_id": "oUY2--R7AFsW8yfyoLWXBg", "text": "I love it that the restaurant smells like delicious smoked meats. I had the chilaquiles with carnitas and it was very tasty and a lot of food. The meat was very flavorful and a mixture of crispy and juicy. The salsas from the salsa bar are very good too. The atmosphere is very vivid and friends have said it looks like something right out of Rocky Point.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2014-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YXiTWdPwuY5uXSUPfZZhRQ", "review_id": "d_cpAYbkFmcYIDFANSfrjw", "text": "We are from out of town and was staying at a local hotel. Our family loves hole in the walls. On our way out of town we saw this place and decided to stop in. I love the smell of the authentic Mexican establishment. We were behind 6 fireman that were ordering their lunch. Watching their food be prepared was a treat. But not as much as our treat when we ate our food. We had the shrimp salad, shrimp burrito, and chicken taco. Everything was great, great, great!", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2014-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aXFzrKH6CW5t_VlHXar04g", "review_id": "CldPfuvt_LBeZsG0sSnj5w", "text": "I totally dislike this candy store to begaig with i went to this place 5 minutes before they close and the open sign wasn on.  They said its close come back tomorrow at 9am I went next day at 9am but it was still close never open waited there for 30 minutes and  I went to another candy store the name is Mayra's the lady was very helpful and nice!!!!!!! and thanks for letting me express my self......", "business_id": "ypj60fU8wsiOkMjxayBgGg", "stars": 1, "date": "2012-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vlaBRMZrMGSs5GHAWT9OeQ", "review_id": "iYIs06c7C5cKZNB9kilLMQ", "text": "Worst customer service ever. I had an issue with a rental of chairs and tables and the cashier was rude, disrespectfull and unhelpfull. The tables were dirty and breaking apart the chairs were filthy. I agree with the previous comment that the pinatas are nice and sturdy but thats about it.", "business_id": "ypj60fU8wsiOkMjxayBgGg", "stars": 1, "date": "2013-10-01", "type": "review"}
{"votes": {"funny": 18, "useful": 13, "cool": 14}, "user_id": "C8ZTiwa7qWoPSMIivTeSfw", "review_id": "SV3tciZCCvGa6N-LVnZ5VA", "text": "Gourmet markets, to me, are like candy shops to a sugar freak. \"Hello, my name is Thomas. And I am a FoodAholic.\" There I said it. Do you feel better. Huh? Oh. Sorry. Didn't mean to get so defensive. But how can you defend AJ's? How? How I ask you? Ok, so it's REALLY expensive. And, yes, they should provide a blood donor center at the entrance to give cash on the spot for shoppers plasma. I HATE huge markets. Fry's too big. Safeway just right. AJ's just right and then some. The produce section is perfection. Not mounds and mounds of produce you know is wrinkling and rotting more than Bea Arthur in season 6 of the Golden Girls. Cute little baskets hold just enough fruit and veggies to select from and not too much where you know it's all riddled with germs and spiddle. The meats and cheeses? Oh, my! The filet (at a whopping $34.99 a pound) is worth every bite. Of course it'll be a year or so when I would pay that much again. Hello? Blood donation station idea! The ready made food is dee lish...curry chicken salad and brocolli delight to name two. Yes, it' s called brocolli delight. My gay ass did not name it. I would have called it beautiful broccoli. Just rolls off the tongue better. I've never had a cart wobble...see Fry's review...they ride smooth and apparently are good for the enviornment. Flowers, baked goods, dishes....AJ's. It's here. I'm queer. Get used to it.", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 5, "date": "2007-09-17", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "APLIPfq1Rf8QyhHHk2uAyA", "review_id": "aFwmlzQ5j-WRd861U778Jg", "text": "UPDATE (11/26/07): If you're craving a home-made pizza, you can buy pizza dough at this particular location. It's from their little corner \"Italian bistro\" where they actually make pizzas. Imagine that. They have a simple menu too, and you can call in your order. That's cool. What's even cooler, though, is buying the dough and make your own special pizza, which I did. The crust turned out great!\n\n* * *\n\nHere is where I'll find my new favorite bread, AJ's brand. It's multi-grain, only 70 calories a slice with 6 grams of protein in each delicious cut. I couldn't ask for more. \n\nBut, since I sometimes go shopping for more than bread, I know you can find pretty much anything at this AJ's, especially when making unique and exciting dinner entrees. From cheeses to nuts to produce and wine, you'll find what you need here. If you have any trouble, just ask. The people working here are really quite friendly. I actually enjoy going to a grocery store - GASP - so I can tell you that this place far outshines other retailers. Of course, it far outprices them, too. But, if it's a special affair or you just don't care, then this AJ's is for you. \n\nI love how it's in walking distance too, situated in an easy-access plaza that offers other interesting treats, too, like Booster Juice and Sweet Tomatoes. \n\nOh, did I mention this place has a great beer selection? You can buy the 6-pack, sure, but for those nights when you're uncertain of what you're craving, you have the option of buying a single beer - mix and match, if you will - and not choking on the cost. Single beers here are cheaper than what you'll find at the bar. Granted, although it comes chilled, you can't open it on the spot. Wouldn't it be great if you could? (Beer tasting, anyone?!)\n\nIf you're not fond of beer (my god, what's the matter with you?), then peruse the liquor or wine selection. You can even find Mexican tequila that isn't your typical Jose. As for wine, I have always loved AJ's selection. Now I love them even more after discovering my new favorite Italian meritage. Cheers!", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 5, "date": "2007-11-13", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "MphD7VDOEb1KTjIp-oFoMw", "review_id": "iH9MZQhig33S3hHNq0sDVw", "text": "I love, love, love AJ's!!! Jason, the bakery manager, is a miracle worker! He made the perfect cake for my mom's 60th birthday party! We ordered a carrot cake with REAL cream cheese frosting and walnuts with blue & yellow writing and little sugar butterflies. And GLITTER!!! Yah, they have eatable glitter! And my mom the pickiest person I have ever met loved it! All I can conclude from this is that Jason must be an angel because I still cant figure out how to please my mom but Jason did it with just one cake! Anything I needed Jason was there like our own personal cake concierge. I would absolutely order from them again.\n\nThey also have Barb's Bakery cookies and Tammie Coe Cupcakes. I love that they support local small businesses. They are a little pricey but everything you get in return is well worth it!\n\nP.S. Did I mention the cake was amazing? The absolute moistest carrot cake I have ever had and the cream cheese frosting... I mean it was real homemade cream cheese frosting not from a plastic tub. Sooooo yummy! I still dream about it... Yes, I know I have a problem.", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 5, "date": "2008-10-15", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 2}, "user_id": "VBEbhE0ISjg6xowGNiGmgQ", "review_id": "yOLGmycvwfI4FDcxsAQG1g", "text": "This place sucks.\n\nAJ's already pisses me off for being so ridiculously overpriced, but  this location is dirty and poorly run to top it off. \n\nOk, to be honest, it's not THAT dirty or poorly run, but I did once buy a refrigerated package of hummus that already had mold on it. \n\nI would probably give this place 3 or 4 stars if not for the prices. The prices are just stupid. The beer selection and salad bar are ok, but again, did I mention how maniachally expensive everything is?\n\nI also don't cook a lot. So maybe this place is useful if you cook a lot and you need some ingredient you can't get anywhere else. But in that case, you'd still have to be the Prince of Dubai to be able to afford a lamb chop and a jar of imported chutney (or whatever people who cook put in their food).", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 1, "date": "2008-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "4oBViNYcsWpPexC405Gh2w", "review_id": "s266hIg6zCOdH5fcd9fDZw", "text": "I, like most that frequent this AJ's, reside in the downtown Phoenix area.  I am just a short drive down Central Avenue but there are several grocers closer to me.  I shop exclusively at AJ's for a few reasons.  \n\n1.  The quality of the groceries far surpasses anything available anywhere else in the city.  \n\n2.  I am an unusually busy Healthcare Administrator  who does not have any time to waste on typical grocery store games.  The staff at AJ's are continually resourceful and courteous.  They are extremely helpful. \n\n3.  The prices!  AJ's has the highest quality product at an incredibly fair price.   I do all of my shopping at AJ's.  \n\n4.  In addition to the quality of their product, their staff, and their prices, AJ's also prepares hot food throughout the day.  I eat breakfast there everyday, and frequently dine there for lunch also.  \n\nI would highly recommend AJ's to anyone who seeks a high quality product and wants the resource of knowledgeable grocers.  AJ's truly is the purveyor of fine foods!", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 5, "date": "2008-11-13", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 3}, "user_id": "2FiNCj5rM3nF0qgaWf86Gg", "review_id": "iPYbnITgzhg9qpddglBRYg", "text": "I love this place. \n\nGood selection of deli food and a decent selection of groceries. \n\nThe staff is very friendly and actually makes you feel like they appreciate your business. \n\nA great alternative to the plethora of ghetto grocery stores in central Phoenix.", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 4, "date": "2009-10-03", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "UoBfwbXaixelZBghbJ2cSg", "review_id": "SqW976OOUTzneHi6636pjA", "text": "Even though the weekend morning pandemonium at the coffee bar/bakery area practically gives me hives, I keep coming back... again and again. The plain old school straight up coffee is surprisingly mellow and palatable. The baked goods are downright irresistible. The cinnamon muffins and scones are out of this world, and I'm clearly not the only one who feels that way since they were already out of both last few times I was in. You greedy bastards! \n\nThe flowers are gorgeous, unique, and high-quality. The beer selection is excellent and I love that you can buy singles (although I worry that Total Wine is going to have them beat in no time, both in selection and price). The soup and salad bar are predictably satisfying, and their cheese selection is fab. Oh, and they have my beloved Fage Greek yogurt -- the only vendor in central Phoenix, that I am aware of. \n\nOnly minus one teensy tiny bit of a star because it's pricey; but do remember, you get what you pay for. The remainder of that star comes off because the patrons are completely insufferable. I practically have to elbow bitches out of the way to get my number at the bakery. This ain't Last Chance, you crazy hos! Calm down, we will all be caffeinated in turn. Sheesh!", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 4, "date": "2009-11-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "9ellV9VrEOPA3vX2pZptSA", "review_id": "mXN9UPmGkQdfFO9U5OL3ug", "text": "Poped into this AJ's last night after going to Gallo for dinner. We got here 5 minutes after they closed, but the employees were nice enough to still let us in, and serve us dessert! Amazing service!!! Definatly the new late night dessert spot! Thank you AJ's, you are the best!", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 5, "date": "2010-09-02", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "Zfdj1VTM8cBRqj01i7GSww", "review_id": "68uHe9G9NoyMwKgZy5YCHg", "text": "As far as some of these reviews go, I'd totally have to agree...A.J.'s in NO place to purchase everyday groceries.  Unless you've got that \"old money\" lying around.  I actually saw someone purchase Windex and a roll of paper towels from there today.  I'm not too proud to get 3 rolls/$3.50 at Target - come on now.\n\nI WILL have to say that A.J.'s has an excellent salad bar.  Not your typical potato salad, macaroni salad type salad bar.  They have crab, actual chicken chunks, artichokes, green olives, real bacon, parmesan cheese, sun-dried tomatoes, eggs, etc.  It's my go-to salad spot when I'm in the mood.\n\nTheir tea selection is awesome.  You can't go wrong with the green tea...always with an orange.\n\nA.J.'s does carry fruits that some stores (not even Safeway) would carry.  We were looking for star-fruit for a drink garnish and found it there.  Sugar cane for mojitos and cute novelty stuff.\n\nI think it's funny how uppity people get when they walk into A.J's, however...it's like \"dummy, you just got out of the same kind of Honda I have...don't act like your stuff don't stank\"!!!\n\nP.S. - You must try their pretzel bread!!!  OMG!!!", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 4, "date": "2010-11-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "usQTOj7LQ9v0Fl98gRa3Iw", "review_id": "V9DCSUCTk-UaCrBV6BxhBg", "text": "I like a good stroll through AJ's now and again.  Especially if I am in the search for some specialty or gourmet item.  Their meats are super fresh as are their deli, salad bar and bakery items.  I don't find myself ever buying much, just a few items here and there.  But I will still go through every isle to look for cool and interesting things to try.  [But to be honest I love going for groceries and do this in just about every grocery store when I have the time.]\nWhile a solid 3.5-4 stars I dropped it to 3 because on my last visit I discovered they no longer carry my favorite Cock & Bull Ginger Beer anymore, replaced with some line of stevia sweetened soda.  Now I can't just ride the lightrail to get it...I have to get in my car and go to a bevmo or total wine.  So sad....", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 3, "date": "2010-11-29", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "F6QsMoJdvtohlbnST-fDyQ", "review_id": "EQg0JEyJs4-f9q8L_Pk74Q", "text": "This is a great store and has been there for as long as i can remember.  Yet it still always looks clean and fresh.  The selection of products is off the Hook as they say.   (They) the young generation.   They absolutely have everything that you could imagine.       Of course there is a drawback!!!   The Price, i t is very high priced shopping , but well worth it in a lot of ways. Lots of parking and very friendly service .AAt", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 5, "date": "2011-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OmN0nUEeDc5kLb9ibJnOnA", "review_id": "oHHvrIOHCQ8izoMmtpDfYw", "text": "The bakery here is amazing.  We order cakes here regularly for business and they are beautiful and delicious.  It's also nice to see a place that still values great customer service.", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 5, "date": "2012-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uBp2Jmip2qXQ0iWHUDY9sQ", "review_id": "l3i-nOtkW7YSCv9HV7TbnA", "text": "This is a small AJ's, but really its the closest thing you're going to find in Central Phoenix to a specialty, gourmet market like Dean & DeLuca or another old-school independent market. \n\nI wouldn't shop here for staples, but they have an excellent selection of items you can't find elsewhere, plus prepared food, wine, spirits, cheeses, etc.\n\nPlus, if I drank coffee this looks like a place I would want to sit out front and have a cup on a regular basis.", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 4, "date": "2012-11-21", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "IP3nF56J-9NEuW7fq29SQA", "review_id": "2lUJRZNhv06uASM-w2AeOQ", "text": "Great food in the mornings to eat in house. It's like a grocery store/restaurant. Omelettes and baked goods, coffees etc. my omelette was great, coffee was fine. Massive portions. \n\nAs for groceries, they have an okay gluten free section which is why I go there. If you like to bake they have a million and one different types of flour. The fresh food is good but get there early by the end of the day it's more slim pickings. Prices are very high on most things because they are fancier brands and a lot of organic etc.\n\nCashiers are kind of slow and they offer you a bag of ice and then charge you for it, without telling you they will first...so that sucked but otherwise this place is decent.", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 3, "date": "2013-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kAalODesjvwHEN25oOt5Rg", "review_id": "KqRMZVjVB3j_V_mmEJjzBw", "text": "I love love love the customer service.. I was sorry to see the Aj's go in my neighborhood.. but its worth the drive!", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 4, "date": "2014-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SHcX9hp5RG3-OqsbvissIQ", "review_id": "BXLymhJOOkRPCTwq9z6-pw", "text": "I was disappointed with this location/visit.  I have never been to this location before, but have visited two others many times.  I'm used to superior quality on everything I buy, but was disappointed with most things on this visit.\n\nI picked up some prepared shrimp and Spanakopita in the deli.  Well the shrimp were a little off, smelled fishy, and were rather hard.  The Spanakopita had no noticeable cheese in it, not much flavor, and was mostly just a clump of spinach.  It's supposed to be creamy and with a lot of flavor.  I also got steaks at the meat counter, and once again, not quite as expected.  I pay the AJ's premium to get premium quality; both steaks were grey on one side and had an off-scent.  They tasted ok but not great.\n\nNot sure if it's this location or they just had a bad day, but I won't be back here to find out.", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 3, "date": "2014-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_vahQpsR3TtwxpmgtV0PYg", "review_id": "5DYQ3L-B0kkHoDi7abQunA", "text": "Friendly knowledgeable staff and great fresh food. Sometimes the value of certain things isn't there and wish they used more organic or quality ingredients when preparing foods and what they carried at the salad bar. The tomatoes are the worst, they're just plain ol' salad bar tomatoes. You can grab the local heirloom tomatoes from the produce section at usually 5.99/lb vs. 7.99/lb for the salad bar so just be aware :)", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 4, "date": "2014-10-15", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 1}, "user_id": "CVssZgB_DM2KncaDgu2Uyw", "review_id": "ONIjnDMd_TCUrsNQBjXFwQ", "text": "Really, really fine selection of awesome cheeses!  Really, really good breakfast and lattes.  That's about all I can say about AJs.  Everything is ridiculously priced!  Especially the wine!\n\nI'll stop by over and over again for their coffee.  I'm not much of a Starbucks girl :)", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 4, "date": "2014-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "i0A-c2yoHySmFhRV2sDR1g", "review_id": "5Ot6gNLuq9zQgNA161eXEA", "text": "The seafood and prime beef here can't be beat. If you watch for the sales when they have 50% off prime steaks and their awesome seafood events you can get some great deals on top grade meat. They also have some really great produce and I actually come here more often for fruit and veggies.", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 5, "date": "2014-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-Cmy3KMas7Y4EHpZ8wRZZQ", "review_id": "2cpqkRRLc9M8Y8jY7CFcbQ", "text": "Go out of business already... One bathroom in the whole store. Overpriced junk food. Mine as well go to Bashas or Food City. Ajs is cheap but charge a shit ton for their food. It's ridiculous. It's not purveyors of fine nothing here.", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 1, "date": "2015-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "APcVBxRZsiAYX6em1MNaTw", "review_id": "acrNkS10bjF-CFDeeo7XvQ", "text": "Twice in a row the person cutting my prosciutto has pressed it together into a ball of meat. Basically ruined. It's one of 3 items I bought and I treated its bag like a carton of eggs. This is not the location to splurge on pricy cuts. Lame.", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 1, "date": "2015-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "66oDhsKSB_eSrhCKiERDow", "review_id": "_HiBhu486FgptRqps7ca2Q", "text": "I'm going to give them their final star, because they've really stepped up their customer service, even after 8pm.  They also have had some decent sales, especially on their private label items (their marinara sauce and bread are especially tasty).\n\nI think the competitive pressure from Whole Foods is helping them improve.  Besides sharpening their sale prices, they're also calling out their nice selection of local brands (Goldwater's, Tammie Coe, lots of others - look for the little state flag signs on the shelves).  I'm also impressed they've kept such a nice selection of specialty brands like Monin syrups (including sugar free!) and speciality products like mochi ice cream.  They even have small boxes of Hawaiian Host \"Peppermint Macnut Crunch\" in their Christmas display right now!\n\nThe store is going to get an expansion and remodel soon to compliment the remodeled Uptown Plaza too!", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 5, "date": "2015-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4aCWsllOurPXzT22MvkuLA", "review_id": "GSruYtmoxBm9-spZNPQsKg", "text": "My favorite go to for lunch.  Their salad bar beats any AJs salad bar out there.  Always clean and friendly.", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 4, "date": "2015-11-13", "type": "review"}
{"votes": {"funny": 11, "useful": 11, "cool": 11}, "user_id": "C8ZTiwa7qWoPSMIivTeSfw", "review_id": "rGSDeV0P6Fl7_M4G9l1yzA", "text": "How can I not give them 5 stars? How? I ask you how people? I mean, these people MAKE candy. Blocks from my house. Lots of parking. Clean. Clean. Clean. You could make smores on their floor. Wow, that even rhymes. I'm thinking bumper sticker here people. Create your own box. With the nicest of nice ladies to help you. I mean really, they have to be amped up on sugar. What else is their to nibble on? Great service. Great candy. Great location. But where was the See's Candy professional to slap that 14th piece of candy out of my hand last night as I slipped into my my milk chocolate coma on my 600 thread count sheets, nearly drowning in my 1/2 inch pool of drool? I don't care. Five stars. Five stars I say!", "business_id": "ezM-93i6eNb4LnYp3J101Q", "stars": 5, "date": "2007-09-16", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "GubdNFoDAsiwE6bWIr97cQ", "review_id": "J13OlL9bURUa9IbXCGeMFg", "text": "This is the store where your business can sign up for discounts, this I have always known. But the last time I was there they asked after I said we did not have the discount if I was a veteran. Wow discounts count whodathunk, cool . Peanut Brittle anyone?", "business_id": "ezM-93i6eNb4LnYp3J101Q", "stars": 5, "date": "2008-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "KmgUyFBWUdGnIVwdk0hdDw", "review_id": "f3TjKdHV7rTZ8P4c1nC4tw", "text": "If you have never experienced the delectable heaven that is See's candy you are missing out.  Honestly, this place has been here for at least 70 million years and I think the brachiosaurus was just as big of a fan of the truffles as I am. I love the classic black and white checkered tiles and the adorable smocked emplyees. The brand has this quaint old timeyness that I really dig. Mary See is the grandmother I always wanted! \n\nI love that they ALWAYS give you free chocolate and have amazing customer service all around. It is so much fun to go and hand pick a few treats for me and the roomies. The quality and uniqueness of their offerings make it definitely worth the trip. If you love chocolate then you should be asking yourself why you haven't stopped in before now. I am eating a pumpkin pie truffle right now that is rockin' my world, thank you!", "business_id": "ezM-93i6eNb4LnYp3J101Q", "stars": 5, "date": "2011-10-23", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "BjwXX-sChcjx2E55B_7rXg", "review_id": "S3PeYRK_MSBxaxDIs4cu5Q", "text": "Hands down, See's Candies offer the best chocolates I've ever had from a chain sweet store, ever.\n\nThough every truffle I've had the pleasure of sampling induced the \"eyes closed, head tilted smile\", there are a few that hold a special place in my heart (and stomach).\n\n1. The Walnut Square - Available in both a truffle and a candy bar, this dark chocolate coated chunk of heaven (butter caramel and English walnuts) haunts my reverie 2-3 times a week. The only problem with the bar is that you have to bite into it, meaning there are opportune moments to drool while eating. Embarrassing? Yes. Worth it? Yes.\n2. Key Lime Truffle - A totally unique, decadent delight, this creamy cube of white chocolate houses a key lime cream flavored center. It's tangy, sweet, and addictive.\n3. Kona Mocha - The perfect blend of texture and flavor, toasted coconut and white chocolate surround a coffee and milk chocolate truffle. If there was a coffee that tasted like this, my mornings would rock.\n4. Almond Truffle - Somewhat reminiscent of an inside-out sushi roll, the roasted almonds coat the outside, followed by white chocolate, and finally smooth milk chocolate in the center. They don't really look like truffles, which makes it easy to eat, oh, say, 10 of them at a time.\n5. Chelsea - The ultimate classy truffle, pecans and chocolate liquor surrounded by milk chocolate create a mini-explosion of awesome on your taste buds. \n6. Scotchmallow - Available in a bar and a truffle, a layer of marshmallow and flavorful caramel are enveloped in dark chocolate. If I could put this between graham crackers I'd be a) in s'mores heaven, and b) a total glutton.\n7. Dark Almonds - Technically this is just a dark almond cluster, but I'll be damned if it's not the best almond cluster I've ever had. \n8. Dark Chocolate Truffle - A pure, smooth chocolate with a bit of texture, this semisweet chocolate truffle and chocolate liquor center is topped with nut crunch. It's simple, but perfect.\n9/10. Mocha/Bordeaux - Both of these truffles are covered in chocolate sprinkles, which I usually hate, but for some reason, they taste amazing. The Bordeaux is a pure chocolate flavor with a hint of brown sugar, and the Mocha is chocolate-coffee (obviously) available in both milk and dark flavors.\n\nTraveling back through my childhood by writing about these exceptional chocolates has made me realize something: these are some of the best truffles I've ever had, local or not. The price is fair (maybe too fair), the quality is evident, and the selection is grand. In fact, I'd pick these over $4.00 French truffles at a shmancy-pants chocolatier any day.", "business_id": "ezM-93i6eNb4LnYp3J101Q", "stars": 5, "date": "2011-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "hn_DclKLzdxABRGGAuqKgg", "review_id": "12YqyN074ezdn2hmeHmQNQ", "text": "This candy shop makes me nostalgic. When you walk in, it feels like the staff have worked there since they were teenagers and they've preserved their enthusiasm and excitement for the candy for years. They greet you loudly, happily, and they offer you samples. What better way to start a shopping trip?\n\nThere's a few counters with preboxed items, and there's a fresh counter where you can pick out which candies you'd like. The apricot delight is very interesting and very sweet. It's a nice change of pace from the typical fruit candies. Milk chocolate strawberry cream was better than I thought it would be - perfectly balanced sweetness with the chocolate. Peanut butter pattie was nothing to write home about - I might skip it in the future. Same goes for the milk chocolate coconut. Dark chocolate chip truffle is very rich and very good and just the right portion size.\n\nPrices are great. We got 4 truffles for less than $3. In terms of quality, it's hard to beat. I wouldn't mind stopping in again.", "business_id": "ezM-93i6eNb4LnYp3J101Q", "stars": 4, "date": "2013-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "m70PZuRVNwgm1_IhQPXU3Q", "review_id": "KlV-UpX0h6ghQzoHb0NPtw", "text": "This is my mums favorite chocolate.  For Grandparents Day...we tried to go to the See's at Arrowhead Mall. Called 3x and no answer.  Looked it up on Yelp, and not so good reviews.  Decided to wait and make the drive from Sun City to central Phoenix.  \nGlad we did. Super sweet, older lady at this location and much better reviews.  Purchased a 2 pound box of turtles.  She will love them. Which makes the drive totally worth it.", "business_id": "ezM-93i6eNb4LnYp3J101Q", "stars": 5, "date": "2014-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "lH5GaJCNGxfNDnursjNzSQ", "review_id": "wNsjjlTcLNNyYf4ZXcrP8w", "text": "We love See's! Forget the delicious free samples they offer when you walk in (though they're nice!), there is so much more to love about this place.\n\nWalking through the doors is like taking a step back in time and going to an old candy shoppe.  It is always impeccably clean and the workers are always so friendly, as if they were welcoming you into their home.  Hands down my favorite treat is anything scotchmallow, but I've yet to have anything I don't like.\n\nMake sure to check if your employer is on their list to receive discounts, too!", "business_id": "ezM-93i6eNb4LnYp3J101Q", "stars": 5, "date": "2014-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "dUgaGUPHdu_4gHQSmCIj_g", "review_id": "bt8I-BLzkS18t0tWhj_kuw", "text": "I walked into See's for the first time since my childhood yesterday and was immediately greeted with a warm smile and shortly after another girl rushed over to me and handed me a sample chocolate with a smile. I told the lady I was looking for an anniversary gift and she showed and explained to me everything they had and helped me find the perfect gift and wrapped it so beautifully for me. I picked up some lollipops I remember loving so much when I was little and when ringing up at the register the lady who was helping me made sure I was happy with how she wrapped my gift and sent me off with more samples. such a wonderful experience and I'm so grateful for the wonderful lady's help making such a beautiful present. I can't wait to come back and pick up my favorite candies on a  regular basis from now on! thank you so much to all the wonderful ladies at See's!", "business_id": "ezM-93i6eNb4LnYp3J101Q", "stars": 5, "date": "2014-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 8, "cool": 3}, "user_id": "_LEQt7oTVjiaXyVHK_MM7g", "review_id": "EGH-dJHtp8uwMLwJLnJDSg", "text": "My favorite favorite favorite place. Possibly ever. \n\nWhen I was in highschool my loitering teenybopper friends and I used to get kicked out of here on a regular basis, but I don't hold that against them. We were idiots.\n\ncNstuff has been around forever and is owned by the nicest family on the planet. The minute I walk in there the smell of cheese (or is it sandwiches?) makes me instantly hungry. And there is lots of cheese. \n\nThe sandwich menu is extensive and I always have the hardest time deciding what to order. It seems like there is a new sandwich added everyday. Do I want the Doe Boy or just a plain ol' Tuna? Russian dressing or mustard? Sub roll or wheat? For extra you can get a side of chips, potato or macaroni salad (which is a little too sweet for me). There is also a plethora of little extra snacks to fill up on, candy bars, twinkies you name it. Last time in there, there was noticeably less Swedish products on the shelves which was a little sad. Maybe they weren't selling very well? They were always enjoyable to look at. \n\nAnyway, please stop in to this delightful little sandwich shop, you won't be disappointed.\n\nEdited to add: German products, not Swedish. They were Umlaut-laden names so I got confused.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 5, "date": "2007-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "XmpqbfSu9X7mjwJGUXTrAQ", "review_id": "f0hIYYRGcym6bhd2GCzY0Q", "text": "I feel good eating here.  It's good food (Boar's Head meats are my favorite brand), family-owned, and it's classic.  I like the Doughboy with a Sasparilla.       It's a tradition for me, and they make me smile every time.  Good food, the best service around and just being in there you can feel the love and tradition of a family owned and operated business.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 4, "date": "2008-10-15", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 4}, "user_id": "ceKoQX0_IJZ6Lr9-9LGcbA", "review_id": "O1mJBdrh6cZmkpZiRHR0yw", "text": "A mom and pop type of sandwich deli that has been around for many years.  You definitely won't get that chain feel like Subway, Quizno's, or Blimpie.  The owners are always so friendly and the prices are great.  Sandwiches are spectacular and I'm loving the location near Central Ave and Camelback, so much seems to be going on in this area. New restaurants and stores opening up all this time and I'm sure this place will be around for a while.  \n\nI'm getting hungry just thinking about the place!", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 5, "date": "2009-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "GVRWfB32i_zvIMJBfbvoBg", "review_id": "lLv_ieXrecFnCD1I9HamKw", "text": "I am so glad this place exists.  It's such a strange little throwback to east coast style delis.  The service here is truly amazing, they just don't treat people like this much anywhere else.  They get to know you, they smile, wink, tell jokes, make you feel good about buying your lunch. I buy local whenever I can, and love that I can eat here before or after a little shopping jaunt to the ultra-local strip behind here that includes Halo, Frances, Red Hot Robot, Stinkweeds and Smeeks.  It's also right on the light rail.\n\nThe macaroni salad is my favorite anywhere.  I know everyone wants exactly what they want, which is often what their grandma/mom/Aunt Jenny made.  Lucky for me, this stuff tastes just like home to me. I can hardly drive by without stopping in for at the very least, a cup of macaroni salad. If I am lucky, I'm hungry, and I can get a cheese sandwich, (which is perfect in every way) or something with the Russian dressing on it.  (The Russian dressing makes me want to get naked and swim around in it.)\n\nThe weirdest thing about this place is the menu, which is on randomly placed sheets of paper hanging over the deli counter.  Do not rush, take your time.  Read it all, they don't mind.  They have a pre-printed menu, which has some (but not all) of the items on it, so you can start sorting things in your head.  The first time I went in I ordered whatever struck my fancy first, and while waiting for it to be made, I found about ten other things I might have ordered instead.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 5, "date": "2009-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JdSzqBS0wicnprSQc6mfGQ", "review_id": "DnREZg6vHyMFqxxfv_48fA", "text": "Easily one of the best sandwich shops around. Family owned and operated for the last 60 years. A great selection of subs and sides and even a few imported goodies. If you like sandwiches you owe it to yourself to check it out.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 5, "date": "2010-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6gSEyqsIboT-0Ap9ammKbw", "review_id": "LkroNeeUgN6beryGkZ-IpQ", "text": "Stan and his kids are really friendly, and The Doughboy is a great brown-bag sandwich.  This place is part of my Central/Camelback routine, right between getting my haircut at Central Barbershop and heading over to All About Books & Comics or AJ's.  \n\nPrice:  Good\nAtmosphere: Okay, don't really go there for the place\nService: Great\nFood: Great\n\nOnly problem, they run out of Yoo-Hoo's half the time.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 4, "date": "2010-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QBQlErZajdIyXX84dvFUnQ", "review_id": "FRB3W0Dq_7fSs8ILV_7t2A", "text": "Dam I wish I would have known this place was here sooner. Really good sandwiches. They use Boars Head meat which I am a huge fan of. They have so many different sandwiches it took me a while to figure out what I wanted. The menu is kinda all over the place. There is a menu board but its old and fadeed but they have white papers with all the sandwiches hung up all over the wall. The staff  are very friendly and I'm sure this place has many regulars. Inside its a tight squeeze with limited seating. The macaroni salad is great as is the potatoe salad. I love the sicilian sub. The italian dressing on it is so really good and I think thats why I like this sub so much. My other fav is the club on wheat. Oh yeah I think Ill go there agin today. Sanwhiches range from $5.95-6.95.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 4, "date": "2010-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FdxUhQ2orufg_eMgWAoH6Q", "review_id": "WRmznNruz8pL0-DC_plN6Q", "text": "Cheese and stuff might be the.cutest little sandwich place on the planet.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 4, "date": "2011-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wRuc17CRCZNyZVvsv0tDow", "review_id": "a5cmm3lGPzW2F1_WL_3sfQ", "text": "I love the Blazin Chicken!  Sandwich's are always fresh and tasty!", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 5, "date": "2011-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "TzG6-nMD0nh8gATt-ZaqMg", "review_id": "nnHQF53tazC39FGpoL91Ig", "text": "This is the OLD SCHOOL Deli of Phoenix.  My family has been going here since it has opened, my grandmother, my father, everyone.  We always ordered Beer Wurst Sandwitches with their famous Cheese Spread.  Try A dough boy, Try their Macaroni Salad.  You can't go wrong.  Yes, you do have to know what you want when you come in, this ain't friggin Subway, its a real DELI...", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 5, "date": "2011-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "Hu_RKBI3tN0UeWFb67oX9A", "review_id": "ea_8cZMoBGIE_LpBQ9myUQ", "text": "I recently met with a client here for lunch on his suggestion. When I arrived I was surprised...the decor/seating area leaves something to be desired. \n\nHowever, the FOOD was awesome! I had the Doughboy, which is their \"most popular\" sandwich and I know why. It was excellent and I highly recommend the restaurant.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 5, "date": "2011-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hTWj9YiiCLCi3TZr0ceLbA", "review_id": "uUz08xcJxrOEqdE_YKNmGw", "text": "I walked in as a skeptic and came out a believer! How great could a sammie be? According to the other reviews, THAT great so I had to try. \n\nI ordered thr Veggie sandwich and it was prob the best I ever had. I was shocked. The bread was so light, airey, doughy, and fresh all in one! The veggies were the basic as on any veg sammie but the ranch dressing made the landslide diference. \n\nI would give it 5 stars just on food but I took one off due to the cramped space. Two of the tables were full of patrons and with 3 other people in line space was very limited, to the point of being akward. \n\nOverall, great place and I will go back again!", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 4, "date": "2011-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wpzKJORxvWVfXL7AdKjhvg", "review_id": "M1_9O-NgIzxDKrnKNtdAgA", "text": "You can drive by this place forever and not know they have the best sandwiches in Phoenix!!  All of the ingredients are super fresh.  Biting in the bread is like biting into a little heaven cloud.  So soft and delicious it's almost not fair that other places have to compete.  I'm not a big fan of deli sides (potato salad, macaroni salad) but the ol lady says the macaroni salad is some of the best she's ever had.  The menu is a little hard to see as it is scattered but have no fear, if you don't find one you like, they'll make you one however you want it.  Family run and the owners are very nice.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 5, "date": "2012-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Rx2RD3sfwsbWJcydrm2bAg", "review_id": "-8lU_m57kKkvOd3QCLUDkQ", "text": "A nice little shop, not too busy, that sells Leftza, when in stock. The Blazer I had was good, nice bread with Boar's head Buffaloed chicken.  Yes, you could make it yourself if you want to,but this is quick, no mess place, family run.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 4, "date": "2012-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DrWLhrK8WMZf7Jb-Oqc7ww", "review_id": "ZlyLZFhzYQlnLhcmbHXO6Q", "text": "Really couldn't find anything special about the sandwiches here. Boars Head meat is always good, but I'm not sure if they are actually slicing the meat for each sandwich. Turkey seemed like it was cut another time, wrapped up in some plastic and then unfolded for each person's sandwich. They also doused the entire thing with about a quart of Russian Dressing (#5), put some fancy tomatoes on the sandwich and I requested a change of cheese from baby swiss to Smoked cheddar. You can only get about 8 different cheeses here on your sandwich (the rest you must buy) and they only carry one style of Boars Head turkey. No pepper or pastrami style, nothing but boring old plain turkey. Whoever is raving about the macaroni salad must be a rookie as well. The mac salad lacked any flavor and resembled ones you will find in a supermarket tub. There might be some better sandwich combinations out there on their extremly cluttered back wall (it's actually not cute cause your menu is in 20 places), but with the limited variety of meats, it doesn't mean much. Yeah, it's been there awhile, but so what, McDonald's has been around awhile too.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 2, "date": "2012-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4OFp34tCTh9Pps5nsjt_lw", "review_id": "1RXExB57NEFE6EHbieQAOA", "text": "Shame on me for not having known about this wonderful little gem.  We tried to have lunch on a Monday and the place was packed.  Too bad we were in a hurry or we would have stayed.  So on friday I stopped in later in the afternoon.  The place was quiet and the young gal behind the counter was sweet and helpful.  I ordered a sandwich and german potato salad to go and am very pleased.  The sandwich was a good size, not to big and the potato salad was solid.  I love a small local business and they do not disappoint.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 4, "date": "2013-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Gth9uH56jrChwgyGgQhTqA", "review_id": "9GinWYjiHrpybl5Se-1Kdg", "text": "I was excited to eat here after reading the reviews.  \nI did not have the same excitement when I left.  \nFood was good.  Quality ingredients.  Friendly service.  Fun atmosphere.  But the volume/portion of food was not equal to the price paid.  If you are on a high carb diet or like more bread than meat/cheese, this is the place for you.\nDoubling the meat/cheese might have helped, but the price for that would have bumped well into a $$ rating.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 3, "date": "2013-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hdrPRkT07j6VExAYEYK2Wg", "review_id": "yOb0SNdKT6wkgFAQs3juMg", "text": "the Sicilian Sub is fantastic", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 4, "date": "2014-10-29", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 2}, "user_id": "QHdHXy73PHc-XDGP7vvQlg", "review_id": "cYgN0B5XoenTn4BOsp59VA", "text": "What a great, locally owned family business!\n\nThis place has been in business for over 60 years!  Now that's impressive.\n\nCheese 'n Stuff is my \"go to\" establishment for lunch during the week.\n\nI always order The Haturo, which is ham, turkey, roast beef, provolone cheese, onion, lettuce and mayo, with Italian dressing on a sub roll.  I have them replace the tomatoes with peppercinis, which helps to give it a little kick.\n\nNow that I think about it, a small dose of tabasco would probably be good, too.\n\nI usually eat my sandwich with some Tim's jalapeno chips (which I have to buy at Safeway) and a side of pasta or potato salad.\n\nTheir salads are great and affordably priced.\n\nI have been trying to replicate a sandwich that reminds me of home and this is the only place that has been able to meet my high expectations.\n\nThe family is extremely nice and very good at what they do.\n\nCheese n' Stuff is one of the best businesses in the Valley.  They deserve your patronage.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 5, "date": "2014-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sO7eccljiBw4GiThp-JNyQ", "review_id": "ytktBTNilMatTWAxWTWf1g", "text": "The best deli in central phx! Stan and his daughter run the place and are making sandwiches everyday! They use boars head meat and cheese so you know it's going to be great! Try the Tyler or the doughboy, can't go wrong!", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 5, "date": "2015-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HGRMSBor0PBXJbFmkCSbYQ", "review_id": "Jlx5ouAy9-x4jfuaEw6tOg", "text": "Great neighborhood sandwich shop I've been going to this place for 15 years and it hasn't changed a bit. The food is fantastic. It's like stepping in a time machine every time I go in. Makes you wish there was more of these local family owned businesses.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 5, "date": "2015-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IPu2iHwmJLBLmuGafnPo2A", "review_id": "teXS6kKdJ3RCR75iPnTfPA", "text": "My favorite part of cNs is actually the brownies. The brownies are amazing. Fudgy, gooey, topped with a few nuts. I'd go back for the brownies absolutely any day. Otherwise, it is a solid place to go and get a sandwich if you don't feel like making one. I had a BLT, and wish it had a little bit more lettuce. I plan on going again and trying something a little more adventurous next time.\n\nThe atmosphere was very earnest--I felt like I walked into the 70s or 80s. Wood panel walls, two picnic tables for seating inside, and shelves for storage make it seem like a very warm mom-and-pop place.\n\nParking, however, can be a bit of a nightmare. Either park behind the building (near Francis, Golden Rule and Stinkweed's parking lot) or prepare to fight for a spot in front of it.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 3, "date": "2015-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fZwvo8YgAS068OQC_M3kBg", "review_id": "UKRRzd_auu8cB5dj00bPmg", "text": "what is not to love. old school deli, unique grocery items and awesome people! Stan and Crystal are great and they have our order memorized. The Bizmark on Rye no cheese (stupid lactose intolerance) is amazing. Try to eat it at least once a week. my wife has been eating the #5 since she was a little girl!", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 5, "date": "2015-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "hQfYj01w-DUN-zkNbe3CJQ", "review_id": "enrFqTfbkZF-RR5AJd9CSQ", "text": "Stopping in after Sweet Salvage with my husband and two friends we were both surprised and pleased with the wide selection of sandwiches and the excellent service. What a great way to cap off a day of shopping!", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 5, "date": "2015-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oEEmCHxVTjj9012Nz-XVMA", "review_id": "4X6eyQ_OH8CIn8ma2dFcug", "text": "Schreiner's is a definite triple threat.  The staff was not only cute but extremely entertaining and best of all they have slab bacon.  By the time I got out of my car it had a great hickory/bacon aroma.  I can't wait grill this up with some filet medallions.  I definitely will be back to try out the sausage.", "business_id": "XRBTHOXaJK_AJ2wy5mX_1A", "stars": 5, "date": "2008-11-20", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 4}, "user_id": "JVkuW-Vf8qF447AZXyWVfw", "review_id": "aZNpoV74xF2ORPPbHZy1Hg", "text": "Dude, this place is a sausage and pig-lover's heaven on earth.  This wurst, that-a-wurst.  Liver, head cheese, new york dogs, regular dogs, every kind of sausage you can imagine (along with every kind of mustard and horseradish you can imagine), even boudin, andouille, they have like 65 varieties.  Wish I lived nearby, I'd try a new kind ever week!", "business_id": "XRBTHOXaJK_AJ2wy5mX_1A", "stars": 4, "date": "2008-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ue9mYNOxPcicrU_UzhGluQ", "review_id": "UCf4oi-9dvH0vOkEs44jnQ", "text": "I tried a couple sausages I was expecting more from all the reviews", "business_id": "XRBTHOXaJK_AJ2wy5mX_1A", "stars": 4, "date": "2012-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "tqjY8__KQI5kE8pA41nUEw", "review_id": "I24MGlUlXXYgFdqvhcnyOg", "text": "I bought a bone-in, smoked half ham (12lbs - whoa!) for Thanksgiving and everyone that ate it said it was the best tasting ham they'd ever had! Not too salty, and the perfect amount of smoky flavor. \n\nAnd don't get me started on the sausage! When I went to pick up the ham the full deli case of sausage was staring me down - how could I NOT take some home. We ate the chicken apple sausage with eggs the next day and they were beyond flavorful. You could seriously taste the apples, it was that fresh!\n\nThe prices might be a little bit more than you'd typically find in a grocery store, but still reasonable, and for the quality of product it's totally worth it, plus it's locally owned!", "business_id": "XRBTHOXaJK_AJ2wy5mX_1A", "stars": 5, "date": "2012-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "AVHseP2_PaUlCWhSsS7oKg", "review_id": "xu5uHCHzMPGEv9Q1WY8uvQ", "text": "My boss invited my to lunch today and we ended up here. I've lived in Arizona most of my life and have driven past hundreds of times but never stopped. \n\nGreat bag lunch special for around $5 includes a selection of sausage with a variety of condiments, bag of chips and a can of soda. I went with the jalapeño cheese and was not disappointed. \n\nYou can also stop by and pick up sausage and other meats by the pound. Potato and macaroni salads are also available. Best of all they have pierogi with a number of fillings. \n\nIf you haven't stopped, you're missing out.", "business_id": "XRBTHOXaJK_AJ2wy5mX_1A", "stars": 4, "date": "2013-11-01", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 3}, "user_id": "wuCszpVPMIMyOCualnZtaw", "review_id": "QQjlDw2qpuvh6Vyr_r-qcQ", "text": "The redwood looking cottage \n\nI have worked in the downtown Phoenix Area for a long time and have driven by Schreiners numerous times but never stopped in, what a mistake on my part.. \n\nHowever, one day my curiosity got the best of me,   My co-worker and I decided to give Schreiners a try for lunch. I went with the brown bag lunch special for just a mere $5.  The brown bag lunch includes a selection of sausage choices, a variety of condiments, bag of chips and a can of soda. I went with the New York Dog and even tho Schreiners offers a wide variety of condiments I kept it simple and went with mustard only.  I was not disappointed. The New York dog was fresh, delicious, and did I mention locally made. \n\nSchreiners offers sausage and other meats by the pound.. In addition to, potato salad,  macaroni salad,, breads, pierogi's with a number of fillings, and chorizo made daily in the store.  On my way out I picked up a pound of chorizo to go. \n\nAll I have to say about the chorizo is that Schreiners sells the freshest and best tasting chorizo around. Once you have Schreiners chorizo you will stop buying chorizo from anywhere else. Most store purchased  chorizo comes out greasy and oily but Schreiners does not.  Schreiners chorizo is full of flavor minus the grease and for less then $5.00 a pound  you get your moneys worth.   Hands down this is the  best chorizo around. \n\nIf you haven't stopped by Schreiners you're missing out.", "business_id": "XRBTHOXaJK_AJ2wy5mX_1A", "stars": 4, "date": "2013-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "i94JgBKT4T7pGco7W1S0OA", "review_id": "Lpo0kQYuILFudEJXmDwZMQ", "text": "I hate to bemoan the passage of time and the change of ownership ( granted, that's been some time ago); nevertheless, that's exactly where this review is going. My mom is from Germany, and I can remember coming to this place back when the counter staff would speak German with my mom. The had the best liver wurst. It was firm, but not dry, and full of flavor. Now, it's bland and tasteless. I never liked blood sausage, but my mom and two sisters used to adore it. No more. The selection isn't what it was. Commercially, this place seems successful, with lots of restaurants proudly advertising their stuff. But the old faithful have been left bereft.", "business_id": "XRBTHOXaJK_AJ2wy5mX_1A", "stars": 2, "date": "2014-11-08", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 4}, "user_id": "IDHrwv_RCildFvmfWTkj5Q", "review_id": "FRRjbi-QEJ1Se14Ik4VEDQ", "text": "I go here for my bacon.  AT 5.49 per pound, this bacon is cheaper than most bacon in the stores.  I love the taste and flavor of the bacon.\n\nI know that they have handmade sausages, but I'm not into sausage.  HA!  An interesting fact...   you can customize your sausage recipe there... so bring in your recipe and order your sausage.  \n\nThey also carry a variety of deli meats.  I love to try the samples, but I have not ordered any of their deli meats.\n\nReturn FActor: 100%\n\nFYI: they have a $5 minimum on credit card purchases.", "business_id": "XRBTHOXaJK_AJ2wy5mX_1A", "stars": 5, "date": "2015-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ePujop91PtrhJuDYByRzTQ", "review_id": "9S7S8YeLD6NR5_UJ0twvUA", "text": "We were looking for some Portuguese linguica and found it here at this wonderful shop. The selection of sausages was amazing and this very small corner store was packed the day before Thanksgiving. We bought both the smoked and fresh linguica and it was delicious. We'll be back to this place for sure. Well worth the dive from North East Scottsdale. We also bought fresh brats and some hard salami.  The place was well staffed and the people that work there are very helpful and friendly.", "business_id": "XRBTHOXaJK_AJ2wy5mX_1A", "stars": 5, "date": "2015-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HpxGTDm60d9JapjN36JFSQ", "review_id": "ZgPMDsq1bGOfvAU7cXhVuQ", "text": "The store is small and uncomfortable, but the products are decent.", "business_id": "wxPOlYC155x-RLfk1kVdfw", "stars": 2, "date": "2012-09-05", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "n6chlQCERdcs7A-VoOeoLQ", "review_id": "6AX2joQQiKeFn6DY6EOEtw", "text": "Should I stay or should I go??? \nThis is the question that ran through my mind as we walked up to this run down establishment! \nSince it was my last day in Arizona, I went for it!\n\nWalking up to the door, I saw that the sign did say \"open for business\", so I held my breath and walked it.  DING! Ahh! I jumped at the sound of the loud door bell! My fiance couldn't help but laugh! \"Hello\" said the owner as he walked in from behind the store.  \"Hello!\", we responded respectfully!\n\nOnly two separate sets of shelving fit and fill in this small shop of Cacti but enough for the visiting tourists like ourselves! It only took about 5 minutes to look around and decide on a few souvenirs.  As I handed him my items he offered us a few samples and tossed in a free gift!!! WOW! What great guest service! \n\nI highly recommend a visit to this shop when in AZ! \nNot only was it a memorable experience but his prices are cheaper than retail stores!", "business_id": "wxPOlYC155x-RLfk1kVdfw", "stars": 4, "date": "2012-09-18", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "gx3ZRjh43OOuavKl_rXvrA", "review_id": "MW_X9oOKcgYqkzX6icKfvg", "text": "The closest touristy, Arizona-esque candy shop to me here in Central Phoenix.\n\nCactus Candy Co is located in a small building room, stocked with: hot sauces, jellies, marmalades, cactus gummies, prickly pear taffy and shirts. Upon entering I was greeted and was given some advice on the popular items people typically purchase. It was helpful, good amount of candies and jellies but definitely limited. Two thumbs up for having a discount with paying with cash + being a student. With the discount it ended up not being too expensive either. \n\nI got a few boxes of prickly pear candies, taffy and jelly for my friends and family back home. Crossing my fingers they'll enjoy the distinct taste of prickly pear from the good ol' Valley of the Sun!", "business_id": "wxPOlYC155x-RLfk1kVdfw", "stars": 4, "date": "2014-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z2FHsDtPqhhJg00-xn4EcQ", "review_id": "tNSkcQC7r1C-okHE1GKmzQ", "text": "I LOVE THIS PLACE !! They have anything and EVERYTHING you could possibly need for cooking baking and anything that has to do with preparation of foods. Its a little on the $$Pricey side of where your coins might be at the time but chances are well worth the money. They have spices, unique brands, imports, gadgets, scrubbers...... I could go on but I am sure I missed a few items, but once you go and check it out for yourself,  what I may have missed could be your new surprise !! PS THEY GIFT WRAP FOR FREE !! BONUS ! (and its the professional shrink wrap style too)", "business_id": "31bXixwy2GNmRlhpl21reA", "stars": 5, "date": "2012-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "rjsx6_pSqwl0zuiwa_tI2g", "review_id": "1Pv-hBZxhZFhmyd9CerQEA", "text": "I've always loved Williams-Sonoma!  It is more than a kitchen store; it is an experience! A great place to buy presents!\n\nYes, you can just go in there and buy whatever you need for your gourmet kitchen, or a unique gift for your best friend or your mother. But WS staff is there for more than just to sell you high end kitchen delights. They will teach you how to use your new purchases and the many options that are available that you had no idea you wanted or even needed.\n\nThe staff is well-trained, not your usual retail sales clerks, but men and women who know their inventory and how it can make a difference in your cooking life and they aren't afraid to tell you.\n\nThe WS staff at the Biltmore are on the top end of the sales scale. They are there to teach you what they have in the store, what you might need to fulfill your every kitchen desire and what you cannot live without. Yep, I challenge you to get out of there without buying at least one thing, or learning how to cook something you didn't even know you wanted.  Williams-Sonoma is a playground for cooks of all levels. And, if you are like me and not a chef . . .it is a great place to buy wedding and Holiday presents.", "business_id": "31bXixwy2GNmRlhpl21reA", "stars": 4, "date": "2013-09-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "KJDymAcoPiW_vuqthGxfpQ", "review_id": "97DpMOivkuhv2MtxFsKW5w", "text": "The delicious smells that come out of this place drag us into this store against our will!  But seriously though, it smells awesome - especially at this time of year when the pumpkin spice smell drifts out onto the sidewalk some distance away from location!\n\nThis is a well organized, clean and friendly location.  It also happens to be in a great location with other shops that you can visit and make a trip out of it!  \n\nOverall: A\nGreat location.  Great smells.  Go.", "business_id": "31bXixwy2GNmRlhpl21reA", "stars": 4, "date": "2013-10-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Ry48Bta6spNowOkiMNC_xg", "review_id": "OsM4JWLszZEgRof9bZKtyg", "text": "The Williams-Sonoma Difference\n\nWhile visiting a not-named-here competitor, the helpful and friendly assistant did not know what a mortar and pestle was. \n\nChristine of W-S knows what a mortar and pestle is, plus alternatives performing the same crushing snd grinding tasks. She also found Occam's Razor in the back and diced out a finely filigreed, well constructed conversation on ethics with roots in Locke and Rousseau. \n\nMeanwhile, Chef Tom supplemented the impressive Christine with a depth of cooking knowledge reserved for the dedicated and well educated food fanatic.\n\nThis store fulfills culinary and cooking wants.\n\nWonderfully useful, supremely cool. Williams-Sonoma will take you to school.", "business_id": "31bXixwy2GNmRlhpl21reA", "stars": 4, "date": "2015-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "XJAKSnJOn2NE8ekSh3uJTg", "review_id": "58uasTGqZnqt2eKwgu8tKw", "text": "The German Sausage company is the closest thing we have to a big city charcuterie in Phoenix.  Our family has been enjoying their homemade ham, lyoner, bratwurst and smoked meats for 30 years.  Their prices are so much more reasonable than the grocery store deli counters and their products are always very fresh.  Walking through the door will immediately transport you to Europe!  Don't miss this Valley gem  - cash or check only just like the olden days!", "business_id": "fhLb0v5NBj93D7PLQpFXfQ", "stars": 5, "date": "2011-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "qDBaslzhTlpzOPg7hARuzA", "review_id": "7hDr03XkNhdO41v7RIkUqg", "text": "Take home a little pastry for dessert!", "business_id": "fhLb0v5NBj93D7PLQpFXfQ", "stars": 4, "date": "2012-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "BiZvuNKi0bs_YwttHhhq4w", "review_id": "VjOGIsR6lFzsYgy1HFpmCg", "text": "This place is awesome. We can't eat regular store bought brats anymore. Their potato salad is to die for as well.\n\nWhen you walk in you get a strong smell of....well something awesome and smokey and realize behind the register there are smoked something or others hanging right there in front of you. To the left are some grocery items as well as spietzle (sp?) and some other items. To the right is the deli counter that holds TONS of meats and other goodies as well as their brats. They have two kinds, from what I have seen, course ground and find ground I believe. I am not sure of the difference since we usually only get the fine ground white ones.\n\nThey make limited portions of everything since its all fresh, so get there fast for the potato salad.\n\nThis is our go to for grilling out and its always delicious.", "business_id": "fhLb0v5NBj93D7PLQpFXfQ", "stars": 5, "date": "2013-09-17", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "Mb0psF4WQF7gZSuZafVr-g", "review_id": "6afmMajRjouYOWyXjsN4Jg", "text": "This is a very small shop.  The variety is limited.  But if you want German food this is one of the few options around.  They have seasoning packets for various dishes, plus some \"raw\" ingredients (like dried spaetzle, sauerkraut, etc).  A lot of that is imported from Germany.  And then they have their meat case with various German cold-cuts and sausages available.  I'm not sure where those are made.\n\nWhen we were there a German lady (speaking German) was ordering several items.  She apparently comes here all the time.  She gave us some advice on things to try.  So far we are liking most of what we bought.\n\nBe warned...cash or check only!  No credit or debit.  I had to deduct a star for that because cash is extremely inconvenient, and a lot of people don't carry much.  Also the hours on the sign at their door are wrong.  They closed at 5pm on Saturday, not 6pm.\n\nI plan to return from time to time to pick up some specialty items.", "business_id": "fhLb0v5NBj93D7PLQpFXfQ", "stars": 3, "date": "2013-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BZAQXM71IPwVCzHYCMiwcQ", "review_id": "zzBay9g_f_5rn2Gl95ZbAg", "text": "Amazing service, great German products (auch Zeitung auf Deutsch!) and the sausages were fantastic. You can tell when your business is appreciated, and they will be getting ours again soon!", "business_id": "fhLb0v5NBj93D7PLQpFXfQ", "stars": 5, "date": "2014-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I2q0U7LJicrqMEeeJWAeXA", "review_id": "oUoQfkPCvPijTuJ6KLXwVw", "text": "I shop for over 20 years at German Sausage and have never been disappointed.  Their prices are very reasonable, cold cuts are usually much cheaper than buying ham/turkey/salami at frys or any other store.  I love all the varieties they offer here and will keep shopping here.  They make it easy by accepting your order by phone, so when you get there it's ready!", "business_id": "fhLb0v5NBj93D7PLQpFXfQ", "stars": 5, "date": "2015-10-21", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 1}, "user_id": "mym5tXZoZCbuPCYQzI5Ysg", "review_id": "7ytsBlQPoRmX1cBS5y6hiw", "text": "Dear AJ's,\n\nWhen I worked at the Pointe Hilton at Tapatio Cliffs down the street from you, you were the only thing I had to look forward to in the day.  There were a gazillion restaurants I could have eaten at on site, but they all sucked shit and treated other employees like crap for some reason.  You were my half hour reprieve from that god forsaken place, where I could escape the whiny assholes who'd come up to the front desk and my puffy-cheeked manager who'd roll his eyes if I wanted to smoke a cigarette.  Remember when I would come in twice almost every single day, once for breakfast, once for lunch and then you'd see me drive by at the end of the day and I'd wave and almost get into a car accident because I wasn't paying attention to the road?  Ahhhhhhh...\n\nYou're the only store in the valley that I know of that sells Cock and Bull ginger beer, quite possibly the best there is in the world, even better than the really good Jamaican stuff. [ *if anyone knows of better ginger beer, cough it up because I am in love with it* ]  Your other selections of gourmet sodas were all excellent choices too.  I really like your sandwiches, man; they hit the spot just right.  \n\nI wish I'd met you under better circumstances.  If I hadn't hated my job, you would have seen me smiling through the aisles.  As it was, you probably saw me eyeballing one of your many fine wines, contemplating if I should get drunk and tell my boss to go fuck himself.  Don't worry, I didn't.  I did quit though and immediately celebrated by eating a sandwich outside of you.\n\nI miss you a lot.  I don't really drive my car very much anymore, and if I did drive, no offense, that's pretty much the last part of town I'd like to be in, aside from obvious ghettos.  Perhaps I could move you, brick by brick to a new location that is closer to me?  No?  That's fine.  If you're not comfortable, I won't press it any further.  \n\nWith that, I just wanted to let you know that I love you.  I'm still a member of your sandwich club and have the card in my wallet.  It will be used again, old friend. \n\n-Billy", "business_id": "jTcLbRCOCnGB4wCgsIYswg", "stars": 5, "date": "2008-10-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "sALB8-F04S9VcZMF_GkGUA", "review_id": "3BPIZZR33_ZXrZ7la-EJSQ", "text": "Being from Cali.. I love a great gourmet grocery ... I cant express how my heart flutters at the smell of a great cheese department.. not for the Cali in me but for the Parisian in me.. ahhhh! Bon Fromagerie!! I wont say this AJ's gets me going like the Aj's in other areas of PHX.. but still thats just pure out being high maintenance and picky picky.. Im happy to have this gem in the desert.. I love the wine department.. the cheeses.. the gourmet of it all.. oh yeah.. and the desserts:-) mmmmm a pure piece of heaven.. if Im feeling decadent that day.. and when running late for a party.. you can always know that AJ's will have a quick run in and grab plant or beauty of bouquet .. :-)", "business_id": "jTcLbRCOCnGB4wCgsIYswg", "stars": 4, "date": "2009-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "QhuESGhOQWnKqwlSrISm8A", "review_id": "p9chNOh8o2LCMjzeI3xbGA", "text": "I will miss you.", "business_id": "jTcLbRCOCnGB4wCgsIYswg", "stars": 4, "date": "2012-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "jUNpJGPRKsu7P69LMOsq0w", "review_id": "rAglnaqhsC4y7hb9PTa0_Q", "text": "store closed 9/19/2012 ***expensive way too expensive", "business_id": "jTcLbRCOCnGB4wCgsIYswg", "stars": 1, "date": "2012-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sALB8-F04S9VcZMF_GkGUA", "review_id": "3YZd2CHhb3vmGNI9wgN7wg", "text": "Staff knows their supps & vitamins & all the things in between.. I like this particular store... Always friendly.. Good promotions.. Such as my fav.. Join the free membership program.. Keep the receipt..& whatever you bought in last 30 days... Will be half off next time you buy.. Love a good sale.. Love good service.. Especially if it helps me stay in the healthy..", "business_id": "4PIDGWu8BGUSGe1PK926AA", "stars": 4, "date": "2010-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "prxoDnZ_NUgFTZPRYuF5-g", "review_id": "k7U-hLhJeNu3O89EPfiW5g", "text": "I came here during the end of July while visiting my brother. The cashier was super friendly.  He even let me practice my Russian on him. My family and I bought four different cheeses and with some sausage. The old Kiev one was delicious. I'll be back for Thanksgiving weekend!", "business_id": "WQJwpYwEFT_QTR-lFIh5mA", "stars": 5, "date": "2013-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-NgJsg-IALmGhtMtZ4mhqQ", "review_id": "3o_I5bCj-zDAjUXsq0Xprg", "text": "Not nearly as good as Russian groceries in other cities.  Some bakery items are stale depending on turnover. Vegetables are hit or miss,  But some items worth the trip. Husband and wife owners could be friendlier. Speaking in Russian helps.", "business_id": "WQJwpYwEFT_QTR-lFIh5mA", "stars": 2, "date": "2013-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "thVKnHeNocIkvDU6EYyRXw", "review_id": "mzhNsNVvk7GZimpyyTQiBg", "text": "I love this store! It's very small but they carry an eclectic selection and it's a bit of a time travel to walk in and find Russian wares from candy to beer to fish to canned goods. The employees are very nice.", "business_id": "WQJwpYwEFT_QTR-lFIh5mA", "stars": 4, "date": "2014-09-09", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "FavRs9o3V2iZC2s1iZU-rg", "review_id": "ueDI6zXJjHgh63GsftDlVA", "text": "* I decided to give 4 3/4 stars instead of 5, simply because I'm Polish, and would have liked a little more of a selection of Polish food items. Then again, I'm from Chicago, and spoiled as far as delis are concerned. However, onto the review!\n  We usually come here with our little boy, and before Mr Yasha died , he would ALWAYS give him a lollipop or a chocolate or something sweet. He was a very kind man, and no doubt, sorely missed.\n  Now, his son usually rings us up, and he's a cool guy as well.\n I must stress, that their assortment of meats, smoked fish, and deli items such as salads, is amazing, and always fresh! I have never encountered anything of sub par quality, freshness taste wise here. Sure, there might be a few \"strange\" items according to the typical American[who will never understand the eastern european obsession with herring], but to a Slav like me, it is heaven. Their herring salad[aka \"Sledz pod pierzynka\"-herring under a blanket], is JUST like my Grandma's.OMG so good.\n Their breads are the bomb too, as well as their delicately brine flavored, crisp, crunchy, garlicky, dilly new pickles fresh from the bucket.\n Now, my mouth is watering-I foresee a trip to Yasha's very soon!", "business_id": "WQJwpYwEFT_QTR-lFIh5mA", "stars": 5, "date": "2014-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xxKbBTXFEB7dJZ_j0p8bWw", "review_id": "U3awzYCn8ZbmzB19ma4HoQ", "text": "My wife went shopping there and among various items, it included Napoleon cake and Russian mustard. One just tasted horrible and the other made me sick:\n\n1) Napoleon cake: never ate such dried out, old cake in my life. Way overpriced. Tasted horrible. Worst cake I ever had.\n\n2) Russian mustard: made me sick. Removed the price tag and noticed that it expired in 10/12 and they sold it in 9/15. \n\nCalled AZ department of health and they said unfortunately there is nothing they can do if a supermarket sells expired stuff. \n\nSo if you go there, better check if things are fresh or if you get some 3 year expired stuff that has been sitting on the shelf forever and they cover it up with putting the price tag over the expiration date.\n\nWill never go back!", "business_id": "WQJwpYwEFT_QTR-lFIh5mA", "stars": 1, "date": "2015-10-30", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 3}, "user_id": "hm_jIHUJYRjvS6IvIm-Inw", "review_id": "P_ipwNdrVPiS2ImQgaGhQA", "text": "This store has an extensive collection of things I do not want, and none of the things I was hoping for when I came here. What I did end up buying turned out to be the worst version of said item I have ever tasted. There are no freshly made deli foods of any kind. Quite a bummer of a place unless you are looking for something canned, or from a box. Then they have you covered. They also have a pretty good selection of candies.", "business_id": "WQJwpYwEFT_QTR-lFIh5mA", "stars": 3, "date": "2015-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "e4TQFVfepzHf--hnBsjntg", "review_id": "SX66M7NGivtiSaH37Tb4fQ", "text": "I shop here every weekend.  Even though I feel as though Whole Foods has lost some of its original spunk since turning into a giant national chain it is still better than anyplace else to shop.  You will always find a nice selection of organic foods and groceries.  Nice wine and cheese selection.  Great prepared foods.  And they give you complimentary ice so your food doesn't spoil during the drive home before the A/C kicks in.", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 4, "date": "2006-09-07", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "PoQOIZc2q5nud7uVz_jdjw", "review_id": "8djnWfXTwNEnYb9d43b8yQ", "text": "Yeah yeah, whole paycheck, cry me a river. Everyone knows exactly what to expect here, I'm not going to whine about high prices. The prepared foods area at this WF is much more restrained than at any other WF I've been to, which is sad because I used to love ogling the selections at my Boston shop. I think this location has a somewhat small but interesting wine selection but my real purpose for this review is to talk about the cheese shop. \n\nArizonans have absolutely no cheese culture. Sorry. I love AZ and I'm glad I live here, but when I think about exotic cheese I don't think 'gruyere'. Cheese selection is the only way in which Arizona has failed me, until I met Laura, my Whole Foods Cheese Monger (not Lara of Petit Fromage).  After truly depressing excursions to AJs (their cheese is a JOKE and they should be embarrassed), then Trader Joe's and Safeway I called over to Whole Foods and connected with Laura. I asked her about certain cheeses I was looking for and we agreed to meet that evening to find unique options for a wine tasting I was hosting. \n\n Laura explained that in the heat of the summer her cheese selection is rather sparse and that it would be picking back up in the fall. The cheese area is one of the smaller that I've seen, but there are some fun options beyond a simple Parrano or Gorgonzola Dolce. I saw some of my old favs like Taleggio, Explorateur, and Humboldt Fog and Laura introduced me to a few new friends, like Hirtenkase, the delightful german cheese that is made from some of the most pampered cows in the world! I decided on a refreshing chevre called Fleur Vert from California, Mimolette and Chaubier, though Laura very generously let me taste through a horde of options to find the right cheese and wine pairings. \n\nI really look forward to checking back in with her to see what new treats are in. I hope I can use her expertise for more wine events and I encourage you, nay, I insist you step away from that enormous Costco Manchego and talk to the Whole Foods Cheese staff about your exotic dairy needs. Broaden your horizons!", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 4, "date": "2009-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w3-jEwGrNUdBmFQsPprYbA", "review_id": "WORjAq3TlsEI5ESNwLVmXQ", "text": "Like any other whole foods. \n\nPrices is outrageous to a point where I rather go to AJ's fine foods. Atleast AJ's staff knows extensively what their product is and super friendly.  \n\nFor organic produce i rather go to sprouts. \n\nThanks but no thanks.", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 2, "date": "2010-10-06", "type": "review"}
{"votes": {"funny": 5, "useful": 5, "cool": 5}, "user_id": "wHg1YkCzdZq9WBJOTRgxHQ", "review_id": "YCOvLD_CC-Pk0kIn7Ox8Cw", "text": "More like Whole Paycheck Market.  \n\nLooking for a way to lessen the mental anguish I feel when I think about where my burger comes from, but not ready to abandon my hypocrisy and actually become a vegetarian, I've been looking for sources of meat, poultry, and pork that actually have some standards regarding the humane treatment of the animals in our food chain (aside from their eventual slaughter, of course).  I'm also lazy and prefer one-stop shopping.  After reading some positive information on their website (and hoping it's at least partially true), I headed to Whole Foods to check out their offerings.\n\nFirst off, their seafood selection was really incredible.  Since I wasn't going to be able to cook it in the next few days, I settled on some frozen salmon filets certified by the Marine Stewardship Council.  That means they can charge $7 for an 8-oz filet.  Off to the meat counter.  I purchased flank steak for $15/lb.  First off, I would like to know why flank steak is ever more than free.  It's a crappy cut of meat in my opinion, but works well for slow cooking.  I also purchased stew meat for $9/lb.  Stew meat!  Another crappy cut of meat.  Needless to say, I did not buy steaks at WFM.  What about pork?  Again, ridiculous prices for chops.  Chicken?  I did find prepackaged chicken for $4.99/lb.  \n\nI did not bother checking out their organic produce since I'm more than happy to consume pesticides like my forefathers.  And wasn't there a big stink lately about some of the frozen produce at WFM labeled \"organic\" actually coming from China? A variety of other items also made their way into my cart totaling $188 for very little.  Needless to say, WFM will not be a grocery store I frequent regularly, but with their pretty amazing selection of seafood, prepared foods, cheese, locally made breads, I will be back occasionally.  I'm a fan of the store, just not their prices.\n\nAs for beef, I found a ranch in Arizona that makes monthly deliveries to the Valley and charges half of WFM without the middle man.  Sorry little piggies in your crates and chicks in your cages, I'm still looking:(", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 4, "date": "2010-10-20", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "qzND3A_Nv89M4sQn8B4TXg", "review_id": "ZH5WX8N6dTr44wv_y2xNHA", "text": "I love the large artisan selection of desserts!  I stop there whenever I can.", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 4, "date": "2010-10-30", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 2}, "user_id": "usQTOj7LQ9v0Fl98gRa3Iw", "review_id": "sGuhG8eqYnPC8xD_yJE37g", "text": "I was up in the area and stopped in. \nIf I lived in the area I would be here frequently but I do find that Sprouts has better prices.  \nMy favorite think about WF has always been their selection of vitamins and suppliments.  However, on this trip I found that many of the things I usually get or the variety I am used to was not present here.  [Sprouts won out again.]", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 3, "date": "2010-11-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "0oRtnPHtvZIE1UNxCDDTPw", "review_id": "YEIzT82S48c2_OiPo45h-g", "text": "I know Whole Foods is expensive, but this place is beyond pricey. I went here since it's the closest one I can get to because I ran out Bragg's Apple Cinnamon Vinegar drinks. I always stock up and buy them in cases. (I'm addicted to this stuff) \nSince all Whole Foods are too far from where I live, I borrowed my brother's jeep and drove up here. \nI have to say that I am not really impressed. The Bragg's here cost $2.39! It only cost $2.19 or $2.29 at other locations! Whole Foods at this location sure know how to rip off people! I compare prices when I shop and always bring my I-touch, so I can google my way around the area especially if it's my first time there. I was disappointed again because this store does not have Wi-Fi and although the employees were nice, they don't know the area either. \nThe only reason I'm giving it 3 stars is because the salad bar had organic kale and my salad was delicious. The hot entree bar was a disappointment. They had 4 entrees there that consisted of pasta, mac & cheese, breaded fish and tofu casserole. That was it. sad.\nSo I drove to Luci's Healthy Marketplace and got 4 cases. Not only is Luci's less expensive, but they also give 10% off discount if your purchase is more than $30. Sorry Whole Foods... I like your other stores, but not this location. No Wi-Fi ? I won't be visiting again.", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 3, "date": "2010-11-13", "type": "review"}
{"votes": {"funny": 3, "useful": 6, "cool": 2}, "user_id": "8JC-Yb3UDUv2FUl5ym1nVg", "review_id": "_0UwDhQ1wm0U6J_zLY8b3A", "text": "And then I found THIS Whole Foods!\n\nAfter my horrible Tempe experience, I wanted to give another WF a chance before going up to the Mayo location (see my review for that one). \n\nThis PV location is quite nice. It's definitely in a much nicer area than Tempe. As most WF's, this location is clean both inside and out.\n\nThe staff is VERY friendly here. Not always the most knowledgable (I had asked some pretty detailed questions about some of the supplements), but they are resourceful. The guy helping me, offered to call other locations for my stuff. Very nice of him.\n\nAfter I picked up everything I \"needed\", I walked over to the prepared food section. Everything was spotless, and fresh. Excellent work. I bought some food to take home. I also got to sample some of their pizzas. Delish!\n\nThen, the best part of the store....the ice cream. It's not your typical FroYo, or gelato that has the consistency of snot. They have the best (in mine, and most Yelpers) ice cream around: Sweet Republic. \n\nI knew exactly what I wanted, so the guy packed up a pint for me to take home. If you are one of those people that can't make a decision on their own like a grownup, then you can sample each of the flavors, while you dilly dally...the lady in front of me was like that. The ice cream guy was VERY patient with her, and even kept up a smile the whole time.\n\nI said it before in a Quick Tip, but this is the second best WF in the area (next to the Mayo location), but the staff here makes up the difference.\n\nWell done, Whole Foods. Well done.", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 5, "date": "2011-09-07", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "8p4at4zdzCpueAmSBaorZA", "review_id": "f02e6oixm-n8SiDwihQVlA", "text": "More like 3.5 stars.  Yes, this place is expensive, but they have the only whey protein shake I like.  So, being in the neighborhood and in need of my protein powder, I stopped by this WF.  It seems a little darker that the others and space is limited, but they had my shake.  So I was in and out in less than ten minutes.", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 3, "date": "2011-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "FHDI8M5sm6lrZXNUBZAOfA", "review_id": "fasmfJ8y_6mwUhVsxJWJ4g", "text": "After living in Tempe for 2 years, I'm very grateful to be now living within 10 minutes of this Whole Foods. If I had to rank all WF in the valley, this wouldn't be at the tippy top, but it's a huge improvement from the Tempe store which would certainly be at the bottom. Way more local produce, much larger salad bar and prepared foods section, and more events.\n\nPeople don't call it Whole Paycheck for nothing, but it's worth it to come mid-week when I couldn't make it to the farmers market and see some solid local options. I'm giddy when they have a huge selection from Sunizona Farms. Since it's also 10 minutes from Arcadia, I am one happy local girl.", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 4, "date": "2011-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oXBahXJCXUEATm5IVexw8A", "review_id": "IvtuxZWfdk_8QcZYMnW31g", "text": "I stopped by for some non-plastic wear (cups and bowls) and was delighted to see their fun juice/coffee bar.  They have a nice selection of different fresh juices, coffees and they even have kombucha on tap!  I don't remember the name of the juice I got, but it had kale, parsley, celery, cucumber, apple and spinach and was soooo good!  Overall, I really appreciate the fact that they support local business and stock their shelves with products that have some freaking integrity.  If it weren't so far from where I lived, I'd probably shop here more often.  Keep it real, guys:)", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 5, "date": "2011-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iLI99hVQ3Dzrzjdk-hiZZg", "review_id": "Wx-oOqDduX4ACVrUBRUAEA", "text": "It's a Whole Foods. They are all the same! Which isn't a bad thing for Whole Foods considering the awesome food and product selection!", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 5, "date": "2011-11-04", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "Ps1Db9zOatoF_76FZNO5CQ", "review_id": "oOdIL0VRKoLBibzWBEjP7A", "text": "I really had a hard time rating this.  The first Whole foods I went to was one of the few big showcase ones in Town Center in Las Vegas.  I happened to be shopping at Penzeys in the same shopping center and knew I had to pick up some veggies for the weekend somewhere.  I found the store to be cramped and crowded.  And the price, I understand why folks call this chain \"Whole Paycheck\".  What made this place 4 star was the quality of the vegetables I ate during the week and the friendly service from every employee I came in contact with.", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 4, "date": "2012-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6khNhFYFO3KSnRAM_9YdQw", "review_id": "Z-8OdH7VcZQbGGf3QR8etA", "text": "I like this little store. It's nothing compared to the giant store in north Scottsdale. However, I like shopping here because it's a little bit less crazy most of the time. They don't carry all the stuff (and no food court or bar-haha) that the other store has, but they still have most of the good stuff. I usually go there after shopping at Trader Joe's!", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 4, "date": "2013-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "AU1mauVM65GCCHjhqjtqaw", "review_id": "ymMHRT1viMzNNTXTwpHohA", "text": "As a breakfast option:  not fresh, low fruit selection, expensive. Stopped here for breakfast while on a hockey trip (after two highly successful b'fast stops at different WF stores in Denver and Colorado Springs--another hockey trip).  Both of the previous were tasty, fresh, and affordable. This WF anchors the other end of the spectrum on all three counts.", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 1, "date": "2015-11-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "rGdvFulgo0qRacIZp-aJ_A", "review_id": "8Dz0F75HrTqpEmXQ471CnQ", "text": "To start with the good, the sandwich was delicious. I ordered the turkey bacon ranch and it was on par with what you can expect from a cafe deli. The turkey was savory, the bacon was crispy, the produce was chilled, and the bread was fresh. If we're going on food alone, it was a home run.\n\nThe ordering experience was another story. The young girl who initially helped me was great. She was new and seemed to not know of the processes, but she was certainly trying and I can't fault that on her. Unfortunately, her manager was not nearly as supportive. It took the young girl almost 5 minutes to drag this woman (the manager) out of her office to fix a problem on the register, and when she finally made it to the front of the counter, she didn't even say hi or acknowledge I was even standing there. There wasn't even what would closely resemble a smile on her face.\n\nIf that young lady who served me happens to be reading this, you were great and this review doesn't reflect you. I only hope that in the future your management team gives you the support you deserve.", "business_id": "6l3UwgKhvhUfxMolobepDg", "stars": 3, "date": "2012-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4UYKNH4vyRpQXr0BbViAKw", "review_id": "LlvZrSqTkXhVAlHtTHFHvA", "text": "Not impressed. Customer service we received wasn't up to par -- guy wasnt able to answer simple questions regarding products they sell. Spoke with store manager who took care of the situation really well, but not blown away with their products. Ended up throwing a Turkey in our roaster bc everyone was disappointed on Thxgiving :/", "business_id": "6l3UwgKhvhUfxMolobepDg", "stars": 3, "date": "2013-11-30", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 3}, "user_id": "AYGHNy8gPxl2Q-etTT3hZw", "review_id": "sEVSM3HwWlcUYVikr8HaAg", "text": "I ordered a ham and turkey breast for thanksgiving. I arrived the day before thanksgiving and there was a line out the door. The staff were working super hard and even though there were 70 people ahead of me, the line went fast and within 20 minutes I had paid and was out the door. \n\nIn the future, I am told the smart move is to pickup your ham and turkey on Tuesday before thanksgiving.  Either way, you will be purchasing very delicious ham and turkey- and your guests will lift you up on their shoulders and cheer for you after they eat their meal.", "business_id": "6l3UwgKhvhUfxMolobepDg", "stars": 4, "date": "2015-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kXT3pVtElactR8nFmeLbbg", "review_id": "TGuAOy-U718yMivk79tiVw", "text": "Yeah, they have hams and whatnot, but it's a good place for lunch too--their sandwiches rock.", "business_id": "Xhrg9t7GGokrQecxXSOvUg", "stars": 4, "date": "2010-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "DrWLhrK8WMZf7Jb-Oqc7ww", "review_id": "1rRjOJqHH9u3LLLnH9JxFw", "text": "The turkey is good here and since I don't like ham. that is clearly an important element for me. With my coupon it was about 8 bucks for meal deal. The sandwich wasn't huge, but it was served on a fresh bakery roll with an average amount of sliced real turkey. Nothing fancy, except I added a slather of chipotle mayo and lettuce and tomato of course. Only a few choices of chips, but otherwise a good basic no frills sandwich with top quality meat inside. Place was empty at 1:30 PM.", "business_id": "Xhrg9t7GGokrQecxXSOvUg", "stars": 4, "date": "2015-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kf5LzB0HaAIpVMd9VNjMcw", "review_id": "OtOvuT9n11eUSlxpc4cC9A", "text": "Q: Why does Honeybaked Ham Co refuse to increase staff on busy holidays, dedicate a register or two to ham reservation pick ups vs. restaurant orders, or simply let us pay for the thing in advance, so we can avoid the ONE-HOUR wait in line out in the parking lot? Every single year. The wait, and the predictable lost-your-order screw ups once you make your way inside, are NOT worth a ham \"cured\" in a stew of toxic carcinogens (check out the ingredients, if you have a while free to read), hoisted on us by a national chain.\nMy guess: to create a false impression of demand for a product that is only ho-hum (excepting the scary ingredients).", "business_id": "Xhrg9t7GGokrQecxXSOvUg", "stars": 1, "date": "2015-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JoOSy4ReLh6oJSBbvVCBog", "review_id": "S4s-PlQlpxv2i51IBbu6OA", "text": "Love this place! Great chocolate, service & atmosphere. And free samples just make me so happy! Raspberry cream truffle is to die for!", "business_id": "4THtcoUYIAW0qBLH7ABG7Q", "stars": 5, "date": "2012-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "LN4cXKGPaGMDHm4nP9Idtg", "review_id": "rnErkvAQ5WXEbduRtdot4A", "text": "I love See's.  My family has been getting chocolate there since I was little.  The stores haven't changed much over the years.  They know what works and have stuck with it.  My favorite are the cherry cordials, mayfairs, and butterscotch squares.  I love that they still give out a free sample.  I have been to really pricey chocolate shops and they do not give out samples.  See's treats their customers well.  One of my favorites!", "business_id": "4THtcoUYIAW0qBLH7ABG7Q", "stars": 5, "date": "2015-11-02", "type": "review"}
{"votes": {"funny": 3, "useful": 8, "cool": 7}, "user_id": "6kmu0mYbdpMIOZ6Y0eVsxg", "review_id": "WsA8pqQxdiEICb-I-36s3g", "text": "This is where I pick up my Bountiful Basket occasionally.  While the food for the co-op is already packaged up for the pick-up, they also have other offerings available at great prices! There is ample parking and super friendly staff.  I've even had people help me out with my bounty.", "business_id": "L_leS8DGulj3iI0QdUppIA", "stars": 5, "date": "2010-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "yRg4mlKsA1MxTs7b_AXslA", "review_id": "qPgVn4wRNSCSrvSXg50EvA", "text": "Started going here for bountiful baskets, but I started realizing I was getting produce I didn't want or need. Then Kodiak started putting out extra things you could buy. Now I am just shopping for the things I want . They do not have everything, but that's ok with me. They also have yummy whole grain  bread (in packs of 5, which you can freeze) and tortilla packs and usually a great price. I went last weekend with my mom and we walked out of there with produce for both of us and paid $6. Oh and they had those huge veggie trays for $1.50! Not sure they have them everytime but that is a HUGE savings over a supermarket price.", "business_id": "L_leS8DGulj3iI0QdUppIA", "stars": 4, "date": "2012-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 10, "cool": 4}, "user_id": "HOleI3jz1MLNUJ6cc1x0Pw", "review_id": "uw7ms2NfDjbi_7C3g2cRAA", "text": "I just found something else incredible about Ranch Market, and I'm going to have to up it to 5 stars as a result. Wednesdays are special produce days, which means that tons of different produce items are on special for 3 pounds for $.99. Yes, my friends. $.99. \n\nI had seen the special pricing advertised on the flyers we get every now and then, but had been hesitant to make a special trip there in case the produce was bad-quality or ran out after, say, 10 am. Well, I went today around 1 pm, and I can tell you that the produce is neither bad-quality or gone after 10 am. There were tons of the special advertised items, and 90% looked super-fresh. \n\nI left with 2-3 pounds of bananas, tomatoes, peaches, key limes, and avocados, all of which cost me a mere $5.62. And just think - just yesterday, I spent $2 for 3 tomatoes at Whole Foods. I'll definitely be back at least every other Wednesday to snag some of these special deals.", "business_id": "iyjEqYqSk-mAya95A9hW8w", "stars": 5, "date": "2008-09-17", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "jWvzAN1czxypi-GM1KY62g", "review_id": "3Y347Io0BDUwNuEet8g8gg", "text": "I describe Ranch Market as the Disneyland of Supermarkets. \n\nSeriously, this is not the place to shop too late at night or you'll never get to sleep from all the excitement you just experienced!  The music is loud, the lights bright and festive, and the smell of the food makes your mouth salivate.\n\nI mainly shop here for three things:\n1) I always buy my nieces birthday cakes there.  The price is fantastic for a customized cake for kids.  The selection is incredible!\n2) If you are familiar with the Mexican baked goods - this place is a one stop shop!  For for a nice change from traditional french bread, try a \"bolillo\" (a Mexican roll).\n3)  Rotisserie Chicken.  \n\nBut ....just so you know...the produce is great and less costly than Frys.\n\nTwo warnings .  First it's difficult to get in and out of the Ranch Market on S. Central on the weekends -- it's VERY VERY CROWDED!  Second, this is an \"ethnic\" experience.   My husband, a \"gringo,\" has, on occasion, encountered some language barrier challenges, but has always been successful in navigating it. - so don't let it stop you!\n\nThe Ranch Market is always on the tour for out-of-town-guests who visit us from the East Coast.  No way would you find an Super Market like this back there -- unless maybe you were in NYC or Miami.", "business_id": "iyjEqYqSk-mAya95A9hW8w", "stars": 4, "date": "2008-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "i9DSitx1CJCCONWAG1FVnA", "review_id": "DcunhsRv8qjJflIvjdogJw", "text": "I found this gem recently and fell in love with the variety of quality fresh produce and the fact that its definitely less costly then the regular grocery stores...um winning!!! Very organized and clean store with an awesome bakery and food market area I haven't got the chance to try yet.  This will now be my staple for yummy fresh produce :)", "business_id": "iyjEqYqSk-mAya95A9hW8w", "stars": 4, "date": "2011-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F6B-A5coQW7gGhi4sd_mkg", "review_id": "1yz_qxjiBqzgS3JzQ-QvNA", "text": "I've buying meat and vegetables here and the inside cafe area always smells SO yummy - we decided to go for dinner - order a burrito and they make a tortilla first YUM .... It was amazing - best Mexican fare we've had and three of us ate for 12.54 and were stuffed! Salsa is amazing too!", "business_id": "iyjEqYqSk-mAya95A9hW8w", "stars": 5, "date": "2011-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mNf-w_tKX2jHdHOlZ7nSkQ", "review_id": "CtQUCwV4OxgDbsBSqmpw3A", "text": "I love this place. Its loud, colorful and fun to shop. There are soooooooo many things in this store that are very uncommon finds. They carry items you wont find locally anywhere else. The prices are great and the restaurant food tastes awesome.", "business_id": "iyjEqYqSk-mAya95A9hW8w", "stars": 5, "date": "2013-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "410n5lOkroV54Z11JVPKjA", "review_id": "JShNJ1bu4Xxi6kOWMSlN3w", "text": "I wouldn't go anywhere else for my produce, but the place only gets three stars because it's a little dirty.", "business_id": "iyjEqYqSk-mAya95A9hW8w", "stars": 3, "date": "2015-09-12", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "jWvzAN1czxypi-GM1KY62g", "review_id": "Fn8eqezDUdIuhh0FKHZkow", "text": "I love it when I run into \"my people.\"  In this instance, I'm referring to New Yorkers.  The Fruit Barn is a family run estabishments and the owners are from upstate NY (or mid-State - depending where you are coming from).  \n\nThe store is kind of like an expanded fruit stand you might find at the side of the road.   The produce is locally grown and they sell a large selection Arizona-only made products (like Honey, dressings,  and nuts) -- stuff you might find at AJ's.  They also have fresh baked breads - off all flavors and varieties.  \n\nBring cash because they have funny credit card/debit card use charges.\n\nThis is one of those little  local stores that you need to stop in and support!   With Thanksgiving and Holiday celebrations coming up, you have a great excuse to stop in and check them out!!", "business_id": "1xoySA9Lzh3lwJeWJsq2Jg", "stars": 4, "date": "2008-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hlq4EBn4ED8Azt9FYLTANw", "review_id": "d1BDS5WE6DWZW_yO8Zm6Vw", "text": "I have only been here once before, but thought I would come back today for a sandwich.  Unfortunately, I had a less than favorable experience.  \n\nA lady, who I assume to be the owner, was reprimanding her employees in front of me.  This made it extremely uncomfortable for me to sit here an listen.  She yelled at 2 different people, regarding different issues.  One of the issues (which did not bother me) She used my transaction as an example of what \"Not\" to do.  All I wanted to do was get my sandwich and get out of there.\n\nThis fruit barn prefers cash payment, and I only had enough on me to cover my sandwich.  I was looking around to see what I could come back to buy later.  Because of this experience, I don't think I will return.  \n\nA word of advise in customer service:  Never yell at your employees in front of the customer", "business_id": "1xoySA9Lzh3lwJeWJsq2Jg", "stars": 3, "date": "2011-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pYpXLk76UmkPnwqXX4nD5A", "review_id": "AkCPLpQ-2lbb2GUndCpysA", "text": "Great people, very friendly. AMAZING prices.", "business_id": "1xoySA9Lzh3lwJeWJsq2Jg", "stars": 5, "date": "2011-09-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "i9DSitx1CJCCONWAG1FVnA", "review_id": "KIO-COtg7gStiptzj1dRHA", "text": "Had one of the best tuna sandwiches here!  I have been wanting to check out so I popped in for lunch and was pleasantly surprised at the prices and fair variety of locally grown produce as well as bakery goods, jams, and other goodies.  The debit card dollar charge didn't make me happy but the sandwich gave me temporary amnesia lol I will definitely be back with cash!:o)", "business_id": "1xoySA9Lzh3lwJeWJsq2Jg", "stars": 4, "date": "2011-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "tHk6UOki4cHYOJoZ7W6VNw", "review_id": "8kqSweZbo8GELq5yLKkDgw", "text": "Great place to do some local and fresh shopping. The ladies are extremely friendly. All products and produce are reasonably priced. Definitely will be come by again.", "business_id": "1xoySA9Lzh3lwJeWJsq2Jg", "stars": 5, "date": "2015-10-09", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 3}, "user_id": "fczQCSmaWF78toLEmb0Zsw", "review_id": "TJiOWtubKhb_hLrUWWFw7A", "text": "The Farm is a perfect place for a romantic picnic, a group, a family, and I imagine even an escape if you want some alone time... the grounds are well kept and beautiful.  Dog friendly also.\n\nThe only reason I am not giving it 5 stars is because they run out of salads that are on the menu if you get there later in the afternoon... (I guess they only make a certain # of salads per day so if you snooze, you lose!)  However, sandwiches are made to order and delicioius...  The iced tea is really good here, and so are all of the deserts.  \n\nSince it's located so close to South Mountain, I recommend going for a hike before and working up an appetite before heading over to the Farm for lunch.\n\nThere are picnic tables, or you can bring a blanket.  I went with a group of people last weekend and we brought a football to play catch... we had a blast!  Make sure you call ahead for their hours of operation.  As I recall, they close at 3pm on Sundays and they will kick you out if they have to because I think there is a gate or fence they close as well.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 4, "date": "2007-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 5}, "user_id": "rg5pRVVh-mtBjNqKB1N2Tg", "review_id": "4__lRiU03djhIPYI94HSRw", "text": "I can't say enough good things about this place.  I was introduced to it when a couple of friends of mine got married here.  I am still impressed by it five years later.  There are a few eating options here, a couple of restaurants and a large picnic area.  It's an oasis in the middle of south Phoenix.  The area around it is nice too, the old farming lifestyle all around.  If you weren't around in Phoenix twenty years ago, you can see the type of farming pockets that used to exist in more frequency around the city.  The only thing missing is an orange orchard with the trees painted white at the trunks.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 5, "date": "2007-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "b60JsTGYbVqUGYbI81aOsw", "review_id": "5406XtidkJ2OV8T94lhQ-A", "text": "The Farm at South Mountain was the recent cite of a Mom playdate my friend and I scheduled when it happened that both of our moms were in town over the same weekend.  \n\nWe went to the breakfast place, which worked out well because I probably would have lost my mom to baby fever if we'd gone to the lunch spot, as there were several tables of baby shower celebrations set up there.  \n\nI thought the food was alright, but not great.  I loved the fruit salad that my mom ordered and thought that the mint syrup was an innovative touch that really classed up a pretty standard assortment of melon.  The egg burrito thing I ordered was on the rubbery side.  I'd definitely go again.  If only for the mini bottles of champagne.   It is nice to sit outside and look at all the flowers and eaves drop on the young couples and watch all the baby shower guests cart huge gift bags from the parking lot across the street to gingham covered tables under the shade trees.  \n\nI hope Del Web or some other super developer doesn't purchase all the surrounding land and totally ruin the illusion or originality and quaintness created by a brunch at the Farm.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 3, "date": "2007-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "RFxGMdmY1QusSsLPCVY6Vg", "review_id": "J9jU1y0TpwkgUWrOIg7dYA", "text": "The grounds were so green and peaceful that the food came second to the environment. I tried the still-warm-out-of-the-oven cranberry-walnut scone and the American Breakfast. The scone was definitely a do-again, but I think I will pass on the applewood smoked bacon next time. I also tasted the waffle, and I would order it just for the blossom honey whipped cream alone...it's fantastically light and delicious. The coffee was okay, but it was on the acidic side, and not really worth the $2.25. Nonetheless, the service was great and the walk around the gardens was inspiring. If you check out the chicken coop, don't touch the fence - it's electric.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 4, "date": "2007-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jWvzAN1czxypi-GM1KY62g", "review_id": "3dW551tPKxMjEzjQIJZj5g", "text": "Oh, I'm a fan.  Ever since we moved out from Washington, DC - three years ago and stumbled on this green oasis in the midst of all the brown.  Anytime I miss the East Coast,  we visit the Farm at South Mountain.  It turns out that The Farm is convenient to us as well.  But I'm happy to know that folks come from all over the Valley to enjoy the ambiance.\n\nWe love the breakfast.  YOU HAVE TO TRY THE MONTE CRISTO breakfast sandwich - it's a little slice of heaven (actually it's a huge, gimundo slide of french toast stuffed with an egg, ham, and swiss - except the description is a little fancier than what I've outlined ).\n\nWe've been going religiously for three years - almost every weekend when they are open.   The wait staff seems to revolve frequently- which is sad, because I love it when people know my name (it makes me feel special).", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 4, "date": "2008-09-18", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "JVeCUlDmcwJ3pteEdmzeHg", "review_id": "2ih2_uY0plwnZhtjXuqNTw", "text": "I have always enjoyed the atmosphere at the Farm. The menu is served cafeteria style so its quick service. My favorite part is finding a seat amongst the pecan tree orchard at a picnic table - makes me feel like Im at a picnic. If you visit at the right time of year - all of the foliage is blooming\nA little bit of a drive for me - but when has that ever stopped me!??\nEverytime I eat there though - I have not been impressed by the food. The salads ok....the pastries have you salivating while in line but nothing special.\nIts too bad because they get the thumbs up on everything else.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 3, "date": "2008-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yCn-Cq8_Tvbs8wkcEIm2lw", "review_id": "nkrjKbQJXCwvvPGb1wTK9Q", "text": "This was a cool little restaurant with a great option to eat out under the trees. I loved their soup!", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 4, "date": "2008-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "r0hdHLsCcCV8J4CIJDqAMA", "review_id": "JKiA19lJKvYlTiIuUq-zeQ", "text": "So different and refreshing. I love the set up and fresh ingrediants, great expierence, I can't wait to go back!", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 5, "date": "2009-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "g9A9krUcmPuO3Uv8WnGP4A", "review_id": "PvFn0r92GYBUYmnNEaMydA", "text": "I love the atmosphere here but the food has taken a turn for the worst.  This used to be my favorite breakfast place but something has changed.  The food looks like the chef does not care.  There was no garnish on the plate, my eggs were cold.  My friend's waffles were burnt.  This is a lovely place to visit with a friendly wait staff but I do not recommend the food.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 2, "date": "2009-10-24", "type": "review"}
