{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Zjk7cSjOCgk1gFF_z1OCXA", "review_id": "7WDs4QT6S7HjFUP-FGO6EA", "text": "i'd have to say, this place isn't all to shabby for sushi. we used to trek here from CMU to get a taste of good but decently priced sushi. i'd definitely recommend it. the wait staff are super nice too. and it's never too difficult to find parking in the neighborhood.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 3, "date": "2006-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "txPBzz6u3yjq_J6SY-xaHw", "review_id": "7E4F9FX2pipIVThW9D7w-Q", "text": "Sushi Kim is the spot to go for authentic korean food in pittsburgh! cant stress it enough, mr kim and mrs kim are always there working literally if you had asian parents that made epic food mr and mrs kim would be it, nicest people ever and they are vetted. \nThey specialize in Gailbi, asian short ribs which they make a custom marinade for and is personally my favorite, also try the Bulgogi, fantastic. They have awesome sushi, (Mr Kim filleted a flounder in front of me and then gave me a piece after he had descaled and cleaned it, great experience overall) and soups, Yukgaejang especially is phenomenal. KBBQ on the weekends you get endless gailbi, bulgogi, chicken, mussels and clams. Not to mention Banchan off the charts. \nIf you are visiting or live in Pittsburgh, you need to give Sushi Kim a visit. I highly recommend it. \n-Not your typical yinzer", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 5, "date": "2015-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "hCKkTKakQ0XRSspZaMauxw", "review_id": "B8k8j_92KWf7F0qDilu1fw", "text": "A mighty fine place: the banchans, soondobu, panjul [seafood pancake] the best i;ve had-- better than the koreans places in NYC.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2010-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "gb2JIM7M2mj7thEjdbfksA", "review_id": "qqgNPR99993GLIbZMuIQ9g", "text": "The food was good, and it's one of the few real Korean places in the Phoenix Metro area, but the service was what ruined my meal here. As expected, my group and I were put in the \"white person\" area away from the main floor. And we had to wait 15 minutes to even be asked for water. It was great food, third to only Las Vegas and Orange County. Would I come back here? Probably, but not any time soon.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2013-11-23", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "90a6z--_CUrl84aCzZyPsg", "review_id": "jXsuzEWSJeBk1SJr9yKssA", "text": "I really like the food here - it's well prepared with quality ingredients. Not much on atmosphere (unless you like dining on picnic benches under the glow of florescent lighting), so it's best to call ahead and take it home with you.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 4, "date": "2010-09-30", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "I-P1v7sRjDLEfVOndp01kA", "review_id": "lGZpym4dWOyFHvIswV6K2Q", "text": "Service is meh-- the server was zoned out, grumpy, and unprofessional.\nThe kimchi and radish side dish are MEH.\nI liked their side dish of jap chae (clear noodles marinated in soy sauce and oil) tho.\n\nI ordered dumpling soft tofu soup (medium spice).\nIt was okay, not the best I had.\n\nThe rice is cooked in a stone bowl, scooped out in a stainless steel bowl and served.\n water is poured into the stone bowl (some remains of the flaked rice is left) and is served.\nIt appeared BROWN... like diarrhea\nthe rice was okay but not spectacular.\nAs for the stone bowl,\nDON'T even taste the contents. It left a bad burnt taste on my tongue.\nGross.\nTotally ruined my meal.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2010-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "b2ug9kjp8N4KtZWYpr7iZg", "review_id": "ww3t4NSqfwjRDuRM5xgz1A", "text": "We had the a la acarte, and sat on the other side.  The other side was for all you can eat with the \"cook your own meat grill\".  The service was good and fast; which is what you expect at most asian restaurants.  The bulgogi was really good.  I have been looking for a place that had the same taste and flavor as the one back home; and this one is quite similar.\n\nThe only thing was the cleanliness of the restaurant.  It wasn't in tip-top shape.  And, I don't like eating while I have to shoo a fly away.  Next time, I may just have the order to go.  Ohh, and another thing..it was a little pricey than I had expected.  Typically, you can judge at how much a restaurant will be based on looking at the restaurant.  I think the bulgogi was $14?!  A little steep.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2012-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FH3kfJmKqiIkyh_NUKzgzA", "review_id": "JM6zmIvPry3sO6FtKsTdYQ", "text": "Contrary to the name... This place offers limited tofu/Veg options.\n\nThe service was mediocre and bland. We were never acknowledged when we entered, no one checked to see how the food was....\n\nWe left feeling empty....  Both in service and quality", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2013-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6nlkNTpTcVdZJomx6MbeQw", "review_id": "dvloiarpVrDzZSCdbSQayA", "text": "My favorite Korean BBQ spot! They only get 4 stars because the service is extremely slow, and when you flag down the waiter and tell them what you need, they look at you and walk away to continue ignoring you! all in all, the food is amazing, and the price and quality is superb! highly recommended.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "HxDBxsCkz9yJ6zd6AiBTwA", "review_id": "zABpDmlvIkfO7Xs5Tof8RQ", "text": "I come here often with my boyfriend and occasionally with some friends. It is probably the best place to get as much meat as you want. Yeah its a hit and a miss sometimes but that's with any business I think. This place has a great price for AYCE another plus is that the grills are big enough to put your food on! Those round ones at other places are such a pain in the arse! We always stick with getting steamed egg, brisket, pork belly and the short ribs. Needless to say not a bad spot! :)", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RE1bDF0f1KbSE4uR_YKfBg", "review_id": "gdkIi0s2cT2OgEcQNyhARQ", "text": "These idiots had our party of 7 sit on a table with 1 grill and had a party of two sit at a table with 2 grills.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2015-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Nf5L5hIq05i1a1uUM7FJwA", "review_id": "eBAb3ScyW5_1zEYJGt2COg", "text": "I've only been once, and it was my first time at Korean BBQ, so I wasn't sure what to expect. Our server was so nice! The meat was delicious, the sides were decent, and the blackberry wine we had was yummy. But it all seemed very pricey for what it was.", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 3, "date": "2011-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "J3SnO1QkK6D37q18lVh02A", "review_id": "t-Kp8ZoxABlVX5CdfmtYcg", "text": "I decided to give this place a try for a high school event about a year ago. This is now my go-to place whenever my friends and I are hungry and are looking for an all you can eat place. But during lunch, they don't serve all of the little side dishes that are usually served before the meat. No kimchi for lunch? Seriously? And gratuity is ridiculous. Besides those cons, the meat's pretty good and the service is good too.", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 3, "date": "2014-11-12", "type": "review"}
