{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uK8tzraOp4M5u3uYrqIBXg", "review_id": "Di3exaUCFNw1V4kSNW5pgA", "text": "All the food is great here. But the best thing they have is their wings. Their wings are simply fantastic!!  The \"Wet Cajun\" are by the best & most popular.  I also like the seasoned salt wings.  Wing Night is Monday & Wednesday night, $0.75 whole wings!\n\nThe dining area is nice. Very family friendly! The bar is very nice is well.  This place is truly a Yinzer's dream!!  \"Pittsburgh Dad\" would love this place n'at!!", "business_id": "UsFtqoBl7naz8AVUBZMjQQ", "stars": 5, "date": "2013-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S-cLXeiWkUVnCDPEtu55Vw", "review_id": "9ZKOzKuxIM_DgKC8bb3wWg", "text": "He was incredibly sexist/homophobic. He could barely play the piano and when we finally recognized a song we could actually dance to he literally asked me to get off stage because he didn't like another on stage who could actually dance with the girls.", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww", "stars": 1, "date": "2014-11-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SxOjm8u40Vf_v52UJyqw4g", "review_id": "CoxR8OTu1jEODKW2C0Kxwg", "text": "The food was good but we Waited an hour for our drinks then 1.5 hours food then an hour for our bill. Won't be back! Not busy at all so not sure what the problem was. I'd hate to be there when they are \"busy\".", "business_id": "sbW8qHJgzEIH42B0S-3New", "stars": 2, "date": "2015-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Bq-4Wan0Y2klBlgqWWaEjA", "review_id": "C3lqt6om7TtlEUDxA6E_8Q", "text": "The absolute worst service I have ever had at any bar or restaraunt.  And, in looking at other reviews, I am not the first.  There are many options at the Waterfront, and I would suggest you try any of them; but stay far away from this place!", "business_id": "EoAY1JSVeJriBzId8lUQwQ", "stars": 1, "date": "2012-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MlqlKOdz1MshRLjEA2_08A", "review_id": "ZWzhsTI6_ducQfOEjPiv0Q", "text": "Wings are overpriced. And the quality of them are bad. They were tough and greasy. The staff are pleasant but then over all experience was too expensive for a sports bar.", "business_id": "Ts4xsKPU7FNPPZRj-nRjIg", "stars": 2, "date": "2014-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "hYaLWF-gCxMMsTEMTMw-sQ", "review_id": "cfEBCcLC_J1QIDtSiKk04A", "text": "If I could, I'd dock a half star after my second visit.  But I feel positively enough about my first meal there, that taking off a whole star seems harsh.  \n\nI got a free entree coupon for my birthday, for signing up for Big Burrito's mailing list, and decided to revisit Casbah.  The good: we got to enjoy the patio even though the weather was a little cool because it was heated.  My maccheretto, a pasta entree with white beans, sun-dried tomato, pesto and walnuts, was very good.  The pasta was al dente and the white beans were perfectly cooked (not mushy).  It was maybe a touch too salty (the fontina, maybe?), but I was happy with the choice.  \n\nNow, onto the weird.  After taking our orders, our waiter asked if we wanted bread with our big-calorie pasta dishes.  Checking if we want bread is fine--but, umm, he could have left out the comment about the pasta?  My friend and I are both twentysomething women.  Luckily, we're not that insecure about our bodies.  We like to eat.  Yes, bring the bread.\n\nWhen he brought our entrees, he sang \"Happy birthday to you, happy birthday to you\" under his breath as he put my pasta in front of me.  I don't like people singing to me at restaurants, so I'm grateful it wasn't audible to everyone else on the patio--but a simple \"Happy birthday\" would have sufficed.  Then when he cleared our plates, he asked if my dish was \"everything [I] wanted, and more.\"  I appreciate the gestures, but it felt artificial.\n\nHe asked if we'd like to see the dessert menu--and added that he was supposed to ask that, that we shouldn't feel obligated.  Uh, what?  I think this and the bread/pasta comment bothered me the most.  \n\nTo redeem the birthday coupon, you have to show an ID.  I recently cut my hair, so it's different than my license photo.  When he returned my ID to me, our waiter said, \"I like the short hair.\"  If this had been the only unusual statement he had made during the meal, I would have taken it as a compliment.  I guess it is one.  But when considered with all the other weird things, it just felt like he was trying way too hard and my friend and I both felt awkward.\n\nThe food here is good and I feel that the service this time was unusual, and the more professional service I had on my first visit here is closer to the norm.  I'd feel leery, though, if I were to have this particular server again.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 4, "date": "2010-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "JFxN23s3ZniO7ZI_Wg7V5w", "review_id": "nAfb7lRtp874j0fQKrPb9w", "text": "So I'm a lowkey snob when it comes to going to nice restaurants and though a lot of places charge an arm and a leg, are overrated, and are just not up to par with what I'm used to coming from Sf and La. With that said, casbah was a nice little taste of home for me.  It had really fresh ingredients and a nice selection of wines to go with. We started with a cheese trio with was paired well with different preserves and chutneys.  We then had roasted octopus and the scallops.   The scallops for me were very interesting and a little too sweet for my taste with the pear and lacked texural components.  However the octopus has a real nice char, and was full of great well rounded flavors.  For our entrees, my bf got the duck which was underseasoned, and the fat was jot rendered out correctly.  The skin was also burnt.  The sides and vegetbales of the dish were seasoned and cooked beautifully though.  I had the lamb loin and it was perfectlh medium rare with delicious bitter greens.  I honestly loved every part of my entree and the red wines we selected went well with the meal. \n\nAll in all it was a delicious meal and a really nice environment.  And worth the money.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 4, "date": "2013-10-30", "type": "review"}
{"votes": {"funny": 5, "useful": 5, "cool": 4}, "user_id": "Ai1t-UCf0ElszaDajWlnwg", "review_id": "JH_nlDFAOQGSxe3qrg4fuQ", "text": "\"Can you believe that the only reason the club is going under is because it's in a terrifying neighborhood?\" - Gob Bluth.  \n\nThis place is SO unbelievably cool.  The taps are constantly changing up, the specials are awesome, and my biggest surprise was that the food was amazing.\n\nThe waitstaff and bartenders are knowledgeable, efficient and friendly.  And the owner of the bar who doubles as the chef is a charming mofo.\n\nOH, and, you get to throw peanut shells on the damn floor.  I would never have guessed that I would gain such satisfactions from a never ending supply of peanuts and popcorn, but I do.  I really do.\n\n*note: this place would be fucking deadly for anybody with a peanut allergy.*\n\nThe crowd is usually awesome and they have live music regularly.  It's in an emerging area of the North Side.  It's an area that really has come leaps and bounds from when I was growing up here, but it can still get pretty sketchy later in the evening.  I say this as a smoker who gets to go outside and watch the circus as it unfolds.\n\nPlaces like this are why the North Side has always been such an awesome area and will eventually regain the crowds of it's glory days.  It's not like a mirrored-room with polka dot mannequins, but then again, what is?\n\nOh right.", "business_id": "YRDKsBFYP7G0E8BLJKIkvA", "stars": 5, "date": "2011-10-04", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "q7MrNVt1FE23rwtWmPYWHg", "review_id": "rjFin8PuWp6z5Zo32NHyyA", "text": "Let me start off by saying that I am unfamiliar with German food. I cannot compare what I had with what is served in Germany, but I will describe my experience. \n\nI ordered a special, which apparently changes at weekly or monthly. The name slips my mind but I will describe it thus: homemade mac and cheese (not the processed powder stuff!) with mini shell pasta. Crumbled crackers topped this concoction that tastes eerily like my grandmother's. She is Italian by the way. The mac and cheese has a variety of 3 different sausages sliced: knackwurst, bratwurst, and Weisswurst. The portion was large! I had to take home about 1/3 of my meal. Maybe the breads and side salad filled me up. :) In my opinion, it was good but doesn't do well as a leftover. \n\nMy dessert consisted of German chocolate cake. I know, I know...how original. BUT I LOVE GERMAN CHOCOLATE CAKE!!!! And yes, I do know that German chocolate was created in America by a man with the last name of German...STILL LOVE IT!!! \n\nI NEED to go back soon so I can try more of their food. One visit isn't enough. I had my sample and I want more!", "business_id": "IxQ1ATP_Wg_QujO9nywzcQ", "stars": 4, "date": "2011-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jIFg8BUDBhjsNQnCJSiOEg", "review_id": "9NEfZ6nRTYAsl90AhA7gnQ", "text": "I was at Max's last weekend. I'm from Chicago, so I was looking forward to trying a German pub in the Deutschtown neighborhood. Our friend took us here, and I really enjoyed it!  \n\nThe service was great and very friendly. The beer selection was awesome, and all the food was delicious! The menu is huge! We ordered the soft pretzel appetizer and the sausage and cheese plate, and both were very tasty! The mustard dipping sauce is phenomenal! I couldn't get enough of it. I wish I had left room for dessert because everything sounded spectacular. \n\nThe restaurant itself, which I heard used to be an old hotel, was quaint and cozy. I enjoyed the historical elements of the place; all very authentic and special. \n\nI will definitely recommend this pub to anyone traveling to Pittsburg!", "business_id": "IxQ1ATP_Wg_QujO9nywzcQ", "stars": 4, "date": "2015-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UDNzg_BLNaNkHCRU6YVkYA", "review_id": "3zaVU6ifP8dLE1EkSTxIvQ", "text": "got the buffet pizza was good they also give you free soup to .", "business_id": "qemCNgjeYGcFsRwxW9x4xw", "stars": 4, "date": "2013-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HC1zr2aBxtgiQXLhfpaRlQ", "review_id": "WkkxVeDUJ4HlN25dLrcjMw", "text": "D's is a legend in beer in Pittsburgh. The selection can't be beat and the food is unique and a style all its own. Thanks's for the years of beers, D's", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 5, "date": "2009-10-17", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "So32N7bSbUd1RwhFtI6jTQ", "review_id": "ynOtIUMl7dMCWufFOVO-sw", "text": "My three stars are for the decor, wow so much to see! There was a giant mural on the wall to the left of our table with just about every iconic figure from Kermit the Frog, to Einstein really it was a sight to see. My little sister, little bro and I had a blast playing where's Waldo, while we waited for our order's to be taken. The  decor and wall murals were about the most interesting thing about our dining experience.\n\nFor a meal for 3 people I spent $50 ouch that's a little high for a hotdog shop and something I wasn't expecting such a high bill.\n\nThe kiddies did enjoy their meals, we got cheese and chili fries, a mason Dixon dog, a red alert dog,  two beef dogs with mustard and ketchup, two drafts of pumpkin ale(for me) and a Philly cheese steak. \n\nThe dogs are  bigger than average, but the chili tasted like your standard chili from a can, I was hoping that with the price tag of $5.00 a dog the chili would have more character. \n\nMy little bro proclaimed at the end of his meal, \"I'm full, I've never  been full off of two hotdogs!\"\n\nI'll do anything to put a smile on kids face, even though the food fell flat, the restaurant was fun and we smiled laughed and jokes through a rather mediocre meal.", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 3, "date": "2012-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "SlKJNLm1SQdgaaKtqD--1w", "review_id": "UYzFu1awMdzrDgPGAkPwMg", "text": "The best hot dog I've had. Ever. I also have to say trying to decide which hot dog I wanted was by far one of the hardest decisions I have had to make (food-wise). Eventually, I got the chihuahua dog because it was out of the box and I wanted try something new. It comes with avocado spread, salsa, cheddar cheese, and jalapenos. The dog itself was perfectly crunchy on the outside and juicy on the inside and really just the best I have had. The toppings were great and I was happy I gave it a try. My friend got the bacon and cheese dog. I was expecting bacon bit type bacon, but they were full strips of bacon that were perfectly crisp and the melted cheese was right on. I am certainly going to come back and try a new hot dog. I am very exciting to finally have a hot dog place that I know produces fantastic tasting hot dogs. \n\nI would definitely recommend you give this place a try.", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 5, "date": "2014-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OdXHaoMJrdZpFN20R5cXmA", "review_id": "ynRJf9_pdtt0pXVbPBe3xw", "text": "Saw Tim Cauley there one time. We played billiards and darts together then we picked a song out on the jukebox. It was fun", "business_id": "7lDNKKxMV84KIS1OVZOepw", "stars": 5, "date": "2015-11-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Iaw3lIyLcS7Fy8yryt0myw", "review_id": "Ohckjhw6d-MAk7IlbgwD8g", "text": "Well it is a Sunday night and the crowd is not here. I opted for the bar to sit and eat and found the entire wait staff joking it up about tossing salads... No really.  The bartender showed up to try and direct them to not sit there ... That lasted all of 5 minutes. Very unprofessional staff so far.  Well now I know about this waitress' tanning habits and dog problems... Her ex must have ran, not walked away from her. The bartender is keeping the service end up despite the completely unprofessional staff around him. Food was typical for Olive Garden so no surprises there.", "business_id": "zpNGtjBlIkDq_PLGSCPlAg", "stars": 2, "date": "2015-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iPTZ9JTTdq4dzbJPM5O8tQ", "review_id": "2hgP0A-hnMbFoU5BoYF0JA", "text": "Hit or miss. I enjoy the atmosphere here and their red velvet cake martini is to die for. The food, however, is a different story. I enjoyed the balsamic chicken wrap which was full of flavor, robust, and refreshing. The buffalo chicken salad, when on special and available, is the perfect portion and served on a spring mix. If you're feeling ambitious, just stick to the tried and true. I had a chicken sandwich and I got to the center for an unpleasant surprise: pink meat. Yuck! Aside from that I tried the steak salad which was a major disappointment since the meat was gristly and tough. Overall stop in for your favorite wrap and a special flavored martini, but resist the temptation to try a new dish.", "business_id": "OxIeMVcop5oxBUWANi-1Rw", "stars": 3, "date": "2013-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "946V1QGcAqScy7PlO5JZTg", "review_id": "Oa-NrFvcKvxsGFkTpNPbyA", "text": "Visited with a party of 8 last weekend for a friend's birthday. We walked in the door and could see no apparent host stand, so we tried the door next to the one we entered. This ended up leading to a private party. Can you say awkward?\n\nWe went back in the main door, clearly confused. The bartender looked at us but kept pouring drinks (rude!). Not even sure how we discovered it, but the host stand was in the BACK of the restaurant. How were we supposed to know this? We were seated, and had to wait awhile for service.\n\nFinally, the server came and took our drink orders and suggested a very strong drink for me. He was obviously trying to get me drunk (and succeeded). Caution: The Vesper is a strong *ss gin martini that is just okay. You pay 11 bucks to drink a shot of gin slowly from a fancy glass. \n\nHe then took our order...and did not think to write any of the 8 requests down. Yep, you guessed it. He screwed up our orders and bills, then proceeded to be rude about the situation. \n\nThe buffalo chicken dip is awesome, but be prepared, there is no chicken. We had one chunk in the two orders. The deep fried pita chips taste like donuts and are muy excellente. \n\nAlso, prepare yourself for bartenders squeezing caramel into glasses. The sound is reminiscent of flatulence. Over and over. So much flatulence. \n\nI was too drunk and full of pita donuts to eat my dinner. The two bites of my pork belly sandwich were pretty alright though.\n\nJesse from Bob Evans down the road is far superior to the condescending server here. We highly recommend Jesse.", "business_id": "OxIeMVcop5oxBUWANi-1Rw", "stars": 2, "date": "2014-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EIcdq6XqVNvq8fQL8fglIA", "review_id": "krjB4kdJ5xDK0-dtXE-zIA", "text": "Good food, good atmosphere, and jazz music make this a regular lunch-time destination for me.", "business_id": "-nfzEVOVvmDSFbxvBsllGQ", "stars": 4, "date": "2013-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "ukrBUZXE5K1J57FI7ve_RQ", "review_id": "LXY5KWqnN4nqzLnkROxRzw", "text": "Bloomfield has some hidden gems and Nico's is one of those kind of places that is getting less and less common around the 'burgh. It's not a gastropub, it's not bohemian, Nico's is just an old time bar/restaurant that makes me nostalgic for a time before I was even born. \n\nI always come here on Monday nights for the wing special. It's something like 24 wings for 8 bucks which is not a bad deal. There are definitely better wings around the city, but I still keep coming back to Nico's. Maybe it has to do with the friendly atmosphere (seems to be a family run place), and the divey feel. The location is great as it just pops up in the middle of a residential section in the heart of Bloomfield.\n\nThe patrons are always friendly, and on more than one occasion I've had random people start chatting me up like we've known each other for years. If you are feeling adventurous try out karaoke night on Saturdays, its always good for some laughs and fun times.\n\nLong live the old school joints in Pittsburgh, I hope you last forever.", "business_id": "tQpYnf3P3Q_OQLYYJvlV-A", "stars": 4, "date": "2011-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "RobeXeaUf_E9x8Jp5tnEiw", "review_id": "MZd5Xl733Gws3EQh5pjEsA", "text": "In general, I'm not into sports bars, however, Silky's at Liberty and Evaline has that genuine sports/Irish pub feel to it that's just right. Sitting at the bar is really nice, there are at least 5 TVs to watch your favorite sporting event on-- there is also a shuffle board table and I see groups meeting here for after-work drinks often.\n\nThe food is A+ bar food, I love the Reuben sandwich and every night they have some themed drink special night. I think Thursday night is ladies night and on Friday they have free wings from 5-7. The last time I went I watched the U.S. Open Women's Semi-finals and the wings did not disappoint!", "business_id": "3zgswf_NfBJpeAoWeTkgMA", "stars": 5, "date": "2007-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UD7Y1CqfY6mDmRwIuCf6nA", "review_id": "9tUS_JzCavirH2AGrjzQLw", "text": "This is my go to place when I am craving a turkey burger.  I cannot complain at all.  The size of the burger is great, especially when I have that craving.  It amazes me.  Of course I make sure to get all the toppings I can, they all seem to go nicely on that kaiser roll.  Side of fries is a must albeit it is hard to decide which type to choose from.  Regular old fries, sweet potato fries or Cajun fries, it's so hard to pick the right one (or maybe an excuse to come back again and again and pair it up differently).\n\nOne thing that I always definitely do here is find the Pittsburgh Earthquake crack.  Not much is out there information wise for this event, but I always make sure to find it.", "business_id": "7XXmky6YYjsvKFwho_eavg", "stars": 5, "date": "2012-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5Yx_Y9_Vp66HHg2muMqydw", "review_id": "1QcYrV5IGRxGsuZaHNfooA", "text": "I've never had their food, but their draft beer selection is top notch. It's somewhat surprising as this is just a neighborhood bar, but they offer a variety of high quality drafts.", "business_id": "jJfTh2O3M2Q716akd9Dr9w", "stars": 4, "date": "2015-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vemRW3Var0MvrmSSn_X2tQ", "review_id": "RIOVPb4HwDWBX4TKTXUpfw", "text": "I haven't been home to Pittsburgh for a while and I was really excited to get out and explore the food scene. Although Harris Grill wouldn't have been my first pick (I try to stay away from the preppy Shadyside scene), I was pleasantly surprised by  the atmosphere, food and service!\n\nI really enjoyed indoor atmosphere that mixed trendy decor with dim, sexy lighting. Our server was excellent and kept the drinks coming and I was extremely impressed by their craft beer selection. And I would certainly come back to enjoy their expansive outdoor patio.\n\nI got to sample a lot of different selections. We started with the Dippo de Queso con Carne, which was a spicy mix of chilies, cheese and chorizo. Served with pita bread, it was good but there are better things on the menu. And onto those, the Baby Burgers were delectable as were the 'Britney Spears' (I swear that's the real name). The Britney Spears were marinated and skewered chicken that was served with some zesty chipolte sauce and rich pesto. \n\nAfter all of this I probably would have given 3 stars. HOWEVER, the Mac & Cheese was excellent and as a connoisseur of mac-n-cheese, I know my stuff.  What topped off this meal was the incredible Eggplant Lasagna (Lasagne Aubergine) that I shared with a friend. Now, I'm not one to ever order anything that doesn't have meat in it. But I would truly go back to Harris Grill JUST FOR THE EGGPLANT LASAGNA. The eggplant was breaded and fried and layered with pesto, marinara, and layers of delicious cheese. I would highly recommend this dish to anyone, whether you're a vegetarian or not.  And I will certainly be going back just to check out their bacon night.", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 4, "date": "2011-09-21", "type": "review"}
{"votes": {"funny": 3, "useful": 6, "cool": 7}, "user_id": "9OZH1Ecw-qUkCW5MS0NefA", "review_id": "a7M6CD8gnZISuU4L2Cv2jQ", "text": "Sooo...I ended up here last Fri. night at around 10:30 after a total customer service fail at another bar downtown that shall remain unnamed (see my bad customer service list if you must know...)  My friend and I had just finished crawling the art galleries downtown, and were in the mood for some libations and grub.\n\nWe started off with some drinks.  Upon opening the drink menu, I was struck by its length and breadth.  I was initially tempted by the lavender-lemon concoction, but ultimately decided to go with a white Russian, since I'd never had one before and my lab manager had talked them up, and I enjoy my drinks sweeter as the night goes on.  It was a nice little drink--very smooth and strong, and I enjoyed the blending of the vanilla and coffee liqueur.  The best part, however, was the graham cracker crumbs on the rim!  My friend went with the painkiller, a favorite of his.  I had a sip, and it was also quite good, even though it involved coconut and I'm not usually much of a fan of coconut flavor.  Later on, he also ordered a beer (forget which kind) and a shot of yellow cake (he explained that this is a tradition because [insert backstory involving hung-over friends here]), whereas the white Russian was sufficient to quench my alcoholic thirst for the evening (I'm a lightweight when it comes to drinking).\n\nIn terms of food, we ordered the large plain macaroni and cheese.  (He doesn't eat much seafood, and I don't eat beef, which precluded all of the other options.)  Given that I'm a mac and cheese connoisseur, and that another friend recommended the mac here, I was excited to try it.  When it came out, it looked quite attractive, with interesting noodles and a sprinkling of bread crumbs on top (I'm a fan of bread crumbs on my mac).  While the flavor of the cheese was pleasant, the cheese:noodle ratio was way too low, to the point that I ended up scraping the plate to get enough of it to cover my noodles. This should never happen with a quality mac and cheese!  Even my friend, who'd had the side dish mac and cheese before, said he thought the cheese was lacking in quantity.\n\nBecause there wasn't any seating available on the patio, we were seated inside the door to the left, against the wall between the hallway and the bar.  The lighting was pretty dim, which made it a bit hard to see.  The atmosphere was definitely casual, and service was acceptable (though perhaps could have been a bit more attentive).  For the items listed above, we spent $50 + tip, which seems a bit steep.  If I were to return, I'd try to come during happy hour, since they have some nice deals on drinks and food.  3.5 stars.\n\nEDIT: I think the lack of cheesiness in the mac and cheese that I received was a fluke, based on reports from friends and the owner's comment (see below).  I'll have to come back another time to resample it--if I do, I'll update my review accordingly.", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 3, "date": "2014-10-01", "type": "review"}
{"votes": {"funny": 8, "useful": 10, "cool": 10}, "user_id": "bhZ13wN_5lQrKX278AP_aw", "review_id": "R2CcHEKxuYSYVYe6glXAaA", "text": "I love Mac and cheese.  After seeing the pictures of a variety of mac and cheese options, I knew I needed to test out Harris Grill.\n\nI came in with two friends a few days ago.  My friend and I split the \"I Can Has Bacon Cheezeburger\" and an order of Mac and Cheese.  The total for this was about $12.50 with tax each. The burger was good but not special.  There was more bacon on the burger than most places, but it was not the star of the meal.  The mac and cheese, however, was fantastic.  The portion was quite large, and our awesome waiter brought us some Sriracha, which was a great addition!  There was lots of rich cheese sauce, which was extra yummy on our french fries.  This is one of the top mac and cheeses I have had in Pittsburgh.\n\nThe place is a bit dark, and even on a Wednesday night, most people were already toasted at 6 PM.  The witty menu is fun to read while waiting for food as well.\n\nParking can be challenging on Ellsworth so be prepared to walk a bit.", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 4, "date": "2015-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eiJgm1J8RW_X72ZzCWYl0A", "review_id": "oH9T12Mma_HZIwEuwMv-MA", "text": "Always consistent, fresh food. Great breakfast sandwiches. Outdoor seating and a fantastic wait staff. Great local place.", "business_id": "DkX3YoxhH4uADsgVgQThew", "stars": 4, "date": "2013-09-28", "type": "review"}
{"votes": {"funny": 3, "useful": 7, "cool": 5}, "user_id": "wcxEz9R_dkyrBjpzRRM5mQ", "review_id": "9acTejW17cQy5UMqKkebqw", "text": "If someone has not heard of Le Mardi Gras, I just assume they aren't well versed in Pittsburgh drinking culture. This is one of the best bars in the city. Their drinks are remarkably strong, easily on par with Lefty's in the Strip. As a matter of fact, I really don't recommend having more than four or five Mardi Gras cocktails. They will kick your ass.\n\nThis is one of the only bars in the city where I will walk in and just tell the bartender to make whatever whiskey drink he feels like making. I realize this might not sound like a big deal, but I have serious trust issues when it comes to bars. There are only about twenty six bars worldwide where I will even consider ordering  a Manhattan or a Martini. \n\nOne of the best kept Le Mardi Gras secrets is that on Sunday they offer free food to their patrons. Even though we visited on a Thursday, the owner, Rich, was kind enough to put some food out for us. These little touches are what make Mardi Gras more than just a bar.\n\nHere are some of my favorite Le Mardi Gras features: smoking, table top pacman, excellent juke box, fantastic bartenders, intimate seating, dark ominous ambiance and lively patrons. According to Le Mardi Gras' website they've also hosted a variety of celebrities including Rocky Marciano, Harvey Kietel, Sammy Koufax, Sam McDowell, Billy Conn, Alice Cooper, George Clooney, Russell Crowe and Ted Danson.", "business_id": "TIPebazlAGJsp8zAwhNkcw", "stars": 5, "date": "2013-10-25", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "7_owr59KZE21Kh1ExkCN2Q", "review_id": "eyKmazCIPv91BvyfLERW7Q", "text": "Came here for lunch with my pops, who was fiending for their $6.95 soup/salad/breadsticks extravaganza. He is a huge fan of this deal, but unfortunately did NOT receive it, since it happened to be a Saturday afternoon, and they only offer their lunch specials on WEEKDAYS.\n\nAnother slight issue I had was the fact that the waiter messed up my order, but the manager gladly replaced it free-of-charge for me, and gave me her humble apologies. Once I received the dish I ordered - beef medallions over fettuccine alfredo - it was actually pretty tasty. It featured green onions, chives, sauteed spinach, and tasted pretty fresh, discounting the strong vinaigrette coating on the steak. My dad would have given this place four stars, but I am not my dad!", "business_id": "4WsTFTH8GgnyFHwrH9nHzA", "stars": 2, "date": "2012-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ob0BwUJZ29N5XIPBa6fAQw", "review_id": "_OSy8H8fiAkg32IEu4HDTA", "text": "This is my favorite watering hole when I am in Charlotte. A great place in a great area. The staff is great too.\nTypical bar food and when my group goes the place can count on cooking about 80% of the menu. You go for the burgers and wings, again it is a bar!\n\nWhy do I have 4 stars instead of 5. Well, I can't find my girlfriend when I go. Each time I keep yelling for Stella! Oh Stella! where for art thou Stella. For thou art the beer for me Stella! Ok, I settle for Amstel but Dude! Stella is just so much better. Now, if Stella ever comes in then my star will rise!\n\nAnother item. Make sure you watch out for the kitty who sleeps by the door. Mostly on the right hand side so don't step on her tail.\n\nSee ya next month Alex!", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 4, "date": "2010-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ixo0CSyf5Ck2JK60_yDDjA", "review_id": "cfpzqkKOjim21HnnMT4uxA", "text": "Stopped by here for an early lunch. The place wasn't crowded at all so we were immediately seated and got our drinks. The waitress and other employees were very friendly and were always around when we needed something. The food was delicious. I had the Mikes Hot Turkey Sandwich, which was pretty unique, but very flavorful. The turkey was juicy and had great flavor and the gravy was also well made on it. Alexander Michaels is definitely a place I will return to on my trip to Charlotte.", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 5, "date": "2013-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0IGoTEcCLPD5G5hV9ZpnMA", "review_id": "MdjgNOyrgYmvJTpTuxHLQg", "text": "I can't understand where these sub-4 star reviews come from but they obviously did not appreciate the beauty of the food served at AL Mike's. Done to perfection and seasoned perfectly our entire group really enjoyed the experience. It is sometimes crowded and noisey but IT IS A NEIGHBORHOOD BAR people. It is a wonderful experience on all levels.", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 5, "date": "2015-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5YCKv3_rnyqk9F39jYhk-Q", "review_id": "Z_sB3DtBjJ21iyNTzqHfpw", "text": "I really don't get the hate on Fox and Hound... The food is pretty good, great boneless wings, nachos, fries,pretzel sticks. Way better than say wild wings. Huge projection screen that will have all the Panthers Games, with great sound too. Went here with some friends just to watch the game and eat lunch. Service was not bad, not fast either, but we were checked every 15-20 minutes which isn't fast but not slow either. And we were just enjoying the game. I like the mix of customers too. Young and old. and all different sports and teams. Really a cool place to watch games and THEY DO HAVE GOOD FOOD!", "business_id": "-6JY1T0w4XETux5kGOj84g", "stars": 5, "date": "2013-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "veeA53Z1NP4GWPZMIxOQsg", "review_id": "dE2_hGo1eo9gHMSDsyFdaQ", "text": "I cannot believe i have not reviewed Ri Ra's before!  This is a good after work spot for a few drinks and maybe a quick bite.  The bar is well stocked and has all the items you would expect from an Irish Pub.  They have a pretty good beer selection as well which is nice to see.  The food is pretty good but typical to what other irish places serve.  (Fish and chips, sheperd's pie etc).  The sheperd's pie is great though and i get it just about every time i come here.", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 3, "date": "2010-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Vzatj8BARWjtmHNfmB7DJg", "review_id": "9Pyn7uiSB-7fWtziZL2Zbw", "text": "Went here for a corporate dinner. Had the finger sandwiches (chicken, pulled pork, and something else), chips and spinach dip, lobster cakes, and potato cakes. \n\nOnly tried the pulled pork, which was good, but others said the chicken sandwich disappointed. Lobster and potato cakes could have been better - too salty imo.\n\nSpinach dip the only saving grace. Oh, and their lemon bar dessert.", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 2, "date": "2014-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nHsj0cHOiroAsmDfF50BtA", "review_id": "5sX57a2i1oMYUoFZQB3VTw", "text": "I like Rock Bottom.  It's in a great location Uptown and offers a good American menu in a nice, casual setting.  I can always count on great food and great service.   If you want a \"light\" meal, they have an abundance of salads to choose from.  I'm working my way through each of them, but I haven't had a disappointing one yet and they're each very filling.  If I'm a little hungrier or craving a hot meal, I tend to go with the Blue Crab Stuffed Chicken or the Hazelnut Crusted Chicken.  Mmm... they're both melt-in-your-mouth good.  Then I usually wash them down with whatever brewed-on-the-spot beer they have on special, preferably something light.  \n\nRock Bottom is a good place to take eaters that don't like to experiment with gourmet food (but you can still find something gourmetish yourself!), out-of-town guests, or even a date for a nice, casual get-to-know-you meal in nice surroundings without any pretension.  It can even serve as a great standby if everything else Uptown is too crowded or you can't decide where to eat.  You'll never be disappointed.", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 4, "date": "2008-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "mTKWYLN9PmqF7UflA7tnPQ", "review_id": "dYz6qTcecZQFACx-thx4RQ", "text": "Oh man oh man! Another review, and this time from the well known Rock Bottom in downtown Charlotte. I came here with a friend who wanted some of their beer as well as their food. And sadly, I wasn't impressed. Inside though they completely changed the outlay of the dining area from the last time I came here, which was about 2 years ago... They added ramps as well as new things to look at and admire, such as the glass between booths and some paintings. But, overall it's all the same with the looks and what not.\n\nI had two things from the menu: Fish Tacos (RB Taco) and the Southwestern Chili.\n\nNow, the good first. Southwestern Chili. It was awesome, I felt like it was very good and chunky. However, I wish the portion was just a wee bit bigger just because it was so tasty!\n\nAnother plus was the service. My friend ordered a steak and it was a little overcooked, the waiter completely understood and took it back to get another steak cooked medium rare. It was fast and I believe even the manager came up to fix the problem. They offered a soup or whatever, but my friend declined (I was wondering why he didn't get me another chili!)\n\nNow the bad. Eating the Fish Tacos was like grabbing a handful of seasoned salt and then eating it. Every single bite was just a burst of not just salt, but just sodium with a little heat kicked in, but that was probably from the amount of salt and it made it seem spicier. After drinking water, it was still stuck in my mouth. Kick back the salt Rock Bottom and pull out that flavor of the fish! After all, it is a fish taco.\n\nOverall, not bad, food is average. Service is pretty good though. Next time though, I'm sticking away from those tacos.", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 3, "date": "2012-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "uZB7gDxE0di5v0P8NcO8AA", "review_id": "lSWy-0JO3lRPfz768WH3dQ", "text": "We had the worst experience at this place! It ruined our first visit in Charlotte. Their service was horrible and I would never go to any Rock Bottom!", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 1, "date": "2015-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "n2LrQTGA67QgG7gXybyGQA", "review_id": "tetpsWTK-l-t0DmtUZSIsg", "text": "They had a free if you come before eleven policy; only reason my friends and I started going there. They changed it without notice, I'm a little bitter. It's 10 or 20 bucks now after 11. It's not worth it. The swing is cool.", "business_id": "jbUu0Mtu9QUjyyeOn6RIHw", "stars": 1, "date": "2015-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Zwsq31eNUo2HpdkV2h9aig", "review_id": "fp79tznzrYpWwftuBTv4tA", "text": "Phil's is a tiny little bar tucked away just off the main strip. While this bar is nothing special in terms of dance, booze specials, or crowd, Phil's makes up for it in other ways. There is usually a cover, &amp; a live DJ attempts to get things going on a tiny dance floor. There is really not much room to stand around, so if you can't capture a table or booth, be prepared to be crammed.\n\nBut the main reason most people go to Phil's is for the bartenders. I don't think you'll find a better looking group of bartenders in Charlotte. This is what Phil's prides itself on, so expect a couple beautiful girls behind the bar. But just remember what the guy to gal ratio is going to look like when the main attraction is bartending beauties.", "business_id": "6SxAOEXHzNjWQMQ9Nnos3A", "stars": 3, "date": "2008-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "P2Vf2lXjOIQ14zB8Q87SMw", "review_id": "JB5u5I-qXHceD7S1-LWyDA", "text": "I went to Capital Grille with a friend for dinner, when making a reservation I asked the dress code and was told \"evening casual.\"  So we dressed appropriately, but we were seated next to a large group of people wearing jean shorts and jerseys.  I'm not trying to be a snob, but if a place has a dress code why is it not enforced? This group also continued to carry on vulgar conversation (f-this, f-that).  If I wanted to hear that I would be at the NASCAR store, not an Uptown restaurant.  I should have requested a different table, but that group departed soon after and I left it alone.\n\nThe service was 5-stars.  Our waitress attended to our every need and we had a delightful dinner, absolutely top notch.  The food was a bit disappointing.  The steaks were cooked perfectly to order, but they were nothing special.  They were not particularly tender or seasoned with anything I could taste.  The sides were fantastic.  I don't know if we just went on an off night, but for the prices they were charging the meat fell far short.  If not for that, I would give the place 5 stars.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 3, "date": "2011-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "wj1356xunegGD6_jA5EomA", "review_id": "fmC72-I1EShbs7uCyLpHeg", "text": "I've eaten there twice while traveling on business.  Both meals were outstanding.  The service was perfect and so was the food.  Everything about how this place is run is top-notch.  I highly recommend it.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2013-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dXkJ91eJ60KppeHC9dmavA", "review_id": "otS0wIXaCUtBGYa2Y5oUFA", "text": "Don't always need reservations. Have walked in a few times without reservations. The wine menu is great and the pineapple martini is delicious. The kitchen is very accommodating to allergies. The ribeye is amazing and I also always enjoy a seafood dish such as the salmon.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2015-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uQpNNgvjrQxjn26YI9LLyQ", "review_id": "6jXXoihLfm-zahVhed5UkA", "text": "Generic, but what else do you expect from most downtown businesses. It's a sports bar for sure. Every meal comes with it's own built in wide-screen television tuned in to some sport where a a bunch of troglodytes go up against another bunch of neanderthals. Service was nice, the place was fairly empty. The décor was interesting. I liked the low lighting and the fans over the bar.\n\nPet Peeve... our waitress didn't know shit about the craft beer she was serving us. This is what knocked the 3rd star off.\n\nThey have a decent beer selection but you better know your stuff cause asking the waitstaff about their beer selectionwill just get you an, \"umm... err... we have bud, bud light, coors light and miller light on special.\"\n\nWent with a couple of friends. I saw something called Tatchos in their appetizer section. I ordered it as it sounded like the most insanely unhealthy thing I could eat. It certainly was. The appetizer portion could definitely feed half the population of Peru. I can't even imagine what the full entrée size must be! They were ok. Nachos with Tator Tots is what I got.\n\nOverall not a bad experience. Not the type of place I'd plan to go but if my friends, who live right around the corner, drag me there again, it'd be fine.", "business_id": "t5l-H2KdY4MQgLDMENz9WQ", "stars": 2, "date": "2011-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "kDYpTc-yc8UAxCs_LhX1yA", "review_id": "8LOGYSxiomGgsGOzR7IAIQ", "text": "Connolly's is exactly what you think it is: an Irish-style pub. That's great. No frills, no bells and whistles, just an ol' fashioned place to meet friends and grab beers. I love it here. Because of its location in the middle of Uptown, it's a great place to meet after work or before, say, a Bobcats game or concert/event downtown. On most nights, it's pretty mellow here, so it's a great place to chat and drink, or even watch or discuss the game on TV. On weekends, though, and Thursday nights, it gets a lot more crowded--pretty packed, in fact, so it's definitely got a different feel on those nights. Great place to meet singles, as far as I can tell. \n\nThe bar itself has two floors, and the upstairs is usually more rockin' than the downstairs--more people, louder music, etc. There are a million beers on tap, as you'd expect, so you can grab pretty much anything you'd want, and obviously they've got all the liquors down pat, too. \n\nGreat bar. It is what it is.", "business_id": "jmzPbvE_02SzTAjwZCTgYA", "stars": 4, "date": "2008-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ITwewV_k1EcFgxfWNlssqQ", "review_id": "yjjrXlbi9fyndKhKKPKY_Q", "text": "I'll agree that Buckhead is probably fun if you're wasted. Unfortunately, I've never been able to stand it long enough to get to that point in the night. I'm totally fine with bars that aren't fancy, but I do prefer places that don't have peanut shells on the floor and deer heads on the wall. Plus, as is the problem with many Uptown bars, the guys there tended to be jerks and the girls tended to be embarrassingly trashed. \n\nYou can, however, go on a Wednesday night and watch dozens of people vie for prizes in the cornhole tournament. That's pretty entertaining.", "business_id": "GK6RBUJUBScobbF1oE5iuw", "stars": 2, "date": "2008-10-08", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "nHsj0cHOiroAsmDfF50BtA", "review_id": "VqfJf1yyf15-mnrrvhjorg", "text": "We went to Dixie's Tavern before the Bobcats Arena opened (i.e., when you could find free parking in Uptown).  We parked in Seventh Street Station (for free back then) and walked across the street to Dixie's.   Places like Roadhouse Grill, Logan's Roadhouse, and Texas Roadhouse are designed to look a bit rundown and...like a roadhouse.  Dixie's was unpurposefully like that.  It was smoky, a bit dirty, and a bit haggard in its appearance.  \n\nWe had a large group and Dixie's was able to accommodate us together.  The service we received was slllllllllooooooooow.  It was a good thing we didn't have anywhere to be, but I was losing my buzz in between beers.  The food was average; your basic bar food, some with a Cajun flair.  From the grungy feel of the restaurant, I wouldn't want to experiment too much with food here, especially where seafood is concerned.  \n\nIf you're in college, like to party, and in your early to mid-twenties, Dixie's may seem like a cool hangout place.  If you're anything else, there are better options in Uptown.", "business_id": "XeFNQqz5vVsVIcTjNuXcTw", "stars": 2, "date": "2008-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "kDYpTc-yc8UAxCs_LhX1yA", "review_id": "7monT7j0hU9wXf90qv9zbQ", "text": "I'd heard great things about Blue, especially in the drinks department (I stuck with beer, this time though).  I visited on a weeknight, and enjoyed the darker, upscale ambiance.  However, based on previous reviews, the food is hit or miss.  My dinner there was a substantial miss for a pretty substantial price. \n\nI ordered the mixed green salad and it was nothing special -- the dressing was blah and it was just regular goat cheese -- no crust, no heat, etc.  I ordered the NY Strip because the waiter said it was amazing, as did another member of my group.  Side note: the service was phenomenal, no problems in that department.  When it arrived, we both found the steak to be EXTREMELY tough.  I know it's not a filet, but you're supposed to be able to get your knife through it without breaking a sweat.  I didn't try my friend's steak, but he actually sent his back for being virtually inedible.  He swapped out for a filet with blue cheese and was quite pleased that he did.  Maybe I should have done the same....I don't know, but if you have to send your food back in order to get a decent meal, it's a pretty bad sign, especially at an expensive establishment.  In Blue's defense, I believe they were pretty upset about my friend's meal -- we basically got an entire desert tray for free.  Those were luckily delicious, as they made up a substantial part of my otherwise sub-par meal. \n\nBottom line, I will not go here again except for cocktails, some appetizers, and some jazz.  Or if someone else is picking up the tab.", "business_id": "eaqJQP6bp7rQJQt5KqfvxQ", "stars": 2, "date": "2008-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rx25n1qk8O8Qu6phL10zTg", "review_id": "XXKnCTn7EA8sTVTUpMX-8g", "text": "I didnt see anything spectacular about this place.   All I kept hearing about this place is the food, ambiance, and how its rank among the best in the country.   I'm more interested in the quality of the food than with all the glossy adjectives when describing the menu and service.  The bottom line is that I felt I donated $100 just to say \"I been there\" for food that was average.", "business_id": "eaqJQP6bp7rQJQt5KqfvxQ", "stars": 2, "date": "2013-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "dH1ADqrLKyO9GDhbPRMt5w", "review_id": "HbnLhDEtilfQ6tvNXvIC1Q", "text": "This is a great music venue!\n\nIt's compact but it got everything you could want.... \n\nThere is a bar in the back with cheap drinks and speedy service and it's elevated so you can see the band and hear the music the whole time you are getting your pops. A railed walk way that leads right down to the front right in  front of the stage, where there is plenty of dance space. There are large bathrooms with ample stalls, so there's no wait time. And for those that do need to sit for a breather seating both in the bar area and general admission seating area. It's doesn't seem like there is a bad spot in the whole place and the sound quality is great! \nIt's a win- win for all!", "business_id": "eNIDbboNe7W_rAnNHoveEA", "stars": 4, "date": "2011-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8ED8BPCXKXZnGsVMyl5Bhw", "review_id": "Q-talw7uMA3TWOcIfax6Qg", "text": "I agree with Lindsey R. that this area of 7th Street has some of Charlotte's cutest restaurants. Fig Tree, Jackelope's, and a few others along this way are all located in re-vamped houses, and it makes the dining experience much more intimate and exciting. \n\nI usually go for the red beans and rice and the fried green tomatoes appetizer, as there's not a lot in the way of veggie-friendly food...but I'm ok with what I get, as it's really, really good. \n\nAnd, since I don't eat too heavy on the entree part of the meal, I have room for the key lime pie. The key lime pie is worth the trip by itself. It's just the right tangy and just the right sweet. It's incredible.", "business_id": "jTGQUWGIVvL-aY03C5BEmw", "stars": 4, "date": "2008-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ks-53uMpLrb5GMEAMEOx6g", "review_id": "lnVyTfFg5i48-ok5E6WZYQ", "text": "One of our favorite places to eat in charlotte.  They have the best food and services.", "business_id": "jTGQUWGIVvL-aY03C5BEmw", "stars": 5, "date": "2012-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nRW4FEFWNl1W89yod5QlBA", "review_id": "InlY_J2Xj-c_BAwLCJq8xQ", "text": "Excellent food the price is comparable especially on the creole dishes. You have to make reservations if you want to get a good seat otherwise come before six o'clock.", "business_id": "jTGQUWGIVvL-aY03C5BEmw", "stars": 5, "date": "2014-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cEKEtwTQN_VJRZuzxwffOw", "review_id": "6bP_ENsEqrHPNCsbChmmHg", "text": "I want to love Cajun Queen, I really do. I try to give restaurants the benefit of the doubt when they fall short, understanding that things happen sometimes outside of their control. That said, Cajun Queen has continually failed to provide a satisfactory dining experience for us on 3 consecutive visits. The food alone would earn 4 stars for the advertised menu prices - although they do offer special discount deals fairly often. The customer service however is consistently dissapointing, to the point where I am convinced that the management staff needs to be changed. The attitude toward customers is not one of \"How can I help make your experience better?\" it instead seems to me that all of the workers are more into talking to eachother while dropping items at tables without saying a word. This is not just one bad egg, it seems to be everyone from the water boy to the manager. A friendly restaurant employee is the exception to the rule at Cajun Queen. In my opinion the lack of customer service ability is a direct result of the management failing to instill those abilities in their employees. \n\nIf you get seated at the two person table in a hallway between the kitchen and 2 dining rooms just ask to be moved. That table is terrible and does not belong in any restaurant that has any respect for its customers. And that's just it, there seems to be a lack of respect amongst the staff for their customers here. The hostess at the door stares at her computer while talking to you without ever making eye contact, the bread boy just drops the bread at your table without a word. Water boy, same thing. Server doesn't exchange pleasantries, just straight to drinks and apps. Manager walks by and talks to his buddy about the game but doesn't acknowledge the guest at the table as his conversation is overpowering ours. Workers come barelling through with a table they are moving without saying 'pardon me' or anything at all. On the way out the door the manager guy just stands there staring at the hostess' computer screen without so much as saying thanks have a good night...\n\nWe have kept returning to Cajun Queen always hoping our next experience would prove to be better, but sadly I think we have now given up. The food earns a 4 star recomendation and it is worth experiencing, but the service is 2 star at best.", "business_id": "jTGQUWGIVvL-aY03C5BEmw", "stars": 2, "date": "2015-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "ITwewV_k1EcFgxfWNlssqQ", "review_id": "NaQJ_Otsg0Q2rNzCawHcqA", "text": "If someone took their basement, covered the walls with graffiti and stickers, and built a tiny stage...the result would be similar to The Milestone. It's a great music venue, but it's definitely not for everyone. It's small, smoky and in a crappy neighborhood. I saw a women musicians showcase at The Milestone, which included a great show for by The Lights Fluorescent. \n\nWarning: There is a makeshift ATM-like machine at the bar. My friend had trouble with the machine and it's a bit sketchy, so I'd stay away from it.", "business_id": "J7XRfg3ScS5K7UyM5Te-ng", "stars": 3, "date": "2008-11-03", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 0}, "user_id": "QKU_s9C7DamNrTESCu9oGw", "review_id": "0ZK4zoeyFYgC6SyY-yAueg", "text": "The biggest beer selection anywhere in NC (aside from the Saucer in Raleigh, of course); Local, National, International beers are all represented. Fun specials like 'beer poker' where you get bottled beer for cheap (waitress' choice) or local beers cheaper than usual on certain days. There is a gimmick for every day of the week, and they are actually interesting and make you want to come again another day of the week.\n\nThe waitresses are dressed as schoolgirls, but are highly beer-educated. They can suggest beers to you that maybe you wouldn't have tried before, and bring endless samples as well.\n\nThe food is good (Rocket Tots are great, the soft pretzels are phenomenal, the best I have ever had, and consistently)\n\nNewly non-smoking (as are all NC places now) and friendly atmosphere.\n\nA small complaint is it can be busy around 9pm or later as a band starts playing LOUDLY, so keep that in mind; also around lunch time during the weekend often people bring their babies (They bring a BABY to a BAR!) which is annoying if you like to say the F word or talk about your hot hole.", "business_id": "F-e-sWfVd3eCYll3BP1QFA", "stars": 5, "date": "2010-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hjGkyqvLOhlG0BNpUhci1A", "review_id": "gQ8XWmEhlO1Jr7LgEULUfg", "text": "Slow service. Horribly under staffed. Waited a while to get my order taken, food and bill. Even during football Sunday, really need to hire more people and turn up the volume on the TV.", "business_id": "F-e-sWfVd3eCYll3BP1QFA", "stars": 2, "date": "2013-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hYySrhzCNJSxTbQXSoigKA", "review_id": "G1rmBj1F56RcvBXAgEHT6A", "text": "Nice place but expensive, nice tv's to see sports.", "business_id": "r-pBY6vR_Iu5XhPRvPnquw", "stars": 4, "date": "2012-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gsK92PJiRE061ePTzgtINg", "review_id": "gwhn9IFMxzEbVoiphXdWyQ", "text": "This was a slightly above average experience for the chain. A friend and I went to catch up during the mid afternoon and were very pleased with the service. There was a new promotion going on with tablets on each table that allowed you to play games. We thought it was rather funny and pointless but perhaps if you had children to entertain you'd be willing to pay the $2 for access.\n\nThe sweet tea was not sweet; be prepared. Otherwise we both enjoyed our meals. My friend has food allergies and can't often eat spicy foods, but she was glad to find tex mex options that she was able to enjoy. I had the chicken pasta and was pleased, though next time I will try something else since there's a nice variety on the menu.\n\nStaff was friendly and efficient, restrooms were clean.", "business_id": "SgjcjIxsAlVkcrtLaLxtTg", "stars": 4, "date": "2014-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "T0OR93_d33xf_9UYYHEe1Q", "review_id": "HD_87whqoyjydBxXiH9k0A", "text": "Great place and awesome ambience. My mom and I loved the wine. Only reason I'm giving it 4 instead of 5 stars is because the female employee was rude to my family after we bought a bottle of wine. Let's be clear... If you work at a place, it's your job to check if the bathroom needs paper towels. Not your customers job. We will definitely be back but hope the employee is a little nicer this time!", "business_id": "1wIKHSHPOkywuOkyrXt6dw", "stars": 4, "date": "2015-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I-zoV8jkfGFQ5gFj1umYbg", "review_id": "rVolr9fZaW_X3OsciXw57A", "text": "I honestly cannot see giving this establishment a rating higher than a 3.  My 2 rating is due to the following reasons 1) my husband and I went to watch NFL kickoff last Sunday.  Ordered our beer and then attempted to order our food.  I said attempt because they didn't have much to offer.  Every time we made a selection it was either 86 or a component was 86. The explaination we were given was it was very busy Friday night and ran out of stuff - hello it is now Sunday afternoon. You are advertising watching the games at your location.  I pointed out that there is a grocery store within walking distance.  The reply was the owners won't let us buy anything.  I ordered shepards pie which is supposed to be a meat potato and veggie dish. When it showed up at the table it had at least 1/2inch of melted cheese on top a fact not mentioned in the description. After scraping that off I proceeded to dig in. Unfortunately the dish was made with less than an ounce of meat alittle bit of peas and corn and a pile of potatoes. I had the honor of paying $10 for that.  2) OK everyone can have a bad day so we returned this Sunday.  Once again they were out of things but not as bad as last week.  I ordered a specialty burger for $11 Safe right?  Wrong. It came out as any basic burger would except for the fact that the actual patty looked liked someone took a bite out of it.  I called the server over to show her the burger and to ask where the special burger was - her reply - it looks like someone bit into it.  When I asked about the bun vs bagel - oh we don't have those anymore!  There is much more that I can say but this is already a novel. Long story short. The food sucks and we will not return.  One other thing when I told our server about our experience last week she stated that she served an English guy that complained that the shepards pie was the worse he ever ate - I agree.  Time to find another place to go.", "business_id": "5odPoosll36dti3xbSwuJA", "stars": 2, "date": "2013-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HKFK6P35KX0VF67NtU0rwg", "review_id": "KRypBJz-iZnj-lcfd8oJUg", "text": "I've been to this place a couple of times and we've always had good food. Service was a bit slow, but will definitely keep going back. Love being so close to Lake Waubesa and watching the sunsets too.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 4, "date": "2012-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "k2GImDHHZvMCOI7EfED93A", "review_id": "ntDCKEwiqB-P5CruUmLoMw", "text": "Definitely a place I could frequent...nice and open and live blues music every Tuesday night.   Be sure to check out \"Blues and Brews\"", "business_id": "c5awCF5eu0ZkxUf_i94uPA", "stars": 4, "date": "2013-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9F_vodJBYKMjqTqcAuHFrQ", "review_id": "WQATkDNfo9fb4bgwhu0ZkA", "text": "Went recently for my own birthday, since I really didn't want to put much thought or effort into planning my party. Even though it was a Friday, we didn't have to wait for a table. Service was prompt and they put up with our group that had people straggling in. I really enjoy their chipotle burger, and another of my group loved how her steamed veggies were cooked. I did get a mixed drink from a friend and it did come tasting weak/watery (I didn't personally order it, so maybe I missed something if I would have looked at the drink menu). The whole experience was good, but not spectacular, at least try it for your birthday once!", "business_id": "6oDZ78JiSKjXVLcurCpnhw", "stars": 4, "date": "2014-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "reI1yQImDR-1a55zVZZPHQ", "review_id": "BbywIQGfSn_ocLLAU3PYvw", "text": "We went here to be able to watch the Bears game and the Packers game one sunday. They found us a seat and made sure we could see both games. The food was decent and the service was ok. It is a good place to go if you want to watch multiple games at once. I wouldn't go there all the time and it won't become my favorite hangout but I'd go back.", "business_id": "qQvpS262VPEHKZvM6j5uhQ", "stars": 3, "date": "2013-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "4GYlYNPsfFx6HdPZ-DF6cQ", "review_id": "jn2_y2qvc5hlbiujym6D9Q", "text": "I frequent this place because it's close to where I live, and I do team trivia on Wednesdays.  The beer selection is both expansive and fresh (they open new taps frequently), and the food is excellent bar-food fare with some healthy salad-type options.  But hey, you're there for bar food, right?  The burgers are yummy (you can sub in chicken or black bean), the fries and rings are tasty.  I've heard good things about the pizza, but haven't tried it.  There are lots of TVs, so if you care to watch some sports it's a great place to do so.\n\nThe servers are very nice, but on busy nights they can be super slammed and stretched thin, so you may have to wait several minutes for service.  The kitchen isn't all that large and they actually cook food to order, so do plan to wait a bit for your meal.  In fact, that's the only down-side I can think of about this place - the service can sometimes be slow.\n\nIf you're not into trivia, I suggest that you avoid Tuesday and Wednesday nights after 8:00 PM or so, because that's when the trivia crowd is there and the place is packed to the gills.", "business_id": "HTplzElel_F_U_qhWuDKdg", "stars": 4, "date": "2012-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ml27UOLodYiipGlVjrtwGA", "review_id": "vH9tk2wCOxo6BUkLMRRiMg", "text": "I stopped at the Villa Tap the other day for a cold one, and to watch a little bit of the Badger game.  I haven't been to the Villa Tap in years. The place hasn't changed a bit.  Great neighbor hood bar.  The only down fall was--it was a little busy and took a little longer than I would have liked to get me beer.  Other that that great time--tap beer $2.50.", "business_id": "J2AiPQnKWBxBwc4MMkbH8w", "stars": 3, "date": "2014-10-11", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "ow0-mYSp0HhV-HrfWsIi6w", "review_id": "WJKI8MpzyDBoAb3j_n5zUw", "text": "We've been eating at Olive Gardens for years. We've eaten at this particular Olive Garden in Madison many, many times. It has usually been very good: a relaxing meal, served well, the food pretty consistently good.....UNTIL!! We were there yesterday after dropping our kid off at UW and moving all the stuff into the dinky student apartment. We were tired and somewhat sad and looking forward to a nice dinner. It didn't start well. Our waiter was a strangely aloof, indifferent guy who seemed to deign to wait on us when he had a moment. Plus, horror of horrors, there are now those little 'ziosk' thingies on each table, just like in a sports bar. We hate those things and so moved it to face the wall. However, when Aloof Guy came to take our order for an appetizer, he pointedly reached across me to get the apparatus and clicked in our app order. In other places where they have these dumb things, using them is optional. Salad and breadsticks came as usual. For my entree I ordered fish and shrimp in 'light wine sauce'. Our entrees came very quickly, we were not done with salads yet, but Aloof Guy didn't care. He just crowded the plates onto the table while we scrambled to make room. When I saw my fish I was immediately wary. The sauce looked like something you'd find at a cheap hotel buffet or a highschool cafeteria. I tasted it, and yup, tasted just like it looked. Very, very salty and with a strange, sourish taste to it. Plus the 'seasoned' broccoli was dry, practically raw and inedible. I politely and apologetically told Aloof Guy that I couldn't eat it and asked for the portobella ravioli, which I've had numerous times before. It's very rich, which is why I didn't order it in the first place. AG said he'd inform the manager and put in my order and then left, leaving the unappetizing plate of fish in yuck sauce in front of me. It took quite a while for him to realize that he'd left it there. Finally he came and got it and finally removed the empty plates from the appetizer and salads. The manager came by and asked about the problem with the fish. When I explained, she as much as told me I was mistaken, as that was her 'favorite'. She just loved that salty sauce! The ravioli finally came and - ah well - not in the sauce they sauce they usually were in - this was thin and broken ( showing the fat separated out). By this time I had given up. I'm assuming that this was just a bad day for the cook, but the aloof and uncaring waiter was a bit much. Also, when we were ready to pay, sure enough, he grabbed the ziosk thing again. I said, are you going to make us use that to pay? and he just firmly said, yes ma'am and left. It was a pain to figure out. So much for the relaxing dinner after a trying day. I guess we'll skip Olive Garden next time!", "business_id": "PhdMPqSdLZi6IV8SdnpUAQ", "stars": 2, "date": "2015-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "otD7HPcvvfqJ1ambxE-MNQ", "review_id": "cTRZ7v-AWh4lE4npndb0Rw", "text": "The Harmony hours listed are dead wrong and they are open, not closed. Makes me wonder about the fact-checkers at yelp... do they have any?", "business_id": "KHOHjA8HOcTlFBCtMQFv8A", "stars": 5, "date": "2013-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rJr7hGZu_6P9kpW2IFbC7w", "review_id": "ahgLaVW4u4d9boBFqZDHmw", "text": "Have been to Pooley's numerous times during trips to state basketball tournaments. The experience had always been good, but not today. Even though there were few patrons, waited 20 minutes for our beverages, and 45 minutes for our meal. The server was woefully untrained, and the bartender seemed to be annoyed when we asked for our drinks.  Food was just averge, price was ok. Service was poor.", "business_id": "yrBo3c3OTKVO4H1ttBxadw", "stars": 2, "date": "2014-09-05", "type": "review"}
{"votes": {"funny": 9, "useful": 0, "cool": 0}, "user_id": "koq3FTM6HzXgLQAxP5W5kw", "review_id": "tH_zTnllP9Of4uXmekUIfA", "text": "Kam's is one of the best bars in the world.  \n\n20,000 watts of nightly sound, free shuttle bus, and darts help to make Kam's the #2 pregame party spot in the nation.\n\nUpon stepping into Kam's, you are greeted with a familiar neighborhood crowd and the aroma of fresh, tasty beer being poured.  A sophisticated, happy-go-lucky crowd draws you in and the fantastic selection of drinks will make you stay.\n\nThe basement is fantastic for parties and the staff is very knowledgeable.  The free popcorn is of gourmet quality.\n\nAll in all, Kam's is a wonderful place to bring a date or just have a night of wine-drinking.", "business_id": "RwhUzMEG2tVnZQY9dEuXzw", "stars": 5, "date": "2009-09-14", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 1}, "user_id": "TF2IQSAmV6bVU_mo-GiX3g", "review_id": "yijSe2uYiYUMyZTKbKDJJQ", "text": "Illini Inn is the last dive bar remaining in campus.  After Deluxe got knocked down to make way for the mediocrity of Legend's and Murphy's expanded and cleaned the place up, Illini Inn stands alone.\n\nThis place is a true dive:  cheap drafts, dingy bathrooms, a good jukebox and a surprising lack of fratboys (especially considering you're surrounded by big houses with greek letters in the front yards.)\n\nGo forth.  Chug a beer.  Join the Mug Club.", "business_id": "BP97hODPAzQvspa3NcyZPw", "stars": 4, "date": "2007-09-25", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "tPKZd5mfmKjreuJtKjyOYQ", "review_id": "OBgw38Itdnkc2mMKCQ3gxg", "text": "If you were to add up the amount of time I spent at Murphy's in college, it would probably be close to the total time I spent in class.  Even today, this haunt is still our campus favorite when down in CU for a football/basketball/hockey game.  \n\nBack in my day, they didn't have the new addition but having the additional space makes it much easier to get a table and some space to move around without affecting the divey-campus bar feel.  Wednesday is Logo Glass Night, and I have several boxes of the great glasses I accumulated over the years.\n\nTheir beers on tap is great, especially for a campus bar.  The food is pretty good pub grub, but I believe there is a \"game-day menu\" where only certain things are served, which is kind of a bummer if you want Irish nachos on game-day because it's not on the menu.  The jukebox is great (every fricking song by The Black Keys can be found on there) and there are loads of flat screens to catch whatever game is on.  If you get there early, you won't even have to pay a cover.", "business_id": "MVH3JOKpQvMTP4jxwBUhkA", "stars": 4, "date": "2010-11-04", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "iKt9RWLOS_PE4SKBRFkKww", "review_id": "KvROWMg1RNikJNWUht6yeQ", "text": "Solid pub.  Food is exactly what would you expect from this place.  Absolutely a classic for Champaign- Urbana and U of I students.\n\nSome of the downsides include how dirty it can be, with a lot of sticky surfaces, their old school way of taking tabs that can be inconvenient, their unclear switch between being carded and not being carded, and their seating can be a bit uncomfortable.\n\nBut, for what it is?  Perfect.", "business_id": "MVH3JOKpQvMTP4jxwBUhkA", "stars": 4, "date": "2015-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yfRrC6MhxpIJ4-xMcrmk5Q", "review_id": "gvEy1khc1lL_xNEEcB6OKA", "text": "I should say up front that this review is based on chips, salsa, and a strawberry frozen margarita.  But you know, I feel like chips/salsa/margz are the fundamental building blocks of any Mexican restaurant, and if they fail at those, they might fail at other things.\n\nWhen my friend and I drove down for homecoming, we arrived a little early and couldn't check into the hotel yet.  Chevys was just down the street, so we decided kick off our weekend of constant food and alcohol consumption by getting some drinks at the bar.  At 5 pm on a Friday night, the place was amusingly empty, with the occasional random quiet man alone at the bar drinking margaritas (awkward) and a couple other tables of folks in Illini gear (and Steelers gear, for some odd reason.  They followed me here?)\n\nWe saw that on Fridays they have a $4 frozen strawberry margarita special.  That deal was calling our name, so we each got one.  They were all right - good texture, decent taste, we got a little buzzed, but nothing special.  The chips and salsa, however, were totally blargh!  Watery salsa, weirdly textured chips - like, the chips were really weak and flimsy, not the good sturdy tortilla chips that can hold up to good salsa.  They weren't even worth eating.  Also, the bartender was visibly perturbed when we asked for the check.  Sorry, but we had dinner plans at Papa Del's, and didn't want to spoil our appetite!\n\n....why go here when you could drive a mile and go to Dos Reales?", "business_id": "WgmAx4SWy-71daxakDNd1g", "stars": 2, "date": "2011-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Kuk0ody1l9jtj_dnnRc3nw", "review_id": "RdPrWP8ATWMidlkWSjlr4Q", "text": "They get a 4 star just off the buffalo chicken dpi and they are playing the pacquio fight. I'm a woman so I can't go higher than a 4.... Even if the food is bomb... A little difficult to find compared to others. Set up is a little awkward. I nearly walked past the hostess booth", "business_id": "JhEA8qHfNmIh8c6OHXnaYA", "stars": 4, "date": "2014-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pwyRJuJoodUS__gsQMGlMw", "review_id": "Tcu4VcFfZIIefpj-Ggmz9w", "text": "The scallop salad is to die for. $14.95, loaded with grilled scallops, romaine, walnuts, grapes and a splendid dressing. \n\nThe place was packed tonight, a Friday night, and we waited 15 minutes for a table to open up.  Huge soft drink glasses are a trademark of Farren's and of course, excellent burgers.\nOnion rings, tri-colored chips, fries and great salads.\n\nThe 600 space parking garage right next door has changed this from a dark hideaway to a prominent location with covered parking 20 feet from their door.\n\nThe restrooms can be nasty and are shared with a couple of adjoining restaurants.", "business_id": "IUhO58Il7gUEjl1RMEncHA", "stars": 4, "date": "2009-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OzKkYH_F8i0gjGsHCEeXlg", "review_id": "GpZu57Zx9Hh7oOTKHQc2sQ", "text": "Generally, I don't like burgers or blue cheese but The Russell is pretty awesome combination of the two. Specifically, the blue cheese sauce is really what makes the burger awesome; you can put the sauce on anything and it will taste great. Farrens is not easily located as the entrance is down an alley. I think it is probably an attempt to keep the campus kids out and create an environment that is more for the locals, which can be nice.\n\nThe place is small but our group of five was easily able to get a table on a Thursday night. The service was pretty decent, and it didn't take long to get our food. In my opinion, the tricolor chips were better than the house fries but I am probably in the minority on that one. Overall, I think it is worthwhile to come here and try a burger with the blue cheese sauce. Next time, I will have to try the Russell with the Kobe beef patty.", "business_id": "IUhO58Il7gUEjl1RMEncHA", "stars": 4, "date": "2014-10-28", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "XzIKZTb4I-7wW4BjKwV2Mw", "review_id": "vCXKlY5FkLZr8NpSUlKgwg", "text": "I think I'm going to review all the bars I go to at U of I, in addition to restaurants. \n\nMaybe the bar owners will actually read some of this stuff? Maybe flying pigs will abduct Alma the night before finals? Who knows?\n\nI've been to Red Lion probably 4 times and tried to convince myself to like it, but I can't. \n\nThe line to get in is usually really long, there is always a cover charge of at least $5 and it is always a loud, high-energy, dirty/sticky haven for UIUC's 'finest' undergrads.\n\nThe layout of the place is actually pretty cool, its really big if you count the outside areas. However, the place is pretty nasty. The floor is sticky, there's empty glasses/bottles everywhere, and the bathroom reminds me of when I used to go river fishing.\n\nEveryone seems to dance on the elevated dance floor and tables, but I've almost wrecked myself a couple times and I wasn't even that intoxicated, so there is a potential safety hazard there. Additionally, I've seen a guy literally fall backwards off a bar stool, a couple really close to having public sex, and not to mention countless airborne beverages that have partially landed on or close to me. Yup, it's that kind of place.\n\nThe bar service here seems to be a little quicker than most of the other bars, but still doesn't appear to be really that great, in my opinion. Half the time the bartender can't even hear me, and I always seem to keep getting pushed back in the queue of people to be served, which is aggravating. Even when you do get served, it appears everything is really expensive. $3.50 for a bottle of Miller Lite? Meh.... \n\nThe inside bouncers/barbacks usually aren't too bothersome. Although on one occasion they were checking for wristbands like Nazis every 5-10 minutes for anyone who had a drink in their hand. It was annoying, excessive and I wish I knew why, perhaps an incident occurred earlier? I really don't know.\n\nThe outside bouncers/door guys are even more aggravating. My ID was given a CSI style investigation between 2 checkers, complete with a nearly 180-degree bend test that literally almost broke it in half. It was initially deemed fake by the first checker, but after giving it to the second with a flashlight, my state-issued ID was surprisingly \"real\".  I now have a creased driver's license. Thanks, Red Lion! I might just have the secretary of state bill you for my next one. \n\n1/5 the place is dirty, obnoxious, expensive and I don't care for it. The only reason you might consider going here is if you drink a lot beforehand and feel like dancing (or getting pushed around by) randoms while [bad] music blares throughout the \"castle\".", "business_id": "TxWfLkj8LLlVLBgA0woYEg", "stars": 1, "date": "2014-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HANb8-8InWnju-XzBQQSBw", "review_id": "8WTmzVAZfdCK_Edez_sQNQ", "text": "Nice lounge with real people.  The patrons are friendly, easy going and mature, and the music is eclectic - James Brown, Tom Waits, the Black Crowes...keep going.  Good hamburgers and cheddar broccoli.  Also a great black bean burger.  Excellent place to grab lunch.  Reminds me of Southport Avenue in Chicago.", "business_id": "pPWre8lbVAssER6CN0uWMw", "stars": 4, "date": "2005-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rMf_QIAUHMIr3OJybv5Ylw", "review_id": "3v7EWCJfwDHK-cX5Jc5aCw", "text": "I love Jupiter's pizza. Lots of different excellent combinations available.\nLots of good drinks to be had. (Bell's!)\nLots of pool to be played.\n\nWhy not 5 stars? Every time I go the service is horrendous. Absolutely terrible. Not because the server is inherently bad at what he/she does but the place is understaffed and our server was most likely a bit overwhelmed.", "business_id": "6U94ybDpNd0fTL7TIzb5Kg", "stars": 4, "date": "2006-11-26", "type": "review"}
{"votes": {"funny": 1, "useful": 7, "cool": 3}, "user_id": "igrgFZl9wDohSem0UyoP6A", "review_id": "tL280Vq2enpHab1GsJXmFQ", "text": "Who would have thought that I'd pick a place in Champaign for my 600th review!... Well, Bacaro certainly deserves it: I finally went there for dinner last night (after wanting to go for several months), and I was wowed. I'm still salivating thinking about it.\n\nI went there with pretty high expectations (I'd heard great things about it from several friends and coworkers): that's usually not a good thing as it makes it easier to be disappointed, but Bacaro did not disappoint. In fact, I'm happy to say that my dinner there was on a par with my best dining experiences in NYC.\n\nFirst and foremost: the food. My boyfriend and I decided to share a bunch of dishes. For appetizers, we ordered the fresh mozzarella with heirloom tomatoes and pesto, as well as the roasted suckling pig with homemade sauerkraut: they were both absolutely delicious (don't miss the suckling pig!). We then shared one entree: we got the braised pork shank, which came with sauteed spinach, mushrooms, bacon, and fig sauce: soooo good! The portions are not huge, but two appetizers and one entree turned out to be enough food. For dessert, we got the panna cotta with fresh fruit: simple but just as outstanding. That was some seriously great food!!\n\nAs Bacaro is also a wine lounge, their wine selection is quite extensive. We got a sampler of three wines by the glass for $14, all of which were pretty good. Not to forget the 10yo port we got with our dessert (very generous pour...), which was good also.\n\nService was great, ambiance was great (although it's a shame that the place was so empty)... it was really a great dinner (sure, it was not cheap, but entirely worth it!). By far the restaurant in Champaign, in my opinion. I'll definitely be back.", "business_id": "h9xdY1NO4GnNijNChTy-8A", "stars": 5, "date": "2008-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dqE1U3d83J7fajewgqcyTg", "review_id": "x4J1twvTerqPws-WiL_Ftw", "text": "The taste was great for sure; it's clear the chef knows what he's doing. The portions on the other hand... ridiculous. The only way we would've been full was if we spent over $200 or so each.\n\nThe service and atmosphere was nice, so if you've got a bunch of money to throw away, and want to lounge somewhere, it's a great place. Otherwise, there are restaurants that offer greater value and dining experience in Chambana.\n\nLike others here, we got PO'ed at the portions and went to another restaurant to fill up right after.", "business_id": "h9xdY1NO4GnNijNChTy-8A", "stars": 2, "date": "2014-11-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "gTCM7qlVrwdml-hFB6aJqQ", "review_id": "6Wbpg-HD7cJ2e71cwvGAlg", "text": "Last night was my first time at Majerle's and it will probably be my last. It is just your typical sports bar, nothing special.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 3, "date": "2008-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sPg1Psg3AixLDYCm3lhRlg", "review_id": "3_mt70tlO9pBvbdUcSD-Nw", "text": "Good place for a beer. Excellent boneless wings.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 4, "date": "2012-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e3V9YwSln5wR22uiLSeJEg", "review_id": "-pQM2OZQeUx13yH7YpGE3g", "text": "Stopped by on a Friday evening.  I got to say that the burger was delicious,  had the #9 all star burger and it was cooked perfectly to my liking and the hamburger bun was so good.  Shoe string fries were nice and crunchy. My son had the Jared Dudley's Grilled Chicken which he said was good.   Our waitress was attentive and kept our glasses refilled. Will definitely come again when I am in the area.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 4, "date": "2015-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tkXV8zrcuDyfRmWCODFVrw", "review_id": "_dSPMlvpJ_1bV5AVP4zSAQ", "text": "Coach and Willie's is a favorite stop anytime I visit from NY.  The atmosphere, the food and the service have been great on every occasion.  We have visited at busy times (D-backs games and Super Bowl week), and when nothing was going on (in town to visit friends) and have had no significant issues with anything.  Food is standard pub fare and well prepared and they have always treated us well.  In fact, there have even been a few drinks on the house.  Conveniently located near the ball park and the arena.  Can't wait til my next trip to Phoenix to visit our favorite downtown haunt again.", "business_id": "j8nyAaN_w5t6wYv-ni23sg", "stars": 4, "date": "2012-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jAO9zgmbTXk4LaTxdSP_TA", "review_id": "EX_R2MIwaObVdPYE79xQJA", "text": "The wings are really good.  I've been 3 times for wings and a beer.\n\nThe best part was the drunk guy in the corner doing air-karate and talking to himself.  What a show!  The place was dead though, don't let me make it seem like the place is frequented by weirdos.\n\nThere's nothing wrong with the place, it just isn't 5 stars.", "business_id": "qsWxbgQwuomXvMseg23DGg", "stars": 4, "date": "2014-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mCA8L4Jp5Dz1LYgG9toavg", "review_id": "AQZM2OMa6HVhdvIiiFapgg", "text": "Bar service excellent when I went into place my take-out order, including giving me a 15% military discount.  Disappointed that gift shop didn't have any XXL classic city T-shirts.  Salad and dessert were excellent.", "business_id": "gkv2XvXpFgiq4Bb2XK7YmQ", "stars": 4, "date": "2011-10-22", "type": "review"}
{"votes": {"funny": 5, "useful": 4, "cool": 5}, "user_id": "4UUIpbOTPmu43wuC2aSGkg", "review_id": "0gZZhPvDDwCyx-bahvT-Pg", "text": "I think I really like this place. Ayesha and I had a chance to visit  Cheuvront on a Monday night. It wasn't terribly busy when we arrived and we were warmly greeted. Unfortunately we were seated next to a loud group of young children that thought they knew something of the world and were very LOUDLY passionate about their arguments. The F bombs were being dropped so incessantly that it became annoying. Our server and the manager that was walking around said nothing to this group. Finally when I could no longer hear what Ayesha was saying, I got up and told the Junior Aristocrats to shut the hell up. The manager and the waiter came over to apologize for the patrons' behavior. I wish they would have done the scolding, not me, oh well.  I could finally enjoy my meal. I got the Marguerite which was cut into strips rather than triangles. The pizza sauce was flavorful, and the cheese was real mozzarella, not that processed stuff that you would find on cheaper pizza. The wine that I picked was really good, though I can't remember what I drank (sorry gang). I really liked the decor and the 007 movies playing in the background. I look forward to visiting Cheuvront's again to try their other dishes and maybe not have to set some people straight on using their \"inside voices\".", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 3, "date": "2008-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rBeuXzsBkGxM5pJujH2zAQ", "review_id": "C_bz23ph5enH9RVunmQREA", "text": "I was supposed to be meeting several people there for a happy hour, but got stood up. It turned out to be ok though. My server Patrick was very nice and helped me decide on a delicious Sauvignon Blanc and some nice cheeses. I also had a bowl of the shrimp corn chowder.\n\nOverall, i thought the locations was great. nice atmosphere and a great patio. The menu was a little disappointing and i would have enjoyed a bit more help in deciding on cheeses. I said i was a big fan of goat cheese, but when he brought me my trip plate, there was only one goat cheese present. I had the Purple Haze (goat), Barely Buzzed (cow), and Purple Moon (cow). He didn't ask any questions about what i liked in my cheese, was I adventurous, etc. He brought me things that were popular, so i guess that would be safe assumptions, but as a lone diner available to answer questions and make bigger decisions, I would've expected a bit more of a unique experience. And the soup was a little thick for me. Tasted like it may have been the bottom of that batch.\n\nThere were a few things on the menu i'd be interested in trying for entrees (the small plates/apps were meh), and having a few delicious cheeses with wine and friends on their patio would definitely be a fun evening.", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 3, "date": "2010-10-22", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 3}, "user_id": "nWouNfZD3Pw08RYizxkqcA", "review_id": "PX_bJ5XWmgHoFyv4atpIIw", "text": "This is a cool rock 'n' roll bar but the food isn't anything spectacular so I don't recommend stopping in for dinner. But Coopers'town is the perfect place to chill before a concert or game with a group of friends. There's a large patio and the staff is cool. And it is one of the cooler bars in downtown Phoenix. On the weekends, local bands often take the stage.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 3, "date": "2007-09-10", "type": "review"}
{"votes": {"funny": 12, "useful": 11, "cool": 12}, "user_id": "qhooXf7Uh8NP3mX6YG3Drw", "review_id": "8hHJ5yKjAMa4Nwvkxu1kTA", "text": "ROCK OUT WITH YOUR COCK OUT!!!\n\nAs a big heavy metal and hard rock fan I just had to make sure to hit up Alice Cooperstown on my recent visit to Phoenix. As I walked into this warehouse sized rock & sports mecca I was surely not disappointed.\n\nThis place is huge. There is an outdoor beer garden seating area on the side of the building and when you walk indoors you realize that this place is airplane hanger big. Rock and roll memorabilia is plastered everywhere here with a terriic amount of Alice Cooper posters, gold and platinum records, photos, paintings, guitars, and other stuff representing his Hall of Fame career plastered throughout. Even all the tables are covered in rock photos and images. Along side all of that is a mix of sports memorabilia spread throughout with flat screen tv's and large projection screens everywhere! Yeah, as you can imagine, they play some great rock music here, classic to current. This is the type of place that Hard Rock Cafe wishes it could be.\n\nThe menu here is pretty big with a mix of classic bar food, comfort food, and BBQ. Nice selection of beers on tap and in bottles. We ordered a mixed BBQ platter and it was actually some pretty decent BBQ! Great ribs and tasty brisket. Alas, what caught my eye was The Big Unit. Not just a regular hot dog, but 22 inches of Vienna Beef destruction loaded with chili, onions, jalapenos, sauerkraut, relish, tomatoes, cheese sauce, shredded cheddar, and bacon, along with a bunch of crispy fries. Oh Yeah! This is the dog that Adam Richman devoured on Man vs Food! They ring a big bell whenever this is ordered. I saw a few people give up on it and take half home in a box. Not me. Now I was going to join that fat ass and do some damage here myself!\n\nYup, I ate that whole damn thing! Honesty, it was pretty tasty and was not too hard to finish. Just had to pace myself. Drinking a huge cup of diet Coke while doing this was not too smart as my gut felt like it was going to explode! Still, I got the whole thing down my throat bit by bit and swallowed it whole. Heh-heh-heh! I sat there in euphoric bliss of my accomplishment. Boy, did I feel like a fat slob.\n\nOn the way out we had to look around the souvenier area and picked up a few things. Had a great time here and the food was pretty good. Nice waitress and all of them here wear Alice Cooper-like eye makeup while working which adds to the fun. Menu items are fairly priced too. This part of town is empty unless a game is going on and there is a parking garage across the street, along with metered spots on the streets but after 8PM they are free. Lots of available parking.\n\nMAN vs FOOD AIN'T GOT NOTHING ON ME!!!", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 4, "date": "2011-11-16", "type": "review"}
{"votes": {"funny": 4, "useful": 9, "cool": 6}, "user_id": "joEN2Mx6n2FNzsIrR0CpjQ", "review_id": "10w5ftXFwo890LGkSImdEw", "text": "I have been lucky to get really good service at most locations I dine at...That's why people call me Lucky (they don't). So when I get bad service, a generally OK experience becomes anything but OK. Lets buy a ticket and check out Alice Cooper'stown.\n\n~Fud/Drink~\nGeneral....bar....fare. That makes it really simple for everyone. Now they have some interesting food options, yes, but there is nothing special. Why elaborate further? Alice's joint only offers greasy fried food options, with little time put into the preparing of said items.  For a football event I went to, they were offering breakfast. I ordered a cheese/egg quesadilla which was \"edible\". Filled with grease, I had second thoughts after ordering it, but was hungry. Meh. Of the two stand out items on their menu, the 22 inch hotdog named \"The Big Unit\" is a big hit. Its big, yes....but that's where it ends. You pay $17+ for a big hotdog guys...its really nothing much to write home about. Why pay that?? If going to the Dbacks game, why not get one or two $1 dogs at Chase? Just saying... I must say the other item on the menu that stood out was the catcher's mitt brownie. For $4.99 you get a HUGE warm brownie plus a scoop of ice cream, everyone at the table was impressed. \n\nAs for drinks, they really are just overpriced. I know they have rent, I get it. But seriously, $6.50 for a draft that isn't close to a pint? Horrible pricing decision. I would've had an extra beer but this turned me off immediately. Nothing else to say, just too expensive for what you are getting!\n\n~Atmosphere/Service~\nAtmosphere is OK, it could be so much better. The inside is fun on the surface, and they have some cool memorabilia hanging up..it is nice to see what Alice put out for us to view. But overall the bar is there for large groups to gather and talk, no extra fluff. When each Big Unit comes out, an obnoxiously loud ringing bell sounds and the bar staff yells out a chant. After a good 30+ rings, I was saved by the bell when my football game ended. As for service, we were the first table to be sat, and had anywhere between 3-8 people at given times. Service was consistently slow, despite the fact the bar was at about 1/2 capacity for most of the day. I had to flag down our waitress a couple times to get service, and remember that brownie I talked about earlier? Well, it sat on our table for 2 hours after being finished. It was still on the table when I had began leaving. So, service was bad. Really hitting the nail on the head, there was no reason why we shouldn't have been waited on more, especially since we had the largest group in the joint that day. Poor service..meh.\n\n~Extras/Rating~\nOverall, its not the best option for grabbing a drink and bite before games downtown. I have made suggestions for other locations, and those suggestions stand. They get 2 stars for location and a nice array of TV's for game day. They lose 3 stars for poor service, poor price for quality, and underwhelming ambiance. They can do SO MUCH BETTER...And until they change things, you can do so much better as well.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 2, "date": "2013-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dGyYmoqSfIxIU8tNkBfvkg", "review_id": "S4tW0OzFpO3PxVcelqt1rw", "text": "good food, excellent staff, nice environment.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 4, "date": "2014-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rMVVlPc8515khcIqAsWf1w", "review_id": "ujI8iFag8PlhTi3JurNbxA", "text": "We have been wanting to go here for a very long time but never seem to be in the area.  Finally we went.  I love the décor.  From the waitresses made up with the iconic Alice mascara to the autographed posters and guitars there is so much to look at.  We had the spinach and cheese dip as an app.  It was served with plenty of warm chips and the dip was very good.  My wife had the Cuban.  She said it was very good although she didn't care for the bread it was served.  I had the corned beef sandwich.  I am a corned beef sandwich whore. I love a great Rueben.  The sandwich was ok.  There was an odd flavor that was hard to pinpoint.  I believe that the meat was smoked which may have been the flavor that I kept picking up.  There were also a few bites that had very tough meat in it.  Over all I would go back to try something else.  Another thing that somewhat threw me was the price of the draft beer.....$4.16 for a Coors Light draft!  That's a little....ok a lot.....steep.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 3, "date": "2015-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "chI2p-ROg2tXI2-tT2_G2A", "review_id": "QOi8zoqSzSa0Mn4W2nq6ZQ", "text": "We were forced to come here since we had an estimated two hour wait for Pizzeria Bianco located next door.\n\nThey have a selection of wine & beer. I loved the moscato but it was $10 for a glass. Beer selections are much more affordable. \n\nThe ambience is really cute and wasn't crowded.\n\nWe ordred 1 appetizer which was the crostini. It was SOO small for $6. Two pieces of bread & four olives. Definitely not share-worthy.\n\nThis is a good place to go with long-lost friends since you'll be waiting at least 1 hour if not more for pizza next door.", "business_id": "JR95uaM82xBUIZ-kQ785iA", "stars": 3, "date": "2011-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "5NteGJSsdNSJSeCE6NvO0g", "review_id": "abUmT9tHlqBXnyiRzKDKhA", "text": "Super cozy diner.  It's small and doesn't have much of a street presence so it's fairly easy to miss if you aren't paying attention.  The diner is a classic boxcar that stays true to it's roots.  The outdoor seating area looks quite enjoyable for a late night snack, though I'm not sure if they are open that late.  Gotta love the outdoor ordering window.  You're best best inside is if you can catch a seat at the corner of the counter.  You not only get a great view of the chef doing the cooking but have a nice fat fan behind you to cool you off.  \n\nWe arrived shortly after it opened and chatted with the cook to get his suggestions on what to order.  Very friendly and funny.  The counter's got various coffee table books full of quotes and handy worst case scenario answers.  \n\nI had the Garfield which was a fried egg sandwich specialty.  I can't really recall all the ingredients but the salsa in the sandwich was amazing.  My girlfriend ordered the grilled cheese and it was knock out.  Prepared with olive oil, it was by far one of the best grilled cheeses I've ever had.  The french fries were done just right and the seasoning on them really hit the spot.  The total for both of us including a couple of ice teas was under twenty dollars.  A great deal anywhere.\n\nJust a friendly reminder that it is CASH ONLY!  I had to run to a couple of nearby gas station ATMs since the first was out of order.  Pretty embarrassing but the chef didn't seem to mind and trusted us to return.  Can't complain about any part of the meal and would highly recommend it to anyone visiting Phoenix or any locals that have been snoozing on this gem.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2007-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TJYLegdD8r_p5HOM6OgX5Q", "review_id": "dbDUDyfJKiA-fCEpBK-HVQ", "text": "I am so glad I decided to take a chance on this little place. Great food at a fair price. And, great service to boot. I had their chicken and cheddar biscuit called the Little Birdy and was in heaven. The chicken was moist with great flavor, not greasy, and not doughy. The biscuit it was on was perfection. Crispy and fluffy where it needed to be with a well balanced butteryness. To make things even better the biscuit did not fall apart after the first bite :). Loved the relaxed atmosphere and music selection outside. The dudes that were working were very courteous and answered questions without eye rolling like you may get at other downtown establishments.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2013-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ytyy-aaiYGGsYK68q_NDWA", "review_id": "s2tv91iPxaEPPz_EQgcWig", "text": "Found out about this place via a Yelp email that was advertising places in my area. After checking out the reviews and the menu, my wife and I decided to grab a late dinner here on a Friday night. As soon as we arrived I noticed this place just had an awesome vibe to it. Friendly staff, laid back patio seating, and the food is beyond amazing. We had the Fried Green Tomato sandwich, Little Birdy fried chicken biscuit, Fries, and a glass bottle Coke (the kind sweetened with real sugar). \n\nIn a nutshell: Love this place. We'll be going back again and again.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2014-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jY3VD_NRLioD6ePzEZuFjw", "review_id": "JKl6DUedJnYYz4IExDmRgQ", "text": "I have been going here for years... And this is my first review ever and it had to be for my favorite place in Phoenix. Everything on the menu is fabulous!! Even the PB&B burger that I never thought I would try... Amazing. Their slaw and Brussels sprouts are on point!!!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2WO2kPeaoQyYyxxzv-tlBQ", "review_id": "umvu0SB9F_LJQGTdI3y3Fw", "text": "Absolutely DELICIOUS. The food did take a little while but the quality of the food and the taste of the food made up for the wait. I had the Pb&B burger... it was heaven inside of a bun, it had peanut butter on it with pickles, this would normally be an odd combination but the sweetness of the pickles and the salt from the peanut butter made for a great duo. The atmosphere was very lively and happy. The service was good but when you order there is a small window that you order through and the woman/man who takes your order sticks you drink through this tiny window. This is a great Establishment and I will definitely be coming back.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YKH4opU1aKBuQuf6wJxACg", "review_id": "M320LedXokjxF5tNipfBLQ", "text": "LOVE THIS PLACE... Diamond in the rough thats for sure.... small place but dancers aim to please. Wont be going to Jaguars anymore after going to this place!", "business_id": "q9B1h5eGBvHjQLF10puUkQ", "stars": 5, "date": "2015-10-10", "type": "review"}
{"votes": {"funny": 4, "useful": 6, "cool": 6}, "user_id": "L3HT_5LwkK6xgChRLCNpXQ", "review_id": "WCaf21WF_aQhWZpre81LQA", "text": "Another weekend of visiting Phoenix and what the hell am I gonna do besides eat?\n\nUnfortunately, Phoenix didn't have an array of free places to visit, besides walking around downtown or their version of Old Town. Being from San Diego, I got spoiled by being able to walk around the beaches, Balboa Park, Seaport Village, the Gaslamp District.... You get the picture.\n\nThough the Desert Botanical Garden isn't free ($15 per adult), I gotta say that this has to be on everyone's to visit list, if one ever goes to Phoenix. The desert garden is pretty amazing, with all it's wild life and vegetation. Walking around the garden paths, we spotted lizards, cacti and birds galore! I even saw a garden gnome (http://www.yelp.com/biz_photos/IdCOpMsZ67g-oQZLgAsnOA?select=-TOj_E-xHmaOBW9NggUMmg). No joke!\n\nCoincidentally, the DBG happened to be hosting the Chihuly Glass exhibit, while we visited. So, we got more bang for our buck. For an additional $3, we also got to see the Butterfly Exihibit. Entertaining since butterflies were on people, as well as plants. Pretty cool, considering we spent almost 3 hours here.\n\nA definite MUST. And, though the Chihuly Exhibit is now done and gone, I do look forward to visiting, again, and hopefully checking out another exhibit.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2009-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "t3qsjX7YCa3z0vO8mODmQQ", "review_id": "CH5L4XHhrFygsWQA3IK_Ww", "text": "No shade to speak of here folks so make sure your hat is wide and your heat tolerance is high. We were lucky and went in November.\nNot a lot of flowers but for someone who is not use to terrain it is really neat.\n\nThe tour is free and really just 5 steps in a circle. The elder man was very knowledgeable and talked too slow for a fast pace world. If I wasn't so eager to get out exploring then maybe I could focus more. I did learn a few things from him but do not expect he is going to take you anywhere but a few steps (I am not kidding.) This is not a tour of the garden in any way. \n\nThe food was great at the cafe. I had a wonderful roast beef sandwich with great flavors in it. \n\nThe views were fantastic! \nThe creosota bushes smelled wonderful as it just rained and the hut made of it was fantastic to stand in and just breath that wonderful smell.\n\nNotes: I would appreciate more place-cards. We spent much of the time trying to figure out what was what there. As their were not many flowers this time of year, maybe to have some of the volunteers around to answer questions would be a good idea?  Just throwing it out there.\n\nThe gift shop had a great variety of herbs, Arizona style gifts, gracious shopkeepers willing to help, and many many plants to take home.\n\nTLDR: Worth the visit if this is your thing. I enjoyed myself but I love nature and it's amazing \"live\" art pieces strewed through out the dessert canvas.  I learned a lot about the flora here in Arizona.  Expensive, $18.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 4, "date": "2011-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sKNrs3NWHYmtOTKnlWZw_Q", "review_id": "bRbTWps1_MNnZOQcb9vApQ", "text": "MUST SEE! We were lucky enough to visit here when chihuly, a world famous glass artist, had an instillation. Even without that, this garden is something you must see.\n\nThe garden been around since the early 1900s. It's a mostly outdoor garden, with the exception of the neat butterfly exhibit.\n\nI would skip the restaurant on site. Service was poor and so was the food.\n\nGo visit!", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2013-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "FsC9Ycdf26KUTQAFcmR6CA", "review_id": "_bb2QU5UIZdOruCbvV4xGA", "text": "Beautiful gardens and lots of education. The staff was friendly and knowledgable. As a native to Washington state I'm fascinated by the different vegetation for the region and in awe at the beauty. I'd go again the next time I'm in the area.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2015-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "2NvURTaR_IAzXlnBs4LFKA", "review_id": "CiAay0ocx_G2ug_LEbKNag", "text": "Love this place!!! Reminds me of my favorite dive bars back home! Food is excellent too.", "business_id": "W41CEzdKJe8wdDB-Rd6KJQ", "stars": 5, "date": "2014-09-03", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "gmr1F-8sjzNns30aK2nXkQ", "review_id": "s5KnxyFVR6YtkbjkRGiAbA", "text": "We went with a group of people to watch some fights. The venue is super cool with so much history it's crazy. I sadly do have complaints about it though. They are as follows: thanks for charging 5 dollars to park even though we bought tickets to your venue. Thanks for charging 15 dollars in additional fees so the ticket wasn't 35 it was 50, thanks for starting the event 1.5 hrs late I'm glad I rushed down there, thanks for not letting anyone know that the seating at the venue is made for people who are 5'4\" of shorter, and lastly thanks for two drinks for 32 bucks!!!!!!  It's a good thing I got to see grown men attack each other as a reward for keeping my cool.", "business_id": "BcBxTyj09Wu-w0KA1QvKTA", "stars": 2, "date": "2013-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4D4UzEOu-QG4-jkyfynhPQ", "review_id": "tu0HJKlMvxljNlDtOurk_Q", "text": "Was grocery shopping for dinner and somehow ended up here instead...\nOur host was very nice and sat us immediately after walking in, he also informed us on drink specials. It is a bit loud here but not as loud as the camelback/central location :) \nI was thinking of ordering a drink but opted for water instead just because.\nWe decided on the 2-4-24 and chose boneless wings as our appetizer. I think Applebee's wing's are just OK compared to other places, the sauce just doesn't do it for me but I'll eat them \nFor my entree I decided on the double crunch shrimp with fries \nWow, they give you at least 18 pieces of shrimp and I am like trying to eat... Unless they're trying to say something haha \nI'm taking some home\nThe shrimp is good itself with the sauce on the side", "business_id": "hzUOqxpcnYYBgLlrgvjQYQ", "stars": 3, "date": "2013-09-30", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 4}, "user_id": "APLIPfq1Rf8QyhHHk2uAyA", "review_id": "UeaYiBVPA54ItGP8o34Alw", "text": "4240. Easy address to find. Plenty of parking in the rear. Street-facing patio for those who want to poke their heads outside, or for those who need their nic fix. \n\nNo noticeable \"Entrance,\" though the \"Exit\" Is marked (I guess that's the more important sign to have up, anyway, in case the party inside gets too fun.)  (NOTE: \"Main Entrance\" is on the south side of the building. Once you walk in, the bathrooms are on your left - pool tables on your right. So much safer than walking into a game of darts!)\n\nWe walked in through the Exit... and just about took a dart to the temple. Quick, duck! \n\nThere were patrons playing darts, chattin' at tables, standing at the bar... It was filled without being packed. Open seats at the bar beckoned to us, so who were we to ignore the call? I took my seat and ordered a Guinness. Service was fast and attentive. My 2nd round came right as I finished my first. \n\nThis place is cool, although on the night I went (my first night, for the record) I noticed there was plenty of men, but only a few females. This bodes well if you're looking to get hit on, I thought... Of course, what happens when I just want to chill out with a drink? Guess we'll see next time. \n\nIn any case, with my friend in tow and conversation free flowing, I had a great time. Bonus - this place is within stumbling distance from my new abode. Nice! \n\nSo, naturally, the night I'm saddled up to the bar and enjoying my Irish beer and the happy buzz that it gives me, I notice something peculiar. Never mind the mix of people -- from artistic smarts to tat canvases to baseball fans. Instead, I noticed the female bartenders cleaning up the bar with aggressive impatience... almost like slapping their rags on the bar top was the clear call to clear out. What time was it? I checked my phone. 12:18, precisely. Even bars in Oklahoma stay open later than that. I looked at my comrade in puzzlement. What gives? \n\nI guess we were being told that closing was coming soon, and our patronage with on a deadline. Well then. I savored the last gulps of my Guinness and we left... long before last call, I'm certain of it. But I didn't want to stick around to find out. \n\n4 stars - based on a first experience. I say that's pretty damn good. I'll definitely be back. (NOTE: I went back...the next night! And I had just as great - if not a better - time at G&D. Bonus! I heard real British accents!)", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 4, "date": "2007-10-06", "type": "review"}
{"votes": {"funny": 4, "useful": 8, "cool": 4}, "user_id": "C6IOtaaYdLIT5fWd7ZYIuA", "review_id": "S5VI4FltERAP1eW8mxkbXg", "text": "G&D was our first stop for our Pub Crawl, the fried food sampler was good and the drinks were decent pour and priced. \n\nThe server was nice and everything went well. \n\nThe location is lose to a rail station with just a short walk.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 4, "date": "2009-11-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "hn_DclKLzdxABRGGAuqKgg", "review_id": "pcbIYf9OIiguCJxrEt8JRQ", "text": "George & Dragon! After driving by you for months, I finally decided to stop in. Very nice!\n\nWell, pretty nice. Maybe just nice. The four star rating is very weak, but I decided to bump up from 3 to 4 because we had a good time. I like that this place is low key and not pretentious. I like that on Sundays, they play different football games rather than just focusing on the Cardinals. And I like that they host different things, like live music and trivia nights.\n\nThe food is very bland. However, it's a bar, so expecting the meal of your life is a little silly. It isn't greasy, bad bar food; it's average and a little overpriced. I would stick to a simple appetizer and some drinks in the future.\n\nFish and chips were OK - the corn was definitely frozen, and I think the fish may have been as well. Burger was very simple and bland. I did like the thick cut fries, but they were probably frozen as well. Portions were pretty good, which is a plus.\n\nThe service was OK. A little lackluster - our server seemed a bit frazzled, and she was the only one working the dining room. There were several tables that hadn't been cleared of the dirty dishes after the customers had left, so seating was limited based on that. The restaurant isn't dirty, but it isn't immaculate, either.\n\nI can definitely see why people wouldn't like this place, but for me, it's close to home, and it's a good place to relax without being around a huge crowd. If you stop in, don't expect too much, and you'll (hopefully) be pleasantly surprised like my husband and I were.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 4, "date": "2013-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tL0cR5UkpcBQsJ1zNEQ04A", "review_id": "pKZtT5X46e50AXR5WoNsEw", "text": "We came here for the first time. Came with the kids and another family. The kids had the French toast sticks and they were really good (our kids are picky eaters).", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 5, "date": "2015-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KA-GVrDP0huPS7zs5tmS1Q", "review_id": "ilzuDmHeb5zIPshQiH-POg", "text": "Came here for a couple of rounds after dinner--it was early like 7ish and the place was pretty empty, but it was nice because my group was able to play a few rounds of pool without being bothered.\n\nIt's a dive/biker place-- but sometimes that's all you need cheap beer and good juke box music. \n\nI didn't notice a \"smell' at all, i thought the place was pretty clean.  And the staff is really nice and tentative....so plus!\n\nWe were of the few \"younger\" ppl here, i think maybe like five others who were in our age group(20's) were in attendance.  Mostly locals probably, but that was cool, fun couple of hours.", "business_id": "VC0VbRhQqvXpolK3pFuZPw", "stars": 2, "date": "2011-10-15", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "6ts41fCsDKHbFZaKOMNmVQ", "review_id": "wENdJWrowYV0d7hIcE78cw", "text": "I love going to places I've never been to that my friends tell me they love. \n\nThis place was just ok. Nothing spectacular, but nothing bad either. Just middle of the road. \n\nWe ordered a bunch of apps to nosh upon. There was their spin on what I think was supposed to be brucchetta, but it was dosed in some sort of balsamic vinaigrette. The toast it was on was good and held up to the toppings. \n\nA cheese crisp of some sort was involved. It was a cheese crisp people, not to hard to mess up. It was cheesy and crunchy in the right places and soft in the others. The salsa they serve with it seems to be jarred, its not fresh...or at least doesn't taste fresh. \n\nI also had a garden salad, with Caesar dressing, I had realllly bad burps that lingered for the rest of the day from that dressing. So gross. \n\nI didn't have any beer, but the iced tea was decent. \n\nThe staff was friendly and on top of things. \n\nI would probably go back one more time and give them another whirl.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 3, "date": "2010-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7vTXWxqwoeN86P8m16EvMw", "review_id": "4wkX0q76B6Xecg5s1592RA", "text": "After a five and a half hour drive from San Diego, we showed up needing two things: (1) something to eat; and (2) a cold beer. We found them both at the SunUp Brewing Company. The menu is primarily pub food - burgers, nachos, and wings - although they did have a grilled salmon special that sounded good. There was a minor mix up with the kitchen, but the service was great and the beers more than made up for it.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2013-10-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "fV0GO3IBljKHL8vKtTox7w", "review_id": "Nch5Fp0ZowQ4bHkVHF6Mfg", "text": "For Christ sake get some real nachos! \nThis means cheddar cheese, not the wired mayonnaise mixed with cheese bullshit. Otherwise we love the shit out of this place.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 5, "date": "2015-11-08", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "xKUCiQz4IY6suDcrN2xqSA", "review_id": "Mh5kKTw-ZuW6CDSiXOz1Og", "text": "We went there for a family birthday and it was great.  \n\nI was the only male out of the 6 people in attendance and these women love to talk!  We were there an hour and half after closing talking and the staff was TOTALLY COOL.  I felt bad for staying so long but the staff kept telling us not to worry about it.\n\nGreat food! Great service!", "business_id": "3CSaqRNvYg7ZdN2zwxwzVw", "stars": 5, "date": "2010-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Ofxlhi_HKp7myFDpwg9aIA", "review_id": "5R3dANpHAg1a3BN8GIws2g", "text": "Second time here in as many months...I read my first review, and think...was I that drunk...OK. The 2 stars. \nFoosball table, 4 pool tables, sports on TV's, and the food is descent.\nThe missing 3 stars.\nEverything is dirty, this place needs a deep clean.\nAll the tap beer tastes pretty old...change the kegs, or clean your lines. \nEverything is really dirty, like you have flies...there was a fly in my pint of blue moon...gross!", "business_id": "_GS1R0LTwr6h8rMWY_8U9Q", "stars": 2, "date": "2015-10-19", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 4}, "user_id": "CVssZgB_DM2KncaDgu2Uyw", "review_id": "RCH41zxJIzeCIYQOFfs-eg", "text": "Yesterday makes my second time visiting The Rhythm Room.  Ironically, both times a New Orleans band bought down the house.  Be ye warned: The sound system in this Jimmy is super good so it's LOUD ... like very loud!  I like it like that though :)\n\nLocal draft beers only .. Devil's Ale is a winner!  $5.00 who can complain :)", "business_id": "JZJqJadk9pSoCGT7VTwBvg", "stars": 4, "date": "2014-09-26", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Cd95wUD6uptKdGd3Y3iAyQ", "review_id": "IN9jra2_ZawXV7nbN1_m9g", "text": "As a straight guy, Roscoes isn't my usual kind of place.  But hey, the beer is cold, the food is good, and after the first Blue Moon, I started getting into the idea of watching Michigan State football while listening to Rhianna.  The breakfast burrito yesterday was tasty and cheap, as were the Bloodys.  Straight or gay, it's a nice neighborhood place.", "business_id": "7srDFwPPnzBaQoPW55Dc8Q", "stars": 4, "date": "2014-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "dK60RfuSM5lFdOcCWBA9ug", "review_id": "fycrIJuVqANnrKfkyfEbdw", "text": "Staff is amazingly friendly. Burgers are terrific, beer is cold and I could definitely see my self coming back.", "business_id": "ntJAKLAq0cXzzdFgPoo0Iw", "stars": 5, "date": "2013-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lgYDQKLxFyX74M0KfSOIjA", "review_id": "FQIqs707dU9tqKZwXiBffA", "text": "The very definition of a dive bar w a food problem. They won best take out for good reason. Don't need a menu just get a burger you can't go wrong. Love this place.", "business_id": "ntJAKLAq0cXzzdFgPoo0Iw", "stars": 5, "date": "2015-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MzfQpcIfoS-vVR0HOX3S7Q", "review_id": "s-eP78_n0xHDM8iSfv0QNQ", "text": "I have been to this place twice now, the 1st time was a 1st date that led to my marriage. This is a great 1st date location. They have designed the moderate space well, with 2 levels and plenty of booths. Thier lighting and interior decorating adds to a feeling of cozy and secluded. \nHats off to the chef! They do a great job with fish, and wonderful grilled veggies and aromatic sides.\nThe service was not excellent, but good. Seemed that he floor might not have been staffed well my 2nd visit.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 4, "date": "2010-10-25", "type": "review"}
{"votes": {"funny": 11, "useful": 18, "cool": 13}, "user_id": "gzJpPaHN-NXBkAZcZri3hw", "review_id": "FEKgnPqSZ3qqm8bcalZ6gg", "text": "The Phoenix City Grill was described by friends as their local \"Cheers\" bar. \n\nWell, I have to tell you something. Although a Norm *does* frequent this joint I'd rather come here ANY day over the tv version. This place is swank! (Sorry friends. Your description needs tweaking.)\n\nI met my friends at the bar area. I parked out back and walked in via the kitchen area. I did NOT, however, realize I would be walking through a full on kitchen. NOPE. I closed the door in confusion. Double-checked the sign outside that said, \"Enter Here\" and proceeded. A very understanding employee provided me \"directions\" to the bar. \n\nThe bar zig zags around to the hostess stand. This is nice so everyone is not lined up like soldiers and conversations flows. There are standing height tables in the bar area as well. The restaurant section has booths (noted on the way to the bathroom) and copious seating. There is also a private room for events behind the elegant wall of wine.\n\nUsing the company's weekly email we scored a free appetizer. The \"Red chile pork tacos\" come two to a plate and are divine. Grilled pork tenderloin w/chipotle aioli & pineapple fennel salsa. YUM.\n\nHaving had a late lunch I could not possibly justify a decadent dinner. But I desperately wanted to after the tacos. Alas, no. Instead, I enjoyed a mouthwatering cup of the daily soup (Friday is the chicken tortilla). \n\nThe group shared something called \"Crispy Eggplant Bites\". \n\nGoodness!\nRed pepper relish, goat cheese, arugula and a sherry vinaigrette are layered over a crispy heavenly crunchy shell. What this heaven is made of I should have asked. But no, I was too busy inhaling to inquire. (Four to a plate. Big enough for a group to share. IMO. However, I could see a tipsy person opting not to. This stuff is seriously good!)\n\nI also fork sampled my neighbor's plate \"The Original Griddled Corn Cakes\". This is a neat mixture of sweet, spice and well, cheese. And I like cheese!\n\nI'd say I'd come back and eat these things again. But NO. I want to try different things *next* time. Brunch looks a-m-a-z-i-n-g. So does lunch. And all the great entrees I had to pass on. (Aww man!)\n\nWith a full belly I understood the \"Cheers\" reference. You come here repeatedly. \n\nIf you sit in the bar area look for Jose, JP & David. All three bartenders seamlessly moved between guests without missing a beat. Our glasses were never empty.  Even though we were waited on by all three of them service was transparent.\n\nOh! And keep an eye out for the owner, Sheldon. He's making the rounds and greeting guests too!\n\nThis place is super popular for good reason. If you're coming for a special occasion or with a larger group (which they can readily accommodate) I'd recommend a reservation.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 4, "date": "2013-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "K8t10Lm949sFpm_MRN2jfA", "review_id": "UxpFDhXF4yMb5TjGlq123Q", "text": "We found the Phoenix City Grille by accident while visiting Phoenix. We were there for lunch and the food exceeded our expectations. The service was very good. The next time we are in Phoenix this will be our first stop.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 4, "date": "2015-11-03", "type": "review"}
{"votes": {"funny": 5, "useful": 10, "cool": 3}, "user_id": "4ozupHULqGyO42s3zNUzOQ", "review_id": "GRc0ishku-ZQK0rP4auZFQ", "text": "I've never seen a real duck at this Decanter, but I'm pretty sure that if they knew what a great little treat this local business is, they'd be lining up and quaking to be let in. \n\nDuck and Decanter is an adorable little local deli, wine bar and gift shop in Phoenix. With a perfect patio to enjoy lunch on a nice day and a gift shop with unique finds to browse through while you wait for your sandwich, it's an enjoyable experience all around. \n\nThe food here is freshly made and up to gourmet par. They have a selection of cheeses to satisfy any dairy like and the wine is equivalently nice. I like to visit the Duck when I want a quality lunch and need it in a short period of time. My go-to sandwich is the ham and brie with honey mustard. It's a big sandwich too so I always have a left-over afternoon snack. They have a huge selection of drinks and chips -- including baked lays and for the times when my sweet tooth takes over, they have a variety of brownies, cookies and candy as well. \n\nI always enjoy browsing through the gift shop and it's a perfect stop if looking for a unique gift that's off the beaten path. Duck also supports local AZ so they have several events throughout the year with local businesses and promote other local happenings around town. \n\nThe wine bar is intimate and full of spectacular vinos. I always forget about the wine bar and need to remember to visit more often. \n\nAll in all, Duck and Decanter is a true treat for my taste buds every time I visit. If you're in a hurry, call ahead and place an order to pick up because it can get pretty busy during lunch time. They also deliver!", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 4, "date": "2010-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J0UoK9CUq6QyFamCrpUHwA", "review_id": "aDm9xXRfC_QoSPBvAf-_WA", "text": "I love this place!\n\nWhenever I go I get a Roast Beef on a Kaiser - great sandwich! And the flavored tea, try the flavored tea.\n\nFun, friendly atmoshpere. People of all types in here!", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 4, "date": "2014-11-04", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "xow0ovtH7aLhUTgJN3tlDg", "review_id": "vLs1YsgkDYTtYVOOMLWKXg", "text": "The swizzle is great!  The people are real and the drinks are cheap but eat before you come because this is truly a bar ... No kitchen.", "business_id": "mgllPJA6NQXlJurFWAkqQg", "stars": 4, "date": "2013-10-20", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "S6NrF2WuiJXp9BbWEDpcHQ", "review_id": "O7uUkQO-QP5FFp4UTt50rw", "text": "Okay...so I kind of cheat. I write about places I've already been to but I'm new to Yelp and trust me, I have a new destination planned out verrrrry shortly. \n\nWhat can't I say about The Dillo? I've heard about this place for years and have only within the last year or so been in to take it for a test run to see how great (or bad) it could be. It's lived up to the hype.\n\nThe Armadillo Grill is misleading. From the outside, it isn't what you would expect. It's a sports bar with class and the food is awesome. My favorite? The fried pickles...such a guilty pleasure but I eat them with ease. The wings are also fantastic and so's the calamari.\n\nThe wait-staff are all friendly...every single person I've been served by has been attentive, friendly without being over bearing and sometimes, a big ol' smart ass (specifically Jason the bartender) which is right up my alley. \n\nAny place that has reverse happy hour is a winner in my book seeing as I work late most of the time and rarely get to make that 4-7 slot many places have. And the happy hour is fantastic! \n\nEven when I move closer to downtown, I'll still make my trip up to stop in at The Dillo....you should too!", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 4, "date": "2010-09-02", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "h1GORHU6lwaHjVyUh56ikA", "review_id": "gDvPi0BnKsDbbyhoH1z2BQ", "text": "I used to love this place. It all went down the past few weeks. The food quality was lacking compared to their norm. Usually I could have shrugged this off but this last time was most disappointing. My wife was just cut from a long double. When we walked in I noticed three very young snickering girls at the bar. The bartender approached us and after ordering our drinks he said he couldn't serve my wife because the manager, who was one of the snickering girls, believed she was intoxicated, which was quite the opposite. The girls sitting around the bar continued to laugh. Obviously we were way more aware than they realized. Normally they have decent bar food and good drink specials but if this how they treat customers they don't deserve business. The biggest complaint is their beer lines taste dirty. The biggest plus used to be fried pickles but now I just enjoy them at The Turf instead. Usually I'm not so easily offended but this was bit ridiculous. I will definitely update my review if this changes.", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 1, "date": "2013-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jNSOQGFKm8LaeJEa997Huw", "review_id": "0R7qQAh8NDAX-u5D9EMgLg", "text": "Got takeout from here. The mozza sticks are massive and delicious. \nThe sliders are cooked perfectly to a medium/medium rare state. They didn't include a sauce, so I added ketchup at home. After that, they were delicious. The sautéed onions added a nice flavor to it.\nI also tried the shrimp from the blackened shrimp Caesar salad and they were orgasmicly good. Full flavored with a slight spicy kick, it's a shame they're only a temporary item on the menu. Nevertheless,  if you see blackened shrimp on the menu, order it. You won't regret it.", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 5, "date": "2015-11-30", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "5xUUzFaKAcrFOPTgMKBfww", "review_id": "hJZcfD7RGZlJvqvNpQh66g", "text": "Merc bar hits just the right pitch for me in Phoenix. Always starts out slow (we got there early for the real estate) and ends up kinda packed. Staff and music always good and you don't feel like you are in one of those ridiculous cirque du soleil type places in Scottsdale full of shiny, happy young republicans nor one of the downtown spots full of emo, salty, better than thou modified arts types that think they are in the East Village circa 1980. Ugh! I'll take Merc each and every time, Thanks!", "business_id": "peA3F-PnIfijYr8HuG-A-Q", "stars": 5, "date": "2011-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 3}, "user_id": "3aq04wW7nVKI4UAg_XOUVQ", "review_id": "097qQ9UMe3548pv31iNVvQ", "text": "This was absolutely my favorite bar when I was at ASU. The place is an old home converted into the most eclectic bar you'll run across in the Valley. There are plenty of small nooks and crannies to get settled into and they have a decent sand volleyball court. When you happen to be outside if the temps drop to anything resembling chilly weather, they have these great little portable fireplaces. \r\n\r\nEasily the most eclectic crowd in Phoenix, you'll drink beers next to doctors, lawyers, bikers, and mechanics. Nowhere else in town will you buy a burger and have to cook it yourself, but that is part of the charm of this place. When you do make it over here, it's a little tough to find because it is fronted by a huge stand of trees so keep your eyes open. Since I'm not in Arizona anymore, please have a seat in the giant teacup and drink a cold one for me.", "business_id": "kWhPVxZv7C2htB-Z8az_AQ", "stars": 5, "date": "2006-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kk05snSafuIFK0lsxoMNzA", "review_id": "PDK6I4S2-Zu8ZFYY8ojB_Q", "text": "Dined here again last evening.  Food was exceptional in a very comfortable yet upscale setting.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 5, "date": "2012-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "U2Ez3lMr3CHuNl8NFww4QA", "review_id": "Wm5SUD8zIVAJQFnGmgINGw", "text": "Who knew that Capital Grille has amazing lunch specials!? I went to Capital Grille today for lunch and was shocked at their affordable lunch prices. For $18, you can choose your choice of soup or salad and an entree! {And of course their amazing bread basket}. Their entree options include; Dry Aged Sirloin Steak Frites with Red Eye Jus, Maine Lobster Roll w/Salt & Vinegar Chips and Jumbo Shrimp with Israeli Couscous & White Wine Mushroom Broth, to name a few. I ordered the \"Cobb\" Salad & oh my goodness, it was seriously fabulous. The mustard dressing was so light and perfect. The steak was cooked to perfection, you could literally cut it with a fork. I will most definitely be back soon for this fabulous salad! It was worth every penny.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 5, "date": "2015-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aAOosIA2598fl8v2mcWoWg", "review_id": "dVTayLehNXfEfD4hgvQEig", "text": "I went here on 9/7 with an old family friend.  The food was good, the drinks were good, and the service was excellent.  Our waitress was very attentive and pleasant.", "business_id": "rVUEZpHQfWI_3kt0lBwaxQ", "stars": 4, "date": "2012-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "NXbUB8hYs9jPjPJzhZ0VgQ", "review_id": "pVibQle2eDV5Fb7yocBJ8g", "text": "This is the BEST Italian food in Phoenix. The \"Goodfellas\" vibe is understated. What I loved was the 80s decor, and I mean that in the best way possible! Leopard print, glass block, neon, LOVE IT LOVE IT!", "business_id": "vvA3fbps4F9nGlAEYKk_sA", "stars": 5, "date": "2008-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wQAIt2AwAnX8XKJ1JiNzAw", "review_id": "Amw0Y6bKlhOUxw7Cy1vM2g", "text": "A+++ would do business with again. How come no one mentioned the piano player?!? Great ambience, AMAZING food and fabulous service. Out of four people we all ordered different appetizers, salads, entrees and dessert. Every single dish hit out of the park, no bad meal and we are a group of foodies who eat at all the dive places around town. Ever been to Durants in downtown Phoenix? This one is not a far cry from that dated, classic feel. The piano guy takes requests..he knows it all! Perfect atmosphere -- highly recommend.", "business_id": "vvA3fbps4F9nGlAEYKk_sA", "stars": 5, "date": "2014-10-03", "type": "review"}
{"votes": {"funny": 6, "useful": 5, "cool": 4}, "user_id": "wxuIXe9jCIwloEwuNsnVvQ", "review_id": "q1PfOT-dQ0iGvf_aRZ8dvA", "text": "Having not been to a strip club in awhile, I had a blast with clients at Phoenix's most famous gentlemen's club.  $10/cover and $10/lap dances with friendly, gorgeous, well mannered entertainers made the night go way too quickly.\n\nHighlights include a pair of Parisian identical blonde twins and a Brazilian angel who looked like she belonged on the cover of Vogue.", "business_id": "aToxIssFRGDGsTV4yJ9qbg", "stars": 5, "date": "2006-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bYdUMQluPbp_zbIs_RLYDQ", "review_id": "G75YCmQDvMjI4kd5aFBZbg", "text": "This may be one of the best cheap bars in Phoenix. The first time I went I fell in love...and then I went back. The second time I went was on a steamy  Sunday with my best friend. What I didn't learn the first time I went is that they will let you you grill your own food (outside), they have a smoking patio, and they frequently serve free food.\n\nReally, what is better than a bar that has a decent beer selection, lets you watch live hockey, AND lets you grill your own steak freeof charge?", "business_id": "yb17xHvhDJthJGS10uhFeQ", "stars": 5, "date": "2010-10-05", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 4}, "user_id": "qASPib1Z8ft8e96dtbh66w", "review_id": "7HOKnyfl5D_S7lTOlg4TYQ", "text": "Oh heck yes.  I really like Postino.  The atmosphere is laid back (the dress ranged from t-shirts and shorts to sun dresses and collared shirts) the wines are good and the food is really good.  I do wish the wine list was more extensive though, especially for a wine bar.  The service is really friendly and attentive, although my husband didn't really go for the wine our server suggested to him.   The bruschetta is fantastic and the cheese plate is ginormous.  Its good to try to get there a little early (think 4pm or earlier) because it does filly up and the parking lot is tiny.  (Or you can fork over the $3 for valet)   Seriously though, I think it must be the tiniest parking lot in Arizona, its like something you'd find in Boston!\\\n\nUpdate:  I chose to have my birthday dinner at Postino because I wanted something casual and fun.  Postino fits the bill.  I called and made a reservation for 12 which was no problem.  (They did take my credit card information which I am totally used to doing for large groups)  We arrived and were seated promptly with great service throughout the night.\n\nI was told when I made the reservation that if I wanted to bring in cake there would be a cutting charge but I could bring in something from Tammie Coe with no extra charge.  I purchased cupcakes and completely forgot about them until we were at Merc Bar later that night!  I called Postino and they were nice enough to hold them for me (again- they had held them from when Tammie Coe closed that afternoon until our reservation)  and I was able to get them the next day.  Cupcakes for breakfast!\n\nI've eaten here several times now and I'm never dissapointed....not in the bruschetta or the salads.  One day I'll try a sandwich I'm sure....if only the bruschetta wasn't so yummy!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2007-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ITQ8anChFzFdw058JYydWg", "review_id": "Aj7CS9dI5bNx53HAlibiMw", "text": "Girly girls like this place, I have a lot of friends that squeal their exclamations of praise. But honestly, other than it being a cool concept/design, I don't love it. The $20 deal is good value (bottle of wine & bruschetta). Full price is not. The bruschetta ingredients are cold, served on cold, un-toasted bread. I have heard they just have a George Foreman grill back there. So, I find stocking up on the antipasto bar items at Sunflower market & grabbing a bottle of wine more enjoyable at home.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 3, "date": "2009-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sQTvI2N_WT5m60ZUbTMCMQ", "review_id": "WWCuqbXaFHrhyvUczsieTg", "text": "Oh Postino...how I love you.\nThere's really nothing that needs to be said other than GO THERE!\nI've been nearly a dozen times now and I've literally never been let down.  \n\nI like to sit at the bar when I can, Sander is such a great bartender and always gets us everything we need before we have to ask.  We even mentioned we were waiting for a spot at the bar (it was a busy friday night) and he was nice enough to come get us when 2 people left.\n\nWe usually get the bruscetta, especially when they're on special (mon and tues), but if you want to branch out, try the pub board, or the butcher block.  Both are perfect for finger food while enjoying your wine and your company.\n\nThis is always where I go for special occasions or when I have out of town guests.  This place is definitely 5 stars.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2010-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GBgY4j4mZjB-eoRb359Nnw", "review_id": "tUr1ShXtakpPEUlcTxOeLA", "text": "As the great Adam Richman says, \"Oh my goodness..oh..my..goodness\"\nHands down the BEST restaurant Ive eaten at in Pheonix thus far!\nHad no idea what to expect coming to this restaurant while attending a conference over the past week, but a friend (who is now a local---tear) suggested this restaurant because of thier great happy hour. (Every Monday and Tuesday night after 8pm, $20 for a bottle of wine and bruschetta) We missed the happy hour but now that Ive had thier homemade bruschetta...who cares! I would come back again and again even without the discounted food. \nThis restaurant is quaint and cute. Sort of small and tucked away behind a random street (obviously Im not a local Phoenix-er) But they have this cute little outdoors area with a fireplace and bar, and when you are in a hot little town in the middle of the dessert, its nice to be outdoors and enjoy the warmth at night, something we dont get to enjoy too often in SF. Im sure many of the other plates at this restaurant are delicious as well, but their specialty by far has to be their bruschetta! Almost any type of concoction and combo you can think of to go on flaky/crispy baquettes, this restaurant has come up with. None of the bruschetta's that I tried were dissapointing.\nLet me start by saying, this place is a \"share with everyone\" type of restaurant, which, I have no problems with because then I get to pig out and taste everyones's plates. haha!\nSo, I literally tasted almost every type of bruschetta that was on the menu.\nLet me start with the Brie and Apples with Fig spread- this almost tasted like a dessert because the tangyness of the apples. The Tomato jam with fresh sheeps milk cheese could also be had for dessert. This actually may have been my most favorite out of all the bruschettas! The cheese was sooo creamy, you could eat it with a spoon. That mixed together with the sweetness of the tomato jam------heaven.....\nProsciutto with Figs & Mascarpone\nThe Warm Artichoke Spread was mighty tasty and fresh and this coming from a girl who grew up in the \"artichoke capital of the world\" \nBurrata, Bacon, Arugula & Tomatoes- Adding burrata to anything cant be anything but delicious! And knowing that, I, a corndog/bacon LOVER think that this combo will rock anyone's world. Um, hello.....bacon!\nSalami with Pesto- the salami was tasty and spicy and together with the homemade pesto was the perfect combo for a warm night. \nI will come back to this restaurant next time I am in town for spring training, hell Ill prob eat here every night Im in town!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2010-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_Rx2iNZzYsLBp03uB27lXQ", "review_id": "-AZnEjb-Q04FLfISVHsgcw", "text": "One of the best places to have a great meal in the valley.\nI ordered a two picks combo menu of the house salad and nine iron(?) sandwich0 which was a PERFECT choice. I can't wait to go back there again to try other menus.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2011-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hkPF7XnOy92HQ8CCAIIEeA", "review_id": "st6qohHKZ0MmIJyLLz327w", "text": "Great bruscetta salty carmel sundae, and of course wine.  Service can be a little slow from time to time but not a big deal.  Love the sparkling sav blanc on a hot day.  Cool atmosphere as well.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2011-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "H1fG6fiTMBgndfSuC0gpuA", "review_id": "5l3UPVoohc0EvCk0TDASSA", "text": "Great food, great wine, awesome happy hour... what more could you want?!?!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2012-10-26", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "G4IR4Mqsg7kFLaruUpAP2A", "review_id": "z21nLwQ3-gG1__CMx5_-RQ", "text": "BAAAAAAAAAAAAZING!!!!  Want something to do on a Monday-Tuesday evening, come here for $20 bucks and you'll snag a bottle of Vino and some delish bruschetta.  The atmosphere is open and Euro feeling with the open wine market and back of restaurant bar.  Seating can be an issue so be flexible when trying to find standing or sitting room.  The food is good and the service is spot on.  Definitely my choice for chillaxin on an off night with friends or even a date.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2013-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "hnzx7Q7IWq5EDVe0yjKK8w", "review_id": "T_8i-NEkBa8DU-i_RITXWQ", "text": "\"Eat me\"\n\nYep, that's what everything (the food) said to me as it came out. That about sums up my experience.. but read on for more specifics.\n\nService: TOP notch service. Our waiter was patient and super attentive. He knew the menu and even said, that's why I work here because EVERYTHING is good!\n\nFood: We started with the spinach artichoke/white bean hummus combo and the grilled cheese.. yes.. folks grilled cheese. This was by far the best grilled cheese I've had..ever and that says a lot. It was on a nice flaky break with the perfect amount of gooey-ness. It was served with a ketchup, fancy mustard, and pesto. Fabuloso!\n\nFor the entree - I had the tomato florentine - I felt like it was missing a spice, but it was still good. I had the chicken and mozzarella panini and the mixed greens salad. Albeit I was stuffed, it was amazing and tasted even better the next day.\n\nThe other perk is they have a focused menu. They aren't trying to be everything to everyone. Another bonus!\n\nThe open doors/windows, patio seating and coziness of the restaurant was a perk.\n\nThe only thing I wish there was more of was light. It was very hard to read the menu using a small candle. It wasn't enough for me to take this down a star though.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2013-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "AcmsTx5DLHo32nX36XVJQg", "review_id": "lOL9T0vSsQ4Niig3txd37w", "text": "I just left literally 90 seconds ago. I came to celebrate my girlfriend's birthday with 4 other women. We ordered every cheese board they offer as well as a bottle of wine (the only reason we didn't order dessert is because they wouldn't offer it)\nI feel it's important to post this review immediately because I want the restaurant to understand why we will never return- upon leaving, we heard/saw the manager saying \"oh good, that table is finally f***ing leaving\".  Really? We had sat at this table for 2 hours however, eating, drinking, and tipping well. At first we were offended, but upon reflecting, we're outraged and will not recommend anyone waste their time there, especially while surrounded by lots of other great date night choices. Very disappointed.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 1, "date": "2013-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NLCC0_t4UZHbYDez2k_Kow", "review_id": "fWQZhlLG-UVpkudP4128hw", "text": "I have been using Maids for over 5 yrs. I love coming home to a nice clean smelling home and knowing I don't have to do anything that weekend (I get my house done on Friday). I recently added a tenant and told this person the night before Maids come, you need to \"pick up\" so they can \"clean up\"! I've always made sure everything is picked up so when Maids come in, they have no problem getting right to the job I hired them to do and that's cleaning! Love these ladies!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2014-09-26", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 3}, "user_id": "5Y4hEVOW0B41kKjVEjDQvA", "review_id": "j_cc59CV4J3Zv1BxEzgRwg", "text": "Wine, bruschetta, friends, and Yelp was how I spent my Labor Day here at Postino's! I had the cabernet and tried four different types of bruschetta, which were all amazing (not a huge fan of the artichoke spread), but still loved them! $5 wine before 5 p.m. so make sure to head in early! \n\nIt had a very relaxed, chill atmosphere and comfortable seating options where you could choose table, high tops, booths, or even couches. Music was a bit loud, but still enjoyed the vibe. \n\nJet really made the experience here excellent. He took his time to give us the history of the restaurants and the management behind them. He gave us great recommendations of other restaurants under the same ownership that happen to be next on my list to try!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2015-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iJQFrCr8NRP4qGbLmTCdPg", "review_id": "0kwZbwC0aB8bAeoCsL5RiQ", "text": "Food and service are great.  However, had a nice table indoors with a great view but in came another indoor group that brought in a lap dog in a Green Bay jersey.  No leash, no harness, no restraint and certainly not sanitary (Management?).  Love dogs, but please be considerate of others (including those with allergies) and sit on the outdoor patio.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 2, "date": "2015-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "QxKjiAVoyl7qo-VYekHuDw", "review_id": "2iuYC_AmABR9kgbjELF5Gw", "text": "Dive bar heaven! Loved this little gem. Their is a jukebox so you can play your own tunes. The drinks are cheap. The patrons are hilarious. The vibe is awesome and reminds me of little beer joints back east. Go. Drink. Be merry!", "business_id": "qz4ZOcv-840UjfCEYI4qZg", "stars": 4, "date": "2014-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k1gklSpB0xTlrDbcVuE-fA", "review_id": "H4PbRM_UK2gWsqgVCrSsgw", "text": "Great neighborhood sports bar!! Price is right, lots of drink specials. If you like playing pool or darts this place is for you.", "business_id": "fuoUja6AXOaOikyLaKOrNw", "stars": 5, "date": "2013-11-17", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "C6IOtaaYdLIT5fWd7ZYIuA", "review_id": "Q7He2Hs2IZQhUpL3LbuL4g", "text": "So I go to eat at a recommended place and they are closed for lunch and only open for dinner....one of the owners friends tells me about Bobby D's. \n\nBobby D's is a HOLE-IN-THE-WALL bar on Peoria and Cave Creek. It is near a Circle K and is very plain on the outside. \n\nOnce your eyes adjust to the darkness, you see a GREAT bar. It is a total local's place. There were 10 people @ the bar either eating, drinking, or talking. There is about 15 booths and about 10 TV's. They have a video bowling machine and a dart machine. The place is very very clean.\n\nI asked what was better the burger or the fish. Barb, who might as well be your Aunt Barb, was really cool and sat down with me to take the order. \n\nShe said the burgers are good but are premade. She never had the fish but just served two sandwhiches today. \n\nI ordered the fish, it was a single peice of white fish, about 7 inches long. It came with cole slaw and tater wedges. The fish was good, although not enough meat. The frys were really good. and the cole slaw was ok. \n\nThe bill was $7.25 and I was satisfied. \n\nThey serve Coke products and no Mt Dew. 1/2 point deduction...haha", "business_id": "EUXT1vSFWaiD_BFmFK8rBg", "stars": 4, "date": "2008-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hyAl0vwfHZZVcInO3zW7ow", "review_id": "esMLuiO9RrbD0xT7jfRh6A", "text": "Fun place, yummy food and a great place to watch football. Very attentive wait staff.", "business_id": "F-ykHfGY9lWr12OJ_Ofy7A", "stars": 4, "date": "2014-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ThNVcOwkhNc16XRIRMz6sQ", "review_id": "r8B1B4esmldSKO_1LJmHCw", "text": "I recently ordered food to go online from this store. I live right across the street, so I go to this Chili's now instead of the one in PV that I would usually frequent. When I went to go pick up my food, the girl working take out seemed very nice and pleasant in conversation. So I paid in cash for my food, and this chick asks me if I want my change... Like are you serious?? Do I want my change? The change she owed me was like less than a dollar... I didn't get it, it really rubbed my the wrong way. I just told her no, she could keep it, because at that point I felt obligated to give her the .75 cents she so desperately needed to have... Where are your manners? I understand you make tips, but that is not the way to earn them!\n\nI was even more upset when I got home and realized that the kitchen had tossed my salad in dressing! When I went to eat it, I couldn't because it was soggy and drenched in blue cheese! I hope that girl really appreciated her tip that she essentially flat out asked me for. It was really worth it to me, especially considering she didn't even check my food before bagging it up!", "business_id": "_BU867oRCLZnDIRmg7S6Wg", "stars": 2, "date": "2015-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Hi7VohxSS5OBt98w4j8t4A", "review_id": "Pps2P5ODjeIwxIzU7KBdxg", "text": "Cozy, romantic little neighborhood Italian joint.\n\nFood was pretty good. My husband had the meat lasagna which he said was decent. I had the gnocchi which was tender and tasty with an okay vodka sauce.\n\nDidn't care for the bread that came out first, nor for the house salad.\n\nMy dirty martini was spot on and a good price even with premium vodka.\n\nService was mixed. The bussers were on top of it with filling the water and bread. I felt our server was a bit cold towards us however. Not rude or mean but a bit impatient and unfriendly. Was it the restaurant.com certificate? It's a shame that I feel compelled to tell servers that we tip well over 20% of the original bill. I shouldn't have to. \n\nWe may or may not be back. Food was good but there are many other delicious Italian options to commit to it.", "business_id": "jq_YnMQjcArdBWuwRospFg", "stars": 3, "date": "2012-09-05", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 5}, "user_id": "b8vpDCrjDwjXSr92JVp-PQ", "review_id": "zIFHbp7gkADZBymjX_DA-w", "text": "Well what to say... Its kinda hard.\n\nDive- Thats the best way to explain it. \n\nBartenders- the ladies know there stuff so dont give them any lip and listen to what they say.\n\nTunes- They have a juke box, with old country music but its a good fit for the spot.\n\nThe fun- People are just there to get a cocktail and beer with out all the fuss you would find in a corporate spot or anything in Scottsdale.They have 2 pool tables , darts, a few video games and a shuffleboard table. so they is always some fun going on.\n\nBreak it down Jess- If your in the mood to get out of the house for a drink or two but want to stay in your gym shorts and t-shirt with the two paint spots on it and maybe shoot a round of pool with a stranger, ho will become a Larrys buddy. Its the spot.", "business_id": "vUmCtldBjn_AuHW4tg2LZQ", "stars": 3, "date": "2010-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "L8NC1S3O0AgBwrysvG1wfw", "review_id": "ba2S6EKeoeNmjDuMs0hdVg", "text": "My husband I went there last night, with some out of town guests.  What a great time we had!  Drinks were very good priced and a live band, no cover charge, and what a Great time we had.  We will be going back here again, we loved it.", "business_id": "f_leeIRar8uNCkk5sAmHRQ", "stars": 4, "date": "2012-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OTuWbBwueDGNGEKeridumA", "review_id": "EwlMxvx8pnHV_6hgsaI6Zg", "text": "yes it is a throw back in time, went for first time today. looks maybe a bit tired but food was spot on. i'm a very picky eater i got the smaller hamburger and fries and could barley finish.so much food my friend got the all you can eat beef ribs (sunday and monday) bartender/ waitress was prompt and friendly  will def be back.", "business_id": "JImJictLIE48_O1z-l2TGw", "stars": 4, "date": "2015-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VP9G0f-812pf8mOVAWdJhw", "review_id": "P_3U9YpAQDQymoVbZfP4Lw", "text": "Amazing food and friendly staff. We will definitely be back. We shared a pasta dish and the fish and chips. Everything was cooked perfectly and have a very balanced flavor. Would highly recommend.", "business_id": "vFJmFFfPVhHkC3bWOeZnNA", "stars": 5, "date": "2014-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6OWHDbEq23f24Vki_veHBA", "review_id": "WMubmzh6GTLHORjKACFzNA", "text": "Some coworkers and I ended up here after the team trivia location we were going to go to ended up getting rescheduled (woops!). I have heard of Brigett's but this was my first time there. It is divey but I felt comfortable parking out front and heading in by myself. I found my group and had a seat, and the server was very nice and attentive throughout the night. It is a ways away from home so I can't say I'll be running back, but the crowd inside (on a Thurs night) was chill and I had a good time.", "business_id": "-xLwGUmmyKgsTtFOOXzjeg", "stars": 3, "date": "2013-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "47m2PoXl6wvkzgNWLl3Tsg", "review_id": "5Nlyitutj56vI5AI2we85Q", "text": "Lived just 3/4 of mile from Whiskey River for 3 years and visited for the first time on Wednesday.  \n\nI was pleasantly surprised and will be back.  Wednesday is ladies night and 50 cent domestic bottle beers.  Yes, 50 cents.  There's a 7 dollar cover, but you'll make that up and then some on the beer.  \n\nVery cool bar and wait staff makes it all the better.  The two Stacey's and Katie were behind the bar and Heather covered the floor.  They're down to earth and fun.  \n\nThe turnout and music was the biggest surprise.  I expected just country but the DJ mixed in hip hop and dance as well.  The ratio was roughly 60% percent women and a very attractive selection.  \n\nI definitely recommend Wednesdays at the River!", "business_id": "gOlJQuE3WYeMgXXDKYfdeg", "stars": 4, "date": "2013-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6rkPLxBIfAbRY98YfFrt9Q", "review_id": "BOxkAgrO_gPK6WHiiworXQ", "text": "Catherine was not very pleasant, and had a very bad attitude. Maybe I'll come back, but probably not after that. Plenty of other bars to go to.", "business_id": "E-_PkZNDuYxW1zs4XFlVmw", "stars": 1, "date": "2014-09-28", "type": "review"}
{"votes": {"funny": 4, "useful": 2, "cool": 1}, "user_id": "Gz6a5ATa6Sg0QlfiCHPcZg", "review_id": "aMpHOkIvJGeKK3JbmBA6cQ", "text": "UPDATE:  the last time I went to this club I met a dancer there and bought her a drink. We ended up going out on a date at which time she disclosed to me that she was actually 19 years old. The part of me that wanted to do nasty things with her shriveled up and died in that moment and I was shocked that she was allowed to have a drink in the club because she was under 21. Her reply to me was oh they don't really care if you're a dancer. Ive got a problem with that I'm an adult and only adults should be drinking in clubs so beware of that.  Don't assume they are of age....\n\n\n\nI was expecting really hot girls...but i found very few.  Mostly fake boobs...and major check-out attitudes.  I'm a girl, im an easy money lap dance 'cause im not gonna try to pull anything...but it was ridiculously difficiult to GET a lap dance from a girl that was pretty.  I like voluptuous spicy girls...dark hair, natural breasts..not much of that at Cristies. If you like alot of blondes w fake breasts...you might like it. The drinks are strong, the atmosphere great.  Buut in my opinion, their girls are sub par for the price......ive seen cuter girls willing to work at the Candy Store.....but i'm still looking to try Burbon Street.  BTW saw waaaaaaaaaaay too many girls at this club with bellies....i was like, WTF?", "business_id": "nFLzsN12DskfMWYNmcOhdw", "stars": 3, "date": "2011-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HbsnWw0xaN8tNqcv_SZGsg", "review_id": "07zOhI2M5n6fpPuWjpcgFw", "text": "has an awesome relaxed feeling when entering, seating on comfy couches and chairs, very clean-has lucille ball stuff all round fall tree and very cute decor- that did it- oh and the wine too!!!   bruschetta (traditional) is perfect w/ drink ..loved it", "business_id": "Our6bzte5W1wlIeOu9luug", "stars": 5, "date": "2009-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "RyX1dtn2eACiehBSj7rxEw", "review_id": "117Cy5JuGAAixsRC8XPSWg", "text": "I've been to My Wine Cellar previously & wasn't very impressed with the experience. Since our friends wanted to try it out, we decided to go back. It was not at all busy when we went & were told we could sit at any table. We really wanted to sit outside but were warned that there's a golf course behind the restaurant, thus there is a mosquito problem.\n\nWe grabbed a table & our waiter came to greet us & take our drink order right away. I thought it was disgusting that he acknowledged that there was a mosquito squashed on the page of the menu but gave it to me anyway. I think that it wouldn't have taken much effort to go grab another menu. It was his first day I guess.\n\nWe got the Oatmeal Stout beer & the pink Moscato for drinks and the bistro burger & the salmon cakes for our meal. Both of the food dishes were good. The bistro burger was large & filling and the side of fries was also tasty. I think for the price we paid for the salmon cakes, it would've been nice to get an actual side instead of just the spring greens.\n\nThe service was fine. I've been to wine bars before & enjoyed them more so I doubt we will be back.", "business_id": "Our6bzte5W1wlIeOu9luug", "stars": 2, "date": "2014-10-11", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "jy1qPe0Tz3ewHacAtshmBw", "review_id": "B959c6b2xorBLAOx7He_QQ", "text": "I have been to Ruffino's for drinks a few times, but I cannot believe I waited so long before actually dining here!\n\nI had an INCREDIBLE dinner last night at Ruffino's - Escargot for an Appetizer, Cannelloni for Dinner...and all I can say is \"WOW.\" My first bite of the Cannelloni was like a taste explosion! Very complex flavors. I've only had Escargot once before at Cafe Boa. I don't remember loving it - but I can say I'd definitely order it again now! It's served in a butter/garlic sauce at Ruffino's inside of mushroom caps. Excellent.\n\nI thought the prices were very affordable. It's obvious the pasta is hand made. The sauces are extremely fresh. You get what you pay for!\n\nIt truly is a sophisticated place. Who would guess by the location in a strip mall?? Fresh flowers on the table, great service, live singer on a Wed. night.\n\nClassic. All that was missing was Frank Sinatra sitting in the corner. But the live singer made up for that (on a Wednesday night even!)", "business_id": "S3FhtwXuiGMlGdBNtmiiSQ", "stars": 5, "date": "2009-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3jVMvuQg_uyimNHxOcJIpQ", "review_id": "CuViqy-XsFeWpVnB9DLHPg", "text": "Well so much for the hype of this neighborhood Italian restaurant. The wine I picked was good and then it went downhill from there. I ordered the linguini pasta with clams in a garlic sauce. The noodles were not good and the sauce was tasteless. Waitress brought me a replacement dish and did not charge me for it. They get 4 stars for their effort but two for their cuisine. Need to try harder folks.", "business_id": "S3FhtwXuiGMlGdBNtmiiSQ", "stars": 2, "date": "2015-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "d1jkfRPcA8Vql9khdGDVZA", "review_id": "f6RnWOO1iQjHEDKBet0QDg", "text": "Islands fine burgers and drinks. \n\nWent to islands for lunch with the kids. Very surf inspired decor and kid friendly. The little one had nice looking chicken strips and a questionable apple for only $3.99 including a drink. My older had pasta and salad with a drink for 5.99.  My fiancée and I had the fish tacos 3:5 which were reasonably priced and although not obvious came with unlimited fries. Although I was paying a bit more attention to the kids doing their activity sheet than the menu so it's entirely possible it was on there and I didn't notice. \n\nGood value but nothing memorable for food.", "business_id": "e0vubCKi8KD8zC2C6FdbuQ", "stars": 3, "date": "2015-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Xa_2gGbzR7dWGfm5XH41Aw", "review_id": "Gs3nPpF3QJJKz5f8vAbbYw", "text": "I love this restaurant! I have been coming here for years (I grew up right down the street) and the service and quality of food have always been consistently fantastic. I frequent this restaurant for lunch and happy hour now since it is so close to work. I always try to sit in Nancy's section - she's friendly, takes really great care of her customers and has a lot of great menu recommendations. I have some food allergies and I am a vegetarian and she is always able to find something tasty for me whether it is on the menu or not.", "business_id": "QzXFdjIbFRGhzL83goPPLA", "stars": 5, "date": "2013-11-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "cH1lLTHReO6uDTif9bfOBA", "review_id": "TUPz7Fw9m9fuyrdIu--LLQ", "text": "If you want down to earth American food with relaxing, beer sipping atmosphere, this is it.  We were here after a long active day outside and just wanted a big, hearty meal with beer.  \n\nWe had the following:\nSpicy Honey Mustard + Asiago Permesan Dusted chicken wings - they were really dry and totally over done BUT on a different day, they were very juicy and yummy.....so yeah, depends on the day.\n\nHot Beef and Gravy Sandwich - VERY YUMMY.  This sandwich is so simple, totally easy to make but amazingly great! \n\n*Location = good\n*Food = yummy.  if you want wings, it's hit and miss depending on the day\n*Service = average\n*Price = descent", "business_id": "G7-NoraGlmzwO0sgs4fbmQ", "stars": 3, "date": "2009-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9F3ZmyGKIA6ALNWgEq3Log", "review_id": "O3wfGqfBd4bFk0DsQt_xLw", "text": "This place is an East Valley institution! For starters, they have live music regularly, and they always have an annual show with Melt Banana from Japan, which is always a blast! Sound is awesome, and the cover is reasonable. Drink selection is amazing, and they have a signature drink menu as well. They have a full kitchen, and even offer breakfast starting at 6am! Perfect for those working the graveyard shift. Prices are good and drinks are strong. The decor is awesome, a good mix of pulps and movie posters and the like. All in all a solid neighborhood bar, music venue, and all around fun joint.", "business_id": "Cp5_NSJFNgylD5SUdmT8nQ", "stars": 5, "date": "2012-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GMmqNBQ4_TwOd3ciqq0nJA", "review_id": "vcaH1BG9yzfEgdTcbL5FzQ", "text": "The absolute BEST dive bar in Tempe!", "business_id": "rjjEN8QTMvilB08ImFyMow", "stars": 5, "date": "2014-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8NZeutNJOAw-h_QOd_A9oQ", "review_id": "K0V-b8JTFmwZjSMMBQMWQQ", "text": "Took my wife and two daughters for an afternoon lunch. Waitress was attentive and the food was good and very speedy. Service was good and a fair value for the money spent and time that I was able to spend with my family. Desert was awesome.", "business_id": "zARGEdB0JyPCPR0f3FKGxQ", "stars": 4, "date": "2015-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G5J5Uxi2ufFACmnY68Y_EQ", "review_id": "3a_T8ckVPhwhv5SJCXPWlw", "text": "Fun place, very unique. Obviosly the main feature is the organist and the broad array of aspects of the organ. The organist was phenomenal and could play every request that was given to him. We couldnt believe how many different things he controlled with the gorgeous organ. The cat puppets were creepy.\n\nFood: I would give the pizza a 6/10. The crust was a little crisp for my liking. \n\nSeating: Sit up top in the middle. These seats get taken first and the sides have pillars that slightly block your view, not bad though.\n\nBring CASH ONLY! They don't take cards.", "business_id": "VRxelK__tuQD0KBxx2LzeQ", "stars": 4, "date": "2014-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "kr7GcAXv7F7cAUVWqEiOXg", "review_id": "Mnkovmn52_AEa2HAhCljfQ", "text": "In order to have - as their jingle claims - MORE than just great wings, don't you first need to HAVE great wings? Absolutely awful food, terrible service, and a gross dirty restaurant. \n\nAnd keeping an eye on me, my wife, and my two little girls to make sure we're not watching some stupid MMA thing, otherwise you'll be back to collect your cover charge??? Man, eff all that nonsense. Never again. Ever.", "business_id": "zBGfa6Vx4K59v8OR81gzJg", "stars": 1, "date": "2013-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "il0RS0Zbm580n5JVW4tbxg", "review_id": "_vg1YlZVjPPxRQUHDyvrXg", "text": "We got a to go order for alfredo and spaghetti. The amount of sauce they put in the food was a joke. It literally tasted like noodles with a hint of sauce. We couldn't even save our leftovers because there wasn't enough sauce to save the noodles from becoming dried out and crunchy in the microwave. When a place is charging $15 a plate for a basic pasta dish then they need to step it up a notch. Id love to think this was a one off situation but it's not. Oh, and if you try to ask for more sauce (ie, the normal portion) they'll try to charge you.", "business_id": "bbmuF6LtbP51bk0Ia0p1rw", "stars": 1, "date": "2012-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "NAohdbmsThewbeUkMMBohg", "review_id": "1QrcV7V7-Q1QqVY8QIX77g", "text": "We went for Thanksgiving since no one wanted to cook. All the food was good, service was extremely slow and they weren't busy enough for it to be as slow as it was. Service was good, kept our drinks full. I had prime rib, cooked great, but no any kind of seasoning or spices. The french fries were not good at all, tasted old. The soup was amazing, best part of the meal! Everyone else in our party said same thing, it was ok.", "business_id": "OreqUicD2AP5QW2HblqRoQ", "stars": 3, "date": "2010-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b0Fkf6IVBreUmKkngwsEnA", "review_id": "jnAPiMFAypPf3FL9UROqXA", "text": "My favorite bar in Mesa. Food is AMAZING, it's cheap, staff is awesome, and the mugs are ice cold. Love this bar!", "business_id": "g8ewG8o0ubTUTAUDj7UZLQ", "stars": 5, "date": "2015-11-09", "type": "review"}
