{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7ffOjgAG5au2IyZGLajsmg", "review_id": "WTAweECWSwgq3SppMTw71w", "text": "Fast, friendly service of solid comfort food at a price that won't break the bank. It's good for pre-theater/concert dinners, especially if you want something that's not too fussy.\n\nThe food is fine, though perhaps not as out of this world as the gregarious owner would like you to believe. My moussaka was a tad on the bland side, but it was piping hot and hit the spot on a cold night. The desserts were definitely the highlight. My companions report that the homemade wine was also surprisingly good.\n\n3.5 stars", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2009-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4B5y6hM_JcQTTcNBZvKWBQ", "review_id": "jszo6AzyNtBdIkFuRXv1Ig", "text": "This place looked hopeful for authentic Mediterranean but the food just didn't live up to any expecation. Do yourself a favor and go next door to Cafe Milano.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2010-09-03", "type": "review"}
{"votes": {"funny": 4, "useful": 4, "cool": 2}, "user_id": "nS-iV5EUzdz8_nQVMxF1yQ", "review_id": "n6zkqXGNItEjgSl7YpLAxg", "text": "This place was really gross.  There was no one around when we went in, but we were starving.\n\nThe food wasn't fresh, the dishes were dirty, and I felt like I was going through Pan's Labyrinth to get to the bathroom, which was pretty far away, seemingly in another dimension.  It was almost an adventure.\n\nThere was old black slimy greens in my salad, but at least the watermelon in the salad was good!  I'll give them that!  The olives were even disgusting--how do you mess up olives?  The spanokopita was limp and oily and devoid of much phyllo.  And there were copious bugs flying around our food the whole time we dined.  \n\nWhen we paid, the cashier asked how much of a tip we wanted to leave, and added it directly to the bill  instead of giving us the opportunity to leave our own tip or write it on the restaurant receipt.  The bill was way too high.\n\nIf you really hate someone, you should take them to this restaurant.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2011-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Delkp6rfwHAmSx7PNWDjbg", "review_id": "3CxXuDLkEYEpaw_uhgp_zg", "text": "I crave the Jackie O cake, a must have!!!!", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2012-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UxLpu7cS6o7adHcu3jhmKw", "review_id": "dG0_XoUNgluT5dO2BoKMuw", "text": "The food here is authentic and tasty and the place itself is a gem of kitch. Do not go here if you want a fine dining experience. The servers are odd, but that's part of the experience. The dining room may be cluttered with old photos, objects representing Greek culture and other oddities, but again that's part of the charm. The food is really, really good and I believe it is very well priced for what you get. \n\nThey also have this amazing soup that seems to have magical powers when it comes to curing a cold. Fabulous!", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 4, "date": "2012-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5wTVzr3SyZzpiu-U_Yim6A", "review_id": "rrPRV7n6EFBHgEn49neYsA", "text": "Christos is a cute little place. It's been there for 38 years and I think that it hasn't changed much over the duration.  Sure the place is kitschy, but that's part of the charm.  The antiques and old photos were interesting to me, and there's some nice pieces there. The service is friendly, down to earth, and warm.\n\nThe owner showed me an award for the \"Jackie Onassis cake\" from 2009.\n\nWhile I want to love this place, the food is sub-par.  While the hummus was good (indeed thin as mentioned elsewhere) the Hercules special(lamb, beef, beans over rice) was just so-so.\n\nI want to see this place continue to succeed, but the food quality needs to be turned up a notch if that's going to happen.\n\nI'm rating 2.5 stars, but rounding up for the reasons mentioned.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2012-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hehZdQ-fMtGIislW16S2aQ", "review_id": "_-04xUPPTAuF3h_PaI0bkA", "text": "Christos was one of the worst experiences I've ever had while dining in Pittsburgh. They call this a Greek restaurant but they don't even have a normal gyro on the menu. My boyfriend and I decided to split the platter, which was horrible. The gyro meat wasn't off the spick, the dolmades were the worst thing ever eaten in my life and they charged us 4.00 to split it which we didn't even ask for in the first place. The only pleasant thing about this place was the cook who ended up serving us our food after our waiter went out for what seemed like a drug deal. Over all, everything was bad and I would never return and would advice everyone else to do the same.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2013-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5qx1_UsVr6fW3hetX_rCsA", "review_id": "d31YnJuQAmO4fm3ME3nEHQ", "text": "I really enjoyed Christos! We went to Christos after a show at the Benedum Center and again before a baseball game. The setting is a very cute little greek place, it's a small place. The people that work there/own it are very nice and really want you to enjoy the food, They do stand outside of the restaurant giving menus to try and get you to eat In there, but we did end up trying it and we liked it! The owner told us a story that he actually has cooked food for Jackie O on a cruise ship.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 4, "date": "2014-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5A__s1jIvHoCeKLDbx30cQ", "review_id": "y4GRaRohaW5QmL82JIw0XQ", "text": "Tasteless food. Too slow service. Was waiting for my check about 15 minutes. Dishes were as an ex-USSR buffet taste. Annoying waiter.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 2, "date": "2015-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e7lJwGbdJsrFziQoXKNJ6w", "review_id": "TUln4LB8zxBq7cH0pOiZCg", "text": "Many of the reviews for Christos accurately reflect my experience today. I truly enjoyed the decor, the food tasted good, and it was inexpensive. My lunch was under $7. I had the gyro platter.\n\nThe waiter, who I assume is part of the family, was a bit creepy and kept asking if I wanted something additional like soup. When it came time to pay, I had to walk to the back and get his attention. He then called for another guy, also creepy and who I think is also part of the family, and he figured my bill by looking at my empty plate that was still at my table (which was at the front near the windows.)  He was suspicious that I didn't have more to eat.  At this point I was finding it humorous.\n\nI am glad I went. It was an interesting experience that I won't soon forget.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 4, "date": "2015-09-17", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 0}, "user_id": "xN5GoyD1MnNivisLZqKFqA", "review_id": "EddgcfWhTyORBl5ruCPeyA", "text": "At first I thought the the name of this restaurant was Anal's, so I wasn't really sure about where my brother and his wife were taking me.  I ended up having a terrific meal.  I couldn't even tell you what I ate but I know it was good!  Most of the items on the menu were unknown to me but everything we ordered looked and tasted wonderful.  I recommend trying something different here at Anal's...  I mean Amel's.", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 5, "date": "2007-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Yvn7DHj7o7sSCH2rNH74Mw", "review_id": "Gg8IjcjnD6N4X_tOynLiJg", "text": "As I have mentioned in a few other reviews I use to live in Brookline and this place was a go to from the start. Known as one of the best mediterranean restaurants in town and bragged about but many of the Brookline residents. \n\nMy wife and I went here and they didn't disappoint. Stuffed grapes leaves, braised lamb shank with cracking....Yum Yum Yum. I have not had the chance to try very many things on the menu but everything I have ordered here has been really good. \n\nIf you make it down to the south hills and want some authentic mediterranean cuisine this is the place to be.", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 5, "date": "2012-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5qx1_UsVr6fW3hetX_rCsA", "review_id": "k_80TSuJ8gwcbtMqQFIkGQ", "text": "Amels is a great Mediterranean restaurant! First off, the atmosphere is so cute! The lights are dimmed, there's decorations in purple, orange, green, vibrant colors.The food is so good and the staff is very nice! They have a bar in the front that you can wait at and have drinks well waiting to be seated or waiting for others to meet you there.", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 4, "date": "2014-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "n5xDCeUAqylS6ShVEfQj1Q", "review_id": "JPcXlZlgotUtMbOFmbtLiA", "text": "This restaurant has a lovely atmosphere. It's beautifully decorated. Our server was attentive. We started out with a hummus platter. It was just ok, the pita was pretty dry. I ordered the chicken Romano it was absolutely delicious. The pasta that came with it was also good. I will be back again soon.", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 4, "date": "2014-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KguRJdSr1TraXieI198Ryg", "review_id": "3aH9RxNcR9FImmaIoYJ0Fw", "text": "Great food and my favorite She Crab soup!  Great beer selection and desserts too. Atmosphere is nice too.", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 5, "date": "2014-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wkLqEAvq9GpVvVv1hSvM-Q", "review_id": "2WGbQddJJCbjvOBQz0fc_g", "text": "The food is terrible. We spent over $100 for the two of us. Don't eat any fish/seafood. Got food poisoning from the meals. If I could give zero stars I would. Regretting going to dinner there tonight. Threw up when I got home. Now both ends. Ugh. We both are sick. Food poisoning. Beware!!!!! Terrible food. DO NOT EAT HERE!!!! Disgusting food. This was our third try here. First was great. Second ok. Third terrible. The entrees are horrible. The apps were good but don't eat dinner you'll regret it. So sick right now. Never going back.", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 1, "date": "2015-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lz84cjByDXepRDJo85GM7Q", "review_id": "ZdZmFTadlS8LiN_mr4DXkg", "text": "This used to be one of our favorite restaurants.  We heard it had gone down hill.  Last night we tried it and found that indeed it has. Way down. I ordered the Greek Chicken. All I could taste was lemon.  They must of changed pita suppliers.  The new pitas tasted like a doughy pancake. My wife's dinner was bland. We were there on a gift card that still has another 5 dollars on it and I'm not sure we'll even use it. It was that bad. My hope is that they fix their problems. It used to be great.", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 1, "date": "2015-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wluO0fobDWmmz2cXdWUsDg", "review_id": "a7DptkSzUkQMvJMI7XQu9A", "text": "Great meal! Great service! This was our second choice for the evening, but I've now decided it's my new favorite place!", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 5, "date": "2015-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "_OURyTahjY9pEIj-2-4ueQ", "review_id": "7ZkGon-bfnRMHsBu7P8BJw", "text": "Best Mediterranean in Pittsburgh! Came here with a group of 6 for my birthday and we had a great time. Try the hummus trio!", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 5, "date": "2015-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "71Gnwsn6XGae6n1PEu72ng", "review_id": "Z33KLjObNjuCWJvo28Y37g", "text": "This place is also called the Kabob House. \n\nBasically its a nice restaurant interior with one guy working as hostess, waiter, and a cook.  The place was clean and pleasant but the food was lacking.  \n\nFor the price of $15-22 you get one kabob of meat (7-8 inch by inch cubes), plain rice, and one tomato slice. i thought the food was not bad although my two friends did not like it(keep in mind they were middle eastern). it just wasnt enough food for the price. \n\nI can get past the slow service, but paying that much for so little was a huge disappointment especially after seeing very high marks for this place on citysearch.", "business_id": "UFvogJEUiLSJwyx2LSz2uQ", "stars": 2, "date": "2007-09-25", "type": "review"}
{"votes": {"funny": 1, "useful": 6, "cool": 0}, "user_id": "anMeQc6V4Vr1vxynm9voOw", "review_id": "FLOR7egp4wLrZVvR4MMCUg", "text": "My husband has revoked my Groupon privileges. If this review was just for the food it would be an easy 3 or 3.5 stars. The food was all delicious - we had the sauteed eggplant appetizer, the cucumber/tomato/onion salad, shishkabob dinner and burg dinner (not what I ordered but it was still good.) The rest of the experience was kind of bizarre.\n\nWe arrived early on a Saturday evening and were the only dine-in patrons. There were a few booths in the back corner with patrons smoking hookah but it was nearly empty the entire 90+ minutes we were there. There was also some take-out business at the same time. A host led us to a table near the couches/stage area in the back. I immediately noticed that one of the workers (?) was napping on a couch about 10 feet away. \n\nThe music was just something off the laptop of one of the hookah patrons, mostly obscure rap music.\n\nHere's where things got a little weird. We were completely finished eating and the staff was around fixing some other tables (at this point we're still the only dine in patrons), and then they pull some tables together and the entire staff sits down for dinner in the front of the restaurant. We waited another 20-25 minutes for our waitress to come back and ask if we were finished or wanted dessert. The answer was a resounding no.", "business_id": "UFvogJEUiLSJwyx2LSz2uQ", "stars": 2, "date": "2014-11-24", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "wPmrjeDshlkS7TacuInQtQ", "review_id": "gACpW6uV9ZKJzAOGqVszpg", "text": "I've been lamenting the lack of Mediterranean establishments on the Eastside for a while. We have arguably the best Thai, Indian, Nepali, Jamaican, Japanese, Chinese and American restaurants in town. But Downtown and the Westside both hold the Mediterranean trump card.\n\nThen I discovered People's Bakery. How can you go wrong? Fresh pastry AND gyros? Wait. Did I say gyros? Yes, I did. No longer do you have to venture downtown to get said sandwich. And the one I had wasn't a ticking grease bomb!\n\nDo yourself a favor when you go and try the red lentil soup. The flavor is excellent and there's plenty of cumin to spare. Delicious! My gyro and bowl of soup plus coffee was under $10, so it's a great choice when you're low on cash and need a filling lunch.\n\n(Oh, and it's right next to El Pescador, across from the Madison East Shopping Center. Pretty easy to miss when driving.)", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2009-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z3uWp25_a0to6p7meH3sWw", "review_id": "Ati4o3Hp7FbfUZegQwQMew", "text": "I'm in love with gyros, and have been to all the places that server gyros within 25 miles of here.  This place has by far my favorite gyros in this area.  It is also the cheapest too!  As far as pastries, I really love their doughnuts and their baklava.  I've never had a bad experience here, and have gone maybe 20 times or so.  It's just one of my favorite places to eat around Madison.\n\nThe people that work there (I assume the owners), are super super nice.  I'm pretty cheap, and don't usually tip over-the-counter service, but I always tip here because they are so nice!", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2010-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "uxLef8dQeOE5puaQ-pvbsw", "review_id": "UFfi2Hmy-Vde9fADiriDKw", "text": "wasn't sure what to expect, but the food was EXCELLENT.  personal service from the husband & wife owners make you feel right at home.  the tabouleh and hommos definitely rival anyplace i've ever tried.  they actually make the tabouleh to order!!!  incredibly fresh and delicious.  delicious baklava!  and, although i didn't try any, the donuts also looked amazing.  might have to stop back and pick up a dozen, for the road.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2012-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 3}, "user_id": "Ffa864LL90s6oxImKPI7pw", "review_id": "h1HWUCVx9aJup0aGE4VaFw", "text": "Went for dinner the other night. We have found our new gyro restaurant!\nHubby & I both ordered gyro. One sammy, one plate. Man, was it good!\nTook a raspberry fritter home for dessert, and that was great as well.\nWe will definitely be back!", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2013-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "B_UefrVB5Xw2X1WRZPRkbw", "review_id": "DOrdwtt93Au4VBoPRrKxzQ", "text": "Living 1 block away is dangerous! This is a hidden treasure for sure. The owners are a sweet older couple who knock out some amazing food. Can't speak for the donuts but I promise you will enjoy the food. The falafel with fries is a bargain--5 bucks or so--and it will be made totally fresh for you. My go to I don't feel like cooking spot.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2013-10-24", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "03vp3tenQ0aQOr0AE5j8Uw", "review_id": "PHAZhZLjfe1ttUtXmyPB6A", "text": "What do you get when you combine Lebanese cuisine, baked goods, gyros, funky interior design and second hand talk of bed bugs?  \n\nThe perfect #yelpnewvember storm, that's what.\n\nOver the summer, there was a spirited debate about where to find the best gyros in town after the unfortunate demise of Dmitri's.  After fellow Yelper Tawnie R boldly declared the People's Bakery as the worthy successor to Dimitri's, I knew a trip to the People's Bakery was in the cards for me.\n\nIf you are looking for elegant digs, this place is not for you.  It's a kitschy, little greasy spoon nestled into a strip mall at the corner of East Wash and East Johnson.  There's not a lot of seating and if someone is on the phone, you're going to be privy to their conversation.  In my case, I got a comprehensive update on a bedbug infestation of a family member that the owner's wife was describing in painstaking detail.  And while the chairs and tables are mismatched and the floor tiles are coming loose in places, the eating surfaces were all impeccably clean and the pictures on the wall gave the joint a homey feel.  And the husband and wife team that run the place have a great rapport with the regular customers getting their lunch fix. \n\nI ordered the $5.50 gyros and fries and grabbed a seat.  About ten minutes later, a massive foil wrapped gyros was delivered to my table.  I swear that an entire herd of sheep were sacrificed for this meal.  In terms of quantity, the People's Bakery delivered big time.  \n\nOn the quality side, things were a little less clear cut. First the negatives:\n* The next time I visit, I'm going to ask to have the pita spend a little time on the grill.  This dish deserves better than a cold, doughy pita.\n* More tzatziki sauce please!!!  When you give me a metric ton of lamb meat, I need more than a tablespoon of sauce to balance out the dish.\n* The same can be said of the tomatoes.  I need more than two very thinly cut slices.\n\nNow the positives:\n* The meat was served piping hot, moist and well seasoned.  It was clear this meat wasn't sitting under a heat lamp awaiting the lunch time crush.  The only thing I would have changed is to have a little char on some of the pieces to provide more textural contrast.\n* The onions served with the dish were pure awesomeness.  I'll be honest, I usually pick most of the onions off my gyros because they can overpower the other ingredients with their sulfuric pungency.  With a medium dice, these onions were fresh and sweet and complemented each bite.\n* I l-o-v-e-d the fries that accompanied the meal.  Salty and crunchy on the outside and hot and moist on the outside.   Yummmmmm.\n\nSo, does the People's Bakery unseat Trader Gus as my King of Madison Gyros.  I say it's too close to call right now.  What I do know is that I plan to return to the People's Bakery to conduct more extensive research.  And if you find yourself on the east side with an empty stomach and a light wallet, People's Bakery is an option worth considering.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2013-11-16", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "uLF25xKZvkCJv2X98E5-pg", "review_id": "yNA5tBHK8zPep-VSrwSuXg", "text": "They are the best. Great flavor, it can not get more mom and pop, the owners are great the only issue I see us that it  is hard to stop eating them", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2014-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "ocUayw1Ih7W_mHSR1RDdGA", "review_id": "EYdsdhpEKAqJ3M2GZZUgjQ", "text": "I can tell by the way it tastes that the falafel sandwich, baba ganoush and tabbouleh are totally vegan, and delicious too. I didn't bother asking them about ingredients because it's so obvious.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2014-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "5akrRpgnj3l_ia16gr0gHQ", "review_id": "TxROeiV9klqnL5sOIxu4Qw", "text": "Great donuts topped off a tasty meal. A little hard to find but like Arnold I'll be back.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2015-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "faACrzLJR0tK0ZqHi2jEuA", "review_id": "OL6ibnYk5-utLyrjzeibcw", "text": "A great couple who serve great middle eastern ethnic cuisine. I just bought a bunch of baklavas for my office potluck for a great price. \nEven though the decor and all is pretty modest, a true food lover will love this place", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2015-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "O0lAQazaL-veJv8FCux37Q", "review_id": "MZR2KiYUrK8xLPBl6BURuA", "text": "Yelp and the restaurant itself states that this establishment is open until 8 pm. So I was confused and disappointed that they were closed when I pulled up shortly after 7:30 pm. Lights were out, nobody home. Hmmmm... \nHopefully I can update my rating in the future :(", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 1, "date": "2015-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tErZ7bb0z19ToDTCyhCg6g", "review_id": "1TuW-90QJWzv3mCeDM3pHQ", "text": "Great food, great place to get together with friends, great prices! Don't be intimidated by the owner... He might come off as anti-social but he is a nice guy once you get to know him. Give the place a shot... You won't regret it! I personally love the falafal!", "business_id": "-1oj6-fkP-iO6OyW8QBqPg", "stars": 5, "date": "2010-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "wZ2B3_9CiWUQCd6hS156Tw", "review_id": "GVxb_qO_cUNmCwAH1WU1VA", "text": "Wonderful hummus and everything else, too!  Take your chances with the plate of a day, it's a bargain and an adventure!  And you'll get delightful hummus, pita, salad and rice along with the special items of the day.  The service can be a little slow since it's ONE MAN running the show but he takes his time with each person's order and serves up tasty plates!  The Arabian tea is also delish!", "business_id": "-1oj6-fkP-iO6OyW8QBqPg", "stars": 5, "date": "2011-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "SBQYD580gsDXAa9eTpKEIg", "review_id": "jcKaFUJcXS6lDRMnpUNc_w", "text": "The food is quite good and reasonable. It can get busy at lunch and the owner does seem a bit frustrated at times, but he is always very kind and gracious. I love giving him the business and I love the taste of his food! I give it 4 stars because service can be hit or miss.", "business_id": "-1oj6-fkP-iO6OyW8QBqPg", "stars": 4, "date": "2011-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XzIKZTb4I-7wW4BjKwV2Mw", "review_id": "SlaylkPuX6Mw1GMFkGVD7w", "text": "I'm new to the area and wanted to try the local middle eastern cuisine, as back home I am blessed with a nice variety of it in the southwest suburbs.\n\nI went into the (just about empty) Jerusalem Restaurant and looked over the menu before being silently greeted by the notorious owner. I stepped up to order and he turned his back, apparently cooking someone else's food. I patiently waited and eventually ordered the daily special of kufta, salad and hummus. \n\nAfter observing my meal being cooked and assembled, I dashed home to try it.\n\nI opened up everything and was initially let down by the quantity I received for about $9. \n\nI started with the salad which looked to be a combination of many different vegetables including onions, celery, carrots, spices and a couple of other unrecognizable things. Even though there was a large array of different ingredients for this salad, it was unbelievably bland and some of the vegetables pretty hard in consistency. I couldn't figure out why, there was some kind of a dressing on it, but it wasn't much more than some type of oil, maybe a really light olive? I'm not sure. It then occurred to me that this salad was probably sitting for a very long time before I had eaten it. I wouldn't get it again.\n\nNext, my order came with Kufta (lamb & beef), 2 pitas and a very small dollop of hummus. The Kufta had a pretty unique flavor to it that I did like, but the quality of the meat was fair, at best. The pitas were decent but by far the best part of my dinner was the hummus. The hummus had a very nice taste and was complemented well by a splash of olive oil. It was not bland and definitely the highlight of my meal.\n\nOverall, I was disappointed having spent almost $. The portion size wasn't much, and the starch (pita) is really what filled me up.\n\nI will be back in sometime just to try something else and see if my review is consistent for all the food, rather than just what I had. This place has a variety of options and maybe I just picked the wrong one.", "business_id": "-1oj6-fkP-iO6OyW8QBqPg", "stars": 2, "date": "2014-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3NU4UJWlsVIl6kSYouaFxA", "review_id": "kvWmu20jws-h4j3B3QCBZA", "text": "I knew the reputation of this place going in but I am a sucker for homemade falafel, pea soup, Turkish coffee and hummus so I went in anyway. My mistake. The old man at the counter ignored me for a while, which I'm used to being Eastern European, and when it came time to talk to me he managed to treat me very well compared to the previous, male, customer whom he ushered away without a word. Again, I don't care about customer service too much but after getting the vegetarian \"special\" and ordering the Turkish coffee to go I saw the old man throw a bunch of bread in the microwave. He continued to \"cook\" the rest of my food mainly by reheating things and frying precooked and frozen falafel. After this, he proceeded to make and overfill a very bad cup of Turkish coffee for me too. Basically, the falafel was the same as the frozen falafel you can buy at  a store, because that's what it seemingly was, the bread was tasteless, the hummus more bitter than the Russian cold and the coffee tasted like the 1970's. The old man tried his best, I am sure, but the food was sad like my soul after visiting this \"restaurant\".", "business_id": "-1oj6-fkP-iO6OyW8QBqPg", "stars": 2, "date": "2015-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_vrM_zDVYvarcRTNvE0cAw", "review_id": "jEI-PLf-iZ44XQfpiko5HA", "text": "I entered, ordered at the counter, and only then did I look around and notice every single person had ordered the special that comes with hummus, salad, and chicken. Every one of them. Wish I had noticed that before I ordered the lamb kebab. \n\nThe food itself was the only disappointing part of my experience at Jerusalem. The lamb kebab was a decent sized portion - not at all generous, but totally within the realm of \"decent\". The flavor, and particularly the texture, of the kebab was a totally different story. It was somewhere between \"acceptable\" and \"gross\" and possibly the worst kebab I've ever had.\n\nIt is worth mentioning that I didn't have the same experience other reviewers had with the owner. He was not at all rude. I hadn't even decided yet before he asked if I was ready to order, and he gave me all the time I needed to read the menu. The decor that other reviewers complained about is unpretentious and perfectly fine by me. There's absolutely nothing wrong with the place except the kebab. I do want to return to try the special - it looked like lots more food for the price. I will update this review if I have an experience that changes my opinion, but for now, I'm giving this place a solid \"meh\".", "business_id": "-1oj6-fkP-iO6OyW8QBqPg", "stars": 2, "date": "2015-11-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "6hRKotVFPYL7Ci0hipN9Eg", "review_id": "Aw_-qCBXaOjVO0Jl3Cylzg", "text": "Yusef's has to be the largest and cleanest, most organized Middle Eastern markets that I have been to in PHX. Stopped by here over the weekend and was really impressed by the selection and size of the groceries. If you're looking for anything Middle Eastern, you'll find it here. Their hummus is heavy on tahini; the baba ganoush is very good. Haven't sampled their food, but after my overall experience, the Vegetarian Combo is calling my name. Only downside is that they sell premade pitas, which are very generic.", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 3, "date": "2008-11-11", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "3vML-LnH0dIyHCrqF5xEYw", "review_id": "IbZa5ZqgjP-iRPm2Xo2h3Q", "text": "I've been coming to Yusefs now for awhile to get gyro meat to go, along with their fresh feta, pitas and cucumber yogurt. BEST I'VE HAD! Finally I was able to eat there as they have a kitchen and OMG, it was delis and the prices are fabulous. I ordered the lentil soup and holy cow, it was UNREAL! I got the gyro plate with gyro meat and fresh rice (basmati?) and it was fabulous. Gyro Greek salad was amazing too. I love coming here because the owner is nice and very sweet!!!!!\n\nI recommend you try this little gem!! It's worth the drive!", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 5, "date": "2010-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "1ii-xwjzYfupBvYsiC5EJg", "review_id": "Mhw1-0uHPMDx2NJqQSdeuw", "text": "All I can say is WOW! I have not found filafel this good since moving back home to az. They have all the traditional favorites, boba ganoush (which is EXCELLENT) humos, fattoush, tahini, salads and pretty much everything else. the grocery is stocked full of amazing things.. sauces and spreads, 'pickled' veggies of all kinds , exotic jams, jellies and honies, breads, meats and cheeses, candies, pastries, even found my beloved persian cucumbers :} they also carry a vast assortment of spices and marinades. i LOVE this place. The owner is very nice. I ordered a filafel (they have the GOOD kind, nice and FRESH and green inside like theyre SUPPOSED to be) wrap with sides of humus and boba and it was perfect even down to the nice ripe tomatoes. AND the prices are decent. I highly recomend this place", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 5, "date": "2011-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KLekdmo4FdNnP0huUhzZNw", "review_id": "JQDt6gFlLr8pwj6l-tSSXw", "text": "Alli can say is thank God they changed owners. The new owner is fantastic. Nice. Helpful. Smiles too!!! Plus they have all the goodies I need. The string cheese. The bulghur pilaf. The salted pumpkin seeds. And the Persian cucumbers. My new favorite!", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 5, "date": "2011-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mP56azLj1LuESpwTLNBfxg", "review_id": "ue98Z0GYkq2HVMyOEgd2Kg", "text": "Very tasty and friendly service at the market. Picked up some fresh ground Turkish coffee while there.", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 4, "date": "2013-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WPXEos5Hw5LN3HeOkC7tlA", "review_id": "V6s6QlyyBVywSMctF9IJng", "text": "Best hummus and baclava in town, great for take away on movie night. Freshly made tabuli is very good", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 4, "date": "2015-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iPyKkZQbYE7n0rrcw4_2Mg", "review_id": "wwO4FXIEp5bqj2WQ8u50LA", "text": "Stopped by for lunch a while back and everything was excellent. I will be coming back when I'm in the neighborhood!", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 5, "date": "2015-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hnirQYfI4cjrzSMENyQTWw", "review_id": "yo-yGBHDuWvu89WkQ3r_ow", "text": "Princess is great if you're in the area and are looking for a quick, really cheap middle-eastern bite. It's a small grocery store with a small counter in the back where you can order snacks, pita sandwiches and cheese and olives. It's also a great place to go for spices, teas and other middle eastern cooking supplies.\nI come for the Al-Wazah tea, which my Saudi friend always used to make. Also, for lunch (it's not too far from my work) I like getting a mix of grape leaves, falafel and hummus. Their hummus is OK but the baba ganoush is actually pretty good. \nThey have a lunch buffet, too, but I haven't been adventurous enough to try it, especially since I'm a vegetarian and most of the food seems meaty... \nThe place is also stocked with hookahs and other things, like calling cards and Quran-alarm clocks.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 3, "date": "2007-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "LHQ2fuC2RDS-Md_dN2O1IQ", "review_id": "WyFvktoixP0kOHtYb3H6Ng", "text": "This is a hole-in-the-wall type restaurant. Its part of a market/grocery store as everyone else has already noted. Its a little hidden, and I think that hurts this place a little bit.\n\nAnyways, the food is VERY good. The chicken shawarma is probably some of the best I have ever had. Hummus, yellow rice, and couscous also go very well with the food. There is the garlic-butter sauce that comes with the shawarma and kabobs, and that REALLY makes the food that much better. Gyro plate is also very commendable, but its hard to get this wrong since the gyro comes on a huge slab and rotates on a rotisserie. Yet, a lot of places do get the gyro plate wrong. I think this place does a good job of heating up the gyro meat on the rotisserie and then the grill.\n\nBaklava also deserves a mention. Its damn good. You can get some exotic mediterranean stuff like olives and feta cheese by the pound, i love that stuff.\n\nThe pricing of this place along with the good quality food makes this place a hidden gem. Its like $8 for almost any plate you'd want. Its plenty of food per plate, and for under $20 for 2 people, its worth a visit. Its very easy to compare this stuff to haji baba, its a tough pick. However, I think the hummus here tastes much better, it doesn't taste like its straight out of a can. The plates here I think are a better deal. If you just want a gyro sandwich, then go to haji baba.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2010-11-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "-q0RFaCkmT6TFxgk0a9dPw", "review_id": "dp5xZ6AezOHcZW61sdEwWg", "text": "I read one of the reviews below, and I would have to agree with the getting sick to the stomach part. It was not fun, thus, the 3 stars. But then again maybe it has something to do with trying out a different cuisine? Me and my buddy at work would come here at least once a week for lunch for the past couple of months now and I got sick to my stomach maybe twice or three times....But because the food is good, I blame that to being adventurous on foods....\n\nAnyway, I had chicken shawarma sandwich it was only $3.99 and I would say a really great value. To me it's better than the beef shawarma. It always tastes goooood. I often have it with garlic paste. Leaves your mouth pungent tasting and dry but  just chew gum when you go back to work or eat fruits.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 3, "date": "2011-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kJyR4gT1pfCcNjEY9-YMoQ", "review_id": "ZuBC9_aO4aqiZ6c60IZSEA", "text": "service for us was very pleasant when she was there which was very little BUT the food is excellent baba ganouch  excellent hummus a little pasty falafal the best gyro perfect dolmathes  yummy as well", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2013-09-02", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "WESBNCIvswTWh-Ak2uGf4g", "review_id": "Rl9OWIXglhIodvYxXrLNMg", "text": "So my classmates family owns this place but by no means is this review biased...the food really is good! Just look at all the reviews!\n\nStopped by here recently on my way to Ikea. My favorite items are the chicken shwarma, hummus, baba ganoush, gyros, and falafel and sambusas. I need to try their lamb stew next time, it looks amazing. Definitely check out the market itself, I always pick up some spices, tea, and pita, but they also have some cooking utensils and frozen foods. The only thing I wish they had was halal meat but no butcher shop here :/ The food is worth the trip from Glendale!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2013-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Nh2vaTapbBWBDYDS_gXPfQ", "review_id": "F81qMnslA8AQEp1Izf19zA", "text": "It's very good food ,, I love it and I will come back here every time I come to AZ .. Ppl work here very nice too", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2013-09-15", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "hBKgLtiPN4bWWI-_Kb1-mw", "review_id": "WA-RyUmLd0tRg6a0UhjEpw", "text": "Almost easy to miss, in a strip mall right before the 101 freeway.  Dining area is clean, staff is very friendly. We ordered the princess combo which comes with chicken shawerma, beef shawerma, chicken and beef kabob, rice, hummus and salad. All the meat was very good, cooked to perfection and seasoned perfectly. Hummus was excellent. We also tried the falafel which I loved, perfect recipe and cooked perfectly. There's a market inside so you can shop after you eat. All in all, it was a great lunch experience.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2013-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kjjezFBacP0iAMv6ep-F9g", "review_id": "_aizoovrTy-TWwYtLABVNA", "text": "Forgot to mention the Prices are great & just had the baklava yummm to die for delicious !", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2013-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Iup_gn6VhdzlCHCu4VJW_A", "review_id": "ZIr9JR5cPz3QMU94JXznag", "text": "I'm incredibly impressed by this deli. THE best Mediterranean food I've had in Tempe. The hummus was light, fluffy and scrumptious, and their beef, lamb and chicken platters are my go-to college dinners (and they're healthy!!) Do not hesitate to try their baklava, for it will be one one of the greatest decisions of your day! \nThe staff is always happy to see me, and have a casual conversation. The store also has a wide variety of groceries to buy! Could spend a good hour or two browsing.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2013-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "iSZnocss-_twC8mh-rZg6g", "review_id": "OmHdviyJRKHl1DgUbuWQBA", "text": "Best Mediterranean food in the area with great service. I have Celiacs and can eat here! Their Lentil soup and Greek salad is delicious. Their coffee is a heavenly treat. My favorite lunch place in the valley!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2013-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "ahJLpA_HOw7jirf18anovA", "review_id": "HoLWW6N7Up13DiMNkLT0nA", "text": "Best food ever!! The falafel is the best in town, crispy outside and nice and moist inside. I also had the chicken shawarma entree, super yummy!! Everything is fresh, great customer service. It's family owned. You can't go wrong with this place at all, a must try!!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2013-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "pVSV--iThCn_D_kxydBvBw", "review_id": "MA_f5nlXv12tQsD0g_gVEg", "text": "Best midetterianian food\nGreat kabab\nGreat hommus\nGreat service\nCons: it took long time", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2013-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4dqGgGCSBGatAU__Db-BXA", "review_id": "uTk7LHs1J9fpISdot8IDcg", "text": "Absolutely delicious food... the employees are SO friendly & welcoming... true, genuine mediterranean meals. The atmosphere is wonderful, as well. Service is consistently great. I would definitely recommend Princess to anyone!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2013-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_e6OtwmE1c6PyD_DhMTWOg", "review_id": "-BxWgyFLWdRvvqDVlWp0IQ", "text": "This place is one of the best hidden gems in Arizona. It is very unassuming but the food is unbelievable. They have the best falafel I have eaten anywhere and their Arabic side salad is the best side on their menu. The kabobs and gyros are also delicious and the price is ridiculously low for what you get. Great family run place, don't let the exterior chase you away, you won't regret going in.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2013-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dTRuJVWSf901PSEzA9gKYw", "review_id": "yxbYvGulMGmLIL22Aecr4w", "text": "We stopped here after some business in Mesa.  We were looking for a snack, Yelped it, and boom.  Mediterranean it was.  Had falafel sandwiches which were AWESOME.  Fresh, crispy falafel (not warmed over) in homemade pita bread. Perfect size.  I eyed the buffet and other offerings.  It all looked and smelled great.  Awesome specialty grocery items.  Don't be intimidated or put off by the looks.  It's a DELI not a high dining experience.  And it is a great deli.  I will be back.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2013-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DOJM58OkGSsIdk2qCUZnLQ", "review_id": "4tULJurbX-tx2HQbUGpO8g", "text": "The food here is pretty amazing. The service, not so much, is very slow. I might not go here for lunch anymore unless it was take out. But the food alone keeps me a fan! Then you can stock up on whatever Mediterranean items you need in the attached market!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2013-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 4}, "user_id": "XeoAojoz5johV2MQ5ngNig", "review_id": "Jpuxc0wdV29xhb6xx7Gk-w", "text": "It's about time i got this review posted considering I have been eating lunch here at least once a week since I was told how close to work this was.\n\nThe food here is really good and fresh. I am a huge fan of middle eastern cuisine and I was surprised they had one of my favorites, kafta, on the menu. The kofta here is great it gets a nice light char from the grill on the outside but is still juicy and tender on the inside. I love it. The fact that the platter is only $8 and comes with rice, hummus and salad is a deal I can't pass up.\n\nThose who know me know that I am picky on what hummus I enjoy since i have been making my own for almost 20 years. The hummus here is the rare exception to my normal rule that I don't like the super smooth and creamy hummus. I am not sure what exactly it is but I like it here.\n\nFor lunch I usually get the tabouli instead of the salad as my second side. It's really fresh and has a nice bite to it. I usually mix it with some hummus and apply to pita bread as the flavors work well together.\n\nAs for other things on the menu I have sampled most of their range of baklava thanks to the great yelp check in deal they had. I really liked the walnut but usually I will just look into the case and point at whatever looks good. That plan hasn't left me disappointed yet so I think I will stick with it. For entree's the chicken shwarma is my second favorite, the garlic sauce really makes this dish; the beef shawarma is pretty tasty but I have a hard time passing over the chicken for this one.\n\nThe staff is friendly and I can't find a negative thing to say about this place. Check it out and you will be happy you did.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2013-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QNuKebSaAD-ycWvaXL1G3A", "review_id": "6wcOKAqswlI5WbOozFHXpw", "text": "Iv been coming here on and off for a couple of years so that should tell you what kind of a restaurant it is, you wouldn't come out of your way to come here but if you happen to be closer by and are craving some Arabic/med/greek food then this place is pretty good. Portions are a bit on the small side, which is unusual for the kind of restaurant that it is. What pisses me off is that the don't have unlimited lamb shanks in their buffet anymore, which kinda defeats the purpose of a buffet. Now you can only get one per buffet, and it was the only thing that you could convince your brain to cough up 10 something bucks for the other things are ehh. You're better off ordering something from their menu, the things on there are actually good.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 3, "date": "2013-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "IjvUOPwgPKhDDrGNkg8Jig", "review_id": "DTdw4WyjiQJP6EYKD2p3ww", "text": "This place was pretty good not bad in price either. I purchased a gyro sandwich and it was pretty good. Good flavors, a bit dry on the meat and pita. I would come back for another. \nStaff: was nice \nStore: was interesting to check out a different culture of foods and shopping. Clean place.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2013-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hm0BPcvaRl1jyJ-E8VnT3w", "review_id": "kfXQoOxIVryKuG7bmUiV3w", "text": "Awesome gyros! I visited this place and came back for more two times more in about 1 1/2 weeks. The gyros are very good and at $4 you can buy 2. The fries are also very good. I'm bummed that I moved to san tan valley b/c I cannot drive to mesa regularly due to gas prices. But if I lived close by , I would be at Princess every week getting a gyro.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2013-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LL5VZd-Hy3BQrLUypv6fNw", "review_id": "XVFMrxwCdXnYWzL1_4nHFg", "text": "We stopped in after seeing the sign on the road about Princess Mediterranean, Gyro etc.   We circled the parking lot twice to see if anyone was in there.  This is not our area of town, we were there shopping nearby.  Anyway, you walk into a nice market, then turn right and there is a good size area for full service dining.  We ordered the chicken shwarma and another meat sandwich (boyfriend ordered it, can't remember the name).  They were both delicious.  The service was incredibly friendly and welcoming.  You think it's just a store at first then turn right and it's full service dining.  We got a free baklava which tasted sooo soo good. It was fun to shop around after eating as well, many spices and new things to see.  I would eat there again for sure.  Our waitress was super nice and the food was delicious.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2014-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RfP030Tmj-1tIP00gnsp-A", "review_id": "1wbTh8yPCIWSXMw46BFGeA", "text": "best food in town without even thinking", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2014-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JUjVkfxCZOTwLnm4WZHMVw", "review_id": "jqjQ2L7RPWSo_MCiUfp7RA", "text": "Honestly the best Mediterranean in all of AZ and this is not written flippantly as I've had a lot all over the valley! The food is amazing, the portions are perfect, and the prices are more than fair! Also.... SHOUT OUT TO DEENA!!! This wonderful young woman is an absolute angle and will take great care of you! Great service!!!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2014-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DKmuaOAGPTcDlNb5goNPpQ", "review_id": "_1tU1nzg_HswQE3P2-tbyg", "text": "I love little spots like this! They have delicious authentic Mediterranean food. The staff is very attentive and friendly. They also have a little market inside where you can do some shopping. I've been here before and will continue to come when I'm in the area.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2014-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1unkO12GyhgTFnC6hRlEVA", "review_id": "dfCgITY-4jC6qerY47BX9w", "text": "It's hard to please a Lebanese person when it comes to eating this kind of Food because we always compare it to our mom's cooking. This said, sorry mom, but this place is legit!\nThe chicken kabab is great, perfectly marinated and cooked. Tabouli is well balanced. Hummus and Baba are just right.\nEat here and you'll be pleased.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2014-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fSsvZJNMgHZT363s27_QWQ", "review_id": "deeKabN-AdMg3xsZuVS27A", "text": "Only gave it 4 stars NOT because of the food because it was 'incredible'Just wish it was nicer inside broken floor tiles ect . Staff was very friendly place seemed to be clean. As I sad food was great .", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NmlEJWaYBj7s28IH12pUpQ", "review_id": "Y86c5ncoTMZ7lWu2MWxOjQ", "text": "My first time trying Mediterranean and I loved it! Hyatt was one of the best servers I've ever had and she was SUPER helpful with recommending what to get. If you have the chance, I highly recommend!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "N7T6hOunTPxLk2AiWrQEmg", "review_id": "k9oh7A-kpdIaCEQ1alUsBA", "text": "These guys are awesome.  Super cool little ethnic grocery store inside as well as a great restaurant.  We've enjoyed several items on the menu and visited many times.  Service and food has always been great!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3nSTAdxlKHa9FzYp5RZThQ", "review_id": "qDwxnfKNTxehfUIhDjY7TA", "text": "First visit today for an early dinner with the wife.Had the falafel and the babaganoosh for an app,and chicken swarma plate for an entree.The wife had the kofta plate for dinner.The swarma w/garlic sauce was fantastic and the falafel was the best I've had anywhere.A nice quiet place to eat with a nice market.Thanks to Sam for making our visit very enjoyable.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "gcl-qCpouRKl6cIc_c_fqA", "review_id": "kx67tnIv_U1DiG-GE8vMcA", "text": "We discovered Princess Mediterranean via Groupon, and became devoted fans from our first dinner experience. PM is a combo restaurant-grocery, and there is plenty for everyone to go around.\n\nFirst, the restaurant. Bring a friend or two and on your first visit try the Princess Combo, which could easily satisfy three hungry diners. It comes with delicious chicken kabab, beef kabab, kofta kabab, chicken shawarma, and beef shawarma -- all of which you can order off the menu, as well. The toughest part is selecting your sides. The Arabic salad is my favorite, but the hummus and other options are delicious too. The service is super-friendly and if you go more than once, you're likely to be remembered. If there is any room for improvement, the iced tea (another addiction of ours) could use a little work -- but the food is so incredibly delicious (emphasis on INCREDIBLE!), it's a minor afterthought.\n\nAs for the grocery, there are countless treats to be found here, from spices to candies to foodstuffs guaranteed to make your mouth water. However, before you go pay your bill at the register, a MUST-DO is the baklava and namura (coconut cake) counter in the back. It's just about the very best I've ever, ever tasted -- and these sweet treats alone might keep you coming back again and again and again.\n\nIf Yelp allowed a 6-star rating, PM would get it from me. Go. Go now. You deserve it!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m2ddMbPm-WKiySHw_Fa_Ig", "review_id": "5u4FLIpyNgxNGarTxJijAA", "text": "I was curious what the hype was all about. Unfortunately, I was pretty disappointed with the dry chicken shawarma plate which took 30 minutes to show up on my table after the order was placed. The waitress was kind enough to give me some baklava for free to make up for the long wait! but I would seriously re-consider returning to this restaurant during peak hours.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 3, "date": "2015-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XPRaTqwOuKWTyYJu6Nf8Qw", "review_id": "zvX3zGWOGKsvaVZXQXy5bw", "text": "Great food and service from hyatt! I had the kabob platter. The beef, chicken, and kofta kabobs were all tender and tasty. Sides of hummus and baba ganoush were perfect complements. I didn't have time to check out the market but seems like there are plenty of things to take home as well.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "v3KrsQepT_bpBWBFsmDtOA", "review_id": "dqfsyBtFqUCSG72Z_nrCeg", "text": "Found this place on Groupon, was disappointed the groupon wasn't good for lunch AND dinner, but ate there anyway. DELICIOUS! The falafel & hummus are amazing, and the market sells the falafel mix to take home and do it yourself. It's a very very casual place, more of a market than a restaurant, but after eating there you want to go buy groceries and make your own Mediterranean food at home! I bought some cold brew lemon & lime tea that is to die for. Anyway, back to the restaurant- the meat was seasoned and cooked to perfection (they sell the seasoning too) and the rice was - oh heck everything was great! Just go there and try the sampler dinners so you get a little taste of everything!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XQW-vtMsP4PeazLsItC7Ag", "review_id": "XjqUmKc5olc2sCjA_qDRSA", "text": "it was ok", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 2, "date": "2015-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L2uBgbc8EqURu3FJApX5mg", "review_id": "GZ4HB9mIPLl4NfDqQZJ5tg", "text": "Ordered thru Yelp for pickup and it was all ready to go 10 minutes after I ordered. Very friendly staff. As for the food, very good authentic dishes. I try all kinds of hummus and theirs had great texture and flavor! Also had the fatoosh salad which was excellent. Definitely recommend and will be returning plenty of times.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wEGyIcy81iEU34vp4Fyu0Q", "review_id": "CJ06DxUJYedc_3u667FkQw", "text": "Very friendly and awesome staff! We were curious about trying a different cultural food... and this place was not disappointing. A must try at least once. Gyro sandwich is delicious! Prices are reasonable and portions are good. Try the coconut dessert!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bka2IvZvdNQArDw3ehPy8Q", "review_id": "OM_tYyuz_8HJ4cszvzlKMw", "text": "Food is tasty! It's not the best shank I had but successful! Having side dish options is awesome. Ambiance is not up to the mark because it's half restaurant and half market. Rest room is really clean ( I was not expecting this ) We purchased some food form the market section and found some internationally well know brands. Paying $ 8-11 for person is affordable for a meal.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6haRx3OHULNCP_nLQ68USQ", "review_id": "6V3WaYAqLVYru8jDuKlgmQ", "text": "The food here was amazingly good,  and prices were very fair for the portion of food offered. The gyro sandwich was very large and flavorful.  The meat was extremely tender and well spiced.  This was probably the best gyro I'v eaten in a long time. Also ordered the combo kabob platter.  The grilled meat tasted very authentic and the hummus was very good as well.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8KKUnoYOGRs8nMQLbwoFfA", "review_id": "XpHB7KeISYVeAFJXlc367Q", "text": "Really enjoyed the Falafel sandwich, but the Greek salad was ok I've had better. The market has some great spices that I picked up. Will definitely be back. Never would have found without Yelp!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-10-25", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "vy0nm2MYGayJ2JcRtfaWxg", "review_id": "ya1E079jFR57TszXg2ZRLA", "text": "Both times I have done the Princess Combo for 2 ($22) and it is always fantastic. Takes me back to my days living in Saudi Arabia and Dubai. The service is always fast, the food always tasty. The hummus is on point, and the rice is great- but what keeps me coming back are the perfectly seasoned and cooked meats. Always juicy and cooked to perfection. all the kabobs are amazing, the beef and chicken shawarma are great, and don;t forget that garlic sauce. Also, the dinner for 2, is more like a dinner for 3-4 so it won;t break the bank either.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "RyX1dtn2eACiehBSj7rxEw", "review_id": "56K9ERN4wPGrUnRYf9ClGQ", "text": "I've now been to a few Mediterranean places that are like this: market on one side and restaurant on the other, and Princess Mediterranean Market & Deli has been my favorite so far! We were greeted when we walked in and every single one of the staff members was really friendly the entire time we were there.\n\nFor dinner I got the chicken shawarma entree which is typically what I get at Mediterranean restaurants. The cost for the plate was $9 which included the chicken shawarma, garlic dipping sauce, a choice of three side (either garden salad, rice, arabic salad, hummus, baba ghannouge, tabouleh, or fries), and also pita bread. I chose the garden salad, rice, and hummus. My date got the gyro entree ($8) that came with tzatziki and chose the arabic salad, rice, and hummus.\n\nWe both really liked the hummus with pita bread, the rice, and thought both the salads were really good too. I was unable to eat the whole plate of food, but my date helped me out. The price was definitely really fair for what we got. I meant to grab baklava, but forgot. It was only $1 for a piece though ... We'll be back!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8cHknWG-gWFT18qPQmYmmw", "review_id": "wWTIYp6uqKhAFQOmjOregg", "text": "Different; different is good. Set up as a convenience store with a restaurant in the back. Try the Princess Combo; good variety, nice meats. The separate gyro was salty and oddly prepared. Overall, a good experience.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 3, "date": "2015-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1-1RcasenaiBfY2ySUHpnw", "review_id": "Bw6WjL5YkAHnl9U-eeunIw", "text": "This place has superb food at great prices. I highly recommend - over most restaurants in the valley. You can't go wrong here.  Although very casual (set amongst grocery and deli) it's worth trying.  When I'm super busy, this is my go-to take out place.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s0313d_2iDdiIBxonfpAuQ", "review_id": "DkQ0-_O1oQrUbOeG-0Elbw", "text": "Very clean, inside and outside seating is great. Service very nice and quick . Food looks and tastes really good", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y5JR7LYkn_jWAHXtoS25QQ", "review_id": "x4mx9yxuFNrYloR2_1Ft3A", "text": "Love princess market for their food and market. Love the sandwiches and my husband and I often get the princess combo for two and always have leftovers for lunch the next day.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OPStKHloEOVxcBtFgkzh2A", "review_id": "_f9dORXyRPkEVjRtDDKa_w", "text": "Fantastic!\n\n\nIt's a grocery store and has a diner in area as well.\n\nWe had the Princess Platter and its $22. It's a bit pricey but that fed both of us and had us pretty content. Not an insane amount of food for $22 but enough and will be a solid meal.\n\nWe also had some white cream cheese dip appetizer that we didn't love. It needs something else like a ground hot beef or gyro meat on top. It's a bit tart.\n\nThey gave us a little $1 Baklava to try for free. It's about 2 bites but also delicious.\n\nSo the big question everyone would have that is into middle eastern food is how does it stack up to Haji Baba. Well, it's better in all ways except for the Shawarma and the Garlic Mayo. I'm still not sure why no one else makes their shwarma and garlic mayo like Haji!!! Drives me nuts.\n\nThe beef at this place and Gyro is def better than Haji. The beef Shawrma was fantastic. Haji has horrible beef in pretty much most forms it comes.\n\nGreat spot!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l49SHe_ZMBbNfyKYSTjNBw", "review_id": "rfE6PWnqcqwAfRM7_HeUlw", "text": "LOVE this place. Princess platter tastes amazing and is a great deal. First time going here and I can say for sure I'll be coming back. Best part was the service. They were so friendly and treated us like royalty. Desert on the house, pistachio baklava; which was to die for. I enjoyed my baklava with some Turkish coffee, great combo. Yum. The market place was fun too, I bought some henna, can't wait to try it out. This place is definitely a new hidden gem of mine.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-11-28", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "WBth5OOvugUKkLHJme_JrQ", "review_id": "6U1gTPmbg7d7GdhleS6ShA", "text": "Yummy, Yummy, Yummy! This place is great! First of all the owners are a very nice Lebanese family, the husband and his wife are the ones always working, they are so nice and friendley!\n\nThe food is amazing, their beef shawerma is very different than anyone elses, they actually use FILET MIGNON for their shawerma, which is a nice change sometimes from regular beef shawerma.\n\nTheir Baba Ganoush is so good, you might eat your fingers after it *Egyptian saying, sorry, lol*", "business_id": "1zdwPAgiJFJhPeS3YIY09Q", "stars": 5, "date": "2008-11-04", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "0B72lj8x6TXrKuAYpaHL3w", "review_id": "fA2pv5-5Kl6Acnq1ycG-2w", "text": "Great for Lunch or Dinner, the food is great and affordable.  You can sit and dine in or just as easy take out your order.  I've never had a bad meal and the garlic is just perfect.  You can phone in an order too, John will tell you to the minute when it will be available for pickup.", "business_id": "1zdwPAgiJFJhPeS3YIY09Q", "stars": 5, "date": "2010-09-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "3vML-LnH0dIyHCrqF5xEYw", "review_id": "iu1Pkl7Uoqe9xHxWWkl0bg", "text": "****UPDATE***** It looks like they have closed. (SCREAMING with SADNESS!) If they open up another restaurant and you find it please, PLEASE leave me a message here so we can go to their new place. I'm so bummed, we loved that place. Wishing you well John!!!!!", "business_id": "1zdwPAgiJFJhPeS3YIY09Q", "stars": 5, "date": "2010-10-05", "type": "review"}
{"votes": {"funny": 12, "useful": 11, "cool": 7}, "user_id": "tlSSQwfHYJany7wPoTH46A", "review_id": "78ZrWrBqFz3hO85IbDaFXQ", "text": "This place sucks.\n\nNow I understand that's not the most helpful assessment, so I'll elaborate to save you from ending up at this crap hole should you think, \"Oh Erica, you must have just been cranky that day!\" Not so.\n\nIt all started when I had a craving for hummus earlier this week. I work too far from just about every hummus slinging place in Tempe but Byblos. So I decided to try something new, and was left with a sour taste in my mouth.\n\nFirst off, the place is located in a shitty plaza of decaying shops (home to the Yucca Tap Lounge if that's any indication) and it's right next door to a Mexican food restaurant that I've never seen anyone enter or leave, so it looks like a front for some shady 'business' dealings. But my craving would not be deterred by a craptastic plaza, after all, Capistrano's is in the same plaza and it's delicious. Looks aren't everything. Hummus would be had.\n\nWe enter. It's empty and dumpy looking. The only people here have a mean age of 70. We significantly bring this average down. Waaaay down. We are escorted to a table and peruse the menu. The server (I assume it's the unfriendly server you had, Kelly B., because he looked like he had a stick up his ass that had been festering there for the past 60 years) took our drink orders and came back with two itsy bitsy little cups. Seriously? You're going to charge me 2.50 for six ounces of lemonade? We order. He frowns for the umpteenth time in our short interaction and waddles off to the kitchen. The food arrives.\n\nThe hummus was straight up GROSS, and the pita bread was shockingly similar to cardboard. The hummus tasted sour with a texture that was a combination between chalk and paste. If I can corner a five year old, I'm going to conduct a taste test between the two substances and see if there's any discernable difference. My money's on no. The presentation was nice, with pickles, tomatoes, olive oil and parsley, but if I wrap a piece of dried up dog shit in ribbons and bows, your gift would still be a piece of dried up dog shit. Maybe you could use it as a paper weight? \n\nThe tomato soup that came along with lunch was pretty decent,and the gyro meat was well spiced. But the fact that my gyro was wrapped in the aforementioned cardboard pita bread was really unappetizing. It's like they took rock hard, stale pita bread, heated it in the microwave to make it pliable, molded it and let it cool in its rigid formation. \n\nSo if you're 70 and your senses are slowly numbing, you might like this place. Other than that, stay away. It's unwelcoming and unappetizing. The antithesis of what a restaurant should be. Let it slowly decay along with the rest of the shops lining this creepy little plaza at the corner of Mill and Southern.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 2, "date": "2007-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "_jjIaczpcVDpHlH6l334rQ", "review_id": "cpJejPGKMujmhyBbRSn1fQ", "text": "Ok...this place is *REALLY* outdated...HOWEVER, the food was great.  The Veggie plate was gone fast (barely got to taste any of it ... wife loved it) and my Gryo plate was very good as well.  This is the ONLY other place that I've been to where the Felafel was great!  I've been to only one other place...", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 4, "date": "2008-10-19", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "0bNXP9quoJEgyVZu9ipGgQ", "review_id": "RpZkgvYNm9HrATJwPHp9wQ", "text": "It's been close to a year since we've last visited Byblos.  The lamb shanks here are so delicious, and they are served over brown rice studded with nuts.  I never have to twist my Mom's arm to dine here.  We both love the tomato bisque (\"to die for\"), although it's been two years since I've had it due to food allergies.  The hummus was good everytime we've gone, and I really like how it's served with wedges of tomatoes and a couple of cornichon (?) pickles.  We always ask for warm, toasted pitas.  Reading over the recent reviews, I wonder if management have switched to lower-quality ingredients?\n\nThe chicken kabobs are pretty tasty, as well, but do try their lamb shank dinners!  I'd skip the desserts here.\n\nI do have two complaints: This venue ALWAYS reeks of sanitizer; at least on all four or five times we've visited.  It's a really huge turn-off.  Another is the surly service from the much older man.  I used to think it was just a culture difference, but now I just think he's not happy working there.\n\nThe restaurant could use a designer to spruce up the counter setting a bit.  As it stood a year ago, the entrance hallway looks more like an office in a decrepit building more than a space where customers wait to be seated and desserts are displayed.  On a postive note, the women's restroom was clean whenever I had to use it.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 3, "date": "2008-11-20", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 5}, "user_id": "m7vtKWpZ9wdEQ95wJxrMrg", "review_id": "VoCZlh0FXrNKibXaU6_NGw", "text": "Two things seemed to stand out  when I read the reviews of this place before dining here: good food, but less-than-stellar service. And that's pretty much what I experienced when I had dinner here with friends. We weren't sure how many would be in our group, but eight of us had arrived and two small square tables had been joined together for us - a good fit for six people, but a tight and only marginally acceptable fit for our party of eight. When another person called and said she would be joining, we requested that an adjoining small table be added to our joint tables, which would have also eased up our cramped arrangement. Instead, the dour old man mentioned in the other reviews grouchily insisted on just adding another setting to one end of the grouped tables, forcing two people to squeeze into that small space. This is extremely unreasonable given that all the tables around our party were empty and remained so for the time we were there; in fact, very few other people were dining in the restaurant that evening. The gentleman who took our order was a lot more friendly but gave us a strange high-pressure sales pitch for some dishes, as Jenny R. had warned in her review. I had given my order for keufta khachkach, but he kept pushing the beef stroganoff, saying that they may not have enough ingredients for my order (... huh!?) He desisted when I told him I can't have a cream-based dish (actually I can; I just didn't want another dish being pushed on me). It turned out they did have enough ingredients for my dish after all ... how 'bout that!\n\nI must say that the food was good, and reasonably priced for the quality and quantity. And everyone in the party agreed about the quality of the food they got.  My rating for the food alone: four and a half stars; for the service alone, one and a half stars; therefore, a 3-star average. If you plan to dine here, expect good food as a reward for your putting up with the service that tries your patience.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 3, "date": "2009-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V9vStLuNc4aqZO_GK2VTuA", "review_id": "FB8UKKMAqG1Acqev5g3Sjg", "text": "i'm only giving this place four stars because i haven't actually been in, just take out and Matthew went to go pick it up.\n\ni must say, super delicious. the gyro i ordered was huge and meaty, just like i like it. Matthew got falafel, which i hate, but he said it was fantastic.\nit came with lentil soup, which was terribly comforting, although unfamiliar territory for me. it was a wonderful discovery,  \n\nthey just finished remodeling, so i think it may be time to go and dine in.\ni'm excited.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 4, "date": "2010-09-26", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "YbHL_lmvARxf0rz0WlVQPQ", "review_id": "00BKgmQR4lcbnBsoWkCrYA", "text": "Unfortunately still in pissy mood at going 0 for 3 in last new restaurant attempts.  Once again, a brief review filled with disappointment and regret.  \n\nStarted with the Spanakopita, which was labelled as a Spinach Cheese Pie for $3.95.  It was cold.  What should have been flaky heavenly goodness in the form of phyllo dough was just greasy congealed torture, which was quite impressive with how this was so damn cold.  Maybe they should've left this in the microwave longer.  Blah.\n\nEntree that was recommended as their house specialty was their oven roasted lamb for $11.95.  It was halfway edible as the rice was sorta interesting with pine nuts for a nice crunch, but was a little dry.  And then the lamb.  It probably wouldn't be fair to say it was dry, it would be more fair to say it was Arizonan desert sand masquerading as meat.  \n\nDamnit, so disappointed again I can't even think of a witty way to end this review.  God bless the edit button, I'll have to come back with something.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 1, "date": "2010-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PuFHZo_8ORYBZoOn8RHjpA", "review_id": "Lzbp2u8EQ1k2lvb8jY9ZmQ", "text": "I love only certain dishes here!  Tabouli is absolutely delicious and refreshing.  I like their tabouli more than Cafe Istanbul. Their hummus is perfect, but so is Cafe Istanbul's so that's a tie for me.  I always enjoy their tomato soup, mmmmm.  I usually get the arayess and enjoy it every time.  Look forward to trying more, but always like to stick to those I enjoy.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 4, "date": "2010-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_n4GlpyAIHZqm15_XRbmDA", "review_id": "2HNxADOWGw3E2dxcu1rbPQ", "text": "BYBLOS!... YUM!!!\n\nI am Half Middle Eastern, Half Japanese...\nso i grew up eating primarilly these two types of cuisines.\n\nAnd i have to say Byblos is BY FAR, \nThe Best Middle Eastern Restaurant in Az...PERIOD.\n\nEverything I've had so far was delicious.\nOh wait, i can think of \"1 thing\" that wasn't good, their pita bread.\nIts obviously a store bought variety, and not freshly made.\nand kinda like eating cardboard...\n\nHowever, everything else, mmmm, Love it.\nTry their...\n\"Hummus w/ Meat & pine\" its much tastier then the plain hummus...\nTheir \"Tomato soup\" (to die for, & i dislike tomato soup, weird huh?)...\nOh, and their Kibbe ...\nAnd the Shrimp scampi's pretty good too...\nAlso a friend told me he loved the chicken Mediterranean (thou i haven't tried it)\n\nSo those are My top Fav's... You won't be disappointed.\n\ni believe anyone who gave less than a 4 star rating to this exceptional restaurant, either never had middle eastern cuisine before, or does not have a sophisticated enough palette to be rating restaurants.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2011-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W1_-DGJi412EoqH6fAp6NQ", "review_id": "DdueU7n4JE0DWhyIMNumSQ", "text": "The owner was nice but very pushy on me ordering the specials. They didn't have what I wanted (grilled chicken burger) so I went with a falafel which seemed to upset him. My order came with soup, I chose lentil. That was very good. The falafel however was just not good at all. My tastebuds just could not agree with the sauce or ingredients.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 1, "date": "2011-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cBG3WD3mKDfZ1BNu7Do50A", "review_id": "CvCMriUBQKTko2fR_Tns0Q", "text": "Good food, especially the lamb. Byblos is a family-owned business and the food tastes like something Grandma would cook. Filling and hearty. The service is excellent and the restaurant is clean. But the decor is frumpy. If you can overlook the dowdy ambience, this restaurant is definitely worth the visit.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 4, "date": "2012-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "U_88BLrkBi7JbLsn-mv90A", "review_id": "8zRIp2KLdpT3LoK-_QS0bw", "text": "The food at Byblos is very good. The menu is neither lacking nor excessive, but just about the right amount in the number of offerings. Years ago I went there on my wedding anniversary--we were both in the mood for Mediterranean food. After we were seated, no one waited on us. After about 15 minutes, we got up and left. (Maybe servers were confused about in whose section we had been seated.) Years later, I went to lunch there with some friends. Everything was fine this time around, but I had to explain to my companions why I had chosen not to eat there for years. It's been over a year now since that lunch, but I need to go back because the food is delicious. That incident many years ago was, I'm sure, a fluke. However, that one time of bad \"service\" left a bad taste in my mouth (and tells a story about the importance of pleasing the customer). Honestly, though, the food won't hurt your feelings. You'll like it.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 4, "date": "2013-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DbskgqCz6M24dNFi0ed0WQ", "review_id": "djLPkUcp8dREwkg2395qSw", "text": "This was a great new dining experience for us.  It is a mix of Greek, Lebanese food.  The owner was our waiter and gave great direction on what the specials were, what he felt would be something we should try.  His sister was in the kitchen making the food so I felt a little like I was in their home despite the restaurant setting.  I had the Lamb osso bucco, it was fantastic, with brown rice, herbed potatoes, & veggies. We also had the falafel, which Christopher loved. It was very good.  The humas with minced beef and pickle was also fantastic.  \nWe had chose this restaurant based on the online reviews and it was close to where an out of town guest was staying but we will be back.  They did all they could to satisfy us and made the promise at our table that if we did not like it we did not pay for it.  They ever brought items we did not order for us to try.  Desert was just ok, they claim to have the best carrot cake you have ever had but, meh... I've had better. \nOne of the reviewers here on yelp recommended that you order the Lebanese beer, I did.\nI am passing the recommendation on to you.  GET the Lebanese beer!  It went perfect with the meal.\nWe will be back!", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 4, "date": "2013-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mDS8rlDOcgRT3PMHGz3tug", "review_id": "XNZ62B5oBxoj7AiWhg2N4w", "text": "How is it that I have lived here for almost 20 years and this is the first time I have stopped into Byblos? They have been here - neighborhood local - for almost 30 years! The owner stopped by while we were enjoying a delicious dinner of moussaka, hummus, babaganouche, tomato soup, and the lamb special. Every bite was incredibly fresh and delicious. Don't skip out before having dessert - the tiramisu and honey pudding were incredible. Oh, and the Turkish Coffee - great flavoring with the cardamom. Stop in and say hello - they'll love you for it and your tummy will thank you.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 4, "date": "2013-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4r9rP4d71VCko2jr93g-yA", "review_id": "0MVINyKuxG7FfbeZlLC1vg", "text": "Great place for Lebanese and Mediterranean food. Family run atmosphere, and all freshly prepared. The hummus is tasty and creamy, everything from the grill is fantastic. I try to order a different entree on every visit,  tried the lamb last time, by far that is my favorite.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2013-11-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "ZvvxtxeTad9t3ZoxdNYe_g", "review_id": "7s-92fxlrolWu06uw_T5mA", "text": "It's an annual thing, visiting Byblos for Susanna A's birthday gathering, and for this, the 4th or 5th time, another quality dining experience.  Over the years I've sampled from the gyro platter, the keufta khachkach, schwarmas, and roast chicken, on up to last night's \"Mediterranean Chicken\", a pleasing chicken in sauce, for me spread over a bed of soft, perfectly cooked rice, accompanied by a cup of satisfyingly homemade tasting tomato soup: $11.95 +$2 iced tea, tax & tip and out for well under $20.  \n\nDining area is pleasant, fairly large, has both booths and tables not too close together.  Comfortable and uncramped, middle eastern music playing softly in the background. White tablecloths and cloth napkins add a nice touch.  The older gentleman took our orders, his bad knees forcing him to sit while he did so, but just made for more homey experience as he engaged in brief light conversation, gently encouraging \"the lamb\", but which tonight we all shied away from in favor of less expensive fare.\n\nOther staff delivered our plates, filled and refilled our water and tea glasses.  Our party of 6 was well-served and glasses never had a chance to be dry for more than a few seconds if at all.  Several of us shared a bite of Susanna's chocolate cake, met all hopes and expectations, qualifying as \"scrumptious\" all around.  I've had their baklava in the past and it too was not disappointing, a moist honey-drenched delight as opposed to the petrified dehydrated shredded wheat like offering you'll occasionally find elsewhere if not fresh.\n\nThe restrooms are towards the back of the dining room through the swinging double-doors, ladies to the left, men to the right.  The men's room is attractive but nothing \"fancy\".  It was and has always been on my visits, clean.  It's of decent size and un-cramped, with  one stall, one urinal, sink and mirror, and a new automatic paper towel dispenser.  \n\nAll in all another very pleasant dining experience I'd encourage anyone to try. Though much of the menu is closer to $20 than my satisfying Med Chicken, barring too many extra drinks, I think you'd be hard-pressed to make the tab exceed $30 a person, and I believe you will be satisfied with the quality of the fare for your funds.   It's a family business with sister as chef, and brother out front.  Belly dancing by neither on Saturday nights.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 4, "date": "2013-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZYLao4xjGNrlhTXt4MhUyA", "review_id": "sTw04Y0nGpWIADgZTou1XQ", "text": "I use to go there in very regular base. I love their tomatoo soup. IT IS A MUST. I also like their  chicken palte with white sauce (I think mushroom). The owners are lovely and sweetheart", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 4, "date": "2014-09-08", "type": "review"}
{"votes": {"funny": 8, "useful": 11, "cool": 10}, "user_id": "8dbRf1UsWp2ktXHZ6Zv06w", "review_id": "CGG_x37LIdHJ2OU5qmZTpA", "text": "I have driven by Byblos so many times and was looking forward  to join the International Supper Club UYE in September, the front parking lot is extremely small, but there is parking in the back, and it's a lot bigger on the inside then you would, ok I, assumed it to be.\n \nWe all were seated and handed menus and the owner was giving us a very detailed list of the specials they had going, and was even ready to take our order right then and there, but we told him we needed a few more minutes, so he said he would be back in 5, and he was. \n\nI already knew what I wanted, I ordered the Falafel Sandwich, it came with soup & fries. There as 2 choices of soup, lentil and tomato or as the owner put it, fight for or die for. I went with the Lentil soup, I love lentil soup but after the order was placed he came back and apologized for the mistake and it was chicken noodle soup or tomato, so now I went with tomato soup.  He said it was to die for! Well let tell yall, that tomato soup was creamy, full of flavor and well maybe it was to die for! I'm not much of a soup person but I could see me having a nice warm bowl of that on a cold day.   The falafel wrap was good to, I had been craving falafel and this hit the spot.\n \n Good food, great company, great time! Look forward to the next ISCUYE.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 3, "date": "2014-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9dx-Atgssn3g71cOVVhuNA", "review_id": "uy2sa9te8B1pQWcpZGMa-w", "text": "I was introduced to this place by my Girlfriend on our anniversary. She has been coming here for year. I cannot begin to say enough about the service and the since of community that is present here. The food sealed the deal thought the Lamb is amazing and also go for the tomato to die for because it is. I could ramble all day about how good it is but all I have to say is go and you will not be disappointed.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2014-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dOrUroBbwnDHbzmxcY_Dhw", "review_id": "PTLYMahwHTPqEKNIG3Kh6Q", "text": "Love at first bite! The owner is so incredibly charming that I wish I could adopt him as a family member ! I am picky with falafel and often find it bland and flavorless..I could eat it here breakfast lunch and dinner! The fact we talked about our experience the whole drive home tells you this place is something special!", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2014-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WYZhXxZKgrlGlM6zRtYm5Q", "review_id": "_FItvxhk0ODfvDoSnSKVtw", "text": "ABSOLUTE FAVORITE PLACE TO EAT!!! Definitely worth the $$. Lunch time the meals are same portion for half price so sometimes I end up doing that on weekends", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2014-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RfP030Tmj-1tIP00gnsp-A", "review_id": "rtvaL1xtIGFnxN7cHEFCQw", "text": "Simply the best place to have a late lunch with friends. i Love it, everything they serve is AWESOME. it makes me feel like it is my mom's cooking every time i go there. this is one of the best places to enjoy a nice arabic meal. They also have the best desserts and cakes, THE FREAKING BEST CAKES. go there and get some real food now.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2014-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TYPwh2JLw9xLSRhqn8F6Zw", "review_id": "w3Vs7lOA_aSf5gZXo81r7g", "text": "Every time I come here they treat me so nice they make me feel like  I'm their family. Super nice never been treated so nice anywhere else. The food is authentic with really good flavor and presentation the chefs are good at what they do. I love this place encourage all to visit Byblos.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2015-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LxJJmsX7u6jE0wgCYC_Nfg", "review_id": "lgV1pZ3xpbat8jRSk_0Wng", "text": "Our favorite Mediterranean restaurant for the past twenty years.  The lamb special is the best, made with meat that was slow roasted for 8-hours prior.\n\nTomato soup to die for, lentil soup to fight for!\n\nIt is family owned and operated.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2015-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qfgq4OzgbxjYh1wazl0SEg", "review_id": "P9iZ7-qLQpTL40CrIOWnfg", "text": "First time here in many years but still has same charm and great food.  The tomato soup is fantastic - get a bowl!", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2015-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VXAgix4y9os51bdmc0MXug", "review_id": "hbgd97AqLRhY64NkmgPZHg", "text": "We have been here about ten times. The owners are sweet and so pleasant. The plates offer generous portions. We all love the tomato soup. It is very creamy and cheesy. I really like the chicken kabobs. The chicken Mediterranean is also a favorite. They give lots of bread to the entire table.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 4, "date": "2015-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8TqwJWjgn3xxAzskYuJLJg", "review_id": "taxFezQPtUI-Ki7o4OO51Q", "text": "I've been going to Byblos for about 5 years. They have some amazing food. The lentil soup is dream worthy. However I recently took a friend who had not been there before. We sat down and decided what to order. I wanted the falafel wrap, and she wanted the chicken Mediterranean. The owner came to take our order, he advised us of the specials, one was lamb and one was chicken. I told him i wanted to order the falafel. He berated me about my choice and told me that i should have the chicken special. I stood my ground and said that I wanted falafel. He then stated that next time, hopefully i will make a better decision. My friend stated that she wanted the chicken Mediterranean, the owner argued with her until she said 'fine i will have the chicken special'. WOW! When our food came out, my falafel was good as usual. My friends \"chicken special\" was bland and rubbery. I think he was just trying to pawn off the pre-made special of the day.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 3, "date": "2015-11-30", "type": "review"}
{"votes": {"funny": 1, "useful": 7, "cool": 1}, "user_id": "YioimGEafeYVIYJKHSYCww", "review_id": "4HiLbu7PIsKwoQ1OKJ3OvA", "text": "I called to inquire about their menu and was meet with some resistance. the person who answered the phone would only tell me to come in and see the decor and and menu. i thought it was a joke and asked again but to no avail didn't get anywhere. this place put a bad taste in my mouth...ssh.", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 1, "date": "2008-09-05", "type": "review"}
{"votes": {"funny": 4, "useful": 2, "cool": 0}, "user_id": "8q4zUGb80MtMf98VdDaLQg", "review_id": "7IHtRvBeiRgeOdnlE5mcjA", "text": "i cant bash this place since i am persian, but it really needs some help. they need to be on kitchen nightmares with gordan ramsey haha. i liked the food, it wasnt how my dad and his friends make but its still pretty decent", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 2, "date": "2008-10-02", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "vRg_8asQCXU8Hob9qVh-Zw", "review_id": "6mfMjqMMHe0NCHfRJixbxw", "text": "i am not persian but embarressed to see the wine called royal kirre..\n\nshouldnt be there royal kir??come on...be nice..\n\nfilemignone was not very bad but nothing compare to atlantas rumis..", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 1, "date": "2009-11-26", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "o7c-wYQ0c9qCnTL0rhLC8A", "review_id": "hNtwZuGpb0-Eo2_BdoKBOQ", "text": "Been going here for years, every time in Vegas.  Came to the new location and was pleasantly surprised.  Great lay out and vibe!\n\nThe food is the best you'll find in the area for Persian.  I recommend the Grilled Chicken Kabob.", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 5, "date": "2010-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FtAjivakFyN-PQS_iWybmg", "review_id": "LC-kpFPoT4hGSjDoNLdE0Q", "text": "The new location is a lot nicer than the old one.  Food is overpriced, and service is a hit or miss.   The owner who is always there seems pretty odd.  Decent food, but definetely overpriced.", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 3, "date": "2010-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "A28VmM7z4H_Kb8_NtN9fOQ", "review_id": "M9udn6C63gxdt4zSaZ_3OA", "text": "THE WORST STAFF EVER!!! Super rude!!! I never even got a chance to eat here - and will never even bother. I called the restaurant to discuss my wedding catering by them and the person on the other line hang up on me after I told them what my budget was. He did not even try to work with me nor asked me any other questions, just HOW MUCH ARE YOU WILLING TO PAY. MONEY is ALL THEY CARE ABOUT -  how sad :-(", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 1, "date": "2011-10-18", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "jZgl-_rDAEEoYVl8psYwyA", "review_id": "ofMkAcNeSXjthyRPtd1Pbw", "text": "Great food and probably the best atmosphere of any Persian restaurant!\n\nMake sure you ask for the price of specials before you order as the stews were far more expensive than the kabob on the menu.  Approximately double the price.\n\nThey bake their own bread, which was fantastic.  The Fesenjoon and Gheimeh Bademjan were delicious!", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 4, "date": "2011-11-09", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "p1FB2z28hWKYU5dCJJQpIQ", "review_id": "FZdlwadUbdW66rVvbadNUw", "text": "I wasn't sure what to expect based on previous reviews but I really enjoyed this place.\n\nThe location is big, very clean, and the tables are set elegantly.  \n\nWe had a waiter and the owner both taking care of us (the place was empty at 6pm on Friday).  I can see why people don't like the owner - he has a VERY dry sense of humor.  Personally, I found him really funny and he treated us well even though we tried his patience by asking the same questions over and over (menu is a little confusing and if you don't pay attention you'll forget which item you thought you wanted). \n\nThe waiter didn't do much more than bring drinks and bread but he was very well trained and very attentive to our needs.\n\nI would definately recommend trying it at least once.", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 5, "date": "2012-09-11", "type": "review"}
{"votes": {"funny": 6, "useful": 18, "cool": 4}, "user_id": "Lt7xl94GwhmRbGPbuzCj4g", "review_id": "tHVVPJ2ZrPDsDNWlBUA_yA", "text": "NO STAR! \n\nWent to Habib's with my elder parents/family, Habib the owner also server snapped impatiently right when we walked-in to get seated.  He seemed to be having a bad day and took it out on my parents and I.  He took my moms order and when my mom mentioned she does not want her food overly cooked he was impatient and rude.  My dad wanted to get seated over by the window and he was denied.  When he asked for an explanation, Habib said to him I'm diabetic and can not carry the food from the kitchen to the widow seat near the entry where my dad preferred to get seated.  \n\nHabib said to my dad I'm the owner also management here and I won't allow you to sit there if you don't like it then leave.  By then Habib had taken five of our orders, when it was my turn to order, I was the only one at the table who's order was not taken by Habib, taken-back by Habib's rude behavior I set down the menu and didn't want to order food, therefore, he asked me to leave on front of my family and raced to my seat as well as personal space as if he's going to hit me.  I got up, words were exchanged and he ran to the front grabbing a phone and threatening to call the police.  We were certainly not treated with any respect.\n\nI WOULD NOT RECOMMEND THIS RESTAURANT TO ANYONE.  Habib is a rude jerk and don't know what else to say. That was 30 minutes into our arrival to Las Vegas and starting our family vacation.", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 1, "date": "2012-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "My196VEbVfpQlIDjsKumrQ", "review_id": "5GRZT9d-r8Wf-fMpyeKMzg", "text": "This place is absolutely gorgeous inside and the food matches it! Great food,BUT pricey. I would have given it five stars if it weren't so expensive.", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 4, "date": "2012-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "55GXsFLH4QYnTQqiijBtxA", "review_id": "gRdcthVDt98n_Z9Bqfo9Ww", "text": "This place is a must go for all epicureans! A real must go! We has the pomegranate marinated chicken and the lamb shanks ant they were perfect! but first the dolmas were served  warm and with that squeeze of lemon juice were out of this world! The tabuli was made perfect and so flavorful. The yogurt cucumber salad  made Anet GO WILD! BUT WAIT befor the meal Habib himself came to our table and explained every dish on the menu, I mean every dish! when he is done describing the dishes I wanted one of everything, everything really! This place is classy, from the way the food is served and prepared down to the floor that is polished like a mirror to reflective quality. The man has opinion and a dry sense of humor and will challenge opinions that need to be challenged! The customer is not always right in this place Habib is right, and he truly is. He is charming and has a forever twinkle in his eye that is indeed lovable! He has old customs like serving the the ladies a bite of food and the long stem rose he presented her with on the way out was a great touch. He even offered us complimentary baklava and we were to full to even accept. all in all a must go for epicureans!", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 5, "date": "2012-11-07", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "-5qp6UapWv1GA890MbrSnw", "review_id": "it4ziiFogGnoHEYLvquMcg", "text": "I was attending a Medical Conference in Las Vegas.  After couple of days, my wife was carving for a good persian food and we decided to Google and came across with Habib's Persian Cuisine.  When we arrived to the restaurant, we were first hesitant that whether we should go there since there were only a few cars parking outside.  I should say that we enjoyed the food and service very much.  We had soup of the day, Hammus, and Barg Kabab.  They were all fresh tasty and high quality.  We went back the second time before we left the town back to Texas.  I highly recommend this place and looking forward to go back to Vegas and try other dishes.", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 4, "date": "2013-10-12", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "oNXlUpLvc4_AbsbbQ8HYVw", "review_id": "RhHXhn-e8LqhXjodXo6egA", "text": "Habib's Persian Cuisine, an Iranian restaurant is located on 2579 S Decatur andSahara.  The restaurant looks elegant and impeccably clean. There was no other customers but our table. During that time we were told they moved and this is a new location that has not been advertised yet. They have a cute little Persian market in the back of the restaurant. The food was okay. I want to go back and try more dishes.", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 3, "date": "2014-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "JTvKlKBJJCC7zc86-tFhUA", "review_id": "9cJSYdcuVp2fvsB2xeALYQ", "text": "Food is below average and over priced.", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 2, "date": "2014-11-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "TxB6Q_VAB4ziB-p0sJvZiw", "review_id": "Ikdy51xB6_XOu9QS4d7ZXQ", "text": "Beautiful restaurant the waitress was very nice the owner is somewhat psychotic and comes and yells for no reason and made me feel very uncomfortable being here he also had a foul odor to him. Definitely on the expensive side and mandatory gratuity and mandatory splitting fee", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 2, "date": "2015-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ul7nQupGLE75VMu-AC21kQ", "review_id": "4dHIsNcfPOFFLeQ--L1rXw", "text": "Firts place to see the resturant put the tip on a behalf of you!!!!\n\nGood food, but service is not", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 2, "date": "2015-10-09", "type": "review"}
