{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uK8tzraOp4M5u3uYrqIBXg", "review_id": "KAkcn7oQP1xX8KsZ-XmktA", "text": "This place was very good. I found out about Emil's when watching a show called \"25 Things I Love About Pittsburgh\" on WQED hosted by Rick Seback. This place ain't a luxurious restaurant...it's a beer & a shot bar / lounge. But the people are friendly & the food is good. I had the fish sandwich which was great. It ain't in a great part of town, Rankin, but I've been in worse places!! Try this place.", "business_id": "mVHrayjG3uZ_RLHkLj-AMg", "stars": 4, "date": "2013-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "op2Gve4sAMQ4qEzq2Tad0g", "review_id": "F0J40KOLx5s5zbcCtO40UA", "text": "I'm reading on here that the food is really hit or miss. I've only gone to Duke's one time, but the food was good. It wasn't too busy so our service was very attentive and it didn't take long to get our food at all.\n\nThe place is separated between a bar area and a more family style dining area. We sat in the dining area because the bar area was pretty full. The dining room area definitely fills up with an older, have lived in Pittsburgh all their lives crowd, while the younger crowd is in the bar area. \n\nI'll definitely be back since I live in the area.", "business_id": "1qCuOcks5HRv67OHovAVpg", "stars": 3, "date": "2013-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r4wiR0dlTX5gCEZOolu3-w", "review_id": "SOLgN5cku4B_35nwAGD0qQ", "text": "This is a place I'd go to just for the games. The food was bad. I had the chicken sliders and there was two pieces of wood in the sandwich which I found in my mouth. Granted the manager did take off the price of the sliders but everyone's fries were lukewarm. My sister got the chicken fingers and wow, there was zero flavor or seasoning on it. The bathrooms smelled like stale urine and the floors were very sticky. The waitress was nice but overall i wouldn't dine here again.", "business_id": "sbW8qHJgzEIH42B0S-3New", "stars": 1, "date": "2015-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8g645khsgHyNyl6mbRHHSQ", "review_id": "CDOdtgSeQxtsyiYIdrbLKQ", "text": "The buffalo chicken dip is very good. Their wing nights are decent (gold rush/death row are probably the two best flavors in my opinion). Wednesday night trivia is also fun (thought it took much longer than expected). \n\nA good sports bar to say the least, usually went there for world cup and euro cup soccer games as well.", "business_id": "Ts4xsKPU7FNPPZRj-nRjIg", "stars": 3, "date": "2012-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KIh-sWidOXdyPTcgKxaEOg", "review_id": "TxHoFt8HuF38gInSCBHYOg", "text": "One of my all time favorite restaurants in Pgh, Casbah is still going strong 15 years later. Today's lunch was a wonderful mac and cheese with braised lamb; my dining companion enjoyed the corn risotto with shitake mushrooms and a side heirloom tomato salad. They use the best fresh local ingredients to craft some of the most delectable, interesting fresh food around.  Also great for Sunday brunch.  You won't be disappointed.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 5, "date": "2009-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "u1KESST6ATusVrn7F6HUvw", "review_id": "hTW0gyqJiSZwQDCvjusqSQ", "text": "I am so happy they got rid of those awful bar stools!!!   We often choose not to walk in to Casbah without a reservation because the bar area was historically uncomfortable.  They have traded out the old stools that were screwed in to the floor, too far from your companions, and didn't comfortably turn to face people (who thought that was a good idea?) in for some admittedly less attractive but functional chairs,  I'm a big fan of the lunch and dinner there--we'll add that more often to our walk-in list now,", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 4, "date": "2013-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k4IBH0MzA61TOr6roK-r9Q", "review_id": "VVlRPucLmtFT0XuVFW_VYQ", "text": "This is my favorite big burrito restaurant. The food is consistently good, and the service is as well. I often have two or three starters as my meal. They are quite interesting and well made. Their pasta dishes are quite good as well as some of the meat courses.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 4, "date": "2015-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tKhg1xMNR3w24S9lANCV0A", "review_id": "iPEUu-UCUxJQsMcjiCRPgA", "text": "I have eaten here many times in the last 27 years, and I must say I have never had a bad meal here.  The Reuben is good, as is the Turkey Reuben, which is served between 2 potato pancakes instead of bread.  The Beefeater Sandwich is always a good bet.  The beef is always tender, and never fatty or grisly.  For the times when I'm a bit more hungry, I get the Wienerschnitzel.  Try the German Potato Salad and/or the Sweet and Sour Cabbage.  And don't forget dessert.  The desserts are homemade by the owner's wife.", "business_id": "IxQ1ATP_Wg_QujO9nywzcQ", "stars": 5, "date": "2008-11-06", "type": "review"}
{"votes": {"funny": 7, "useful": 8, "cool": 8}, "user_id": "Wm9hTt2x-ziM-GpU3fQ1hQ", "review_id": "oEX8cQbB9_htvXeMGkmAPw", "text": "Our first stop in Pittsburgh, what a great start! Had a couple of yuenglings, a warm, salty yummy soft pretzel and a big ole plate of German goodness in da tummy!\n\nThe Peasant Platter had knock wurst, weisswurst and a pork chop on top of heap of sauerkraut...with potato pancakes, spaetzel and a basket of baked breads!  So.much.food.  And oh soooo good!\n\nThe bar is cool, staff is really nice and I believe they offer their patrons a free ride to and from on game days!", "business_id": "IxQ1ATP_Wg_QujO9nywzcQ", "stars": 4, "date": "2014-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rkmM0Ku4NmG6gE5DaaEntA", "review_id": "ITfqp4GbzmmykvaNY5ZGDA", "text": "I went with my boyfriend and one of his coworkers to this joint for lunch last week. As the rating suggests - meh.\n\nIt wasn't terrible and the service was fine. I just feel like I've had much better pizza elsewhere around town. And for sure a better margherita. Theirs fell into the category that I find most end up in: a regular cheese pizza. Quite a few places seem to not understand the differences between the two, and this place was no different.\n\nNow, the cheese/margherita pizza they served me was pretty good, but it didn't stand out for me. The other two ordered sandwiches of some sort that they both really seemed to like. The beer selection was also a bit lacking for my taste, but that may just be because they didn't have anything I liked so I stuck with water (that's me when I go out to eat: alcohol or water ;).", "business_id": "qemCNgjeYGcFsRwxW9x4xw", "stars": 2, "date": "2012-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x5EWOcs7WKtra17g-sJLwQ", "review_id": "yQdADQXETTz-zn9b_qvXsQ", "text": "Made my first trip to D's today.  By far one of the best bars I have been to.  Great atmosphere, good food for a bar, and how can I not mention the BEER CAVE.  They have an impeccable selection of brew.  Great place to go for a night out or just to have a good time.  I would imagine a Stiller game would be pretty fun to watch.  The prices are just right including drinks, but if only we could do something about the county drink tax.  \n\nI will visit this place frequently.", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 5, "date": "2008-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pztZ7aZtyx6Bp9O4-yic7w", "review_id": "EJEWwTrLOScqZtFv7uC64Q", "text": "Obviously the great rep of this place is their beer selection.  A lot of bottles.  Decent tap selection, though you are guaranteed to have a rather lopsided selection among the taps.\n\nFood is fair; I've yet to go there with others and have our whole meal come out at once.  Salad will come first, then a couple of dogs, then fries.  If you are polite and civil and believe in not eating until everyone is served, well, let's just say that no one ever taught the manager, cooks or servers here that lesson.\n\nNow, their service:  Really lackluster.  \"Entitled\" is the word I would use.  It pains me to give them 15%, because honestly, they don't earn it, even when I was a regular and knew some of them by name. Meh.", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 2, "date": "2011-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5s0YP_ZMshAYPb0VdSfukw", "review_id": "Z9sOk6WqJ6Gj73tmZ-D4Pw", "text": "As if this place needs another glowing review!\n\nWhen I first moved to Pittsburgh, a local clued me in to the wonders of D's. She leaned forward and whispered, \"....yeah 'suchandsuchbar' is alright, but if you want the BEST beer selection in Pittsburgh with the friendliest staff, go to D's Six Pax and Dogz.\" \n\nShe proceeded to give me directions. Mind you, this was a total stranger. But I liked the mystique so obviously I jumped in my car and found D's (her directions were perfect.) \n\nWalking into the beer cave is an almost religious experience. What's this to my immediate left? Seasonal brews? Yes, I'll definitely have some of those. Trippel Belgians? Count me in. Beers brewed by monks? Of course. All the Dogfish Head and Rogue a girl could ever want? Double check. Giant bottles of Chimay? I must be dreaming. And if you thought things couldn't get any better, you're clearly not following along close enough-you get $1.00 off every bottle you take to go. \n\nBobby and I brought a friend here last night because he said he had never been. We stocked up on pumpkin beers and they even had Weyerbacher Imperial Pumpkin Ale which I can never seem to find anywhere. Our friend was in awe. The only downside I can possibly think of when it comes to D's is the magical time powers that seem to exist in the beer cave. I kid you not, I've sometimes found myself in the beer cave for over 45 minutes agonizing over crafting the perfect six pack. Of course, this isn't D's fault. I'm naturally indecisive. \n\nI love this place so good.", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 5, "date": "2014-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ZqKg4O7EXci7SR_UUS2J_g", "review_id": "0iIkT30HfwcJUJUhQXT8UA", "text": "Don't be fooled by the run-down exterior- this is a genuine beer hall that would make do nicely in any town in Europe. The decor is nothing to write home about, but the food is great. The dogs come in all varieties (bratwurst, all beef, turkey dog, veggie dog) and you can mix and match any topping your heart desires. Prices are SO reasonable, especially at a time when it's tough to find great food for a reasonable price in this city. The best feature of D's is their beer cave to the rear of the restaurant. While your dinner companions peruse the menu, make sure you stop and take a good walk through their beer selection. You can pick from hundreds of domestic and imported beers from around the world, including some rare gems you'd have to special order anywhere else. Chill your beer there in minutes, or get a discount walking in and bringing home a single or six pack. They always have interesting offerings on tap as well. Highly recommended!", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 4, "date": "2015-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "bHxKVGf_8z9fwvbbYJsKFw", "review_id": "GReKBs98GPFFHUaaFIpJQg", "text": "I love their unlimited soup, salad and breadstick for lunch special!", "business_id": "zpNGtjBlIkDq_PLGSCPlAg", "stars": 5, "date": "2012-09-25", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "DJEMTgcPO5O6qQA1eWNLSw", "review_id": "JuosgW301wQPVm2GwK7euw", "text": "Try the sweet potato fries with a side of honey mustard instead of ketchup. Linda and the rest of the ladies at the bar are awesme.", "business_id": "OxIeMVcop5oxBUWANi-1Rw", "stars": 4, "date": "2012-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "3CxWftKJAqpsYRW0FqIWeg", "review_id": "kTWdV9t6Xg6048b94tN6SA", "text": "Go for the martinis, don't stick around for the food. \n\nI have been here several times for tiny tini Tuesdays - a weekly event that allows you to sample their colorful and delicious martini's in tiny glasses.  You order three at a time for a somewhat steep $12.  If you want variety though, this is not to be underestimated.  \n\nHowever, the food is always lacking.  I went on a lunch date here and decided to go for the grilled cheese and tomato basil soup as my stomach wasn't feeling up to anything more adventurous.  The grilled cheese was fine.  Nothing special.  The soup however had a thin drizzle of basil oil which when stirred in made the soup greasy and wholly unappetizing.  \n\nYour best bet is to head there after work for the martinis and then head around the corner to Six Penn for food.", "business_id": "OxIeMVcop5oxBUWANi-1Rw", "stars": 3, "date": "2014-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "jThUkO26of_9arLY5zUszg", "review_id": "B6WOh7NnjhKANR_iktM6iA", "text": "I am so absolutely disappointed that Pegasus closed! The name has been around for so long and many people know of it, even if they've never stepped foot in it. Pegasus was an amazing bar/club to go to to dance, socialize and roam their 3-4 floors. The dance floor was spacious and there were so many places to go if you grew tired of dancing! I never had one bad night at Pegasus! Every night there was an amazing adventure! The staff was great and the people there were so much fun! I met some great people there and the crowd was almost always friendly and fun. I really hope that Pegasus comes back because Pittsburgh needs it!", "business_id": "FsY-8nYOCXyj9FoVxbjzTQ", "stars": 5, "date": "2014-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 2}, "user_id": "bU8oW3KjhH4OmCbW1z4xUA", "review_id": "5JPZZ1ovYmmU_c0-4d4V9g", "text": "Love the fish sandwiches, they are all they are cracked up to be.  If you want lunch - try a sandwich here - but order ahead for pick up, or be prepared to wait 30 minutes or more in a shady looking bar.  The bar is very smoky, although it is also stocked with a soda machine if you get thirsty waiting for your sandwich to be made.   Although for a fish sandwich and fries you'll probably drop about $10, I think its definitely worth it.", "business_id": "FD6OocZdFUfE2J5H0WN4fA", "stars": 4, "date": "2008-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G1hNu0FZFv5S_nkh1C-35g", "review_id": "Y_Fs8HL7VIbudiCOpHp4dg", "text": "Take a quart of wedding soup home with you.  There has to be a little Italian mama in the back making sauce.\n\nTraditional Italian cooking .... you know what is for lunch tomorrow. ... leftovers from dinner ... huge portions.  I took a 300 lb football player (lean mean fighting machine) there for dinner he couldn't finish the lasagna ... it's that big.\n\n[Parking is an open metered lot behind the restaurant ... people walk their dogs on the sidewalk and through the lot ... watch your step ... there is always a pile.]", "business_id": "-Nanlb7SYXObqQ6dZ49UOg", "stars": 3, "date": "2015-09-15", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "JEvkfVPf_DuhX-ntE5L6bQ", "review_id": "yyUJKvG-C4VipITrAS0nIQ", "text": "Bloomfield is the hood I work at and live in! Being that Lot 17 is right around the corner I take out from here quite a bit. The thing is I can only review one menu item. I used to live in Florida and survived on Mahi Mahi salads, sandwiches, and blackened fillets... \n\nAt lot 17 I am always ordering the blackened Mahi sandwich no bun with veggies,(usually broccoli or beans). This is a highly flavorful and tender good sized; piece of fish that had no fishy flavor. One of the mildest white fish. I have eaten it on the bun and it is very tasty too. The blackening can be a bit heavy and chard so if you don't like that burnt taste you may want to have it grilled. That spicy kick and filling but healthy selection keeps me going throughout the busiest of days!", "business_id": "7XXmky6YYjsvKFwho_eavg", "stars": 4, "date": "2011-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "rkmM0Ku4NmG6gE5DaaEntA", "review_id": "PcPh9RF82cj1Z5zhvupyyA", "text": "This is the sports bar I have been looking for since I moved to Pittsburgh! I only wish it was closer!\n\nWe checked this place out on Saturday. We were dressed up because we were attending a reception for a wedding later on and we were just trying to kill time. There weren't too many people in there and majority of the TVs were focused on the Pitt game with a few other games sprinkled throughout. \n\nFirst win: PUMKING! I am seriously in love with that stuff. The bartender was incredibly nice and funny and social, which is how I like my bartenders. I mean, shouldn't they all be like that? Customer service is pretty much your job, but I digress ...\n\nWe didn't eat anything, as I said, we were heading to a reception afterwards, but we got to enjoy some beers and watch a bit of the Penn State and FSU games, my two favorite teams, so that was nice. The TV setup was in such a way that no matter where you were sitting you could see the game, a feature most sports bars in this town seem to be lacking. Prices and selection seemed on point and the bartender hooked it up! :) All in all I was super satisfied.", "business_id": "jJfTh2O3M2Q716akd9Dr9w", "stars": 5, "date": "2012-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x_MbMxRc_FVlZrTqclfUyw", "review_id": "7YsL4biBFIsQStceXuWxKg", "text": "This place just bored me.\nReally don't know what to say.\nBored, bored, bored, bored, bored.", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 2, "date": "2010-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1L9gUYaYKp3GaRBgNiCUUg", "review_id": "zL3QZ-P-yhJR9DLgqku-4A", "text": "Great evening. \nBasics:\nGreat service, \nVery good food..hamburger Helper ( not like I remembered )\nVery good beer with pumpkin for my wife and met with her approval!\nDesert ...homemade cookie with Ice cream and whipped cream was perfect\nCheers", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 4, "date": "2014-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oY3CZqp5lLZLp-Tm7bEVLQ", "review_id": "WJUyz9kiD42dsauWYJEnoQ", "text": "A little expensive, but a really trendy place in a cute part of the city. The mac and cheese and desserts are incredible. Its dark inside but the unique food makes up for it!", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 5, "date": "2015-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DDCAczgY2N_B7bYXDild6w", "review_id": "VcpvXFlCHqd1pOyQfznxgg", "text": "This is a neighborhood Denny's with a bar. Small place and the meal was served on plastic plates and they used plastic mugs for coffee. At best, less than mediocre breakfast. Pamela's was closed and we were really hungry. Service was slow but they were nice about it. I don't plan to return and would choose an alternative.", "business_id": "DkX3YoxhH4uADsgVgQThew", "stars": 2, "date": "2010-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lhhcCD-L3kdjYu9xffIHkQ", "review_id": "gblDp9bfTNik-9Q-vkVvAg", "text": "Nice atmosphere, way strong drinks, interesting music selection. I had a great time at Le Mardi Gras, and I left drunk and happy.\n\nMerci Beaucoup, mes amies!", "business_id": "TIPebazlAGJsp8zAwhNkcw", "stars": 4, "date": "2011-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "urozdIsIzmQR-snDgDOqZg", "review_id": "DBJyEiKibxM-v6b53RZ1Ig", "text": "Good service, small portions", "business_id": "DE_11y6_vCmPBlbeYskh-Q", "stars": 3, "date": "2014-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iw71Q7AwGWfBvULvWcKuwA", "review_id": "BEKDJeLI6H-mFsCbm2lZGQ", "text": "I have to laugh b/c this is the second time I find myself quoting Nicole W. but she said it best \"Alexander Michael's is the quintessential go-to spot for solid food, good drinks and superb company all packaged into a quaint little spot in the 4th ward.\"\n\nEspecially if you live within walking distance, this is a place you will go again and again for an uncomplicated place to find simple food done right with quality beer selections.  I had the chicken pita.  I was not expecting that the chicken would be perfectly cooked, seasoned and the pita warm and robust.  A side of beans satisfied an additional protein craving without the temptation of the go-to french fries.\n\nThe place is too cute explaining on the back of the menu why there is a beam in the ladies room which finds itself the victim of unsuspecting visitors who inevitably find themselves in close contact with the supporting structure.  They also give some history on the house which makes good reading while you wait for your first round to show up.  \n\nSmall complaint that again, tv in the dining area.  I guess many people eat in front of the television at home and grow accustom to it?  Also, low ceilings make for a cozy atmosphere.  Probably not the #1 place for enjoying the natural sunlight of a gorgeous day.", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 4, "date": "2010-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gVGu5DHk5iI4CQ2tX7ka6A", "review_id": "sqnoNxVfcS3wWWot1CJFww", "text": "Atmosphere was good, service was good, menu was limited, BUT the Cheese Cake was incredible, the desert is what pushed my review to 4 stars.\n\nHowever, the \"What it's All About\" chicken was very good.  I was disappointed I couldn't substitute for the potatoes, bummer.", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 4, "date": "2013-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Al_lV54KFnRgAqDO-qVIuw", "review_id": "LrnyIYJHjw72XnmcMLe1-Q", "text": "This is a great old gem in the historic 4th Ward of Uptown. Everything here is great, and the prices are even better! \n\nI've had the chance to have several menu items here, each being just as good as the last. \n\n-The London Broil is served with perfectly  cooked/marinated flank stead. Of course to have to get it with the peppers & onions to really make it what it should be. \n-The Ruben is a good size, and the Dijon mustard they thrown on there makes it a little different than what you're used to. It surprised me as I didn't even read the description on the menu when I ordered it. \n-the quinoa veggie black bean burger is superb. This is a must try for everyone who loves any sort of veggie burgers --- it's served on fresh pita bread, wowza!\n-crab soup is delicious as a starter for all you seafood lovers out there. \n\n\nBonus: All of their bread is locally sourced from the outstanding Nova's Bakery in Plaza Midwood!", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 4, "date": "2015-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EPCnL_c63KjmJ9EVB6kM5w", "review_id": "f-ku1joXKH93rCOMY8f70w", "text": "I've been here quite few times and while F&H isn't perfect it's better than so e of the reviews here make it sound. First the bad, like other reviews have mentioned, sometimes the service can be bit slow. It's usually fine but it admittedly has a few more bad days than some other places. On the other hand they have pretty solid lunch specials, great wings (the Hot BBQ are delicious), and some nice beer specials ($2.50 drafts on Thursday ($2 domestics), Yes Please!) They also have plenty of TVs and a pretty good customer rewards program and when it comes to a sports bar, what more do you really need.", "business_id": "-6JY1T0w4XETux5kGOj84g", "stars": 4, "date": "2012-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BxM2sc176XP7Qz8avM0iSQ", "review_id": "U3l9GRkrI_SSGPykJ-2y7g", "text": "Have been to Ri Ra's a few times now and the food has been great. The roof patio is awesome when the weather is nice, I love all the wood and pub feel of the place.  I haven't gone for just drinks yet when it's busy, but I have the feeling it's a good vibe. Great burgers and sandwiches!", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 4, "date": "2010-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bIOg3bUfk_2NfjhdPV6YZg", "review_id": "tK1O2ZcdmUfdS6K6NZZqjw", "text": "Just average unfortunately.  The good:  My drink...dark and stormy is going to be my new standby.  The mediocre:  Everything else.\n\nBurger was just so so as were the fries.  The burger was the 704...I honestly can't remember if It even came w/ the pickle chips.  The really really low point of the meal was the desert. The bread pudding was ice cold and hard as a rock. It did come smothered with a caramel sauce, but that couldn't save it.  When asked how our food was I was honest and could tell the waiter was taken aback. I mean seriously, don't ask me if you don't wanna know.  I was polite about it, but said that the dessert was just average.  And questioned why it was cold.  Bread pudding is always warm no?  He also got docked a few points for twice trying to take my plate while I still had more then half of my food left.  He actually removed my girlfriend's drink while she was still working on it!  \n\nIt was nice to have a late night eating option in uptown, but unless someone else wants to go I won't be back.", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 2, "date": "2014-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kDYpTc-yc8UAxCs_LhX1yA", "review_id": "I4QIaUuOpiAnfGrI1ZljhA", "text": "We like this place for casual lunches and dinners. It's right in the heart of downtown and it's huge--lots and lots of tables, along with a huge bar and plenty of outside seating--so it's pretty convenient for all sorts of days and times. It gets pretty crowded, especially during the lunch crunch, but because of its size, you'll never really have to wait all that long. \n\nMy girlfriend lives for their fish tacos, so if that's your thing, order away. I like their burgers and sandwiches--great club sandwich, good fish and chicken sandwiches, good reubens, great chicken finger sandwich. Roch Bottom features a lot of standard pub food, done up a little nicer than the options you'd find at most places. Though it's original, Rock Bottom has more of an Outback or Applebees feel than a pub. Not a bad thing. \n\nThey've got a great selection of beers, many of which are, obviously, their own creations. Try 'em all. They're really good.", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 3, "date": "2008-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zl01mec0TYRvxdHlQHs2jw", "review_id": "mbJzfuoimbGe-7qGA-3gow", "text": "Typical sports bar. Caught the tail end of happy hour. I got the Rocktoberfest seasonal ale and that was pretty good. But i ordered a side of fries to munch on and it was incredibly tiny :(", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 3, "date": "2012-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iqBJREy7cMKeYkWNBwnKIQ", "review_id": "B0wryd-Aeu5XVUwoUxKFbQ", "text": "We absolutely LOVE the food here. However we had family in town and brought them here and the service was terrible. It's embarrassing the service was so bad after we have been talking this establishment up for so long. The food took forever but was delicious once we received it. The server was Ami and had zero desire to be there and really wasn't in the mood for our party of eight.", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 3, "date": "2015-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8QevrmvT9nGs-cagPUpAbw", "review_id": "ptjCGhodHOXsH-DNFLz5Qg", "text": "This is a club, people. You know what you're getting.\n\nI've been there about 5 times in the past year, and every time has been a different experience. I've never felt any more paranoid there then I do anywhere. I've never had any terrible experience with the owner or bartenders, save that the latter are often a little cold and don't offer the same interesting conversation that some smaller pubs and bars do (I can't blame them, having to serve hundreds of drunks all night).\n\nNo, I always have a good time. The beats are loud, the lights are low and neon, and the DJ makes me want to let out a whooping yell when the confetti blasts out. The only issue I seem to keep having is one the club can't do much about. People. The people who go there are looking for a good lay, not a good time. Dancing in a group of my girlfriends for a girl's night ended up being a practice in defensive tactics as we tried to protect one another from unwanted advances. If the people dancing around me just wanted to dance, it would be my own personal Disneyland. \n\nAll in all, if I want to cut a rug and get crazy, this is where I go. Hope to see you there. ;)", "business_id": "jbUu0Mtu9QUjyyeOn6RIHw", "stars": 4, "date": "2015-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0_Xyynwz0H3n1coC9Rnn6Q", "review_id": "jU4dCM7nIHJv6WOHWhR5Nw", "text": "The place feels like an old bar. I went there with a group of work folks so I got to see a variety of sandwiches hot and cold.\n\nPhil has lots of different sandwiches that you can try, I don't really have a favorite since I am trying to find something new every time I go to a place.\n\nI gave this place 3 stars because it is a nice place. Sorta away from the people out side and streets. I will come back to it again to try other sandwiches.", "business_id": "6SxAOEXHzNjWQMQ9Nnos3A", "stars": 3, "date": "2013-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HGF0nzrPHL_Z62sH4urO2w", "review_id": "AG3p3w7oDZGhddrTor5d8Q", "text": "This place is classy .. Ambiance is good .. Service is good too ..\nI'm not a wine person .. But if you are it's good ..\nFood -- quantity is good .. I tried calamari .. Which was good.\nTrio miniature ice cream - ice cream was good , but the cookies served with that was not good .. I kinda of dint like the way they served water .. \nBut overall this place is ok . I don't want to go back again .", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 3, "date": "2012-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "v4oykWFMOvtlrfke1DRC7Q", "review_id": "jrEY7THkeummUePJJc0-Yg", "text": "Great dinner tonight with good friends. Lobster bisque, crab and lobster cakes with an added lobster tail, filet and lobster for my husband. Good wine. Richest carrot cake.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2014-10-05", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "gRKiX_9JUqi4Jy8KjtsehA", "review_id": "q5kv7YtG8UQiXUOSTSa9sw", "text": "The Capital Grille is solid.  It has a more upscale feel then some other high end chain restaurants. The drinks are awesome and the food came out perfect.  From oysters, to bomb ass lobsters this place is pretty legit. Personally, I think the steaks were just a tiny bit above average.  Better than Fleming's, but not as good as Sullivan's. This is a great place for a date or a business dinner.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 4, "date": "2015-11-25", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "T_kMEgHqIqwbHR_7yhqWFw", "review_id": "uAkhsr6Chd6qcVVlWuJcOQ", "text": "I certainly enjoy a good cigar and one of the few places in Charlotte to light up this is one of my favorites.  The bartenders are great, they are friendly and provide first class service.  I will say that the cigar selection is a little disappointing but they don't mind if you bring your own.  As for prices, well like most cigar bars you will pay for the privilege to smoke indoors.", "business_id": "7BVCmaxhvXgEpx7J-SQ4QA", "stars": 4, "date": "2010-11-27", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "-3akdU5UTDn6dwiTCO2cAw", "review_id": "3V1MTYbthjPgLq19EIEItQ", "text": "Connolly's is a great Irish Pub with no food, but great bartenders and an even better time. Beware though, if you have never been, you will be floored at how dark it is! I have a friend who told me the story of when he first moved to Charlotte and stumbled into what he thought was pronounced \"Cannolli's\". He walked in, ran into a table, couldn't see anything and ran back out because he had no idea what he had just walked into. Ha! \n\nBut your eyes will adjust and you will be fine after you grab a Guinnes or a cider. Most of the people that work there are actually from Ireland or another country such as Australia. The experience in a pub is just that much more enjoyable when accents are involved (especially with hot guys). \n\nWhile you're there, take in the music, which is sometimes Irish, sometimes hip hop, and the decor of the room. On the walls you will find all authentic effects from Ireland, such as street signs and sports memorabilia. If you are there on a busier night (which sometimes can be every night) head upstairs if you can. The upstairs is usually open Thursdays through Saturdays, I think. It's much roomier up there and you can always find a few young people dancing up there (again with very little light). \n\nThe crowd normally seems to be mostly young professionals including a lot of after work stop-ins like bankers and lawyers. Sometimes there are a few tourists and foreigners with accents as well (preferably hot).   ;) \n\nTo make the most out of going to Connolly's take it for what it is... you will get drinks very quickly and proably drink A LOT. You can easily meet new friends and sing and dance a little. They don't serve food and even though, it is clean, there's not much else to it. \n\nA HUGE tip for the ladies: if you use the restroom downstairs make sure you lock the door with the large latch lock that slides UP! If you lock the bathroom door with just the measly doorknob lock, SOMEONE WILL WALK IN ON YOU!! I have done this three times in one night to three poor, unsuspecting women who did not know this. Whoops! Sorry 'bout that...\n\nAlso, I almost forgot, they just expanded their patio and it's awesome!! They now have 2 cornhole setups, a ping pong table and outdoor flatscreen TV's, not to mention more patio tables and more standing room. Venture out there; it's a new world! \n\nAaaand lastly, if you do stop by, do me a favor and find the Irsh bartender \"Murph\" and give him a hard time... seriously do it. It will get him all fired up and a good laugh for you and me! ;) He is my favorite bartender in Charlotte but he's still a pain in the arse.", "business_id": "jmzPbvE_02SzTAjwZCTgYA", "stars": 4, "date": "2010-10-26", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "kDYpTc-yc8UAxCs_LhX1yA", "review_id": "fQi8k51RGNRao5hGOemdNg", "text": "A lot of people (girls) I know love this place, but to me it seems like much of the same in Uptown Charlotte: it's crowded, loud, and a little over-the-top. Again, though, as I've always said: this isn't always a bad thing. \n\nOn Thursdays through Sundays, this place is pretty packed with twenty-somethings and maybe braver older adults looking to booze and get after it, probably before hitting a louder/dancier place nearby. There are plenty of food options (try their mini pizzas and other appetizers), so you can come here and grab a snick whilst you drink or before you head out to drink more. \n\nI've been told that their martinis (their selection and creativity is extensive) are awesome, so if you're into that you may wanna try them. And they usually have some great deals on those, so be sure to check that out.", "business_id": "e5J3s-xxs1S6PPHJhldBEA", "stars": 2, "date": "2008-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "82LUelkkyEF3a7fvjzHFRw", "review_id": "Y5IJ8Z_dmVZud0Rm_LbMIw", "text": "Just not my kind of place. There really wasn't anything in particular that stood out that was horrible. It lends itself to a younger crowd.  It never seems that clean. It has decent drink specials. During large events it will become incredibly packed.", "business_id": "XeFNQqz5vVsVIcTjNuXcTw", "stars": 2, "date": "2012-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UmCAhWcU_abaaESenKUiLw", "review_id": "SFJ9HzDM1w8ap3iKNNebUA", "text": "Came here for a DNC-sponsored event... Open bar. Carving station. Yes, it was free. But Blue spared no expense. Excellent food. The service was pretty damn good considering there was hardly room to maneuver. \n\nStill bummed they tried to seat us in plastic chairs in terrible location when I first came here for restaurant week as earlier posted", "business_id": "eaqJQP6bp7rQJQt5KqfvxQ", "stars": 5, "date": "2012-09-07", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "_k5NtcOgPMYWk8y3tdselw", "review_id": "DMSCCLtrcZwI9rk0Fw2j5w", "text": "I used to go to Scorpio's years ago when I was 18-22. I lived in a small town with a handful of gays & we would flock to closest/only gay bar near us (an hour drive). We always had fun because we were young, drunk, & HAD to dance. Plus we just didn't see drag queens or gay people at all back home.\nI'm 30 now & have lived in Charlotte for 2 years. I do not like loud clubs or dancing (still drunk & gay though). I hadn't been to Scorpio's in years until I befriended their loveliest bartender. Now I find myself lurking at her bar every other Sunday indulging in practically free vodka sodas. I enjoy people watching & reminiscing of the days when I was so young & thought I could dance and make out with strangers in public. I'm a comedian now so it does provide me with material & sometimes smooches so I can appreciate it. It is still a night club where ppl get shitty drunk so grossness and wrecklessness is bound to happen. It is what it is but I'm glad it's still an escape for these young, dumb, drunk gay kids. \nIf you're looking for gayness, twerking, & sloppy ppl making out while trying not to take a tumble then there is no place like The Scorpio in Charlotte. \nAnd they have a really hot bartender... Did I mention that already?", "business_id": "COkT6HcVRY8Ur2nRTYY5wg", "stars": 4, "date": "2015-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "smidHR3NEAnd6UJUl_6h0g", "review_id": "vzt4SF7v2mH3c7tgbaPZKw", "text": "About 8 of my friends wanted somewhere unique to go and have a few different beers to try and we ended up at the Saucer.  Friday night was a great night to go, was busy, but not packed and our service was great - even with a waitress in training tagging along!  The beer selection was amazing and they had some great specials ( I was able to partake in a pumpkin beer for the first time for just 4 bucks  :) )   I had an order of nachos and this was the one disappointment of the evening...the sauces they came with were great, but the nachos themselves were just kinda meh.  Overall it was a 4 star experience.", "business_id": "F-e-sWfVd3eCYll3BP1QFA", "stars": 4, "date": "2010-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l5Se0l0Dc0eUHpQQoNRFig", "review_id": "RwsD0t7UlKORKpQExgZ1QQ", "text": "Best beer selection in the area. Wait staff is so friendly and knowledgeable.  Heck the waitresses know more about beer than I do! That's saying something. The brat con queso  is a an awesome appetizer.", "business_id": "F-e-sWfVd3eCYll3BP1QFA", "stars": 4, "date": "2013-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3Wc5xlVp-R69tHzM9MqywA", "review_id": "UsDbFIV70LnNO_cwms1FYA", "text": "Mediocre service and worse food. Been here several time and the quality decreases with each visit", "business_id": "r-pBY6vR_Iu5XhPRvPnquw", "stars": 2, "date": "2013-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ceUqTNgcTfN2ccQYnkk6hQ", "review_id": "Ht9ne3flKaQlX0XgDE7TOQ", "text": "Great experience in this place! The server was great! And the manager was great!\n\nOur food was late coming out, so they didn't charge us for the meal. Regardless, it was delicious and perfectly cooked. Kudos to the manager, really made our night.\n\nWe also had other meals from the wonderful menu. I had the quesadilla and it was plentiful! I would recommend it in a heartbeat, saucy, flavourful, and colorful. Can't ask for more.\n\nOne negative was the appearance of the restaurant, looked out of date. Need some TLC and would be bump into the 5 star.", "business_id": "SgjcjIxsAlVkcrtLaLxtTg", "stars": 4, "date": "2014-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tbXk1CBHmA74RoToOPEGIQ", "review_id": "iH1Cd0wsCyhWDcc1P-1NRQ", "text": "Service isn't the greatest. If you don't drink beer, drink specials can be somewhat lacking as well. Food is usually pretty good. Nachos are awesome. Wings are great. The pizza is always good too. The lunch buffet isn't a bad deal. Lots of TVs and a nice outdoor area.", "business_id": "3xdV-7di_YD3MVqs3Pa7-g", "stars": 3, "date": "2013-09-19", "type": "review"}
{"votes": {"funny": 1, "useful": 7, "cool": 2}, "user_id": "_0YeBZigbXCtbGixmby_-Q", "review_id": "IN3jV0j9aiCmX4n8OQZbsw", "text": "Great atmosphere and location, but the food is sad, just sad. Won't be coming back. It's fine if you want to enjoy a few beers by the water, but don't come hungry.", "business_id": "Zc2IwSzGY63zkyhfNrr7HA", "stars": 1, "date": "2013-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EXWVRlno7JpoJ78CsMj8Qw", "review_id": "3c0URENQDoMzgdda8PDbqA", "text": "Sweet Jay-sus! Sitting here on a conference call, appetizing on the fried mushroom appetizers and - oh my - by far and away, the best fried mushrooms I have had - and I've had a ton...\n\nThe fries were spectacular too... Just waiting to dig into the Mexican pizza and watch some Downton Abbey... Gonna make a B-Day feast dyn-o-mite!", "business_id": "zOc8lbjViUZajbY7M0aUCQ", "stars": 5, "date": "2014-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "yUkWGeu4B6OGE-7GNlYrjA", "review_id": "Q94wYGkAjKz65cW9GC_b8w", "text": "Classic neighborhood bar.  Good strong drinks at good prices. I think the bar food is great (try the spudsters!)", "business_id": "G1qUGBNYNS220jKlPAlFsA", "stars": 4, "date": "2008-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tVSrhMRsYvbocEbEIGf_0g", "review_id": "Fa4YodhRhnsVmtkTNoThDg", "text": "If you're looking for late-night fun, this is a good place.  Great live music and dancing, reasonably priced drinks, and several TV's to keep up on your sports.  Didn't eat here, so I can't speak to anything else", "business_id": "Nj0vQjUYjaa7qbvZlEr2jQ", "stars": 3, "date": "2014-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hrnSxGti9HOHxG2UaPz1rQ", "review_id": "TZR17v3YYMitJt4ltWUhSg", "text": "My folks love this place and I can't imagine why.  I had the chicken wrap and it could not hold a candle to the wraps at the Great Dane.\nThe fries are so overly seasoned they are almost impossible to eat without a huge glass of water.  Don't go there.", "business_id": "JdCFcgw4yk4M1ZRhAhBIag", "stars": 1, "date": "2009-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RhKfRl8Kc36TixK4bb_ICg", "review_id": "mSuwet9hkrxlBo3RPH9VAw", "text": "Went for lunch had the fish fry. Really bad over cooked just bad. Will not ever go back", "business_id": "HTplzElel_F_U_qhWuDKdg", "stars": 1, "date": "2014-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q75MUoAeRv18TgvIba3naw", "review_id": "WT8Ju1Bin7ipL8dkMXVELA", "text": "The Players club is the BEST!!!! Wendy, the bartender, is the bomb!!!!! Definitely the best burgers ever!!!  Love love love this crew!!! It's a must do if you are in Madison!!!", "business_id": "YlznKuAxnd7j3QfXFzoIog", "stars": 5, "date": "2015-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "O0lAQazaL-veJv8FCux37Q", "review_id": "8nbFWgAv3yRndH0sQiMkHA", "text": "Oh how I miss you, Harmony Bar!  I never miss a chance to grab a walnut burger and hot chips when I'm back in town.  \n\nThis is just a wonderful neighborhood bar.  The food is still \"bar\" food but it's quality, tasty and made fresh to order.  The pizza is good, too.  Good beer selection and a truly local atmosphere.  The Harmony fits right into the vibe of the neighborhood.\n\nOh how I miss you, Harmony Bar!", "business_id": "KHOHjA8HOcTlFBCtMQFv8A", "stars": 5, "date": "2010-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_e_4mcwCQIO5c-gvLAmYIw", "review_id": "UsK1DuNgxD2mAnLghbvBMA", "text": "Bad service and unfriendly staff. Everyone looks like working there has made them bitter, fat and angry. The food is not good; NEVER ORDER THE FRIES! The crowd there  is so-so at best, usually on the trashy side. Guard your wallet or purse. Heavy smoking crowd as well.", "business_id": "cRqZ_w9ImfYYIXTHpJMv0Q", "stars": 2, "date": "2014-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-Qu1uTuhIooZYMKmW8xXwQ", "review_id": "ya9xax6IIUf4kWYq2kCcBg", "text": "Crazy cheap for an alum used to Chicago bar prices. Tried the broski for four. Floor was so sticky it pulled my shoe off my foot when I tried to walk across the floor. Bought a Bacardi and sprite and felt almost instantly roofied by bacteria from the spray gun and glassware.", "business_id": "RcHfSp2qCW8DFwpmpuNv4A", "stars": 2, "date": "2015-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "bsbPntpOLlBU0UPW0M2MkA", "review_id": "niT7xHQ10AITtJ_cN_5pug", "text": "I recently returned to my alma mater, Illinois, for the Illini/Ohio State game (yeah, disappointing). Whenever we go back to Champaign, we must stop in Geovanti's for their chicken strips (tenders, if you will). These are seriously the BEST ever. The breading, the sheer size, the honey mustard dipping sauce - MOUTH-WATERING!", "business_id": "iCOvcfVRfi-f05aeqBLpKg", "stars": 3, "date": "2008-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sUrU9l3_f1iWYZdLmop0Rw", "review_id": "EBvGZ4baaooOXOW2VANKiw", "text": "Great Irish Pub right in the heart of campus! This bar is almost always packed, especially if there is a good game on! The food is awesome too for bar food. They have a great chicken sandwich with french fries. Add a tastey Guiness to complete your meal!", "business_id": "MVH3JOKpQvMTP4jxwBUhkA", "stars": 5, "date": "2005-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dzKYG04n0nLXv6tGFvJX0Q", "review_id": "BXtOAp4v1p29o1IaSIWD3Q", "text": "Drinks: I'm 75% sure they use Sprite-type drink in their gin and tonic. They use gigantic glasses of mixer with a single standard shot. We also ordered shots separately and each shot was $2 for 0.5 fl oz. I was stunned. I have not really ventured to campus bars in my three-and-a-half years here because I consistently have bad experiences. 0.5 fl oz for a shot is the next level of low. Most campus bars at least pretend to not be totally lost and call 1 oz a shot... But 0.5 just leaves me speechless. Standard shot, you guys, is 1.5 fl oz. Nowhere else have I seen a recipe for mixed drink with an 8 to 1.5 mixer to liquor ratio. That's basically spiked Sprite. My point is, they have -1000 drink craftsmanship. Which is fine since apparently you're supposed to lower your standards on campus. But what really gets me is that they sell 0.5 oz dribbles of liquor and call it a shot... \n\nFood: Food service is poor though the food is fairly good. We waited an unusually long time for two burgers. We began to think something was wrong so we peeked into the kitchen (after asking a server and having to wait more) and it looked like the cook was cooking away... And then he ate the food. I get it... If I were working all night I'd get hungry too. But it's kind of strange delaying orders for an absurdly long time so that the cook can prepare and eat food from scratch.", "business_id": "MVH3JOKpQvMTP4jxwBUhkA", "stars": 2, "date": "2015-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RH1qLpGvJxoYO8g0CVDKyQ", "review_id": "NMiGNZVtryq8zVcC5SUCvg", "text": "I came to Mike N Molly's to see a relative play in his band. I got there late and there was no seating. Across the street a building wall  is painted in chalkboard paint and people are allowed to draw pictures and write whatever they want. I liked that there was no cover charge.", "business_id": "6X7vAFv-Xj1TPcrJK7H2Eg", "stars": 2, "date": "2013-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PoArLCMA9Pkf5NiV51GQOw", "review_id": "eFwzKXtxEgeuYuGSmq_YEA", "text": "On the one hand, Legends is in my opinion the best campustown/Green Street bar. On the other hand, it's still a college bar. But it's my favorite and thus 5 stars.\n\nGreat atmosphere, never overly crowded the way some of the other dumps on campus are, often you're able to grab a seat, even on some of the busiest nights. My favorite night was Tuesday nights - Ride the Rail, and yes I completed my rail card senior year. I've got my name up on the wall which is very cool but I've got so many great memories of sitting around having beers with friends. And, I have to say, the beer selection's pretty good actually. They always have a few good drafts on top of the normal college bar cheap, watered down stuff. Nothing elaborate, but good quality mass produced stuff - Sam Adams Seasonals, Woodchuck, etc.\n\nThe food's surprisingly good as well. I would say Firehaus has better food, but as far as green street bars go, that's probably it. I generally stuck with burgers or chicken sandwiches and they have a good selection of toppings to put on whatever food you get.\n\nBut you really go to Legends for the atmosphere. It's an upperclassman bar where you can go to actually hang out and talk with friends. They have good music playing in the background but it's never all that loud and it's stuff you want to listen to anyway. They've got some slot machines and pool tables now which also make for a good time and there's a dressed model of the Chief up front which is a welcome sight for any Illini.", "business_id": "05FJCAvUFOAk8B_nIOqt7A", "stars": 5, "date": "2013-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "W4ojW7f30haCertr4CzFJw", "review_id": "b0jbQjF7evWVDhc-JwcAyA", "text": "I went for the dollar beer again and met a friend for dinner.  I had the grilled chicken buffalo wrap.  The flavor was good but I think they use canned chicken for the grilled chicken and the bacon was rubbery but other than that it was not too bad.  The homemade potato chips that they served with the wrap were excellent.", "business_id": "OxMl_jn8qNvV-pU2Dxj52w", "stars": 3, "date": "2012-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-zOrSvCiee5PT7D6JsMi2g", "review_id": "hCNFSQGi2G8ksqSUE3DIHw", "text": "One of my favorite places to eat out in CU.\n\nAs an alumni of UIUC, I find this place to be fairly priced with decent service. They have a solid draft selection as well as a well-rounded menu.\n\nFood: 5/5 (Remember, if you're not a chip-person, you can always change it out for fries for few cents! The Spicoli is the first-timer's go-to. However, I personally like it a little hot. You'll see what I mean when you get there. Their *real* [emphasis on that] Ginger Ale is real. Seriously. Burns like a mother, but still good.)\n\nPrice: A full meal with a draft and tip will be ~$10-15 per person, assuming that you get a burger. I'm not quite sure about the appetizers. But, it's definitely not a bad price.\n\nMood: A little dark. Has more of a darker, but cheerful, environment compared to other bars.\n\nService: I found the service to be good. No remarkable situations or anything necessarily outstanding compared to your expected service for restaurant in this tier.\n\nOther comments: Definitely recommended to visit at least once. If you and couple of your buddies want some decent burgers, this is one of the places to go. Might as well pay here, then go to Five-Guys to waste your money or any other corporate burger shops.", "business_id": "IUhO58Il7gUEjl1RMEncHA", "stars": 5, "date": "2014-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-0rG6ZZRl7BJAbPZK5UpwQ", "review_id": "X_J6vgQDuo6XY4pKYQoezg", "text": "Cover charge...why though?\n\nAiry, indoor and outdoor sections, with access to the bar from the outside as well, pretty neat. Small elevated \"dance floor\" in the back corner-not safe, because there's no railing. Multiple people, including myself and my friends were concerned about our well being and others. You don't put drunk people on a stage without some precautions, guys.\n\nMost surfaces were wet. Rude crowd. Pushing, knocking your stuff to the ground...no classy people here, just kids sitting on the backs of benches and dancing on tables. Didn't check out the bar so I can't say what booze they have available, but from the sip of a Long Island I had from a friend...no thanks.\nNot a bad place, but not really \"good\" either.", "business_id": "TxWfLkj8LLlVLBgA0woYEg", "stars": 3, "date": "2014-09-14", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "m8u49f6BQbnLBPujd6twaQ", "review_id": "LpKY2F3oKIjIKAEMvjezQw", "text": "How can you not serve food after midnight? geez, alcohol makes me so hungry!!  it's not like they have really hard-to-make food on the menu .its mostly just finger foods anyway from quesadillas to tacos.. Gr! \n\nThe outdoor seating is nice as long as there's no one puffing around you.", "business_id": "mJxu0USvbwSHcGsmwWh22A", "stars": 3, "date": "2008-09-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "YtbXNQJEJAHZK_2DFXSa6w", "review_id": "I7nskOyBefWcz46dVfZEiQ", "text": "Jupiter's was always a favorite when going out.  Great games, lots of pool tables (esp. awesome for those nights when the joint is packed and you really wanna play)!  The music is usually good (maybe more trendy for my tastes, but that doesn't take away from it, obsly).  What does, though, is their service.  Super slow.  It's usually _okay_ (the service that is), but I've had a rude bartender or two!  I suppose that comes with the rush of a fast paced and crowded bar on a Saturday night.\n\nAll in all, I wouldn't say Jupiter is extremely outstanding, or extremely poor.  It's just a run of the mill bar in downtown Champaign (though, it could pretty much be places anywhere).  It offers some great entertainment, with some good refreshment (albeit expensive!!), with the option of a thin crust pizza!  Totally a three-starer!", "business_id": "6U94ybDpNd0fTL7TIzb5Kg", "stars": 3, "date": "2015-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a0qku_DTmpK-7iV5u8G4Rw", "review_id": "UhiJIpHG-0rHR4DJqDyU_A", "text": "We had an absolutely great meal at Bacaros! We went all vegetarian but the mushrooms, beets, and prizetta were awesome!", "business_id": "h9xdY1NO4GnNijNChTy-8A", "stars": 5, "date": "2013-11-07", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "q0KigjVBtb6dfRjX3QJbsQ", "review_id": "CsVlZilTQRPsi8xxWTmchg", "text": "I had to ask how to pronounce the name. It's pronounced \"marleys\". Like an idiot, I was calling it Ma-jer-els. (I knew I was wrong, but still.) Glad I got that straightened out. \n\nIf you've seen any of my other Yelp reviews, you would know that I love old buildings; and I like businesses that reuse old buildings. This one was built in the late 1800s and is one of the oldest still standing in Phoenix. Majerle's has been in the building since 1992, and that is impressive. Let's be honest, downtown Phoenix kinda really sucked in the early 90s. That they have managed to stay open for almost 20 years gets bonus points in my book. \n\nI had the BBQ chicken wrap, some mild wings, and a beer. (Well, I split it with someone, I am watching my figure.) I liked it. I liked it more than I thought I would since it's a sports bar. And it wasn't any more expensive than any other sports bar. I really liked the exposed brick walls that echoed stories from bygone years and sighed in relief that the wrecking ball never came. Thank you to Majerle's for having vision and bringing value to downtown Phoenix.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 4, "date": "2009-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "kGgAARL2UmvCcTRfiscjug", "review_id": "3RVdcl6DzMQNtNYTbgM8rA", "text": "Upgrading this place 1 Star.  Over the past couple of years, we've dropped by here after a game (Suns/Dbacks/Rattlers).  It's a fun place to come and hangout and have a nightcap.\n\nAfter Rattlers games, the team will come and party with the fans in the back room.  Those guys are super cool and the atmosphere is fun.\n\nReturn Factor - 75%", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 3, "date": "2013-10-17", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "qASPib1Z8ft8e96dtbh66w", "review_id": "BrfbWhoIPTs0pNycR9zvWQ", "text": "I went with the suggestions of Yelpers and stopped in to Coach and Willie's for drinks pre- Dbacks game.  It was a good choice, I think.  I didn't care for the outside which has loud music playing but inside it's a nice pub (upscale is a bit of a stretch...) with lots of TVs tuned to sports.  We were able to snag two seats at the bar and even ordered some nachos.  \n\nA few thoughts:\n\nStanding room is kind of scarce.  If it ever got really packed you would have to stand around people at tables eating and while I don't really care I know that its something my husband doesn't like to do.  \n\nIt took forever to get the bartenders to notice us and take our orders.  And we were sitting at the bar!  When our nachos came they were asking for the \"S.\" party and we were flailing our arms in front of the bartender and screaming \"that's us!\" and she still didn't see us!\n\nThe bartenders were pretty cool.  They made some futile attempts to get a \"Let's Go Dbacks\" chant going but the crowd wasn't that into it.  (And at that point there weren't that many Cubs fans there...)  They had a good healthy banter with the Cubs fans which was amusing.   They didn't care when we ordered shots of Jager, although the two female Cubs fans next to us were shocked.  (Sorry, this is just how we roll.  We don't take shots of whatever that nuts and berries concoction that you're drinking is....)  \n\nThe nachos were strange.  The chicken was like grade F chicken and there was a lot of the fixings but they were not well layered at all.   There was a ton of stuff on top (including all the guac and sour cream) then a bunch of naked chips and then a whole ton of cheese and all the beans on the bottom.  We also asked for jalapenos on the side, but they just didn't give them to us at all.\n\nI would definitely go back here before a game again.  It was a good relaxed atmosphere and a quick walk over to the stadium.  However, I think I'll probably stick with drinking there and save my munchies for the ballpark.", "business_id": "j8nyAaN_w5t6wYv-ni23sg", "stars": 4, "date": "2007-10-05", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "4oBViNYcsWpPexC405Gh2w", "review_id": "7lWat8ArtJX0XiWMXx29Bw", "text": "I am a fan of hooters.  I usually receive a great server and the food is amazing.  I love the boneless wings with 911 sauce.  I do not drink alcohol, so I cannot comment on their selection.  I can say that I frequent this Hooters a few times a week.  It is a great place to unwind and the location is amazing.  This is the perfect time of year to sit on the patio!", "business_id": "qsWxbgQwuomXvMseg23DGg", "stars": 4, "date": "2008-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ygoiHYnlA61MdfrDBQis9g", "review_id": "-iLUH9Xz0hjGXNCWC7AEjw", "text": "Happy hour definitely cheaper....sucks they charge extra for ranch when you need more than one small container of ranch for wings!", "business_id": "qsWxbgQwuomXvMseg23DGg", "stars": 3, "date": "2015-10-10", "type": "review"}
{"votes": {"funny": 4, "useful": 6, "cool": 5}, "user_id": "Q96IRvil6RNgdLmGKuh81A", "review_id": "LsTEqpRVvdvlW9j3k5HY6Q", "text": "This is a lunch review, so please know that I wasn't drinking wine at the time. My review may have come out differently if wine was on board. :) \n\nI thought the place was nice enough. but for some reason I was expecting nicer. The decor was just ...meh..for me. \n\nThe prices seemed unbalanced. We got the 3 cheese plate as an appetizer and it was good, but again I was expecting a little more for $16.00. I ordered the lunch combo; half sandwich and soup for $10.00. The chicken and prosciutto sandwich was a bit dry and sort of lifeless. But the tomato basil soup with goat cheese chunks stirred throughout was amazing. I would go back and just have that soup. \n\nAll in all a nice lunch, but I'm not in a huge rush to go back. Maybe for drinks and an appetizer before dinner (someplace else)? Also., we felt it was a bit odd that everytime our female server (she never divulged her name) came to our table she addressed us as \"Lady and Gentleman.\" At least tell me your name before you call me that for an hour! ;)", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 3, "date": "2009-10-12", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "RxfFQxUtSIGYwTKU_rvAeg", "review_id": "LFKGDKBeJvu0C9zTvfiCyQ", "text": "I simply cannot get over how much I have fallen in love with this place. I have lived in CenPho for several years now and have only just tried Cheuvront in the last four months or so. I mistakenly assumed it was a pretentious wine restaurant but truthfully, it is far from it. \n\nMy first foray was at a Sunday Italian cheese tasting they held over the summer. Around $15-$18, you sampled pre-selected cheeses and had the option of ordering a wine flight with it or anything else to drink. You could also order other food. The tastings began at 3pm, and the best part was the restaurant officially opened at 4pm which began their 4-6pm daily happy hour. Yes, DAILY. Great HH selection, too, between the drinks and food. I am a fan of the one cheese plate for $5, margherita flatbread ($6, I think) and their goat cheese phyllo pockets with a balsamic sauce. God, those are to die for. On the dinner menu, we also tried a bleu cheese mac and cheese that was delicious. \n\nSince the first cheese tasting, I have been to an American cheese tasting, and most recently a Spanish cheese tasting. It was at the American cheese tasting that I discovered a favorite goat cheese with the consistency of a parmesan. Cheuvront sells their cheeses for about $1.50 an ounce which is very reasonable. I also had a fantastic red sangria that I had to stop at 2 for. So good. \n\nThe service is great, friendly, laid back and approachable. That is how I would describe Cheuvront, overall, too. Check out their website where they have a calendar with their tasting events.", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 5, "date": "2011-10-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "M6hieO-LbXPG1WBQXjXA1w", "review_id": "A8va42L1JUeBn2u2BBjc-g", "text": "Apparently, this place is only hot when a game is on.  I came here on a Saturday night around 10:30pm and there were only 5 other patrons.  The place is huge, so it looked even more pathetic than it sounds.  \n\nI got the Kilt Lifter Scottish Ale, a locally brewed amber beer that was quite flavorful and not too bitter.  They have a good selection of beers on tap including imports and domestic.  I had already eaten dinner, so I didn't attempt to indulge in the Big Unit, but checked out the menu just for yuks.  Quite a variety of options and most meals seem to be named after a certain person.  Cute touch.  But no assignment of credit for who inspired the big unit...\n\nAll the staff here have black teardrops ala Alice Cooper.  Lots of guitars on the walls and three HUGE TV screens above the bar.  Outdoor seating and music blasting in and outside.\n\nThanks to Jim B. for the recommendation to come here.  It gave me conversation fodder :)", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 3, "date": "2008-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WNCNmynlYmIkz2VeTlfVRw", "review_id": "K40IZI9BYOxw1RM0_BYV_A", "text": "I certainly wanted to enjoy this place...who wouldn't? With Alice Cooper's name on the door and his picture everywhere, I thought it would be a hit. I am new in town so I decided to check it out one afternoon. I went on a Wednesday for lunch and sat at the bar- they boast half-priced lunch between 11-3 and have various items half off for each day of the week. Wednesday was 50% off their salads and meatloaf. I decided to go with the Bruce Lee asian chicken salad and coupled it with a nice Pear Cider. I loved looking at all the memorabilia and the bartender was super nice. My salad was disgusting, to be frank. Limp lettuce with some canned mandarin oranges thrown on top and chicken that was cooked in the worst sauce, also strewn about and finally topped with way too much sesame dressing. When the bill came, I saw that my beer was more expensive than my salad! Not worth it. Go for a beer but not a meal.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 2, "date": "2012-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_LsbT_uW0UE6rhsWiAIrsg", "review_id": "S00_vBK0gE9C4O947DfsSQ", "text": "the best of everything food and atmosphere, nothing like it.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 5, "date": "2013-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "APcVBxRZsiAYX6em1MNaTw", "review_id": "V0JgrM-U22L19OBKAKijSg", "text": "Overpriced and microwaved.  Eat more than 10 feet away from the game and enjoy a meal.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 1, "date": "2014-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4CG1zashzJcRHKYrI0sZtw", "review_id": "X851fWwZQAViVn4czQ32cQ", "text": "We came her before the rattlers game and celebrated my son's 11th birthday. Our server was great even gave my son a huge dessert for his birthday.  My Aunt who orders quesadillas everywhere she goes said this was the best quesadillas she's ever eaten!! Good place to come before a game.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 4, "date": "2015-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "fzw2r5fMcB690t3t2aFW4Q", "review_id": "aMtVjFCkQXVHHqc22i3AMg", "text": "We love the Cash. It is one of the few bars that have a smoking patio that you can drink on.\n\nWe have donated a lot of stuff to raffle off for charity events at the Cash. They always have a great turnout.\n\nThe crowd is extremely diverse. The drinks are good and cheap, and the bar staff is very friendly.", "business_id": "c6sTwXAwIAgf2YQtA4ZWHg", "stars": 5, "date": "2007-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZKo-HD5FdrINIHAcD9AnAA", "review_id": "FzvmLNzDEqxWVGNwqrVaAQ", "text": "*nom nom nom!*  Mm, this place is the perfect eatery for a lazy Sunday, or if you are skipping school or work as it's quite naughty.  One of those mimosas and bloody marys in the morning kind of days.  The Garfield is extremely satisfying and the french toast in a cup is genius, if a bit sticky.  But since we are being naughty eating here a little stickiness is probably appropriate!  It is tiny tiny, but I find it amusing rather than annoying.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2009-09-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "kI_tWfzqpcEYFHFJDi3WpQ", "review_id": "QGy5FBDaq0iCUR2eaEi0PQ", "text": "May I just say that the service and food here is awesome?!\n\nI'm in the industry myself and don't like going into a restaurant so close to closing, but we were hungry for good food and they just so happened to be open. The service and food we received was very good quality. They serve burgers provided by Niman Ranch and have an open bar. John Luther (Awesome name, btw!) took our order and was very friendly the entire time. The three of us ordered the No Way Jose Burger which came with a choice of fries or cole slaw. The price is pretty reasonable: $10.75 for the burger and fries. We each also ordered 3 Hess Cream Ales and 3 burgers for a grand total of $55.82. \n\nThe atmosphere was very chill and the clientele, for the hour, was very friendly. We will definitely be coming back here again soon! Especially since it's only a few blocks away!\n\nAlso, shout out to Dreya(?), our chef for the night. Great job!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2014-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "xWdYIUGlQqmJPGq1ahwHmA", "review_id": "1x3NYgruH2jNmJ_U7NcRug", "text": "I tried the pull jackfruits po' boy(vegan) the first time, loved it! and the fish po' boy the second time and oh boy was I happy  with the fish po' boy since I'm a  pescatarian, it was probably the best fish sandwich I've had. I want to go again and try everything I can eat. Also please try the honey soaked beignets they serve so you can die happy.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2014-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lMEfP6_0eIQaT2GWi7Ww6w", "review_id": "dYtA06QfsvVckHEIx88FXw", "text": "I almost never write reviews,  but this needed one. There used to be a vegan ace in LA called pure luck. Had this bbq jackfruit sandwich that I loved. It went out of business a while ago and I haven't found one like it since. Until last night. That jackfruit po'boy was amazing. One of the best sandwiches I've ever had. My hat is off.  Honestly, might even be worth a drive from la, just for the sandwich.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F-IBzB1fUC2nSfvPdus5uQ", "review_id": "M2Syd1NINCpG4b3kqHfpsA", "text": "great place! love the food and the employees are accommodating! The No Way Jose is amazing!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AX_lO-VJm2NnaprSKsesRw", "review_id": "ZmATeGpEFUE-lyjpZ3_5JQ", "text": "Great vibe and good times! Was here on a Tuesday of all nights. Karaoke and pool. Great group fun or if you single and ready to mingle. Gotta eat the chicken wings, Moses style! Tonya the Bartender and JR the cook.", "business_id": "W41CEzdKJe8wdDB-Rd6KJQ", "stars": 5, "date": "2014-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2_-AHV4ha8yNNDkTyxmxEg", "review_id": "bMCHo-GcGpwjebbjkEVxBw", "text": "I love this little place, I've heard they had a lot of problems with the old staff but since then have gotten some great people working. They have great wings, the bartender got me hooked on grilled teriyaki ....if you are going to get them pay the extra dollar to grill them totally worth it. I'll have to go back and try a burger they looked awesome and are cooked in wine", "business_id": "IgaruuknYwCr9afeDYQ_yw", "stars": 5, "date": "2014-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XdopaWy-znJGADkWSAF8Og", "review_id": "zMONHwx-TPiV4xYTzsZBdA", "text": "I'm allowing one star for the hostess, who was very nice. Subpar service from our waiter Michael. When my father asked for another beer, Michael said, don't you want to wait for your meal? He had 1 beer prior. Really? \nMy mother asked for her House Sirloin medium rare, father asked for medium just a bit pink. Both steaks were blood red and inedible. There was so much gristle, you couldn't chew through it. I tried a piece and couldn't chew it. And I have all my teeth! Lol. \nThe waiters and waitresses took the corner booth to eat and talk. We tried for 5 minutes to capture anyone's attention to no avail. When Micheal finally stood up, his response to the fact that the steak was too rare and inedible was \"What do you want me to do about it.\" Loaded question my friend. I'd have been my normal sarcastic self had my parents not been there. They cooked the steak longer but you can't get away from gristle. \nI'd say these two steaks might have been the exception however, the couple next to us had to return their chicken. I guess the cooks like everything rare!", "business_id": "hzUOqxpcnYYBgLlrgvjQYQ", "stars": 1, "date": "2015-09-25", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 4}, "user_id": "1ylYrKcGNA8MDkhNBTjHMA", "review_id": "am6sx9kTWFE4BLC_0BCnHw", "text": "The post-party for the Switch OYE was here. Even if there were only 8 of us. We came just in time for trivia night. Which is apparently a big deal here. I LOVE trivia with useless factoids, so I felt right at home. 40 questions really tries the useless knowledge portion of the brain. Which in my case is most of it. Unfortunately I was already a little sauced and was 3 more beers deep by the time we were done. It was a great time, including war paint. We scored 28 out of 40. I am going back soon to redeem myself. Georgie S, are you down?  We also created a new game that works when Nikki F is there.  If she starts to fall asleep, someone says her name and then rest of the table, in unison, must yell her name again.  Good clean fun!\n\nI like the decor. There are authentic European football jerseys and scarves all over the place. Rugby too. \n\nA couple of side notes. 1 star deduction for, what I am guessing was a manager, coming over and telling us we were being too loud and disruptive. WTF?!!! We are in an English pub, with a lot of beer, drunk people, playing a competitive trivia game. Are you serious!? I was dumb founded and I think I may have talked back to this dude. Couldn't believe it. \n\nI have started my \"Slay the Dragon\" card. Only 61 more beers to earn my shirt. Starting to train now. \n\nSorry for the pic post Nathan S, I had too.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 4, "date": "2009-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "ClptG3R38wR_xM9XVR-bEA", "review_id": "qfzuoP8DGzxq0Gu_qAatRg", "text": "Like many born and raised new englanders, from time to time I get the craving for *quality* British pub food, and in Arizona this can be a disappointment in the making... Until you try George and Dragon.\n\nThe fish and chips is hands down the BEST I've ever had. Scotch eggs are always good, again if you have a palate for this type of fare. They are served with a tangy fruit chutney, and everything is complimented by their exceptional list of beers on *fresh* tap. \n\nLate nights can get a little loud and rowdy but otherwise its a fun and relatively clean establishment. Cant wait to go again!", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 4, "date": "2011-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6670GGYK2G11s-D5JQbgzg", "review_id": "htzgPd2vOIa5cMsfoHaZFA", "text": "I went here on the purchase of a Groupon. It was very interesting, I love pubs and this is the type of \"Cheers\" atmosphere that I could get accustomed too. Casey was our waitress and she was great, food was very good and prices not bad. We will definitely try it again, the only thing that prevents us from being regulars is the distance from our home. The Halo Burger is a MUST!", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 4, "date": "2015-09-15", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "E5QyEU6FCQwnTys0S73zNw", "review_id": "fvDeFn8YwYBOmW0udkRXUw", "text": "Hanny! this was my place. i was here like clockwork every other friday, and every other saturday. i would also stop in randomly on the other 6 days of the week. \ni have history here, some good, some bad. i stopped in here last week on a whim, i saw some friends i hadn't seen in a while so i figured go in and have \"1\" drink. well after my 4th beer and a vodka shot with some fucking hot \"bloody mary\" shit in it. i was at least tipsy. i closed my eyes and walked from the end of the bar to the restroom. yep. can still do it. \n\ni love this place. i wish i still lived in uptown i would still be here all the time. its alot cheaper then my roosevelt addiction. :\\\n\nHanratty's has 3 pool tables, several pinball machines, and 3 dart boards, and 2 mechanical dart boards. deffinetly a great place to stop by for some 8ball. \n\nthe atmosphere here is fucking cool. it's been a valley bar for god knows how long. wood bar, wood support posts, wooden walls, wooden booths. its got more wood then a whole fleet of escalades. i think G-Unit is still jealous. put your hands on this grain my nig.....yea well you get the point. \n\nthe economy has hit this place a little rough..so if you see this review. check out the place. bars like this cannot go under. they need our support. go in and say \"hi\" to Frank. he's cool as hell. Sarah still cute as ever. Save Hannys!!!", "business_id": "VC0VbRhQqvXpolK3pFuZPw", "stars": 4, "date": "2008-11-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "raMSkwLdZ-kFea1fTY_-Ew", "review_id": "jWwoc50VheOEIeCZLyU3JA", "text": "I've been here twice...the first time was driven by a rumor that they made their own root beer.  I'm a sucker for homemade root beer, so I had high hopes that this place would become a favorite.  My husband and I were so excited when these huge glasses of RB hit the table!!  And then confusion...both of us looked at each other and said \"WTF???\"  Worst RB EVER!\n\nWhat the heck was in this drink that made it taste like ass?  We looked all over the menu and found nothing.  Then we saw the \"fine print\" on a small table sign...STEVIA.  It's made with Stevia NOT sugar...I'm sorry, but I have to say that this is the lame-est root beer on the planet.  If I'm going to treat myself to a big glass of homemade root beer, I want it to be delectable...sugar and all...no freaking high fructose corn syrup and no bloody artificial sugars (and yes, I know stevia is \"natural\" but who gives a crap...it tastes terrible anyway).\n\nAfter the root beer debacle, it didn't get better.  The food was meh...service was not so great (there were moments of \"is she ever coming back???\").  I'd say, go here for the beer, sans root, but that's about it.  Otherwise, skip this place and drive out to Four Peaks...you'll be happier all around.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 2, "date": "2009-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I1XJ6wyA9rBgbDBGiDCJfw", "review_id": "IUhz7N6kDxXrRV8CppolXQ", "text": "Came here on saturday before a diamond backs game.  My friend and I sat outside and ordered the beer sampler...we essentially tried every beer on tap.  I was very impressed with the cherry wheat beer as it had a really good balance.  I would definitely come back...easy to get to from downtown using the light rail...The only negative was that they seemed slightly under staffed and service at times was slow.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2012-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "aL3twjz8GSRBaMiCPPDrlQ", "review_id": "gc4CepVTRkgkGT0yBkw64g", "text": "Great place to enjoy lunch with a brew...or two...or 4. Had the Trooper Pulled Pork sandwich with Mac and Cheese. Their Mac and Cheese is EXCELLENT with three different cheeses and smoky flavor.  Wife had a homemade veggie burger with grilled onions and Chipotle mayo. She got hers with kettle chips. Try a sample of beer while you are here as one choice seems to never be enough here! Always with a rotating selection, this is a brewery and restaurant not to be missed!", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2015-10-14", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "a_V8LRfMxGvpGtTwR2olrg", "review_id": "py3N8S86FBNZWljuy4A3cg", "text": "Yes I have been here before...\n\nNow for a person who has been to Italy and has worked in restaurants for years I think I can give a pretty fair review:\n\nMy Girlfriend and I went there very hungry on a Friday night; they were not busy nor slow, about average for October in Phoenix. We called to make a reservation and when we came in we were seated without menus. Now working in restaurants this is almost un-heard of but like I said we were hungry...\n\nThe waiter came over and asked if we would like something to drink (A little rudely) but like I keep saying we were hungry. Since we didn't have any menus including a wine menu, we asked the waiter to see some menus. He proceeded to only bring a wine menu...\n\nAfter we made are choice we laid the menu down in clear vision of the waiter (A definite sign to come back to the table.) He then proceeded to take the other tables' orders. (Perfectly fine). Oh and they had both food and drink menus as this comes back later in the story.\n\nWe waited for a solid 10 min before trying to flag down the waiter....NOTHING. We decided to try to flag him down and he was having none of it. We then got up from the table and left! Walking right passed the so called manager (Older lady with short brown hair) she told us to have a good night as if we just had a great dinner.....\n\nWe were so hungry we needed to go somewhere else!! On the way to a much nicer and hospitable establishment. I called Cristo's and asked to speak to the manager. The lady who told us to have a good night answered and told us she was the head manager and then proceeded to tell us that not giving people who sit down at a restaurant menus unless they ask... I had never been so offended in my life. A straight up LIE!! \n\nI could not hear any more. Hopefully the owner reads this and make this right. I am not seeking anything free I just don't want this to happen to anyone else ... EVER AGAIN", "business_id": "3CSaqRNvYg7ZdN2zwxwzVw", "stars": 1, "date": "2012-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Gaf4_cxaz2s94qOe7lBA6Q", "review_id": "U6hWDi_s1SKzDNOEHbWcNw", "text": "We live near here service is always pretty good and my husband and I enjoy having a place to walk I and feel comfortable with good prices and shot recommendations!", "business_id": "eT-7JjVWhRnkeY2UwXwUMw", "stars": 4, "date": "2012-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oXkbuOiN9HDS3WgOQONfRg", "review_id": "W6Xj0G0AZdyNwY5tXAorRw", "text": "Wineburger is one of those places you know you can go to when you need a decent bite to eat at a fair price.  The cheeseburger is decent - standard bun, lettuce, tomato, pickles, and cheese (no onion for me, thanks)... but little flavor.  My lunch companion said she tasted the flavor of the red wine but I couldn't.  The fries were surprisingly good, and the basket was enough to feed at least three people.  My iced tea was strangely bland, watered down, and sour, but not entirely unpleasant.  Our waitress was really good, though - attentive, friendly, and all-around pleasant.  Another important thing to note is they are a cash-only establishment.  They do have an ATM, though.  I don't think I'll ever find myself craving a burger from Wineburger, but if I find myself around 16th St. & Camelback without any other options, I'll likely stop in for a quick bite.", "business_id": "ntJAKLAq0cXzzdFgPoo0Iw", "stars": 3, "date": "2009-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-SZjigU9al7-VwRajHNFiQ", "review_id": "pZ3nF4FfDwFHCmXmjJ8xTw", "text": "Was totally surprise last Friday night to go to Harvey's and find out that their Wings which were 10 for $7 are now 6 for $7.  Was a good local place but really $14 for a dozen wings, too many places in a mile radius with atmosphere.", "business_id": "ntJAKLAq0cXzzdFgPoo0Iw", "stars": 2, "date": "2014-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "U07D8HjVB7TLKq6ZMVT91A", "review_id": "VMYAUlH3v_bm8WKF7WV2Jw", "text": "I love PCG! It has to be my favorite restaurant, aside from Houston's. The brie appetizer is soooo yummy. And last week I tried the Portobello Mushroom Sandwich. It was sooo good. The bacon wrapped shrimp is good, but after two, you feel a little weighed down. It had some type of white cheese in it- not necessary. I shouldn't have tried it anyway- I am trying to be a fishetarian. They have great simple salads. And the cedar plank salmon is absolutely my favorite menu item. mmmmm.....", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 5, "date": "2009-10-08", "type": "review"}
{"votes": {"funny": 10, "useful": 13, "cool": 12}, "user_id": "n9Zg0jlOGtxfIrvoPm6Hhw", "review_id": "aRehDgbzaSmSLh2l6REQIg", "text": "Walking into PCG on a recent Sunday for brunch, I wasn't sure what to expect.  The place was pretty much empty.  Coming off a few less than stellar recent brunch attempts at other local spots (why is it so hard to find good Eggs Benedict!?), I took this to be a less than favorable sign about the meal ahead...  \n\nWell, I was wrong...  PCG served some of my favorite things!\n\nA mimosa with fresh-squeezed OJ started things off nicely.   :)\n \nOn to an appetizer - yes, even brunch deserves an appetizer!  I was happy to see Jumbo Bacon-Wrapped Shrimp on the menu.  Now that Wildfish no longer serves them, I have been hunting for a new favorite.  These were delicious - 4 large shrimp, stuffed with cojita cheese and wrapped in bacon - perfect with the accompanying chipotle-lime aioli.\n\nAnd last, the main event.  The Tenderloin Eggs Benedict was fantastic.  Two English muffins graced with generous slices of medium-rare tenderloin, poached (not overdone - hooray!) eggs and tangy hollandaise.  This masterpiece came with diced breakfast potatoes (not greasy at all!) and a small bowl of fresh fruit.  Yum!  \n\nThank you, PCG, for renewing my faith in brunch.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 4, "date": "2012-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qrfjRU0UVlmb1EE9DPD1TQ", "review_id": "Djju5ec8tKMtheaB1jQekw", "text": "Great good, service! Servings are large and care to presentation is evident! This restaurant deserves 5 stars!", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 5, "date": "2014-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_qDCRA8PTafuoXc0VWyBlw", "review_id": "bKHIo-kVi9TxxJ8DfI-pUQ", "text": "I love the Duck! My mom has taken me here for years growing up and I always loved their sammies and pickles. This last weekend a friend hosted a bridal shower for me on the patio and it was an amazing time.\n\nI didn't know you could reserve a private patio and it had the perfect mix of sun and shade. We had sammies and fruit salad catered and bought a few bottles of champagne. What else do you really need for a good time?\n\nWe ended up staying a little longer than our 3 hour reservation and never felt any pressure to hurry up or leave. We still heard the live music and got the energy of the other patrons while having our privacy.\n\nFood was tasty as always. Fresh veggies, hearty bread and I love that pine nuts are in the veggie. One of the best lunch spots ever!", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 5, "date": "2009-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tXhlRAnR3_GoWvewfQni4Q", "review_id": "YV2mNsXYtd6fBiZYcnyk7g", "text": "The cheese selection is very large and reasonably priced for the kinds of cheese available. That is not to say that duck and decanter is cheap. I prefer the staff at the north central location over this location. Duck and Decanter almost has a monopoly on unique cheeses, coffees, teas, etcs. The only other real option is AJ's and the prices there are exorbitant.", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 4, "date": "2012-10-17", "type": "review"}
{"votes": {"funny": 6, "useful": 6, "cool": 5}, "user_id": "VD101SO18FEaE0vM7x4iEQ", "review_id": "d4QqGmWSgP_bKjb5H-EduQ", "text": "Oh dear Swizz how I adore you. (already..!)\n\nYou opened your arms to me widely and took me in and soaked my liver into oblivion. \nA warm (although ACed) comfortable dark womb-like oblivion.\n\nThe bartendtresses know how to pour, like monsoons pour, you would think they are trying overflow the cups of bliss or put out a nearby imaginary fire that is threatening your invisible Lilliputian drinking friends and their mini-city that dwell on your cocktail napkin. ***(my vision is never clear enough, micro-capable enough, but I know they are there. I wonder if they live in a blacktopped hell of strip malls as well..? maybe that's why the 'lil folks need to be dowsed with anesthetic...?)\n\nThe juke has Steely Dan's \"Can't Buy a Thrill\" on it.... Aces.\n\nNo need for pest control...\nThe flies 'round here are instant family... and sometimes buy rounds...\nEven shitty/shifty/grumpy Uncle Bill/Bob/Mike is an a-OK guy and your pseudo-Aunt Wilma would love to buy you a beverage... a very unhealthy and wonderfully euphoric beverage to be specific.\n\nand then I found the Wednesday night trivia hosted/created by the lovely Lindsey . \nFYI: This trivia is not  for drunk dumb folks.\nAnswer her riddles first, reap the buzz post quiz, then make yourself happily unintelligent. \nYour wallet and prestige can benefit!\n\nMake sure to ask Sarah 'bout her California Brazilian Wax Makers Mark Experience. \n***(please just do not feed her any of the devil's lifeblood! I hear it may be very dangerous! ;)\n***(actually don't ask her. I want to savor that storied story for my own personal humor-self-storage reserves.)\n\nLong ramble short...  Short swaggle swizz...\nJust like the door reads: \"Swizzle in, Stagger Out\".  Exactomundo.\nJust be damn careful (get a cab!).\n\n***I found this place due to the mucho-helpful Yelp.\nSo thank you YELP and the Swizzle thanks you as well, just don't ask my wallet or liver to comment.\n\nCheers!", "business_id": "mgllPJA6NQXlJurFWAkqQg", "stars": 5, "date": "2008-09-17", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "llkm_iXQszkN5DZvmqjNqA", "review_id": "cntB5Mz7rykiLJqTvsQwYA", "text": "i went there once a while back and it was dirty and never went back... but if Stevey is right about the drink specials i might have to re-visit", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 2, "date": "2006-11-27", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "vjU0uDNyPTUVVF7RX_yaRA", "review_id": "77UWzDonhd_xRn9Zo0Ae4g", "text": "I think it has to be said that this place is definitely more of an OTB than a restaurant/sports bar.  With that being said, it's not a bad place to grab a drink, get some grub and watch a game.  You might have to fight with the people focused on the horse racing, but it's not too bad.", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 3, "date": "2012-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5Y9gDwrfO2NiHHhEBeE5_g", "review_id": "3TAv3Vth4u3JkKdcGBJkYA", "text": "Probably an ok place to grab a drink and watch some sports but wouldn't recommend you eat there. I ordered the chicken/brie sandwich - sounded lovely on the menu but it was boiled chicken - so rubbery it was tough to cut through. My husband ordered the steak tacos. They were so greasy he couldn't pick them up. We both had bad stomach ache for hours after eating there.", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 1, "date": "2014-11-15", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 4}, "user_id": "mF3VUdKq6kR-MXaFaRfzQg", "review_id": "X-97CaHsLNuKKtZJXSXrpQ", "text": "This place definitely has an upscale loungy feel to it. The only way I found out about it is because I work right in that area. I can see how it would be a nice change of pace from the typical clubs around the valley. It would be a good place to start the evening and maybe impress some people visiting from out of town. \n\nThink of a place you would see in L.A. or Chicago. I have been to places like this in each of these cities, dark, swanky, cool, hip. My secret hint for this place is that you can see certain Suns players come in late at night to hang out.", "business_id": "peA3F-PnIfijYr8HuG-A-Q", "stars": 4, "date": "2008-09-03", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 1}, "user_id": "gl0cKc12NfoPnDgMus8WNQ", "review_id": "VfEli4aZkoaIyb-hQcBMxA", "text": "Can't say I really KNOW this place, since the only time I've been to MercBar was around 2:30 AM. But it's a lounge. I think MercBar would even go so far as to say it's a CLASSY lounge. Lot's of loungy things like leather, and brass, and dark wood. The barmen are coiffed in style, although patrons won't be out of place in a nice pair of jeans and a nice t-shirt.\n\nPizzazz does have a price though, and the \"beautiful person upcharge\" is in full force here. Expect a good $10 for a cocktail. They do make them nice though. The bartender was knowledgeable and served up an excellent Manhattan.\n\nGreat for: the cocktail and conversation crowd\nNot great for: those prone to spontaneous removal of clothing/dancing on tables", "business_id": "peA3F-PnIfijYr8HuG-A-Q", "stars": 4, "date": "2014-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5qHu6jYL0cdtbOa3KrkjMQ", "review_id": "-LFPL-RvkYyj9OQ5uxNgHg", "text": "A big THANK YOU to Capital Grille, Ann (the event coordinator) and the servers who helped us with my brother's dinner rehearsal.  We had 34 guests in the Biltmore Room.  The food was amazing and I can honestly say, I have dealt with many vendors and this event was seamless.  They went above and beyond to make our night special.  I feel horrible that I forgot the head server's name, but he was THE BEST.  Thank you!  I highly recommend this venue if anyone is looking to host a private event.  THANK YOU ANN AND CAPITAL GRILLE!", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 5, "date": "2011-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "USN7sbfqxbwi1hYnw0QFhQ", "review_id": "e2PIY8j0fccVIV48WXhc5A", "text": "My husband and i spent his birthday Tuesday night with Ricky. The service and suggestions were amazing-we loved the wine and splitting the delmonico with two different preparations. Outstanding service, enthusiasm and a great experience with Ricky.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 5, "date": "2014-11-07", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "HP_xZYNC5XK-VyNrnHbtRQ", "review_id": "4oJvTlKtwLFzLHPPMKq_0Q", "text": "My husband and I used to frequent the Keegan's in Ahwatukee, but we have moved from that area and are slightly closer to this Camelback location. \nWe ate breakfast at this location for the first time yesterday.\n\nI found the service to be a bit slow, but our server was very polite and accomodating.\n\nI ordered the cinnamon brioche french toast. I would go as far to say this is the best french toast I have ever eaten. It was so moist and tasty! \n\nI like the set up of the Ahwatukee location better. The bathrooms at this location are not as nicely kept as the 'tukee location.\n\nI'll definitley be back for Sunday brunch again for some of that great french toast and hope to check it out for dinner some night. Keegan's usually has some good, home cooking dinner specials, so when I'm too lazy to cook my own meatloaf I'll head here on a Monday night.", "business_id": "rVUEZpHQfWI_3kt0lBwaxQ", "stars": 3, "date": "2008-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ru1-YkqkCmvk_7VW_F8Tfg", "review_id": "OyviVMepucam5rcFnv0W2g", "text": "Not great. Very empty at dinner time on a Thursday. Odd crowd and wait staff seemed uninterested in our table. Food was pretty meh, will not return", "business_id": "rVUEZpHQfWI_3kt0lBwaxQ", "stars": 2, "date": "2014-10-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "9F3ZmyGKIA6ALNWgEq3Log", "review_id": "lEu__tqfStSh8IbG7BKHjQ", "text": "I couldn't find anything wrong with Avanti. Five starts across the board! To starters, the decor is amazing. It is right out of a scene in Goodfellas, or even Scarface. Think elegant 80s chic, right down to the zebra striped chairs. The service is spot on; this isn't your chain joint with some struggling actor as your server. All the servers here know their menu and their wine pairings. The food is the icing on the cake! Everything here is authentic italian, and it is downright delicious! The boo and I had bruschetta as a starter, then moved on to the pasta trio with the gnocchi, vodka sauce penne and fettuccine alfredo. Everything was creamy and cooked to perfection, and we finished with their tiramisu, which was divine. Drinks were strong and were perfect; they have an excellent martini here! All in all five stars, this is an excellent place for birthdays, romantic dinners, and special occasions. Avanti has lots of character, check it out!", "business_id": "vvA3fbps4F9nGlAEYKk_sA", "stars": 5, "date": "2012-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ky5-mOk8-9M-NlLr8Jh8rA", "review_id": "ze3o2jObTDpqtc9X81kybw", "text": "Sophie's serves consistently good, authentic food and has fun French bistro atmosphere.  The menu changed from the last time we were there, and while it didn't bother me, my boyfriend was disappointed about the absence of mussels on the dinner menu.  We got escargots instead - the 1st time I'd tried that.  Everything seems really fresh, and service is attentive.  The manager on a recent Saturday night seemed to know exactly what every table ordered and how much they had eaten.  He was concerned that I wasn't eating my crepes - too full on everything else including the cold avocado soup.  Duck confit cassoulet was sold out by 7pm on Saturday but the boyfriend's coq au vin was apparently quite good.  I had sea bass and gumbo crepes - surprisingly good.  Wine list - meh!  For dessert, we're creatures of habit and always get the apple tart.  They give you yummy little truffles with the bill.  It's quaint, quiet, and delicious.  \n\np.s. Thomas is an awesome waiter, and I don't know him personally.  :)", "business_id": "PuHucejs4LG3hSXnrwi9-g", "stars": 4, "date": "2010-09-13", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "StpZu9cJ5gCyPVIzI86H7A", "review_id": "zBVJk5g7MjefLJGKzXuJDA", "text": "The service and unique location make this a great hockey dive bar. You can watch live hockey at the rink right in front of you and have the numerous tv's playing other hockey or any sport really. Funny locals that have been going there for years make it a place to call ur hockey dive bar home.", "business_id": "yb17xHvhDJthJGS10uhFeQ", "stars": 5, "date": "2014-11-09", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "_6NI9_kujXCUEiwrnDI53g", "review_id": "BfV2RHrqYI_UEsv5tgORLw", "text": "Love this place!  The wine selection is awesome and the food is super yummy.  I recommend you order the brushetta sampler, there are so many options and I have tried and love them all.  On Monday's they have half price bottled wine night, excellent for happy hour.\n\nMy only complaint is the parking situation, I hate that my only option is valet.  Why can't I just park my own car?  It does get packed in here so come early, it is busy because it is awesome.\n\nOne other thing I have noticed and really appreciated is that everyone who works there is guest oriented.  I had a manager opening my wine for me, the hostess told us about the specials, the waiter helped us move from the lounge to the restaurant, it was great.  There was no, \"Oh, that's not my job, so and so will be right with you,\" they take initiative and focus on the guest, something that is lacking in too many places today.\n\nLove it, can't wait to go back.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2008-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sALB8-F04S9VcZMF_GkGUA", "review_id": "9DfRwj1OVyTgjH_W1HaS-w", "text": "Still a 5... Still my fav wine bar , date place.. Or place to hang, get good vinos & gossip... Cheap valet.. But if u snag a LGO place, I think.. Free. Bruschetta.. Not any, any other wine bar.. Can compare.. Yummy sweets..& staff is amazingly nice.. Even though this place is always standing room only..", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2010-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M6kAQ2anG2c8-fcoHEC_1A", "review_id": "2d_IT91a90AHAEhGvrHC-A", "text": "I really adore this place. I've eaten here many times and the food has always been excellent. The atmosphere is fun and hip. The servers are friendly and helpful.\n\nThey offer a wide selection of bruschettas. Each selection is more delicious than the next! I especially love the prosciutto with figs & mascarpone and the ricotta with dates & pistachios. Their salads are tasty and are a perfect portion. I love their Pub Board with a nice cold lager. When they have tomato soup you should get the grilled cheese panini. Soo good! Good prices on wine and other drinks. I've never had to wait very long for a table, maybe 5 mins at the most. The only downside is parking. The last time I went valet was mandatory and felt a little ripped off to pay $3 for someone to park my car three feet from the valet stand. Oh well!\n\nCan't wait to go back!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2010-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NqjJrT2dGRvVyn9aycy_lg", "review_id": "L4k7DBBYBY0_nedfeavGMg", "text": "I love the decor and ambiance, the food is delicious (try the brie panini) and there are plenty of wines to choose from. Plan on spending an hour or two to relax.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2010-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Q-e5Kriu18oFX5orJkoNhA", "review_id": "xsg9eHyr2esatS1Aue_tdA", "text": "There is nothing better than a lazy Sunday at Postino. Actually, there is nothing better than a lazy any day at Postino. The food is great, the wine is great and the service is (usually) great. Along with the bruschetta, which is yum, I always order the Italian Picnic salad. The beets and bacon are delish paired with a creamy, Italian dressing. The only downside is the parking. Very limited and usually you have to valet. If you are in the neighborhood I recommend walking or biking. All in all this place will not disappoint.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2011-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gB5gmjulziNkE2brvm3w9Q", "review_id": "N5fLoLf96K8gvzwcbbsMOw", "text": "I was a bit skeptical of Postino because I had heard so many great things about it and didn't really understand how bruschetta could be that great, but now I'm a believer. It's the whole package of the location, the vibe, the constant crowd, and of course - the amazing food! I ordered a board of bruschetta, planning to split it with my friend, but then remembered she is unable to have gluten! It was so delicious that I finished the whole board by myself! I just couldn't say no to the brie, apple & fig, or red peppers & goat cheese, or prosciutto, fig & marscapone, or the burrata, bacon, arugula, & tomatoes. My fave of these four was the brie, apple & fig. Deeee-lish!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2012-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "X-AOcuGqWACSwAusrjYIpQ", "review_id": "Vxl1oK5hWGTicK-L0WmvVQ", "text": "My fiance loves this place.  I therefore love it as well, since the majority of my reason for choosing an establishment is to make my fiance happy. anyway, the place is trendy and fun and I would recommend it as a great place for a first date.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2012-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "mFhQOr7NPhGwx4GnnxTFaw", "review_id": "WxKGUQLYNqcPybTOOM1tZA", "text": "Postinos is one of my favorite places to go monthly for a light dinner and wine. I get the bruschetta every time and I am never disappointed. The servers are always very knowledgeable on wine and will give you a great suggestion. I have had some of their Panini's and soups and those were also delicious! The Arcadia location is also my favorite Postinos to go to; I love the atmosphere.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2013-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bi8KZ9Ykvu3lCsMJAV0zpw", "review_id": "MaoYYr7QYsQjwnGXmGxgLw", "text": "The bruschetta and pub boards are to die for, and we look forward to the $20 wine & bruschetta deals on Mondays and Tuesdays every week! Get here a bit early on those days though, as everyone likes this great deal.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2013-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "fEj_XwjnerQDYBMM120zmg", "review_id": "IcyKW2rS49SoPegztzwiDw", "text": "Absolutely love this place! The food is amazing. So full of flavor and each meal is prepared with careful attention to detail with the freshest ingredients. Always trying new wine with great recommendations from the staff. All that combined with a fair price & terrific customer service will always keep me coming back!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2014-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GiR3tvTaAhZSnWKZ24dR_Q", "review_id": "TMuv2CHjbIR_uufZ0C9O2w", "text": "Definitely one of my favorite places because they have great wine and yummy bruschetta! I've brought family, new friends and pretty much everyone here. We always get the bruschetta here! It's the perfect sharing plate. The live music is a plus when they have it and it's just a chill environment.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2014-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DoWoU8jfwCh9DyjEECTyGg", "review_id": "hpzPVfTYCAyYbhTLU0uz2Q", "text": "Postino's is a well decorated, little restaurant located in a former post office. My husband and I shared an order of bruschetta. We chose the apple and Brie, salmon and capers, BLT, and seasonal bruschetta. They all were quite good and imaginative. We were there in the afternoon, but I would definitely recommend the $20 bruschetta and bottle of wine special on Tuesday and Wednesday (I think that's right) after 8pm. What a deal! \n\nMy only criticism is that it felt like we had two waitresses and one of them wasn't very friendly.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2015-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "asd1tyY1GHgib7muisSEsA", "review_id": "83dKN1roKsLo2wp6lqYydQ", "text": "Wings were OK. Liked the Yella Pilsner draft special. Decent dive bar. Real good ranch!", "business_id": "qz4ZOcv-840UjfCEYI4qZg", "stars": 2, "date": "2012-10-29", "type": "review"}
{"votes": {"funny": 5, "useful": 2, "cool": 2}, "user_id": "Cp-PV8rsypbO-xBrQ6KmQg", "review_id": "GImkvhB_iw6M4cZWqnhstg", "text": "Sure, it was a school night - but the place was deserted. Well, apart from the few people taking up the bar games... though they all did clear out by midnight. The bar location didn't seem like it would really draw people in on that alone. Think: East Phoenix 70s mini-strip-mall...\n\nThe bartender went to my high school and had been in the valley forever. The vibe in the place was very old-school local. Valley natives would feel at home I imagine. The location probably has a bit to do with that. \n\nBefore everyone cleared out, I joined in a chat with some of the regulars - they were quite friendly and I would feel quite comfortable going back based on that. Smart, young, and good-looking... also hip and down to earth. Pretty refreshing, really. \n\nThe drinks were quite strong... plan a designated driver or an alternative method home if you're going to drink. The atmosphere was 'dirty old dive bar,' but I've definitely been in much worse. I'd say it's on the clean end of that description. However...\n\nI went into the men's room to take a piss and someone had splattered their own shit onto the wall of the tiny bathroom. It was a big splat about waist high, streaks going from splat to floor where there was a big shit pile. What kind of person throws their shit on the wall? I mean, seriously...\n\nI took a picture with my phone and pissed and then left it as it was. I told the bartender about it and she seemed to immediately know who had done it. I mean, if you know a person is capable of shitting on a wall - don't fucking let them into your bar... duh. She said she wasn't going to clean it and said I could use the ladies room (which I did the second time I had to piss). I guess I don't blame her not wanting to clean it... it was gross. \n\nNot too gross to take a picture of though - should I submit it to the photos of this place on here?\n\nI guess apart from the shit and the location, this place is okay for a local dive. It's punk-friendly and has plenty of bar games (pool, darts, etc...). It's similar to TT Roadhouse, but with only half the character - also a little more space and fewer customers.", "business_id": "4vZZjr6IZAk4riT0DB8MbQ", "stars": 3, "date": "2007-11-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ICMoG7iQUdKbxnGuTZ_IUw", "review_id": "dvi4Pv5kiogLeuZHSUviLA", "text": "I love this place. Foods always great bartenders are so nice. Bloody Mary's are amazing ! I always stick to the biscuits and gravy", "business_id": "RIeWXLMHZQlYprYt1x2f1w", "stars": 5, "date": "2015-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fOfn3XczMmQ-WzLLZ_Mz0w", "review_id": "3XqQLoENUukM46xlzlraPQ", "text": "It's a sports bar type of place.\nThe service has always been good to me here.  :)\nFood is standard for a bar but pretty good. Try the wings.\nOn karaoke night there is this older gentleman who belts out all your favorite grunge tunes from the 90's. I don't like karaoke but this is a treat, hahaha", "business_id": "F-ykHfGY9lWr12OJ_Ofy7A", "stars": 4, "date": "2012-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YJi-6seHWHBXui8bi6TjlQ", "review_id": "m_7xh2ClNZ66k_bfZKVX_Q", "text": "I waited at the front for about 10 minutes before someone finally noticed me. Our service was very attentive.. almost too attentive. They kept interrupting me and my boyfriend to consistently refill our already full waters. We had probably 3 different servers that night and although it was 10pm, they were very off task. I could hear them cussing and messing around in the back. My skillet cookie wasn't very good either :(", "business_id": "_BU867oRCLZnDIRmg7S6Wg", "stars": 2, "date": "2014-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LL5VZd-Hy3BQrLUypv6fNw", "review_id": "I3GnyFU0KSNivnTXCOiNgQ", "text": "Good food great service and atmosphere!  We stopped in for a quick Drink and really dug it.  Super comfortable friendly employees, drinks are priced right.  HD tv everywhere and just cozy sit down place to hang out and relax.  Go now.", "business_id": "kvxrjOmicwb2njvXOJsZRw", "stars": 5, "date": "2015-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AqwiBcQcQpCvlQ5KtYuH4g", "review_id": "mSUUb9bRxfS45fn9TjNwpg", "text": "This place is cozy and so New Yorkie!  Great service. Authentic Italian flair. Calamari is very light and selfish. Caprese salad is so good with in house home made mozzarella. Chicken Parmesan is so good!  We will be back for sure!", "business_id": "jq_YnMQjcArdBWuwRospFg", "stars": 4, "date": "2015-11-21", "type": "review"}
{"votes": {"funny": 19, "useful": 5, "cool": 8}, "user_id": "HOleI3jz1MLNUJ6cc1x0Pw", "review_id": "5h6lRtXvNlwYTU4kZKUdBQ", "text": "[Scene] \n\nIt's 5:45 PM on a Sunday. A man and woman are in North Phoenix meeting some friends at Sala Thai for dinner at 6:30. With so much time to spare, they decide to grab an alcoholic beverage. Thanks to Yelp on the man's Blackberry, they see that The Blooze is right down the street. They pull up into the shopping center shared by Big Lots and park in front of the bar. They open the door to find a dimly lit room with a bar to the left. There is only one open seat at the bar, so they decide to order a drink and then go sit at one of the high tables on the right. A man sitting to the right of the open seat turns toward them. As he opens his mouth to speak, the man and woman realize that he is missing all of his front teeth. \n\nMan with no teeth: Take my chair! I'll stand. I've been sitting for hours!\nWoman: Oh no, that's ok. We'll just get our drinks and then go sit over there (points to high tables). \nMan with no teeth: No, please. I insist. Take my chair. Sit at the bar. We're all friendly here. (He struggles to stand up and then kind of shoves the chair towards the man). I mean, unless of course you want to make out or something. \nMan: (Laughs). No, I think we'll be fine. \n(The bartender approaches). \nBartender: What can I get you two? \nWoman: Two vodka sodas, please. (She and the man sit down in the two chairs). \nWoman (whispering in man's ear): We'll only be here for a minute, so you're ok with sitting here, right?\nMan: Yeah, yeah, it should be fine. \nMan with no teeth (extending hand for shake): Nice to meet you two. My name is Eddie Vedder. \nWoman: Really?\nMan with no teeth: Yeah, like the guy from Pearl Jam.\nWoman: I don't believe you. Can I see your ID?\nMan with no teeth: Yeah, I get this all the time. (Pulls ID from wallet). Here you go. \nWoman (turning to whisper in man's ear): Haha! It's spelled Eddie VeTTer. With two Ts not two Ds. (Hands ID back to man with no teeth). Great!\nMan with no teeth: Yeah, Eddie's my third cousin. My wife didn't believe it when she first met him at our family reunion. She was like you're related to Eddie Vedder the singer? Are you two married? I married my high school sweetheart, Christina. Do you have kids? \nWoman to man (whispering in ear): Oh. My. God. \nWoman to bartender: Can we get our check? \nBartender (incredulously): Oh, you don't want another round? \nWoman (handing bartender debit card): No, thank you. We're just going down the street to meet some people for dinner. \nBartender: Sorry, we actually have a $10 minimum to use a card, and your total so far is only $5.50. You might as well \nWoman: Wow, ok. I guess we'll have two more. \nMan with no teeth (who has been staring at bartender's cleavage this whole time): Haha, oops, sorry. I've been skiing the slopes for the last few minutes. \n(Woman squeezes man's hand as if to say OH. MY. GOD. WHAT ARE WE DOING HERE?)\nMan with no teeth: So, anyway, as I was saying, I married my high school sweetheart. We had kids right away. We've been married for 30 years. Except we're separated. We are apart except for the good stuff. He. He. That's right. I'm so glad to hear you don't have kids. It's important to grow the relationship first. \n(Woman keeps glancing around)\nMan with no teeth: If you want to make out, I can leave you alone. \n\n[15 minutes later]\n\n(Man and woman are walking out to car. They turn to each other with looks of disbelief and speak at the same time). \n\nMan: OH. MY. GOD. \nWoman: OH. MY. GOD.", "business_id": "f_leeIRar8uNCkk5sAmHRQ", "stars": 3, "date": "2008-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I1Qj9NnnTEXQpEqQqGV6WA", "review_id": "uej0BDCEZq3xScjumKRPmQ", "text": "A dive, in a good way. Not fancy, but tasty! We are here for Saturday morning breakfast. The crowd is a mix of folks that seem to have been here all night and hard working folks out so mom doesn't have to cook. Our breakfast was nicely prepared and delivered quick. Service with a smile by cheery and professional wait staff that had no need to write down our order. (Ask for Nikki). I'm always impressed by a real pro the can perfectly remember an entire tables order. \n\nIf you are in the hood one morning, you can hide here and enjoy a fine breakfast.", "business_id": "JImJictLIE48_O1z-l2TGw", "stars": 3, "date": "2015-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gKjo91GulBukKiCAV4A1JQ", "review_id": "4FRo9KSTaGAUFdfieKEPbA", "text": "Bad customer service, my bar tender is still washing dishes when my friends is ready to pay.", "business_id": "vFJmFFfPVhHkC3bWOeZnNA", "stars": 2, "date": "2014-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6KLOAlDcBM3MqGOb7yqxhg", "review_id": "iOQBDUQ3cgGEKZ_9yntPmA", "text": "My husband and I enjoy going to this bar.\n\nWe have gone many times and we pretty much always get the same thing.  TACO'S and BUD LIGHT.\n\nWe have gone here for many years and we always have good food, good beer, and great service.  We have taken others here and they seem to like it too.\nI would like to come here on a night where they have something going on, as long as I have a DD!!  :-)\n\nThanks Bridgett for the great place to go for some good & inexpensive drinks and food!!!", "business_id": "-xLwGUmmyKgsTtFOOXzjeg", "stars": 5, "date": "2013-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "tRStM37q7iXbHzSfjQ8bYg", "review_id": "ELv7Uf-ecVPvbYQMYqIdag", "text": "It's my understanding that some married ladies I know went to Whiskey River for a girl's night, and were asked to leave because they were wearing wedding rings and were deemed \"unattainable\". I'd really like to know how you can justify this, if this is how you treat customers, I would not be surprised if you were facing a lawsuit for discrimination soon.", "business_id": "gOlJQuE3WYeMgXXDKYfdeg", "stars": 1, "date": "2013-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nl-1YfZZjJgRV9PeUAdCXw", "review_id": "5AI4KP3b8wjPqw1jRRncGA", "text": "I've been here a few times and each time was fun. The drinks are cheap and the bartenders are friendly.  Good neighborhood bar where you can drink cold beer and meet new people. Casual atmosphere and relaxing.  Can't say I'm a regular but I'm working on it.", "business_id": "E-_PkZNDuYxW1zs4XFlVmw", "stars": 4, "date": "2011-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nP4X1Y7SNVHMtRAXhqZldQ", "review_id": "qGky8xCgwHcWFlICBDJeLg", "text": "Visited this location for the first time tonight.  I had the California Chicken sandwich and substituted the broccoli for the fries\n\nThe chicken sandwich was excellent,  very tasty.   However the broccoli was very bland like it was washed under hot water and served.   It definitely could have used a step up or two in flavor.   \n\nFor dessert I got a piece of  cheesecake to go with strawberries.   It was a good portion,  but just average in flavor.   However, they did't pack any plastic wear or napkins with it which I would assume there would be with a to go order.", "business_id": "SgGINtDKQgoXoAnQgrDKDg", "stars": 2, "date": "2012-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "omoEjYFKVV7e-DtnezeUOw", "review_id": "U7SVev7C9z-98TH375RHZg", "text": "Had a wonderful party at this place last night for a friend.  The back patio is perfect for this time of year with a nice private and relaxing feel.  The food was creative and wonderful and the wine was the perfect temp.  \n\nA musician by the name of Blaine Long was playing on the patio and the guy just blew me away.  All original music, great style and feel, and he knows how to control volume and tone so damn well.  Certainly the best musician I have heard in an Arizona bar/restaurant after living here for 15 years.  \n\nI will certainly be back to experience an evening without the party.  The staff was very good and professional.  They thought of everything the guests could need including blankets for a baby when the temps dropped.", "business_id": "Our6bzte5W1wlIeOu9luug", "stars": 4, "date": "2013-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lzJREEn493Km2qVaR9sLaQ", "review_id": "G39HGpslothA6rfuPyeNlA", "text": "Excellent service!! I love that this place is so homey. The new music venue is awesome. Great happy hour prices!", "business_id": "Lk-FP6yxYRTcU52SaTx2EA", "stars": 5, "date": "2014-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AHEjsbiM-I3if_qbEa9eeQ", "review_id": "Tf6dD1Bdd5mET0ZqZ1Sx6Q", "text": "Server was very non chalant from the get go. Not saying bad but attitude didn't sit well with me, kind of felt like I was lucky he was waiting on me, rather than him appreciating us as guest. Never even asked if this was our first visit or not. \nDid the scallop wrapped bacon w/ raspberry chipotle sauce - to bad they use pre cooked bacon to wrap the scallops the bacon was cold. Garnished with lettuce tomatoes and cucumber ( over kill)\nBread was really tasteless. \nSalad was wilted - tasted good \nFood was fair not a WOW!\nOkay totally a disappointment dessert TIRAMISU -- the worse that I've ever tasted!!!!\nBig question: Would I revisit: NO - only as part of a group would I not on my own. \nThen why three stars - to be fair comparatively to other restaurants that's what they deserve.\nI can only say try them you might enjoy their food.", "business_id": "S3FhtwXuiGMlGdBNtmiiSQ", "stars": 3, "date": "2014-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oAb4GTAjBM9bOOLo1ZN3jQ", "review_id": "W2gjej3e7TmI9rOLm38UMA", "text": "Don't do the nachos. Pretty generic Sysco canned cheese and chips.\nGood service at the bar tho. Shannon was great.\nI've ate here before and good service and good but you can tell some/most of the stuff is Sysco food.", "business_id": "e0vubCKi8KD8zC2C6FdbuQ", "stars": 4, "date": "2014-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "2qKgObPOV1kDl6U08Mjxyg", "review_id": "HG-fuyuFWveFDLxVPQICLQ", "text": "I went in here for a midday drinky drink! I had their bloody mary.  I would have to give it 4 stars.  Tasty, tangy and not to salty. Just the way I like it.  Atmosphere was calm for a Sunday.  The food looked fabulous and the server recommended the coconut shrimp.  I shall try this next time my friends :)", "business_id": "QzXFdjIbFRGhzL83goPPLA", "stars": 4, "date": "2012-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_5tSO5BQD-EH0XW_ngzQKw", "review_id": "HRkdV7A5tb7iw64LDsJDdw", "text": "This place is still terrible with new ownership. Food cold and tasteless. Unfriendly atmosphere. Save your money and time. Terrible snob attitudes!! Never will go there again or recommend this place to anyone!!", "business_id": "d-rZazFFYvnjRZUhLTEUZg", "stars": 1, "date": "2014-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h7YB0darjysgjqkm7Q_x-A", "review_id": "CBBNKJVGLfDXZhPfEGkEgg", "text": "As a fan of dive bars I have to give this place a big thumbs up. I may be a bit jaded though by have alot of friends play here. Cheap drinks, dark, low stage all pluses in my book. Also gotta love they serve white castle burgers. If youre into dive bars you definitely gotta hit this place. \n\nOh yea, and the pool tables are shit.", "business_id": "Cp5_NSJFNgylD5SUdmT8nQ", "stars": 4, "date": "2008-11-23", "type": "review"}
{"votes": {"funny": 4, "useful": 9, "cool": 5}, "user_id": "tlSSQwfHYJany7wPoTH46A", "review_id": "zxxoagyoM_nDJ4HVGg8k7g", "text": "I am a geek. I don't know why, but I really like establishments with the word monkey in the name. Tickles me pink at an adolescent level, like nut shots and fireworks. So Uncle Monkey's Bar started off at an advantage. \n\nIt's definitely a dive bar, so don't go in there expecting something fancy schmansy. It's got monkey in the bar name, people. That should pretty much tell you everything you need to know about what awaits you inside.\n\nCash only, cheap alcohol (11 bucks for three shots of Jameson, and one fifty well!), stiff drinks, pool tables, and a decent jukebox. Pretty much all you need to satisfy this little barfly. Admittedly, I was a little drunk on crappy bowling beer by the time we got here, but I had an absolute blast. There might also have been darts, but when I'm seeing double bull's-eyes it's unlikely I'm going to be getting many double bull's-eyes, so the option entered and left my brain pretty quick.\n\nThe stand out decorations were a painting of a tarted up cartooney monkey in the women's bathroom and two creepy mannequins, a flannel clad lumberjack and a tomahawk carrying \"chief.\" Granted, it's probably not politically correct, but it's definitely perplexing and helps drive home the fact that Uncle Monkey's doesn't give a flying fuck about catering to anyone that doesn't fit the dive bar mold. It's dark, weathered, kinda dingy and it exists for the express purpose of getting' you loaded, and the patrons reflect this fact by looking a little frayed around the edges as well.\n\nThe one issue I had with the place is the fact that it's hidden away in the corner of a non-descript strip mall with no sign on the front, so if you don't know about this place, you're unlikely to be finding yourself sharing a drink with the yokels.", "business_id": "hi5xfV28jsGBRWJWoBhDaw", "stars": 3, "date": "2007-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BGUSxfFURrimKfTcHLi1tw", "review_id": "V4wBwsQFVVb6UX8xn5ZKqA", "text": "Had the BBQ Burger for lunch. Too much lettuce tomato and 'fixings' to steal the taste of the burger away. \n\nLet the meat be the star of the burgers, not lettuce.", "business_id": "zARGEdB0JyPCPR0f3FKGxQ", "stars": 2, "date": "2010-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "SjudILbdF7SwuPw4skG3IQ", "review_id": "oVKQr82cp1LZNqeoreE6rw", "text": "I really hope Native Newyorkers CORPORATE is paying attention to these reviews. Most people here are complaining about the same things over and over and with my recent visit I can assure you none of those problems have been fixed.\n\nHere's my experience from my recent visit on the Mayweather's fight past week.\n\n- When we walked in, after telling the host how many, he just handed the menu to us and told us to sit wherever instead of walking us to a table. This is the worst you can do to a customer. Hand them a menu and tell them to go sit down. Are you too lazy to walk them to a table?\n\n- Place was disgusting. Beer all over the floor and sticky seats and tables. \n\n- Like most people complained here, this facility seems like a depressing hotel from the 90's. No ambience, not hip at all. Also has a weird smell.\n\n- WINGS = EXTRA SMALL compare to any other NN location. \n\n- Rude waiters, specially the guys that work here. No smile, Not friendly. \n\n- Our chicken strips came out burnt. Returned the order. No manager came out to talk to us. \n\nAll in all this NN has worst service than a moms and pops Pete's fish. Not worth it.", "business_id": "zBGfa6Vx4K59v8OR81gzJg", "stars": 1, "date": "2014-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OxeS4yjPG8ZeJYf4S_hlUg", "review_id": "ageYTtfRWrDLs3L9f3LxNA", "text": "Olive garden is always a bit of a crap shoot when it comes to service, but this one is really impressive. There is a dairy allergy in our group, I know I know we chose Italian, the wait staff made sure everyone was aware of it, the manager even came out to personally cover the dairy menu AND even offered to whip something up using what ever the kitchen had! Simply outstanding, well done Olive Garden, we will definitely return!", "business_id": "bbmuF6LtbP51bk0Ia0p1rw", "stars": 5, "date": "2013-11-29", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 6}, "user_id": "f4CExFYr3GTMSBD4BccDQw", "review_id": "DKB-JaARiNDsjANjx2jvsA", "text": "This place is always a good time! Pretty pricey but my belly is full and I am always happy when I leave. They have a great baked potato soup, that I have to get every time I come here. It warms my soul! LOVE IT! After a bowl of soup for my appetizer I usually order a steak, loaded potatoes, chicken........ seafood... you name it they have it. The service is a little slow at times, but I have never been unhappy with my food. The steak is nice and tender, the chicken is nice and moist and their chocolate chip cookie with ice cream....... mmmmmmmm! I really never have room for it, but I cant say no, so I make room! HAHA! Keep it up Black Angus! Mmmm Mmmmm good!", "business_id": "OreqUicD2AP5QW2HblqRoQ", "stars": 4, "date": "2013-09-05", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "DRI0GowQPNpwUfT-FX7nSg", "review_id": "v44rNbL7Za3VN5jkkMa13g", "text": "This is my \"Cheers!\" They have great drink specials, friendly 'tender's and an array of flavored vodkas that you wouldn't believe. Cotton Candy anyone? Not to mention a great (and updated) Jukebox as well as darts and Golden Tee for the kiddies, er, hubby's. :) \nKaraoke if you dare, but come with a smile and kick back with some of regulars you'll see there at the same time, everyday! While you're there, leave your mark and sign one of the tables. \nYay Cobb's!!!", "business_id": "44Up9Gbs-IKMnt7ULDWu8A", "stars": 5, "date": "2010-10-21", "type": "review"}
