{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "v9s5BpJsVQYB44D7jPu6-A", "review_id": "m0LObxiA_JZcSIpnwSGUOw", "text": "Our FAVORITE RESTAURANT in Pittsburgh - we come here every time we are in town. Best hummus in the tri-state area!  The lamb is GREAT! Actually, I haven't had anything here that wasn't great! Christos remembers us everytime we walk in the door.  We have our own special table right by the kitchen and talk with him while we eat. The baclava and the Jackie O cake are to die for.  Don't pass up the grape leaves and the homemade wine. We always buy extra food to take home.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 5, "date": "2008-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_OURyTahjY9pEIj-2-4ueQ", "review_id": "7XEWAHvP3_NScJ2nM6BXsA", "text": "Best Mediterranean in Pittsburgh! Came here with a group of 6 for my birthday and we had a great time. Try the hummus trio!", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 5, "date": "2015-11-29", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "8WQubmP7G0NM3IyzyMnCEA", "review_id": "-SZkITorsdlg01Q_hiyZ5Q", "text": "Yusef is a cool authentic Middle Eastern food place.\n\nMr K was right on his warning of wait time for the food, fortunately, ours came out in less than 20 minutes.  Time passes pretty quick in here browsing through the extensive selection of Middle Eastern spices, cheeses, halvas and other specialty foods.  \n\nSolid rendition of gyros and falafel...but the sublime baklava is what will be drawing me back to Yusef...just the right amount of sweetness and a light touch with the rose water.\n\nTasty and cheap alternative for lunch with sandwiches going for just $4.99 and 2 pieces of buttery baklava for just $1.75\n\nIf you're thinking of grabbing a bite for dinner, beware that they close fairly early at 7pm.", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 3, "date": "2007-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "D6zXk5QvDrJcRrKdEsnJSA", "review_id": "FbAadKYiaMeSgTUTF55FdQ", "text": "So impressed with the authenticity of the food. Absolutely delicious - so flavorful and well prepared. Our server was beyond polite and helpful, very courteous. Prices were very affordable!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2013-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MxoaSqM-reQOgog2mHi5Vw", "review_id": "WBNdSZz0oR950lp1roij5Q", "text": "Yummy!!!  I love good Mediterranean food, and have been looking for a new favorite place since my last one closed.  Have tried many around the east valley, and most of them end up being more of the fast food variety.  \n\nThis place, however, is fantastic!!!  We got take-out for us last weekend, and it was superb! \n\nThe gyro meat was seasoned well and very tender, and the tzatziki sauce was perfect.\n\nThe greek salad was fresh and the dressing was tangy and delicious.  They didn't skimp on the kalamata olives or feta, either.\n\nMy husband had the beef shawarma, and said it was tender and well flavored.\n\nThe baklava was melt-in-your-mouth good, and they have several different flavors, not just your standard walnut.  We had the pistachio.  \n\nWe are going for round two tonight!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "lPaYMDmJbAnv_3pmZH_inw", "review_id": "D4AoVvLoLWVC4dFmzmFGrg", "text": "So sad that Aladdin's is closed. This was by far some of the Best Middle Eastern eats in the valley. I sure hope they open a new place in a better location. Already missing their garlic dressing!", "business_id": "1zdwPAgiJFJhPeS3YIY09Q", "stars": 5, "date": "2010-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JH6BxvBhiG5hSi9CCmzCKA", "review_id": "qMiDhwIX4-Y7MVExYjC67g", "text": "Two words: tomato soup. It's the most incredible liquid I have ever tasted in my life.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2014-11-09", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "QOoIgTp7jvX2T94DlHePDA", "review_id": "vN7zQYoicLkS5okTHjz8Ew", "text": "I laugh at the ignorant reviews from the fragile people whom base everything on there desired style of service. Habib was straight to the point, genuine, and welcoming. This is because I allowed him to give me his style of service. The food was outstanding! I will bring him business because it was that good.", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 5, "date": "2014-10-07", "type": "review"}
