{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "bvu13GyOUwhEjPum2xjiqQ", "review_id": "ZHm4gbW9mt18k9pSR-0L-A", "text": "I don't care what Cub and Bulls fans think, this Steeler and Penguins fan thinks deep dish pizza is not all that. First, the crust tastes like a biscuit, and biscuits belong nowhere near or on a pizza. I will give UNOs a thumbs up on it's flatbread, it's better pizza than some pizzerias In the area. When I look over uno's menu almost nothing excites me, this place is a dud. Guess what? Chicagoans don't know how to eat hot dogs either!", "business_id": "6p9TlP2I8S4agxYMNFSDjg", "stars": 2, "date": "2010-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kWkgwRxqWD-h260dMTkHUA", "review_id": "81TE5GgNy41ki4ZeiPQasg", "text": "I stopped by here this past Tuesday in order to pick up a to go pizza.  My fiance, a friend and I were trying pizza from three different places and Luigi's was one of them.  I have driven by Luigi's many times before and for some reason had never stopped in but that did allow it to come to mind whenever I was looking for a pizza place I had not yet tried in the Bellevue area.  Whenever I called to place my order I was told that my pizza would be ready in about 15 minutes.  I arrived closer to 30 minutes later and was immediately confused whenever I walked into the restaurant.  You see there was a large dining room on the left that was full of people and I didn't immediately see the are where I would get my pizza from.  Finally after a few steps into the restaurant I noticed that the whole back area of the restaurant was where I needed to be and I made my way back there.  My pizza was ready for me and I quickly paid and was leaving whenever the cashier told me \"Stay out of trouble\".  I really hope that was a friendly sentiment and not one that was based upon my appearance or anything else.  The pizza itself had a medium thick crust with a bland sauce which is weird since I could see a ton of green herbs in it.  The cheese was just ok and nothing special while the pizza itself had a slightly sour taste to it which I did not enjoy.  Out of the three different pizzas we ate that night this one was overwhelmingly our least favorite which was evidenced by the fact that 3/4 of it was left after the evening.\n\nThe bottom line for me is that I will probably not head back to Luigi's in the future.  I just don't see myself making a trip to Luigi's between the weird experience (although not bad) that I had in the restaurant and the fact that there are much better pizza places nearby.", "business_id": "eOv0Dbq2E8sd0CKMAqTImw", "stars": 2, "date": "2013-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1Vm6c1na630TGii4IJHfkw", "review_id": "KkqboDbO343rWu6IwGHw4Q", "text": "I called for a delivery of a pepperoni pizza, large. Very simple since I was in the mood for it. The delivery and the time taken were exceptional. Very fast, very good delivery service. \n\nThe down side is the pizza. It was hot and fresh, but the flavor was just OK. It wasn't the best nor was it the worst. It was just OK.\n\nIf you do find that you like your pizza and need a quick delivery, you can't go wrong here. Other than that you may want to look elsewhere.", "business_id": "lHP5STO7aomlEQixH8m1aA", "stars": 3, "date": "2012-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f_GBmARcIYwiiF0DwQpOsg", "review_id": "Jm8BzHxeiWfvQTSYXKqurw", "text": "Maybe I just had a bad day.  This was THE WORST \"pizza\" I've ever had.  I have had Original DiCarlo's in Wheeling, WV in several locations.  This is not even worthy of the name.  I got 3 extra cheese.  First off, the pizza was basically glued to the wax paper.  The crust was unevenly cooked.  First bite the crust was almost raw, dense, and way too chewy.  The sauce tasted sour and the cheese (shredded, not dices provolone like the Original) was slimy.  My second bite, the crust was burned, tasted burned, but at least it was crunchy.  There was no third bite.  The remaining slices got tossed in the garbage.  This was by far the worst \"pizza\" I've ever had.", "business_id": "PTkChuI3GPCw-ZL1Iph76A", "stars": 1, "date": "2012-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "j7wocLxF51u4d2K60howXw", "review_id": "zjBYBegb6wgfcpcxJ7jeLw", "text": "Sorry, but our pizza was cold.  All nine cuts of it.  And the garlic wings didn't taste like garlic.  Maybe it was an off night?", "business_id": "93UCt9OgWYmypZCpXtUu8g", "stars": 2, "date": "2010-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qbrlRwy-QnIq7qxWORI_Lw", "review_id": "4UwocP6YUzfUOMFAA5SrgA", "text": "Awesome pizza. Wish I had known about this place years ago! But glad I heard about it and tried it out. One of my absolute favorites now.", "business_id": "93UCt9OgWYmypZCpXtUu8g", "stars": 5, "date": "2015-09-20", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "gSLy4fdXb2smyGGJ7TAxNQ", "review_id": "1dG0muoNGsA5RdZN-DErlQ", "text": "I have been a patron of Bado's several times now, and this is a great spot to have few beers, watch a game, and meet up with friends.  Their beer selection is commendable and is frequently updated.  I have sat a the bar and had a table.  I've never had a problem with service.  Staff is knowledgeable and makes great suggestions.  \nNow for the food...their pizza is so yummy!  I love everything about it. The cheese, sauce, toppings...all great.  Their wings are also good.  \nIt can get quite packed during a game or on a weekend evening, so there can be a wait.  Grab a beer and wait b/c it's worth it.", "business_id": "qemCNgjeYGcFsRwxW9x4xw", "stars": 4, "date": "2012-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jCe7-XK9GA0AdeKPNCLhqQ", "review_id": "lTNq6E1L7kXe8TrsZDRKWg", "text": "Always has fast delivery. Friendly staff/delivery drivers. The Italian dogs and provolone wedges are a must!", "business_id": "nqRNOug4OMrYTTZg-qLxXA", "stars": 5, "date": "2015-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "gwnVSev8aNLvMArs3WTfFw", "review_id": "3EKtl4_mv9_n_iJ1sRsFCA", "text": "Decent pizza and calzones.  Get rid of the canned mushrooms! Crowded at lunch.  Calzones are huge!", "business_id": "l-OmDgEd4QkZpyXVpkp2yA", "stars": 3, "date": "2011-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5wTVzr3SyZzpiu-U_Yim6A", "review_id": "MIXPN_1Tw3BorSlBl2sY7A", "text": "This place is hard to find.\n\nEither go into the elevator and press M for mezzanine and the counter will be on your left with Cashier sign above it.\n\nOR enter the unmarked door on the right hand side of the revolving door go up the steps through the crappy corridor and you'll eventually run into it.\n\nYes, it looks like you shouldn't even be there.  If you think you are in the wrong place, then you've likely found it.\n\nThe decor has been accurately described by others as broken down dorm public area.\n\nWith all this being said, the feta & ricotta pizza I had was delicious and cheap. $6.50 for a personal sized pizza. It was chock loaded with cheese and bacon and spinach. Very good. Food was great, decor and ambiance, horrible.\n\nI'd advise just getting delivery.", "business_id": "nBl_NeArpL08MpoghDiA_A", "stars": 3, "date": "2012-09-27", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "z5Y8aIWjwyaa0110WAZorg", "review_id": "iWKRl3IoDBih3U1DY8xu2w", "text": "I eat this pizza all the time when downtown, usually when running around at events like First Night or the Gallery Crawls...not the best pizza I have ever had in my life, but it's not bad!  And I haven't ever gotten sick from it.  Just wanted to offer a different opinion.", "business_id": "SvoJ3Y3uqDfB4iGUaWXh8Q", "stars": 3, "date": "2007-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "NH8aEIKCSO_xtp54zrMoTg", "review_id": "NjuF24qBcwxOmFscwVIg6Q", "text": "Angelo's has by far and without question the best hoagies in town. In fact I'd be hard pressed to think of better I've had anywhere. Maybe it's the homemade dressing (a creamy mayo/Italian concoction they call mayonnaise), maybe it's the fresh meats and bread, maybe it's the way the name them is the pizza oven... I don't know. It's probably all the above. My favorites are the capicolla &  mushroom cheesesteak. \n\nThe pizza is also very very good, but the subs are so outstanding it's tough not to go with those. I also love the fresh made garlic knots. \n\nThe ambiance here is nothing special, but the food more than makes up for it. The only thing keeping me from a 5-star review is they don't do residential delivery. The hoagie is worth the walk, but someone else bringing it to me would just be perfect, especially if it's pizza I want them I'm probably being lazy.", "business_id": "PTS4MxQel-xzj5qWxVn3LQ", "stars": 4, "date": "2015-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SDlLqXn4IEtMzNwt9sV98w", "review_id": "Bn091EBNcFlsEhgAaccbHQ", "text": "Good pizza . Not the best but good.  It would do them a lot of good if they took debit cards/credit as payment rather than the very antiquated cash only .  I'd think they'd double their business, at least .\nDelivery would be nice but I live close by so it's not a big deal to get there .\nThe hoagies are so so .  \nGood luck parking your car if you head here at night, especially.  Seems to be a favorite spot for night-shift city cops to chow .", "business_id": "r8jeeS3k_diihMDSu9IjlA", "stars": 3, "date": "2012-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cOrbRK1ZXTGe5_rG5wFOvA", "review_id": "y2PmOyHTAiyfuk8pVtdCkg", "text": "Saw all the great ratings so I ended up checking this place out on two separate occasions during the evening. Bought two slices of pizza on the first go-around and two subs on the second go-around. Not really getting what the hype is about concerning their pizza since it tasted ... just like any generic pizza. Cheese was gooey, sauce was alright, crust was not too thin or thick ... essentially right in the middle of the mill. They definitely do have good subs/sandwiches that are worth getting though.", "business_id": "r8jeeS3k_diihMDSu9IjlA", "stars": 3, "date": "2015-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "-Gdjho_gZhgTXkYmSPy0qw", "review_id": "E7Jk4qP5nMQG6J0N0dlW_g", "text": "I can't explain how thrilled I was to find Il Pizzaiolo. The closest thing I've been able to find to authentic Italian pizza in the 'burgh. Me and my boyfriend came here for a light lunch, but had a difficult time deciding between the D.O.C. margherita and the arugula and prosciutto. We eventually decided to keep it classic and order the margherita.\n\nAs soon as it came out, I could tell it was exactly what I had been craving for months. real. pizza. we scarfed down the whole thing in minutes. And then being the fat kids we are, we just had to order another one. Screw light lunches, right? This time we got our second choice, and although it was pretty messy to eat, it was just as tasty.\n\nI hadn't had pizza like this since the last time I visited New York City, so eating here was pretty much a spiritual experience. At least for me, a pizza lover stranded in Pittsburgh. The only thing I would improve is that I wish the pizza had a more \"soupy\" center. That would just take it to the next level for me. Other than that, the service was quick and the atmosphere was quaint and pleasant. Unfortunately, it's fairly pricey for a casual meal, so I won't be able to come here as often as I would like (oh, and despite what another reviewer said, they do take credit cards). Definitely want to come back and try the pasta sometime, though...so expect a part two!", "business_id": "6-rJjW6ITl5o_FliiNgZRA", "stars": 5, "date": "2010-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Sdy0RPXf0nxZ-15Zb_Fxmg", "review_id": "ujfjdr3BO0L7dM8l7dHjKA", "text": "have gone here many times and always enjoy it. Great quality food, good portions. Love the atmosphere too", "business_id": "6-rJjW6ITl5o_FliiNgZRA", "stars": 5, "date": "2014-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lue8Pdg24VOEJrUiUV8stw", "review_id": "IR4fiZkJE7Dln1a1UWBIfg", "text": "I am from Chicago so I take pizza very seriously.  I love Village Pizza.  I honestly think it is the best pizza in the USA.  When I go to Pittsburgh it is the first place I want to go and make it a point to go everyday I am in town.  The fact that they also carried 40 ozs to single cans of beers was impressive.  I wish there was somewhere half as good as Village Pizza here in Chicago.  The pizza is delicious.  Do yourself a favor and go there and as someone else stated they moved so find their new location at 815 S Aiken.", "business_id": "kxZIebwbpe_ddry6EKMdCg", "stars": 5, "date": "2011-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OomoAUVEKkMHNT9iefCDnA", "review_id": "cRR6sd1tTkzuXkfjmP5XsQ", "text": "Man! I was really looking forward to a nice pizza! But the slices are so much different tasting then when you order an actual size pizza. It was so dry and had no flavor whatsoever, no salt no sauce --- I was just overall disappointed", "business_id": "sJtGRBWYUj013nkFA4Hrdg", "stars": 2, "date": "2015-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VoPfJcozBzNzt5IiY1-Eyg", "review_id": "q9GO-TPGUoA-R4S8BCGbgQ", "text": "My parents love this place, but I hate it. The service has been crappy the past few times we have been here, and you usually have to wait for your food for about 35-40 minutes, and you have to wait 10-15 minutes at the lobby to get a table. Yes, that's not long, but it's definitely boring. I don't like this place, nor the food.", "business_id": "SVKC_-gIQFkHElZ6bFsE6g", "stars": 1, "date": "2015-09-26", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "hBZ4tkZJqkLZRf215I-WDg", "review_id": "S2-RZk-g8IV_wsp2OiXyow", "text": "The beer selection is wonderful, including some great local brews.  Sadly it was 11:30am on a Thursday so we couldn't partake.  \n\nI had the Chicken Florentine pizza. It was missing some zing, I found it rather bland, but I'm a sucker for anything involving feta.  \n\nMy boyfriend had the chipotle bbq chicken and loved it.", "business_id": "kAid56AY_laxGYslMdsYJw", "stars": 3, "date": "2010-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xrPtS7uo5r_VJB5g3pDzTg", "review_id": "BQVQMXcVamVXd-E32BM1CQ", "text": "I FINALLY had a chance to try Brixx pizza! My husband and I came here before a Hornets game to get a bite to eat. We decided to order two pizzas. There pizzas are meant to be personalized sized, but they are pretty big! Well worth the $10. The pizza is made from a brick oven so it came out super fast. The crust was light and crispy- cooked perfectly. \n\nWe both ordered pizza and we were able to split pizzas half n half so we eventually were able to try 4 different flavors! Btw they have about 20\nPizza options for you to pick from. Here were our choices: \n\nPear and Gorgonzola: very unique. I liked this pizza, but would never order a full pizza of it. The nuts on the pizza kinda threw me off however, If you like something different I would recommend this. \n\nRosemary chicken: very refreshing with the Rosemary. The pizza also included mushrooms and onions. \n\nMeatball: oh my! The meatballs were awesome! \n\nJerk chicken: this was my favorite flavor. It was spicy, but the pineapple on the pizza counteracted it. I would order this pizza again!  \n\nOverall we had a good experience at Brixx and I would go there again. I love the variety of pizzas they have, plus they offer salads and sandwiches too!", "business_id": "kAid56AY_laxGYslMdsYJw", "stars": 4, "date": "2015-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6k6jsknhUalkPXool5F0mg", "review_id": "VsuktC-6y5aKXbdgA9C8xA", "text": "I only rated 1 star because I couldn't select a half or none.  Placed a delivery order at 5:30 and was told 30 minutes.  Called at 6:50 am was told it was on its way.  Called back again at 7:15 and it was not in the system anywhere and they have no record of it (after taking our credit card mind you).  \n\nWill never order from there again and suggest you use caution as well, especially if you have young kids.", "business_id": "jr8D3lu1S0-eRpIVxkKnMA", "stars": 1, "date": "2014-11-07", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "c1F1I-svkZGo-YEJioATyQ", "review_id": "eiN6A24u2m6Fvg5xCZheRA", "text": "This is my umpteenth time coming here.  I have never had a bad experience. Food is only decent that's why it is not 5 stars. Bartenders are friendly. Drink prices could be better but they have specials occasionally.  I keep coming back so it can't be that bad. \n\nBtdubbs. This is my virgin yelp.", "business_id": "3xdV-7di_YD3MVqs3Pa7-g", "stars": 4, "date": "2013-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NKcrPC7kAWUoO_POcXtCeA", "review_id": "gEK2f9r5uba-4KDI5tRvWA", "text": "DeMarcos is not only the best Italian restaurant in Fort Mill but the best restaurant by far! Their bread knots are to die for and are so addictive! The eggplant parm is my favorite, and my husband loves the penne alla vodka with shrimp. Their side salads are so good and the balsamic vinaigrette is homemade and my favorite! We come here about once a week. Their hostesses and servers are so polite and have always given us wonderful service. Their marinara sauce is the best! I LOVE this place! Defiantly go here! (:", "business_id": "LwSNsn2k6v_Nb2dbhP3qsQ", "stars": 5, "date": "2014-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dmxXRo78_Eyf9kFgk-VVWQ", "review_id": "6-DIZZQzdDVHY46FfZbJGQ", "text": "The huge thin crust supreme pizza we had was delicious! If we lived here, we would be returning.", "business_id": "jqOPL979k-t_Vc049CnAjg", "stars": 4, "date": "2014-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "HANb8-8InWnju-XzBQQSBw", "review_id": "d2_DSXAe8z9rKpxd4kCahg", "text": "The service is awful and you will often receive things you didn't order.  The food is ok, but get it carry-out after a quick inspection to make sure they included everything you paid for.", "business_id": "yTlW8Xh1wPpvHBl3dGz9mA", "stars": 2, "date": "2005-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zaAnvzBTJh6mMrEJXUD4ig", "review_id": "W6U7jIZkn6qrj8nCG2YmdA", "text": "Just got back from a great party at Esquire. The food was fantastic!  Their fried chicken is out of this world and they also had really good Greek salad and potato salad. They have a good bar selection too...I had good German beer. It's just a friendly, fun place to hang out and they have a back room for private gatherings.", "business_id": "pPWre8lbVAssER6CN0uWMw", "stars": 4, "date": "2012-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1wR9JTdpa0wiN0TkD1v98Q", "review_id": "NLCwr6ibcK5jww1Ybrzb9g", "text": "worth the half off tues. guys... real cheese in those shakers. nuff said.", "business_id": "6U94ybDpNd0fTL7TIzb5Kg", "stars": 4, "date": "2013-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iHzZb-rFVIJNDiIAvWr7Eg", "review_id": "iDJ6tA1MmvJQf4uAxvR5nA", "text": "I was craving pizza. I wanted to try somewhere local and found this place across the street from hotel. I ordered to go, and the host was bubbly and cute. I didnt know what I wanted so I decided to try the \"recommended\" pizza skins and the numero uno deep dish. \n\nThe skins came the size of a peresonal pizza and had the deep dish crust, looking like a pizza, but it was filled with mashed potatoes and topped with bacon bits. I do not recommend. It was too starchy, and not enough flavor. I only had one piece. \n\nThe pizza was good. It was basically a combination and the personal pizza was huge. The crust became a bit much after a few pieces, but the filling was great. I think the restaurant has better options, but rating purely on food I was not impressed.  \n\nIf I were ever to go back, id keep it simple... a pepperoni thin crust.", "business_id": "nc3IiY5LNdmEwUZCW84yuA", "stars": 2, "date": "2008-11-15", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "p3jwJsnF1ARgBaYev9tYRA", "review_id": "VtJtzoBZZBfYi4o1-wZjfg", "text": "We felt like Italian tonight.. really wish we'd gone elsewhere though..\n\nOur party numbered three tonight so we each ordered somethin different.\n 1: calzone with 3 toppings =$12.00\n 2: Italian beef sandwich with pasta salad=$9.95\n 3: antipasto=$10.95\n 1 water, 1 ice tea & 1 rootbeer $2.70 per drink..\nTotal bill was just over $40.00\nNot really bad for three people.. as long as the food and service are good..\n\nWe had the short ,dark haired waitress(avoid her if possible).\n\nThe first round of drinks was fine. But we had to be rather obvious to get refills. The second ice tea made us all choke(yes we all tried it).\n\nThe menu stated that eat in customers received complimentary cheese bread.. we never did.. we sat watching as the other waitress brought out basket after basket of bread to her tables.. our waitress stood eating and drinking and chatting..the other waitress actually took care of her customers.\n\nAs for the food.. a waste of money for the most part..\nWe all tried everything we ordered and agreed that the only things we liked were the calzone and pasta salad.\nThe antipasto was okay but not worth the cost.\nThe Italian beef sandwich was awful. It tasted of blood but the meat was over cooked. It lacked any other flavor..\n\nWe saw no reason to complain as we doubted anything would have been done.\n\nI actually hated leaving the $5.00 tip for our waitress but I didn't have any smaller bills.. I wouldn't have left a tip at all but I feared a scene with the waitress.. She seemed the type to complain about the lack and chase after you when you left..\n\nAll in all.. we won't be back.. and I'll be sure to warn my friends..", "business_id": "JN2qXIuDXnV2d8WnSqd28A", "stars": 1, "date": "2014-11-13", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "slAdwQk0i984K7lxzsWQGw", "review_id": "VnCbFclhlZNPx-kBy4VeGQ", "text": "This place is awesome. \n\nFor the guy who said you should go to Safeway instead for a sandwich, well, I'm guessing he probably thinks a steak at Applebees rivals a steak at City Hall. \n\nIf you like turkey with mayo and mustard, you can't get that here. If you like to try new things with fresh ingredients, you might want to give this a try. Yes during the summer it is hot and they only have outdoor seating, but how about taking it to go and eating in your car? I've done in many times. \n\nAs I say in my Pizzeria Bianco review, I now live in NYC but will take extended layovers in Phoenix gladly to stop at these two places. I have also scheduled meetings around these places being open! It's THAT good!", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2008-11-12", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "8uPrL5vr8ZpTvSrhb-9e5w", "review_id": "3Z8x4cAuNv3IOjqRqAgLTw", "text": "I'm pretty sure if you could eat heaven...this is what it would taste like.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2011-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9FgE70NHPgzf_c2TLpE6Zw", "review_id": "3PtPfoSCI96TVxn6WY7NgA", "text": "Love it.  Perfect lunch spot.  This is NOT the pizza place folks...go here for salads and sandwiches and they will not disappoint.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2012-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q9zdZyN95FNX9Q9vJK_jWg", "review_id": "Uu-LTOEGN_4Fu_Bumqokkw", "text": "I guess I'll join the bandwagon and give it a 4 star. We had the local greens balsamic salad, the lasagna, and the wise guy pizza. I'm giving it a 4 star because the food is good and the service we received was GREAT! Personally though, it's overpriced. We probably won't be back. There are other places with similar menu items that are just as good that are less expensive. But a good first experience!", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2015-09-25", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "ZKo-HD5FdrINIHAcD9AnAA", "review_id": "-QCgWCxjCpwtIUUTGsJgQA", "text": "I Love Love Love Oregano's.  When I lived abroad I was terribly homesick for this place and to be honest, the thought of living further than an hour's drive from Oregano's puts me into a panic.\n\nThe food is Delicious and Generous and the prices are SUPER reasonable.  The Alfredo the Dark with chicken is wonderful, and my staple.  I especially like the roasted poblano chile on top, which oddly varies in degrees of hotness depending on the day.  There was one time that I happily snarfed the pepper only to realize a minute later that my lips were ON FIRE.  Like, I had to ice them for the next 20 minutes.  Still, I take full responsibility for that silliness and recommend that everyone be Very Careful when eating those little guys.  The salads are great, the belinis are yummy- the staff is crazy friendly, which would usually annoy the hell out of me but I find it oddly endearing.  *sigh* I cannot wax poetic enough!", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 5, "date": "2009-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "R603a8A4ikzKoN5_dhm0vw", "review_id": "JnOXw4ylrWuNMjcE1y_zVA", "text": "Great food. Great service. Mark went out of his way to make sure we were taken care.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 5, "date": "2011-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jmoPgoIUeXko-eB62lw66Q", "review_id": "oR0dMrm6lqq-4P7Ddikh_g", "text": "Don't try and do take out with this place in less you want to wait all night.  Called tonight at 6pm to order a pasta dish (no pizza) and was told it would not be ready until 8:30pm - no place is worth waiting over 2.5 hours for a take out order.  Called STREETS OF NEW YORK, ordered the exact same thing and got it delivered in 30 minutes.  DON'T even try and place a take our order with Oregano's!!!  They should not even offer take out if it is going to take that long to make something that I have to go and pick-up.  Done with this place.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 1, "date": "2014-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VF7MZz9IsQDmF2Uivs-2yQ", "review_id": "auNhlQef60C3XkoFAuoi0g", "text": "Their food tastes SOOOO good! Nice family operating the place.\nTheir vegetable lasagna is amazing and it comes with the best garlic bread EVER! Their ranch sauce is the best I ever had.\nI usually get pizza with mushroom and onions and ask them to make it well done and it's made to perfection.", "business_id": "-S7aL8dVIiXjCdbTZVn8uA", "stars": 5, "date": "2015-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "MxA_wJOmUJxN1AmELO0RjA", "review_id": "vBPP6CLbXsXtnamOXzfVDw", "text": "Great prices for the the quality of pizza.\n\nWe got wings and the pizza. It was all good. No complaints.\n\nQuick, friendly service. So good.\n\nEverything was good. Like, so good. It's my new fav pizza place thing.\n\nSo good. Like, good.", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 5, "date": "2014-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "utD6Pi48oZb6a08NxkG6jg", "review_id": "IpWFDVbTs6XsBNVA_nRVeA", "text": "Great service, great food and great prices! David went above and beyond. He was running the entire place taking care of it all, and did it all with a smile!", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 5, "date": "2015-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "n1jU9uP2QuL0JaPlZFInMQ", "review_id": "uYqdRTb0wzzmo4lOYPjOZw", "text": "It was so hot on the day I went to this place, they were baking the pizzas on the roof! hehe!  I was pleasantly surprised with the quality of the pizza, pretty damm good. I have 2 slices and one of Sicilian; all were just like NYC. The service was good too, unlike in NYC. :)", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 4, "date": "2011-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EJDmZN3hg1QyQgqAu0055w", "review_id": "ee9b1crrDJDD_UAOTTLkPQ", "text": "Came in to have some pizza while waiting for a car service to be done across the parking lot. The restaurant was not busy in any way but instead of seating me, I was asked to go up front and order then sit anywhere I would like.  When the cashier finally got done looking at something her co worker thought was funny, I placed my order then sat down across the way so they could see where I sat.  While waiting for my order the same cashier came up to me asking what I was doing in the restaurant sitting at a table. I told her \"I ordered a pizza from you a few minutes ago and waiting to eat it here\".  Eventually it was brought out to me in a \"to go\" box, not served in a way as if I would be dining in.  I told them that it would be fine, I was too hungry and bothered to ask them for anything else.  After I started to eat my food, they decided to sit down a small family with a few young/loud children at the table two feet away from me.  Again, it was not busy, they had the entire restaurant to seat them that did not have to be right next to someone else already upset with them. Wait, how did they even get seated? When I walked in they wouldn't seat me!!  So needless to say, major fail and will choose somewhere else next time I am near that location.", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 2, "date": "2015-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w8HQHRHs9qfbzUafzpwROQ", "review_id": "lcwvkqc6kYUGU_Lzv3tFLw", "text": "One of our favorite pizza places. Cater to our wheat crust fascination and my son loves there pineapple BBQ chicken pizza. Little hard to find close parking on a Friday night but the desert was well worth the walk. The service is always nothing less then stellar.", "business_id": "ut-kla-EA23nJOij_dcL0Q", "stars": 5, "date": "2013-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KSMJieKAYJGKgCBysgFZhw", "review_id": "QIR61_OdDA83JTWRLa1U3A", "text": "Pizza. Pizza never changes.\n\nFrank's used to provide pizza to my high school cafeteria 10 years ago. I thought I'd give em another chance now that I live in the neighborhood.\n\nThe pizza was alright then and it's still alright.\n\nThe delivery was not good. The person was nice enough but forgot my two liter and then came back with a regular and not a diet (I can't drink regular for health reasons) and made no offer to fix it. I wouldn't have taken him up on it, but just the consideration would be nice. He was super apologetic, but, that doesn't make up for the $3 two liter that will sit in my fridge until I have a party and need a mixer.\n\nIt also took sixty minutes which is absurd for a pizza I order at 11 AM.", "business_id": "VWcaFOSFcDwmFquycBzFyQ", "stars": 2, "date": "2015-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "lR7BCG34Das3Jl5m_vfnvQ", "review_id": "usz0h7mr6LR45LTS8wStsw", "text": "Last night we invited two couples from out of town to meet at Vincents Bistro. We made reservations for the evening. We enjoyed our dinner and wine, ordered souffle for dessert. Just as I was sipping my first cup of coffee, a server came to our table and told us we had five minutes to finish as people were waiting for our table. \n\nHow embarrassing, after telling everyone that this was one of my favorite restaurants. We spent hundreds of dollars on dinner and wine. Our meal was very good, but I don't think my friends will go back.", "business_id": "oc0Wl6ktfMLb5VZ2Uz6M2A", "stars": 2, "date": "2013-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "meEGdTJvpp3GjNNXpesRMw", "review_id": "Baau_LSmifHoB9cUx5VRFQ", "text": "try it you will like it, and Donna is a hoot plus provides great service. ate lunch regularly there when i worked on 44th street.", "business_id": "j0Uc-GuOe-x9_N_IK1KPpA", "stars": 5, "date": "2013-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "618-QjYnR0pwah6utjWoDQ", "review_id": "4sexTQcunobEf4a9GgUZLA", "text": "LOVE this place!!! Pizza by the slice, delicious and NY style! Staff is also great, friendly!", "business_id": "GvwDppcJLm9lso9iS2hSIw", "stars": 5, "date": "2015-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DfxzHI4TjGTUuFELonH5wA", "review_id": "uRbeNjdJW35YQ_3nOZIiNA", "text": "idk...i've gotta say, i've had far better pizza than this.  i too was excited to try this place based on the reviews.  we got decent service, in fact our server was super nice and cute.  we split a salad that was simply lettuce and spinach with a tomato thrown in. the 5 bucks we spent on that could have purchased both 1 bag of lettuce and 1 bag of spinach.\n\nmy first glass of wine was corked and so much so that when i went to take a drink it burned my eyes but they were very nice about getting me a new glass of wine.\n\nnow on to the pie...  \n\nwe got the spinach special which came with a saccharin sweet sauce; personal preference would be a bit tangier but it was the grease and the crust that was the bummer.  when i get thin crust i like it to be crisp but this? not so much.  mush to the sogg town. \n\ncan't say that we will come back, there are just too many good pizza places in town.", "business_id": "YldXB1hRpnE1CWLF3mvgpQ", "stars": 2, "date": "2011-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QCJjdS6UXzLtsUpnc8Fk-Q", "review_id": "jNNlAm1bLt1ILLBYa-ddvw", "text": "***Moving to 5509 N 7th St, Phoenix, AZ 85014***\n\nThis location is closing at the end of November 2013 to a new location on 7th St and Missouri. They will offer some great new menu items, as well as introducing a café/marketplace/bakery!\n\n---------------------------------------------------------------------\n\nFrom article at http://blogs.phoenixnewtimes.com/bella/2013/11/spinatos_pizzeria_pizza_central_phoenix_restaurant_new.php\n\nThe family-owned local chain that's been making old-school Chicago-style pies in the Valley just shy of 40 years has announced their newest location, a 10,000-square-foot space at 5509 North 7th Street in Central Phoenix (7th Street and Missouri), will officially open Monday, November 25.", "business_id": "YldXB1hRpnE1CWLF3mvgpQ", "stars": 5, "date": "2013-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pumDVwnU2DEr5Nra5PT09A", "review_id": "kiTXzNkdFzQ8tXAZsXN2Cg", "text": "I have a passion for great pizza.  It's been my favorite food since I was a kid. I've outgrown my fondness for the typical pep & sausage as my tastebuds have been seeking out new flavors. The first time I tried the Gourmet White Pizza at Stumpy's I believe I heard the chorus to Hallelujah! Another favorite of mine is the Hot Blue Chicken Wing Pizza...an explosion of flavorful deliciousness! So good...I am actually salivating over my keyboard just thinking about it! Anyway...Stumpy's is by far one of my most favorite pizza places. Another giant plus? The owners and staff are the most amazingly friendly people I have ever met. They greet everyone with a warm smile and a wonderful pizza!", "business_id": "kxDGexkbP30fBvxVI0CzFQ", "stars": 5, "date": "2010-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HFu9gUYhfH1MvTV71S9AfQ", "review_id": "ix7BbUdfpA6Q_KdabDlMeQ", "text": "From out of town, I was look for a good take out Pizza and I was not disappointed. Fresh mushrooms, good hand tossed crust, just the right amount of sauce. Well done. Good price also. Service was good. Definetly recommend.", "business_id": "kxDGexkbP30fBvxVI0CzFQ", "stars": 4, "date": "2014-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sZnasdMranpEybGgTj-3gA", "review_id": "p2bocQQESc3SFgOGcwsd1w", "text": "When I saw the $20 for $10 deal at Rays I jumped on it.  Ordered the breaded chicken w/ spaghetti dinner.  My buddy ordered the sausage hero sub.  I was amazed when they told us we needed to order something else to use the entire $20 deal.  We choose the cheese garlic bread.  The food was great and the service was good. Could not have asked for more!", "business_id": "V3lQtk1LgwAEcF9j-BzchA", "stars": 5, "date": "2012-10-24", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "tjWh1RIkBla3W85YVUInLw", "review_id": "3k01yukOrKvT-O7DuQ0ByA", "text": "I am terribly sorry *kinda* for this less then magical review. I have frequented this place some many a' time. I like this place. It's close and tasty. I feel like this is the point of the review I present my uncertainty! Enter sad face. Wife ordered...per super awesome phone thing, a large pep and idk maybe 20 wings. Non the less $30 later I walk in, like I have many times b4, and dude looks at me like I am bothering him. With the secret two digit numerical code my wife relayed to me I was able to get my hands on the order. After acquiring the ordered items I shuffle slowly towards the register. Before 1 1/2 shuffles buddy behind the counter gave me some serious angry eyes asking if I paid! What!! I was obliged to promote their high traffic area and simply moved closer to the point of business where I could pay. Not cool. Insulting and honestly.... Never again. I hope they trained that staff to make sure they never get return business because in that scenario.... Job well done", "business_id": "V3lQtk1LgwAEcF9j-BzchA", "stars": 2, "date": "2015-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BO6vNTuZXTgKfb8Y4o93tw", "review_id": "JRRR-QH6EKvgMKJq9gGaXQ", "text": "we ordered on line and picked up two pizza's, After picking up our pizza and getting it home we bit into one of our pizza's, it was so raw and nasty! I called and the manager said it was fine for us to come pick up a new one, so I said crispier please. I go and pick up new pizza and to my horror it was burnt! Black and hard as a rock! I had no choice but to bring it home. The crust was thin, which we did not order and the toppings were scarce. We had 1 medium pizza to share with 5 people. Threw them both in the trash! What a waste amd I personally ate a apple for dinner. Manager tried Ill give him that, but he should look at the pizza;s, after a complaint. Wonder if he would serve that doughy or very burnt pizza to his friends or family?? I would hope not! Never getting pizza from here again. I prefer to have gotten our money back .", "business_id": "zwJX3eetOhpi-gv4-E4rcQ", "stars": 1, "date": "2015-09-20", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "ikQYq-dN3xSXxc4zB96GlQ", "review_id": "X7qE3ETL7N5QSYGTJbaVyQ", "text": "The pizza here is delicious! Not as greasy like other places. The cheesy bread sticks with marinara sauce is so amazing. This is one of my favorite places to have pizza. Service is great.", "business_id": "pF7uRzygyZsltbmVpjIyvw", "stars": 5, "date": "2012-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WasDmbYp6x8ywh_BvcGo6w", "review_id": "mHAg5aqu6wCWcaXoj0hcwg", "text": "Delicious calzones! They are filling and tasty. It's my go to item on the menu. My husband loves the thin crust pepperoni pizza. Drinks are a little pricy but then they give you a gigantic cup so it's worth it!", "business_id": "pF7uRzygyZsltbmVpjIyvw", "stars": 4, "date": "2015-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "70IU3ydGxnxagsM_2DWvzg", "review_id": "U8tDck2fjeWfeYPhpJ2aMQ", "text": "I'm only giving this place three stars but I wish I could give it five. The food is amazing and very moderately priced...especially the honey hot bbq wings and pizzas (which we get everytime we come in). Last time we tried a cheesesteak and it was fantastic! Best I've had in a long time. The happy hour (5 dollars for a premium pitcher of blue moon or fat tire, or 4 dollar for domestic brews) cannot be beat anywhere in the valley. \n\nThe only thing about this place that is not up to our standards is the service.\n\nThe girls they hire here are inexperianced, slow and sometimes down right rude. Most of the servers we have experianced forget major parts of our order or forget about our table altogether. Once we were even told \"we better hurry up and finish because we are closing in 15 minutes.\" We had just gotten our food! My friend who was dining with us that night had frid zuchinni that she was in the process of eating and one of the servers literally grabbed it out of her hands and started boxing it up...while she was trying to eat! I've never experianced that level of ignorance and downright rudeness while dining out...ever. and I'm usually prety forgiving being in the restaurant industry myself. The girls just have no clue! \n\nThe food and great happy hour are sincerely the only things that keep us coming back again and again...although I wish it was an overall satisfaction.", "business_id": "lf42gtgq_2_jPvjfp_K1nQ", "stars": 3, "date": "2011-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KjuYimtGUMUdVILAKhF1gg", "review_id": "wbveQKldIpJQUFXjhjinOA", "text": "I enjoy uncle sams, I was born and raised in the area and have been eating here since I started eating solid food. It's not the greatest food but the wings are pretty good. When you order togo it's hit or miss. Sometimes your food is perfect, and sometimes you get 12 drums and 1 wing with an order of wings. All in all its easy, ok price, and quick.", "business_id": "lf42gtgq_2_jPvjfp_K1nQ", "stars": 3, "date": "2015-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4MnVm1LWQ2ZXso4ORe_fZA", "review_id": "C8q19kY4uDfNcZz4rzh49w", "text": "I love that this place delivers! I ordered a strawberry-walnut-chicken salad, and was not disappointed. The vinaigrette was divine, and the chicken charbroiled just so. I also ordered bruschetta, expecting a couple small slices of bread with a tiny bit of tomatoes on it. It came in a normal sized takeaway container. I was flabbergasted. Inside, were pieces upon pieces of toasted bread, topped with delicious tomatoes, garlic, basil, and cheese. Holy moly. It was enough to share with at least two other friends. Yum!", "business_id": "0gQrhOYWdO0XVZEKtOrvaA", "stars": 5, "date": "2015-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "U12kPMkTjeQBB6qE5rzUEg", "review_id": "PVLPSdSdwc4_fmfUYqRAkg", "text": "The food was awesome. The place is cozy with comical flair for words on the menus. The cowboy music was a little depressing for the lunch time crowd. The server did mess up our order, but she was honest and fixed it before we noticed.", "business_id": "u5o4H8h0sIVhqa8Lcusi5g", "stars": 4, "date": "2011-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1nYLxeSnKVDrcTvV8GSCdg", "review_id": "pT68FfDQFw6Q70IaETirJg", "text": "Worst service ever. Told 30 minutes for delivery. An hour later I had to call in and ask what happened. Told them to cancel my order. Regardless how busy they can get, that's just poor service.", "business_id": "u5o4H8h0sIVhqa8Lcusi5g", "stars": 1, "date": "2015-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fex6wfOldNR9_6hSDMFEEA", "review_id": "hJfoKHpYC7ASPiVFpHnb-A", "text": "Amazing when it was open. I felt like I was walking in to the closed CEC store in Scottsdale. But as of 10/9/15 it closed down.", "business_id": "08In-bFs8JOmSTDlQ0BfFw", "stars": 5, "date": "2015-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LXffClsgSec1cgDnd70pWA", "review_id": "yohbsj3i1o6ziU3YEqmIIg", "text": "This place by far has the best pizza I've tasted in a long time! Best part about it is that it's next to my work so great place to hangout during lunch.", "business_id": "RYZ08XAToBaN-bS5HHVEhQ", "stars": 5, "date": "2013-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DwU7KVfebA70AlVtX0iOWw", "review_id": "laQDzg_GHX_3xOWO4LTM-A", "text": "Love the Pineapple, Ham, and Jalapeno. The new pizza is good. I like the garlic flavor on the crust. I don't do carbs and pizza very often, so it is a nice treat. Ordering and paying online is awesome, and the online tracker is pretty cool. It is not Nello's, but it is still pizza. It tastes even better right from the fridge for breakfast.", "business_id": "gaX1rGPdv9eyPra0cYsYZA", "stars": 4, "date": "2010-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1wMGLaMIH7CcmJ2htS1rmw", "review_id": "i1QIr-UBEbu1z_MIfJ_aLQ", "text": "After reading the reviews here we decided to check out Bell' Italia last night. \n\nAs others have mentioned, its a tiny, family run place, maybe eight or ten tables total. They had the Sinatra going on the sound system, and the NY-LA game on the TV's, but the sound was turned all the way down on the game, which was good. The Sinatra was more pleasant to listen to than baseball announcers. We ordered a large pepperoni pizza (most of it for home leftovers), lobster ravioli, and ziti with meatballs. My wife had the sangria, which we all tasted. \n\nThe food was all good. The prices were a little high compared to Vincent's, which is where we usually get Italian, but very much in line with any of the big chains. The pizza had a fairly thin crust, and was very good. The pastas, according to my wife and niece, were good. The sangria was real nice also. I'm more of a scotch and beer person and never acquired a taste for wine or wine products, so this is high praise coming from me. \n\nWhat made this place stand out was the service. Very rarely do you find a place as friendly as this. They made a real effort to help us keep our two-year old happy, bringing out some dough with a tiny little rolling pin for him to play with. They also gave us some cheesy garlic bread on the house, which we all loved. We also got the usual complementary bread and oil, of course, which was also good. \n\nAll in all this is a really nice little place. Highly, highly recommended over chains like Olive Garden. We'll probably continue to order our carry-out from Vincent's, but when we're in the mood to go out for Italian food, Bell' Italia will be high on our list.", "business_id": "hgb1RihLYRSpFBjBhn8rZw", "stars": 4, "date": "2009-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "O6gv84PCivRYWp52Nlr2hg", "review_id": "tB3gV0dPf3NuXmKDjICRwg", "text": "This is a cute family owned restaurant. Small inside but the food is SO good! We had eggplant rollatini, stuffed shells, salads and pizza. So good it's definitely an east coasters dream place. Eggplant was tender and not overly breaded. Shells were cooked to perfection! Pizza was thin and tasty. We've been coming here for years and love the people who work there. A definite stop for east coast Italians!", "business_id": "hgb1RihLYRSpFBjBhn8rZw", "stars": 5, "date": "2015-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s2uFF2G9h0d7jdJYhPWU6A", "review_id": "qDO2h4iPFL_TKoGHPgRBpg", "text": "Overall is good. The vegi pizza is fresh. The pasta is pretty good. They also offer extra saurce for it.", "business_id": "UpYva_zhJ6pRGfdTruIYIg", "stars": 4, "date": "2014-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "t2vt5C1x1oudBKwvsvUDQA", "review_id": "6QkuXDWCsKf8VlA_Pd_sMQ", "text": "As a former New Jersey girl who was raised on pizza made the right way, I've found my home away from home.  I might have shed a tear when I bit into my first slice.\n\nThe crust has that perfect amount of crust, not too thin and the cheese is heaven.  We've been going once a week since we found the place and I'll never eat pizza anywhere else.\n\nStaff is friendly (yes, even Jersey lady if you talk to her for more than a minute) and service is quick.\n\nMmmm...I think it's time for my weekly fix!", "business_id": "m3O2EFVs3eo8s40MGGzmsA", "stars": 5, "date": "2010-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3EGc7iK1sIltuGulQFZwcA", "review_id": "7Z6GnSEabgWCC1HEtc_GUw", "text": "Very disappointed that the original owners aren't there anymore .. They used to be very good and very close to New York Pizza , now the pizza is horrible . It's either under cooked or burnt . I wouldn't recommend a Sicilian pie , they have no clue . The chicken parm hero is soggy ..  I had to wait over an hour and a half for my pizza bc it was either burnt or they gave it away . I would never go back", "business_id": "m3O2EFVs3eo8s40MGGzmsA", "stars": 2, "date": "2014-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9F3ZmyGKIA6ALNWgEq3Log", "review_id": "O3wfGqfBd4bFk0DsQt_xLw", "text": "This place is an East Valley institution! For starters, they have live music regularly, and they always have an annual show with Melt Banana from Japan, which is always a blast! Sound is awesome, and the cover is reasonable. Drink selection is amazing, and they have a signature drink menu as well. They have a full kitchen, and even offer breakfast starting at 6am! Perfect for those working the graveyard shift. Prices are good and drinks are strong. The decor is awesome, a good mix of pulps and movie posters and the like. All in all a solid neighborhood bar, music venue, and all around fun joint.", "business_id": "Cp5_NSJFNgylD5SUdmT8nQ", "stars": 5, "date": "2012-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DY5KIrDvxuhYiRiY4r4l8Q", "review_id": "Y-vOuHbthfuTKr9AcaXWaw", "text": "I went back here finally after 3 years of staying away. What a dissapointment. The prices went way up, the food way down, and the attitude has not changed. NOW, I can say I will never return. Ate 1 bite of lasagne and did not like it, TOO too much acid. Server said \"just take it home and eat it tomorrow\". If that was the case, I would have. For 30.00, I could have went to Olive Garden and really enjoyed it. Spent 180 for nothing and left hungry, no apology or offer to change it, I am never returning to this DUMP!!!!", "business_id": "sllZXXYijYUs-n80uSa96w", "stars": 1, "date": "2013-10-04", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "UPtysDF6cUDUxq2KY-6Dcg", "review_id": "FSjjwsdWpZ7L1rwI7yoeJg", "text": "Five stars for the memory. (hope you all enjoy it) When I was a kid we went here as a family all the time, but one time when I was a baby the organ came out and started playing and I almost bit my moms boob (other parts but keeping this pg for the kids) right off. No matter how many times we go back, nothing will ever get my family to stop telling that story. Lol.  Pizza is decent, and service has always been ok, although I haven't been there in quite some time!", "business_id": "VRxelK__tuQD0KBxx2LzeQ", "stars": 5, "date": "2009-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p5j_HnhZIToxmAhma1qCrA", "review_id": "sluxDZ808hOTqMnZ2V5f7A", "text": "Dirty ice. Apperently roaches near drink station in kitchen", "business_id": "VRxelK__tuQD0KBxx2LzeQ", "stars": 1, "date": "2015-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_qEHpIm100z3kWEzUKBL4w", "review_id": "16UdISJErNDpgVPzbVapCA", "text": "If you order from here get it take out. It took them 2 hours to deliver my one pizza. My poor kids were starving and I didn't even get an apology. I kept calling and they kept saying it would come in 5 mins. They need to get their act together.", "business_id": "WRzJ8GymVfBj9W6M8wpzAQ", "stars": 1, "date": "2011-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AeucYo8J-rZjcq09Wuqsjw", "review_id": "Wd2b7jigiZK2EB5-sBA-uw", "text": "Awesome Aweome Awesome !!!!\n\nWe do not do pizza night often but every now and then we do and I suggested Nellos since I have driven past it several times as in the neighborhood and I'm always into finding new spots by the house. We check out the menu online and I am in LOVE with all of their ingredient choices! I'm a woman of variety and Nellos has it. We ordered 3 small pizzas and created two of our own and also tried the Bianca pesto Pizza as well. Everything was absolutely heavenly!!! The thin crust what eggplant/artichoke one we created was my fav.... you will never get eggplant at Pizza Hut people but Nellos is def worth the splurge! I picked up our pizzas about 25 minutes later and when I arrived pizza was ready and I was in and out in no time to get back to our Sunday evening of Guitar Hero. Cute spot inside and we well def be back to check out the bar and try out happy hour!", "business_id": "69c7z9ySnlqV87tITDGENA", "stars": 5, "date": "2011-11-21", "type": "review"}
