{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b-XqgkyZ8NZr-RGJq0KoJw", "review_id": "wfvvgqDZL3Y7msewVV0GZA", "text": "First time here and I wasnt impressed at all!  I should have gone to the dairy queen :-(", "business_id": "Rjx8GcWuCzfVsKC5iPIcQA", "stars": 2, "date": "2013-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7IPdr4DfB5TizGvUGZeozA", "review_id": "QUvMAULwE-L_skdsw7AwNQ", "text": "The best place for an artic swirl. :)", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2009-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "T_wjLgPOPXry7Bea4MzoVQ", "review_id": "CwJA7-zzj5shB4t68rqBWQ", "text": "This is a cool little ice cream stand that has apparently been in this location for quite some time.  Their advertising reach is not very far, but if you get close to them you will see and be inundated by the colorful myriad of amusing bandit signs that are posted.  What caught my eye?  The orange sign that looked like it belonged to a construction company that said, \"Ice Cream in 500 ft.\"  Points for originality and tenacity.  \n\nFor my first visit, I ordered the following:\n\nApple Dumpling Sundae\nVanilla Ice Cream with chocolate sauce\n\nThe associates were nice and quick and I enjoyed my apply dumpling sundae.  It wasn't too sweet and had really good apple and cinnamon flavor.  I really liked the dichotomy and juxtaposition of the hot of the apples against the cold of the ice cream.  \n\nA true testament to their popularity is the fact that they still have patrons awaiting their fare when it is 50 degrees outside.  I want to try so much more of what they have to offer.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 4, "date": "2010-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "6deaMWBaD4P3QjghDoWxrg", "review_id": "HlSPNNOHmgBGymiDTISLSA", "text": "Have driven by this establishment many times when I lived in Pittsburgh and in my visits, but I never pulled over to sample the goods. That is until today and it was really good!\n\nDon't be swayed by the lines. The staff is really efficient and move quickly. Prices are reasonable and portions are huge. \n\nAlthough I was really impressed by the different flavors of soft serve and that they are all homemade, I saw the sign for the apple dumpling sundae so I opted for that instead. My aunt went with a classic chocolate shake. \n\nThe sundae is massive and the ice cream was so good, some of the best vanilla that I've had. Only critique is that the core part of the dessert were canned and were too sweet and sugary(- a star)\n\nEven though I don't opt for anything vanilla in life, I think I might squeeze in one more scoop on this trip!", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 4, "date": "2012-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9cCTmiJ7hz35rHIdr8n9kA", "review_id": "cWjjj65Zal76GtoFbrRjfQ", "text": "If you never drove down East Carson street, you are missing out on PageDM. Not far from the hopping SSide but in a strange looking spot next to a bridge and at a not so fun corner with a little parking lot.\n\nBut the ice cream is to scream for!  Flavored soft serve ice cream, a Yinzburg Sundae,  a vanilla shake with some real vanilla flavoring.\n\nThe Original Root Beer Barrel is still in the window!\n\nDelicious.\n\nCash only.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 4, "date": "2012-10-01", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "_vS9qNQvx8wVUOIkj4qfAg", "review_id": "o8utJ-ne_MBvKte2yb3Zdg", "text": "In my opinion, soft serve is the best kind of ice cream. I love Dave and Andy's, but I have lost many scoops trying to lick my ice cream and it tumbling off the cone and right onto the hot cement of Forbes Ave. (The 5 second rule does NOT apply here!!). \n\nI adore Page's because it has EVERYTHING! It reminds me of home, where I can go to Pappy's in Uniontown or Bill's in Belle Vernon, places you can grab a burger, fries, nachos, a sundae, shake, or cone. Variety is the spice of life!!!\n\nWhile you're waiting in line, make sure to read the news paper clipping about the root beer barrel DJ J mentioned.\n\nThe parking area is weird and difficult in my opinion.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 4, "date": "2012-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JeFoNHDRhowMQWs9tA_AUw", "review_id": "ZZhVhInhF1Ec0e2jBk41uw", "text": "Great ice-cream at a reasonable price. I love their chocolate banana milkshake.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2012-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tQjvFcsbpUre8zRRpK7zMw", "review_id": "eWOeXPuPWWKAswMSJIJt8w", "text": "The best soft serve I have ever had. Some flavors are better than others. Of the mint chocolate chip, toasted coconut, and pistachio that I tried last night (what can I say, I was hungry) the toasted coconut was the best. It has real pieces of toasted coconut.\n\nA very good value for your money.\n\nDon't expect to find any seating here.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 4, "date": "2013-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "5qx1_UsVr6fW3hetX_rCsA", "review_id": "VJMsBIpQXolE6RVMl2VTqw", "text": "Page's is a must have summer spot! Once you go once, I guarantee you'll go back! There ice cream is so good and there's so many different options to pick from! You could pick something different each time you go there, and still never run out of options. Not only do they have ice cream they also have food items such as hot dogs, burgers, nachos, etc. They get super busy on evenings and the line can be pretty long, but it moves quickly and it's part of the fun. They don't accept any cards, only cash...there is an atm outside of the building. The prices are so reasonable also! I love page's!", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2014-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "jThUkO26of_9arLY5zUszg", "review_id": "6AZ6zyDEVL2EmbI0ynBRaA", "text": "Page's is the best ice cream place I have ever been to! Their ice cream is creamy and full of flavor and their artic swirls are filled with all the good stuff, no more digging at the bottom to find the goods! They use Nancy B's decadent cookies, which shows you they care about the quality of what goes in their ice cream! There is usually a line to wait in, no matter what the weather is, because everyone wants a piece of Page's! The only small, teeny tiny issue I have is the location, while there is much history behind it (Refer to windows for newspaper articles), it is dangerous to pull in and out of on the corner of Carson and Becks Run. I got in a horrible accident by someone who hit me coming out of Fagel Street, which is right behind the dairy mart, so just be careful pulling in and out of Page's. Other than that, this place is sure to melt your taste buds! And it is wallet friendly too! Just bring the cash, no cards accepted (atm on location) and make sure you get there before they close for winter!!", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2014-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mxo0eNM-b6gOYHU5-eod6w", "review_id": "BrctUacD64zD3_G6tj1sRw", "text": "It's ok if you like soft serve and enormous amounts of it.  I am not a huge soft serve fan and I find the flavour of Paige's very bland.  So I t tastes like cold sweet and that's about it.  The atmosphere is great and it's worth a trip come here once just for that.  I don't think it is worth a second trip though.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 3, "date": "2015-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sqj09mc5M680xeZ2Hu7Z8A", "review_id": "gh9qw6MSN8Vn-dB7LegN3w", "text": "Love this place. The soft serve is so yummy! My mom always took us to get ice cream here in the summer when we came to visit. Just stopped here two days ago and it was just as delicious as I remembered! I just hate trying to pull out of this place because traffic is always so busy in every direction.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2015-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6GkN-2eDeu-j4s7_PWiS5A", "review_id": "fKw9_fM6jqgbbyjWlcAoWw", "text": "Page's has become my family's go-to ice cream. My favorite is the birthday cake which contains ACTUAL BIRTHDAY CAKE. If you're feeling sassy, ask them to dip it in peanuts. There's always a line and parking can be dicey so bring your bike or compact car! It can also be a pain to get out of this place when there's traffic.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 4, "date": "2015-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MvcLuHgZ9d1cJM4pQe2EGA", "review_id": "UY2kz2MP0wIQz8KmzDG_fw", "text": "Been ordering from them since the early 90's. Always hot and fresh.  Best white pizza I ever had. Hoagie's are great. Burgers with curly fries with cheese is always a favorite. Sometimes they don't answer the phone for what ever reason, but when they do its great.", "business_id": "VkqKyq09rDYMhFk5nElWWA", "stars": 5, "date": "2014-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "jThUkO26of_9arLY5zUszg", "review_id": "nY29keYwUJUZ7l3G5VJ46Q", "text": "Bishops used to be the best pizza place around but anymore, it is mediocre at best! It really just depends on when you get it. Some days it's better and other days it's not. The taste and quality isn't consistent. Just recently we ordered from bishops and the pizza did not have a lot of cheese and the crust wasn't warm or tasty. It just tasted bland. I know that this particular location has been for sale but still operating, so hopefully new management can turn this place around and make it as good as it always used to be!", "business_id": "VkqKyq09rDYMhFk5nElWWA", "stars": 3, "date": "2014-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HucqZjjxcz4QTdWEtqMl7Q", "review_id": "vQes3ZUY9r8SdWcZP75m3A", "text": "Not sure why people talk bad about this place. I own a business that they will deliver to and we get food from them at least 2 times a week. Might be a little ore money but worth every penny. Ignore the bad reviews on here. This place is one of the best food places out there..", "business_id": "VkqKyq09rDYMhFk5nElWWA", "stars": 5, "date": "2014-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WWYhf4h6OjjMaTu0uz550Q", "review_id": "rWS_27NrnQUa_zYetG5Q5g", "text": "I can't believe this place doesn't have more reviews! There is something so satisfying about buying an Isaly's chipped chopped ham sandwich right from the source. The sandwiches I bought here were so good and wow I can't believe I'm raving about something as simple as a ham sandwich but man it was memorable. This is seriously one of the last remaining Isaly's locations so it really should draw more attention than it does. Unfortunately no Klondike bars (they were invented by Isaly's) because apparently Isaly's lost the naming rights to Klondike bars or so I heard. Get the chipped chopped ham!", "business_id": "I9-Ei8_KYtMjbixNJSCvwA", "stars": 4, "date": "2015-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "6VEID9yjoYWFZkUcP_GNBg", "review_id": "NAhqPVCWNtWW_bhzwe5fGw", "text": "Exactly what you'd imagine from an adorable neighborhood ice cream shop. When it's time to grab a cone, this is where my kid wants to go! Good s'cream too!", "business_id": "LV_OCiR9rOHVHgdhbpqw2Q", "stars": 4, "date": "2013-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-mkeftjZkAAmAegAlgZY_Q", "review_id": "9GYnamNRguDo1VRqPYFGUQ", "text": "We took our three grandsons here today for ice cream--what a find! It's a terrific ice cream shop with a wonderful neighborhood feel about it. The guy who served us was also unbelievably patient with our 9-year-old twins who took FOREVER to chose what flavors they wanted. Oh, yes, & the Hershey ice cream was smooth & tasty!", "business_id": "LV_OCiR9rOHVHgdhbpqw2Q", "stars": 5, "date": "2015-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cFD42nNaAT3Mcw5m_EK9jg", "review_id": "z9J3bcQl5eqfxymkyGQP4g", "text": "Don't waste your time. Incorrect orders are the norm. It's fairly disgusting (sticky tables, trash everywhere). The last time we stopped in there were seven people working...but maybe actually three doing work. The other four were checking their cellphones or standing around talking. There is one young girl there who works her ass off but the rest contribute to the chaos.", "business_id": "9aw0t0rlACKkMaxsX0KlKA", "stars": 1, "date": "2015-09-07", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "ApYIFJh2L0yce4sqILrtYw", "review_id": "w_S5__VHC3FbUSaplshj-A", "text": "This place is a MUST!  I don't live in Pittsburgh anymore but visit often throughout the year and go often when I'm in town.  I'm a native Pittsburgher and I didn't even know about them until well after college.  Now I'm hooked.  They have a penny candy section!  Remember the penny candy stores that used to dot Pittsburgh's neighborhoods??? I hadn't thought of those in years until I stepped into Klavon's.  It does that to you, it takes you back. You'll understand what I mean the minute you're there.  \n\nThe owners and the people who work there are SO WONDERFUL you'll want to go back and back.\n\nThe ice cream is delicious and they have the best homemade (? I think) whipped cream.  I often get amaretto and it is scrumptious.  You can have jimmies, sprinkles, caramel, nuts, etc.  \n\nThe atmosphere will kill you, and the story behind the place is really interesting.  Look it up or have them tell you.  It is authentic old Pittsburgh.  You won't be disappointed if you go here.  It's an experience and a wonderful one.  I can't say enough positive things about it.\n\nThey have a small parking lot behind the building.  It's not that far away from the lively part of the Strip District.  A nice afternoon would be shopping for produce down the street and walking up to Klavon's for a treat.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 5, "date": "2008-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QZtUJwDilqJyxUpaNoOHtg", "review_id": "AOaAU406umrg_jLb33g7qQ", "text": "awesome!\nthe shakes. and ice cream. and candy. and food. and the decor!", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 5, "date": "2008-09-21", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "mJtackEVsKn89YN63MN4ig", "review_id": "ZatpYxso16UY4aECbzduRw", "text": "I first heard about this place (or saw it) on one of the Rick Sebak WQED documentaries about Pittsburgh (which btw you should watch them ALL - they are fantastic).  In the program the place was old and run down and waiting to be remodeled.  He then did an update to that doc in which it wa reopened.  When I saw this I had to go.\n\nThis place it amazing.  The only classic soda fountain ice cream shop I know of.  It is soooo cool.  Classic style soda fountain, vintage hard to find candy.  The decor is just great.\n\nI totally admire the owner for getting this place together and reopening it.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 5, "date": "2008-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "kMJAITuqfdBmr3O6Acq10A", "review_id": "7E-y1RvMM5KmPpO4sM0Ajw", "text": "Squeezing in the last summer treats in is tough but trip to Klavon's revealed another Pittsburgh delight.  I can't believe I had never visited before! A Wee Sundae- white house with marshmallow, Amaretto whipped cream and rainbow sprinkles for me.  And a strawberry sundae with pineapple and whipped cream for him.  SO good.  I kinda wanted to throw in the towel and order another but I used will power and resisted the urge.  So we will just have to make a repeat visit! Friendly service makes you feel welcome and relaxed.\n\nOh just an FYI: $1.50 service fee for debit/credit card....", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 4, "date": "2010-09-07", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "6QhWTugzBJ3cdv2N4WZcSA", "review_id": "5Z7CThXqVrq-VGLxLrdI_g", "text": "We visited on one of the first chilly days near the end of this summer. The place is definitely adorable, with remnants of the old pharmacy against the back wall and a totally nostalgic soda fountain feel. \n\nI got a turtle sundae, which was good, not amazing. But good. They have lots of choices for toppings and combinations, and the prices are reasonable. They need to get rid of the moody teenage girl behind the counter though; she kept swearing under her breath, she had chipping polish on her fingernails (health department anyone?) and wore shorts that could only be described as denim underwear. I saw nobody wearing gloves or washing their hands while handling ingredients directly. Other than that the staff seemed nice enough.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 3, "date": "2010-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OPHNYPp5UvGmmixIfFTVnA", "review_id": "-8NddtgC5ohKu2Q3ED2czQ", "text": "Awesome place to go on a date. Cheap and super cute.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 5, "date": "2010-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1uHPzP0hYNVDvuHVPSKNQA", "review_id": "NN8_KndXsaZ9oMEzo0nZLw", "text": "This place is totally a trip, but so charming. Has anyone ever seen the movie 'Nothing But Trouble'? If so, this place was straight out of Valkenvania. Luckily, the ice cream was superb. I got the black cherry frozen yogurt and after one tongue swipe of my cone, I'd forgotten that I'd chosen frozen yogurt as opposed to ice cream. Can't wait to go back...even if it is totally freaky time warp.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 4, "date": "2010-10-30", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 3}, "user_id": "b9WOuVFcnHxEGYXWdCeIVA", "review_id": "TwXpeg0rY_HYXVPQg1z9YQ", "text": "Mannnnn, I'd LOVE to get invited out on a date here!\n\nI mean, it's perfectly adorable and ever-so-vintage. You've got antique decor (though oddly, they don't feel antique here - it just feels like you've stepped back in time and the whole world is like that), yummy ice cream cones and shakes, candies from yesteryear (with prices to match!), and a friendly staff.\n\nI found this place via a LivingSocial coupon, which truly worked since I never would've known about it otherwise. Klavon's is tucked away in a somewhat deserted part of the Strip District, surrounded by abandoned industrial storefronts. I had the chocolate chip cookie dough cone, which in itself was pretty good, though not amazing. The milkshake and old-school candy? Totally awesome! Highly recommend due to the super sweet (no pun intended) step-back-in-time ambiance and homey feel.\n\nNow all you need is a hot date and a poodle skirt, right?!", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 4, "date": "2011-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "J_q8jN623uew8ZzMChXBCA", "review_id": "06KV8DFk7winhN3hn-vTYA", "text": "Klavon's is a wonderful slice of history.  It's a beautifully preserved old time pharmacy and soda fountain.  Ray Klavon is the owner and the grandson of the original owner, and this soda fountain is an absolute labor of love.\n\nThere are selections on the menu that you can't find anyplace else...Depression Era Phosphates and also Egg Cremes.  My favorite ice cream dish is the Ballerina...which looks absolutely fabulous and tastes great.\n\nI love the old phone booth, the marble counters, and the other small details that indicate this place is the genuine article.\n\nI keep going back again and again, and I am always warmly greeted by the staff.  This is an especially nice place to visit by bike.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 5, "date": "2011-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "M0ZdzSHYFiqKSrkU_spdnw", "review_id": "Hnzre4QrB3NtnISX9VrT0Q", "text": "Absolutely loved this place!!! All the makings of an old school ice cream shop and to top it off, the ice cream is fabulous!!!! The experience and service is excellent!! Can't wait to go back!!!", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 5, "date": "2012-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bI6bMu0ZsomD-blY_3WL5g", "review_id": "aqlNaSM4wU92oWK9ZFeTTQ", "text": "This ice-cream spot is actually a block away from my house. So that explains the frequent visits from time to time. I heard they kept the store the way it was after the new management. The style was definitely old school but I liked it. \n\nThey served the ice cream behind the bar and the cash register is behind a glass case. They usually take your order when you come up to the bar or sit down at a table. You actually pay AFTER you eat.  This makes the entire process quite troublesome since the store does get filled up easily and you find yourself standing at the cash register waiting for someone to take your money. I will give them some time for the service to improve since they are new and still learning. Besides that, the man that works there (I assume the manager) is always accommodating and offered us cups of water.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 3, "date": "2013-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "EeOBT-RohoF3yWAG36dTDw", "review_id": "TB15zqmQKLYFF1O0X81GEQ", "text": "Klavon's was a miss for my son and me. We came on a Saturday afternoon after walking the strip district. When we entered there were lots of people and and no structure for procedure in ordering. We sat at the bar and waited 5 mins or more to be acknowledged by employees who were making ice cream 24 inches away from us. Literally they kept their heads down and refused to make eye contact. Just when I was about to get up and leave a lady said I'll be with you in a minute thanks for your patience. So I decided to stay and listen to her complain to another employee about a customer who changed her order from cake cone to waffle cone. Maybe that's a thing here in PGH or just the establishments I walk into where employees openly complain about customers in front of other customers.\nMy son only wanted a scoop of ice cream and I had a 1 scoop hot fudge sundae. Some how the total came to $7.38 for that. The ice cream was icy like the kind you would buy in those gallon buckets. \n\nToo bad. It's the kind of place that should be a treat not a 2 star review. Oh, the two stars were for the candy selection and old timey feel of the place.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 2, "date": "2013-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "9Zm4RVIVDh4t7CkI3-QvOQ", "review_id": "HLsfsJeO5RzqmeRVSuLLKw", "text": "What a great place to stop on a beautiful Pittsburgh evening.  Our group of seven were greeted by two helpful and knowledgeable young ladies, Jessica and Courtney to explain all the yummy offerings.  They serve Penn State Creamery ice cream which is rich and creamy.  They offer custom made flavored whipped creams (chocolate, vanilla, pumpkin pie) To top their decadent sundaes and treats.\n\nThey also offer a variety of \"penny\" candies and fudge.\n\nWhenever we need a sugar rush we will be returning to Klavon's!!", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 5, "date": "2013-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tAKjY3bQXH51msJbOHYPmQ", "review_id": "fzVpff0OZ3YdHwR5TagQ9w", "text": "Ok, so what we have here is an early century gem that is kind of covered by a thick layer of lack of knowledge and interest in history.\n\nWe stopped in before a two-store 'block party' in the area, and having heard about it for years and never been in, we decided to check it out. Entering was kind of a wonderment initially, scoping out a somewhat back-in-time feel and appearance, with shelves of old style candies and gums for sale, a menu board with a handful of varieties of ice creams, sundaes and other concoctions available for somewhat reasonable prices. And the Terrazzo floors are pristine and gorgeous. \n\nThe decor is mostly original old soda fountain, with original shelves and display cases, beautiful marble tables and wooden booths, and original snack counter, vintage blenders, etc.\n\nI ordered a double espresso and my friend ordered a coffee, and I do have to say kudos for knowing how to properly fill a double shot demitasse. The espresso was a little on the sour side, but good enough for what I expected at an ice cream store.\n\nI think that what could make this place fantastic would be eliminating the 'youth' from the employee team, or at least replacing them with folks who had a clue what that era represents, and how to recreate it, or, at the very, VERY least, educating the youth on what it was like, and how to recreate it.\n\nWhen I'm sitting at a vintage marble table, sipping espresso from a demitasse, I'm a bit thrown off by hipster music coming from a Pandora box, and a service staff that looks like they just came to work directly from the Urban charter school, dressed like silly high school kids.\n\nI sampled the ice cream, the death by chocolate...and although it tasted 'ok', hearing the story that this old fashioned ice cream parlor bought their ice creams from Penn State Creamery, and did not make their own, well, that was about as 'authentic' as the Necco company candy reproductions being sold to 'look' vintage, but all of which were really just watered down versions of the originals.\n\nThis place could be so much more than it is, a true destination, if the 'theming' was carried through in a more careful and thoughtful manner. Turn off the hipster tunes, and put on some big band or old fashioned malt shop tunes. Try a nice crisp uniform instead of saggy (or skinny) jeans with a sloppy looking over shirt or T-shirt. \n\nWhat should be a very cool and warm, inviting atmosphere plays off as a little cold and sadly weathered.\n\nCreate a few more aspects of the true old fashioned malt shop, ice cream parlour and lunch counter, instead of a 'trendy' collection of outside sourced lunch options, and the run of the mill sundae collection, simply renamed to be 'cool'. Throw in a kitchen sink challenge, maybe some home made baked good...\n\nIt's a very cool little building and spot...with SO much potential. \n\nIn South Florida is a place called Jaxson's...this place ALWAYS had a line so far out the door that they'd hire a keyboardist to play in the parking lot to keep people entertained while waiting, and they'd pass popcorn out to the waiting line.  They also had the vintage candy shelves, and you could truly find ANYTHING still made. Their ice creams were all made in house, and they would have bells and whistles going off if you ate the whole 'Kitchen Sink', or similar creation. They had a nice simple kitschy line of 'real' meals, to accompany the ice cream\n\nTHIS was a 'destination', not just an after thought.  And this is what Klavon's SHOULD strive to be.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 3, "date": "2014-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FN-0pdqsB_CS97OPwFlK0w", "review_id": "_7xAzAMX1exueOKNZjkjdA", "text": "I came here with a group and enjoyed a peanut butter swirl milkshake with m&ms. It was a hard decision given the many choices available for ice cream, sundaes, and milkshakes. I love that the staff will do custom orders. The vintage look of the place  is really cool along with it's neat candy display in the corners. The staff are super friendly. The location and parking were convenient in the strip district.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 4, "date": "2015-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q90mNaC6nAstl8DWbrGoVA", "review_id": "3h-XlRJDcn5H6xznQ31bwg", "text": "One of the biggest draws to this place, I think, is the 1920s style of both the parlour itself and the ice cream sold within it. That said, it's still good enough to stand of its own, even without that draw. They sell a bunch of old-style (I'll assume all from the 20s) candies and snacks up front, also. Would recommend.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 4, "date": "2015-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dP3TbWkCnARMdosiRC0_oQ", "review_id": "YCBM6fq9vGmlb-oW7zc9_Q", "text": "This place is awesome. Completely authentic and has the old school charm, not to mention the menu is huge! 20 different sundaes, shakes, splits and floats. The service was super friendly and they genuinely seem to enjoy themselves. Did I mention the sundae I had was delicious! I got the cookie n cream with hot fudge and I asked for peanuts so they threw them on. It so was inexpensive. My friend got their homemade chocolate almond ice cream and she loved it. Def recommend for families or even date night! I will definitely be going back!", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 5, "date": "2015-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nwGJxknW4F63ICGGJuoUkQ", "review_id": "CvYQ8wHDgzEC4IOwTEBIIA", "text": "Giving this place 2 stars because I like the ice cream but after my last experience I really want to give it 1. \n\nOn Wednesday, I called at around 6:30 pm and asked how late they would be open. I was told 9:00 pm. I went at 8:15 pm and it was closed! Why would you give me a closing time and close so much earlier? \n\nI called the next day to ask what happened. I could understand if an emergency came up, but nope! I was told that they had no customers for two hours and they decided to close early. I'm sorry you didn't have customers that day but you can't just close whenever you feel like it, at least adjust the timings and tell people the hours accordingly. \n\nTL;DR: I drove 25 minutes in both directions just to see a closed sign on the door even after I called to confirm hours, so disappointing.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 2, "date": "2015-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "6QhWTugzBJ3cdv2N4WZcSA", "review_id": "QTht_tRadFGfkKoUjpiwnw", "text": "So we've been a couple times. It's a cute little place, reminiscent of the little corner ice cream place we went to as kids. Now this isn't Cold Stone quality stuff, but it's decent and cheap. Plus they have REAL Slush Puppies, old school style. It's a little confusing when you walk up, you can't tell whether they are taking orders at the window or inside the shop. Minor problem though.\n\nI was forced to deduct two stars, however, after I visited today. I ordered a small cookies and cream \"Flurry\" and was shocked, nay, FLABBERGASTED to learn that this place, which has the nerve to call itself a business, uses FAUX Oreo cookies. I don't even know if I can walk down the same street as this store ever again. They may as well have given me a Rocks and Gravel Flurry. A travesty, really.", "business_id": "3_3yJMo2dTPeq8woOW69IA", "stars": 3, "date": "2010-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4nb2kePC91_GutcXHxG66Q", "review_id": "QynDN7yIjlaOPTX8WNKN1Q", "text": "if you like blizzards from DQ, Twisters is better. More filling and it is a little cheaper. Solid little shop", "business_id": "3_3yJMo2dTPeq8woOW69IA", "stars": 4, "date": "2013-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KOrggEZ4aa7JzVIuY-Zgkw", "review_id": "3lyKnSP6wOjEtcMM5RMtzg", "text": "A nice small local ice cream shop. A great place to grab some soft serve on a hot night. I can't say to much about the place other then the soft serve is good and very cheap. They also don't skimp. It's easy to walk to and they have seating outside. Now I only tried the soft serve but they have a larger menu. Sad to say I no longer live in the area and won't be able to try this place out again.", "business_id": "3_3yJMo2dTPeq8woOW69IA", "stars": 4, "date": "2015-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6ptKeJ-B8epsojFP47Gmng", "review_id": "96-KASAb-_DIrLUITpGLQQ", "text": "I've lived in Bloomfield a while and never made the trek over here since it's kind of at an odd location and there's no parking. I got a free coupon for it from the Entertainment book and gave it a go.\n\nLooking into this place, they have no website. It's 2015. You can create a website free at blogger. There is no excuse. That's low-rent. They do have a facebook and they do have a pic of the menu in the photos, but you have to LOOK for it. I shouldn't have to look for something, it should obviously be there.\n\nI read online that it opened at 11am, wrong. It opens at 12. I arrive at 12:03. They ask me to wait and still have the door locked. Not a good first impression.\n\nI saw they had a soft pretzel on their menu, so I ask for one. They said \"we don't have it anymore\". They sell little but still can't keep their menu up to date. Not good.\n\nI get my ice cream and get lip about using the entertainment book coupon, with them saying \"waffle cones don't really count towards it\". Thankfully they give it to me without further lip.\n\nTotal for one waffle cone with sprinkles = $4.70. It's actually cheaper at Dairy Queen, plus you get more.\n\nThe ice cream was nothing special. It was melted within 10 minutes and the cone was from the previous night as they pulled it off the holder. I used to work at Brusters and we would make cones ahead of time so they would be fresh. Not here. It's also likely the next person to come in wouldn't be able to get one since I think I took the last two.\n\nWOULD I GO AGAIN? If I really wanted soft-serve ice cream and didn't care, sure. But there's nothing special about this place. Dairy Queen and Sweet Licks in North Hills are superior.\n\nADVICE TO TWISTERS - Get a website. Get up to date menus. Make sure your opening and closing time is listed correctly.\n\nRATING - 2 out of 5.", "business_id": "3_3yJMo2dTPeq8woOW69IA", "stars": 2, "date": "2015-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "07fx2Z7MYNhEMWvwf4w2vQ", "review_id": "v4pUYAQSSstwhdw7E2PDMQ", "text": "Best coffee on Walnut. Ice cream is excellent. Like the other commentators, I feel the service can be hit or miss, mostly because the lack of a clear location to form a line, but it is generally excellent. The venue isn't as cool as Coffee Tree, but the staff are always friendly, and again, the coffee is better. This is my go-to coffee place in Shadyside.", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 4, "date": "2011-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_7Lg8iTWpFc0O7PEA8FmbQ", "review_id": "-oaeu05VwM3Xng6DsRCTKw", "text": "With Coffee Tree Roasters and Starbucks packed to the brim, I mustered up the courage to go back to Jitters after my first review. And the experience was a total 360! I've been back a handful times thereafter to make sure I wasn't dreaming and it has been consistently good I'm happy to report. Each time that I have gone the staff has been friendly, attentive and quick. I do like how they list the coffee of the day and of the three places here on/near Walnut I have a preference for how Jitters' coffee tastes (Starbucks is too dark for me and CTR's roast just doesn't appeal to my palette tho sometimes you'll see me sucking it up and drinking their joe). Jitters is a local neighborhood joint so you'll tend to see the same faces whenever you go which is nice and comforting in a way. They have free wi-fi though password protected and you need a key for the bathroom. I'm very glad that Jitters has turned into a positive for me!", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 4, "date": "2012-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Dl2vvLKeRXuIF1xjP4YKzQ", "review_id": "RmRbvbPh8Bf2fEFvAC5PDA", "text": "Awesome staff, quick and accurate service, great tasting coffee and free wifi... Umm, what else do you need?  I avoid the other coffee spots on Walnut either because the staff ain't so hot or it's always jam-packed.  Jitters is cozy and clean, check it out if you need a quiet little place to work or study.  The baked stuff always smells delicious, but I have yet to indulge...", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 5, "date": "2013-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UD7Y1CqfY6mDmRwIuCf6nA", "review_id": "TePYKwthzZ7B8AOqiOsbeQ", "text": "Sorry folks, I'm not a fan.  When out with my family we decided to get something frozen for a treat.  The one good thing about this place is that it serves Dave & Andy's ice cream.  But that is possibly the only good thing about the place.\n\nThere is no order in here.  Especially with three possible ways to enter.  The proper entrance at the front of the building, the side entrance or if and when the doors are open, walk right through the front of the store.  With that, no one seems to know where the line starts, if there is a line at all for service.  What should take just a few minutes to order your item easily turns into a good ten to fifteen minute wait staring down the person that just cut in front of you and several other people.\n\nThe pricing seems a bit high here too.  For two scopes of ice cream the cost was equivalent to going to a frozen yogurt place and getting a cup filled with not only frozen goodness, but mixture items as well.\n\nThe place is nicely set up, but it does feel a bit crowded in here.", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 3, "date": "2013-10-07", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "o9XGClSBzCsQxbcCzTPdnQ", "review_id": "J4VVsiLU1B83pa3YkHSRqw", "text": "I generally hate flavored coffees, but I always enjoy the flavored coffees here, especially the Hazelnut and Coconut when they are featured.\n\nThe remodel makes the place much more inviting than it was in the past, and I love going in the mornings and seeing all the regulars. \n\nIt's definitely comparable to Coffee Tree Roasters a few storefronts down, and definitely better than Starbucks. Fun spot for studying I would imagine, but those days are behind me thank goodness.", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 4, "date": "2013-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dyhZMuEqxgcnmAIqEeMKDw", "review_id": "l4eOzH1G0m7gcZIM4lBzgQ", "text": "Their coffee is solid--better than coffee tree roasters, imo--and the atmosphere is nice and relaxed. Prefer this place over the local chains any day.", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 5, "date": "2014-10-13", "type": "review"}
{"votes": {"funny": 5, "useful": 9, "cool": 6}, "user_id": "9OZH1Ecw-qUkCW5MS0NefA", "review_id": "lVRZUqT-kgJ9gkEOYh9I3w", "text": "I just came back from a visit to Jitters, and it has totally changed in layout from how it used to be two years ago.  The counter, which used to be against the wall on the Negley side, is now across from the main door on Walnut. I think the new layout is a lot better and more intuitive.  While the space is bright, clean, and welcoming, it's quite small, only containing six tables plus a few lounge chairs inside.\n\nI ordered a small cinnamon-cardamom herbal tea, and it was served nice and hot.  I didn't add anything to my tea, but condiments and napkins can be found across from the barista's stand where you order.  I also wanted a snack, so I decided to get a potato chip cookie, since (1) it looked the most appealing and (2) it sounded interesting!  It was saltier and crispier than a regular cookie, but was still also sweet, and had a drizzle of chocolate icing on the top.  While I liked the sweet-salty combination, I would have preferred for it to have been a bit sweeter to offset the extra salt--if there had been more icing, it would have been perfect.  It was definitely different and interesting, and worth a try, though!\n\nBefore I ordered, I overheard the barista saying to other customers that she didn't know where the baked goods that they sell come from, which didn't sit well with me.  (If you read the other Yelp reviews, you'll see that they come from Prantl's.) Employees should be informed about the product they're selling.  Having said that, she did describe the potato chip cookie accurately, which partially redeemed her.", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 4, "date": "2014-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q0qEnJk9aJ7urcr-n3v5MQ", "review_id": "hL6O2rQO69qILh4QuQexfA", "text": "Staff is very friendly - made a specialty recommendation for me when I told them it was my first time in. I got an iced London Fog which is nothing short of delicious if you're in the mood for something out of the ordinary!\n\nDrinks are served in real ceramics/glassware if they are for dine in, which is always a plus for me. Additionally, the atmosphere is light and airy. All the outside seating was (unfortunately) taken, but the inside was bright and had lots of natural light.\n\nWill return when in Shadyside next!", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 4, "date": "2015-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "vcDwG_IjnzRB80dxpB1eVg", "review_id": "NkPjG51y9MPWmE6fXLdvyQ", "text": "One of my favorite place to drink coffee with friends. Great coffee and friendly staffs. Thumps up!!!", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 4, "date": "2015-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MH8ey3I2SHqEqzhGI-dCuA", "review_id": "XQGe4MjYjSTb1T2NnwDtSw", "text": "A lot of people who come here are regulars, and for good reason. The baristas are super friendly, and they really take the time to get to know you. They serve high quality coffee at a fair price, with excellent espresso, and talented baristas. They also have Dave & Andy's ice cream available, which is delicious and local. Jitters is a great small business which also supports other local businesses. Check it out!", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 5, "date": "2015-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "uSm3JH4lM2HwT85HXRCKTg", "review_id": "QSQ6RS7MZjQ6uOJDcVHEIA", "text": "Love the place. One of the best local places in the area. Love the atmosphere and vibe inside. Reasonable price and friendly staff.", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 5, "date": "2015-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2jkE2AhFum7t3jHSngMZtg", "review_id": "1P5t79ey3YZZ8mHkA-S_Vw", "text": "Great ice cream and many flavors to choose from. The staff is friendly and the place is clean. Parking is tricky when u leave because u back out into traffic on the main drag. The price of the ice cream is ridiculously high. Two scoop sundae was over $5.00 a banana split was nearly $7.00 I don't know of many locations and with those prices they may not last long. I hope they do though.", "business_id": "jt5lOq4Ab33j4LdfjrK42Q", "stars": 3, "date": "2014-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aTi0NVrcPJWbN6jAsJVcAw", "review_id": "ldEzfUMyIZGfpZzz7v2YkQ", "text": "Halfpenny's is a soda / ice cream / quick-bite-to-eat shop in the bottom of Two Wachovia Center.  Hours are 7 a.m. to 4 p.m.  This is a popular spot to grab coffee, bagels and muffins in the morning but don't look for a lot of menu variety at lunch.   It's fine for your morning coffee and afternoon ice cream cravings, but I'd say get lunch somewhere else.", "business_id": "HzZ3424aEgmElEP06l0KKA", "stars": 3, "date": "2008-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_reGn3AGRxCpGA1HiolMhQ", "review_id": "fj9OpDLXh8H_IA8jBejOjQ", "text": "Halfpenny's has been in this spot for FOREVER, and even with changes of ownership through the decades, the food and service remain consistent.\nGood food, good prices, friendly service.  The owner remembers my preferences, ALWAYS!   And remembers my name, as well as the names of other regulars.   Love this place!\nOne time a colleague was kind enough to get my lunch, but did not remember my preferences.  When my colleague mentioned my name, the owner told her how I like my sandwiches!\nThis is a very popular spot for fast breakfasts, good-value lunch specials, and ICE CREAM!  Love those mid-afternoon pick-me-up milk shakes.\nNot a coffee drinker, but this is a very popular coffee place, offering many different flavors.\nThe Mrs. recommends Halfpenny's.\n.", "business_id": "HzZ3424aEgmElEP06l0KKA", "stars": 4, "date": "2013-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OHjkyigiMfWlVPlCEj3vRQ", "review_id": "lb9c-lDbULQ9AzRxiKcVjw", "text": "Good, honest food, at a fair price, made by cheerful folk. I've been going there for years, and am rarely disappointed.", "business_id": "HzZ3424aEgmElEP06l0KKA", "stars": 5, "date": "2014-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Zwsq31eNUo2HpdkV2h9aig", "review_id": "DSAM-qiRCdUhw_z_mfmGDA", "text": "Wow...this local place is spot on for a good lunch. Walking in, it reminds me of an old timey lunch spot, straight out of the 60's. For lunch, they serve up burgers, hot dogs, & some other sandwiches & such. I had a chili cheeseburger & oh wow. These things are made fresh & cooked when you order them. It was a great burger & had all of the condiments I love on a burger, especially the hard to find chili & slaw combo. \n\nWhile chili & slaw are put on your burger behind the counter, they have a condiments bar with all of the extra fixings. From ketchup & mustard, to lettuce & tomatoes, they have everything you could think of to put on your hot dog or hamburger.\n\nAlong with the food, they also have some great dessert in Tony's Ice Cream. I grew up in Gastonia, so I know all about Tony's, as it's some of the best ice cream you'll ever have. I didn't have any at Snoops, but I can vouch for how good it is.\n\nYou can get a great lunch here for under $7, which with the burger I was served is simply amazing. It may not be the healthiest option in Charlotte, but well worth a trip every so often to grease your arteries.", "business_id": "nhPdxY-jbf-XVQ6Hq6qJPw", "stars": 4, "date": "2008-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MZBF4LqZrT5yefELVbUhfg", "review_id": "2W_AYqZzyNzKrEU81285lw", "text": "Great burgers, excellent price", "business_id": "nhPdxY-jbf-XVQ6Hq6qJPw", "stars": 5, "date": "2010-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tFI7Bi1D4-QlYLFeL_cIyA", "review_id": "yJGZ3b2GzNOYA1kX61DtpA", "text": "Delicious burgers, reasonably priced!  The burger toppings are delicions and fresh - I love the \"build-it yourself\" options.\n\nDon't miss the fantastic lemonade or orange-ade that is fresh squeezed when you order it!", "business_id": "nhPdxY-jbf-XVQ6Hq6qJPw", "stars": 5, "date": "2011-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YI6GKJPaU3lF648POJ6Yag", "review_id": "aRFhB7NkxpwZNrOBkBD5gw", "text": "Yes, the hawthorn location closed. They were going to become a phat burrito, but that has been currently scrapped and is just closed. \n\nThere is still one location open on Westinghouse blvd. and they just opened for dinner as well as lunch.", "business_id": "nhPdxY-jbf-XVQ6Hq6qJPw", "stars": 4, "date": "2012-09-24", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "8ED8BPCXKXZnGsVMyl5Bhw", "review_id": "qdQDN6aiR5NriREK-aLrCw", "text": "Yum!\n\nThis place is dangerously close to my house. I sometimes go on this horrible milkshake binges, and Maggiemoo's is fresh and delicious at a great price.\n\nThey've got a great selection of flavors, and they ice cream cakes are fantastic. It's also nice to be able to get the ice cream cupcake...you usually think of ice cream cakes as being for special occasions only, but the ice cream cupcake concept lets you just get one whenever you want.", "business_id": "IQbEYPh7OKoUmsI6VoLmTw", "stars": 5, "date": "2008-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l24YZc4-y9RNCMiqgLRo5g", "review_id": "DXeAqXs9-1-njGXOapCwLQ", "text": "I live Maggie Moos but it seems they're out of red velvet ice cream most of the time.  I guess with it being a best seller.....but that should be a clue to have more readily available.  The staff is always friendly which is a plus and last time I tried a flavor I had never tried.", "business_id": "IQbEYPh7OKoUmsI6VoLmTw", "stars": 3, "date": "2014-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "X36p3mD4oqBE53sASc_Ykw", "review_id": "mwQFLtiDdGQycCyfaaB3Hw", "text": "4.2 Stars -\n\nThis is a mini version of Coldstone Creamery and just about as good....maybe better. I got a double scoop of Dark Chocolate and plain Sweet Cream (which sholud be renamed BUTTER CREAM!) Inside of a dipped cone. This was very yummy as the flavors were bold and rich. They offered toppings but I was content to just have the ice cream naked! Very delicious on its own.\n\nOverall an EXCELLENT choice for a frozen treat while in the University area!", "business_id": "IQbEYPh7OKoUmsI6VoLmTw", "stars": 4, "date": "2014-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2-uR7a5losM7P_PAZdws3A", "review_id": "dKc_-awQf1YqgPbTDdY9Ew", "text": "There's a wide variety of sandwiches to choose from.  The chunky chicken melt kind of tastes like Thanksgiving, I don't know how to describe it better than that.  It was just really good.  The ice cream was pretty good.  I've had better, but not very often.  The service could have been better.  The people just kind of seemed uninterested, if that makes any sense.  Overall, I'll probably be back if I'm in that part of town, but I won't seek it out.", "business_id": "M8CC5_9vEvt1yOI2pnkvKA", "stars": 3, "date": "2008-09-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "oi5Hw6hHraOG9qWkNoFyyA", "review_id": "icgGaMoJ1BhV7-AB1WSx2g", "text": "Perfect little ice cream shop from the prices to the sandwiches. Staff is friendly and orders are made quickly. It's located  on a broadwalk so it perfect for just a spot to relax. Make sure to grab one of the huge brownies for a buck and some change before leaving this place it's well worth it.", "business_id": "M8CC5_9vEvt1yOI2pnkvKA", "stars": 5, "date": "2010-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "un7xBdyOEs_ArUgtJjr5ow", "review_id": "MTZjH56YbnJBZvqRSqBfLQ", "text": "Who says no to desserts? Hardly no one I ever know! After walking a bit at the Boardwalk, we decided to get ice cream at Ninety's Ice Cream & Sandwiches. Since we already ate lunch, we skipped on the sandwiches and just ordered ice cream. I got the salted caramel chocolate ice cream in a waffle cone. I really love the flavors and liked the chocolate chunks, not to mention the creaminess of the texture. Next time whenever I do come back to Charlotte, I will come back and try their sandwiches.", "business_id": "M8CC5_9vEvt1yOI2pnkvKA", "stars": 4, "date": "2014-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l_vRCjYILaY9PYWevubPwQ", "review_id": "67d-r6tRNFSWXbvGR6FPDg", "text": "I wanted ice cream so my husband pulled off the highway at this Culver's. We opted to get the flavor of the day (cookie dough craving). I was disappointed to find that it was a chocolate custard with TONS of cookie dough chunks because I like custard and not just the mix-ins, etc. but it was overall a decent sundae. I'll just stick to vanilla next time!", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 4, "date": "2008-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WsGQfLLy3YlP_S9jBE3j1w", "review_id": "kzFlI35hkmYA_vPSsMcNoQ", "text": "Love it!!!!! Love it!!!!!! love it!!!!!!!   Who doesn't love Culver's!", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 5, "date": "2012-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wC6THvVd2U1yHSN3HcD0Ug", "review_id": "8_XJAD-A1ecpKniOd9nkgQ", "text": "This is \"our\" Culver's. We visit a few times a month and my inlaws always buy our kids Culver's gift cards for little holiday gifts. At the De Forest Culver's, the staff is friendly, the managers are awesome and the food is way better than the stuff from ordinary fast food chains. It's hot, fresh and Wisconsin-owned. Woot!\n\nThe only downside is that it costs, on average, about $25 to feed our family of four there. That's pricey. Thank goodness for my inlaws and those gift cards!!", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 5, "date": "2014-10-29", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "QP-MdjpUFejr9apuAWcfQg", "review_id": "V2ejGJtqKJLRx1gGtxMAOQ", "text": "Pretty darn expensive for custard but it is really good, possibly the best I have ever had.  Been there over 15 times and have yet to see an adult working in the place.  Service is hit and miss.  Our last trip the IQ level of the help was very low.  Bathrooms are usually clean.", "business_id": "AYoLKzRFajucKnjIFxc__A", "stars": 4, "date": "2007-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9SU4T5EvO3UVy7e-26yCjQ", "review_id": "DXV3dSU7Aw5syPPWAHQTKQ", "text": "Honestly, Cold Stone has the best ice cream I've ever had.  Maybe I don't get out much, but this stuff is fantastic.  \n\nThis particular location always comes through - it's clean, the staff are friendly, and they are very accommodating (throwing some take-home concoctions in the freezer while we eat our current order in the store).\n\nWe never get Cold Stone without a coupon, however.  Yes, it's fantastic, but expensive.  Various coupon books (Entertainment Book, maybe the Bucky Book?) will provide BOGO coupons, or buy one, get one $.99.  That helps.\n\nFavorites include:\nMe:  \"Strawberry Shortcake\" (made with cake batter ice cream)\nWife/kid:  cake batter ice cream with brownie in it\nkid:  well, anything chocolate, but he loved the banana ice cream too.\n\nThe flavors are spot-on.  Sample a few when you go in (even if you know what you're getting already!).", "business_id": "AYoLKzRFajucKnjIFxc__A", "stars": 4, "date": "2015-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PFtbOIt89VdJB6OLLNaEGw", "review_id": "ECriUysgMGjNv8WVK4Ehvg", "text": "Ok, I heard from someone that Culver's had cheese curds.  (For those that don't know what a cheese curd is then ready this wiki article.  Don't worry I didn't know about them until I came to Wisconsin.  http://en.wikipedia.org/wiki/Cheese_curds)    So, when class got out early today, I decided that I needed to hunt for the elusive curds.  The easiest place to come was here.  But the curds are not the traditional curds, they were fried curds, like fried mozzarella.   A nice snack but not exactly was I was looking for .... on with the search.", "business_id": "kiAsweI4sOjDzGyz3Y_HsQ", "stars": 2, "date": "2007-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7OP-I_VSr6L7FlzsqWjdIw", "review_id": "cjEv7AxWiSMeJfjN79lb_Q", "text": "This place is the bomb.   Fresh burgers and the cheese curds are melt in your mouth perfect.   The service is way above average and the restaurant is very clean.   I have enjoyed Culvers for years when we would visit on vacation.   Now we live here and we make a weekly visit to Culvers for dinner.   Of course you have to top the meal off with a custard.   It is a fast food restaurant but it is way above what you would expect from a fast food restaurant.", "business_id": "kiAsweI4sOjDzGyz3Y_HsQ", "stars": 5, "date": "2013-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "R04P35fYVS4HASyBuMcElg", "review_id": "Y9r6tGwMNdfT9kiQPsFNRw", "text": "Culver's famous Butter Burger is a great step up from classic fast food options like McD's or BK's, but isn't at the same level as Red Robin, In-N-Out Burger, or Five Guys'. That being said, it is still delicious, and, since there are Culber's restaurants all over Wisconsin, it's convenient.\n\nThe real reason to go to Culver's is for their custard. Concrete mixers are where it's at, and, if you're not careful, you'll move to Wisconsin 40 pounds lighter than when you move out.", "business_id": "kiAsweI4sOjDzGyz3Y_HsQ", "stars": 4, "date": "2014-10-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "oSA746-4MCJpWorJkzxqpQ", "review_id": "c9gR8kG64lfSFrROnYlXeQ", "text": "Fact: i have been to way too many Culver's locations of late. But this one is as great as the rest. Perhaps even better in that is isn't overly air-conditioned and has a unique seating layout reminiscent (in a good way) of old Country Kitchens. Cozier than other locations. Great and fast service. Tasty burgers. An excellent lunch on a day out doing wedding-related things with my mom. 4 stars!", "business_id": "9wsv3WwH0HtwPvD8XCdT_g", "stars": 4, "date": "2012-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7OP-I_VSr6L7FlzsqWjdIw", "review_id": "B--VrnKhU1GwZaT6yJqh2g", "text": "Decent Culver's from a service perspective but the food is as great as you would expect at a Culver's.   But no tv.   I thought all Culver's had tv's.", "business_id": "9wsv3WwH0HtwPvD8XCdT_g", "stars": 4, "date": "2015-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "efLAz7cbHbo_5oYuES6ujA", "review_id": "ffgZQCku5yH0cbWXxmhe8A", "text": "As far as any Culver's goes, expect a higher quality of fast food. We personally love our Sun Prairie Culver's because they are very accurate with others and attentive to customers. There are also fantastic at giving back to the community.", "business_id": "9wsv3WwH0HtwPvD8XCdT_g", "stars": 5, "date": "2015-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hM04DSbUuFGn5acI_np2dQ", "review_id": "hIOCrSPox7HrdGaxW_JVXw", "text": "this place has great service, the lady that helped me had no problem of me asking to taste test all the flavors I wanted to try. They have a ton of flavors, which can be good and bad. TOO MANY OPTIONS! there was another person working there which might have been the manager who was just chatting it up with her friend and not helping the other worker.", "business_id": "0FdNeZAx-afgg8HV9oyqSw", "stars": 4, "date": "2014-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-HQ5lmi-JkEwy9iXd8-fmg", "review_id": "vMAkfTd0iZnkqfPoGDSDMA", "text": "My fiance had a taste for ice cream after going out for dinner, and this place was on the way home, the two people behind the counter were funny and very nice and helpful. The Blueberry Cheesecake + Waffle cone is where it's at, My fiance got some carmel Chocolate something or other that she really liked.", "business_id": "0FdNeZAx-afgg8HV9oyqSw", "stars": 3, "date": "2014-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7Ebh7CAuSklYmwb-JpQo0A", "review_id": "ZMMJALJ7hFC-FUUwCfi7EA", "text": "I got two flavors on a cone and the scoops were huge, so that was a plus! I asked for a lot of samples but the lady behind the counter was nice and didn't mind at all. There were a lot of flavors to choose from, so that was the main reason why I had a hard time deciding. Minus one star because another lady working wasn't really paying attention to the customers or helping the other out. \n\nI got the Black Cherry and Black Raspberry flavors (I know, lame combo lol) and my boyfriend got the Salted Caramel and Kitty Kitty Bang Bang. I was sorely tempted to switch cones with him cause I liked his better. \n\nMoral of the story, try flavors that have eccentric names.", "business_id": "0FdNeZAx-afgg8HV9oyqSw", "stars": 4, "date": "2014-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tT4r3WFUr4KJawi_Un_2QA", "review_id": "inc7xh8YRdQcUxBDC3zojQ", "text": "It broke my heart to see the staff make food for folks who didn't actually order it (appeared to have made too much) throw away the items that no one claimed. The staff should be trained to offer complimentary items when too much is made, versus throwing out perfectly good food in front of a line full of guests. What a waste!", "business_id": "q83uB6EGF6y2MuR-7VZPRg", "stars": 2, "date": "2015-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "xSI7zNvo6UBrcdmRO4fAWg", "review_id": "QS_AhRBItUam6OiV4a1DJg", "text": "Each trip home I need, need to stop by here  for the requisite small turtle sundae: its melty eggshell-white frozen custard, hot fudge, caramel, a pile of pecans and cherry on top makes my day. Or my year. \n\nTake a pint to-go, too. I'm currently dreaming about their pumpkin custard. Mmm.", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q", "stars": 5, "date": "2009-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_HxOsUTJuvpedEdU_19iKQ", "review_id": "I9QDkuDjkz6qOWCpojy87w", "text": "Cheddar burger, check. Vanilla shake, check. Food coma, double check!!! This place is old school burgers, fries and shakes; and they are good at what they do!", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q", "stars": 4, "date": "2009-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fl3z1szzUcpzuWEiy2mr3g", "review_id": "n-zzwrRqfuRsDEA-_oBaug", "text": "Better than Culvers. But more expensive.", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q", "stars": 4, "date": "2010-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1-bhSFWLp2eI1Bj8ZlG4HQ", "review_id": "NEwmOsmM1wgCWXf2YQNwhQ", "text": "If you stop eating frozen custard for a while and then go back to it, you  wish you never tried it again.  After a few years frequenting this place, the Oreo malt is the only thing I consider ordering. And that is only if someone I'm with really wants to go and is paying for it. Prices are obscene. All of the food is greasy, bland, and expensive.", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q", "stars": 2, "date": "2010-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3ulh3ylZhTTsxPIXXm0HmA", "review_id": "HCqPG38xD__Yv8wKyW0pag", "text": "Good, wisconsin-esque experience.  The flavors of the day, mint oreo, then cookie dough, were just ok.  Would go back, unless I found someplace better.", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q", "stars": 3, "date": "2010-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QmXVPx1jfWz8-jhe23xVFA", "review_id": "YGFt5BW2ca1tW4SMj_E5tw", "text": "Great custard, fresh toppings, overall its amazing. $$$ though. I paid $4 for a chocolate shake and it was not even that big. A cheaper alternative, obviously Culvers. I would still recommend Michaels though.", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q", "stars": 4, "date": "2012-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "RvweNJFVkR3ttkWsIBy7nQ", "review_id": "tdKPOP1m4XMR-C-5cHay5A", "text": "Please do not ever go here.  This is a public service announcement.  I do not even know you and I like you too much to suggest this place.\n\n1- Prices?!  Are you kidding me?  $6 for a milkshake?  It was tiny.  Not to mention it was not much of a milkshake.  It was a peanut butter cup shake.  They took some peanut butter cups, crushed them and stirred them into custard with some milk.  I saw the whole process.  It was not very impressive whatsoever.  The flavor was ok.  \n\n2 - The food.  I had a chili cheese dog.  This is my standard order when it is available on the menu.  The chili tasted like Hormel.  The hot dog was hot and the chili was warm.  I like that they have shredded cheese on it, rather than liquid cheese.\n\n3 - My dining companion got a burger.  It tasted ok, but it was a very thing patty. He also ordered cheese curds with it.  They were so greasy and lacked any good flavor in the breading.  \n\nOverall, we spent nearly $20 there and I was not satisfied with my meal.  Every talks so much about how great the custard is.  Nope.  Not good.  Go to Culver's!  Seriously, for $6 you can get something TWICE the size with more mix-ins.  Better yet?  Get a cone for you AND a friend.", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q", "stars": 1, "date": "2013-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aygJzxCaec7e0UcxeJzmKA", "review_id": "FAxzKveUfNYetrR-1xE57g", "text": "The custard is nice, but little flavor variety. Only 3 flavors. The people working at this place have little patience for the indecisive.", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q", "stars": 3, "date": "2015-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "TmMXPkMuPDOTQ7z2PC-fuA", "review_id": "D5TveLDFzdd61Jj33IvF6A", "text": "After a good workout, a friend and I had the \"hangries\".  We wanted something quick but good....and being almost 9p on a Friday, there weren't a lot of options outside of fast food or pizza.  I have some odd dietary restrictions so I wasn't expecting much from Michael's.  I ordered the California burger (without cheese, mayo and a bun) and sweet potato fries (I was ecstatic about that option).  Not only did the young guy at the counter hardly flinch when I ordered, but he humored me when he called out my ridiculous order in front of everyone waiting. I'm sure, like most people, he wasn't excited about working a Friday night but he didn't lose his sense of humor. \n\nTaking food to-go is always a gamble as well.  Michael's did a great job packing the food so it wasn't spilling everywhere or soggy by the time I made it home.  My burger and fries were fantastic, good portions.  My friend had the bacon cheeseburger, fries and chili dog and loved it as well.  \n\nThank you Michael's!", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q", "stars": 5, "date": "2015-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "16fUoxbABxFICJuVNxvI1g", "review_id": "28DdPmzSMclddFANQv3Vqg", "text": "Expensive but Delicious! I like the cherry torte sundae it is my fav :)\n\nAlso, it is across the street from the park so you can enjoy some sweet views of the Madison Skyline on a summer day/night!", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q", "stars": 4, "date": "2015-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ffa864LL90s6oxImKPI7pw", "review_id": "rG7lP_Gu91Uljqc7JJBNEw", "text": "Love me some Culver's!  The burgers rock, the cheese turds & onion rings are fab, and the fish fry is REALLY good!  And, let's not even talk about the malts!  OMG, sooooo gooooood!", "business_id": "FiP9q_YD5vgxu_Sflo5oZw", "stars": 4, "date": "2013-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "2d6bYq_7cfi8zp0lswZjOQ", "review_id": "4HFrxuLJ2W9k5KCTzmhNcw", "text": "This place is sad. From the time we walked in until the time we left I witnessed so many things wrong the health board would shut them down. First a waiter eating a bag of potato chips on duty at the bar talking to 2 girls.  Then the guys cooking the burgers starts talking to them. He puts on one of the girls sunglasses and continues to cook. Then he gives them back and plays with he key chains. Then cooks again. Never washing his hands and never wearing gloves. Then I see our waiter come out of the back eating food as he is getting our drinks, meanwhile no manager in site. Finally after about 20 mins the manager Lewis comes out of the back for just a bit to talk to a couple waitresses and drinking margaritas the night before. This place is a total joke!!!!", "business_id": "DWZ1_iy-cTeehK5FTiqH-g", "stars": 1, "date": "2015-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pnW4cDs9yHTuuihTaubK8Q", "review_id": "KHtBxJlPiLIjwmqUMcKWww", "text": "I'm leaving a 1-star review only because Yelp won't let me go with 0-stars.  I also cannot leave a review for the food due to us picking up & leaving before we could get a food order in due to the lack of organization in this place.  The table of 6 sitting next to us mentioned they had been waiting for close to an hour, and 5 of the six were just about done with their food and one person was still waiting.  We said forget it, and went next door to Cracker Barrel and got seated & our food very quickly.  \n\nIt appears that the other reviews for this location are similar to what we experienced.  Poor management, poor attitudes, and I can only imagine what goes on with the food preparation.  Save your hard earned money and avoid this Steak 'n Shake at all cost.", "business_id": "DWZ1_iy-cTeehK5FTiqH-g", "stars": 1, "date": "2015-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "HANb8-8InWnju-XzBQQSBw", "review_id": "y5Vuw2bIwrek91u-r6pd-A", "text": "Open only in warmer weather, these design-your-own custard creations are akin to Dairy Queen - but better!  The wait in the long line at the stand is worth it.  Choose your custard, pick candy or nuts to have blended in, and enjoy.  If you're counting calories, hold out for the pumpkin pie custard, available in the fall only.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2005-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "sUrU9l3_f1iWYZdLmop0Rw", "review_id": "vvNYMybEr5InwTu2CwCfNA", "text": "Custard Cup was my friends and I's place to go in the summers! They have the best tasting Custard around! You can create your own mixture with their large variety of toppings! It kind of reminds you of a Dairy Queen but sooo much better!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2005-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "UDBtgT4qGrP1bNm7pPlzUw", "review_id": "K0E8Lzq_LifoWBIVOKIChg", "text": "Goddamn I miss this place. Cold Stone Creamery has got nothing on Custard Cup. I have so many awesome memories of friends and family gathering here on hot summer days and nights. The only bummer was that it would shut down at the end of the season and we'd have to go without these delicious treats for a whole 6 months. Smart choice on their part. Because as soon as those doors opened at the beginning of each summer, the line never ended til the end of Sept.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2007-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "vNhHiztGh3yrcqvZ5Pk5AA", "review_id": "mGfehqjskZoDDrBfEsYsXg", "text": "I totally love that you get your custard and then sit out on the picnic tables.  It is as close to \"the good old days\" as it gets anymore.  I really like that you can add banana to anything too!  And I've gotten my kids the Teddy Bear Custard Cup a couple of times, its cute.  They love it and its pretty cheap.  Its just a regular cup of custard with like 5 teddy grahams stuck in the custard and you can add banana or nuts or whatever.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2007-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3kIfmKSvUWOX4HoME9CcKQ", "review_id": "2CrqHJJD0k6t1OHpRcbHnw", "text": "I love Jarlings! Every time I come and visit Champaign, I have a craving for Jarlings. Their ice cream and custard is the epitome of comfort. It's nice to grab one of their shakes for the long ride home on 57. Their peach shakes is one of my favorites.\n\nBut don't forget, they accept cash and personal check only. No plastic.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2008-09-01", "type": "review"}
{"votes": {"funny": 7, "useful": 3, "cool": 4}, "user_id": "SpKVX3rt892E-BrL-yeqiw", "review_id": "KMB89lVp5CPcbhMPqdbvXQ", "text": "You are a delicious custardy fiesta.  I ignored the hype, and went in wary, and came out full of dairy goodness and joy.  Jarling's is an unpretentious establishment, basically a small structure with some picnic tables--and a crapload of delicious frozen custard.  I went with the pumpkin pie snowstorm, and the regular size was enough for a small meal (think of it as a dinner shake, if slimfast decided to kill you).\n\nTasty time.  I'm gonna go again before the snowstorm becomes a real thing and not just an item on the Jarlings menu.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2008-09-17", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 3}, "user_id": "x7ZP6lB2fZl2UN6lun87lA", "review_id": "4BV1zFB5a_Dl8QY6TcvnyQ", "text": "I like custard.  Jarlings sells custard.  Therefore, I like Jarlings.\n\nSo it's just a standard custard shack, except that it's not a shack, it's a huge building.  I'm not sure what they are doing with the industrial-sized kitchen area.  \n\nI was watching the hustle and bustle behind the counter, and the custard machine is wild.  There's a big pipe slowly crapping out forearm-sized ropes of custard into a stainless steel bin.  Then the workers scoop the custard out of the bin.  Fascinating.  \n\nI didn't order a baseball-helmet sundae, but I did notice that they have the helmets of every team.  That's cool.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 3, "date": "2008-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PpXJwpZ9sFwGFUKFcWq_1w", "review_id": "xpWb4s3lC2Bs84rZujWJOw", "text": "I've never had frozen custard until I lived in Champaign. Let me just say that this stuff is amazing!! Prior to this I was a huge fan of Dairy Queen. Jarling's Custard Cup has changed me forever and I miss it greatly now that I'm back in Virginia. I'll never look at DQ the same way again.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2009-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_hz_dF3yYAUdbD8rwqbVPg", "review_id": "ZsAHakBeXtGcOc6alHrltQ", "text": "Custard isn't really like anything I've tried before. It's rich and creamy. I got chocolate the first time I went there, and I was told by pretty much everyone that I made the wrong choice. Come here for the lemon custard. I haven't gotten into all of the other complicated choices, mainly because the lemon custard on a sugar cone is so darn good! And the prices are extremely reasonable. My one complaint, and it's a small one, is that they don't take credit cards. Oh well, guess I'll have to keep cash around for when the mood strikes!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2009-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "7a5tgR4lbdAefJIbCmSuUg", "review_id": "6t-n-FLqbVN7MITlBD_SIw", "text": "I was lucky in college. I had friends with cars or I had a car to drive to Jarlings. It's kind of hard to get to otherwise and I wasn't that in love with public transportation back then. \n\nWhenever I'm in town for work, I figure out how I can maximize trips to Jarlings. I'm not kidding. \n\nThings I love:\n- Strawberry shortcake snowstorm\n- Pumpkin pie snowstorm (seasonal. Lucky me visits during the season)\n- Vanilla custard with chocolate/butterscotch sauce.\n- Strawberry custard\n- Any float\n\nThere's nothing that hits the spot as well as Jarlings.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2009-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hd4E2wcaEQ2kKDnGIjbhFw", "review_id": "7voVyBDb9h8Eb_i32LFmJg", "text": "Anyone that gives Jarlings Custard Cup below a 5 star rating is functionally insane, or, they were huffing spray paint in the preceding 5 hours before enjoying their tasty treats.\n\nSeriously, Jarlings is that good. \n\nTo those drawing similarities between their product and ice cream? You're gastronomically challenged. Yes they are both cold and dairy based, but it ends there. Their custard is obviously so much denser and creamier than ice cream. Ice cream by process has to have a bunch of air stirred into it.  \n\nThe only knock on the Jarling organization is that they don't want to franchise it or distribute the secret process. \n\nJarlings inc world wide could have an IPO greater than Google's\n\n;)", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2009-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IYZlG7UxayDAz9BKXRFQEA", "review_id": "-URQPNm1GF7irUX5hiYHmg", "text": "Boy do I loooooove Custard Cup!  I'm not a big ice cream person, but this stuff is awesome! My only gripe is that they don't accept credit cards... but it's so good that the one time I forgot cash, I chose to drive around Champaign for 20 minutes looking for an ATM because I was that desperate for Custard Cup.  I've only had the chocolatey-type snowstorms like butterfinger, grasshopper, reeses, etc, but I'm sure the others are just as awesome.  And the place is always packed which is a good sign that the place is pretty freaking sweet.  Mmmm I want some Jarlings right now!!  It's way better than Cold Stone, Marble Slab & DQ combined!!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2009-10-21", "type": "review"}
{"votes": {"funny": 4, "useful": 2, "cool": 5}, "user_id": "2sklUYBnk7LxzM-11yPUPg", "review_id": "1y1G2f6dIEnfiHrZIQljeg", "text": "Jarling's a darling.\n\nJ: ust so you know, this is my #3 frozen custard place.  Pretty rockin'!\nA: vailable seating outside.  Even in November.  :o)\nR: edonkulous amount of items on the menu, including a bajillion variations of snowstorms (like DQ's blizzard or McD's McFlurry).\nL: eery of overblended ice cream treats, the only downside to my visit was that my snowstorm started melting before I even got it.\nI: f you're reading this, Nov. 22 is the last day Jarling's is open for this season.  You're too late. :o(\nN: ever too cold to eat frozen custard.  Why are you open seasonally??!\nG:ot daily flavors of vanilla, chocolate, lemon, orange, and something else.\nS: uper smooth frozen custard!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2009-11-22", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "JzPCN2iEGNWvzvJOXM-dKQ", "review_id": "Mb0L84_W09ucr4R9ciOrmQ", "text": "Apparently this is Tom Hank's favorite place, how do I know that? I don't know, someone told me he visits the area and it's been declared so.\n\nAnywhos, I had never had a custard cup before, who knew in the college town of Champaign hid a custard cup place that would be as addictive as nicotine. I went 2 out of the 3 days I was in town visiting. \n\nCoffee Oreo Snowstorm on the first visit and Strawberry Shortcake Snowstorm the second trip, both costing a reasonable $3.75. Needless to say, I polished off both cups of custard each time. Supposedly 90% fat free, but I don't believe something that good could ever be fat free. \nThe menu is huge and every combination flavor imaginable is up there, it kinda looks like a McD's Flurry, but NO IT DOES NOT TASTE LIKE ONE. \n\nIt gets really packed on the weekends, I kinda want one right now, it gives me something to look forward to when I visit.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2010-09-19", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "NGX1PZwHET_oQOT7vkkxag", "review_id": "ASnQGx8Sv-pKdu1DDBvrYA", "text": "I have nothing against this custard place. Its old school, and an institution I'm sure. It has a ton of different menu items for the frequent visitor and I am sure that its custard is really good, compared to other custard stands.\n\nHowever, in my humble fat opinion, custard sucks. It is just not that good of a dairy dessert. Sorry, but custard is basically soft-serv iced cream with a little zing, owing to the addition of egg and/or a little fermentation. Anyway, not my thing. I would much rather go for scoops of \"regular\" American-style ice cream, a la Baskin Robbins down the street or, better yet, gelato (if its fresh) at Pekara.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 2, "date": "2010-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "tw3PFgey15p0ruFRVoFidw", "review_id": "bVv7ZRvpymvFpoY9LoCRQQ", "text": "Custard Cup is a LONG-time family-favorite (I have memories of going there when I could barely walk), but today I had such shockingly abysmal treatment from a long-time employee that I felt moved to jump on yelp to say something about it. \n\nSomeone in my group was having trouble deciding between two things while we were ordering, and she said \"just make up your mind, because there ARE other people waiting to order\" in a nasty tone.  For the record, there were two other couples in the place and both had already ordered.  We weren't holding anyone up, and even if we had been it wouldn't be by much... and while it's her job to make sure things move along, it should NOT come at the expense of acceptable customer service. \n\nI left the place stuck between feeling shamed by the employee and shocked at her treatment of us... not the way that loyal customers should be made to feel by any business.\n\nI doubt it will affect my future patronage, because after 20+ years of Custard Cup in my life, one bad experience won't keep me from returning while I'm visiting my former C-U 'hood.  It has soured the magic for me, though, and this can no longer be one of those pristine childhood memories.  Say it ain't so - what's next, Curtis Orchard??", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 3, "date": "2010-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "BvGV9lMMUmB5hLWkNlY3vw", "review_id": "5UJB1JvcAWhxnd_iGM6pAA", "text": "Pretty awesome. I've been going to this place since I was little, and it's been consistently good as far as I can remember.\n\nTHE ONLY THING, is that I wish they had a cake batter flavor, it's my favorite and sometimes it's the only thing that brings me to Cold Stone.\n\nOther than that, I love Custard Cup. I usually get a cookie-dough snowstorm, cold-fudge sundae, butterscotch sundae, or strawberry custard, but you can never go wrong, seriously. I never feel like it's officially summer until this place is open!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2010-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4YSr2lR8i4sVywgi-Y1CLw", "review_id": "euTVbM9dObq5u-cpVA3gfQ", "text": "Best custard in town. Loves. Fantastic local biz.\n\nSnicker Parfait is a winner, as is the Praline Snowstorm.\n\nPretty much hard to go wrong with ANYTHING on the menu here!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2010-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2RmOaMxFePjgIkRwRYioUA", "review_id": "F7JXXfNK1ivql2MfBLVEZQ", "text": "So delicious. Lemon custard with cold fudge is a favorite!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2011-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Kiq2D60hq6LHdPi3xqjZJw", "review_id": "CUWc0ztWErUMdp8zcQJI8Q", "text": "So the story is, I was down in Champaign for the Homecoming game, and being a fan of the Travel Channel food adventure type shows, I asked my friends what is the one thing they would have to have when they are back at their alma mater. Hands down answer was Custard Cup cold fudge.\n\nWhat is cold fudge? How is it different from all the other's? After listening to them raving about it and the anticipation of this so called cold fudge, we have have finally arrived at the cup. I didn't realize there were so many other flavors and I was curious what they were. My friend didn't know what they were either, frankly, it didn't matter as long as cold fudge was on the menu.\n\nFinally, custard in hand, so much hype has built up that I was now thinking it would be a letdown. I took one bite and in a few minutes I am scraping deep into the styrofoam cup. I liked that it tasted like real natural chocolate. All I can say is, I am officially hooked.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2011-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "XOnwygK-EerILmQSxP2K6Q", "review_id": "dYCpAu5aB0pohLkWxhkFQA", "text": "Apparently this is THE place to go for custard, and I agree! Jarlings has the largest flavored custard menu including fan favorites like vanilla, chocolate, strawberry and I believe, orange. They also offer a weekly specialty flavor.\n\nI'm still not the biggest frozen custard fan (hence the three stars), but Jarling's, nonetheless, is still satisfying. They offer sundaes, scoops, concretes (custard with mixed in candy or flavors, i.e., they make a \"grasshopper\" concrete).\n\nJarling's also has a classic, 1950s ice cream drive-in spot feel to it. There's limited seating inside, picnic tables outside, a drive thru window, ample parking, and high school kids in tye-dyed t-shirts taking your order.\n\nI also suggest getting a pint or quart to go. It's much cheaper than eating an order there.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 3, "date": "2011-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1VKKeTucAPQO-gf7rIAt5Q", "review_id": "xC8hbnzX-fSf3aVxRqFlog", "text": "Given how famous Jarling's is, this place doesn't need anymore 5-star reviews...AS IF!\n\nAbsolutely delicious! If you're looking for a tasty, sugary treat to heaven, look no further, you've found the spot.\n\nBut do beware of the largest size - unless you are Phelps or are on a \"dirty bulk\", you'll be consuming 3000 calories of pure sugar carbs.  Get the small size and let your taste buds go to heaven.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2012-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RH1qLpGvJxoYO8g0CVDKyQ", "review_id": "aa2sp4dOLrv0nyjLm130Hg", "text": "I remember visiting my uncle and going to Jarlings Custard Cup as a child. I'm an adult now and it was just as delicious as I remember! I got the Banana Cream Pie Snowstorm and it tasted better than a blizzard from dairy queen! My other family members got Root beer floats and they said that they tasted delicious as well.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2013-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UjS6tMpdxoVHrT5XRAPVOA", "review_id": "fQejy4xWOqd6C9Nje3vDRA", "text": "Cute quintessential stop on a hot sunny day after a game of tennis. Luckily it wasn't too hot and sunny so it wasn't crowded. I can imagine the lines can get long because they take care to make each order special. The sweet smell of homemade waffle cone wafts through the air the moment you step inside. They must be doing something right if they've been an establishment for 30 years.  There's also a drive thru for those on the go. The custard single dip is plentiful on a waffle cone. I like how they stuff a marsh mellow at the end of the cone to stop it from dripping.  The strawberry cheesecake, grasshopper blizzards were tasty and even the marshmallow malt was good though tasted more like vanilla than marshmallow.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2013-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NesaQNyzDRmSW6yoOPOgZA", "review_id": "oEj1K5_pCK9xrURWDQCOmQ", "text": "This place has so many flavors, it puts DQ to shame. So cheap, great vintage feel, outdoor seating. Short drive off campus.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2013-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NHkUIrdmKAHhRRhf5WBUKQ", "review_id": "U6YLt9rj5WydFWlS0LGePQ", "text": "A Champaign-Urbana institution. I've been going here since I was a kid and it's stayed consistent. Tough deciding whether to go with a Snowstorm or just some of the simple flavors in a waffle cone. The pies and ice cream sandwiches are great too.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2013-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XdlBjKW-leAJ_Ui31sFVHA", "review_id": "LW2csht7EFiQxzeOphNg0g", "text": "Cold fudge shake = heaven.  Seriously.  I think it's my favorite cold dessert of all time.  \n\nOnly give it 4/5 stars because their service is SLOW.  I drank an entire medium cup of coffee while waiting in line to get service.  And I'm a slow coffee-drinker.   The cold fudge shake is so good that it's almost worth the wait, though.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2013-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-DT5p9_ewd_jQOM3TAj2kQ", "review_id": "26DR_03qoE2Oa0PBW7YVhw", "text": "Fantastically amazing custard! The cold fudge sundae with vanilla custard is my favorite thing on the menu. The pumpkin pie snowstorm (seasonal) takes a close second.  We just discovered they sell frozen custard cookie sandwiches which are also yummy. \n\n It seems like Jarlings is always open when we need to make a \"late\" night custard run around 9pm or so.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2013-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "kRqk2li5lEm8R2EcYDrXBQ", "review_id": "1MDecNQbUJUIcYE473faTw", "text": "One of the first places I tried when I came to Champaign and it did not disappoint. I loved the texture of the custard with the chocolate filling and some nuts mixed in.\n\nI wish it were open longer--I don't even know when it closes but I am craving some right now.\n\nIt's so delicious! It's great for the summer days definitely.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2013-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h8ZdjqyHNRnlukDg-9OTww", "review_id": "XYhWq29O7nAQku4GoM0qqg", "text": "Jarlings Custard cup.. quite the Urbana Champaign institution it is. And deservedly so. It is only open part of the year, so its a question of making hay when the sun shines. There are long lines, cash only (till recently I think), but the custard is creamy, fresssh! and so worth the wait. They have a huge menu with all sorts of floats, sundaes and ice cream sandwiches but good ol' custard is something you just cannot beat!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2014-09-04", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "9UAW9TcYnfMVjoNYJLN-CA", "review_id": "dQbm2_MeovTzpxW3UOKhTA", "text": "Greatest ice cream ever. If you are within 300 miles of Urbana-Champaign, take an unforgettable detour to Jarling's. You can thank me after you have swooned on two large scoops of their vanilla \"custard\"  ice creams topped with pecans, bananas  and fudge", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2014-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hAj8mwHO77rcT9SnC_eSfQ", "review_id": "ZaC0QP-JIy0RJbyJQUGEUA", "text": "First, the vanilla custard and cold fudge are great. Unfortunately, the other custard flavors seem to be made with artificial colors and flavors. The key lime tastes like green Skittles, and the strawberry has a strong resemblance to cheap, pink bubble gum. This was probably okay back in the 1960s, but now it's kinda gross.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 3, "date": "2014-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OHlNjcJko1RYE2Ihv7sOMQ", "review_id": "fhfbfslINUfDZZk72Mw3BA", "text": "Best ice cream place in town.  I love their snow storm. Every time I ordered big one. Sitting outside with it. Life is so good. Only it is a pity that it closes at winter :(", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2014-11-08", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "goz54FSSoQkvWnElKz__iw", "review_id": "BeSSV2MFDSIKZJT4uPiBnA", "text": "Everything I've tried from here hit's the spot. I wish they'd stay open year round.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2015-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WIMjZojWHQgZTjpTSfJ7BA", "review_id": "sFgmzNobcQsbkw_Xp4lQyA", "text": "Okay, so I may be reprimanded for this rating! I don't get how this is good 'custard'. If custard stands for froyo-ish ice cream then yes it's good. Good texture, stays cold, no overpowering flavour and just yhe right amounts of sugar. And the lemon one is the best flavour. But, IMHO, this is not custard.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 3, "date": "2015-09-09", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "aSyHqB5QIybJb3npJUy78A", "review_id": "59gMFxmb3TRiPGVqLvVDnw", "text": "I love this place.... it is five stars.   Their cold fudge is the best.   Yes, it may not be real custard --- Culver's is closer to custard than Jarlings, but still Jarling's is AMAZING.  My only gripe ---- since changing owners..... it was the Friday before Labor Day ---  September 4, 2015..... the local pools are celebrating their last weekend of the season.  It's 94 degrees out....it's going to be mid 90's all weekend long..... wow, Jarling's would really hit the spot on this super hot sunny weekend..... oh wait.... the parking lot is empty....the barricades are up.  Sign in the window says, CLOSED FOR THE SEASON.   Hello?!?! It's still summer!!!  It's not even Labor Day..... you closed four days ago on August 31st?!?!  What the hell?!??!!!!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2015-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "-yYFnBCAVc3mgFt7m3syTw", "review_id": "KseHjFXs0uXc8VAzmPSFHg", "text": "Jarling's is a local ice cream gem! They offer a huge assortment of frozen custard, as well as ice cream staples like a banana split or sundae. I had a banana split and my partner had chocolate in a large waffle cone. Some words about our choices - you definitely get your money's worth and a little extra! They were very generous in their servings and the staff are just as sweet as the products Jarling's sells. \n\nSo why is this a 4 star review and not a 5 star review? If you are craving ice cream on a weekday or weekend evening (like we were), you will be waiting for a *long* while. Additional word of caution: you *will* be cut in line. Stand your ground and get your ice cream - it will be well worth the wait!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2015-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "1I_U7ShIQnxRRT1uDSdVhQ", "review_id": "PSl_s0N3G1cv99d7gN_c_A", "text": "Would have been five stars because the custard is AMAZING, the customer service by the rude associates took this review down a notch. Awesome custard. Horrible customer service. Kind of like Wal-Mart.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2015-10-02", "type": "review"}
{"votes": {"funny": 2, "useful": 8, "cool": 6}, "user_id": "0bNXP9quoJEgyVZu9ipGgQ", "review_id": "5Zy-Mbr_A9EWyzpjqe84Yg", "text": "07/01/10\n\nAfter my overall disappointing meal (had high hopes after reading rave reviews) at Tortas El Guero, I decided I'd check out the ice cream here- thanks to the recommendation of the TEG server.  Again, the Mexican rep behind the counter didn't speak English, so it took awhile to convey my wish to try a couple of flavors before settling on one (she kept asking if I wanted the flavor in a cup or a cone!).  I was at the point of giving up and just walking out when she finally figured my question out...\n\nBoth flavors were so good, I really had a tough time deciding!  Ah, but I do love coffee ice cream, so...  I still dream about the coffee here, so a return visit is in order very soon!", "business_id": "9pYBiLe3k5Gi-AJqRklXcQ", "stars": 4, "date": "2010-10-08", "type": "review"}
{"votes": {"funny": 5, "useful": 4, "cool": 4}, "user_id": "Ry48Bta6spNowOkiMNC_xg", "review_id": "RfvIvM2thijYsBmf9xb3RQ", "text": "Dive in.  Enjoy our Arizona Diversity\n\nHave you ever eaten a Frozfruit bar?  That is a Paleta Michoacana.  Those bars were made in Michoacan Mexico long before they met the Blue Bunny.  Some paletas beat the bunny easily.  Does your neighborhood have a Mexican (legal of course) vendor pushing a freezer chest on wheels?  They are making their $50.00 or less a day selling paletas and other frozen delights.  Coconut, one of the most delicious flavors, will keep your brain from unraveling like mine is.  Eat them early in life and often.  \n\nWhen I was 15, I had one of the most anxious nights of my life. Maria Fraga invited me to her Quinceanera.  A six syllable word I'd never heard or seen before I got the invitation.  The only question I asked was should I dress up?  My best at the time were some black chino pants I'd grown through, three inches above the shoes on my white-socked feet.  I also had a white shirt, also recently miniaturized.  I did have a tie, a one-inch wide bright green iridescent one I really liked because the color reminded me of a green tree snake.  \n\nEquivalent words in English to Quinceanera is Debutante Ball.  Parents save from the day a girl is born, there's a formal coming of age mass, everybody's in a gown or tux, and there's a giant ball at a rented hall.  Being some some flavor of Protestant, I didn't attend the mass.  I was dropped off at the rocking hard ball with the live band.  I was the only white guy.  I did not know how to dance.  My clothes were too small, my tie glowed in the dark and 100 people were dressed To The 9's.  Plus, cool Santos Ortiz was out in the crowd, dancing sua-ve with all the girls.  I did find Gilbert, dressed a little better than me.  We hung out making small talk in a dark corner.  I left within an hour.  \n\nThe night I met Cesar Chavez felt the same.  I was one of four white kids and one adult in a sea of migrant workers, nobody apparently speaking English,  The green chile, frijoles and home made tortillas nothing like the tacos my Queens New York Mom and Kansas City Dad whipped up for all the hungry kids.  \n\nIf cross-cultural situations like the above or even the potential to step into another culture freak you out, I'm here to tell you it's totally survivable.        \n\nLa Michoacana is a great place to dip your toes in the water.  I've seen it walking up and down 16th Street, but never went in.  The outside has a sleek traditional Mexican exterior, the inside is Mexico.  My stop was for water and an investigation.  I found an inviting, artful interior I was not allowed to take pictures in.  Mural copyright or something I suppose.  \n\nFood is served, shave ice is served, plus a variety of raspados, which you should try.  Fresas con Crema, fresh strawberries in cream will shoot your socks to the other end of the room.  The water was excellent, saving me from a dehydrated afternoon on the mean streets of Tempe.  I'm definitely going back.  I'll report more.", "business_id": "9pYBiLe3k5Gi-AJqRklXcQ", "stars": 4, "date": "2013-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kktEYkWTtbxFUhFFFBERxw", "review_id": "rfztivzzqb247TKJvyqD4A", "text": "I love everything they serve at this place EXCEPT FOR ONE THING THEIR CUSTOMER SERVICE. The ladies that work here should atleast have a smile on their face. Other than that the food is good the place is clean and neat.", "business_id": "9pYBiLe3k5Gi-AJqRklXcQ", "stars": 4, "date": "2015-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8RPGS1UoZurHyna57jN46g", "review_id": "HTA_6IHWUWdT4EH-l-U8Xg", "text": "By far the best place I've been too. I tried everything and it's all good best for me is the escamocha crema it's the best.. Flans good too best place in need for a sweet tooth urge ...  Anytime any season.. Lol kinda pricy tho could simmer down a dollar or two ;)", "business_id": "9pYBiLe3k5Gi-AJqRklXcQ", "stars": 3, "date": "2015-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e-GOQDdx_pPSi_dHJ87oKQ", "review_id": "MVVFbzcbZhewldZ-ovJl7Q", "text": "Who doesn't like DQ? And they gave this one a face lift!\n\nNot a lot to say here but I've never had bad service here and the drive thru seems to be always busy so, dozens of ashamed late-night eaters can't be wrong.", "business_id": "zZmhEpiVpRfFQid87-pcOQ", "stars": 4, "date": "2013-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dqmXlUQyDh6d5U2_Zjb-Iw", "review_id": "hv5Nqz_fMewx02KXEj0wpg", "text": "The line was long but did move quickly.  We can cones and then tried the new Apple blizzard and the pumpkin blizzards.  They were both outstanding and reasonably priced . It is too bad that they do not serve both of these choices after december", "business_id": "zZmhEpiVpRfFQid87-pcOQ", "stars": 4, "date": "2014-10-12", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "0aK3o0Vd1LDc3EWX4-PJeg", "review_id": "rcP0BoMc357tFxpImRIg2w", "text": "Buyers beware! I have been to this DQ several times with minimal complaint. It is small and seating is limited but that never really bothered me. Today I brought my daughter and we purchased ice cream and food and the cashier told me the bill total was $8.00 even. I gave him my credit card and he ran it. At first I didn't think he was going to give me a receipt. I guess they just have a slow credit card machine.  He finally handed me the credit card receipt, not the actual receipt the cash register produces and I noticed that the card had been swiped for $10.00. At first I thought maybe there was a fee for using a credit/debit card and next I thought, wow, that's ridiculous. When he delivered the food, I asked him why the bill was $8 and the receipt showed my card had been charged $10 and he said, \"oh\" and walked back the register and instantly popped the drawer open, took out $2 and ripped the receipt off and walked over to me. He showed me the total and said, \"you were right\" and handed me the $2. Umm....ok. So basically, my advice is to watch your receipts very closely, ask for both copies, the credit card and the register one, and maybe even pay with cash cuz last time I checked the 8 and the 10 weren't \"next to each other\" on a keyboard and I am not sure there's a plausible excuse for this accidentally happening. I am thinking that that employee thinks he's running some kind of scam where he skims a couple bucks off every credit card transaction and pockets the extra money at the end of the day and that's some bullsh*t. I will be contacting the store directly tomorrow to voice my concerns with their manager although maybe he or she's in on it too. Might be best to avoid this location unless you're actually wanting give your money away to dishonest people.", "business_id": "zZmhEpiVpRfFQid87-pcOQ", "stars": 1, "date": "2014-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "THYIqfnLV54VZ_v2hCfq2Q", "review_id": "lbZMnVpq_Ki2FVdnHUUKfw", "text": "Only one sentence needed:  Best strawberry shakes.", "business_id": "xAVAqgpZOYYvP4BtfUInsA", "stars": 4, "date": "2012-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cUeFrgBzMhRjOb_6CeGpYg", "review_id": "hrGWSEw8YsVF2XWm-Cr5lQ", "text": "The customer service at this location is ALWAYS on point. There is one guy in particular (must learn name on next visit) who is always so nice and entertaining. They were out of kit kat tonight (first time that's ever happened), but I couldn't even stay mad.", "business_id": "xAVAqgpZOYYvP4BtfUInsA", "stars": 5, "date": "2014-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wAhCtp26dlO7H26AfShefg", "review_id": "_2ARiEmUqCU958zpivdyaQ", "text": "Employees here don't seem to care. I immediately noticed upon walking in that their dining area needed a lot of TLC. There were 2 young kids working at the time. Neither of them seemed to want to help me. I had some questions, none of which either of them knew the answers to. The entire experience was just a mess.  I really would not recommend this location to anyone.", "business_id": "xAVAqgpZOYYvP4BtfUInsA", "stars": 1, "date": "2015-11-08", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "4IxLt4QvCsJEdaNvH9QApw", "review_id": "HjkkvmuvixBgu7oW0_0oKA", "text": "Ummmm.....Mister distributor in Scottsdale! Where the h-e double-l is my rum raisin ice cream?? You have been out for a while now! Lost a star til its back. \n\nI tried the Vanilla Honey Bee. Creamy and somewhat like French Vanilla at first bite. But then, you taste the subtle honey flavor. Its good,  but you should be a big honey fan... otherwise don't get it.\n\nNatalie's F*#! the Recession tip:\nLarge Hot Coffee for only $1", "business_id": "PIu2Rocm6_Vyp2M3v6TKdA", "stars": 4, "date": "2008-09-11", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 4}, "user_id": "zhVOlwBuEgdGlHjwgVf3Jg", "review_id": "o1QAk6wwm4OC67miEQTPNQ", "text": "Try the Dulche De Leche Milkshake. Yummm....\n\nWhen we have lunch at the food court in Scottsdale Fashion Square, I do not get a drink with the lunch, instead I get the gazzilion calorie full Dulche Shake. Yummm...Yumm....\n\nI could go on and on...lolz.", "business_id": "PIu2Rocm6_Vyp2M3v6TKdA", "stars": 5, "date": "2009-10-03", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "BuwjlU6D4kcs1aGo7wSM4Q", "review_id": "7Gzyc4RkVpKLErJbesIB1g", "text": "I've been eating Haagen Dazs at Biltmore Fashion Square since I was teeny. \n\nRum Raisin, to be specific. \n\nYes, even when i was teeny, I was a foodie with some interesting tastebuds.\n\nIt's a little different than it was when I was in highschool (in 198... cough cough) a while back, then my friends and I used to pile into my parent's Valiant and spill out hot and hungry, headed for rum raisin and giggling and gossip outside while we watched the moneyed preppy boys go by. \n\nBut it's still good, I like getting my Haagen Dazs not out of a carton in the grocery store.", "business_id": "PIu2Rocm6_Vyp2M3v6TKdA", "stars": 4, "date": "2012-11-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "KvWny9qUZJKrqo_LYesgSg", "review_id": "zWnmo6tdu4PG9DMrekivUw", "text": "I love Baskin Robbins because, well, heck, it has over 31 flavors!  I don't like to veer off from my \"boring\" Vanilla (as the hubs calls it), but I can't go to BR without getting their cookies and cream on a sugar cone.  There are so many other flavors there that are also quite tasty but I feel like I'm betraying cookies and cream if I try something else.", "business_id": "XTtNevBI5G5x_GjFqSBMpA", "stars": 5, "date": "2013-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "ZUx-B52hGRhmeUDVukmjrg", "review_id": "xPlJvjTfzBCi0sZLLUjL5Q", "text": "So the birthday boy and I went here the other night because he wanted to get his treat of a free scoop. Unfortunately, we learned after driving out of our way to get here that they no longer honor birthday coupons. I understand there is a cost associated with accepting the coupon, but it seems as though it would be a small one for loyal customers. I think the company as a whole should accept a coupon or have a way of notifying people when they search for locations near them.", "business_id": "XTtNevBI5G5x_GjFqSBMpA", "stars": 2, "date": "2013-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2j-b86VI9mP-ymprDdsDTw", "review_id": "1OArX8tkA0T36PpiBxfBfA", "text": "For places like Baskin-Robbins, the product is the product.  So you basically know what you're getting, a whisper back to my childhood when I would beg and plead with my parents to take me there.\n\nNow with my own child I try to do the same but instead of the happy lady behind the counter waiting to help us, we find a group of rude teenage girls with attitude.\n\nWe used to frequent this location more often with my son, but service has plummeted faster than the ice cream melts in the Summer.  On our most recent and probably last visit, we came prepared with a BOGO coupon, and asked the girl employee if we could use it.  To which we received a solid thumbs up, so we ordered 2.  When it came time to pay the girl then told us that we couldn't use the BOGO coupon we had literally just asked her about (but we could totally save it for the next time we came in).\n\nAfter a short period of talking to a wall about the coupon, we decided that we no longer needed the ice cream.\n\nOn our way out, the girl loudly announced to the rest of the patrons that \"These people don't want to pay for their ice cream so who wants free Sundaes?\"  \n\nI would stay away unless you like to be insulted by teenage girls, I thought I ended that in high school!", "business_id": "XTtNevBI5G5x_GjFqSBMpA", "stars": 1, "date": "2015-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WqCQNdWhiGvrZ1EExSNm5Q", "review_id": "lX0M_tdZ1VCBjJik4tBNCQ", "text": "This used to be our favorite store for birthday cakes and I have bought DOZENS of ice cream cakes there. My last customer service experience was horrible. On the day my order was to be delivered I received a call letting me know they did not have the supplies to make our cake! After trying to offer helpful suggestions like \"can you get sugar cones from another store???\" I asked for a manager and was told there was not one available and he doesn't talk to customers anyway. I will never go to this store again. Which is too bad. Some poor entrepreneur  is about to learn a painful lesson about hiring bad management.", "business_id": "XTtNevBI5G5x_GjFqSBMpA", "stars": 1, "date": "2015-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "il0kYsFyY03IoWUNFXujFg", "review_id": "svC20-dxLKgv2mpYu2Fw5A", "text": "I would not even give this store 1 star.  The store is dirty and is often out of most flavors.  Worse than this they pay their employees with checks that bounce. When the teenage employee asked how he will get paid since his check bounced he was told \"try depositing it again later or just call the state\".  This is no way to treat employees. The owner does not care about his employees or customers.  It is such a shame because kids love getting ice cream.  They are in a great location for Arcadia families.  Horrible customer service, dirty counters and floors and just an all around bad business.  I will never come back.", "business_id": "XTtNevBI5G5x_GjFqSBMpA", "stars": 1, "date": "2015-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6Tk5_ZhQlcsPn4e-rpxwKQ", "review_id": "witzh03Yb875RIL6c-eutQ", "text": "Eric McCarthy (shop owner) should be ashamed of himself. Not only does he allow his store to be a dirty, health code violating shack of germs. But he also is running a sweatshop allowing children to work without pay. SHAME ON YOU! Pay your employees and clean that place up. He refuses to pay an employee who worked and told her to file a complaint with the dept of labor. What a joke of a business man.", "business_id": "XTtNevBI5G5x_GjFqSBMpA", "stars": 1, "date": "2015-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3Mm_Kl6cXOPpRJYYpE9_AA", "review_id": "QamwbR_Ik0xLpoAL_PdMBw", "text": "Shame on you for stealing from a child!  I will be sharing the news story with everyone I know so no one ever steps foot in your business again.  How low of a human being are you to not pay an employee, a child, the money she worked hard to earn.  I hope all your employees and past employees rally together and you get what you deserve... A FAILED BUSINESS AND AN EMPTY BANK ACCOUNT.", "business_id": "XTtNevBI5G5x_GjFqSBMpA", "stars": 1, "date": "2015-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SCxVm16g1Tpszmw9BJ207g", "review_id": "R5IOHHjDDusR9W8U6QQtdg", "text": "BOYCOTT this place...Does not pay his employees and their Paychecks Bounce....\n\nhttp://www.azfamily.com/story/30493630/teen-says-she-was-scooped-out-of-pay?autostart=true", "business_id": "XTtNevBI5G5x_GjFqSBMpA", "stars": 1, "date": "2015-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "VrQmX1y_8aDs1qngw9PSRw", "review_id": "GQpaGiSvbqd1LO5_geUnmw", "text": "This POS Eric McCarthy doesn't pay his teenage employees!\nhttp://www.azfamily.com/story/30493630/teen-says-she-was-scooped-out-of-pay?autostart=true", "business_id": "XTtNevBI5G5x_GjFqSBMpA", "stars": 1, "date": "2015-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_PzSNcfrCjeBxSLXRoMmgQ", "review_id": "UlCKwuMXE_RWkFfK_YLmag", "text": "The staff was nice, the blizzards bring back memories, but the place was sticky (tables, and chairs).  Ek.", "business_id": "pkUj-lZb5ZEzLBw87-pOew", "stars": 3, "date": "2014-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bb59_bAbjazWMLJooTI6-Q", "review_id": "to6vpfROWBq9CWFX7RAEKA", "text": "This location is convenient and that is why I gave it 1 star. Honestly every time I go here my order is wrong. I have come to the point where I make them repeat it back to me and they still mess the order up. I've even Gone to the point at the window to ask them if my order is correct they say \"yes of course\" I will get it and check it and it's wrong. I understand it gets busy but that doesn't mean serve your customer whatever the hell you want. I have allergies to foods and if it wasn't for me checking everything I eat DQ may have landed me in the ER more then once.", "business_id": "pkUj-lZb5ZEzLBw87-pOew", "stars": 1, "date": "2014-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yEQ96ibrgRxUaJP_wv5cbw", "review_id": "BM-Dmaripq6YrINe2cO_MA", "text": "If you are having a bad day.. get a blizzard.\nIt is great.. nothing else makes me as happy as this.", "business_id": "pkUj-lZb5ZEzLBw87-pOew", "stars": 4, "date": "2014-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NEM5_z4ImMeaa24zmOwBrw", "review_id": "1OIznMkpprGBaq2GiKC3ng", "text": "I really wish i could give this a better review but they closed 20 minutes before they were supposesd to and on top of it everyone was extremely rude. Never again, save your money and go get yogurt or something wouldnt be surprised if they went out of business and became replaced with a yogurt shop.", "business_id": "pkUj-lZb5ZEzLBw87-pOew", "stars": 1, "date": "2015-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DsBEs0NBTgIUEtIClLwdBA", "review_id": "3IAZY4DMRbGGERGpbhrb0g", "text": "Getting charged for ranch when it comes with your meal is ridiculous. Who orders chicken strip dry? Also the people there are rude.", "business_id": "EUfVkqNFv5Ay0W7nbaivJA", "stars": 2, "date": "2013-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IBHIB59epUFRXPOhwN_LqA", "review_id": "b2b6cN3cpSDvNsL7RElKzQ", "text": "I will pick soft serve over hard ice cream any day so I really like Dairy Queen. I usually go for a vanilla cone....sometimes with sprinkles...or if I am really treating myself I get the pecan mudslide. I don't see it on the menu anymore but the people here are always happy to make it. I am not impressed with the interior of this place so I always use the drive thru so I don't have to think about it. Sometimes you order, pay, and pick up from the same window, sometimes they send you around the building to pick up. You never know what they are going to want and that can be frustrating as it changes every time. The staff is not overwhelmingly friendly but I have never had them be rude. They tend to keep their heads down and quietly work.", "business_id": "EUfVkqNFv5Ay0W7nbaivJA", "stars": 3, "date": "2015-09-09", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "k6ZQA3DJ2EfZJMmadBlWNw", "review_id": "vhaQ6_P14IVGJPEyhFeS6A", "text": "Dilly bar. Say it with me. Dilly bar.", "business_id": "vB3vEjcw9dfHmgP8ac5ZMQ", "stars": 4, "date": "2011-09-06", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 1}, "user_id": "joIzw_aUiNvBTuGoytrH7g", "review_id": "J8t5pc9rASN_ZV_bC3g5Cg", "text": "Surly old lady working the counter on my day and believe me, I caught the vibe quite clearly and won't be back.  Ice cream didn't taste quite right, and the Blizzard ingredients seemed stale and unchewable.  Yuck.  Tummy gurgles for an hour after consumption.  Not good.", "business_id": "vB3vEjcw9dfHmgP8ac5ZMQ", "stars": 1, "date": "2011-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GoymUzKqvET2QOZkIWZi9w", "review_id": "3W3F2AEfYJv2qrEEG1mRTw", "text": "Been through the drive-through a few times. Never any errors and they're always friendly!", "business_id": "vB3vEjcw9dfHmgP8ac5ZMQ", "stars": 5, "date": "2013-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "myLlIKARGcfV9rU2IwOeqw", "review_id": "7pZujfTqP8hv5XsWrzxRZg", "text": "Dairy Queen!!  We go through the drive thru mainly at this location. \n\nThe soft serve is fabulous, I love it dipped in chocolate!  The blizzards always have a lot of toppings- no skimping at this location.  The hunny and I like the Reese peanut butter cup blizzard or the Oreo blizzard.  One time we accidentally got the wrong order and tried the fudge brownie cheesecake blizzard with extra fudge on the side and we thought it was a little too rich.  We still ate the whole thing, as usual of course!", "business_id": "vB3vEjcw9dfHmgP8ac5ZMQ", "stars": 4, "date": "2013-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5pJoh4JxYX9DTl9SMFRS1A", "review_id": "5ZkYC7j7kmE_sEGk3W7-CA", "text": "When I need a sweet treat I go through this drive thru for a blizzard. I hate to admit it but I've tried multiple varieties of blizzard flavors, and every time I leave satisfied.", "business_id": "vB3vEjcw9dfHmgP8ac5ZMQ", "stars": 5, "date": "2014-09-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "vN25DTdMDr718zMCAgJvQQ", "review_id": "GdryTePMbZSMStga9L56qA", "text": "Yes, I want to go into Coldstone every time I pass it. And yes, I am always very happy with anything I order. The cheesecake ice-cream with graham cracker crust and caramel. To-freaking-die-for.\n\nBUT\n\nI must say, I always feel cheated when I leave the store paying more than it costs to get 4 gallons of ice-cream....for just 3 \"like it\" cups of ice-cream. Yeah, that part...do NOT \"like it\". I guess having an 8-year old whose begging and pleading often leads to my purchase of this over-priced dessert doesn't help, but I resent Coldstone for exploiting our taste buds' desire for something cold in the middle of the desert. \n\nI miss Mr. Softee, where a cone brimming with soft-serve ice-cream (WITH sprinkles) was a mere $1.25. \n\nSo for the ridiculous prices, I took away 2 stars. I still love their ice-cream though (dammit).", "business_id": "8WPCqC0Y-yszJi7eqfSllA", "stars": 3, "date": "2010-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "ky9pQ8AKufvZ63IxR41jGg", "review_id": "ilNB39wgqENEpkAyJpYhng", "text": "Nothing much to be said about this establishment that you don't already know or that you have read about or that you have experienced. However with that being said let me just say if you have not had the banana ice cream with real fresh bananas, Carmel sauce, and nuts mixed in....placed in a warm waffle cone.....then you have not truly tried a Cold stone treat to savor for all time people....wohoooo!!!! Try it...Try it...Try it...trust me you won't be disappointed. Eat, Drink, and be Merry my Friends!!!!!", "business_id": "8WPCqC0Y-yszJi7eqfSllA", "stars": 4, "date": "2010-10-15", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Oo1dbXAuTW8PlV-HX4MPvQ", "review_id": "HfcZrbxfmTIwM_qlsEbI0Q", "text": "The staff argues with the customer about bad tasting ice cream. When I asked for a replacement it was an argument an all I wanted was it switched out. I wasn't trying to get anything free.", "business_id": "8WPCqC0Y-yszJi7eqfSllA", "stars": 1, "date": "2014-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "hn_DclKLzdxABRGGAuqKgg", "review_id": "HPrQojokCp3lGF6Y5h6rTA", "text": "Small, clean shop with very nice staff. I grew up on Baskin-Robbins; I feel like a little kid whenever I get a scoop of their ice cream (especially chocolate chip). If I'm in the area again I'll definitely stop in.", "business_id": "qeqrsjWXc15KmlK5Z8580Q", "stars": 5, "date": "2013-09-15", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "qb3lltSzKhTSL2jbc9HqyQ", "review_id": "GDOUCmjt1KMbvH2Bd_1Ugg", "text": "Best place to get ice cream cakes. This location has a much better variety in both size and flavors than many of the other Baskin Robbins locations. The owner is typically in the store and always very nice and accommodating.", "business_id": "qeqrsjWXc15KmlK5Z8580Q", "stars": 4, "date": "2013-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DwU7KVfebA70AlVtX0iOWw", "review_id": "o06Mw2_B6UP2OdnolK74wQ", "text": "5 Stars for what it is...Dairy Queen! Who doesn't like a Blizzard? Fast and Yummy. In and out with a Blizzard Meal Deal. I was spoon fed a Hawaiian Blizzard on the drive home...it doesn't get much better than that.", "business_id": "fRtuc2k17r6aZMJWEMcXFQ", "stars": 5, "date": "2010-11-18", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "T7J9ae0wTskrI_Bgwp-4cA", "review_id": "Nc3Nydld13ygJNAcO_bU-A", "text": "I was craving Dairy Queen for quite awhile.  When I finally went I was wondering what I wanted it so badly for?  I ordered a grape freeze.  The icey slush mixed with soft serve vanilla.  It was was so mediocre.  I felt like I was wasting calories for the day.  If I want a treat I can think of such better/higher quality treats and ice cream.", "business_id": "fRtuc2k17r6aZMJWEMcXFQ", "stars": 2, "date": "2011-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NB0XRk-gkRzFtV0BNgS7oA", "review_id": "dsuP5NMCsA_57pdMIueEWQ", "text": "I went here for dinner tonight after work since I was starving and haven't gone grocery shopping in God knows how long. First off it was really clean and everyone was friendly and service was fast.\n\nI ordered a chicken strip basket with gravy which was yummy. The fries kinda sucked but they always have been kinda blah here. I also ordered a large hot fudge sundae with extra hot fudge which was way over priced and not worth it. The hot fudge was sort of gummy and gross. Okay it was super gummy and gross. Not sure what was up with that, the sundaes at Sonic are half the price and a million times better.\n\nI'll definitely be back for the chicken strips, not so much for the ice cream.", "business_id": "fRtuc2k17r6aZMJWEMcXFQ", "stars": 3, "date": "2012-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BEe04ziifpSkBdKsCSAUXA", "review_id": "Z4sVSlcrAE-l-NMqdBcxHw", "text": "Excellent service as always. Best swirl cones in town.", "business_id": "fRtuc2k17r6aZMJWEMcXFQ", "stars": 4, "date": "2012-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Vyl4rcnSJ3ZjUwu7G4VK4g", "review_id": "pK1cCMjyiRQ-pXrarl_w6w", "text": "Sometimes I really wish I could give a negative star rating.. Maybe I just have bad luck? But every time I order through the drive thru, the 16 year old brat with dark hair happens to take my form of payment. She's a prissy little brat if you ask for a to go bag after she's put all her hard work into demonstrating your blizzard by dumping it upside down to ensure its quality. \nNews flash, kid. Learn some manners and customer service skills. \n\nNeedless to say I will be calling her management. I am so tired of being treated poorly by these kids working at every fast food joint on every corner in town. \n\nYou can't enjoy quality food/ice cream unless the customer service staff can treat you properly.", "business_id": "fRtuc2k17r6aZMJWEMcXFQ", "stars": 1, "date": "2015-11-01", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "hORy0O17fXiPM5g_ouY3-A", "review_id": "XnntfwMtnODo-ZP_ukdJXw", "text": "This place has Thrifty Ice Cream. Pistachio ice cream is the truth!! The water tastes great here and I couldn't ask for more. yay! There is a .35 charge on your card if your total purchase is less than five dollars. FYI", "business_id": "OeMFOkAqCjKmVLPSsUDB-w", "stars": 4, "date": "2013-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4TKLNJc88B-EttxI5LktIQ", "review_id": "OrHnM1pbiBxL1PLGTgMefw", "text": "It would just be an average candy store deserving of a two-star rating if it were not for the shaved ice. Try the vanilla, it is really good!", "business_id": "w8SrdJXeqTR4PZHieJ7DXA", "stars": 4, "date": "2012-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MvAivCygiO8Q_tzDbyR_cA", "review_id": "Vsp1MtVbczQ-1Sx-JCs66Q", "text": "Great service! owner/operator. The place is always open. Great prices and good verity if you like candy, ice cream and shave ice. Who doesn't ? This place is the kind of store memories are made in. It's been there for 20 years and generation have enjoy their good and simple treats  they serve.", "business_id": "w8SrdJXeqTR4PZHieJ7DXA", "stars": 5, "date": "2014-11-08", "type": "review"}
{"votes": {"funny": 2, "useful": 6, "cool": 5}, "user_id": "k4-6lakq7t3kCgbvPxcuvg", "review_id": "AkJKb-7QYcfnCcs76_Dw1A", "text": "I don't know why, but when I get a migraine (sadly, that's sorta often) ice cream helps dull the pain.  I'm really not a huge ice cream fan, but like I said when my head is pounding, ice cream is a great non-narcotic pain releiver.  \n\nSo I had a migraine this particular day and I came in to get a scoop of Daquri Ice and the young man behind the counter was just so friendly and helpful.  He really was awesome.  While I was there I decided to pick up a couple of pints for my freezer for later, and I am glad I did since I definitely needed them!", "business_id": "rHY8KUStCMQMSZCC2KRMfQ", "stars": 4, "date": "2013-10-22", "type": "review"}
{"votes": {"funny": 5, "useful": 5, "cool": 5}, "user_id": "kffxYQVQsEpF1DVlQlcGCg", "review_id": "EDIhEegxgXva7jWoJzL1FA", "text": "I had not been to a Baskin Robbins in a very long time. But, we came here one day just because of that.\n31 flavors,it always reminds me of Ferris B.\nIt is clean in here which is a plus. The girls here are working hard. \nOn this visit we both got the sundays. \nTwo scoops of Ice Cream with Hot fudge and nuts. We both declined the whpped cream.  Chocolate with Peanut Butter for T, for me bubble gum with Rocky Road.\nThey were great!   After that, I signed up for the Birthday club. \nJust get on line and sign up. They will send you a coupon for your big day for a free Ice Cream cone! Yes!!\nAlso a great place to get an Ice Cream Cake, a little something different.", "business_id": "rHY8KUStCMQMSZCC2KRMfQ", "stars": 4, "date": "2013-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eHowibQMqmWR9xAN1ZgRTg", "review_id": "JBku4AleEx8PG31dGPlgKA", "text": "best root beer float ever!..this place is in the process of a remodel and i love the new modern look.  they have also done a few cakes and pies for me which were always a hit with my family.", "business_id": "rHY8KUStCMQMSZCC2KRMfQ", "stars": 5, "date": "2014-09-19", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "q5nFaw9isjD_01PpVAR7hg", "review_id": "JuaBK5suFLE4nTe4ZT0ArA", "text": "I'd like to give this place five stars, just to drive my favorite Floridian more bananas than he already is, but alas, I cannot.  It's very good and worth the 20 minute drive, but the service can be uneven and sometimes the custard is a little too melted.  That being said, did I mention that I'll drive 20 minutes to go here and that I pass two Dairy Queens, one Baskin Robbins, and more of those tart yogurt places than I can count?  So yes, it is creamy and delicious and very far from Florida.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 4, "date": "2008-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 3}, "user_id": "RknsoxpICgtuuv46uaTpyw", "review_id": "3rQsh_zQ_OIOFjTm_n8wQQ", "text": "When I'm in the mood for a creamy desert I will always go to Nielsen's. I prefer the baseline/power location but this one is bigger. I do miss the Iceberg that use to be in this location. I like the choices of mix-ins for the custard. I always get Captin Crunch and Maraschino Cherries. Sadly I do not visit this place much anymore cause of my addiction to tart frozen yogurt, but when I get the creamy craving I go to Nielsens.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 4, "date": "2008-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "--rlgfAvvi0BtfRDA1p-VQ", "review_id": "L-n-mCza362pOBWzsgcOvw", "text": "One of a kind around here. Legit. Classic.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 5, "date": "2011-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-TGhL3bdyu6QHAYx31Da6w", "review_id": "Kkj4FZrA6ZDWQxP_Qbs2Jw", "text": "Terrible service and the custard was very runny. We got a concrete with Reese's peanut cup. You could hardly see any Reese's peanut cup. Instead of fixing the concrete they gave us a tiny bowl of candy and told us to mix it ourselves. Oh and let's not forget the concrete is in a cheap \"red solo cup\" from costco.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 1, "date": "2014-10-06", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "13rHSaBk8YK1aAzc6z3cIg", "review_id": "9LHnIqI2_IbOMGonRRgu8g", "text": "The custard was milky and there was hardly any mixing. It feels like they are looking to cut costs in so many ways and it has caused a bad experience. We paid $5.00 for a custard and it comes in a Costco cup with poor customer service. \n\nThey even have a combo lock on the bathroom door. If you need to use it then they walk you to the bathroom and put in the code to open the door. The only places I see doing that are gas stations in the ghetto.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 1, "date": "2014-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ah9jZHtJ4Udmeb0r_0GdFw", "review_id": "JMkc2UEmuLRDfPommBkrjA", "text": "Good Sundaey and  hi ge e. Clean and bright.  Slow on the burger.  The help doubt know  the food", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 3, "date": "2014-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_8S5mKeUqldA_Al8LN3lpQ", "review_id": "ZCBYa4SO2abxpjwv5XN87Q", "text": "I asked for a concrete, but got something more like soft serve. So disappointing.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 1, "date": "2014-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rjYqBXMeTVwcIFlkUG1EdA", "review_id": "BldBw-M10OyCLOAWxi9WWA", "text": "Used to be an amazing family establishment. But had gone down hill. Everything we ordered was already melting and milky when they came out. The concretes hardly had any mix ins where we had to ask for more.  Their AC wasn't even on and it was hotter inside than outside at 104 deg. When asked the cashier why it was so hot she said it was because of all the windows. Just overall horrible experience and will never go back!!", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 1, "date": "2015-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6tfkU-GYb8kIMVlyjBoVcQ", "review_id": "I6qdEZrl7nQo1r1WrrBEBg", "text": "Went in at lunch time and it was completely empty. Everything was way overpriced and not a very good selection. We just got concretes, which only come in one size and are crazy expensive. It was okay, but not worth the cost at all, and there was way too much to finish, so a real waste. I won't go back.\n\nThey must use evaporation cooling, because it felt like a swamp inside. It was a hot day and we were expecting to sit in a cool place and have some good frozen custard. Instead it was hot, sticky and overall a really unpleasant experience.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 2, "date": "2015-09-15", "type": "review"}
{"votes": {"funny": 4, "useful": 1, "cool": 1}, "user_id": "wNTZMYPQRZAx645BuhdTyQ", "review_id": "WUDLpRvlJDgppZYK1fISIw", "text": "Here's the secret formula:\n\n- Vanilla ice cream\n- strawberries\n- almonds\n\n------------- mix, fold ---------------\n\n- hot fudge on top after it's mixed\n\nAND......\n\ntell them Randy sent you!\n\nWARNING:  THE CHOCOLATE DIPPED CONE IS OVER THE TOP AND TOO MUCH FOR THIS FORMULA----YOU WILL IMMEDIATELY SUFFER FROM HORRENDOUS GUILT AND TOOTH DECAY IF YOU DARE USE ONE!!!\n\nJust get it in a regular cup and don't be such a pig.", "business_id": "IgMFOK_SOND-4b_DpvFCSQ", "stars": 4, "date": "2009-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fPehGlmrNXtgd9Yc40TMeQ", "review_id": "iFvflSLFdCQu9_bGxv8sGA", "text": "I would consider myself an icecream/yogurt condiseuer.\nnow.... this place i have been going to since i was a little peewee! \nThe store actually used to be located on McKellips and Gilbert road and then moved to where it is now.\nAnyway... this is a local family owned FANTASTIC yogurt shop that has evolved and adapted (to competition) to a yogurt, smoothie, hangout type place. The staff is soo nice and really care for their customers. Always smiling and taking time to ask \"how your day was\", etc. \nNow lets talk about the yogurt.... SOOO PERFECT!!!\nthey offer various flavors every day. they do have a calendar they hand out so you can put on your fridge. \nThey make great yogurt pies too!!!\nAnd the best part of all this is that it is very cheap compared to the chain yogurt/icecream shops!!!!\nIf you live around this area (mesa high school) you definately need to take a yogurt break... makes for a great date or dessert stop after dinner because they have plenty of sitting area in and outside and they have a PACMAN game that you can play while enjoying your delightful treat.\n\nThe absolute best place for yogurt!!!!", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 5, "date": "2009-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3_eIloSMHvjnfdFXd8C54Q", "review_id": "tynlvQda-WvJbjOPLCKtCA", "text": "Good yogurt and resonably priced.  Give it a try.", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 4, "date": "2010-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zs_esz_pkKzAktONS9SLQg", "review_id": "dPPUdOEv9UZHLw4bkVpxAw", "text": "I was just treated terribly by the owner of Mesa Frozen Yogurt today! I ordered the flavor of the day which was chocolate and vanilla. The owner started to make it and I realized that in small letters it said that the chocolate was \"sugar free\". I told her immediately that I didn't want it because I'm allergic to artificial sugar substitutes. She just kept making it and said that I would be fine. I again said that I couldn't eat it because of the allergy to sugar substitutes. She argued with me that they didn't use sugar substitutes in their \"sugar free\" chocolate frozen yogurt. I asked her what they used. She said it was something made out of fruit. I again told her I couldn't eat it. Well, she insisted that I pay for it anyway even if I wasn't going to be able to eat it. I paid for it, left the place and threw it away! I still can't believe that the owner would want a customer to pay for something they couldn't eat and leave unhappy. All she had to do was stop making it when she first started and I said that I couldn't eat sugar free. The amount wasted would have been comparable to maybe 2 samples. I would have been happy to buy another flavor that didn't contain artificial sugar substitutes in it. She was very rude, insistent and unapologetic. She could care less that I wasn't going to eat it. She just wanted her money!! I have never been treated this way before, especially by the owner of an establishment. Owners usually care more than anyone that their customers leave happy!! Unfortunately she will loose my business and anyone else that I have the opportunity to share my story with.", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 1, "date": "2013-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mtSO5-tA73mpTEMDKnftcw", "review_id": "0w5bxuYpmWAwIfyugXBMsA", "text": "Great fro yo and the people who own it are great!", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 5, "date": "2013-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "sfxxPibl_7gjwVaiEjxR_A", "review_id": "HLaODnJKnPTHxqiZrbS9KA", "text": "This place is uncomplicated frozen yogurt.  They don't have a million flavors or a million toppings, but they have a nice selection of each.  And their prices can't be beat!  So if you are looking for some cheap, tasty frozen yogurt, definitely check this place out.", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 4, "date": "2014-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "czmoFr39k8ITZRHD3WyR4g", "review_id": "7mHSz3W_EpIZ7EW1RImHjw", "text": "My hubby and I used to come here all the time when we were dating.  I just took our daughter and him back and nothing has changed. They are awesome. Go on Thursdays because marshmallow is my favorite, you should like their Facebook page to find out daily flavored. They also have great prices!!", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 5, "date": "2015-09-30", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "hh9pDUbN4fL9ovLVNR2bGw", "review_id": "4tf9PUrT3Hv7nwDpEUQk-w", "text": "I remove my review because I was compensated with a couple freebies.  I will return to ColdStone and give them another try.  How can anyone ruin ice cream?  Well they did it once, lets hope they don't do it again.", "business_id": "HEAAXwMrHkxEdRwdtqsogg", "stars": 1, "date": "2011-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uFXrezdNbph5QbmvYVmhEA", "review_id": "r7z6zxgjS1_F-SgsgxI7vA", "text": "Love this place!! They let you bring your dog in and will even give your dog a free sample bowl! the ice cream is always so good and the staff is really nice.", "business_id": "HEAAXwMrHkxEdRwdtqsogg", "stars": 5, "date": "2012-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3F6vID0ibmjbXUWzQgGaAw", "review_id": "TpkJH-F6b8tS3vANC92YrA", "text": "This by far is the best cold stone I have been to.  Great service, fun atmosphere, easy parking, and clean store!!", "business_id": "HEAAXwMrHkxEdRwdtqsogg", "stars": 5, "date": "2013-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Syc4pbEkL3bbzjO4X4HhQw", "review_id": "uL6inFpNIKfqswPlhF84_g", "text": "Sure beats those pay by the weight yogurt places that are so popular right now.", "business_id": "_3xR-RAnabwTj4Drsdfjgg", "stars": 4, "date": "2011-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "R4Ax3btoJ6qLXhqq6J50VQ", "review_id": "okC3B9DA4ugdt1kU21kBQg", "text": "Who doesn't love ice cream?  Nothing special about Baskin-Robbins except the workers are very nice at this location.  Always a good place to stop by after getting gas", "business_id": "_3xR-RAnabwTj4Drsdfjgg", "stars": 4, "date": "2013-10-30", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "7Wr91hSKfgkKnkyhLOlwww", "review_id": "GaeExsMJLn4oxSDqKosu-Q", "text": "The chocolate covered strawberry bowl was very good. However when you ask what is in the different blizzards, no one seems to know and they have to go get a list. They did find out for me however and were pleasant about it. Always very good, prices similar to other places.", "business_id": "5C4gtiP5qkBKFF3og7Wt3g", "stars": 4, "date": "2012-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bsLVi4yPj1G0XBp-P2fRaw", "review_id": "yA4mWRNjfXSSOJxWFbn-vA", "text": "I love Dairy Queen and especially their chicken strips and fries. I get this almost every time I come, and am never disappointed. My one complaint is that every time I do, regardless of I just waited behind other customers in the drive thru, I am asked to drive to the front and wait for my food. Tonight I sat for a good 10 minutes and when I pulled up, I paid and immediately asked to pull to the front. The good thing is I know my food is fresh, but what bothers me is in that 10 minutes I waited behind two customers, my order hadn't even been started? I waited in the parking lot an additional 11 minutes before someone brought me my one order of chicken strips. Hopefully they improve this.", "business_id": "5C4gtiP5qkBKFF3og7Wt3g", "stars": 3, "date": "2014-10-01", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "C1rHp3dmepNea7XiouwB6Q", "review_id": "PERorZLFodakm-LLhWW3Kg", "text": "It's your standard Dairy Queen. Delicious crappy for you food we all grew up on. Remember getting sundaes in little baseball helmets?", "business_id": "kqFQLV63mAYCsY1LSB2OZw", "stars": 5, "date": "2011-10-21", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 4}, "user_id": "XOe-I25-W_FnbYfQyafylw", "review_id": "B-uD_flB8xIbve2EM-5n0g", "text": "Did you know they have Happy Hour?\nQuick stop for a cool treat!\n\nOn weekdays from 2pm-4pm, they have happy hour on a few of their refreshing drinks! So cool!! 1/2 OFF!! Moolatte, Arctic Rush, Shakes, and Malts!! Woot woot!! It's essential in this heat!! :)", "business_id": "cG1pHlWhdSc2M9ChWZo-dg", "stars": 4, "date": "2009-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ngqEHNd1cJZVBl0nhR0Khg", "review_id": "WTYbQ8SO2z1zoR67cKlRrA", "text": "This place needs a major renovation, and the wait staff aren't geared toward customer service. If they don't do your order right, they refuse to make it right. Skip this place. Next time, stop at the DQ near I-10 and Florence.", "business_id": "cG1pHlWhdSc2M9ChWZo-dg", "stars": 1, "date": "2010-10-23", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 4}, "user_id": "ZmIgP4U4Ht9CYmNX0_zP6w", "review_id": "l76vtqucV5lkmCwNG392Kg", "text": "I have to agree with Lisa K.  This Dairy Queen is excellent.  I had a coupon for a free Blizzard and this is the closest one to my home so off we went.  This one is located in the strip mall where Phoenix Palace Buffet is on Dobson.  It's kind of tucked away next to a Yoga studio in the corner.\n\nWe were warmly greeted the minute we walked in and served quickly.  My daughter told the woman that her birthday was coming up and she instantly put her on a list for a free birthday blizzard.  Nice!  We all know Blizzards are full of fat and sugar but the darn things are so good, who can resist!!  I tried the Pumpkin Pie Blizzard and it was delish!!  I love all things pumpkin though so if that's not your thing, my daughter had the cookie dough and she gave it two thumbs up!!  She said there were big chunks of cookie dough in it and that was a-ok in her book!\n\nIt's nice when you get great service at a little fast food joint.  Usually that's not the case.  Kudos to this one for being different in a good way!", "business_id": "j5tNIkM_UbyaiAGPqqLJcQ", "stars": 5, "date": "2010-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YOZ6xwXXpxD0vxJiA6WC-A", "review_id": "QGEMuRs_yYpXXeCfE903qg", "text": "I can't rate this place because it's not there. they moved, miles down the road to a different location, who knows how long ago.  yelp won't let me give zero stars for a non-existent place", "business_id": "KgYvd2BlQIGUw4Aj5qKevQ", "stars": 1, "date": "2011-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z0_C4HRVvkLkyEsVGGMnkg", "review_id": "y-FtJ6K8D0CL6DqhidZ5Xw", "text": "Near Harkins.   A good stop after a movie.  Very small.  Two tables outside.  Inside standing room only.", "business_id": "KgYvd2BlQIGUw4Aj5qKevQ", "stars": 4, "date": "2012-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e7-by8PfbVOVPberJLVB9Q", "review_id": "ar2nMxe_d846znXVr2CWTQ", "text": "We ordered a cake, we picked it up got it home and cut into it.  It was a white cake with white ice cream. Nothing else in it, not what we ordered.  I called the store and was told thr Manager was at Queen Creek and Alma School store,  he wasn't I left my info and my issue.  I called back to this store lrft my info and issue. Never received a call back.", "business_id": "KgYvd2BlQIGUw4Aj5qKevQ", "stars": 1, "date": "2014-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "_JJgknodFeeqOW2e9a3kKw", "review_id": "Ny0wKyLYvG2a25YPJHY31A", "text": "Great ice cream!  However the place is very small and under staffed.  While we were there, we saw three different groups of people leave because the place was too crowed and the wait was too long.", "business_id": "KgYvd2BlQIGUw4Aj5qKevQ", "stars": 3, "date": "2015-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "U2A40xQIJJVYPf0zsHRTog", "review_id": "xT1iYZLWGWaVzuw19E9SPQ", "text": "It was so hot in the shop that the ice cream was melting, the funny thing was that it was a lot cooler outside. So my complaint isn't with the workers but the management actually. Get the AC fixed the poor workers were working hard and sweating there ass off.", "business_id": "KgYvd2BlQIGUw4Aj5qKevQ", "stars": 3, "date": "2015-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LxMeEhcumXs0h2WdH7VS0Q", "review_id": "Qgo21hZCi9Y3Fj8Mz6yG5A", "text": "Delicious!! Love this place. Get the 5 buck lunch. Burger, fries, and ice cream with soda. Disapointed that they removed grill burger. But, at least I can upgrade it for a dollar more.", "business_id": "waNp5VTwK1ZRF3XkOwSaSw", "stars": 5, "date": "2014-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hgzGlvQ7-KYp5Fjdt7xdNQ", "review_id": "jGyH5U7wu8GPoCHIK27xnw", "text": "Dont bother going through this drive thru. I went through a bit before 9 tonight and asked for a banana split with no pineapple and extra chocolate. Molly at the window clarified my order. Even with all of the clarification, when I got home and dug into my treat I found ice cream, banana, loads of pineapple and a tiny drizzle of chocolate. When I called, Molly apologized and said that she would put me on a list for a free split the next time I come in. First, it's not free. I have already paid for it, and I have spent time and gas in order to obtain the faulty product. Second, why would I want to come back, after the prank that somebody pulled tonight?", "business_id": "waNp5VTwK1ZRF3XkOwSaSw", "stars": 1, "date": "2015-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lAV4kZLB6RWd8GOWaQ3mgg", "review_id": "F-rwi-KPziAvSf-5oTmvaQ", "text": "Ok. Health Scale goes out the window. We're Talking about dessert!  Custard is so much yummier than ice cream. If you've never had it it's time for a new experience. I love custard!", "business_id": "RgXWA8zXD83KnckFfWOqJw", "stars": 5, "date": "2011-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pQ6ij6cOBRB3yJGHbVZHUQ", "review_id": "i7oXo1e_17n1prFolVQ7tg", "text": "Went here to try them out after Sai Wan Bistro. Walked in to the store and there was no one in the store. No customers, no staff to be seen anywhere? Waited a couple of minutes and walked out. I'll bet the owner wonders why his business is in the toilet. As we left, we drove behind the building and the \"staff\" was outside smoking and texting. To the Owner: Please notify the bankruptcy court of you soon to be filed application.", "business_id": "RgXWA8zXD83KnckFfWOqJw", "stars": 1, "date": "2012-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vG4gHg0xkzcg7MVCwmokFA", "review_id": "zUcbc9dSpFVskddaZLVoCg", "text": "Seriously good ice cream!! Mint mint chocolate chip!!! I really thought the young folks behind the counter were outgoing and seemed to enjoy their jobs. That always makes me happy to see, as I feel I am supporting a good employer!", "business_id": "EJzoRTV3IUSxpnxRAzngDw", "stars": 5, "date": "2013-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hAqARW_pYpHuzAMFjdkEGQ", "review_id": "iAbAZgI_xOMrUL9lo75iFQ", "text": "My husband and I were in this area and decided to you use my Birthday coupon buy one get one free.  But, it was not honored and the coupon had not been expired!  Why bother printing and presenting when no one pays attention or acknowledges that it was your birthday  What is the point???   So disappointed!!!", "business_id": "EJzoRTV3IUSxpnxRAzngDw", "stars": 1, "date": "2015-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Bw3lg82T4awjUQoLUZEf-A", "review_id": "hAwWE3yu3TpsukTUMJUh9A", "text": "Great little store. Their thrifty brand ice was delicious.  Reminds me of the ice cream I used to have back in Cali, when Rite Aid used to be Thrifty.", "business_id": "yna3dHG51ukNanJRee2eEA", "stars": 5, "date": "2013-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nz-mzO8NEFXEEZY8gGZ1pA", "review_id": "KKKstgM6pudHlIWyzMl39A", "text": "It reminds me of a mom-n-pop store where you can buy ice cream cheap, sno cones, chips, and candy.  They even have smoothies now.  You can buy water cards for convenience at the same price or cheaper when you buy more on the card.  I paid between $75 - $90 for my card, the service is still fantastic before and after I bought it.  The interaction is way better than most places. $$$", "business_id": "yna3dHG51ukNanJRee2eEA", "stars": 3, "date": "2013-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ewnwxqKtpDv8erOIZkCpjA", "review_id": "7Lq_8jp1vXsQZWqdCwxMdg", "text": "Solid DQ. Had a delicious blizzard served by a pleasant counter person. No reason not to enjoy a little soft serve deliciousness here!", "business_id": "fJfh5j2f9AhivqGelAThsg", "stars": 3, "date": "2013-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RQwoK2qW4FWCOTUltzOiig", "review_id": "xQSp7oRkKdDcKGX9pYiq0A", "text": "pulled up at 930 to watch the businesses lights go off, they closed. the yelp page for this DQ says they're open to 10pm weekdays. very unsatisfied with the incorrect information.", "business_id": "fJfh5j2f9AhivqGelAThsg", "stars": 1, "date": "2015-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "MtRXS7QFQTnOFeTpD5MY3g", "review_id": "tFaP1ubLWJ0TLI1_w9jhcQ", "text": "I wish I could give this no stars. This is a fast food place, everyone knows that. The food is expected to be low quality. But the service should at least be decent. Every time I have been here in the past two years the service has been humorous. When I'm given an attitude as though I am disturbing the teens inside who are at work, none the less, I am turned off. It's been hard to not drive threw and order just to throw it on their windows. All I'm asking for is some common courtesy and manners. Without customers YOU wouldn't have a job. I now drive to the mall nearby when I'm wanting a quick dairy queen fix. Which means no drive through and five extra miles. At least the service is a bit better.", "business_id": "FBNxmgHqP9ksk-56XLJ1eg", "stars": 1, "date": "2014-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AqucywuIrJ3be8L155rsqw", "review_id": "nXy28abBum0Othj8Mr9Lyg", "text": "Got a medium hot fudge Sunday, I would've been better off going to McDonald's. Not much hot fudge and they charged extra for the nuts and whip cream. I would have $3 in my pocket.", "business_id": "FBNxmgHqP9ksk-56XLJ1eg", "stars": 2, "date": "2015-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SHcX9hp5RG3-OqsbvissIQ", "review_id": "W85eHRoNLnj8yxRSiGmOUQ", "text": "One of the better fast food burger options.  They're not dry and bland like most of the major chains, and they have a lot of interesting options.  I'm partial to the Flamethrower burger which is lightly spicy and covered with a tasty creamy sauce.\n\nService at this location is always fast and friendly.", "business_id": "FBNxmgHqP9ksk-56XLJ1eg", "stars": 4, "date": "2015-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "9CnkqXgz8JzBfcpOErFGvA", "review_id": "KHt__qqXQkbpznTKRmyQnQ", "text": "This is the only place I can find my favorite ice cream. I've been coming here for years and I've never once had a problem with this place. I've cream really brings out the kid in us so I would recommend the clown cone, it's really cute and everybody loves it.", "business_id": "1ctVj76TXrHpqX3px49n6A", "stars": 5, "date": "2012-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OsWkjaHbcPXKFuMmr2HolQ", "review_id": "lwu1MvNJ3HnrhAOpja40_g", "text": "I've lived near this Baskin Robbins for years and seen it through the change in ownership. I go to Baskin Robbins because their Mint Chocolate Chip is my favorite flavor. I don't have much of a sweet tooth so every once in a while when I do want ice cream I try going to this location. I have gone 4 times in the last 6 months and of those 4 not one time did they have Mint Chocolate Chip. It's disappointing, it's not that hard to keep an inventory and keep something in stock. I would be understanding if it happened once but 4 times means there is a something wrong. Won't be going back to this location.", "business_id": "1ctVj76TXrHpqX3px49n6A", "stars": 1, "date": "2015-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RvZks2VBHdym25_d6I8YGw", "review_id": "DfoQsFVm4-0zdxlUinYkzQ", "text": "Bit pricey, but it's always been our favorite place to go for treats....", "business_id": "v8w1vCDYh6BhXQFzFMUsWg", "stars": 4, "date": "2011-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6w6DP3aBoGIY0FO7RYAi4A", "review_id": "9Zqi09FT-x35HkCLqYcZuw", "text": "Great experience! We stop by for a quick treat and were very happy with no lines, super friendly service and quick check out. Will be stopping by again! \n\nAmazing staff!", "business_id": "v8w1vCDYh6BhXQFzFMUsWg", "stars": 5, "date": "2013-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wuCszpVPMIMyOCualnZtaw", "review_id": "EWBRkJQkP_HKVPUxZZWWhg", "text": "It's been a while but it's still good.\n\n\nIf you like  ice cream (and who doesnt) and you are not afraid of the calories. Then Cold Stone Creamy is the place for you. Coldstone has good  Ice cream and you get to create\n your own custom ice-cream creation. \n\nAs we entered the store we were greeted with a loud \"Hello\".  There was a bit of a long line however, the folks at Coldstone  kept the line moving.  As we waited in line, it was obvious that the staff at Cold Stone enjoyed working there and working with each other. \n\nWhen it was our turn we were served and given suggestions by the staff.  Its been a while since I last visited coldstone but it was still as good as i remembered.\n\nColdstone has awesome service, lots of choices of icecream, so if your in the area give it a try", "business_id": "v8w1vCDYh6BhXQFzFMUsWg", "stars": 3, "date": "2014-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "60i9h-gPKH1f0YC_bZXDhg", "review_id": "iJ2xwhkwFhvnqrOc9RbrGQ", "text": "Good Ice Cream and Crew\n\nCold Stone is always a treat.  Pros are great, rich flavors along with lots of candy options to crank up the joy on the day... and harden your arteries.  Perfect for the Arizona heat.\n\nThe negatives are the table area can be messy and the friendly crew working often gets a detail wrong on the order.  And what's with an ice cream sandwich with ice cream too soft to stay IN the sandwich?! :o(\n\nStill a good place and you'll gt service with a smile.  If they close the gap on the little things, I'll be happy to up them to four stars.", "business_id": "v8w1vCDYh6BhXQFzFMUsWg", "stars": 3, "date": "2014-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hmXwrR3ute6dbawYgchlUg", "review_id": "WZQ03clpg5hmZneuxjZoxQ", "text": "The store is alway pretty friendly and ice cream is good.  The place is a little out of the way and the outside sitting area is dirty.", "business_id": "v8w1vCDYh6BhXQFzFMUsWg", "stars": 3, "date": "2015-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-1F7KZxq3Lib1CKLlybC5Q", "review_id": "gRrG53-jMO8m0ZeYh3mMpA", "text": "Great place", "business_id": "01kU7NKzfCP3tgYmgzXbjQ", "stars": 5, "date": "2013-11-30", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "8WQubmP7G0NM3IyzyMnCEA", "review_id": "k6o93GgCP4eIFGjWNQCQvg", "text": "Unexpectedly delightful ice cream in a strip mall location (like just about all my good finds in Phoenix).   Honestly, I was just looking for a quick break and much needed sugar on the drive back from (sleep deprived) days in Vegas...what I found was one of the best ice cream I've had in Phoenix.\n\nThis little independent gem does it all...ice cream, gelato, mix-ins...and Karen was amazingly friendly and overwhelmingly generous with all her samples.  I was told that she makes everything herself on site.  Everything I tried was super tasty...but the one flavor that can get me in my car and back to Surprise would be Red Velvet.\n\nPricing is a bit different here...you pay for ice cream by the weight rather than by the scoop...great for me since I really do prefer little scoops....lots and lots of little scoops", "business_id": "Om3WtcK5qgwEW5-CojPMxw", "stars": 4, "date": "2007-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j_UNmHDEVBDOyPAVVt8QlA", "review_id": "rn299e6KRUV-qesHsA0msQ", "text": "Yum ice cream", "business_id": "Yt0qDtYzioJTUnDgHHTD-A", "stars": 3, "date": "2011-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PWEDLCAoCK0l_XynUvLFnA", "review_id": "SuWBtygaI2xLYFaV5J6tdg", "text": "How does an ice cream shop NOT have chocolate chip or mint chocolate chip for over two weeks! Come on -does someone need lessons in supply and demand? I only ask for ice cream every once in a while!", "business_id": "Yt0qDtYzioJTUnDgHHTD-A", "stars": 1, "date": "2014-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jOWBX40VZpr4u0dGqww59g", "review_id": "-74Lnqr6Hq7owUydq0apFQ", "text": "I was in Wickenburg a few weeks ago, it was hot and we decided to stop in at Chaparral for some Ice Cream.  After speaking with the owners we learned they had just taken over ownership and have been working very hard to turn the place around.  They make all of the ice cream in house and have just started serving a variety of sandwiches, pizzas and other homemade treats.  I tried the Hassayampa Mud, (it is a coffee ice cream with some other ingredients I can't remember) and I am still craving another scoop!  My sister had the caramel and nut with yummy homade carmel sauce on top (sorry I can't remember the name)  and loved every lick!  I would definitely tell anyone in the Wickenburg (even if you are just passing by) area that this is a must try!  Oh and I thought the cutest part was the little gift shop they have set up for browsing.", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 5, "date": "2009-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nxOW5AV1ULk61qJG_SrkPQ", "review_id": "eXgU9BKiwlRxTLWo6ZyyQA", "text": "Yummy stuff -  good value\n\nThe BF had the warm apple crisp with vanilla ice cream - scarfed it down in no time.  I managed to get a bite before he finished; it was very good, nice slices of apple, good topping.\n\nI had two scoops (and they are HUGE).  One was a sugar-free amaretto, with lots of almond bits.  The other scoop was a half-and-half of maple walnut (definitely would order that again, and I bet it would be great on top of that apple crisp), and lemon, which was rich and creamy.\n\nThey have lunch items on the menu - pizza, salads, sandwiches.  They offer fund-raising events for schools, and have love music during the weekend.  Nice staff....", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 4, "date": "2010-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V7pppn-r6tL_Yb2_msQQFw", "review_id": "BBh7LuUOb8dUyqIr3-q1mg", "text": "Homemade ice cream is lovely. I can imagine it tastes even better when it's 120° outside... which it doesn't quite get up to here.\n\nI had a cone of Hassayampa Mud, with a waffle cone, with the nuts. The nuts gave it a texture I appreciated, and there weren't any ice crystals in the ice cream. This particular mix eases off the chocolate, but it's okay: the ratio of ingredients is just right.\n\nThere's a whole bunch of other stuff for sale in the main area, including some pretty neat laser-engraved metal plates. It's a nice find.", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 5, "date": "2011-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8B1QOB8uI4hQKFTJXwWS-Q", "review_id": "xmGT8pD59X3otquLyVhBwg", "text": "I have had their ice cream during intermission at the Del Webb center, and it is VERY good.", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 4, "date": "2014-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PXUGmGihZIszs1SVLmUa5g", "review_id": "00qhsO8HPIBk6qyxYa2Mhw", "text": "First visit so I sampled several flavors; the winners were Hassayampa Mud (chocolate/coffee) and Prickly Pear, which seemed regionally appropriate as well as tasty. Good textures although the Mud was oddly resistant to melting. I also liked the flavor of the Amaretto sugar free ice cream but the server said they don't make that one in-house so I skipped it. A guy played cowboy songs in the front of the shop - nice ambience. Only tried the ice cream but will save room for a sandwich next time because the offerings sound adventurous.", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 4, "date": "2014-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hkydjWDHPN1117L-010CCQ", "review_id": "MXaY6D8uoNr063-K-O8Wtw", "text": "Yummy homemade ice cream! Pricey but worth it. PLEASE NOTE: New location as of mid-November - next to McDonald's", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 5, "date": "2014-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4ALw7x4cs8cNffZqJVR5Zw", "review_id": "_0cGCltLBXPxGuxyzzGbWA", "text": "So we read that Chaparral has the best ice cream around; homemade actually.  We had also read that they were moving but we saw the store so checked it out.  There was a closed sign on the door.  Then we saw it again across the river so we went there......well they were moving all right and were not set up for business.  I walked in and they were sitting around relaxing for a while and I said I was so sorry they were not open for business.  We chatted some and I thanked them and headed back to the car.  Then suddenly out comes one of the guys and tells us to come back in; they said they have some in the freezer that they moved in the morning.   They asked what flavor and we said we didn't care so they brought us each cappuccino.  We sat down on something and ate our ice cream and chatted.  We tried to pay but they wouldn't accept any money.  The owner is so nice and friendly, oh and yes the ice cream was delicious.   Apparently they have food as well but of course we do not know what they have to offer. Thank you Chaparral for a great experience and story.", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 5, "date": "2014-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "2AGGIi5EiVLM1XhBXaaAVw", "review_id": "z_3tjADqWMANqHElzqqcFA", "text": "Absolutely love Chaparral Homemade Ice Cream. Stopped in on a Saturday afternoon at about 2:30 only to surprised by live music. The kindergartener in our group whispered, \"They're real cowboys - I can tell by their hats.\" The singers were very friendly, engaging the kids in their performance. So much fun.\n\nAnd the ice cream? Homemade. Had to taste the prickly pear, but we opted for maple pecan, boysenberry and chocolate. All wonderful. They also have a full breakfast  menu and an assortment of sandwiches and pizzas. Family owned. Seating indoors and outdoors.\n\nWe will definitely return for the ice cream and the entertainment. And maybe one day even a sandwich.", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 5, "date": "2015-09-26", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "auVkTXPmA8o3oU8barlBSw", "review_id": "AZ-c3DwiTFiylQs9LlbQHw", "text": "Cute spot in Wickenburg.\nExcellent homemade ice cream with a variety of unique flavors, including some Wickenburg-esque flavors like Hassayampa mud and WHS (for Wickenburg high school).\nWe had lunch, too - pb&j for the kids (love that they offer pb&caramel, pb&cinnamon, pb&honey, etc...with or without banana sliced on top!) and a chicken salad for me. Both quite good and at very reasonable prices.\nService was very friendly, and we loved listening to the two gentlemen play guitar and sing country covers, while encouraging the kids to dance (on a Friday at lunchtime!).\nIt's definitely my first choice in Wickenburg and a great stop to break up the drive for some ice cream.", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 4, "date": "2015-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a7HutJAfWtIZBgisBYf73A", "review_id": "TGs7caOyfzY7wtTvmJ40FA", "text": "We visited Chaparrals after a ghost tour of Wickenburg.   Least to say, I was not expecting to be amazed of the pristine, SEXY homemade ice cream they offer. Their ice cream is literally orgasmic and pleasing to all of the senses. The antiquated decor and all white interior really gives off a old western feel. I've got to say, their ice cream is literally the best I've ever tried and I've had A LOT of ice cream in all my years.", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 5, "date": "2015-10-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "zD0BZI-GJHnVTVKSXXBSng", "review_id": "wGdoSknzxN1hd7AHvnj0Cg", "text": "Where have all the milkshake made out of milk and ice cream gone??? It seems like they all are made of some slimy chemical product that doesn't even melt. YUCK!\n\n Thank goodness for good ole Dairy Queen! They still make it the old fashion way and I am so grateful! I love their strawberry shake.....but I will soon need to \"shake\" this craving since each one sets you back almost 800 calories....totally worth it!\n\nI guess if you don't drive through and walk in to get your milk shake, you burn some calories right? TOTALLY EARNED IT!", "business_id": "M0d6CT77EK8aS0AcvSNaRQ", "stars": 4, "date": "2010-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ye96FF1SKClpmDtx1eaWCQ", "review_id": "UOqucZ4TVPiWqzgICP-Z_Q", "text": "This dairy queen is located inside of a mall, which makes it nice, warm and easy to find. The staff that works here is so sweet and accommodating. I arrived five minutes to close and they treated me as if they just opened. There is a girl that works in the front who is an absolute sweetheart!! \n\nI always order my standard dairy queen \"dip of heaven.\" Its this cone topped with some vanilla ice-cream soft serve, then they dip it in this hot chocolate dip. It comes out with this hard encased shell of chocolate. The perfect combination of crunchy exterior and cold creamy inside.\n\nMy friend got the BLIZZARD. You can make your own contraption of soft serve with different toppings inside. Then they mix till it gets to this perfect combination of not so soft and not to hard soft serve. The best part of this..... She turns it upside down, thats right... Take the cup of whatever you made and turns it upside down just to show you how creamy it is. \n\nMy suggestion, any roadtrip or trip outside of your hometwon(especially if your deprived of having a DQ in your neighborhood) requires a stop.. its an American classic since the 1940s its a must for ice-cream. Its not fancy ice-cream, or organic, but its perfect to get some ice-cream and sit in the mall. If you go during Christmas they have a Christmas light show you can watch while eating your tasty ice-cream that happens every hour.", "business_id": "M0d6CT77EK8aS0AcvSNaRQ", "stars": 4, "date": "2015-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TBbME7IpGfOOcB1uFOLjDQ", "review_id": "RE38O_HMonAxLGOLoDBjUg", "text": "Decent selection of flavors, polite & quick service. Only thing is there are eight chairs. Total. Not the best thing when you have a family of five.", "business_id": "5JUK1WyW4tWodmEkDsW8wg", "stars": 4, "date": "2012-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gHTQyPfUr47uNRLEPBpFFA", "review_id": "nxN5UjP7pheB_DYK_8A0RQ", "text": "Based on the service the other day, this location is down to 2 stars from 5. For whatever reason, ALL their chocolate ice creams were too soft to be served. And since I came here specifically for the chocolate therapy, this was a huge disappointment. I sadly ordered a regular sized  non-chocolate flavor and the woman working scooped it into a child sized cup. While I think I still got the correct amount of ice cream for a regular, it was overflowing in the small kiddie cup making it a little difficult/messy to eat. I think I'll just stick to buying my Ben and Jerry's pints from the grocery store.", "business_id": "5JUK1WyW4tWodmEkDsW8wg", "stars": 2, "date": "2013-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "O7LzmTKdA0w-jGfq051Z2A", "review_id": "cWqUCui1rS5hvhzOQqpOxw", "text": "9:20pm and chair's all up on tables. Had to stand outside!", "business_id": "PMpQAV7glwhKhnHfDa30Dg", "stars": 1, "date": "2012-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "QMTQNQmp4hQ2o6hkRX_Uxg", "review_id": "HngXbe_f56NDHAcqLOOn6A", "text": "I got ice cream here just yesterday. And the staff are always excited to see you and not only this they are happy to see locals. They remember your name and the ice cream is always very good. I give it 5 stars.", "business_id": "PMpQAV7glwhKhnHfDa30Dg", "stars": 5, "date": "2012-10-17", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "J0SEk_wHYZkqJLRlVcvRnQ", "review_id": "impkCPOmsE7lUaar4AyCfQ", "text": "I've been here a few times and I dont feel that guilty b/c of the sinless sweet cream. I ordered the cookie overload last week and it was about 100 tiny little chocolate chips. yuck. I thought htis was supposed to be oreos?? Nxt time I will ask for OREOS in my Oreo overload.. not chocolate chips. She was so busy complaining about having to do homework when she got out that she wasnt paying any attn. to what she was doing really. Her lil brother was talking to her and relaying messages from their mother who was outside in the car and let's just say learned way more about this lil gir's family life that I needed to.\n\nCAKES:\nMy previous experience here was with their cakes. I'd never purchased a cake here so I was super pumped. I even had a coupon for $3 off a cake. Well ... those cakes are huge and it was for Valentines day - choclate strawberry cake. Yum. Looked devine right? Wrong. I ended up buying the lil cake which I couldnt use the coupon for. The lil one was only $5.00 cheaper than the huge one which served about 10x more people than the lil one..But I can;t have that much cake in my freezer, or in my possession.It was gross, It was more chocolate frosting than cake, which was about 1/2'' thick. The regular size cake is like 2\" cake. just not worth it. It was all frosting and no sustanance. I recommend the BR cakes over this place anyday!\n\nnote: you're better off going to yogurt rocks in the galleria, if its w/in hours. if not try making it to u-swirl inside GVR!. They have red velvet cake flavored yogurt in their possession. OMG so good!", "business_id": "t8PQ5iKCeeofy-nXvTNk2A", "stars": 2, "date": "2010-09-23", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "TBbME7IpGfOOcB1uFOLjDQ", "review_id": "j5FaV2abU9Qa0jfQvybIQg", "text": "I find it disturbing that someone gave this location one star simply because she didnt read the menu. All of the menu items are described in detail on the walls of every cold stone creamery. \n\nIve been coming to this location for two years and I've always had good service and top- rate ice cream. If i had any complaints itd be that there isnt enough seating. But i wouldnt complain about that cuz im not a whiner ;)", "business_id": "t8PQ5iKCeeofy-nXvTNk2A", "stars": 5, "date": "2012-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rf4TB08jWv2WJQSUGSKCGg", "review_id": "T3xFWJaPQJ1L_Nxd2qAq0w", "text": "We went in to this location last week.  We left.  The air conditioner filters in the ceiling above the staff were nasty.  Then we looked in the freezer and the coils were just as gross.  A cleaning might be a good idea.", "business_id": "t8PQ5iKCeeofy-nXvTNk2A", "stars": 1, "date": "2013-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GT1x4GFW1k6QfAj7HyGUgA", "review_id": "Mj5xyiz5M0I7crWTqOnE_A", "text": "I had given up on cold stone years ago because they started serving the ice-cream so soft.  I really liked it when they first came to town because the ice cream was hard.  I talked to a guy I know that used to work there and he told me the reason it is so soft now is that it was to hard to mix it all up when the ice cream was hard.  He was a big guy and he said his forearms killed him during and after work...... Long--short, we went in the other night the young lady was very pleasant and the ice cream was really good.  It was softer than I would have liked but I looked at it in a different light.  I figured I could put up with some tasty, but soft ice cream to save a very nice teenager some sore tired forearms.", "business_id": "t8PQ5iKCeeofy-nXvTNk2A", "stars": 4, "date": "2014-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jqhMhmLhoeCySthoazATqA", "review_id": "KGafdU89s8irbli5Ja9xyA", "text": "The cherro is frozen & there is paper in the ice cream this place is not good and to priceless  good luck next time maybe", "business_id": "t8PQ5iKCeeofy-nXvTNk2A", "stars": 1, "date": "2015-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "X4DOJRBsPKegCL91T43DGA", "review_id": "DTIfq-8huxpB872JfbAeCw", "text": "Always friendly staff and of course great ice cream.  It's a little pricey but the serving sizes are pretty big.", "business_id": "t8PQ5iKCeeofy-nXvTNk2A", "stars": 5, "date": "2015-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4qaviROg6YclcYkzjq5tMA", "review_id": "Dz7cjtOlxMbb99OwbxBBfg", "text": "Went here tonight and was greeted by the awful old deep fryer oil smell. Ick!  If McDonald's and Burger King can figure out how to not have that smell, surely DQ can too. They are under new management from earlier this year but Iam disappointed to experience that oil smell.  I am however giving them two stars because the service was very fast despite all of the people in the place.", "business_id": "SchSiNdLjuRjjrsXFeggWA", "stars": 3, "date": "2012-10-20", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Tt88fGVlVMTGyQptdj4CBA", "review_id": "egd9ia1WnUBWxvHjs9qhRw", "text": "I'd have to just say this dairy queen is average.\n\nAmong all the ones in town that I've been to, they usually are about the same. Super busy and staff always seem overwhelmed.\n\nThis one was packed with all the seats being taken. The table we sat at was dirty with ice cream and napkins and the staff was not cleaning any of the tables.\n\nUnderstandable in a rush, but don't visibly eat ice cream after a rush in the back instead of cleaning tables first =\\\n\nAnyways this place was just below average for me..", "business_id": "SchSiNdLjuRjjrsXFeggWA", "stars": 2, "date": "2013-11-22", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "jXgNfZnWf87pZ-k2vFz22A", "review_id": "bhoTgbq8kDkrn3XqoRzzjA", "text": "What a mess. \nAfter making my pumpkin blizzard. They tried to use a regular soda lid on the large then forgot the whip cream.  Next after asking for whip they forgot the pumpkin spice.  Asian guy working was on the side using his cell.  \nHad to ask for the spice in another container so I could put it on the blizzards myself for the kids.  \nWtf?????  It was soo freakin messy and it looked like an ice cream shoved into a cola container at first. \nThis place needs a serious employee training so they know never to serve something with less quality to the customer.", "business_id": "SchSiNdLjuRjjrsXFeggWA", "stars": 1, "date": "2014-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Yt2Jinssal_G45KN7ljIvg", "review_id": "KHw3-7p_RAYODBIYZs4PEA", "text": "Stepped in with the squad three deep with the highest hopes of greatness after peepin' the online menu one time. With ice cream on my mind and cheese curds in my heart I placed an order of simplest form. \n\nYa boy had to wait 25min. for those curds. Despite the food being excellent, the customer service left more to be desired. Me and my squad went from one hundred to zero real quick. My strawberry shake is very on point though.", "business_id": "SchSiNdLjuRjjrsXFeggWA", "stars": 2, "date": "2015-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LmZ1Cwt5HMBiWv9nXjcHag", "review_id": "aRTf53GzQIFpUvZCmFgAYQ", "text": "I wouldn't ordinarily review a Baskin-Robbins 'cos it's a big chain and you get the same product everywhere, but the guy working behind the counter was so enthusiastic and friendly I had to mention it. He greeted everybody as they walked in, gave suggestions on the product (I said I liked the reese's peanut butter cup after I sampled it, and then he wanted me to sample the heath too for contrast), encouraged additional samples (\"hey have you tried THIS?\"), cracked jokes in his european accent, and then later, as we were sitting there working our way through our ice creams, he brought by little dixie cups of chocolate shake (\"hey, a guy just ordered a shake and there was some leftover in the blender so I'm bringing you some!\") ...and finally a \"Bye, please come again\" in the most totally sincere manner...", "business_id": "Ze0mG__i-9ziEjN2gLcHqw", "stars": 3, "date": "2007-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PV5voYSD43Cn_3gHmxG7DA", "review_id": "t8ivgpebgOJrGbpkig1OCg", "text": "Summer is here and Las Vegas almost fooled me for a while. Cold in May... The last few months were also not as hot as previous years... Then BAM! Where did this excruciating heat come from? \n\nThis past week has been hot enough for me to want to hibernate indoors until fall, but instead I decided to stop by for some ice cream. As Emmagelle B has stated in the previous review, they serve an .88 cent cone that comes out to .95 cents with tax. For this price, I was expecting a dinky cone that would disappear in two bites. When the girl behind the counter, Amber, handed it to me my eyes bulged in disbelief. It was more than I had expected and a steal at this price. \n\nFantastic service and a great deal. Another reason to go out for a cone.", "business_id": "Ze0mG__i-9ziEjN2gLcHqw", "stars": 4, "date": "2011-09-03", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "oTmdXjs0-vaydY7SO4Kv4w", "review_id": "1Z33FtjMNPl95bg6mlHBgQ", "text": "I loaded up the family and the free ice cream coupons. ..everybody was excited for the treat! When we arrived they would not honor the coupons...even when they called the manager at home! Lousy service and poor customer service. Thanks for nothing!!", "business_id": "Ze0mG__i-9ziEjN2gLcHqw", "stars": 1, "date": "2013-11-11", "type": "review"}
{"votes": {"funny": 4, "useful": 4, "cool": 2}, "user_id": "3m5rsk7xoLddGrLK3Qi5rg", "review_id": "9a_N7fz3JhbnXvevmeW9ig", "text": "Where do I begin.....?\n\nSo, my sister decided late last night that she wanted a malt... This is actually my first time in a BR, and it will most likely be my last. \n\nWalking in, there was a family of four in front of us, and then, about 10 other people (in different groups walked in.)\n\nA young lady was helping us, and we had four shakes/malts to order. \nBy the way, their shakes (for a small) start out at almost $6. A little over priced if you ask me. The girl only took our order two drinks at a time. 1 strawberry shake, 1 rocky road malt, and two malts that had half chocolate ice cream, and half vanilla ice cream.\n\nNeedless to say, the family of four was helped, and went outside.\nAnother group of four was served, rung up, and left....so on and so forth.\nTwo older gentlemen even came in to buy pints of ice cream, and left before us. \n\nWhile starting our last two drinks, the gal opens up a drink carrier, and places the drink carrier in the cooler....onTOP of the ice cream barrel. My sister and I sat at the bar, and waited for our last two drinks.\n\nAlmost 15 minutes, and $28 later, we left the empty shop. With pink ice cream on the bottom of our drink carrier.", "business_id": "Ze0mG__i-9ziEjN2gLcHqw", "stars": 2, "date": "2014-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "12GDbDND8Kex7MsxB4e8Og", "review_id": "8ya6GD0EEgJB8kmTWhVGjg", "text": "When it comes to service this Dairy Queen is the worst.  It's always dirty and there's never a manager on duty.  If there's a spill it stays on the floor and doesn't get cleaned up.  The gal came out with our food and a little girl ran in front of her.  The gal spilled our drinks but didn't replace it.  We had to go back up and ask for it and she also forgot my daughter's smoothie.", "business_id": "m4_H2hZKSoA2iu5aqrP1nA", "stars": 2, "date": "2014-09-19", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 4}, "user_id": "pW91HUnVz6ssLZ4dY-ztyQ", "review_id": "q1P3ywvNh1eVYx9GSdZaMw", "text": "Luv-It became a part of my life when I was in elementary school in Las Vegas. My BFF introduced me to the place, and whenever I return home, I can't resist a stop at Luv-It! \r\n\r\nThe ever-changing flavors make choosing difficult.\r\n\r\nI rarely miss Las Vegas, but life without Luv-It is a chasm in my heart.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2005-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ojQYtstkGXtcryk5I9GTYA", "review_id": "lT53f-WMU1wSm3tlAMHvUw", "text": "ifg you can get around their odd hours and somewhat unpredictable flavor selection, the custard is really quite awesome.\n\nyou should definitely check the website before going if you are picky about your flavors", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2005-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "ytjqLRFobRxl0DDJgoR-Eg", "review_id": "Sc1zueZ9qD-XhzR0wmhNIA", "text": "my favourite frozen custard in the world........\n\n\ni remember going there my first day of kindergarten\n\ntry butter crunch, scotch jimmie and, of course, the banana split", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2005-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "stHzPpS26Jf1PK2R4mVkQg", "review_id": "nHqy2pJ2YI-w4PTMAmu7jg", "text": "Mmmm yums~!!! This place rocks! Thanks yelp! I just got the banana split, but it was really good. I liked that it was not too sweet, yet can fill your snacking desires. I wish there was a frozen custard place like this where I live.. but then I would probably gain 10 lbs in a couple of months.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2006-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 3}, "user_id": "HHbe1svajOb3FOXdoAoGeA", "review_id": "7EpJQKa-87wPEqu5xR5WVA", "text": "Forget Pinkberry....forget Coldstone....this is where it's at!! It takes quite a deal for me to say this 'cause I don't say it very often ( just ask all the men in my life) but ladies and gentlemen...\"I'm In Luv\"....In Luv with Luv-It!! The absolute best frozen delight I have ever had. Luv-it is a locals fav that should not be missed. The custard is smooth, creamy and a bit of heaven especially in the midst of the desert heat. The best part about it is that it is made fresh everyday. I stopped by just shortly after they opened and I \"luv-d\" the fact that I could see my custard being freshly made before my eyes.  The Mint Chip, cheesecake, and butter pecan are to die for and are a must have. Their feature flavors change daily and are updated on their website weekly. I must admit I check weekly because I can't miss out on those three flavors ( I have a half-gallon of Cheesecake in my freezer right now). If you are looking to depart from the usual ice cream destination....Luv-It is your place!!\nAnd if you are bored/or feel guilty for being gluttonous and feel the need to work off that calorie-filled adventure, walk right next door to Olympic Garden. The arm exercises that you can do by pulling out all those dollar bills at the strip club I'm sure could work off at least a small serving of this frozen goodness!!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2007-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 3}, "user_id": "c4d7bUfVtCkmZ3xoj6k36Q", "review_id": "vue3AGIoExSal2kdfR_org", "text": "Thank you yelp! I was in Vegas for business and had some time to kill before my plane. I thought what should I do???? Then like a light bulb in the back of my memory I remembered reading about luv-it on yelp. I quickly dialed 411, and cruised my sweet rental car ride up the strip, past the stratosphere, to the little corner behind the am-pm. It was the middle of the day, in the middle of the week, so there wasn't too much of a line, but as I walked up one satisfied customer asked me \"have you ever been here before?\", after I said no, he replied \"ohhhh, you are going to love this stuff!\". I ordered a small blueberry.... and wow! Luv-it was like nothing I have ever had before. Very thick and creamy with a sweet blueberry taste. I only wish I could have tried some of the other flavors, but they only offer a few from their variety each day.\n\nSo.... if your in Vegas with some time to kill, of just looking for a unique frozen treat, I highly recommend checking out luv-it frozen custard.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2007-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZoiKCnVfSQOAGvRIg_Ykaw", "review_id": "r-6_qzt5LzCYMxW9DX58og", "text": "Fresh custard!  This place rocks.  Don't get your hopes up expecting a glitzy drive-through but definitely stop and has a flavor of the day.  It's worth the trip.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2008-09-01", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "_u5rl1GhCb-NtX_BMa8w7A", "review_id": "e3nOZagBa7WmjdVHXlzJ3w", "text": "so. i admit it - i love the new trend for frozen yogurt... especially the tart flavors, and having a choice of 20 toppings... its great.\n\nbut for las vegas, no frozen treat is better than a cup of frozen CUSTARD from Luv-its... seriously, its creamy, rich, and flavorful... they change some of the flavors daily, so there is always a chance to mix it up - \n\nso heres the real deal tho, we all know Vegas can have hotter than a mutha fucka days more often than not, and nothing beats the desert heat better than a cup of frozen custard (and a cup of water) from this joint. 5 stars, fo sho...", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2008-10-20", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "RykUrBlD01fht38BTfNMEQ", "review_id": "yZ1iGq2tTk_3KXkgF_NEww", "text": "Oh North Vegas... the neighborhood of crack whores and drug dealers.  Despite the danger zone, frozen custard is THE BEST.  I would gladly put my life in danger for 5 minutes to indulge in this palate pleasing concoction.  There's something about using pecans instead of peanuts that gives it just the right amount of crunch without over-powering the flavor like peanuts often do.  I'm a big fan of the Luv-It Original but by all means, please please please try the others and let me know your thoughts.  For such a random hole in the wall place, they have a ton of options.  \n\nNOTE:  Forget about the junior sizes.  You think the regulars are huge but once you start eating, it disappears in 5 minutes.  Total WTF moment.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2008-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0y9qZZLauQ3sPp-G-NcE7Q", "review_id": "zjApNFdwDDbk1v8csXg11g", "text": "\"A Hole in the Wall\" was definitely the right phrase that my dear friend, Sheana J. used to describe this place...\n\nA hole in the wall, but a good hole in the wall place...I was surprised that it was actually frozen custard. Other frozen custard places leave that egg-like aftertaste, but Luv-It didn't! Brownie points for that! I ordered their Malt flavor frozen custard, and it was DELISH! It wasn't as powdery nor was it eggy! It tasted just like regular ice cream, and was just perfect! I hear that the egg nog flavor is pretty good, and probably the best choice for the holidays.\n\nI would have given this place 5 stars, but the price is a bit much for frozen custard. $2.45 for a junior cup???! It would probably be more worth your money if you order one of their specials like the Banana Split...\n\nWARNING: Always bring a friend here when you venture out to this area of Vegas. SCARY! Oh...and DO NOT bring your high-end goods here (as mentioned again by Sheana J.)...You'll never know who will be lurking around the corner at this place...\n\nI will definitely back here again...but of course...with a friend or even two...", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2008-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZoiKCnVfSQOAGvRIg_Ykaw", "review_id": "SaqTPewvA7jYaEs4dv9DUw", "text": "Banana split in a bowl.  It was good.  I love wisconsin custard!  This little hole in the wall does a great job!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2009-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XAz4I30tssPn373BzAduug", "review_id": "B0NrwW_RoaSLwEZIURSwmg", "text": "I have heard of this place on tv before, either travel channel or food network. We came here after dinner one night after a friend who has grown up in vegas suggested it. It is in the GHETTO. It felt almost unsafe going to this area, but we pulled up this shack on a Friday night around 10pm with still a crowd eating custard. My bf and I shared a sprinkles custard, it had chocolate sprinkle and marshmellow supposedly but I couldnt tasted the marshmellow. It was my first time having custard and it was pretty good, you could taste more of the egg and milk compared to ice cream. They offer different flavors for different days of the week, but our friends really like the Western special.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 3, "date": "2009-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oVwkbsSzuO1YUvo2ql1Vug", "review_id": "ls_XkQJUKzXLiO5nyQ9ztg", "text": "One of the best frozen custard I've tasted. Whenever we go, I always get vanilla or chocolate sans any toppings to fully enjoy the taste, creamy texture and richness of the custard. There are several different flavors available any given time, if you want to make sure what they are, visit their website first to see what's served up that day (http://www.luvitfrozencustard.com/flavors.htm). Visiting the place is an experience itself, a hop away from the Stratosphere, the location is ghetto but frequented by cops (and prolly strippers on break). One summer evening visit, the entire Vegas SWAT team was there! Luv-It lives up to the raves patrons give it, it definitely tastes good and the location has this unique and inexplicable charm.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2009-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CVao7mI1bSzEe2LETDjg9A", "review_id": "tyv27JKcefPUGMfGua2W8w", "text": "http://www.eatinglv.com/2013/11/there-is-no-more-love-at-luv-it-custard/?pid=20573 \n\nUh oh. Was looking up flavors for future dates and noticed their site was no longer current.  Then received differently styled FB updates and noticed different call outs to owner names.  Sad to hear the changes recently.  \n\nOld review pre 2013.....\n\nWe come here 2-3 times a day when we are in town visiting.  It's that good and no guilt here since it is a 12 hour drive from bay area.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2009-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yIQJU8GbuH5le-XO1977UA", "review_id": "fvnrgT4le0_xSkC-EEXAgw", "text": "I used to drive past a Frozen Custard shop here in the Valley almost daily for years, but never took the time to stop in.  As you may have guessed, by the time I finally decided to check it out, the business name had changed and they were now only serving pizzas and calzones.  :( \n\nSo.. when I heard a TV newscast about this place while staying in Las Vegas, I had to go check it out!  Unfortunately, the newscast was about the minor character actress from \"The Office\" who had complained that the business was in a ghetto area, but my now intense longing for the custard I had let slip away overwhelmed my common sense and I just had to go!\n\nLet's just say that arriving here just after dusk was a huge mistake.  There were no people outside, except for a few guys that were suspiciously loitering halfway between this place and the neighboring liquor store.. so I drove off and came back about 20 minutes later to find several people enjoying custard and finally feeling secure enough to leave my car.  Being a seasonal-flavor junkie, I was pleasantly surprised to find Pumpkin as one of my choices, and adding the Western sundae toppings (hot caramel, hot fudge, pecans) was a nice compliment to the extremely smooth, tasty custard below!\n\nI think the food was well worth the drive to North Vegas, and I would also recommend this place highly because the owner was very nice.  However, I have to deduct one star because of the hours of operation.  I wanted to come back one more time before leaving town, but the shop doesn't open until 1pm.. which only leaves 4-5 hours of daylight to feel safe coming here!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2009-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "p-kO5FA4WDmWXQEHz1-4-A", "review_id": "6a2ug3luHzXvbu_kWHNOsQ", "text": "The bf was so excited about all of the flavors he had seen on the website but was :( when we arrived and there were only about 5.  So his rating is about 3.5.  He said his coconut custard was really good.\n\nMy rating, on the other hand is a solid 4!  The Western is a sure fire winner.  Those salted pecans rule the school!!  I wish I had some right now!  I was worried it would be too much as we were still stuffed from dinner - but it was delicious.  Much lighter then ice cream...more like frozen yogurt but creamier.\n\nThe area is well lit so don't be too scared.  Those pecans are worth dodging a bullet for!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2009-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "Oeu8567fNpfjfICfD4Y2Fw", "review_id": "SFY9SegA4sMfN5dPmaqGig", "text": "If you were to try one place in Vegas, this would be the place. This place makes other frozen custard places taste like...um...ice cream, eww! You can't go wrong with any of the flavors. The best part of this frozen custard is its airy texture and rich taste. If you were to choose a flavor I would go with Rocky Road or Maple Walnut. Almond Chip is also a great choice. Don't let its exterior or the ambience scare you (It's behind a few dumpsters near the Olympic Garden), this place is foolproof from disappointment. Go eat now!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2010-09-01", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "ptAS1xmxKNCdPxmZqDmNfg", "review_id": "HOCw0UDyyGfbW-FEQU5zaQ", "text": "Dessert of the gods! Seriously, this stuff is truly delicious. Hole in the wall, shotty neighborhood, thugs left & right; but its worth potentially getting mugged.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2010-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "5MhbO-FbPPRkM1G9oZsdOQ", "review_id": "pg-MdsZUukryeTqsYly3FA", "text": "We FINALLY made it to Luv-It last night around 10:30pm.  There were 3 people in front of us (which was great, because I heard the line is usually really long.)  We checked their flavors on our way down with our friends- Banana and Mango.  ehhh... not something we were interested in, but thats ok.  Chocolate & Vanilla are always on the menu.\n\nTwo of us ordered a vanilla & chocolate with chocolate jimmies (jimmies = sprinkles), one ordered the Western Sundae (their most popular) and our other friend ordered vanilla with fresh bananas, hot fudge and orea cookie crumbles.  The total was $18... not bad.  WARNING: IT IS CASH ONLY!  If you need to use an ATM, then you have to go to the Mart next door.\n\nWe decided to stand outside and watch the strippers walk into their place of employment- The OG.  That was fun!  haha!  We also watched a hooker get picked up by a red car.  OK, so yes, place is in the ghetto.  Was it that bad- no way.  I heard the girl that plays Kelly on \"The Office\" said this place was like hell.  Not in a million years.\n\nIf you like custard, go to this place.  I'll be going back later this month to get the Pumpkin flavored custard!  Can't wait!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2010-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VwNAEN1KNu4Zc5zRn4-s1w", "review_id": "y-_QTheHL6FQDTnINfUZuA", "text": "This is the best frozen custard place in the country! If you come to Vegas and don't come here, you have wasted your trip! The quality and deliciousness of the home made custard is truly addictive. My Dad brought my Mom here before I was born and we have made it a family tradition ever since. \nTry it...you'll LUV-IT!!!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2010-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pnvs3Hd6ZWdSg0IvGST9Mw", "review_id": "FAe3SHFahru8HFNqvOeJyA", "text": "Luv-itz is one of Vegas' worst kept secrets for sure.  Definitely not a tourist spot by far, as its far down Las Vegas Blvd, into a less glamorous part of town, but believe me the trip is worth it.\n\nAwesome sized portions of delicious dreamy custard, with dozens of different sundae options, even though the western is what everyone in their right mind should order!\n\nJust make sure you bring cash, as Luv-It still does not take credit cards!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2010-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9hAxvoUVMD4IZWNEb-BuAg", "review_id": "NYt7-UE81G1yzlTx5UCv4g", "text": "Heard their Champagne Cherry was awesome, so stopped in today to try it. AWESOME!! It needs to be on the flavor menu more often. Also loved the Coffee Chip. Both were stellar and super yum. Do drive from across town for these flavors. :)  Custard is so much better than ice cream!!!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2010-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_6bFXoUrzam_1SzP3bFLXA", "review_id": "kw-FP-5mkhHpXJTp8gs9Cw", "text": "Have u ever looked upward to the sky toward the Stratosphere Hotel Casino tower? Guess what, somewhere around its vicinity is Vegas' best-kept secret!! \n\nSssshhh, my secret for a long time since I had it....it is to me the besssssttt frozen custard in this city everrr! I am sure not much of a secret to some who shares my love for \"Luv-It Frozen Custard\"!! \n\n\"Luv-It Frozen Custard\" has been around long before the nearby hotels were built. Matter of a fact: 37 years! This is a popular go-to place for locals but tourists are not so much aware of it, although surely some knows about it but keep it to themselves.\n\nLast night I ventured out there for it. I had the \"Luv-It Special\". I have been ordering \"The Western Special\" before. I love chocolate and that's what it is but last night I tried the \"Luv-It Special\" and it's a new favorite! It has the frozen custard which is made of eggs and milk, pecans, marshmallow, strawberries and cherry. I had hot chocolate fudge and bananas added to it for my very own \"luv-it mine\"...lol. Funny, Greg Tiedemann, the owner who served me (and i would guess everyone else at the window) had to stop and think before he made my order, but he said he like my combination. (Check out my photos). Know what, I can't have my frozeeee custeee without chocolateeee. The moment I had my hands on my special order and savored it, I was in heaaaavennn....so coool ,so goood, I was on highhhh LOL\n\nFor more info, \"Luv-It Frozen Custard\" is located in the not-so-good downtown area of Las Vegas on the northern \"Strip\". There is this small rather cute retro-looking building structure situated in a parking lot with a sign that screaaaams \"Love\" because it's in red with a heart on a white background. Now if that's not making my heart beat fast, what else? Look up toward the business' sign and looming behind it is the Stratosphere tower. If you are lucky, you won't have to wait in line. Just walk up to the window to order from a board list posting of a variety of frozen custard choices with various ingredients from nuts to berries, to fruits, to fudge, to chocolate, sundaes, malts, shakes, frozen bananas, whips, luv sticks. \"The Banana Split Special\" is on the menu list which is another of my favorite to order. The moment  you get your order, you wouldn't think of anything else while you savor the frozen custard of your choice... seat not needed. Mmmmm...Just coooool up and live it up! Love It!!!! eh, I mean Luv-It!!!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2010-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Iu3Jo9ROp2IWC9FwtWOaUQ", "review_id": "UM0B4jl75egmDDreKbIpIQ", "text": "This is a great stop!  Last night, I decided to skip dessert at Casa Don Juan and instead head for Luv-It.  I've been here before, but it was on my way to McCarran.\n\nI got the Rum Rainbow - one of the flavors of the week.  It was rich in rum flavor and the rainbow evidently came from sprinkles added to the mix that melted and left colored streaks.  It was very flavorful and very smooth.\n\nI really like this place.  Now if it would just move to Summerlin, I'd be happy - and broke!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2010-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2LaQ3zFchMRofT8d358Cfw", "review_id": "SZ7WuQR8evPfGs993Fjx8Q", "text": "Oh my God this place is Google!!  Don't even bother with the rest of the synthetic crap out there. The western rocks. The place is unique.  We went there all the time and it was never disappointing.  The dude who owns the place is kind of a trip, but he really isn't as grumpy as he seems...he is just serious type. God I miss this place!\n\nKeep eating local!!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2010-10-15", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "C7ciXF5bvugEnoiQ22a64Q", "review_id": "MrYBdXLymx_CFmCT8sXG5Q", "text": "Love love Luv it!  Why had I not heard about this place in the 2 years that I lived here?!  I guess that's probably a good thing considering I'd probably get caught eating frozen custard 5 times a week and then become qualified for lap band surgery. This sweet little place is full of old school charm, and its right by the Stratosphere, so be warned.... the neighborhood is a little rough around the edges.\n\nOrders are taken at the walk up window which opens at 1:00pm. There was a line when we got there!  And it was a Monday. Geez, people.  I guess the secret is out. The flavor selection changes daily, since the ice cream is made fresh in small batches.  Luv it has all kinds of flavors, toppings, and sundaes which makes it hard to decide. So, I went with their recommendation: the Western Sundae, and it is so effing good. The vanilla  ice cream is rich and super creamy, topped with chocolatey hot fudge, caramel and pecans.  I think I need to lay down.   Another great sundae is the Banana Fudge Krumble, which has hot fudge, sliced bananas, oreo cookie crumbles.  \n\nWow.  Vegas is lucky to have this frozen custard shop.  My body is lucky that I don't.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2010-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "AKzEyZ72fB5Ie9yhekTSeA", "review_id": "rYxIRNKsP1mLxtZA3j8_gA", "text": "Based on the stellar reviews of this place I think a lot of people may disagree with me but I wasn't impressed.  The location has cute vintage charm but the frozen custard tasted like regular ice cream to me.  Maybe I was expecting something more 'custardy' because of the name.  I ordered one of the cups that came with butterscotch, bananas and nuts.  The ingredients were quality but it still just tasted pretty basic. If I lived around the corner I might come here to satisfy my sweet tooth every once in a while but I much prefer gelato, yogurtland or coldstone..", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 3, "date": "2010-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eih46vKL3BxS3xHI9hkqIg", "review_id": "Uu7tlVuPqb_CyMlf3Rm2Vg", "text": "LOVE IT! I've visited before, but that was years ago. I'm so glad I made time to come back. Luv-It is located north of all the casinos, right by the Stratosphere, i.e. the sketchier part of the strip. But that's Chuck E Cheese compared to Skid Row in LA. Anyway, I digress. The custard is thick, smooth, rich, and creamy - just like I remembered. I got the Luv-It special with chocolate custard, frozen strawberries and salted pecans. So damn delicious. I wish I stayed another day just to have this again.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2010-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "5y-PncRlhVVJ_dEDPcC3tA", "review_id": "KABiA5UHcdpQspjwv6betA", "text": "Luv It has been around since I was a teenager and it's just as good now as it was then!! This is one of those family businesses that has stayed true to their origins. The custard is always perfect and the selection of flavors is great. My wife and I love the Western Sundae with butter pecan custard! It is truly a little slice of heaven! Plan on waiting a little bit to be served, it's a one man show, but it is worth it!! Plenty of celebs frequent Luv It, so be on the lookout!!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2010-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y3EoopsOxU5Zmc31r7d5HQ", "review_id": "JBt4fcsQzmu_vlrUFn_Lvw", "text": "I tried the Western Sundae . . . it was yummy! Glad i don't live in Vegas or else i would be there all the time trying all the items on the menu. I can't wait to return and try the caramel sundae! There wasn't a line when we where there we went right up to the window and placed our order. I will be back! :)", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2010-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2HeE7ipLrQSYj6Bp_P08Cg", "review_id": "lqPO3CCohLgtWUUniIMcFg", "text": "First have to thank my wife for wanting a frozen treat, haha.\n\n  I have to admit, at first glance I was a little hesitant, but all that went away once I dove into my delicious custard.  Luv It!  My wife and I will be coming back next time we're in Las Vegas.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2010-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fgYkHiNSY_uyMRoU633aeA", "review_id": "lC-q9Fg_o6NqtLEqfJ2kFw", "text": "Best frozen Custard ive ever had Smooth and creamy and lots of diffrent flavors the pumpkin is my favorite so far ive been a half a dozen times and its always a treat! butterscotch jimmys mmmm..... about ten dollars for two icecreams but worth every penny.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2010-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "lq_pBvW-9nwY3Vd8OSWfaA", "review_id": "4yXa-nlU9xmLJUcgKlR-IQ", "text": "Maybe my problem is that I'm always comparing Vegas institutions to my hometown favorites--maybe if I stopped doing that, I'd be a little more satisfied with life. As it is, eating at Luv-It, I can't help but feel a little ripped off that it doesn't compare to other frozen custard places I've eaten at. The prices are a little higher, the custard has a little less flavor, the neighborhood is a lot less family-friendly--last time I was there a guy came up to my car asking for money to buy his suicidal friend a beer--but examined in its own right, Luv-It is still pretty great. The custard is creamy and good, and the experience itself is worth it. Luv-It's may not be the best frozen custard, but it's good, and it's all we've got!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2010-11-21", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "cr1tquDMDwt4-WSsahOr8A", "review_id": "byh7xrq0F7lKe9dvs9RIWg", "text": "I always stop here before I spend my hard earn money on hookers, gambling, boose and buffets.. and SO SHOULD YOU.\n\nThey call the ice cream here custard. I was always confused which is what but there is no doubt in my mind that this is a must visit if you are in Vegas. Just a little bit off of the strip and new OG (olympic gardens strip club.. for the guys).", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2010-11-21", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 3}, "user_id": "fZNIqFn8ka6Xy9_4AgUKng", "review_id": "e63hFgLuHfev21KXHtrSSA", "text": "Vegas locals are nuts about Luv-it.  But to be honest, I don't really get it.  Don't get me wrong, anything frozen and sweet is a score in this heat.  \n\nHowever, they don't have much variety of flavors.  I've been there a few times after 9 pm and the shop ran out of most of its flavors, leaving me with chocolate and vanilla to choose from.  That's a little annoying.  And, while I get that custard is different than ice cream, the taste of Luv-it custard isn't really distinct enough to celebrate.\n\nHowever, the sundaes are pretty amazing.  The nut topping is freshly toasted and the fudge isn't too sweet.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 3, "date": "2010-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XrfkmMwiaPwNN3ww-T_MLA", "review_id": "_U6hJySXzBvRWLgMNSHFtA", "text": "After hearing about how good the frozen custard was here, a few of us went to go grab some for a whimsical snack. The location is a wee bit off the strip and the appearance of the establishment might be a little inconspicuous, but the deliciousness that is frozen custard makes it worth it to make the trip. This was one of the many highlights on my recent trip to Vegas.\n\nThere were four flavors to pick from and we got to taste a sample of the Almond Chip. This flavor had a good taste without having too much almond flavor and there were real chocolate chips mixed in. My friend who recommended the place suggested Vanilla over Almond Chip. So I took her word for it and got a single scoop of Vanilla. After that first bite I was glad I listened to my friend. You can't tell that it's custard and it tastes like ice cream. The texture is a little creamier and it doesn't melt that fast. It's the perfect consistency between yogurt, gelato, and ice cream. The single scoop was enough to hit the spot, but not make me feel like it was too much.\n\nI think the man who served us was the owner... he may come off as a little serious at first, but he provided nice service. Next time I'm in Vegas I would probably venture out to make a stop here again.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2010-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "93eDBjOBiSvgJKLX40jrgQ", "review_id": "RM4vqnETdURjYR5AUtpOyQ", "text": "Pretty much a classic, well made walk up custard stand. Great tasting and fresh made every couple of hours. I had their maple walnut custard and added hot caramel and salty pecans- heaven!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2011-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ikf6HMvFlXMEJLW4HH-tFw", "review_id": "VYJjZKFNtKvbdCQ7A79NFQ", "text": "I had amazing custard at the Green Valley Ranch buffet. From then on, I became obsessed with finding custard. \n\nLet's just say I was not impressed and I've been on more than one occasion, and have tried a few flavors.\n\nIt's cold and sweet so it's impossible to be bad, but it just doesn't taste like custard. It tastes like something you can get from the freezer section. \n\nI've tried three flavors.. Chocolate - Nothing special. Coffee Chip - Coffee part was okay, but the chips were crazy bitter. Mint Chip - Underwhelming.\n\nI've been a few times. There's a million places I'd rather go besides here, but I'm not saying I'd never go again if I was in the neighborhood. It's just ok... and overpriced!\n\nHave cash if you go.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 2, "date": "2011-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UVeWVoi9RvgH1WLgrzI6pA", "review_id": "AFqYc6aqT78SQNeydN3iuQ", "text": "Took the family here because we saw great reviews on Yelp. It was definitely worth the drive up the strip. I think this place will be on our list of stops every time we come to Vegas.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2011-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-oTBPHzif6mUpj6KggLi9A", "review_id": "uogJKtxfb0uKY13AwaNXEw", "text": "Luv Its has been around the valley for 30+ years. You dont stay in business with a bad product thats for sure... and Luv Its has mastered the custard game !!!\n\nIts smooth, it's thick, it's creamy... everything I want and NEED in a custard. In addition to that they have some very wonderful creations such as my personal favorite, the banana split. You get a whole banana with strawberrys, peanuts and just for fun they add in marshmallow fluff... \nThats personally what I call love !! \n\nI've been coming here for years and will continue to come many more.. I Love It..", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2011-09-11", "type": "review"}
{"votes": {"funny": 4, "useful": 3, "cool": 2}, "user_id": "Ly72PZoHkGZUVWgLH8W2-A", "review_id": "jIdiQXcBJ8lnJ1uVbvD2Yw", "text": "I am such a traitor.  I've betrayed Nielsen's Frozen Custard, which is from my hometown, and...I liked it!\n\nUnlike squeaky-clean Nielsen's, Luv-It is so confident in their frozen custard abilities that they just don't give a f*&# about their customers' comfort!\n\nDon't have any cash?  Too bad, go home.  Want seating?  Go sit on the crackhead in the alley.  Afraid of being knifed?  Suck it up.  Luv-It just doesn't care!  \n\nWhile Luv-It doesn't have the amazing Nielsen concrete (truly amazing), they do have awesome sundaes.  My favorites are the western sundae (caramel, hot fudge, vanilla custard, and toasted pecans) and Luv-It sundae (toasted pecans, strawberries, vanilla custard, and a cherry on top).  Their sundaes are the best in LV, in my opinion, and should be tried.\n\nI look forward to betraying Nielsen's many times in the future.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2011-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jINbhO0tD7505n_FxmOnhQ", "review_id": "ao-XTFVAVl2OV1cZ1iFh3g", "text": "4.5 stars. Finally tried it. And I am a fan. \nThe first and last time I had frozen custard was in Milwaukee, the \"custard capital of the world\" and must admit that this was way better than anything I had there.  It is definitely a hidden gem and I love the fact that this little humble stand has stood the test of time since 1973.  \n\nSince I love caramel, hot fudge, and pecans- I had to order the Western, and now I know why it is their #1 seller.  It is definitely delicious.  I am salivating just thinking about the creaminess of the custard and, the salty, sweet, and crunchy toppings.  I ordered a junior strawberry for my daughter and she loved it, but then again- she loves anything pink.  \n\nSince it is autumn, I see that Pumpkin is on their \"flavor of the day\" calendar.  I must definitely go back and try it, that is- if I can restrain myself from ordering the Western again. I am just grateful I don't live nearby and am not in that area often, because I would have it for dessert EVERY day.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2011-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7lyD5Bw7oSWki2VjlCfP6g", "review_id": "ezknL7fdCFgFRdCAwDp6ew", "text": "Great stuff, can be described as a creamier ice cream.  Not entirely distinct in taste compared to a thick soft serve ice cream, but the slight difference is worth the visit.  We had the vanilla frozen custard topped with pecans and strawberries, simply delicious!!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2011-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tpnBrPrDrf2ahLGsFr2Rig", "review_id": "Fqj8p0aOpwMn3EiOQcIsjQ", "text": "I agree with the Yelper who suggested getting the frozen custard without all the overly sweet toppings... It's better to me that way.\nHuge servings! Boy this isn't on my diet but who cares?\nReally scary liquor store next door. Drunk homeless men yelling at us for money. Don't go alone!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 3, "date": "2011-10-16", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 3}, "user_id": "-IbF8EUP-HWH4_bFxmIXnw", "review_id": "5rSVAFcGMQheBGXeZeFnrw", "text": "If you haven't tried Luv-It Frozen Custard, you haven't lived in Vegas.  This is by far the GREATEST dessert place in town!\n\nIt's a blue hole-in-the-wall type place on Oakey near the Stratosphere.  Their custard is made FRESH every day.  The flavor is rich, and the texture is just mesmerizing.\n\nThis is NOT cheap, sugar coated, commercialized ice cream.  This is the real deal, folks.  You can really taste the quality.\n\nThe owner and his family are very humble about their business.  They don't have a paid PR team running around tooting their horn like other restaurants that aren't even that great (*cough* five guys *cough*).  They know their product is good, and so they just want genuine, honest customers who are there because of good WOM referral.\n\nIf only they could open another shop near Henderson, that would be most excellent for me and everyone else that side of town. :o)", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2011-10-21", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "qFIHXqTwb-h7uIumAuT7Pg", "review_id": "BjLZHAFH2EA0Ruw-cVEhiA", "text": "SO. GOOD.! According to LV's own, the Killers' singer Brandon Flowers, this is \"the best frozen custard in Vegas.\" \n\nThese are his exact words when interviewed by Spin magazine: \n\n---\"[BF:] Dude, we should get custard!\" \"Custard,\" [drummer] Vannucii seconds. \"Do you like Custard?\" Flowers asks me. \"I've never had it.\" \"Oh, man. He's never had custard, for hell's sake! We gotta go to Luv Its. It's the best frozen custard in Vegas.\" Our driver navigates down East Oakley Boulevard toward a wood-paneled shack almost hidden from the main drag. \"I'm so happy! I can't believe we're here,\" Flowers says, smiling. So we eat custard, eggy and rich.--\n\nIf a world-famous rock star born in Vegas loves it, you know you will too. \n\nhttp://thesponge-dani.blogspot.com/2011/10/victims-pilgrimage-killers-fans-guide.html", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2011-10-22", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "C1cv0JYSBCJ-Qw4zX6ZUoA", "review_id": "d5V4KdImJEjn3ip4lYMekA", "text": "Been hearing about this place since I moved to Sin City, finally made the effort to go even though it's only about 2 blocks from where I live.  Shame on me.  What I've been missing!  \n\nDenser, less sweet and filled with whole goodness of what ice cream should be.  I'm making my way through the 'sundae' menu and always happily consume every ounce of this wonderful product every time I go.\n\nNow you will hear and read about the sketchy neighborhood, but we've had no problems so far and have never felt like we were in any danger of any kind.  Maybe it's my NYC roots, but a it takes more than a couple of panhandlers to scare this chick away.  Craig Ferguson had it right that this is a must when in Vegas, don't let the paranoid rantings of some Valley Girl wannabe starlet keep you away.  Parked in the lot and standing on line you will see families patiently waiting for the just reward of digging into this wonderful dessert.  But take greenbacks, cause no cards are accepted.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2011-10-23", "type": "review"}
