{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vGI3dbg5zFRXBg4eVVmGSg", "review_id": "e2YxtsZJE3w6DdNP8yMs7w", "text": "Ive pretty much been eating at various Kings' pretty regularly since I was a child when my parents would take my sister and I into the Fox Chapel location often.  Lately me and my girl have been visiting the Heidelburg location. I love the food, it really tastes homemade, much like something a grandmother would make, complete with gobs of butter and side dishes. Prices are low, selection is great, but dont expect fine dining by any means. \n\nService is hit or miss at pretty much all of them; if you have lunch at any Kings, you will likely be waited on by a sweet but sarcastic  older lady who has been doing the waiting thing for 30 years and knows her game. Seek out this lady.  My experience with the younger crowd at night isnt the same.\n\nIm in my 30s now, and very little has changed, other than the Fox Chapel location was remodeled about 10 years ago to look less like a diner, which was a big fail.  Any girl I meet has to enjoy Kings or she's out.", "business_id": "wJr6kSA5dchdgOdwH6dZ2w", "stars": 4, "date": "2010-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "DLu1Bum8EXNE62xno-v0VA", "review_id": "a5FZ3U8jZh9ToU9oOJJ7gA", "text": "I don't write fast food reviews often, because I don't really see the point. By definition they aren't fine dining and there usually isn't much of a reason to leave a rave review. So when I do review fast food joints, it's because they're extremely bad at what they do - and this Wendy's location is a prime example of that.\n\nThis spot used to be ok enough. I remember coming by with my family and having no serious problems getting a quick bite at all. These days, though, the staff definitely don't have their act together, and I guess management doesn't want to tell them so. I can't remember the last time I got out of their drive-thru lane in under 15 minutes. At first I thought maybe it was a fluke. Now it's become a long-term occurrence. The last time I came, they had the audacity to say \"We'll be with you in just a moment\" - twice! - and they left me hanging. Each. Time. I ended up staying just to see if they even remembered I was there. They did, after I sat so long that it would have been too long a wait at a sit-down restaurant, let alone in a fast food drive-thru line.\n\nThe only reason I keep coming here is because their food at least meets Wendy's standards and gives me something to keep me going between my appointments throughout the day. But based on other reviews, even this isn't always the case. Get in the line here at your own risk. Don't expect much. In fact, skip it altogether if you can, until other visitors can confirm that you won't wait as long as we currently do for our \"fast\" snacks and meals.", "business_id": "m0QsJDntW1MrWCxBVFwuAg", "stars": 2, "date": "2015-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "eiR1HVpLc_MhGmENZYfkEw", "review_id": "dyIP0AnTanze3bPh_me-hg", "text": "Everyone's commentrs about this unpretentious pub style restaurant are understated.  When you approach the corner location your iniotial reaction is that this must be the wrong address.  Keep the faith !!\nOnce inside the people are friendly, whth all sorts and ages of people.   The service is supurb and the food is incredible.  The hamburger is the best one I have had in my 50+  years of being a hamburger lover.  The dry blue cheese bacon burger has no peer.  The Chicken salad is the best my daughter has ever had.  The mushrooms in garlic butter are habit forming.\nWe cannot believe what a jewel this is and the pleasure you get eating their fine food !!!  You must not miss it !!", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 5, "date": "2007-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rqD_rUDQ0pY4cPYvzMw90w", "review_id": "IH7kxdHKVKuXQcXHLkcYEw", "text": "Food here is ok but they have huge portions and decent prices.  Service was a little slow Saturday Morning but they were nice.  They also made sure that you burgers were to your liking and didn't assume that I wanted Mayo.  The home fries however weren't as good and tasted like boiled potatoes that were greasy.  But you do have the option of getting Cole slaw,  potato salad or even rice or veggies instead of the home fries.  Overall I would come back if I were in the area and had a big appetite.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 3, "date": "2010-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "le_2l2HaHkR6jLjWK3vYGQ", "review_id": "c2mQ7IlM5BWkn1FzdLDcbw", "text": "Finally made it to Tessaro's with my husband and another couple.  It truly does have the best burgers ever!  We all got burgers;  2 cheeseburgers and 2 Kelly burgers.  Absolutely delicious!  The guys got chile as well and it was very good...rich and tomatoey and very well seasoned.  The burgers were cooked to order and were great.  Our waitress, Jessica, was very kind and helpful and was a great server!  We will definitely be going back!", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 5, "date": "2014-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "D1G8W0SgCbsKTv7cAqKcNg", "review_id": "uR1Ri-qD8IoF3tawakLXVA", "text": "3.5 stars. Had dinner at Tessaro's recently on a random Wednesday night and it was super busy.  Luckily we didn't have to wait long and were seated soon as they could clean off a table.  \n\nI ordered the Cajun burger (medium well) with American cheese and all the fixins.  I got the potato salad as a side after reading the rave reviews about it.  While I wasn't too fond of the potato salad (I rarely am) I did enjoy the burger.  Although I was disappointed that it didn't have more of a Cajun flavor to it.  There were some bites that snapped back with spiciness but for the most part I couldn't get much Cajun flavor.  I really enjoyed the charred bites of the burger...some folks may not really appreciate this and it wasn't overwhelming, if it was I probably wouldn't have liked it.  But overall it reminded me of a great burger cooked at a BBQ!   \n\nOne thing I didn't realize is all the fixins come on the side for you to put on it such as the pickles, mustard, ketchup, mayo...it worked out though since I wanted a little of each.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 4, "date": "2015-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MXShUisXANLgVqsSFDYPBA", "review_id": "WKCNgNBz4E-JuPHKewNcNA", "text": "Love the baconator. Service is top notch and quick. fry recipe isn't my favorite but a lot of people like it", "business_id": "EZrCQtZxiEo1kkAYt2EQqw", "stars": 4, "date": "2015-11-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 3}, "user_id": "DnO7GbZe0zGI_zKUdFxd4g", "review_id": "ifIH9QdksjAWctIF4pAUag", "text": "really good dogs and burgers!", "business_id": "gpCtDCSXIoQx70cq9itfNA", "stars": 4, "date": "2012-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MSy3VaBL8mdEm27gpa7lHw", "review_id": "srUYP7x-5a2OvyurMdseIQ", "text": "Amazing cheesesteaks, burgers, friendly people, and their ranch is top notch.  Shout out to the Balsley family for running an amazing Food & Wine business for nearly 40 years!", "business_id": "nkNdTqpv1m5GBKx8xrpluw", "stars": 5, "date": "2011-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "qSfnwZ1GF0_WlkVVJmY2rg", "review_id": "81oNLfDGg6Ii2UTvMDBQpQ", "text": "The inside is what sets this McDonald's apart. No point talking about the food, y'all know what to expect. But what is unexpected is that there is a player piano in the front downstairs tinkling pleasant quasi-classical tunes. \n\nUp the circular staircase upstairs is wi-fi and cable news on a big screen at a tolerable level. People were set up with their laptops and the overall effect was really manageable. I rarely ever want to go IN to a fast-food place because the environment is usually such a turn-off, but this location is a nice alternative. Unlike a previous reviewer, I found the place to be quite clean and this was at a very busy lunch time. \n\nGetting in is a bit of a trial as you have to cross through the drive-through line and the people in their cars are not really looking out for pedestrians.\n\nI'd return here for a place to linger a bit, which is a shocker when I think about it.", "business_id": "4kM-mP7z1nP015R2Tlz1Tw", "stars": 3, "date": "2010-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sNbWq4QnL802UV5mSTTD2g", "review_id": "kyAl-kN7WzjfG2EcViQwfg", "text": "I love this place. This is a great place for breakfast. I never got to try any other meals here, but the grits with cheesy eggs were delicious. The prices are very cheap.", "business_id": "pvaUE-Cmg6k37GQ-LluOLw", "stars": 5, "date": "2015-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tbXk1CBHmA74RoToOPEGIQ", "review_id": "iH1Cd0wsCyhWDcc1P-1NRQ", "text": "Service isn't the greatest. If you don't drink beer, drink specials can be somewhat lacking as well. Food is usually pretty good. Nachos are awesome. Wings are great. The pizza is always good too. The lunch buffet isn't a bad deal. Lots of TVs and a nice outdoor area.", "business_id": "3xdV-7di_YD3MVqs3Pa7-g", "stars": 3, "date": "2013-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_xf2ECTRftPV4bzK4mGYEg", "review_id": "LFmGd7MWHPdXxx0MqNc1Eg", "text": "Great little bar, friendly bartenders (unlike the *other* Spartan- ahem!) and super pizza.  A little on the smoky side, except for a one-day-per week smoke free Saturday, so time your visits accordingly.  Decor in the restaurant could use some updating, but it's a small-town family owned joint that is what it is....", "business_id": "zOc8lbjViUZajbY7M0aUCQ", "stars": 3, "date": "2009-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rXiiwnbL7bbmrLpLwL4RtA", "review_id": "IYPV7bzRrR7j0J4ATG0AOQ", "text": "Stopped around 4:00pm today on my way home.  Haven't had a burger from there in a long time.  Just as good as I remember.  And the ladies that were in the drive thru were very pleasant also!\n\nThanks!!!", "business_id": "HGzdDbukK8RJEc623kLz5Q", "stars": 5, "date": "2015-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q75MUoAeRv18TgvIba3naw", "review_id": "WT8Ju1Bin7ipL8dkMXVELA", "text": "The Players club is the BEST!!!! Wendy, the bartender, is the bomb!!!!! Definitely the best burgers ever!!!  Love love love this crew!!! It's a must do if you are in Madison!!!", "business_id": "YlznKuAxnd7j3QfXFzoIog", "stars": 5, "date": "2015-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5XQw3XSU7BFYocUVsflcaQ", "review_id": "ud-PLNH9tEFshTS_j9mWJA", "text": "Typical burger and beer place.  Food is pretty good.  Service was great!", "business_id": "4pZeC9W0EIiBTOJMnwG2vw", "stars": 3, "date": "2013-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "qXiN4Gi9N0FOeQYoeiWU8g", "review_id": "XkmWUy-HwpaNXSmjwg1z4A", "text": "People are generally pretty excited about \"half-price burger days\" which seems to happen multiple days a week... In my opinion, the burgers are overpriced to begin with and I'm not sure why anyone would visit here if it wasn't A. \"half-price burger\" day or B. you're just trying to get sloshed with some homies. \n\nI've been here a few times and tried their burgers. They're alright. The mac n' cheese side is an upcharge, but it's pretty good, very heavy. Recently, I ordered a veggie burger with no bun (not about to waste my carbs budget on some basic ass bun, ja feel?) and the whole bottom of the burger was burnt and seemed to have something stuck to underside of it. I'm guessing the grill just hadn't been cleaned in a while...\n\nIf you want a good burger, go to Seven Saints or Destihl. If you're more of looking for a place with a college atmosphere, come on in. This place feels just like your local frat house.", "business_id": "1T2rnvl67Gk9Uc0gzsCKQA", "stars": 2, "date": "2015-10-01", "type": "review"}
{"votes": {"funny": 9, "useful": 4, "cool": 5}, "user_id": "JkMOQaMjlBHMqp6gj-hL3w", "review_id": "3PYedsPSFPnrSh7uzpm_Nw", "text": "I only come here to get their 99 cent bags of ice that are advertised all over their outside windows. \n\nUnfortunately, out of 6 visits they have only had the bagged ice once. Why??? And offering me a large cup of ice for the same price is not gonna make me happy Mr. Manager. Just bag that ice up....", "business_id": "xH5axHFadmc7Veutt376TA", "stars": 2, "date": "2011-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4D4UzEOu-QG4-jkyfynhPQ", "review_id": "tu0HJKlMvxljNlDtOurk_Q", "text": "Was grocery shopping for dinner and somehow ended up here instead...\nOur host was very nice and sat us immediately after walking in, he also informed us on drink specials. It is a bit loud here but not as loud as the camelback/central location :) \nI was thinking of ordering a drink but opted for water instead just because.\nWe decided on the 2-4-24 and chose boneless wings as our appetizer. I think Applebee's wing's are just OK compared to other places, the sauce just doesn't do it for me but I'll eat them \nFor my entree I decided on the double crunch shrimp with fries \nWow, they give you at least 18 pieces of shrimp and I am like trying to eat... Unless they're trying to say something haha \nI'm taking some home\nThe shrimp is good itself with the sauce on the side", "business_id": "hzUOqxpcnYYBgLlrgvjQYQ", "stars": 3, "date": "2013-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eNWLOxMZym8m__63CwDiOA", "review_id": "jCcYNgBBKjzkoWah38n1zA", "text": "Every time I go here, I order the same thing. A junior cheeseburger with a cesar side salad. Every time I get the wrong items. I'm getting real tired of it. I've worked the drive thru at fast food places. It's seriously not that hard. Come on people....", "business_id": "g4Eit1EeeEGhTVik6AWYsA", "stars": 1, "date": "2014-09-27", "type": "review"}
{"votes": {"funny": 15, "useful": 5, "cool": 6}, "user_id": "oC0kwGvgaAeT3ZIxdxTcJA", "review_id": "5VVDOe9wMKhqPu17ZApdZg", "text": "If I ever want to be reminded what kind of asshole I am, I just need to reread this review and I'll know. \n\nWhy is this the review that will serve as this reminder when I have so many Yelps explaining so much about that already? Well:\n\nI went here on an anthropological adventure. I'd heard the regulars were noteworthy in a Bikinesque fashion. That they're scary and funny and local and Cheersish... And that everything takes forever. And that everything is average but that it's the combination of the preceding factors that make this place worthy of one adventure to see how the other half live in their natural habitat.\n\nWe walked in and were IMMEDIATELY, like within seconds, greeted by a drunken song. A man and a song and a twinkle in his eye and I was immediately charmed. \n\nI was expecting it to smell very strong, especially since they sell cigarettes in the vending machines, but really there was no noteworthy odor. \n\nThe bartender was high or drunk. If she was not high or drunk, she's spent so much time in her life being either high or drunk that she now gives off a permadrunkenhigh vibe. For instance, she takes our drink orders and says, \"Want menus?\" and then walks away and re-asks us our order, which was a pitcher of beer. And then does not ever bring menus. Glazed eyes. I don't give a fuck ethos. \n\nAMF is on the menu, which I had to be reminded stands for adios mother fucker, which is just basically telling the drinker that this particular night will not be one they should bother trying to remember. Here, I could make some grand (albeit stupid) statement about how this is exactly the type of place people come to forget, but I don't think that's true considering I was the only one drinking them. \n\nThe one gentleman we interacted with was so desperately lonely that he clung to every vestige of a chance of an opportunity to insert himself in our convo and I felt deep sympathy for him. \n\nAll and all, I can't see any reason to ever go back but I'm glad I went and that it exists. It serves a need. It serves a population. It offers an opportunity for snobby a-holes to have a place to go on \"anthropological journeys.\" \n\nApparently, they put wine in their burgers if you're into that...", "business_id": "ntJAKLAq0cXzzdFgPoo0Iw", "stars": 5, "date": "2013-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "g7xgXF_nAhXRwFZa5gvmcw", "review_id": "nToN_RexblRv6qrerzCX4g", "text": "Been coming here for years and probably will be coming here for years ahead. But it kind of sucks there juke box is broken and all they play is country music. Countries ok once in awhile the tears in your beer for 4 hours straight is ridiculous great burgers and cheap beer but they can take that country music and do something else with it", "business_id": "ntJAKLAq0cXzzdFgPoo0Iw", "stars": 2, "date": "2015-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "NtOVhVdb27aw2bFQ9_ANHw", "review_id": "fqJhH5j0sUHDbYGgF_Ye-w", "text": "Best wings ever!!!! There is no place that can stand near this place for wings.", "business_id": "qz4ZOcv-840UjfCEYI4qZg", "stars": 5, "date": "2009-10-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "KmbnwPNzQuQ7SpSnQaHmyw", "review_id": "kKIXdbuYnaYKb4YjvNnYUg", "text": "This is literally the best bar I've been to in Phoenix. It's a small neighborhood dive bar. We started out with jalapeño poppers which were delicious. Top notch. We then had the double dipped \"works\" grilled wings. I consider myself a wing connoisseur and these were the best I've ever had! Also, even though it's a dive bar they have the nicest restrooms I've ever seen and I'm a bit of toilet connoisseur if I do say so myself..... The bartender did a great job. She handled the whole bar by herself.", "business_id": "qz4ZOcv-840UjfCEYI4qZg", "stars": 5, "date": "2015-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "R9n2K6acBRqMjLVCUxgfOw", "review_id": "aNFReciPCpOIxSnd2Xa7Vg", "text": "Other than Ted's Hot Dogs in Tempe, not many foods have transferred well from the East to AZ , but this one has. This hole in wall has captured the greasy but delicious tastes that elude most places down here. \nThe place was packed on a Saturday at 4:30 so you know they're good. \n\nI got the Italian beef which was tender and piled high on a hoagy roll with peppers and onions. Yum!\nAnd my wife got a dozen wings. Half BBQ, half medium. They were flavored as wings should be.. spicy sweet BBQ, Franks hot sauce and butter for the mediums... and were really big. No bleu cheese dressing for dipping though. Only Ranch.\n\nPrices are cheap. \nService is painfully slow. \nThey need a bigger parking lot.", "business_id": "iNvY0zAlaD_ye7Z6rHu-Ug", "stars": 4, "date": "2011-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "32nOoYH8paK_Bbvl2VjaHg", "review_id": "PjnI-_xNbeNOCknT-zcekg", "text": "One word...SLIDERS!!!!!!! Absolutely the best. You can't just have one!", "business_id": "iNvY0zAlaD_ye7Z6rHu-Ug", "stars": 5, "date": "2014-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I-hwyneMCFI1MTQBB8abFg", "review_id": "cDgeyJPC54CSlf-nNyNQkw", "text": "Although I'm a great fan of Arby's roast beef I have to honestly say that the apple crisp was one of the worst tasting things I have ever eaten at Arby's.", "business_id": "i8X14GDzaYD_TOGeWjmv-A", "stars": 5, "date": "2014-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VO-AemelxZi83yS0FYvKIA", "review_id": "Hfcl2Yr4NH7ZjfwlReDYjg", "text": "Since the departure of Taste of Philadelphia at 32nd and Camelback years ago this has been one of the only quality spots in Phoenix for a cheesesteak.  Personally, I've never ordered anything BUT a cheesesteak but my wife says the Uncle Sam's Special sandwich is awesome.  They have several locations, but I'm partial to the 32nd and Shea store for some reason.  It just has that slightly dingy feel that makes the steaks taste that much better.  The waitresses in knee socks and cheer skirts don't suck either.  Only thing missing is a full bar.", "business_id": "lf42gtgq_2_jPvjfp_K1nQ", "stars": 4, "date": "2009-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hd3BHvFC0FFYj_Qh8d43MA", "review_id": "pq92ucfHPraKY1L9jReIAA", "text": "I have been a regular of this place since they opened. When they were at Shea and the 101 I was always there. Since that location closed I now have returned to this location. If you are looking for fancy then skip this place. It is very casual, overall the service is good and I think recently there are some new cooks as the pizza crust has been exceptional. extremely reasonable prices, delicious, meaty wings and drummers, tasty cheese steaks on great rolls. Now if they would just get rid of the Pepsi and replace it with Coke they would be stellar. great place for kids too.", "business_id": "lf42gtgq_2_jPvjfp_K1nQ", "stars": 5, "date": "2015-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OQbklaUmAUoUCiSlMdptGg", "review_id": "9SE9j8ZGBJMyZm8Dc0yY8A", "text": "17 minutes in the drive thru. 12 of those minutes after I  paid. I ordered a sausage biscuit and a soda at 11:27am. If you can't be prepared for all day breakfast, don't offer it.", "business_id": "41SzC2WJ-RVUpVZ2NJfE-w", "stars": 1, "date": "2015-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bJhbiC0c0kgH3l4k1-XyJA", "review_id": "vgA1TnA-Lobg5BnrsXuGVw", "text": "Ordered the patty melt and some onion rings. The patty melt was amazing. Fast service and great food. The staff was friendly. Will be coming back.", "business_id": "GTVneiUeIyRL8Wa_WmEQ0g", "stars": 4, "date": "2015-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "--4TkB_iDShmg41Y_QW9nw", "review_id": "Bnxr7DlTVIP30Py6Mw8Hvw", "text": "We come to islands every time we are at Desert Ridge, 3 or 4 times a month we eat here. We absolutely love there service, food, and atmosphere. Everyone is so wonderful! LOVE the hamburgers , and the chips and salsa are to die for especially the guacamole. we have tried all the food and no complaints! we are sad about the pv island, they need to open more.", "business_id": "e0vubCKi8KD8zC2C6FdbuQ", "stars": 5, "date": "2014-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aUv23ZEyaNbqR4_hyKUDwQ", "review_id": "gWmJ0zK4UX-8as56YnN7pQ", "text": "Cruised though the drive-thru on our way to see a movie at the nearby Desert Ridge AMC theater. Typically In-N-Out is quick, delicious, and way better than McD's. Sadly, this was not one of those nights. \n\nWe ordered three burgers, three drinks, and an order of fries for the three of us and requested the orders be placed in separate bags so we could take (smuggle) the food into the movie theater (we were pressed for time and starving, okay?!). The order took longer than usual to pick up at the window and when I asked which was the burger with ketchup and mustard (instead of the \"special sauce\") the server just stared at me blankly and said I should be able to tell. Right, but I was hoping to figure it out before biting into my friend's burger! Thankfully I don't have a food allergy so it wasn't a big deal, but still kinda annoying that our burgers got swapped and we couldn't figure out which was which. \n\nI think I'll stick with my usual In-N-Out in Tempe, thank you!", "business_id": "byFWmwlVSmUj-AmM6NZYvw", "stars": 3, "date": "2013-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Dd9XSj09aVpDI-Clwcmj7w", "review_id": "ReYuyfN4gcveVZ2WNJGuKw", "text": "The food is really good there but the drive thru takes FOREVER. Wow! Not good if you have a short lunch break.\n\nI would recommend getting the bacon avocado burger but it may be faster to just go in, order and leave instead of going through the drive thru.", "business_id": "2qf-0qkDNh7r8iU0498htQ", "stars": 3, "date": "2013-10-17", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "JDS3OQRBq0F4hpKHFCtAqA", "review_id": "TTB5T7iBaK2h0nPJhSpFtg", "text": "I just had to try this place after reading all the positive reviews about it. We went here the other night around 8 P.M. Two of us had breakfast and the other had a burger. Everything was great !! all the reviews were right. You got to try this place out !!!! \nThere was only one couple besides us in the place at this time of the night. Food was very good, lots of it, very reasonably priced. No problem getting breakfast at this time either. Burger looked and was told to be very good. \nWill I be back ?? \nYou betcha !!! I've told my family to give this place a try. \nI only have one question about this place, when we went in, they took our order at the counter and we paid for the food, gave us glasses for self serve drinks, before we even sat down. Is this normal ? They did bring our food to the table. I saw the other couple take their dirty dishes to the counter. Is this normal for this place ? I don't know, but we did the same when we were done. Do you leave a tip ? again I don't know. I didn't notice if the other couple did or not. You usually leave a tip for the service. We left a tip. ( He did bring the food to the table.) But is this normal at this place or was it just because it was late and nobody was there but us. Please let me know.", "business_id": "AoO0FJyUm01lmIJJTcPWEQ", "stars": 5, "date": "2008-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hCPF6c6pCpL-sCHh5FfHww", "review_id": "IRw8QIWwyePc58RgNjujwA", "text": "Giant Burger's food is fantastic. The hamburgers are made with 100% beef and taste homemade. Their garden burger is made with a Boca patty that is grilled to heavenly perfection (you must try it with mushrooms yum!). Whichever burger you choose, it will be freaking huge. Their fries are cooked in canola oil and they are just the right amount of crispy. I had a chocolate shake which was big enough to share but I wouldn't dare share something so amazing. The only thing that bothered me was the hamburger buns. It's like they were steamed. After the bun touches a wet tomato and onion the bread becomes kind of soggy but still edible and delicious. I prefer a grilled bun so I will ask for a grilled bun the next time. Also their shakes are not very thick. However, the shakes do have an exquisite taste and the amount that you get for the price is awesome. Everything is reasonably priced! I'll be back for sure!", "business_id": "AoO0FJyUm01lmIJJTcPWEQ", "stars": 5, "date": "2014-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vlxXm83oGWun_aQT73c8mA", "review_id": "DeXOG7xCMgUOa7m23THpiQ", "text": "It was all right. Better than fast food chains. I was a little concerned with the cleanliness. The bacon was left out at room temperature for I have no idea how long. It was out before I came in, and it was still out when I left 15-20 minutes later. I'm not sure if it was being left on a refrigerated section of their grill (if that's even a possibility), or if they just leave their raw bacon out.", "business_id": "AoO0FJyUm01lmIJJTcPWEQ", "stars": 3, "date": "2015-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5-7Eb7if4LoFOZ9iUHGXNQ", "review_id": "0f5jX6WAiAZIt-hOAUSxNQ", "text": "We go to red Robin frequently but we have never had an  experience turn out the way it did. First off, we wanted 2 different fries, one regular and one parmesan.  We were told that it's only one bottomless friends per 4 people therefore the 2 of us couldn't have that. .. But at any other Red Robin it's fine.  The fries they brought out were barely warm, you could tell they were left under the heat lamp. We ordered mushrooms and mozzarella sticks, the mozzarella sticks were good but the mushrooms weren't cooked right, and the breading on them were gross. Our basket was filled with sauce and then covered with mushrooms to hide that they spilt sauce.  The \"nacho cheese\" for the burger was disgusting and cold, when you think nachos, you don't think cold sauce. The burger didn't taste good either and usually they are fine. For some reason this Red Robin isn't good. I don't recommend going to this one, save your money.", "business_id": "-GYx5GAx_-4XEsn7mFwdkA", "stars": 1, "date": "2015-09-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "uFXrezdNbph5QbmvYVmhEA", "review_id": "SFSC-N8riTHwqVte0cMiKw", "text": "Went here yesterday and they forgot my 99 cent chicken nugget. I called and the manager said sorry and then put me down for a free 12 piece chicken nugget and frosty. He made the whole trip 100% better for me. Also every time I drive thru they always get my special requests right. This is also the first time they have ever forgotten food. When I go thru they always pet my dog and are social. I enjoy coming here.", "business_id": "BRaQrgYVR17bd_zr-wNSlQ", "stars": 5, "date": "2012-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G2T6w8CzY8a5d81cXcFXJg", "review_id": "wwPq7zlYGgBxLToAXJZILQ", "text": "Apparently this location is gremlin friendly, cause after midnight they don't serve you; unless you have cash. Sure, gizmo is happy, but no one else is. What kind of huge fast food chain doesn't accept a debit card!? A communist one, that's who. They like to brag about all day breakfast, but only with exact change and a polka dance to go with it. Absolutely ridiculous establishment.", "business_id": "z6V7Mb0fjHo_JT3l7dCKsA", "stars": 1, "date": "2015-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vzx_IGxrFF7czNu0OVz_oA", "review_id": "K1i5ZYs8GLAYqnoppGHqvQ", "text": "Table had a glass and receipt from previous gues on it when I sat down,  waitress was \"going to get that in just a minute.\"  She never did.  Burger was HORRIBLY overcooked!!  I had 2 bites left by the time she finally came back around.  Service was slow-  would not reccomend", "business_id": "zoHCkEiIKfXiLTKUqKEojQ", "stars": 1, "date": "2015-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "VgdDYz0-i1kDszfEu5nFdg", "review_id": "J6FNRWnIy4E8xxTAMy1t8Q", "text": "I got the Jack Not Jill sandwich.  Maybe it was my fault for changing the hamburger bun out to wheat toast but, this sandwich was very lackluster.  The fries were soggy and not crisp at all.  I won't be rushing back and, if I did go back I would definitely order something different.", "business_id": "7-4FxYXhNUS2lhpUb_q5-w", "stars": 2, "date": "2012-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GzT9N7ZTmPZvdH0IHXd_3Q", "review_id": "3Dd7QEx3CCLnsOGTy91X0g", "text": "My brochacho and I decided to watch the Sunday Night Football game here, since it came highly recommended. Peanuts are available on all tables, and you may channel your inner savage by discarding the shells on the floor. The bar feels a bit dank because of these said shells. \n\nI was intrigued by the \"Specialties\" portion of the menu and decided to order a French Dip sandwich. Unfortunately there was nothing special about the sandwich other than the fact it was especially bad. It also was obvious that the fries had been sitting for a while. That being said, the drink specials are awesome - definitely cannot beat a $6 pitcher! They have a few other beverages on their drink-special menu as well.\n\nIf you are looking to watch a game and drink beer, I would recommend this place. I hope the other options on their menu are better than my sandwich! Order at your own discretion.", "business_id": "7-4FxYXhNUS2lhpUb_q5-w", "stars": 3, "date": "2015-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jsigTj5jwrIjktN_5SI4Vw", "review_id": "Khk98B3De2lelh1KrE34oQ", "text": "For some reason I feel compelled to praise this Wendy's location.\n\nThe staff here has their sh*t together! I come here for lunch usually once sometimes twice a week, orders are prompt, friendly and never any errors (driver-thru), EVER! I've never been to a fast food location that has never made a mistake on an order, except for this location. I can tell my selection is made-to-order and made consistent! Great job to all the hard workers here!", "business_id": "BkRnVd0B3y7Nd3VoIvn99w", "stars": 5, "date": "2015-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CuVTy-_S1IknzeUzow_B3A", "review_id": "TXjTTDJxJPT15gNVq9ZuOg", "text": "Don't listen to any naysayers, this is a good, local restaurant. I like it because every time I eat there, I can get something different and it always hits the spot. The Philly sandwich is tasty, as well as the prickly pear chicken one. Finally tried the pizza and wings and those are great too. Service has always been great and have never had a problem here.", "business_id": "JMOK_Sy6aSOZwd4qgkX7hg", "stars": 4, "date": "2013-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5XZ9gYbA-L4GXWQlMtftjQ", "review_id": "Xq8gutgBjnUE-Q6v9EnR8Q", "text": "My first visit - the chicken nuggets were dry and they forgot the sauce. Sauce might have made them edible but without the sauce, they were so dry, they were inedible.\nMy second visit a week later, the girl had a bad attitude and did not listen to my order. I specified no salt on the french fries and no ketchup on the burger. When I picked up my order, I asked her if there was no salt on the fries and no ketchup on the burger because it wasn't written on the receipt. She accused me of not saying I didn't want salt. I had to wait again for both items to be redone. Notice that there was nobody else in the restaurant. When the redo was done, I asked for the honey mustard sauce. She played games with me. She didn't want to give it to me. After practically arguing with her for several minutes and her attempts to give me plain mustard, that I do not like nor eat, she finally gave me what I asked for.  She was not pleasant about it.  She was also inappropriately dressed with tight leggings too long for her, all hiked up and no skirt, no long shirt, no tunic, nothing covering the leggings, just bare sloppy leggings.  She looked dreadful and her attitude sucked.  It was my second visit and I won't go back, except for freebies that come in the mail.  I don't care to be treated like that and when only one couple came in while I was waiting for my order, I would hate to think how she would handle herself in a busy restaurant. She had a long name that started with C.  I couldn't read it because she kept turning around. How this girl retains this job when she is so miserable to people, doesn't smile, doesn't say thank you - is beyond me.\nI let their head office know.  They care.  I was promptly emailed back and asked for more details.  I was told they want to fix the problem.  I suppose it takes a while to weed out bad employees.  I have no idea how long this girl worked there but, I am glad they plan on fixing the problem.", "business_id": "VsgXwpFdqbUaYP5PCQzeoQ", "stars": 1, "date": "2013-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZaK1QecJXJCuFRIC2Xi4Hg", "review_id": "kCA9oun95496cgJV93hLiw", "text": "I've been going to arena sports grill for years and have never been disappointed with the food nor service. Great sports bar and place to hang out to watch some Sunday night football.", "business_id": "_TWT58PWunYIyPgpz1fuog", "stars": 4, "date": "2014-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nQsgNZwL9IaU2zUIbSaGnw", "review_id": "JIS0sp8tnBEvuJWDL82zMA", "text": "If I could leave negative stars, I would.  I don't always leave bad reviews, but when I do, they're horrendous and my intention is to bring this to light to upper management.  \n\nI have NEVER in my life experienced worse customer service at a fast food place than I did last night.  An order of tacos, curly fries, ketchup and ranch.  Easy right? We know everyone's guilty pleasure is jack in the box tacos dipped in their delicious ranch sauce.  \n\nUsed the \"convenient\" drive through, the lady working the drive through must have been having a really crappy day based on her attitude.  I get the food in a couple bags and leave.  \n\nOnly to arrive home and found that for some reason, they interpreted my \"curly fries, ketchup, and ranch\" request to mean cold plain fries, and loads of taco sauce. \n\nDinner was ruined.  I called the store and spoke with someone named Hector.  He refused to let me speak with the manager.  He also refused to give me information on whom to contact if I had a complaint.  Hector didn't really do all that much for me except hang up on me and tell me that If I wanted to complain, I'd have to call back Wednesday morning at 8 AM.  \n\nworst part?  Hector didn't even ask what my issue was.  He displayed zero willingness to help and of course, an apology was out of the question.  \n\nHector's poor disposition and suffering customer service skils have led me to write a better business bureau complaint.. all over ketchup, curly fries, and ranch dressing.\n\nI really hope it was worth it to you, Hector.  Here's some insider advice though.  NEVER let a customer walk away angry.  If you are in a position of power to fix a situation and avoid a negative escalation, do it.  Since Hector clearly skipped class in any managerial courses he may have taken at the community college, he could use this advice.  \n\nIt could have been corrected.  With an offer to come back to the store another day and have the order made correctly.  Hector, this could h ave been corrected with a simple apology.  Your lack of initiative has caused me to start the hike up the corporate ladder of jack in the box.  This was an embarassment to you and the entire jack in the box franchise.\n\nNeedless to say, \nI will not be returning here.", "business_id": "KyLmGuB-EjpeliQO-Qu9Kw", "stars": 1, "date": "2014-09-17", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "-EyEj5BujVFisco6OwmR8A", "review_id": "kxA8dkO8fQby82DH8gptFA", "text": "I usually would think one Burger King is the same as the next but....wow....this place was terrible! I got a coupon in the mail and saw they have a new chicken parm sandwich and I was in a hurry so I decided what the hell. After I ordered and I got to the window, the woman at the window didn't even acknowledge me. After a few minutes, she told me my total, I paid, she gave me my food and closed the window. Never heard another word after my total. That should have been an indication of what my food was going to be like. When I pulled up to the end of the drive thru, I opened my bag, unwrapped my sandwich and thought the bread was a bit cold. I took a bite into my sandwich only to find that bun was slightly frozen, the marinara sauce cold, the cheese frozen and the chicken lukewarm at best!  I put the car in reverse, went to the window and waited. The same woman opened the window, didn't say anything to me so I told her about the sandwich. I explained that the sandwich was cold and the cheese was frozen. Her reply?  Well after what seemed like an eternity of silence, her reply was \"no it's not. The cheese is cold though\". I said \"noooo...the sandwich is cold and the bun is a bit frozen still\". After snatching the sandwich out of my hand, she closed the window. A couple minutes later a guy handed me a bag with a new sandwich. Again, no words. Just window opened and then closed. I was afraid to open the bag but I was brave. This time the chicken was hot and everything was cold.  I couldn't even eat it. I just ended up throwing it away. They have lost my business.", "business_id": "iJDzwfZ7qwRMQq4YIm6ERQ", "stars": 1, "date": "2012-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XV9jnQZyx-BvYUy_QJZs7A", "review_id": "UJlk9cjyfTZQwYfFz1NTew", "text": "Stopped in for a shake after a very terrible experience at the Vegas location last weekend. Three different people greeted us. It was so very welcoming. Also, the shake was amazing!", "business_id": "7NN40EKNb_KaqemxxSH8Wg", "stars": 5, "date": "2015-11-04", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "qw-9YLeLbSt8PNrNrXubLQ", "review_id": "peY_4CWLodSnFOtQ8xdaYA", "text": "I had an italian sausage with onions and peppers. Because I was starving, I'd say it was A-OK. Otherwise, it was pretty much a Costco sausage thrown on a charcoal grill, with onions and peppers. Which would be pretty good, actually...plus cheaper and less of a wait. It was good, but edging out Pink's? No way.", "business_id": "jJhNOhuGpIsJX5SEUFFWYQ", "stars": 3, "date": "2009-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FKViOrC8nGcyUH8HNuBFgA", "review_id": "4hbzWvVvF_hBxE9fqLBIsw", "text": "Vegetarians beware! There's not much of interest here for you unless you like a good crispy French Fry. This is a student staple because of the larger portions and rock bottom price (it's practically cheaper than a McDonald's these days). \n\nThere is a ton of cool sporting and Ted's memorabilia on the wooden walls, and the ceiling has these goofy light panels that make it look like the blue sky, except faded from the lights. \n\nThis place is usually jam-packed on the weekends but things move QUICK. The person at the grill usually shouts for your order when you are 3-6 people from the grill, so pay attention! The employees love it when things move like clockwork. \n\nA great place, but usually one I save for a hangover day.", "business_id": "jJhNOhuGpIsJX5SEUFFWYQ", "stars": 4, "date": "2012-09-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "bf6zHWWxLIrget3kiOdBHw", "review_id": "g_v5Ng9qBybfA_6qeRCWvg", "text": "Amazing amazing amazing,  that is not overkill. I am from Buffalo where Teds is a staple,  like 6 locations.  Fearing that the quality would not be up to snuff with the home town originals,  I had not tried this yet.  I kick myself for not going earlier because the quality of the food had carried over from the east coast! Charbroiled goodness..... Amazing brats, burgers,  and fries.  GET THE WHITE HOT SAUSAGE (part Veal, part pork) as it is the best thing on the menu.  Friendly staff and clean dining area.  They have pictures of Buffalo all over which brings me back. If you have not tried Teds you are missing out... Go now,  drop everything and hit the restaurant asap...seriously get on it.  Oh,  by the way I live in Tucson and drive up to Tempe just for lunch at Teds. It's that good.", "business_id": "jJhNOhuGpIsJX5SEUFFWYQ", "stars": 5, "date": "2014-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nL4QufiB7bmRrP-oV14L4Q", "review_id": "AQ9DHivivk6AkIQq909S_A", "text": "Whenever I stop by for lunch, there's always a line.  And you know what long lines mean: delicious, fresh food.  If the line is long (so, closer to the main door), the wait can be about 15-20 minutes, and plenty of time to change your mind from wanting a Brat, or maybe an Italian sounds better, or maybe the White Hot, nah I think I'll try a Sea Dog, or Polish?  No, Italian, yes, an Italian with fries and onion rings?  Just onion rings.  I'm indecisive, if you couldn't tell.  Their most recent addition has been to add mac and cheese on your freshly grilled, and perfectly burnt (in a good way!) hot dog, for an extra 75 cents.  This and chilli, is the most amazing thing ever.  And don't forget to get some cheese on the side!  I might have to start attending cheese-aholic meetings, for the sake of my cholesterol (no, I refuse to see exercise as an option here).\n\nCut to the chase:  My favorite things about this place, the perfectly grilled hot dogs, great choice of toppings (only the cheese, mac and cheese, and chilli are an extra charge), and those Teddy Bars look so good!  Though I've yet to try one.  My only complaint is the wait, but I've noticed that Ted's isn't so busy at dinner.  I hope I didn't just jinx that", "business_id": "jJhNOhuGpIsJX5SEUFFWYQ", "stars": 5, "date": "2014-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q2EusMHCzeu__ExyKAF0eA", "review_id": "OEC1u0HkqGl4JajJUxZkAg", "text": "I have no idea why people wait 30+ minutes for a fast food hotdog. OK, maybe Gene and Jude's (if you've been drinking) but not this place. I keep trying different sausages to see if any of them are any good but they're not. On the other hand, the onion rings are amazing. But no onion ring is worth a 30 minute wait. Open more Portillo's in the Valley!", "business_id": "jJhNOhuGpIsJX5SEUFFWYQ", "stars": 3, "date": "2015-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "adbGzWWooOw2C0mqUic10A", "review_id": "jkgIB8VktdfwNepiasWmsg", "text": "I've been hearing commercials about Red Robin for years, and I have never gone into one until a month or so ago.  Quite honestly, I expected more.  I think their only saving grace is the tower of onion rings, which were tasty, but they weren't worth the price they charge.  My fiance and I ordered our burgers, which definitely were NOT worth the price they charge for them.  Their burgers are flavor-less, and mine was not medium to medium-well cooked as I had asked (it was more along the lines of medium rare....far too pink for my taste).  I know what you're thinking:  did you send it back?  The answer is no, because I didn't want someone to spit in my food for having to re-make it.  When I got the bill, it was almost $50......for two burgers, a tower of onion rings, and two sodas.  I have to be honest, I can get a better burger at In-N-Out, spend far less money, and be completely satisfied.  Want another example of where you can get better burgers?  SmashBurger, Burger King, and Lenny's.  \n\nI definitely will not be coming back to this location, or any of the other ones for that matter.  I even filled out a comment card, someone said they were going to call, but they never did.  I would have given them less than one star, but unfortunately, Yelp doesn't go down that far.  Red Robin, how you are able to stay in business is beyond me.....perhaps it's your booze....who knows.....", "business_id": "x737irkRUs8ABGRc2ILLAA", "stars": 1, "date": "2015-09-05", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "2pewHjH4Le8eNsGswKUc3w", "review_id": "-6U-l4o-qIWVyiTgF3GuZA", "text": "What happened to this place. Use to be good?!?? One word of advise when you tell a customer they are waiting on fries, might wanna give them fresh fries. Not 4 hour old fries. Completely gross learn to lie better if you feel the need to lie.", "business_id": "MBs8A1Zrkd6SYzIplO2wgQ", "stars": 1, "date": "2015-09-17", "type": "review"}
