{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fyRXaDxDXsmBHbJ7Z8OK-w", "review_id": "a1X2uH3sjyzePaDeC1q6wg", "text": "I have a little bit of mechanical knowledge, but not enough to land me a job as a mechanic. I try to do a good bit of my own work to save on the repair bill and to avoid unscrupulous mechanics. \n\nI called a handful of shops to get a quote to replace an exhaust manifold gasket and bolts on my 05 Grand Cherokee. Alan (owner) quoted me $250 per side (I have the 5.7 V8, so there are 2 sides) to fix it. Sure enough, it was $250 out the door. Alan is a great guy that knows his stuff. If it doesn't need to be fixed, he'll tell you it doesn't need to be fixed. BUT, if it does need to be fixed, it really does need fixing. He even checked on a couple of other things and made some recommendations for other specialty shops for projects I plan on doing on this Jeep, which he didn't have to do. \n\nI chose to give Master a shot after my normal go-to shop in Monroeville didn't return my call seeking a quote for the exhaust manifold. Some of the reviews on Google for Master are unfair, with the chief complaint being a misunderstanding of personalities. If you want to question what the mechanic tells you needs to be done, fine. Just make sure you know what you're talking about. If you have zero mechanical knowledge, don't tell the mechanic how to do their job. Alan won't blow smoke up your dress and hold your hand. If you want your car fixed, take it to Master. \n\nThanks again, Alan, for giving me the opportunity to boast on the Jeep forums about only paying $250 for a repair that many have shelled out $1K+ to fix! You're my new go-to shop for our vehicles. \n\n(If you're curious as to their hours, I was there a little after 7AM. They are first come, first serve.) Don't be an idiot and expect your car to be fixed 5 minutes after pulling into the lot. Oh, and don't park in front of the garage doors like a tool!", "business_id": "frIRW4BGhdAWbSsG5ev2ng", "stars": 5, "date": "2014-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tAvaIHz7zUdNr2WOT9-r4g", "review_id": "E8hEP0k1bOJkedU61zmbDg", "text": "This is perhaps the best mechanic shop in Pittsburgh.  It is ran by two brothers and may not look like much but they offer excellent service, honest work and great pricing.  Recently I brought my truck in after another shop said I needed a litany of repairs.  At Bruno's they did only the necessary work and even fixed the ignition switch which had worn out and only charged me for the part.  These guys are great, but they are usually backed up with work so you may have to schedule in advance.", "business_id": "G-PlXGCY3G4zNOUzD61ZDA", "stars": 5, "date": "2012-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "JwWB4PW8BDezHBaLCej-EA", "review_id": "mB0bk6t1kO4UmXMDdysHyQ", "text": "Bruno's is by far the best garage I've ever taken my car to, either here in Pittsburgh or in Los Angeles where I used to live. I drive a 2000 Saab, so believe me, I have A LOT of experience getting my car repaired. The two brothers who own Bruno's are great. They are very knowledgeable, they're very willing to help you and, above all, they're honest, which I've found is a  rare commodity when it comes to mechanics. I cannot possibly recommend Bruno's highly enough.", "business_id": "G-PlXGCY3G4zNOUzD61ZDA", "stars": 5, "date": "2012-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MJ_5gOlCqE2OIZHMhqsaZw", "review_id": "RLN3AZjeps_sWeVtmQmxMA", "text": "It is the best mechanic shop I have been to in Pittsburgh.  I went there every year for inspections and every time my car had a problem.  Absolutely excellent service!! The most valuable things that I have found about this shop is the honesty and great price, as other people mentioned in their reviews.  The brothers who work there are very nice and honest. They are always ready to help.  There are a couple of times when it was just a tiny problem with my car, they fixed my car without charging me, and even refused to take my tip.  They always explained to me what problem my car had, gave me recommendations, and found the least costly way to fix it.  The only thing I wish they could've done better is setting up voicemail function for their phone, as the phone doesn't work sometimes. However, they are always in the shop from Monday to Friday when I drop by, even after I get off work at night around 5.   It's not easy to find trustworthy mechanics. I feel pretty lucky.  Definitely recommend to those who are looking for a good mechanic shop in Pittsburgh.", "business_id": "G-PlXGCY3G4zNOUzD61ZDA", "stars": 5, "date": "2015-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OhGiua2kOTSaUGQ3cOpNog", "review_id": "gLN38G_JsJnJwSzfxZ8s-g", "text": "Had very bad experience with this auto-shop. My car's engine stalls at idle and coolant temperature is not right. When make turns, there is noise from front wheel. This garage took more than a week to diagnose my car and gave me a ~1900$ bill for repair of a lot of un-related stuff. And they didn't even check the cooling system until I ask them to do. Then they insisted nothing wrong with cooling system other than a loose clamp, which is not loose at all. And they claim all my car's problems will be fixed. They took another week to finish the job and the next morning after I got my car, my engine stalls twice within 20 minutes, coolant temperature is still wrong and front wheel noise is still there. Sent my car back and they said another 500$ to replace several sensors will fix the problems, which is non-sense. I will never trust them anymore and nether should you. They only trick you to do repairs you don't need and never fix a real problem.", "business_id": "l-dc5DeNBiHYJA1XO4cFPA", "stars": 1, "date": "2009-11-03", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "d9AfUK4A1xZikqhsc5k07w", "review_id": "wZdbEBrmlH436B5DFrvnIA", "text": "Definitely overpriced for what they offered.  Took my car in to check my AC, they didn't get back to me for the whole day, and decided to fix whatever the problem was without asking me and charging me an insane about (approximately $150 more than most places).  Definitely will not go back there again.", "business_id": "l-dc5DeNBiHYJA1XO4cFPA", "stars": 1, "date": "2010-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YMZW4E4xEoL-btz4uEtgUA", "review_id": "yypvIyVCWrbJrxNyK8sHxw", "text": "I was passing through Pittsburgh and discovered a headlight was out.  I found Bastone through Yelp and drove over.  \n\nThey fixed the light on the spot charging me $12.  First impressions are great - very clean repair shop and the service for this minor repair was done in a friendly and welcoming manner.", "business_id": "l-dc5DeNBiHYJA1XO4cFPA", "stars": 5, "date": "2011-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Hr9I9Jdy3MKCZ7c-bpehMQ", "review_id": "n7UBUTR8_Hv-zacFoRsrHw", "text": "Bastone is the best auto service I have found in the US.  I have trusted my car to them for all the years I have been in Pittsburgh and I do not plan on changing them.  They are very professional, logical prices, and they make everything possible to meet your time schedule if you ask them for.  They even give some perks for \"loyalty\" customers (e.g., free oil change for every 6 oil changes you do there - of course this means every 2.5-3 years but still).  The also have a shuttle to drop you off (I have never used it but I have seen other people using it).  However, because they are so good they are very busy too, so make an appointment ahead of time.  They are also not open during weekends.", "business_id": "l-dc5DeNBiHYJA1XO4cFPA", "stars": 5, "date": "2013-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h2kyXtLyfOiS5AmRepUSWQ", "review_id": "TLsvU7CQbKy9wpHLC83ovQ", "text": "Love this place, really nice people willing to help and pretty decent prices..", "business_id": "l-dc5DeNBiHYJA1XO4cFPA", "stars": 4, "date": "2014-11-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "UD7Y1CqfY6mDmRwIuCf6nA", "review_id": "5BeRSLI2XkbEKSinwKDVOw", "text": "Very easy place to get my tires replaced.  I pulled in, they took a few pieces of information and I just had to wait.  While I was to wait I made sure it was OK for me to walk to nearby businesses to pick up a few items I needed.  They took my phone number and told me they would call when my car was finished.\n\nWhile I was out at nearby stores my phone rang less than a hour later and was told I could come and pick up my car.  Walked in, paid and away I went.\n\nWhy couldn't I give this place a five star rating.  Two reasons.  1.  I ordered my tires and was expecting to receive a call on a Friday to stop in and have the tires put on my car, they did not call me at all and I called the following Monday to find out my tires were there for the past few days and no one made the effort to call me.  2. When I left, I could not comprehend why the air pressure wasn't regulated to my new tires.  How hard was it to make sure that my psi was set to 32?  One tire was at 38 and the other at 35.  I promptly needed to visit a gas station to remedy the situation.", "business_id": "UFhcxnTzfLO-ROftyP_ukw", "stars": 4, "date": "2012-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CT7kzHHF9SpS96mkCvwqWQ", "review_id": "fSwj3yKIL4G-TMdCOltixg", "text": "I experienced three main issues with this Goodyear location while purchasing/installing a new set of tires:\n\n-They did not have my name or appointment in their system when I showed up. Fortunately, they still honored my appointment. \n\n-They did not install tires correctly. Left for a business trip the following day, and once I got on the highway and my speed passed 65 mph, the car began to rattle (with my new \"comfort tread\" tires). Booked an appointment, and they fixed the issue.\n\n-Two months later, I went to my Toyota dealership for routine maintenace. The dealer mechanic found that the lugnuts on the tires had been over torqued by Goodyear. So the Toyota mechanic had to saw them off of each tire and replace them with non-security locked nuts. (If I had a flat on the side of the road, I would have been SOL).\n\nAll of these issues were entirely preventable. The lack of expertise and techincal skill at this Goodyear location is abysmal. I do not recommend.", "business_id": "UFhcxnTzfLO-ROftyP_ukw", "stars": 1, "date": "2013-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k0a-uii8yr__Rl-9ipl_RA", "review_id": "akfkEE4cPX1x6P0VU7K2PA", "text": "I was just there this morning for a 10am appointment to get my summer tires swapped out for my winter tires.  My regular mechanic was overbooked and there is snow coming on Monday.  Receptionist scheduled me in just fine and the quoted price was reasonable, so I said OK.  Upon arrival, store manager stated that they will not touch the car as it has aftermarket rims and lug nuts.  He did not state any restrictions about aftermarket parts as they could not guarantee the work.  I asked if this was the case for all rims and he became a little snotty.  I had heart surgery a while back and I can't do the jack and tire work as not to tear at my incision/breastplate, if this was not the case with my health, I'd certainly take care of it.  Aftermarket rims are common - should not be an issue.  Last time I ever set foot in that place.", "business_id": "UFhcxnTzfLO-ROftyP_ukw", "stars": 1, "date": "2014-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "stFPdii0cJR7qpp6rz1CRw", "review_id": "_9z6J2NwhTY9RSyj6RsfJw", "text": "I have bought tires here. I have gotten tires repaired here. The staff is prompt. The product is good.", "business_id": "UFhcxnTzfLO-ROftyP_ukw", "stars": 4, "date": "2015-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LxnhT5IqCS9Ju0rApb-iyA", "review_id": "gND02pEyZx5Nk4OF8gxuFg", "text": "Made an appointment for 3:30. They completely forgot I was coming but said they could start on my car in ten minutes and be done in an hour. Came back an hour later only to see my car in the same spot. They said it would take another two hours to start work. Completely unhelpful and unapologetic.", "business_id": "t15LDNaHFpu-bAEJSdoV-g", "stars": 1, "date": "2011-11-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "MqvtOOrWg-2gxT2qnpcn7w", "review_id": "fyzM3_V39ZaecC77k9iDIg", "text": "Have taken my car here a few times because there's a bus stop out front so it's convenient to drop my car off and get to work. But after what happened I will never be back. They just cost me money and lost my tires. \n\nIn March I blew a tire on a pothole (naturally) and they replaced the two front tires for me. The second tire was fine but you have to replace both, I kept it so that I would have a spare if another one blew out. Put the tires in my basement, no problem. Saved for a rainy day. \n\nThis week I ran over a nail and the tire wasn't fixable so I had to get it replaced. Luckily I've got a spare! I called Monro early this morning to see if I could get in but they said it would be tomorrow at the earliest. I needed my car so I took it to pep boys (three hour turnaround - also the last time I needed an oil change they said they were booked for three days, good lord). \n\nI drop the car off at Pep Boys and tell them the extra tire is in the back. They call me up and tell me the tire is the wrong size. What? Monro gave me the wrong tires back when they replaced them in March. So I had to buy a new tire when I had a perfectly good one that is now god knows where. The tire was the wrong size and definitely didn't come from my car as it wouldn't have fit on the rim. \n\nAfter paying for the tire at Pep Boys I went over to Monro to see what they would do about it. They informed me that because I already had the new tire put on they couldn't do anything but the next time I came in they \"would work with me\". Why the hell would I come back when you just screwed me out of a hundred bucks and a good tire? Not worth chancing. Because you couldn't fit me in within a day I get screwed? \n\nIf you need tires go to Pep Boys on Milvalle. If you need an oil change go to Midas on Penn Circle they'll be able to get you in and not wait three days.", "business_id": "t15LDNaHFpu-bAEJSdoV-g", "stars": 1, "date": "2014-10-02", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "kRrg7nU-BJpW1xDQptNH1g", "review_id": "XEgQLZOJB3dOxHKC3m6Hhg", "text": "Ah Monro, where \"45 minutes\" is actually 2 hours and running at the time of this post. My car is on a lift with no tires and the employees are smoking cigarettes laughing. I can't even escape if I wanted to. At least they turned the heat off in the waiting room. Not like it's November in Pittsburgh or anything...", "business_id": "t15LDNaHFpu-bAEJSdoV-g", "stars": 1, "date": "2014-11-15", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "AFNTPG5UmvJMuyWM7IPlPQ", "review_id": "FsBPp6oHoTnwzsivzUQoTA", "text": "Going to a new mechanic to get your car repaired shouldn't rank up there with public speaking and first dates, but it usually does.  Well not if you go visit Tim at Walter's.  They guys at Walter's are friendly, trustworthy, and treat you with respect.\n\nThey are a small shop so call ahead if you need major service, but where else are you going find a mechanic who actually suggests way to save money on the repair", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2007-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "X0tol2KOb4DduPipPgnRpg", "review_id": "LuiPDpKZPxmRhGHDG88cpg", "text": "Went to Walters after I had a ripoff repair store tell me my Volvo needed new roters.  Thank goodness I know what they are and that they had been replaced just 16 months ago.  Tim at Walters confirmed my belief and passed my inspections.  He was fast, funny, and smart.  I then sent my husband in with his ailing BMW and Tim did a fantastic service on it as well.   This is a real honest and thoghtful mechanic.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2009-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "OFmzR7xSnP9Se-_kMbzMqw", "review_id": "KtGwUYA-SzG0CNydV_ffHA", "text": "Growing up, my dad always fixed my car.  Now that he lives two states away, I don't have that luxury anymore.  Luckily, Tim at Walter's Automotive is a great substitute.  Honest, friendly, and helpful--I'd recommend him to anyone in Pittsburgh.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2010-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "YTHnhkhUY9m83m915xsjJg", "review_id": "yjqvZu0o_fcCmh7dtIO8fw", "text": "Scenario: Get into my car at 3:30 and head to campus for a meeting. All of a sudden, the tire warning signal lights up even though I don't remember running over anything. I get out of the car to carefully inspect my tires and they feel/look completely OK. But after owning a BMW for 3 years and having constant wheel alignment/tire issues (ie. when a tire warning signal lights up, it usually means my tire's about to blow out!!), I freaked out and frantically drove my Infiniti to the first 3 auto shops on Baum Blvd. I waited at the first stop for 5-10 minutes and the guy did not get off the phone. I got back into the car and drove it over to Pep Boy's where a mechanic was outside smoking. He says I need to go through their service desk (inside their huge store) and deal with them first. I'm thinking, \"ugh. no time. I have class in 40 minutes and I'm already late to my meeting.\" I drive past the 3rd shop and I don't even see anyone sitting at the reception desk and figure it's going to take forever to get what I'm asking for.\n\nThen, I remembered the really positive experience I had with Walter's. I decided to drive to the end of Baum Blvd. to find his place and boy, am I glad I did. As soon as I got there, the service coordinator told me to pull my car around front so that their mechanic could take a look at my tires. He stopped what he was doing to do this and told me I could just stay in my car. Then, he reassured me that my tires were OK and he proceeded to inflate them, explaining to me why the signals might have come on.\n\nFree of charge, in and out within 5 minutes, and helpful/reassuring. I love this about Walter's Automative. They're not out just to make money. They genuinely just want to help. Highly reccommend!!", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2011-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "hRCWkTaCs2lEWiRKH-T4IA", "review_id": "SPa17Yat37X8h7vYi2vrMg", "text": "There are at least 2 auto repair shops where I could drop my car and walk home or to school in less than 10 minutes.  I have to drive to Walter's, take the bus back home and catch it back  to get my car.  It's about a 15 minute ride each way.\n\nI would walk there on my hands.  They are that awesome.\n\nTim is not only great at what he does, he is cool as hell!  He was patient with me and my (over 230,000 miles) car that took a freaking month to pass the emissions inspection. Turns out the mass flow sensor wires were dirty- anywhere else and I would have already replaced 2 O2 sensors and I would still be going through emissions crap.\n\nI am really happy to have found someone to take care of my car :-D  Thanks Tim!!!", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2012-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "QrZNgYOJTHMmuFo-M7M8gQ", "review_id": "GuQh3-vDZMCRsnABVzjICQ", "text": "I like Tim Walter so much, I almost wish my car would break down so I would have an excuse to see him. \n\nHe is super honest, explains everything, gets the cheapest appropriate parts he can, and isn't the least bit condescending. Picture the kindest surgeon you can; Tim Walter is the same, just for cars instead. \n\nAlso, the man has a great memory. He *still* makes fun of me for that Coke can I had strapped to my muffler 7 years ago.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2012-11-06", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 1}, "user_id": "YLft4yXd5lni3kkPgSVDmQ", "review_id": "e5EN_TgdsHisvbj6ipeF5A", "text": "For the last 5 years that I have been living in Pittsburgh I have been coming to Walter's...its always been a bit of trick planning to take my car in for maintenance as they are very busy because they are indeed great mechanics and generally awesome and friendly people. You absolutely do need to call a few weeks ahead and be patient. Quality service takes some time. \n\nNow that I am moving to the opposite side of the country, I took my car in one last time to get everything checked out, fixed, swapped out etc. My car was in the shop for 3 days and I waited patiently knowing that I can trust Tim and Arlene in the same way I can trust my parents to get something important done. They aren't there to screw you over. I know this because I had, on my first occasion taking my car there, gotten a second opinion on somethings and everything aligned between the two sources so they earned my trust! \n\nThey took care of me and my car really well. Arlene kept me up to date on what was going on and Tim took the time to explain what the parts were, what they did and how much things were going to cost. He even sat with me after closing hours researching the oxygen sensor and tires I needed online and quoting me the best price. He listed out everything I needed to have done and told me which was most important for a cross country drive and what could wait. That is service and care!! \n\nIf you need a great mechanic, like you need a good doctor, be patient, be inquisitive and do a little bit of planning. Your car will get serviced, your wallet will be in good shape and you might learn a bit about the car you drive. I only hope to find as good of a business in Seattle as I did here in Pittsburgh. \n\nThanks for everything!", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2012-11-10", "type": "review"}
{"votes": {"funny": 2, "useful": 6, "cool": 3}, "user_id": "_7Lg8iTWpFc0O7PEA8FmbQ", "review_id": "_aRKIwWD3q8UagLMtlw6DQ", "text": "Hands down a great experience! I called yesterday as the driver headlight on my car was out and asked if I needed to make an appointment. The woman on the phone said to just stop right by during their hours. I went by this morning and their (small) lot was full so I just sat in my car while I believe who was Tim was finished chatting with another guy. I continued to sat in my car for a couple of minutes while Tim quickly inspected my headlight. Unfortunately he did not have any replacement bulbs but ordered them right on the spot while I was there and told me to come back any time in the afternoon. Fast forward a few hours later. I  just popped by and after popping my hood and going into their office to pay, my headlight was replaced! Friendly, honest, fair and quick service. No BS. Highly recommend Walter's Automotive.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2012-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2REGpU7W6gK-8RvOBc45uA", "review_id": "iUj8BrmSRRECyh5WTjSFvg", "text": "I have an older car and so sometimes things go wonky. One night I had to drop it off because it was barely running and I had no idea why. This was the first time I went to Walter's, turns out that it was only an oil changing problem. Car places usually screw me over because I know nothing about cars, but Walters did not. They are really great and fix the car for your needs. Yesterday I returned for inspection and once again he treated me fairly and only mentioned things that I already knew needed work. I would recommend this place to anyone with an older car and wants an honest car repair man. Walter's will definitely be getting my business in the future!", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2013-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r2HhFDFr6YihPOCDRqhk9g", "review_id": "WfHECHJ0CkaGZP5weJBa9g", "text": "Went to Walt's Auto for an inspection after seeing all of these great reviews on Yelp, and was so happy I did. I will be taking my car and my husband's truck here from now on. The service here cannot be beat!", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2013-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sgnZCcZLaSyFq3H3aL3eAQ", "review_id": "t4JKZgHaeVSkcpTn8KBupA", "text": "As the Survivor song says \"THE SEARCH IS OVER\"! After years of being taken advantage of by countless mechanics who care nothing about you or their workmanship, in Tim I have finally found a true gentleman who is a master at his craft. My situation was complicated and he accommodated me at every turn. Not only did he care about the cost, he twice came in on his day off to service my vehicle. I could sing his praises for an hour. I am a young widow, mother of three and know little of automotive repair. I live 90 minutes away. I will  EAGERLY return as needed without the fear that has accompanied me so many times before. Walt's Automotive is a dream come true.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2013-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jAYnPavj3TBxnWn_lV746w", "review_id": "7eq4QUNJk8km-JbxgpTNaQ", "text": "I can only agree with previous reviews in that the service is\n1) Good\n2) Affordable (the don't overcharge you)\n3) Flexible, e.g., you can pick up the car late.\nThe personnel is polite and knowledgeable.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2014-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lKYWrcamGkEqsgediVbPAQ", "review_id": "GszV-Z7sBCH_NRxOYATH6Q", "text": "Good honest business. They did not nickel and dime me and have quickly gained my loyalty and respect. They had the decency to recommend that I not get my inefficient catalytic converter replaced.  Bit of a wait to get the car in, but it was well worth it.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2014-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SYASgPaJ0QXXdZo0OBVHMw", "review_id": "S04TnV93uQNNRbXZrF6ouQ", "text": "I just went to Tim as my check engine light came on on my recently purchased 2005 Toyota Corolla. Tim took a look at the code and told me what the problem was. Reset it for me and told me to call him if it comes on again, all free of charge in just 5 minutes. That is why I like Tim and will recommend him over anyone else, especially for old cars, the guy is very honest and will only recommend what is best for your car and your situation. Not making you spend money when you don't need to.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2014-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "NChl6bTuhngG6_R4-pp20w", "review_id": "ON-0sO2Srv5cKofdzZ36HA", "text": "It's hard enough finding a good mechanic period. But to find one that's friendly and reasonably priced is unheard of. I've been loyal to Tim for the last 4 years and he's never let me down. If there's one complaint it's that things can sometimes take a little longer than expected, but this is a minuscule \"con\" in an ocean of \"pros.\" At one time, I needed a new flex pipe put on my exhaust, Tim recommended that I go to a neighboring shop to get the exhaust work done because \"it would be too expensive if I did it.\" This was something I've never encountered. A mechanic recommending another place to do business??? Do yourself a favor and give this place your business. Your car might be out of commission for a few days, but the comfort of knowing you're not being swindled is absolutely worth it.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2015-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KDmWYum8ihkHQ-JbmOZj3Q", "review_id": "yBHlLHpnMVeUaqRJ-BQKzg", "text": "Not that these guys need another 5 star review, but here I am.  Super nice folks. They are accommodating, knowledgeable, affordable, and fast.  I'm new to the area and went here based solely on yelp reviews. I hate dealing with mechanics but Walters was refreshingly painless.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2015-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uPCkl9SWdJsNOloVFj2OGA", "review_id": "rop7Y1RBSxWVw_zyiH8MMw", "text": "Recently took our car to Walter's for a state inspection. Could not be more pleased with the service provided by Tim and his staff. Time went above and beyond to make sure that we were taken care of. I will be going back to Walter's for all of my auto mechanic needs.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2015-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mQGKX3eq3D7GMbyGlFqo2w", "review_id": "kyGBEEgxSkbAgieaPFhCyw", "text": "This place is outstanding. I always get great discounts, and all the mechanics are very honest and helpful. I am certainly not rich and Marvin is always willing to assist me with my budget and what needs to be done on my vehicle. I've been given very specific directions on whatever needs to be worked on, taken back to the garage and allowed to see the old/new parts with no hassle. I would definitely recommend going here.", "business_id": "FZ67NZD-_aou82e-7TT_nA", "stars": 5, "date": "2014-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zE2eR-4DGYS8EmdvovP_QA", "review_id": "LWnMmlAaYXOKw2D3SsOEKw", "text": "I called to find out if I needed an appointment to which I was told \"just come now we can take you\" then when I gave them my keys they said come back in three hours. Guy was also trying to push a credit card and seemed upset when I said I didn't want one. Three hours later when I came to get my car transaction was processed and he was ready to let me go on till I brought up that The paper said something had been broken on my last oil change. That's funny because between my last oil change and this one I personally checked them oil meter and it was not broken. Furthermore I week later I found my car's belt system was broken. The guy who fixed it said someone must've broken and although I don't agree it's something they could've seen. Not coming back even though it's rather convenient", "business_id": "FZ67NZD-_aou82e-7TT_nA", "stars": 1, "date": "2015-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fEe-CunJ0lkONsedEbe-IA", "review_id": "19eiZl1vJrZ9kVYySYcuUw", "text": "Great service! They fit me into a busy schedule within 2 hours of calling and fixed my flat tire for a great price. I will definitely use Midas again after my experience with them.", "business_id": "FZ67NZD-_aou82e-7TT_nA", "stars": 5, "date": "2015-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sgnZCcZLaSyFq3H3aL3eAQ", "review_id": "Xd1_Co4ufRPSPKlQIIKGfQ", "text": "Was referred by another automotive repair shop for a custom exhaust weld. My repair was handled by Isaac. I found him to be a true master at his craft! There aren't many places who do this kind of work anymore and it's a shame. Isaac saved me about $800, as I didn't have to buy the entire exhaust from the dealer.  Everyone at Meineke was courteous and I was out the door in less than 45 minutes. Thank you Isaac from the bottom of my heart!", "business_id": "t_Mjhtr0KTB9uGNzxl37WQ", "stars": 5, "date": "2013-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6uX-CcFs2uUepK-WSz5oWA", "review_id": "gX6Zo7-Ntie6S7d7O7oU6g", "text": "Not sure why the negative reviews on here? I went there for brakes and got a great deal. They squeezed me in on short notice too since I was going out of town. I'll be going back for more work -- the guys here are great.", "business_id": "t_Mjhtr0KTB9uGNzxl37WQ", "stars": 5, "date": "2014-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bTArr0CwFOKnY4S3A3Pa7Q", "review_id": "PtVGN1vqEcajAINT6JtyuA", "text": "Good people, good work, very reasonable prices. They let you bring your own parts and don't give you BS.", "business_id": "W25mXeVDTHBIXAidJrwHPg", "stars": 5, "date": "2014-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "X40nXGyQCFMiW7dx0ASsbg", "review_id": "r9fruOQQ2q9gJW0aJwlZug", "text": "The crew here is amazing! They squished me in for a late inspection and had my car back to me that night. Very honest and trustworthy! Extreme well priced! You won't be disappointed!!!", "business_id": "W25mXeVDTHBIXAidJrwHPg", "stars": 5, "date": "2015-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "iTmWHtltCtk0Gm55AOxrUA", "review_id": "_FuGID_hoFWPO5__XWf26w", "text": "So I was returning back to the office after doing a site visit and I heard the dreaded \"Pow!  Thump-thump-thump\"!  So I pulled over, got out of the car and sure enough, that right front tire was flatter than a Nebraska cornfield.  O-o-k-ay!   I was so glad that years ago my brother taught me how to change a tire.\n\nWell this Monro was the nearest place to get the tire repaired.  It turned out I'd picked up a nail!  I've heard good and bad about auto repair chains, but they did get the tire fixed quickly.  \n\nAnd girls, you shouldn't be afraid of learning how to change a tire.  Because I had the company car, it actually took me longer to do the memo and the expense report than it did to put the spare on", "business_id": "D5AC_cRdXrSWqL8KjJt5KA", "stars": 3, "date": "2011-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IO9E8yrQ83sOCwkBSmUTMw", "review_id": "LwdHAVClTILX3SDTNqYnLQ", "text": "Quick and nice, they have fixed my tire without charging me money, really good to go!", "business_id": "JtViWM5LYyQ22uq2DYqt6A", "stars": 5, "date": "2014-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kYT-oSFpyWzy7NpECAalEQ", "review_id": "-Zi3fzRwWXPsQCKzbTZ8LQ", "text": "I took my car here on the recommendation of my son who uses MJ Automotive Service all the time.  He told me how great they were and his review could not have been more accurate.  Kept me informed the entire process, reviewed recall information on my vehicle and advised that the repairs should be free from Ford.  They were correct!  If you want to deal with honest, knowledgeable and friendly mechanics, this is where you should take your car for service.  I will be a returning customer.  Thank you Mike and Jeff - you were a blessing.", "business_id": "vWrXsnk4DMRUckSR1tMmXw", "stars": 5, "date": "2014-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "1h5T9mNgReCiykYCxvI55A", "review_id": "fLo5TwVHTTBxxs8VQMhsfA", "text": "These guys are great. Fast, friendly, and one of the few garages I've dealt with as a single woman who treat me ethically. Thumbs up on this location.", "business_id": "qfE56Noi-gtgy0WcSMtfIA", "stars": 5, "date": "2013-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "grZtiAUAx3wttIi-GHubcQ", "review_id": "J4qJEx9R_xpLv5wIBVENIw", "text": "They are fine for oil changes but don't go here for state inspections. They'll try to hit you with a bunch of unnecessary repairs. They wanted to charge me 1,500 dollars to pass me. I took it some where else and they said I needed a $140 of repairs.", "business_id": "rzcK-fYhrQGLt9uvv-Boxg", "stars": 1, "date": "2014-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "MSuyK2p8G9hEqyWf5IgnYQ", "review_id": "ht9G-hIGcSLj1AiO5gVSRg", "text": "I am very torn about this place. I was having trouble with my muffler and came here to have it replaced. A couple months later, my entire muffler fell off... So we returned and had it put back on. A couple months later I continued to have problems and the muffler sounded like it was going to come off again. Granted, I have an older car- but, after going to a place that basically specializes in mufflers you would expect them to be able to figure out the problem. They worked on it yet again and I haven't had an issue for about a year now. \n\nI have come in here for an oil change two times. Each time they were quick and efficient with my car. Kevin is who I have interacted the most while coming there and he is very friendly and helpful! He recommended that they replace my windshield wipers and didn't give me any issues when I denied his request to do so ( I wanted to get them cheaper at advance auto parts down the road). \n\nI agree with another yelper- stick to this place for oil changes.", "business_id": "rzcK-fYhrQGLt9uvv-Boxg", "stars": 3, "date": "2014-10-08", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "MSuyK2p8G9hEqyWf5IgnYQ", "review_id": "HShM4GqpH8gk_sDS9yGFmQ", "text": "Had to update.\n\nAfter visiting this place for muffler issues 5 times in three years and being told by an employee that my entire muffler system should, and I quote, \"outlast the lifetime of my vehicle\", I actually believed them. Hah. They replaced pipes, my exhaust & other odds & ends in my muffler system just in January of 2014... only to find out in September of 2015, that my entire muffler system was shot. I went to a mechanic I trusted, which is what I should have done all along. They fixed the issue and I am relieved it is done... but looking back, I wasted about $1,000.00 over the course of 2-3 years in this place.\n\nDon't waste your time with this place. Go to a small business & support your local mechanics.", "business_id": "rzcK-fYhrQGLt9uvv-Boxg", "stars": 1, "date": "2015-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XDhB6t86SWK80MjWJcZuOg", "review_id": "mtdWY7mx_cjWeJDuyaPPTA", "text": "Wow!! If you want to get ripped off, false information and talk to people with no integrity - then stop by Monro! After 3 tries, or now make this 4, I will never recommend or bring another vehicle back! Just this last episode that has to deal with an inspection has me annoyed! Last month I stopped by for an oil change and asked if they could check my brakes since they were squeaky and my ebrake seemed loose. They told me everything was in good condition and nothing to worry about. I have driven 200 miles in the car since beginning of September. We bring it in October for an inspection and now my rear calipers need replaced - roughly $500! So after explaining the situation they lower the price to $350. Just to be on the safe side, we bring it to another mechanic who notices that the brake pads have NO pad left on them and the calipers are perfectly fine! He even shows us what we need to show monro to pass and get our stickers (we paid for them but weren't given them previously). So we bring it back and the guy just is blasé about it and gives us the stickers and says that the pads must have worn down in the 5 miles round trip we just made to the other mechanic. Well sadly Monro, you have lost a customer and I will make sure I spread the word!", "business_id": "rzcK-fYhrQGLt9uvv-Boxg", "stars": 1, "date": "2015-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7Hs0ipM_GGYg1BuCCa3d2Q", "review_id": "PeATebsMIQVb-VxiLNhd6A", "text": "My car was hit while I was parked on my street, and the responsible insurance company (State Farm) covered the damage. Penn Auto was one of their recommended shops, so I went with them. I was absolutely blown away by their service. When I first got in touch with them, they were able to get me in the next morning before work (at 7 a.m.) which is a huge plus for me, to get my estimate. I was in and out in about ten minutes, and we scheduled to get my car in about two weeks later, which was fine with me - the car was drivable. The next week, though, I discovered a screw in one of my tires (unrelated to the accident) - they, again, were able to get me in the next morning before work. He repaired my tire within 20 minutes, and didn't charge me anything for the repair. I took my car in for the repairs the next Monday - they gave me a loaner car for the week, because the insurance didn't cover a rental. The car was done by Thursday, and it was great. It looked as if nothing had ever happened to the car. They also fixed a couple of scratches for no extra charge. Everyone was really friendly, as well. I would absolutely recommend their service to anyone and everyone.", "business_id": "fM5hwoJGY5gn1jEQnKiyDw", "stars": 5, "date": "2012-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bgPkRE-h1JYUlh9ipDq04Q", "review_id": "2_Rzdyx-SldOJG1r7_TULw", "text": "I had a bad experience at Penn automotive.\n\nFirst, they did not schedule me in even though I called multiple times to check the time and date. It seems like I didn't have to wait extra, but that's a first sign about how they run things...\n\nSecond, the lady at the counter is extremely rude and unpleasant. I wanted to speak to the person who inspected my car - who I paid about $80 to inspect my car - and she kept telling me I could not speak to them. That I had to call back or write a note about what I wanted to ask them, she would ask the inspector, and come back to me. Come on! The guy was right there in the shop fixing the next car. I could have spoken to him in 2 minutes and gotten out of there.\n\nThird, they claimed that my car needed an oil change, an expensive one, and I took their word for it. I forked out about $70 for that oil change. When I get back home I asked my mom about it and it turned out she got an oil change about 2 months ago... These folks are not honest and just want you out of there quickly. Have never experience such a rude interaction with a car shop.\n\nBeware...", "business_id": "fM5hwoJGY5gn1jEQnKiyDw", "stars": 1, "date": "2015-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ZL0H1_aSxh-C7mi7-l_l0A", "review_id": "QQWMEQjkJjzbKZ8KucCHqg", "text": "I WOULD NOT AGREE TO ANY REPAIRS TO YOUR CAR OR MAINTENANCE OUTSIDE OF OIL CHANGE, INSPECTION, TIRE ROTATION, AND TIRE REPLACEMENT, END OF STORY-- not even brake work, fluid flushes, taillights, or anything else.\n\nI went to Mr. Tire for 3 years for service on my car and they misdiagnosed several major issues that when talking to the mechanics that could finally fix my car elsewhere were actually very common problems and not weird at all--ie should have been very easy to diagnose and fix (a shame I don't know more about cars).  I find their prices to be above market for any repairs and below market for basic services (i.e. sucker you in for the basics and then when something doesn't pass inspection or isn't quite right they hose you).", "business_id": "H27egCbna1FH8X8HFpLD_A", "stars": 1, "date": "2014-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "g2j8pCUKx8rJbyBGGnudsA", "review_id": "rkOnUrQElDI1igF_uwjYRA", "text": "DO NOT GO TO THIS AUTO REPAIR SHOP - Quite possibly the worst auto repair service in our region/ever. I took my truck there to get inspected. The aggressive and cantankerous manager told me I had $1200 worth of repairs including replacing my windshield because of a crack. The crack was a small splinter in the windshield that is no bigger than a dime. I know nothing about the  what constitutes a replaced windshield until I simply went online and found that the splinter needed to be larger than a quarter. When I told the manager he yelled at me. \n\nI took it off the lot and to an independent repair service and it passed with no repairs - $40 compared to $1200. Let the list of bad reviews on this shop confirm, this place should be shut down.", "business_id": "H27egCbna1FH8X8HFpLD_A", "stars": 1, "date": "2014-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nwpzAqDiSx5P4XxAKT5PMQ", "review_id": "i9qXM_FDeZzqJvmpfYTCDQ", "text": "I'm a car guy and I can spot a fellow car guy and that folks at Tullock are car guys. This family-owned shop is friendly, knowledgeable and most importantly honest. It's easy for mechanics to take advantage of customers that wouldn't know better. These guys don't do that at all. Plus, if you're info older and classic cars, they can do a restoration too. If you're looking for an honest mechanic to help your car last that much longer (as we all are), give Todd a call", "business_id": "MrEABR3VfV0jDm_6oOfvXQ", "stars": 5, "date": "2010-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yAHYMZBO0N-AUAspCO8PZw", "review_id": "HFxGuUgDld-IPCTKHdf7Sw", "text": "associates very helpful and willing to help you find what you need.", "business_id": "zKGGHa7AXr4EnPvBAaum5A", "stars": 3, "date": "2012-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "X36p3mD4oqBE53sASc_Ykw", "review_id": "8fECATGRzir4JjQcdLXJOQ", "text": "3.5 Star Rating....rounded up to 4 (I feel generous today) As far as Sears auto stores go this is a pretty good one. They're always busy being in a mall....but to me that's its appeal. You can drop off your car and eat, shop, people watch, whatever and kill some time while having at least some fun. \n\nThe service here is pretty good and prices average. They have worked on 3 cars of mine and have usually done a decent job. Quite frankly I do prefer Pep Boys but you're stuck there with nothing to do. So I keep coming to this Sears for those things that take time so I can walk the mall.", "business_id": "zKGGHa7AXr4EnPvBAaum5A", "stars": 4, "date": "2014-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RbSPl5bMKm_INZKn_Y05FA", "review_id": "u33fCa9Zjwt8tCL27IznXw", "text": "The entrance is hard to find/identify... the exit says Sears, but the entrance has a door that says Avis/Budget.  You have to wait in line to bring your car in for service instead of parking in the lot and going into the shop with your keys.  Waiting in line took roughly 20 minutes on a Tuesday about 12 noon.  \n\nI brought my car in for a simple oil change.. it took almost 3 hours.  Granted when they told me it was done, there were several things that Diego had found that I could fix in my car.. the list of repairs totaled over $800.  I didn't bring the car in for an inspection, just an oil change.. that's all I wanted.. could have saved time elsewhere.  It was about $40 for a high mileage oil change including tax and with a discount coupon.\n\nThey assured me that the fluids (windshield washer, power steering, etc.) would be topped off; I checked in the parking lot afterwards and it was not done.  I was so fed-up with waiting so long that I didn't feel the need to wait even more.", "business_id": "zKGGHa7AXr4EnPvBAaum5A", "stars": 2, "date": "2014-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JsDwRspwFsyi8MUP_JSjqQ", "review_id": "a09wUQ5BCPDKJPg5aV3_wQ", "text": "I have been coming here for service for 2 years now and spud highly recommend them for any service.", "business_id": "zKGGHa7AXr4EnPvBAaum5A", "stars": 5, "date": "2015-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "tybCdN9qF-aTsA8V_XNeGw", "review_id": "UrbZRwrK3FabprKqghSzzA", "text": "I wish it were possible to give a business 0 stars because this auto repair facility committed several cardinal sins today and are not trustworthy. \n\n(Background: I am a young female who has had plenty of trouble with being treated unfairly in the auto repair world. It is my pet peeve. It is wrong. And you - mechanics - should feel ashamed for taking advantage of women car owners because you think you can.)\n\nI went to Treadquarters today for help after I noticed a screw had punctured my tire earlier this morning. The tire wasn't deflated yet and the screw was deeply embedded in the tread. I needed a patch so I could go on about my day. When I looked Treadquarters up online they were advertising \"Free Tire Repair\" with some exclusions, none of which applied to me. This coupon, paired with their good reviews, made it an easy decision to stop by. \n\nThe young man who greeted me seemed a little turned off by my coupon. I'm assuming this company offers such incentives so that customers will bring them other business that creates better revenue. A smart strategy. However, it doesn't work if your employees are begrudging and dishonest. He went out to my car to look at the damage and proceeded to feed me some bullsh*t about the screw being too close to the side wall. The screw was definitively NOT in the side wall or anywhere near it, no matter how many times he tried to show me with his \"thumb measurement\". It was only about an inch away from the mid-line of tire. Regardless, this young man said it couldn't be patched and that I needed to buy a new tire. I didn't argue because I knew differently since my dad works on cars and I had already sent him a picture of the situation. I thanked the jerk for his time and drove off. \n\nA few miles down the road, I stopped at Woodies. I told the front desk guy there about my situation and he said they would take a look. My tire was patched and I was back on the road in 30 minutes. I will be doing a separate review for the great service I received at Woodies. \n\nThis type of treatment is inexcusable and I have no qualms with denouncing the entire company until they deal with their dishonest employees. He tried to \"screw\" me over. Bad move buddy.", "business_id": "n3jucIUCSjIXrKU-ykIb0w", "stars": 1, "date": "2014-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tleikKa7x8gBeL8rBXu0oA", "review_id": "uvGOZrzpg1KzZ6Db8i_2zw", "text": "I went in Treadquarters Pineville 3 weeks ago to get a patch on my tire. Today I was washing my car I noticed a big scratch on my wheel that went the entire way around. In the past I worked at a custom wheel and tire shop and know that the only thing that will cause this type of damage is if the technician does not pull the wheel weight off the wheel when he dismounts or installs the tire after a repair. Now everybody makes mistakes but back at the tire shop I worked at if the technician made a mistake and caused any kind of damage he would inform the customer. This was not the case at Tread Quarters Pineville. When I went back to Treadquarters to show them the damage, the same young man as mentioned in \"(Aaren H)\" negative review told me that there is no way that this was the cause of the damage and that I probably curbed my wheel.  Are you freaking kidding me??? It seemed as though he took it personally and then told me that he will file a claim. (In which I still have not heard from the company) I will also make note that he told me that this damage does not affect his hourly pay or anything at the shop.  I have never dealt with such poor management in my life.  This sort of treatment is inexcusable and I have no problem letting everyone I know the the poor treatment I received at Treadquarters in Pineville.", "business_id": "n3jucIUCSjIXrKU-ykIb0w", "stars": 1, "date": "2014-10-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "HXJYb1uwI8PlS3skfuVVog", "review_id": "9_BGnvcAz9yQqsFXQRIStA", "text": "This is a review of their business practices online.  \n\nEssentially, a long time ago I started getting emails from this exact precision tune.  Someone there must have given my email as theirs, or the tech mis-typed it.  \n\nDO NOT LET THEM HAVE YOUR EMAIL.. there is no way to get off the list.  I'm now taking actions to report their mis-handling in the case they send any more emails..\n\nIf you get stuck with their emails, contact their admin by searching 'whois ptautocare.com' and getting their email.  \n\nEdit : They claim the link at the bottom will unsubscribe.  I clicked that thing many a time man... been getting emails for years from you, the Honda Dealership nearby, etc etc... FML", "business_id": "VTu63fFRaKQV_BgoU8rquw", "stars": 1, "date": "2013-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x3jzdkXbqB_dN1WC9JrhSQ", "review_id": "Jt3WxipBqKWUKOQrAseaiQ", "text": "Hate the place!\nMade my car unsafe - didn't tighten lug nuts on back tires after rotation- I had to fix my tires , at gas station ( on \n\nhighway)while on vacation\nCan't do a simple job- don t trust them !", "business_id": "VTu63fFRaKQV_BgoU8rquw", "stars": 1, "date": "2015-09-07", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "woZAlrx9DGhp_NQX6TzjLw", "review_id": "xwxd7TngHdGGdw8054PajQ", "text": "My vehicle was failed state inspection because of a claim I was missing specific emission equipment. So I went to the dealership to pickup the missing parts and the dealership informed me that my vehicle has never had the emissions parts in question.", "business_id": "nLTTeGZrT2S2xaUISCgrSw", "stars": 1, "date": "2014-10-26", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "lqbRjkMypCBUieZMaDBB5g", "review_id": "gPwD59KGuX4jmUs7XH92Yw", "text": "I was in and out within 30 minutes. There were several people in front of me, but after they got my car, i would say it was only about a 10 min wait. Everyone there was very polite and courteous. I would recommend this place.", "business_id": "nLTTeGZrT2S2xaUISCgrSw", "stars": 5, "date": "2015-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "U5qUwsCNyo8vKBrhBUEzbg", "review_id": "4EmPzNshMnF7fzh7dhdVHQ", "text": "I'm absolutely floored with the service Griffin Brothers offers.\n\nThe other day I realized I had a flat tire about 5 minutes away from home.  With the wheel on the ground and no car jack, I wasn't sure what to do.  Much to my dismay, my AAA membership had also run out.  I had my tires and oil serviced at Griffin Bros the week prior, so I figured I would give them a call.\n\nNot only did they send someone out to air up my tire, but when I drove to the shop they put my car immediately on the lift when I told them I had a meeting to be at in 30 minutes.  Unfortunately they didn't have the right size tire in stock, and it was going to be an hour before they could get it. \n\nRealizing I had to make the meeting, I told them I would need to jet, and offered to pay for the roadside service...which they waived.\n\nGriffin Brothers was there to help me out in a time of need, and helped me for the sake of it being the right thing to do for a customer.\n\nHands down, I will continue to do business with and recommend Griffin Brothers for anyone needing automotive service in the University Area.", "business_id": "mnOTw4P5NaLbzFp2bTsm9g", "stars": 5, "date": "2012-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "m5Za7GZeK30V4XkpE4WvWg", "review_id": "9btG2xuwdcHvJueY8dJk8A", "text": "A few days ago I got a flat tire, I needed a quick fix so I just got a cheap plug and told myself I would get it properly fix the day after. I went to a shop right down the street from Griffin Brothers first, and they tried to sell me a tire. Saying I was upset, it's an understatement. My tire was in great condition, I just wanted to get it patched up. Thankfully I stopped at Griffin Brothers. They were not only extremely nice but very helpful. They had my car ready within an hr, and when I went to pick it up I got such a pleasant surprise. They didn't charge me a thing. I could not believe how great and generous they were. Needless to say I'm getting my oil change and everything else that involves my vehicle done there from now on. You can tell they are professional and trustworthy.\nLove them! And will recommend to anybody.", "business_id": "mnOTw4P5NaLbzFp2bTsm9g", "stars": 5, "date": "2012-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3KUwHnlBilKdlkJydbmbZA", "review_id": "a4yC3SwZK3mYGM9696S4vQ", "text": "I've been a loyal customer for over a year, and if they've moved me enough to shrug off my inherent laziness and write about them, that really ought to be all anyone needs to know.\n\nI've had two inspections, a flat tire repaired at no charge, and probably something else I can't remember. I just keep going back.", "business_id": "mnOTw4P5NaLbzFp2bTsm9g", "stars": 5, "date": "2013-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "HxxPa0ZvrqU6JlcLJGbxtg", "review_id": "IoeN5cEZJp6I4Ck5IkUgMw", "text": "I've been taking my vehicles here since 2008. No complaints. Love the shuttle service. Free coffee, coffee, & wifi if you want to wait. Friendly and proffessional staff. Clean bathrooms", "business_id": "mnOTw4P5NaLbzFp2bTsm9g", "stars": 4, "date": "2013-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EkJzvP-MdNTdPB_dsx-e0g", "review_id": "72zP7WelvMRJiVN78Ffcbw", "text": "My wife and I went to this Maaco location to have her car bumper repaired and painted, along with other collision work, after an accident we were in. We were really satisfied with the service we received, the pricing was extremely fair and they finished 2 days earlier than we expected. Will definitely go back if we ever need their service and I would highly recommend them to anyone!", "business_id": "JKKQVd4gFpjUadY35qntlQ", "stars": 5, "date": "2014-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nJaS7dwLEqI-MMqggV9jkQ", "review_id": "Ga0UOrXj7scgKSP9vQToCg", "text": "DO NOT GO HERE. EVER. \n\nRidiculously overpriced for the finished product and experience. I will NEVER recommend this place. And after everything they took 50$ off and expect me to be bowing down in gratitude? Yeah right. \n\nDropped the car off to be repainted on a Monday. Am told it will probably be ready Friday but they'll just say Saturday to be extra safe. Friday rolls around. No call. SATURDAY rolls around, NO CALL. The next week starts, still no call. It isn't until Wednesday that they call, saying it will be done the next day by 10am. Soooo...why didn't you call before this????!!!! I drive up Thursday, 1:35pm. Over 3.5 hours after they say it'll be ready. GUESS WHAT. NOT READY. Front desk guy Ron has no clue what's going on or even what year it is. (Side note: customer in front of us left unhappy, customer behind us left unhappy.) Manager Cory comes out and explains to us that the car won't be ready until after 5. I tell him I'll be at work and won't be able to get it. He offers to come pick up my husband and drive him down since we went to all the trouble. The only person who seemed to have a semblance of a clue on what customer service should look like. Husband didn't want to be picked up by a stranger, so we went back the next day, Friday, A FULL WEEK AFTER EXPECTED FINISH DATE, to pick it up. Entire car was dusty, inside and out. Dents were left in the doors that they didn't bother to fix. Pinstripe was not put on, DESPITE CALLING AND CONFIRMING IT WOULD BE DONE. They proceeded to put it on while we stand in the parking lot. Pieces of plastic and metal (that clearly belong to the car) are sitting in the backseat, no clue what they go to or what Maaco broke in my car and didn't fix. When I finally turn the car on, the air and radio are blasting, and the seat has been leaned back. \n\nTruly the worst customer experience ever. Wow. Beyond unprofessional. Purely shady.", "business_id": "JKKQVd4gFpjUadY35qntlQ", "stars": 1, "date": "2015-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UmCAhWcU_abaaESenKUiLw", "review_id": "sy76_pS4vrrDnMwcbSkZ1g", "text": "Great service. Very honest man, who runs this business by himself.  He's such a good mechanic, and you will be shocked when he quotes you a reasonable price", "business_id": "sctg5U2PEmGoxyPQx5lYgQ", "stars": 5, "date": "2012-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GYyc-ffzG5sTVXHHQc3Y1w", "review_id": "tteOK6z7AhyYAgntCZNPJQ", "text": "Steve is the best!! Very honest, knows what he's talking about. Best me mechanic in Charlotte", "business_id": "sctg5U2PEmGoxyPQx5lYgQ", "stars": 5, "date": "2013-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OoixMRc9yd4D1TPAKR3mjg", "review_id": "ZiGHeJ6GoK0c0QB569056w", "text": "Steve is great. Quick service and great communication. Convenient location, walking distance to S. Tryon St.", "business_id": "sctg5U2PEmGoxyPQx5lYgQ", "stars": 5, "date": "2015-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "QlOc_cKy_7Fs-Pg0vi9NAg", "review_id": "CLPeA4UBMnhLhDwPn5-YZg", "text": "My car wheel was making a dreaded clunk clunk clunk, it sounded like a CV joint problem.  I dropped it off, they called me later and told me my car had different size tires on the back and they needed to be switched to the tune of $19.99!!!  A dishonest mechanic could have taken me for a CV joint ride, but not these guys!!!    An added bonus is, if you drop off your car, there are plenty of places to walk to, even go to the movies.  I love an honest mechanic!!!", "business_id": "-_SZy-tV0oNRiFgMStMdyA", "stars": 5, "date": "2009-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ncHyBw9G0ez6bpbZtaFtjQ", "review_id": "ikSinbX9fXxVCCVYoj9ikA", "text": "I needed an oil change and tire rotation this morning; I noticed that there are TWO Firestone stores on Park Rd., within 1/2 mile of each other.  I stopped at the \"other one\" first, as it was the first one on the left as I drove south on Park.  It took 10 min. for someone to come to the counter, only to tell me that there is a 3.5-hour wait for any service.\nI promptly left, and went to this Firestone, where they immediately took my car in, and in one hour, I was back in my vehicle, on my way.  \nPlus, you can have breakfast at the Park 51 Cafe, right behind them, while you wait.  What a great deal!", "business_id": "-_SZy-tV0oNRiFgMStMdyA", "stars": 4, "date": "2011-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jYTx4Gxip4HlABQ1zcID8Q", "review_id": "WC5HuUae8Ob4jHpp83oF6g", "text": "Awesome service here. Making an appt was a breeze on the phone and Scott was very helpful at the front desk.\n\nWas having tire issues and got them balanced at another Firestone. They took it right in and checked it out and rebalanced them for no charge. Faster than the time they provide. \n\nAll around awesome prior military guys who do good work. Whenever I'm in Charlotte they will be my go to place.", "business_id": "-_SZy-tV0oNRiFgMStMdyA", "stars": 5, "date": "2013-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G_7D8VT8wQ6nufCBsX9DPw", "review_id": "LJyrc4GbMcvHoUQUMAFP0g", "text": "Had my brakes routine checked here and a squeal started immediately after they serviced them.  Returned it twice for adjustment and the problem got worse with an added \"pull\" to one side when driving.  They couldn't find any problem.  Took it to another local place (Woodies) and it was fixed first time.  I got the feeling Firestone didn't want to warranty their work and just focus on getting the next sale.", "business_id": "-_SZy-tV0oNRiFgMStMdyA", "stars": 2, "date": "2015-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Bwt0VO08UL0orh4-Ej0Wtg", "review_id": "d6g83D-gceE2XSH3Z0P5tg", "text": "I would NEVER suggest that anyone shop for a used vehicle at this Ford dealership.  The used car Sales Manager is lacking character and integrity.  They had a vehicle priced online right at the price we were looking for so we went in to see the vehicle.  It was a very basic, no feature vehicle for a college student.  Once we agreed to purchase it, they came out with a price $1000 higher than what was listed.  The Sales Manager came out and tried to make excuses for a 3rd party company that posts their sales ads and that it was their mistake...we told him it wasn't our issue.  He then proceeded to LIE to us about the costs they put into the vehicle...since they would never put into it more than what it's worth.  This man should not be in the position he's in, as they could have easily made up for their $1K mistake just in the day and should have honored the price they advertised...and to sit and lie to our face?  Get some integrity loser!", "business_id": "j3nqWy30B-663uuc1AbDbQ", "stars": 1, "date": "2013-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OKKLMzuWsuS5M1XQGwojsQ", "review_id": "2b8JeqrBOdyEBEuMxpKr7A", "text": "In a time where extraordinary service is at a premium, the Town and Country staff is the best. In particular Freddie Skipper. Freddie provided me with the most incredible experience I could ever have in buying a car. I wasn't even in the market at the time, but after reviewing where I was with my existing payments, we were able to save me money and get me into a new vehicle months before I ever thought I could. Thank you very much Freddie and the team at TNC Ford....you are great!", "business_id": "j3nqWy30B-663uuc1AbDbQ", "stars": 5, "date": "2014-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "e4vO7OX1T4CisZPw8aiwvA", "review_id": "bNzHDRCBcdNa9Ut8Q7MnFQ", "text": "not happy with this dealership because you cant reach anyone in service and it goes straight to the answering machine and then they never return your calls.", "business_id": "j3nqWy30B-663uuc1AbDbQ", "stars": 1, "date": "2014-11-18", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "xZTXoZDIFmSdD-lwGdUxFw", "review_id": "3jd0QvRLpd2NsB6cLtn2Fg", "text": "Probably the best customer service I have received regarding cars. The sales person took care of all my paperwork, took my rental and returned it for me, drove with me to the gas station to fill the rental car up so I can take off from there with my new car. Got me approved, helped me to set up my car insurance, will register my new used car for me (getting the license plates), got me a good deal, sold me a nice car with a recent inspection...what more do you need?? I hope I will not have to buy another car soon, but if I should..my first stop will be there. Thank you!", "business_id": "j3nqWy30B-663uuc1AbDbQ", "stars": 5, "date": "2015-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mRVrjfSyv4X0c0h2u_OdYw", "review_id": "uQwo3aaLbi4xx5QGDonqsg", "text": "I've been getting my SUV serviced by them since I moved here 3.5 yrs ago.. Never had any problems.. Just good service and good customer service. I was just there this Saturday morning.. In and out.. Bravo Zulu!", "business_id": "j3nqWy30B-663uuc1AbDbQ", "stars": 4, "date": "2015-10-13", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "XTWcOMinYnnwbk4_3pQZpQ", "review_id": "GP2xTw17TsyrrmFoFFp7LA", "text": "I have bought 4 vehicles from Town and Country Ford.  They have always treated me great.  Just purchased a f150  and I have to say the new one on one experience was great.  The truck was exactly what I wanted and I love it.  I decided to use my bank which I have never purchased a vehicle like this.  Helped me every step of the way.\n      The only reason the is not five stars is because of one of there managers.  He came over and said a couple of thing that just stuck me the wrong way.  Told my experience guide I didn't really like that manager.  I don't know if the guide said anything to the manager but he never came back over.  \n      I thought maybe it was just me and not the manager that maybe he was a good dude.  I told my buddy who was looking for a truck to go to town and country.  Well he had the same type of problem with the same manager.\n        Overall there was no hassle and I still had a great experience.  The sonic experience is the way to buy a vehicle.", "business_id": "j3nqWy30B-663uuc1AbDbQ", "stars": 4, "date": "2015-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "GRiX5F5zgJiQQ1NyV3B6Cg", "review_id": "utIVfDlIram1i-RsR-DP2g", "text": "I wish I could review the Folger Subaru Service Center separate from the Sales Team / Dealership, but unfortunately they go hand in hand. \n\nPer my previous review, the purchase and financing process is fantastic here. Easily five stars - the staff is friendly, knowledgeable, and a pleasure to work with. \n\nBut... having had the car for a few months now and having dealt with the Service department, I have to drop my rating. Service is a 1/1.5... Sigh. \n\nSpecifics: \n- When we purchased the car, it was mentioned that the first year/two oil changes would be free. In my naiviete, I didn't think to check for something in writing to confirm that. We took the car in for the first change and explained to the attendant that we'd just purchased it and this was the first oil change, which should be free. The attendant asked if we had any paperwork on that (which we didn't, so tough to argue it) and that it was no problem and he'd look it up for us. Naturally, there was nothing in their system for it so we ended up paying 70 bucks for an oil change I could have done myself at my house for 30 bucks. Oh, false promises...\n- Moreover, it took the service center more than TWO HOURS to change the oil. I'm a not a patient person; I understand that. But really? Two hours? A job that takes, at most, 10 minutes? Urrrgg. \n- More false promises: my girlfriend bought a car; I then bought a car. We were told that she would get a $100 check for the \"referral\", since technically she brought me in. Hey, I don't really care about the hundred bucks, but that was really cool of them. Except that we never actually received any check. I'm not sure why they even mentioned that if they weren't going to follow through with it? Odd. \n- Last Straw: It took forever to get my license plate from the purchase. Two and a half months went by during which time I contacted the dealership multiple times (only of half of which they actually replied to). So, finally I decided to just show up and say, \"Hey, what's the deal?\" I was told I had to bring the car in and get it inspected (why I would need to do this, I can't fathom. Should the brand-new car I just bought not have already been inspected? And why would it only be on the fifth time I asked about it that they would mention this? Hrrrm...) Anyways, I consented. I made an appointment to bring the car in at 8am on a Saturday. I got there at 7:55. Around 8:10 I was greeted by an admittedly friendly chap named Larry. I then milled around for 90 MINUTES... An hour and a half for an inspection (that should have been done before they sold me the car...)? Unhappy, that made me. Combined with the two-hour oil changes from a couple weeks prior, I was pretty well done with this place by then. Then when I went to \"check out\", they tried to charge me for it. I explained the situation and they asked if I had a coupon? Why would I have/need a coupon? Fortunately, my seething rage was enough to convince them to relent and just let me leave in peace. A few days later I got a call that my plate was in and I could \"come pick it up\". I was like, \"Um... no. Mail that thing to me.\" Long story short, I'm pretty sure they just forgot to file it. \n\nSo, in the end, my recommendation is to confidently buy a car from Folger Subaru, but make sure to follow up on your title/tag/registration, get any \"promises\" they make in writing (which is really just car-buying 101, my bad), and then never go back there again.", "business_id": "gdaFZvWpmWIDri1Fv9PEHA", "stars": 3, "date": "2013-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "sehe8YuVgA0nsmiouoSVag", "review_id": "3g-MRkiTROgz81gBLMMROQ", "text": "My wife a I went there with the intention of trading in our vehicle and purchasing a 2014 Forester.  We drove 2 hours each way since our salesman, Jim Gamble seemed eager to make the sale.  Our experience was abysmal.  We excused the dilapidated building, dirty bathrooms, cheesy \"Sales Tower\", and carnival popcorn machine and helium balloon canister.  We really wanted a new Forester.  Price offered on the new car was adequate, but we were offered what our salesman called an \" AUCTION PRICE\" for our low mileage, immaculate late model vehicle.  FYI, to Folger Auction Price is less than most rough trade in prices listed in NADA, KBB, or AutoTrader.com.  Jim also told us about the bloated add on fees (doc fees, extended warranty, service plan, and my favorite- Cop Dots) which are all conveniently added in to the sales price.  I rate Cop Dots right up there wuth the old window etching, scothguard and undercoating.  Actually, going to Folger Subaru is like car buying used to be 25 years ago.  Luckily, we found a Subaru dealership in Mooresville and saved $$$$ and felt much better about our purchase.  Smart and savvy consumers beware!", "business_id": "gdaFZvWpmWIDri1Fv9PEHA", "stars": 1, "date": "2013-10-23", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "4GX9hQbsHFNf0Hk_9CT7nw", "review_id": "ODafNWU5KkblqNTUhnFvXg", "text": "Ok, so I've never actually bought a new car in my life until yesterday, so I don't have a gigantic frame of reference, but I was really satisfied with the service I got from Clarence, my sales rep.  \nWe bought a 2012 Sportage to replace our 08 Sorrento.  Throughout the process, Clarence was on it!  He clearly explained all of the numbers without the expected song-and-dance of the stereotypical car sales guy.  He was very easy to talk to, listened to my fairly picky set of requirements and conditions regarding my trade in and the new model, and was available to answer questions when I called him almost every day for a week.  He even picked up on the golf course on his day off.  \nMy wife and I both have credit scores that accurately reflect our long history as drunken restaurant employees, so we ran into some issues when it came to obtaining financing.  Several dealerships turned us down, including two that offer a 'Guaranteed Approval' promise.  Clarence and his finance department guys worked for a week on getting us approved.  They worked the numbers back and forth, helped us out on the price, and got us squared away with exactly the car we wanted.  \nThe car is warrantied for 10 years/100k, but I'll be calling Clarence again in 3 years for a new Sportage.\n\nPros:\n- Friendly, helpful staff\n- Good selection of cars\n- Really went the extra mile to help us get the right car\n- Solid service department\nCons:\n- None that we could see.  \n- They wouldn't let us take the cardboard cut-outs from the Sorrento commercial home with us.\nSide Note:  If you're in the market for a car, check out Kia.  If you're in the market for a Kia, BUY THE SPORTAGE EX, IT'S SUPER AWESOME!!  LIKE, DOUBLE RAINBOW AWESOME!!", "business_id": "zpNqsFrhLJlxAtPrSkbImg", "stars": 5, "date": "2011-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6pjM27T9BTwniR_7oh65Fw", "review_id": "H7O3aTgWBpGNhsOb1m2chA", "text": "If you like lip service, then this place is for you. Made appointment to have routine service done ($1000)!!!!\nThat does not cover the warranty work they had to perform either. \nPromised to have loaner car for me. I showed up on time . They had all my information and NO CAR. So insult to injury... Give up a weeks pay and then have to be late for work!  These guys like one thing.. YOUR $$$$!!!!\n\nIf you like lip service, then this place is for you. Made appointment to have routine service done ($1000)!!!!\nThat does not cover the warranty work they had to perform either. \nPromised to have loaner car for me. I showed up on time . They had all my information and NO CAR. So insult to injury... Give up a weeks pay and then have to be late for work!  These guys like one thing.. YOUR $$$$!!!!", "business_id": "zpNqsFrhLJlxAtPrSkbImg", "stars": 2, "date": "2012-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "emWlVqIQPp0bSLcwxwEiIw", "review_id": "4bHMifw0b-aMORlvm4k4fQ", "text": "My review pertains to the Collision Center.\n\nThis will be short and sweet. My brand new 2012 Kia Soul was totaled by a drunk driver, and was taken to the Folger Kia Collision Center (as I bought the car at the Folger Kia beside it) for evaluation. I live in Savannah, Georgia currently for school, but Crystal (the manager) was highly communicative and on the ball. She was prompt with returns, and very helpful during the entire experience. Any paperwork I needed or wanted was given to me without question and in a very quick manner. \n\nCrystal and her team did a great job with inspecting my car fully and making sure all parts were accounted for. I'm very thankful that this was the place my car was taken to, and can't wait to give them my service again when I purchase another Soul.", "business_id": "zpNqsFrhLJlxAtPrSkbImg", "stars": 5, "date": "2012-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4tVOrKQsiE98P7ToBCgFgQ", "review_id": "1wB3n6JU1-qkLDBamc_y2w", "text": "I had a wonderful experience at this dealership. Although I didn't end up buying their car, I felt that the salespeople were courteous, kind, and most importantly honest. Aft explaining a frustrating experience at another Mazda dealership in town, they were very up front and candid with me. Honestly, I would have bought their car; the only reason I didn't was that I preferred another more.", "business_id": "hcjvUppdf0lvYnIyjYOi3g", "stars": 5, "date": "2013-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "-_1ctLaz3jhPYc12hKXsEQ", "review_id": "RGdrzzA_kl2ti93BEVIWcw", "text": "I have been really happy with the service at Compact Car, but there was one thing that was always at the back of my mind - their waiting room really sucked.  It wasn't enough to keep me from giving them a fifth star, because I've always been happy with their service, but it was really bad.\n\nWell the last time I was there, I was amazed to find out that they had done some work to the place.  No more do you have to cram yourself into the front room (about the size of a small coat closet) or hang out in the back (maybe a walk-in closet).  They have apparently done some remodeling and now there is a spacious waiting area with the vending machines, a bookcase - with books - and they even offer wifi.  Sweet.", "business_id": "F5DJEqbNveNq8x94XU_Vqw", "stars": 5, "date": "2010-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EmArNT-fovBi70QFgSIgwg", "review_id": "8wSOaCjcnc0wzEv2NMfAig", "text": "If you own a Honda/Acura go here. Seriously. Just go. Hands down best in charlotte. Ever.", "business_id": "F5DJEqbNveNq8x94XU_Vqw", "stars": 5, "date": "2013-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ilpmb35WXONLb1I3gEeVpw", "review_id": "dyHq9fvT-XKjovdrgrKDFQ", "text": "This is the most awesome place to get your car serviced if you have a Honda/Acura!  They are knowledgeable, friendly, do great work, and don't price gouge.  I got to where I would not take my car to be serviced as a woman, because I was always taken advantage of.  Compact Car Service has proven to me time and time again that they can be trusted.  We thought we needed new brakes 6 months ago and they told us we still had some time on them.  They could have easily sold us new brakes and we would have never known.  Recently both of our Acuras have been having problems and they have worked with us to figure out the problem BEFORE having us spend a lot of money to do something they think \"might\" be the problem.  They have spent a lot of time on our cars, but until they find the problem, they haven't charged us.  I don't know anywhere else in Charlotte that would have done that.  They are good, honest, hard workers who don't take short cuts and don't sell you things you don't need.  I didn't think a car service place was out there like this.  We are so thankful we found such a wonderful place to take our cars.  Keep up the good work Compact Car Service!!!", "business_id": "F5DJEqbNveNq8x94XU_Vqw", "stars": 5, "date": "2013-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-31NhL01-zaBdOTAy718dw", "review_id": "NcYJTev5ZQQjy8I2WOmuTQ", "text": "I can't say enough good things about this place.  They know what they're doing, they work with you to fit you in, their prices are fantastic and they explain things well without making you feel silly because you don't know mechanics.  I also really appreciate the clean, smoke/grease-free waiting area.  Compact Car Service is three steps above most car shops in my experience.  This was a great experience; I'm thankful I went there and I recommend it highly!", "business_id": "F5DJEqbNveNq8x94XU_Vqw", "stars": 5, "date": "2015-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B0RM_KxQHKwxrKDuvUTLwg", "review_id": "mX5z07Rs5DPgtZBMyeIbdA", "text": "I have been taking my car to Coulwood for years... I live about 30 minutes away from them and I still only take my car there. They are very honest and have great prices on top of the line tires, and they also have done other work on my car that.... had I taken it to the dealership... would have cost me over $600, and Coulwood charged me significantly less! \n\nAs a female, I have been ripped off at SO many auto shops, but never here. These guys are great!", "business_id": "EF4UNFplUpjEEx9LglIR_g", "stars": 5, "date": "2015-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "42Pq0flXlYFn7jnN8IWe_g", "review_id": "R5dTP21rZuereYAeyUgCwA", "text": "I had to replace a tire with a slow leak.  I was in and out in 20 mins.  I've been here a couple times now and wouldn't hesitate in coming back again if the need arises.  Nice staff.", "business_id": "VkAqGYd5TOMgO4yXo2fjuQ", "stars": 5, "date": "2015-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xVmOXwrP3sz99J_JqK87Gw", "review_id": "N9P1om6xdTB2wQTowCDuqA", "text": "After being nickle and dimed about our trade-in to the point were we were about to walk out the door, our front tire goes flat the next day. After re-inflating it continues to lose air and we have to bring it to a garage due to being stranded. They showed us a defect in the tire where the side wall was bulging out the size of a golf ball. The garage mentioned that if we were on the highway we could have been killed as it would have been a total blowout. We then bring it to the Charlotte Volvo for repair and they send us a picture of another damage where someone had previously patched the tire. We then have the same sales manager for the next  2 months do the biggest finger pointing game we have ever seen. Calling and emailing that they are not responsible. Wow, 3 days after getting the car we had to have it towed and he is finger pointing. It shows what type of operation this is with no concern for our safety and the risk they put us in.", "business_id": "UWtpIca-ub74r6Lgwfu0Og", "stars": 1, "date": "2014-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "YQ6gEhylZCYh1psIaGvXwA", "review_id": "9IbRmpVuJevV_53-C6pi1A", "text": "Go to McFarland & have Bill take care of your car: superb work, wonderful man, quick service, & great price. I was sent to him by one of the best auto repair shops in Middleton with the promise of excellent care and was far more than satisfied. Though I had to rent a car for two days, the additional price was worth it:  the paint job was terrific. Bill and A-One are first rate; no one could do a better job.  An adventure awaits you: totally worth the ride. Tip handsomely!", "business_id": "MIqx6o7Tpu0A_y0RKlNsxw", "stars": 5, "date": "2015-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S59SgfmhWoWCsx_86wQWyw", "review_id": "IUTDRJq8-89ila-TDecrEA", "text": "I can't say enough great things about Dunn's.  I started going to them when I bought my Mini Cooper and they have lovingly cared for it for 2 years now.  Jeff and Jason and JT are all fabulous and knowledgable and generally great.  They are consistently good about not charging for extraneous repairs but not to the point that they are neglectful of my car.  I highly recommend them.", "business_id": "O16EckCLtNoA49hewGht_w", "stars": 5, "date": "2014-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XmSPy_RTZArCirAqWsVP6w", "review_id": "EvDGfPR9okPcMQUufa3Q2A", "text": "Usually don't like going for oil changes as i just want the \"basic oil change\",and not trying  to sell me on other things.,I can do basic filters,wipers etc on my own at a much more reasonable cost.This place was different.I was told by the friendly and professional manager [Patrick White] only of things to keep an eye on.As Heathers review indicates, fluids were topped ,interior vacuumed.windows washed and I too was in and out in 15 minutes.All for 29.95,the early bird special price [before 10am]..A painless experience and I too will be back.", "business_id": "ugGTR2EvJ0c_-TpMS1LSNw", "stars": 4, "date": "2012-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XmSPy_RTZArCirAqWsVP6w", "review_id": "l3xTa_HFwicU6qaHHMQRpg", "text": "Have had my oil changed here for the last couple of years..Continues to be friendly,speedy, and professional with little \"up sell\" pressure..Melissa has been especially accomodating and helpful..", "business_id": "ugGTR2EvJ0c_-TpMS1LSNw", "stars": 4, "date": "2014-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "vUiLO-EfTnPzfDuhJMF_rA", "review_id": "_CKiiEnqAoxQRisN6Sxhmg", "text": "My wife's Mini Cooper had to have its engine replaced. She no longer felt comfortable driving that car. We visited Nissan, Honda, Toyota and VW dealerships and ultimately had the best experience with Zimbrick VW in Middleton. Otto was very helpful. He was not pushy and gave us all the information we needed to make a decision.\n\nZimbrick made a very fair offer to trade in the Mini but we ended up selling it ourselves. Once my wife's car was sold, Otto made the process very quick and easy so we had her in her new Passat the same day. He even stayed after closing to walk her through setting up her new car!\n\nWhen I replace my Toyota RAV4, I will definitely consider Zimbrick VW.", "business_id": "uyp8kpTXKfKXvAB8HdJSAA", "stars": 5, "date": "2013-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L1YpzZ3z8aaGvuFEC7yYXg", "review_id": "hmQx7U6A4p6WIg8Q6FEQyA", "text": "4.5 stars for a minor oversight.\n\nCalled to have nerf bars installed on Tuesday.  They said they would order the part and have it by Wednesday. They said they would call when the parts had arrived. I called them on the following Monday as I still had not received a call.  They apologized and stated they would look into who had failed to call. \n\nIn the mean time they asked me if I could bring the truck in right away. I was able to. They were able to get the bars installed in less than a half an hour and expedited the process by having 2 people work on it.  All in all, 4.5 stars just for the minor mistake, which happens due to oversight. Just shy of 5 stars. Will be back!", "business_id": "XCfRPJ9UCgd1dPkzXRsjPw", "stars": 4, "date": "2015-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zMzVLKJ-cC14zRrF0ogEkQ", "review_id": "oLGdwmQ739MknDv03rnAkw", "text": "I had a great experience with Tom's Auto Clinic.  I was dealt with in a friendly and straight forward manner.  The price seemed very reasonable for the work that was done and the turn around was pretty quick.\n\nAll of that aside, what I was most happy about was the feeling that these are honest people that won't screw with me.  I get pretty nervous when looking for a mechanic because I know that they have me at a pretty serious disadvantage (I can't really tell my catalytic converter from my flux capacitor).  \n\nWhen the work was done and paid for I walked away feeling like I had gotten a good deal, and that's key to my return business.", "business_id": "XStsiplxlx8Guqf-oV5LAw", "stars": 5, "date": "2010-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KacDtnCV5PFTZf7mEY-ekg", "review_id": "eKKvShSgYn_OmZE--L3nzA", "text": "My husband and I took our car to Steve and Marylynn for years before the car succumbed and we bought a VW diesel so had to go elsewhere. These two are so experienced and honest - it was really a pleasure working with them. We also appreciated their no-nonsense, straight forward approach. We love our VW mechanic but we miss Steve and Marylynn.", "business_id": "XStsiplxlx8Guqf-oV5LAw", "stars": 5, "date": "2011-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "iDvcS75AzpGTyNO0gXtKHg", "review_id": "SWU1QrsPniKq8RhKOm1Cfg", "text": "Left for work this morning in the pouring rain only to discover my windshield wiper blade was completely broken (no idea how this happened).  Tom's is right around the corner from my house, so I stopped in and told them my problem.  They replaced the blade and had it fixed in under 5 minutes...and only charged me $5!  So incredibly helpful.  I will certainly go back if something else happens to my car.  Thanks guys!", "business_id": "XStsiplxlx8Guqf-oV5LAw", "stars": 5, "date": "2015-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "hiJQnR90oBQCgzwE83SsyQ", "review_id": "mTQlGa-cr4DzwM03tZN-yg", "text": "Jeff came highly recommended by a whole slew of friends. After getting a few estimates for my muffler that were between $400 and $500, I took it to Jeff, who came in at $170. I was highly suspect of the other places trying to rip me off, including the place that had replaced the entire exhaust system a year prior. The repair was done quickly and flawlessly. No one is there to answer the phone, so leave a message and Jeff will get back to you pretty much right away. This really is as good as it gets.", "business_id": "Slv6Y4kw_wzZjbiVERII5g", "stars": 5, "date": "2014-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gDEo_V6QjFPp-B7rS90_Dw", "review_id": "ZHfjcGpA783zZvUSJIbbyA", "text": "My car needs some costly work done, so I took to asking friends for recommendations. A collegue pointed me to Northside. It took a while for us to schedule something because we kept playing phone tag. But everytime I left a message, Jeff returned my call within the day. His estimate for the work was a significant fraction to what I'd originally been quoted.\n\nAs long as they can fix it, I'll be taking my car there!!", "business_id": "Slv6Y4kw_wzZjbiVERII5g", "stars": 5, "date": "2015-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9JvFO1vnsfsSNItzq6axmw", "review_id": "drxk-KJ3FrO0nhTghRMiwA", "text": "Overall I think Firestone is a rip off but I go there because of the credit card. I prefer the East side location to the west. Bill S. Is very helpful at East.", "business_id": "Yn89vJYXcdprx9U_w1qmMw", "stars": 3, "date": "2012-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "nAcKWYGMhnyOwUEdCOO34Q", "review_id": "0VCzHuHlJJlBf-uZuv-Rbw", "text": "Came here for an oil change on the weekend and an inspection. Overall, it took about 2 hours which isn't bad for a Saturday afternoon. When I returned to Firestone later that afternoon, they gave me a huge list of things wrong with the car which I knew before I came in the place. I didn't get my car completely fixed but I had a wonderful conversation with a woman named Christine who works there. She gave me so much great advice and I appreciated her honesty! If I asked a question about the car and she was unsure, she would walk through the garage to find someone who knew. I appreciate that more than anything because some people will just tell you what they think you want to hear.", "business_id": "Yn89vJYXcdprx9U_w1qmMw", "stars": 4, "date": "2015-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ctvJQmi5EEBndDQ0X1uDcg", "review_id": "bhuHLZ-Q24367RYS4K8r_g", "text": "Extreamly helpful. The car just randomly broke while my fionce wason her way to work, she turned off the main road and ended up at Chets. They said they'd fix it that day and even gave her a ride to the west side. After work, she went to Chets and picked up the car. They fixed the problem and also informed us that the power steering was leaking (we knew something was up with it already). They filled up the power steering for free and told us to come back when it started making the noise we had heard before. \n\nAt that point we actually decided to go to a few other places to fix the car and two places quoted us over $500, and told us it would be a week. Chet's told us they could do it the next day and the total bill was $210. \n\nWe will come here first from now on!", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 5, "date": "2010-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0gnHHAaw8fimmvrR3Mo3dw", "review_id": "qe4hLBeL0JSrzP3ngGBpOg", "text": "Came to Chet's because of the good reviews it got on Yelp! Here's another one! \n\nSo I don't know crap about cars. Unfortunately, this fact shines through when asking my questions about my car (\"oh the year of my car?...um...I..uh...don't know off the top of my head\", \"was my temperature gauge high? well...uh...no lights lit up on the dash...?)  Yeah, I'm a prime target to get scammed at a auto repair shop.  So when smoke started coming out from under the hood, I was pissed and fearful of taking it to a car repair shop.   But Chet's was super nice and helpful!!  The guy taking all my information at the desk was incredibly cheerful and happy to have me as a customer. Their reception area is pretty nice too (especially for a car place). And when I found out my car had to stay at the shop for a few hours, they offered me a free ride home.  My car was diagnosed, fixed, and cleaned up in a few hours and they didn't charge me through the roof for it!!  \n\nDefinitely coming back to Chet's the next time my car is being a piece.", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 5, "date": "2010-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7la3qalCjgbpxCEBYJOV4w", "review_id": "qc8KEmKDGqqJ2DXHFRv9Dg", "text": "Honest, friendly, clean and efficient service.  I will be returning here again for all my current vehicle's maintenance needs - which should be relatively few, according to the mechanics at Chet's, who could have frankly sold me quite a significant line of bull about that had they cared to.  In and out for an oil change and tire rotation in about an hour and for about $40 total.  Thanks, guys.", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 5, "date": "2010-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "RdufJ-Wl0abkMOlE2WNaLw", "review_id": "xKgRLw24YpeWhUhjKUVu6g", "text": "My Toyota Rav4 had a hole in the muffler. I took it to Chet's for an estimate. After his guys looked it over, he called around for a price. The parts place told him $1300.00. He said that seemed crazy and called another place, same thing. Then he tried to figure out different options. He called the Toyota dealership to see if the muffler was still under warrantee, and because the catalytic converter was inside the muffler, it was still under warrantee.\nI took it to Toyota and it was fixed for FREE.\nI have never had a place go above and beyond like they did at Chet's. This is a place you can trust. I will bring all my vehicles to them.", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 5, "date": "2011-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "9TDqZLPsOgWERXii_etbcw", "review_id": "SMLC4BQNinXTLWTH4WaRbA", "text": "It's hard to find a good auto repair place where you won't get taken advantage of.  Because of the great reviews on Yelp, I drove out of my way to take my car to Chet's.  I'm a young woman with an old car that I didn't want to put a lot of money into.  I just need my car to last me another year or so until I can afford a new one.  I dropped by Chet's without an appointment or anything, and one of the mechanics came out to the parking lot to take a look at my car right away (free of charge).  He actually got on the ground to peak under my car, and he knew what the problem was in less than a minute.  He answered all my questions, and I arranged to bring my car back the next day to get fixed.  When I brought my car in to get fixed, the guy at the front desk recognized me right away and slipped me a coupon from their ad for 10% off my services because he knew that I didn't want to put a lot of money into my car.  I was taken aback by his thoughtfulness.  The mechanics kept me informed as they were working on my car, gave me the estimate, gave me their opinion, and answered all my questions.  All around great service at a reasonable price.", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 5, "date": "2011-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "fzvX93h2jQtnp5g7I0Ehaw", "review_id": "bLhddty3lSOio-kg7DJaQw", "text": "Was so impressed with this place. We called them this summer, knowing we needed some serious work done. After reviewing many places online, we decided to go with Chet's due to their high Yelp rating. From start to finish, superb service. When I called, the guy answering the phone was nice and helpful. We brought the car in the next day and they offered a ride. They kept us informed throughout the day about what was going on and what the cost was going to be. There was a LOT of work to be done, so they kindly asked if they could keep it overnight. The next day, we got the total, which, considering all they had to do, was very fair. Also, the mechanics talked to us in both simple terms (so a non-mechanic could understand), but didn't treat us like we were stupid. They were honest and detailed. Will get my car care from them!", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 5, "date": "2011-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iSZ0G9l_Vb1PnXZtOnuHyw", "review_id": "V9xUmU5pjhDvzfz39-cZ6w", "text": "I popped in because my tire pressure light was on, and also because I had bought my car a month ago with a little over 100k miles on it and I wanted to make sure everything checked out. An energetic guy by the name of Roman checked out my tires while humming merrily, and then answered all of my new-car-owner questions about maintenance for the next ten minutes. After everything was set I asked where I should pay, and his response was, \"Pff. Air is free.\" So is consultation, apparently. Very generous of them.", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 5, "date": "2014-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "wE7kSbc96IIXpQxJgLrGMQ", "review_id": "Z9swGe7KNfz6Tg5QCnodDw", "text": "Chet is an old school stand up guy with professional integrity that you don't see so much of anymore. My storage rental experience could not have been better. He let me use as many of his pallets as I needed with no extra charge; he was extremely kind about every interaction. My deposit was returned immediately with a hand written thank you note from Chet. I mean, who does that? I had zero moisture or mold issues with the storage unit itself, although everything was in there for 2+ months thru the hot, wet, humid end of summer. Extremely pleased. Can I give six stars?", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 5, "date": "2014-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hpRLi-BUTn3utVLxfBoxYQ", "review_id": "b6puSh0pEjJAhxqkX2iG3g", "text": "This guy is a crook.  When I took my vehicle to my regular mechanic he was so pissed he wanted to know who ripped me off!!", "business_id": "BRqIGc5nGobwIVxX9vxyig", "stars": 1, "date": "2014-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "faFyvwwZY6cG8UdTPeHZBQ", "review_id": "70uzS74qcaXenXNVLhj_8A", "text": "I'm a big fan of Seversin's. I've taken my Subaru Outback to Seversin's several times for oil changes and other repairs. They've saved me hundreds of $$, suggesting a less expensive way to fix a crack in my engine block (I think?) that was leaking coolant and also plugging several holes in my tires, rather than trying to sell me new tires. I really appreciate their honesty and patience with a non-automotive genius like me. I highly recommend Seversin's for honest, fast service you can count on.", "business_id": "IFzagko8Y344ajAhWOxnUw", "stars": 5, "date": "2011-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h4fjgz-44HFE_kGy6p8P-w", "review_id": "wHA7JrPKRloQBpUuADgUqg", "text": "We've been here twice since moving to Madison, as they're the closest shop to our home. \n\nI'm in two minds about them, so hopefully this doesn't get too long.\n\nOur first encouter with them was when we were in the middle of moving from our hotel to our apartment  over the weekend and our brake line went. We went in on Monday morning and asked them to tow it to their location from the South Towne shopping center. They did so ($60 for the tow), and had our car fixed by Wednesday morning. The price was high, but not higher than anywhere else, but not the best deal, either. So, reasonable.\n\nHowever, as I was driving the two blocks home, one tire went flat. I walked back, told them what had happened, and let him know we had previously had no issues with our tires. I asked if he could tow it back or if it would be safe to limp, and he said he couldn't tow it as their tow truck requires inflated tires (cue my suspicion of how my tire went flat in the first place), but they would also charge me for the tow. So I decided to limp the car back. At this point, my opinion of them was pretty low.\n\nHowever, as I got back to my car, the service man drove up in the tow truck and said that he wasn't sure if it was safe to limp. He checked out the tire, figured out that he could try to patch the bead, so he just took the wheel back to the shop and patched the bead. Only charged me $10 for that whole fiasco, so after that I had  a pretty good impression of Seversin's\n\nOur second encounter was more recent. We hit a deer with a glancing blow. We were pretty sure that the car was mechanically fine, but we wanted to get it checked. In addition, one headlight assembly was toast, so we requested that they replace that and realign the other headlight.\n\nIt took almost a week to get our car back from that, and when we did, it was making a new sound -- bubbling. After a bit of research, it seems this can be from low coolant. We refilled our coolant, and as of right now things are okay, but I am really disappointed that they didn't address that issue, or at least tell us -- especially as the body damage was near the coolant reservoir and radiator.\n\nHowever, their customer service is pretty good, and they're convenient. They also look to be good for regular maintenance.", "business_id": "IFzagko8Y344ajAhWOxnUw", "stars": 3, "date": "2011-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "KacDtnCV5PFTZf7mEY-ekg", "review_id": "HvbOWPa3GsZXnl15q2agiQ", "text": "If you have a VW, just take it to Dave and know that you took it to the best place around. Dave is as good as others have said - ethical, honest, responsible, hard-working and very, very knowledgable about all things VW. We've been going to him for three years and have been very grateful to have his service - such a relief to have an expert mechanic we can consistently rely on and trust.", "business_id": "IlE4UouTsBEGiJ_bNrb5ug", "stars": 5, "date": "2011-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-GYSHHxHYd6uTrqlTw_OGg", "review_id": "CChJ-bpvMw6QOLgxAkgBpQ", "text": "I've been bringing my cars to Courtesy Auto for over 20 years.\nALWAYS top notch service, honest, reliable, never upselling. Thanks Dave!", "business_id": "IlE4UouTsBEGiJ_bNrb5ug", "stars": 5, "date": "2015-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ISwiZNOXrgxlLfVZsGBUww", "review_id": "VkXVo0IJ_pIMYqMoAhgBHA", "text": "In August we had 4 new tires installed.  Whether tires, brakes, or other mechanical issues we have received very satisfactory service over the years.", "business_id": "zHdt_KW2QqgJJ9bLmtShdQ", "stars": 4, "date": "2013-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "u0CXtisz7vv-nLxILHPA2Q", "review_id": "sExKiVcLjqvmtzDcHxP3iQ", "text": "I had my oil changed here a few times and will NEVER go again. This last time I went, it took about an hour (even though they promised 30 min) and I was going to let that go. While driving within an hour after I left, my car began to have a hard time accelerating. It was louder and louder and harder to go up hills. I noticed oil leaking all over my front tires and I was leaving an oil train as I was driving. I was afraid because I didnt know what was wrong. I have a 2012 with 50,000 miles and had never had a problem whatsoever. I called back to Tires Plus, and they told me to bring it in. When they finally took my vehicle in back again, they at first, didnt apologize until they could tell I was upset. They apologized, letting me know they have \"new people\" working and he now has his \"best guy\" working on my car now. He asked how they can gain my trust back, and I told him they can't and I will not be coming back. They offered a free oil change next time, but my thoughts were that I should have gotten this oil change for free/a refund! I am in my early 30's and have NEVER had this bad of an experience with an oil change.", "business_id": "zHdt_KW2QqgJJ9bLmtShdQ", "stars": 1, "date": "2015-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QvOLNXIyHIoptcZfAm381w", "review_id": "tyOD8i9iooZztsIQLHIqnw", "text": "I really trust the guys at Monona Motors. I feel that their prices are fair, and they will explain things in lay-man's terms. I feel fortunate to have an honest, quality garage like this in my neighborhood.", "business_id": "xod-YOn69KMhUHBkd6boOQ", "stars": 5, "date": "2011-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tbor5dK0JcV5a0Up7ZMbpg", "review_id": "w6qLDMkHc2zVQhqPPSuFtQ", "text": "Great work at a fair price. I recommend without hesitation.", "business_id": "xod-YOn69KMhUHBkd6boOQ", "stars": 5, "date": "2011-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MwpWkXZ-eO0BRjRinyxvWg", "review_id": "PZvi1UhBPNd1yF2lAnT4xA", "text": "I just had my first experience with Handel Automotive. Bill, the service manager, was great with customer service, had a sense of humor and was very attentive to me describing the problems. Also, as a woman, he treated me with respect which was a refreshing change from the norm. He also went out of his way to print off an online coupon that saved me $10! I'll definitely be referring people here! Their pricing was great and the service was excellent.", "business_id": "mMiTHeVCf2glBIFFgXqIQw", "stars": 5, "date": "2014-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j8WfOquRF3dXEDntot1vLA", "review_id": "vZL0bB3oNkMyIIS4QsGsTA", "text": "I went to Broadway Tire for an oil change.  I had a Bucky Book coupon for an oil change. I attempted to go to the location on E Washington first, don't even bother trying there.  I stood in the shady looking reception area and was never acknowledged.  I went over to Monona where there were actually people working at the desk.  I received prompt and friendly service.  The waiting room left much to be desired, but luckily I was not there for too long.", "business_id": "kZiRL1dkGowCcL7nM86OYg", "stars": 3, "date": "2012-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f2f7dq0c6-lr2ZEiF2wbMw", "review_id": "1GZdVdLw8lgmbFP0Q5AKSg", "text": "Just a follow up went to Monona location and finally had my oil changed now back because my car is leaking oil. Avoid I would give zero stars if I could.", "business_id": "kZiRL1dkGowCcL7nM86OYg", "stars": 1, "date": "2015-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lADU3qFeNc8Unf0L2TxZJQ", "review_id": "J2uYimf7vGl2fYXTGYiCiQ", "text": "zimbrick nissan eastside madison - Is totally cheating.. Don't believe sales team its all cheating.  I was cheated around 2000$.  I never recommend this showroom.  Gave price quote for AWD and delivered 2WD.  Please be very careful if you still want to visit this showroom.", "business_id": "AJOejrnO0z4lzp_GHO6wUQ", "stars": 1, "date": "2015-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 2}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "-kXjQn9XT-Gws-QRuLb9mA", "text": "Update: 5-stars for parts department; 0 stars for service department. I'll stand-by my previous review for the parts folks. Read on for my experience with the service department.\n\nVehicle: 2000 Nissan Maxima SE 3.0L V6, Automatic, 156,000 miles. Current owner obtained it in 2005 and put on 100,000+ miles. No major issues, ever, aside from \"regular\" stuff. To say the owner knows the car inside out would be an understatement. \n\nSituation: Recently, when the car was in-gear (drive/reverse) and the ambient temperature was below 45F *and* the car was cold (like when trying to start it first thing in the morning), the car would bog down, load-up, and stall. The car would always immediately restart; however, as soon as you put it back into gear, the car would bog/stall/restart until it was fully warmed-up. Once the car was warmed-up (or if the ambient temperature was above 45F), the car ran *strong* - no issues at all. None. \n\nBackground: I am an ex-ASE-certified Master Technician with 10+ years of working on cars, fabricating cars, helping racing teams, and was also an automotive magazine editor for 3+ years. I know cars pretty well, still have 100% of my tools, and enjoy working on cars.\n\n+ We tried several things to resolve the bog/stall when in gear and cold problem. I cleaned the throttle body and idle air control valve, replaced the air filter, thoroughly cleaned the fuel injectors (using a pressure cleaner; didn't just dump STP in the gas tank), checked the TPS voltages (Throttle Position Sensor) and cleaned the Mass Air Flow Sensor. None of this helped when the car was *cold* or when the outside temps were below 45F. It still stalled until warm.\n\n+ I researched various message boards and repair forums, and found a Nissan TSB that said the computer may need a software update to resolve the issue. I don't have the appropriate hardware for this work, so I called Zimbrick Nissan Service. \n\n+ I provided *extremely detailed* information about the issue and the attempted repairs/history. The car was dropped-off on 11/3/15. They provided a free loaner car, which was a great gesture.\n\n- Over the course of 10-days, Zimbrick Nissan essentially guessed at what the root of the problem was. They shared the following as diagnosis (over a 10-day period; it changed almost daily): worn-out timing chain, worn-out exhaust, faulty computer, faulty Mass Air Flow Sensor, some undefined \"mystery repair\" (that they tried, and turned-out to not work), and finally, on 11/12/15, they called to say the car had \"weak ignition coils\" and that the spark plugs were \"gas soaked, fouled, and beyond saving.\" Cost to replace the \"weak coils\" and spark plugs? $859.\n\nI knew that coils do not grow weak, and if they do, they will set a check engine light. The car never had a check engine light with the current problem. There were zero codes and no lights. When I asked for more information, the service writer said they were \"out of ideas\" and \"had exhausted all possibilities\" for fixing the car. Pay the $860 for coils and plugs and then hope this fixed the problem was the only option.\n\nI declined the repair, and asked to have the car returned to its original state. To Zimbrick's credit, they did not charge for the 10-days of guesswork. They held to the original $230 estimate for diagnosis.\n\nBUT... when we went to pick-up the car, we immediately discovered it would not stay running, no matter what we did. It would immediately and repeatedly stall, and, it was back-firing, and running very, very poorly. Much worse than when we brought it in. It would stall and die and belch, even after it was warmed-up. \n\nWe pointed this out to the service writer, who said he'd have someone take a look at it. After 30-minutes, no one looked at the car. We went back in and were told that all of the technicians had gone home for the day, but that there was \"no possible way Zimbrick did anything to make the car run worse.\" He went on to say that because we had \"declined the recommended repair, it was unlikely Zimbrick could do anything to assist us.\" \n\nHe also reminded us that Zimbrick went \"above and beyond to help\" and that we declined the diagnosis for spark plugs and ignition coils. We limped the car home, and I took a look at it the next day. \n\nWhat I found were: four (4) disconnected vacuum lines and throttle cables that were lying loose and not secured in their brackets. This would explain why it was running so poorly upon pick-up. After reconnecting the lines and cables, the car immediately ran normally. \n\nI then did some more Google searching, and discovered that the issue was likely due to a cracked intake manifold gasket. I replaced the $17 gasket, and the car has been running *perfectly* under all conditions. Worse yet, while replacing the gasket, I inspected the spark plugs - they were perfect. Ugh. \n\nI e-mailed Zimbrick, and they seem to feel they did all they could... very disappointing. $860 worth of plugs/coils would've been 100% unnecessary.", "business_id": "AJOejrnO0z4lzp_GHO6wUQ", "stars": 1, "date": "2015-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bPzcpkhSeQDu6WQTUh08yw", "review_id": "gCWejSjEB5NR2aGfE6LcNw", "text": "I just moved into town and needed somewhere to take my 1995 Honda Accord for some routine maintenance--oil change, transmission service, tires rotated and balanced, and a 4-wheel alignment.  I also had noticed what might be a small oil leak, and needed that checked out as well.  I called around to 6 different places, and Dyno-tune was the most affordable.  I was able to get an appointment for the next day, and brought my car in Friday around 9AM.  They were incredibly nice to deal with both on the phone and in person, and I got to talk to the same person each time I called (owner Randy WIlson).  I was charged exactly what I was quoted, with no hidden fees or charges.  As well, Randy said the leak was minor and it wouldn't be worth it to pay several hundred dollars to fix it given the age of the car.  I felt he was very honest and never tried to take advantage of the fact that I'm a 22-year old woman without tons of knowledge about my car.  I'll definitely be taking my car here next time it needs work!", "business_id": "G_NB9evo2fn3_Lgfpap6iw", "stars": 4, "date": "2009-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "p5ht6rQC0NkgdtgY2OlYxg", "review_id": "wqhg1h6HIHkIeoOcD9Mhlw", "text": "I have had primarily good experiences with this garage.  I was referred by a female family member on the reputation that they don't talk down to people who don't know cars very well.  Every visit I've had there has been positive, with the employees being knowledgeable and thorough.  They have some of the best pricing in town as well.\n\nOn my last visit, I came in for a wobbling wheel sound.  They replaced a wheel bearing, but the problem continued.  They did mention that I should also look at some new tires, so it could be that the sound was being caused entirely by bad tires.  I was somewhat disappointed that the problem wasn't fixed, but I can't say that I tried everything.\n\nAll things considered, a good place.", "business_id": "G_NB9evo2fn3_Lgfpap6iw", "stars": 4, "date": "2010-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "sleEMt44E1StWrjz3mcujQ", "review_id": "3jwbj1TU0Waduil3Pkjy2g", "text": "I was very, very pleased with Tatman's.  They towed my car.  They fixed my car.  They didn't send me the same form 4 times to get my insurance info like Carle did, they just called the number I gave them and got the info they needed.  I never had to pay them any money because they were so on top of the insurance, even though my repairs were of the substantial variety engendered by being run into by a guy going 30 mph.\n\nThey told me the repairs would take 3 weeks, and they only took 10 days.  There was a small problem with the remote control locking when I came to pick the car up, and even though it was after 5 they fixed it, for free, right then, and gave the car a thorough inspection before letting me leave to make sure nothing else was wrong, and I was still gone 15 minutes after I came to pick the car up.  \n\nEver single person I talked to throughout the entire experience, from the guy that towed the car to the receptionists to the guy that inspected the car after the remote problem was nice and helpful.  I would definitely recommend Tatman's to anyone who needs body work done after a car accident.", "business_id": "4jlqFH3cZsgRdWxZ6kwwvg", "stars": 5, "date": "2007-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UHgo14XWliFG-hQrhNnSMg", "review_id": "DRBt8Lf6nhONNgD9_7QxiA", "text": "I have used these guys for several services on my Audi, and they are outstanding.  They specialize in VW and Audi, and if I'm not mistaken that's all they'll work on.  One of the owners is a trained VW tech who left a local dealer a while back.\n\nI have an extended warranty on my car that only allows me to go to a dealer for repairs, but given their extensive experience with VW/Audi, my warranty company was willing to let Pro-Tech do the work rather than drive 1-2 hours to a dealer.\n\nPrices are reasonable, service is pretty fast, and their customer service is as good as you can expect from a mechanic!  It's worth saying I get the feeling these guys are super-honest and dependable.", "business_id": "P_X0pRArVxBjCihppLmHJg", "stars": 5, "date": "2012-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ImO6tw7csX57ciBZoV_I2g", "review_id": "-MKwmfZ80U06MfTRAg5Jdw", "text": "They got me in right away, had two new tires on in 45 minutes. Very easy, very informative. Great warranty and support. I'll definitely be back. Thanks, Ryan and crew!", "business_id": "XL5MmKKzob_TIiRW_GnhAA", "stars": 5, "date": "2014-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "99Qos7AunXZnaDogiP847w", "review_id": "QzYNVaCxdo4wDi7_mnjFgg", "text": "Brought my Saturn to Fairfield Automotive and I couldn't be happier. The fuel pump had a component that was cracked and they were able to repair it, rather than my purchasing the entire unit, which saved me the equivalent of my mortgage this month.\n\nI will definitely return and would recommend their service. Very personable and friendly staff, and an overall great experience.", "business_id": "umWStNDUdE1QtbnPjPCfwg", "stars": 5, "date": "2010-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-KZ0k14H3zdZVzEnhVq1ag", "review_id": "zggbK903U1M5_wvesXuFBw", "text": "After getting a brake job this afternoon (thanks, Rusty!), I was reminded that I have been getting great service from Bob and his gang for over 17 years. This is a great shop for getting oil changes, tire rotations, mufflers, brakes, and numerous other basic services. The prices have always been fair, the information great, and the services excellent. I always recommend this Meineke as a place you can trust.", "business_id": "vXxsDHzRvQEhK6YbNs3Nww", "stars": 5, "date": "2011-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Es8RMJe8VR2X1dmrTZhNtw", "review_id": "z94b9IyaNgAemkkkjMugxQ", "text": "If you expect to be treated like a king, don't come here. This is a pleasant, no nonsense car care center. It is pretty standard and this was my first time here so I didn't expect much. \n\n1. You have to get an appointment. You cannot just drive here because they have a set schedule so call ahead, even if it is just an oil change.\n\n2. You'll be greeted by one of the mechanics in a pretty spartan office area where there is a rack of magazines on the wall and four chairs. \n\n3. The basic oil change took about 20 minutes, which included oil, filter, lube, and a quick diagnostic check for about $22.00. \n\n4. My only complaint would be that it wasn't exactly explained to me what was going to happen to my car until I asked. As my first time there, I didn't know what the \"basic\" package included. But I did hear the mechanic tell another customer that, when it comes to repairs, they won't do anything until they talk to you. \n\nIf you're looking for a cheap oil change, this is a good place to go.", "business_id": "vXxsDHzRvQEhK6YbNs3Nww", "stars": 4, "date": "2012-10-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "vOV2AJpBDI6Pqv09F1pnVw", "review_id": "eobFnkBG6HQt7a0NS9t30w", "text": "This is where I take my car when I need a real mechanic (I *so* do not qualify) that does honest work for a reasonable price.  \n\nThey guys there have been unfailingly cool, honest, and affordable but it's also good to know that you're less likely to get screwed here than at a locallly-owned or non-chain joint because they have a corporate structure to complain to if need be.  But like I said, this is unlikely.  Find value, fo real tho!", "business_id": "vA8ed8BFvQxz4HFt8cHd9Q", "stars": 5, "date": "2007-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "-mqE7uZSnGEAb_quhfcyJQ", "review_id": "R95m6Oo97BWI2TjSr0ZEdg", "text": "Possibly the greatest store ever.\n\nFarm & Fleet is the only place in CU that sells fasteners by the pound.  You can get four 3/8\" nuts at Menards or Lowe's in a little plastic bag for $0.99 or you can get ONE POUND of them in bulk at Farm & Fleet for $1.50.\n\nBeen coming here all my life.  Walking through the front door still sends a little quiver up my leg.  Just as it always has.", "business_id": "vA8ed8BFvQxz4HFt8cHd9Q", "stars": 5, "date": "2009-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "D5gjH9Kr6csdd9u6HzYpYg", "review_id": "oJX3eSUI1xp7IaHvBMfbHQ", "text": "I work close so stop here if I need anything for the house or garden.  They have cute decorations for holidays.  I recently bought new tires there and even though I went there ahead of time on my lunch and purchased them and had them waiting for me when I got there after work it still took them almost 2 hours to get those tires on my car!!!", "business_id": "vA8ed8BFvQxz4HFt8cHd9Q", "stars": 3, "date": "2011-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4mi_ispquZs0H6Zu5-EkkA", "review_id": "1cj42UXUmdlxhcjJ5vaQDw", "text": "I don't have one of these at home and I've never heard of them so I totally checked it out.  I can't describe it.  It is mostly gardening, outdoor, tools type of stuff.  Then they have some knickknacks and clothes.  The clothes are perfect for an old lady or farmer.\n\nIt is a an interesting place but I am a city girl so it doesn't have anything that I would ever really need.  I did enjoy looking around.\n\nOne thing I DIDN'T like was that there was not much organization to layout of the place.  The sections didn't seem to be in any particular well thought order.", "business_id": "vA8ed8BFvQxz4HFt8cHd9Q", "stars": 3, "date": "2012-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HWxpDahPr7_U5BSQRNc1LQ", "review_id": "9_x4FL2WIxXzf12vH_Q4yw", "text": "The staff and service in the auto center are great!  They take the time to go over estimates, repairs, and any questions. We are treated very well.", "business_id": "vA8ed8BFvQxz4HFt8cHd9Q", "stars": 5, "date": "2015-09-05", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 0}, "user_id": "JgHGyWS2emyHq6aq144SLQ", "review_id": "xtQ2W0X1X7ftMIKcUbD6nw", "text": "My review is purely on the automotive/tire desk. I had purchased tires here a year prior to my most recent visit. After one year, my tires with a 75K mile warranty needed replaced. I came in to have them replaced and the girl, Chelsea, at the tire desk was rude and unprofessional. While my tires were being inspected, I looked up to see her sitting in the passenger seat of my car going through the glove box. Obviously upset, I asked what she was doing and she said I told her to go through it to find some documentation. No idea where that idea came from and I asked to speak with a manager. She called for one and I spoke with someone who said he was the manager and he said that there was a miscommunication and what she did was acceptable. I don't see under any circumstances why a receptionist would need to remove everything and go through a customer's personal belongings. I called back later and requested to speak with the manager and I was transferred to Michael Jackson. I explained the story to him and he informed me the gentleman Chelsea called over for me to speak with was in fact NOT a manager. I asked him some questions about my tire warranty after he was very apologetic and he said he'd call me back. Never heard back even though I followed up twice. \n\nDo not bring your vehicle to Farm & Fleet.", "business_id": "vA8ed8BFvQxz4HFt8cHd9Q", "stars": 1, "date": "2015-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "eCjYcpdownKb2ZLqohxggg", "review_id": "bCDEcv999eN2p0gWOWGlHQ", "text": "One of the two places I would trust my car with in Champaign/Urbana. Honest, reasonable, and skilled. Peter and his team always get things done in a timely manner, and without adding additional unneeded services to your bill. In a town full of shady garages, it is a wonderful change to have Peter B's around whom you can trust.", "business_id": "bshpPwiOvUdr_m9jFfsWTA", "stars": 5, "date": "2015-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DJhCX7TvKetUR8aBYZAT_g", "review_id": "nrv1C1uIsIKQYm15fZN1MA", "text": "Easily the best garage in Chambana. I went to Midas in Champaign and was told my car was in serious danger because the brakes we are less than 10% pads. I was also told my left front strut was blown (this was true). The quote was 850 for the brakes and caliper service and 1050 for the struts as they have to replace both (also true). I told them I simply couldn't afford it and instantly the offer for their overpriced credit was made.\n\nI left and decided to try my hand at a local garage. Long's did not disappoint. I was seen immediately and given a cost of almost half what Midas quoted for the strut and then told that my pads had 50% left and calipers were fine and could easily and safely drive for quite some time on them. They offered me rides to and from my home and found ways to discount and save parts like the strut strike plate and charge less for labor. Rudy, who I did my service with, was given a handshake and the promise that I now have my permanent mechanic: Long's Garage\n\nPLEASE bring your car in to Long's!", "business_id": "BH5ItzgUlz0GoYJxknV3Zg", "stars": 5, "date": "2013-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "eCjYcpdownKb2ZLqohxggg", "review_id": "Isk6Q04vcBoQaVP-nmc30A", "text": "I would say Rick's is one of the only 2 places in Champaign/Urbana that I would take a European vehicle, or any vehicle for any service more than an oil change. Rick himself is a very down to earth guy, and very skilled. I have never felt overcharged there, or that there unneeded repairs added onto the bill. They seem fair, honest, and able. The only down side, is that often they are booked a couple weeks in advance, so if you have an emergency, it can be pretty difficult to get in to get your car looked at.", "business_id": "-StiqyQX9YxKb6VYp2DRfg", "stars": 4, "date": "2015-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "KWQTvzVz5w9KZFyGb0wHZA", "review_id": "vG7OPyC1em1xkC-NwmC5ag", "text": "I have been here for regular stuff like oil change, buyer's check etc. The people here seem trustworthy. I am giving a 4 star only because I have been going here for the past 3 months only.", "business_id": "UvQCdPSXUdnmzbDEtUaoXQ", "stars": 4, "date": "2013-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rt9vgdYKGbWQ95L8ss0AmQ", "review_id": "p_x95XdzYXRKb942pvGTbw", "text": "I have come to Car x for years. I moved to Peoria and always have consistent service. From champaign to Peoria -- no difference. Shane was friendly and even honored another coupon for oil change tire rotation, balance, etc.  very happy repeat customer. I recommend them.", "business_id": "UvQCdPSXUdnmzbDEtUaoXQ", "stars": 5, "date": "2014-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zYajNAnxfJuY6OHyromWjQ", "review_id": "R-0etS4YONaD_OThE50jcQ", "text": "They were able to fix my car at a reasonable price within the time they quoted me. They went above and beyond to find the source of my cars water issues and dry out my interior. They even showed me how I could save time and money by fixing it myself.\n\nNice owners. Haven't had problems since going there, would recommend. Parking lot is tiny that's the only problem.", "business_id": "UvQCdPSXUdnmzbDEtUaoXQ", "stars": 5, "date": "2014-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y7TaGvsfK8wbKoIkqMguOg", "review_id": "GpLRpKoj0nFwzzEjkzoqDw", "text": "I went to CarX to get a buyer's inspection on a used vehicle I was interested in. Their report said  that the car was fine on every aspect, so I bought their words and took the car. Guess what, the rear right door latch was broken and won't lock or scroll window, it's a $500 job with parts and labor. I was just amazed at the fact that a professional team of car mechanics missed a broken door. Maybe I misread the items they check in buyer's inspection so they don't actually check on-board electronic system, or they don't check all the mechanical part on the car. If that's the case then why would I want to have you inspect a car before I buy it than just hire a private car machanic then order him to check every dang thing on the car? It's costs me about the same anyway.", "business_id": "UvQCdPSXUdnmzbDEtUaoXQ", "stars": 1, "date": "2015-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "99Qos7AunXZnaDogiP847w", "review_id": "TXQzJKaFToy6LZ1E_ayfYQ", "text": "I wasn't thrilled with the service I received when I took my Saturn L200 in. This was the second time I have taken it in and have been underwhelmed with their customer service skills. \n\nI was especially not thrilled when I was told it would cost over $700 to repair. I thanked them and said I didn't need to have it fixed afterall, and took it to another place in Urbana. It cost $209 to repair - and THAT guy got a NICE tip from me!", "business_id": "12Cz9K4vwj1cSy2r0sYVQA", "stars": 3, "date": "2010-09-17", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "8-98T_0Z1l9hBYXHfaHFPQ", "review_id": "_C28pHS1YQ9tcgHbieWg_A", "text": "I spent over $3000 on my car at this place since July. Why the 5 stars? Because I was not ripped off, everything was explained to me...step by step if needed (and I did need it - ha), nobody in this shop is a douchebag, the other customers are even nice, they don't try to rip off the ladies, they don't try to upsell me crap I don't need unless I ask if there's other crap I might need, and I'm pretty sure if I hadn't been out of town they would've let me seen the damage to my engine and walked me through the process if I'd asked so I could do my nerdy internet search on serpentine belts and motor mounts and all that other crap that was wrong.\n\nI knew they weren't effing with me because when I bought the car a few years ago the creepy dealership supposedly changed the motor mounts. When Virginia Auto Service identified a problem with (and subsequent damage as a result of) the motor mounts, I knew it was true, and I thought about that tug in my stomach I ignored when I bought the car that told me NOT TO BUY THE CAR OR TRUST THIS CREEPY CAR SALESMAN. \n\nSeriously, if you have a problem with something this shop tells you all you have to do is ask and see if they can work with you - find different parts, develop a plan to do repairs in steps...ask your grandpa to come in and hand them wrenches or wipe the sweat from their brow so you can have a discount as they diligently work to repair the vehicle you neglected and ignored for over 2 years knowing full well you were driving a heap. \n\nWhen they quoted me a price over the phone I said \"THERE'S NO WAY I CAN PAY FOR THAT RIGHT NOW. THERE IS NO CHANCE I CAN PAY THAT\" while my head was exploding and my face was melting (at work). I don't know if they want this advertised, but they let me leave my car there for over a month (closer to two months) while I made gradual payments and they did the repairs. My job sent me to BFE Texas and Virginia Auto Service just let me leave it there because it couldn't be driven. That's effing CLASS, folks.\n\nBecause they are so awesome I tell everyone I know about this experience, I write positive reviews whenever I get the opportunity, and I will not be taking my crappy little car anywhere else.", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 5, "date": "2010-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "oXkbuOiN9HDS3WgOQONfRg", "review_id": "62p8aUTFPSXiY1Wv0oOSIw", "text": "This past Friday I was ready to head to Texas with my boyfriend for a family gathering. For once, I was ready to go bright and early so that we could make the six-hour drive before the holiday weekend traffic got to be too terrible. My car, unfortunately, had other plans.  The battery, which I had purchased less than a month prior, decided it didn't want to work.  We suspected it was a bad connection to the terminal but couldn't be sure. Instead of driving to Checker Auto, I decided to take the car a couple blocks away to Virginia Auto.  I have a few friends who regularly take their vehicles here for service, so even though I had never utilized their serviced, I felt confident about taking my car in.\n\nAt 8am, their small lot was already packed, and I snagged the only available spot.  We walked in and were helped right away.  The very nice lady at the desk asked if I'd made an appointment ahead of time and I explained our situation.  She said they had quite a few other cars in with appointments but she would see what she could do.  We sat inside the small lobby and chatted for a while before she came back in.  My brand new battery was dead.  It had been completely drained!  She said they could put the battery back in and we could go back to Checker to have it replaced or they could install a new battery for me.  Not wanting to take a chance on another bad battery, I decided to have them take care of it for me.  Not more than 20 minutes later, they had finished!  I wasn't thrilled about having to pay more than I wanted to, but it was worth every penny.  After we got to Texas that afternoon, my very car-savvy Dad looked at the  car and said the battery had been installed very well - it was in securely and everything had been cleaned up really well.\n\nI need some serious maintenance done on the car, and I will absolutely be taking it in to Virginia Auto.  As soon as I do, I have no doubt I'll be coming back to this review to change it from a 4-star to a 5-star review.\n\nThank you, thank you, thank you, Virginia Auto, for taking such great care of me and my car and allowing us to head out of town for a few days without worrying about my car!", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 4, "date": "2011-09-07", "type": "review"}
{"votes": {"funny": 1, "useful": 8, "cool": 1}, "user_id": "LZrS2Uwzjo5E_qAm-P6TlQ", "review_id": "uTmlVNfqWesSrNN0eGYMxQ", "text": "The yelp reviews were so good I wanted to believe I found a new mechanic, unfortunately not the case for me.", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 1, "date": "2011-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "418z-fh1kkQG1FmItFzUUg", "review_id": "RRxymwjcceqU9uMeCkF7rQ", "text": "We recently took our Mercedes to Virginia Auto Service for  a new set of tires. Since we purchased the vehicle there has been a vibration in the rear of the vehicle. We have taken it to several places, including the dealer, to have it repaired, to no avail. When Matt balanced the tires on his new machine, that simulated road force, the problem totally dissapeared. I guess it pays to go to the shops with the most high tech equipment. thanks guys!", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 5, "date": "2011-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "JeDXg5tMVVAj1mRRRPD2Pg", "review_id": "EIiF8D3jAoNh4FchFvp_ZA", "text": "I checked out this business in connection with a Groupon, and after becoming very disenchanted with the dealership. After my regular service adviser was \"transferred\" after returning from maternity leave, I was regularly facing pricey service visits even for regular maintenance.  The increase in cost was pretty odd since it corresponded with the change in my service contact (they are paid on commission at the Acura dealer).  I was also pretty annoyed by the \"transfer\" of my trusted contact.  So, I started my search for a better option.  I went ahead and purchased the Groupon after checking out the business on garagefly.com.   I was very impressed with the service here -- they did a comprehensive inspection and everything checked out fine. They made no attempt to up-sell me on anything, including brakes, which the dealership had coincidentally told me would \"definitely be due\" on the next service visit (my brake pads were on the good side of fine when VAS checked them). Everyone seems very honest, and friendly, and while I don't know about the prices for major repairs, it's good to know that they'll only be charging you when you really need work done (unlike the dealer).  They also have a driver to take you where you need to go while they work on your car.", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 5, "date": "2011-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "OPodrF8mFSDkGsVU11PRhw", "review_id": "9OhQTO9qxyvhboAk7Y_ukQ", "text": "I always passed by this place on my way to work. I was due for an oil change and decided to stop to have my car serviced. My concern with going to a new mechanic is to 'not get taken for' doing work that does not need to be done, etc..  but with this place, I felt at ease, seemed honest and only advised on what your car should need and not need. Friendly, professional, clean, and what was very convenient was that a very friendly guy named 'Bergie' took you to your work and back.\n\nRecommended.", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 5, "date": "2014-09-21", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "JgDkCER12uiv4lbpmkZ9VA", "review_id": "uZuaH28fepDCNlKVrOCG-A", "text": "Being a guy who always perfers to have service done at the dealer for convienence, loaner cars, and recourse if there are any problems, it's just too damned expensive to do a BMW Inspection II with fluid flushes. Chapman wanted over $1,200.... Bavarian did it for under $500 and let me choose which fluids would be used on the car. \n\nThey are friendly people with conversational skills who seem genuinely interested in making sure that you are happy with what you got. There is no pressure to get extra services that you may or may not need, and nobody is trying to sell you things that could do more harm than good, unlike *ahem* Atwood European. \n\nI picked up my car at the end of the day as promised, and they'd put my sunscreen in my windshiled while it was parked, and the mechanic came out to help me back out of a tight parking lot. Anyone can perform an oil change and fluid flushes, but it's the little details like being honest, helpful, and pleasant that make the difference.", "business_id": "OceUtK4lKAziifRdkRh4Dg", "stars": 5, "date": "2010-09-02", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "WCKZOvJ0rBRqI3NfCnh5Ig", "review_id": "ov7RNIRbBJPhYb3I0so2oA", "text": "My BMW was making a strange noise a few months ago.  Took to Chapman BMW on Camelback and was told my car needed a new radiator, mechatronics sealing sleve, upper strout mounts, etc.  Total quoted was $3200 in \"required repairs.\"  Same day I took my car to Bavarian Motors - told radiator was fine, just leak in hose. Same with sealing sleeve -- no leaking transmission fluid.  Replaced strut mounts and hoses and price was $470 -- a lot better than my $3200 price given to me at Chapman.  This has happened several other times too with Chapman where I was given very high costs for repairs only later to learn items weren't broken or needing service.", "business_id": "OceUtK4lKAziifRdkRh4Dg", "stars": 5, "date": "2010-10-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "PIBd8pZdqUoju0ehEJPuXQ", "review_id": "MBQ1bPFHfHbx-AH6dmhZgQ", "text": "Having just moved to the Phoenix area, and after being burnt previously buy a dealership in Portland, Or. I decided that relying on the professionalism of a BMW Dealership Service Department was not going to get me anywhere but broke and frustrated. I found Bavarian Motors here on YELP and I was not at all disappointed. Ray got me in quick and had the car ready the next day. No up sells, no hassles, a truly pleasant experience, to include the final bill. Even the folks from Enterprise Car Rental, who he set me up with, had nothing but good to say about this shop and their reputation.  As long as I am in the Valley here, Ray and his team will be the ones taking care of my 2 BEEMERS.\n\nBTW - Ray do you do Harley Davidson's too by chance?\n\nKeep up the good, honest, and friendly work !", "business_id": "OceUtK4lKAziifRdkRh4Dg", "stars": 5, "date": "2011-10-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "7kNPTNDDwZAKJyxkomuimA", "review_id": "4rTJtXxQ2_WfsykdQMcrvA", "text": "I took my Mini to Bavarian Auto after being at the dealership and having a less than fantastic time there. I absolutely love the mechanics at Bavarian. They had the weird issue on my car - which turned out to be a nail stuck in the ABS - solved within an hour and were completely honest on what dealership recommendations actually needed to be taken care of right away. I have had a few other issues with my car over the past year and have been able to call them and get honest advice right away. I highly recommend this shop to anyone with a Mini or BMW!", "business_id": "OceUtK4lKAziifRdkRh4Dg", "stars": 5, "date": "2011-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "OaqnrdmDVX5cwc6OwZg_cw", "review_id": "0rhNi_J_jvRRMiCjVfO2qg", "text": "Thanks ray you saved me over $1000 dollars on my clutch, well worth the visit. My m is singing to a new tune. That's for being patient on my flywheel.", "business_id": "OceUtK4lKAziifRdkRh4Dg", "stars": 5, "date": "2012-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "SvDT9gxFzxEdCWnpiEGy3A", "review_id": "CRlG_3L-idnW7K4Onrshqg", "text": "When I first bought my pre-owned 325i I knew I would need to find a good shop that would not gouge me every time it made a strange noise, or a light came on the dash... This was shop #2 (of 3) that I tried. I knew I had a coolant leak and Ray and crew accurately assessed it by replacing EVERYTHING in the cooling department to the tune of $1,400. Ugh fine, in AZ that last thing I wanted to worry about was the stupid cooling. \n\nNow the tragedy (kinda)\nI drove to LA in the BMW all happy as could be, and upon arrival a nice lady drove up alongside me and said: \"YOUR CAR IS LEAKING GREEN STUFF ON THE ROAD!!\"\n(all obscenities from me omitted) After some distraught moments, and luckily having a gas station/shop 50 feet away, the tech saw that a coolant plug cap on the bottom of the radiator had come completely undone, which was very odd. After replacing the plug and refilling the coolant I was on my way. \n\nOn Monday I called Ray to ask if this would be an ongoing issue. He seemingly shrugged off my concerns with a \"sorry that happened\" and sounded like he had more important clients to tend too. \n\nI went to this shop based on the other Yelp reviews I had seen about it, and I will be first to admit that Ray does know his stuff when it comes to cars. But overall I was somewhat disappointed with the service I was given and will be moving on to find a better fit for me.", "business_id": "OceUtK4lKAziifRdkRh4Dg", "stars": 3, "date": "2012-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "g5QxNUDDU3iATH1H-vE8Og", "review_id": "a1pBn0s2wOsQOGkb8wpA5g", "text": "Huge thanks to Bavarian Motors for the fantastic job restoring my poor Mini-S. We've been long-time satisfied customers for routine maintenance and wear-out replacements, but this was a definite stretch.   \n\nThe damage was extensive, yet they went to great pains to get every detail right - duplicating wherever possible the custom features originally chosen.  I love my Mini, and they understood the connection.  They worked successfully with the insurance adjuster and settlement was equitable and fast.\n\nMost of all, the kindness and concern shown for me was amazing.  Andrew went out of his way to make sure I had not been injured, and more than once comforted me with the statement, \"People are what's important, not cars.\" \n\nI have to agree: the people at Bavarian Motors are the draw- the great service and repair grow out of their care and concern for everything they do.  \n\nMy car looks magnificent and runs like a charm!\n\nThanks guys!", "business_id": "OceUtK4lKAziifRdkRh4Dg", "stars": 5, "date": "2013-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Mq6ar6ZG3CQvrTmSbRkSMQ", "review_id": "snRogCjbylkIgyaMh520bg", "text": "Seriously! I know its a slow day, but there's only one car getting service in 11 service bays, one guy working and the other four technicians are chatting, checking their phones and who knows what.  Pep Boys must be cherry picking the road maintenance crews or is now under postal service management.  \n\nIt's a simple oil change and tire balance, so it shouldn't be difficult to do more than one tire at a time.  You'd think they'd want to get a customer in and out quicker.  \n\nMaybe my first clue was that they were not busy on a Sat morning, when everyone else in town had an hour wait, but now, I can see why this place is empty.  My second clue was the other bad reviews on yelp...  \n\nI would have given one star, but the guys at the front desk were helpful and attentive.  Too bad it ended there.", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 2, "date": "2012-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wGZZOMkKhdmkf8M0XnPzmA", "review_id": "GrkPzxd4Jr2SMgQUEzemOw", "text": "BEWARE!! \n\nI had my car serviced here. Before leaving, the Pep Boys employee who handled my payment verbally told me that my car was in good shape and had no other recommendations for maintenance, which seemed reasonable, as it was showing no signs of problems. Following the oil change, I drove home (approximately 3 miles), where the car sat for approximately one hour. I then drove from my home approximately 7 miles where the car engine was stopped for 15-20 minutes. \n\nShortly after starting my vehicle and driving less than 2 more miles, the engine temperature gauge spiked to the maximum and the engine began chugging. I immediately turned the car off and pulled to the side of the road, in an effort to avoid any further damage to my car. Then my car was towed to a more trusted shop across town. When examining my car, the mechanics at a more trusted shop found that the radiator coolant cap was left off the fill neck and was lying on top of the engine. \n\nPhotos of the cap location were taken once the hood of the vehicle was lifted (cap was not moved by the trusted mechanic); including three images showing the coolant fill neck and the cap. The other photo showed the hood liner wet from the coolant that came out. Due to the short amount of mileage that was driven, the car thankfully became operable once radiator coolant was filled and the cap placed back on. Based on the photos and a licensed mechanic's evaluation of my car, it is apparent that the Pep Boy's mechanic removed the radiator cap from my vehicle and failed to secure it back onto the radiator fill neck. However, the store manager, Jae, informed me that since I drove my car a few miles \"it must have vibrated off after service.\" \n\n\nI may be a female, but I know that the caps have locks, AND that I have 136K miles on this car and no cap has ever \"vibrated off\" while driving. Thanks for the advice. Really. I sent both photos, reciepts, and letters to Jae. He was unwilling to admit any fault. Go somewhere else for work on your car. Hopefully there are other shops are more helpful and honest.", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 1, "date": "2012-10-09", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "gi1aErWjjhLQWZGAyCWcwA", "review_id": "v12AUHiBmOTIVmYJJcAxkQ", "text": "Teresa (Customer Service Manager) and Ramiro (Service Advisor) were so extremely helpful!  I needed two tires and an oil change before a road trip last week... I didn't intend to buy them that night but they made me such a great deal, I couldn't say no.  They price match any offer plus 5%!  They also helped me find the best deal on an alignment so they could match it plus 5%.  After all that, they even gave me 10% off my bill and signed me up for Rewards so I could get additional discounts.  It took almost double the time they estimated which is the reason for the 4 stars instead of 5.  I've had bad experiences with Pep Boys in the past (Technicians doing work that wasn't necessary/authorized and then the Manager refusing to take it off the bill) but I feel comfortable dealing with Teresa and Ramiro.  I'll definitely come back!", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 4, "date": "2012-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "khPlizt3ava1xkbtAxHQnw", "review_id": "uviwDA9M1FRU4gmu7TJYjw", "text": "Stopped by today to buy some rear drums for my car and got excellent service and attention from the manager, Jae. It was a quickie and price was right. He checked if he could turn my rotors for only $13.99 but they were out of spec so I bought new ones and he even gave me a 10% discount. I was in and out in less than 10 minutes. I will definitely drive out of my way to go to this location from now on. They rock! :)", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 5, "date": "2012-11-17", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 3}, "user_id": "zfysCL-0uQNCWdGvzZ6QWA", "review_id": "0zCFB4AO2fpm6V4y1gbQdA", "text": "I'm not the most informed car owner out there, mostly due to my own ignorance, so I always need help when in a car parts & accessories store. I needed windshield fluid and a few other small items and Jae was very helpful in answering my questions and finding me the right products without trying to convince me I needed anything extra and ridiculous. The store was clean and no one was standing around when I went. The best part is they also price match!", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 5, "date": "2012-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1xhx-xkWfsEn-xRiPNehbA", "review_id": "_ijbxi5d9IJoNGybi4r8rg", "text": "I brought my 2005 Honda CRV in because the air conditioner was blowing warm air.  I made an appointment and dropped my car off there because it's fairly close to my sister's house which is where I wanted to wait. Thirty minutes later they called me to ask approve a $48.00 diagnostic check. No problem, I tell them.  1 hour after that they call me to tell me that my air compressor is locked up. I ask what it would cost to fix it.  I was shocked when he quoted me $2235,00 total, parts and labor. When I picked my car up the cashier told me that the compressor was $650.00. The labor is what brought it up to $2235.00. I talked to many friends who suggested I check out either Amazon or EBay for a brand new compressor then take to a local mechanic for installation. BRILLIANT! I purchased a brand new air compressor for my car for $115.00 from Amazon with free shipping. I then took that up to Angel's Auto Repair and they charged me $300.00 to install and that included the freon. I don't understand why Pep Boys charged so much but I appreciate the honesty and integrity from Angel's Auto Repair. My air is nice and cold now!", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 1, "date": "2013-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "X1AqkXDI07E6LRufGF-YYA", "review_id": "fn_XmSjjX1WRslKzoVc08Q", "text": "Heading out for a road trip this weekend and decided to stop in to pep boys to get new windshield wipers, just in case... The guy at the counter was very friendly and helped me get the right ones, didn't even try to convince me to get the most expensive ones which was nice. He came out to my car and put them on for me too. Easy, painless experience which is normally not the case when it comes to dealing with anything involving my car. Now I'm ready for a safe ride and any weather we might hit. :)", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 5, "date": "2013-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2IRzzxueABQhBYfpjV7pXQ", "review_id": "c5lMGm8Mbgc_tqsiqqw14A", "text": "I had a flat tire just happen about an hour ago. I usually go to Discount, but they were closed and decided to go to Pep Boys down the street. We walked in and had the best service from Don Myers. He came out to check the tire and found out it wasn't repairable. They are open until 8 and were booked, he even said we were the last ticket they would be taking for the night. After pricing the tire, he said he would try to get us out in about 20 minutes even if he had to do it himself so we didn't have to wait 2 hours. Lo and behold, he went out and changed the tire himself! I spent almost $200 on a new tire and normally I'd be a little in the dumps about spending so much for a tire, but the service we received from him actually left me feeling great going there! The GM (forgot to get his name) was also very friendly. Great store, great service and I'll be going there from now on for tires/anything else I need! If you get a wind of this Don, congrats on your graduation and good luck in CO!", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 5, "date": "2013-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "fu8Ks0xuQPC-yLo8kdCOvQ", "review_id": "TlQi9J4YAdv-WMwsptfQgA", "text": "Had to get my car towed and they waited after hours to make sure I got there safely. Went above and beyond to assist me and breakdown all my options of repair.  Service rep Arny is awesome (don't know spelling) but great service! Definitely recommend.", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 5, "date": "2013-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "JjweKRcu8DeYTah_KHsT2g", "review_id": "MOKKtiZkSbSQBJLe2K_sUw", "text": "Shortly after posting this review someone from Pep Boys requested I email them about the situation at hand. Would you guess I received NO response?! What a crock. Save yourself and do not bring your car to THIS Pep Boys Service Center!", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 1, "date": "2013-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 28, "cool": 28}, "user_id": "Bm2WTblMlWNOlQ5ossSo2w", "review_id": "g6CKNeKiAZGFYmSQL06gKQ", "text": "I dont know why I am seeing a couple of bad reviews here because Pep Boys did me a good service. I think they had a miscommunication.\n\nMy car was a 2003 chevrolet impala, I bought this last 2007 and had a great ride with until recently. So I seeked Pep Boys for some help and they looked into my car. They're good at communicating with their customers; the charges where reasonable and it just blew me away. The  person who repaired my car was very good because he taught me a lot of things to avoid having problems with my car. He also taught me how to know if my car is already in need of repairs. After the job was done, my car went to its normal state and they satisfied me of their work. Thumbs-up for Pep Boys. Will be back again if I can experience another problem with my car.", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 4, "date": "2013-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hkabUUaY4bhKattNC18BAg", "review_id": "dLBQb_LjOPu5RlVjMRetHw", "text": "Thanks Romero for giving me the best deal for my SUV because I needed that oil change!!", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 4, "date": "2014-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "btLssxZq0qOFKKBbYP8L6w", "review_id": "j5mHZIAUG6g7y_CD_23dvw", "text": "I agree with the other reviews.  John and his team do great work.  I was having trouble passing emissions and I took my car to the Hyundai dealer twice with no success.  John looked at it and within 5 minutes was able to tell me exactly what was wrong.  No gimmicks and great prices.  I trust him 100%.", "business_id": "R5zU2QNqKW9U2CRePh-bEQ", "stars": 5, "date": "2015-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lMLdwmAK6RdP6N7cMQbz7A", "review_id": "yj7ckEYJPc4Z8o6h54vjTQ", "text": "Honest, timely and friendly. Got us in the same to do a pre buy inspection. They did a thorough job while we waited and we left with peace of mind about the vehicle we were purchasing. We signed up for email service reminders and will definitely be back.", "business_id": "NUR1pLEwUETAvcW_1rfGFw", "stars": 5, "date": "2014-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DrWLhrK8WMZf7Jb-Oqc7ww", "review_id": "UDeO2HSYmqUUvB5kgVtd4w", "text": "Brand new to AZ, the process of finding a new mechanic can be a little slice of hell. Luckily, I found Dean's on Yelp and the three good reviews had me heading over there to figure out what was wrong with my gas tank and gas gauge. Right away over the phone, I was given the rundown that the estimate is free and they would even shuttle me back to my place while the process unfolded. When I arrived at Dean's, there were several older women waiting for their cars to be fixed and they were telling me that this place has been around for over 50 years and they have been bringing their cars in for decades to get fixed which was comforting. There are photos on the wall of years gone past and that says they have been doing something right. As for my car, Grant found a way to get into my tank through the trunk saving several hours in labor costs and also identified other parts I needed as he figured out my problem. My car was bought used so i didn't know it needed a new battery and fuel filter, which I am glad they discovered. I was kept mostly informed of the timetable for my repairs and even though my vehicle had the worst case scenario (Fuel pump), it was easy to be impressed with the detail-oriented mechanics (calling all over for best price on parts and breaking car talk down to the basics), friendly front-desk people and long-time customers who keep coming back which now includes me.", "business_id": "osI3BT6AagWA-ravXrmK3w", "stars": 5, "date": "2012-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F3slVCSkCvytxat4Trw3jw", "review_id": "afhmIPz0Ei8wnZqCBJD9eQ", "text": "MB Motors is a family run establishment that only services Mercedes-Benz automobiles and if you have a Mercedes-Benz, this is the place to take your car for service.  I was referred here by someone a couple years ago and every experience I've had with MB Motors has been outstanding.  They will take the time to tell you, and show you, what needs repaired; they will complete the repair quickly; and their pricing can't be beat.  In fact, I often feel like I should be paying them more than they charge, given the amount of time they often spend with me and my car.  They won't sell you a service you don't need, and they take the time needed to correctly identify a problem.  Take your car here - you won't be disappointed.", "business_id": "0Xnduj9w6aYHOtN_RlHUng", "stars": 5, "date": "2010-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "q61Z8003K9ee7ekgc2qoiw", "review_id": "UcCFF2qysByZoBHvz4ciPA", "text": "I'll tell ya what:  You have to go HERE if you have a Mercedes.  Honestly, one of the best, most reasonably priced shops I've ever dealt with.\n\nYou go inside and you will meet customers that have been going there literally for years and years.   \n\nI've never had a bad experience- just today they got the ignition switch fixed after I had to tow it in LAST NIGHT- yes, it involved undoing the steering column and using all kinds of nasty cutting tools to remove teh old switch (tumblers failed)  but they had it FIXED in less than 1/2 the day.  \n\nWOW.  \n\nFast, accurate and best of all real good pricing....\n\nPS- BUD is president of the local MBCA (benz club) so yes, he is a bit of a fanatic about these cars.", "business_id": "0Xnduj9w6aYHOtN_RlHUng", "stars": 5, "date": "2012-10-10", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "CSeX-BgaL6vWDLW66YlwFg", "review_id": "0INUCsdRjV9O6UZ-_k1Utw", "text": "Seriously, honest, reliable, thorough shop.  The first time I took my car in, they beat the dealer's repair quote by more than $2000, told me what I actually did and didn't need and prioritized the work that I needed done.  Have been going there ever since.  Just got a new car and will be taking it to see Bud.", "business_id": "0Xnduj9w6aYHOtN_RlHUng", "stars": 5, "date": "2013-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "VzHy3TTl9pD19v0HIvzsig", "review_id": "8qmQEiiNyM6n27wOzd9rfw", "text": "I was very fortunate to find this Mercedes shop -you won't find better  Bud did two pre-purchase inspections for me:  in the first case, he kept me from making a serious mistake;  in the second case, he confirmed that it was a very good car with only a few problems.  He fixed the problems at very reasonable prices so that I could drive the car back to Albuquerque with no worries.  I would highly recommend MB Motors as a special shop.  Bud is honest, capable and he offers fair and reasonable prices.", "business_id": "0Xnduj9w6aYHOtN_RlHUng", "stars": 5, "date": "2013-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "z9z9dPRsROEvauQtxFE5vQ", "review_id": "2G7kI5G5veVexruJTirJYA", "text": "These guys are the best.  They know the products inside and out, and are kind, informative, and fair in everyway.  Take the guess work out of your repair, and let them do what they do best.  I have had many Mercedes, and do know them well, but these guys have so much experience, and knowledge, and I could not recommend a more trustworthy source then the great people at MB Motors.\nYou guys Rock!!!", "business_id": "0Xnduj9w6aYHOtN_RlHUng", "stars": 5, "date": "2014-09-30", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "JrQTbUeHPOjAxxr6KXo0qw", "review_id": "lOUlPd0bHyUH734LjHk8Yg", "text": "Since living in AZ this is the only mechanic I go to that I can trust.  Amazing service at an amazing price.  \n\nMy whole family and friends all take our vehicles to BD Car Care. \n\nMake sure to say hi to Dario and Allen when visiting.  These guys are real pros!!!", "business_id": "KXh8CE7KF3u3RdC70Ecenw", "stars": 5, "date": "2013-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "D27LJyqNKSFogWjmtGRZsA", "review_id": "mM9ldifv5WwVSindbb-H5w", "text": "Amazing service and quality work. The owner Dario Is a great person to work with. My BMW runs great after the  repairs", "business_id": "KXh8CE7KF3u3RdC70Ecenw", "stars": 5, "date": "2014-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kCpR3vXU2Dg9HrpJ7yuYzg", "review_id": "TR27YZtdjdVlS55If_CANg", "text": "all i can say that these people are honest and punctual. This is not an experience i had with other car shops. Unfortunately had to go to quite a few. I had dealt with Chapman BMW service several times before i came across this shop. They know their cars and have better customer service than Chapman BMW.", "business_id": "KXh8CE7KF3u3RdC70Ecenw", "stars": 5, "date": "2014-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CbwUUTayOYSNW9gsbEN3HQ", "review_id": "bVfKtU3WCEasnTmOtwhlMg", "text": "These guys are great! The Mercedes dealer quoted $800 to fix the electric seat, and these guys charged me $150. On average, Bd Card Care is 25% cheaper than the dealer, and the quality is second to none.", "business_id": "KXh8CE7KF3u3RdC70Ecenw", "stars": 5, "date": "2015-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tnxU_6K4BD7VZiX6Y89dXA", "review_id": "KG7BvS90JQxYv6vmm-ESFw", "text": "This place is great. One of my neighbors referred me to Mazvo, and I've been a loyal customer ever since. I wouldn't dream of taking my car anywhere else. Mike and Shahe are honest and treat every customer with respect, regardless how little the customer knows about cars. They always provide a list of essential repairs and maintenance, as well as any items the customer may want to look at repairing later. I can't say enough good things about these guys.", "business_id": "L95jFICMBewv08k7YUx5OQ", "stars": 5, "date": "2007-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "80oOlV-op_GRlA4lWrolrQ", "review_id": "tHtR6tBhCy8W24fki7OT_w", "text": "MazVo is fantastic. I have been going to them for 2 years and my husband's family have been using him for over 15 years. \n\nHere is a prime example of their superb customer service - I called at 8am and explained that my car was making a strange noise and that I needed to get it looked at ASAP. I also shared that I would need transportation to get to work. They had everything arranged for me when I arrived 15 minutes later.  I was able to drop off my car, hop in a rental car (and it was a very nice toyota too!), and got an update 4 hours later with the diagnosis for my car.  And 2 days later I was back in my car again!  Shawn and Lena treat all their customers with respect and dignity - and they are ALWAYS looking out for their customers. I won't take my car anywhere else.", "business_id": "L95jFICMBewv08k7YUx5OQ", "stars": 5, "date": "2015-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lgVVfcS8IEEgWAlwyaFFGQ", "review_id": "pPMFE-YZCnwyOg2WFgYCvg", "text": "They told me that the oil change would take an hour to an hour and a half. It ended up taking three hours as they waited for a part. In their defense they said it was possible it would take longer. That was fine but when the person at the front\ndesk starts talking politics, swearing, and pushing his beliefs, that is when the line of professionalism was crossed. The car works great but the customer service left much to be desired.", "business_id": "6jsv1cp0Gd26X0BiE2tmTw", "stars": 2, "date": "2012-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "HzfWEVSxEVx58Le48JvrpA", "review_id": "40hZN7BT1MIsFHGux6eC5w", "text": "Went to get my brakes changed from a slight squeak.  They told me that I had a crack and that I was leaking brake fluid and that it would be a safety issue for about $350 more than I planned to spend.  I was shocked as my car had just been inspected a month prior with no problems, and my brakes didn't feel mushy at all.  They strongly urged me to not take my car without doing the repair because I wouldn't know when my brakes might fail and I'd be unable to stop.  I was really anxious, but needed to get a second opinion before spending that much money\n\nDecided to take my car to my regular mechanic who said there was nothing wrong.  Saved myself $350.", "business_id": "6jsv1cp0Gd26X0BiE2tmTw", "stars": 1, "date": "2013-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qfI0xdpRiTjTi6P7djpRrQ", "review_id": "lVnbVJ4Chio-6x4mYEilpA", "text": "Damsel in distress w car issues... I had been hearing some strange noises and squeaks in my car & had delayed going to a mechanic (who has the time?!). Thank goodness Just Brakes was open on Labor Day - hard working dudes on a holiday in this Arizona heat!\n\nRight away, I was greeted w a friendly hello and welcome by the Store Manager, John and he walked me through the process - I felt like he really cared about my concerns and wanted to give the best service.  He welcomed me to their open shop, where I could shadow the inspection and learn what was good, bad and ugly w my car.  John showed me the difference btwn my grinded down back brake pads vs front; I got lessoned auto parts and vehicle anatomy 101. \n\nJohn was patient and even offered me shuttle service to where I needed to be while they worked on the car.  \n\nWonderful customer service, fair prices and most importantly, peace of mind knowing that I was going to be on the road safe and if I needed anything after I left the lot, I could call the shop and have them help.", "business_id": "6jsv1cp0Gd26X0BiE2tmTw", "stars": 5, "date": "2014-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XPRYg0-dYlpoaSoNEi2vVw", "review_id": "KLIC_lDBEWCp_WTdBAQrJg", "text": "These guys are great!!  I just had my SUV in for brake service as recommended from the dealer but didn't want to pay the dealer prices.  The brakes were more costly than I thought due to an issue with how they were wearing which John the store mgr. pointed out and walked me through in the shop.  I also had to replace my shock absorbers which were leaking and already had a quote from this from the dealer but these guys were much much less so I agreed to have them do the work.\n\nThere was an issue with the shocks that they ordered the wrong items as my SUV has air suspension shocks so there was some extra time that was needed to complete the job.  The great part was these shocks were twice as much as what was quoted to me for my total repair price and John still honored his initial quote where most places would've charged me extra for that.  \n\nLastly, the communication was excellent and John kept me in the loop all day.  We discovered around 7pm that the job wouldn't be done in time before they officially closed but I really needed my car the next day for work and meetings and they stayed open until almost 9pm to finish the job and he didn't hesitate at all about doing it.\n\nI wish more companies had the integrity that they have.  I will absolutely be back here to support this business and happy recommend them.", "business_id": "6jsv1cp0Gd26X0BiE2tmTw", "stars": 5, "date": "2014-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zNUvVM1UnvVYn1psm4oHYQ", "review_id": "3-6-sFYgex1esORhANbLiQ", "text": "Where do I even begin?  If I could, I would give this place 0 stars.  The severe lack of service and communication I received and am still receiving from this excuse for a mechanic is unfathomable.  \n\nI took my car in a couple weeks ago for an oil change.  I knew there could be some additional things that need done so I was completely prepared for that.  Lo and behold the manager calls me and tells me I need new tires, plugs, coils, thermostat, and fuel system cleaned.  After quoting me a ridiculously high price I asked that they ONLY complete the plugs, coil, and oil change.  Of course, they added on the thermostat as well.  This tells me they either did not listen to me or did not care.  Either way, strike 1 of many.\n\nWhen I dropped my car off I expressed to them it MUST be done that day as I needed it for work.  Well they close at 8 so I figured no problem since I dropped it off at 11am.  No phone call from them after the initial assessment at 2pm.  When I called them at 6pm for status I was told they were waiting on 1 part for the thermostat (which I did not request) and that once it was received it would be 5 minutes and done.  Fast forward to 7:45pm and no call.  I call them back and was told the part did not arrive and it would not be done.  I expressed my frustration with the process thus far and was told it WILL be done by 8am when I had to leave for work.  SURPRISE....it was not done.  I had to get a ride to work and was told my car would be delivered to me at work.  Against my better judgment I agreed to this.  This part that should take 5 minutes once received took over 5 hours.  Once again I call for status and was told they were on their way.  fast forward 2 more hours and they have not arrived.  I work in tempe, not far.  Come to find out the mechanic drove my car to another shop to do who knows what and pick up someone then deliver my car to me.  Not happy about that at all and then I get in my car and they leave their empty pop cans/garbage in my car.  By this time I'm fuming.  \n\nLater that night the manager blows up my phone to get paid of course.  He keeps asking for my CC info to pay him but never bothers to tell me the total or breakdown or how I'm going to get a receipt.  He also states he is going to talk to his District manager regarding the experience I had and get back with me the next day regarding some sort of compensation (shockingly this was never done and I never received a call).  Finally I get the total from him and reluctantly pay it with the promise he will email me a receipt.  Here we are over a week later, 3 phone calls to the store, and 3 emails to corporate and still have no receipt!  \n\nNext step is to visit the store, yet again, for a receipt and I believe additional recourse is in order.  I honestly have NEVER received such terrible service in my life.  The sad part is I have taken my car here before when the old manager was there and received phenomenal service.  I thought I had found a mechanic I could trust and that would take care of my car and myself.  I was certainly wrong.  It seems the corporate office doesn't even care about their customers. Take your car here at your own risk.  You have been warned.", "business_id": "6jsv1cp0Gd26X0BiE2tmTw", "stars": 1, "date": "2015-09-15", "type": "review"}
{"votes": {"funny": 5, "useful": 4, "cool": 4}, "user_id": "pQbyx3VDl52eGR2mKd7Qag", "review_id": "4utKwk1TW-oZYV_8gbb2dw", "text": "The experts at coulter cadillac Oldsmobile knew exactly what to reccommend. I came for their free lunch special and found out that not only was my car depreciating in value, but a caddilac is a true investment. I got my authentic 98 aurora there and it has been going up in value ever since I drove it off the lot. IF you ever need a great wateringhole or place to grab a quick snack. go here. as good as it gets folks!", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 5, "date": "2008-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hPb6AQVKRcsASyfAIStStg", "review_id": "8aJ22r7tZb-bl9vQFx-Ozg", "text": "Coulter Cadillace by far is the best experience I had in buying a car.I live in Pasadena, CA and was looking for a Black Audi 2010 Q5 s - type. It's a rare to find piece in used market. In my search on Autotrader, Coulter cadillac, Phoenix, AZ showed up. Initially they were not willing to give it for the price I offered. When Glen Heiser from Internet sales got back to me, I bumped up my offer price, for which he agreed. He gave me the final out of the door price, I again asked him to reduce the price by $700, so that the price can be rounded off to lowest thousand amount. He got back to me stating that the price is reduced. Remember, all this was happening over the phone. I neither looked at the car nor test drove it. Finally I asked him if there is any body work that needs to be taken care of, he said there are minor things and he offered to take car of them, which he did. \n\nI got my loan processed, sent them the check and they shipped me the vehicle. I loved the first look of the vehicle but I had my own doubts. I test drove it, took it for a car wash and it looked amazing. I found that the Dust protectors around front brakes were deformed, I though this happend while shipping and asked Glenn to send me the pictures they posted on their web site before sale. Glenn was curtious to send me the pcitures and the deformation was in the pictures as well. I took my Audi to an Audi mechanic. He looked at it, test drove the car and asked me to be at ease and be at peace. He said I got a very good deal. \n\nSo over all, the price was $1000 more than what I initially asked for, vehicle is in perfect condition. The customer service and peace of mind that Glenn offered was top notch. His pre sale and post sale customer service were excellent. Coulter cadillac is a trust worthy place to go if you are looking for a new or used vehcile. Ask for Glenn.\n\nKiran", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 5, "date": "2011-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xXk4TEQqu2enhad5BlsZRQ", "review_id": "AvaeF4zgi1WevZqWgj7XPQ", "text": "Just had my Yukon in the service department for a leaking oil pan gasket and some maintenance items. Richard Garrick took really excellent care of me, the final bill and my Yukon. The tech that worked on my Yukon, Mike, took the extra time to clean off the excess oil after the repair was completed. Super happy with the whole experience and the Yukon is running perfect and no longer leaking oil on my garage. Thanks guys!!", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 5, "date": "2012-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zaG6LcjWcppAQnMn6K46VA", "review_id": "buJYx12faZ_4rfjgvBFnZw", "text": "The Coulter Cadillac staff was very helpful, knowledgeable and pleasant.  Both the sale man (Lindsay) and the sales manager (Paul) were terrific.   We could not find a car that satisfied our needs.  We ended up buying at another dealership but they were very pleasant when we told them.  We will be sure to return when we are looking for a car in the future.", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 5, "date": "2012-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y6jzpZ3Agx8oKK0Ml4QIeQ", "review_id": "sTFK-79gNS8-WQXT8zl6DA", "text": "My wonderful 2011 GMC HD2500 needed a oil change after hauling a trailer 2500 miles.  The engine light came on and it resulted in a catalytic converter replacement.  They also noted that the windshield washer fluid tank had a crack and replaced it. Coulter has always been awesome.  I have been buying and servicing our cars there for many years.  Thank you for the excellent work.  I love my truck and it handled heavy loads and hard weather very nicely.  Thank you again - Ron", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 5, "date": "2013-10-04", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "JkjOzHwSaMqWLC0Z_gbtZw", "review_id": "ub8S_K2uLdLRcHnABL0CWw", "text": "Brought to Coulter-on-Camelback for routine service and to diagnose an annoying vibration in the gear shift.  Waited only a few minutes before I was processed and seated in their amazing lounge with complimentary coffee, tea, and breakfast sweets.   The chairs are very comfortable and with Television and broadband, it's easy to pass the time while your vehicle issues are addressed.\n\nMy service manager was attentive and brought me regular updates about the progress.  He also handled the ordering of parts and payment.  I didn't have to search for anyone.  It was all handled by the same person and he came to me.  Very good service.", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 5, "date": "2013-11-04", "type": "review"}
{"votes": {"funny": 2, "useful": 6, "cool": 5}, "user_id": "fczQCSmaWF78toLEmb0Zsw", "review_id": "ZuGSW8IPe8Krz7ke1Pahwg", "text": "Buying / leasing a new car is never a fun process... at least for me.  \n\nIt's even worse when you are married to someone that takes a really long time to \"pull the trigger\" on a large purchase and over analyzes everything.\n\nSo when I reached out to Coulter in early 2013 and connected with Roger Farney over the phone, I am sure he had no idea that it would take him almost a full year to \"close the deal\" and get our business.  His persistence paid off though... Roger was never pushy.  He called and emailed to check-in on occasion and he answered all of our questions when we reached out.\n\nTen months later, I'm now the proud owner of a new car and I was pleased with the experience at Coulter.  Once we were ready to move forward on our purchase, Roger was patient and thorough with me as he showed me all of the ins and outs of my new vehicle.  He followed up several times since and has been there to answer questions for me as they come up as well.\n\nHopefully I won't have to visit very often for service, but when I do, I won't hesitate to take my car back to Coulter.  \n\nIf you're in the market for a new car or you have a Cadillac, Buick or GMC that needs servicing, check this place out... and safe and happy driving in the meantime!", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 4, "date": "2013-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "ru9-V2yO813OLwhLrhzHcA", "review_id": "o9k9eaUP7qogRRpiRTa8Yg", "text": "We do not buy our cars here I am just here for a recall. Normally we're down the street at camelback Toyota. Well they must have spoiled us there because the service here sucks. Maybe it's just the one guy \"rich\" that has a poor argumentative attitude with each customer I've seen him deal with in the 3+ hours I've been waiting but I will not be returning again. If you're looking to buy a car, seriously go to camelback Toyota... They've treated us like kings the many times I've gone there", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 1, "date": "2014-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "h7YB0darjysgjqkm7Q_x-A", "review_id": "sD5-UkpuCximR0ES7qVeBA", "text": "Neat looking place, terrible customer service. I made an appointment a week ahead of time to have my car in for a simple repair - I was told it would take, at most, two hours. I bring it in on time and at first, the employee tells me to wait and stay in the car - me sitting in the car and my wife waiting with our infant. So were waiting and he never shows up to greet us. Eventually, I get out of the car and go to his kiosk, where he seems less than thrilled to see me. Begrudgingly, he takes my keys and tells me he will call as soon as its ready. So I'm at home on a Tuesday, not at work and in need of my car, waiting. After a few hours of being in limbo I call him to check on the status - he tells me they haven't even begun to work on the car yet and that they will try to get it in today... Two hours pass, three, four, five - and *boom* it's already 4pm. So they kept my car all day with no warning. This time he calls me and tells me they don't have the part for the car, even though the appointment was scheduled a week ahead of time... Ultimately, they want to keep my car over night. \n\nJust keep in mind when you come here - if you have an appointment - it basically means nothing since they seem to take walk-ins. Also keep in mind that there is probably a healthy dose of incompetence involved as well. \n\nOther Recommendations: Airpark Auto, anywhere else", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 1, "date": "2014-10-08", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "DrWLhrK8WMZf7Jb-Oqc7ww", "review_id": "j4LuEKs4KFpkuBvF6fmSrQ", "text": "Just popped in for a quick visit to get my key fixed on a recall and the actual time that it was quoted as taking actually occurred. Only two hours and a free wash and vacuum were included in my price of zero, but I gather others who are paying also receive this service. The outdoor table and benches are much needed because the inside waiting room is like a morque. Those are some really uncomfortable places to wait, but they had a huge number of magazines and free papers and free donuts. Other assorted items cost money as some very old broad was playing out the string slinging \"auto waiting room fine cuisine\" Shout out to Ron - at least on this day.", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 4, "date": "2014-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "ru9-V2yO813OLwhLrhzHcA", "review_id": "LVU630y3pWwPEa4b1SDtMQ", "text": "My experience with Coulter Cadillac was horrible. I am so upset at the poor customer service I received. They found a screw in a tire and patched it while they were in there fixing a recall... HOWEVER today (a few weeks later) we went to replace 2 other tires with Discount and they told us Coulter had patched OVER the screw and now we needed to replace that tire as well. When I called to speak with the service manager, John Thorne, he was extremely rude. He denied that they would do that and every time I tried to speak he would interrupt me. (SO extremely rude!) I tried to ask questions regarding their procedures multiple times and he would not let me talk. I was so frustrated and now we're having to immediately replace an expensive tire that we do not have in our budget. He kept telling me that its probably a plug they put in when they patch a tire. WELL I'm PRETTY SURE that Discount tire knows the difference between a plug and a screw they patched over. We are taking the tire back to Coulter to address it and we will see how it is handled from there. Do yourself a favor and GO ELSEWHERE!", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 1, "date": "2014-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-UKv3eJTi-Q4mMw0u7w_rg", "review_id": "48p0TQ5-alZ5MTQKHHUQVg", "text": "What are Recommended Reviews?\nWe get millions of reviews from our users, so we use automated software to recommend the ones that are most helpful for the Yelp community. The software looks at dozens of different signals, including various measures of quality, reliability, and activity on Yelp. The process has nothing to do with whether a business advertises on Yelp or not. The reviews that currently don't make the cut are listed below and are not factored into this business's overall star rating. Learn more here.\n\n27 Reviews that are Not Recommended\n \nGeorge C.\n0 friends 1 review\n11/10/2010\nDon't buy a car from this dealership.  They are dishonest and don't care at all about customer service.  I purchased a used 2009 Yukon Xl... Read More\n \nm d.\n0 friends 1 review\n6/29/2010\nBe warned!\n\nI purchased a new car from coulter and was assured it was in perfect working order and could be driven off the lot.\n\nThe oil leak... Read More\n \nCJ C.\n0 friends 4 reviews\n6/5/2014\nSatisfactory experience.\n \nCurt R.\n0 friends 3 reviews\n9/24/2014\nI took my XTS in for recall notice today. Mr Roger Farney was able to set up a time exactly for the time I needed. Mr.Large in service... Read More\n \nDiann P.\n0 friends 1 review\n9/1/2014\nPurchased a 2011 GMC Yukon. Bill Jurczak, and his associates, were a pleasure to work with. Fastest and smoothest vehicle purchase we have... Read More\n \nKaren C.\n0 friends 2 reviews\n8/6/2014\nWe purchased a 2014 Buick Enclave from John Harrell. He was outstanding to work with, very professional and courteous. We also were very... Read More\n \nBill J.\n0 friends 2 reviews\n7/31/2014\nI have purchased 3 SUV's or trucks from them and would recommend them to anyone. They have always delivered on what was promised in the... Read More\n \nTrissa L.\n1 friend 6 reviews\n7/17/2014\nI came in for my first oil change and update. Shawn was incredibly helpful and efficient. This is my 3rd cadillac and the service and sales... Read More\n \nDonna S.\n0 friends 3 reviews\n7/16/2014\nmy 2013 escalade ext came in for a routine lube oil and filter, and 12,000 mile check up as well as a few warranty issues with my navigation system interface and the center console.\n\nmy service advisor brad, as always was fantastic.  he listens to the issues of concern and addresses them all. be they warranty related or not.  i was provided a clean and ready loaner vehicle right away, and off for my day.  brad kept me in the loop with regard to the progress and current status while we waited for a part to be shipped in.  when his service work was complete, i returned the loaner and he sent the vehicle to the coulter body shop for some cosmetic work i had pre arranged.  all my contacts in the service drive area were very attentive and professional. including brad, sam, and even the service manager came over and made sure i was taken care of....\nbill coulter can be pleased at how well his service area is operating with customer contacts like these folks at the front line.\n\nas for the sales department, they are wonderful too.   paul glans, allen hall, and deb niles go out of there way to make sure all customers are handled professionally, and leave happy.  i am happy to be a long term coulter customer. thanks to the coulter family.....\n\nbest,\n\njames s. sweenie, broker\nsun-west mangement & realty, inc.", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 5, "date": "2014-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QWVcfWFEXUTECVIMfk0RSw", "review_id": "X0rigqqhfu6WFNfZOYy3SQ", "text": "Amazing customer service they helped us get what we needed right away. Very attentive", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 5, "date": "2015-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OacRaP2XiIHVr7S0ZfO71g", "review_id": "pksr5p5EufXeAly8q1mczA", "text": "Great experience!  Can't say enough about the complete team effort.  From the beginning to end, we had complete professionalism.", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 5, "date": "2015-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Il8u1nB2qq53DUw65wLKyg", "review_id": "0AwoDJptnX6T1ChiN0Zkig", "text": "New Information: the following is a dealership decision. We've spoken to an attorney about the case. I noticed the dealership remodeled this year, so I find it impossible to believe any claim that they couldn't cover this expense. They cannot legally require us to use their service department, but that's where the bulk of their money is made. Had we used that they would've probably covered this because they would just be giving us our money back for overpriced and unnecessary service.\nThe next step would be a Class Action Case.\n\nIF YOU CAME TO THIS PAGE YOU ARE SMART ENOUGH TO WANT TO KNOW IF YOU SHOULD BY A GM MADE VEHICLE. \nCommon sense would say that if you wouldn't run into a burning building then it probably isn't a SAFE choice to by a GM car. The following story could happen to you.  For the record, they seem to have an airtight loophole so they NEVER have to cover lemon defects!!!!  Be smart and steer clear unless you've got money to burn....\n\nLook below to see the final decision offered to us by GM. What I find interesting is their complete omission of the most important facts.\n*All service records are available that show that ALL services were done on time. They have declined these. It is illegal to require that the dealership service departments be used, however that element has been stated several times as part of the decision factors. \n*This four year old vehicle had to have an engine replacement at 75k miles approximately for defective lifters. This was covered under our warranty because it was a defect. That was at approximately the two year mark.\n*We are now needing the same defective lifters dealt with in the REPLACEMENT ENGINE supplied by GM at about 75k miles from the time of that replacement. We are now at about the two year mark again.\n\nThe response below is presenting the cars data now of 143k miles and 4 years as if the engine wasn't replaced in the middle. Our vehicle is past our warranty for mileage and age BUT they are not offering ANY WARRANTY on the replacement engine. Typically there is a 3 year warranty, which is now down to 1 year(so said in the last conversation but prior to that it was stated as 3 years) and neither includes mileage. This basically means that they could put in a new engine with a defect and not be legally bound to cover that for any amount of time. They have referred to our issue as \"unexpected\" engine problems. Apparently this is a problem that MANY of this year and model have had. That's not unexpected then on the part of GM. This information is readily available, so feel free to check it out. It's only unexpected from the consumer position!\n\nSince the \"resolution\" seems to be final I really hope that other consumers will read this and take it into account when purchasing a GM vehicle. They own four brands...\n\nGood morning Sarah, \n\nWe understand that this was not the outcome you were hoping for and we truly apologize for any frustration this has caused. You have the right to expect long-term reliable performance from your vehicle and every effort has been made to assure excellent quality for our customers. We handle customer's concerns on a case by case basis and thoroughly look into various factors before delivering the resolution. Such factors are, age of the vehicle, mileage on the vehicle and warranty parameters. \n\nBased on the factors we mentioned, your vehicle does not meet the criteria and we are unable to assist with your engine replacement request. As your Yukon XL Denali has over 140,000 miles on it, it is out of Bumper to Bumper Warranty by age and mileage and out of Powertrain Warranty by mileage. We rely on our dealerships to be our eyes and ears in the field, as they investigate each vehicle and take these factors into consideration before determining the resolution. \n\nAt this time, the resolution stands and if you have any additional questions regarding the details of your case, please direct those to your agent. I will certainly document our conversation within our system and notify your agent accordingly. \n\nSincerely, \n\nSamantha N\nGM Customer Care", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 1, "date": "2015-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Fa0cKTkPhxdYi9HpcuQh8g", "review_id": "3_CTIH9LwR_jaVheC9CHvg", "text": "Arrogant.  Slow.  Expensive.  I understand that this is a repair shop and not the Hallmark Store, but what's the point in going out of your way to piss off a customer.  Mike, I assume the owner, couldn't or wouldn't do the work on my Chevy truck.  After a smart ass conversation with Mike about how long it would take (4 days to get parts.... for a Chevy... and two more days to perform the work), I decided to have my truck towed to Courtesy Chevrolet.  Courtesy had it done the next day for half of what Mike quoted.  Let's review.  The DEALERSHIP was less than this repair shop.  Two of my family members with classic cars have had similar experiences.  I think Mike has plenty of time to think up clever put downs for his customers because he is bleeding business to other shops in town.  He owns the retail shop too, so skip that as well.", "business_id": "R72PRg4ZKOjstjUiTCUWTw", "stars": 1, "date": "2015-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vliAJpHltPo-SL6tGz5A3g", "review_id": "QaRFtzgIK0PUQOepmfr2-w", "text": "New to a city and need car repairs- is my middle name. Its hard not being a car guy but having your own and you're wives car to take care of. I always feel like I cant trust anyone who has the ability to repair anything on our vehicles since I wouldn't know any better. I need an oil change fast so I took in my VW Jetta. The guys we're really friendly. Read a lot of mixed reviews all over and talked to the manager about them when I got there. They fixed Thompson (my car) up real nice and no problems after like I was nervously expecting. I'd go there again.", "business_id": "QiI73966zZ0H6-ojFdbcOw", "stars": 4, "date": "2010-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VRDiQMV8GN3JySRjmdraEg", "review_id": "wQhh4tT1Wqw5QTJXeNX6UQ", "text": "We love the honest, dependable service.  They help us keep the budget reasonable. We have used than for years. Our cars are still going after more than fifteen years. It's a nice small business.", "business_id": "NjwxCfOTleHsYgcHtEsAPQ", "stars": 5, "date": "2014-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HIjr47HcsZQvmwYe7pW5-Q", "review_id": "CPs3j-Wt57jT4QLLwA8fqg", "text": "This shop is great. They service our fleet vehicles for work so I brought my personal car in when I needed the AC serviced. They fixed me right up and didn't break the bank. I appreciate their honesty and professionalism and tell everyone I know to go see Chuck at Camelback Garage", "business_id": "NjwxCfOTleHsYgcHtEsAPQ", "stars": 5, "date": "2014-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cZxY3BVSjkUmKcoAVJH9tA", "review_id": "QTqa5VpPI4T7jN02u8VzFA", "text": "I took my S2000 here for an alignment on a recommendation from a friend, and I'm so glad that I did! The gentlemen working the front desk was chipper and talkative. When I mentioned the car I was asking them to service, the tech that was in the office stretched his arms out and said, \"My friend, you've come to the right place.\" It turns out the tech is a fellow Honda/Acura enthusiast and sounded almost excited to help me out!\n\nHe drove the car onto the rack slowly, minding the lowered nature of the S2K. While he was doing his work we discussed all things Honda. He did not mind that I was in the shop, under the lift (inspecting the undercarriage), giving my car a once-over. Meanwhile, he's doing his job efficiently while giving me advice on how to modify it and get the most of a wonderful driving machine. \n\nPretty much, I'm happy as can be that I found a fellow enthusiast working right around the corner, who I know it out to do the best job he can on my vehicle. Definitely a reassuring feeling.\n\nWith all that being said, and as happy as I was with the service he, and the shop, had extended to me, the reason I am writing this review and rated it as such is because of the treatment I witnessed them giving other customers.\n\nWe've all had bad experiences with an auto shop at one time of another, and it seems like they can prey on women (who typically don't have the knowledge of cars your average Joe would). As I was in the waiting room, the gentleman at the counter, as well as another tech, were talking with a woman about her car, fully explaining the situation she was in, giving her numerous options to take care of her vehicle's problems. Although they weren't directing this honesty and service my way, I really appreciated seeing it and made a mental note.\n\nBased on how they treated me, and the other customers in their shop, I would recommend Tucker Tire highly!", "business_id": "n4N4NyNS78JUvamWttTxJw", "stars": 5, "date": "2010-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "F9hl4Dn1Ube3A6NShgfXmw", "review_id": "cP14vw7wOtIzklj2q_3q7w", "text": "Great service, plainly.\n\nI was referred here for tires, and they managed to get me in and out (changing all four tires) within 30 minutes on a weekday which I was working. One of the guys patiently ran me through the tire warranty literature during the process, and everyone there was helpful and knowledgeable.\n\nPlus, it's great when a place quotes a price for work and sticks to that price; no unwanted surprises= me, happy.\n\nThey're a long-time locally-owned business, so stop in if you need some repairs done, help the local economy, and get well-serviced.", "business_id": "n4N4NyNS78JUvamWttTxJw", "stars": 4, "date": "2012-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "y76b3SuhzkXUzyvQbZEEBw", "review_id": "8_ytrj561BrD6skT3VkJww", "text": "Good guys, and honest from what I can tell.  And they didn't charge me a diagnostic fee, which is nice!  This is the second time I've been here.  They changed all 4 tires on my BMW for a super good price!  I definitely recommend these guys!", "business_id": "n4N4NyNS78JUvamWttTxJw", "stars": 5, "date": "2013-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "D9roidMQd7aAB2ZjvSdSpw", "review_id": "hShketoqZhgVX65WOmQJVA", "text": "Wonderful & quick service. They repaired my tire from a nail hole, we will definitely use them when we purchase tires in the next couple of months. same day service & friendly staff", "business_id": "n4N4NyNS78JUvamWttTxJw", "stars": 5, "date": "2014-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GnvRsaj89_Cpivo83YyldQ", "review_id": "zJZx3zhxeZoaj75Q4-Izrg", "text": "When Tucker Tire could have charged me for tires, they chose to repair my tire instead, demonstrating their INTEGRITY.\n   When my route employee had some major issues with his truck that needed urgent repair, Tucker Tire demonstrated a SENSE OF URGENCY, repairing his vehicle quickly so he could be on the road and back to work.  This demonstrates their COMPETENCY.  It is easy to recommend this company.  I don't plan to go anywhere else, and neither should you!!", "business_id": "n4N4NyNS78JUvamWttTxJw", "stars": 5, "date": "2014-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yM0Bv8lqQrx9Yo0_1rtqxg", "review_id": "kxc9CG8KS1gjZB3eG0rjvg", "text": "Great Service! Came in because I had a flat tire and they helped with changing it out for me! No one was rude.", "business_id": "n4N4NyNS78JUvamWttTxJw", "stars": 5, "date": "2014-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "eOVVMnFC5jeAInwiG3uNEw", "review_id": "52V92Vmfte59EOigZ55B5g", "text": "Went in for an oil change, to get my tires rotated, and to see if I needed new brake pads since they've been squeaking lately. From the moment I walked in, service was quick and very friendly. Everyone seemed eager to help. There was a little bit of a wait, but I did go on a Friday just a few hours before they closed. Still, even with the number of customers they had, I didn't have to wait a very long time. Their prices were very reasonable and the service was professional and fast. They were able to fix my brake pads, which luckily was a super minor issue. They didn't try to badger me or sell me on more things, as auto repair places tend to do. They were very honest, gave me some advice about my vehicle, and sent me on my way. Overall a really pleasant, easy experience. I'd definitely go back.", "business_id": "n4N4NyNS78JUvamWttTxJw", "stars": 5, "date": "2015-11-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "2ROwNmjIV_D5wx5H0zElaw", "review_id": "ZthUBElffB5ed8C1-Q7u3w", "text": "I don't know if I can say anything original about this place. All of the previous reviews (for the most part) are SPOT ON! After a recco from a family friend, I have been taking our cars here for the past 4 years. \n \nMost recently I had a timing belt and some other normal maintenance done on my 05' Honda Accord V6. The cost was far better than the other quotes I had received (I wanted to see what the dealer wanted), and I don't know if Al or Frank have Thanksgiving plans, but my wife would love to have them and their family's join us! Honestly, the service from these guys is unparalleled! I TRULY felt like I had the work done by a friend.\n \nGo Here! I don't care if you have to get your car towed there from Eloy (God Bless You if you do), but do it... \n \nYou can thank me later", "business_id": "WH0Q0CmYW00vnJpG37O_cw", "stars": 5, "date": "2011-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Kl3Abb3ZFqZMzRDoTjwvxA", "review_id": "bpn1fvDtzXtjYobRRfR1Ng", "text": "If you own a Honda or Acura and live near Precision Imports then Precision Imports should be your go-to mechanic.  Having owned 2 Acuras and 1 Honda over the last several years, I can't recommend these guys enough.  They work on all makes and models, but they seem to specialize in Honda/ Acura. Their prices are fair and, even more importantly, they are straightforward and honest. Referred my brother when he needed work on his car and he is now sold on them, as well.   Their shop is small and it can be hard to park your car.  Their waiting area is also no-frills so you are better off dropping your car off and coming back later.  High quality work and integrity.  I wish all auto mechanics were like these guys.", "business_id": "WH0Q0CmYW00vnJpG37O_cw", "stars": 5, "date": "2012-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QwO4LVCiPZZdg5URrQfYpw", "review_id": "MULOAxWlhqIYIWkPv1oVUw", "text": "My family has been going here for a long time, but until recently I insisted on using my own mechanic. When he moved away I began going here. Here were the three situations.\n\n1. My battery went out and my Acura stereo wouldn't start without a code. I took the car to them and one of them ran out, popped the hood, jumped into the car, did some special trick, turned on the radio, jumped out and said, \"There you go, don't worry about it.\" THEY DIDN\"T CHARGE ME!!!!!!!!\n\n2. My wife was driving our car on the south side and blew a flat. Her dad changed the tire and shore off two of the posts. I had it towed to Precision with the new posts in hand. They fixed it that day and only charged me $40!\n\n3. I had a crack in my radiator and a couple of hoses. I figured it would be very expensive. I took it over there and they had it replaced in the same day for $340.\n\nThey are honest and efficient. They do not overcharge. Many other people know this so they are always doing a LOT of business. They are THE best in the Central Phoenix corridor.", "business_id": "WH0Q0CmYW00vnJpG37O_cw", "stars": 5, "date": "2013-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NtfVIlBtdq7JnYKNlCKYmw", "review_id": "UwYx3AzVve0iROJDKpeoYQ", "text": "I just cant say enough about these guys.  I took my car in yesterday for an oil change and my check engine light was also on.  They changed my oil no problem and my engine light was on because I needed a new gas cap.  I was SOO relieved.  These guys are totally honest AND reliable.  These are the kind of guys that I KNOW if and when I need them to do a big job, I'm not going to have to call around to price the job with other competitors, these guys are the BEST!  My boss has been using them for years and that is how I found out about them.  I am divorced so I don't have anyone to work on my Jeep but now I have these guys.  They can never close up shop because I don't know what I will do.  I don't want to go to ANYONE ELSE.  They also put on my registration sticker on my plate because I didn't have the tool to get off the license plate cover.  They are just GOOD GUYS.  Thank you Al!", "business_id": "WH0Q0CmYW00vnJpG37O_cw", "stars": 5, "date": "2014-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "y3zB8c2IUov0P8A2SMwrng", "review_id": "DQagyUEC64u4R8RoNm1QcQ", "text": "My 1995 volvo was a hand-me down which came with lots of problems! Volvo am I has been great with all my last minute calls and stop bys. The prices were always fair and repairs were made extremely fast! I will continue taking my car there as long as I have a volvo :)", "business_id": "7P3ECWrdSepztN5A3boTmg", "stars": 4, "date": "2010-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t8vH6ubd-6i9DTisZaQdgg", "review_id": "d8MSED7jTmlFlbc6PgD73A", "text": "I stopped by for new wiper blades on my C70.  They didn't have in stock but where able to obtain within a couple of hours.  I drove back and had my new blades installed in minutes all for the price of the part only.  I will go back again next week for a maintenance check.", "business_id": "7P3ECWrdSepztN5A3boTmg", "stars": 4, "date": "2011-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8KmHPVzyBW45_tXX8zU5mA", "review_id": "BzD8BosIfNRNN0s09n7OUA", "text": "This place is awesome! I came in based on the previous reviews and I wasn't disappointed. My car was sounding like a rice rocket, so I brought it in - turns out two welds had popped off of the exhaust. $20 and 5 minutes later, everything was perfect! Wish I had come in sooner this week and had my brakes done, but at least I know for next time! Plus, if you choose to wait for your car - The Yard is RIGHT NEXT DOOR!", "business_id": "5jqqVt-A8bwwJDj7Ii7tvw", "stars": 5, "date": "2013-10-29", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "azj8vFl7JuSyHqamSVhd4A", "review_id": "Vb7BkaP4qB_A3lDx8u0CdA", "text": "My second visit to Mad Hatter.  The first visit was on referral, the second was because they did such great work on the first visit.  This time, they did a manifold back exhaust for me, to include all new pipe, new o2 sensor bung, new catalytic converter and glass pack.   Part of my request was that they reroute the exhaust to give me room to put an anti-wrap bar on the rear axle of my weekend toy - a '93 Jeep Wrangler - and they accomplished that.   \n\nFurther, the previous downpipe from my exhaust manifold routinely made contact with my front driveshaft under front axle articulation, and they were able to move the new downpipe slightly to the side to eliminate that problem.  \n\nThere were some holes in the pipe near that driveshaft and near the old cat, causing my Jeep to sound like a UPS truck.  So, the bonus is that by sealing up the new pipe, they eliminated exhaust leaks, and I now have a little more power without the UPS truck engine sound.  \n\nBest of all, they did all this while I walked across the street for a bite to eat.   \n\nThanks guys!   Highly recommend!", "business_id": "5jqqVt-A8bwwJDj7Ii7tvw", "stars": 5, "date": "2014-10-23", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "WDUD1jjEl940rnCH4dBlXg", "review_id": "I8IlU-K_r9wOwt-2kTAiJw", "text": "It couldn't be more stereotypical that I'm asian and I drive a Honda Civic WITH mad ass vroom vroom sounds a la Too Fast Too Furious. \n\nOk, so my Honda Civic's muffler is broken. \n\nLooking underneath the car, the entire thing is rustyyyy lol (darn you snow and salted roads of Pennsylvania)! So I gotta do what I gotta do and prepped myself to spend dough for this. BUT! This place - well, Angel (yes that's his name) - did exactly what we all look for in excellent customer service. Upon inspection of my car's rusty muffler pipes and blah, he advised that all I really needed is to change the muffler and tailpipe, and not the entire stretch of pipe. Yay! That saved me a couple of $$$! \n\nSo so so lucky and very glad that there are still honest and competent mechanics out there! Take your muffler and brake problems here, people!", "business_id": "5jqqVt-A8bwwJDj7Ii7tvw", "stars": 5, "date": "2014-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3VYlrUCvG0dhlgoEruGOdw", "review_id": "rGdvep_fiIxtSuC63YOHAg", "text": "Came in for brakes squeezing. Said still had life left in pads just dirty. They cleaned it up and sent me on my way.  I'll be back when they need changed.", "business_id": "lgWOnPbDjKrpa-hhugGZGQ", "stars": 5, "date": "2015-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F5ffMTVBh8ruqFeGIItyiA", "review_id": "cyWaWRQgvcz0St67522GtA", "text": "I've been taking my Jeep here for service for a couple years.  Great customer service, reasonable rates, and easy to speak with about what needs done.", "business_id": "4OY51VjcxPKO6WGzRfVdVw", "stars": 5, "date": "2010-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "A9x6WO4DJuHzT2U_fT9Jhw", "review_id": "Ldpc5TMeHFOMZC8WgQPEeQ", "text": "These guys are \"as good as it gets.\"  Super friendly, reliable, good pricing, and great service.", "business_id": "4OY51VjcxPKO6WGzRfVdVw", "stars": 5, "date": "2013-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hetl3xkxwCQe__ahFBqamg", "review_id": "RQQ1hr-5ltjtgZAp3Hjkbg", "text": "This is THE place to go for any auto repair needs.  Jeff and his crew did some work on my Jeep and I couldn't be happier.  They're very friendly and knowledgeable.  I had a bad experience with a shop in Mesa who pretty much took me for a ride.  While Inman & Sons is a bit out of my way from east Mesa, the trip is worth it for quality service like this.  All my vehicles now go to Inman & Sons.  I would not hesitate to recommend them to anyone.", "business_id": "4OY51VjcxPKO6WGzRfVdVw", "stars": 5, "date": "2014-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "JgDkCER12uiv4lbpmkZ9VA", "review_id": "bwzq5UzywOq7Vq8GgrTA9g", "text": "I have to agree with every other reviewer. This place is awful. I was recommended to go here by Chapman BMW and I like to think I'm pretty good at sizing people up when I meet them. This was no exception.\n\nAndrew, the owner of the shop, treated me like I was an absolute moron and tried his damndest to upsell me with things I know I don't need or want. I've been a car enthusiast for a long time, and I can do most of this work myself except I don't have the tools or space. I know that a BMW auto tranny should not be flushed with pressure if it is high mileage, and I told him I don't want the service. He continued to argue with me and tell me he knows better. I'm sure he does quite well selling un-necessary service to your average luxury car owner, but I know better. \n\nArrogance only gets you so far in life. I walked out of here with a serious bad taste in my mouth.", "business_id": "5CgGQRXx_3TA8WQiKEmhhA", "stars": 1, "date": "2010-09-02", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "edHC2WgPfvXFrKNsrpDKyg", "review_id": "wNKb63_LsYiBNfAsn8dX7w", "text": "The best place for MB service in town, I was told by another shop I needed a new computer as it turns out all I needed was a new key. \nThanks for the honesty & great service!", "business_id": "5CgGQRXx_3TA8WQiKEmhhA", "stars": 5, "date": "2013-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "kDWAgzXNH5-WUsYh92UztQ", "review_id": "qao5932MxscqObBC6R4Axg", "text": "Andrew the owner of the shop is a typical salesman; he tries to sell you things that you don't need. I went in for an oil change and came back with a list of problems about $3000's long, which I know wasn't the case. For one I was told I need new brakes and mine have a month left, even though I know that's not true cause I just replaced the pads myself months before. I was returned the car with grease marks on my seats and carpet from them doing an inspection on the battery (located under drivers seat). And had to ask if they don't mind cleaning it. Among that a trim piece was now missing and I was told it was never there even though I bought the car new and never had the battery changed before. Upon leaving the shop I notice the \"service now\" light flashed back on. I had clearly made a statement to Andrew to make sure the light was reset after completion of the oil change; they failed to do that. I returned to the shop and asked to have it reset and I was told \"can you come back tomorrow, we are doing an update for our computer for your porsche\" I asked him why it wasn't done three days ago when I made the appointment knowing I was brining it in. I will never take my car to get serviced there. I am very mechanically inclined but don't have the shop space to do my own work. But as most luxury car owners may appear; loaded and full of money, who know nothing about cars, I however am not your stereotypical luxury car owner. BEWARE, He is a scam artist!", "business_id": "5CgGQRXx_3TA8WQiKEmhhA", "stars": 1, "date": "2013-10-19", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "khYS0k6VLlvzvDGzqWZzJA", "review_id": "tIno_wNTla2SvR9-aNEqlw", "text": "I first came to Atwood European 3 years ago after taking my 2007 CLS550 to a local dealership (who shall remain nameless) after having a strong smell of gasoline around my car inside and out - and in my garage - after fueling.  The dealership assured me the entire fuel tank had to be replaced at a cost of over $3,500.00.  I authorized some other work at the dealership regarding an issue with my trunk not opening and closing reliably and decided to seek a second opinion about the fuel smell.  Fortunately, I was talking to a co-worker whose parents had been taking their cars to Atwood for years with nothing but satisfying results.  I took my car there and after inspecting the vehicle, Andrew and his team determined that in fact, my fuel tank was fine and that my fuel pump was leaking and needed to be replaced - a $280 part - and that repair immediately (and permanently) solved the problem.\n\nSix months later, I was still having problems with the trunk from the dealer's so-called repair and was due for routine service anyway, so I took the car back to Atwood.  I ended up needing full rear brakes and front pads as well, which I expected as I was starting to hear the usual warning sounds when pads are worn.  Andrew and team were able to determine that the issue with my trunk was actually a problem with wires in the wiring harness that were damaged due to wear (a design issue with this car) and instead of recommending replacing the entire harness, they repaired the section that was damaged, saving me hundreds in parts and much more in labor.\n\nA year later, I had a front suspension strut beginning to fail and I took the car to Atwood.  Andrew was able to replace the strut with a part carrying a lifetime warranty (something a dealer can't/won't do), and he even refunded a day of my car rental due to timing issues with when he could get the car repaired.\n\nLast year, I had a complete transmission failure while on a trip in Sedona (on a holiday, no less) and consulted with Andrew after leaving my car at another small independent shop in Sedona (Redrock Precision Motors - I highly recommend them as well).  I ended up having them replace the transmission with a rebuild carrying an unlimited mileage warranty.\n\nMost recently, my other front strut failed as I was leaving for a trip to Flagstaff to visit my daughter at college.  This time, it was a more dramatic failure, requiring towing to the shop.  When we arrived at the shop late on a Friday afternoon, Andrew's lot was nearly full - inside and out - telling me that business is good, but also signaling that it might take a while to get my car done.  One of his crew drove me to the car rental place so that I could get a car to continue my slightly delayed weekend.  They didn't have to do this, but offered to because they knew the car rental shop was slammed and would take a while to come get me.  When I came back to town on Monday, I checked in with Atwood's answering service a couple times and was not terribly surprised not to hear back right away, knowing how busy they were.  As it turns out, their internet and phones were down on Monday and Andrew spent most of the night there with the service provider getting back online.  He called me back on Tuesday morning after getting all his messages and, much to my surprise told me that my car would be ready that afternoon if I approved the detailed estimate he gave me.  I arrived at the shop and everything was to my satisfaction - the work was done promptly and within the estimate we discussed by phone that morning.\n\nI've gone a long way here to demonstrate a pattern - a pattern of dependable and honest service that I've received from Atwood.  I know cars very well - I have several (and have owned many more) and work on many of them myself and am not someone who could be easily deceived or swayed by a shyster.  Andrew and his crew have always been up-front and straightforward about all the repairs and service I've had done there - often going beyond the call of duty to save me time and money - and I will continue to be a customer for as long as I continue to own european brands.", "business_id": "5CgGQRXx_3TA8WQiKEmhhA", "stars": 4, "date": "2014-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5PseUP8lKveIdB_VcxaVFw", "review_id": "C8wF2o1SnnUrhP4MJy1RlA", "text": "I have used Atwood European for the last 2 years for service on my Mercedes Benz.  I can say without hesitation that their service has been nothing but stellar in every respect.  Andrew Atwood gives personal attention to my car every time I take it in, and the work has been everything I could have hoped for.  They are better than the dealer, and about half the price!  I recommend them highly!!!\nJames T", "business_id": "5CgGQRXx_3TA8WQiKEmhhA", "stars": 5, "date": "2014-10-07", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "EMLEE7T0HScynyuVPw56hw", "review_id": "bgz4TvJ_zAxKM98_TJvNNA", "text": "Andrew has made an effort to step up his customer service in regard to my wife's car. He has shown that he is concerned and willing to try and provide dependable service. We appreciate his recent efforts.", "business_id": "5CgGQRXx_3TA8WQiKEmhhA", "stars": 4, "date": "2014-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "s-_Tev-XdBYd3ozEq6xqAQ", "review_id": "VLfMOYR0P1qPf29jIPWDQQ", "text": "Worst place that I've ever been. I paid $108 for an estimate. Andrew was rude and lied right to my face. He quoted $1100. to replace a part that just needed to be cleaned and lubricated. I did it myself for under $5. in materials.", "business_id": "5CgGQRXx_3TA8WQiKEmhhA", "stars": 1, "date": "2015-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jKoS7ZfndNeUkLkbNt1ASQ", "review_id": "I6rVmaVEWoW1wJ_cmu_q6A", "text": "Andrew is the only one in town who took the time to get my 308 past emissions. He built a muffler system and got it through every year. He knows older Ferrari's and other exotics... He saved me a lot of money and headache.", "business_id": "5CgGQRXx_3TA8WQiKEmhhA", "stars": 5, "date": "2015-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GkRS-15huaSInWcfw2wdrQ", "review_id": "Ra1XeGX54oScvlQ-RTCJ6w", "text": "Been dealing with Andrew for about 10 years. I'm on my second MB, which I would not have purchased without having a great technician like Andrew. I have never met a more honest and straightforward person in my life. He goes the extra mile to solve your problem at the least cost to you. He always stands behind  his work and I have never, ever, seen him try to upsell any customer.  If you are looking for a great technician and a great person, bring your problem to Andrew at Atwood!", "business_id": "5CgGQRXx_3TA8WQiKEmhhA", "stars": 5, "date": "2015-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SXaH697vRiPeGtkkm3NsjQ", "review_id": "9lnJzRl4CIt51KRLjDR42w", "text": "I brought my vehicle in with the engine overheating. Despite the fact that I didn't arrive until midday and there were 4 cars ahead of me waiting for service, they quickly diagnosed the problem, ordered the replacement part, and had me back on the road in less than 2 hours.  I was in a bind and needed the car that afternoon.  I am very thankful for their outstanding customer service.  The cost of the job was explained to me before they began the repair and was very reasonable.  I will definitely return to Hay's Radiator Service in the future and recommend these folks to others.", "business_id": "ZogIIx8SdAFedjXDT9jFFg", "stars": 5, "date": "2015-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MGe43SNhvvW-CY02qRXTeA", "review_id": "eIdLqUnfboKmmn0m3hmBOQ", "text": "They restored/re-cored the original radiator in my 64 chevy pickup from a 2 row to a 4. You can tell they put pride in their work. It looks brand new!  Great customer service, fair price, high quality work, fixed in 1 day, im extremely happy. I also learned that they can install an AC kit in my truck. I will definately be back!", "business_id": "ZogIIx8SdAFedjXDT9jFFg", "stars": 5, "date": "2015-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-c6Ob5yo62ycCsuDQURV9w", "review_id": "bm9xXF5TtumnsydyJZPAVA", "text": "Great work, honest, and always go out of the way to help.  Definitely a place you can trust.", "business_id": "2fXVpii6fawN7qCL_M2Urw", "stars": 5, "date": "2015-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MxA_wJOmUJxN1AmELO0RjA", "review_id": "jbOY4jjYJ9QcOdprTQMTMQ", "text": "They replaced the clutch in my Nissan Frontier about a year ago. After comparing prices for the job, the price was reasonable and service was fast, professional and courteous. They needed to make a small adjustment in the clutch pedal or something, and they fixed it immediately and apologized.", "business_id": "uKNp1tdMEibbriPE9bhZKg", "stars": 5, "date": "2014-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W7nkIA52ThKHnuNQF7EMnA", "review_id": "FeZE2xCDXiF_mY_ZSmddsw", "text": "Hard to find an auto repair place you can trust. I have been here twice and they are trustworthy, fair and helpful. Great service, fair prices.", "business_id": "uKNp1tdMEibbriPE9bhZKg", "stars": 5, "date": "2014-11-22", "type": "review"}
{"votes": {"funny": 4, "useful": 6, "cool": 4}, "user_id": "MLaaZKZiNkLqeBOH5y98GA", "review_id": "WiP9kGPrsGjmc7RImhfycw", "text": "We brought our car in for an unexpected problem which is always the worst way to try out a new auto repair place. They are in the neighborhood and we had been talking about trying them out for an oil change on one of the cars and that of course meant one of the cars broke down. \nBrought it in without an appointment and Glenn worked with us to get the diagnostic report done and repairs done. The car is older and we are not sure if we are keeping it much longer so it is helpful to know some other things we might want to get done if we decide to keep it long term. There was not a high pressure sales pitch to get things done like other places. Communication with report and specifics by email was great. No surprises.\nWill be bringing the other car there for sure and recommending to friends!", "business_id": "uKNp1tdMEibbriPE9bhZKg", "stars": 5, "date": "2015-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "k3wv0bv0qMQ5iS3Q9vguHA", "review_id": "4XbxsYVFv_kUMgFyiQz4Hw", "text": "Took my car into the dealership for warranty work and found out I needed new front brakes and rotors.  The cost?  $800.  No thanks!  So I shopped around for a service shop that works on German cars and found Auto Europa.  They offered the best price (half of what my dealership wanted), and the service was great!  The staff was super nice and didn't treat me like a \"dumb woman.\" Instead, they explained everything that was to be done to my car and I felt comfortable with the work they did.  The only downside is they don't offer shuttle service like some of the other places I called, but since they weren't too far from my office I didn't mind.", "business_id": "3jBkt2zeO1t0mUUBJMzTJg", "stars": 4, "date": "2008-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mbgppRfYH0kC7p7X2VPcGg", "review_id": "qa_YberEk5mDAKkSecEJOQ", "text": "If I could give negative stars I would. One of the used car salesman hit me with one of their cars. After being cited by Phoenix PD, he proceeded to lie about who owned the car and what insurance was responsible. Later, after finding out that Auto-Europa actually owned the car and was responsible I tried calling to get insurance information. I spoke with Jason who was rude and dismissive and refused to give me any info so now I have to hire an attorney to file a civil suit. If this salesman Joseph Pratt and the owner/manager Jason are any indication of the type of service and sales it's my duty to warn everyone of their scumbag practices.", "business_id": "3jBkt2zeO1t0mUUBJMzTJg", "stars": 1, "date": "2013-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "OcixEn23hAhZeZkC6kVn4w", "review_id": "IHFmSX5xEwl3mQSDIsKqFA", "text": "I first started taking my car(s) to Bill's 25th St Auto when they opened years back and have been impressed with the caring ethical way they approach their customers.  If you need something done they will do it right but more importantly if you DON'T need something done they will tell you too.  There is no quota or amount they have to ' get ' out of your time there; it is just honest caring ethical service. ( and a bunch of super nice guys as well) Thanks Bill...and Bill....for taking care of my service needs and those of my family and friends\nDr Stephen Doholis\nPhoenix AZ.", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2010-09-15", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "rbHxHwdchoZu5sxb8fvUiw", "review_id": "SNwcM_HI3mtR4WA6v3ewow", "text": "I am a small business owner with a fleet of vehicles, to shut down my trucks for service or maintenance cost my company hundreds of dollars. 25th Street Automotive understands this down time and handles fleet  companies with urgency. \nI recommend them highly. \nThank you \n\nCathryn Curcio\nOwner\nDesert Breeze Glass\nAuto * Home * Business\nwww.desertbreezeglass.com\n480-752-8191", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2012-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "thNK1lnjrKQW6YLAaGjMpw", "review_id": "EWaec60L_orOa5p9Pp-hrw", "text": "Amazing! I mean how many shops can actually be proud to be a BBB member let alone win the Ethics award! My service choice hands down even thought it's 30 miles from home!", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2013-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qwyjMQZ7SDA9owSg_nHbvw", "review_id": "_Pno-Cnk95ewURWulFmkGg", "text": "This local auto shop is the best!!   Totally realizable and honest.  Tell them if you plan to keep your car forever or if you plan to trade it in soon.  They will make recommendations accordingly.  They have saved me hundreds of $$ by customizing repairs to my needs.  Check out all of the awards they have received: AAA Top Shop and Better Business Bureau.", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2013-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "8KmHPVzyBW45_tXX8zU5mA", "review_id": "jJwukj9yg55paDg94_kpKA", "text": "In the service industry, it's difficult to come across truly trustworthy businesses. I get that everyone in the world is in it to make a buck, but I'm so glad that some businesses value honesty above profiteering, especially because they're intelligent enough to realize that when they treat their customers like people, and not dollar signs, the money will come. \n\nI've had the pleasure of bringing my two vehicles to Bill on three separate occasions. Each time he told me the TRUTH. The first time he told me there wasn't anything wrong with the car and he didn't try to charge me for an unnecessary diagnostic. The second time he told me he was just too busy and that it would be a few days until he could get to my car. He even let me call him over the phone to make sure my dealership wasn't screwing me over on the repair he wasn't able to get to. The third time he told me someone else who specializes in that service could do the job quicker and cheaper than him. \n\nHonesty: that's what keeps me coming back!", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2013-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TEbbCr5M4_Cm2dDhzy4GQQ", "review_id": "yQGRknZs_Vk9KfCdwg5s1A", "text": "I was looking for a mechanic and decided to try them because they were rated highly by yelp users. After my service here I will definitely be going back. There amazingly friendly, fast, low priced and super awesome. I felt they were being honest on their assessment and I will definitely be going back for future repairs. Thank you!!", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2013-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9MldGIxi4XqputDjZmEH6A", "review_id": "l321Za3SKJpqgwDqo2gfWw", "text": "If only the Bills were doctors...we'd be healthy!  This automotive shop is simple the best.  We've been trusting all our cars to them for years and years.  They are experts in their field, kind, and very honest.  It's like taking your car to family for repair. You can depend on their word and not have to worry.\n\nThey just looked for a way to save us money by suggesting a repair based on experience and know how rather than lots of expensive tests. We agreed that would be best for us and asked them to proceed that way... they were right as always and our car is running again. \n\nThey treat us with respect and are so courteous that they carefully put a paper liner down on our car floor to protect it and keep it clean (they always do this even though some of our cars are getting to be quite old).  We appreciate that nice touch.\n\nYou can trust your vehicles to 25th Street Automotive- we sure do!  Thank you Bill and Bill!", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2014-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3eXRiep__ROy4n7P278YSA", "review_id": "kEwkk1oGfbQ3NhrCrmAx9A", "text": "This place took care of my 2002 Maxima for almost four years. Bill is an honest person with a lot of integrity and has always been straight about what needed repairs, what could wait and what maybe wasn't worth working on at all.\n\nWhen it came time that the car needed more in repairs than was worth it, Bill was up front about costs and, even as a mechanic, recommended that it would be more worth while to put the money into a down payment on a new car rather than dumping another few grand into my Maxima. He was even kind enough to recommend some cars I may want to look into. \n\nAnother nice perk is that they will drive you to/from home or work while they service your car if you are going to a place that is within a certain proximity.\n\nI appreciate how I'm treated at this shop, and of course it always feels good to support incredible local businesses. I will be giving my business to this shop for as long as I am living in the Phoenix Metro.", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2015-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6Tk5_ZhQlcsPn4e-rpxwKQ", "review_id": "tp4l8SLaBJoyY39lXI9_1A", "text": "I called because I had just had my car stall on me on the highway and needed to tow it somewhere to get a repair. My usual car repair person was not close and I though I would give this place a try. I asked about towing my car to this place and the guy I spoke to was very rude, I understand if you don't have time to get to my car but he just had a very matter-of-fact attitude with me like I should have known better and my business was not that important to him.\n\nLuckily I called kinkades repair close by and although they were just as busy and weren't going to get to my car until the next week the guy was very nice and was willing to at least hear me out and answer my questions.", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 1, "date": "2015-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6LMZqCEiff87MWtLq3EPZg", "review_id": "w5_063vJOMhjMG-t_MhMZg", "text": "Excellent service through and through! I found my local auto repair shop, thanks to a referral from my son-in-law. They are very honest, only do to work that needs to be done. I called and received same day service.  I understand that sometimes this is not possible, but I'm glad it worked out for me. Added bonus- the driver that drove me to and from the job was very personable. Thanks Bill & Bill! You now have a loyal customer that will refer others. Anna", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2015-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "-txH2zJSBZQHO6RWvoWXuQ", "review_id": "nfkUr4tOrHogCBoB8gVEVA", "text": "Due to a ridiculous amount of car trouble over the past year, I have had to visit these guys way more than I would like to.  And I'm sure other ladies can back me up on this, but sometimes it really sucks to walk into an autoshop by yourself.  But I have never once felt like I was getting fleeced.  They are all very nice, explain everything to me, and the manager Terry always remembers me when I go in.  \n\nThey're extremely quick, super polite, and have not once suggested to me that I need all sorts of crap done to my car.  In fact, I asked the guy if they could do something, and he told me I really didn't need it.  \n\nThanks guys!  It is such a relief to have somewhere to go where I know I'll be taken care of.", "business_id": "7K-uRX-Dk65rjF_CkdmHQA", "stars": 5, "date": "2008-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F9hl4Dn1Ube3A6NShgfXmw", "review_id": "isf10bKo9-uDS8PKdMoAKw", "text": "Never been a fan of dealing with mechanics, especially at big name-branded (in this case, Firestone) shops as I'm afraid of any overhead. Well, this place was a pleasant surprise.\n\nIt was a Saturday morning and I was having that \"metal on metal\" grinding noise when I braked. I came to Yelp! and saw these guys, who are actually less than a block away, and decided to give them a chance based on the good reviews. Welp, it was a good choice.\n\nFirst, no indifferent attitude (which is what I liken to most mechanics). The guy on the phone was all about helping me and I was surprised to find they could fit me right in and have me in and out in an hour.\n\nTurns out I didn't need rotors like I had thought, and he just changed the brake pads. Love not being upsold this, that, and the other thing or having unnecessary repairs! He even applied a coupon for $10 off and changed my windshield wiper blades for free- pretty atypical of a branded shop, I'd say.\n\nAnyway, check 'em out.", "business_id": "gCaccP5CxQn-j2KCNbD4gg", "stars": 4, "date": "2012-10-27", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "F9hl4Dn1Ube3A6NShgfXmw", "review_id": "2BYIao6MhmX7PeItowL0lw", "text": "Well, jumped the gun on that last review I guess.\n\nTurns out, the work they did here was botched. I'm not sure if I'm influenced by the good and helpful attitude of the guy who helped me here or not, but I'd like to think it was some sort of mistake. Still, a costly one for me.\n\nI had gone in with what sounded like worn brake pads to the point of metal-on-metal rotor scraping, and thought I would need new rotors. After checking it out, the aforementioned \"good guy\" told me the rotors were fine and simply installed brake pads and cleaned the back brakes. \n\nA week later, I started hearing the noise again. I took it to another shop (Larry Harker's Auto) and they found that the rotors were not in good shape, and that in fact one was much thinner than the other. After they replaced them, the noise vanished and has not come back.\n\nLike I said, I want to believe this guy just made an honest mistake; it just seems like an unlikely scenario, though, given the problem. Just kind of goes to show that smaller shops with a long history in the area are usually the way to go.", "business_id": "gCaccP5CxQn-j2KCNbD4gg", "stars": 2, "date": "2012-11-15", "type": "review"}
{"votes": {"funny": 7, "useful": 9, "cool": 8}, "user_id": "QKW7sYPWPSsIcWqSiDzChQ", "review_id": "Kpqo-pyNSrPVbH2DtjlXvQ", "text": "family owned and operated\n\"aligned\" my car, while i waited\npulled it out, on to the racks\nlooked it over, front to back\nturned out, i just had low tires\nembarrassed,  but had to admire\n\"no charge\", ol' Jack  said to me  \nJacks Auto, since 1960\nopen air, work from below\ndomestics, imports and limos\npretty much, will fix 'em all\nworked me in, with one quick call\nalignments,  that will set you straight\nsuspensions, and they'll fix your brakes\nmonday thru friday, weekends off\nkwan's not king, at this shop  \nrefreshing, in these days of greed\nlousy service,  rude employees\nold school, old enough to know\nwhat it was like,  when you would go\nto a garage, or filling station\nreplaced now, this franchised nation\nimpressed, by his, honesty\nand their solid, warranty\nseven months, seven thousand miles\neast bound, i began to smile\nno more wobble, tires low\ninflate, I was, good to go\nand pay it forward, owe him one\nso go see Jack, he'll git er done", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 5, "date": "2009-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0fOPM1H03gF5EJooYvkL1Q", "review_id": "uQS6PSny4QVkvdZs0xw5RA", "text": "Extremely clean Lot and Waiting area.  No wait for my 8:30 AM Appointment which I was 7 minutes late for due to Indian School Construction (Thus avoid EAST BOUND Indian School prior to 16th Street as once you pass 12th Street you are stuck until you route thru the one Right LANE open.  In addition, The City Bus stops a few times which ties the back up further.  I was charged the quoted amount exactly and paid by Credit Card.  In addition, I was informed of a damaged Tire to replace soon.\n.", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 5, "date": "2011-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "i0A-c2yoHySmFhRV2sDR1g", "review_id": "Cgdn0HWHVbgxM2tuUl2KUw", "text": "Took my Dodge 2500 here today to get a wheel alignment. I had been here before and they told me I needed to get new lower control arms and a steering stabilizer, I had these installed yesterday so I was back to get my alignment.  They checked the truck and told me it was so close they did only a very minor adjustment and there was no charge! The truck drives nice and straight and I'm extremely happy. \nYou could not ask for better service, I give Jack's my highest recommendation!", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 5, "date": "2011-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2URwvKJRHf68V1UncLVaZg", "review_id": "8fgVDG7KwgmpY63ay2H0Gw", "text": "Great Job Gentlemen! Had them work on both of my vehicles and will gladly go back when ever I need to have work done again. Joel and Ken are very professional, No BS when it came to what needed to be done. Best in Town.", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 5, "date": "2011-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "M0qNUNClSgDkkrClMKXd4A", "review_id": "p6xPK-AH3LAzs1jdAl2ZsA", "text": "These guys are always fair,  have the best work ethic and never have a problem explaining everything in detail. They use the old-school weights, analog solution to an analog problem. No computers, and its dead on every time.", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 5, "date": "2013-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "roqJZ47TCjgMoe43exJX4Q", "review_id": "5U8v4hZvydIRLWVyxLpLJA", "text": "I'd give them 7 stars if I could! I used a hand alignment shop in Michigan before moving out here and was so happy I found Jack's here in AZ. Hand alignments are the only way to go.  I've been there three times with three different vehicles. A cargo van, a mini-van and a Honda CRV and every time they charged me less than I expected for an amazing alignment. This place costs half what a computer place charges for twice as good work. Do not even think about going elsewhere. \nAlso they do brakes and shocks. Not sure what else. My OLD \"reputable\" mechanic in Scottsdale charged me $400 for \"heavy duty\" shocks in the rear. They put on standard shocks, charged me $100 for $50 shocks and loads of labor. I inquired here. Real Heavy Duty shocks for $100 each for my cargo van and $85 for labor. $285  vs $400 plus the real thing and not standard shocks marked up double. \nI really love coming here and it's fun to watch them do the work. They are extremely professional and efficient. My front end alignment on the van was exactly $60. Not taxable because it's labor and no \"shop fees\".", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 5, "date": "2013-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pnXQOi2C9xQ06MLOMnnxOA", "review_id": "cCXDl_sHm81zw9-yT7R-dg", "text": "I was little surprised when I showed up at 3:50pm and not one car on the floor. Techs were closing up and turned me away. They close at 4:30pm and according to tech no vehicles after 3:30pm. Just a heads up just in case you only have time after work to take a vehicle in for service.", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 3, "date": "2014-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Oe4pGWwBL2ZmmwynEOWWgg", "review_id": "lQRYTHF_cIn9er8qGZ9BvQ", "text": "Here are some guys who really know their business. Honest and reliable.  My Lexus dealer could not fix the problem - my car still pulled to the right after they did an alignment.  Jacks merely rotated the front tires and the problem was solved.  Why couldn't Lexus do that?  When I asked how much - no charge.  Now you know who the real expert is.  Will need brakes soon and I will go to Jacks for sure.", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 5, "date": "2014-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WWTV2mCEOluVeZTrchavHg", "review_id": "166rlpjL89-hTaTVhwqadg", "text": "Place looks clean, inside help is very nice. My technician though was rude, condescending and drove my truck like it was a hotrod.  The alignment feels good, steering wheel is still off but better. The attitude adjustment is the only thing bringing down the rating.", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 3, "date": "2015-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "ZUDTfC2-A2tf3DZw_9KYDg", "review_id": "MahKN9bci7wGTHfGmaW_0w", "text": "You're much better off just paying like $20 extra for an alignment and going to a dealership or other professional place where they have a real alignment rack than this hole in the wall. They just seemed clueless about my car.\n\nRude people that talk down to you, understaffed, junky room to wait in, and take far longer than they promise.  The price is just not that much of a discount, I'd gladly pay a tiny bit more.\n\nThey also just seemed out of their element, like they were feeling their way through the job.", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 1, "date": "2015-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zVDdjn2jPVKZpwWRxr502w", "review_id": "lqIh-FiJVaCYDul5hmU0_A", "text": "After taking my car to Art's Auto Body (just up the street), Dave had recommended Jack's because this place specialized in the issue I was having with my car. Took my car in first thing the next morning, and within ten minutes, they had me on my way... just a few loose bolts, and they didn't even charge me. Honestly and politeness is what will keep me as a customer.", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 5, "date": "2015-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nQRty5GZzxu_XrCh8U9vIw", "review_id": "Q76sph980zjcgKjHd5QhCA", "text": "I called to have my car aligned and they told me over the phone of their warranty. After the work was done, and my card charged, I inquire about the warranty and they then tell me AFTERWARD that since I have \"mixed tires\" they would not cover a warranty. I say okaaaaay and leave only to find out that the car steers to one side,\nI politely call with the intention of just having them adjust this, no big deal sort of attitude to which I'm told it will not steer right due to mixed tires, at that pint I'm mad because I'm given attitude for\nSomething they didn't tell me about TWICE and when I show up im told it will never stir right but he could move a tire which may improve things. After talking and trying to figure out if it's worth a try, I  soon I get the \"just go find someone who will make you happy\" cop out. The only positive was that I was refunded for this shifty experience. Steer clear from here!!", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 1, "date": "2015-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZyRClG_Dl8jjwKVifBrK8w", "review_id": "yknvlnsmFBQHehO2I0pLew", "text": "This place is amazing,  they are friendly and honest. I will bring all my vehicles here for service.", "business_id": "nDJ9Pbt0RF6iXLgVzGyC3Q", "stars": 5, "date": "2014-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JQKxQNy6GqMB_rVkmRmMQw", "review_id": "qP2iwOYX7PfbC1D69D7VnQ", "text": "I've been taking my vehicles to this location for over five years. Maurice is outstanding. He is very polite and professional. I have always been pleased with the quality of work completed by staff at Sun Devil.", "business_id": "nDJ9Pbt0RF6iXLgVzGyC3Q", "stars": 5, "date": "2015-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iCxOxdKXTdZVcMszgSNKUw", "review_id": "0nIyl_4o3Ywya7lmI3XBDQ", "text": "Loveeeee Sun Devil Auto! I got stranded one day and had my car towed to this location (before I had always gone to 7th st and Bethany), to make a long story short, my alternator failed and I also got new rotors and brake pads, Maurice had me in and out same day. Very friendly and overall make me feel comfortable. Thank you again Maurice! I will definitely be back to this location any time I need work on my car done.", "business_id": "nDJ9Pbt0RF6iXLgVzGyC3Q", "stars": 5, "date": "2015-10-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "aRmRVMsE22Sj-omnhZTJAw", "review_id": "F0ceFeBfA_T3go_UD0FGOQ", "text": "This place is a complete and utter joke... made an appointment for a simple oil change.. I walked in 15 minutes early and literally sat there for 45 mins.. no one even acknowledged me.. mind you I had an APPOINTMENT.. you would think someone would be at a counter calling me telling me Im late right?? Nope.. not this place... I should of robbed the damn register on my way out cause there is no one even around.. that dude at the desk works like a chicken with his head cut off.. horrible horrible service.. now Im NEXT DOOR at Brake Masters and they already have my car being worked on... save yourself the complete nonsense going on at Sun Devil Auto and just go somewhere else.. or do it yourself.. I would pay some dude in front of the Home Depot before I ever thought about going back there", "business_id": "nDJ9Pbt0RF6iXLgVzGyC3Q", "stars": 1, "date": "2015-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7mRjaqZopHm69EBzObNp1g", "review_id": "eeqIYaLVUAeusoC6pIrjnQ", "text": "Do yourself a favor and take your car to good, honest people who aren't going to try and sell you on unnecessary repairs and maintenance. The folks at Tony's understand that everyone is on a budget these days. They have gone so far as to break down my list of needs in order of importance and price. Their cost has beaten the dealership as well as other repair shops every time. They have even picked me up at work so I don't have to worry about getting a ride from someone. They go above and beyond every single time and to be quite honest, it's nice just to walk into a place where they are happy and know your name. The Lil' Red Jetta is in good hands.", "business_id": "S1q51o5JqD5rzzDq_WD5_w", "stars": 5, "date": "2011-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mKAjaoumV6-MZFUTP0Eznw", "review_id": "5LUT5x2TN68wDDu6rmrusQ", "text": "last week I had to get my truck emissions-tested for MVD registration renewal.  Drove to the testing center first thing in the morning, and it failed one of the three tests.  \n\nDrove to Tony's, they drove me to work, picked me up after work and handed over my keys and the emissions testing 'pass' certificate.\nThey had fixed the clogged engine valve, and drove my truck down to the MVD testing center and had it re-tested; it passed, of course, so I just mailed in the forms.  That's what I call first-class service.", "business_id": "S1q51o5JqD5rzzDq_WD5_w", "stars": 5, "date": "2012-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5tJA7V8_bBHKTNxJJ4lmWg", "review_id": "ODhwrvgMVL-0TvLxfPJXYw", "text": "We have been using Tony's Auto Service for 14 years. They are honest people with excellent mechanics, who tell you all you need to have a safe reliable car. They will tell you what MUST be done and what might wait. Their prices might seem high, but their service is excellent. You can trust them.", "business_id": "S1q51o5JqD5rzzDq_WD5_w", "stars": 5, "date": "2012-11-28", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 4}, "user_id": "fczQCSmaWF78toLEmb0Zsw", "review_id": "q_mf4pOW3TSHjioZWowP4A", "text": "Nothing like having a crazy busy day filled with meetings, etc... and walking out to your car to find a flat tire. Womp womp.\n\nNow I don't know much about auto repair, but I didn't think my flat tire was that bad at quick glance.  So, I figured it would be okay if I drove on it a bit.  I started driving to my next meeting spot and called my husband to let him know that I'd be taking the car in later, when whoa - I got an earful from him.  He had me take the car straight to the nearest service center (Tony's).  He said it was dangerous to drive on a flat and basically hung up on me for attempting to do so.\n\nLuckily, Tony's came to the rescue.  It turned out the flat was caused by a screw in the tire.  Scott took one look and said it wouldn't be a problem to patch up.  He also hooked me up with the yelp discount check-in offer, which was better than the one for AAA members.  \n\nA couple of hours later, my tire was good as new!\n\nTony's offers a complimentary shuttle to take customers to/from their car, but I didn't need to take advantage this time.  \n\nNeedless to say, if you find that your auto needs service, I highly recommend heading over to Tony's.", "business_id": "S1q51o5JqD5rzzDq_WD5_w", "stars": 5, "date": "2014-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tsJWfrGIAGAUFohlFKvg3g", "review_id": "4NMj-IOOKJ_ycj5HoH2Djg", "text": "I received great service and they got me on my way quickly. Vince even took the time to explain the difference in tires to me and made me feel like I was safer when I left the business than when I came in. I'd definitely recommend!", "business_id": "Q_ntUL08gNFpCHhJALwQFA", "stars": 5, "date": "2011-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aAzLPIcZqBtm4RwVcsWtFw", "review_id": "HICSoE33qoTeaa80AbshoA", "text": "Dont know why i came back to this location a second time! This place suckkss & lack major customer service. An hour & a half & still waiting...for an oil change & i even scheduled the appt online!!!", "business_id": "Q_ntUL08gNFpCHhJALwQFA", "stars": 1, "date": "2011-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Qgc_li9aTDxw5nsuWwqi4Q", "review_id": "baraBW8f3mrKDKy-kX_trg", "text": "I went here to get some service done. They did several things including change of my thermostat. I normally like Firestone and prefer to go to them. I was disappointed that they charged me a diagnostic fee and did not credit that fee towards my expensive repair.\n\nFast forward to a later date, my car overheats again. I take it to another Firestone, and they tell me (and show me) that the thermostat gasket was installed incorrectly.\n\nNo big harm, I don't think there was any engine damage.  Firestone in Glendale, Ca fixed the issue under warranty.", "business_id": "Q_ntUL08gNFpCHhJALwQFA", "stars": 3, "date": "2011-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l60V-WimxqKK_29evZRlPA", "review_id": "2LoYXXbg9BFEUNPUz7NNHg", "text": "I picked this location because it was one of the few open on a Sunday and I desperately needed an oil change. I made an appointment online, very easy to do. I arrived on time, gave all my info to get into their system as a new customer, but was told it was an hour-and-a-half wait to have the work done because there were other cars ahead of mine. I said I would wait because the work needed to get done, but let him know I was disappointed that they couldn't honor the appointment (especially since I had a hyperactive 4-year-old with me). Otherwise why bother making an appointment? I was happily surprised that they pulled my car right in and began working on it right away. I had also asked for a tire rotation, and he came out to tell me that after looking at my tires they really didn't need to be rotated yet so he removed that charge. I REALLY appreciate these guys went the extra mile to honor my appointment AND not charge me for a service I didn't need. I'll definitely be back.", "business_id": "Q_ntUL08gNFpCHhJALwQFA", "stars": 5, "date": "2015-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UUMAw4ibw8yzXHj8PjOF5A", "review_id": "AuiOV7aTXCpxMgrfXYpQ7Q", "text": "These guys do know their stuff.", "business_id": "8wF2zj1Np6x7DY5BpJ4C-w", "stars": 5, "date": "2013-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "Mj_mEJD3LPxj93V2jVvpHw", "review_id": "Rx0nlg70VSPA6XppC7r0Xw", "text": "I've taken both of my vehicles to Alexander's (now A&J) for at least 5 years. And I've always had excellent service and thought the price was fair. \n\nWhat can you say about a car repair shop? They charge you a fair price, fix the issue, and don't screw anything else up. Thumbs up.\n\nBut there is one thing about these guys that stands out to me.\n\nI was referred to A&J's by a good friend who, by her own admission, is a merciless consumer. She's great at knowing where she can get the most for her money and when she finds those places she's very loyal. Since I've been taking vehicles to Alex I've also referred a handful of people there. And they've all thanked me for the referral and (at least those that still live in Phoenix), still take their cars to A&J's for service.", "business_id": "Y1ReKMzP5pl76oDUrheaBg", "stars": 5, "date": "2009-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CdOPheKnug6JVszOGEdATw", "review_id": "3CBz7gC5YVOV8JqmIGXEnQ", "text": "Great service, Came here they gave me a quote now I'm sitting in the waiting room while their fixing my ride.. Small but okay. Free water, magzines and juice, six chairs in the waiting room. With a restroom.", "business_id": "Y1ReKMzP5pl76oDUrheaBg", "stars": 4, "date": "2014-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2BdazjB9e8H3Qt9FvkUrVg", "review_id": "oJ5q5wDIK0a2quyljyMiug", "text": "My girlfriend and I have both taken our vehicles to Alexander's and have received nothing but exceptional service. The last time my g friend took her truck in for brakes they noticed she had a bad tire, Oscar went to discount and found a used one and charged her nothing for it. Also, threw in free oil change! Great service and fair prices every time!", "business_id": "Y1ReKMzP5pl76oDUrheaBg", "stars": 5, "date": "2014-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hTdOMPAkhD2A2_1AAt96bA", "review_id": "_WbJkxtBWF8e01ulDtPiew", "text": "I've been going to Alexander's Auto Repair for 12 years. They are honest and very reasonably priced. Alexander and Oscar are the best!", "business_id": "Y1ReKMzP5pl76oDUrheaBg", "stars": 5, "date": "2015-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nQRty5GZzxu_XrCh8U9vIw", "review_id": "bxVlLz8iuhcVGOBH-2xa2Q", "text": "Found myself stranded without warning that this could happen, despite some recent work done somewhere else.\n\nCalled Alexander's and they went above and beyond to get me taken care of. Their customer service in doing so was greatly appreciated and I was able to get my car back same day, despite most repair shops estimating the issue to be resolved in about 4 business days (as it is Thanksgiving weekend).\n\nTo top it off the warranty is 2 years or 24,000 miles. They towed my car and picked me up to retrieve it. \n\nI would highly recommend taking your business here. They are professionals that care.", "business_id": "Y1ReKMzP5pl76oDUrheaBg", "stars": 5, "date": "2015-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QfMkmIcJVAiKYgItdX5D5A", "review_id": "6IU3HlTpni8up-Wilr2XAA", "text": "great shop...manager Craig is fair and knowledgeable....saved me a bunch of money!!!\nI've had all three of our BMW's in there for service..!\n\nMike", "business_id": "5m1L5l_k2xFTZO3jttmVOg", "stars": 5, "date": "2013-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "te4qVK4D5mQyaa6GVZda4A", "review_id": "arZ9GyuU65A4B0f7neMCgw", "text": "Scam Artists!\nBeware, these guys will try and tell you anything to get as much as they can out of you.  I went in with my Lexus for brakes that were  grinding.  They gave me the classic line that my rotors were too far gone.  Of course, they wanted to put new rotors on and pads at the tune of 450 dollars.  The manager, Craig, tried telling me it was so expensive because my car is a Lexus.  Such BS! I said, no thanks and went to a reputable mechanic near my home who said the rotors are fine.  I got new high quality brakes for 140 dollars.\nThese guys are pulling the classic scam that makes the auto brake industry so shady.  Do yourself a favor and look elsewhere for a place you can trust.", "business_id": "5m1L5l_k2xFTZO3jttmVOg", "stars": 1, "date": "2014-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Xxvlrm76TJP8WKkvqNaGBw", "review_id": "96xkQQqUc07mz60Hy2IP4Q", "text": "I took my car there for an oil change and as soon as I walked in I realized the great customer service. They are very nice. They said good morning to me with a smile on their face. I went to three different places before I ended up on this one and what I heard as greeting was \" WHATS UP... WHATS GOING ON.... and a simple..SUP?\"  A GOOD MORNING from the guys at Break Masters # 122 made my day. They finished the oil change and the gentelman, a young guy, who changed the oil brought my car around and gave me my keys with a \" Thank you sir, HAVE A GREAT DAY\"  NICE.  While I was there a lady came 3 times to the waiting room to check on the coffee and to clean around. I really recomend this place. Prices are good but service is even better...", "business_id": "5m1L5l_k2xFTZO3jttmVOg", "stars": 5, "date": "2015-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aRmRVMsE22Sj-omnhZTJAw", "review_id": "u5MxjsnW9T9M8QX5l-ZLlg", "text": "Awesome awesome.. walked in after some horrible experiences elsewhere and they had everything done in less than an hour... thanks guys...", "business_id": "5m1L5l_k2xFTZO3jttmVOg", "stars": 5, "date": "2015-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "g5aVCtfiKNFVyiL3wCgLTg", "review_id": "a7WdYEhGrMcl1v570Bd7Wg", "text": "Hm, I sort of feel bad giving these guys such a low rating since they were rated so highly by the other reviewers. But honestly, I can't say I had a good experience there.\n\nI went to these guys based on a personal referral from a friend and b/c of the positive Yelp reviews.  I should have known better, since there were only 3 reviews, and my friend was new to Phoenix and went here because it was close to her home.\n\nAnyways, I have an older car and the check engine light came on.  I made an appointment, and when I show up, these guys wanted to charge me $98 to just diagnose the problem!!  I mean, most other shops do it for $20 or for free.  At that point, I didn't have much choice because I had already made elaborate arrangements for a friend to pick me up and I was getting worried about the check engine light.\n\nLong story short, they wanted to charge me a total of $750+ for repairs, labor, and parts.  I think their labor costs are way overpriced because I looked at what they wanted to charge for parts and it seemed more or less reasonable.  I buckled at the amount (mostly because I didn't have the cash) and because I wanted to get a second opinion after I learned that the check engine light costs $98 to check out. (I've since been to a Midas by my house who diagnosed the Check Engine light for FREE. And I've seen other places that do it for $20...still a chunk of cash compared to FREE but measly change compared to $98). \n\nNot knowing where to find a reliable mechanic for a second opinion, I took it to the dealership. I know that dealers usually charge higher prices that shops, so I was prepared for the worst.  But at least I wanted to know if the repairs suggested by Kelly Clark were legitimately needed.  Well, it turns out the repairs were really needed, but the shocker came when they quoted me a price of $550 for repair, parts, and labor.   That's a $200 price difference!!!!!  And I got the quote from a dealership too, who I know is probably charging more than normal. \n\nBottom line: Kelly Clark quoted me $750+ for repairs that my dealership did for $550.", "business_id": "joVkrByRkDujZP3w4_1Fcw", "stars": 1, "date": "2010-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "Ebi30JkOwUzAI-qRchF-xw", "review_id": "GrOC_GBb4eO7_7lcVq3qaA", "text": "I read a review of how great they were. I took my truck there. EEKS, me thinks never again! I had an 8 am appointment for an oil change and head light problem. I waited for 2 hours and they didn't address the initial problem (the head light) until I reminded them at the time of payment. I clearly explained that I received a citation for having a head light out and I needed that looked at first. They reconnected the wire that had shaken loose and were shady in writing it on the receipt. I asked the guy to clarify on the receipt what was done and he blew me off by saying, we didn't do a repair. He refused to make that clarification on the receipt. This caused a problem when I went to the Paradise Valley court to prove I had the head light problem corrected. They are extremely overpriced and don't care about the customer.", "business_id": "joVkrByRkDujZP3w4_1Fcw", "stars": 1, "date": "2010-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "VCK3eQKToEkmu8jdSEbTwQ", "review_id": "6vThheWBak4j6s2Hncz2tA", "text": "THIS is the place to go for honest automotive work. I have been coming here since 2007 for oil changes, car battery, emissions and other various work over the years. \n\nI have referred two friends to this shop and both have thanked me profusely for doing so. \n\nI cannot recommend this place enough. This is the real deal and they will not give you the run around.", "business_id": "joVkrByRkDujZP3w4_1Fcw", "stars": 5, "date": "2013-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xDNP1Ah50e6RjBOz2EBMDQ", "review_id": "Tu5r4KfNFpQn8D5G-iCI8Q", "text": "I have been bringing my multiple Bimmers here for over a decade.  Scott doesn't want to be your friend, he just wants to fix your car.  I had an experience a few years back where my car literally wouldn't run.  I thought I was in for a very expensive fix.  Turns out the vacuum hose separated itself from the manifold.  I simply need a clip replaced.  My total bill was under $25.  If they were a dishonest shop, this would have been the perfect time to take advantage of a customer.  Half the time he tells me what my car needs, but suggests I don't do it for another 6 or 9 months.  I believe honesty comes first with Scott.  In this day, what is that worth?", "business_id": "Yhbsyq_n4J3vLhw9WkXwAw", "stars": 5, "date": "2011-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EsJQCG0cLBjvGXIaN5XuEw", "review_id": "V0dPLjlva8ufY84JVr1lFw", "text": "I've been servicing my 2004 BMW 325i with Ray for the last 7 years after I found out there was more out there than a dealership to rely on. Its a win win with Ray.\nCars do break down and cars do need repairs. My last repairs over the last 3-4 years.\nRear drive shaft, belts, pulley wheels and expansion tank (broke on me while driving to work), radiator replaced, power steering pump, head gasket, both control arm bushings, both front upper mount struts. Yeah I saved money and my car still runs like she has 2,000 mile on her brand new. Now going on 160,000 miles. I trust Ray because he has a staff that knows the year make and model and what to look for.\n1 year warranty on the work performed. I had my head gasket replaced 12 days left on the warranty. Bottom line my car still moves and handles top notch.", "business_id": "Yhbsyq_n4J3vLhw9WkXwAw", "stars": 5, "date": "2014-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RQZL4DZbJQ5MUGloNVKPBg", "review_id": "aX8XtZOVINjmLZ46z1oJ7Q", "text": "James Strang is the man! He's the owner of the shop, and if you're looking for an honest mechanic look no further. James always lets me know what's going on with my car. When I should change something, or how long I have until something will break. This guy takes pride into his work, and it definitely shows. My Honda has +200K thanks to James..", "business_id": "lxloQZzZjX6ftk-SipI1wA", "stars": 5, "date": "2012-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nsdG8GFDnCR9fZL7VBS2Mg", "review_id": "tXrUc3NlE30qg9F9Z7rrag", "text": "DO NOT use this AAMCO on CAVE CREEK RD!!  After posting this comment I have been called several times by the owner threatening me with legal action for using his name in posting my opinion of his horrible shop!!   Yet another reason this shop is VERY BAD.   Here is YELP's own review guidelines:  ( don't post other people's full names unless you're referring to service providers who are commonly identified by or commonly share their own full names.)  HHHMMMM  Wonder why S.L. doesn't commonly share that he is the owner of this shop or want his name used???    This location charged me $3,400.00.  To RE-build my transmission.  Used scare tactic \" oh you CAN NOT drive out of here it is un-safe\".  This is a common practice of AAMCO to separate you from your car as quickly as possible.   After leaving my car for 5 days with this location they did several other repairs on my car.   I went to pick it up and was dealing with the owner Scott.   He was shocked to learn I was paying with my debit card.   He wanted me to pay with cash !!    I said no I don't have cash.   After 3 weeks I brought my car back due to a bad vibration.   I dropped it off on a Monday at noon.  By Tuesday at noon no call from them so I had to call and ask what was going on.  I was informed by John my car had not been looked at yet it was in line with all the rest of the cars to be looked at!   I asked for the owners number.  I call Scott Lefkowitz the owner at his other location on Vanburen.  He promised to call me back and never did.  I got a call from John saying my engine mounts were broken. And that has nothing to do with the repairs we already did.   I told them not to do anything to my car.   I took my car to 2 separate mechanics both told me I had NO broken motor mounts.  That it was my torque converter.  Which was suppose to have been rebuilt and replaced when I had the initial work done.   The shop on Cave Creek is a scam shop.  Very rude poor service and they will lie to you just to get more $$ out of you.  Do not use this location !!!", "business_id": "u4JL5Vw4_XI-4Zu6ZKcfNw", "stars": 1, "date": "2015-10-29", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "vsXP832M0kOxKpfduD7dWw", "review_id": "TH45GK3xVkadJpiMJ38_JA", "text": "Taking my car to the shop is like going to the dentist. I can sometimes get a little stressed out about what's going to happen and how much it's going to hurt (cost) but it's a necessary evil. \n\nIt was a relief to find Central Car Care. This family owned car service and repair place at Dunlap and 3rd St. offers reasonable prices ($19.95 for an oil change), patience (when I'm asking my 80-billion \"how do you know you HAVE to do that\" questions or whine about how badly I do NOT want to spend my money on fixing my car) and fair, honest service (when my replacement battery didn't last a full year, they changed it out for free!). They've always completed my work on time and greet me by name when I walk in the door -- even when I don't have an appointment and it's been months since my last visit. \n\nThey guarantee all of their work (parts and labor) for 15 months, 15,000 miles, which gives me some peace of mind. And, host an annual customer appreciation event where they discount tires, oil changes and the like... \n\nIt's conveniently located by the Sunnyslope Transit Station, so public transportation makes for easy access (although, shuttle service is available and they have rental cars if it's an overnight deal). \n\nPaul, Tommy and Rex are awesome and do a great job taking care of me and my vehicle!", "business_id": "xJ9kdujal0bSGlZ9tsvrYw", "stars": 5, "date": "2008-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QDn0Td1yXw43eSTWv7T1Rw", "review_id": "bKy2QlL2m6YQqJn_nQZ2Sg", "text": "Great service! Checked and filled all tires from a warning indicator when on way to work early in am.", "business_id": "xJ9kdujal0bSGlZ9tsvrYw", "stars": 5, "date": "2011-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "HzfWEVSxEVx58Le48JvrpA", "review_id": "fDm6BuAZWXUGCq0P8L3bhg", "text": "Honest, trustworthy, professional.\n\nSeveral years ago I worked for a tour company that took all of their vans to Central Car Care to get serviced, so when I saw a groupon for an oil change here I decided to take advantage.  I came away with a good experience and a well running car.  \n\nA few months later I had my brakes changed at a Just Brakes who told me my brakes were going to fail and that I needed to do an extra $350 worth of repair to be safe.  I called Central Car Care, explained the situation, and told them I was nervous about the safety of my car but thought I was getting scammed.\n\nThey told me to bring my car down and they inspected it for free.  They told me my car was safe and didn't need the work that was suggested.  I offered to pay for their time, but they told me to just bring in my car when it needed repairs and my continued business would be thanks enough.\n\nI don't think I've ever been to a mechanic before that said I didn't need suggested work done.  Thank you so much.", "business_id": "xJ9kdujal0bSGlZ9tsvrYw", "stars": 5, "date": "2013-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nQRty5GZzxu_XrCh8U9vIw", "review_id": "3D74r9STdAepbx8ZMJu3mw", "text": "Went to central care care for a diagnostic. They gave me a long list of of over priced repairs, so I decided not to go on my weekend outing, for fear of my car breaking down. I took it to a trusted mechanic for a second opinion, that is closed on weekends, where I found out that the so called things that needed to be fixed were inaccurate. One item specifically, was my radiator hose, which the trusted mechanic showed me had a lot of give left it in, not the dry, almost cracking story I was told at Central Car Car. Do yourself a favor and save your money, wait for that M-F shop.", "business_id": "xJ9kdujal0bSGlZ9tsvrYw", "stars": 1, "date": "2014-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WVFigZ5GIJ83T38LV3sjdg", "review_id": "tp8Wf__01295Vz7XQQzT4g", "text": "This is my go to shop for whatever I need done on my vehicles,  Paul and his staff are courteous & knowledgeable. Repair prices are reasonable with quick turnarounds!", "business_id": "xJ9kdujal0bSGlZ9tsvrYw", "stars": 5, "date": "2014-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DYDCOM77BTeQo18Z5tYlag", "review_id": "gKwKfpxxr37yo-rv9TxINQ", "text": "I have been going to Central Car Care for years and have always been happy with the quality of service and the fair prices.  I have referred several of my friends to Paul and Rex and everyone has expressed the same feelings of fairness. Tim", "business_id": "xJ9kdujal0bSGlZ9tsvrYw", "stars": 5, "date": "2015-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rQevUI352rpU4c8lE9csoQ", "review_id": "IDr063OsaKDOXVJGDSH-kQ", "text": "I had a funny car noise on a Saturday, going on a road trip on Sunday. Central Car Care (Mike) diagnosed it quickly (power steering hose leak) and repaired it within a couple of hours, so I could make my trip with no worries. Cost was $500, but that's way cheaper than if I had gotten on the road and had the steering seize up, needed a tow and a major repair. Plus he identified a couple more issues to have my regular mechanic check out later.", "business_id": "xJ9kdujal0bSGlZ9tsvrYw", "stars": 5, "date": "2015-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Uuy-y2PRxWmfczCAcy44ug", "review_id": "UlOoHeNm-2QhGak_-vbj1g", "text": "What a great place!! I was having muffler and exhaust problems (my civic sounded like a chopper), so I took it to a large chain auto shop, they said they didn't wanna risk touching my car, since they don't specialize in mufflers. They recommended mighty muf'ler. After a day @ their shop I get a call saying my car is ready. I'm expecting to pay upwards of $500, but the man at the shop said he didn't want me to pay for what I don't need, and that he would just patch up what needed patching. $25 later, my car sounds like new!! great place, and very friendly!!", "business_id": "6FECmOLQSICW1ykyBbEHng", "stars": 5, "date": "2011-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xCY9C6KN9xTDzKrow9iivQ", "review_id": "bIN2sPTvZ17dSzrfkzx7pA", "text": "I was told to see Greg after a local shop diagnosed my exhaust problem.  He took a few minutes to look at my car, told me what I needed and what it would cost. I went back a week later, he did the work in the time he told me it would take and there was no surprises and my car is doing well. I would recommend this place over ANY muffler shop. Plus you support local business and not a chain.", "business_id": "6FECmOLQSICW1ykyBbEHng", "stars": 5, "date": "2012-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SHcX9hp5RG3-OqsbvissIQ", "review_id": "g5Hfyzw2_qV0Rty0ZVzQ8w", "text": "Got me in and out fast, inexpensive, and friendly.", "business_id": "6FECmOLQSICW1ykyBbEHng", "stars": 5, "date": "2012-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wTOsWfGoC3kaOpH0yT4fyw", "review_id": "-bBat_qEHekgtp7ywaUXGg", "text": "This is my third experience with Greg. He is nothing but honest and thorough in all he's done. Today he advised against an exhaust I wanted by flowmaster insisting I wouldn't be happy. Turns out he was right! Installed a powerful sounding magnaflow and a new tip on my Tacoma. Also done work on my friends 370z Nissan and a Civic I had a few years ago. Highly recommend his company. Fast, friendly, and knowledgeable. Thanks for your work today!", "business_id": "6FECmOLQSICW1ykyBbEHng", "stars": 5, "date": "2014-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fcY1Tztpwzc600IDWBkJeg", "review_id": "lx1RfWwWixzsaBhnR475OA", "text": "It's not often that you find honesty, integrity, and quality in the auto repair business, but Mighty Muffler folks are all of those things.  I called them to see what kind of mufflers they stocked for my 2004 Corvette.  The owner was honest and told me he didn't stock them and I could get them cheaper by ordering them myself on the Internet.  He said he would be glad to install them for me and he allowed me to have them shipped directly to his shop.  He stored them for me and installed them for the quoted price.  He modified some aftermarket parts on the car to assure a perfect fit at no extra cost and sent me happily on my way with a corvette that emits a deep throaty muscle car sound.  I recommend Mighty Muffler for anything from your Kia to your '34 Ford hot rod coupe.", "business_id": "6FECmOLQSICW1ykyBbEHng", "stars": 5, "date": "2014-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hSBc5f-Vr-i7LA2M6tIhbg", "review_id": "y2gNQRNPyr2u0uZIOzRoZg", "text": "Awesome! I was recommended to come here to get my muffler fixed and I am so glad I did. Spoke with Greg mostly (cool guy), but there were two other guys there that were super friendly as well. I would absolutely go back. Fair prices and fast service. Completely happy.", "business_id": "6FECmOLQSICW1ykyBbEHng", "stars": 5, "date": "2015-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "K5XGdbmELv80N_4YMDwCKg", "review_id": "9f3yUYW5QLk1MpePhvgQBg", "text": "Honest service, knowledgeable technicians, timely repairs.\n\nI recently had my truck in for repairs over at Elliott's for some transmission shifting and electrical related issues what I thought would be very pricey. The opportunity was definitely there for them to charge a really high price and make a good profit. Instead after diagnosing the issue what I thought could be over a 2k repair ended up being a fraction of that mental guesstimate, and within one day I had answers and an idea of when I could expect my truck back.  To John & the team at Elliott's thank you, you sold me only what was needed and fixed my trucks problems.", "business_id": "shGQ1-I_eVcid-jrQIhbfA", "stars": 5, "date": "2014-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q9Bz4UerffpuK1aoRNF1Pw", "review_id": "Df9Rf2q5gqJyPbZrNi0u3A", "text": "Horrible horrible customer service and work. We went there a year ago and it was great but the same problem they supposedly fixed happened again! So we took it again five days ago no one has called us or anything I called today and sounds to me as they haven't done anything so frustrated never going back there.", "business_id": "shGQ1-I_eVcid-jrQIhbfA", "stars": 1, "date": "2015-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q9Bz4UerffpuK1aoRNF1Pw", "review_id": "3w1lbT1_voh15l2xqbhwpg", "text": "Horrible horrible customer service and work. We went there a year ago and it was great but the same problem they supposedly fixed happened again! So we took it again about a week ago no one has called us or anything I called today and sounds to me as they haven't done anything so frustrated never going back there. We were charged 100 dollars to look at it after they found out it wasn't the same problem but never told us or asked us if we wanted them to proceed and how we would be charged for them to diagnose the problem and they just went ahead. They would never call us to update us or anything and we would have to call them everyday . They had my car for a week and that's how long it took them to diagnose what was going on. Don't go there! When it all was said and done they wanted to charge us 1,300 plus the 100 for diagnose...no thanks", "business_id": "shGQ1-I_eVcid-jrQIhbfA", "stars": 1, "date": "2015-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fStqgvCXPJD4Z0_bhPdkVw", "review_id": "PPslkHvuL2Jb8uXk7lHLIw", "text": "I have been going here for about 3 years now on a referral from a friend.  I finally decided that I should at the very least repay George for his honest and good work on my car by writing a good review for him here. \nEverytime I have had to bring my car in, it has been a great experience. \nHe charges fair prices for high quality work.  But the most important thing about this shop is the honesty.  Something that is severely lacking in most of the auto repair community.  Instead of adding on items that \"need\" to be repaired to up my bill, he will tell me when I don't need something.  That is worth its weight in gold. Most recently, I brought my car in because it was having problems starting. Sun Devil Auto said I had a bad starter and needed a new serpentine belt along with it. A $500.00 repair. George told me the truth. It was a dying battery and my serpentine belt still had several months left on it. I left happily in less than an hour and only spent about $100.00.  Easily the best mechanic I have ever had. As long as George continues to run Rob's Quality Automotive I will go there.", "business_id": "f5Zo7ERPbqcj9soe1DimpQ", "stars": 5, "date": "2011-09-30", "type": "review"}
