{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "bXb6NeEXi6cu6bPvqWN73A", "review_id": "CizL6ZyZm2YnGevRD4vIfw", "text": "My boyfriend and I are practically Hibachi connoisseurs so when we visited Pittsburgh for the weekend the first thing we Yelp searched was.. you guessed it, Hibachi! Sapporo was highly rated so we went for dinner on a Saturday night.\n\nThe restaurant is located in front of a dimly lit motel but don't be discouraged by the facade because once you step inside the door the atmosphere is warm and inviting. \n\nWe were greeted by the owner's daughter who sat us at an empty table while we waited for the other guests to join us. The owner's son brought us menus to look over and informed us that Sapporo is a family-run establishment. The table quickly filled with regulars who said that Sapporo was their favorite Hibachi restaurant in Pittsburgh, one couple even said that they come for dinner every single Saturday evening. The owner himself came over to our table and began cooking our meal!\n\nI ordered the Hibachi chicken and broccoli in Sapporo special sauce and my boyfriend ordered the Hibachi shrimp and chicken, both with fried rice. Both meals were good but the special sauce on my chicken was absolutely delicious! Definitely one of the best Hibachi chicken variation that I have tasted and my boyfriend really enjoyed how flavorful his shrimp tasted. The chef, a Korean war veteran, was engaging in our conversation and made you feel as if you were over a friend's house for dinner.\n\nWe both agreed that we will definitely return to Sapporo the next time that we are in Pittsburgh.", "business_id": "8Nm_jcCYtMXYW0ODSHDiXA", "stars": 5, "date": "2015-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "go2dZIDfrEBqfsGKnA4m7g", "review_id": "t8PMF9xeHcxOqw-wB0rkzA", "text": "Excellent sushi place for Pittsburgh - best I've found yet.  (Please don't expect West Coast sushi - I did qualify my statement by saying \"for Pittsburgh\".  I usually have to do this for Pittsburgh restaurants.)  Sushi was a little loosely prepared, but the fish seemed very fresh, and the presentation was nice.  \n\nThe service was excellent, too.  Our waitress was very friendly, fast, and helpful.", "business_id": "mPlWLIA4pkHMRtlQDm6UyQ", "stars": 5, "date": "2010-10-18", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "TckShYnQa0eD3WQxdoE3GQ", "review_id": "0B5n_sckE1WP1P9UFfEocA", "text": "Do not go here if you are on a budget and/or really hungry.  However, if you have an expense account or are a guest of someone with an expense account (as I was last night) than this is a good option.  In fact, this is the best sushi I've had in Pittsburgh.  Umi is a part of the admirable big  burrito group.  It's located above Soba.  It's up two long sets of stairs, so if you are bringing someone handicapable or elderly they'll have trouble navigating the double staircases.  As I was walking up the stairs last night I noticed the painted large waves on the walls.  I believe Umi is japanese for big wave (maybe?).  Our reservation was for 6:30 and initially they only had the tatami tables where you sit on the ground and your feet dangle in a hole in the floor.  These tables are probably okay for date night, but would have been weird with two business associates.  Luckily, a table opened up.  If it's this busy on a Tuesday I suggest a reservations.  Anyways, the rest of the space is very nice with a sushi bar with about 5 seats as soon as you enter and very warm colors with a few scuptures and a waterfall in the middle of the dining room.  The service was pretty good.  There was nothing particularly memorable.  I started with a Mark West Chardonnay, which was okay and priced under $10.  They also have a good selection of warm and cold sake'.  I started with the white tuna sashimi which was a few slices of super fresh melt in your mouth tuna with a nice soy sauce and just the right amount of wasabi.  Matt tried the shrimp tempura which was perfectly breaded quickly fried light shrimp with veggies.  This was a good deal at $12.  Keith had the lobster soup which had a few big chunks of lobster and a nice broth.  I ordered the toro tartar with caviar, which was probably a teaspoon of super creamy fatty tuna and a touch of caviar.  This was really rich and one of the most expensive teaspoon serving I've ever had at $21 for such a small amount.  Keith had some noodle dish which he said was good and actually was pretty reasonable, but again it's noodles.  Matt ordered the strip steak tataki, which was about 1 1/2 ounces of prime steak served with a sweet soy sauce.  It was delicious, but again $20 for less than a 2 oz. serving.  I stuck with sashimi.  The lobster sashimi was great and had some type of flavored sauce instead of just soy.  The salmon and tuna were also amazing.  They were cut perfectly and tasted like they were just pulled from the sea.  Overall a really good sashimi \"dinner\", however I have to admit I did stop for pizza a few hours later.", "business_id": "Cy9XgM3ZG2jZ1ganvolb6Q", "stars": 3, "date": "2008-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NN00JfJo7XK5hKqcPRU_eg", "review_id": "kEbcNRpbcBGgPO-axelSjA", "text": "Easily the best sushi I have had in Pittsburgh.  The sushi is incredibly fresh, flown in daily from New York City, and the inverted tables make it a fun place to eat.  The staff was incredibly friendly and understanding when I wasn't sure what to do with the warm napkin upon sitting down.  Although it is pricey, if you are looking for a special night out I would highly recommend Umi.", "business_id": "Cy9XgM3ZG2jZ1ganvolb6Q", "stars": 5, "date": "2015-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HmkA3lo9what2r1YuGwn_Q", "review_id": "wXmm_pJ065Jty9wEJfHhkw", "text": "Musashi was an overall great experience. The restaurant is quaint,warm, and cozy. I was originally looking for a more generic Japanese meal like teriyaki chicken with broccoli, fried rice and shrimp sauce. The food they serve was not what I expected but was still delicious. It seemed like more authentic Japanese and was very fresh and tasted amazing. The chicken teriyaki was served with soup,salad, rice and noodles. The most outstanding part was the service. They went over and above to make sure we were taken care of! I highly recommend it!", "business_id": "Y_OeiGhTm6ZEfZ1UQgM_wA", "stars": 5, "date": "2011-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SgfuZWzXWFWooO3tZ8NogQ", "review_id": "oHI_DCGP8KGQ5p_nySC7BA", "text": "Let's start with the good things about this place.  The theatrics by the cooking staff is great.  They talk to each other, crack jokes, and have a great time doing what they do.  It would be a great place to take your kids.  There were a lot of young well behaved children there enjoying themselves when I went there for dinner.  There is also a little Koi pond with a bridge that you walk over when you head to the Hibachi grills.  \n\nThe quality of the food at Kabuto is about average.  One thing that was a little disappointing, was the portions.  Even though I was the only one at the table to finish their meal, I feel that at similar restaurants I have gotten larger portions.  \nLunch time is a lot lighter as well, but for about $9 you get a protein and two sides.  They say that they will get you in and out in 30 minutes for lunch.  Sometimes this will happen and sometimes it will not.  \n\nAnother thing I should mention is that I got a 22oz Kirin that was past it's \"enjoy by\" date.  Not far enough where I wanted to fuss but I would probably will stick to more common beers there (you would think that would be common).", "business_id": "P0aKJw8rb0DKLaGottHEAw", "stars": 3, "date": "2012-11-15", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "whKpnugMnWTz3UjlrN71yg", "review_id": "8q8JziwhtPAH1q0xmcuBBw", "text": "Should have put the elastic band in the jeans before coming to Nakato...good lord! Located only 15 minutes from Uptown in the University area. Wife had a hibachi craving, and fellas, we all know how that goes...best to say, yes dear and ask where, and the \"when\" is immediately. Not going to lie, I'm glad it was hibachi and not ice cream :). \n\nYou walk into Nakato and are greeted immediately. We made a reservation so we checked in and got a buzzer. Only strange thing was the 2 story lounge/bar area and the TV's in odd locations. No worries, just grabbed a spot on a couch while we waited. Only 2-3 minutes. Upon being sat, our waitress came by right away and she was very nice. I can tell they take their service commitment to heart. The menu is extensive with hibachi offerings. They also have sushi, so if you want that make sure to ask for that menu too. \n\nWent with the \"Nakato Delight\" which came with shrimp, chicken & NY steak for $23.95. Most of the entrees (combo) are around $20. For extra items or premium like filet or lobster expect and extra $5 or so. Also went with the fried rice which was $1.75...kind of annoying, but no big deal, as I like egg in my rice. Came with onion soup, salad w/ginger, shrimp app (small), noodles & veggies (surprised variety!), rice and of course the meat. I was doing fine on my \"timing\" until the the noodles & veggies came. Soup and salad...gone, no problem. Then a FULL plate of noodles/veggies...as I'm eating, I see the rice start an say oh \"SH&T\" and start to eat faster while my wife watches and is content letting her plate rise with goodness and not concerned about \"timing\". Little did I see/know as I finished shoveling the noodles/veggies that the rice had their own separate bowl and did not need a place on my plate...ha...oh well, there was room if needed now! \n\nOverall a great experience and for $20-$25/person average, so much food...can you say leftovers! As we got up to left I said to the table \"nice shoveling with all of you\". Not far from the truth...ha! So good!", "business_id": "1PSnPPFVfp03iPfJRPWWQw", "stars": 4, "date": "2010-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E6uRiADAuiL8vkylnOMwyg", "review_id": "h_zeoBQvYyychByaCfaYfg", "text": "When we walked in was a bit concerned looked huge and empty... Guess it gets busy end of week. We ate a sushi bar.  They did not have all items available but the sushi was good and reasonably priced. Service ok.", "business_id": "1PSnPPFVfp03iPfJRPWWQw", "stars": 3, "date": "2015-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5UjQ_ag5lXasxIEjMVzbLA", "review_id": "qOeWloKwwxzfi9CNB-PYDw", "text": "Great sushi and teppanyaki.  The service is friendly and warming.  I'm a bit of a sushi snob and I have to say this is the best place in town.  I've tried Kofusion, Sushi Kame, and Yellowfin.  The fish at Kamakura is always the freshest and I enjoy the flavor of the rice as well.  As you know, sush is all about the rice and Kamakura has the best.  \n\nThe teppan is great as well.  Each chef has a unique personality and cooking style.  It makes going more often enjoyable and different everytime.  Even if you have to wait a little for a table, it's one of the best dining experience in Champaign.\n\nThis is the only Japanese restaurant owned by a Japanese family.  I've talked to the owner a few times at the sushi bar, great people.  I would suggest this place to anyone.", "business_id": "K5PfWwW61Ajommy9xvXdAw", "stars": 5, "date": "2011-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_PzSNcfrCjeBxSLXRoMmgQ", "review_id": "oStOvJEbC48XP3mJauN2Zg", "text": "My friend has been talking about this place for years to me.  She found got me to go there with her for lunch.  WOW, I am a fan now!\n\nThe food was good, fast, and great prices.  I only had the veggie egg rolls, gyozas, and the white meat chicken terriyaki.  I NEED to go back to try more things....", "business_id": "kaIue7GRCmkPzDeHDBTttQ", "stars": 4, "date": "2009-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kQQ6aIHuK4ZzXqDcnhs_7w", "review_id": "Sying7VmX5FH16osA9NO8w", "text": "This place is amazing! The food is great but when grandma blue fin comes by to refill you're drink or even your entree, you'll understand  why we all love it!", "business_id": "kaIue7GRCmkPzDeHDBTttQ", "stars": 5, "date": "2013-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "45XAn-XZEhILx1kZIr9Rhg", "review_id": "Qz19PyP7DOcLv1k0UUkFBg", "text": "Just recently started eating sushi and while in Phoenix on a business trip stopped in and talked with Seth. He will make you anything you want so long as he can and for a new sushi person like myself this was big.  I will be coming here every time I'm in Phoenix", "business_id": "oSKT5oZX1NWYaHwOWL5lag", "stars": 4, "date": "2015-11-06", "type": "review"}
{"votes": {"funny": 5, "useful": 9, "cool": 7}, "user_id": "N-D-d1Z4UybdlkK1HxlNPA", "review_id": "b2Tc3HtrQxWvD53dZ_FXWA", "text": "This was our first time at CherryBlossom. Hubby has needed to eat more vegetarian lately, so I've been on the lookout for new places with more options. \n\nThe food was mostly great. Hubby enjoyed his tofu yakisoba, I liked my chicken katsu (although a couple of pieces were not quite done), loved my salad, liked the bread basket, and we both really enjoyed the crispy California roll. Dessert was also pretty good- we liked my flan better than his green tea mousse (which was not very sweet except for the almond flavored cream on top). \n\nService was attentive in the beginning and then our waiter disappeared. I witnessed two other tables in our section grow confused and then annoyed as we waited... and waited... and waited for the waiter to return. One couple was even in mid-payment and finally went to the take out counter to inquire what was happening. I asked the busser to let the waited know we wanted our check. This disappearing act really took the shine off of an otherwise nice dinner. We'll likely return, however, to give CherryBlossom another chance.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 3, "date": "2008-10-10", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "LoCIUMo8m1bbt33_0Yqy_Q", "review_id": "KXryVjsXf2ZqhPzp4-91hA", "text": "My friend told me about this place a while back and raved about the ramen, and I thought, \"wow, I guess this place must be worth trying!\" Well, my husband and I went there for dinner last week and we were not disappointed!\n\nI loved the ambiance. I loved that the meal doesn't start out with any old bread basket, but one with a delicious roll, yummy cinnamon-sugar toast, and excellent banana bread! Definitely a shocker, coming to a noodle place, but a pleasant surprise :)\n\nThe menu is broad and eclectic, ranging from Italian linguine to curry noodles, from ramen to sushi, and an impressive and surprising selection of rice dishes.\n\nI had asian wheat noodles with chicken (I don't remember the name of the dish), and it was very tasty! While we were there, we heard another customer telling his friend that he's tried many things on the menu, and everything has been delicious. I believe it. They say a large part of taste comes from our sense of smell, and this place was just brimming with incredible aromas! I can't wait to go back and try more yummy dishes!", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2009-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "qRo9gHN5OiV1-peDuhCh-g", "review_id": "FC34Rwkjl9GYaCNvIYU1RA", "text": "Ordered out here today and was very pleased with the food. I got the Iron Pot (Nabeykai Udon) and it was tasty although I would have liked more vegetables. It had TONS of seafood. \n\nThe pot stickers were yummy. Perfect flavor and perfectly cooked. \n\nHow'd I not know about this place?! I can't wait to try it again!", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 4, "date": "2011-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hSEv6hOHIJt2kaFHr2vsPw", "review_id": "Eb4ajn0AuvYvdioT05ETSQ", "text": "What a cool and unique place! The food is fantastic. The chicken katsu was amazing !!", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 4, "date": "2012-10-03", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 3}, "user_id": "uqK3yvpg5Evk_XgzMW-lAw", "review_id": "DFzo_cMKl48B3cnCa99aLg", "text": "We sat at the back corner and noticed we were surrounded with all Asians.\nHmm... is it because we're Asian, they had to put us in the back with rest of them?  I don't really care. \n\nI think our waiter was mad at the table next to us. He wasn't too attentive and sort of rude when we first placed our orders.  His personally changed after that table left.  I'm so glad they left.  They were so loud. \n\nI'm not sure if they have a new owner, or just simply being cheap & cutting on the potion size.  We had ordered the tofu shiitake mushrooms and got just three pieces.  What!  I have ordered this many times definitely more than three tofu's.  At the least the ramen still good.  The size is the same.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 3, "date": "2013-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GtkB-38oc18qdCDAgtTjdw", "review_id": "qVjFPYswND1y0L_ri5ihWw", "text": "Decent ambience with decent service. Nothing too special. I ordered the spicy olive oil pasta with calamari and my dad ordered the pork katsu with curry. The spicy olive oil pasta was bland... had no flavor whatsoever. Literally felt like I was eating a bowl of carbs..\n The pork katsu with curry was better. The curry was a tad bit sour for my liking but the pork was pretty good! My dad kept complimenting the rice, so I'll take his word for it. Overall I don't think I would come back due to the long drive but I wouldn't tell anyone not to check it out!", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 3, "date": "2014-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1_Qd3EgfoslVG06OYRB0ow", "review_id": "ElG1ctm7nfKJ5vDadYaaxg", "text": "Excellent food! Sushi is perfection, the different selections in noodles is spectacular! Not to mention the staff are super friendly! I come in at least once a month if not more. Make it a must eat place in central Phoenix!", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2015-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6uVt_7u9wV8-cp7QIBBz2Q", "review_id": "E6yyJklLrdnq7i5nklN4eg", "text": "I LOVE THE RAMEN!  I have yet to had better ramen anywhere else. Service is hit or miss.. But food is so good makes up for it every time.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 4, "date": "2015-10-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "btfv0CFoDX6vJCPms6-Irg", "review_id": "0gQ-2og3kXFyix9lWeWDfw", "text": "Nothing too special about Moto Sushi outside of their sushi desert which consists of ice cream, nutella, and brownie rolled into a layer of rice krispies and sliced \"like sushi.\"  That might be the only thing sushi about it...because it's \"sliced like sushi.\"  If I sliced a crawfish into sushi roll shapes, would I be able to market it sliced \"like sushi\"?  It was a fun end of the meal treat.\n\nOutside of that unique desert experience, their sushi was just so so.  The waitress had a \"secret menu\" that she did not even inform us until we had got our order.  My co worker then proceeded to order another roll after we found out about this secret menu.  I'm not sure what is the point of the secret menu if they don't show it to you until you after you receive your food.  What's the point?", "business_id": "c0RSs2KYK5Y-ZlSrNq9LyA", "stars": 3, "date": "2008-11-24", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "rjlb-7-JcmM6fR64ZpyTug", "review_id": "2m0u8H9Cy85v0trM_lnA-g", "text": "Look all you sushi snobs who like to pull rank, I too have been to Japan. Whoa. Crazy, I know. Moto sushi is good. Moto sushi is not great. The best time to enjoy it is at happy hour or during \"all you can eat.\" \n\nThe thing is, the underground menu is too expensive. I'm not a cheap person, ask my friends ... sadly, I am more likely to over-pay for things and I have no patience for sales. Given that I am a chump, who spends too much money, me saying their creative sushi rolls are too expensive says a lot. If I want to pay $13 for a roll, I am going somewhere else. Otherwise, the basics are value priced and pretty darn good. Good that is, not great.", "business_id": "c0RSs2KYK5Y-ZlSrNq9LyA", "stars": 3, "date": "2012-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VBX26pSjUQMTt3pnaUjgrQ", "review_id": "Pl830isHt8dqTN5jKVFBmQ", "text": "Why do I come here? Every time I do I promise myself it will be the last time. Went in got lunch today around 12:40. There were 6 tables including ours. It took over 5 minutes to get water on the table. We ordered a gyoza, a tootsie roll and a spicy tuna roll. It took an additional 30 mins for that to come out. Our waiter was rude and short with us, hardly came to the table at all. I didn't try the spicy tuna because I'm 9.5 months pregnant but my sister couldn't even choke it down because the fish tasted bad. We had to scarf our food down because my sister had to return to work. We didn't  anticipate it taking 40 minutes for two sushi rolls and some fried dumplings. It would have been one thing if it was busy, but it wasn't. And every time I come here the service gets worse. Seriously moto, this is the last time!", "business_id": "c0RSs2KYK5Y-ZlSrNq9LyA", "stars": 1, "date": "2014-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "K5owfRSgd1e7ds7-Oj3GVg", "review_id": "hKTA0qW9s5S2SyBu1onaNA", "text": "Really good sushi and pretty good variety of other entree choices. It's our favorite sushi place in Phoenix, in spite of loud environment and impersonal (but efficient) service.", "business_id": "NDKkce5Au-o_OhIt5f2ZBg", "stars": 4, "date": "2007-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6pPpvjd14UtmUQwAWQlzXg", "review_id": "KNaZzWGgSl8F7Nzjd_FwQA", "text": "Always a fav for fast food!! I been going to various locations and this isn't anything more but easy fast and yummy!", "business_id": "QplY4p8HHJY0ncbgcpb8WQ", "stars": 5, "date": "2014-09-17", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "wNRk30HOJvdD_vU0z0RFUQ", "review_id": "UH3egaatWpYnNrDrRQwPCw", "text": "Hands down best sushi bar in the valley. The service is always amazing plus its a great spot for happy hour too!", "business_id": "r7Ge8_c5Y2TXthb4CSjzaA", "stars": 5, "date": "2012-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "bDomx2QRbZGw3ybT03AG1g", "review_id": "EAZQ86OEjddSQVuU0Wexog", "text": "Friendly service and fresh fish. This is the only place where they have more than just one hot sauce - Sriracha, fire sauce, and jabanero sauce. The last two were really good. $7 for 5 piece sashimi. Tuna and yellowtail was good.  $9 Softshell crab roll was decent, but then again it's never that spectacular anywhere. Interestingly, I saw Larry Fitzgerald in parking lot. Now my outing to Phoenix is complete.", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 4, "date": "2009-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KcnrpEOCMXEfI7-VK-H5AA", "review_id": "vCX7gzHymoKsR34lpmMRyQ", "text": "My wife and I stopped in for some delicious sushi before attending an event in Phoenix.  The sushi was delicious. My wife, who typically doesn't like tuna LOVED our spicy tuna role.  Everything was so fresh. The service was outstanding and fast!  Great experience!", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 5, "date": "2011-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "v6Z4gM_52ZAyz-3e_MS3Bg", "review_id": "sJ68T6tyCBmQuRxqBqC9NQ", "text": "Great sushi and near the apartment so very convenient.  Love the atmosphere and the service was well.  Got to do it again and try the Hibachi next time. Oh yeah!", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 4, "date": "2014-10-13", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "DB7QchPV2SQ0ZsrztDNouA", "review_id": "TmFiV985qOO2uyDU8IFtZw", "text": "If I could give this a negative review, I would! I am so disappointed! We had worms on our table. I thought maybe it have fell off our bowl or while he was cooking in front of us. Two worms on our table! The manager apologized for it but this was just gross. Where there are two worms there are more. People lined up for this place and its filthy like this?! Never going back. Will write an in depth review on my blog.", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 1, "date": "2015-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kuA-srBtV0MDN6ySvUlGGQ", "review_id": "l1ps48bcUYMEmNJpWRFwRA", "text": "Staff always friendly.  Food is good and will always be a customer.  Happy hours are excellent.", "business_id": "nBfusVbqwul0BU0Rcrlelw", "stars": 4, "date": "2013-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Snr-iImWYYD_a_7Iar3E0w", "review_id": "VzsuoLNEGlRtAOrYQzLEWA", "text": "We got there at a very busy time but there was no excuse for getting two of our plates to us real fast and or other place which we ask for twice and were told it was getting prepared was never given to us. We decided we didn't want it because it was a half an hour later and decided to leave. When we got our bill they had charged us twice for something we never even got. Good thing we always check our tab. They took the $23 off of the bill and as we were getting ready to go a waiter came up and gave us our food and we declined it. The manager came and gave us a free appetizer card and told us they compensated us on our check but in reality they just took off the food that we never received.", "business_id": "nBfusVbqwul0BU0Rcrlelw", "stars": 2, "date": "2015-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xVPhxMatM0AOFcWvYDiGFA", "review_id": "9ywFh9uxHDaeBl0lh4Kk9g", "text": "The food is good we go here specifically for crab legs, frog legs and prime rib ,dinner around 16$ its worth it.", "business_id": "-Ogv7rpcgUHkFaSy3vD8Sw", "stars": 3, "date": "2014-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OL8a7vkzQd0x22n7Zyp-GQ", "review_id": "Y7LN1vzuCfdaV9Z-K8FaBw", "text": "This place is awesome! Great food and perfect atmosphere. Very relaxing ! It would make it much better if they had decent hot mustard and sweet and sour verse the poor quality generic kind that comes in a package.  I would recommend the dine in experience", "business_id": "wc0a0XLhcMkoEQx1TbuhpQ", "stars": 4, "date": "2015-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NrwQRsZZLtTeLoMo_5rEbA", "review_id": "geVX6J0J8vbFSu58ritAiQ", "text": "Amazing, truly a hidden gem! Best Japanese we've had since moving to Mesa 5 years ago. Definitely on par with small family-owned Japanese places in Hawaii where we're from. Gave us a little taste of home. Minimalist service (pay at the counter etc, like some of the places back in Hawaii), however no minimalism when it comes to the quality and quantity of the food! Great tempura dinner. Highly recommended, lots of character and great flavors. We will be back soon!", "business_id": "BBPkwpj9kSeDuy0uOwWHJA", "stars": 5, "date": "2013-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "CvHRfVLfmdyUlTfBBnxrjw", "review_id": "QjtQ3zYvdCcklIy9umLMaA", "text": "Been going here for years about once a year. The food tastes sooo good. However, we all get sick after eating here every time. They have almost doubled their prices too. It used to be $11 for chicken entree but today they charge $18! Come on, how about you clean up your bathrooms if you are going to charge that much. The toilet in the women's restroom has no back lid, a screw has been the flush handle for at least 8 years and it is dark and dirty. There are Curtains you walk through to go to the bathrooms and they are covered in what looks to be sauce and food. That's been that way for years too. I used to eat there anyway because of the prices and it tastes good. But I will never go there as long as they charge as much as they do now.", "business_id": "42xKe5YcCIKmGiqW0i4aGw", "stars": 2, "date": "2013-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uiNGB7qxbZbLqBVK693mwQ", "review_id": "P0lY_gnkWRmDap7lHsvcRw", "text": "The food here is always fresh and tasty.  Highly recommended. Great service and quick to get the food out.", "business_id": "Js7xxK2D4Dc0W8XkAzc4cg", "stars": 5, "date": "2015-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XCn7yowfX92_5UHXETMZfg", "review_id": "EU1tm70l6SDfDkGgPefSDQ", "text": "Amazing sushi, great atmosphere. Friendly staff. John at the sushi bar will take special requests including \"how spicy do you want your spicy yellow tail\". A refreshing break from the canned chain sushi experience.", "business_id": "6syMU43FKGkcbX2957Ga8A", "stars": 5, "date": "2014-11-01", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "fu3Y_E-v_EalSsAbTdrghg", "review_id": "_ZlfTqUt6KHAshK2UJ87Ng", "text": "I've only been here once and it was for my friend's birthday party on the weekend. LOTS of people were here. The waitresses were so very nice! It did take awhile for our food to come out, but I'm assuming thats because we ordered 45405348347598454 rolls... Between the sake bombers and overdosing on eel rolls, I can't really remember if the service was exceptional.. all I can say is that I didn't get sick so that has to say a lot :D", "business_id": "5vgmIwBB48fwo_WC8vGiXA", "stars": 4, "date": "2011-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ELIac8K599qfb7E0VMmwGg", "review_id": "kDqsqrwAJbIZZ-F7cJxuUg", "text": "Good food and good drinks. Ninja has a great selection of sake and Asian beers. They also have a phenomenal selection of traditional and modern sushi...the Teppan food is great as well, I recommend the filet", "business_id": "5vgmIwBB48fwo_WC8vGiXA", "stars": 5, "date": "2015-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8e3Lo5U0i-ckBXLMntsy6w", "review_id": "DiBiCJSx988v0N3S1jvdGg", "text": "Let me start with the good.  Their fish seemed fresh, and they have some interesting, well conceived rolls.  Their Scallop Nigiri was fantastic, fresh, and delicious.\n\nOutside of the scallops, their food was 'Meh'.  Had Yakisoba, and several rolls; did not try any of their sashimi, because it seemed really expensive (4 pc. Sake Sashimi for $9).  We quickly realized why the rolls were cheaper: because there isn't much fish in them.  The fish on the rainbow roll we got  was sliced so thin, it was hard to tell how quality the fish was.  The rice to fish ratio was ridiculous, leaving with me mostly full, but unsatisfied.\n\nWe were warned before ordering that they were pretty busy, and we should put our sushi order in quickly.  While I appreciate the warning, I don't think AN HOUR AND A HALF is an acceptable waiting time with or without warning.  The Yakisoba we ordered came out promptly, but after finishing it, we waited another full hour for the sushi.\n\nOverall I feel they are overpriced for what you get, and the food is not exactly worth the wait.  Not bad by any means, but not worth dealing with the price/service.", "business_id": "un3KC2gyMrSG6yqjVRctXg", "stars": 2, "date": "2011-11-03", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "p8zh_-zQYwxbODaVxjRWEA", "review_id": "Ig-en9r9Jt3y2C9OAiD6Jg", "text": "We went during happy hour.  Got the crazy, las vegas, spicy yellowtail, california roll, assorted tempura and tempera ice cream for dessert all for $40.  All the rolls were delish, but relatively small compared to other sushi places.  Tempura was more on the greasy side, but had a good variety (shrimp, carrots, green chili, onion, green bean and eggplant).  Tempura ice cream was great.  They give you 1 green tea and 1 vanilla covered with a lightly pound cake and tempura batter.  Only reason why I gave it a 4 star is the size of the rolls, other than that great tasting sushi!", "business_id": "un3KC2gyMrSG6yqjVRctXg", "stars": 4, "date": "2013-11-29", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "FLdun6KWwAh-gC8VHVZGCw", "review_id": "BRMhFvrO8XE5-9vrItxL0w", "text": "Awesomely delicious rice bowl place.  The teriyaki chicken rice bowl, ordered light on the sauce, is particularly good, as is the orange chicken rice bowl.\nI accidentally left my keys here once.  The proprietor was kind enough to hold them for me until I later realized and returned to retrieve them.", "business_id": "l1kqHWtICTNk8TdCNisf5A", "stars": 5, "date": "2006-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UuVmfLKWNf2ANY-a1jlKsA", "review_id": "85Zc_Mp_UhGSGT099J513A", "text": "I came in last minute on a Friday night, literally 5 minutes before closing and they had no problem taking my order which is always a good sign of customer service. I ordered a teriyaki chicken with extra sauce and a large chicken yakisoba for my husband. Both were delicious! Be aware, the yakisoba comes with rice underneath, we will ask for all noodles next time. The meat was very tender. You also have to option of brown rice which I thought was nice. I would recommend this little place to anyone who's in the mood for something quick and delicious.", "business_id": "l1kqHWtICTNk8TdCNisf5A", "stars": 5, "date": "2014-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zEiTVy41B5c4QEiEZck_bg", "review_id": "tBvqOJrZchmG3IZepPjYsQ", "text": "Having some sushi at Temari in Gilbert.  Sake is the owner, has a binder with new creations he thinks of on a daily basis.  I would highly recommend this place for great Sushi!!!!", "business_id": "Er20nsiOS6TFHmAE717iTA", "stars": 4, "date": "2012-10-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "V_NaUUcLx7e-hFRyGOsOBA", "review_id": "9txn8OCk6AyJqhqiwlVCDg", "text": "Was not impressed. The seaweed salad was drowned in sesame oil and every roll was entirely overwhelmed by sauce (there was a quarter cup of garlic sauce left on the plate when we finished the Primo roll, no hint of exaggeration.) And for a place that charges for forks, you'd think they'd pack the rolls a little tighter so they don't utterly disintegrate. It was heavy, heavy fare and we left feeling overfull and gross even though we ate about half as much as we usually do on sushi night (and both had gas pains for a couple of hours afterward).\n\nThe free strawberry ice cream was not delicious and the fortune cookie was downright weird.", "business_id": "Er20nsiOS6TFHmAE717iTA", "stars": 2, "date": "2014-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "516iSAFAOIMkh6mRWE462Q", "review_id": "qpzO67-dymB0SZw_kLUleA", "text": "While on vacation in Scottsdale, we were looking for a fun little sushi place and turned to YELP as we usually do.  Sakana had great reviews so we went.  We had a great time!  The sushi was really good, the staff was fun and friendly and so were the people sitting at the sushi bar.", "business_id": "Bjt3rB73dvSDe1XEPEWc6w", "stars": 5, "date": "2010-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "jU5Q0THWMPv4R24VmAXRVg", "review_id": "AStviIwx8D_XT6HzgdZABQ", "text": "I can say that my wife and I are regulars here.  We are not the kind of people that walk in and are like hi Norm, but we do eat here about once a week to every other week.  The food is always good, and the staff is always friendly and good at what they do.  The few times that we have had issues they have always been taken care of.  The portions are generous and I feel it is the best bang for the buck when it comes to sushi in Scottsdale.  I do eat at a few other sushi places in town, but this is my fave.", "business_id": "Bjt3rB73dvSDe1XEPEWc6w", "stars": 5, "date": "2013-10-04", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "7BABHHlT6eGtgngrCaMxsw", "review_id": "Fh9h8YUnlg6pt4IXXQchsg", "text": "Calamari - 1/10: rubber covered in grease explosion\nWakame salad - 2/10: overly saucy\nAsari soup - 3/10: over cooked clams in bland miso soup...couldn't even taste the miso flavor.\nSAHARA RAINBOW ROLL - 7/10\nEDAMAME - 8/10. Nothing special but good", "business_id": "Bjt3rB73dvSDe1XEPEWc6w", "stars": 1, "date": "2015-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0sUYQ_xiPLFwgeIbWtX1RQ", "review_id": "qgbty8dm-JxoLScHsE6cLg", "text": "My Husband and I visited this establishment Monday evening - arrived @ 8:30pm for Sushi.  The Sushi bar area seating was already closed for the evening so we were directed to the bar.  We were the ONLY people at the bar so you would think we'd get a lot of attention but it was quite the opposite.  We placed a small order with intentions of ordering more-had the bartender leave a menu.  We had to ask for water and once our food was delivered we didn't see or hear from the bartender until the plates were empty.  I looked around for the menu he left only to find that he had taken it away which gave me the feeling he didn't want us to order anything else. He never asked how our food was - really didn't care about anything but closing down to place to get out of there.  We asked him why he didn't care and he didn't have an answer.  We left and mentioned our unhappy experience to the hostess (2) and they said they would report it to the manager.  I am sure they didn't and I wont be back.  Pitiful.", "business_id": "ishjLG3Sc94ZOelXZZhaIw", "stars": 1, "date": "2014-09-05", "type": "review"}
