{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XPUUaAS8hY4ln19pYs3cqg", "review_id": "-GKqbChvn1VhxqF0Xl5HkA", "text": "I scheduled an 11 am appointment waited until 11:45 to be seen. That's okay with me I don't mind waiting because things happen. The part that was an abomination was the doctor then proceeded to rush through the exam in literally 5 minutes!!! I paid for a full eye exam, he took one glance at my eyes and said, They look good on top. I have been to other optometrists and they were much more thorough. I will certainly not be returning and recommend you find the optometrist on Butler Street, that's where I'll go next time. I hope this helped you make the right decision.", "business_id": "U071C9Sl-ICavtE0hUMpcw", "stars": 1, "date": "2015-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tL-aIPbXdZNGp9a1d4VMhA", "review_id": "H-TXQQaVg-g5Tmd-sUTNjw", "text": "I made an appointment because I had an terrible, stabbing ear ache. After waiting nearly an hour after my appointment time, I was quickly ushered into a tiny room and without being asked anything, I was given a hearing test. I never asked for it and don't know why it was done. Then after another long waiting period, the doctor finally saw me and he tells me I have hearing loss. He looks into my aching ear and bluntly tells me I have no infection but rather TMJ which really, really scared me. I think he was wrong because two days later I had infected bumps on the side of my face and after it cleared, no more pain. The entire visit was a horrible waste of time which didn't help me at all and took nearly three hours!", "business_id": "UOLNw0-7GjxomFQiHUXisA", "stars": 2, "date": "2013-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "JFuXoSan4UhfNk29yOgoMA", "review_id": "Gs-vGrhbjnuz2TkLKOdl4w", "text": "Dr. Shafran is wonderful.  I would give this 5 stars if it were just her.  She actually takes your needs into account when prescribing treatment, she'll ask about what your insurance can cover and not, etc.  This is important as many neurological treatments can quickly get pricey.  And she's bright.  Very bright.  She'll try everything to help you improve and never give up (she's driven too).\n\nI give 5 stars for Dr. Shafran.  But her office staff gets 2 stars. \n\nI have had at least 4 Rx refill requests per year fall through because they couldn't keep track of my pharmacy requests (I tried giving 1 week notice, then 2 week notice... but they lose it every time & blame it on the pharmacies).  After 3 yrs of being a patient there, I sadly had to leave because of repeated missed Rx refills were a risk to my health.   \n\nThe wait times at the office used to be atrocious, they might be improving to under 1/2 hr now...   I used to come expecting a 1hr wait (my longest wait was 2.5 hours).   That being said, Dr. Shafran treats you like you're the only patient in the world when you're there.  I love that you can ask her as many questions as you like.  \n\nOverall, I would recommend going to Dr. Shafran, but mail order your Rx's.\nBe proactive in dealing with the staff (there are only two of them) and don't allow them to shift blame to you or others for their mistakes.", "business_id": "PFO7RF1xz4ZBuaq46KsLpA", "stars": 2, "date": "2012-10-16", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 0}, "user_id": "j4bxJyvIBwpL1KS-S65Mbg", "review_id": "io9tsr3nN9XeDFCMkpkh2A", "text": "Dr. Harry S. Tamm should be the example after which every promising, young doctor should model himself.  Dr. Tamm is the epitome of professionalism.  His Staff handles every aspect of the patient's care with as much genuine care, efficiency, and ability.  Dr. Tamm, himself, takes whatever time the patient needs.  He never seem to be in a hurry to move on to the next patient if YOU need more time or explanation.  He is available for questions, phone calls and follow up information, if the patient needs any of these services.  If you need a Neurologist, Dr. Tamm is the best there is.  I would recommend Dr. Harry Tamm and any of his colleagues at Phoenix Neurological to anyone who needs this type of Specialist.  He is, by the way, just about the smartest person I have ever met - in every way - not just medicine.  Doesn't everyone want a doctor like this?", "business_id": "cVxig7AVvbWkHh9ZyOQyfA", "stars": 5, "date": "2012-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "izrPGEutYNurRfodgsIxAw", "review_id": "RBatrMA-qzgkO7w2ud2laA", "text": "I spent about 4 months at TOCA for physical therapy on my knee after a lovely little arthroscopy. For someone who spends lots of time biking, running, rowing, water-poloing, and yoga-ing, I wanted m'knee back and I wanted it back to normal fast. The staff at TOCA were professional, respectful, and straightforward in the plan for my recovery. I rotated between a couple different physical therapists and then technicians would help me out with various exercises as I went through the program. \nThe equipment was solid (not state-of-the-art, but the quality was not lacking either) and each of the physical therapists personalized exercises and routines to my progress and strength. They didn't just pop me on a routine for every \"knee patient\" and check the boxes as I completed exercises. Each exercise was evaluated for efficacy and no, I didn't get away with avoiding the semi-sucky exercises that were necessary.\n\nOverall, the staff was attentive, friendly, and experienced. I'm now 99.9% recovered and able to bounce around on my knee again thanks to the physical therapists and technicians at TOCA.\n\n\n...hope I won't need to go back :)", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 4, "date": "2009-11-21", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 0}, "user_id": "pjC0di_ruBQrccjf9aYu1g", "review_id": "OIbbC96JntJPF4t60etj_A", "text": "BDP holds the contract for the Phoenix VA. I recently drove a friend for an eye exam, at the VA's expense, at an external office (outside of the VA Medical Center). The wait was quite lengthy and the office people seemed a bit scattered; however, most concerning was the fact that they did not do actual exams for the 'reading' portion of the bifocals. They use a mathematical calculation based on the age of the patient - this means the exam at your local Target is better quality, as you would receive an exam for both portions of your bifocals. The second concerning piece was the billiing... as in, the senior citizen received one. This was funded, entirely, by the VA and he should have never received a bill; however, one must wonder how often the oldsters from the VA get a bill and happily send it off to their Medicare supplemental insurance, or worse, simply write a check. Double-billing the government and the patient, I believe, is a major no-no. Big, fancy buildings just means big, fancy prices - not better quality service.", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 1, "date": "2014-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 7, "cool": 0}, "user_id": "fdfax5deZnM-pmeiyhIJVw", "review_id": "EKJEy3VJofk76QrU-3m4Zg", "text": "I had LASIK done here in June 2012. I was initially drawn to it by Tim G's review, hoping that I would also qualify for the $299 per eye prices. Unfortunately, when I had my consultation they quoted me about $8-900 per eye for traditional LASIK. (I can't remember the exact price they quoted). My contact prescription was -2.50 in both eyes. I was a little bummed and decided that I didn't want to continue and I left. I was already starting to regret that I didn't just get it over with, as it was something I'd been wanting for awhile, when about a week later, they called me and offered me a lower price. They told me that they could do it for $599/eye for the traditional technology if I did my surgery on a specific date. I took them up on their offer and scheduled for a Friday morning. I decided to do all of my pre-LASIK appointment and my surgery on the same day, so I arrived early that morning, had everything done, spent a very long time waiting around being nervous (as your eyes can not be dilated for the surgery, and that is part of the exam to make sure you are qualified for LASIK), and then had my surgery around 3pm. I am very very pleased with my results. If you are thinking about having LASIK surgery done, I highly recommend the Lasik Vision Institute. I couldn't be happier with them!", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 5, "date": "2012-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "oGBDF5HoCoyIjWFpCgnybQ", "review_id": "0C1maZxG2sDEqL9UEvGJ4A", "text": "What a wonderful experience!  These days it is a miracle to even get 2 minutes with the doctor.  Here I was able to ask questions and actually get some insightful answers.  I never felt uncomfortable or rushed.  I highly recommend this office.  The PAs are wonderful and Dr. Romine was very attentive!", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 5, "date": "2011-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "oJsnqRror1DUmi3jWgbwaA", "review_id": "g7YJTz8MnoYkMtJqA-RfEw", "text": "I see Dr Clark and Dr Corcoran here as my primary physicians and have since high school. They're both very efficient and warm people - ideal doctors.  It's an older neighborhood near their office so I'm usually a LOT younger than the patients waiting, but besides that its a normal great office!", "business_id": "1GXycbqgmD9TfhQFoktSLg", "stars": 5, "date": "2011-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "l-144cdHj46kdSyrajw9TA", "review_id": "OvXWbSulZGrHedogebCoIA", "text": "Always had to wait 20-30 mins after booked appointment. Medical assistance never asked, \"How is your day?\" or \"How have you been?\" Worst patient treatment. They never seem to keep things on record for the life of them. I came with my mom only for a referral for a skin doctor and have already waited 20 mins to get taken back, find out they don't have her record, and then placed back into the waiting lobby for another 30 mins. I am very glad to be at another doctor. Luckily this will my moms last visit here. We are very unhappy with the way we have been treated.", "business_id": "g0fSQ0yQ-zMAeqmLLbuoHg", "stars": 1, "date": "2011-09-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "fl6oI21uXoxVMwfR6lFanQ", "review_id": "R7cZdLtKmsKHSIMHIuyG4g", "text": "My PCP at this office is Dr. Chad Campbell, D.O. and I love him! He really spends time with you in the exam room listening to your symptoms and assessing you current state of health. He and his staff are competent and have great triage skills so if you have a last minute emergency on Friday and call the office, they will be able to fit you in or tell you its okay to wait until Monday. As a Registered Nurse, I am picky about my providers and highly recommend Dr Campbell to anyone looking for a PCP!\n\nAlso, as a side note: For those of you who get caught up in the suffix of M.D.'s and D.O.'s please don't. I know the old school way was MD's and there is this prestigious entitlement around MDs, but D.O.'s actually have an extra class (it's their Osteopathy class they take each semester for their entire schooling) to take in order to graduate so don't dwell on the suffix, dwell on the actual provider!", "business_id": "0-KOpYSe9aQTAfM38f47HQ", "stars": 5, "date": "2011-11-10", "type": "review"}
