{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XTp6S7yXL7HluVUaBYdbyQ", "review_id": "8rZtuT8USrLQIu5k4LPFKw", "text": "Terrible. Preordered my tires and when I arrived they couldn't find the order anywhere. Once we got through that process I waited over 2 hours for them to be put on... I was originally told it would take 30 mins. Slow, over priced, I'll go elsewhere next time.", "business_id": "b12U9TFESStdy7CsTtcOeg", "stars": 1, "date": "2013-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "bEyGMTOF8gcAwjNz_qXv-w", "review_id": "uc4QWmb9RQmdq8lJHW_W5Q", "text": "I went here a couple weeks ago to get new tires on my car. I couldn't agree more with the other reviewers. Walter's was originally supposed to call me with an estimated cost, and when I hadn't heard, I called and spoke with Walter directly. 15 minutes later, he had an estimate for me. When I couldn't decide on the tire I wanted, he had three different types waiting for me when I came in for my appointment & went through the pros and cons of each! Just great service!\n\nI also found the price reasonable & the service was quick.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2011-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7-t8knEf1jeRM1k3LIjpsg", "review_id": "wwiGhvE21eWZseFtEL4d2Q", "text": "What a great place! Mark is amazing! We had been at another car repair shop and took it to Mark because he was close by about 1 year ago and haven't left. He is awesome! Always gets us in and they do excellent work at excellent prices. We will be with him for a very long time. Thanks to Mark and Isaac...consummate professionals who really care!!", "business_id": "t_Mjhtr0KTB9uGNzxl37WQ", "stars": 5, "date": "2015-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7RSl1Ft05RkJmmKBJqoEJA", "review_id": "m_y_CZerC063qm7TeWGxSQ", "text": "I stopped in to get a serpentine belt replaced that I had in hand.  It broke on my lunch hour so I went to AutoZone and bought one.  I how long it would be to get to it and how long it would take.  They said they could get to it \"right now\" and it shouldn't take long.  30 minutes later they pulled it in the shop.  1 hour later it was completed.  They tried to charge me $212 for 2 hours of labor.  I asked how could it take 2 hours when it was only the shop for 1 hour and I was there for 1.5 hours.  They then corrected it and charged me a flat fee of $99.07.  If this is their generic price for 1 hour of labor it is ridiculous.  It shouldn't have take an hour to do it anyway.  This is the first and last time I will visit here.  They also pulled my car in front and left it running while the bill was being discussed.  I am very unhappy with their service and will let everyone I come in contact with.\n\nUpdate.  The owner called me to apologize. He asked me to call back and get a full refund.  He also had a free oil change put on my account.  I called to get the refund.  I probably won't be back.  It's not convienent for me.  I only stopped because I needed ta repair that day and they were close.\n\nThis occured on 9/27/2011.", "business_id": "n3jucIUCSjIXrKU-ykIb0w", "stars": 1, "date": "2011-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-Q00KxShmMTQB50HZCfJ-Q", "review_id": "l6YvRhEF_PgIaCwFFKs4nQ", "text": "Extremely poor service. Second time I've been here and had a bad enough experience now to put a review on here. I went in for an oil change and have them check my tires and check clicking sound in engine that I was told a while back from another Firestone and Hyundai dealership that I needed to get fixed. \n\nFirst off, charged me about $15 more than I've ever been charged for simple oil change. When asked why it was so much cause I've always been given a certain amt, I was told there was NO CURRENT PROMOTION which is a LIE cause THERE ALWAYS IS...just go on Firestone's website and there is a synthetic oil change for $19.99. I was charged $40! I've been coming to Firestone for 7 yrs now and that has never been an issue. I was in a big hurry, so I didn't get into it with the employee like I should've. \n\nAlso, this Firestone replaced a tire not too long ago and tires went low less than 2 wks after replaced. I've filled tires 2x since so I asked them to check on tires. Employee seemed to forget about tires being checked even though I mentioned the issue multiple times. When I asked at the end of the \"service\" how they were. He said, \"Oh, they're fine, and that's it. No response to my concerns. And come to find out they didn't even fill up the tires like I asked them too. I honestly don't think they even checked them.\n\nLastly, the clicking noise coming from the engine. When I asked about the noise and where it was coming from exactly, cause all I could remember was that it could eventually affect my transmission, the employee said their guy in the garage could hear it but not figure out what it was. That, to me, says a lot about their skill level.", "business_id": "-_SZy-tV0oNRiFgMStMdyA", "stars": 1, "date": "2015-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nNGds65jxwCiW6ILPR5eiA", "review_id": "J299oUqXPKzDBuc7Xvi9eg", "text": "Buyer Beware. What you see on Autotrader may not what you get at University Volvo and they will blame it on Autotrader. Also, think about buying the warranty on used cars. Within months after purchasing a used car at UV, the AC went out.  The dealership offered assistance in the form of a credit card application to finance the repair.", "business_id": "UWtpIca-ub74r6Lgwfu0Og", "stars": 1, "date": "2015-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "nbCirGvhw0TIf4HaNzwfVw", "review_id": "LnfS5JGCAZhG1L9eAqeYjw", "text": "My previous review was for an oil change, which I still stand by.  This time I brought in my car because it was making a rattling noise.  I was told that the bracket holding my flex tube was broken and it would be around $350 to replace the whole pipe.  The pipe itself was not damaged and I asked if there was a cheaper option to attach the pipe back to the car (either by welding it or creating a new bracket). The mechanic gave me a rude answer about coat hangers.  \n\nI called around and was quoted $200 to replace the pipe at Speedys Muffler. When I brought it in there to get it replaced, they told me the pipe itself could just be bracketed to the car for $45. \n\nMake sure you call around before getting work done here in case there are other repair options that Chet's didn't consider.", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 2, "date": "2013-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4PUAI_qAymmnCUkcfhNCuQ", "review_id": "sXE1tLPK8ZNfqzpHBvA8_A", "text": "I used tatman's to have a few small scratches removed.  The workmanship was alright but the customer service was mediocre at best.  It took many visits to ensure the job was done correctly.  I would recommend you look elsewhere for better service.", "business_id": "4jlqFH3cZsgRdWxZ6kwwvg", "stars": 2, "date": "2010-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "N0Vc2DKM3ClQYx5mv5iAPg", "review_id": "hZVVJCQ08A8JPpNDJp6Bqw", "text": "I don't know much about cars but I do know that the people who work at Virginia Auto really care about their customers. Matt, especially, has gone above and beyond what was expected to help me out.\n\nLast week my car broke down on the side of the road in Austin, TX, and I had no one to help me. The road side assistance card I was given during my Groupon I had used a few months prior was expired and I had forgotten to get a new one. I called Matt and he stayed on the phone with me for over an hour trying to get a hold of someone to come and pick me up. He eventually found a truck to get me, free of charge, and then sent me the new road side assistance card the next day. \n\nHe knew that I was living in Austin and would probably never bring my car back to his shop for repairs but he still did everything he could to help me out. Anyone who would do that for a customer will always get my business and I letting my friends in Phoenix know about his great shop. \n\nThanks Matt! Keep up the great work.", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 5, "date": "2010-09-25", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 2}, "user_id": "drS3ZN6-zA3sr5WM2fG5tQ", "review_id": "D9MwU_NBiUdz02oF8X6NlQ", "text": "Oh how the oil changes creep up me every time!! Glad pep boys could be of service! Best part is, i did a quick search on their website and found a long list of coupons!! I love my coupons. Service was quick and friendly. Oil change with coupon was $24.99, not to shabby in my opinion!", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 5, "date": "2013-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "N38FR5wXG-fRIQILbXlPcQ", "review_id": "Nes-SZPxFRwxkFdsxCTS-w", "text": "After 15 years as a totally satisfied customer of MAZVO's, I attended their complimentary car care clinic and it was phenomenal!  Shahe was not only a fantastic instructor but quite the host, offering lots of refreshments and helpful information to make every attendee not only a good driver but a well-informed one.  If you want great car service from an honest, very capable facility, go to MAZVO!", "business_id": "L95jFICMBewv08k7YUx5OQ", "stars": 5, "date": "2014-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TMmxB675KyM3F0oUDvls6A", "review_id": "l2yLTB12LmKU3WT_iNI0-w", "text": "I had an independent shop and we sent all of our GMC and Cadillac warranty work to Karen Parker.  Karen is experienced and always took care of our (collective) client within a reasonable time.  I found her to be professional and knowledgeable about the mechanical aspects of GMC and Cadillac products.  I can tell you this.......DO NOT under any circumstances take your car to Earnhardt Chandler Cadillac on 202 and Gilbert.  I hear Earnhardt in Scottsdale is good but not handy for us SE Valley peeps.", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 5, "date": "2015-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t8vH6ubd-6i9DTisZaQdgg", "review_id": "wYyUIFGnF7TsZ-_z6hAhKA", "text": "Went back to Volvo Am I for a maintenance check, and the second visit was as positive as the first.  Volvo Am I Fane", "business_id": "7P3ECWrdSepztN5A3boTmg", "stars": 4, "date": "2011-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vliAJpHltPo-SL6tGz5A3g", "review_id": "0AqgnzUv-0Jq7O8F7d_LGw", "text": "David and Glenn are really good guys. Hard to find people to trust in a 'big' city. Was recommended by someone I trusted greatly and have been a regular there with three different cars for two and a half years. Will do good honest work and not charge you for services you don't request. Glenn will often put together a list of things that can be done to better the car, but never push me to get a sale, honestly recommends needed repairs but respects my budget and time. They even offer rides when you need them. They will pick you up too. Other mechanics are real friendly too. Do yourself a favor, relax and give em a call.", "business_id": "uKNp1tdMEibbriPE9bhZKg", "stars": 5, "date": "2013-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "oXkbuOiN9HDS3WgOQONfRg", "review_id": "Ktwcxb21qSlPIRH_md75cw", "text": "About six months ago, my Dad told me I needed to have my wheels aligned.  I kept putting it off, but last week I decided I just needed to get it done.  I searched Yelp, of course, and came across a few reviews for places near what would be my new office.  I finally settled on Jack's Auto Alignment & Brakes, called on Friday, and made an appointment to drop off the car today at noon.\n\nA friend/co-worker followed me out to the shop, and when I get there, I spoke with Ken, the man who made my appointment.  He said the car would be ready by the end of the day and he would be happy to call before they started work if I so desired.  I told him to do whatever it needed and to call when it was ready to picked up.  I asked him if he needed payment before I left, and he said no - he wouldn't charge me for work he didn't yet know needed to be done.  Excellent!\n\nBefore I left, I asked him for a favor.  I had gone to get my emissions tested over the weekend, but because the emissions sensor thing under the steering column (that's a VERY technical term) had come unplugged, they couldn't do the test.  They said I could do it myself, but I couldn't figure out where the thing plugged in.  I asked Ken if he could figure it out, and thankfully, he was able to!  He didn't charge me to do this, as some places may have.  Very cool of him.\n\nAnother cool thing:  One of the guys noticed my friend's tires looked a little low.  He had her pull the car to the bay and filled them up for her.  It's those little extra touches that make a good place great.\n\nShortly after I returned to the office after dropped off the car, I had a message from Ken telling me the car was done.  They finished in less than an hour!  I called back and spoke with Ken and he told me only the front wheels needed to be aligned and told me I needed to replace the front tires sooner rather than later.\n\nWhen I went to pick up the car, I realized I'd forgotten my debit card and ID at home.  Thankfully, I have my card number memorized and Ken was able to run it manually.  Again, very cool of him.  Before I left, he told me to have the alignment checked once a year and reminded me about the front tires.\n\nThere's no doubt in my mind I'll take my car to this place when I need to have my brakes replaced or my wheels aligned.  I'm a huge supporter of locally owned and operated shops, and I'm thrilled to add this one to my list and recommend them to anyone who needs their services!", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 5, "date": "2009-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TU6stUlyKnf7z2RwdDGuzA", "review_id": "1d7whsX_m7naYfLnA1tBQw", "text": "Good service, new manager.  I had to have the 60000 service done on my car.  According to the manual there are 2 options, the spendier one and the low end service, but no specifics about desert conditions.  I took it in and the manager went over all of the manual's service requests and eliminated the ones he thought I didn't need and turned out to be 200 dollars cheaper than what I was expecting!  Nice to know an honest shop who is willing to save me a few bucks", "business_id": "Q_ntUL08gNFpCHhJALwQFA", "stars": 5, "date": "2011-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GBXGMbapCuhQ8NrXfP7nJQ", "review_id": "jQgmto5_G7E0lXWjPvEghw", "text": "It's hard to find warm hearted kind people now a days.  Owning a Bmw as most individuals know is very expensive.  I just replaced my battery and it needed to be registered to the car.  A simple process that most dealerships would charge an hour or two of labor on.  This process only takes a few minutes time.  I called Ray and he said he could fit me right away.  I drove to his shop and he quickly brought his high tech computer scan tool out and coded my battery for me in minutes.  I was on my way in a very short time.  Before choosing him I called a few other shops for pricing and they all seemed to be about the same.  Once the job was done, the bill was way less than quoted!  He said remember me in the future and have a great day.  Well, I hope everyone reads this review and gives him a shot with their Bmw.  I'll definitely be back.  Ray was very nice and friendly.  Not to mention his shop was spotless and very organized.", "business_id": "Yhbsyq_n4J3vLhw9WkXwAw", "stars": 5, "date": "2015-11-06", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "khPlizt3ava1xkbtAxHQnw", "review_id": "io9n350flLui0xvaV2Gadg", "text": "I purchased a deal chicken deal for 3 oil changes from this place. It came with a coupon card that offered 15% off of a cv boot replacement. Well it just so happened I needed a new cv boot so this was perfect!\n\nI scheduled my cv boot replacement during my 2nd out of 3 oil changes. I specified that I would be on a time restraint and would only have 2 hours for the work to be done. I was assured that would be no problem at all\n\nWell things happen, right? The company that sent the part over sent the wrong part. George said that he would have them bring the right one right away and I would still be out of there in time. Well lucky me, they still didn't bring the right part for the second time. I was pretty upset because I had to drive back to Scottsdale to pick up the little girl from school that is my charge as a nanny. So George offered to let me drive his personal car that happens to have the same size car seat I use installed in it. Since the little one I had to pick up was not my child I was not comfortable doing this. But what I nice gesture! \n\nSo I rescheduled the service for the following day and left after two hours of my time wasted for an oil change. \n\nSo why the 5 stars? Because George replaced my cv boot for no cost, due to my troubles the prior day. Awesome! Even though this was not his fault, he ate the cost and made the customer happy, hoping I will return. And I will, for sure!", "business_id": "f5Zo7ERPbqcj9soe1DimpQ", "stars": 5, "date": "2011-10-11", "type": "review"}
