{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zo_soThZw8eVglPbCRNC9A", "review_id": "UzMViMQZuSxOr5wrru3LwQ", "text": "I visited this store several months ago to simply ask about smartphone plans. The agent was pleasant and helpful. I would recommend a visit to this store.", "business_id": "HZdLhv6COCleJMo7nPl-RA", "stars": 4, "date": "2014-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mrmDFhLjEGOjSQT_GZgM_g", "review_id": "yGPdA_RETILjRiTPPX7ObA", "text": "Target is pretty standard. If you've been to one of them, you'll know largely what to expect from this one. That being said, this store is clean, and the deals one clearance can be good. Just make sure to check the circular and the website, as sometimes additional coupons can be found that the store personnel aren't aware of. \n\nThe electronics department staff are not very knowledgeable, and tried to pressure me into buying a different TV by repeating marketing lingo, but were unable to explain what their claims actually were when challenged on them, so make sure to do your research beforehand if purchasing electronics.", "business_id": "ISKLP0qxApATxRlUDob6Cg", "stars": 4, "date": "2012-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KI31SxdEI5f5wFxt0sIw2A", "review_id": "kaH7FdN9veW4gdip2-myOA", "text": "I've ridden, trained on and/or raced bicycles for 30 years and during that time, I've purchased bikes and/or parts from no less than 20 different shops and websites. So it is with a great deal of experience that I can say, with confidence, that this is the best shop I've ever stepped foot (or cleat) in. \n\nI purchased a new bike and had 3 other bikes serviced there in a short period of time. Glenn, Craig and the ENTIRE team effectively demonstrated technical expertise, a passion for the sport and most importantly, a deep respect for their customers. I not only witnessed it myself but witnessed it with other customers while I was waiting. \n\nWhether you're new to the sport or a long time cyclist seeking a new and better experience, there simply is no better shop than Big Bang. Their selection, access and overall service is simply unreal. Enjoy this place, it's a treat.", "business_id": "4ykgzzzGEWjMD5lwk1-l9A", "stars": 5, "date": "2015-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E62SZVU_FsbCYaVnMRs4TA", "review_id": "pKOyPOiHvrD9kJBQgsRzYQ", "text": "Most of the home depots i've seen are the same and that includes this one. aisles full of hardware supplies, tools, bathroom accessories and even a small nursery for gardening. \n\nMy favorite section is the tool section seeing that I'm a DIY-er. (Do it yourself) if you didn't already know that. I enjoy building, maintaining and fixing things in my own home as opposed to hiring a contractor and paying a boat load. I'm best known at the Home Depot in monroeville. I come in there so often a lot of the employees know me just by my dog. Yes my dog, who i have brought into this store several times. They allow pets i'm assuming because i've never been asked to leave and I've seen others with their pets as well. \n\nThat's the best part about the store is the animal policy and the fact that they offer enough supplies for you to practically build a house. Some things are cost efficient while others are kinda breaking the bank. There not as modern as lowes but they have alot of the same products. I recently built my own in home bar. t's 8 by 2, a long bar that i (a girl) built by hand. I'm very proud of the work i did. I installed lights and polished it and it has a resin top with ceramic tiles beneath it. It's a real beauty and i got all the supplies at home depot. Cost me about $600 to make but i put it together in 2 months so that's a plus. \n\nBut yea if your in need of some nice plants to go in the kitchen or patio OR you just want to spruce up a few things around the house, then this Mega home repair store is where you ought to be. Between this and lowes its not like you have a choice.", "business_id": "qA1PXTv0snTO1gpNPm-Jfw", "stars": 3, "date": "2013-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "chvjWC1GEF85ZvuJWKmekg", "review_id": "OiT7btyz0PHFNpPjooeyng", "text": "I came home one night to find unpackaged flowers sitting at my door. Normally, I would be excited, however, this was not the case. My information card was poking out of the flowers in the open, revealing my full name, address, and phone number. Being a young woman living in a new city, I was upset to see the carelessness by Dormont regarding my privacy. They did not care at all that they left my personal information out in the open for anyone passing to take. When I called to complain, the woman apologized and said that this has never been brought up as a concern before. Even though it has never been a concern before, it should immediately become one for you when a customer is calling to complain, especially when I said it made me feel unsafe. This is the last time I will ever want to see Dormont Florist anywhere near me. I am the type to always enjoy fresh flowers in her home and will be finding a new florist with higher standards.", "business_id": "nrVJI0fhbjO1eOZZ5gLWqg", "stars": 1, "date": "2014-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RSExP0-Boucr4QyIEzZi0A", "review_id": "NIOo-xIcG3hTAnYluzPjxg", "text": "Wow. I hope that the one experience I had here was unique and not the norm for frequent customers. All I wanted to do was to buy some thermal socks (which they didn't even have any for men!  ???). I just ended up grabbing the next best thing (Oddly, they did have thermal socks for women which I almost purchased). I go stand in the check out line, and I don't think I've ever dealt with slower people than those who work here (and that's saying something). Not one, but two of the registers I stood in line at froze, and the women had to wait for the manager to fix.  They didn't seem to mind at all, which leads me to believe this happens all of the time. I waited for my beau who bought something after I did: another 15 minute wait.  Needless to say, I will not go here again.", "business_id": "SNJHgqJPj5SZhntFdsDUeg", "stars": 1, "date": "2014-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_EgqctGkSNdalOYZVNPG8g", "review_id": "OSxRVGHwrsLeFCwUDVf3Kw", "text": "Gorgeous things and apparently they ship too! Can't wait to get my flowers and planters home!", "business_id": "NqmdaI1GX8LOTRYlMGlTsw", "stars": 4, "date": "2015-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BMGMeDaO47-rI-s238Lxfw", "review_id": "qcb7BiajZGeMVQOLMl16_w", "text": "It's been a while since I've been here (maybe back when it was called Paul's) but I remember this place standing out as far as record shops go. It was super organized with easy to browse cards in place of the actual discs (for some, not all). I remember getting a lot of good stuff here. The selection is pretty deep. Next time I'm back in Pittsburgh I'll definitely come back!", "business_id": "OmAWp8kUqXrW0umGdZgNUg", "stars": 5, "date": "2015-11-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "90eO0bjrR7W6LYqhuvo1ng", "review_id": "k4BmjJRMFGlIptowQ7PvQQ", "text": "Incredibly unfriendly staff, completely clueless consultant.  It wasn't crowded - we were there on a Monday afternoon.  We had been to 5 other places over the last several weeks and pretty mjuch knew what my daughter wanted.  The consultant brought back whatever she felt like grabbing - some fit the description, but most did not.  If I asked who the designer was, she didn't know and didn't look.  If I asked the price, she didn't know and didn't look.  If I asked if it came in white (almost all were a ivory), she didn't know and didn't look.  Always 2, sometimes as many s 4 other consdultants were standing at the counter talking - close enough to us that I could hear their conversations, and none of them ever spoke up to say answer any of our questions or to say anything.  At one point, our consultant stood between my daughter and me and told her to ignore what I thought (and I was NOT being negative) and tell her if that was her dress.  When my daughter said she wanted to go back to another store and re-try a dress, she pushed her into buying the one she had on.  I finally told her to change clothes - we actually had a lighting appointment scheduled - and because I was not going to write a check to that store that day or any other day for that matter.  My daughter did get her dress - at the other store where they treated us like we were special - like we were doing them a favor rather than the way we were treated here.  From the time we walked in, theconsultant at BB made us feel like we were a nuisance.  Think twice people before going here.\n\nUPDATE:  I received a very much appreciated phone call from the owner today.  She was upset by the way we were treated and apologized profusely for our experience.  While there's nothing that can be done to change what happened to us, she did speak to the consultant and hopefully, it won't happen to another family.  I might have considered going back and having a different consultant after the conversation today if we hadn't bought a beautiful dress elsewhere.   I will say, they do have some grogeous gowns!", "business_id": "x2y1d9-v6ReSXJasCagyNg", "stars": 1, "date": "2012-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QElhuXqi1FtlpeiurTKpJQ", "review_id": "SpBFOg3MSGZDyUUg4rnMgg", "text": "Wow! I absolutely love this place. For its location on route 19 in central Mount Lebanon, this place is gigantic. It has its own dedicated parking lot in the back, which is great because parking in the ares is always a bit problematic. \n\nThis is a great little hardware store with all the smaller items of a typical store, but a little less in terms of large items like wood, fencing, etc. It's also a bit confusing with the layout, and I got separated from my family and lost in the store. It was a glorious kind of lost though, because I love hardware stores. This place has a lot of nicer high-end fixtures like lighting and faucets that I haven't seen at the big-time stores. \n\nIn addition to traditional hardware items, this place carries some kitchen supplies, camping and outdoor gear. They had a great selection of reasonably-priced Carhart gear in the center of the store that I was eyeing for Christmas gifts, and I also saw an aisle full of ceramic teapots that I reluctantly avoided to prevent unnecesary spending. This place is great for browsing DIY-ers and people who just love to roam hardware stores, like me. \n\nI went here at the beginning of October and they have a great selection of adorable Halloween decorations. The center of the store has a giant table full of sale items, including last-season decorations and random knick knacks. I didn't get a chance to explore the place in depth so I can't say too much about its inventory or prices, but it's a wonderful, large, convenient, and interesting store and I can't wait to go back.", "business_id": "jLgIlhi_A78JG-43C8e63Q", "stars": 4, "date": "2014-10-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "5rn80Jz7x69y2tQGcZTwOg", "review_id": "lmELne8-SSMBBBX1BZjvbw", "text": "You want style?  You want selection?  You want clothes that have been respectfully honored for the wearable vintage art they are?  Go here!!!  The owner Richard is top-notch and knows his stuff inside and out.   My only regret is that I didn't have more days to visit...maybe that good thing, because honestly, I don't think I would have left the store.  If I lived in Pittsburgh, I'd be making weekly (maybe even daily) journeys to the store.\nI'm an experienced vintage shopper and baby - it doesn't get better than this!  And the prices - very reasonable for the quality of the clothing, which is all cleaned and tenderly loved.", "business_id": "bbfdJ1dkwWNww1m_SfyDnQ", "stars": 5, "date": "2010-09-23", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "ylIgegaQaJOjL4_lH2EkFA", "review_id": "XGM7yWAD00jrcTDD9JZfSA", "text": "Loveeeeeeee rite aid.. Cuz I get 20% off \nHE'LL YEA", "business_id": "Lgyc-00L5pAELhjwUjAz-w", "stars": 5, "date": "2012-11-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "KSS6v5fcZNoelu4eEZCFcw", "review_id": "ihhx4FQvV-TKOgnmlcR_TA", "text": "I know of 2 locations of this store. This was my first time in this location. This is is one of the best toy stores in Pittsburgh. They have puzzles, games, Legos, Madame Alexander dolls, craft kits, stuffed animals, you name it-they probably have it. I, as an adult, was mesmerized. There is so much to look at from floor to ceiling. Some things brought back memories from my childhood and somethings brought back memories from my boys' childhood. Now that my boys are grown and not at a point in their life for children, I buy for four girls who are 5 and under. The are the daughters of one of my close friends. Needless to say I didn't leave empty handed.", "business_id": "g_XU88LhAeONO46eA_i4Fg", "stars": 5, "date": "2015-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vmYgpjq-twVHVNKGxu04Qg", "review_id": "q5GzrHo20wlmBlabjZIlvA", "text": "This ratings is more for the employee's they have bagging the groceries at this location. \n\nI love the deals this Bi-Lo has to offer. That's why I shop here. I spend a lot of time planning my grocery trips, clipping coupons and checking out the circular. When I get to the store I spend the same amount of time picking out my groceries. When I get to the check-out the last thing I want to happen to my carefully picked groceries is to have them thrown into bags, crushed, bruised, and meat packaging punctured due to poor bagging. When I left the store today my tomatoes were at the bottom of a bag with boxed goods packed on top of them, same with my hamburger meat. My bread was crammed into a bag along with canned goods and all other canned goods/jars of food were packed in single plastic bags, filled to the max. Needless to say, carrying my groceries into my home was a bit of a gamble, as two of my bags handles ripped, and another that was crammed full of boxed groceries ripped down the side. As much as I love the deals and the convenience of this location, I don't think I will continue shopping here if the service doesn't improve. I would rather pay a little more for my groceries than have things ruined and damaged due to poor workmanship.", "business_id": "P_Ks4SYvo_m4pHlPE8rOUQ", "stars": 3, "date": "2014-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J1duRhkYkaZYfhpr66cYFQ", "review_id": "5FkUP8PZ9Z-y8L4VO_1pag", "text": "\"The sales staff (Joanne) was helpful in helping with the design of our sideboard and matching color with our upholstery. The piece was delivered, however there are some small areas that need to be retouched. The main problem I had was when the technician was sent over to fix the piece and didn't even have the correct paint color. Looking forward to having it fixed and received compliments on the piece already. Overall good experience in the showroom.", "business_id": "fqFWad8GW178xzzC4A4ZEA", "stars": 3, "date": "2015-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GkM9zfqMqUyG3PFXJpD9Aw", "review_id": "SrwZSPUqH0ArZSGHt6vIrQ", "text": "David's Bridal is fine. They have all of the expected. The staff is fine. Nobody really goes out of their way for you. It is just a fine experience. I would recommend getting your dress altered somewhere else. David's Bridal wanted to charge my bridesmaids $100 and make them wait a month to just shorten the hem. Just save yourself that headache and take is somewhere else for cheaper and faster alterations. With the majority of my bridesmaids out of town, using David's Bridal as our bridesmaid dress vendor was easy. There were locations in both Florida and Georgia that the girls could use and having everything in the David's Bridal system made it an easy process for all girls to obtain their dresses. Don't expected to be wowed, but David's Bridal is fine.", "business_id": "SmxYzoYDxMRMahF-PO7gHg", "stars": 3, "date": "2015-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HRFD2ca4_TPSGSqekJaomg", "review_id": "7j6NFfLCQ9VevcUZ4oC0Jg", "text": "I was here earlier today and I have to say every time I've gone there its always a nice experience. It never seems to be too packed and they actually have a very nice selection of stores. I always end up leaving with more than I intended on getting, but I think that's may just be the shopaholic in me. lol. I also like their food court, but other than that its your typical mall.", "business_id": "CyZ9PCtYv1hKeyTtWx__aw", "stars": 5, "date": "2010-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2HYSH6-qI3xUVOTLFanq8g", "review_id": "CmRMoH1w93RrEMKpztFflQ", "text": "just bought my third watch from finks,this time it was the breatling avenger seawolf,tracy and her employees made me feel at home,got a really good deal,thanks guys", "business_id": "OJcanoocedzNsx1S7l3A0A", "stars": 5, "date": "2012-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "JaBOVU7_SmVZc9oOEeWr7g", "review_id": "_I9VW7VGpDIwhFhyby0xSg", "text": "They did a good job with the framing of my diploma.  A little expensive compared to what I had done in Florida, but not completely unreasonable.", "business_id": "m-XMNHUfuniMD3DR4AC_ig", "stars": 4, "date": "2012-11-07", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "wpwAFk3FjNYKr4ximWZRoQ", "review_id": "Li84X6AQ8vNQ9LM-qnippw", "text": "Staff is always knowledgable and helpful; their suggestions definitely help with branching out from movie-viewing ruts! \n\nIf you like movies (or maybe just want to get lost in their labyrinth classics and discover how many movies you've never seen, or even heard of) support this local business and be a regular. Do it.", "business_id": "STcLx0y_X89TsC0m2gVgHw", "stars": 5, "date": "2012-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "kSV2NJ2jsj5qssaF6ANqew", "review_id": "wTcKmr7B0ZTmKQsc8MK8jg", "text": "Best place in Charlotte for comics, hands down. Sadly, not the best place to go for a friendly staff. Condescending tones and mockery of things I asked for/was inquiring about are not a good way to get return business! :( I'll buy online before I go in here again.", "business_id": "L1OqlH9UzjBK0js4sKs9cQ", "stars": 2, "date": "2010-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mAtHz4OfKCcsB8XMDA1KyQ", "review_id": "743IY5QaQTN9gOSe7CILQg", "text": "I had a great experience at Hyatt. I came in looking for a 9mm and they had a great sale on handguns. Steve quickly helped me even though the story was completely packed. He allowed me to hold as many guns I wanted until I felt comfortable with my purchase. He was very knowledge about brands and features that would be best for me. I will definitely be back for my next purchase !", "business_id": "gR_Xp2i0M5iR-Ht7EipWqg", "stars": 4, "date": "2015-11-21", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "VhI6xyylcAxi0wOy2HOX3w", "review_id": "gMlJbLBqr-mTWm_AQLpt0Q", "text": "A nice B&N with books at full retail prices. If you're looking for a recent release or you just like to browse, this is a great shop. I sure hope they sell some because I wouldn't want the same thing to happen to them that did to Borders.\n\nOn two levels with a coffee shop and a few seats here and there. Free wi-fi.\n\nParking is a bit of a pain - there just aren't that many spots!", "business_id": "8NnFve6QYvTNjrhVc-sepQ", "stars": 3, "date": "2011-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gjVHOgX5QOMUvpJMS1iTMg", "review_id": "TtP5EgjIq_TZ8XnDgdFy-A", "text": "I visited Todd's Flowers in Plaza Midwood for two reasons:  \n1. To support a local business\n2. To get my wife a congratulatory bouquet for her new office.  \n\nAs soon as I walked through the door, I realized I was in a floral thrift store. I was greeted by a stark showroom filled with dusty baskets and props that looked like they belonged in a family photo studio circa 1981.  The two small refrigerators they did have only had 4 bouquets in them, and the flowers appeared old and wilted.  The employee pointed to the cooler at what I believed to be the \"Charlie Brown Christmas Tree\" of floral arrangements and informed me the arrangements start at $45 and go up from there. \n\nThe employee did rise quickly to greet me, she asked if I needed help.  I inquired about delivery, and they do deliver, which is nice.  She was more than willing to help me out, but the combination of a boring showroom, shabby product and high prices just left me standing there staring at the employee.  I couldn't even make up a lie as to why I needed to leave, I just blurted out \"I'm going to try somewhere else\" and turned and walked out.\n\nI ended up going to an unnamed local grocery store in Charlotte and a florist working in the smallest little corner of the store made me a really large arrangement with fall colors for around $35.  This was definitely a case where I wanted to support local business but the product they offered completely underwhelmed me.  \n\nTodd's Flowers has a good location with some really nice Elizabeth homes nearby, but they need to work on the customer experience, and they need to have someone cranking out beautiful arrangements that you can't find anywhere else in that area.  If they did that, you'll have to take a number to get in the door.", "business_id": "2w0ZbDPEwhM6jMjJhgIkEg", "stars": 1, "date": "2012-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8_XdmE16W6LjIxPisjB26g", "review_id": "XFS2KCr8V-UvCJI33Xd5Tw", "text": "The worst Walgreens in the history of Walgreens. If you enjoy waiting in line, visit the pharmacy! You are guaranteed to wait at least 20 minutes before you contemplate leaving. \n\nI think to get hired at this location, you must have to be able to complete a 5k in over 2 days.\n\nIs my point across yet? Very slow service with employees who seem to hate their jobs.", "business_id": "KTy6UinwPHCU3j_GpE_pGg", "stars": 1, "date": "2015-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F4rCOVJa0NP6cSDVISTiPQ", "review_id": "-uBFWooUOK_8zTCr04Hhiw", "text": "Store is cool, but the time center scratched my brand new watch when I brought it there 2 years ago and last month they broke my other watch when they were changing the battery. I'll go to the store but I'll never bring a watch to the time store again.", "business_id": "zKJ-FLl4v-H5Gx3_A8AGcg", "stars": 2, "date": "2015-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "52jUkzxr2Eq6Agdsx9W-VQ", "review_id": "ObLtIWZUSKAIrtEi9jS9jg", "text": "I ordered three trees to planted by the Bruce company early summer.  I was told they wouldn't be able to get to it until early September.  What?, well, ok I'll wait because they have nice nursery stock.   I called mid September when they still hadn't planted the trees and I was given a date of Sept. 25.  Not to my surprise, no one showed.  I called and they said everything was delayed due to the rain.  It hadn't rained for weeks, but they would be there next Tuesday.  Tuesday has come and gone and no trees.  I called and cancelled my tree order and asked for my 50% , $500 deposit back.  It is now too late for trees to be planted and established by winter.  I am waiting to hear back from them.  I will give an update later on as to whether I get my deposit back!  I have had trouble in the past with them not showing up for a job..no call ..nothing.  I should have learned my lesson then!", "business_id": "vknZxEFCHOMidG0OJKYekA", "stars": 1, "date": "2013-10-02", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "oSA746-4MCJpWorJkzxqpQ", "review_id": "ps1EtfSbf0ybx4waH_wvAA", "text": "While not as big as its West side counterpart, this little JoAnn's packs a punch. It's got a very good fabric selection and the gals (and occasional guys) at the cutting counter are nearly always super helpful. It's rarely very busy and the sale sections are fabulous. Today a very polite employee braved calling the busy superstore location and stayed on hold for nearly 10 minutes while she and an employee there tried to locate a product for me. Well done!", "business_id": "fBSd-fl9-9LkitwrFRcBng", "stars": 4, "date": "2012-10-01", "type": "review"}
{"votes": {"funny": 9, "useful": 4, "cool": 0}, "user_id": "6kp815UUjK--ukUjmDlSCQ", "review_id": "CHCJ8eAEGtOhdKgTHTAyVg", "text": "Remember when East Towne mall was nothing?  A big building full of emptiness, speckled with a few pathetic stores here and there?  Ten to 15 years later, and now its been completely revamped and is all dolled up with white twinkly lights, and cheesy holiday decorations.  Hell, even Santa shows up there now.  \n\nBut guess what?  You can't just walk around the mall without some dipstick wanting you to try on their lotion or straighten your hair for you!!!  Isn't that exciting?  It's like being harassed by a car salesperson, only these people want to let you know how ugly you are, and how they can improve you with their shit products.  \n\nDo you want to try this wonderful lotion?  Can I straighten your hair for you?  Can I ask you a question about your skin??!  Can I ruin this trip to the mall for you by refusing to leave you alone every time you walk by?!?!  \n\nYES!!!!  It's like getting a root canal and then asking for a do over.  Because, even if you politely say no thank you, they persist, and harass, and then as you are walking away, you hear them say snide little things about you.    \n\nI hate those pushy bastards.  They ruin every, single trip to the mall.", "business_id": "CRKM5F4MHGHvEGgI3LXy8A", "stars": 1, "date": "2008-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oSA746-4MCJpWorJkzxqpQ", "review_id": "Cpx7eEP3tMOidHKwp_BUOw", "text": "Due to the employee giving me incorrect instructions I ended up with one copy that wasn't sized properly and was still made to pay for it. Even though the employee set the machine up wrong. While it was only 18¢ or thereabouts, that's still a bit annoying. \n\n2 machines for self-service, with a full-service area too. Nothing special, but enough to handle most small copy jobs.", "business_id": "7hchHAiiUEET2eKA-unPhA", "stars": 3, "date": "2012-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kdL6ldI-ZqHapKrMw2CEFw", "review_id": "JSsPomaItT8_XCvN5OOA5w", "text": "We were contacted by Marling and decided to give them another chance. We worked with a different person (Maria) and everything has gone smoothly so far. We are currently awaiting our new kitchen cabinets/countertop", "business_id": "JD04BlA142xkYsPTErQOrg", "stars": 3, "date": "2012-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "qy9xGKT_77fekC7Tt2eYqw", "review_id": "8UqcM3IDomvXS9BOcNjWew", "text": "This place is like heaven to me. Yes, it's a little overwhelming. Yes, it's a little overpriced. But that spells the makings to a great grocery store to me! The selection is second to none...especially for us gluten free folk. Produce is phenomenal. And if you haven't tried them yet their marinated chicken breasts turn a normally boring meal into a flavor explosion. (Seriously, try them.) If there's something specific you're looking for, you're bound to find it here.\n\nOnly things I'd say they can improve upon:\n1. The deli counter. I know it's supposed to be super good quality deli meats but every single time I've gotten some they are pretty dry. Maybe I'm just ordering the wrong kind? (Suggestions anyone?)\n\n2. The sushi area. I've never actually tried it but it always looks a little scary.\n\n3. The prepared foods section. I tried getting a salad or something here once and the man working behind the counter had no idea what was in anything. Since I'm gluten intolerant this can be pretty important. \n\nBut even with these negatives, I keep coming back and actually look forward to going grocery shopping!", "business_id": "OxR3b_qcMJlzwzGPU5fmdA", "stars": 5, "date": "2013-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "nQxZvH7QixXfNoO1rdhdFg", "review_id": "TceHwxdxxtB14c72vSZO5w", "text": "Misty Mountain is what I would call a fairly average game store. There's nothing overly positive or negative that stands out about it. I really feel that this store could really step up their game in some areas to become something really stellar.\n\nFirst, I love the massive open play space at the back of the store and frequent CCG, roleplaying, miniature, and board game events. It's a great way to pull the gaming community together. Along the same line, this particular store does not suffer from \"basement gamer smell.\" I am pleasant surprised that the store has a neutral scent, despite the masses of people that hang around the store for the open play space.\n\nThe miniature and CCG selection seems to be full of anything you would really need, but the board game front needs some work. The selection sits between Target and a well stocked game store. Many of the demanded new releases are not in and many box covers are faded from sitting in the sun. I love supporting friendly local game stores (FLGS), but I find it hard to support this one because there isn't much on the shelf that I want to buy. I already own everything on the shelf or I'm disinterested. It would be great to see more stock options and  new releases. Additionally, carrying component upgrades for board games would be a welcome introduction.\n\nIt appears that all of the prices here are MSRP, which is fairly expected for a game store. Unfortunately, they do not have a loyalty program for customers. While I LOVE supporting FLGS the lack of loyalty program makes it a difficult choice for me to either spend significantly more money compared to Amazon or Cool Stuff Inc or to support local business. For example, Terra Mystica is $51.99 on Amazon, but the store is selling at the full price of $80. I really want to support you, Misty Mountain, but you make it so hard with these massive price differences and no loyalty program. If you do have a loyalty program not a single employee has told me about it after multiple purchases.", "business_id": "u5p8rf79qxDkXX129qZInQ", "stars": 3, "date": "2015-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GYEEDSd5Y2gTGropU9_MYA", "review_id": "e5xKB5vxj-yNkQWdSvmtug", "text": "Two weeks before my wedding I was faced with an issue: we had no flowers.  My aunt was going to take care of them, she planned to get them from a local market and arrange them herself, but fell ill.  So we had a predicament, one that Blossom Basket took care of.\n\nDespite giving them just two weeks notice, despite calling over and over and updating my order, despite giving them little direction on what I was looking for, they were extremely friendly and created beautiful bouquets and arrangements I was so proud to have at our wedding.", "business_id": "iUT5YfK0CzfPHuFbJuO_3A", "stars": 5, "date": "2015-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "EALZVtYyZZS1JFKVYMG8Mw", "review_id": "zab9xHiXf5mZRXqlDz_Ghw", "text": "My 4 year old loves to check out all the costumes. Cheap fun. The staff is super nice and don't mind her trying things on. We usually don't buy much. Maybe just some little cheap necklaces or bouncy balls. I have gotten a couple birthday gifts there. Good source for little kids' party favors. Also I think I am going to have to go get that Jessie hat from toy story 2 as my kid loves that movie. Maybe I'll save it for christmas.\nPrices on Halloween costumes and such are about the same as they are everywhere but the service is way better than target or wherever. The staff will help you find pieces to match or accessories without pushing them on you.\nAlso there are plenty of mirrors strategically placed around the store to check yourself out.\nAlso they have there own parking lot in back so the don't have to pay the meter.", "business_id": "8zaahO6vCRqr26E5z-VJ-Q", "stars": 5, "date": "2015-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rMf_QIAUHMIr3OJybv5Ylw", "review_id": "A2pR_a0EZa5wF_uBcZZ-Jg", "text": "The One-Stop Shop.\n\nSomething old, something new.\nI like the collection of frocks and outerwear.\nAlso the accessories are fun. And the vintage frames are great! \nDandelion tends to be the first place I check out if I'm looking for something unique or for a piece to complete a costume. A surprising amount of my wardrobe favorites are from Dandelion.\n\nIts just a fun shop! (that I miss dearly!)\n\n(That being said it can still be very hit or miss, but so are a lot of shops)", "business_id": "gVp2MmQ2VP8bzeObzX6Qtw", "stars": 4, "date": "2006-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3vc-qrVkTzMhNZuy_qFb8A", "review_id": "rULzowykJ6zLrlDVig0G8A", "text": "Newly remodeled and service is friendly and available. They don't price match. I was told they will only price match their own webiste.", "business_id": "2WhMtk_k6POWSmr054NDHw", "stars": 3, "date": "2011-10-02", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "YHIXQ_p3xAMGoWAsBTGBig", "review_id": "_1ZBGs9QXW3dnkJADYjb4Q", "text": "If I were held at gunpoint tomorrow and forced to choose only one thing I miss about my hometown, I would definitely live to tell the tale. That's Rentertainment is the obvious answer.\n\nWhere else can you bump into your high school math teacher while combing the LGBT section for My Beautiful Laundrette? Where else can you methodically work your way through practically every detective show ever shown on Mystery during the 90s? Where else could you simultaneously rent 500 Days of Summer, the third disc of the fourth series of MI5, and that obscure Korean movie your friend's been pestering you to watch?\n\nThe very first time I went to That's Rentertainment was the same day I watched Colin Firth in Pride & Prejudice for the first time. My mom and I rented the whole 6-VHS (I know!) set, and when it came time to pop in the third installment, we realized that we had a second copy of volume two instead. The shock! The horror! We ran to the car and hightailed it over to That's Rentertainment. Not only did they have the third tape ready and waiting for us, they commiserated with us over our terrible case of Darcy-interruptus. We went home, and binged on the rest of the show until around 1 AM.\n\nAlthough the VHS tapes are (mercifully) gone, That's Rentertainment continues to be the best place in town (and, I can say with certainty, anywhere) to get your home entertainment fix. I love it so much there that I even make a habit of getting 25 cent gumballs from the dispenser by the door and enjoying their stale je ne sais quoi all the way home, with a grin plastered on my face, despite my aching jaw, and two or three DVDs warming the passenger seat.", "business_id": "I9iYkqmioN8MuWEB9wWxkg", "stars": 5, "date": "2012-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x1WmR6KHk_FPhOQEcaPwOw", "review_id": "UeoUrVgrVBUVoV4AletFjQ", "text": "I made my way across town to Michael's Jewelers right in downtown Phx.   Although had to pay for parking it's situated in a high traffic area with many business types.  I respect an establishment that gives a warm welcome and caters to their customers.  Got exactly what I wanted and I will go back again.", "business_id": "YLyEGXEgh1qh8y4kWEsddw", "stars": 5, "date": "2012-11-26", "type": "review"}
{"votes": {"funny": 5, "useful": 4, "cool": 4}, "user_id": "Lp_Ykqfbv5Q-oyGYlMGJRg", "review_id": "KnDpm6X_NvoPqNv-ss1uvw", "text": "Smells like hipster.  Which is about 10 times worse than normal BO because the hipsters are too cool to shower more than once a week.  Because that would show they cared...\n\nThe place does put on some decent shows, they just need to work on sound quality.", "business_id": "YRJKTPc7Tkz1cbjGHmOHuw", "stars": 3, "date": "2009-10-01", "type": "review"}
{"votes": {"funny": 2, "useful": 16, "cool": 0}, "user_id": "5XeDEr-w6rA_gx7GOMpNlg", "review_id": "hqGaqLFYru6tCkAehDpkyA", "text": "I was so excited to check out this store. Living in a vintage building and flush with cash, I felt it was the best prospect for furnishing my apartment. \n\nHowever after spending a few minutes in the store I felt cold, alienated and stupid,\nFor starters I was never greeted, my presence acknowledged, or even asked how my day was. The store was empty upon my arrival, and it was not until I dared to touch an item that my presence was acknowledged....albeit with a condescending and rude outburst by the stores owner. \n\nI thought the furniture was vintage and original....apparently they refinish and refurbish furniture and pass it off as found vintage. I was told by the owner that most of e furniture was recently shellacked....and was not in display condition. \n\nI also had the unfortunate experience of asking the staff about several pieces I was interested in. Between eye rolls and deep sighs I was told of the inaccuracies in my question, yet never told if I could purchase the items or not. After being deemed too dumb to engage in a conversation by the woman minding the store I was handed over to the stores owner with a sigh, an eye roll, and a rather condescending \"do you want to handle this?\". The stores owner than continued to alienate and insult me, making me feel dumb and rather small. \n\nIt seems as though the storefront is a showroom for their online sales, as most items are not for sale...and anything that is worthwhile is plastered with \"do not touch\" signage. Very unhospitable for a furniture store, as I usually like to sit in something before I purchase it. \n\nI'm not going to even go into the prices, which seem as alienated from reality as the stores owner or his assistant; two ageing hipsters locked in a battle for who could be snootier or more pretentious. \n\nAside from the nasty staff, the lack of  hospitality and the god-awfull smell inside the store I would say the store was acceptable. \n\nI'm sure this store will survive, as most online customers probably don't know that they are getting refurbished furniture stored in a putrid cat-urine smelling environment and sold by condescending belittling better-than-thou hipsters. \n\n......avoid this store, check out the wonderful vintage stores elsewhere in town.", "business_id": "xWcTt1L4vQC_QkPfPBVlCw", "stars": 1, "date": "2012-10-24", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "p4nM3nMNFDqrFTh4fRsFzA", "review_id": "04EYqqejnBX4UonBUSH5zA", "text": "Being an Old School Detective, I have no choice but to go to MacAlpines to eat.\n\nIt is like stepping into the TARDIS and going back in time!\n\nGreat Coffee, Food, Soda Jerk (who is not really one) and outstanding waitresses!", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 4, "date": "2011-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f4wzdoM3utfagjgQUGvKAw", "review_id": "MY-oH12WS3QlgU9kI3gFIg", "text": "Was excited to try this place, looked like so much fun...a soda fountain mixed with old \"stuff\" to shop. The vintage shopping was the highlight, cool things from jewelry to furniture and great clothes. Can not comment on food as we only tried the shakes. Our waitress was disinterested and seemed annoyed to be waiting on us after she figured out that is all we wanted. The shake had 5 inches of whip cream, which is great if I wanted a whip cream shake, scooped it off, as wanted to try the actual shake and that seemed to further annoy the waitress, as result took forever for her to come and remove dirty things. Shake was just okay...took my dad as thought he would get a kick out of the place. His comment was \"when does the strawberry flavor kick in?\" meaning the shake had no flavor.  -if I am going to splurge on another shake though, sorry this will not be the place, giant hamburger on Lindsay has the best. And the staff are phenomenal....always friendly. Sorry wanted to like this place...the other staff seemed nice enough and I think one of the other girls noticed and tried to make better when we checked out...so at least they tried. But won't return for the food or shakes. I will stop to peruse antiques again after I eat at one of the other restaurants along the same street.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 2, "date": "2013-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "touVic_E7zgSH29CO8dL4A", "review_id": "oYAPqYIXxVUJGFYHGPDz3A", "text": "Had a James Dean soda ice cream and that's my next favorite desert that I have ever tried!", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 5, "date": "2015-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ng2dNC5Y0VpzVd097M_gLw", "review_id": "egwlyDAMIzrTO5T3Q0PRXw", "text": "As with other reviewers Dan is the man.  Saved me $100 on my phone repair.  Friends kid sat on it and bent it.  Dan replaced the cracked screen and digitizer and was able to save the frame $100 frame by slowly unbending it.  He could have just told me I needed to buy a new frame and how would I know the original could have been saved.  I think that sums it up pretty well......happy customer", "business_id": "4anyLAWqWVZh5BFpol9czQ", "stars": 5, "date": "2015-10-09", "type": "review"}
{"votes": {"funny": 5, "useful": 9, "cool": 8}, "user_id": "QKcCinWdZ_-Tff3KBNH54Q", "review_id": "2LtBbXcFNGfs1VhgSlfAQA", "text": "There are many good things about Costco and very few bad.  Let's get the bad out of the way first.  For years, Costco Tire Center was my goto for tires.  Then, the Michelin tires starting blowing up on me.  To be fair, I am hard on tires.  But blowouts are hard on vehicles, so I stopped getting tires at Costco. \n\n I can't really think of much more bad, unless you consider they keep moving the inventory around, so you are always looking for that stuff you bought last time, because it's not where it was before.  Sometimes when you see that thing that you just gotta have, but cannot really afford it?  Well, you better bite, because it may not be there the next time.  Prices are great, but you have to buy in bulk.  This is okay for things that will keep, but stuff like bread and pastries- you better really like because you are either gonna get tired of them or they spoil.  I use a vacuum sealer for stuff I don't think will last.\n\nI like that you can get more organic stuff now.  We buy as much organic as we can afford, and Costco is good for things like Half/half and eggs.  We go through a lot of half and half.  Gas?  you bet.  Always priced great. Anyway, been going here for years and I highly recommend Costco.", "business_id": "XLqnjlLYt0_q_NG7l_BpMA", "stars": 5, "date": "2015-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1_zj7B1bRgE7dC6tywUcTQ", "review_id": "wVmwEtuEMWN1CUV2W06LVQ", "text": "YELP totally missed the boat by not mentioning this place as THE BEST BIKE SHOP IN PHOENIX. I simply called them one day, knowing what I wanted: A Salsa Mukluk, Snow Bike, aka \"Fat Bike\"...  They \"had one that  needed to be built.\"  I said: \"Build it and I will come.\"  I rode out of there a couple of hours later with the coolest bike I have ever owned.  The staff was totally hip and cool and GREAT and communicating and relating to my needs as a cyclist. I would not go anywhere else.  Do yourself a favor and buy your next bike at  the Slippery Pig.", "business_id": "42Ai9wcFPE2HZ_aADGXI9Q", "stars": 5, "date": "2011-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gdoPetEmoNslU0Hf3TmuEA", "review_id": "K5nX6_940d83pL1V0qW55A", "text": "I like their variety in products, however they always have peddlers there asking for money and making people uncomfortable, but they don't seem to do anything about it.\n\nAlso almost every single time I go to the pharmacy, they never have my prescription ready, even after they've called me to tell me it was ready. One day I called it in about 3 days early, just to make sure I could stop by anytime before I ran out to pick up my prescription.It turned out I wasn't able to pick it up until the day that I ran out anyway, and even though I had called in three days earlier, it still wasn't ready! To add to this frustration, I have gone in and waited for up to 3 hours for prescription to be ready, when I was told it would only take 15 to 30 minutes. Lastly, they have the automatic prescription refill, when they call you to tell you that it's ready when your prescription runs out. I signed up for this, however they didn't call me the last time I had a refillb ready because they weren't aware it needed to be refilled, and the time before that they called me to tell me it was ready and when I showed up it wasn't ready. I'm sick of waiting here and eating my time for my prescriptions. I am taking my business elsewhere.", "business_id": "HfWkdqxegjiGEXzI8j7Wwg", "stars": 1, "date": "2014-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3Ibl0tvCENCtwyRkB37QFg", "review_id": "nKEyV2RZSNlDVpXJbwZ8Vw", "text": "Whenever I am fly into Phoenix, I make time to stop by this record shop on central ave in the downtown area. If you collect vinyl records, in particular, classic rock, soundtracks from TV and films, blues, jazz, etc..then this place is amust see..They have two locations, however the one located on central ave contains the majority of vinyl, some cds, and even cassets. The owner is avery friendly and knowledgable older cat...you will usualy find a few original rockers hanging out by the counter, discussing rock music, or just music in general. It;s a clean and well mainted (organised) record shop, one of a dyign breed. I've scored afew rarities in here over the past few years. Enjoy if you go.", "business_id": "lfysf-HycrQ7Z02HuPqgKg", "stars": 4, "date": "2009-10-23", "type": "review"}
{"votes": {"funny": 4, "useful": 4, "cool": 4}, "user_id": "UoBfwbXaixelZBghbJ2cSg", "review_id": "8xkysMf45fZvsuJBXZbe_Q", "text": "Even though I can feel all the gay boys trying to figure me out when I come here, it's my go-to place for fabulous greeting cards, dry and sarcastic, with lots of emphasis on alcoholism and dysfunctional families. Perfect for me and mine.", "business_id": "Gqq6AF9MIbhh5wwGofeiJQ", "stars": 4, "date": "2009-09-07", "type": "review"}
{"votes": {"funny": 5, "useful": 5, "cool": 4}, "user_id": "wHg1YkCzdZq9WBJOTRgxHQ", "review_id": "hwgc_OTZqcc6r-S-wwMCbQ", "text": "Thanks to Deb L's plus one, we stopped in a few weeks ago to check out drawer hardware.  It's like a virtual cornucopia of all things HGTV.\n\nIf you need handle pulls, door knobs, bath fixtures, anything hardware, this is the place to go.  Just not if you need it in a hurry as most of the product is special order.\n\nWill definitely return when we have a master bath or kitchen remodel.  These two we won't be doing ourselves.  We'd like to save our marriage.", "business_id": "legTAWPSLBTRVBvikPXATA", "stars": 4, "date": "2009-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GaplVmOArdxbhtroR4sFuQ", "review_id": "nZeMPF1ohF6eFUVQ8XGNRQ", "text": "This group is the BEST!  \nI had a 'not so good' experience with one of the 'other eye docs here in town but have found a total different experience with Central Phoenix Eye Care - the best I've seen!\nDr. Stephanie Mastores listened, discussed my options and for the first time in my life, I can now wear contacts!\nAnd the staff, phenomenal.  In fact, I ordered two 30 packs of contacts this morning and Carol from the front desk just called me to ask if it was okay that she ordered the 90 pack for me instead - for only a $1 more.  They were looking out for MY pocketbook - love it!\nI went there because of the YELP reviews and I had to YELP myself.  They are THE eye-care center I would recommend above all.", "business_id": "gztTQsgq6FJwIoV4P4RNIw", "stars": 5, "date": "2013-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wqQ-50Sjf9ol3SYaPbA1YQ", "review_id": "tVCuAz5hsottj90LvwL5NQ", "text": "Nice place! Didn't have what I wanted but would go back!", "business_id": "HgoYXFi_R2LbzYUDsa79Sw", "stars": 3, "date": "2012-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KHwkbp20fdGifaydEUq9OQ", "review_id": "ytlZwoIJB4EnPh8LQ5mnRQ", "text": "My friend and I were not only rushed most stores will go ahead and let you finish shopping and maybe say lock the door but we were rushed to be out of there right at 6 o'clock. We were in such a rush that when I got home I was wondering about the price that I paid looked at my receipt and I was charged twice for something then I call my friend and told her about it she looked at her receipt and was also charged twice. I don't know if this is a way to pocket the money or what was going on but it was funny that both of us were charged twice", "business_id": "9WVcWmfqATexHjNgc3303Q", "stars": 1, "date": "2014-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "JlCjjf4H8rs2_lkj7xWRZA", "review_id": "55xoDnp3IPraLzXsTiZlqA", "text": "This place is as bad to be expected! \n\nEssentially a warehouse stuffed with random fabric scraps, ribbon and assorted accessories. \n\nTo be honest, you better come here on a scavenger hunt, or else you will be disappointed!", "business_id": "nbO0X6SNrZWOoDQS3WQCPw", "stars": 3, "date": "2013-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gGNAr-cmCQUgA9B0QjVqAg", "review_id": "hvBoiTBsJbdmYwG4-KYhqQ", "text": "Phoenix Flower Shop did a stellar job on our bridal flowers. Every item looked just  as I had described to the florist and we were even able to pick up a few loose stems at the last minute. Excellent!", "business_id": "oUrlWqz2tkyNRcggKZWfAw", "stars": 5, "date": "2011-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uVREGLZXdueWOYljlgHsww", "review_id": "9Gx6xFG4wacIlL2wLHZtyg", "text": "It felt like a smaller location where there's a little bit of every dept but nothing really expansive. The arts section was small and the art pencils are limited or they ran out/not well stocked. I didn't find all of what I needed, but I found some. At least the workers there are helpful and wiling to take some time to point you in the right direction to get what you're looking for.", "business_id": "GrGHVKec258eN1_gtJwS1w", "stars": 4, "date": "2014-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zfysCL-0uQNCWdGvzZ6QWA", "review_id": "bWp-YlTX39jY52GQ57XrNw", "text": "This location seems to be low in stock on a few items. I went to purchase Aqua Di Gio the other day, and they were out of the smaller bottles. The whole men's cologne section looked a little bare.\nAnother thing that isn't the greatest here is the parking. The whole lot facing Camelback Road is a total cluster. I started parking on the other side, by Fry's and PetSmart, and it's been a little better. I only stop at this location when I'm in the area.", "business_id": "BHFBi9eEQqzh8QaUYyngjQ", "stars": 3, "date": "2012-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "vGj7Dmd3aSNxmfraIQ7THg", "review_id": "7pGmLruEnkm8DFaUeYPy4Q", "text": "Worst Best Buy ever.\n\nI just had an employee there throw a temper tandrum because I asked him to call someone who has keys to the mobile locker over so I can buy my item.  Treating customers like crap just because someone asks if they can buy something?\n\nMethinks not.  Never again.  NEVER again.", "business_id": "kEqcAtMaC6hcY8Wbi1nxtA", "stars": 1, "date": "2009-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "5hIcclyqd9yelg2BlsiXBg", "review_id": "7fyYxF0hbJ6gSjuWVUOAsA", "text": "On an incredible furniture hunt these last few weeks for a couch we searched high and low, east valley to west valley, central Phoenix to north Scottsdale and even online then finally we found a wonderful collection of comfy great made furniture.  We had specifics and yes our taste comes into play which is why I was hesitant about going to Copenhagen. I really had in mind that Copenhagen was going to be overly priced and way too modern for my taste.  I was wrong.  It definitely is modern but they offer pieces that have a great balance with modern and semi traditional.  Their leather choices are fantastic from color to grade.  On top of that, the service was phenomenal.  The sales people were not pushy at all and when we were ready to work with someone she was extremely knowledgeable and patient with all our questions and concerns.  I would most certainly recommend this place for their selection, service and quality.  One warning:  some pieces can take up to 4 months to get!  UGH!  So if you're thinking of buying something in the near future, start to look sooner than later.", "business_id": "qRllNpkNjFFj7sPlQkV1mg", "stars": 5, "date": "2011-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0vJG6lPDdyDweBpfxN1L5A", "review_id": "DaXbSk7l9MQykR2cupHUSg", "text": "The staff is knowledgeable about shoes and if you want someone who knows what they are doing to help you. They treat every customer with full attention. I have gone there to purchase tennis shoes. Salesman was friendly and provide me shoes fit my feet, nice look and with reasonable prices.", "business_id": "P6H-p8fXbPq8VjO4kLTz4A", "stars": 5, "date": "2012-10-15", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "EP3cGJvYiuOwumerwADplg", "review_id": "iAq6a0R5vKdBl7vLSDg3BA", "text": "I saw reviews for this place and realized that it was where I got my wife's wedding ring.  Wow, what a great little family owned business that has a great selection of jewelry at a great value.  This place doesn't do well because it is at a great location it does well by its customers and has been in the area for year.  I discovered it going to Nicoli's Italian grocery next door when I lived in the area.  Check it out and you will see the great people that work here.", "business_id": "xaWje-dMVpAEQQMKv9556Q", "stars": 5, "date": "2011-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "EG1DRLG5ehpc86B4Cqzqag", "review_id": "4bXIV-rT6IQqLXKGI1KFlA", "text": "I stop in every week to check out the treasures.  I am reluctant to brag about this place for fear you may beat me to a rock'in deal.\n\nSeriously, it is one of the best places for furniture.  Granted, it is hit or miss but when you find something it is grand.", "business_id": "n7snytnuDnAWmGb60YUl7g", "stars": 5, "date": "2014-11-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FA-FuMOLNse3nKk9Ymgckg", "review_id": "IWV-s37Tw4WHC-_A4Id2XQ", "text": "I just moved to the Valley as a retiree  and wanted to sell a high five figure amount of gold & silver proof sets.  I've collected coins since I was 8 years old and had a pretty good idea of what the market would be for this particular collection.  After a quick phone call to C&C to determine their level of interest, I was invited to the shop to let them examine my coins and price them out.  We set up a time and day that was mutually acceptable.  The shop was closed on this day of the week to allow staff to work up their inventory and other duties, so we had complete privacy during the transaction\n\nI dealt mostly with one of the owners, Ken Moon.  Ken was very open about pricing and grading and we had a pleasant morning discussing a broad range of topics, some of which was actually about the value of the collection I was wanting to sell.  Subject to examining the sets, Ken made me an offer that I felt was more than fair, and we closed the deal on a handshake.  They examined the items, confirmed grading, and there was no backtracking on price. He cut me a check and the transaction was concluded.  Simple as that.\n\nTo be honest, when I walked into the shop, I expected the usual \"beat down\" on price that dealers usually try to get the price down.  That didn't happen.  Ken showed me the spot prices, made adjustments for the numismatic value, and quoted me an offering price.  It was fair and there was no haggling.  \n\nI highly recommend C&C Coin and Stamp.  I don't usually bother to write up these kind of reviews.  But due to the high level of professionalism and unexpected transparency of the process, I wanted others to know they can deal with these guys in confidence.  \n\nDoug L\n11-19-15", "business_id": "_yPLHvbeRcFazrUusCNHKA", "stars": 5, "date": "2015-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HbACMtumZWXxhYpnnMms2g", "review_id": "Ivwkyxf-7KccAveAAuegqg", "text": "Super fun place to shop for high quality clothing and accessories at bargain prices. They have a large selection especially good for work clothes lots of suits and dresses. Good selection of evening clothes as we'll. beautiful jewelry too. Other locations in town a fun day to bit them all.", "business_id": "OkRzw22eDg45do8i-1jHow", "stars": 4, "date": "2013-10-17", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "HFzQ3xFlSwPlZeYkDzWwFg", "review_id": "kepkWNL6DZG5Ykr5lIkaig", "text": "Went to Saks over the summer couldnt get help from anyone yet it wasnt busy. If you dont look like a million bucks dont run inside here! They wouldnt throw fire on your burning body!", "business_id": "9dvuzmf1oF122Y4cZepRVA", "stars": 2, "date": "2008-11-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vsqOgW24DbDiH66jgztcpA", "review_id": "vIuXr-s1oI1C0K3vaSElQg", "text": "This is one of those reviews where I wish I could give more than 5 stars!!\nGoing to your local cell phone provider can sometimes be a very stressful situation, and personally, I always think there is a conspiracy to screw the customer over. Not the case this time!\nWent in around 6:30PM one evening just to talk about what my options were for upgrading my phone. We were greeted immediately upon entrance and helped by Monique Perez (who I actually saw mentioned in an earlier comment as Vania - both names are on her card). Monique was, for lack of better words, AMAZING! She was personable, knowledgeable, and very helpful every step of the way. She explained to me all of my options, gave me breakdowns of prices, and suggested the best steps for me to take to get the best deal on my upgrade. They were out of the GB size phone I wanted, so she gave me her card and told me to call her the next day and she would check for any shipments that came in. I followed her instructions and was happy to hear that the store did receive stock the very next day. Monique informed me she would be working that evening - so I stopped back in again.\nShe was warm and friendly from the very beginning until the very end, even staying with me past closing time to finish everything and walked me out the door.\nI was very impressed by her professionalism and patience with my account and questions (as I mentioned, I am still a skeptic, so I threw a lot of questions her way!).\nNot only would I recommend this Sprint location - but I give my absolute highest recommendation for Monique!!! \nThank you, Monique, for easing my nerves and making my experience painless, fun, and rewarding!!!", "business_id": "N6ff0yyo9Cv_7XPz-YDoow", "stars": 5, "date": "2015-10-22", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "HtLIKSlKoKoxv86ozIIX7w", "review_id": "3msKALlhH-T4MRF6cAvcyQ", "text": "This place rocks! I went in this morning to get a new head unit for my car, I already had something in mind but they didn't carry it. This was fine because they found me something that did exactly what I wanted and actually saved me some money. And who doesn't love saving money?\n\nThey started on my car right away, had it done in no time and installed beautifully. They even mounted the Bluetooth mic in a great spot and didn't leave any visible wires.\n\nI will definitely be back here to get everything else done. Low pressure sales that focuses on getting you what's right for you and not what makes them the most money. Combine that with quick expert installers and great prices and this is by far the BEST place in the valley to get your audio hookup", "business_id": "xI_iG7X6BcdLtj57bkUOqQ", "stars": 5, "date": "2011-09-14", "type": "review"}
{"votes": {"funny": 13, "useful": 9, "cool": 10}, "user_id": "QKW7sYPWPSsIcWqSiDzChQ", "review_id": "gFEAiHNoTPoDCcd2wnDDcQ", "text": "i use an Apple\na mac every day\nthey say, keeps the virus\ndoctor away\ni love their laptops \nalu alloy case\nbought my first apple II\nback in seventy-eight\ncame in for a macbook\npassed on mac air\nwhen the super cool genius\ninside of their\ncompany store\nbiltmore, a z\nfinally, got around\nto waiting on me\nhe started in with his\ni'm cooler than you\n\"dude, I work at apple\"\nsmug attitude\nbig whoop, big fella\nseriously, why?\nsteve jobs started apple\nyour job's,  jobs'  sales guy\nin your skinny jeans\nthe prereq hip glasses\nand your little lanyard\nyou're fanboy, mactastic\nso don't condescend\nbelieve it or not\ni came in here knowing\nexactly what I want\nso go fetch me my macbook\ncanon wireless printer\ntime capsule back up\nthe jbl speakers\nthat's it, run along\nshoo, bye, off you go\ntake your disheveled hair\nand red t-shirt in tow\ni'm the easiest sale\nyou'll make here all week\nI hardly let \nthe Apple geek, speak\njust gave him my amex\nhere, swipe my card\npulled round the  back\nand they loaded my car\nso the lesson, I guess\nis know what ya want\nor prepare for the hourly\ncultist to flaunt\ntheir apple too-cool-aid\nup and down your face\nyou'll hardly feel worthy\nthat they let you grace\nyourself with their presence\nit's slightly obscene\nbut the reality is\nand I hate to be mean\nwhen it's all said and done\nat the end of the day\nyou're a dork selling iPods\nget it? got it? okay.", "business_id": "l5vzFaqSjvxZiRn0MJeKkg", "stars": 2, "date": "2009-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "O-b5xwRMao3ksVBmuL6jnA", "review_id": "agnq7eF3VRS-8NLl9uSlTw", "text": "I really wish I was able to give this store negative stars because the deserve it.  Every time I go to an Apple Store I feel like a head of cattle.  They honestly don't care about their customers even a little bit, it's all about good marketing to sell their products then when they malfunction they do everything they can to keep from fixing it because that would cost them money.  I have Apple plus, insurance that I paid for in the case that my phone needed fixed or replaced.  That was the case when I went here and not only did the jerk who was supposed to be helping me fail to do so he also made my phone worse.  Then he blamed me for the phone not working after his solution didn't work.  I truly loath Apple just based on its stores.  I wish I could leave them but I have so much sunk cost between the Mac book, TV, iPad, iPhone that I'm not better off leaving.", "business_id": "l5vzFaqSjvxZiRn0MJeKkg", "stars": 1, "date": "2014-10-10", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 3}, "user_id": "kffxYQVQsEpF1DVlQlcGCg", "review_id": "kYFzmcbHyFrjfmgRfby9sQ", "text": "I visit a lot of Home Depots. They  do carry a lot of things made in China, which is not always good when you are trying to build things. They won't last.\nSo the solution to that is you must read the labels.\n I do purchase a lot of Items here though. So they must be doing something right!\n The very best thing about Home Depot is the great return policy.  If something breaks, or you bought too many, or it is just not right they take it back. WIthout a lot of drama. I really like them for that, and that is why I really like to shop here. \nLots of parking in the lot. The staff is very helpful and friendly.", "business_id": "DC77ROlgfnpxQNFKQbbpnw", "stars": 5, "date": "2012-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 3}, "user_id": "PNS9z4aFDbfhpIsHCfNvNg", "review_id": "JSWyEGmyqWxGyMSSP5m8Qw", "text": "We used PaperJoy for our wedding invitations and programs. Lydia, the owner, was a Joy (no pun intended) to work with. She was willing to stay late to accommodate my work schedule and was quick to respond to each email. \n\nThe best part about Lydia, was that she was very conscientious of my budget and helping me eliminate extraneous costs without losing the look I wanted. I came to Lydia with a vision of lace on my invitations and she was excited for a new challenge. Together, we created beautiful invitations and programs. Everyone commented on how custom and unique they were. PaperJoy's prices are beyond fair for the type of custom attention you'll receive. If you're not looking for a \"cookie cutter\" look definitely stop by PaperJoy. I can't wait to work with Lydia again for other paper needs.", "business_id": "mG5WTamjKzje897WkCXiTA", "stars": 4, "date": "2009-11-18", "type": "review"}
{"votes": {"funny": 5, "useful": 4, "cool": 3}, "user_id": "UoBfwbXaixelZBghbJ2cSg", "review_id": "Gt20CcHY6fOmDhVS5KMD0Q", "text": "You'd think with its proximity to the chi-chi yuppieville that is Arcadia, this Target would be... well... not so ghetto. This one is actually worse than the one at Christown (oh, excuse me, \"Spectrum\") Mall, and that's saying something. We'll be saving this location for emergencies only.", "business_id": "VxnV1uMZURUQMNUaPdB8QA", "stars": 1, "date": "2009-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_EfzVg1nt_dWCYgpcgn9BQ", "review_id": "A1HsD6Er6Qq9e2O378uc1g", "text": "Fast and courteous service. Fast as in one hour.  The big draw is convienance but the con is price. I love my frames but they were 80 bucks. It costs me 50 to replace One broken spring hinge.  A week later the other spring broke and he will charge me 50 again. I asked him to replace both usally when one breaks so does the other.  So the pro is rapid same day repair. Con is $$$.  But at least you have options!", "business_id": "gUt1OMval0UORqUCZomPjA", "stars": 5, "date": "2014-11-27", "type": "review"}
{"votes": {"funny": 7, "useful": 9, "cool": 13}, "user_id": "QKW7sYPWPSsIcWqSiDzChQ", "review_id": "ykhZBKYe0XchPrrwdaW6Xg", "text": "kids, i thought it, about time\nto tell, a little, nursery rhyme\nnot about, that candle maker\nnor the butcher, but 'bout Baker\nNursery, down on, fortieth street\nthe lucky ones, that got to meet\nfounder, master,  gardener Jim        \njust passed, now daughters, run for him      \nno differently, than '68\nflower power, watergate\nwar and peace, Jim bought the land\nwhere, to this day, his nursery stands\nworked it  with, his wife,  six daughters\ndeclined, fat, developer offers\nchose to peddle, plants, instead\nto fill, arcadia, flower beds\nand veggie gardens, his seeds we've sewn\nsold trees, who's roots, have caught and grown\nnow shading, front lawns, 'cross this town\nthe monsoon blows, a branch comes down\nbut still, the trees, are standing strong\nlike Baker did, four decades,  long\nwe've bought from Baker, twenty years\nand watched, the 'old way', disappear\nin a town, where progress rules\nscrape, then stucco, buyers drooled\nat grabbing, their piece, of the dream\nbut Jim stood pat, while builders steamed\nand coveted, ten acres, prime\nnope, not selling, keep your dimes \nand dollars, still, Baker remains\nBaker's, green acres, looks the same \nhelpful staff, laid back pace\npart of the charm, neighborhood place     \nphoenix oasis, sittin' tight   \nso go buy local, you just might\ndiscover that, your thumb is green\n\"plant your roses\", remind to \"feed\ncitrus now\", drawn on, frost cloth\nthe old sign weathers, paint peels off\nstill planted, firmly, in the ground  \nTarget, Home Depot, circle 'round\n'garden departments\", therein's, the rub\nthey wouldn't know, a ladybug\nfrom an earth room, Jim Baker did\ngave rocks and flowers, to my kids\nand taught them both, a thing or two\nbout insects, plants and taught me, to\n \"do what you love\" , his legacy\ngodspeed, thanks for, your nursery\n\nJim Baker passed Aug 31, 2009.  He was 86.", "business_id": "7p0OI2Ld46-EzJkRHGQEJQ", "stars": 5, "date": "2009-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "Fy06Jb9BZuSUow2CGEOWTA", "review_id": "4E_7i_wIXApRvlhXikJZLQ", "text": "Awesome, great store and service! You are now my furniture. I went to Pruitts to look at  dining tables but my eyes betrayed me...they wandered to  look at a beautiful, fluffy, comfortable mattress whispering zzzzzzz's to me. I sat down, bounced a bit, then a salesman came by...i felt the hair on the back of my neck raise as I was about to tell him \"i'm just looking\" (leave me alone), but before I could get a word out he said \"It looks like you want to test out the mattresses, my name is -----if there is any thing you need I'll be near by, just let me know\"  and he walked by. Oh?....I wasn't sure how I felt, a bit abandoned?  shocked,? but atlas I... I felt a burden lifted, I was free I could lay around, avoid the chit chat and discomfort of knowing a sales\"man\" was watching me roll around on a mattress. Two and a half, yes, 2.5 houre later I walked away buying a set. I love my new mattress. Now my next purchase is to find that dining table, wow, what a selection of styles and price ranges, It gives me lots of options, I like that.! THANK YOU Pruitt's!", "business_id": "XThGLVVN4oVybmv2gFS1Wg", "stars": 5, "date": "2012-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9YzMT2qm-p0sb0hQ_zQ8HQ", "review_id": "daufaZ2u0A4EU17-k_s_QA", "text": "After buying a vintage bike to restore for my girlfriend and on a recommendation from a co-worker, I decided to give Bike Barn a shot. Rich, one of the mechanics helped me get some bearings for the headset because one of them was completely rotted! Luckily one of the original ones was still in great condition. I told him I'd like to replace both since I'm re-doing the bike. He said he didn't have those exact ones but had some that will work perfectly. He went to the back & picked out new bearings... Got home and nowhere near close to fitting! Asked him some more questions about other pieces I'd need. He seemed completely annoyed at the questions I'd ask & just working there in general. Seems like he just wants to get through the day just to get to the cold brewskis in the fridge at home. The guy with the buzzed head & lady that work at Bike Barn are super nice. Unfortunately, by my first interaction here I will not be going to Bike Barn any longer I'll take my money over to Landis Cyclery.", "business_id": "pU2yeKn-NNJnbMLuFfAXBQ", "stars": 2, "date": "2013-10-20", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "5SfiUP1BkvpESGQUgifEJw", "review_id": "Z6ErR2K2d1dFS2nqr4vr6w", "text": "Stopped by here recently with my mom to look for glasses for her. The salesman then proceeded to tell my mom her current glasses were \"out of style\" and kept forcing her to try on pairs of glasses that were totally not even close to what she wanted. He was somewhat helpful, certainly brutally honest, but a little too clingy and swearing while trying to help us was not a plus. They have a interesting and trendy selection, but we had a hard time actually shopping through the salesman's many unhelpful comments. Needless to say we will not be back if we have a choice.", "business_id": "oE6iNXWpo9XxAWm-CGvcww", "stars": 2, "date": "2013-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tXGAxQanGXeDgePYkTosMg", "review_id": "g84QiwUwTJCbLPoj3k5P1w", "text": "My daughter and I went shopping for a dresser for her room on Saturday and found a dresser at a furniture store on Bell road but it was all scratched up and I told her we could shop again on Sunday. Then I thought to look it up on yelp and this place came up. It's a very cute store on cave Creek Road. It had alot of antique stuff. My daughter found a real az style dresser for $95 plus tax. The owner was so helpful and very fast in getting the dresser ready for me to load it in my SUV.We did this in a matter of 20 minutes. I would recommend this place to everyone that is starting out and moving out for the first time.", "business_id": "lH-S5wD90s6hKtUpkFx43w", "stars": 5, "date": "2015-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qYCAR7Q4u6xvAWLVR56W3A", "review_id": "7lJWbN_vXvUnkrSSebS1Pw", "text": "A huge monsoon storm came through our neighborhood a few days ago and uprooted mature trees, knocked over walls, a semi truck, and generally caused a huge mess.  Luckily the mesquite tree that Whitfill planted for me 2 months ago was staked and didn't uproot, but did fall down to about a 45 degree angle and one of the stakes snapped.  I called the next day and Whitfill Nursery kindly agreed to come out within a few days and stand the tree back up and stake it again.  They came today (2 days after I first called) and added lots of stakes to get us through the rest of the monsoon season, and the tree looks better than ever! Now that it is upright again I can see how much it has grown (tall) and filled out in only 2 months.  I really appreciate them standing by their warranty even though damage due to weather is not explicitly covered.", "business_id": "pCvl0km6v3Imcpq5UV_-UQ", "stars": 5, "date": "2015-09-03", "type": "review"}
