{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2cQrK_qA2DGZQcjlTTdKFA", "review_id": "Z36WR8G0o7L9i2CUGwidFg", "text": "Minerva has awesome cakes! They are cash only. Stop and pick up a delicious cake! I have been enjoying this bakery my entire life!", "business_id": "hnHt6EinzC-IX6y3GSF7jw", "stars": 5, "date": "2015-10-04", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "es9l0E8GJT4eWyCTSU4C2A", "review_id": "-OmtfMU-RY_SL6ytxb2XzA", "text": "I walk by this place every Wednesday, and until today I had never poked my head inside. I was super hungry, it's raining, and the store smells SO GOOD, so I couldn't resist.\n\nThe person helping me was super patient and nice while I asked about basically everything in the case (checking for gelatin, you know). Also, they take credit card!\n\nAnyway I settled on a pumpkin roll, which was amazing. First, the slices are huge. Second, the ratio of cream cheese frosting to cake is high, but I love it like that. Third, the flavor overall was perfect, not too sweet.\n\nCan't wait until next Wednesday!", "business_id": "YMEtEsUDQKOYJOcE5Fx3gQ", "stars": 5, "date": "2015-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cSWE541AsNf3O5Rbm_N--w", "review_id": "1VoULdg4dxfHgZYRqy47mQ", "text": "It's open again!  Same great donuts as always (and a lot brighter inside!?), glad to see a good guy was able to make it back!", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2015-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J0imael6hKgpRrmXkjPi2A", "review_id": "y3C0mhG-9_1DU0vAXKSn1g", "text": "I tried both the beef shawarma and the falafel sandwiches at this place. It's both a food counter and a middle eastern style deli/grocery. The service at the food counter was slow and impersonal, but about what you'd expect from such a place I guess. \n\nI wasn't super impressed with the shawarma. The beef was tough and it felt more like a gyro with tahini sauce instead of tzatziki sauce.\n\nI enjoyed the falafel sandwich much more. The falafel is freshly fried and while not the best texture was very flavorful with a nice crunch. The pickles on it were actually pretty good even though I'm not a pickle fan... Definitely house made and not soggy. The other veggies as a lot of flavor, although the overall veggie to falafel ratio is a bit off. Still a very tasty sandwich, though.", "business_id": "gCiKiqPGAC_ZVt5bBcwnrw", "stars": 3, "date": "2015-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Tlc7887fNtZ5iV36WAw_pg", "review_id": "qZzwYzdpmRKTqoxlLFm6Mw", "text": "Bagels were okay and they had the usual assortment of flavors. Cream cheese flavors seemed lacking- not much flavor.\nI like that it is a local bagel place. \nHowever, I find it in bad taste when an establishment changes their prices for those using a Groupon or other coupon. I am using the coupon (which your store issued) to save money and then they increase their prices for those using the Groupon!", "business_id": "LHyGQnuWR2q44bsrw1ZLAg", "stars": 2, "date": "2012-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_QNlHdi44k2qbRXAD2ZLZA", "review_id": "m-_KZm0E3F0kLaAsWBx_9g", "text": "So glad I popped in here! I love local bakeries and this one is tremendous! The almond torte is too die for! Also sampled the cookies and cream, red velvet and peanut butter. Ranked:\n1. Almond torte\n2. Red velvet\n3. Cookies and cream\n4. Peanut butter (wasn't anything super special, but the flavors above were superb!)\nI binge are three & didn't feel guilty.", "business_id": "yWVY1Bq19lDxu3BP7_96EQ", "stars": 4, "date": "2014-11-12", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "8ED8BPCXKXZnGsVMyl5Bhw", "review_id": "qdQDN6aiR5NriREK-aLrCw", "text": "Yum!\n\nThis place is dangerously close to my house. I sometimes go on this horrible milkshake binges, and Maggiemoo's is fresh and delicious at a great price.\n\nThey've got a great selection of flavors, and they ice cream cakes are fantastic. It's also nice to be able to get the ice cream cupcake...you usually think of ice cream cakes as being for special occasions only, but the ice cream cupcake concept lets you just get one whenever you want.", "business_id": "IQbEYPh7OKoUmsI6VoLmTw", "stars": 5, "date": "2008-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "bx0Z2NaQplL3dfj3KfxNEA", "review_id": "xEbLWz5UeC0o1_lkSzxteQ", "text": "On very short notice, I called Clasen's Bakery looking for a Black Forest Torte or something similar for my husband's birthday (it is his favorite dessert). They had one but it was frozen. They offered to take it out of the freezer and hold for me as it would be about 3 hours before I could get to the bakery to pick it up. This worked out perfectly for us to enjoy the treat later in the evening on his birthday! The torte itself was delicious. Even my kids (normally very picky) enjoyed it! Thanks Clasen's for making the birthday celebration a hit!", "business_id": "YaaQx4qt1f36iFT4TWivAw", "stars": 5, "date": "2015-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "LkmcnJNBfnvaZk6MoE_k5w", "review_id": "kk1_UHGc28fgsA7JGoLipQ", "text": "I've been coming to this Perkins since I was a kid (popcorn chicken and Where's Waldo? activity books FTW) and while my last visit was not so great, they're generally a reliable location. Most days the food is tasty if unimaginative, they can accommodate groups, and they usually can get you in and out pretty quick despite the lobby being packed to the gills on weekend mornings. \n\nFor the last few years I've avoided Perkins on the whole because of sub-par food and service from another location (an annual stop after a camping music festival due to their being open on holidays and ability to seat 10-12 of us with no reservation), but my man friend really likes their breakfast and, more specifically, not having to wait for breakfast like you do at most places downtown. Over the summer I had an avocado/queso/english muffin creation that actually really surprised me with how good it was and breakfast potatoes that were clearly deep fried but similarly surprising in how much I enjoyed them. The breakfast combo price was right ($8ish dollars), and for some reason one of the available sides was a muffin, so I came away with breakfast the next day, too. \n\nFast forward to a couple weeks ago when we stopped back in. Sadly, my breakfast find had disappeared from the menu and they appear to have done away with the bonkers muffin side. Nothing was really striking my fancy on the most recent menu, so I decided to pick one of the most ridiculous offerings, an apple cinnamon muffin that was sliced into thirds and turned into french toast. I'm sure it was terrible for me, and while the flavor was surprisingly good, muffins just aren't stable enough to hold up to being battered and so it was kind of mushy mess. Compounding my meh meal was the fact that it took close to 40 minutes for our food to arrive, tracking down our server was difficult, and my appetite was put off by how dirty the ledge under our booth was. We were seated in one of their tiny (but cool) two-person booths along the window and with the morning sun pouring in I could see all the crumbs, bits of paper, and rusty bobby pins on the window sill. If anyone from Perkins happens to read this, please, please clean that up. The fact that the pins were rusty tells me it's been awhile since a vacuum has made its way to that area. Yuck. \n\nWhile my most recent visit was definitely a two-star experience, they've been just fine on other visits so I'll leave my overall rating at a three. Not the best choice in Madison, but a reliable stand-by on the whole.", "business_id": "yYIEKwgQUHJpySOcVdCAkg", "stars": 3, "date": "2015-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4yv4bQSnx2R2kzeSo0XJwA", "review_id": "MihdcMOC1jSGKUd6V8aXBw", "text": "Everything about Zoma is, uh, OK. The coffee adequate if not excellent and not roasted here. The space quiet, if not warm. The chairs mostly comfortable but tables wobbly. It's not dirty, but not exactly spotless either (although I accept that for any coffee shop). On most visits, the counter staff are friendly and the outdoor space wonderful. I don't eat many treats here, but they smell terrific most days.", "business_id": "UV9c6A16IXXA7JmkTor8Tg", "stars": 3, "date": "2011-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "smmOtecDCdqyVoS9kOauSQ", "review_id": "HQQyhCvmK8RimdXCf40-nA", "text": "This place always runs out of items on the menu. I've ordered the chicken fried steak twice and it never comes with the fresh bread they advertise. In this visit alone I've heard the waitress tell two tables they didn't have baked potatoe or a breakfast item. Our waitress appeared lithargic and took a long cigarette break while all her tables waited on her and the cook. It was bad enough she didn't check up on her guest often enough. The team leader is no better. She's helped us twice before. Never smiles. its enough to make someone depressed. Luckly the food they have is great on an empty stomach. Love the unlimited hot coco. Avoid the water. Tastes like algee.", "business_id": "SZvYxcvYYVRue9MXcEDjsA", "stars": 2, "date": "2010-09-30", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "saiZmxzBIowJbMgPBW1Now", "review_id": "S2UereyRmREted9Mp7H65w", "text": "Whenever there's a special occasion, my fam and I head to Asahi Bakery for traditional Asian cakes.  It's basically an airy angel food cake with light whipped cream and fruit in between the layers and on top.  It's so good!  They also have yummy pastries and cookies.   It's pretty inexpensive and def. worth a visit.", "business_id": "Tr3EsurgHqGPTXwAfjZ04Q", "stars": 4, "date": "2010-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WXi3Ulga_migZyvAUZdNCQ", "review_id": "u8fJF4cJoyYfTmuwN_8aLA", "text": "Au Petit Four was a fabulous lunch find! Located in the Esplanade, its tucked into a nice spot behind Houston's. Simple Decor, nice patio and plenty of tables. Lunch was so tasty! I ordered the lunch combo, 1/2 a cold sandwich and soup. The soup was a minestrone and it was so fresh! The noodles were nice and firm and there were tons of vegetables and beans. For the sandwich I ordered the Prosciutto & Brie and it was awesome! For 2 lunch combos, 2 beverages and 2 pastries the total came to $31, not bad for a fabulous french lunch! I will definitely be back :)", "business_id": "wftoNIA0Q8nX-Da47psBCA", "stars": 4, "date": "2010-09-18", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "_7el1cOgnfkNfmZKi277bQ", "review_id": "j-E9HkhDXY3UU7hraMkzhA", "text": "Let me start by saying yummy! Barb's did a fantastic job on my birthday cake! My sister ordered me a 4 layer magical marble cake with Grand Marnier filling and Butter cream frosting! It was sooooo moist and flavorful! In my opinion and several of my guests it was a much better tasting cake then Tammy Coe. It is less expensive as well. I also received a Red Velvet cupcake. It was the best red velvet cupcake ever!", "business_id": "vv1uvJRBUqi707TA5GuhCg", "stars": 5, "date": "2009-10-19", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 3}, "user_id": "k4-6lakq7t3kCgbvPxcuvg", "review_id": "aCwVnpIGDl6w9dNJGC3gww", "text": "I came here and got a cake for my teenage daughter's 18th birthday.  I meant to make it special and bake her a cake, but we were leaving for Disneyland the next morning and I simply ran out of time to contend for the 'Mom of the Year' awards in my house, so I did the next best thing and I went to Barb's Bakery to get a cash and carry cake.  \n\nSince there were only 6 of us at her little party I opted for a new offering at Barb's; miniature 6\" cakes for around $12.  It was a beautiful, pure white cake with elegant white roses and piped drapes and beading.  It was a sight to behold in its monochromatic simplicity!  My daughter was very impressed with her tiny creation in pure white.  \n\nThe only drawback about the cake was the taste of the frosting, it didn't have any kind of a special flavor, like Barb's cakes normally do, it was just plain and sweet.  Not even a vanilla flavor.  This seems odd for Barb's so I'm almost wondering if someone forgot to add vanilla flavoring to that frosting batch?  If it's on purpose then I'd politely suggest adding some kind of extract to the frosting as it just needs something more to really take it from a simply 'good' cake to a 'delicious' cake.  \n\nJust my two cents!  Otherwise my little cake was perfect and my daughter thought it was beautiful, thanks!", "business_id": "vv1uvJRBUqi707TA5GuhCg", "stars": 4, "date": "2013-10-21", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 3}, "user_id": "4ozupHULqGyO42s3zNUzOQ", "review_id": "qRx72fNRlVZepbBfLnvs_A", "text": "Never fear for Tammie Coe's cookies and cakes are still near! I nearly cried when I found out that Tammie Coe's cakes and cookies wouldn't be served at LGO anymore, but then I realized that I could still visit the bakery for my sweet tooth fix! Phew! I absolutely love her baked goods. Recently, I purchase a package of her burger buns for burgers and they are fresh, fluffy and tasty! My go-to treats are her delectable cookies, especially the chocolate ones and the apple cinnamon cookie. The apple cookie has real apples in it! Do yourself a favor and find a way to try some of Tammy Coe's delicious treats!", "business_id": "bsEJKduEgoBhNNNHO4ZHEw", "stars": 4, "date": "2012-10-26", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "RY6ocH_WKWjTaKXNiY8opQ", "review_id": "9r1OXSmDSKDgjI1xziDJrg", "text": "I wish they had this type of place in the bay! Extremely cute grocery store where you can pick up a bottle of wine to enjoy with Sunday brunch. There were fresh baked goods, fresh squeezed OJ, freshly made salads and desserts galore! I ordered the croque madame and enjoyed it so! It's pretty crowded on the w/e, so come early & have a friend save a table. They're pretty organized so the line moves quickly and cashiers are very friendly :)", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 4, "date": "2009-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "p0YBicqzx7sS5pmRxHCVKQ", "review_id": "k7HxGMgabFxDUi2XWZ_hOg", "text": "Always Fresh, healthy, upbeat.  Great iced drinks, sandwhiches, etc. Kid friendly, clean, and nice market inside.  Decent vegan menu.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2011-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f01B5tRtqf3k6ak1pPSAWw", "review_id": "BMWmWseEMriEcujBk1OkEg", "text": "Adorbs!", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2011-11-29", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "xY0SP85UvAeoGjneF-gQew", "review_id": "l_JqoGpi0MtYq9Xl8H3eWQ", "text": "Love this classic Arcadia eatery, store, pizzeria concept. Food is consistent, items in the store are always changing for the seasons and they have really cute things. Now it does get crowded and they can get a little unorganized, but for the amount of people they serve, they do a great job. My one complaint about this great place is cleanliness. when you get your food you have to grab your own cutlery, fill your ice tea, get your own coffee Etc, This station is always dirty. When I was there yesterday,I literally had to sort through the cutlery to find a clean fork and knife. They were washed but no polished and there were chucks of old food on them.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 4, "date": "2012-11-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OUME1h-3AfZTxx2EpD_MZg", "review_id": "kqbL1mLCkS9VPfq4anQUlA", "text": "LGO is a classic place to get a quick bite that's going to be quality.  Here are my favorites: \n-Iced Coffee\n-poached eggs and english muffins\n-any of the salads, burgers or pizzas/wings\n\nThe Reuben sandwich is great too!", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2014-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zPRtdWqscEpfFXQYFR-e_Q", "review_id": "7_LgkMlwraUtGGsHcWVgVA", "text": "Get the bakery brownies, go now and don't hesitate, you will not be sorry. They have sea salt and sans salt, I get without because the salt is overpowering. A good brownie is tough to find and LGO has it. Buttery and rich.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2015-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5DN8w4c2MSKoh4-Q8GMeTw", "review_id": "mBi62SUkBrCFMDhB4KWSfQ", "text": "From desserts to gourmets sandwiches on homemade artisian bread this cafe has much to offer. The ladies who own and run this place put there heart and soul into making your meal unforgettable. They have  nice patio dining for these gorgeous fall days and a drink and treat station for your for legged family members. Help keep the mom and pop shops to survive and give them a try.", "business_id": "j5HLcBru7FEirYJPbKFVWA", "stars": 5, "date": "2012-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Pv7DGHzZ-uqIUdOsqPpsVg", "review_id": "38AMztFUTmU8y3VLRWJL9g", "text": "Stopped into Breadcrafters for a quick lunch on a Saturday. They were moderately busy but not packed. Looking at the prices I assumed the sandwiches would be quite large and I was right. My boyfriend and I split one and for a light lunch the size was just right. \n\nWe split the club with a side of pasta salad. The bread was fresh and soft and the ingredients were plentiful and fresh tasting as well. While the sandwich was big, the side was not - even for a single serving. I felt like they kinda skimped a little on the pasta. But what was there had a good flavor - a pesto sauce of some kind I think - with olives, red peppers and mushrooms. \n\nWe sat outside, the patio was nice and relaxing.\n\nOverall I'd say it was good but I wasn't blown away. I'd like to go back and try a different sandwich and side to see how it compares.", "business_id": "j5HLcBru7FEirYJPbKFVWA", "stars": 3, "date": "2015-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XM3MccvY9gEQIGH7GUGw0A", "review_id": "bzw07oqJhRsoWQwNHc1cPg", "text": "Terminal 2 @ PHX...it was lunchtime and we'd just come through security.  Decided to get lunch and did a \"pick 2\".  Seriously good food, especially for airport food.  We got 2 - 1/2 sandwiches...2 1/2 salads...it came with a cookie for dessert and it was under $16.  I often wonder who the people are that give such bad reviews...or maybe I'm just too easy to please?  I don't think so.", "business_id": "Cm1jT60fxb1DjwpqjWJ8EA", "stars": 5, "date": "2014-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SLvZfeCztX7QaNbJs_7ikQ", "review_id": "k35RWHP1xgAsqU8rfqgkxw", "text": "After a long trip to the nearby Hobby Lobby, I was looking for a treat before my 25 minute drive home.  Nothing Bundt Cakes is conveniently located amist all kinds of shopping. When I walked in I was greeted by a young girl with a smile, who seemed to really want to help me get what I needed.  They had samples of their flavor of the month, which was White Chocolate Blueberry.  Absolutely heavenly!!  I ended up buying 3 of the bundtettes.  Chocolate chocolate chip, white chocolate blueberry, and cinnamon swirl.  I go nuts for anything cinnamon, so that was a front runner for me.  Perfect balance of cinnamon and cake.  Chocolate one was just a little too chocolately for my liking, but moist and tasty nonetheless.  The -1 star is only because I think they are a little pricey.  But for the occasional treat, I won't complain!", "business_id": "vPJ4iCOSuxCxHPtb18gwWw", "stars": 4, "date": "2011-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KJDymAcoPiW_vuqthGxfpQ", "review_id": "XVu6Hb0c7oTE1ozsaju26w", "text": "Keifer was the saving grace when we visited. He was the only person to greet us of about ten front counter workers and that includes two obvious managers. He apologized for our wait as they were organizing orders and getting prepped for the day. \n\nThe people immediately behind us (4 people) and the couple behind them walked out before ordering due to the wait. \n\nOatmeal was good - had it plain with cinnamon topper. My fiancee had the croissant breakfast sandwich. Croissant was light and fluffy while the ham had a smoky flavor. The cheese was what you'd expect cheese to be but the egg was a touch on the dry side. Overall a good breakfast option - definitely re-order worthy. \n\nNote: when they brought food to the table they did offer us complimentary cookies for waiting in line and for the food. So that helped bring it back a notch!\n\nOverall: B+  will come back", "business_id": "JJGkhOmfOFamPbCAaRKPPw", "stars": 3, "date": "2013-09-04", "type": "review"}
