{"votes": {"funny": 1, "useful": 6, "cool": 2}, "user_id": "AhbHvWC9Zm8SI4Agvs-UvQ", "review_id": "0b_lf6SM_oyOiRLs_BKW6g", "text": "Important Update - Closed on Monday & Tuesday - found out the hard way...\n\nGrew up in Pittsburgh. Never knew about this place. Stopped by after doing a YELP search. Donuts are yummy. Love cake donuts with crunchy outside. Donuts here are very tasty. Small place, clean and sanitary. Parking was easy on the street in front. This is in a residential neighborhood and not in the business district. I will visit again - SOON!!!", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 4, "date": "2010-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "W4ojW7f30haCertr4CzFJw", "review_id": "Lyic_2zhVmP0VN-_CSktiw", "text": "Too expensive for what it is.  I had the ham and cheese flat this morning and it was the worst breakfast sandwich I have ever had in my whole entire life!!!  The ham was just awful and there was way too much cheese. I will certainly never go back for a breakfast sandwich.", "business_id": "xky2rWT8kpsdyJ4YgZB3Jw", "stars": 1, "date": "2011-11-14", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "E5qFR0RBQBoXx8FbrOkdbw", "review_id": "0xxtYxt6_Vn2QUaIgMtugA", "text": "Quick service, but the selection of donuts is lacking at 7:30am. You'd think they would be fully stocked and ready to go.", "business_id": "T-AAN0CizEBOTtHinTuvrQ", "stars": 3, "date": "2014-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GXt1b29IAQulijQWBwUPNA", "review_id": "Y6UJb9Q6OmTcFQt-ICNGmQ", "text": "One of the best donut shops in the valley. I live very close and have been here many times. The quality is always consistent. Prices are great. The selection definitely diminishes as the day goes by...but of all the times I've been here, there has never been a line. Maybe one or two patrons sitting down. My favorites are the maple bars and the cake donuts are amazing too (and I never used to like these much!) I've heard ravings about the croissants but I haven't tried these...yet.\n\nUpdate: Went back for a croissant on a Sunday to try it for the first time. They were OUT before 9am AND there was a line. If you go on Sundays, just beware they will likely be out of your favorite items.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 4, "date": "2015-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "iQTOwoJxHobk4kidfUIW9Q", "review_id": "OvvAcgJ7YvuV2SaPsxRhNg", "text": "Took Nelson Q.'s advice and got a apple fritter. I was forced to get the full size because they were out of the half size.  Om nom nom, nice pieces of apple in the dough. Not too much glaze like other places making it the perfect amount of sweetness. I also ordered a jelly filled, pretty good as well. The dough they use here is awesome because its the in between of the lightness of Krispy Kreme and the thick doughyness of standard donut shops. This might be my new favorite spot for dontus, too bad I live far but on the plus side I will start my intern at UMC next month. So they should be seeing me on a regular basis. Good for my taste buds, but bad for my waist line. Ekks!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 4, "date": "2012-11-04", "type": "review"}
{"votes": {"funny": 6, "useful": 5, "cool": 7}, "user_id": "wl1xe1S6x0hdZNatSAUxRg", "review_id": "rQ-oEvq1gHZdwh3eigh6GA", "text": "-I like olykoeks.\n\n-June 7th is Nation Olykoek Day.\n\n-Real Olykoeks sells olykoeks.\n\nYou won't find bacon-encrusted olykoeks filled with maple-M&M-peanut-butter-fruit-loop-jalapeno-blueberry-chai-creme here.\n\nJust straight-up, old-school olykoeks. Glazed. Chocolate custard. Sprinkles. \n\nThe olykoek I ate has already congealed and is now settling nicely as a thrombus in the anterior interventricular branch of my left coronary artery. Widows will be made tonight.\n\nAnd when it comes down to it, isn't that the ultimate test of a quality olykoek shop?", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 4, "date": "2015-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ljBUoa7FLuMIDXAToewmPg", "review_id": "RctmscYel_NT6oNpEFt4kw", "text": "Absolutly AMAZING!  The donuts, the owners, the customers, everything there was just fantastic!", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 5, "date": "2010-09-02", "type": "review"}
