{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "AY-W59xCVPDaCaOKJOQUhw", "review_id": "cmliNQk3fUcfzmxSBt60XQ", "text": "Great breakfast place. Come hungry. Look for Dick, my dad, and Gino at the counter every a.m. about 0830 and say hi. Try the mixed grill (half).", "business_id": "b9WZJp5L1RZr4F1nxclOoQ", "stars": 5, "date": "2011-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s8Ki9RK9yRE7jk_qipnv5g", "review_id": "2GpR3AjPtEFau1U3lBkSUQ", "text": "Here before Bucs VICTORY OVER THE CARDS in game 3 of the NLDS, a Sunday. Game at 4:30, got here at 2:30. Packed both inside and out. Can't comment on any other time but this really hectic one. \n\nOrdered Pepsi and brisket nachos. AWFUL. Soggy chips, some shredded beef drenched in sweet generic BBQ sauce, a blanket of cold congealed cheese spotted with jalapeño slices. Not a degree above room temp. \n\nWill give them 1 star for tasty Pepsi and keeping it filled.", "business_id": "Z101WZaISochG6g7tI2ZVw", "stars": 1, "date": "2013-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "N_XFO8FzEfUCFl6Q1RZ59g", "review_id": "H9G4po4c4ZTfYPqjmnlYcg", "text": "Since there is no where to leave comments on the restaurants website, the following are more of suggestions/comments (let's hope they read these). The comments should be obvious to those with any common sense, but unfortunately, I find myself having to state them anyway. First and foremost, and I feel like i am stating the obvious here, the cinnamon & sugar (c&s) bagels are very sticky, especially on the bottom. With that being said:\n1. Do not store c&s bagels underneath any of the following bagels: onion, poppy seed, sesame seed, everything, or any other bagel that has \"loose parts\". When the loose parts fall off  they stick to the c&s bagel. Biting into a sweet c&s bagel and getting a bite of onion (which I dislike) is AWFUL. \n2. either wipe off the counter or place a new sheet of wax paper on the counter after prepping one of the above mentioned bagels with loose parts. Again, when you place a c&s bagel on top of these loose parts, they stick to the bagel. \n3. when someone orders a tub of cream cheese to go with a c&s, please wrap the bagel. If not wrapped, the container becomes sticky and messy from coming into contact with the bagel.\nI was a \"regular\" at the Market Square location before changing jobs and never had any of the above issues. The C&S bagels were kept on the top shelf and they wiped the counter off after EVERY order.The only good thing I can say about this location is that it has drive through.", "business_id": "uwiD9jxs09xxXG0by_xKuA", "stars": 2, "date": "2014-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IzhHexyJoEwWy2rqD3BhJw", "review_id": "YuqDNXda_XXbMES9dVgxrQ", "text": "When I told people I was going to Pittsburgh, everyone recommended Primanti Bros. I went and was underwhelmed. It was a big sandwich, but the flavour was not amazing. I also ordered a bowl of chili which was too spicy for me. As a Chicago native, I feel it's the equivalent of people recommending Giordano's or Portillo's. They're not exactly the greatest places in town, but they're well-known and popular for one reason or another. Do it just to say you did.\n\nI don't like coleslaw.", "business_id": "NeUf9FyCCIN4MEseNyqkXQ", "stars": 2, "date": "2010-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dvnk4Sq80OzhcIptr8MBIg", "review_id": "5cpHzeXwYW8Cfgr_xcQkiA", "text": "I have seen many food show on the Primati famous sandwich, so it was a must try while I was in Pittsburgh. I was not disappoint. I would come back the next time I am in Pittsburgh.", "business_id": "NeUf9FyCCIN4MEseNyqkXQ", "stars": 4, "date": "2012-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "R8ponEhYwzZG9UfdpNIqJQ", "review_id": "hxKcbDbqqgoCd0FEdgT3gg", "text": "I can see why people come here....the prices are great and the sandwiches are huge....after the bf saw Primanti Bros on one of the food networks, he made it a point to have a sandwich here when we made an overnight stop in Pittsburgh.  The waitress recommended the pastrami, so we shared it....I wasn't sure how this whole fries and slaw thing was going to work, but it did...it was tasty and yummy.", "business_id": "NeUf9FyCCIN4MEseNyqkXQ", "stars": 4, "date": "2013-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GgwZT1gcWHYu3eT_bqLITA", "review_id": "AD58jr4dvLHs095_IdDJWA", "text": "Had the second best seller which was really good.   A nice carb coma from the italian bread and fries.  A great mix of salty from the meat and those aforementioned fries with the sweet from the slaw!  \n\nThe service was good so why only three stars?  Well, when your choice was seeing the stories on their televisions about our enemy murdering defenseless journalists or some show about naked people living off the land...kind of stifles the appetite and not appropriate for even the most casual of dining!   I would have expected better from the hipsters running the joint.", "business_id": "NeUf9FyCCIN4MEseNyqkXQ", "stars": 3, "date": "2014-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XnkaYmJyHt12_fSgI_9PVA", "review_id": "kfsx9VfZLeLlYMkkQN3ivw", "text": "I love Primanti's sandwiches. I'm a Pittsburgher and will always love their sandwiches. If you want to hear more about those, read other reviews. This one is for the service at this restaurant.\n\nIt's just bad. The servers are polite, but extremely inattentive. I'm going to go ahead and play my \"I Waited on Tables in High Volume Restaurants for Several Years\" card just so I can say that even during lunch rush, no, that level of absence is not acceptable. They take up to fifteen minutes to even greet the table, which leaves you looking around wondering who will be serving you, or if you can at least have a water. If I were serving, I'd at least pop over and say a quick, \"Hi, my name's Ali. I'll be with you in just a few minutes.\" No matter how busy you are, there are a few things you just don't let slip: greetings, drink refills, and a speedy check. If it's busy, communicate that delay by saying \"thank you for waiting,\" or \"sorry for the wait.\" Honestly that's all it takes. That's it! Primanti's servers were lacking in all of these things, and from the customer perspective, it really does make a difference in the experience. Ok, sorry for the rant, but they either need to better train the servers they have, or hire more so they aren't stretched so thin.", "business_id": "NeUf9FyCCIN4MEseNyqkXQ", "stars": 2, "date": "2015-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WqdJBm6qpwbSC0kWgsd56A", "review_id": "sQjPtlKhCBq_Z_5jGYjZCQ", "text": "This is my first time in Pennsylvania and I suppose I was looking for more since Philly is so well known for cheese steaks and Pittsburgh is in the same state. I guess this wasn't the place but I was really satisfied with the service.\n\nGot here around 3pm after lunch and the wait was about 10 minutes. The chef and server were very friendly.\n\nThe onion rings are huge and the fries are a mix soggy and crispy.\n\nThe hoagie was fresh and the cheese and steak both good. I've had better in California which is why I did not give it a 5 star ranking.\n\nI might have to try Primanti Brothers.\n\nI find it funny they have a #7 Ben Rothlesberger. The Steeler colors and jerseys are everywhere here.", "business_id": "pvGT62T6Ci1LKOS9DL42pg", "stars": 3, "date": "2010-10-18", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "S5SoboMgSPJ2u-0ypxd63g", "review_id": "4oOhAiEyRLq2_jCeaah0SQ", "text": "This place has the worst french fries I have ever tasted. They were literally BLACK. All I tasted was burnt oil. My photo is the zucchini planks and that lump of blackness are the French fries that I was sent home with. I could not even eat one! I also ordered the zucchini planks and a grilled cheese on rye with bacon. The grilled cheese was incredibly dry and the cook put the bread together upside down, like it did not match up...One piece of bread was the opposite way than the other. Also the sandwich did not stick together like a melted sandwich should. Ugh. The zucchini planks were delicious. 1 out of 3 is not great. My sister raved about this place. I am so disappointed. Disgusting. DO NOT EAT HERE. I spent $30 for only one edible thing worth $4. So pissed!", "business_id": "o_wRqOpli9kyZGXlJtLLdA", "stars": 1, "date": "2014-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dEmywFqh72QplmyOEDwnQQ", "review_id": "iV8ztwc-J-R_GBYfRyUKqQ", "text": "The place looked clean. When I went it was crowded (Friday night) so it took a while for my pizza to be ready. The large pizza is huge bigger than the box and tasty. My hubby asked me if I got an extra large pizza lol. The slices are huge. One slice is like 2. I also ordered a salad and wings. The wings were good a little spicy. I didn't eat the salad yet because I ate everything else first. I would definitely go back and try other things.", "business_id": "sJtGRBWYUj013nkFA4Hrdg", "stars": 5, "date": "2013-10-05", "type": "review"}
{"votes": {"funny": 18, "useful": 5, "cool": 8}, "user_id": "QlOc_cKy_7Fs-Pg0vi9NAg", "review_id": "rj6u4RDN2wzQWduO1qvtZw", "text": "I am going to keep my rating four stars simply because I love their Chicago dogs, but Matt, do not serve me limpdick french fries ever again or else.", "business_id": "gpCtDCSXIoQx70cq9itfNA", "stars": 4, "date": "2010-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "9gtD42ZepGv567AxHuvsnA", "review_id": "eORvupGbsedpDu4oQP4N5Q", "text": "This is your typical Jersey Mike's sub shop and it's located smack dab in the middle of uptown.  Like most Jersey Mike's the ingredients are fresh and the subs are really good.\n\nOn Tuesday's you can get a regular sub, chips, and a drink for $5.99.  I must say that's a pretty good deal.  If you keep your receipt from Tues you can come back any day of the week and get the same deal again for $5.99.  If you're not lucky enough to get there on Tues then the subs for lunch can get a tad bit pricey.  A regular club sub, bag of chips, and drink will run about $10.  When you get into the $10 range for lunch uptown you start to have a lot of options at your dissposal.  So my advice is go on Tuesday if you can!", "business_id": "6ICGve6UyGPuLaGrKQBVuw", "stars": 4, "date": "2010-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MmZXLmkESXB6-MRTarCyqw", "review_id": "YBSSH5xvPqttdYwts_6STQ", "text": "The food is soooo good! Fresh ingredients make the flavor pop all the more!! Really enjoy eating here and the price is what puts it over the top! Yummy meal, that's budget friendly.", "business_id": "4-B5ou1FbGVjVEQd3FAoIA", "stars": 5, "date": "2013-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5SWpKcJtuncJEHLN4yd2Sw", "review_id": "7MYeyaazPIu5Rt8Ti9-JHg", "text": "Right down the road from us, we go all the time. Great burgers and the reuben my wife gets always looks tasty. Tons of (great) fries, one order is prob enough. Friendly people too.", "business_id": "WkD7OrSIHLzgOQo9wQHu-A", "stars": 5, "date": "2012-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2-uR7a5losM7P_PAZdws3A", "review_id": "dKc_-awQf1YqgPbTDdY9Ew", "text": "There's a wide variety of sandwiches to choose from.  The chunky chicken melt kind of tastes like Thanksgiving, I don't know how to describe it better than that.  It was just really good.  The ice cream was pretty good.  I've had better, but not very often.  The service could have been better.  The people just kind of seemed uninterested, if that makes any sense.  Overall, I'll probably be back if I'm in that part of town, but I won't seek it out.", "business_id": "M8CC5_9vEvt1yOI2pnkvKA", "stars": 3, "date": "2008-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oLAG_gj7of95l5mmctm7Rg", "review_id": "xaqBgcCPjBQpZJnUs170pg", "text": "If you want a better rating, start answering your calls instead of asking people to hold every 8 mins for 30 mins.", "business_id": "UvuUOiP0oIgJ2H_8J6h6Zg", "stars": 1, "date": "2015-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "eXIskwLm8NWcctCPTk6Opg", "review_id": "ybPUmyp38Y-vVacrkva_hw", "text": "Ever since my husband (native to Madison) took me here, I always make several trips out from Chicago every year... otherwise my cravings for the Shrimp Creole, Red Beans and Rice with double sausage, Gumbo, Chicken Po' Boy, Jambalaya, and really anything else Roussos has got goin' on that day....will cause me to go into NOTO withdrawal. Oh! And who can forget the Panola hot sauce he uses! There is so much soul in this food and super flavor, but really it's Roussos' own personal touch that makes it so unique. The food is truly special. So get yo' self out to NOTO but make sure to bring your appetite!", "business_id": "cpGv6ES2hzPCtCUQgipwXw", "stars": 5, "date": "2009-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tOS1MVVagkPxR-fiodhjXw", "review_id": "sRKiLsStI0Hf2P0q_zvFFw", "text": "As much as I want to hate Panera, I just can't.  I tend to hate chain restaurants, but Panera is my weakness.  Damn you Panera.  Another day of good soup and a tasty sandwich, served quickly and efficiently.  One day I wish you would just screw the pooch and deliver something awful so I can live out my dream of openly hating you.  But not today.  You delivered another tasty lunch.", "business_id": "S2x-rEziU3ONR9zO_vpPxA", "stars": 4, "date": "2014-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "btZL51l-EyfcBjtPOXFmxA", "review_id": "Lcqclojh3_Ucenf2dAUI6g", "text": "Called from marketplace mall area... When i told the girl on the phone, she said that I was serviced by a different location and that they were closed.  Then she hung up on me without as much as a goodbye.  Wow... No effort to satisfy a customer at all.", "business_id": "j9N_fG1PVCSY-3HY1TRQ5Q", "stars": 1, "date": "2011-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W4ojW7f30haCertr4CzFJw", "review_id": "vfZ5-xW7UCFI7gYYfyrYSQ", "text": "This store is OK. It has been remodeled since the last reviewers and is clean and modern looking now. I tried the chipolte grilled chicken sandwich they have been advertising on the radio and it was bland. It was not spicy and I had pepper jack cheese on it. The chipolte sauce did not have any flavor at all. I could taste the bread over everything else. I do not recommend this sandwich unless you are looking for a bland, flavorless sandwich. \n\nI would like to add that the girls working the counter did a great job getting everyone through the line quickly. Sometimes when you go to Subways the people working the counter think your there just to stand and look at the ingredients under the glass.", "business_id": "L3S29vAyPOxmDZ04AilwnQ", "stars": 2, "date": "2010-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FtM_8SObe4ExhoDrCdZx9Q", "review_id": "fgm_EuBR55WpmJ416pCKBQ", "text": "I was delighted to find this genuine deli serving delicious authentic food. It is an oasis in a land of franchises. Corned beef on rye and lox with cream cheese on bagel were soul satisfying. If I lived in Phoenix, I would be a regular!", "business_id": "9BH18avE46LlHMvJn67MaA", "stars": 4, "date": "2013-11-17", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "7W4egS-WyR0hRHMfQtPEOQ", "review_id": "foAzhJyVIeh_TF4EnDb7Iw", "text": "The reason I Yelp is for entertainment and because I use the reviews from others to choose where I spend my money, so I like doing my part by sharing my own experiences. My intention is not to get free stuff. Ever. I rarely write negative reviews, and the reason I wrote a negative review for Zoe's was because I believe the conditions of the restaurant were a health risk. That being said, here is my update. So one of the managers from Zoe's asks for my phone number so he can find out more information. I give it to him, willing to share my experience. He calls me, hears me out, and apologizes. Then he asks for my address so he can send me a gift certificate. Unnecessary, I tell him, but nice touch. So I give him my address. Now, 2 weeks later, nothing. I messaged the customer service person who had contacted me initially just to let her know the gift card had not arrived. Just pretty surprising the level of poor management. I am no longer wondering what happen to Zoe's because it is pretty self evident.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 1, "date": "2012-09-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "Dw0b16ira4GoAm0wlWlYQA", "review_id": "wbsstRYdT4Qi0ftIzoIXEQ", "text": "As far as Subways go, this one is pretty good. The lines can be very long at lunch (like, out the door long) and for some reason, the staff are incredibly stingy about giving you extras. I play a game with the staff where I say \"extra pickles please\". And they look at me for a moment, unamused, and then give me 2 single pickle chips. So I stare back, and say \"extra please\", and then they give me one more, and so on. We do this little dance every time, as though for every single extra pickle slice they give me, a dollar is docked from their paycheck. haha... who knows why. But it's clean, and consistent I suppose.", "business_id": "Vvh2Hd4SsZjEEfKLNKAEWw", "stars": 3, "date": "2012-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "h9FvuiV-YcvrAYBQhdSoEQ", "review_id": "YbsjtALTnOPtquVqfPzSWA", "text": "I was stoked to find real Philly cheese steak place. They defiantly look the part. But the sandwich, although it was tasty, it didn't have much meat on it!! Especially for $6.59 for a ten incher. I felt like I had eaten a six inch sub with double bread. If I ever come back I guess I'd have to spring for double meat. They did however have \"Tasty Cakes\" just like back East. You can't beet a good \"Butterscotch Krimpet\"!", "business_id": "OoHWabV-ym7_HWlHeXTsVA", "stars": 3, "date": "2011-09-13", "type": "review"}
{"votes": {"funny": 11, "useful": 11, "cool": 11}, "user_id": "oC0kwGvgaAeT3ZIxdxTcJA", "review_id": "eeasChiu_6QEzsGNwrzuhw", "text": "Every day that Richard Z is in my hood, I play emotional Russian roulette with our lunch spot. Is he gonna hate it? Is he going to order the wrong item and blame me for the rest of the day? Should we go with the tried and true. Should we try a new locally owned small business gem and raise Phoenix out of the fiery ashes of its universal assessment as the smallest of the big cities? The guy's a real Nazi about his sustenance. \n\nSo today, as we're walking to Focaccia Fiorintina, where we just should have gone to begin with, I'm like, \"OH! Do you like gyros? Your last name is Greek. Let's go to Athenian Express!\" \n\nWell, that was stupid. I really really really hate ripping on mom and pop shops. I hate giving two star reviews to family owned restaurants. But damn... You made me look like a REAL arsehole, Athenian Express. \n\nPoor Richard Z has been lamenting about how empty he feels all afternoon. And being the people pleaser that I am, well, I'm just devastated. \n\nThe lady that took our order, no doubt a solid and very decent human being, was unwilling to play along with any banter whatsoever. For two extroverted numbskulls like us, it just takes a little bit away from the charm.\n\nAnd the spanikopita arrives... I find it too spinachy. He finds it too bready. Just goes to show you can't please everyone, or in this case anyone. \n\nMy sandwich was literally inedible. Not because of the taste. I picked it up and the whole thing fell right apart. My tray looked like a murder scene. Ketchup, who for so long suffered as the understudy in this WAY off Broadway spectacle, played the part of my disappointment. \n\nWhen I asked @spirit_fingers about his meat, he said, and I quote, \n\"It's not offensive.\" \n\nI remember liking this place in my past life. Today, it was not good.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 2, "date": "2009-10-27", "type": "review"}
{"votes": {"funny": 5, "useful": 6, "cool": 6}, "user_id": "ARe8Nr_YehB2ubsGJhZ-hg", "review_id": "kSL5izroEzAEjNGKhyAFZA", "text": "Maybe it's an AZ thing, but I had more wraps during my few days in Phoenix than I've had all year...\n\nGabi K and I were setting up for a big pARTy and decided to order some grub for all the nice peeps helping us.  Knowing we'd be likely to eat lots of junk at the party we decided on something healthy beforehand....and That's A Wrap was conveniently located near the Phoenix Art Museum (the scene of the party).  We placed an order for 15 wraps and asked them to throw in some water bottles, fruit, chips, and cookies (so much for being healthy) as well.  \n\nThe delivery guy showed up with our wraps and there were so many good ones to choose from.  They all had creative names (Ken and Barbie-Que, The Very Brady Clubster, The Godfather, etc). I finally settled on the Senorita No-Meata, which may have just been the best wrap I've ever had: grilled peppers, onions, black beans, corn, garlic rice, and cheddar cheese all wrapped in a jalapeno tortilla. Ummmm.....YUM!\n\nThe bag of chips were so addicting and I found it impossible to eat just a bite of a cookie (go figure).  The fruit looked good as well, but of course I ignored that to focus on the chips and cookies.\n\nThat's a wrap for today...but i'll be back to try more wraps during my next trip to Phoenix!", "business_id": "ZoQAOnEFnyHjSpomtfqesA", "stars": 4, "date": "2008-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rZfRd5PXu_V7IfK32IaNxw", "review_id": "Z14Chio_4rjfU2nkwNsHuQ", "text": "There is not much I can say about this place except that every time we've went it has been a pleasant experience. Their pizza is quite good, perhaps not the best in the world but still quite tasty. The one time I had an issue they promptly addressed it and even gave me a gift card.\n\nWhat really sets this place apart in my mind is their wonderful broasted chicken. It is easily among the best fried chicken in Phoenix, they also have a great all you can eat deal on Wednesdays. The chicken is crispy and flavorful right until the last bite due to the marinade. If it has an issue it is that it may be too salty for the more salt sensitive people out there, but IMO, it is far from overwhelming, and each bite has a combination of flavors. We will be moving to a different state next year and will definitely miss this franchise, specifically this particular location. \n\nI've yet to have anything at this place I'd consider sub-par or average. Not to mention the fact that the atmosphere is very soothing and quiet every time we've went.", "business_id": "JN2qXIuDXnV2d8WnSqd28A", "stars": 4, "date": "2012-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 3}, "user_id": "3NwAgpjNFe7SnYgVuGElWg", "review_id": "h484Vophp6pLkpjcntEd_w", "text": "Oh, Pane Bianco, there was I time when I visited you twice a week...  There is something wonderful to be said about knowing you can just order the Market Sandwich and never be disappointed.\n\nNow, I live in NY, the food capital of America, and I have yet to find a place with such wonderful people and delicious food.  I miss Bianco's bread on the daily, and there is a little piece of me that hates New York for not capitalizing on the joy that is Pane Bianco's mayo-less tuna sandwich.\n\nBut when I'm back for Christmas, I'll be there at least five times.  No lie.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2008-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "T7J9ae0wTskrI_Bgwp-4cA", "review_id": "SlVZps6GQZJEwhoADeTTyw", "text": "I wanted to hate this place.  There isn't that much parking.  It is packed with only a few big picnic tables to sit outside and eat.  It was to hot to eat outside, IMO which meant I had to take my sandwhich to go.  There were only 4 sandwiches and 3 salads to choose from.  One dessert they were sold out of.  The price was high- $8 for a sandwich with no sides.\n\nHowever, once I took my first bite of the tomatoe, basil, mozzarella sandwich I was in HEAVEN.  The perfect amount of each ingredient.  They have perfected the sandwich!!  I have been craving it ever since.  I will stop by for lunch EVERYTIME I am in the area.  I will bring everyone I know to eat here!  Seriously!", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2010-10-20", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "k2u1F6spBGhgk2JtAe97QA", "review_id": "25OvZB3qlmBmK25wHH8NdA", "text": "Location location location! This place is in a great spot for lunch goers and church goes and coffee lovers. its right off the lightrail and across from two churches that I know of, AND next door to lux. You could even get your bike tuned at the Slippery Pig while you eat!\n\n Its got the cutest \"i got all this stuff at a yardsale and upcycled it into voila\" amazing furniture! The wait staff was friendly and the food was delish! \n\nI ordered the soup made with seasonal veggies. My son was in the mood for meatball sandwich probably because he smelled the special \"Sloppy Giuseppe\" brewing! He ordered that and was mega pleased. its exactly like a meatball sub only its not. =D Instead of meatballs its like a meat sauce with more meat and less sauce. \n\nWe'll definitely be back.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2012-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4pi5L3KDxNiYLMQG7rTkdw", "review_id": "CjO20qmvQw09jxkE7UbVMA", "text": "Just bought some bread here to take home. EXCELLENT! Other than my own homemade Biga, best in the city.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2014-11-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "zOm5ZN2fZkdjJeWmB9Nosw", "review_id": "HqdqjvPpUJtMR2AGPe5ITA", "text": "Was there 11/27 with a groupon. Ordered the Philly Cheese Steak. It was unremarkable. The meat was salty and tasteless. The cheese ended up adhered to the paper wrap. A good cook knowing his business would be aware of this issue. The bread was average. If it was not for the groupon they would have gotten the sandwhch back. I took most of it home and fed it to my dogs. In the world of food its real hard to screw things up when others do it right. For this reason I give it two thumbs down and a no to return dining.", "business_id": "SfrBXbRdNB_gqPkIgJyKCg", "stars": 1, "date": "2012-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DrWLhrK8WMZf7Jb-Oqc7ww", "review_id": "ZlyLZFhzYQlnLhcmbHXO6Q", "text": "Really couldn't find anything special about the sandwiches here. Boars Head meat is always good, but I'm not sure if they are actually slicing the meat for each sandwich. Turkey seemed like it was cut another time, wrapped up in some plastic and then unfolded for each person's sandwich. They also doused the entire thing with about a quart of Russian Dressing (#5), put some fancy tomatoes on the sandwich and I requested a change of cheese from baby swiss to Smoked cheddar. You can only get about 8 different cheeses here on your sandwich (the rest you must buy) and they only carry one style of Boars Head turkey. No pepper or pastrami style, nothing but boring old plain turkey. Whoever is raving about the macaroni salad must be a rookie as well. The mac salad lacked any flavor and resembled ones you will find in a supermarket tub. There might be some better sandwich combinations out there on their extremly cluttered back wall (it's actually not cute cause your menu is in 20 places), but with the limited variety of meats, it doesn't mean much. Yeah, it's been there awhile, but so what, McDonald's has been around awhile too.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 2, "date": "2012-11-01", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "m70PZuRVNwgm1_IhQPXU3Q", "review_id": "ifieYrFr_mzt3icAQn7jAw", "text": "Nothing special, to be honest.  I am a huge supporter of small business owners. Sadly, Sonic has better tasting hotdogs and buns. Also his lemonade offered with special (says machine is broken, awaiting repair) is disgusting, watered down. Sadly, after all these years driving by... I know why I have not ever stopped in....and never will again.  :/", "business_id": "FW2Z4ll4zSOEDAJX9-wBZA", "stars": 2, "date": "2014-11-04", "type": "review"}
{"votes": {"funny": 4, "useful": 7, "cool": 7}, "user_id": "m7vtKWpZ9wdEQ95wJxrMrg", "review_id": "mnWvCbydO9YGpZuisKCRqw", "text": "I think this can give the Jewish delis of NYC a run for their money. The place itself is clean and spacious, and the comfortable booths were just right for the mini-UYE with Rand H., Mike C., and Robyn N. I ordered a half pastrami sandwich and a bowl of kreplach soup; these came with sides of coleslaw and pickle spears. A plate of bagel chips was also served with the soup. The pastrami sandwich was superb and overstuffed like it should be; really tasty - I thought I should have ordered a whole sandwich instead of a half. The kreplach was good; tasty and hearty, and a bowl could have been a meal. I really have to come back here to try other stuff, such as belly lox ... but return visits won't be too frequent for me, only because the food is quite pricey. The half sandwich, bowl of soup, and coffee cost close to 15 bucks.", "business_id": "PxeX1M8WtyPxX1MuuGIh-g", "stars": 4, "date": "2010-11-16", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "FAsJEfgQL7mL5mg76Z6-2w", "review_id": "PJEKgBXrrL53cahEnsoGbg", "text": "These people were so unbelievably rude to me. They were rude on the phone, they were rude when I picked my order up. I am not going back even though the food was good, not worth being treated like you are the smallest person in the world. There are a handful of other delis very very close that are just as good.\n\nUpdate: 11/22/14\nI just saw your truck driving down 7th Street in the most reckless dangerous way. Wow, if you're going to drive like a jerk, word of advice, don't vinyl wrap your truck with your business on it!", "business_id": "PxeX1M8WtyPxX1MuuGIh-g", "stars": 1, "date": "2014-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1baNWhQuHP6nUpy7AcpLsw", "review_id": "YJEcyVaYbRDvkJg52YrpAg", "text": "Excellent sandwiches.  Avocado on toasted sourdough was the best.  Must have had two whole avocados on the sandwich!", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 4, "date": "2010-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gUXfVNgnNF9WU73T-d-FKQ", "review_id": "UGMVpVHkQBlaMjEMFmub5g", "text": "Tuna with water chestnuts on gluten free bread (they use Udis), YUM.  And a super patio - sit under the eucalyptus trees, relax and enjoy!  Friday nights, live music...add a glass of wine and it's casual and super relaxed :-)", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 5, "date": "2013-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ylyVSS7H5NJPpu90swck3A", "review_id": "7t13iPKWypTY4HJTJj3VWA", "text": "The pizza is really good here! Good ingredients, lots of cheese and crispy crust. I won't say it's like NY pizza, but it's very tasty in its own way.\n\nFriendly service and charming ambiance, with lots of Frank Sinatra music, and subway-esque signage. Only thing I haven't liked here is the lemonade, it's made from a mix, and the temperature in the restaurant is always freezing.", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 4, "date": "2011-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9CfM2qdg_HjjsvVzEtjSdw", "review_id": "na-mCVnwdvRExrzl8cGzbQ", "text": "Not sure what is happening, but two visits and two messed up orders.  Both times it took them more than an hour and half to prepare our pizza.  The first time they apologized for the \"slow service\" and the fessed up that they lost our order.  Six weeks latter - they DID EXACTLY THE SAME THING AGAIN. Not only did they lose our order, but then when we got home they gave us the wrong salad order.  Their pizza is not good enough to justify this type of wait.  We will look for another pizza place that manages their orders better.", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 2, "date": "2014-11-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "e2mJAZ09fXqZMgQ-OiRIHg", "review_id": "X-zWQ83FhtOC5V6XD7NleQ", "text": "I've been eating at Miracle Mile ever since I can remember, initially at the old Christown Mall location.  For my youth, it was the only Jewish/American deli I knew.  It's still great after all these years and location changes.  I've since eaten at a few deli's that can top it, but not by much.\n\nI'm not going to run down everything I've eaten over the years; you know what deli's have to offer and this place is no exception.  Get your matzo/pastrami/corned beef/chicken soup on, homey!", "business_id": "fmuj7u1gflmEjW-h0v9bwg", "stars": 5, "date": "2011-10-10", "type": "review"}
{"votes": {"funny": 2, "useful": 7, "cool": 6}, "user_id": "4ozupHULqGyO42s3zNUzOQ", "review_id": "QUunpaix5_AlAKZZyAxcRw", "text": "Au Petit Four makes its home in an unassuming location within the Esplanade. This is a great little bakery and the perfect caffeine fix during the workday. While I haven't had a chance to try their croissants and baked goods, they smelled delicious and I'm counting the days until my return. \n\nTheir iced coffee is spectacular. The sugar free vanilla and Carmel is straight from France and it makes the perfect blend of refreshing coffee with a huge caffeinated kick. The staff is friendly and they have great seating to stay for awhile and do work. So in summary, Au Petit Four is tres bon for baking, coffee and work essentials and I look forward to coming back and trying out their food!", "business_id": "wftoNIA0Q8nX-Da47psBCA", "stars": 4, "date": "2010-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "2KNPtV5E44vAiEr5BvMkUA", "review_id": "WKPtFciGnuP_8HKiNV8k7A", "text": "When I want a sandwich, this is where I want it from. \n\nSoft flavorful bread (you are already ahead of the game because Subway and Jimmy John have hard and/or bland bread). Fresh sliced meats, cheeses and veggies (sorry but S & JJ have slimy meat and that's a HUGE turn-off), and when you take a bite of your sandwich and all of the mayo/mustard/vinegar/oregano have magically melded together...you'll be a believer too. Prices are slightly higher than Subway, pretty similar to Jimmy John, but the quality leaves them in the dust. My only suggestion would be for them to start a delivery service or subscribe to Grubhub.com or something like that so I could order it for our lunch meetings. \n\nOh and the service is always done with a smile. Great job guys!", "business_id": "U2hhSRVHfBryKPNTgasprA", "stars": 5, "date": "2013-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ys5YBxnm8wcIpTqEFboRFA", "review_id": "J1A1gLD6vOUlsqbswjlEeA", "text": "I have never written a review before but felt I needed to after my experience with Croque. We order from Croque all the time and most often have the food delivered.  In the past the food would arrive around 20 minutes later than we were told but it wasn't a big deal.  \n\nToday when we ordered we were told our food would be delivered in 30 minutes.  An hour later still no food.  My boyfriend called and the lady told him the food was on the way without even saying sorry or anything.  Another hour went by now we had been waiting 2 hours for our 30 minute delivery.  He called back and told the lady we still had not received our order.  She said it's on its way again.  He told her I hope you are not planning on charging us for this food because we have been waiting 2 hours.  In a pissed off voice she says \"Oh so you want a free meal???\"  After some arguing she said she would not charge for the food.  \n\nTwenty minutes later I received a call from the drive.  She told me her boss said not to charge for the food but demanded... \"you have to tip the driver\" over and over again.  I told her she could talk to my boyfriend when she got here.  She then called back three more times yelling that we had to tip her.  My boyfriend told her just so you know I was going to tip you but when you deliver food 2 hours late you shouldn't call your customers and demand that they tip you.  Tipping is optional and it's based on performance.  When she got here she rang the doorbell 8 times in a row (No i'm not making this up) \n\nNeedless to say at this point we did not tip her and will no longer be ordering from Croque.  Their customer service is a Croque of $#!%.  (Sorry I had to!!!!)", "business_id": "GSsq_y2PfYBzn51gAG_c7Q", "stars": 1, "date": "2012-11-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rSsmrmI_bK1_-kiOWeHvhw", "review_id": "IyHf37AR90dwqEsW3wa7Ug", "text": "The hostess/lady who took my order was very polite and created brief and pleasant small talk. I ordered 2 cheese slices to go and my food was given to me within 5 minutes. The price was reasonable. The pizza was in my opinion slightly above average. The restaurant itself wasn't the most charming and the location wasn't the greatest but not the worst either. But for quick take out it was ok. Giving it 3 stars.", "business_id": "j0Uc-GuOe-x9_N_IK1KPpA", "stars": 3, "date": "2013-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HnqzojvN3AyZHjslUlxiJQ", "review_id": "WMQTgVxC3Kxo4Ontg8tgpg", "text": "Ever had salmon on a bagel? I'm sure you've had. \n\nI just can't get enough of the Nova Lox at Einstein's. It comes with cream cheese, tomato & raw onion slices, and just the right amount of capers. Just one bite and you will be hooked. You get to pick what kind of bagels you like and I know it sounds weird because it is sweet on a savory bagel (the cashiers always go like, are you sure? Yes! I am sure!) but I always pick the cinnamon raison bagel. In the words of Rachel Ray, \"Yum-O\". \n\nI've tried the caramel macchiato today; since I was already too late to stop at Starbucks. I don't know if they were missing the caramel or the macchiato or both to it because it just tastes like warm milk. I'd asked for soy, too. Had a tummy ache. :(\n\nBut it is okay, I end up not finishing my \"tall drink\". Btw, tall is (as far as I know) the only term for Starbucks for) small size. But I consumed all my bagel just in time until the boss walked into the office today.", "business_id": "5Js9G0axfWhbYlB9UgXLww", "stars": 4, "date": "2014-11-07", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "87PyuaVWNZEyeiMD6yrDtA", "review_id": "hsgQ3qgv48OjVMlSI2dTHQ", "text": "Had lunch here with some co-workers. The location is good, the facilities are clean, the prices were decent and the food was excellent. I had a Chicken Salad which was great, I will try a sandwich next time.", "business_id": "S8R5c7-plWe3NtmijYAJvg", "stars": 4, "date": "2015-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "618-QjYnR0pwah6utjWoDQ", "review_id": "4sexTQcunobEf4a9GgUZLA", "text": "LOVE this place!!! Pizza by the slice, delicious and NY style! Staff is also great, friendly!", "business_id": "GvwDppcJLm9lso9iS2hSIw", "stars": 5, "date": "2015-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z5_oZaSu49KcGmQ04ksoUA", "review_id": "LqSICOrOwid6SC3Xjh8iTg", "text": "I'm giving them a 5 just for their spaghetti and meatball calzone. It sounds awful, but it is one of the best things I've ever eaten. Must try!!", "business_id": "YldXB1hRpnE1CWLF3mvgpQ", "stars": 5, "date": "2010-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "snfrEGKkcG8h67d1Z9pooQ", "review_id": "pjfdBh9cB_Q2p6A_7R6ebg", "text": "Eating here for years and always enjoy the food. Customer service is a major reason I come back to most places. Tonite I called for delivery because I've been sick for a week. The manager took my order and was incredibly nice with get well wishes. Upon delivery, so was the driver. To my surprise-I received my yumalicious food AND a get well surprise of cookies!! How thoughtful is that?!?! A true Italian family restaurant, filled with heart. Thank you Daniel and Stafff, for the meal & thoughtfulness. It will never be forgotten.", "business_id": "YldXB1hRpnE1CWLF3mvgpQ", "stars": 4, "date": "2013-09-25", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "zNFIzjoEX3skz2zd7wE5Sg", "review_id": "KH941DJ3tBCj7YTmFQFufQ", "text": "Coffee I can get the same at the canteen here at work.\n\nThe eyebrow raise at me when my drink was ready wasn't the \"customer service\" I expected from someone I didn't know. It would've been perfect if his pinkie was raised as he handed it to me.\n\nDecor was interesting but not somewhere I would go back to unless I was desperate or forgot I had been here before.", "business_id": "4eFIVmbeCvJGCrhzmd-VYA", "stars": 2, "date": "2014-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "oMGWeM12E8vy3ytmflf9bA", "review_id": "gi7-qVmZeOT2RSWe6Y9K7A", "text": "Italian hero was decent but probably wouldn't come back for it.  The pasta salad was old and some of the pasta was starting to get hard.  No bueno.  Overall I'd say they are coming up short in too many levels. If you want a real Italian deli go to Niccolis not too far from here.  They have one of the best sandwiches I've ever had!", "business_id": "unPzS1QJJctlZyLGFSk_HA", "stars": 2, "date": "2014-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mDnhkSfBNM3UlmgQlHezCg", "review_id": "SSmCDNH9tGYUQr1Pe7HT0g", "text": "Just picked up my first pizza from there. 16\" The Works! Fantastic!! The whole family is hooked. Fresh,flavorful, not greasy.....yummy!!", "business_id": "kxDGexkbP30fBvxVI0CzFQ", "stars": 5, "date": "2014-09-20", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "CWYHXKPXqP4KgY3TyI54lg", "review_id": "DbrNcAFr9TKJUhqofybXkw", "text": "The store near Bell and 7th St. was filthy.\nThe employee making the pizza obviously had a cold or sniffles or something.  Repeatedly touched his face and handled the food.\n\nMy slice of pizza was very good.\nBut the utensils were all soiled, the tables were dirty, windows dirty, etc.\n\nBeen to this and other Ray's pizza locations many times.", "business_id": "V3lQtk1LgwAEcF9j-BzchA", "stars": 2, "date": "2008-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r_efxKk6jHRLb38koXp6-Q", "review_id": "gjo4oFk3lWhZVuWKDDkoig", "text": "I love their pizza whenever I am willing to spend a little extra and make the drive I certainly come here for their New York style pizza. The white pizza Is amazing!!!", "business_id": "V3lQtk1LgwAEcF9j-BzchA", "stars": 5, "date": "2014-11-01", "type": "review"}
