{"votes": {"funny": 4, "useful": 4, "cool": 6}, "user_id": "9ellV9VrEOPA3vX2pZptSA", "review_id": "9--jL__9efnmXZEm9o0HIw", "text": "OK OK... as a Proud Italian I hope my momma don't see this! I'm actually going to give D'moes a 5 star rating for a few reasons. Last Friday, me and my 2 brothers left the suns game, and proceed to put a few \"adult\" beverages back. At around 2am, when Haney's shut down, we had an overwhelming craving for crap pizza (its better than our normal Jack in Box at 3am run that usually ends up with someone puking in the drive thru line because the smell of the taco sauce is so amazing). Low and behold, the ONLY spot that was still taking orders (up to 2am!) was D'moes. Now, 1st off - I live at Summitt (by BOB). These guys gladly delivered to me, all the way down there! Major props for that. 2 - They understood me... considering I don't remember ordering the pizza (I woke up to pizza and wings boxes all over my pad, and me saying \"who ordered pizza\" then I burped... wing sauce and vodka is a healthy combo. 3 - apparently, after checking my voice mail, the driver was pounding on our door for about 5 minutes (we were REALLY jamming out to Rock Band, in case you don't know, were pretty awesome. Wikipedia that Ish ladies and Gent's; Kansas City Bullriders). Well, the driver and my door man both called 3 times. I'm assuming the driver eventually came in and grabbed the bass guitar and strummed it out. Maybe he had a slice with us? Who really knows these things. However, I do know that I was insanely impressed with D'moes... from the left overs I ate the next when I could remember. It was pretty darn good. Between the awesome'ness that is called \"their customer service\" and the legit taste it left in my mouth, I'm a believer, unless, if I say I'm not, will I get a commercial?... hmmmm.... Potential there....", "business_id": "x5Mv61CnZLohZWxfCVCPTQ", "stars": 5, "date": "2010-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "-dHUwAr6d5eJVGY8RQBpIg", "review_id": "Q2w4FwoNhQe7akTkgnjBkQ", "text": "So I went here like 2 weeks ago, on a Saturday night, it is currently named Downtown not palazzo anymore. They charge a cover which is $10 not bad. The drinks are a bit expensive. They have three dance floors. Each floor plays a different type of latin music one floor consists of salsa, bachata, merengue. The second floor is Banda and the third floor is top hits like reggeton, Spanish pop etc... Overall it was cool.", "business_id": "SiwN7f0N4bs4ZtPc4yPgiA", "stars": 4, "date": "2014-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Sg9eHImUp1DMYhY7gA2img", "review_id": "yjEOpYaOnahtzCHBzY6KUg", "text": "It was fine.  A fine thai meal to have before a rock show downtown.  Would I go again if I were in Phoenix, probably not, maybe so.  The service was fantastic, the food was fine, the place just had a weird energy, or maybe that's just a Phoenix thing.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 3, "date": "2010-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "EZORwyVnI1XXKtAKPiWZFw", "review_id": "oL_PitZqVAM0Kg8fDqvmaA", "text": "***************************\nUnsanitary Conditions\n**************************\nlast time we ate at this \"establishment\" a cock roach crawled across the bar.  When we told the owner we were told that a shipment of produce was infected by roaches. No offer to refund the meal was offered. We delivered an email of disapproval to the owner upon which she responded with refunding the meal.\n\ntoday when we returned for the first time since that unfortunate incident the owner informed us we were no longer welcome in her establishment. \n\nIt seems a roach infestation had lowered her Maricopa Health department score - which somehow was our fault for indicating to her that there was a problem.\n\nvery disappointing.  This is a restaurant i've enjoyed for years and years but will never dine at again.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 1, "date": "2012-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z05fLO8I6bE9K6R7mODZdA", "review_id": "Kv-w_aK5nhvHkcFDEuKeUw", "text": "Hit and miss, these days. 3 stars on the food these days, every other category they do great.\n\nThey used to be a solid 5 star Thai source back when they opened, but now about half the food is really really good and the other half is not really good. Their Pad Thai used to be the best ever by a fair bit, now it is just sweet and doesn't even have peanuts on it (last couple of trips at least). The barbecue was OK, but the green chile dipping sauce it came with was exceptional.\n\nStill AWESOME - - Beef Panang, Pad Kee Mau (spicy coconut milk chicken soup). All their curries have been awesome to my memory. I used to take joy in trying new things here, now I am more cautious.\n\nI hear there is a Scottsdale location now, but I think I will stick with the original.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 4, "date": "2014-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AAVr5obnyphZg3LBNNEC5w", "review_id": "bHwicfeqE3YeB1oRYPCN7Q", "text": "We waited 45 minutes for our food. I asked how much longer it would take and was told up to 10 more minutes. I asked if the management would give us a discount for the wait. I saw our very friendly waitress approach her manager who was clearly annoyed by the question  (we made eye contact more than once). The waitress came back and said she was really sorry but they can't do anything about the wait because everyone else is waiting too. So we canceled our order, and they made us pay for the tea we drank!\nNow I know it wasn't much but when I've had a problem like this at other restaurants, the manager always comes over to the table and hears the grievance personally. The wait staff was great but the management was sloppy and hands off.\nSo we drove all the way to Siam Thai (which was pretty busy) and had an excellent meal which was served promptly.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 1, "date": "2014-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "fXb9GE7B8OFDqkBr_V5wGg", "review_id": "Wws76VrmkUQfTkXMXujxKw", "text": "I began coming here in 2005 because it was the closest gym to where I was living at the time.  But even after I moved out of the area, I knew I had found \"my gym\" and I've never gone anywhere else since. Even after I moved to Chicago, when I come back to AZ for lengthy visits, I get a month to month membership here every time. \n\nI highly recommend giving CPSAC a try, especially if you're tired of the \"mainstream\" gyms or just want a better overall gym experience.  Plus they have a Cold Plunge which is getting harder and harder to find in a gym nowadays.  These people actually KNOW what they are doing and what muscle building and muscle building recovery is all about.  For my money, this is the best gym in town.", "business_id": "werWnE_3k8GYVaMuUcWw4g", "stars": 5, "date": "2011-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uq5C5qFHN7iqvdX83VwrlA", "review_id": "kZCGBY4a_D3oB1Q8xuDXJA", "text": "If you're gonna eat tex-mex in the downtown phoenix area, this is your best bet. \n\nI typically go here every time I come to Phoenix, and it's pretty great. the outdoor seating with the Grotto view is really really gorgeous. \n\nThe chips and salsa are FANTASTIC!!!! You get an assortment of chips and they are the best I've ever had. \n\nThe blackened fish tacos set my mouth on FIRE. I had no idea they would be COVERED in chili powder. too extreme for me. \n\nTypically you get, white chocolate wrapped in a tamale leaf to cleanse your pallet after you are finish with your meal, which is one of my favorite parts of dinner ... but our waitress forgot :( ... definitely ask! \n\nI would say this is your typical \"mexican/southwest\" restaurant, where the entire menu is basically variations of taco salad, 10 different variations of quesadillas, and tacos of some sort, and 3 pages of different margaritas and drinks with \"loco\" in the name. \n\nNot too bad, not great either. I personally prefer the Greek place next door :)", "business_id": "e5kc0CQ4R-PCCDgb274gSg", "stars": 2, "date": "2009-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rvXhbPPY0uu2AopBAt_O-Q", "review_id": "Bmu-9V_Ah4sZfhhxXEjLrw", "text": "Great portions and good food. Stayed for a week near by. Probably ate here 4 times in a week. The southwest Cobb salad is beyond delicious. Great happy hour 4-7 everyday. Highly recommend.", "business_id": "e5kc0CQ4R-PCCDgb274gSg", "stars": 5, "date": "2013-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "U-7bw2PW3QDiWxjdqOtLZA", "review_id": "biHL-MS1uQwt_QykJoCVhg", "text": "If you come here to dine in close to closing time DO NOT sit in the back section or you will get scolded by the Latina hussie behind the counter.", "business_id": "72N6TdH5MdUWE2YhYRbyxw", "stars": 2, "date": "2013-11-15", "type": "review"}
{"votes": {"funny": 2, "useful": 6, "cool": 6}, "user_id": "qhooXf7Uh8NP3mX6YG3Drw", "review_id": "EsFU7XVRxebi_DIeJXgjEw", "text": "Just an amazing collection of Native American art and artifacts anywhere. The Heard Museum is a must visit if in the Phoenix area.\n\nYou can easily walk around here and explore all the exhibits and after a few hours still not have seen it all. So many different tribes are represented here. Baskets, bowls, artwork, clothing, dolls, ceremonial outfits, kachinas, and more from many tribes are on display.\n\nWhat is impressive is that most of the pieces on display are donated by private collectors. Senator Barry Goldwater's collection of about 400 kachinas were donated and on display among many others who gave to the museum. There are also free hourly tours by knowledgeable museum staff. There is even a children's area with hands on crafts, exhibits, and learning tools. \n\nThe layout of the museum is very open and thought provoking, the exhibits are displayed well, and the staff helpful. On site terrific cafe, gift/book store, and coffee shop too. Definitely a must to see if interested in Native American cultures, art, and history.", "business_id": "SG_gEmEXL4ID6RAEinC5Bg", "stars": 5, "date": "2011-11-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Jt3EQa5TP7-r0fUAgFyFTQ", "review_id": "U5m96Hwn8moIqsl9rgsOSg", "text": "Pleasantly surprised with the quick and competent staff here. Normally not one to be impressed with fast food, I was delighted to get above and beyond service. A+ awesome!", "business_id": "neGAQFkBNI8-rpPBLBzNkw", "stars": 5, "date": "2015-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sKDdRw12V2dDLT2phv3cWQ", "review_id": "dgRZ3AL6FIW4guYKvCqObg", "text": "Stopped in for happy hour and had a couple beers and gorilla wings.  Pros: the wings were big and delicious, and they have a decent beer selection (domestics, Guiness, Four Peaks) Cons: Its a little bit cramped", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 4, "date": "2011-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "REFrXuYPcJBluKIgCusxbw", "review_id": "7VkWqU2QhA8WVu7xoXZDqg", "text": "Great sports bar atmosphere. Great service, burger was delicious, and the cookie dessert was to die for. Choose this place!", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 5, "date": "2015-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "D2XJrLrS3kC4rbm8k41P2g", "review_id": "3EX74WR-2WH_gnwIiRsCtg", "text": "I cannot say enough great things about the entire team at Arizona Sports Physical Therapy. I'm not sure about the first reviewer's experience but mine was nothing but quality. From the first phone call they were very helpful. They called my insurance for me to make sure it was accepted. Since I knew I had a muscle problem, I didn't want to have to set up a separate visit to a physician when I knew a qualified physical therapist would be able to get me back in action again. They were able to get me in for an appointment the following morning after I called them.\n\nMy search for a PT began when I hurt my back while playing tennis. I didn't want to wait until it just felt better. I'm so glad that my search led me to this clinic. Matt and Andrea are incredibly skilled therapists. They were flexible with my schedule allowing me to sometimes visit in the morning and sometimes in the afternoon since my work schedule can be difficult. Every member of their staff --from the front office on back -- was friendly, helpful and engaging. They made sure I kept challenging myself at every visit and it made a huge difference. I was able to heal pretty quickly.\n\nIt's been a few weeks since I completed treatment and I can happily say I ran a few miles this morning without any pain in my back. I've already referred a few friends to Matt and Andrea and would absolutely continue to do so. Not to mention that if I should ever need a qualified therapist again, these two will be the first to get a call.", "business_id": "Gd3Dz1sbPjHBzwFxd7chiQ", "stars": 5, "date": "2014-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "POvdnaJ4O4mQo6Y0NzgESw", "review_id": "UeIS9XxMGdL_DVdBI4tq1w", "text": "Marina Ochoa. Amazing. 2 months later and I'm still getting compliments on the cut, and how healthy it looks. I've been going there for about 4-5 years, and will continue to do so!\n\nMarina will LISTEN to you. Tell her what you want, and she will give you ideas and suggestions. She won't push anything, including products. Though the products she recommends are always topnotch. She won't make you feel like you have to purchase anything. \n\n\nThe staff is always very cheerful and happy to assist you with any questions. \n\nTell Marina, Maria sent you :)", "business_id": "Og03_vbBCVAFNHXgdflRLw", "stars": 5, "date": "2012-09-27", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 4}, "user_id": "q9XgOylNsSbqZqF_SO3-OQ", "review_id": "y4XMzBWa74Ch1EM8p17Hjg", "text": "Making the rounds on all the wonderful mexican food places the south side has to offer I found myself here. I can't believe how many times I have drove by this place and never stopped in. The dining room is humongous, you could probably fit 500 people in it.  It is a bit brightly lit but squint your eyes and dive into the salsa, it is really awesome. I must say I was not impressed with my lunch order, I got the tacos and they were dripping with grease. I think they make the tacos, lettuce tomatoes and all, then threw them in the fryer (yuck). I think I just made a bad choice though as the dishes others ordered, (fajitas and seafood plates) looked delicious. They give you a really yummy soup at lunch time. It consisted of broth, rice and veggies and was very flavorful. The waitress was sweet and attentive and the margaritas were great (if you like them made with limeaid, which I do).", "business_id": "BESmH-lmMm34_EefL8X9fQ", "stars": 4, "date": "2008-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vG4gHg0xkzcg7MVCwmokFA", "review_id": "Yv4V7QE7N-E6SRXzNgvZJA", "text": "The food is delish! But beware the salsa is hot hot hot just like the plates! Service was really good too! Prices seemed right on as well. I know we will be going back as it is a favorite foodery with the hubbies family!", "business_id": "BESmH-lmMm34_EefL8X9fQ", "stars": 4, "date": "2013-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9YNHa2keKC1TCOYQf2e9RQ", "review_id": "SIZg76kp1xNy4o7UxqDkwA", "text": "Great food, decent service, great atmosphere make this a great restaurant for lunch or dinner. Had the carne asada plate and it was great. The beef was grilled over a flame and it made the beef taste great. Soup was delicious and chips and salsa outstanding. A little pricey, but the quality makes it worth the price!", "business_id": "BESmH-lmMm34_EefL8X9fQ", "stars": 5, "date": "2014-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "pEVf8GRshP9HUkSpizc9LA", "review_id": "SVGqJyYVCQsmWPmYr-efRA", "text": "I visited the Phoenix Theatre last night with friends to see White Christmas and really enjoyed myself!  The redo of the theatre is great...absolutely love the new look!\n\nEvery seat is great and the tickets are reasonably priced!", "business_id": "X9ih9Iotd-VEZ8tTYfoarw", "stars": 4, "date": "2013-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7Z8Awsdiu-jFSopj_7nedw", "review_id": "pvew5b6VNr7cEwHnzDlJAg", "text": "Went in specifically for the 5.99 taco deal advertised online.  Went in and they would not honor it...said it was wrong and deal was now 6.99.  I pulled up \"their\" website and showed it to them...still, no remedy.  The food was good and price was decent, but I think they should have honored the price advertised and change it later.  That would have been good customer service.  Other than that, no other major complaints.  I was though, reminded that they were closing in half an hour when I told them I would be dining in.", "business_id": "D09yG6Z3gcsh24Qn7Y4gYA", "stars": 3, "date": "2014-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 3}, "user_id": "0oRtnPHtvZIE1UNxCDDTPw", "review_id": "f4sFpjFxp3T2-BJYpJrkDg", "text": "After visiting the Phoenix Public Library, I had a sudden craving for some  japanese food. This restaurant happened to be right across from it, so I decided  to eat there.  I ordered the Panko Fish Bowl,  but to my dismay; I was informed that they were out of fish, so the owner suggested the coconut shrimp. \nI was pretty happy with it and I thought the special orange sauce was flavorful. \nThe prices are also pretty affordable and the food comes out pretty quick. \nBut the real reason why I  am giving this business 4 stars is  based on the fact that the owner and the staff of this establishment are helpful and honest. (I lost my cellphone there last week and they found it.) \nPlus I prefer to spend my money on local independent business like this one rather than a national chain.", "business_id": "kaIue7GRCmkPzDeHDBTttQ", "stars": 4, "date": "2010-09-13", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "gGMi5Ep4i7HByd4MTuivHQ", "review_id": "PZB7dFjk1EWoQMAypbfWqw", "text": "Holy moly! I'm addicted. This place is amazing! Friendl6, fast service. I had the panko chicken it was amazing, filling and a great price. I will be at this place a lot!", "business_id": "kaIue7GRCmkPzDeHDBTttQ", "stars": 5, "date": "2015-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FMl_rC4BJXhZbJRrYU_Oqg", "review_id": "UDnWMAwBU9FGCcUDJppPLQ", "text": "Awesome place. Really nice staff", "business_id": "j8nyAaN_w5t6wYv-ni23sg", "stars": 5, "date": "2011-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "Pr1Z6jWvfYBZXozRsDMFWg", "review_id": "uO1jPBWwqKqRWK-SPwwpxg", "text": "Am I a snob about Asian food? Yup. Can't help it. I grew up in NYC, where Chinatown has real Chinese people. I lived for a decade in San Francisco, which has arguably the best Asian food in the US. I had a Korean girlfriend who was attending the culinary institute, and I happily volunteered to be her guinea pig (yeah, for her cooking too). And I spent a lot of years traveling all over the US and Europe, so I'm sufficiently jaded. \n\nI also have to say, I've tried lots of restaurants since moving to AZ four years ago, and I've come to the conclusion that, just as the Germans can't do decent Mexican food, AZ suffers a dearth of decent Asian restaurants. \n\nThat said....Fate is pretty good by AZ standards. Put it in SF and it wouldn't last a week, but here, it stands tall. The atmo is funky to the point of trying-too-hard. I like the support-yer-local-artist concept, sure. I like the rustic, we're too cool for carpeting decor. But fer chrissakes, would it kill you to slap a coat of paint on the walls, or sand down the splinters on the floor? \n\nSure, I'd eat there again....but I'd rather just grab a good Asian fusion meal when I'm out of town.", "business_id": "VsO_rhXi5lgbaGxNwoEZsQ", "stars": 3, "date": "2008-09-25", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "oIVsVM8H273aoT1JUmsDIg", "review_id": "-mAibDWoDRpUKFwd5p6y0A", "text": "Just a quick update to let people know that they now serve alcohol! Woohoo! They got their liquor license six weeks ago -- after a tedious process, they said -- and now have a full menu of wines and other libations (Beer and Sake that I know of).  So, next time you want to cruise downtown to listen to some great live music, have some fantastic grub and enjoy the cool atmosphere, you can do so with some wine and beer too!", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 5, "date": "2008-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cKB3Nna6NlvGRrF9ve4MDw", "review_id": "ELvLKkMI4xhobl6iBdLbYg", "text": "Dr. Shafran is brilliant.....and once you've been to her a few times you will understand that she doesn't disconnect from you which I believe is why she can come across a little gruff.  She is the only Dr. I've seen in the last five years who treats me holistically and has a referral ready for any situation.  Like another reviewer, if quality of care was the only component she would have 10 stars of out of 5 but scheduling is a misery.  When I can schedule an appointment at leisure I have resorted to fax a request since the voicemail is always full and it is so hard to get the staff to answer the phones.  The front office staff run hot and cold as well - sometimes caring and willing to go the extra mile for appointment coordination and at other times snarling.  I appreciate them as people and realize the stress they are under, but it goes both ways.", "business_id": "PFO7RF1xz4ZBuaq46KsLpA", "stars": 4, "date": "2014-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rNX3ykut63SdNO8kFLK7ug", "review_id": "pa9yVSwr9lCajFzZAX_rPQ", "text": "Delicious! Love the fresh flour tortillas!! Definitely not store bought! The Cadillac margarita is excellent addition to the have with the chicken fajitas! The bean dip here is very good big enough for 4 people to share. Love the salsa because I like spicy and it has kick to it! The bizarre thing is you can get right in on the weekend because it's more of a lunch spot being downtown. I would recommend it! Nice quiet atmosphere for a weekend night.", "business_id": "-lOSaCuBRAvX5JBifx-EMw", "stars": 5, "date": "2014-09-06", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "7_CGN5ytagrHZANPvSOwvQ", "review_id": "11yqUlNCS9miIrR5U7pPeQ", "text": "Its been years since i came to this hooters.  i used to go here every time i visited my sister in AZ or my friend a ASU.  South Park Wednesdays were the best. 25 cent wings, and south park.  cant go wrong!!", "business_id": "qsWxbgQwuomXvMseg23DGg", "stars": 4, "date": "2007-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YpnjHpP8tGOlPRyiFQANUQ", "review_id": "kXvGtJbIqeLyLbHd_4jlyw", "text": "Horrible service the waiters are ass they see you and don't even get your drink or order !", "business_id": "qsWxbgQwuomXvMseg23DGg", "stars": 1, "date": "2015-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "thdVzCfKx-DV0zYWqId3pw", "review_id": "87dFLz3no7v3jKgtX5pbBA", "text": "I've actually never set foot inside this restaurant, so I can't comment on the place itself. But every now and then we've picked up orders from Old Spaghetti Factory at work, so I can comment on the food. \n\nThe entrees are as basic as it gets. This is definitely \"family food.\" Most adults won't complain about it, and kids will enjoy the simplicity. I recently had the Old Spaghetti Factory's Chicken Parm. I won't call it bland, but it's nothing that the average home chef couldn't cook up for their family. \n\nI will give the place credit for the portions. It's not expensive and you get a lot of food. While the chicken itself was not huge, it comes with Spaghetti, an entire loaf of bread and butter, and a side salad. The salad was way too plain for my taste, but at least I had a little bit of vegetables to go with my meal. It's also quick. Take out orders are almost always said to be ready within 10 to 15 minutes.", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 3, "date": "2010-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Unu4WvrxWAAC_oDliuTHtg", "review_id": "ZczC23otg2rpAcn2xalO7w", "text": "When you eat there, you got to think of two things: \n\n1. Do I want to eat at a historical Victorian house that breaths rustic history?\n2. Do I want good memorial Italian food? \n\n1. The place is awesome, very big and large, filled with low lighting (Keep this in mind) and a lot of historic decor. Wooden floors that creak and crack, and memorabilia on the walls. Sadly, this doesn't really do justice since the food was plain 'Meh'\n\n2. I had better food. In fact, the Olive Garden serves better food then this place. The Chicken was warm inside out and the meat sauce tastes a bit sour, like it was getting bad. My SO had the meat balls, but the low lighting made it hard to tell if it was cooked our not. After opening one of the meat balls, it was a bit red. A Manager came and told us, this is how it is due to how the meatballs was cooked. \n\nLike my 2 star rating indicates, I've experience better food. If it wasn't for the decor, I would give his a 1 star, but the feeling of eating in a old house feels great. It's just too bad we had to eat this kind of food here. \n\nAs for the service, it was okay, not too bad or too good.", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 3, "date": "2014-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9bfoylR5aWWdYarIt-6Nfw", "review_id": "-ehQZmNn26J3M04empkmlw", "text": "NBC could care less about those of us who cannot afford cable. The Republican national debate is only available to those with money. Thanks NBC.", "business_id": "1AuFwptM7GER1R4eu08xKg", "stars": 1, "date": "2015-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cfUTbVcVh7XFULNR-MEZdw", "review_id": "wEUOPZ0RM6-PHagW5A8VsA", "text": "Cold fries, mediocre burger with with lettuce, tomatoes and onion on the side. Wilted to the point where I didn't want to touch it. Service was horrible. Little to say....", "business_id": "2I666dqzs1XB6xigIKa9bA", "stars": 2, "date": "2014-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "a1xnEJP6IZbpM4pCSI_5QQ", "review_id": "SKnXbLaYr7xNgBSm9rxMpA", "text": "My very first review - my dark blue car ruined on the exterior.  Couldn't see it until I returned home and the sunlight revealed exterior body scratches.  Evidently they didn't take care to use clean rags/towels.  Looks like a Brillo pad was used.  Going back tomorrow to see if we can get this rectified.\n\nWell, I'll keep my review the same.  Took my car in this morning to see what could be done.  A \"charming\" older woman (JOVEL) came out to tell me this was definitely not caused by them an it was without a doubt caused by a buffer.  I explained to her that a buffer had not touched my car since it was last detailed by European Detail over six months ago.  To my face she told me I was not providing the truth and if I took it to a BMW dealership they would also confirm I was \"lying\".\n\nGuess what!!  BMW confirmed that the damage was likely caused by rags because of the linear motion that was apparent.  Rick was the gentleman from Los Olivos who accompanied me.  When he also learned that perhaps I wasn't lying as JOVEL had certainly alleged he offered a re-wash and a had wax to correct the problem.  Thank you Rick for obeing a professional.  \n\nEven upon return to the Wash JOVEL was still had her heals dug in refusing to acknowledge any error on their part. \n\nAlthough the business has taken a turn to rectify it was like pulling teeth or pleading a case before the the Supreme Court.  Not acceptable.  \n\nAgain kudos to Rick as a gentleman and professional.  If this was his site alone I could raise my review substantially.", "business_id": "Li5LOL873Ep8HoPRML18sw", "stars": 1, "date": "2013-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1Ryrpx7M4ziOAcQoScfNRQ", "review_id": "ZRMPwd8Yt3pVnFv9IdsKnw", "text": "Love love love this place - the only bad thing is they have 1 location -\nI drive all the way from N Scottsdale to downtown Phoenix for their fresh deli sandwiches.  I always get the poor boy with everyhting...they always put the right amount of dressing and veggies and of course fresh meats - it's huge ! so come here with a big appetite - one of the truly REAL New York style subs...going to get one right now ;)", "business_id": "9BH18avE46LlHMvJn67MaA", "stars": 5, "date": "2011-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kI1MoLcExqwmK7wcT5Vy1w", "review_id": "1vwaHenaX_JIf3X_vdSr5A", "text": "I crave Zoe's when I'm in the mood for something light and fairly healthy. I love their chicken salad and tuna salad. Both are pretty much just meat, mayo, and salt/pepper/spices, I think. No onions and no mustard make me a happy chicken/tuna salad eater! I also love their pimento cheese, feta slaw, and potato salad. The chocolate cake, though, is what hooked me onto Zoe's in the first place. It is basically a Texas sheet cake - moist, not too overpoweringly chocolatey, with that boiled fudge frosting that soaks in and seals in the goodness of the cake. {Droooool}", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 5, "date": "2011-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XKLeOYO9qlKMFlGCPqDlng", "review_id": "UAQWeUtBcpcfXwS8GoyMhQ", "text": "The one star is for the fact that the poorly trained staff are trying their best. I asked for a milkshake, not once but twice.\nWhat did I get? I got 2 cups of ice cream. Seriously? \nNo one here knows the difference between a cup of ice cream and a milkshake? Apparently not because the female manager said that the cup of ice cream is a shake!\nI hope corporate sees this. I've been to two of your restaurants (McDowell and 3rd Street) and (7th street and Buckeye) both have sucked.", "business_id": "VCQ3VvnVRhibTT8J61xWkw", "stars": 1, "date": "2015-11-14", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 1}, "user_id": "WKzBtp4-XKCvzS4jbjPy8w", "review_id": "NryUmiLJNxuF8rICoZXSVw", "text": "I went to hooters, then came here. I don't care how big hooters is, Hard Rock Cafe is in a hole mother league! You guys rock!!! Sorry about the shitty tip.", "business_id": "gkv2XvXpFgiq4Bb2XK7YmQ", "stars": 5, "date": "2013-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CL1ot3kl6ZZWIgt1ANKdzw", "review_id": "DcQZkaZMfl8khFu6C9yCpw", "text": "I would literally give this Mcdonald's zero stars if I could, I work 1/2 mile away and sometimes when I need coffee and don't want to go into Starbucks because it is too busy I decide to go here. I ALWAYS REGRET IT. I just got an iced coffee and they do this to me every time and i shouldn't be shocked anymore, but I order an iced coffee and say \" can I have less than half of the cream and sugar you add\" they usually get confused, so i rephrase and say \" can I have a light iced coffee\" they know what it means because it is on the sticker on my cup right now... and my coffee is literally white... so now it is going in the trash and I just wasted $2. I don't need diabetes in a cup, but thanks anyways McDonald's.", "business_id": "xH5axHFadmc7Veutt376TA", "stars": 1, "date": "2015-10-07", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "HZeFzs42f0iGaA-sP_hUnA", "review_id": "b-nJdF4Dm7L4yiaWWadJTA", "text": "I'm not generally a fan of chains, but sometimes I eat here.\n\nThey follow instructions well. I can get something relatively healthy to eat, with little fuss, and it tastes pretty good. The personnel are polite. The food is fresh. It's clean. It's close to my house. The foot long chicken breast is $5, and they don't act like I have horns on my head when I ask them to remove some of the bread from the middle of the roll. The subway sandwich toasting machine is fast and nifty. I'm a fan.", "business_id": "Vvh2Hd4SsZjEEfKLNKAEWw", "stars": 4, "date": "2008-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AqwiBcQcQpCvlQ5KtYuH4g", "review_id": "snYARDPpRpSJqQ9AHp-SgQ", "text": "Food is ok but can you spell S L O W?  During a busy lunch rush you would imagine that sandwiches could be made quickly. Waiting 15-20 minutes is ridiculous. And I beat the crowd!  Still waiting...finally got my sandwich and it was not what I ordered!  Plus $7 for a half sandwich??", "business_id": "wki-Qlp3OWgH0XtZ-Jz_WQ", "stars": 2, "date": "2015-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_tVI6-YW4917BSzKodlpOQ", "review_id": "jLy3rxjW9apXD6YUc3gh9w", "text": "I love coming here I think it's one of the hidden gems of the city. There are great restaurants. But mostly I love the scenery . They have done a wonderful job of creating a tranquil environment. I consider this a great place to change it up and visit you can be alone and read , snap I grew photos  for fun, and even a good place to prolong a date. As you walk into this amazing courtyard there  is a fountain, a lot of lit trees, flowers, benches, and soft modern contemporary music playing in the background. Bring a date here and all the work of ambiance is done for you.", "business_id": "JIV4LF8KE8pAUnU28QAhIw", "stars": 5, "date": "2012-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wUEp87FqOB9ew27Iz6zk_w", "review_id": "x5ZdicN9xbYI6AFUT7By_Q", "text": "Haven't eaten at a Schlotsky's in years.... and now I remember why.  This location is really close to my work and would be so convenient to eat lunch at, but I just don't like the food!\n\nI ordered a half sandwich/salad combo lunch meal.  The salad was actually decent, but the sandwich was bad.  VERY little meat and cheese and way too much shredded lettuce.\n\nOn top of that, my meal was more than $9, which is pretty ridiculous considering what you get.  Won't be back, and unfortunately still looking for a convenient and tasty lunch spot.", "business_id": "QAe9UHKsxPdXQovBpaznMQ", "stars": 2, "date": "2013-10-21", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "iEZfMGszjIV7NHNhk1pRRA", "review_id": "GNvsgO-2bYk_n2Ux05cGzg", "text": "It may look like a fast food joint on the outside but this place is local Arizona BBQ at it's tastiest. \n\nI ordered the 1/2 lb. pork rib dinner ($11.49) which came with two sides. They ran out of collard greens so I settled for two corn cobs.\n\nWith the ribs and corn my face and fingers are super messy from the sauce. Good thing I'm eating alone. The ribs were super delicious! I wanted to cover every bite in their BBQ sauce. It was that good. The sauce was slightly tangy with just the right amount of sweetness. Honey Bear's calls it Tennessee BBQ, but here in Phoenix it's oh so good.", "business_id": "q1nDSpmV-FdTBNj6UuZvTg", "stars": 4, "date": "2011-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eft2HBDixzHGeS4Qh0XWvA", "review_id": "pOQ1JCzZup_9mFkqfq88AA", "text": "well I went to honey b. and the staff was exactly how the other reviews portrayed them, looks like they are family business own so I will assume that they are brothers, the guy at the register was distracted w his cell phone and also short when I ask for substitute but thats ok, the food was ok nothing that I will refer friends over to go out their way but they are working on the customer service per comm. below and above so that is good.", "business_id": "q1nDSpmV-FdTBNj6UuZvTg", "stars": 2, "date": "2014-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "g9Lx2D4fYM4Ld2uMO41HTg", "review_id": "jZeBtUIvR8RYs0IwktVQXQ", "text": "I really liked this place!!!! A group of us were headed out to dinner on a Sunday for my Birthday in September and figured we head down town...Well nothing was open!!!! No Portland's, not Lisa G's, not Pasta Bar nothing...so after an hour (literally) we settled at this place...now we had no idea what to expect, but here it is a nut shell...The food was great, the service absolutely amazing, our server made some really thoughtful suggestions...The wine and beer selection were totally unique, try the pumpkin ale they had on tap...Their cheese selection was large and all the right regions (France/Italy/Spain) were represented...and your server will no doubt help you out making a selection. The desserts were actually out of this world...The pumpkin bread pudding was literally sinful! It's a must, but I have a strange feeling their desserts change regularly.. Anyway point is that place is really chill and its got a nice \"down town\" vibe...Cheuvront and Kazmirez are worlds apart in food, crowd, and service...I don't really like to compare them....actually the only thing they have in common is that they both sell wine and cheese....\n\nOh, and they offer 25% off of Bottles to resturant industry workers!! Way to be!!!!", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 4, "date": "2008-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8HB1_ZRxZi027-SKZssNlw", "review_id": "_3k5GVpfLqCRVIMtaeK7aA", "text": "A few months ago I wrote a very positive review of this place.  Starting about in September, however, something very odd and unpleasant happened to Cheuvront.  The lunch service became slow, to the point where I thought I'd been forgotten.  Worse, the food started to change in unpleasant ways.  Gone were the good ingredients and subtle flavorings.  Suddenly everything was layered on in huge blobs and weighted down with unnecessary spices.\n\nSpecifically, I'm talking about the lunch pizzas I had for lunch at Cheuvront so many times before.  Last time I went, a few weeks ago, I suddenly noticed that they used nearly four times the cheese necessary.  Today, there was four times the cheese, at least two or three times the sauce, along with chunks of nearly raw garlic.\n\nWorse, the cheese on my pizza was cool and congealed, showing that it had been sitting around for a while before the wait staff deigned to bring it to me.\n\nI was embarrassed to have suggested to a colleague that we eat at Cheuvront today.  I don't know what happened to this restaurant, but at least the lunch service is a total loss.", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 1, "date": "2010-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "RwvKEUIt4TYA9iTkBUQjFg", "review_id": "TZIyuGOwX7EuYuET3lyo6w", "text": "I just had to go here to check out a place owned by Alice Cooper.  I ended up getting a meal that was good and gulped it down with a nice beer. A bit dark but hey, its a place for rock stars.  Try to avoid going there where there are major events at the stadium- the streets can get nasty.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 3, "date": "2006-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hQxx3VixUBVmqDPCJBnBvA", "review_id": "SGIbXsllaT8N4QwoBl1xrA", "text": "Although the food was good the excessive price of the experience left me wanting more.  I ordered the macaroni and cheese, with chicken, for $13 - the portion was ok for the price, but less than an hour later I was hungry again. To drink I ordered the microbrewery SanTan Devil's Gordo Stout for $5.50. This was a very sad beer; watery, flat, and slightly sweet - over priced at any amount.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 3, "date": "2011-10-13", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "gzJpPaHN-NXBkAZcZri3hw", "review_id": "BbRTBDuzE6Asi1iYprVVVg", "text": "Hoh. How I miss the beloved bacon, egg and cheese from NYC. It's a delicate balance that's hard to explain to someone that hasn't eaten one. Some prefer their sandwich on a bagel, others on a croissant. In my last years of Manhattan life I leaned towards toast. So when my eyes feasted on a menu item called \"The Patriot\" I paused.\n\nCrispy Bacon? Ok!\nFried Egg? Ok!\nMelted CHEESE? OK!\nON TOAST? Alright! \n\nLet's try that!\n\nI was hopeful but figured \"Meh\". I was at a sports bar after all on a Sunday. At worst bacon was involved. Out came a heavenly surprise of gooeyness that pleased my palate. I almost wished I had a hangover to test this puppy out. (Bacon, egg and cheese had in my city living rescued me more than a few times.) But, no. I highly recommend this breakfast delight. AND it's beyond reasonably priced! ($4.99)\n\nI visited this bar/restaurant with a group of eight to watch football on a Sunday. There were quite a number of televisions. (In fact, I hadn't realized there were TVs above me.). It's also a really neat place if you're a fan of, obviously, Alice Cooper. The memorabilia covers almost every inch of the walls. I'd recommend enough time to peruse.   \n\nAlthough the food was far beyond what I expected I can't grant more stars. Our service was not ideal. It was rather difficult to obtain any service. (At one point we were flagging down our server as though we were waiving in an airplane.) We did have a reprieve when a gentlemen stepped in who was quite knowledgeable about cocktails. I wish *he* had been our server.\n\nI found it strange given that the restaurant wasn't crowded at 10:30am (yet). Had there been a packed joint - sure - I get it. Also, our table wasn't bussed unless we would ask for plates to be taken away. (And some plates were left to die. Perhaps to compost. We never asked for those to be picked up soooo....) When people order coffee bring them creamer. (Or ask if they want some.) Another example of a service gap: If one person places a food order it would be nice, just as a suggestion, to ask the rest of the table if they're interested in placing a food order. \n\nThere was one other TERRIBLE thing worth noting. \nAs such, I've left this at the end of the review. PARKING.  The following is just an FYI. The lot out back is NOT owned by the restaurant. (I inquired on the way out.) I think this is important however as there's no differentiation to a consumer when you arrive to the restaurant. \n\nMy experience parking was so heinous I filled a BBB complaint. (Yeah, *that* bad.) And I devoted a Yelp review to it as well (here: http://www.yelp.com/biz/arena-park-place-l-p-phoenix#hrid:yi7CY8WilX73OYj7Tl6YjQ) If I had a choice I wouldn't park here. But it is right behind the restaurant. Just be aware of potential customer service issues.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 3, "date": "2013-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r0M3AaodrGa9qFNqeeevgw", "review_id": "YEXy6CGPdGatC2UuA5EYUg", "text": "We are DBacks season ticket holders and like to eat before the games at different places by the ballpark. We had bad service one time before at Cooperstown when they forgot to call our table and they put us outside in the corner after a 2 hour wait.  We heard there was new management so we came for another try.  When we sat down we waited 15 minutes before waiter came by.  He rudely said \"sorry I'm busy.\" This time was worse then before.  We ordered the $17 brisket and turkey breast for two.  We got 3 slices of brisket and 3 slices of turkey.  We sent it back and the food runner got pissed and gave us attitude. The manager came and said sorry but we are working on our portions and when I saw that go by I was concerned.  But he didn't do anything until we complained. We left and the one thing I think sizes it up is that they didn't care. So disappointed!", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 1, "date": "2014-09-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "nVmNnpfUCLOq9oIxVdnVbQ", "review_id": "RCu569kk9Q4LLdwfcl1pSg", "text": "For lunch I grazed at Alice Cooperstown. I had No More Mister Nice Guy and Desperado playing over in my head. I was not brave enough to try The Big Unit hotdog but several patrons did while I was dining. The portions are generous and staff is helpful fast and friendly.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 4, "date": "2015-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UsShQth4ThCaxi5rvxGRKA", "review_id": "_Q9aJWZxtQin5Wyos4HHUQ", "text": "I work for a photographer (Kym Ventola) and we get a lot of inquires through the wonderful ladies at Bentley...Riette and Corinne. Both are absolutely amazing to work with. We had the opportunity to check out the space recently and were blown away. SO beautiful and the perfect spot if you are looking for a loft style venue.", "business_id": "6apEKjkj5j1W1sS1dSwWyA", "stars": 5, "date": "2015-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZogE_bNZLuHgEQUR7W2rzg", "review_id": "F5GUjr0pnOYqN3hhmf5xdA", "text": "I came to Phoenix on September 10, 2014 for the Carnivores Tour...AFI, 30 a Seconds to Mars, and Linkin Park. I was there as a VIP through Adventures in Wonderland. I can say that parking was close, easy, and cheap. It wasn't as hot outside as I'd been expecting and the AC in this venue really works!  I could have used a hoodie!  If rather be too cool than too hot though so that isn't a complaint. The band that had me as a guest were all wearing layers of clothing...even hoodies with the hoods up! The public areas I saw were all very clean. I spent 95% of my time backstage, in a dressing room, or on the stage. These are not public areas but they were clean and easily accessible. The private bathrooms in the dressing room was large and had a shower...probably a necessity for sweaty performers. I was in a wheelchair and everything was easily accessible for me and there are many areas in the venue specifically for people with disabilities. There were lots of food options including beer/wine. All in all, this was a great venue and a great show!", "business_id": "uFJwKlHL6HyHSJmORO8-5w", "stars": 4, "date": "2014-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5Aqezt6V3W0BjJeyBP45xg", "review_id": "sesj7YPVz9SYfCOrZyDmYw", "text": "Moths in beer and highly priced burgers. We had a coupon for free appetizer and once they took it out of the bill it was only two bucks off! How in the world an $8 coupon for being in their reward becomes two dollars off. Had a better time at other eateries. Definitely not worth the drive or the food.", "business_id": "1-1VcGTL3GyCqUpXZLFTZA", "stars": 3, "date": "2015-10-24", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "NLDDaat42UQXQCOpU4e2TA", "review_id": "iITGoyG0irXXVcS4uTTzcg", "text": "I am a total sucker for quaint bungalow style homes.  (I used to own one, a Sears Bungalow, 1920.)  So this adorable bar/lounge had me as soon as I walked onto the wraparound porch and into the front door.  I could smell the character.  This is a wonderful venue for a date, or, in my case, for a small group of friends to gather.  It has ambiance and then some!\n\nYou know that friend of yours who has the great cocktail parties?  That is what it feels like here when the bartender asks for your order.  No positioning to get to him, no yelling your order to him.  He's right there...all for you.\n\nWow.  I am getting nostalgic here, so let me close with these couple of important details:  1) The wine selection was small but the wines were good, and 2) the cheese/cracker/olive food pairings were quite good.\n\nI left feeling that I had just had a wonderful experience.  Interestingly, there is a bar/lounge in Raleigh, North Carolina that I still remember fondly, years later, because it gave me that same feeling.\n\nI cannot wait for the opportunity to return.", "business_id": "JR95uaM82xBUIZ-kQ785iA", "stars": 5, "date": "2010-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a09ENYogqRn0sQ8J2D_rng", "review_id": "iXrn5lGemAih7gl8XyRxRA", "text": "My baby turned me on to this place.  I love it so much. Such a good place to eat", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 5, "date": "2012-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7o6OfRHsmcv44R1CjAh8dQ", "review_id": "cc6F98xOEOBNwy2c7I4q7g", "text": "One of the best places in Phoenix to take kids, especially when temp gets hot. Not as large or innovative as the Exploratorium in San Francisco but an excellent time. One day should be plenty for the kids to see everything. Season passes are worth the money. Wish they would change the main parts throughout the year besides just the special exhibits, I would give 5 stars then.", "business_id": "MwmXm48K2g2oTRe7XmssFw", "stars": 4, "date": "2013-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "knkoKibrCtg1aQ9rFrDHtQ", "review_id": "R6dGZCekEK7HoBquK9JUPQ", "text": "Went here two days while in Phoenix. We are members of a reciprocal museum so admission was free. My main companion was my toddler in need of an air conditioned play area away from the August heat. Most of the venue is more for slightly older children, but my kiddo enjoyed the concrete water play area and the home builder exhibits. I wish there was seating in the water play area - only a concrete wall to lean against. Some tyrannical older children who are allowed to roam wild without parent supervision can ruin areas or a day here.", "business_id": "MwmXm48K2g2oTRe7XmssFw", "stars": 5, "date": "2015-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "b4C9E7vTJrOdkJQA86xYSg", "review_id": "wTdOmQDsPBotxRJ57KnkcA", "text": "Their chips and salsas are excellent and very spicy.  I always get the same thing on the menu... it is a combination plate with a beef taco and cheese enchilada.  The beef taco is yummy... I think they mix potato in with the beef.  I really like this combo although some people do not.  Everyone I have brought here absolutely loves it.  I told my mom about this place because (she is a local restaurateur) and she loves this place too.  That is saying a lot coming from her:)", "business_id": "hWhVP-28LYP3llaMlAJ_JA", "stars": 4, "date": "2007-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "O2EjnYZeOxyewoldnHYnOg", "review_id": "Ea33hYpFc27ifyI2C7-UkA", "text": "First impression walking in was definitely how clean it was. The food was good and didn't taste like every other Mexican food restaurant out there but had a more authentic taste to it. The drinks were really good too. The service was not the best but it wasn't bad. I recommend trying this restaurant at least once to form your own opinion.", "business_id": "hWhVP-28LYP3llaMlAJ_JA", "stars": 3, "date": "2012-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "touVic_E7zgSH29CO8dL4A", "review_id": "j6e91x6YoGMuy3v3MjPcoQ", "text": "Had a Manudo with a knee of a pork. It was tasty, rich with ingredients, and good amount. Expected a bit different feeling with the knee, but was pleased. real pansita in Mexico is a bit more tasty. Here they also serve it with lemon not lime. \nThe salsas they make: the green one - really good, the red one is precooked and a bit too mild. \nMichelada was great! \nTried also a piece from combo, normal enchiladas and clasic tostadas. They had great red salsa with it, but otherwise pretty mild in taste.", "business_id": "hWhVP-28LYP3llaMlAJ_JA", "stars": 4, "date": "2015-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "igmAKlR86SMh76Yz-EsYOw", "review_id": "YaQ2EPRZl6mTiYH3vb3WDg", "text": "This has absolutely become my favorite bar in Phoenix. There are some weeks that I go multiple times. The atmosphere is so relaxed and inviting. Whether you want to dance and dip or unwind after a long day you can do either here! Will always be my number one choice!", "business_id": "c6sTwXAwIAgf2YQtA4ZWHg", "stars": 5, "date": "2013-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jAO9zgmbTXk4LaTxdSP_TA", "review_id": "maIxxz_2Az1OL9e4umcd9A", "text": "Amongst the worst fast food burgers.  A step up from Sonic, McDonalds, and Jack in the Box, but not nearly as good as the others.  \"Not nearly as good as Burger King\" ain't the biggest selling point.\n\nWhat in the world is that crap you call a bun?  Easily the worst bun on Earth.  I've had better bread in Africa, no joke.  A step BELOW wonderbread.  Heck, a step below stale wonderbread.  Awful.  You know those burger buns you get in an 8 pack in the grocery store that are all stuck together?  The things you buy because you feel lazy or are strapped for cash?  Those are ok.  Whataburger isn't.  It's far, far, far worse than that.  Look at these pictures.  The bun is like play-doh or a circus peanut.  Gross.  Did you read the part where I said it's worse than food in Africa?  Because it's worse than food in Africa.\n\nI've been here over 10 times because it's open late and I worked third shift for a couple years.  Well, I don't anymore and I tried this place for lunch at noon.  Still awful.  How the heck could anybody like this place?!\n\n2 stars because it isn't McDonalds, although McDonalds has better buns.  But I'd still literally rather get punched than eat a burger with a McDonalds bun.\n\nWhataburger: Worse Than A Punch\n\n\nedit to add:  Also if you go to the drivethrough, expect to wait 20 minutes if there is nobody in front of you.  If there is, play a few hands of solitaire on your dashboard.  Slow as hell.", "business_id": "ixTr1qXUFGTzyaZUuCDDvg", "stars": 2, "date": "2014-11-01", "type": "review"}
{"votes": {"funny": 4, "useful": 6, "cool": 4}, "user_id": "Lp_Ykqfbv5Q-oyGYlMGJRg", "review_id": "Gu4Us58b1NmSqMzUIY9IZg", "text": "I don't know about this place.  They have all these great wrap sandwiches but the salads seemed like an afterthought.  And I try to avoid food carbs, cause I need them carbs for drinking!  So I got the Greek salad and it just seemed plain to me.  I loved all the kalamata olives and abundance of feta, but flavors seemed to be lacking.  Maybe I'll have to get a wrap next time.", "business_id": "ZoQAOnEFnyHjSpomtfqesA", "stars": 3, "date": "2009-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Iycf9KNRhxvR187Qu2zZHg", "review_id": "H74KJByESDDQ_iYlRwTNfg", "text": "My Dad and I went to get some latin food.  I have been before so I knew what to expect.  This place has really good authentic food at a really good price.  \n\nI got the Posole which was excellent and a huge portion and I got a beef tamale.  I also had the cantaloupe drink and it was awesome.  \n\nIf you haven't been you gotta check this place out.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2010-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3FxBKOfxH1I12KFueQV9ug", "review_id": "9xbMpog_KO9YfvNNY07BwQ", "text": "I have been using Thunderbird Trophies for T-shirts, hats, jackets, window stickers, decals, trophies and other business marketing materials for many years. They always do an awesome job at reasonable prices. I highly recommend them.", "business_id": "WZZK_F66iPuLp9jeFCeKDA", "stars": 5, "date": "2012-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "raMSkwLdZ-kFea1fTY_-Ew", "review_id": "jx2t1MvYx1-3gmsYWNzrkw", "text": "Gosh, there was so much hype about this place that I was expecting a LOT more.  Very small gallery and the space itself seemed kind of run-down and not that clean.  They gave us wine, which is great when you go art-hunting, but I was not impressed with the art either.  Yes, I'll go back...to support the local arts, but this place needs some cleaners and a landscape and interior designer to spruce it up!!", "business_id": "F3L3UuWJUez6ybJr4y5Agw", "stars": 3, "date": "2012-10-11", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "Ayghyizl2eih8jTsKHWguA", "review_id": "tMY7gp8UklhcsZ0QuWhc0A", "text": "Fantastic hole in the wall (hole in the trailer?) restaurant. Great relaxed vibe, with good old bluesy southern music as a backdrop to the even better tunes of familiar conversation. I loved how hometown it felt. This is definitely a place where strangers become friends.\n\nFantastic service! Our server was Brandon, who was so helpful in making sure my meal was vegan and describing every delicious detail to us. Upon leaving, every employee waved and thanked us for dining. So nice!\n\nOn to the food...fantastic. I had a veggie burger with fried avocado on the side. Life changing. My boyfriend had the classic burger and fries, and loved it. I can't wait to come back and try the vegan po'boy.\n\nI'm really excited to be a frequent patron of the Welcome Diner. So happy we found it!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2013-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aChvMWkO8cO1wfTRdOSYUQ", "review_id": "87rgFVylI3JaN-DnHIvs2w", "text": "Great food. Great little whole in the neighborhood.  Great people.  Recommend to anyone looking for good food in Phoenix.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2014-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XBBcS4-eB28xwaXl_iLEEg", "review_id": "tdWIQAXp_XnLdN3mhRTSDw", "text": "Definitely my favorite diner in AZ. Such a friendly staff! And the Hurricanes... BEST DRINK omg! This place is a must if you are in the neighborhood!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2014-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DVqigFeLodiysUezvQRkGA", "review_id": "YpObbTYPKgE19Nr9wR-eoA", "text": "PB&B was surprisingly delicious! I would have never thought peanut butter on a burger would be delicious, but it's super tasty!! Their fries are crispy and taste like real potato. The second generation cocktail is really good and I can drink those all day!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SF_AJttxGXU7H6t-N4zaMQ", "review_id": "txeaHjZT-Zt9TTwfEAfrbg", "text": "Burger was really good tried the fries they werent bad i like set up. Like that it didnt taste like a regular burger", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 4, "date": "2015-11-24", "type": "review"}
{"votes": {"funny": 3, "useful": 6, "cool": 4}, "user_id": "0bNXP9quoJEgyVZu9ipGgQ", "review_id": "uQMaFFjJhbgbb6Y6qNB2nQ", "text": "PRM is the place for Inexpensive fruits, a great-tasting torta (pollo deshuesado), refried beans, and succulent barbacoa y carne pastor.  Grab a strawberries and cream cup by the juice stand.  it's a great way to end a very tasty and satiating meal.  If atmosphere isn't important, save yourself mucho dinero by skipping Tradiciones and eat at the food court.  I tried to dine at the seafood counter twice, but both times the kitchen had just closed.  \n\nTo elaborate on the pollo deshuesado- I believe it's chargrilled chunks of chicken (wonderfully marinated and perfectly caramelized) with slices of tomato and crispy lettuce on telera bread.  Ah, telera!  So, so good!  I don't even recall any condiments added.  Just chicken, veggies, and the bread.  \n\nWhy not rate PRM five stars?  Two reasons: \n\nBad guacamole- it tasted like water- so thinned-down, and yet at the same time had a congealed look about it.  PRM should be ashamed of itself for serving such a sub-par product!  Oh, well.  I shouldn't eat avocados anyway... \n\nRice served has corn in it-  It's also served this way in the formal restaurant Tradiciones.  Don't get me wrong- I love corn, but my immune system does not.  Why not offer plain rice as an option?  Rice and beans make a perfect protein combo  Why deny me of it?\n\nAt least I can always look forward to the tortas.", "business_id": "VXIkI9_EbDbYHeO9IzKjJg", "stars": 4, "date": "2008-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qiD7GHidIC89qGaiUTy9Og", "review_id": "QE9AVoDT02BNVPurVOaIBg", "text": "Gotta once a week for lunch.  Chile rellenos and tamales are to die for.  Throw some of those freshly made warm tortillas and I'm in Mexican food heaven. \n\nBakery is excellent.  Still trying all the different treats. Half I don't know what they are but they are good.  \n\nThe staff is super nice and helpful. Always clean.  Kind of has the feeling of being at a bazaar.  Love it!!!   Glad it's on my way home from work.", "business_id": "VXIkI9_EbDbYHeO9IzKjJg", "stars": 5, "date": "2015-09-17", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "z1rVr91Jo7o3myTvT2qUzQ", "review_id": "jJxrjPGYUlp1Ps3i8rO7mQ", "text": "I used to love them, then they sent me a pair of dull shears. Then they sent  me a new pair , but it only took 2months to send me a new pair to the wrong address mind you. So decided to buy from someplace else.  Just got the new shears and am sending them back but  I HAVE TONPAY THENSHIPPING ON THEIR CRAP......  I'm through with ryans  and there's obnoxious shit....", "business_id": "Dj3i6a_vboALYTRKTmBABQ", "stars": 1, "date": "2012-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ghrJ6XmpeBhYqmIWT8PYPA", "review_id": "7HaIR_tuZrKeGgy7yBRP1w", "text": "RAINBOW DONUTS IN DOWNTOWN PHOENIX SELLS BOBA TEA AND SMOOTHIES.\n\nThat's all you need to know.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2010-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xIGZWNfRz_i31FxfVRB8cw", "review_id": "szI66p5kokxqAn4jIP3e_w", "text": "I'm changing my review after being here more then once. This dr office is absolutely amazing, dr and nurses take the time to really get to know you. The wait times aren't that bad. They tell you your appointment time as the check in time so you are not late which is awesome. I'm having to come here twice a week for monitoring of my baby. I have never waited longer than 15/20 minutes. Everyone is so friendly and helpful. I would recommend this high risk dr office to anyone that needs to see a high risk dr.", "business_id": "K4yExVqUtW2sRE4grXU8Zw", "stars": 5, "date": "2014-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 8, "cool": 4}, "user_id": "FHJUj7EHB9nB2czVOzQX3Q", "review_id": "qRH9PhwqQ1H4v99QWqOcfA", "text": "\"Phoenix Youth at Risk (now 'New Pathways for Youth') transforms the lives of at-risk youth through mentoring. We unlock futures so that youth in trouble do not become adults in trouble.\"\n\nPhoenix Youth At Risk is a non profit mentoring organization founded in 1987 to help at-risk youth of the greater Phoenix area redirect their lives with the help of adult volunteer mentors. The goal is to help kids and teenagers recognize and expound upon their potential as outstanding citizens.\n\nThey have two programs. The New Pathways Mentoring Program is a 9-month program consisting of one-on-one and group mentoring for teenagers who may otherwise fall through the cracks. The Positive Adult Leaders in Society (P.A.L.S) program matches youth ages 5-15 who are in homeless transitional housing with adult mentors for at least one year. \n\nHaving never mentored in my life, the thought of helping a child was intriguing and scary all at the same time. I decided to jump on board with Phoenix Youth at Risk nearly 2 years ago and was immediately paired with a wonderfully gifted teenage girl. The P.A.L.S program asks that you be able to commit at least one hour a week to taking your youth out for at least one year. You could simply take them out to lunch, out bowling, to a museum, to your home, or the like. \n\nYou become a positive influence in their life through just being you. It's an incredibly simple premise, yet one that can leave a lasting impression for years to come, for both mentor and mentee!\n\nJoining this organization was one of the best decisions I've ever made. There's no greater joy than helping a child see their full potential and I can say that the joy my youth gives me is the same, if not greater than the joy I give her.\n\nIf you want to make a lasting impression in a child's life, please consider Phoenix Youth at Risk as a valuable life changing experience for both you and your youth! They are ALWAYS in need of volunteers, but especially adult males willing to mentor boys!!", "business_id": "pf04_HoTlCMStImb3OMkig", "stars": 5, "date": "2008-10-07", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 0}, "user_id": "j4bxJyvIBwpL1KS-S65Mbg", "review_id": "io9tsr3nN9XeDFCMkpkh2A", "text": "Dr. Harry S. Tamm should be the example after which every promising, young doctor should model himself.  Dr. Tamm is the epitome of professionalism.  His Staff handles every aspect of the patient's care with as much genuine care, efficiency, and ability.  Dr. Tamm, himself, takes whatever time the patient needs.  He never seem to be in a hurry to move on to the next patient if YOU need more time or explanation.  He is available for questions, phone calls and follow up information, if the patient needs any of these services.  If you need a Neurologist, Dr. Tamm is the best there is.  I would recommend Dr. Harry Tamm and any of his colleagues at Phoenix Neurological to anyone who needs this type of Specialist.  He is, by the way, just about the smartest person I have ever met - in every way - not just medicine.  Doesn't everyone want a doctor like this?", "business_id": "cVxig7AVvbWkHh9ZyOQyfA", "stars": 5, "date": "2012-09-26", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "o33IBagNFxdJhIrRTl691Q", "review_id": "VfxIC1wYZE8RE6jQSA9A9Q", "text": "The Coronado Cafe seems to be real hit or miss based on the reviews below.  I can understand some of the points on the misses, but for me, it was a hit.\n\nPHX seems to be populated with several of these former houses turned restaurants/bars.  I'm a fan of their eclecticism.  It makes for a fun, intimate setting more often than not.  My dinner was tasty and cooked to perfection - no qualms there. But the wait staff was super meh.  I'm not a regular at semi-upscale places, but when I am, I certainly shouldn't have to pour my own wine.  It just seems declasse. And while we were the last two people in the place on a Thursday night, there was some definite tension in the room to get us to leave.  I don't know how long we were there after they technically closed, but it was a tad awkward.\n\nSo factoring in my experience with the rest of the reviews, Coronado sounds hit or miss.  But if you manage to get the right chef and right waiter combo, it could approach a five star experience. Who doesn't like a little gambling?", "business_id": "5-X03Zc0nN7U5eoe8uFUdw", "stars": 4, "date": "2008-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0YnT3uyhdF5_1M7Hel1Klg", "review_id": "5IqLXgYa97xMbi-U5xiCdA", "text": "Great ambiance - small, quaint, cozy feel. Great for couples. Fabulous crab dishes - loved the crab dip app and the open faced crab cake sandwich was amazing. And save room for dessert - best creme brulee in Phoenix and the bread pudding was great too. And incredibly yummy sangria! All around great experience - food, service & ambiance all get an A+.", "business_id": "5-X03Zc0nN7U5eoe8uFUdw", "stars": 5, "date": "2012-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "8p8HZNmrkUBtMx_vmW9dNQ", "review_id": "lHBUCorJ-4aTCKCqp4UDyw", "text": "Walking into MacAlpines is like stopping the clock and turning it back to the turn of the century.  You can get ice cream goodies there that you simply can't get anywhere else reguardless of price.\nMy wife and I have been here bofore but only for ice cream.  This time we ate at the little tables in the back.  Service was quick, efficient, and very nice.  Wife had a Reuben (she always has a Reuben which makes her an expert on Reuben's I guess.) She declared it one of the best she's eaten.  I had a seafood salad sandwich.  My sandwich was delicious.  \nBoth came with really GOOD potato salad.  I mean good!!\nAfter that we each had an ice cream soda.  A real ice cream soda.  Rose's was cherry with vanilla ice cream.  Mine was chocolate soda with Chocolate ice cream.  We were both stuffed to the gills when we left.\nTotal price: 30$ including ice cream, and drinks.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 4, "date": "2010-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LE6Yajmx2Db20gA99iu-IQ", "review_id": "47slLdaReOJplorNE_sBfA", "text": "I love this place.  I'm not much for the soda fountain offerings, but that's because I am always stuffed after I've eaten whatever I ordered.  I love the 'old' standbys...the egg salad sandwich and mushroom soup!  or the blt!   The wait staff is adorable.  And we get to do a little vintage shopping , too.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 5, "date": "2013-09-04", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 2}, "user_id": "2AGGIi5EiVLM1XhBXaaAVw", "review_id": "wYOn4gNjOpBezp9CS7YbMw", "text": "MacAlpine's, established in 1929, is a Phoenix treasure. It was still an operating pharmacy and soda fountain as recently as 1991, at which time the pharmacy side of the business surrendered to new era competition. Fortunately, the soda fountain remains. \n\nI'm awarding five stars, partly out of annoyance with snarky one and two star reviewers unaware of the spot's historical significance, but mainly out of love for MacAlpine's ice cream concoctions. Moreover, how can you not award five stars to the establishment where Wayne Newton was discovered in 1962? Note to the one and two star reviewers: Wayne Newton is an American singer and entertainer who is best known for his 1963 hit song Danke Schoen and more recently as a surgically enhanced Las Vegas headliner.\n\nI must confess that I'm not a huge fan of the food at MacAlpine's. How often do you read that in a five star review? Let me clarify. The menu is fine, but why would you want to risk eating a Sloppy Joe and not leaving room for a sundae? Another note for prospective one and two star reviewers: The ice cream at MacAlpine's is not hand crafted. It's basic ice cream, served in a manner consistent with the tradition of a soda fountain. Just as it should be. If you want Sweet Republic or Churn like flavors, go to those establishments and please don't write a negative review for MacAlpine's. \n\nMacAlpine's is amazingly kid friendly. Also friendly for anyone else who still has a little bit of kid within. There are roughly 100 flavors of soda from which to choose. One hundred!!! Want a sundae instead? How about Bears at the Beach, a Carousel or Dirt & Worms? They also have a variety of sundaes that cater more to adult tastes (if you must). Or instruct the waitress construct the customized treat of your dreams. The location on Seventh Street is an ideal stopping place before or after a downtown trip to the Science Center, a Dbacks game... Note to one and two star reviewers: Sure, there is a lot of dusty and worn old stuff on the premises. Just remember, you too will one day be old and worn if you're lucky enough to make it over 80 years (and it wouldn't be polite to point it out to you). I suggest you travel back in time and embrace MacAlpine's quirky nature. Be sure to budget a little extra time to enjoy the antique/vintage/retro store located on the premises as well.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 5, "date": "2015-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GlVIC6S7gs2MgWp89oDu7Q", "review_id": "06tF95cx7hneDAQkSUVr1A", "text": "Lots of flavor, their enchilada sauce is off the hook, order anything \"enchilada style\" and you will not be disappointed. Great food, great price.", "business_id": "Xo9Im4LmIhQrzJcO4R3ZbA", "stars": 4, "date": "2009-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qgjYyUiiJz5oPMGcBUxTNg", "review_id": "psPMRT0B0bFRTSeagaJgPg", "text": "I had the green chili enchilada style with rice and beans.... oh my heck.... so delicious.  Lots of great mexican food in Arizona!", "business_id": "Xo9Im4LmIhQrzJcO4R3ZbA", "stars": 5, "date": "2013-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kktEYkWTtbxFUhFFFBERxw", "review_id": "rfztivzzqb247TKJvyqD4A", "text": "I love everything they serve at this place EXCEPT FOR ONE THING THEIR CUSTOMER SERVICE. The ladies that work here should atleast have a smile on their face. Other than that the food is good the place is clean and neat.", "business_id": "9pYBiLe3k5Gi-AJqRklXcQ", "stars": 4, "date": "2015-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2nXVVKX3K4Httr7-IU1Rew", "review_id": "-dyBFg-hZGzkT5w4FH1S2Q", "text": "I was way excited to try this restaurant since it's so close to my house.  I just assumed it was one of those places that looked like a dive outside, but served up a piece of heaven inside.  Once I read the Yelp reviews, I was convinced I had made a sound real estate investment!\n\nMaybe my expectations/hopes were too high, but I thought it was just ok.   I liked the chips and salsa, and the service was friendly without being in your face.  We ordered a round of margaritas which tasted good, but were really weak in terms of the amount of tequila.  My father had the garlic shrimp and octopus which was really delicious--if I go back this is what I'd order--and I had the fish cuilichi was ok, just kinda heavy and not really something that got me excited.  The girly girl in me says, \"not worth the calories!\"\n\nI think I'll give it another try some time in the future--perhaps it was an off night.", "business_id": "NYBx4sdSVrN-I5Q8RfLMPg", "stars": 3, "date": "2011-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "xFG4Ca2HHmbxDTkMlmHnjQ", "review_id": "GfnuMnLhxx2w4tPvdx49kQ", "text": "This place is pretty good. The decor was great! The service was very good.\n\nThe food was good, but not exceptional. We expected the prices to be much lower than they were.\n\nOverall, it is good and we would eat there again, but we wouldn't go out of our way.", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 3, "date": "2012-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "z6EeZjvQS97V2KpzScaXnw", "review_id": "L8jRYiJDNz6sSV9XLXw_vA", "text": "My wife and I stopped here on our way through Phoenix on a road trip.  The food was really good and the margarita was tasty.  We really enjoyed the shrimp ceviche as well.  On our way back to the airport we stopped again for some food for the plane. The best part, the food was good and inexpensive! This will definitely be our go to spot anytime when we fly into Phoenix! Oh yes, the staff was very friendly also :-)!", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 4, "date": "2014-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "huimDarPpqW6JdgNmaIOcA", "review_id": "bQ3TObBADtIgihL3cFdt8w", "text": "Well worth trying!  \n\nGreat unique tastes in the heart of Phoenix. \n\nChips and salsa -- solid\nCeviche -- really good\nCarmarones Culchi -- this is the dish to order.  Sauce is incredible.\n\nGenerous portions, reasonable prices.  Nice staff.\n\nWill definitely return when in AZ.", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 4, "date": "2015-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "RknsoxpICgtuuv46uaTpyw", "review_id": "VsmsmJBf_raVMOJqhRElBQ", "text": "I remember going where when I was a boy scout. It was very fun and interesting. I love the desert vegetation and loved seeing and learning about what is what! I haven't been lately but we are planning on it. I would recommend going and if you don't have an appreciation for the desert you will after you go here.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 4, "date": "2008-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4qciXq3RqNXXbSXqiBrQ-w", "review_id": "thkIq2G0o6lAzKJmROc3TQ", "text": "I had NO idea there were THAT many varieties of cactus!\n\nThis is a great place to go during the day, when you are awaiting for your red eye flight back to the East Coast, you won't see anything like it east of I-95!\n\nTips:\n\n1. Try to go as early as you can, before the full desert sun comes out. \n\n2. Bring water, a hat or an umbrella (parasol)..it gets hot (see #1)\n \n3. Admission is $18, and an AAA discount is available.\n\n4. Bring a camera!", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2011-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lzzQ-pSFsP00aIH3bZgbAQ", "review_id": "P95_8fWdygZK5XvOan1KhA", "text": "Such a beautiful garden!  \n\nOffers a free day the second Tuesday of the month. I'm already looking forward to going next month when it's a bit cooler. \n\nThe have a neat activity for kids- ask at the front gate. \n\nThe gift shop carries beautiful pottery and art.  Great place to find interesting gifts or souvenirs. \n\nThe grounds are impeccable!", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2013-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "M_TBxBimBQUXVkt04PWCRA", "review_id": "RBi1Iyg8twKYJ3IEmAhHRA", "text": "2 visits in the past two years. It is quite beautiful inside the unique botanical garden focusing on local desert flora. Lots of placards abound to tell you the different names of the cacti, aloe, and agave. There are probably 5 sections to the gardens that take about 5 minutes or each to walk around the walkway loop. One focuses on I believe on hummingbirds so the plants attract a good amount of hummingbirds if you have the patience to watch for them. I thought that for the admission price, what you got what pretty fair. The grounds are immaculate, though perhaps smaller than I expected. Staff are friendly. Since it is an outdoor tourist attraction on essentially the surface of the sun, staff on golf carts run around hydrating tourists who will certainly not be prepared for such oven heat. \n\nThe Chihuly addition to the gardens I have mixed feelings. On the one hand, it adds some pizzazz to the grounds. On the other, it looks sort of forced, out of place, and more of a PR stunt to get tourists to come. Especially the glass swans in the small lake....I couldn't get down with that.\n\nCan spend as little as 30min here and as much an 1 hour. Make sure to take a break from the heat at some point. Stay hydrated and bring a water bottle.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 4, "date": "2015-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DryNT_e_ozlbNYX0DQfT-g", "review_id": "HgFWow0tf1QccJOu-2MP3Q", "text": "I come in here to get gifts for my sister who lives in Flagstaff and does not have access to this kind of store.  They always seem to have the things she asks for and seem well stocked. They have always been nice to me when I go in, but I see a lot of bad reviews here and I think I know why.\n\nThis store feels very much like the SCA, or any other historical-focused organization. In those sorts of places, you need to 'earn your respect', in a way.\nI'm not a jeweler and so they don't bother to look at me one way or another. \n\nBut If you go in this store as a jeweler, be aware that they are probably sizing you up when you come in. These people may want either evidence that you know what you're doing, or willingness to ask them questions and have them share their knowledge with you.  Those sorts of places can have little respect for amateurs unless the amateurs come in with a willingness to acknowledge the expertise there and ask to have some of it. \n\nThat attitude can come off as pretentious or demeaning, but really it's just a very old-fashioned way of thinking. And jewellery is an old-fashioned art.\n\nHopefully that helps if you are a jeweler in the phoenix area looking for some supplies. Don't go in this store expecting modern customer service, because most people in this site have not found it. Pretend you are in the Middle Ages, and you are an apprentice going into a skilled artisan's store. That artisan probably demands respect in a way most modern people don't. It may seem backwards, but you may be able to tap into their knowledge if you pay the price of admission.", "business_id": "0PO74pfETLFUs0AcdvdCdQ", "stars": 4, "date": "2015-09-02", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "xUxxoTkQNWbKU44cCbtY4A", "review_id": "gEv9QauBbj3Gq9gTsFT_8A", "text": "I'm so glad that there is at least one Asian grocery store in the valley. Unfortunately they seem to have a hard time keeping some of my favorite items in stock, I wonder if this is a result of some of the import restrictions/delays that have been a result of the recent quality issues with food and toys imported from China.\n\nI'm half Chinese and spent much of my youth being dragged around Chinatown near L.A. by my grandmother and 6 or 7 aunts. So the 99 Ranch Market brings back memories...some fond...some not quite so. But, at any rate, the prices are great and the selection is good and authentic (when it's in stock). The cashiers could use a little dosing from the friendly fairy, however. Then again, I don't remember many friendly cashiers or clerks at any of the stores I frequented as a kid...so I guess it just makes the experience all the more genuine for me.\n\nI would recommend going on a weekday, or, if you must go on the weekend, just avoid going around lunchtime. There's a dim sum restaurant in the same shopping center and the parking lot gets pretty jam packed with cars and pedestrians.", "business_id": "ozWBsvbeM2LSPsRDsYKr1Q", "stars": 4, "date": "2007-10-09", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 2}, "user_id": "drS3ZN6-zA3sr5WM2fG5tQ", "review_id": "D9MwU_NBiUdz02oF8X6NlQ", "text": "Oh how the oil changes creep up me every time!! Glad pep boys could be of service! Best part is, i did a quick search on their website and found a long list of coupons!! I love my coupons. Service was quick and friendly. Oil change with coupon was $24.99, not to shabby in my opinion!", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 5, "date": "2013-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_uL7OiQSfNsCd60DrAf7qQ", "review_id": "F7Xay8uX0RWnHd1VsR9NlQ", "text": "I recently had a work event scheduled at the Embassy Suites on 44th street, and unfortunately I was not 100% pleased with the experience. \n\nI first of all will say that the hotel itself is very nice, pretty, nice courtyard in the center, and the event room was set up well and clean. However the service was lacking quite a bit. \n\nFirst, when I got there I was the first to arrive out of my group, my event coordinator didn't get in that early and was not there to greet me or show me around, nor did anyone else bother to show me to the event room or how to get where I was going. I take that back, the girl at the front desk handed me a map and pointed me in a somewhat vague direction that didn't help much. I was told I would have easy access to the room to unload my car at, well without any employees to show me the access door I had to hoof my boxes from the parking lot around the building the long way. I did not find that back door until long after the seminar started. The room we were scheduled in was changed last minute for some reason, I believe  it has something to do with the final head count that we gave them. The room we ultimately in was a bit cramped for the number of attendees we had. \n\nI had to introduce myself to the catering manager and chef. No one came in to remove the places and trash from breakfast until almost 11 a.m. nor did they check on us. The boxed lunches weren't made right, only upsetting a few clients, but still.... I had to pop into the kitchen myself a few times and track someone down to help me. With the amount of money we were paying, it should have been perfect. For a cheap continental breakfast and a mediocor box lunch it was about $40 per head, kind of a lot. \n\nOver all my seminar went well at the hotel, but there were some behind the scenes issues that I really wish I did not have to deal with throughout the day. I wouldn't not recommend this hotel for you event, just make sure to cover everything prior to your event. Such as on sight contact, exactly how the food will be prepared, appropriate signage and whatnot. \n\n**I have not spend a night at this hotel so this review should not reflect on making overnight reservations.", "business_id": "LtJszEtHhXMZR0y6lbdswA", "stars": 2, "date": "2009-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wUEp87FqOB9ew27Iz6zk_w", "review_id": "_ElIIVS6FSE051k9qKD8vQ", "text": "came here last Saturday night with a friend. the food is very good and you get a large portion - I had leftovers for lunch the next day. my only gripe is that the naan was a little more burnt/crispy than I like. I will be back to try their weekend buffet though.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2012-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y8cJznzsIn39YM0jkQFhbA", "review_id": "s-5kqv9TZyL5JMD3Ln1HIg", "text": "Three words: chicken tikka masala. I've been to many Indian restaurants before and after eating here and no one even COMPARES to the chicken tikka here. We go for the buffet pretty much only for tikka masala! We ALWAYS receive extraordinary service, and the waiters always bring fresh, hot naan to us within minutes of arriving. ONLY complaint is that when we first started coming here years ago, there was actual cheese in the palak paneer. No more. There also used to be pistachios on the rice dessert. No more. I understand they may be trying to keep the price low, but I'd rather pay a little more and have the palak paneer made correctly. We will keep coming back and driving from Chandler because this place is always on point. Support your local businesses!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2015-10-05", "type": "review"}
{"votes": {"funny": 13, "useful": 14, "cool": 12}, "user_id": "hq0WUfau1Mh3GyHn8oVdNQ", "review_id": "NM8RlFnZgkXdrVQpN-adMw", "text": "Awesome Karaoke songbook, cheap drinks, and colorful characters to be found at the Breakroom. \n\nThis place is a hidden gem for Karaoke lovers if you can deal with the diveyness of the place. Yes, the place is a little seedy and in major need of a facelift, but honestly worth it if you have a serious need to get your sing on. \n\nThere is a small rotation, usually just 5 or 6 people even on a busy Saturday night - I think I got the chance to sing 8 or 9 songs last night. The host pre-programs a chunk of songs and walks away, so be prepared to grab the microphone the second you hear your song come on with no intro.\n\nThe crowd is a melting pot and the song choices reflect that. A little Marvin Gaye followed by Blink 182 followed by some rap song I never heard followed by Michael Jackson sung by some white guy with a Michael Bolton hair-do.  \n\nAs for the bathroom, the whole place is a little dumpy, so I'm not sure what other reviewers were expecting. A towel valet perhaps? The toilets flushed and there was hand soap and towels so I consider myself lucky.", "business_id": "W41CEzdKJe8wdDB-Rd6KJQ", "stars": 4, "date": "2009-11-29", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 2}, "user_id": "LqgGgWi3FLHBViX9tmZ9sw", "review_id": "NSFgJN-huKmWcASHt_cP5Q", "text": "I could stay with one star, but the thin crust for a pizza is worth a 2nd star. \n\nRight away when we arrived, there was water spilled in the floor, we waited and waited until we had to go and look somebody to \"sit\" us. When we left, the water in the floor was still there :O.\n\nPeople comes here mainly for pizza. SERIOUSLY!?? I stick to my Humble Pie. The rest of \"italian\" food seems overpriced and I had to take a look around to other tables to confirm I was not missing anything special. Improvement is a word they should review each day.", "business_id": "PEHJjxdw11TGFma9Zhz3ng", "stars": 2, "date": "2011-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f0Ayvscn8Cci_UuF2VTZYw", "review_id": "Ioa3HTTLskGxRyl_N-jnvQ", "text": "Wonderful Pizza !! Great Selection of Wines and Beer !!! Pretty extensive menu and Great Comfortable Setting !!!", "business_id": "PEHJjxdw11TGFma9Zhz3ng", "stars": 4, "date": "2015-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9xEeJzA_KIEPbgyksl_tPA", "review_id": "qEnl0c3kHvjJ7e9fDHEv4Q", "text": "My wife is in the Arizona Burn Center.  I'm here every day, and will probably be here for another month.  The staff is amazing, particularly the daytime nurses.  The nighttime nurses tend to be more distracted, for whatever reason, and a couple of the residents in training have given us some complete bullshit information, which is somewhat surprising, considering one told us we'd be out within a week (which we knew, from basic common sense, was totally off base).  Overall, the ABU is amazing, nationally recognized, leading the way in cutting edge care, and has a couple of truly amazing nurses.  Alexis and Michelle - I can never thank you enough.", "business_id": "7_pBQ2IJKxAumHl8hMAPXA", "stars": 4, "date": "2015-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ng2dNC5Y0VpzVd097M_gLw", "review_id": "egwlyDAMIzrTO5T3Q0PRXw", "text": "As with other reviewers Dan is the man.  Saved me $100 on my phone repair.  Friends kid sat on it and bent it.  Dan replaced the cracked screen and digitizer and was able to save the frame $100 frame by slowly unbending it.  He could have just told me I needed to buy a new frame and how would I know the original could have been saved.  I think that sums it up pretty well......happy customer", "business_id": "4anyLAWqWVZh5BFpol9czQ", "stars": 5, "date": "2015-10-09", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "kAw0HygRTr8QJ56Vsc_6WQ", "review_id": "uZkMuKZS2WHsFYnXj-J52Q", "text": "I this is your idea of good BBQ, you obviously don't know anything about what good BBQ should taste like.  I saw one review that suggested you eat the meat with the sides - looking for flavor I guess.  Lame attempt at sauce, ho hum buns.  I think the only reason they've lasted is that this town doesn't seem to have much competition in the BBQ department.", "business_id": "xfk9eY8gmwn8qsbyd-W6lQ", "stars": 2, "date": "2008-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e2ezIMl3c0VoF_1kvOanSg", "review_id": "_sMTmTt6Vc-h5NlgBelnaA", "text": "Something is up at the Tempe Honey Bears, and it's not good.  I've eaten here for years, and at their Phoenix location, and previously at their South Tempe location (now closed). Food and service have always been excellent.  On my last visit, the place does not appear to be run by the family who has delivered excellent food and service for the past several decades. I ordered my usual Rib & Chicken combo with 2 sides.  The chicken was OK, but the ribs were seriously undercooked and underseasoned.  This was a huge disappointment!  As with most BBQ places, the ribs are supposed to be, juicy, flavorful and fall-off-the-bone tender.  It's something I look forward to when indulging at a place like this.  The hispanic staff (including a very young kid) who were running the place were unfriendly and slow.  There are lots of BBQ joints in town now, several closer to home, but I've been a loyal fan of Honey Bears for a long time.  I hope they can get their act back together.", "business_id": "xfk9eY8gmwn8qsbyd-W6lQ", "stars": 2, "date": "2013-09-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "caaDd2cesCsm1LzOS-x-xw", "review_id": "dRfx7q-LQ79KjiFUvsVN2w", "text": "Elephant day at the zoo yesterday was amazing!!! good day at the zoo. Highly recommended specially now that we are getting a good weather to spend the day outside", "business_id": "1Ap6ZNCvyLLKHP0wvCk9yA", "stars": 5, "date": "2009-09-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "1Am0pv3HWphO6QVycWHL1Q", "review_id": "FJgs8k4WvLyshpbIdwhpSA", "text": "Decent zoo, but not what you'd expect in a city this size.  Agree with previous comments that more indoor attractions would be desirable in this baking climate.  Only tip is to get there early!", "business_id": "1Ap6ZNCvyLLKHP0wvCk9yA", "stars": 3, "date": "2011-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "vpfVuYOBech1P220ho1KFA", "review_id": "fVMhDVDf0S53asfQTfJlZA", "text": "This review is based on past experiences which were about 2 stars, and today which was a 3-4ish. The last time I went to this zoo I was NOT happy. But I figured, hey let's try again...\n\nFirst off, do not go to this place without a coupon. I had a free kid coupon from the savvy shopper which put admission for my daughter and me @ $20. Not bad. \nGet there early. Parking is a nightmare around lunchtime. Avoid photo vultures at entrance upon arrival. \n\nWe walked in and decided to hop on the safari train for an extra $5 each. For the size of this zoo, that was the best idea EVER. We went clear around the African trail and surprisingly saw most animals and decent views as well. I have walked that trail before and seen NOTHING so I was happy with that. \n\nAfter that we hopped off the train and walked to the exhibits you miss from the train. Orangutans must have all been sleeping. Boo. That's usually the best part. Bears were out, which is usually not the case. Little monkey exhibit is VERY cool, only problem is the little kids who run around and scare the monkeys back into the trees. Seriously I could not believe some of these kids in this place were allowed to act the way they did. \n\nI didn't buy any concession items. Brought my own snacks and water. They looked pricey though. \n\nI think the cooler temps had a lot to do with the animals being out. It was around 65 or 70. \n\nI'll go back next fall. With a coupon, of course.", "business_id": "1Ap6ZNCvyLLKHP0wvCk9yA", "stars": 3, "date": "2013-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Od5yn2M26nxN3wRE42qphQ", "review_id": "g0R5Npz7z-Ir02Pbq-XqYg", "text": "I got the pass and it's great to take my son.  Members get in an hour early. Which is nice to beat all the field trips", "business_id": "1Ap6ZNCvyLLKHP0wvCk9yA", "stars": 5, "date": "2014-11-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "hW44Jvcnk7vR_LDcyktJHw", "review_id": "nwSpjXRYT9qvoSU1jG-tkw", "text": "I really enjoyed this zoo with my little ones on a visit from LA. \n\nThe zoo was not very crowded on the day of our visit and the layout of the park was lovely.  There was so much to see an overall a great spot to visit while in the Phoenix area!", "business_id": "1Ap6ZNCvyLLKHP0wvCk9yA", "stars": 5, "date": "2015-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zGz5NI4sscO4_6YYH-qVtA", "review_id": "ZiDDFVqmI5NFRTlpdz36Dg", "text": "Let's see.....\n89 cents at Taco Bell for a taco that has cheese like sprinkles on a cupcake, or a Baja soft taco that has FIVE pieces of tomato in it? \n\nYOU\nMUST\nBE\nJOKING.\n\nCompare your Baja soft taco to the picture sometime and feel free to yell at the counterperson. Yes this happened. Taco Bell should be sued for complete misprepresentation!!\n\nMEANWHILE at Del Taco..... \n\n39 cents for a balanced taco with a decent amount of cheese and delicious medium (\"Scorcho\") sauce --- THE CHOICE IS CLEAR. Plus the deluxe tacos are CHOCK FULL. I usually get 4 regular tacos and end with 2 deluxe ones.\nI've had the double cheeseburger once, nothing impressive there. It wants to be an In 'n' Out Double-Double, but it falls short, like when you were a kid and wanted Levi's 505's for Christmas and end up getting Sears jeans.\nCome for the cheap tacos and LOAD UP I SAY!\nThe burritos are OK too.", "business_id": "_gXpjRIjb5fv5f5IVGXvsw", "stars": 4, "date": "2012-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eRzPesIycsMAkxnGrEDIEQ", "review_id": "OL5AxAKoMQini-vfzuI_GA", "text": "What a hidden gem! This fire museum is a must see for everyone. All will love it. Wonderfully put together. Has an interactive area for kids as well as a fire truck you can get up on! What a wonderful way to beat the heat in AZ ! Thanks to this wonderfully family for bringing it to all who want to experience fire trucks and history first hand.", "business_id": "fKwCjTBOmwcbl4XtYRZToQ", "stars": 5, "date": "2015-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "csuJ462FfY6QQSy8YY5paA", "review_id": "kFqEFO6ufNxVs9zLf6yrAQ", "text": "I went with the deluxe wash, took a long time but car was spotless inside and out. I mean pristine. The deluxe is not the option for a quick wash, but if you have time go for it.", "business_id": "LrPG6AgIomIrSNTcwJU5Hw", "stars": 5, "date": "2015-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zn81QpflLDUaGZkCMUowCg", "review_id": "kbaD16y2Jf5-jHHc6EgbeQ", "text": "Great authentic Chinese menu.  Thank you Helen for translating the menu!  My significant other will be able to go there & order off the Chinese menu now!\n\nI like the rice cakes.  Also a vegetarian dish with lima beans in it.  Not quite sure of exact translation to English what it is.\n\nThe staff is always friendly.", "business_id": "2unQHR9uaRxk3dsW6f3MGA", "stars": 5, "date": "2008-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GSuh2QXnaZIWr4DgFldNvQ", "review_id": "tKn-eeIjQcakRd-2LY5ESQ", "text": "Pharmacy is entirely too slow.   This is a busy place.  Either need faster workers or more of them", "business_id": "LDtE3rhFnl4ud1ogxS6rGA", "stars": 1, "date": "2014-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jEZNqvXjHcSaNtS1XkUz3w", "review_id": "mVIt8yYGZ71Wl6v0BV4zrQ", "text": "Very inexpensive and tasty, but very TINY tacos al pastor. I mean hobbit-baby sized. Think if White Castle made tacos.  \n\nThey were good at least. Everything else was bland; particularly the not-at-all spicy salsa. My Mexican associate gave it a 5 out of 10 for taste and authenticity. Not being Mexican, I can't speak to authenticity, but I can say I don't like boring food, no matter if it's authentic.", "business_id": "s87D-mtAuJ8BluKgYYsXGw", "stars": 3, "date": "2012-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zHgmWv6NbwZepUSqA_FlLw", "review_id": "tHgYxfp9J9g-0jDrnkHM7w", "text": "one of the best chinese food here in phoenix. you have to tell them to use less salt. because often times, the food just a bit too salty. other than that. it has great selection for Szechwan style food.", "business_id": "yQONzVpX-DEpGSuKMIov6A", "stars": 4, "date": "2011-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nMHu8rkh1wkKn5Md0MzNHA", "review_id": "TCeBE5KbTfMzgG5qwGKzWQ", "text": "First time at Szechuan Palace, after reading Yelp reviews. Ordered to go and took it back to work for myself and coworker. \n\nHe ordered the Szechuan shrimp lunch special and I ordered the Kung Pao Chicken Lunch special. Both came with choice of soups, rices and a salad. \n\nThe Szechuan Shrimp was well received but he said \"I wish it had more shrimp\". Don't we all?  The Kung Pao Chicken was good, with plenty of sauce and chicken. I actually wanted more peanuts. The rice, soup and egg roll were all good but the salad was a waste of time. I think they were making the Americans happy with a salad but I don't like ranch dressing. \n\nI will try it again, mostly because I meant to order General Tsao's Chicken. I know, dumb.", "business_id": "yQONzVpX-DEpGSuKMIov6A", "stars": 4, "date": "2014-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "sj_L6VWMe6nOyGnmIG3lzw", "review_id": "KcVQJ5CIRgKzA7gmjVmyQg", "text": "This place is horrible. It takes months to get in and when you do the psychs give you a different diagnosis everytime. They prescribe medication that's completely out of date. I am on ahccs and I am trying to get well so that I can start to work again but with the quality of care provided it's like I am stuck here for the rest of my life. Nobody there has any compassion for their patients and most of the staff is just downright rude to people that are already dealing with immense emotional issues.", "business_id": "q6mL53la1IIf-idZ40pnuA", "stars": 1, "date": "2015-09-08", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "YPwFl3RCRwr-kyN-890STA", "review_id": "ixzKYXm8IOef_swhI_1voA", "text": "Good little dive bar for sure. I stopped in for lunch and since it was Tuesday the burgers are only $2.00. I had a 1/3 burger with Swiss and added Green Chili to it. It was very tasty for $2.00. I also added a side of fried zucchini and those were amazing! They were cooked perfectly and was served with a side of ranch dressing. \n\nService was friendly and very quickly. I could have been in and out in 30 minutes but I took my time since I wasn't in a huge rush. Even though they were quick on the service they didn't rush you in anyway which was nice.\n\nOverall, everything was very good and I will certainly go back for lunch.", "business_id": "IgaruuknYwCr9afeDYQ_yw", "stars": 4, "date": "2010-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vf3fJqktsZR4OL6iMImrIw", "review_id": "2DTe3c_Jvgnb-D9z-POgUQ", "text": "Whole in the wall but oh so worth it!!! I had a sope & it was huge & delicious! Service was fast and the waitress is extremely nice! The gorditas are a good choice tooooo! Must try if u havent!", "business_id": "rAb_wfdKKPPbcIysjYcW4A", "stars": 5, "date": "2014-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cYkrhWi5XcC0b64z4R0Y_Q", "review_id": "KTiwyRrMy7KgK5kPnRi4iA", "text": "Waiter is ok. Food is bad. Cold food and waited forever till anyone came to get our drink order. Worst experience.", "business_id": "hzUOqxpcnYYBgLlrgvjQYQ", "stars": 1, "date": "2015-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "8qe2c5uRlAkvNFvDriBm1Q", "review_id": "iS9OTAPRfqtQoRZfTe1Auw", "text": "We got to experience Macayo's because the local Italian restaurant is closed on Sundays.\n\nHow to express the feel...?  Not very busy on a Sunday afternoon around 4 PM...overpriced and certainly light-on-the-tequila margaritas...plenty of chips and salsa being delivered to the table...entrees that took WAY too long to be delivered...portion size and presentation leaving much to be desired...and the waiter kept our water glasses full.\n\nWould you be satisfied with an order of rolled tacos which list on the menu as coming topped with  guacamole?  When the cheese is sprinkled on so lightly that you can count the shred strands on each one?  When the guacamole is served in a 2-ounce solo cup on the side?  I think not!\n\nAnother in my party ordered a chicken soft taco and a bean and cheese burrito...the chicken was in shreds, like someone in the kitchen boiled breast, thighs and legs and subsequently shredded them with a fork.  The worst part was no seasoning...save for the salsa served with the chips.  The bean and cheese burrito was a study in rice...so much rice that it was difficult to find the beans and cheese in the burrito.\n\nThe fourth in our group ordered the nachos supreme.  The chips are advertised as coming smothered in beef or chicken (he chose beef),\ncheese, refried beans, tomatoes, sour cream and guacamole.  Again, the guacamole came on the side in a 2-ounce solo cup as well as the sour cream.  They were not requested on the side...but they came that way. \n\nAs I am in search of the best guacamole burrito on the planet, that is what I ordered...a burrito that is guacamole, sour cream, bacon, cheese and raw onion.  The burrito I received...got the guacamole...got the cheese...got the sour cream...missing the onion...and some really fatty bacon.  It has been a long time since I had a guacamole burrito that chewy.\n\nMargaritas were just a flat-out mistake.  I guess you have to know someone behind the bar to get much more than the faint whisper of a tequila bottle being passed in front of the glasses.  When they are delivered, they look incredible...the glasses filled perfectly...the salt on the rim done so well you could take a measuring tape to the glass and find perfect consistency all the way around.  While I enjoy the look of a well-presented margarita, I wanna feel and taste tequila in it!\n\nMaybe this works for the family 'hispanic eatery down the street'...it does not do so well for me.", "business_id": "jzPMl-NoB5F2fwoHX3hN8A", "stars": 2, "date": "2011-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "a6XmkMbVaA_oHvpCLubwPw", "review_id": "xx4gOez7Ib-i99CsrzN7-w", "text": "The manager contacted me with an apology but it was a joke!! Never even addressed the terrible service we received!! Never go to this restaurant!!", "business_id": "jzPMl-NoB5F2fwoHX3hN8A", "stars": 1, "date": "2014-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "XBHJCDzNh--mBhJkzyM_iA", "review_id": "5ahxSZjYUyx_AEWHDgPopw", "text": "These ladies know how to do flowers.  Starting, on the phone- so accommodating and willing to work within budgets.  I used them for work and had a strict budget to follow and they did it perfectly for 14 orders and deliveries.  Very nice and easy to work with.  Then I had to go to the store and drop off something that had to be included in the delivery.  What a great store-- some really great decorating ideas are in there. \n\nI highly recommend Cactus Flower.  I will use them again.", "business_id": "72INqF4dYTHdCoUoePIuSw", "stars": 5, "date": "2007-09-17", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "w4suxL1zlxsihVlugZZDAQ", "review_id": "PbHLAM1pqGQINKyCxWo-1A", "text": "Hidden in an office building with barely any nearby parking, this eatery is easy to miss. Their 3003 N Central Ave. # 118 Phoenix address can be very misleading. There isn't any signage or entrance on N. Central Ave.  Instead, it's all on the side street, Catalina Dr.\n\nCranberry Hills offers breakfast and lunch for dine-in, to-go pickup or delivery and catering. For breakfast, they offer a selection of omelets, egg sandwiches, baked goods and fruit. Their lunch menu consists of standard items such as cold sandwiches, salads, pasta, pizza, soups and bakery items. \n\nEverything on the menu is extremely reasonably priced. You can walk out the door with a huuuuge salad for less than $7. They also offer their salads in half sizes as well. The food is all around average. The ingredients could be a little fresher at times, and I'm not too keen on the amount of iceberg lettuce that gets thrown into their salads. However they don't skimp on the toppings. Those extras get piled on top. This place is also CROWDED at lunch time. Everyone in that office park seems to eat there daily, and the parking is awful.\n\nMy favorite on the menu is #48 - the Orchard salad with a standard bed of greens, chicken strips, oranges, apples, jicama, dried cranberries and walnuts, served with country French dressing (that I usually switch out for their Roasted Red Pepper Fat Free dressing, just so save those extra calories). \n\nI've also used this place for catering before and for the price it's very economical and fast. They will drop off your order and set up a really awesome and professional salad bar complete with all the fixings - salad mix, nuts, cheeses, an assortment of dressings, turkey, ham, chicken, fruit, tortilla strips, etc. I've also used Cranberry Hills Catering for those last moment \"oh no I forgot to order lunch and the meeting is in 4 hours from now\" situations. They've saved the day for me countless times!\n\nI wouldn't go out of my way to get their food for just an individual order. I mainly recommend this place for catering in addition to those last minute office lunch emergencies. They are fast and convenient if you work in the Mid-town Phoenix area.\n\nSince they don't have it on here, this is a link to their Web site http://bit.ly/cLvlvG", "business_id": "I4L_MJOZsnux3xCU2bLP8Q", "stars": 3, "date": "2010-09-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "usQTOj7LQ9v0Fl98gRa3Iw", "review_id": "V9DCSUCTk-UaCrBV6BxhBg", "text": "I like a good stroll through AJ's now and again.  Especially if I am in the search for some specialty or gourmet item.  Their meats are super fresh as are their deli, salad bar and bakery items.  I don't find myself ever buying much, just a few items here and there.  But I will still go through every isle to look for cool and interesting things to try.  [But to be honest I love going for groceries and do this in just about every grocery store when I have the time.]\nWhile a solid 3.5-4 stars I dropped it to 3 because on my last visit I discovered they no longer carry my favorite Cock & Bull Ginger Beer anymore, replaced with some line of stevia sweetened soda.  Now I can't just ride the lightrail to get it...I have to get in my car and go to a bevmo or total wine.  So sad....", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 3, "date": "2010-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "VRpGqz34M2s_vOs-B3ww4w", "review_id": "xV-ws5rNJaaIQgHg_NFPpg", "text": "5-Stars FANTASTIC service!!! 3-Stars for the pizza: GREAT sauce, and toppings, but the crust needs help. Nice, and thin, but dry and a bit crumbly (not sure why so many pizza places in AZ have this 'problem' - especially when claiming to be \"New York\" pizza). Of the places I've had pizza in Manhattan (mostly the Original Ray's, and Lombardi's) - those crusts are fantastic . . . no one in AZ (that I've had) has been able to come close. I'm still on the hunt for the perfect Arizona pizza.", "business_id": "JN2qXIuDXnV2d8WnSqd28A", "stars": 3, "date": "2013-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EDiikU6YYgySSpOQgIXjRQ", "review_id": "Cpk1Scdb3RiPbDAF7LJlkg", "text": "Soft. Chicken. Tacos.\nI swear that stuff is so addictive. Just the right amount of blandness (which you can spice up with the mild or hot sauce packets).\nSome days there are sales on where you can buy 10 soft chicken tacos for $10.\nThat stuff is usually gone really fast when I buy all 10..\nAlso great as hangover food, and for lining your belly before a party.\nEven breakfast!", "business_id": "KIbFaBrZDX7rrYJInkv5Kg", "stars": 4, "date": "2014-09-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "slAdwQk0i984K7lxzsWQGw", "review_id": "VnCbFclhlZNPx-kBy4VeGQ", "text": "This place is awesome. \n\nFor the guy who said you should go to Safeway instead for a sandwich, well, I'm guessing he probably thinks a steak at Applebees rivals a steak at City Hall. \n\nIf you like turkey with mayo and mustard, you can't get that here. If you like to try new things with fresh ingredients, you might want to give this a try. Yes during the summer it is hot and they only have outdoor seating, but how about taking it to go and eating in your car? I've done in many times. \n\nAs I say in my Pizzeria Bianco review, I now live in NYC but will take extended layovers in Phoenix gladly to stop at these two places. I have also scheduled meetings around these places being open! It's THAT good!", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2008-11-12", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "8uPrL5vr8ZpTvSrhb-9e5w", "review_id": "3Z8x4cAuNv3IOjqRqAgLTw", "text": "I'm pretty sure if you could eat heaven...this is what it would taste like.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2011-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9FgE70NHPgzf_c2TLpE6Zw", "review_id": "3PtPfoSCI96TVxn6WY7NgA", "text": "Love it.  Perfect lunch spot.  This is NOT the pizza place folks...go here for salads and sandwiches and they will not disappoint.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2012-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q9zdZyN95FNX9Q9vJK_jWg", "review_id": "Uu-LTOEGN_4Fu_Bumqokkw", "text": "I guess I'll join the bandwagon and give it a 4 star. We had the local greens balsamic salad, the lasagna, and the wise guy pizza. I'm giving it a 4 star because the food is good and the service we received was GREAT! Personally though, it's overpriced. We probably won't be back. There are other places with similar menu items that are just as good that are less expensive. But a good first experience!", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2015-09-25", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 3}, "user_id": "4_YfcfHkCem1onJFkItxjA", "review_id": "hpcZSd3tzZJ4PyP7lR_ywQ", "text": "Yes, it's true.  You will hear British accents here. One of the better neighborhood bars in central Phoenix, George & Dragon is also one of the best British pubs in Arizona.  A very friendly and diverse crowd - I made some of my first friends here in AZ at George & Dragon.  \n\nNot exactly like a typical British/Irish pub crowd - as this place is frequented by a more punk-rock, rag-tag, counter-culture bohemian crowd.  Whatevs.  It keeps things interesting.  People playing darts or pool are always up for talking and invite you to join in.  The bartenderesses here are always very nice and well endowed at the same time.\n\nBeer selection is among the best in Central Phoenix it would make any discerning Brooklyn hipster drool with delight. Chimay, Tetley's, Stella Artois, Kronenburg, Boddington and Anchor Steam are among the brews available. The jukebox is a gem - everything from The Kinks to the Police, David Bowie and Tom Jones.  \n\nNo Country Karaoke on Mondays is a riot, and has one of the hugest song lists in town from which to choose.  They have also recently added a 1960s British mod dance night on Wednesdays.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 4, "date": "2006-09-17", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 2}, "user_id": "zCC6huLkNBEr3JUgQyxJbg", "review_id": "aeH2eG7l1n3gsfPNB4jmZQ", "text": "A couple of friends and I participated in the Phoenix Actually' Great Phoenix Scavenger Hunt meeting up at the George & Dragon. The location was good - right on Central, close to light rail access. Parking was descent in the back. The bar was spacious with pool tables & darts in the entry room, plenty of seating in the dining around and around the bar. It was big enough to accomodate all of the scavengers as well as those patrons wondering what all of these other folks are doing.\n\nBefore the scavenger hunt started my friend ordered an Ace Apple Cider. I ordered one as well and it was very sweet. That drink would be dangerous because I could pound those all night not realizing it was alcohol. \n\nWe made it back to the George & Dragon a little early (8:30)...still 30 minutes left in the scavenger hunt, but the web site to upload pics to was slow, so we decided to enjoy some apps and drinks at the bar. The appetizers were typical bar food - we ordered the mozzerella sticks, potato skins and another round of Ace Apple Cider. Typical, but tasty. The cheese sticks were very cheese and the 'skins were good. The plate game with a few garnishes of vegetables as well. \n\nThe service was excellent too. We were going to order the shrimp, but the waitress indicated there really isn't that many, so perhaps another selection would be better. She was very prompt despite the large crowd. I left a good tips due to the attentiveness and advice.\n\nI love pubs in general and would definitely go back any time.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 4, "date": "2009-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XwIIa-0SeoEnH6JBpMMiUg", "review_id": "XTfLz27QxSCmWRCbSd7eYA", "text": "Atmosphere is very English. Food was pricey, but quite authentic. \n\nTried the scotch egg, it was different, but good with the chutney!  Had the lamb roast, seemed a little bland, and the peas were frozen. \nOverall, an average meal, with cool atmosphere!", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 3, "date": "2012-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SGlEeg-qqJ-p5ZR-PcA8DQ", "review_id": "Lk_ftxocCZxuFe_wf_ZB9Q", "text": "The only reason they get 2 stars is because I half way enjoyed myself the first time I went there the night that basically everyone in phx lost power a few weeks back .. Even then it wasn't all that great. Last time I wanted to order the French dip or English dip so badly but no one wanted to wait. \n\nTonight I'm sitting at home so hungry and pretty sick and wanted something other than McDonalds or filbertos so I call and ask when their kitchen closes and they told me 1230, I said thank you! And they just hung up. Rude . I called back and ordered food. I get there to pick it up and told me they actually didn't even have one of the items I had ordered and when I get home excited to eat my French dip.. There was not even any aju sauce for the sandwich. I went against the bad review for this sandwich because I thought the person was just complaining about every little thing.. But I too feel the same way.. No aju and it was not very good at all .. Probably will not be back. \n\nLike I get it.. It's pub food but I have worked in many in the past that were better quality. Js.. I'm the most non picky and laid back person. It takes a lot for me to even write a review .", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 2, "date": "2015-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3WzLqToyXE7-aatwEIpO4g", "review_id": "J8lgo0VAuQVKH01YRwA-eQ", "text": "If you like to be followed around like a dog to buy overpriced cigars that are very DRY. This is the place for you. 15 plus years selling wholesale cigars so I would know. Buy one put it in your humidor for a month and enjoy!", "business_id": "vQxxDYo-riHU5j9jHhi_tw", "stars": 1, "date": "2013-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1_zj7B1bRgE7dC6tywUcTQ", "review_id": "wVmwEtuEMWN1CUV2W06LVQ", "text": "YELP totally missed the boat by not mentioning this place as THE BEST BIKE SHOP IN PHOENIX. I simply called them one day, knowing what I wanted: A Salsa Mukluk, Snow Bike, aka \"Fat Bike\"...  They \"had one that  needed to be built.\"  I said: \"Build it and I will come.\"  I rode out of there a couple of hours later with the coolest bike I have ever owned.  The staff was totally hip and cool and GREAT and communicating and relating to my needs as a cyclist. I would not go anywhere else.  Do yourself a favor and buy your next bike at  the Slippery Pig.", "business_id": "42Ai9wcFPE2HZ_aADGXI9Q", "stars": 5, "date": "2011-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MP2eV7R1YNWpeiad4-5FEg", "review_id": "iZdaqiWUIu_ek4gRbl2MeA", "text": "My friends and I go to this location all the time. Not just for the food but for the people that work there! It's always so clean and nice! Always friendly service. April always greets us with a smile and always checking up on us.. When it's busy the service never seems to fall short of anything! I recommend this place and location.", "business_id": "SkNUbFJiJtbZjY-S_S0u7g", "stars": 5, "date": "2013-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wQAIt2AwAnX8XKJ1JiNzAw", "review_id": "aHPQvz1jJh82moYZCAi7KA", "text": "Well, I was a fan until I came to fill my dogs prescription here. I dropped it off during a busy time and they said one hour to fill. I come back and they say they didn't fill it because of how much it cost. They wanted to make sure I was ok with the high price. Umm...how about call me or something? Too bad. Still get photos here but no longer fill prescriptions", "business_id": "HfWkdqxegjiGEXzI8j7Wwg", "stars": 3, "date": "2014-10-29", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "YgucNL2tibnjEmDLqHPqow", "review_id": "Qr4vBoPJ4-MUMvYixPKRzA", "text": "First of all, THE LOCATION HAS CHANGED. I followed Yelp's directions because I'm a tool and didn't look up the actual address online... yup, they're no longer at 333 E. Osborn. They're at 1313 E. Osborn. So... yeah.\n\nThat aside, o-m-g. For a doctor of this sort, Dr. Cyr is AMAZING. I have been to many women gynos (sorry, no dudes up in my lady-business) and I've had good ones and I've had atrocious ones.\n\nMy atrocious experiences have all been in Phoenix, so I had been without an ob-gyn for several months until a co-worker recommended Dr. Cyr. Lucky for me, I struck GOLD! Dr. Cyr, you're not allowed to retire. Sorry. (Don't worry, she's young; she won't retire anytime soon).\n\nCut to the chase. Reasons why Dr. Cyr is amazing:\n\n1) She doesn't make me feel like a creepy weirdo for not being married nor wanting kids anytime soon. SERIOUSLY, I got grief from ob-gyns for 'not being ready for a family yet.' Um, guys, I can't even feed myself on a regular basis, and you want me to have a kid? Major fail. Dr. Cyr DOES NOT DO THIS. She didn't even bring up me wanting kids now or in the future. Thanks, Dr. Cyr!\n\n2) I didn't wait a million hours to see her! At my last gyno doctor (who shall remain nameless), I waited 2 hours for my appt. Wtf?? Here, I waited no more than 20 minutes, and that was because I was filling out paperwork. YAY!\n\n3) Dr. Cyr answered my questions professionally and fully. She didn't shirk around my more... awkward... questions, and she explained the options to me in plain English. She reassured me on some things that I was worried about, and she even made me laugh in the process. I NEVER laugh at the doctors! This is amazing!!\n\nOn a less quantifiable basis, I felt Dr. Cyr just 'got' me. It's hard to explain, but I felt comfortable talking to her and felt I could bring any issue up and she wouldn't judge me for it. \n\nShoot, I think I want to have a baby with Dr. Cyr now. Wait.. that's not quite what I meant... anyway, go see Dr. Cyr if you have lady-parts! You won't regret it!", "business_id": "eovEq5kDSdf0WF_P_bD2Uw", "stars": 5, "date": "2013-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_d90UI4hSMObWzSqx6lwuw", "review_id": "wQHWH0wOick8FxEpEJOg-A", "text": "I just had a Colonoscopy at the phoenix va and was very pleased, I was in and out in 2 hours. every one there really likes their jobs very professional.  I have not been to the emergency room in 3 years but it can only get better. parking is still a problem", "business_id": "-TIyxSc-lLmJzunje6MD9Q", "stars": 5, "date": "2014-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "O_5KbswzZQeTEPo0a4_FAw", "review_id": "csPf_DzoruLq5uE-85omqA", "text": "These guys went above and beyond when it came time to get new headlights in my car. Their customer service is on point, and these people who know what they are doing/talking about.", "business_id": "P4e1yH_XjwMtlD7jtyTGVQ", "stars": 5, "date": "2015-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 8, "cool": 3}, "user_id": "_LEQt7oTVjiaXyVHK_MM7g", "review_id": "EGH-dJHtp8uwMLwJLnJDSg", "text": "My favorite favorite favorite place. Possibly ever. \n\nWhen I was in highschool my loitering teenybopper friends and I used to get kicked out of here on a regular basis, but I don't hold that against them. We were idiots.\n\ncNstuff has been around forever and is owned by the nicest family on the planet. The minute I walk in there the smell of cheese (or is it sandwiches?) makes me instantly hungry. And there is lots of cheese. \n\nThe sandwich menu is extensive and I always have the hardest time deciding what to order. It seems like there is a new sandwich added everyday. Do I want the Doe Boy or just a plain ol' Tuna? Russian dressing or mustard? Sub roll or wheat? For extra you can get a side of chips, potato or macaroni salad (which is a little too sweet for me). There is also a plethora of little extra snacks to fill up on, candy bars, twinkies you name it. Last time in there, there was noticeably less Swedish products on the shelves which was a little sad. Maybe they weren't selling very well? They were always enjoyable to look at. \n\nAnyway, please stop in to this delightful little sandwich shop, you won't be disappointed.\n\nEdited to add: German products, not Swedish. They were Umlaut-laden names so I got confused.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 5, "date": "2007-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sO7eccljiBw4GiThp-JNyQ", "review_id": "ytktBTNilMatTWAxWTWf1g", "text": "The best deli in central phx! Stan and his daughter run the place and are making sandwiches everyday! They use boars head meat and cheese so you know it's going to be great! Try the Tyler or the doughboy, can't go wrong!", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 5, "date": "2015-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WzecZ336Z5NS8y0OfJqg4A", "review_id": "8uG9bzFo2qi1nvA-6r8ttQ", "text": "Great Food. Usually a weekly or bi-weekly stop for us.  \nThey are there to please thats for sure. Never have to worry about your glass getting empty either. \nMaybe sometimes too fast. We've learned to order our appetizers and wait till they get to the table before we order our dinner so it all doesn't show up at the same time. But otherwise a great place for Chinese!", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 4, "date": "2011-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "o8J-ergbGYjrUy85I_rxzw", "review_id": "KI8ZoKsBiP2SfIeCHsSGqg", "text": "It's very hard to find decent Chinese food in Phoenix and this place is your standard fare. The house chicken and vegetable chow mein were very good as well as the vegetable spring roll. They're set up in what looks like a banquet hall which is a little weird at first but I do like how open it is. Definitely come with a group and order a few plates to share. We couldn't finish the two dishes between us - tons of left overs!", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 4, "date": "2013-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4Z2VpJFwNh18VKDnCdbX5Q", "review_id": "JTI45x-KzlSXhaf5OEPNfg", "text": "Very fast service. Servers are so nice. It seems like a clean place. The food is at a decent price and great.", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 5, "date": "2015-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3Ibl0tvCENCtwyRkB37QFg", "review_id": "nKEyV2RZSNlDVpXJbwZ8Vw", "text": "Whenever I am fly into Phoenix, I make time to stop by this record shop on central ave in the downtown area. If you collect vinyl records, in particular, classic rock, soundtracks from TV and films, blues, jazz, etc..then this place is amust see..They have two locations, however the one located on central ave contains the majority of vinyl, some cds, and even cassets. The owner is avery friendly and knowledgable older cat...you will usualy find a few original rockers hanging out by the counter, discussing rock music, or just music in general. It;s a clean and well mainted (organised) record shop, one of a dyign breed. I've scored afew rarities in here over the past few years. Enjoy if you go.", "business_id": "lfysf-HycrQ7Z02HuPqgKg", "stars": 4, "date": "2009-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "W3F84BQfutQh0mAQ5DSVDg", "review_id": "y_HbI2u-hSD9Dkefx9kYww", "text": "My friends and I were looking for a local salon to get my mother's hair done.  When we stepped into Lovato's, we were welcomed by the most charming family.  This family owned business was comfortable, professional, and well experienced.  They consulted each other and my mother about color, cut, and maintenance. Not only did they tend to my mother's special requests to make her feel comfortable, but she walked out of that salon looking 20 years younger!  She looked absolutely gorgeous!!! Her experience instantaneously made her a future regular at Lovato's.\n\nI can't wait to get my hair styled next ;)", "business_id": "qurW9PjV90saHESwsGAwdQ", "stars": 5, "date": "2014-10-02", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 4}, "user_id": "pv82zTlB5Txsu2Pusu__FA", "review_id": "RXrj_v7J3eNlrx1dFKh6rw", "text": "saturday afternoon: after a busy morning of \"Total.Hangover.Cure\" induced shopping at the saturday market and then an eventful trip to Trader Joe's my buddy Polo and I were getting apprehensive with Hunger. I was eager to take him somewhere that would fit his requirements (cheap/plentiful) so that he wouldnt embarass me like he had at a \"colorful\" brunch my brother and I had taken him to at FEZ, which ended in him loudly and unapologetically complaining about portion sizes and price. My best bud Polo is a big dude, and accordingly a rather big penny pincher. I was driving us back to my pad when we passed Yoshi's on central, \"whats that place?\" he says, \"oh, just like this japanese fast food place, it's slightly better than kyoto bowl..\" he nearly grabbed the steering wheel outta my hands.\nI veered into the drive thru, ordered a chicken yakisoba bowl for him, and a chicken curry for myself. As we waited for our orders a group of elderly folks strolled by, donna summer was playing on the radio, impulsively i blasted her sweet disco melodies as loud as my car speakers would allow, and we had an improtu dance party in my car as they stared in horror and confusion. the gal who worked at yoshi's opened the drive thru window, laughed and handed us our orders. We took my groceries and our Yoshi's bowls back to my pad, had a quick refresher, and dug into our Yoshi's bowls as we watched always sunny and spent the rest of the afternoon with full belly's of joy. Yoshi's is an easy, fast, and fairly decent alternative to panda or KytBwl, i'll be back soon most likely.", "business_id": "L19_1cG2ALVjdBQ456h26A", "stars": 3, "date": "2010-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "y1pcDeo5NWpYOjGdAvr05g", "review_id": "jPxfEmVPiPjZET3t2GwKLw", "text": "Easily the best comic book store in Phoenix. No gaming crowd hanging around, the staff is always amicable and helpful, I can always expect to be greeted at the door with a friendly smile and welcoming attitude. The store is clean, well lit and easy to navigate. New releases are in alphabetical order and have the last few months issues nearby in case you missed something. One of the best features of this establishment is the collection of consignment books, packaged together as runs at VERY reasonable prices. If you are looking for a specific story line, or filling in gaps in your collection, check this section out as they always have a great selection. The interior displays are always changing, with over stock deals, grab bags and more packaged runs rotating in on a regular basis. Their trade collection is second to none. They have a great back issue selection on the floor, and if its not in the bins, they probably have it out back. Their claim of \"over 1 million comics in stock\" is easy to believe.\n\nSome other reviewers have complained that the store doesn't have couches and chairs, but that is fine with me. I tend to avoid the stores with lots of people hanging around for two reasons: 1) the books are probably all messed up and read, and 2) those stores tend to have the cliché clubhouse/comic book fanboy feel; if you aren't part of the club, you aren't welcome. NEVER had that vibe here. \n\nI've also seen complaints that the prices for some items are high, based on other stores in the valley. I've never felt that here either. The prices are very competitive and again, the multi issue packs are always a FANTASTIC value. I've bought tons of stuff here, and never felt ripped off. In fact, I've picked up runs that i would probably never have looked at before, simply because they are packaged together already, so I don't have to dig through the bins, and they are being offered at a very reasonable price.  \n\nI've probably tried all the shops in the valley, and this is the one to beat. If you are looking for a comic book store, not a gaming store that just happens to sell comics, this is it.", "business_id": "y9cQ0DBC0qFNgkpTXHzokA", "stars": 5, "date": "2013-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_p9EnnLQg6KDlIRU2fYEJA", "review_id": "ElpFF3MHTfxGOi_Bkc9ssw", "text": "QDOBA on Central, Park Central Mall - 9/24/13, Tues @ 11:30 am... I was waiting in line for over 10 mins, when I finally got to the girl, she told we they we out of chicken! I don't eat meat or pork, so I ONLY wanted chicken. I flat out said, \"Good-Bye!\" to her & walked out,  as I was walking out, I made sure that I told everyone in line that they were out of chicken. I was very upset!  NO restaurant should ever run out of something like chicken! I would think that a restaurant would be or even should be embarrassed to be running out of a 'staple' such as chicken, don't you think? and the girl was so nonchalant about it, too.", "business_id": "WPSM_oTPceoSnwqQWfAsdg", "stars": 1, "date": "2013-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iC5QxAMw0ucoDGyzY9YoeQ", "review_id": "IxdiKnKLB9yc2P-YoYBOPg", "text": "I wanted to say the staff and Dr. Martins are the top of their field!  I would trust them any day with my four legged babies!!!  Gismo and Lady love them all!", "business_id": "jUQpIF_bhhF_XQqScrt5yg", "stars": 5, "date": "2014-09-12", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "jdeNI5TTTuM6mj3HTgstRA", "review_id": "eMMVbHhDuXhuN0M8Ny1hZg", "text": "Came here last Sunday for a few pints ($3 each!), and I have some highs and lows to share about this place. To steal a word from Bud Light, the beers here had a lot of \"drinkability\". My hefeweizen was very smooth, and there were no complaints about the Pilsner, IPA, or the Vanilla Porter. Nice flavors all around!\n\nBut the $5 appetizers were not as pleasant, I'm afraid. The seared ahi sliders looked delicious, and they tasted pretty good. The wasabi aioli was a bit overpowering, but I would order them again. The black bean chili fries were just mediocre. It sounds fancy with the melted Oaxaca cheese on top, but they don't taste like anything special. The cheese quesadilla was way too bland for a cheese lover like myself, and their bruschetta was alright, but a bit too different.\n\nI'll be back to try an entree sometime, but I'm not expecting much. I love the cozy patio and great beer. Support local breweries and come here. As long as you stick to the beer, you won't be disappointed.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 3, "date": "2010-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yP4GLw2mAxrjL_D66OapXQ", "review_id": "RYyCdCpGejWsPDvUVsmUJg", "text": "Cask drawn IPA.....good stuff!", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 5, "date": "2013-11-13", "type": "review"}
{"votes": {"funny": 16, "useful": 13, "cool": 12}, "user_id": "C8ZTiwa7qWoPSMIivTeSfw", "review_id": "I9G5isLLU8dkJAVEPsPj_A", "text": "Unique? Not really. Central? I guess so. Every city has the essential queer store with loads of gay greeting cards, over priced candles and jewelry, novelty tees, and yes, porn, lube and toys. Oh the toys...It's a great place to get a quick gift for a fellow sistah. The greeting cards are fantastic. Lots of undies and swimwear (WAY overpriced!). And hordes of really bad clothing. Think tight mesh shirts with really bad pleather pants. What is this Fire Island 1979? All in all I like to support this type of store. Plus there's always the sleazy element of cruising. The tshirts are fun. Staff is helpful and friendly. They're always playing thumping, pulsating  dance music (poppers anyone?) that just makes me want to get more crap I don't need. Of course the CD they're playing is available for purchase...good trick....$36 later....YIKES. I have no will power.", "business_id": "Gqq6AF9MIbhh5wwGofeiJQ", "stars": 3, "date": "2007-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GN20gCrMHjXH7zdZ3AaAcA", "review_id": "kIz1EZj1as1voi0BevMP7g", "text": "Drinks are consistent (as are most chains)\nGood atmosphere to work, lots of tables with plenty of outlets for laptops if needed\ngreat outdoor area to relax & drink coffee\nBaristas are friendly", "business_id": "dSQh1Hx2BiSrYog4ad740A", "stars": 4, "date": "2011-10-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "nPkThwwnj2_FtnWiUfzYKg", "review_id": "eZjjs1hawi7VaeXun50uDA", "text": "I had been reading many reviews on nail salons, in hopes of finding a great one. After reading everything everyone had to say about Elle nail salon, I had to try it out. And I will NEVER come here again! \n\nThey said I was going to be helped next, it took Sally about 30 minutes to start on my manicure.\nShe was answering phones and scheduling appointments while working on my nails. She did a HORRIBLE job\nIt was not the shape I wanted \nShe didn't polish right \nMy nails look as if a 5 year old did them\nA monkey could have done a better job!\nI went today 10/05/2014 around 3:30pm \nAnd because of what an ugly job Sally did\nI had to sign up with yelp\nTo let you ladies know, not to waste your time and money on sucha money hungry salon.\nI will NEVER ATTEND THIS SALON AGAIN!", "business_id": "f9WABGuw1OBfO_lw5HFiJw", "stars": 1, "date": "2014-10-05", "type": "review"}
{"votes": {"funny": 73, "useful": 32, "cool": 25}, "user_id": "oC0kwGvgaAeT3ZIxdxTcJA", "review_id": "mZ31RDKqrZuGMukZox3wcA", "text": "Let me start this Yelp by saying I've never given the business to a stripper. Are we clear? Ok.\n\nI'll tell you why this place gets five stars... Because not one but two of the dancers offered to go home with me. \n\nOne for $250. She said \"If you have $250, we can go somewhere together.\" And then she licked my ear and showed me her guns. Her shift was over and she was in street clothes, mind you.\n\nSo guess what happened next? \n\nStripper two (who actually did leave with me - long story) said, \"Gross, some skanky girl licked you and her breath was terrible.\" I was embarrassed, yet psychologically removed from that experience.\n\nWhat happened with Stripper two is a great story but I don't know that I want to share it here. But if you go to this club, one piece of advice (Useful alert!): the less attractive dancers require money to leave with you. The self-possessed hotter ones do not. However, if you get her naked in your bed, do no verify pre-coitus that she is not, in fact, a prostitute, because she will leave and call you names as your front door slams behind her. Or so my buddy tells me. Such trifling arrows of human amusement are not found in this man's quiver of irresponsible behavior.", "business_id": "wnOQw4nazfglLxwLogTlng", "stars": 5, "date": "2008-11-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "uz0oKQ4I-FkDoo6Up4ljUw", "review_id": "4L73P3BFl6Ej4gHpbB9GrA", "text": "This place is awesome! Great prices, awesome food, and the friendliest people!", "business_id": "DeAnVirgOxQnI36V1W158A", "stars": 3, "date": "2011-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ueo_kh3MeyUOZpK1AcTNZQ", "review_id": "anUf4otyoR_McKeWRgrH9A", "text": "One of my favorite treats in the Valley! I have always received great service and AMAZING FOOD! \n\nSure there's a wait, but its only because everyone loves this place. Highly recommend the Pizookie! Large servings, I cant say enough good things about this place.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 5, "date": "2008-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s5XBIeR6g12dSJGak6-B7g", "review_id": "2eP6cDL3yWUStzrPLS3iCg", "text": "LOVE LOVE LOVE this place.  The atmosphere is always awesome, the Bellini's are fabulous must have drinks and the food is wonderful.  Everyone must try the Mama's Chicken Rosemary Pizza... and if your a pasta lover, try the big rig with angel hair and chicken (its a spicy alfredo sauce dish of yummy goodness that just makes me happy every time I eat it).  Last off, never forget to get a pizza cookie...nothing, and i mean nothing beats this dessert.  This place will never be anything but a favorite of mine, even if we do have to wait 1.5 hrs for a table on busy weekend nights... just means more time to have a drink and chat with friends on the patio.  Enjoy!", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 5, "date": "2011-10-09", "type": "review"}
{"votes": {"funny": 3, "useful": 7, "cool": 6}, "user_id": "Q2jWOzEmkl6Zys2R1fFZWg", "review_id": "fvTGspUo-eBA4s3C7lJHcw", "text": "TALE OF TWO TRIPS\n\nDuring our lengthy stay in PDX one of The Nines Portland (Starwood Hotel) concierge encouraged us as a must try to visit this particular Oregano's Pizza Bistro. He said the pepperoni thin pizza, rigatoni and salad were his very favorite.\n\nOn our first Sunday evening in Phoenix, we make it priority to have dinner here. He did warn us that it's a very busy place.  So we arrived after 8pm and coincidentally parked right in front of the \"welcome\" sign. Again the parking gods were looking after us. If's most unusual for us to be offered water while waiting outdoors for our table. As it turns out we eventually get seated outdoor at a bar table for two. This is where we meet our server Lucas along with his manager Jonny (yes, it's not a misspelling).\n\nTold them that our PDX hotel concierge had been touting about their entrees. We proceeded to order the following mindful that we're intentionally over ordering and that the servings are huge in portions:\n\n- Jr Pablo Picasso Salad\n- Big Rig Pasta adding two meatballs to this rigatoni dish\n- Numero One-0 12\" thin crust pizza\n\nI think we had to be careful not to attempt to finish everything that was in front of us. It was all very very good. As a welcome to Phoenix gesture, Jonny treated us to their Pizza Cookie Chocolate Chip with chocolate mint Ice cream. By the time we were ready to hit the bed, it was very close to closing time.\n\nNote:  The pizza didn't make it past bedtime.  In the meanwhile it was salad and Big Rig for lunch the next day.  My classmates keep looking me as if I was a meal on wheels.\n\nOTHER TRIP\n\nDidn't know that our class would run so late that it eliminated many of our restaurants we had listed that closed at 8pm and 9pm.  Intentionally we keep a number of them along the 16th Street corridor.\n\nSo Yu-go chauffeur says let's go back to Oregano's and say hi to Jonny and Lucas.  This time we're seated indoors where its quite cool with all the red and green.  Asked Jonny to recommend something other than what we had tried previously.  This time we're more conscious of portions.\n\n- Junior sized Beefstro Salad that's spicy\n- Clark Street Meat 12\" thin crust pizza\n- Pizza Cookie Chocolate Chip with two different flavors of ice cream (told Jonny that we would buy our dessert this time. He still comped us)\n\nWhen it was all said and done, there was nothing to take back to the hotel.\n\nMANGA TALE\n\nThe pizza crust is flat bread thin and crispy so that we didn't feel like we were filling up with pizza dough.. Perhaps I would instruct them to cook it for a few seconds longer just to ensure that the crust remained crispy throughout our eating experience. Our personal preference would be the Clark Street Meat and Big Rig Pasta.  Both salads finished tied.\n\nA very big thanks to \"Aire-Bear\" of PDX for this wonderful experience. BTW his favorite is the Big Rig.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 5, "date": "2013-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "pxSJnxAYE6PwUiyvMIWSjg", "review_id": "3W_BpxPPx0LPUZCuxMQBCQ", "text": "They are the best cleaners I have had in the valley.", "business_id": "H7oxbxOf8Et5n6OD9uKgdA", "stars": 5, "date": "2011-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RzU8QymzASkuZvJhIQRjPg", "review_id": "s9LJUavtxBOEWcilq2xxRA", "text": "What a slow ass drive through!!! How does this constitute fast food? Everytime I hit this McDonalds it's so slow.....", "business_id": "lFs2xPJ6Nngi6DnHfsX4qA", "stars": 1, "date": "2015-10-24", "type": "review"}
{"votes": {"funny": 3, "useful": 9, "cool": 5}, "user_id": "fczQCSmaWF78toLEmb0Zsw", "review_id": "tL4sVONWJZB6rUgjcpSuVg", "text": "3.5 stars... Cherryblossom Noodle Cafe is a really good concept.  (It's a shame that Phoenix is lacking on options when it comes to Noodle Houses; Chicago, New York, and DC have noodles galore but we're not there yet I guess.)  Anyways, Cherryblossom has a welcoming ambiance and decent service too. I've been a few times, so I figured it would be the perfect place to stop for a late dinner last night after Urban Affair.  (It was Friday night around 9:30, so no problem getting in and seated right away).\n\nWe sat at the bar and got drinks immediately.  Since the BF had already eaten a bunch of appetizers at the event we were at, he said he'd just share whatever I ordered.  So, I chose the miso eggplant appetizer and the Yaki Udon Noodle entree with tofu.  The eggplant dish was really tasty but they served it straight from the stove and we both burned our mouths taking the first bite.  We had to let it sit another few minutes to cool down enough to eat it.  (Note - I'm not complaining; I'd rather have my food served too hot than not hot enough... )  \n\nWe finished the eggplant dish up right as the noodle dish arrived.  The noodles themselves were cooked just right but the dish had a weird flavor to it.  It just didn't taste right, or maybe it was just nothing special.  Either way, I would skip the Yaki Udon and go for something else on the menu when you go.\n\nAlthough I wouldn't rave about the food on my most recent visit to Cherryblossom, it was quick and cheap for a latenight dinner.  We were in and out in less than an hour and it was $20 out the door with tip - can't complain about that!  I'll be back!", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 3, "date": "2008-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dUrVJl5qi2CJWff7s8HJNw", "review_id": "_T5jdJe_1bOvhom3ThGLpA", "text": "Cherry Blossom Noodle Cafe is an interesting place.  It's located in a dodgy strip mall east of Rosie McCaffrey's Irish Pub.  A weird location, but once you walk through the door of Cherry Blossom you are transported to a little rustic restaurant setting.  It was a nice surprise.\n\nThe place was busy.  We had to wait for a little bit because we didn't have a reservation.  Our table finally opened up and the three of us took our seats.  I was pleasantly surprised with the prices on the menu.  The place wasn't going to break us.  Another thing I noticed was that the menu items were all over the place.  Sushi, Japanese Food, Asian Noodles, Italian Pasta and so on.\n\nOur waitress was an interesting soul.  I will leave it at that.  She showed up to take our order and deliver our food and that was pretty much it.  Our water glasses were empty for most of our dinner.  I ended up pouring our bottle of wine because my date refused to pour it.  He gave up on our waitress.\n\nWe had Spring Rolls with a peanut sauce and a Spicy Tuna Roll to start the dinner.  I enjoyed the spring rolls.  The spicy tuna roll was a little bit fishy.  I was scared.  My main dish was the Korean Spicy Beef.  It was one of their signature dishes.  I don't know why.  It was just okay.  The sauce was very rich.  Almost overwhelming.  I forced my self to keep eating.  I don't think I will order that again.\n\nCherry Blossom creates a nice environment and the prices are right.  No wonder it is crowded.  When I return I will try something else.  After all the menu is huge.  Something has to be good on there.  Three stars.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 3, "date": "2009-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "stC4ENxqdzYPBo7-vGPAXQ", "review_id": "JKD-GWujRWoBkNaHIEfUEA", "text": "Amazing chicken parm. I was told by my Brother i need to try it. I was hesitant at first because its a Japanese rest. It is fantastic. I have ordered it 2-3 times a week for past month. I am as picky as they get with Italian food. Good Italian food. Was born and raised in NYC and found this to be some of the best chicken parm in AZ. Portion is filling especially for $12.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2011-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nf656QMXHTuSmu-FGbrB-g", "review_id": "Os2Q2InMTtGzw1LucyKtpg", "text": "I love \"hole in the wall\" restaurants. This place has great decor, cozy feel, and great staff. Their menu has items to please all palettes.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2012-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "FJ3YM26IT1U0r9JijhLpNQ", "review_id": "G1LX_ZjE-xemh9sG9r_s4A", "text": "This was one of the few times Yelp has led us wrong. Came here because it was close by & had 4 stars. \n\nI will say the service was perfectly fine. Our server was very friendly & even though it was busy, we were greeted at the door & sat quickly. \n\nUnfortunately, it was downhill from the point we got our food. We ordered an assortment of rolls & a dish of pad Thai. The sushi choices almost all include cream cheese &/or tempura, which made it difficult to choose a variety without everything tasting similar.\n\nThe sushi all tasted fishy. I don't think it was unfresh, but it certainly didn't taste fresh either. It was somewhere in between the two...if that is possible. The presentation wasn't bad either, but the overall experience was tainted by the poor tasting sushi.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 1, "date": "2013-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OOxLwlNadygUwL_aG8KnSQ", "review_id": "pSJoI879yN36ktJBrs2rXg", "text": "I've been craving ramen and yelp had lead me to this place. I'm glad it did. I came here for lunch and had their ramen and California roll lunch special. The ramen soup was so flavorful and perfectly cooked! I'm still craving it right now. The California roll was fresh and a great portion as well.\nI can't wait to come back and try more things on their lunch menu but you better bet I'll be ordering that ramen lunch special sooner than later!", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 4, "date": "2014-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vyI3hYh_e8Xo8cYUD06p9A", "review_id": "TH0aKcIISbRLUdh9lYV4Vg", "text": "We loved this Japanese, Italian fusion place! Shrimp shumai was so fresh the wrapper melted in my mouth and it was still hot, with hot mustard in the middle of the plate.  my son had chicken parm, noodles al denti, sauce fresh, quality cheese on the side, white meat cutlet seasoned but not covered up by mounds of cheese and not over salted.  Husband had udon soup - tastey, noodles were fresh as if they just made them. we will go back!", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 4, "date": "2014-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RmD3jZdYJEWQuUkBaM-SMA", "review_id": "qJAJWywFGB9htYPze4W3kA", "text": "Amazing beef soup. Everything tastes great. Best thing I discovered was milky pepsi!!", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2015-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "V35ln_NqTycSELLMoLWjXw", "review_id": "9xD_HtBoZI_LHVOrnTcNAQ", "text": "I rated this location poorly because of the manner the store employees processed my return. I walked in at 5:45 PM and purchased a data card reader and battery charger for my Sony camera [universal]. I returned the next morning to return both items as my camera was stolen. \n\nI was told the store did not accept returns on battery chargers. I was told the policy existed because of people like me [who were from out of town]. I was told these people forgot their chargers at home and would buy the item, use it, and return it. I felt as if my integrity was being questioned. I felt my integrity being quesstioned. While I undertsand the compelxities of owning ande running a private camera shop, I felt the store did nothing to make amends. While I try to support private business, this situation maes me want to go to one of the \"big chain\" stores with a more \"liberal\" return policy. \n\nThe packages were unopened and factory sealed! What could have made this experience  better was being told about the return policy when I purchased the items. I lost $40 on a $70 purchase. Rather than being told beforehand about the policy, I was told after the fact \"You should have read the return policy\". I do not know anyone who stops to read the return policy before making a purchase. I learned my lesson. I will always ask about a store's return policy before making a purchase.\n\nI strongly caution you to read their policies before buying anything. Cameras must be returned within 7 days and most items are non-returnable.", "business_id": "VilxIfmahfOhMcIaGK8Www", "stars": 2, "date": "2010-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XPRYg0-dYlpoaSoNEi2vVw", "review_id": "KLIC_lDBEWCp_WTdBAQrJg", "text": "These guys are great!!  I just had my SUV in for brake service as recommended from the dealer but didn't want to pay the dealer prices.  The brakes were more costly than I thought due to an issue with how they were wearing which John the store mgr. pointed out and walked me through in the shop.  I also had to replace my shock absorbers which were leaking and already had a quote from this from the dealer but these guys were much much less so I agreed to have them do the work.\n\nThere was an issue with the shocks that they ordered the wrong items as my SUV has air suspension shocks so there was some extra time that was needed to complete the job.  The great part was these shocks were twice as much as what was quoted to me for my total repair price and John still honored his initial quote where most places would've charged me extra for that.  \n\nLastly, the communication was excellent and John kept me in the loop all day.  We discovered around 7pm that the job wouldn't be done in time before they officially closed but I really needed my car the next day for work and meetings and they stayed open until almost 9pm to finish the job and he didn't hesitate at all about doing it.\n\nI wish more companies had the integrity that they have.  I will absolutely be back here to support this business and happy recommend them.", "business_id": "6jsv1cp0Gd26X0BiE2tmTw", "stars": 5, "date": "2014-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OacRaP2XiIHVr7S0ZfO71g", "review_id": "pksr5p5EufXeAly8q1mczA", "text": "Great experience!  Can't say enough about the complete team effort.  From the beginning to end, we had complete professionalism.", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 5, "date": "2015-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kAHUx9Z-vwaahW5cpoUg0w", "review_id": "_lrRZn4RvFvjT3j7Tx0iLA", "text": "For this Thanksgiving get together, we actually had a little drama. Unfortunately, I was the focus. Fortunately, I was quickly taken away by the Osso Bucco which was delicious and succulent in a tasty broth. A small fork was provided for digging out the marrow but was really needed was an anteater tongue or large sledgehammer to slurp up every morsel of marrow. \nThe Calamari starter was tender and perfectly seasoned. The maragarita goblets are fantastic old school bar cocktails and 2 were sufficient to make anyone happy.\nCome bring some family drama with some calamari, osso bucco, and cocktails for a great evening.", "business_id": "3CSaqRNvYg7ZdN2zwxwzVw", "stars": 4, "date": "2015-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "0dgQa81w5it1PMpGpC_L0A", "review_id": "z_tlLcCjjtekj21JZ1HNcA", "text": "I stopped by Karsh's to spend my groupon on pastries for a work meeting (hope they don't expect breakfast every time!).  I was happily surprised at how reasonable their prices were.  I walked out with tons of yummy pastries - bear claws, danishes, etc.   They were all yummy.  Even after purchasing way more than I actually needed, I still hadn't spent the entire $20 groupon... I was about 70 cents under, so the woman helping me threw in a handful of small, sprinkled cookies to make up the difference.  Nice!\n\nThis is definitely a place to keep in mind, when the usual donuts just won't do!", "business_id": "vaqmESluryt5i4Wbkb6KRA", "stars": 3, "date": "2010-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pYhKjyzGvEVY-mj9xB7Oug", "review_id": "3tgAflE-obVjbWbGvSsGYA", "text": "The guys are the bee's knee's!\n\nAwesome haircuts at a great price.\n\nSometimes there is a little wait but it worth every second. \n\nThey are professional, courteous and make sure you walk out of there in tip top shape.\n\nI have never had a bad experience with them and recommend family and friends all the time!", "business_id": "vLlPTJV2KInOg6AIvNCf2A", "stars": 5, "date": "2011-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "waizSfrXOanYkhDneQnZrw", "review_id": "CEdZDAcG1UW-wJPh0ZtB0A", "text": "Such an unassuming little spot, the jumbo Chicago dog is excellent! Seems like a family owned operation which I totally dig, and the lady at the counter is as sweet as could be. Super glad I skipped the trendy place down the street in favor of grabbing lunch here!", "business_id": "FW2Z4ll4zSOEDAJX9-wBZA", "stars": 5, "date": "2015-11-05", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "0bNXP9quoJEgyVZu9ipGgQ", "review_id": "cSKn-pFcfci8rkUAUP51eg", "text": "My first and only visit thus far was many, many moons ago as part of a large meetup group.  Many of us started to gather outside around 7p.  I arrived a little earlier since I planned on trying some BBQ at the stand located outside the venue.  The meat sampler I had was tasty, and it was easier to turn down the cornbread since it looked rather dry.  Instead, I said hello to a beautiful slice of peach cobbler :D  While I cannot eat raw peaches anymore (a pity really, since I only started eating fresh, not canned, peaches around 2 or 3 years ago and LOVE them!), I've found that cooked peaches are safer for me, which I am thankful for.  I recall thinking that the cobbler was good.  \n\nMusicians started to set up around 8, and the first band began playing at 9p.  I enjoyed the many bands that performed that night.  The acoustics of the room was very good considering the venue's history.  I did notice that the crowd here was an amalgam of various age groups, and everyone did seem to be having a lot of fun.  One downside I found was how busy the bar was, esp. since all I wanted was ice water.  Perhaps someone should install a bottled water vending machine.", "business_id": "JZJqJadk9pSoCGT7VTwBvg", "stars": 4, "date": "2008-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "s3qLTxZt4ob-HhpoftOnhg", "review_id": "gjx4Bz-fty-9HdpPOVE--w", "text": "Saw the Soul Power Band last night. They are very good. The atmosphere was classy and cool and packed. The attendants were nice and attentive. This was my first time there, and I kept thinking, why didn't I discover this place sooner?", "business_id": "JZJqJadk9pSoCGT7VTwBvg", "stars": 5, "date": "2015-11-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "DUE3dksgt7x-aYBANqEYNQ", "review_id": "kppbe1cPxfiFdSf2A1MKRw", "text": "Top notch....as long as you have a warranty", "business_id": "MdDCaLarh1aWU9NfB6SQjA", "stars": 4, "date": "2013-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "7cucTtf-UbtDxnvFnnb1jw", "review_id": "aWRhB1-UpcQgg7pVabURKA", "text": "I only come here for massages so that's what my rating is for.  Their 90 minute massage is $105, which is a bargain compared to local hotel spas, etc.  I highly recommend Ann, who is great!", "business_id": "byNyDMlRwpWD1GAil5QXjA", "stars": 5, "date": "2013-09-26", "type": "review"}
