{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "9cCTmiJ7hz35rHIdr8n9kA", "review_id": "dXBCUsjyAmWiKypnDnRJUw", "text": "OK, its Friday night and have about 70 minutes to eat. Driving by Papa J's and W says, lets stop in and get a quick dinner. \n\nAdvice host that we are in a hurry.  The host advised us it is a 90 minute service. The place was crowded, we were seated at the last open table. However our waiter, Jason, said he will do his best to get as out on time. We ordered our dinner immediately, with a salad and a glass of wine. In a few minutes we had our wine, then in a few more seconds we had our salads and some great homemade Italian bread with some olive oil and balsamic ving. for dipping.  Yum!\n\nJust as we were finishing our salads our dinners were delivered. Great job Jason! The Fettuccine Carbanara was very good; a thick cream sauce with bacon and ricotta.  In and out in 60 minutes.  Now that is some good service.", "business_id": "P1fJb2WQ1mXoiudj8UE44w", "stars": 4, "date": "2011-10-17", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 0}, "user_id": "6rR83Un71x8KWnW9-oJfqA", "review_id": "WeOCls-1J47AFFQpN4kf4w", "text": "This was the place I brought friends visiting from out of town when I wanted to show them the classy Italian  spots in Pittsburgh. After my visit last night, I have no desire to ever go again. \n\nI don't know the owner, Joe, personally but he has stopped by our table a few times and said \"dish looks beautiful.\" He was always confident in his food which I guess is a good thing if the good is delicious,  which it usually is  \n\nThe table next to ours had a two women, a mother and daughter. The mother asked the server for a new steak as hers was a bit salty (I've never had the steak as I'm vegetarian but my guests have mentioned the abundance of salt). The server apologizes and returns to the kitchen. The owner comes out and fakes an apology claiming his steaks are perfect. At this point the whole restaurant is listening it's that crazy.  The  best part? He comes out again and says \"I really enjoyed the steak you sent back.\" He was eating the steak and had some in his mouth! I can't make stuff like this up!\nAt this point the whole place feels bad for the mother and daughter. Clearly an awkward situation. The owner got so nasty the daughter tried to reason with him and he said \"it's not my job to make people happy\" that's strange considering he wants our business. \nSo the mother tries to pay the bill with a $100 and leave but he said they can't make change. Eventually another customer helps make change and they leave.\n\nI couldn't finish my dinner I was so mad.  Maybe Joe was having a bad day but there is no excuse for how he treated those customers.  Sorry, we will never step foot in here again.", "business_id": "ZL6DNzyenFm9Kpz6uADlNg", "stars": 1, "date": "2014-10-07", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 0}, "user_id": "KDn2HhWfKNE9--RXpWz-9g", "review_id": "zZ5gOnmjljRT3fyfd0yQ5Q", "text": "Seated in the bar after having made reservations a week in advance. That, paired with a mediocre menu and overall experience, gives this two stars. Save your money and stay in town. I would probably send you to the (gasp) Olive Garden before I referred you here.", "business_id": "qUeBDN0D8SC93KeAHhiL-g", "stars": 2, "date": "2013-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qlHSiu6FTHIUvuqH1PSkcg", "review_id": "HG6irztyOZQxphqn4nSw1w", "text": "We had the mushrooms, meatball appetizer, pasta, salad, veal piccata and spaghetti with clam sauce. A nice pasta dish with roasted veggies and marinara was made as a special order. But I was not wowed by this restaurant. Large portions are not enough to impress me. The tastes were good, but for the prices, I'd expect better. If you're a big meat eater, or love to eat huge amounts of pasta, ok, this is great. But the sauces were just ok, nothing spectacular. Spaghetti with clams was covered with red pepper flakes but not noted as such on the menu. Would you like someone to cover your pizza slice with red pepper flakes without asking? I'm sure the deserts are good but we didn't have any - but the sizes of the appetizers and entrees is just over the top, but not worth the premium prices to me.", "business_id": "qUeBDN0D8SC93KeAHhiL-g", "stars": 3, "date": "2015-11-30", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "lyrEN-nQlrMtoL5ll7h9BQ", "review_id": "ihDQwP_PyWeRWjn_C1-DKA", "text": "Went for the first and last time tonight. Made reservations for 3. Restaurant thought we said 2 and acted like we lied. $12 corkage fee for 1 bottle of wine. Asked to leave when we finished eating, because they needed the table, on a Thursday night. Food was OK, but not even close to making up for all the other problems. I can easily get a good meal elsewhere for those prices, with better service.", "business_id": "q_BKmbdlYfQJroJVHfYMUQ", "stars": 1, "date": "2015-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "bHxKVGf_8z9fwvbbYJsKFw", "review_id": "GReKBs98GPFFHUaaFIpJQg", "text": "I love their unlimited soup, salad and breadstick for lunch special!", "business_id": "zpNGtjBlIkDq_PLGSCPlAg", "stars": 5, "date": "2012-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vUO9hsujaRGqjvP6FBioJQ", "review_id": "EBYAMBWFV0Kv2Ha6aaN-xQ", "text": "Great food! Chef salad, garlic bread and pizza was amazing. Dinner for two for less than $15 in downtown Pittsburgh. House Italian dressing (homemade) was delicious! We will definitely be back!", "business_id": "DhDNNHZtaBxYNSqJz64ixg", "stars": 5, "date": "2015-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1lHaL4dlPUm2YOkNbD9ayA", "review_id": "wot0Cf1IgPobj7mRvDjC4Q", "text": "We went on a Saturday night. We were told it would be a 30 minute wait...but it was likely closer to 45-50 minutes. \n\nThe food is just average. Nothing special. Didn't seem handmade or anything like that. I thought they were known for their lasagna...so I got that. Blah...average.\n\nService was incredibly slow. I don't think the waiter checked on us once.\n\nI probably wouldn't go back.\n\nVisited October 2014", "business_id": "9mwShpTgZofOujt4JfyGmw", "stars": 2, "date": "2014-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EV4u-Ct9a0Yl7ecwAffccw", "review_id": "gsuLUu9HDk5GmQdUTEL6xA", "text": "Somehow I thought the place was going to be fancier.  The way the concierge at the hotel spoke of it, it sounded like it was going to be expensive and busy.\n\nBut I was pleasantly surprised to see entrees that weren't too expensive and a very comfortable atmosphere!  It was a welcome warm spot on a cold November night!\n\nI had the Pasta 3-course meal and was thrilled! - cesaer salad, all-u-can-eat 3 types of pastas and any dessert off of the dessert menu!  I thoroughly enjoyed 2 of the 3 pastas and particularly liked the meat raviolis.  Very tasty!  While it was an all-u-can-eat offer, we really didn't have much more than small amounts of each, as all the portions were hearty and filling.\n\nThe wine list had a selection of $28 bottles that were not fantastic, but tasty for the price.  And the ambiance was enjoyable.  Our group of 8 had pretty good service, and definitely enjoyed our experience there.\n\nSide note:  Not an Italian dish, but the night we were there one of their specials was Hungarian Goolash, that was raved about by the 1 person at our table who ordered it!", "business_id": "XmdTkxKyJd7TuDLoiic1kg", "stars": 4, "date": "2008-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EoItAkP58vSnG_-ZhJI8pA", "review_id": "tCvcbexb87Pq2JU6h8AGtQ", "text": "Had dinner here on a Saturday night. Actually, wanted to go to Piccolo Forno, but they said they only take reservations for groups of 6 or more and for two of us there might be a half our wait. We wanted a sure, immediate thing so we decided to try Lidia's.\n\nDRINKS: My husband had the cabernet and said it was fine, nothing spectacular but def what you'd expect from a cabernet. I had their Prosecco. It was good, not as sweet as I'd like, but still tasty.\n\nAPPETIZERS: We didn't order any dishes intended to be appetizers (you'll read what I mean), but we did enjoy the basket of bread and unique spreads (garbanzo and something, olive and something) that came with tit. The bread was not straight out of the oven, but it was definitely fresh-baked that day.\n\nENTREES: I ordered 2 appetizers instead of an entree. The first was the octopus dish, and it was THE BEST OCTOPUS I'VE EVER HAD!!!!!!!!!!!!!! Tasted like what it was but without being too briney/fishy. Also had a great texture. And the other items in the dish (capers, etc) complimented it really well. I don't use the word delicious that often, and I use delish even less often. But that was deliciously delish. \nMy 2nd appetizer-turned-entree was the cheese crisp. It was tasty, but super heavy. I chose the crab and scallion filling for that one, which was nice, but I think the whole cheese crisp idea (essentially cheese melted down to a \"cracker\") did not suit me. After a few bites I decided to pack the rest, but haven't eaten much of the leftovers.\nMy husband tried the pasta trio (unlimited) and liked it, though he didn't rave about it. I think there was a spinach ravioi, some type of alfredo linguine, and a pesto with meat and a red sauce, so there was a good texture/flavor variety from what I could see on his plate. He ate two full plates of the variety of pastas and was stuffed!\n\nDESSERT: We shared the Tiramisu. It was very fresh and authentic tasting. I felt like there was a bit too much espresso/coffee powder sprinkled on top, but perhaps my palate is sensitive to that. Overall it was yummy.\n\nSERVICE: Friendly and attentive.  \n\nDEALS/DISCOUNTS: None\n\nOVERALL: Glad we tried it. I would like to try the other well-rated Italian restaurants in Greater Pittsburgh, but I have a feeling I'll go back to Lidia's someday for that octopus -- so freakin' good!", "business_id": "XmdTkxKyJd7TuDLoiic1kg", "stars": 3, "date": "2011-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6K3fW6OL8DRt89bCij1dPg", "review_id": "MtiERkTPfn9RnSrZZZHzPw", "text": "We have been to Lidia's twice now, and have received delicious food and excellent service both times.  We have only been on weeknights, and with reservations, however, so I'm not at all discrediting the reviews that discussed poor service on weekend nights and/or without reservations.\n\nThe pasta trio special was good when I had it, but my favorite dish is the gnocchi with duck ragu. I also loved my husband's wild boar ravioli. Skip the overpriced wine and order one of the house sodas instead. The ginger cranberry is fabulous!  We also love love love the frico and burrata appetizers. The frico is large and rich enough that it's really enough for two people, but the appetizers are yummy, so everyone might as well get their own and bring home whatever they can't finish.  \n\nNote to parents of babies, this restaurant is very family friendly, in our experience. We loved bringing our infant daughter here and were pleased that the restaurant offers slings for carseats for the smaller babies as well as highchairs for babies who are of sitting up age (many places don't have the slings). The lady's room and its changing station were very clean. The staff often stopped to smile back at the baby when she was smiling at them, and our waiter asked if we needed anything for her. Not necessary, but very nice, and appreciated.\n\nThey have valet parking, but we just park about a block away and walk, since we sometimes enjoy walking further down the strip district, anyway.", "business_id": "XmdTkxKyJd7TuDLoiic1kg", "stars": 4, "date": "2014-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XL7deQSuYDQlGIM7PKnNKA", "review_id": "Fnm04L9_dxzjdtFBXMosaQ", "text": "I live right around the corner, so I've been here a couple times. The atmosphere is local, and the service is friendly and attentive. What wins this place 5*s  is the food - some of the best italian food I've ever had! Pasta, gnocci... even the salads have been delicious. The bar is beautiful as well. It looks very old but in a good way. I was so surprised by this place - it's one of those Bloomfield gems that I was very happy to discover.", "business_id": "nUISXnW2Jo9ovnoFBIUY_Q", "stars": 5, "date": "2012-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G1hNu0FZFv5S_nkh1C-35g", "review_id": "Y_Fs8HL7VIbudiCOpHp4dg", "text": "Take a quart of wedding soup home with you.  There has to be a little Italian mama in the back making sauce.\n\nTraditional Italian cooking .... you know what is for lunch tomorrow. ... leftovers from dinner ... huge portions.  I took a 300 lb football player (lean mean fighting machine) there for dinner he couldn't finish the lasagna ... it's that big.\n\n[Parking is an open metered lot behind the restaurant ... people walk their dogs on the sidewalk and through the lot ... watch your step ... there is always a pile.]", "business_id": "-Nanlb7SYXObqQ6dZ49UOg", "stars": 3, "date": "2015-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EjxE1dW0WVqOezpKqFN5kQ", "review_id": "SbxW24dT0AG4HS9nzrPRdw", "text": "Used to be a devout Mineos kind of guy but I have been converted to Fiorism.   Just love the cheese and crust.", "business_id": "r8jeeS3k_diihMDSu9IjlA", "stars": 5, "date": "2008-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5c23Gg5owmGCDAaA9JzzyQ", "review_id": "ksXchLk1MqyyxxaRCOZlcA", "text": "My favorite pizza in the city. Hoagies are also pretty good but the pizza takes the spotlight. One of the best places to shoot pool in the south hills next door, what more do you need?", "business_id": "r8jeeS3k_diihMDSu9IjlA", "stars": 5, "date": "2014-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WG3nRWr_RPm7cImK869wKA", "review_id": "Op2L-LLQM862gdelwdfKUg", "text": "Best wings and fries in Pittsburgh!!  Really great bar atmosphere!  Food is typical bar food but delicious. They have a pretty good rotating draft selection and the bartenders are great. I love this place, really. It's a great neighborhood bar, I only wish I lived in walking distance!!", "business_id": "dQjaHoo89bLymdMm4S5_1g", "stars": 5, "date": "2015-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "xSyjJmHMYyoutsNznUWTqw", "review_id": "6tANdkDHK1Ha-oKt_vIuRw", "text": "Turns out I should leave behind the N. Hills and venture to the S. Hills for dinner just a little more often.  I consider myself to be an excellent judge of Italian food and this place was really good.  We ate dinner in the wine bar which is out back and up a set of stairs.  It was a little more intimate than the front dining area.  \n\nI'm a fan of sweet wines and there were a lot of drier options so I went with the blood orange martini and it was fruity without being overly sweet.  There were so many delicious meatless options on the menu that I was really debating what to order.  I LOOOOVE fresh mozzarella and basil, so it was like my own little slice of heaven.  I went with the rigatoni with eggplant, marinara, fresh basil and mozzarella.  I cleaned my very large plate and even used some of their bread to wipe it a little cleaner.  I'm eager to go back and try some of the other fare.  I also want to give mad props to our waiter who helped me make my choice and provided excellent descriptions of the food!\n\nMy only real complaint is the olive oil they serve with the bread.  It could use some flavor or seasonings or even just some parm and a little pepper.  The only bland item I tasted.   Also, the restaurant is a little pricey.  Not ridiculous but not cheap either (especially when you add on a drink).", "business_id": "6-rJjW6ITl5o_FliiNgZRA", "stars": 4, "date": "2011-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "CHBvRUX2zhvepA1IOzQPVA", "review_id": "nbLOh1O8hQ76M4z0Hsbtjg", "text": "Cozy and comfortable, our food was really good, and the waitstaff friendly and efficient!\n\nThe mussels were great (garlic madness) and they split some entrees for us in the kitchen. wowowow.\n\nWill definitely try and revisit next time I'm in Pittsburgh.", "business_id": "xgK6AAhJ-cYBUCSaLzgTuw", "stars": 4, "date": "2008-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DSWiwtUyWK1YwY8NBKDhGg", "review_id": "OGg-60W8bhhv04ehKb2V4Q", "text": "I've been meaning to try Girasole for at least three years. Finally got around to it tonight as we were looking for a nice patio dining experience on what is presumably one of the last warm autumn evenings of the year. The patio is somewhat tight, but pleasant -- we were able to get seated within a few minutes. It's on a side street to Walnut, so it's quiet and appears to be non-smoking which is a huge plus.\n\nThe entrées (pumpkin ravioli and grilled chicken with gnocchi) were delicious, as were the appetizer salads. They have a decent Italian wine menu, and a selection of mixed drinks too. Overall, we had a good experience, although the servers seemed rushed and this made the experience somewhat less pleasant.", "business_id": "xgK6AAhJ-cYBUCSaLzgTuw", "stars": 4, "date": "2013-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "plNKzNhFP4fzAvfBlfET7Q", "review_id": "IBVCvc9Tcrcni37B1PNVkw", "text": "I have been to Girasole 3 times now, once in June, August and today. Here are my thoughts over all three of my visits.\n\nThe atmosphere is inherently romantic, except that the popularity of the restaurant combined with the small space makes it difficult for it to be an intimate outing on a weekend (I've been there on Friday and Sunday evenings for dinner, not sure the situation on weekdays). Sometimes it can get pretty loud.\n\nHowever, the food makes up for what lacks in terms of atmosphere. I love that they give unlimited table bread with your choice of butter, olive oil and balsamic vinegar. Their entrees come with a house salad that is exquisite: sometimes I look forward to it more than the pasta! It has this great tart dressing with gorgonzola cheese and roasted pine nuts. Absolutely divine.\n\nI've tried three entrees:\n\n1) Cavatelli with lamb sausage - light sauce, very flavorful meatballs. Loved trying a new pasta\n\n2) Penne with grilled chicken - a constant on an otherwise seasonal menu; this is my BF's staple order but was a bit too safe for me\n\n3) The famous cheese and spinach ravioli in a tomato cream sauce - THE BEST RAVIOLI I've ever had. Dipped the bread in the extra sauce, this will definitely be my order moving forward!", "business_id": "xgK6AAhJ-cYBUCSaLzgTuw", "stars": 4, "date": "2014-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZzH8eT_kaflG2_piqIWkUQ", "review_id": "2oC3PwRkhIbznS8WeejoiA", "text": "great pizza and huge portions this is some really good stuff. They are really friendly and this is a hell of a deal its the size of three slices at any chain and they taste amazing. The only thing that could be better are there sides but still this place is worth a shot for a pizza lover", "business_id": "sJtGRBWYUj013nkFA4Hrdg", "stars": 4, "date": "2011-09-06", "type": "review"}
{"votes": {"funny": 5, "useful": 8, "cool": 6}, "user_id": "VhI6xyylcAxi0wOy2HOX3w", "review_id": "KYarnk3rSVN_7JzvNepKWQ", "text": "Booked on Open Table, right after I got the confirming email I called the restaurant and asked if the kitchen table was available. I happen to enjoy sitting in the kitchen. So I was disappointed that my wife and my daughter weren't fans of the experience. But Buca was awesome - they swapped us right out into another table immediately without a wait. Woot!\n\nWe chose the large tossed salad to start and then three big entrees to share. Yep, that was probably too much food. Huge platter of Eggplant Parmesan. Big tray of cheese manicotti. Ginormous vat of shrimp fettuccine Alfredo. All really delicious, all really big servings. We took a shedload of it home with us.\n\nAs for the desserts, they are ALSO sized to share. The brownie sundae, by itself, is enough for five people. And we also had what we thought was going to be ONE canoli but was actually three of 'em. Oy, my tummy hurts.", "business_id": "SVKC_-gIQFkHElZ6bFsE6g", "stars": 4, "date": "2014-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RLvyhysiwYoClxbAo0XwLg", "review_id": "ChK0wFpmp5RvtNfySgVhOg", "text": "The food today was all good ..we had chicken Alfredo ,kids ravioli , the new wings , risotto balls and the soup and salad , they were all tasty I really enjoyed the wings. The service was however pretty terrible the appetizers arrived after our meal we think they forgot that part of the order . the bread sticks showed up finally as we were done . I will say the manager did give us the appetizers for free without us ever having to complain so that was a plus ..", "business_id": "4WsTFTH8GgnyFHwrH9nHzA", "stars": 3, "date": "2014-09-27", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "SZ56K9vxIEid0KoqZjFwkQ", "review_id": "WQvWEN1GnCz-om3tpnY0dw", "text": "I found an opportune moment to try this place when Charlotte's Restaurant Week rolled around again last summer. I have, and always will be a fan of fine Italian cuisine, so one could argue that I was biased from the moment I stepped in here. Nevertheless, it would seem that this small restaurant tucked away by the Bank of America building, certainly lives up to expectations. \n\nThe diner is spoiled for choice by the authentic menu items, though the choices are not overwhelming. Dishes are described in only three or four words which allude to traditional Italian ingredients and preparation. Then again \"potato gnocchi, tomato porcini mushroom sauce and parmigiano\" already sounds delicious.\n\nThough we waited awhile to be seated, we were handsomely rewarded with free champagne, which kicked things off nicely. The grilled octopus or \"polipo\" was outstanding. Lightly chewy and savory with a nice grilled flavor. The scallops must have been sourced from another planet because they were each the size of small dinner plates. Perfectly browned coat with soft white flesh in the center. Veal Milanese was also quite good, though possibly a little tough. Awesome arugula + parmesan + balsamic garnish. For dessert we had the Semi-Freddo with almond nougat caramel sauce. Great finish.\n\nI would definitely come back here again. My mind wasn't blown, but the food was pretty good and the restaurant's atmosphere felt a little more traditional than those of its contemporary Italian counterparts in the US. In uptown, this will be the closest you get to real gourmet Italian food that resembles anything like its motherland so let's make the most of it!!\n\n4/5", "business_id": "z24h6ZYnZiWjlDTuLXG9jw", "stars": 4, "date": "2012-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Zwsq31eNUo2HpdkV2h9aig", "review_id": "wq5oathuWcvWnj_34Heyig", "text": "I'm not completely positive, but I'm pretty sure this place is named after Frankie \"Blue Eyes\" Sinatra. He's pictured throughout the place & I don't think it's a coincidence the place is called Frankie's.\n\nLocated in the Dilworth area of Charlotte, you're in the nice part of town so expect to pay a hefty price for dinner. I've only been for dinner, so I can't comment on the lunch menu, but this place seems too upscale & nice to not be a date night retreat. I suppose if I had a well paying job I could swoon my girlfriend here more often, but for the food & price, I'd just prefer this as a date night joint.\n\nThe food is quite tasty, so don't think I'm not a fan of it. Being half Italian, spaghetti sauce flows through my veins, so any Italian restaurant lights up my radar. I've had a couple of their dishes & they feed you a hearty meal that will soothe your hungry stomach. While not the best pasta dishes in the world, it's pretty good & there's a reason the place is always packed for dinner.\n\nIf you do date night here, they have an extensive wine & beer list so both you & the misses are happy. The service is absolutely extraordinary, or maybe we just had a really good waiter one time. I was there with my girlfriend's friend's bday dinner & the waiter crooned her much like Sinatra would with the Happy Birthday song. Yep, count me impressed.\n\nSo while Frankie's may not be a weekly dinner destination, if you're in the Dilworth area with your misses & craving Italian, then this place won't disappoint. You may even leave the place looking to download some Frank Sinatra when you get home.", "business_id": "OOPBFViU0cl_GryJOEEUcg", "stars": 4, "date": "2008-09-18", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "OXzYyZSHo9Dl6Qd0s_o2Ig", "review_id": "w1nCzopCxU_JO4vv12J8Hw", "text": "Fantastic Italian food!!  I have been going here for years and after a recent visit I realized I never reviewed it!  My favorite app here is the goat cheese and bread.  They drizzle the sauce around the plate so you get a hearty mix of the cheese and sauce mixture for your bread - YUM.  I have liked every pasta dish I have ordered here - and the pizza is made in their wood-fired oven.  \n\nRecently I got the pasta with vodka sauce - it is so much food!  Very delicious but heavy, you can easily split this with your dinner partner.  The outdoor patio is so breezy and cozy you will love to linger over your wine.  The fireplace is a great touch and creates perfect setting for a romantic date.", "business_id": "MQnNtW1lHS-eid3QNUoUIw", "stars": 3, "date": "2011-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "vKg-Zi4tvTyNt3Fo1QEYTw", "review_id": "DjSpFyGgSTjLt3EbIlZBFQ", "text": "I do not have much to say about this place other than the food is horrible.\n\nthe people are nice but the food is horrible if you are itialian and the cook is not even itialian.\n\nstay away if you want real itialian food.", "business_id": "MQnNtW1lHS-eid3QNUoUIw", "stars": 1, "date": "2014-10-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "hSgTbqNYo1-OfEAiXB7h_w", "review_id": "18HvdhSKvIeTC7vPjX9bxQ", "text": "World Famous? OMG...World Famous? \n\nI am a lifelong Charlottean and the Open Kitchen of my youth must be in a pod somewhere waiting instructions from the mothership. This place gives restaurants...no...anyplace with a kitchen, a bad name. Terrible greasy smelly cheesy food. Cinnamon or nutmeg or something in the sauce. flimsy plastic cups and paper plates, cold bread. And to top it off the woman at the register was very rude. \n\nCome back Mama K.....we need you.", "business_id": "MCFxbw9hQYejyvg59T44TA", "stars": 1, "date": "2011-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "NCyCjKe-jr9TkS5cfumXlA", "review_id": "kUrllvzKv_sdKai7Tb1M_A", "text": "Food was mediocre at best, place seems kind of dirty. Wouldn't recommend.", "business_id": "diPvh48CJsNW0hsf9981ZA", "stars": 2, "date": "2012-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pbTIQDN5tnB3Vm3m9N6FuQ", "review_id": "XzJiy0Flh323Kc28hxKvNA", "text": "Overpriced and underwhelmed. The excellent waiter could not make up for for overcooked broccoli and sausage over mediocre quality pasta. Pity as I like to support the local businesses.", "business_id": "GNKcvMI0RyVQyEA4jNQXjQ", "stars": 2, "date": "2013-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GGs7Q2xTSMOq2tRG09Lv7g", "review_id": "Am7CE2aztMUNR3wRLzzgog", "text": "Been to this place last Friday for dinner. At first we were served with bread and olive oil. I ordered, \"Blood Orange Cosmo\" my husband ordered ,\"Sorrento Lemonade\"\nthey were OK!   \nFor main course we ordered Alfredo pasta and  Chicken Milanese. Pasta just ok! but \nChicken Milanese was awesome seasoned perfect and well cooked. The portions are very big.\nHow can we leave Italian Restaurant  without Tiramisu but too much of Rum.\nI am unhappy because of the service.,", "business_id": "hvhogN-3cMny0Nrqbsjpkg", "stars": 3, "date": "2012-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "mraE_nGFafgSb_bRaugKKg", "review_id": "vA2ulskJqxzkxMJVqNBddg", "text": "I went to Vin Santo with some work colleagues while in Middleton for a conference, and it was terrific!  The restaurant is small, with dimmed lights, which makes for a cozy setting.  The hostess and waitress were very welcoming.\n\nWe arrived around 7:45 on a Tuesday, and we were the only people in the restaurant, which seemed unusual, but maybe it was because it was a weekday?  Anyway, I ordered the scampi carciofi, which consisted of shrimp, garlic, artichokes, olive oil, and cherry tomatoes served over spinach fettuccine.  The portion was HUGE, and the food was fresh and very tasty.  My colleagues had the eggplant parmigiana, which looked and smelled delicious, and a chicken dish that I can't remember the name of, but which also looked pretty good.  \n\nI'm not sure Vin Santo is the best place for a business dinner, but for a romantic date, it's perfect.  I will make sure to come back here whenever I am in the Madison area, and I would recommend it to anyone looking for a hearty, delicious Italian meal.", "business_id": "q8fD82us6uuGufvI44NoAg", "stars": 4, "date": "2010-09-27", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "2sFRtgagDZEufcJ5uBfz6g", "review_id": "dC0DCJ-uv7jgcDvfPlOHLA", "text": "We go to Benvenuto's a couple times a month after work for drinks. The bartenders are always friendly and efficient.  Such a gem to have on the Northside of Madison.", "business_id": "ybkWtM1ZnT2ewuquj3A9KQ", "stars": 4, "date": "2012-11-24", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "2L-zcbG8o8AXuRLyJ18N9A", "review_id": "eUKaqPCCv1cpXXKevV_6BQ", "text": "The various red sauce pasta lunches are a great deal, and some people are big on their porketta sandwiches (not me, really).  I always liked their pre-packaged desserts and other gournet goodies, and LOVED their muffaletta sandwiches (ask for one, they dropped them from the menu a while back, but the last time I went they would still make one for you).", "business_id": "ki33_SvM4kPjgA44Re8-zQ", "stars": 4, "date": "2006-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XzIKZTb4I-7wW4BjKwV2Mw", "review_id": "6aE5EfRvlo5uNimDBjYfaA", "text": "Another date night! This one wasn't my choice though, and knowing how I feel about chains as well as my high standards for Italian cuisine, I bit my tongue and hoped for the best.\n\nWe had to wait about 10 minutes on a Tuesday night to be seated. Apparently Olive Garden is a hot commodity in Champaign....\n\nWe were seated and I was quite indecisive about what to get. I settled on a build-your-own-pasta with alfredo/cream sauce and added Italian sausage. For my choice of soup, I got the Tuscan bean, and of course the notorious breadsticks. The soup was pretty tasty, it had like beans and zucchini and onions and a bunch of other things in a tasty tomato-y broth. Not bad! The pasta I got wasn't too bad either, the noodles may have been a little overcooked but the sauce was pretty creamy. I did not like the sausage. I'm no tubular meat expert but this tasted really institutional and for the upcharge it cost to add it to my pasta, I probably should have just went meatless or ordered the chicken, like my smarter date did....\n\nThe thing that really upset me about the experience though was the service. I don't remember the server's name, he was actually quite personable, but our meal felt very very rushed. Our soups came out quick which was good, but I was not even halfway done with mine before our dinners had arrived and we had to move our soups out of the way to eat our dinner. I'd consider myself a fast eater, too so this was frustrating, especially since I wanted to actually talk to my date, you know, the reason why I'm here in the first place!! This wasn't the last straw though, I was probably 75% done with my entrée when the server comes up and asks if we are interested in desert. Ugh! We looked at each other and both agreed this meal was unnecessarily rushed. At that point I just asked for the bill which he pulled up on those tacky tablet things a lot of chain restaurants have now.\n\nThe food wasn't even as bad as I thought it was going to be, but the hurriedness of the service really put me off. 2/5", "business_id": "H0D2HYqLd9MRCq68rtbTyQ", "stars": 2, "date": "2015-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "t7x9yAP2O_PeBvEvuI6E-Q", "review_id": "rQKNslbR-Kq-HA_J028B0Q", "text": "I took my girlfriend here on our first date, and I could not have asked for a better experience. Food was excellent and the atmosphere was very warm and pleasant. Portions were reasonable, but not huge. Wine is half price on Sundays by the way! Definitely a great dinner date location.", "business_id": "h9xdY1NO4GnNijNChTy-8A", "stars": 5, "date": "2012-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5Td84D4oDkkgxsMeqcrTRw", "review_id": "4Eemy-19ZTHU1pjToKXmzQ", "text": "I can't say I will be going here very often but it is another option for me when i want a nice dinner that is gluten free.  \n\nI was impressed that we mentioned gluten free and the waiter gave me some options, he even remembered no croutons on my salad and the item I ordered had a gluten item on it so they substituted something else in it's place.  \n\nThe food was good and I have to say the pasta was really good because I've made my own and well this was a LOT better.  It was the perfect consistency I just wasn't impressed with one of the toppings because it made the dish very dry.  I ordered the Pot Pourri forgetting that the clam sauce would have gluten in it and substituted with the browned butter and Mizithra cheese which was really dry to me.  The Marinara sauce was good and added some flavor to the dish which I thought it was missing with the other item.  \n\nThis is a great family restaurant and the staff is really nice and friendly.  For the price of the food and the service you really can't beat it.", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 3, "date": "2010-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "k5bDN0HquYYiScd5Tz41Pg", "review_id": "Nc3vG8GjA8tMyKlKjQA0mg", "text": "This is my favorite OSF location! The historic downtown location (coupled with ghost story rumors) makes for a fun and #TBT experience! The staff here are always friendly, professional, and prompt. I love coming here!", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 5, "date": "2014-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6FhkqCqJKadKb6pbPUukbQ", "review_id": "qC9ZEeVfkKn6xPR2Ct5Elw", "text": "This place is amazing!  .. The food.   It is really on point.  The breads are fresh and yummy (gotta use the butters)..pastas are the real deal, salad, gelato is a must! \n    I heard it's Haunted?  Plus they have all the atmosphere coolness you would expect..  Super cool decor, classic arcade games and other entertainment (sometimes balloons, artists, and such)..\nThe upholstery is rad and colorful dark woods, there is also a Spagetti Tree (have to see).. Among other things..\n     But honestly the food alone.. Will make you moan.", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 5, "date": "2015-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HpxGTDm60d9JapjN36JFSQ", "review_id": "ceOMBsFpXQsoubeyxm5j4Q", "text": "This place rocks! Great service, awesome food, and comfortable atmosphere. The prices are reasonable.", "business_id": "PEHJjxdw11TGFma9Zhz3ng", "stars": 5, "date": "2012-09-15", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "_PzSNcfrCjeBxSLXRoMmgQ", "review_id": "gQ7nRTpb8v3ItxgpWeXcow", "text": "Love this place for a quick lunch.  All I have had is the pizza.  Combo #2:  2 slice of cheese ( you can add meat for extra $) & 24oz drink for around $5 or so.  \n\nThe pizza is thin, hot, and melty cheese....  YUM!  Not like NY pie, but great for AZ.", "business_id": "ZAgPh4v-oOb1g6cdlkKI0g", "stars": 4, "date": "2010-09-29", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 4}, "user_id": "HZeFzs42f0iGaA-sP_hUnA", "review_id": "KutHTGuEMF59JvmqtLhwQw", "text": "Shortest review ever.\n\nAwesome mozzarella, super fresh basil, tomatoes that taste like tomatoes, real bread. These are a few of my favorite things. \n\nAnyone who gives this place less than 4 stars - don't go back, you don't deserve this place. Go play in traffic or DIAF or something.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2008-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "K4UmjxSpiHZohl2MnkBuKw", "review_id": "-8cGKBef-kJnCHiISbeDjw", "text": "I had a delightfully salty sandwich. Although the wait was longer than acceptable---over half an hour---it was about worth it. I probably won't return unless gifted with free time, but it was a nice one shot.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2009-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SAAMpBGcVVNAww_4yZpIoA", "review_id": "U1eSy8XxPm0WTuxelQx-PA", "text": "A good mozzarella sandwich for Arizona but NOWHERE NEAR the one I had back in Jersey at Joe Leone's in Pt. Pleasant. \nI had to park down the street, even on a Saturday at 2pm. Paid $20 to take home a Mozzarella/tomato& basil, and a Soppressata/provalone& roasted pepper. The hubby agreed: they were good, not great. Had to add salt & pepper to the mozz sandwich; not a good thing... \nBread is very good, but it's that tough, rustic thin focaccia style which makes my mouth sore from chewing. Not a big fan of that. Also, they were sold out of the Sandwich Special of the Day so that left me with exactly 3 to coose from. Not enough variety.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 3, "date": "2012-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "nX8uAoc0_PgIc1YBhfW7zQ", "review_id": "lAIr-uExP3Semq41KPscBw", "text": "The sandwiches at Pane Bianco are consistently amazing in taste and quality.  Pane makes their sandwiches from locally sourced ingredients and home made mozzarella, which is that extra kiss that you look for in any decent meal.  My regular favorites are the mozzarella, basil and tomato sandwich and the sopressata sandwich. Both are incredible.  My wife loves their tuna sandwich as well. \n\nHaving said that, I do have one minor criticism... the evening menu.  For the love of god leave the sandwiches on the menu in the evening.  I have sat outside so many times listening and watching people leave when they go in to pick up a sandwich in the evening only to find out that  it cannot be obtained.  I even would love a Pane sandwich in the evening from time to time and more often if I knew I could get one.  :)", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2013-11-30", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "_JJgknodFeeqOW2e9a3kKw", "review_id": "Mb_1tCDFC5m49Rahp2iBWA", "text": "Went there for lunch and had a Chicken chopped salad.  There was not a lot of chicken and it was not cheap!  Everything is already made and it is re-heated after you order it.", "business_id": "OkXpdUozVS3vjSRtCoSIvw", "stars": 2, "date": "2010-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EP3cGJvYiuOwumerwADplg", "review_id": "0b81goCghKzJW9X-NQzPXw", "text": "First time I had pizza here for some reason....and cant they make something that is gross!  I have eaten here tons of times and every experience with the food and service is the best ever.  I have had the Alfredo the Dark (fettuccine alfredo), the big beef sandwich, the big tuna sandwich, and now chicken wings and pizza.  The alfredo is so creamy and flavorful with a bit of spicy to it.  I remember not being able to finish the gigantic plate of noodles.  The beef sandwich makes my mouth water just thinking about it but my table was craving to share pizza and wings today so we ordered the pepperoni pizza thin crust and it was truly amazing.  The garlic was perfect the crust was and cheese were a great consolidation of flavor.  The chicken wings were great also, the sauce was a little thick and had a garlic hint to it as well.  Of coarse what would a visit to Oregano's without ordering a macadamia nut pazookie!  Man, this place is the best place for the cookie desert with ice cream, the half cooked cookie inside a good 10\" pan and about 1/2\" thick is so flavorful and good.  I almost got sick from eating to much.  Also if you have never been to an Oregano's be prepared to wait since they are always busy, the atmosphere is way casual and the decor is so very cool and trendy.  I cant think of a better consistent trendy place for great food and great service.  It's most definitely as good as it gets!", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 5, "date": "2010-11-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_TKfJJH6nekfUuf8Cq8rSQ", "review_id": "T5EKFf0HlEZZDLsA_0VvfA", "text": "Why is it always crowded?  Seems like everyone loves Oregano's.  A varied menu with great choices especially pizzas and sandwiches.  Great service.  Easy parking. A salad is big enough for an entire family!  The server always asks us if we want a traveler for our ice tea.  Sometime to remind you of your dining pleasure on your way home.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 5, "date": "2013-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5wT4TWp8170mpqID7a_PbQ", "review_id": "iAXSqibJy4apOsy6Pjq6Bg", "text": "We sat on the patio tonight and unfortunately I did not catch our waitress's name,  or maybe it is fortunately bc the service was absolutely horrible.   It took forever for our appetizer to come out,  tables that were seated and ordered after we did, got their apps before us.   When our appetizer the boom dip came out we were given two small plates and the silverware.   Dip was good, artichokes were a little tough.   Our pizza finally arrived and we had to use the same plates that we had put our dip on.  Keep in mind that this whole time our waitress never returned to the table,  the appetizer and our pizza was brought by someone else.  We finally got her attention when she came to get the drink order or the next table,  and asked for napkins.   We had to wait several minutes for her to bring them to us,  and when she did she only brought us one each.   We continued to eat and my husband ran out of Pepsi, completely.   We waited,  and waited,  and waited.   Finally he got up and refilled his own drink, walking behind the bar to do so,  which our waitress saw him do.   We finished eating and we waited,  and waited,  and waited. ...again.   Finally we flagged down another employee who was walking by and asked for a box and our check.   Our waitress finally brought the check and I had to ask her for a box as well.  If she had acknowledged the fact that my hubby had to help himself in order to get a refill,  that I was out of my drink,  and that her performance with us had been less than satisfactory, I wouldn't be writing this right now.  We know people have bad days,  get busy,  etc and we don't expect perfection but a little concern would have been nice.  It takes a lot for me to leave a bad review especially based on the wait staff bc I waited tables for years,  but I really think it is called for tonight.   A simple I'm sorry I dropped the ball with you guys would have gone a long way.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 2, "date": "2015-10-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "upssaszVG_egJVRKBU5Dzg", "review_id": "JojEOipeQ2nOC8tJjT7Lsw", "text": "Quaint little noodle cafe that can become crowded as there is a steady flow of patrons going in. Sit at a table or the counter, which overlooks the grilling area. The menu is somewhat distinct in that it provides Asian selections as well as Italian pastas. I started with some very tasty spring rolls and went in the Italian direction for my entree. I ordered the spaghetti with olive oil and grilled chicken. Except for the bland, unseasoned chicken the dish was quite flavorful with a bit of kick provided by crushed red pepper.\n\nThe server accidently knocked my glass of water over in my direction but he cleaned it up quickly and was very embarrassed about his mistake. Overall the service was great and I expect I will return soon to try the Tempura, which comes highly recommended. I dig the wooden floors too.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 4, "date": "2008-11-16", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 2}, "user_id": "lPaYMDmJbAnv_3pmZH_inw", "review_id": "VQ_LGg3dinxYPznEQh7P1Q", "text": "My introduction to Japanese cooking occurred years ago in Norwalk, Calif. It had been a grueling day and I wanted to get away, so I hopped in the car and started driving until I saw a storefront with a line out the door. After waiting for about 15 minutes I pointed to the picture on the wall. Having no idea what it was, I had ordered Tempura Udon.\n\nI dunked one of the thick shaggy pieces of shrimp into the savory broth and watched as the tempura quickly soaked up the broth. The flavors were ethereal.\n\nMy initial slurp of thick slippery udon is among the great food experiences I've ever had. Unfortunately, I've never had udon that has compared to that first steaming bowl.\n\nAfter driving by Cherry Blossom Noodle Cafe in Phoenix many times, I finally stopped in. They excel at their namesake with tasty noodles and more offerings than you can shake a wet noodle at.\n\nIt's a calming space with a quick, friendly wait staff and a menu that's mostly Asian inspired. There's a section dedicated to Italy, though I'm not sure how much curry and ginger Italians use in their pasta.\n\nCherry Blossom also offers many salads, including Tokyo Chicken Coleslaw ($7.60). It's essentially a Chinese chicken salad with grilled chicken, cabbage, lettuce and daikon sprouts in a tangy vinaigrette dressing. It's deliciously light and refreshing.\n\nA friend once told me that the spiciness of a spicy sushi roll was invented to help disguise the flavor of fish that might not be so fresh. While I'm not saying that the Spicy Salmon Roll ($5.60) wasn't freshly made, it was so fishy that it was inedible. Spicy as it was, it couldn't disguise the flavor that remained with me after the first try.\n\nThe California Roll ($4.40) fared better, but then again it was just a California Roll, imitation crab, cucumber and avocado wrapped in rice.\n\nMoving right into noodles, the egg version used in the Korean Spicy Beef ($10.50) were so chewy and fun to eat, I only wished the bowl was larger. Spiked with green peppers and tender sliced of beef, this wasn't as spicy as I has hoped, but this was quickly remedied with a side of chile paste.\n\nMy eyes widened as my Ebi-Ten Udon Noodle ($8) arrived. It was a large bowl filled with huge udon noodles paired with soup and steamed spinach. Along side were several pieces of shrimp tempura that were golden and inviting. Could this be what I've been searching for all of these years? After one sip my hopes plunged; just not quite the same. The flavor of the dashi, the basic soup stock used for udon, was a little too strong. Don't get me wrong, it was a very good bowl but, not quite the sensation I experienced so many years ago. Perhaps it's never as good as the first time.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 3, "date": "2010-09-30", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "q9B5_BOza_1SCRRKd-akzA", "review_id": "mFIOzNRLgxEsmNIvWaFObg", "text": "I had the beef udon soup lunch special. Food was ok for the price. Lunch special came with typical cali roll, and the udon soup was ok in portion, the broth is pretty flavorful. \n\nI was not totally happy with the service my waiter provided. Not once did he stop by to ask if my food turned out ok or if I need anything else. \n\nWhen I finished my meal, he asked if I wanted dessert, so I asked what they have, he pointed a few items out in the display case and walked away. I had decided to try one of them, but instead of asking what I have decided for dessert, he came back with the check. \n\nI was turned off by his lack of service, and decided not to get the dessert and just pay and leave.\n\nThere are so many items on the menu, it was hard to pick. So, I think I will give it another try. But probably will make sure I am not seated to the same waiter again.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 3, "date": "2011-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4bEB0RtHqIZw83i3bTly6g", "review_id": "gnxXX8R5ooFHJ7TCa_VasQ", "text": "Love, love, love their pork ramen!", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2012-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bwmXfjwrogAaGqV33kSVpQ", "review_id": "TOUG7n80VX-LCJCJ0u84_A", "text": "Eclectic place with random menu. Food took forever to come out - over 35 minutes for a bowl of ramen and some stir-fry noodles. Ramen is already made and noodles with some beef are so easy to make, so I don't know what was going on in the kitchen.  I thought both dishes were too salty and the cha su was very dry. The ramen should also have more vegetables to balance out the bowl. I was glad I added on some tempura vegetables.  It satisfied my craving because I was sick and wanted soup, but I'd probably stay away from ramen next time. If/when I come back, the other food and service must be really good to win me over.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 3, "date": "2013-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lTrXhA60MDewrE_Do0jPgw", "review_id": "uz4z7nYbkhQdF95wQCJOaw", "text": "Home away from home.  Love it.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 4, "date": "2014-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0HjguRCR-m_QGIVH9m5m7Q", "review_id": "VT6CW27T7tNc-cPmc7_1bg", "text": "If heaven has Ramen, then I hope it's from this place. Absolutely love their Cha-Shu Ramen. I've been coming to this place for quite some time and they never disappoint. Best place in town if you're looking for some Ramen or some bring else great to eat.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 4, "date": "2015-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yT5oZVtq1C40AtpbmX_eNQ", "review_id": "J-o64p-kd0gk7PqSd6Hnow", "text": "The Vegas roll and Philly rolls are both great. My friends thought their food was decent. We'd like to try it again but the server was bored. The four of us got there when they opened and we were greeted and seated immediately. After that we had to hunt down a server. For drinks, questions, ordering, the check. Please get better servers and we'd happily return.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 3, "date": "2015-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "o4uEuIH4KCjMQ8k4MglIGw", "review_id": "Ao8TFnGSEg8Y1dBHAOK5KA", "text": "The most dependable upscale restaurant I know in Phoenix. First-rate dishes, like melt in your mouth osso bucco and a huge and delicious veal chop, at reasonable prices. Reservations essential. Don't miss their calamari.", "business_id": "3CSaqRNvYg7ZdN2zwxwzVw", "stars": 5, "date": "2013-09-17", "type": "review"}
{"votes": {"funny": 6, "useful": 8, "cool": 8}, "user_id": "kffxYQVQsEpF1DVlQlcGCg", "review_id": "9_Y5NsS4x-Dn0bHsZ4DRLA", "text": "I have been to this place many times now over the years. Surprised it has taken me so long to review it. Maybe, I thought I had.\nAnyway. Great location. It used to be more south. It was a cool little hole in the wall back then. Now it is more like a cool little family restaurant. \nThey play live music even on certain days.\nTHe food is good, the atmosphere is not too bad.It is a nice place to go and not too bad on the wallet.\nOn a busy day or night parking can be tight. But,  other wise it is great. Check it out one day when you are on the East side of pghoenix. You just might like it.", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 4, "date": "2012-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ndAnPbSpIVHQ4MtYhSAhHQ", "review_id": "uKlk63cm60D1GodU-3JZOA", "text": "I read great things about this place and their vegan options so I was excited to give this place a try. But I wasn't impressed. The service wasn't that great (slow, uneven and he didn't even bother to open my beer for me). I arrived with 3 other people and we all received our food at different times. And about the food: I can't speak for the entire menu as I've only been there once but the vegan sandwich I ordered was just ok and the fries were terrible (frozen, cheap???). The owner did come over and speak with us and she was very nice and the entertainment was good but I was disappointed when I left as I read such good things about this place. May give them another try though....", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 2, "date": "2015-09-14", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "OYpsdMcpdCdlkknpgpFMLA", "review_id": "CXPxWmR0VFw-xTuDUBk3IA", "text": "Oooh, see, no one told me Luke's does Chicago Style hot dogs. I went there a couple of months ago to try the dripping beef sandwiches that everyone is raving about. Ok, normally I'm a big fan of anything beef-related, but that type of sandwich is more targeted toward my dad, not me. However, the Chicago Style hot dogs are absolutely delicious. I also love the presentation...they wrap up the hot dog with a sheet of paper, and drop the fries inside the packet and roll everything up. It looks like a wrapped burrito. The staff was amazing, as well. Very friendly.", "business_id": "Tk2dSL0TwQeI_zNJmb442A", "stars": 4, "date": "2008-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OYBGsv9nI7jFSxrnI1RA0Q", "review_id": "xj1XUZKQqjtNUAsVgo9_Xg", "text": "Every time I am in Phoenix, this restaurant is a must stop over!  The Italian beef combo is great and it's consistent every time!  I always get a bottle of their pepper mix so I can taste authentic Chicago through out the year!  They are always busy, but it's worth the wait. Ordering is short and sweet and you better know what you want when you get to the counter, but go and enjoy!", "business_id": "Tk2dSL0TwQeI_zNJmb442A", "stars": 5, "date": "2015-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4zQ4da9FQXSLHJy3QOyumw", "review_id": "YrSLF3psrj3MuQG9MGalAw", "text": "I'm glad I stumbled upon this little tucked away gem. Best Italian sub I've had in the valley!", "business_id": "T5HYqRADhAL6VPRAacz74Q", "stars": 5, "date": "2015-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "K0euQLFAcKhQPZ6JxGAryg", "review_id": "kU91gvsA4kFqniN-d9fDXg", "text": "I must say I was pleasantly surprised.  I ordered a 10-inch pizza with breaded eggplant and artichokes.  It was soooo good!  This pizza definitely reminded me of home!  Shoutout to my Yelp friend Ebony W.  It was her check-in that sparked my curiosity to try this spot :)  Ooh and they have locations throughout the valley.  I will have to try the Scottsdale location next!", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 4, "date": "2012-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vS3wU1sjG9gyG7bTMyXFCg", "review_id": "SaSr8srKKLh85UkJD6u4qA", "text": "Love this place. Great pizza, good wings, good service....a great spot for NY Pizza. Also they have a great selection of slices at lunch time. I recommend this spot for sure!", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 4, "date": "2015-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fYWIxI6kwuVqpPu1I1baWA", "review_id": "MEtJtnBmvpDSj-ilvlsOpQ", "text": "What a perfect, friendly, tasty meal we had there last night!  The absolute quintessential italian neighborhood kind of place - a little kitchy, a lot tasty, and an inviting staff and warm and friendly owner.   Butternut Squash Ravioli in a brown butter sauce (one of the limited rotating specials) was perfect, and the very large portion of lasagna (at just $13.5) was almost as good as mom's :).  Smallish, quaint, a touch of cheese on the billboard (\"As seen on TV\") make it a perfect spot for a quiet romantic dinner as well as a group of 6-8.  Larger groups may be challenged as I don't *think* they take reservations - but check on that ....", "business_id": "VpW40mznMS43CqdbelX2wA", "stars": 5, "date": "2011-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "s3ogzzWFW0TOJbXe9blRnA", "review_id": "WumY2d9-JBlwKNrujMvi_w", "text": "Been coming here consistently for a year now. Always delicious. I love the scampi sauté with shrimp, arugula, and cherry tomatoes. My other favorite to go item is the eggplant parm sandwich.", "business_id": "VpW40mznMS43CqdbelX2wA", "stars": 5, "date": "2014-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "D9ry7SJ5vtsOc04b5zqkbQ", "review_id": "iomLZbutczUQqVqWd1NwFQ", "text": "A nice find in Phoenix. Good menu, something for everyone. I had Gnoochi which was terrific, others at my table had chicken, veal and salmon and all enjoyed their meal.  The wait staff is nice and attentive and they don't rush you out.  You can linger as long as you want. I imagine it would be very nice to have your meal outside on the patio but it was a little chilly the night we were there. Yes I would return for sure.", "business_id": "PAtgWCLCFRQd_fjnihISOg", "stars": 4, "date": "2012-11-02", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "_7el1cOgnfkNfmZKi277bQ", "review_id": "ylOjhQ-wdq096x5SjnwADQ", "text": "I have been very disappointed in Avanti's lately. I used to love it. A friend and I each got groupons to go so I thought great can't beat half off. I hadn't eaten here in years. Nothing has changed it's dark and outdated. They need a Ramsey make over for sure. \n\nThe service was good although it was very difficult to understand our waiter he had an extremely thick accent. \n\nThe Caesar salad was very good. The veal parm which is my favorite of all time was not good. The veal was rubbery and the breading soggy. The pasta was way overcooked although the sauce was good. \n\nThe Tiramisu was soggy as well. The cake at the bottom was soaking wet. Yuck\n\nIf not for the groupon I would have sent this back. But half off an overpriced meal made me think I got what I paid for. \n\nWell we had another groupon to use so we went back. The second time the service and atmosphere the same. \n\nMe thinks there is a microwave doing heavy duty in the back. This time I had seafood risotto BLUCK! The Risotto was undercooked and had no flavor. The seafood tasted dirty and there was grit in my shrimp. This Risotto was a disaster! My friends vegetables were mush. It was worse than the first visit. \n\nThe worst part of both visits is that the restaurant was almost empty on a Sunday evening and the food was sub par it makes no sense to me. \n\nThe long and the short of it I wont be back. Avanti's has slipped to Olive Garden level with Macaroni Grill prices! WAY OVER PRICED.", "business_id": "vvA3fbps4F9nGlAEYKk_sA", "stars": 2, "date": "2011-11-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "J3JloNMSIsBcUQJUOcq-TA", "review_id": "vxP4IuujddyWJs1c_d2LvA", "text": "Everything here is great!  I've tried almost everything on the menu, and I have not been disappointed once.", "business_id": "vvA3fbps4F9nGlAEYKk_sA", "stars": 5, "date": "2015-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "PShy2RYNadDUhJf4ErOJ7w", "review_id": "ZYjhOLd7pH6NfCEIMugdHg", "text": "I enjoy the food here\nHowever, I found it to be ridiculously overpriced\n4 friends, $400 bill, yikes!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2007-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "_jjIaczpcVDpHlH6l334rQ", "review_id": "t1uAlhgxHA8PBS0I0PTC_Q", "text": "Great food.  Great atmosphere.\n\nWe got an Olive Appetizer, a Cheese Plate, and Bruschetta (Brie & Apples with Fig Spread, Prosciutto with Figs & Mascarpone, Tomato Jam & Fresh Sheeps Milk Cheese, and Roasted Peppers with Goat Cheese)\n\nI got the \"Nine Iron\"\nHickory smoked bacon layered with grilled chicken, fresh burrata\nmozzarella, lettuce, beefsteak tomato and dijonnaise\n\nMy wife and her friend split the Vegetarian\nGrilled asparagus, roasted artichokes, red onion, vine ripe\ntomatoes, goat cheese and house made pesto\n\nAnd, of course, a bottle of wine.  We rolled out of there STUFFED to the gills!\n\nWe will be going back again soon!\n\nThere is one problem...if you don't like to give your car to a valet, then you have to walk...far.  On the good side, it's only $3 for valet.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2009-10-27", "type": "review"}
