{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "auESFwWvW42h6alXgFxAXQ", "review_id": "fFSoGV46Yxuwbr3fHNuZig", "text": "Yes this place is a little out dated and not opened on the weekend. But other than that the staff is always pleasant and fast to make your order. Which is always spot on fresh veggies on their hoggies and other food. They also have daily specials and ice cream which is really good. I had a banana split they piled the toppings on. They win pennysaver awards ever years i see why.", "business_id": "5UmKMjUEUNdYWqANhGckJw", "stars": 5, "date": "2015-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6MQjQ3jfCUUxItIvKadJsw", "review_id": "XKowpVX4xIPN1KyimUs43w", "text": "I don't know why but this McDonalds always managed to get my order wrong.  This is almost constant.   However there is a young assistant management who is extremely professional and friendly.  He make sure that all of the customers incorrect orders are made correctly. I believe his name is Matt or something that begins with a M.  (Young guy, brown hair, and awesome tattoos).   \n \nThe major complaint that I have with this location is when the high schools let out.  The tons of students just hang out, cussing or making a lot of noise.  They sit on tables and often just sit at your table.  When Arby's and Wendy's use to be open next door, the management did not put up with this loitering.", "business_id": "4LcFKTr6Ah87VcxW2z5e6w", "stars": 2, "date": "2014-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rosWZLmjXAzxba5V8Z_BWg", "review_id": "pRWxDoKsxYSchQzOZJpR8Q", "text": "Coming to a US Taco Bell is always an interesting experience.\n\nFirst-off, there's no fries in US TB's. I learned that years ago when a group I was with apparently offended an employee by asking for fries supreme. It was like we were attacking a sacred family recipe by wanting ground beef and cheese on fries instead of nachos.\n\nSecond, the combos come with a taco, not with a side like you would get in Canada. If you want nachos supreme you have to make a special request.\n\nThird, it's so much cheaper here. This is pretty standard across all fast food in the States. $5 for a Gordita combo here. Over $6 in Canada.\n\nFor this restaurant in particular, the service was good and the food came up quite fast. They have a choice of three different Doritos tacos. Hopefully they bring that choice to Canada soon.\n\nGood call by the person who left the tip to swap a Doritos taco into a gordita. Delicious.", "business_id": "l2ynPEBj9S_yN9gjg32tBA", "stars": 3, "date": "2013-10-20", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 0}, "user_id": "nHsj0cHOiroAsmDfF50BtA", "review_id": "C2mYC1DznxWY0WA-mYNKHg", "text": "I was flying out of Charlotte and got to the airport really early for my flight so I opted for breakfast.  Being that Burger King is one of the only places open really early, I chose it.  Plus, I enjoy their breakfast items.  \n\nI know it's come to be commonplace to expect poor service at fast food restaurants, but...why?  I worked in fast food in my younger days and provided quality service.  I was quick, I was knowledgeable, I was friendly, and I was attentive.  Is that really too much to ask?  If you can't make it in fast food...where can you make it?  \n\nAnyway, I stood in line behind one other person to order my breakfast.  I stepped up to order when it was my turn, and after the co-worker next to him finished talking to him...or at least took a break.  I placed my order and then stepped down the line to await my order.  I looked around and saw chutes full of pre-made sandwiches sitting under the warming lamp.  Employees were congregated in the back talking.  And more employees were congregated around the register talking.  Nobody was working except for the cashier, and even he was doing a half-assed job.  The cashier abandoned his register and came over to fill the first guy's order.  He then proceeded to get my coffee and fill my order.  Some jerk-off airport employee behind me \"kindly\" offered to take the coffee I had just been poured so I could get a \"fresh\" cup.  Thankfully, the BK employee continued to give me my cup of coffee.  \n\nThe food was good and still semi-warm, but is it too much to ask that people do their jobs while on duty?  Do you really need 10 BK employees standing around doing nothing?", "business_id": "X-uPUUV7xPiKivsQzJD-wg", "stars": 2, "date": "2010-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uc4QurS1XrvyiIpne2IbhA", "review_id": "EY4KGFUwiRKS6jD968L0-w", "text": "Food is always hot and fresh. Love the variety on the menu. I've tried burgers and other things from here without any issues.", "business_id": "Lw-01HQDswygHvAZfwkpxA", "stars": 4, "date": "2015-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vE4TIv-AEsFalZ4faTRH-g", "review_id": "PQRSy1xoirMBDPHX2Xfrpw", "text": "A recently remodeled Chick-fil-A, this is your standard line around the building, smiling teenagers in the drive-thru kinda place.  The recent remodel forces you to drive all the way around the building to queue-up, but since this place is always packed, I guess that is required.  And, while you wait, you get to enjoy the lovely waterfall around the back of the building.\n\nThe wait took a bit, but it was a long line, so it moved as quickly as possible.  I got my sack of #1 and delicious lemonade and was on my way.  As always, the Chick is a winner.", "business_id": "3IQSDaqbnqACADJWlXpRkA", "stars": 4, "date": "2013-09-06", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "-NcGO7nzM6w2ClVslI4NDQ", "review_id": "AztTqqjqfZusr4h0pOAE3Q", "text": "Swetha + Qdoba's Grilled Veggie Burrito = wheeeeeeeeeeeee!!!\n\nYummmy, yum, yum, and some more yum!\n\nOh yeah, don't forget to go in wearing sweats!", "business_id": "qC21Nl_OUfTr_xf8ZjzOcg", "stars": 4, "date": "2010-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Lbyvv2oDKtamo9N9k38Oeg", "review_id": "6hhBlFuYMuwqR9q8x43L0Q", "text": "Always good, fast service, staff is respectful and very rarely get my order incorrect.", "business_id": "n_t3HHkoR3TXomoBOcVZaQ", "stars": 5, "date": "2014-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "epGql75QhKDg0dePE92N_Q", "review_id": "hp3nesFjOHYv9_l1LXdOKA", "text": "I think this is a great place to dine in if your ever in a rush but want to eat something decent. Good food, fast service, and overall good, but I find the insistence on getting certain ingredients by the server sometimes annoying and guilt tripping depending on the ingredients.", "business_id": "BPftTf2ZNidSaeyyXcxhdg", "stars": 3, "date": "2015-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ffa864LL90s6oxImKPI7pw", "review_id": "-R7nlq4Bpf7jey8EXVVknA", "text": "This place has NEVER gotten our order right.  Not once.  Lame.", "business_id": "cCStad4wX3ADPbz5AHCn9g", "stars": 1, "date": "2013-10-23", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "yxvL-fnq6WppqMnoPMmWww", "review_id": "b4iP6fJkCR3P-yLKX7E0eQ", "text": "I don't know why I always make the mistake of going to jack in the box. I got the ultimate bacon cheeseburger, and asked for no mustard or ketchup and I wanted tomatoes and onions when I got my burger or should I say my to leather patties on a stale bun with ketchup lettuce no onion no tomato! and when I took it back up to em they looked at me like I was asking for all the money in the register.  then when I explained what was wrong they started laughing didn't offer to refix my food or anything. this place sucks a giant bag of dicks, I would love to punch Jack and his big round stupid face for hiring such incompetent Jack offs that want $15 an hour .come to think about it maybe I should punch myself in the head for coming here again and again", "business_id": "VCQ3VvnVRhibTT8J61xWkw", "stars": 1, "date": "2015-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DghMl81bONCh5ELnrgn4Fw", "review_id": "l1V1V0l53SfQ7bPz_bUCSg", "text": "Great customer service, food is made to your liking. The only negative is, I wish they could do something about the bums infesting the area. It can be a little bit of a deterrent when females go in alone.", "business_id": "ldIxXmxD3Cku0vODGYb9dQ", "stars": 4, "date": "2010-10-29", "type": "review"}
{"votes": {"funny": 4, "useful": 1, "cool": 1}, "user_id": "MWt24-6bfv_OHLKhwMQ0Tw", "review_id": "Kn1Z_j9XgoOQn8Og-_f48g", "text": "Normally I love Del Taco, so I figured I would try out their breakfast burrito before a road trip up north. Bad call.\n\nFirst of all, I had to repeat my order three times. Breakfast burrito meal with coffee. Not a tough one, and no special order.\n\nWhen I get up to the window, the guy tells me they are out of hot coffee. WHA? It's 9am. However, he said they can give me an iced vanilla coffee instead. Sure, fine, whatever.\n\nI hand over my debit card and what do you know, they are charging me to use it. Great. I am now paying 23% more because they are cheap-scates.\n\nI get my bag of food and pull away, only to find out that I didn't get the meal.. I got a coffee and the burrito, but no hash brown sticks. BOO! Well, I am certainly not going back to try and explain myself, especially since I already scraped my tire trying to get closer to the window that is 5 feet away from the curb.\n\nOh, and to top it all off, the burrito and the coffee were gross.\n\nNo way, jose.", "business_id": "_gXpjRIjb5fv5f5IVGXvsw", "stars": 2, "date": "2008-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gcI0S55zNCuCgSIJdSbneg", "review_id": "g1hkEPYO2_C8THlzNsGRAQ", "text": "It's basically Asian fast food - and the quality of the food is pretty good for that standard. It's priced right as well. The food is ready, well, fast, since it is fast food. The inside, however, is the area that needs improvement. You can tell there's been some wear and tear to the building and the booths.", "business_id": "L19_1cG2ALVjdBQ456h26A", "stars": 3, "date": "2014-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Ja8FvcWiWHEXME2vmTPTkA", "review_id": "MdZ6DOFmQKW6_N4jhqX1_g", "text": "It's just your regular Filberto's but it's Julio's....\n\nIf you want the ultimate Filberto's/Julioberto's experience, hit up the Filberto's on Thomas St and Rural Road.  That place is awesome!  It's a nice restaurant experience with a kickass bar!  The people who work there are really what put it over the top.", "business_id": "o3TruOSgOwNgx08QosuWTw", "stars": 3, "date": "2013-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xFYoqWd5aKdN1w112Y22Kg", "review_id": "pTkHfYz6BKHa6nFojXZQ7Q", "text": "The food was good.  I had the salad with chicken; black beans and salsa.  Good service. I arrived before the the long line.   I would go back.", "business_id": "K2_Hmmo5crTYWiT_1sWnfQ", "stars": 4, "date": "2014-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-JJvZt30Z0xvMYqvUD1OGA", "review_id": "gk1fprV7kfgvx0VTCNvqNw", "text": "Great place for chicken. I come here about 3 times a month, Love the corn and black bean sides", "business_id": "TBTaMIaeDw5B79hXDZBtrA", "stars": 4, "date": "2012-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3am2PwtajoR3LIlP7XZtbA", "review_id": "S8gW25zAPgKLToPw5WdOLA", "text": "Pei Wei is always consistent with their food and service, which is great, by the way. Whenever, I'm in the mood for some quick-serve Asian food, I head to my neighborhood Pei Wei and never regret it!", "business_id": "9Vu9KhK2-kBSM-FXvxXGNg", "stars": 4, "date": "2015-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xmeC0meTkYWPSE2d4RvNZg", "review_id": "-9IqZiA-0dtCxTYOcgucFA", "text": "Would've given five stars had they not been so skimpy on their crackers. The chili was excellent as usual, but when I ran out of crackers... I went back and asked for more... you would've thought I was asking for their firstborn child...", "business_id": "En2GuQV7FoOGHhXX5SMEBg", "stars": 4, "date": "2014-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y4SwjhshR9ufu8ZBG0oE2w", "review_id": "68Q-boAuTVPyEFaKJS4tQQ", "text": "I went here through the drive thru last week and then this week I go for breakfast, and the signs are all taken off and the windows and doors a boarded up. It closed really quickly", "business_id": "q5Vz6JNAGDqAT_P1lB1jVg", "stars": 1, "date": "2014-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OQbklaUmAUoUCiSlMdptGg", "review_id": "9SE9j8ZGBJMyZm8Dc0yY8A", "text": "17 minutes in the drive thru. 12 of those minutes after I  paid. I ordered a sausage biscuit and a soda at 11:27am. If you can't be prepared for all day breakfast, don't offer it.", "business_id": "41SzC2WJ-RVUpVZ2NJfE-w", "stars": 1, "date": "2015-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6rvI5BObB3ZKfVOK0ULl-w", "review_id": "9u2_mkcCaBI8FpC1oL8atw", "text": "I am giving a 1 because i can not give a zero.\n\nLast night me and my fiance visited for food after seeing a concert. It took 3x to get our order right via the box before getting to the window. Then when we got there he tried to charge us for another order that was double ours. All while yelling over/through my car to someone else in their giant cargo truck!! We finally got our correct order... or so I thought. My sandwich that was supposed to have sausage added (and i was charged for!!) was missing sausage entirely. If that wasnt bad enough my croissant was partially BURNED. Not over done but BLACK.\n\nI said whatever and figured i would call and address this in the morning. I called and asked for a manager. Apparently one is not there on the weekends. I was at least offered a team lead. \"Ok, at least this can get addressed\"\n\nNope. I was greeting with a shouting \"what do you need?\" Not so much as a \"how do you do?\"\n\nCorporate will hear about this. I will also NEVER come back to this place either. Your restaurant and employees give fast food chains a bad name. Shame shame... \n\nFeel free me directly should you choose, i would love to discuss this and maybe be assured this will be resolved as i would rather not drive an extra mile or so to another one (which has always been A+ by the way)", "business_id": "mcgtZvjjCXLY-Dt7V_XZ6g", "stars": 1, "date": "2015-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l78zvFdOBS0BeKGtKpGy3A", "review_id": "VKHmlYiPTgGyv0XWIPRKig", "text": "I haven't really been a huge fan of KFC, but today I thought I'd give it another shot. The drive thru was the only thing open and the person handling our had to constantly ask what it was I wanted. Even though there was only one car in front of us, the wait to get to window was about 10 minutes. When the lady started handing us our drinks, we noticed that our order was taken wrong after all that. After waiting 5 more minutes for our drinks, they then proceeds to tell us that we had to wait 5 more minutes for them to prepare the chicken. It actually turned out to be 10. The food was obviously reheated, and drinks were overfilled making them a mess to uncomfortable to touch. They also\nforgot my drink. I won't  be coming back ever.", "business_id": "72pUqCkncwVVn65cIiX8aA", "stars": 1, "date": "2012-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oe47sWtTf76KKTARd7Gaeg", "review_id": "I_iGyjHqZ7rme8m7iRLngg", "text": "YES, I appreciate the undying love and dedication to In-N-Out Burger.  I just don't get it.  To me, the burger tasted like a somewhat better \"Big Mac.\"", "business_id": "byFWmwlVSmUj-AmM6NZYvw", "stars": 2, "date": "2011-11-28", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "1ySRmdGv9zMvXy45GSDWeA", "review_id": "yC9IicIgyThsrqwTf_J4mA", "text": "Got their current promo item claiming to be a Island fire cheeseburger. The burger boasts spicy habanero sauce which actually fell very short of anything spicy. The redeeming factor is always their drinks but it's hard to get that wrong.", "business_id": "GoEHXcq_nY4jZOx3Ay5gxw", "stars": 2, "date": "2013-11-15", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 4}, "user_id": "OI1iNMzrKaFkX1ZSqGsFAA", "review_id": "V8uF3zZ2TyamU-xOM2wp0A", "text": "I've always had great customer service from this location no matter what time I go. I've gone from breakfast in the morning to late late night snacks. I usually get potato wedges so I just wish they were a bit more consistent with how much cheese sauce they use. Though, that's just to be expected at drive-thru fast food.", "business_id": "k-w0uGmiWaBBL8u5Zoa3kQ", "stars": 4, "date": "2013-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Jq8SXdt-5VMaSLqGrFjZrA", "review_id": "csdVwGsJPouZcfOm0uRY1Q", "text": "Small, clean restaurant with nothing fancy going on. The food is tasty though, and the staff friendly. The House Special Lo Mein is really delicious. The prices are a little high, and portions are fairly small. I like it enough however, to order takeout somewhat frequently. The egg rolls taste great, even if they have a bit more cabbage in them than I would prefer. I wish their was a better selection of dim sum type of offerings. Overall though, it's pretty good, especially for take out.", "business_id": "3MwUofF-CektEM52NwDaUA", "stars": 3, "date": "2014-10-17", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "uFXrezdNbph5QbmvYVmhEA", "review_id": "SFSC-N8riTHwqVte0cMiKw", "text": "Went here yesterday and they forgot my 99 cent chicken nugget. I called and the manager said sorry and then put me down for a free 12 piece chicken nugget and frosty. He made the whole trip 100% better for me. Also every time I drive thru they always get my special requests right. This is also the first time they have ever forgotten food. When I go thru they always pet my dog and are social. I enjoy coming here.", "business_id": "BRaQrgYVR17bd_zr-wNSlQ", "stars": 5, "date": "2012-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7w_yv1EcMjSCoCifxu8GEg", "review_id": "mpkwBfMVo--OkXL10Xanew", "text": "The food is usually always good. The counter staff is slow and not very personable. If there is a line to order, you will probably be there for a while. I did get food poisoning about 3 weeks ago, I called to let management know and never got a call back or anything!", "business_id": "-jBymA8tI-WURtSBcuUdXQ", "stars": 3, "date": "2012-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YOZ6xwXXpxD0vxJiA6WC-A", "review_id": "WKwgq1osLQzPXzrjKOh8Kw", "text": "they usually get the order right. I don't like how they don't offer or include a spork when you order nachos supreme or nachos bell grande. All other Taco Bells that I've been to, it's policy, they just give it. This one, not.", "business_id": "JXu6H3o0G0SRw7AFrbc4qQ", "stars": 4, "date": "2011-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f48B77lxW5Sg8pM72siQ_Q", "review_id": "LweFA3P5afYf5a-VRdX7-w", "text": "This place needs to be condemned! Ate there yesterday and just got out of the hospital with food poisoning. If you enjoy sitting on the toilet for 24 hrs straight feeling like you drank a bottle of acid than go ahead and eat at this dump.", "business_id": "tMkKUGwABdGWKwnLXaCYUg", "stars": 1, "date": "2015-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "02mA_muC-5A_Oe_tv8tg0g", "review_id": "J1giQVovwQC1mk_6scrEbw", "text": "If you are in the mood for Asian cuisine, this is the place.  This restaurant is located within a half mile of where I live, so I always order food to go.  The staff is excellent, the food is very, very good, and the pick up window is usually fast (sometimes they get very busy and you have a bit of a wait).  They also have what they call \"curbside delivery\", which means you can drive up to the south side of the building near the take out door, and stay in your vehicle.  They will come to you. Try the hot and sour soup, it's the best. Several of their dishes are made with hot spices, which I love, so if you are calling in and order and don't like your food spicey, be sure to let them know.  Pei Wei is a less expensive chain associated with P.F. Chaing's China Bistro.", "business_id": "WixkMVXXFCx-lYsr6JoF6Q", "stars": 5, "date": "2008-10-01", "type": "review"}
