{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "ab9G2vl_l2CJHY9p0jC4Ag", "review_id": "E6GmS65oNlATsI5E0yILGw", "text": "Stay away!!!!!! The waiters/waitresses hate you and your hapiness.", "business_id": "Lm_mR5xDF91OeZw97ch41g", "stars": 1, "date": "2010-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "pUwJVufTaDCzpoRANWirCQ", "review_id": "iCZluBw-vJGaV5Y3fjb3eg", "text": "DON'T JUDGE A BOOK BY IT'S COVER.\n\nA hidden gem, this place is phenomenal - best Thai food I've ever had. You need to go here.", "business_id": "sxeuOMBRllOHXJTaUlI9kQ", "stars": 4, "date": "2011-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ux3AYPS40-BsqKMVhsrYtQ", "review_id": "MpQS7259dVXIhTNQwbsnXQ", "text": "My favorite Thai food place. I highly recommend ordering the daily specials--especially anything with duck.", "business_id": "sxeuOMBRllOHXJTaUlI9kQ", "stars": 5, "date": "2015-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "tuzZ1QAU0P75BOI4iwoLgw", "review_id": "8nwF1bwXS98DmamfcAJKNA", "text": "The food is good and it comes out fast. the turn around here is great if you have somewhere you need to be after dinner but a little too much if you would like to hang out a little and take your time with dinner. But, the food is good. The dinner portions are always better, from the amount of food you get to even the size of the shrimp. (The shrimp on the dinner portion are actually twice the size.) And the food is good.", "business_id": "DReLu6HuFOm4p-jYZpgQkw", "stars": 4, "date": "2013-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "dJlo6PovBYJk6zCkd7Y10Q", "review_id": "VTbbLgQFzdtCDpikaatDzw", "text": "I've been meaning to try this place for a year now. Finally, after getting home from a trip and not wanting to go too far, we decided to check Chi Thai out. We ordered and were told it would be about 15 minutes. We killed some time by buying some groceries. My wife and I both got the Pad Thai with Beef. The price surprised me as a little expensive ($9.95) but that was before I realized how much it was. I ate Pad Thai for three straight meals. So it's actually a pretty  good deal. It is much better than the other thai place we tried. I will look forward to going back and trying more.", "business_id": "jm2VltGSjXCX6Da27Y-Ndw", "stars": 4, "date": "2013-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EPvayAIX9GiBvax0mjmktQ", "review_id": "qVxAUBowCAdlioJ9XhxmAg", "text": "Very authentic thai food--once you get past the terrible (outdated decor), the fact that you are the only person in the restaurant, and the overly spiced curries. If you feel like a restaurant without that ambient atmosphere, but that is still pretty decent, this is the place for you!", "business_id": "0lFRJ0q1PU_R4YaLNRWnpA", "stars": 3, "date": "2014-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IUWjTmXc3wLVaMHz33inaA", "review_id": "3QGLeglYCOF5Q7jVE7fGUw", "text": "Husband and I decided to try this place out based on the great Yelp reviews and it did not disappoint!  We ordered takeout, and weren't too adventures.  I ordered the Beef Panang and husband ordered a peanut chicken dish.  Both were delicious, the chicken was moist and flavorful, and the Panang had just the right amount of spice.  One of my main complaints with the local Thai eateries is that they generally do not provide much spicy kick, but Wild Thaiger knows how to pack the punch.  Definitely do not order the spicy dishes if you can't take the heat.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 4, "date": "2010-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CFrn4uPdimzKfb5W6enGFQ", "review_id": "HKmQbcVncNkHfmwKM7KX6w", "text": "Yellow curry with chicken:  I dream about this!\nPeanut chicken:  fabulous, with more flavor than is imaginable.\nBasil chicken:  I think the official name is something else but this is incredibly, memorably good.\n\nLunch specials are wonderful, but I'm usually there for dinner.  Great service and consistently good Thai food.  Of all the Thai restaurants in town (and I like many of them), this is my FAVE", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 5, "date": "2012-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PsXTlHn6GMhV1x_ao4t17g", "review_id": "CYJlGH2R87ZUj6hdP1JPag", "text": "The Tom Ka Gai is amazing!.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 4, "date": "2014-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "WhoEWEuzjuz8U4iT1_vx6w", "review_id": "AjaTQINvKyX5mEGexEn9Gg", "text": "The food is really good but the chef tops it with a good presentation witch makes your meal that more delightful. Thank you wild thaiger team, you are always so friendly and  truly take care of your regulars.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 5, "date": "2015-09-17", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "LMqKXdbwYdCqCCF64QbVkA", "review_id": "fxzJs9W6ICV2n8zMzbw9pw", "text": "When it comes to Asian style privately owned restaurants, most of them run into each other for me. Thai Lahna, on the contrary, is in a league of it's own. The scene is what any would expect, and the service is curt, but the food is what you're coming for, right? The portions are generous, with no shortage of protein. The sauces are so far above average, it makes the entrees at other local restaurants taste like happy meals.\nI'm not kidding here, if they only offered their sauces over rice I would still go as much as possible. But let's not detract from the content, all ingredients are cooked to perfection. The bamboo shoots have never been too firm. The chicken has never been too tough. The scallions never wilted. \nDown sides: table-side manner (servers are all about the business here), only canned sodas, long wait when it's busy (but it's hard to hate on a place that is too busy), how full you are for hours after leaving... ENJOY!!!", "business_id": "wct7rZKyZqZftzmAU-vhWQ", "stars": 4, "date": "2009-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HqjngAd0dH-JNMyZOfAglg", "review_id": "QfDVUpUZf7SNkhwaUUkrkw", "text": "This was one of the first places I dined at when I moved to Phoenix and I was quite impressed. The green curry tasted very authentic and service was impeccable. It's a must try!", "business_id": "wct7rZKyZqZftzmAU-vhWQ", "stars": 4, "date": "2012-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vYkg3AGHxQxKLd1Mh1d86w", "review_id": "MbzrgYqzWgDe0xODT-Ws2g", "text": "Since my first review we have eaten here for dinner and had takeout.  Both were great experiences.  My wife had Pad Thai with chicken the first time and with shrimp the second time.  She definitely prefers the shrimp Pad Thai.  I had two fish dishes, the first was the spicy fish (number 63) and the second was a spicy fish curry (number 44).  Both were great.  I had both dishes \"Thai hot\" but could have had them even more spicy.\n\nYet this has got to be the best Thai restaurant in the Northeast valley.", "business_id": "nefBMCGgMPvOnASoyO_X1A", "stars": 5, "date": "2011-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "giQ14BaRRy4ViWKKsu5zBA", "review_id": "QlRAw8u3B3hsQPzlf-ap5A", "text": "I think overall this place is more of a 3.5 stars. The Pad See Ew was not that great. Needs more sauce, the noodles were a bit dry. The green curry was delicious. The papaya salad was good, but I don't know that I'd get it again. The medium hot was a bit too spicy for me because I'm a wimp when it comes to spicy. I'd say the medium hot is a bit spicier than Serracha.", "business_id": "nefBMCGgMPvOnASoyO_X1A", "stars": 4, "date": "2014-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "4VfhBQmNRQVuJxG9WWHIig", "review_id": "79GQ9CCp250ZT1jXYx6obw", "text": "This is my go to place to get the best chicken Pad Thai! Also the price is super good, considering most places have high prices and poor quality. Love this place, its definitely a top 5 fav for take out.", "business_id": "GBN0-wo_cHLnC_pwoOTIFQ", "stars": 5, "date": "2014-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GkWuTgewni9bzPM4HUCO-g", "review_id": "n6KrGs58w6dCeix6AiIUgA", "text": "I've been here multiple times the service continues to get worse. They are severely understaffed and it's impacting everything from their service to their food. We waited an additional 40 minutes for carryout when we were told the food would be ready in 20 minutes. They shorted us on rice as well. We ordered multiple dishes and they gave us one box of rice instead of a box with each dish like they are supposed to provide. The quality of the food is slipping. The curries continue to become more watery. The sauteed dishes or so dilute with water that you can't taste any seasoning but rather just limp vegetables that resemble a bad broth. It is sad because this place used to be 5 stars but it seems to me that they really don't care about customer service. Today was so pathetic, they had one person(one of the owners) serving tables, taking phone orders and busing tables. And the restaurant was busy! Seriously, you can't afford to hire a couple of waiters? \n\nThis place used to be 5 stars back when they had a normal waitstaff but for the past 3 years or so, it just seems like they don't care about customer service. Unfortunately, now it's impacting their food. \n\nI would only order carryout. Stick to the curries. If they tell you 20 minutes, double or triple that time when arriving to pick it up. And don't tip on carryout!!!", "business_id": "K4DHwck_2ds1wURnmZdFiA", "stars": 2, "date": "2013-09-02", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "JffajLV-Dnn-eGYgdXDxFg", "review_id": "L2HWEtnQZmfBroOZqp5P0g", "text": "Ok, so, I found this place after craving sweet and sour chicken last night.  It was late, and I wanted to carry out.  This place is located within a shopping strip that has quite a few asian quisine's to choose from.  The reason I chose here was because it was exclusively a carry out joint.  I just wanted to grab a bite, take it home, and eat.\n\nSo, I enter the place, and its kind of drab, and not really appealing to the eye.  It appears to be a delievery/carry out joint, with NO seating.  So, I review the menu, and place my order for sweet and sour chicken.  The girl behind the counter was warm and friendly, and answered the few questions that I had.\n\nI was kind of iffy about this place. It's not in horrible shape, but it really needs a good cleaning and some updating.  I felt it was kinda dumpy looking.  But, it was late, I was hungry, and I didn't want to be to pessimistic.\n\nWell, I got the food home, and ate it.  It was fine.  But, I ended up getting sick later on that night.  I don't know if its because of the food, or the fact that I am having an ulcer flare up or what.  So, i have to give this place 3 stars, but with hesitation.  I want to say, I am not one who normally has a week stomach.  I don't know if I threw up because of my ulcer, or because of the food, but please eat here with caution.", "business_id": "s2-waYR5o7AZTNHeQVWRcA", "stars": 3, "date": "2008-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "wMHnLpVNYQY0dlXEMXsP2g", "review_id": "FfFxSuzdZ0wdki0TzZ6xQA", "text": "This place is next to my favorite chineese place. I tried it for lunch and had the Green Curry. It was $7.95 and I am full. This place has what you want. It is very good food, good service and its a clean quiet atmosphere. I like it very much and I will continue to go there.", "business_id": "vtQOervVVTXjhvSZQiZ6PA", "stars": 4, "date": "2013-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RxX5_RP3hSGpMhGY6y6OiQ", "review_id": "oLJhhl6XaVoPSIGvDNiu9A", "text": "There are many different Thai restaurants around the Phoenix Valley that serve red curry, but I have found none that can match the authenticity of Mint Thai. Mint Thai brings the culture, tastes, and ingredients of Thailand right to our community.  The most important part of a Thai meal, especially red curry is that it is authentic. There are four main reasons why Mint Thai has the most authentic red curry. \nIt can almost be considered as common sense, but it is crucial to the red curry that the ingredients are fresh and imported from Thailand. When you are cooking other types of food, this may not seem as important but with red curry there are a lot of herbs and other ingredients that simply cannot be produced correctly here in America. If they do make it here, it will not be the right flavor to give you the true Thai taste. The red curry paste is specific to Thailand. The spices used in the Thai red curry paste are not the same as other places. Another ingredient, the fish oil is made in Thailand. The fish used has to be caught in the country of Thailand to get the distinct fish that is used there. Different countries make fish oil with their own type of fish causing the taste to vary. The fish go through a fragmenting process and the juices are pressed out of it after a few weeks. All the ingredients used by Mint Thai are from the native country of Thailand and are added to the dish in the proper order to make the perfect dish. \n Another thing that Mint Thai does precisely is the way that they use the ingredients that they buy in their red curry.  The order that is used when adding ingredients is critical. For example, contrary to making vegetable stew, where you can add all your ingredients at the same time and throw it in the crock pot or on the stove, and come back to it at a later time, Thai Red Curry must be constantly watched over and made in a particular order. Straying from this order will cause the red curry to not be authentic and taste differently. \n So far, I've spoken of things that are important in order to get the taste of the red curry that you are looking for. Now I want to tough on how Mint Thai adds its own personal touch in order to make your experience while dinning and eating red curry feel authentic. The red curry is presented in such a way as you would find in Thailand. The food is always the right temperature and served with white rice. The staffs at Mint Thai are mostly all from the native country of Thailand. Hearing them speak to each other in the Thai language completes the experience. The decorations inside the restaurant are also very traditional Thai. It is complete with a picture of the King and Queen of Thailand, who are very highly respected and loved in Thailand.  \n Mint Thai gives dinning out for red curry the complete authentic experience. They are friendly and welcoming and the food is also fresh and delicious! The price is very reasonable and eating red curry there is one purchased meal you will not regret.", "business_id": "RFeDe3fNr14kvUKlVx6_4w", "stars": 5, "date": "2010-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "LABKzJqIEuzXmmik8AUi8g", "review_id": "6iiCm6KCF6IGxP4g3vHOUA", "text": "I don't understand why people call the food bland. If you want flavor full chinese food go to PF Chang's, but expect the heavy doses of salt, butter, unsaturated fats and other stuff. For me they deliver exactly what they promise, good food, low calories and salt, with very little fat. Unlike a meal at PF Chang's you the food settles in your stomach without that heavy feeling.  I eat here often.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 4, "date": "2011-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cNbpfwuMfvLb233G4Zs_5Q", "review_id": "v23YDqsWI36LFZi8cNgvcw", "text": "We had dinner with another couple at Flo's, based on the reviews we read here. Unfortunately, 2 stars is about all I can muster. The food was as lackluster as the service. Spring rolls were quite greasy (meaning they hadn't been drained adequately at best); and the four dishes we tried were distinctly uninspired. Flo's would certainly not be my first choice for Asian food in the Valley. And I doubt that anyone in our party will be returning. If you're searching for impressive Asian cuisine, skip this place.", "business_id": "H7KzlC0-o1wIhlGg-Me5Ag", "stars": 2, "date": "2010-09-01", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Jmfjq2QR2PmMBl7NOy2z9Q", "review_id": "iuZ6OW8lWkIM7yQGTLcQUQ", "text": "Maybe not the most romantic restaurant for dinner, but offers an amazing lunch and has great drink offers from the quaint, little bar.  Very good Phad Thai and Spicy Basil Chicken...  Have a Flo's Bloody Mary while you are there.  Great food!", "business_id": "H7KzlC0-o1wIhlGg-Me5Ag", "stars": 4, "date": "2013-11-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "sqLsoqm3lNxvfkOQ_wXucw", "review_id": "0BJU2j175Dt-X3rrIfpDFw", "text": "My two favorite cuisine in the whole wide world? VIET tops the list then Thai trails behind closely. I've been to lots of Thai places around the Valley but hands down my favorite is this place. It's kinda confusing to get to (read: mapquest this place or else) but it is worth it. The shop is cute and cozy and the owners are very nice and accomodating. You'll never really find it crowded but they have lots of to go orders and they've been a stable here in AZ for over twenty years. I can't recommend any one dish because all their dishes are diligently prepared and fresh. The prices are pretty good too. Anyone wanna come with on Friday?", "business_id": "0hYTkJtgQGu-ysCZnmFZDQ", "stars": 5, "date": "2008-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UdAjAVrxnfG47qqrEjUlkg", "review_id": "rr8qlEk5Ks6uSzacni4d8g", "text": "This place takes foreeeeeeeever to serve food!! Appetizer alone which we ordered as soon as we sat down took close to an hooooour! Then the main dishes? Another 20 mins?! Sad thing was, I came in with the family hungry, and craving some curry. Kinda lost our appetite by the time the food came..", "business_id": "XguGFMUSEMz4wx_2G-otyA", "stars": 1, "date": "2014-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ExVqO8oS8e7eemsIXXUCmQ", "review_id": "oFz8InFxPXOJ8cwYobt1kg", "text": "This food was not good.  Very disappointing.  The ribs were tough and bland, the shrimp was dry, over cooked and bleh, The eggrolls were flavorless.  The crab rangoon was basically just creamcheese filling.  Just not good.  The kung pao chicken was inedible.  It had a weird sour taste to it, not that it had gone bad, just not good food.  Very sorry we spent our money here.  We will not be returning.  We enjoy China-a-go-go on Valle Verde a lot better than this.  It isn't fabulous, but we are always satisfied.  Also, the delivery took well over an hour after ordering without any forewarning.  Not happy at all.", "business_id": "V6csWcyvwOg_E2ni3V_CgA", "stars": 1, "date": "2012-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6SUdWJu47ZhfAQZnvitgkA", "review_id": "kH6MSYPXzCxLHGhy1xZ_Ow", "text": "Another gem i found!\ni got here about 3pm it was not busy at all. actually it was just me and a friend. i was kinda worry but not haha. its seems family owned. right when i went in i was greeted and seated right away and our servers brought water right away! i love when they do that instead of us the customers ask for it. she gave us a few minutes to decided what we want to order. i decided to go the pad see eww . for $5.95 deal! it comes with soup . may i say this soup was really good and flavorful than the other place ive tried thumbs up! also salad, rice, eggroll, slice of fruits. it didn't not take to long for it to be cooked. im really use to big portions maybe thats why im overweight haha. but this was just the right amount! the staff was nice and friendly. place was clean aswell . do try this gem out!", "business_id": "H2eCY4wIIudy5C0BW5Y3ZQ", "stars": 5, "date": "2013-09-29", "type": "review"}
