{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L9R8Lk-_YVgEX254-LQ8TQ", "review_id": "CGGXzcKxsZgCEP-Bcr_iFg", "text": "Good experience , friendly staff, good pricing. Very happy and will continue to use.", "business_id": "e7ExjMdmeF95SzrZ--dHcA", "stars": 5, "date": "2014-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Pbms_qYJC7mYDy3tvZrzzg", "review_id": "huZUlRJL6PZKPLoBlQg-Vw", "text": "Buono's was sold after 20+ years of Jimmy making the best pies in town. Sauce recipe is the same, dough is the same, pepperonis not at all the same crust isn't quite as thin but overall great pizza.", "business_id": "m3O2EFVs3eo8s40MGGzmsA", "stars": 3, "date": "2013-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Zp8zjXj6Cvg66F5QH6Rc_w", "review_id": "FANPLUI6a8cRsI_zOw-dmQ", "text": "Closest thing to New York pizza I've found in years. Close to my house I've been coming here for years first time I've yelped it though.", "business_id": "m3O2EFVs3eo8s40MGGzmsA", "stars": 4, "date": "2015-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0QyicNU48_QB8YWIt4Kl5g", "review_id": "44zKXxoLCUYxKWw-T3GZJw", "text": "Was visiting this area and was referred to visit here. There were four of us that walked in this past Sunday to watch some football and grab wings and beer. Place was pretty empty and got a seat right away. Server came over and took our order of 3 beers and a gin and tonic, 15 min later we finally received our drinks. The Gin and tonic sat so long at the bar there was barely any ice. It took about another 20 min to even order our food and once we ordered it took 35 minutes for simple wings and fries. Once the wings came out they were cold but didnt want to send them back just to wait another 30 min. All around a pretty horrible experience. Wouldn't recommend visiting here unless you want terrible service and terrible food. Its funny because I had read the reviews before I went and it said the service was horrible, I couldnt believe it was that bad but I was terribly wrong. Big thumbs down to this place.", "business_id": "G7-NoraGlmzwO0sgs4fbmQ", "stars": 1, "date": "2014-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "1cKTUGVPmRJRrihjdxbPlA", "review_id": "lJov6BteBaMlp6kGR-oe0Q", "text": "We just recently moved from San Francisco, and we are happy to find this Vietnamese kitchen here in Mesa. The taste of pho (beef noodle soup) is authentic and delicious. We also ordered the BBQ pork w/ vermicelli noodles with chili sauce on the side. The restaurant is a cafe-style atmosphere, clean, and very pleasant to eat in. The Price is about $7-8 per item; it is a bit more expensive than in San Francisco due to less competition. We also love their home made dessert for $3.50 and will definitely revisit soon.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 4, "date": "2007-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "pTzdWFmI3E01SaGcf4W3Ug", "review_id": "bHNSNuGQsT1EK1RvXaJ9QQ", "text": "Teriyaki chicken was nothing special. Curry chicken just wasn't good.\n\nCalifornia rolls were huge. Almost too big really.\n\nMaybe it was an off day, but I just wasn't really impressed. Won't be coming back here again.\n\nHowever, decor was really nice, and the service was top notch as well :D", "business_id": "wc0a0XLhcMkoEQx1TbuhpQ", "stars": 2, "date": "2011-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "aV-ooYwqhEgHDaFZXiSW1w", "review_id": "s2SlUgAoBX_7OPUCo6UnAQ", "text": "My mother was admitted to this hospital due to a collapsed lung. Unfortunately it was the closest hospital to her. First of all you have to wait forever to get a nurse in your room. Since she was hooked up to all kinds of tubes, she had to always wait for a bed pan. When asked if she could wear depends we were told they ran out, and gave her a feminine pad! She had an accident twice when they didn't get in here quick enough. The first time we waited two hours for her to get cleaned up, the second time they told her she wasn't that wet and didn't get changed at all! Then the nurse who took her blood raised up her bed all the way and left it up when she left. When another nurse came in she yelled at ME for her raised bed! Today when I came to visit, there was bloody gauze and some kind of suture on her table that was not thrown away when her chest tubes were taken out. I had my four year old with me and did not want him to touch it so I asked her nurse, Simone, to throw it away because I did not know if it could go in the regular trash. She was on the computer and told me it would be just a second. Thirty minutes later she came in and said did you need something? I know at hospitals nurses have multiple patients, and are always busy. They're normally some of the most awesome people there are. But when these nurses act like it's a burden when they're called, it makes you scared to even call for anything. And I haven't even mentioned the construction they're doing here with all the jackhammer and pounding noise. How anyone could rest and get better here is a mystery to me.", "business_id": "Rm8jCL-8fbBAPtPpBJGu7Q", "stars": 1, "date": "2015-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZDZr9jCc9FznutQB_kGvLg", "review_id": "ncmsj6jHVbt19Lr7iS5H1A", "text": "I played today on a Tuesday. Play was a little slow at first but picked up. Course was in good shape. Pro shop staff was friendly. I would play here again.", "business_id": "bRk44ShCT0osos-1xaTRyA", "stars": 3, "date": "2014-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0d3vlF6zd049N-AZvLtXnQ", "review_id": "q7cgqt9NT8wBBVKoBqlpHA", "text": "awesome! friendly staff, they serve tang  & kool aid, gotta love it!!", "business_id": "KS2w8ychyieJbUqRa6kCHw", "stars": 4, "date": "2011-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Yz7p2kMjj4EMVssWFsGFdQ", "review_id": "Onf9x4KvbhtUC4SNMRxXtg", "text": "Best place. Better than the Tempe location in my opinion. Nicer staff, things don't get messed up. Food tastes better too.", "business_id": "KS2w8ychyieJbUqRa6kCHw", "stars": 5, "date": "2015-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "V6axWAF3-xOvUgjOKLNy-Q", "review_id": "bdWd34LlDqMU8MN9R7tYZQ", "text": "This is one of my favorite places for roast duck and roast pork their regular Asian food like kung pao chicken is very good as well.", "business_id": "8TGUK7LD3M-vLWml-jLb0w", "stars": 5, "date": "2014-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "67z8bv7gkioAnwk5XBX-Gg", "review_id": "Cfx8_BTz1Wle82OEU6VSIQ", "text": "The quality of the food varies a bit from visit to visit, but this place is capable of making the best tempura I've ever had.  The udon is also excellent. Do not order the curry. Nigiri and sashimi are okay.", "business_id": "BBPkwpj9kSeDuy0uOwWHJA", "stars": 4, "date": "2012-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "hCKkTKakQ0XRSspZaMauxw", "review_id": "B8k8j_92KWf7F0qDilu1fw", "text": "A mighty fine place: the banchans, soondobu, panjul [seafood pancake] the best i;ve had-- better than the koreans places in NYC.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2010-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "gb2JIM7M2mj7thEjdbfksA", "review_id": "qqgNPR99993GLIbZMuIQ9g", "text": "The food was good, and it's one of the few real Korean places in the Phoenix Metro area, but the service was what ruined my meal here. As expected, my group and I were put in the \"white person\" area away from the main floor. And we had to wait 15 minutes to even be asked for water. It was great food, third to only Las Vegas and Orange County. Would I come back here? Probably, but not any time soon.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2013-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mKDpNucXep-N0V1oEUVPkw", "review_id": "QMwytUNsztyVPStQE0CyIA", "text": "I've been going to Mesa Dental Care for about 5 years.  Dr. Nia was very compassionate when I came in crying for my crown on a front tooth.  It was really traumatic for me to lose that tooth.  They sent me to the crown laboratory to ensure I got just the right shade to match.\nThey don't keep me waiting and use state of the art equipment and make me feel comfortable about my dental care.", "business_id": "EaIhqN7LT-fWfwI_N-f2TA", "stars": 5, "date": "2014-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oNVd-Rw8KD2_kxg3NUDwww", "review_id": "ex5ok7xRzOZXvbJdeq-MxA", "text": "*** I love this place! ***\n\nI have been going to Nails 8000 for about 10 years. They are all very friendly, genuine, and never rude. Tam does an awesome pedicure! Tina always takes such great care of my nails, they are amazing. Tee and V are great as well, they truly do a great job of making you feel comfortable, relaxed and welcome. \n\nThe prices are very resonable, and I know they count on tips so with the prices low it's easy to give 25-30% tip and not break the bank. \n\nThey are revamping the nail polish/acrylic nail displays-Kudos for listening to customer suggestions!", "business_id": "Ay-snTeDn4w790I-sBfyjg", "stars": 5, "date": "2013-11-06", "type": "review"}
{"votes": {"funny": 4, "useful": 4, "cool": 3}, "user_id": "C8Ha0_DXfTtAWs2oZDwkHg", "review_id": "WawYAuH1R8J3sX8LVONYIg", "text": "Take two shots of penicillin and a tetnus shot after eating/drinking here.  And for god's sake stay out of the bathrooms.  Don't believe me, check out the expert reviews on Maricopa.gov, restaurant ratings...pretty yuk!", "business_id": "Cp5_NSJFNgylD5SUdmT8nQ", "stars": 1, "date": "2009-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SfDerUF2N2Hx9D84VrXpug", "review_id": "56SnOIkjz0gR9HdkqbJRhQ", "text": "This place is really cool...recently started taking my children here and my 5 year old son loves it. My daughter who is 2 screamed and cried to the high heavens and her teacher was very patient and didn't let it phase him at all. I wasn't sure about bringing her back but because the teacher is so great and assured us the crying is normal, i went ahead and signed her up also. I also like the play area and the extra pool that the children can play in while they wait.  Also the prices are very resonable and if you go to the website you can print out a  coupon for first time clients.", "business_id": "WOgYQltFy-NhgYQzsMEfKw", "stars": 5, "date": "2010-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "y11qW_reOCfxfwM2x_I_mA", "review_id": "C3gWtyfEWLPReZ-vI-RYWA", "text": "I saw mostly negative reviews about this place but since it was so close to where we had to be we gave it a try. Shouldn't of done it. Took forever waiting for someone to help me check-in. Then at time of checking in the lady was not very professional looking and was all over the place making mistakes over and over again. Eight months pregnant and she decides to give me an upper unit; no elevators. I had to ask her to switch it to a bottom unit which took up even more time. \n\nThe room was not vacuumed, the furniture, TV and desk were full of dust and the bathtub was dirty. \n\nForget about the free breakfast... It was so far away from where my room was I was just too tired to walk all the way over there.\n\nWe only stayed two nights. The first night an alarm clock had gone off in a vacant room next door to us at 3:30AM and didn't turn off until 5:30AM!! My husband and I were so tired!!!!! There was nothing we could do and no one to help us at that time. My husband had been working 14 hour days so I know he was so super tired; I was pissed. The next day I called the front desk and spoke to Yvette. I told her the situation and asked her to please get someone to fix the situation. The alarm clock had been unplugged in my room which makes me think that all the alarm clocks in every room are unplugged. Obviously except the room next door to us. She said she would get someone down there to fix right away which I was grateful for. \n\nOur second night here......... my husband and I are both up at 3:30 AM AGAIN because of the same stupid alarm. Cannot freaken believe this!!!!!!!!!!!!!!!!!!!!!!!! \n\nI go to check out that same day about 15 minutes before 11 AM... and Yvette is at the front desk. I confronted her about it, and it was plain to see how upset I was... but she seemed to care less. Her attitude sucked and she's lucky I didn't go off on her. One of us had to be the professional one. \n\nWe will definitely never come here again.", "business_id": "CscJ0RubTHofHvRJhERvXQ", "stars": 1, "date": "2014-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Vy3GcLOMGVyBioEZ3Ew4pA", "review_id": "Pm7p2u5DhYFIUbQyC1eQ0g", "text": "This has become our Saturday morning, post Weight  Watchers meeting, breakfast hangout. Love the Nurse's breakfast, my fiancée typically gets the breakfast tacos. Good service, front patio is nice, the side patio is too cramped for my taste. Parking can be tight during peak hours so carpool if possible.", "business_id": "8aPTQeDYOMNEu907WfflCQ", "stars": 4, "date": "2014-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kX8h3KDNoVp76BpRfgDY3Q", "review_id": "gmvtrxV_qJnOeSHtenK_9w", "text": "Awesome food. Love their lunch specials, out the door for less than 5 bucks with a rice bowl.  Authentic Thai food and spiciness that goes with it. Eat here at least once a week", "business_id": "s2-waYR5o7AZTNHeQVWRcA", "stars": 5, "date": "2011-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EZNeBS6i2RmZYtGDBwFv1A", "review_id": "Qrw6f-Lcuj-zr-TbCrGA5w", "text": "DONT GO HERE! \nNot worth it, go to the Pep Boys on southern/country club!\n\nWent in here in the 11th for a simple oil change and it was a huge mistake! The oil change included a tire rotation and the works, but once my car was done they said my rear RIGHT tire had stripped studs and they couldn't put the lug nuts on properly, so they said my car was unsafe to drive and told me to walk home because they couldn't fix it till the next after noon. I told them I had school/work the next day and couldn't miss , so we agreed to roll my car into the parking lot and I'll just have my boyfriend fix it himself. Turns out only one of my studs on my RIGHT tire had stripped and they had just ruined 3 of my lug nuts trying to force them on one stud. However, they did force a lugnut onto my stripped stud and we couldn't get it off ourselves so we went back to Sears to have them remove. They wanted to charge me another $24.99 to remove the lugnut because the incompetent MANAGER wrote in the paper work that the stripped studs were on the LEFT side.\n\nI only talked to the manager the 2 days I was there and he was completely unprofessional and rude. I will definitely never be coming back.", "business_id": "o_GpjGhqK-hRxA7u_Mxv9g", "stars": 1, "date": "2015-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "mhL60RvkB5ewp_QywR_MBA", "review_id": "vGuvO2ilr9BlNgEeIM6hOw", "text": "I should have checked on yelp before I even bothered making an appointment at this place. My appointment time was at 9:15 check-in I arrived at 9 o'clock paperwork in hand which I had already filled out. After waiting for 30 minutes I went to the front desk because maybe someone had forgotten about me. I was rudely told by the woman at the front to please sit down and she will be with me shortly. After almost an hour I was finally called to pay my co-pay. I then waited an additional hour just to be called into an exam room. After 30 minutes I was finally seen by the P.A.and was told the doctor would be in to see me shortly. By shortly I guess he meant an additional 30 minutes. Dr Bennet literally spent 10 minutes with me and that included an entire body exam. He never apologized for all my time he wasted nor did he hardly seem bothered or interested in anything having to do with my well-being. What a complete waste of time and money I will be reporting this to my insurance. Do yourself a favor and do not go to this office if you're looking for a doctor that truly cares about patients. He's a sorry excuse for a rheumatologist. And his office staff are clearly clueless", "business_id": "GA6-xbZ-uemHe4fbN2GQXQ", "stars": 1, "date": "2014-09-03", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "oORHh30ptSk_5v7UBBWzwA", "review_id": "cFw2vL4a7Mw_Qfu17ZbC8w", "text": "been coming here once a week for 6 months.  always a great meal.  chicken fried steak and eggs was my fave.  \nuntil this last Saturday.  waited 15 minutes for a waitress, when she arrived she asks what I would like.  well how about some water.  5 minutes for water and I could count the guests on one hand.  I ordered my usual.  runny eggs and the steak was pure salt.  the hash browns were raw.  when the pancakes arrived she wouldn't look me in the eye and never asked if I wanted coffee or anything else to drink.  she left the receipt without a word.  when I went to pay the manager asked if he could talk me into a pie.  never asking if I enjoyed my meal.  too bad, losing my favorite morning spot.", "business_id": "dbh72sNyNeHUgJqQye9Vbg", "stars": 1, "date": "2014-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FPj0VlYKX6txU91TS_AxkA", "review_id": "B2Ak2KMbfb-gorh0WyYC1A", "text": "We have been going to Golden Canyon Chinese for 17 years. The first 10 years were awesome and then they changed recipes with the sweet and sour chicken.  They would ask \"old style or new style\" now it's just new style...which are beer battered fried chicken lumps. The egg drop soup frightens me now...lots of corn starch and corn. Hardly a veggie in their food. I decided yesterday's visit was our last. Thanks for the memories Golden Canyon Chinese food...you used to be the best!", "business_id": "CuYHDItnOSfSlPfPDA9Btw", "stars": 2, "date": "2014-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rGIFxf2zOggqX743_YCrTQ", "review_id": "Q8LKYqtNMFSNOKNrT2N1WQ", "text": "I wish I could give more than 5 stars! I brought my 85lb lab/rottie mix in for the first time just this morning and this is hands down my new go-to place! We saw Dr. Anderson Jr. and he was so informative and caring. He didn't force surgery or this is that. I was blown away when I was given the bill at the end! Seriously 75% less than what Banfield would've charged me! I really can't say enough good things about this wonderful clinic. I highly recommend switching to them for all of your pet's needs, you won't regret it!:)", "business_id": "pJ1Fy-IXJYECunEAj586HQ", "stars": 5, "date": "2014-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "67z8bv7gkioAnwk5XBX-Gg", "review_id": "NCIDWCtmf3e1-GSwxwJWUQ", "text": "Having lost the gene pool lottery, I have some ridiculous health problems that are very hard on my teeth.  As a result of this Dr J has placed 7 crowns for me in the last 2 years along with filling several cavities so I have extensive experience with him and his staff.\nI've seen about half a dozen dentists in my lifetime and he is hands down the best.  Everyone in the office is very friendly and considerate and they do first rate work.  I will likely move out of Arizona soon, but will be sure to make an appointment with Dr J anytime I come back to AZ.", "business_id": "CJhF1smSIwvUeKM1tUNXVw", "stars": 5, "date": "2014-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hvFTeJlUKqtvCoQN_cd5Kw", "review_id": "ncjqng2MvtoYCU4HCAIuaA", "text": "My husband and I checked this place out when our membership was up at Snap Fitness. We both wanted a larger club with more options.  This was close to our house.\n\nFirst impression:  Outside is very run down.  The entire center needs a rehab.  Chipped and missing concrete as you walk up.  The fountain just outside the entrance was barely on and had huge amounts of algae.  Interior seemed VERY 80's (can you say Miami Vice?)  Lots of glass block and older looking floors.  The waiting/seating areas and main desk looked second hand.  The place had a \"not very clean\" odor when we first walked in.\n\nThe first person we had contact with never did give us his name and did not have an ID on.  Yes, he had the Bally's red shirt, but no ID.\n\nWe told him we wanted to find out their package pricing and what the club included.  He immediately wanted us to fill out an \"insurance waiver\" so he could show us around.  My husband asked if this also gave them the right to call/email us and sell our email address/phone number/address to outside vendors and he said, \"Oh no.  Its just a waiver so we don't get sued if you get hurt while I show you around.\"\n\nWell, my husband read the small print and right there it stated that by signing the form you agree to allow Bally Total Fitness to sell/transfer all personal information to their partners and other interested companies!!!\n\nWhen we pointed this out and told him we weren't signing this, he said, \"Well I can't show you around then.\"\n\nWe left!  I don't do business with underhanded sales tactics!", "business_id": "o2gquauQEE9L1sBbcdbxZg", "stars": 1, "date": "2010-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "byJBEza-0WEtZ7yHybO_IQ", "review_id": "mVd11O0DRLdIePUt6DfPVw", "text": "The only thing that has been positive is our neighbors and friends my son has made the fees are horrendous no grace period on rent even if it falls on a holiday you pay a 50$ late fee they taped up the drop in box so you can't bring it by after the office is closed. Then the gate is always broken the pools with the exception of the one they show by the front office are disgusting most the time and the chairs and patio equipment are old and stained there is broken glass under the stairs that have been there for atleast 2 months but I get a letter for the appearance of the apartment complex  I need to take down my curtain because it's not white and my major complaint is BEDBUGS!!!! Numerous tenants have thrown out couches beds and other furniture warning to not take due to BEDBUGS they charge you 300 bucks for their company to come out and issue you a list that says maintenance will remove the outlets for the treatment because if you don't follow everything on the list you are at fault if the bedbugs come back we call to have this done we are told we have to do it they will not enter our complex so they are not following guidelines they gave us we did this procedure back in March or April now on Oct we are over run again with the bedbugs under our carpet and in the walls and again the same procedure that didn't work the first time is being issued upon us again with another 300 dollar fee this is not an isolated incident they travel through the walls!! The bites are horrible we can't sleep at night this will be the 3rd couch and 2nd bed we have had to throw out they are rude about it and inconsiderate even cussing when told they are in the walls I'm filing a bbb complaint against them and looking into who the property owner is so they can know what is going on at this dreadful place!!! This is not liveable conditions and the whole procedure and process is horrible!", "business_id": "x8Jxxfk0CaM0wmmDcPPagQ", "stars": 1, "date": "2014-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "IjvUOPwgPKhDDrGNkg8Jig", "review_id": "DTdw4WyjiQJP6EYKD2p3ww", "text": "This place was pretty good not bad in price either. I purchased a gyro sandwich and it was pretty good. Good flavors, a bit dry on the meat and pita. I would come back for another. \nStaff: was nice \nStore: was interesting to check out a different culture of foods and shopping. Clean place.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2013-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6haRx3OHULNCP_nLQ68USQ", "review_id": "6V3WaYAqLVYru8jDuKlgmQ", "text": "The food here was amazingly good,  and prices were very fair for the portion of food offered. The gyro sandwich was very large and flavorful.  The meat was extremely tender and well spiced.  This was probably the best gyro I'v eaten in a long time. Also ordered the combo kabob platter.  The grilled meat tasted very authentic and the hummus was very good as well.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V9vStLuNc4aqZO_GK2VTuA", "review_id": "WEpfFzpP99MgyI4pHS1KnQ", "text": "can i give 6 stars?\n\nreheated leftovers last night and they were delicious. not at all weird like leftovers can get.  AND i was full when we left the restaurant with our leftovers, i didn't think i brought that much home...i was full again last night. i am so happy with this place!\n\ni will probably want to go here again this saturday night!", "business_id": "PNrOTfMmE0CJFV9YwSLzYw", "stars": 5, "date": "2010-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FKi5me6fBGPmiRHo6w4EBw", "review_id": "R8JtBh9F3sUAE2LNx6TZyw", "text": "Same as it was 20 years ago. Went for lunch after recently returning to the valley of the sun. Not much to write about my lunch. Portion was small. just some breaded chicken some sickeningly sweet sauce and some walnuts. Boring. I had the hot and sour soup that was oddly thick and had WAY too much tofu. The place inside was dark and old and seemed dirty. The bathroom opens to the dining area, so that made it seem worse. Probably wont be back. Disappointing. I remember something better. but maybe its because i was young and hadnt experienced a better place.", "business_id": "PNrOTfMmE0CJFV9YwSLzYw", "stars": 2, "date": "2014-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z-nFzLSERYPvUSzBn-wqUw", "review_id": "0HA7KzTc3rvBXhZ3-gwbJg", "text": "The food was most excellent!! Especially for the price. Only downfall is that its too close to my house!", "business_id": "CuyNmwDOLeMTrbv2c6rNxA", "stars": 4, "date": "2011-11-28", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "gIBOZF2McRkIRjKExxGvwQ", "review_id": "ch7-AoK-5pqE0ObgDO9MBA", "text": "I dropped my brother off there to get a decent hair cut because his hair grows pretty quick. He asked the lady there for a fade, to shave ALL the sides off, and to leave one inch on the top. However, he spent an extra 20minutes there trying to explain to her what a fade was. He explained it to her four times after she grabbed out a pair of scissors and cut his all the hair on his head down to an inch. He repeated to her that he wanted the sides faded, so again...she said ok and kept snipping the scissors to get the hair shorter. My brother at this point needed to tell her a fade is done with electric clippers. \nHe was ready to get another person to get his hair finished but the only other lady was busy. Generally, patient and easygoing but he was very unsatisfied with the entire experience. We currently had to be at a Verizon and it's so embarrassing because he has all the small pieces of hair all over his face! He was very disappointed, but not surprised that she did a horrible job at cleaning up the mess after the hair cut. Horrible place, stay far far away especially if you are picky about how well your hair gets cut", "business_id": "BVJlVm8w5ioi-S6GrY_ZnQ", "stars": 1, "date": "2013-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0beZngJ03EmIQfVcnlVK4w", "review_id": "ME1Hh5VTBgTh6G2RWw1t4w", "text": "This place has everything you could want or need for Halloween! Just got done shopping and had a great experience. The staff was nice and helpful, the store is full of costumes and all the accessories you could want. Considering it is so close to Halloween they still had a great selection.", "business_id": "bbFWQng4nd0P083xUEiShA", "stars": 5, "date": "2011-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qGNjpaLix9lcSAej50vQ_g", "review_id": "S0jyrlI06uCJTfJmPqbEMA", "text": "My situation is different from most in that I have insurance thru the state. I went to a few chain shops and was pleased with Chris and the price. I then went to Cigna's optical center and priced the same two pairs of glasses. About the same price, with the deductible. But wait...Cigna pays set amounts for out of network. Final price? About $160 less thru AmBest. Got the glasses several days later. I tried progressive  bifocals for the first time I'm my daily wear sunglasses. Like them so much, I'll see AmBest after the first of the year when the insurance will pay for new lenses and get a clear set made.", "business_id": "AIr3Xtgsm9BHQs1_IM_ppA", "stars": 5, "date": "2015-09-15", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "8Knppc9FtlyJNi9ySRz8XQ", "review_id": "iS7rAI7svsGAhvcfRB30Ww", "text": "I knew I needed to see an endodontist urgently for a tooth that has had a root canal and a crown. A strange bubble had formed on my gum-line one morning, and even though it didn't hurt, I was anxious that it was an abscess. \n\nI had just moved to the area and didn't have a new dentist yet. I also didn't have dental insurance yet figured I might as well go straight to a specialist since I would be paying out of pocket. I picked this local office because it has perfect ratings on yelp. I called at 11am and the receptionist was so kind to me as I explained to her my situation. She was able to slip me in for a 3:30pm appointment that day. I was so grateful they were able to get me in at the last minute!\n\nI arrived and I got brought in without much wait time. They did 3D imaging of my teeth which was very easy and painless, as well as an apical bitewing. I really appreciated the thoroughness of my evaluation. My endodontist that came to see me was Dr. Hamberlin who was very friendly and empathetic. It was indeed what I suspected, an abscess! He explained to me what may have occurred and drew on the digital imaging to help me understand my tooth situation. He quickly made a referral to an oral surgeon who was also wonderful. \n\nI had a really good experience during a time that was rather stressful. The office consult was $99, but I felt it was worth it because they were able to bring me in on such a short notice and I wasn't charged extra for my digital imaging. Thanks again!", "business_id": "NRbxQLwFyfb7BC0Vs2ld5A", "stars": 5, "date": "2015-10-22", "type": "review"}
