{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BoSz7ToyKU6kG0oSs9NHtA", "review_id": "O2ZoTq3QRFO3NcS8h8nmHA", "text": "This place continues to be a joke.  The service is bad and the attitude of the workers is worse.  \n\nMy order is never right and yet I still go...never again.  \n\nI officially deem this place the worst restaurant in Pittsburgh.", "business_id": "JL5B_s1EoN4zIru4JSw4Qg", "stars": 1, "date": "2013-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "1h5T9mNgReCiykYCxvI55A", "review_id": "l__lsHsXJ3HdHcfzw220wg", "text": "Horrible service. I mean HORRIBLE. \n\nWent during a non-peak time. Pretty quiet in there, not a lot going on. Three employees who were sitting around chatting watched me and my my disabled, elderly friend stand and wait for long, endless minutes without doing anything. I finally went over to the bartender - also hanging out and chatting and watching us stand there - to ask if a hostess was available. Her response? \"Oh, I can seat you.\"\n\nReally? Then why did I have to ask you to!?\n\nThen, the young male waiter assigned to our table just laughed when my companion asked where the restrooms are. WTF?\n\nLook, guys, that would be crummy service to anyone, but to treat an elderly person with a disability like that is just unconscionable. \n\nWe left and won't be back.", "business_id": "hhNlQWaKqGbMPoeZHoL-IQ", "stars": 1, "date": "2015-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uZqIfdZvTZTudZuggUVirw", "review_id": "lggBRwnqRfXQpgY9ms2qUw", "text": "Worst service in the area, by far.   Once we were seated, it took the waitress 25 minutes to make her way to our table to take our drink order.  We finally decided to settle up 45 minutes after placing our order.   The food never made it to our table.   I have eaten at this restaurant before and  the service wasn't so bad.   The food is generally pretty good.  If you want to order Chicken, definitely get it shredded.", "business_id": "2VuPoaFPktvtAqTX_Fzc-A", "stars": 1, "date": "2011-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uc4QurS1XrvyiIpne2IbhA", "review_id": "BFewBZ0bnyqNnytBqXzJZw", "text": "Service is always good. Salsa and ranch is so good. I don't like how they give small portions of it. Salsa is a very small portion and me and my husband had to ask for more salsa 3x. Burritos are so good!! Rice is fluffy and flavorful. Fajitas are good but there was a time where my fajitas didn't sizzle to the table. Other than that, it's good!!", "business_id": "CxGK5_GoIhG9798zYPsvfA", "stars": 4, "date": "2015-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1BSl660nGalwncSD95NzCA", "review_id": "xnP3kO6UfEm34B10Bp_wqA", "text": "Para mi primera visita y ser fanático de restaurantes mexicanos ahí le vamos. La cerveza draft de 32onz es mi preferida y a buen precio. La salsa y lo nachos muy buenos. La comida muy buena pero el servicio y las atenciones de los meseros es donde único fallan. El servicio tiene mucho que mejorar. La variedad de postres es nula sólo 2 opciones. Por lo demás seguiré visitándolos para cenar.", "business_id": "p_HFt0I92MHDNPWvdtyEBA", "stars": 3, "date": "2013-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "403elUK_OqNTCYn5iwVlmg", "review_id": "wI41WIbt-GJpcPo_xcgCXA", "text": "I travel on business often from San Antonio Texas \nand I make it a point to vist Miguel's the night  before I return home. I have been very pleased with the service, prompt turnaround on the food and above all, the taste of authentic mexican food.", "business_id": "p_HFt0I92MHDNPWvdtyEBA", "stars": 5, "date": "2015-10-22", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "kPBOUfcko39gFe4FEb7khw", "review_id": "s53EG41y3wtcCaMj2hbPMg", "text": "I should've just gone to Taco Bell or Monterrey. After hearing rave reviews from Mexican, Puerto Rican, and Dominican friends, I finally got the opportunity to eat here last night. \n\nI arrived around 9:30pm and was sat instantly. we were the only party in the upstairs part. My friend, who is Mexican, chose to get the rice water (forgot the original name) and it was delicious! Chips and Salsa was plentiful, I didn't care for the salsa at all. Tasted bland and watered down to me. The chips were obviously out the bag, which I don't mind but some salt or some seasoning was needed. \n\nI ordered the Street Tacos and my friend got the Shrimp Fajitas. He loved his fajitas! Now, my Street Tacos on the other hand is a completely different story. The tortillas/soft taco shells were greasy and cold. I couldn't even eat them. The items inside the taco weren't that great either. Huge strips of chicken that tasted bland, barely there pico de gallo, and a sprinkle of cheese. There was lettuce and guac on the side. I also asked for sour cream on the side to try to make it taste good. It also came with rice and beans. The beans were beans, nothing special. The rice was the best part of the meal... but it was room temperature which I didn't like much.\n\nService is the reason why I will never give the food another chance. Our server was Ingrid. She was pretty great at first. When a Spanish speaking couple came to sit upstairs, she began talking to them so me and my friend had to wait about 10 minutes for the check once we were done eating. Then, she assumed the checks were together and seemed to have a shocked look on her face when I asked to get them split. We had to wait about another 10 minutes for her to finish talking to her manager/co-worker. The thing that that really put the icing on the cake was seeing a charge for sour cream. I wouldn't have minded if I knew when ordering sour cream with my tacos that there would be an extra charge, but to me that is just Serving 101 to tell a customer that all add ons were extra. Paying $1.25 to attempt to make the tacos taste a little bit better was ridiculous. When asked about it she told me, \"All add ons have a charge to the ticket\". No attempt to atleast say, \"I'm sorry, but sour cream has a charge.\" I just don't like being surprised when the ticket comes. There was a man, maybe the expo manager or kitchen manager that refilled our chips, salsa, and drinks. I'm not the greatest tipper, but I always tip 25-50% on inexpensive meals so I felt obligated to leave a note telling her that I would've tipped if I knew about the charge and if I could've got the ticket faster instead of watching her chit chat literally right in front of me while waiting for my ticket One of the first times in a while that I didn't tip. I'm in the service industry and I know that if I ever treated a customer like that, I would've gotten wrote up and had to have comped their meal out of my pocket. \n\nSuper long story short: Sub-par food, worse service.", "business_id": "rg1-6A-8SKXGh_p-Abbyxg", "stars": 1, "date": "2013-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JXJ1LSo38p9LgFNlkvVkig", "review_id": "mlSSpSJpCAQyMulmbBNyZQ", "text": "OMG! they have some good fried ice cream. Great service and great steak fajitas.", "business_id": "UzbI1Da7X23bDLwPluj5Qg", "stars": 5, "date": "2010-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wD68tb65IpzyOUJcee1Rwg", "review_id": "I3GX4_VIkJ4OmPHBeSFyJA", "text": "I've only been here once, but thought I'd share after reading some other reviews. \n\nFirst off, this is NOT TexMex. I'm not sure what I would classify it as, maybe AmeriMex, but definitely NOT TexMex. \n\nNow that I have that out of the way, I'll say that I like El Cancun. \n\nI do not like this El Cancun. \n\nWhile it looks decent on the outside and the inside, the food and service were simply terrible. Chicken was very watered down, the salsa was flavorless, and the service make a fast food chain look really good. Just a poor, poor experience at this location overall. If this was the only El Cancun in Charlotte, I would feel the same way many posters do and just never come back. \n\nLuckily for me, I live in Rock Hill. There's an El Cancun here. And it's pretty awesome. I won't give it a full on review because this isn't really the place for it, but suffice it to say that if you're in RH and you see the El Cancun and you go \"ugh, no way that place is terrible\" don't put your experience with the really shitty location on to the one in Rock Hill and give the other one a chance.", "business_id": "hGMY-HlQTFUCSmHPDobBUg", "stars": 1, "date": "2012-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QP-MdjpUFejr9apuAWcfQg", "review_id": "rt9MBckxKbIofURx46FjwA", "text": "Decent menu selections, better than average service for a restaurant outside of downtown, and a fair price.  It is hardly authentic, but we dine with our six year old often and Pedro's is a great place for kids or to go after work to watch the game.  They have changed the salsa twice and it still sucks.  I was informed by the manager that the old recipe was 'too spicy' for people in this overgrown Mayberry.  Over all it is decent with pretty good service.  4 stars are for value and service.", "business_id": "wPidHd5FxspPRgVqdEQ-Xw", "stars": 4, "date": "2007-09-03", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "pUGA56jZfTtkszfBAVGwKQ", "review_id": "SqA61SHo3LNjAa873md7AA", "text": "I'd give it a zero if I could. This place is weak as fuck. Mexican food? Please. I'd rather go to Taco Bell. There's a taco truck down the road that you're better off spending your money on.", "business_id": "1ZMcQNF-hHL0nJSnh5_a4w", "stars": 1, "date": "2012-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z-0O0XKmsykITnDWQPAXwA", "review_id": "6bx178oPbdeBEHkZx0v37A", "text": "I don't care that this is a chain. They have, hands down, the best chips and salsa I've had at any Mexican restaurant. I would love to buy a tub of that salsa. All of the menu items I've tried there have been amazing. I usually go for the enchiladas, but I've been super impressed by the fajitas, and most recently, a vegetable quesadilla that was parmesan encrusted - somewhat odd sounding, but soooo good. It's always friendly service, and they're very accommodating. The prices are good as well.", "business_id": "WgmAx4SWy-71daxakDNd1g", "stars": 5, "date": "2010-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t5IXWQdoTKRVTiM-I9PslQ", "review_id": "Iuh0_qlMziBD9NalXaQdaA", "text": "Food was OK.  I had the enchiladas and they were good. The rice was also great. the chips and salsa were horrible in m opinion. The salsa was slightly sweet and the chips were a mixture of different types of chips. While this was unique.. it wasn't good. On the flip side my food came out in about 5 minutes. My server was good also.", "business_id": "e5kc0CQ4R-PCCDgb274gSg", "stars": 3, "date": "2011-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sH6k8UIE2N3hjKNKtEE3Lw", "review_id": "INMpe8MCSx_JA8sNl5FqFA", "text": "I really liked this place they will definitely see me again. Often! The atmosphere outside was fantastic, noise levels were jovial while we could easily converse without shouting - just right.\n\nThe food was amazing. People at two other tables around us exclaimed Wow! When receiving their orders. \n\nWorth a visit.", "business_id": "e5kc0CQ4R-PCCDgb274gSg", "stars": 5, "date": "2014-10-25", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "LXWAXIeYFIdgd2JVPF-9qA", "review_id": "o0OFNgiYO4JVv9XluWq2ng", "text": "After one of my epic party adventures down town... My buddy said this place was a must for great breakfast food. We entered the spot it was packed we were seated pretty fast and I looked over the menu and went with the  Machaca, Chilaquiles y Huevos Combo with a tall Dos Equis it was early but a must have... I rate the experience as followed.\n\nMachaca, Chilaquiles y Huevos Combo - A\nStaff - A\n\nI enjoyed my meal it was so good... I will be back for sure soon for some great food everyone was so nice my second beer ended up on the table talking with your hands can be a problem...The staff laughed and helped me clean it up now that's team work.", "business_id": "BESmH-lmMm34_EefL8X9fQ", "stars": 4, "date": "2011-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "KJr7eW2yHEtDxZm8TXb8QA", "review_id": "198y0HH5o7ytwmEZ59DOFA", "text": "Would have given 5 stars, but They been open for years now you think they would have a better system on there wait times. Food is amazing best Micheladas in town.", "business_id": "BESmH-lmMm34_EefL8X9fQ", "stars": 4, "date": "2014-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MDByIVDOEJkhiafmjxpZ4A", "review_id": "LgQZlK7cG_PkcIx1ESkb0w", "text": "Incredible, authentic, delicious food!  My grandparents were very good friends with the owner since the \"Flautas Restaurant\" inception (now Comedor Guadalajara) - the evolution of this incredible family has been a joy to be a part of.  We are forever customers!!", "business_id": "BESmH-lmMm34_EefL8X9fQ", "stars": 5, "date": "2015-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xlhOYJz88hseqBnygHVz6g", "review_id": "wOPV4LvBLLg3NSWhpo4QDQ", "text": "I stopped in here today for lunch since I was in the area. The service was friendly and nice. I ordered the carne asada tacos. First I got chips and went to the salsa bar. The chips were noticeably stale, but the salsa was good. The carne asada tacos were gross. The meat tasted spoiled, the texture was weird and it was greasy. I was very hungry but could only stomach two bites. The beans were runny and tasted bad. I will not be back here again.", "business_id": "D09yG6Z3gcsh24Qn7Y4gYA", "stars": 1, "date": "2014-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kOb1hWSwA6aD2mRVy6lqFQ", "review_id": "Lu4MVbIhLVvRHqQFWEhM4A", "text": "This place is ok if you are so starving you don't care what you eat. The chips and salsa are great, but everything else is pretty bland. I am a fan of tamales and I would definitely not order it again. They do make some pretty good chicken tacos, but you only receive 2 small tacos and its about $12... no thanks! I would prefer Taco Bell over Mi Amigos. The staff is very nice and the service is good, too bad the food does not match.", "business_id": "-lOSaCuBRAvX5JBifx-EMw", "stars": 2, "date": "2009-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0J9Q4Eg2Oyo9CnOyUam5aA", "review_id": "jBstt7x1fDdm5x2eo-KTqQ", "text": "Not my first choice for Mexican food by far but when I have no choice so be it. The staff is ehh and not that friendly or fast. The only thing I will eat here is the rolled tacos, everything else I've had is not up to my Mexican food standards by a long shot.", "business_id": "-lOSaCuBRAvX5JBifx-EMw", "stars": 2, "date": "2014-11-20", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 3}, "user_id": "JgDkCER12uiv4lbpmkZ9VA", "review_id": "dnFO_39rMO1MxfQPY4lxzQ", "text": "After an online argument with Julia T. about what constitutes Mexican food, I decided to try Rosita's Place, since she gave it such high praise. \n\nUpon walking in, I was actually pleasantly surprised at how clean the restaurant was. I was expecting more of a Carolina's type atmosphere. The lady who brought us our menus and sat us was very friendly. I thought the fish pond, while extremely odd, was a relaxing touch in the center of the dining room. \n\nWe ordered a half-pitcher of margarita, some chips (since they were raved about) and it all came pretty much right away. The salsa was good, not great, but good. The red being the more flavorful, though hot, and the green being comparatively mild and bland. Margaritas were tasty, but verrrrrry weak. We went through the pitcher and wondered if they had much booze at all. I like the taste of tequila a lot, especially over margarita mix, but I could not taste any tequila in these. Then came the entrees, Chicken Enchiladas for her and Red Burro Enchilada style for me. I ate my food, as I will never leave something on my plate, but I was telling my girlfriend the whole time that it smelled like canned dog food. I didn't say this because I thought it was bad, or gross, but actually smelled identical to dog food. She agreed. I thought long and hard and today it came to me, it smelled like Pedigree brand. \n\nOverall it is a clean restaurant with great service, but unfortunately somewhat questionable food. I want to know what drugs people are on that makes them think this place has any type of quality. I'll probably go back and try something else, because it had a few things going for it, but the food is NOT one of them.\n\n+1 for cleanliness\n+1 for service\n-3 for food", "business_id": "hWhVP-28LYP3llaMlAJ_JA", "stars": 2, "date": "2008-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "eu4EDnp3n86L5LtZGrb2EA", "review_id": "t7Cst2yw6XPEKXbyVTXtEg", "text": "Rosita's Place is one of my favorite Mexican restaurant in the Valley. I usually get the same thing everywhere I go and base my judgement on that one item. I order the green chili burro enchilida style. Rosita's offering was so good that I sometimes crave it and drive from Scottsdale just to get one. The salsa is always hot, and sometimes hotter, but very good. Just make sure you have your water in front of you before you try it. Any time I have out of town visitors, this is the place I take them.", "business_id": "hWhVP-28LYP3llaMlAJ_JA", "stars": 5, "date": "2013-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lHv_dwgSxA0qA9YyLVc9rQ", "review_id": "pAC01GoYQgiHqP2kGyCHBg", "text": "Good was amazing as I had heard on here thanks guys. I got the chimichanga amazing in fact it was way to much I had to take the rest home. My girlfriend had ordered the menudo and she also thought it was very good just that they did not have any bread to go along with it. Now to the bad things as soon as I came in we had asked for a table the lady said to just sit there pointed and didn't bring any menus or even show us to our table. Our server granted she was slightly busy no more than a diner I think checked on us once. Overall 3 stars just because the front personel really did upset me", "business_id": "hWhVP-28LYP3llaMlAJ_JA", "stars": 3, "date": "2015-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "INevu6OWYEOI2q4zD3UCFA", "review_id": "w95_L-rizg0Knofaq-GPiw", "text": "I thought it was okay.\nMy food came really wrong.\nI really liked the chips.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 3, "date": "2010-11-02", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "jnMII2mt0V6AM4_oMECyIQ", "review_id": "PCYlrJyDTmHB97HDpDh3Rw", "text": "I'm ambivalent.\n\nOn one hand, I'm not in the camp of white and/or hipster guilt who will automatically give anything \"ethnic\" 5-stars, just because that's the cool thing to do. While Phoenix Ranch Market has very delicious food and a decent selection, it's still missing a lot to be a \"real\" mercado, or whatever.\n\nI'm also not in the other camp who complain excessively about \"authenticity\". I lived in Guanajuato for three years, so I know at least a tad about the real stuff. And this is an Americanized market -- there are no questions about this, or there shouldn't be, at least. But on the other hand, I don't care. It's nice. We're in America, so let's appease the whities.\n\nYeah, it's nice. I like this place. I usually always smile at some point in here, but I also frown from time to time. So, I'm ambivalent, but everybody should at least go sometime during the weekend to experience the beer cooler mariachi band and have a meal. I guess.", "business_id": "VXIkI9_EbDbYHeO9IzKjJg", "stars": 3, "date": "2008-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "e-GOQDdx_pPSi_dHJ87oKQ", "review_id": "MHLgoSSpGiKstTBv2gsHNw", "text": "I used to love Pro's but, being slightly out of my way, my trips became less and less often. Then I got a coupon flyer for the *new* Los Altos Ranch Market. I was like, \"$5 off a $25 purchase, SAY WHAAAT?\" Turns our Pro's had gone into bankruptcy and emerged under the joint ownership of a couple other Hispanic market chains. Fun facts but the coupon got me down there Saturday morning. \n\nSame old Ranch Market with shoes for sale up front, the assortment of prepared food, drink, and bakery items, and chicharones from bite size to mucho grande. I like their produce and meat selection but wish they carried salmon other than the frozen bags. Still, it was a good reminder of the shopping experiences I had before my current battles at my local Fry's and Basha's stores. I suggest we all commit to hitting Ranch Market a little more.", "business_id": "VXIkI9_EbDbYHeO9IzKjJg", "stars": 5, "date": "2014-09-15", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "HFzJb1EnBsB6fD5s-9fXUA", "review_id": "HbxndB3aYldV-zWdCv2adA", "text": "I actually liked the food here. The beef was flavorful and not dry at all and the chicken was good as well. \nThe waitress gave us some chips and salsa but I was surprised that they didn't bring over any Pico.  Ah well....\nThe horchata was pretty good so I would recommend that too.\n\nThe decor is pretty interesting. They have these super heavy chairs that are very uncomfortable so be prepared!\n\nI would have stayed longer and maybe ordered more food but there was a baby crying his little head off the whole time I was there and I had to get out of there.\n\nNext time I'll try some take out since I really enjoyed the food.", "business_id": "cgNIBHS2mLdbTRiodAT6EQ", "stars": 4, "date": "2011-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lRrkwHgmT_AMRJMIRHJMPw", "review_id": "nNCgM5BEkyAbXEf17FwJ4w", "text": "Delicious!!!! Get either the Red or Green chili burro Enchilada style.... and get some extra sauce too..... Most people seem to go after the green chili with red sauce.... I kind of liked the red chilli a little better... both spectacular!!", "business_id": "Xo9Im4LmIhQrzJcO4R3ZbA", "stars": 4, "date": "2009-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IqYAc0tPG4Z9yzTEcD7hnw", "review_id": "HEgzQ1ucKHmuOEl-xrJ83w", "text": "Red mixed enchilada style. Tacos with guac. Homemade tortillas. The best.\n\nI've been going here since '94, and nothing can beat their enchilada style. It is THAT good. If I'm feeling super hungry I will also order the tacos with guacamole.\n\nThis is one of those places that is hidden in a house, with an outdoor patio and no inside eating area, but the food is so good you don't mind standing in line outside in the 110 degree weather.\n\nI would give them 5 stars if it weren't for their limited and inconsistent hours, the occasional sign that says \"Not serving enchilada style due to personal reasons,\" and parking.\n\nBut...\n\nAnybody visiting Phoenix or living there who has not tried this place, is definitely missing out. It's a MUST check out regardless.", "business_id": "Xo9Im4LmIhQrzJcO4R3ZbA", "stars": 4, "date": "2014-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PLxGZk9YX91Vi89RX3n-NQ", "review_id": "0s05cdCalxogdtK1wKBijw", "text": "Been coming for years and they never disappoint!! Makes me feel like I'm back in Rocky Point at the fish market. Must try and they now accept cards, which is great for me since I never have cash!!", "business_id": "NYBx4sdSVrN-I5Q8RfLMPg", "stars": 5, "date": "2014-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p5jXjPeG-lh8lOwFioboZg", "review_id": "GuxqlR31Awqh1vgkkeeksA", "text": "The most amazing fish. I take all my colleagues in from out of town. Moriscos is an amazing \"hole in the wall\" secret. The fish smothered with plablano pepper is my favorite. An absolute winner.", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 4, "date": "2013-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "g1L5wLm34RdmGcZ5xk-Q3A", "review_id": "9KXhOmhfQMCvUZ6nQjHkfg", "text": "Definately my kind of place- Diamond in the rough... Fresh seafood... and cheap beer! The food was delicious! I can't wait to go back and try that giant seafood pot!", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 5, "date": "2014-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a5n9nSRnexze-5TjPZq8ZQ", "review_id": "Q49BwZxlTunFFCRR5WqFSw", "text": "Food very mediocre and service was very slow.\nAlthough only few tables were filled, took forever for drinks and food.  \nNice environment though.", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 1, "date": "2015-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QE_Swh76QFdzRQpYf2Jz3Q", "review_id": "dZVVrlGugT2kxo6KmJ9zYA", "text": "Incredibly disappointed in this place. After a few recommendations, we decided to try it for take out. We wanted a good variety of foods, so we ordered cheese enmoladas, a gordita, a chile relleno combo, a pastor burrito combo, chilaquiles verdes and a pambazo. All of this food for us to share and the best part of it was the salsa, which they happened to charge us for. \n\nThe cheese enmoladas were stuffed with a dry, flavorless shredded chicken. The gordita wasn't too horrible, but was definitely understuffed. The chile relleno seemed as if it was stuffed a few days prior. The cheese had a brownish color and was slimy with a gritty texture when rubbed between the fingers. The pastor burrito was very small, understuffed and was served on a cold tortilla. The tortilla was actually still ice cold on the bottom of the burrito by the time we got home, so the filling must have not been very hot either. \nChilaquiles verdes were a complete joke. It was seriously a handful of chips, a small spoonful of green salsa and a tiny sprinkling of cheese. It did come with some sort of a pollo asado on top, which is unique and it was flavorful, but it was very old and dry. It is served with just beans and some iceberg lettuce, but for $8, this is no bueno. Something also caused the bottom of the container to melt, so I had to transfer it to another plate, but I still found pieces of styrofoam in my food. The pambazo was flavorful and pretty decent. The filling (chorizo and potatoes) had some sort of a bitterness to it. I think maybe the potatoes or chorizo were burnt, but it was one of the better dishes. The combos were also served with rice and beans. The rice was old and hard. I'm certain that it had been out the entire day. The beans served on all of our dishes were entirely inedible. They had a really funky sour taste, so they were either spoiled or just plain bad. Either way, discarded all of them. The salsa that we were given and charged for was really great! It was a red salsa and tasted like it was homemade. \n\nWe did order 30 minutes prior to closing, so we figured that a lot of the issues were due to the late order, but the food was really unacceptable. If they didn't have quality food to serve or it was ready to be thrown out, just tell us that you're not longer taking orders. It really sucks to pay for something and then have to discard at least a 1/3 of it. After all of this, we would still try El Nopalito again because of people's recommendations, but only if someone else was paying. Not happy.", "business_id": "s87D-mtAuJ8BluKgYYsXGw", "stars": 1, "date": "2015-09-07", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "PcXydnyYdFVsZhSWeURezA", "review_id": "D8SXiwMPKvj2Tow9R5Wrqw", "text": "Unless you have a few hours of your life you don't mind wasting, DO NOT COME HERE! \n\nMy wife and a few friends decided to grab some happy hour food and beverages somewhere. when we arrived and sat down we asked about specials, the waiter replys with \"oh,  um.... $3 draft and wells\". we proceed to ask about food and margarita specials (that the sign behind us clearly states). he tells us \"no\". I then ask him \"Are you Sure? Because that sign over there says differently\". He then says \"i'll check\". \n\nI was right. \n\nstrike 1..\n\nAfter we order a drink we decided on some food. About \n15 minutes after we order a group of about 12 or 13 business type people walked in......Well i'm not really sure what happen after this point but everything seemed to go down hill really fast. \n\nOk..... so i then ask the bartender to change the tv station from CBS News to the football game. (we are the only ones in there besides a person at the bar and the business types in the other room). He does this about 20 minutes after i asked as he obviously forgot until he saw me staring at him. Not too big of a deal.\n\n25 minutes after ordering our appetizers we still have not seen our waiter or any sign of our food. He finally comes over to our table and says \"you're food will be out shortly, our cooks are slacking\" It's completely obvious to us that this guy forgot to put in our order. \n\nFinally our food arrives! It was brought out by another gentlemen who exclaimed \"Sorry about the wait folks, that big party over there (the business types) caught our cooks by suprise! \n\n1. We ordered long before they even came in. \n2. Your cooks got caught by surprise??!!!  So, they're not used to cooking when they go to work as a cook!\n\nThey got one order completely wrong. our friend who is a vegetarian, ordered the harvest sampler (the veggie sampler). They brought her the regular sampler consisting of beef chimi's burro's and other things. Now we have to wait another 20 minutes for her food. \n\nAfter comping her meal we received our check. We asked the waiter again if he can split it up 3 ways (we had told him we would be doing this prior to ordering) \"Sure, No problem he says\". He returns 10 mins later only to tell us he can't split the check and we'll have to \"figure it out\" \n\n My wife and the rest of our party except one, proceed to leave and wait for us outside while we \"figure out\" the check.  After deciding we would leave a poor and undeserved tip just to be nice, our waiter brings back our change.. no $1's. before we can open our mouth to remedy this he is gone. \n\nAt this point i'm tempted to walk out without leaving a tip but im a nice guy. So i stroll up to the bar to make change. The new bartender makes eye contact with me,  but doesn't say a word, turns around and proceeds to shuffle around the bar as he tries desperately to open a bottle of seagrams with no luck. After 5 minutes and not even a\" i'll be right with you\" or anything i walked out without leaving a tip. i have never done that before. EVER", "business_id": "jzPMl-NoB5F2fwoHX3hN8A", "stars": 1, "date": "2011-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jlCebZRU0TBFDpSv-VqRkQ", "review_id": "UgvzMsaBqRk1RN9fDeL68g", "text": "Repeat customer for 20+ years...today not so impressed with staff in bar...normally Greg or Joey upbeat very personable...today no bartender to be found (apparently their day off) one server in lounge too busy cleaning tables to even notice we sat for at least 5 minutes with no drinks or salsa while he continued to clean tables around us...decided to move to main restaurant where hostess didn't even care we were waiting and asked if we wanted her to tell her staff we were there lol ... sat with Gely in main restaurant thank her for making my almost horrible experience a plus....great service attentive!!!! Get rid of who is in your bar today!!!", "business_id": "jzPMl-NoB5F2fwoHX3hN8A", "stars": 4, "date": "2014-10-06", "type": "review"}
{"votes": {"funny": 4, "useful": 3, "cool": 3}, "user_id": "MphD7VDOEb1KTjIp-oFoMw", "review_id": "LzPlYHferU4I5R_O0_znZA", "text": "I am a super fan of Del Taco! This is the cheapest, yummiest place any time of day! Whenever my friend and I go traveling this is the place we miss the most. In Europe they dont have Mexican food (well they do kinda but for some reason there is no spice and it is all made of kidney beans and corn... yuck!) and the first thing we do when we get home is head to Del Taco for the comfort of their yummy, cheesy  Half Pound Bean and Cheese Burrito with Green Sauce for $.99 and the Chicken Spicy Jack Quesadilla for like $2.79 or something. When I went to visit friends on the other side of the country recently, they were talking about what they missed from back home and inevitably it was Mexican food... specifically Del Taco. I almost cried when I found out that Del Taco isnt national. I think I am addicted to the stuff because I just cant do without it. The best thing is that they are open like 24 hours a day. They have hot cinnamony Churros for $.99 too! If you are doing something like Weight Watchers too they have a regular Bean & Cheese Burrito that is like 6 point or something I think. I read it somewhere but you can check it out.\n\nEven so If I die from a Del Taco heart attack I will die happy!\n\nHey one more thing DEL TACO EMPLOYEES PLEASE BE CONSISTANT! The portions and flavors lately have been inconsistant. Thank you!", "business_id": "KIbFaBrZDX7rrYJInkv5Kg", "stars": 4, "date": "2008-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GMCchZHZT-5HXGu8kJJDoQ", "review_id": "Oi2zOI3uzGWiI3QjFFjhlQ", "text": "I originally gave this place 4 stars. In hindsight that may not have been appropriate and I'm downgrading it to 3 stars.\n\nI haven't been for a while now as the last time I went I had a tamale that was just not good.\n\nSo I have had not-so-good food there now and felt I should revise accordingly.\n\n3 stars is A-OK which I think is a fair rating for a place with such great prices and good service.", "business_id": "DeAnVirgOxQnI36V1W158A", "stars": 3, "date": "2010-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oFr73dze-adNYopKUpMWHQ", "review_id": "XeObZeyqVmv-S7OtbCCRWw", "text": "This is a great place to eat. The price is right! The margaritas are delicious. It isn't a big place inside. But the food is worth it if you ever have to wait. The staff is friendly as well.", "business_id": "DeAnVirgOxQnI36V1W158A", "stars": 5, "date": "2015-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5FOuFx8qYyA0JcXYB31lDQ", "review_id": "luvcfyon5cZlJHZihP8i6Q", "text": "Never rated a place this low before. Bad start... It was very slow and yet it took forever for our server to come to our table. The decor was a throwback to the 80's, and probably that was when it was done and never updated. The menus came with dried up food on mine. They eventually came and brought us typical chips and awful salsa. It was served in q maple syrup dispenser and had the consistency of tomato paste. You couldn't pour it so you had to remove the top and scoop it out with a spoon. It tasted a little like flavored tomato paste as well. When our server came by we asked for a drink menu and he pointed to his head, as if to say all we needed to do is ask and he would recite it to us from memory. We asked what is good here and he grinned and said \"margaritas\", to which we asked what kind. He began to recite flavored, and we said we wanted a top-shelf, he really didn't know what we were talking about so we ordered the non-flavored with salt on the rocks. It came out and was perhaps one of the most typical standard margarita mixed drinks with very little tequila. We mistakingly at that pint decided to stay and ordered a combination plate, split. They split it, but instead of splitting both items they gave my wife one and me one and only one set of utensils. He asked what kind of sauce, we said green but on the side. The green sauce came later when we were ready to leave. The food was really diner fare and while not awful, not something to write home about. We chose not to finish and instead took our check to the counter and paid with Apple Pay, which was the only redeeming part of the visit. We should have trusted our first instinct and left as soon as we walked in.", "business_id": "VlG9qxAc4d0em2djaU__xw", "stars": 1, "date": "2015-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NlAaJWIfcH4F9t5fRRYpzg", "review_id": "S-As_Ls_9Q1qqlC5uDGp1Q", "text": "Best Queso in town. Love burritos and the taco salad.", "business_id": "0K35eGvzVRZEirNo5v_WfA", "stars": 5, "date": "2015-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XUKvPp4NKWTeAxf1YqtCiA", "review_id": "AKnZnWaNXjLlzeJsY59KjQ", "text": "Awesome food. First time here so I can't guarantee all the items, but what I tried makes me think the menu is promising. Wow. Yum. And they have a daily special that's happy hour prices. Not to mention the awesome chips and dip (mild, hot hot, and spicy bean dip) that come out as soon as u sit. Yum!", "business_id": "ib-y5nsfn3unE0lLY1vfAw", "stars": 5, "date": "2012-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "b4C9E7vTJrOdkJQA86xYSg", "review_id": "WCNrLu5dy4aydSivOq82OQ", "text": "I really enjoyed myself here.  The atmosphere is really cool.  My girlfriend says the smell of the burning fireplace reminded her of Aspen... you could smell the wood burning when you pulled into the parking lot.  The service was excellent and the food was also very good.  We ate downstairs at the bar and chose a few things off the small plates section of the menu.  They also had a lot of fresh fish choices on the specials board.  I would definitely come back here again.", "business_id": "5kRug3bEienrpovtPRVVwg", "stars": 5, "date": "2007-10-09", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "jQcGFSO18cicLzCtjhvGBA", "review_id": "0_lIYtyHGe3kZwfkGxNnOQ", "text": "We visited rokerij Sunday in their downstairs bar. We always love going in for their happy hour! Great small plates for $5 each between 3pm and 6pm. \nWe learned that they have half off bottles of wine sun, mon, and tues! \nThe food and service is always great.\nHowever, we were sad to hear that they are not doing the reverse happy hour late night that we frequent to often. Where are we going to go now? Anyone have suggestions for a new late night happy hour with great food?", "business_id": "5kRug3bEienrpovtPRVVwg", "stars": 4, "date": "2009-10-05", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "i8DseVjz5ypByMh3ZfxEFA", "review_id": "8CfuybY7vQYJcGFWNP-QTQ", "text": "I used to go to Richardson's religiously before the great fire of July/2009. Thanks to the tragic loss of my original introduction to the holy trinity, I slid into The Rokerij one evening in search of my \"last supper appetizer\" THE Garlic Plate. \n\n Favorite dish in the valley, hands down. \n\n The hole downstairs makeshifts for a great date night venue, in thanks to the lack of cellular service. You can keep your partner's attention solely on you for the duration of your meal/bottle of wine/conversation...\n\n I always fail to remember the after effects of said Garlic Plate. Your body will betray you, your stomach will take over and your boyfriend will be disgusted by you sleeping ever so close...\n I highly suggest at least a 12 hour separation from all loved ones if you plan on them wanting to hug you ever again...\n\n This meal is well worth the awkward night following, in fact I think I want some again tomorrow...", "business_id": "5kRug3bEienrpovtPRVVwg", "stars": 5, "date": "2010-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9VRz5DuDdOH2h4at-G_65g", "review_id": "OIEX4s8aAE6fGlQzCLL44Q", "text": "Truly awesome experience. I went there with my family around a year ago and it was definitely a fulfilling night. I recommend the pork chops. It was the only place in 15 years of dining with him that my great uncle enjoyed and actually gave a praise to the food and service. Believe me, that is huge!!!", "business_id": "5kRug3bEienrpovtPRVVwg", "stars": 5, "date": "2012-09-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "45V7-1r79DEG0HbuaKYIlg", "review_id": "G5o5ezlgOBv16RGBeaYg1w", "text": "I've adored the downstairs bar and fireplace here for years - and had always been happy with the food and service. Somehow, the place fell out of rotation and off my radar for years.\nUntil last week - when I was invited to join a small group for reverse happy hour.\n$5 wine, draft, marg. \n$5 small plates.\nAnd all well worth it!\n\nBetween the four of us, we ordered:\n2 orders of prime rib sliders\n1 order carne adovada sliders\n2 order shrimp piri piri\n2 orders smoked salmon\n1 order grilled oysters\n1 order rokerij oysters\n\nAnd it was WAY too much! Lots of food went home with us.\n\nThe shrimp piri piri with toast points was amazing - will definitely be ordering it again.\nThe carne adovada sliders were the highlight of the night. GREAT flavor!\nThe prime rib sliders were okay - but as others have pointed out - quite skimpy.\nThe salmon was tasty - but we would have been fine with one order instead of 2.\nGrilled oysters were OK. I got spoiled with grilled oysters in New Orleans - these didn't come close.\nRokerij oysters were fantastic and will be ordered again, for sure.\n\nHappily - there's lots on the menu we didn't get to. Which means a great excuse to go back. Soon, and most likely often.\n\nFor me, the best part is the 10pm to close happy hour - even on Sunday. Not too many people going out for food and drink at 10 on a Sunday - gives me a guarantee of a spot at the bar and stellar service.\n\nWIN!", "business_id": "5kRug3bEienrpovtPRVVwg", "stars": 4, "date": "2013-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "FMpINhPJSBmyiiA58uEung", "review_id": "5oC4zz8CsCyq8lpP7rFh4g", "text": "Went here with a friend the other night. Decided to sit in the dining room because I haven't seen it before. Someone brought us waters but no one greeted us for at least 5 minutes, so we decided to move down to the bar downstairs. It was only a couple minutes before happy hour ended and the bartender threw in some food and drinks for us which we were delighted by. But the rest of the visit was less than pleasing. Both of the bartenders were detached and not warm, or welcoming. I honestly felt like we were a burden (although there were only three other people at the bar) it felt like we were getting the cold shoulder. The guy bartender did not smile once. Let alone make eye contact.\nFOOD: the oysters were more disappointing. They were not shucked whatsoever and they were too large, and did not taste fresh. I let them know and they were taken from me but without apology or any action taken to remedy the situation besides taking half of the order off of the bill. \nNeedless to say we decided not to order anything else, the uncomfortable visit went on long enough. \nI'm extremely disheartened by this and when before I would recommend this place to friends, I will not be returning and I will not subject others to this.", "business_id": "5kRug3bEienrpovtPRVVwg", "stars": 1, "date": "2014-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DNXdO9-uDc9PKNXTICIZWw", "review_id": "eye5J23KHaExl7BUbRGUsg", "text": "Occasionally I have a craving for greasy Mexican food from one of those cheap joints all over town. Even though Filiberto's is less than a mile from me, I go the 3.5 miles to Greenway and the 51 and get two or three ground beef tacos and an order of chips with cheese and salsa, which is HUGE.\n\nFortunately I don't do this very often or I'd be as big as a house. It's certainly not gourmet Mexican but it's good and cheap and beats the shit out of Taco Hell, and sometimes that's all you need.", "business_id": "syxUZu1GrJv0LYnV38hMug", "stars": 3, "date": "2008-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "aerUnfhmnNYiazVrK5jcaQ", "review_id": "xK6lBo6Y2W9bMJVC3VROHA", "text": "I have an emotional connection to this restaurant so I may be a little biased. This is the Mexican fast food that my parents would take me to when I was younger...whatever but I LOVE ARMANDO'S. Armando is always reliable on a late night or really, any time at all. I haven't had a majority of the menu, but for basics like the bean and cheese, chips with cheese and guac, rolled tacos with cheese and guac are delicious when you're craving such things. I also absolutely love their veggie burrito (without lettuce) and the Armando's breakfast burrito. Sometimes it can be hit or miss, usually involving too much unmelted cheese, but I can't help but love it. I will always root for Armando's over any other late night Mexican. Even when I lived in Tempe I would drive out to Armando's. My friends agree that it is the best amongst the Mexican fast food. I've never had a problem with service, even over the 4324328940 times i've been there. They always give plenty of napkins and sauces which is always necessary when eating Armando's. Go there! Don't let the Fili B's in the same complex defeat Armando's!!!!!!", "business_id": "JobP0ghILdh8S8l-LhHHxQ", "stars": 4, "date": "2011-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1lSFhUewKa22FwhXuVgFdw", "review_id": "zu74QAL8uMenJhspbxAihQ", "text": "Really have nothing but good things to say about this Rubio's or any for that matter. Their burritos are probably my favorite in the \"fast casual\" scene, especially the \"Burrito especial\" (with chicken) for me. They changed the recipe a year or so ago so I ask for it to be done the with the old recipe and with avocado instead of guacamole. Service is quick, quality is good (I've never gotten sick after eating anything there). They have a huge menu for those who are picky eaters and a large self serve salsa bar. I wish the salsa was a bit chunkier but I really can't complain otherwise. Only wish there were more Rubio's locations to be honest.", "business_id": "edjCywtqffQ8__vM7POZbw", "stars": 4, "date": "2015-11-08", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 0}, "user_id": "ofEx4LotDyaxIjWB9zbQiQ", "review_id": "2qSNz40CjEeKP5T9fqwW9g", "text": "This location sucks. Didn't know you could desecrate chipotles perfection but you can. They run out of super basic things every time I'm there and just expect you to deal with it not even try to provide more or hustle. Last time I came in at a very normal dinner hour and they ran out of steak and the employee said to just order something else? Da fuq? \n\nThey run out of chips ON THE REG which I didn't know was possible. There will be 6 or more employees standing around doing nothing. Also the employees are pretty sassy 85 percent of the time (eye rolls etc). Like I get it, customer service is rough at times but chill out.", "business_id": "K2_Hmmo5crTYWiT_1sWnfQ", "stars": 1, "date": "2014-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "B3oCDlO3uBUrFQu-xmr6uQ", "review_id": "6p1EfqmR_4qDESs_v6FEHA", "text": "Adobado burrito. Five bucks. Open 24 hours. 'Nuff said!", "business_id": "wdEnI9WTLHiqSCH1RdJ40w", "stars": 4, "date": "2011-10-09", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 1}, "user_id": "sWtIduPNp6MtUPrGnDcb8Q", "review_id": "hjQ2QCk3cYkiBB3G58zoeQ", "text": "My review is purely based on nostalgia. Don Jose is the first restaurant I ever remember coming to. That was over 20 years ago. My dad used to go to the old original location at who knows where... So, to say that I know it well and it knows me is an understatement. The nice family who ran it knew our orders by heart and we came about once/week for many years. Imagine my upset to find out it was closing back in 2009. I wanted to have a cry. Even though my dedication had faltered in the past few years since I started college, I was still heartbroken that the old reliable Don Jose would not be there. \n\nIn the two years that it was not open, I mourned and craved my cheese enchilada staple, along with my beans and a cheese crisp covered in hatch chiles... Of course, we covered everything in their simple yet amazing garlic-induced red salsa that has a certain jenesequa about it. When I heard they were opening up under a new owner but with the same menus, I teetered. What if it wasn't the same? What would I do then?!?! My heart would fall to the floor and my childhood restaurant ruined... I went for it. \n\nI ordered the same thing I have ordered for over 20 years: Two cheese enchiladas and a side of beans. They tasted... THE SAME! Delicious and simple! Awesome! The salsa? ALMOST the same. There was something different that I couldn't put my finger on. I would almost say they may just use a different brand of tomato sauce, that's how slight it is... And that shows how many gallons of the stuff I've consumed in my lifetime. Well, adieu old Don Jose owners and hola to the new! Thanks for bringing it back and letting me continue the enjoyment in the same old booths I've sat in for years. (But seriously... can't ya'll give those a little more cushion at some point? I was sinking last time.)", "business_id": "uevPN8zwJpBpnxRur1jUhw", "stars": 4, "date": "2011-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0LWtyha0aMRothLwrzsnGQ", "review_id": "6L_7qP5mfUvqj0DVWIDUpQ", "text": "Used to go here a lot with the fam when I was younger, not sure why we stopped. Anyway, went this week for lunch. It was just as good as I remembered. Nachos are super cheesy, great amount of shredded beef too. They are a meal all by themselves. They still have my favorite dish- pollo fundido. Chicken chimis, covered in jalapeno cream cheese, and topped with melted cheese. That's one thing about this place, they are not shy with the cheese, which to me, is OK. Waiter staff was great, very attentive with drink refills. I will have to go here more often.", "business_id": "ieYiA4L5gk7S3kZYK0l_dg", "stars": 4, "date": "2012-09-07", "type": "review"}
{"votes": {"funny": 10, "useful": 5, "cool": 5}, "user_id": "sALB8-F04S9VcZMF_GkGUA", "review_id": "l_-7ajTMmiMkDhVt5umCZg", "text": "Aunt Chilada.. You bad señorita.. Here's your grade.. No bueno.. You get an F.. I drove all the way from my hood to go & visit you across town.. You treated me like a step niece that you hated ! \nDrink order took forever.. & was wrong.. No H2o.. Despite 3 , yes 3requests.. Order was wrong., took a bazillion million minutes to get.. And the waitress was not a happy girl.. Nope, Aunt Chilada she was not.. And your chips were stale too.. The cheese on top\nthe taco came when of all things I finally get to pay my debt to you for bad service and nibbles.. And then she forgot the credit card.. What the heck, Tia.. Was she getting her nibbles & snack on across the way with my card.. ?? Well.. Sorry , but you let me down..& it'll be a long time before I visit your casa again...", "business_id": "G9LwkTSdKOyOGqd5BbuIkA", "stars": 1, "date": "2009-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wDAAn0HlnuZQnfga6CVIKQ", "review_id": "vDLsfvLohSRT_Ojmk37Yug", "text": "The food was good but not spectacular. The atmosphere and service was great. I love the bocce ball court is great. Fun to play while enjoying a cervesa. I'm very willing to give this place a 2nd chance.", "business_id": "G9LwkTSdKOyOGqd5BbuIkA", "stars": 3, "date": "2012-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z_r-2KmJBu3anSI8PM3oag", "review_id": "nDQxCnKI84LZtE42tEA7Kg", "text": "I actually ate at Aunt Chilada's twice yesterday and have eaten there quite often over the last year.  Lunch was good with both the food and the service being done right.  Went back last night because it was a beautiful night and we wanted to sit on the patio.  Initially the hostess was not very accommodating but reversed track and sat us on the patio.  Chips and a bottle of water showed up pretty quickly but unfortunately no glasses.  We sat there for about 10 minutes without seeing anyone else.  I have been in the food service business for years so I am pretty forgiving so this was not a big deal.  What was a big deal was that they were apparently having a function for a girls softball team and while the parents were inside their girls were on the patio \"playing\".  12 - 14 of them yelling and screaming and running around.  While they do have a bocce court on the patio, its not a playground although this was not the first time we have seen children using it as such.  It was the first time there were so many and so loud.  Had we been served a little faster it might not have been so annoying but with nothing to do but sit there and listen to all the noise we decided to leave.  As we got up the waiter hurried over and asked if everything was OK.  We explained we had come for dinner and the noise was too much.  To his credit he asked if he could give us a gift certificate which was nice but didn't mean much as we had made a special trip to enjoy a nice dinner at a nice restaurant.  If we wanted to be around of obnoxious kids on a playground we would have chosen Chucky Cheese or Peter Piper.  Probably won't be returning any time soon as it is a drive for us and not knowing what to expect (nice restaurant or kids day out) its probably not worth the effort.\n\nIn regards to the girls softball team, the parents of the Hotshots should be ashamed of themselves.  I coached travel ball for 15 years from 10U through 18 Gold.  My daughter is a coach for one of the premier high school programs here in AZ.  Never would one of my teams been this obnoxious and rude.  The Hotshots have been around a long time and have been a premier program in AZ for a long time.  If any of the people who are running this program happen to read this, you may want to tell your coaches that as long as your team is wearing its name on their shirts they should act with some class.  When my daughters played in college, the first thing they were told was you represent the school in all you do.  We told our players the same thing and that is why all of my seniors received scholarships to play at the collegiate level.  They could play and they were respectful and had class.  There is more to being an athlete than just what happens on the field.  This team was an embarrassment to your program.", "business_id": "G9LwkTSdKOyOGqd5BbuIkA", "stars": 1, "date": "2015-09-18", "type": "review"}
{"votes": {"funny": 4, "useful": 7, "cool": 5}, "user_id": "m7vtKWpZ9wdEQ95wJxrMrg", "review_id": "x6N0u-sligIYKtVRZSD_ZQ", "text": "Though this place truly looks like a dive, I had high expectations - for the food, at least - because of a glowing review I read in one of the local journals. The place looks a tad decrepit and while the tables look clean, their surfaces did have a bit of a sticky feel to them. On one occasion I had the huaracha recommended by the review I read. It was a generous portion of food and it tasted good, though it was a bit on the dry side. On a second visit, this time with my friend Rand R., I ordered a variety of street tacos - al pastor, carne asada, carnitas, and chorizo. They were very good, especially when you add the salsa offered on the side. The horchata I ordered with the tacos was good and was the perfect  accompaniment fo the tacos. In all, my dining experiences here were A-OK, though I'd rather go to Tacos Atoyac for similarly-priced  but higher-quality food ... and tables with a cleaner feel.", "business_id": "PxUQyOAdK8c3P_WnrXuCUg", "stars": 3, "date": "2012-10-29", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "JXOHPEGA3tg7udPFQm81Pg", "review_id": "NxKPf_GS5XXZbwI2JhbaIg", "text": "Authentic!!! 150 %! The entire staff is wonderfully accommodating and nice! They did everything to make sure we were comfortable and had all we needed to take out. The prices are awesome and the food is mouth-watering. I've been going here for years and it only seems to get better!", "business_id": "flUKBy7WHqYdfOrwU1A2SA", "stars": 5, "date": "2014-09-18", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "KvWny9qUZJKrqo_LYesgSg", "review_id": "DCD4edMU8L-7kNb4X4_Usg", "text": "Can you really go wrong with a bean burrito? I love them here.  They are cheap which makes it even better.  Their hard taco supreme and enchritos are also the bomb.  Obviously I cannot eat here everyday or I'd be the size of a blimp - so this place is for when I am feeling super lazy and do not want to cook - or as a late night, I've been out too long kind of meal.", "business_id": "4XJ8gO6cbS6PuZ9dzPsrBg", "stars": 4, "date": "2013-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pwjiI6wvbiD_ZXUX2yrxMg", "review_id": "LqtWdxlkx6OP5eeokGbQdA", "text": "They used to have some awesome Tortas on the menu but they sometimes have the bread if you ask they can make them.  I really like the fish tacos omnomnom", "business_id": "Yb2pNCxYR32XKmpirqJqeQ", "stars": 5, "date": "2013-11-08", "type": "review"}
{"votes": {"funny": 3, "useful": 0, "cool": 1}, "user_id": "kDJ9PRlYugp5RIa9ontPZg", "review_id": "pev3DBMWuDjdDjebJV7x2w", "text": "Home of the incredible exploding burrito. This place is awesome if you want to wear your food. Actually, that might be better than eating it. :(", "business_id": "DlLduXXSwjkm7OL4Z1iH1A", "stars": 1, "date": "2009-11-05", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 0}, "user_id": "cTaAK6N4REWVu_ruCQLHfg", "review_id": "ArRujkVfTujlcQWU9LJ9eA", "text": "I am typically a pretty understanding customer and realize that with anything mistakes on orders can happen.  Last night I placed a take out order and ordered the super nachos and only wanted beans cheese and sour cream.  I have gotten this order once a week for the last month and never and I do mean never have they ever put green chillis in the cheese.  \n\nAfter getting home last night when I found that the order had the chillis I asked them to correct it.  The cashier was accomadating but the owner was very rude to my wife and I and lied to ou faces saying that is what they always do.  I informed him of how often we come to his business and he still did not show any concern for us. I WILL NOT BE RETURNING their and they lost a customer for life.", "business_id": "oqZPXoenkQvAKQJ2pDCo0A", "stars": 1, "date": "2012-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NikC1IPnWn5JU0cDuT91EA", "review_id": "02HiXK8dbaBCPf1fGy4eMA", "text": "I always come to Rubio's for Taco Tuesday. The service is always friendly with a smile and super polite! The restaurant is always kept clean and the salsa bar stocked. Keep it up you guys rock!", "business_id": "iOITnizWLD3NlKxRtZd5AA", "stars": 5, "date": "2013-10-09", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "3PleJJEDyGLIWqaW7JlTyQ", "review_id": "0oVhChfxFuIhljbWzoAUhw", "text": "We drove by this place forever and kept saying, hmmm, wonder if it is any good...it is! We love the steak burrito and the Jamaica is sooo good. Haven't had a burrito I haven't liked yet, only wish they had some indoor seating.\n\nMucho Bueño!", "business_id": "1cGZU2gDewDfEu-bBMZEgQ", "stars": 4, "date": "2009-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wacvaRaYdk8iH-mDOS_OIw", "review_id": "4U5TRRQG4p4tAAU2-AtrtA", "text": "We've been to a closer La Parrilla Suiza before, so when it turned out that we could get diner miles by going to this one, we thought we'd try it, even though it's much further out.\n\nMaybe they had an off night, but I had some serious issues with hygiene! I'm not usually too fussy on this kind of thing, but the tables were dirty, there was old crud and new food stuck all over the table and in the grout lines of the tiled table, the floors had clearly not been cleaned in a while (food from previous diners was still all over the floor) and the toilets were in a terrible state of disrepair!\n\nOne toilet was completely blocked, another was covered in excrement and the sink wall had some kind of damage too, like a chunk off the wall missing. There was water/pee and toilet paper all over the floor too!\n\nWhen my daughter and I returned from the restroom, we told the waiter what state the ladies was in and he somewhat grunted in acknowledgement, but when my daughter needed to go again before leaving, nothing had changed.\n\nThe food was ok, but to be honest, I had a hard time enjoying it.\n\nWe won't be returning!", "business_id": "WxpCYziMlEy8mrEa_VcB1w", "stars": 2, "date": "2012-11-25", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "lOXdWY60YDqvqKWrNKkEYA", "review_id": "3HyQEjAWOfi4dGre65QIOw", "text": "Thank God there were some Mesa firemen standing outside this place when I pulled up as my wife was very uneasy about exiting our car and heading in.  Even trying to explain how fellow Yelpers loved it, did not ease her fears.  After a unanimous \"Defnitely, it's awesome!\" amongst the three battlers of the flame in response to my \"Is this place worth going to?\", we parked the car and walked on in.  This place is a definite hole in the wall (read: DUMP) and I/we LOVED it!  Great chicken tacos, awesome machaca (shredded beef) burros, delicious chorizo and the tamales were equally spectacular (homemade of course).  It's located in a somewhat dicey area of Phoenix, due west of the airport, but it's totally worth going to.  It has become my new \"first stop\" after I get off the plane at Sky Harbor.....unless I land too late at night....", "business_id": "d52zg-S0o940WUCK-nNiKw", "stars": 5, "date": "2010-10-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "ltGh04bjEBhwItWVVG7UJg", "review_id": "nLhIAJnH2EMIQqbV5tl7xQ", "text": "I succumbed to peer pressure!\n\nDon't you hate it when you don't trust your own instincts?  OK, so Yelp is a great resource and so are friends' recommendations.  But when it comes right down to it, it's all a matter of opinion.  When it comes to Carolina's Mexican Food, mine differs from most.\n\nI've mentioned in other reviews that I love the idea of a mom-n-pop place where local owners are doing their own thing, contributing to the local economy with jobs and paying their taxes.  Plus, this place makes their own tortilla shells. so that's a nice touch.\n\nThe food isn't especially memorable.  The machaca or chicken tacos are appropriately sized overall, but contain mostly just iceburg.  See for yourself with the posted pics.  The chicken was flavorless, but the machaca was a bit easier to discern.  Also, the size of the cheese quesadilla was fine, though proportionately had little cheese.\n\nIn the interest of safety, I would NOT recommend coming here at night alone.  If you must, be sure you're with a group of people and at least one or two of you have sobered after a night of drinking.  This place is OK for taking care of the munchies.  Just be sure you're careful to be safe in this less-than-stellar neighborhood.", "business_id": "d52zg-S0o940WUCK-nNiKw", "stars": 2, "date": "2011-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xLWS4QNwWYtRN8-KGotkkg", "review_id": "Ud0DWUm8w-WIhci_HFABcg", "text": "My favorite Mexican food! I always order  a machaca potato and extra cheese burro. The cheese quesadillas and tortillas are delicious too. I like to wash it down with some of their horchata. I am not a fan of eating at the restaurant as it's a little ghetto but it is very clean. I recommend calling in the order since it gets really busy sometimes.", "business_id": "d52zg-S0o940WUCK-nNiKw", "stars": 5, "date": "2013-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nehuAYnof0VLiGpePKI8zg", "review_id": "JXQZ9idd1iUhrKzWV70ElQ", "text": "Wow the food is good but the service stinks! The line is huge you would think they could figure a way to speed things up. I don't think it is worth the wait and definitely good luck trying to make it back before your lunch hour is over.", "business_id": "d52zg-S0o940WUCK-nNiKw", "stars": 1, "date": "2014-10-09", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "81XdrCUIhrQZempyhXoSmQ", "review_id": "TtZUWI4RMRkBNCGtcjnDow", "text": "Best tortillas ever. I'm from California and my boyfriend took me here because it's his favorite Mexican place. The tortilla is phenomenal and thin but also has flavor to it.  I'm not the biggest tortilla fan but this one I ate all of it haha\n\nI got a red machaca and it was really juicy and delicious.  I haven't had better tasting/juicer meat in California.  It's also really cheap.\n\nTry the butter tortilla but stay away from the horchata.", "business_id": "d52zg-S0o940WUCK-nNiKw", "stars": 5, "date": "2015-11-25", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 3}, "user_id": "jopndPrv-H5KW2CfScnw9A", "review_id": "fEQQwkGUJ3E3T1t3tYDoMQ", "text": "I will admit Mims serves up some seriously good food BUT the place is really small and super ghetto. You have to walk through a screen door then open the front door to get in like your walking into someones house( in the ghetto of course). When you get in its hotter inside than it is outside and it does NOT smell good. I walked into the bigger room on the side where the the games are and it smelled like a cat was living back there! I ordered a chili dog and french fries with an iced tea. They put real shredded cheese on the chili dog not the artificial cheese and the french fries were crispy and tasted great with ranch. The food makes up for the poopy atmosphere and if you eat here make sure you place your order to go.", "business_id": "-b_VjHZmA7-8LVWp6z36VA", "stars": 4, "date": "2009-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-SvLqaZ_VW12Gnf8kHFHOA", "review_id": "wL4MwrrJ8beGQX7qbs-hmQ", "text": "had the super coctel..very fresh!!", "business_id": "Bv3g-9R5wUevZPP0jzihqg", "stars": 4, "date": "2012-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "79LOudEmAcxSYVA1SF5Ayg", "review_id": "6IVMZbchOwHFMI5sCu7F2A", "text": "Went there with a group of about 8 people.  I ordered a 'big' margarita...which actually wasn't bad.  The food on the menu looked good, but I was not a fan of the chips and salsa.  I know most people rave about it...but the whole squeeze bottle salsa was actually too thin for me.  I like my salsa chunky so that I can dig in with my chips.  Anyways, I ordered the my food and was happy with it.  It was very good.  Probably worth 4 stars in my book, but since I only gave this restaurant 3 stars your probably wondering why only 3 of you just said it's worth 4 stars.  Well the reason I knocked it down was because of the service.  Just not very good at all.  Our service seemed irritated everytime we asked for anything.  She only came to check on us 1 time during the whole meal.  We had to get up ourselves and go to the kitchen to get a side of sour cream and our own napkins.  I'll try them again to see if maybe she was just the bad apple of the bunch.", "business_id": "14NSxaXBNspIVnsrMYJZVw", "stars": 3, "date": "2008-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pLqShiJgOHliS_T1OCRvvQ", "review_id": "NqK0Q_BkeB6lYTtVE9wV3w", "text": "I have been eating at this restaurant my whole life.  If you're love authentic Mexican food, then you must try them, they are worth the drive.  The food is delicious, the prices are great!", "business_id": "14NSxaXBNspIVnsrMYJZVw", "stars": 5, "date": "2014-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "MWt24-6bfv_OHLKhwMQ0Tw", "review_id": "1yc0bgMQby-hWEUw8IE5Rg", "text": "This Macayo's is just like every other Macayo's except they have the slowest service in the world.\n\nStandard chain Mexican food. I normally get the California burrito and an Iced tea. Nothing overly spectacular. Actually, the chips and salsa are really good.\n\nDo not come here if you are in a rush because you will be anxiously shifting in your seat waiting for your check at the end of your meal.", "business_id": "aACW1qAdOfgcU8yX61dOFw", "stars": 3, "date": "2008-11-09", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "weYT-xJwz8o7mLNWIhD6HA", "review_id": "ORz4Zaa5493Gg5C-AaF9dg", "text": "Despite the crappy reviews, I have to say I'm a fan of this place!\n\nMet a co-worker here for happy hour (which is M-F 3-7p), and was pleasantly surprised by the decent service, cheap drinks ($3.25 mixed well and even less for huge draft beers that the hubby was drinking), and 1/2 price appetizers.  We ordered 2 apps, the Firecracker Stuffed Jalapenos (YUM) and the chicken quesadilla (double YUM).  Perhaps we were just really hungry, but at like $4 each they were awesome!!!\n\nAlso, their salsa is no joke.  It's tasty and spicy, just how I like it.  I only wish they had stopped bringing us the \"bottomless chips\" because I just kept eating that salsa all night.  I would say that their salsa would be on my top 10 list...  Hmm, speaking of a list...\n\nAnyway, if you're in the area and are looking for a good, cheap happy hour, give this place a chance.", "business_id": "fsxBliRs4rwxRXkZUVy62A", "stars": 4, "date": "2009-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GoDjpEPTyUQoQVRwPljIgw", "review_id": "KvkL7xjM5qS-TYZ_yGb7NA", "text": "The happy hour here is usually the only time we're here, but a family member wanted to eat here the other day and we said \"sure!\"  Our service in the bar is  very quick and efficient, but it wasn't that way when we came with a group of 8 and sat in the dining room.  I think the server was pretty new and he might have been double sat so he was running around like a chicken with his head cut off.  The fajitas don't come with as much meat, or veggies for that matter, than other Mexican restaurants we frequent, but there is an abundance of side items that come with them.  We really liked the nachos as an appetizer because each chip is loaded with beans.", "business_id": "fsxBliRs4rwxRXkZUVy62A", "stars": 3, "date": "2015-11-29", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "AdpQcQcRVNZdG_17p4V45Q", "review_id": "Q2FBu91XyDqurpWnjd6BRQ", "text": "Thought was supposed to be HOT, but was'nt more like tooo sweet!!!\nI got the Fireman carnita burrito really was disappointed so far Arizona's Mexican foods is way to BLAND and wife has'nt found any she likes!!!\nThe girl that took my order was nice and polite and the carnita meat tasted good but that's all !!! my 2 star rating is on the high side!!!", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 2, "date": "2010-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "N1fNcF4MKBzRzDrwOpimmw", "review_id": "ZYNx8TWiQx-uE4NyeC95jg", "text": "Like everyone else, I saw it on DDD. \n\nI love good mexican food, and this was GOOD. I was really curious about their carnitas that they cook with sweetened condensed milk (or maybe it's evaporated) and I was surprised how tender and flavorful they were. \n\nThe carne asada was super good. I don't know what it was marinated in, but it seemed to have way more flavor than I am used to in carne asada, and I mean that in a good way. I loved it. I loved it more than the carnitas that I was looking forward to! \n\nTheir horchata is also really good. Rich and creamy with visible spices. Definitely not the typical fountain drink style horchata. \n\nI would go back in a heartbeat and look forward to returning to Phoenix to do so =)", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 5, "date": "2010-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vGN1K0izhh1fzCSQAIJnWw", "review_id": "nBNudL7vz4Vyqc8cHxHJ3g", "text": "One of the best MX food restaurants I have been to! I am a regular.", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 5, "date": "2012-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "mf76vzICSeyjs63ZSGcgDA", "review_id": "ZVAKDabtMqC2oXYNvVqL9w", "text": "YUM! Best place I've found so far in phoenix.\n\nThis place packs flavor into their tacos. I went with my boyfriend last night and ordered the chicken street tacos. He got tacos al pastor. Both were so frikin good. My mouth was watering. And the green and red sauce they give you really take things to the next level. The tacos are pretty small so my boyfriend had to order some more food to fill him up and he got one of his personal favorites, tamales. He said they were some of the best he ever had. The prices are great too. Very inexpensive for such good quality.\n\nWe moved here two weeks ago and this is the one of two places that we have loved. Other places we have tried out lack flavor and seem to love to pile on the cheese and sour cream to make up for it. \n\nWriting this review is making me relive the joy of eating there I might just go back tonight!", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 5, "date": "2014-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PwF9xD_Ahz4KmvN9y1L-CA", "review_id": "v9h-g5f_2DoUj2VpnEg62w", "text": "I love this place, it's one of my favorite Diner Drive In and Dives, and I enjoy stopping anytime I get a chance and am going through the Phoenix area.  The restaurant area has expanded, and it looked cleaner and nicer than ever.  They are doing well.  I normally order the triple taco place with rice and beans, and it never fails to amaze me - the flavors in the meats are cooked in just perfectly.  I had a combo this time of chicken, carne asada, and carnitas - all excellent with the absolute right amount of spice.  Perfectly flavored rice, and just the right amount of cheese in the beans.  There were no tables outside like there have been in the past, and we had our dog with us, so they had no problem letting us taking a table outside, and we put it back when we were done!!  This is the perfect along the freeway fast and delicious stand-by!", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 5, "date": "2015-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "7bdCfESkLLta4vwxO5tyHw", "review_id": "eIJhKNDKF7UYE3HB4qG-8A", "text": "The remodel is so nice, really digging the modern look. \n\nBeen coming for breakfast burritos, and they have not let me down! A little pricey for a breakfast burrito, but very good and worth it. \n\nWait is also a little frustrating, but again, the burrito is very good.", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 4, "date": "2015-11-03", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 5}, "user_id": "MnDHJvePh4cWMrBgOp0_Ig", "review_id": "XPr3gAvg_172wGmJ6O6UgQ", "text": "This is my new favorite spot. So glad it is close to me. I was at another location for the first time the night before and liked it so much I decided to come to this location of lunch the next day.\nI must have just missed the lunch rush because the place was pretty much empty. Which made me wonder for a second if there was something wrong with this location. Where were all the people? I thought it would be packed with people. Not that I am complaining because I was able to get right up to the counter and order and get back to work pretty quickly. There is nothing wrong with this location because the food was fantastic. So was the service.\nThis time I got the Langostino Lobster Burrito. I have never had lobster in burrito before and wondered how it would taste. But I was told it was very good and sure enough it was fantastic. I think I like the Original Fish Tacos a little more but this was good. I could eat 4 of there tacos even though 2 do a good job of filling you up. It is one of those things that is so good you don't want to stop eating even though you are full.\nI will definitely be back again and again and again and again. So good and cheap too.", "business_id": "N7oUi6aM01UlvrsIcTSqmg", "stars": 5, "date": "2013-11-08", "type": "review"}
