{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "dnimMmZEGiDOVLBDMHIb_w", "review_id": "ar3l_79EpoX5GnwbcxzDEg", "text": "I'm a serious amateur photographer. Their prices seem middle of the road and they keep a lot of the higher end stuff in stock. \n\nThe staff are all knowledgeable and usually fully answer my questions. I've learned a lot there.", "business_id": "GiElN3AF8N4ZpfH6PNRjdg", "stars": 4, "date": "2008-11-07", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "bKKVpwp1ERdWUl4lqc8ChA", "review_id": "TK4cex-2VBmq4lzUz7WS4Q", "text": "BEST croissants I had in Arizona ! \nOwners are very nice and friendly. I didn't try much more but it is worth a stop just for that !", "business_id": "wftoNIA0Q8nX-Da47psBCA", "stars": 5, "date": "2012-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uSK-dcA9RES5xzo3Z58iJw", "review_id": "bNT0n6_3Ilahdat07gnOrA", "text": "The turkey was one of the best sandwiches I've had on a long time!\n\nI ordered the hot turkey, mozzarella and cranberry sandwich online and picked it up. The 6-inch was plenty for a decent lunch. The order was ready prompty, the online checkout system was simple, and I was able to pay in cash when I got to the cafe instead of paying with a credit card online when I didn't know if my sandwich would be ready or not.\n\nConsidering Croque is in the same shopping center as some (not-so-great but cheap) chain restaurants, I really hope they can compete. \n\nThe garlic sauce is amazing.", "business_id": "GSsq_y2PfYBzn51gAG_c7Q", "stars": 5, "date": "2014-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FdxUhQ2orufg_eMgWAoH6Q", "review_id": "AJbRrPOoQAXGxjNpnKTwnQ", "text": "The experience at Marcellino Ristorante is perfect and I love their new location in Scottsdale!", "business_id": "MLVKDbuI2xaOJQ4-NZj2MQ", "stars": 5, "date": "2011-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "OGwg26ZGtj6fRta8v5RnQQ", "review_id": "kh5tbYuTIwYE0yEurmW5Ow", "text": "Marcellino Ristorante is a truly excellent Italian restaurant. There are many options especially in Scottsdale for fine dining, especially if one craves Italian cuisine. However, one seldom finds as complete a package as Marcellino. The combination of ambience, charming decor, impeccable service, and flavorful dishes makes this an excellent choice if you are bringing a date or celebarting a special occasion. Try the homemade pasta, trust me it is to die for. They also have a version of chicken saltimboca (can't remember the menu name) that is heavenly. If you dine al fresco, you might get some live music blaring from Tapas Papa Frita, which is either a plus or minus depending on your threshold for music volume. Prices are somewhat high, but is within the expected range for a classy Scottsdale establishment. One downside is that I would not recommend the mussels appetizer as the mussels are tiny. The desserts are homemade and decent although not something I would write home about. Truly the main course is the crown jewel of this establishment's menu, but don't get me wrong - the appetizers and desserts (that we tried) are fine, just not up to the standard of the rest of the restaurant.", "business_id": "MLVKDbuI2xaOJQ4-NZj2MQ", "stars": 5, "date": "2014-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M2NEo3gYTzNpqasb8X85Xg", "review_id": "UnKv3vlWi0bfC14b03OK2g", "text": "This group of people went above and beyond to deliver excellent customer service. They educated us on what to look for and to avoid when purchasing diamonds and rings. After this they listened intently as we explained what was most important to us in the rings we were looking for. Upon hearing our details, several rings were brought before us to choose from- all fitting the style, quality, and price we were looking for. They never pressured us to buy, and even gave us a free bottle of champagne upon hearing of our engagement! We will be back to see this crew for all of our jewelry needs. \n\nAlso, they have an adorable and very friendly black labradoodle that peaks out from behind the counter every now and again!", "business_id": "207cpG9Pu08La2qVe4ArqA", "stars": 5, "date": "2015-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mJp5ELFhZwBlNyViWl9CHQ", "review_id": "sAFm-DeINI2u9uwJ5-xTGQ", "text": "F1 Race Factory provides a good experience for go-karting. After 4pm on Sundays they combine both tracks so you get to drive a longer course. Purchasing the membership pays for itself in one day and reduces the cost for future races, although it's still kinda expensive fun. The karts themselves are kept in good working order and the staff are nice & helpful. They provide helmets, but you must tie your hair back and wear closed-toed shoes. \n\nI've never tried the other amenities available because they don't seem worth it at all, ie) arcade, climbing wall, bar & grill. Just go for a karting afternoon and have fun! You'll be sweating and you'll almost forget how to drive your regular car. :-)\n\nThe one drawback is that you can't set up reservations so you may be stuck waiting for quite a while. Each race takes up a 15min block, so only 4 races take place per hour. If you want to coordinate a larger group of people to all part-take in the same race, you may have to wait over an hour.\n\nI definitely plan to go again, hopefully once a month on Sundays after 4pm to enjoy the longer course.", "business_id": "YO_ngkGvdFKjiQmIP89YZQ", "stars": 4, "date": "2010-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "705eQuNIz5fKdrDo-GssyA", "review_id": "ouPmc9fDCBHezl5hccjFtw", "text": "I was beyond impressed with the level of dedication these coaches have!  The programs are top notch and the kids actually learn to develop inner strength along with their physical strength.  SO much better than babysitting them with video games!\n\nThe fees are so reasonable, I really am amazed at the quality of what these kids are learning.  I LOVE that this is available in times like these, and especially in this kind of weather!", "business_id": "pP2r6EDBWDi1Pevb_pTNTw", "stars": 5, "date": "2013-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-DRza4wuHHWfQx5HcG6qaw", "review_id": "GgxxZBvtgjV7Jv6TwX1fBA", "text": "Very interesting for the train lover. There are full size trains that apparently are historic from earlier days including one of the 40&8 railroad cars presented by the French government after ww1. There is a small train kids can ride around. There is a model train exhibition too. In addition this is a big park with play areas, places to barbecue and so on.", "business_id": "X3icXUyW9vS4UXY6V_MR4w", "stars": 4, "date": "2013-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eRtuJOuHBXoJ3GRlAe_eTw", "review_id": "gtWftLICyd_cISTtrI4DRg", "text": "LOVE this place!\n\nThis is the place to go for any music equipment.  They even have weekend guitar lessons for free.  Also, they will price match with any competitor.  \n\nI understand it can be kind of intimidating to talk to the staff.  They are like the Genius Bar of the music world.  But they really are just there to help you.  \n\nI buy all of my guitars and equipment from here.  I always receive a follow up email about a week after purchase just checking up and making sure I like the product. \n\nThat's top notch customer service.", "business_id": "XF1g7-1TyTMUMG1qMovlRg", "stars": 5, "date": "2013-09-16", "type": "review"}
{"votes": {"funny": 6, "useful": 10, "cool": 6}, "user_id": "0bNXP9quoJEgyVZu9ipGgQ", "review_id": "fDZOghYmfkx2ouNP5cc4Bw", "text": "9/15\n\nMy first visit, and probably my last for awhile.  Loved the pastrami and corned beef combo on marbled-rye, but found the slightly-under $12 price tag too high for a sandwich, chips, and a pickle.  I will note that I was able to squeeze four small, but ample, meals out of this: two with the marbled-rye, and another two meals from the leftover meat cuts with bread from home.  I might stop over and buy some deli cuts to enjoy at home, but I find the price paid repulsive, esp. when I drive many miles to dine out at least three days a week!\n\nBTW, I chose to eat one-half of the sammy at nearby Crust, which explains the background.", "business_id": "TpQMR-JFE5V0UPzTjjuwFQ", "stars": 3, "date": "2009-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aTFb6_h7gQrf1LDuFotZfg", "review_id": "HPHISLMexM2jdIQh1ESHYA", "text": "Brent is the owner-operator of this pool cleaning service. He is a solid, stand-up business person and very trustworthy. We have used A Perfect Pool since 2004. During tough economic times, Brent was able to find us a refurbished part for our filter until we could afford a new one. We trust this outfit so much, we refer him to everyone who asks. My Spouse is a Realtor and his reputation depends on the quality of the service people we refer to clients.", "business_id": "MOEDY_K1ODppExreulA0WA", "stars": 5, "date": "2015-11-06", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "ReaO1zN3BuRqRX07fg88kg", "review_id": "SKcbfed4pyOjTT0qbTK2DA", "text": "This place is really the worst car wash I have ever been to.\nFirst experience I pulled in and immediately some guy was trying to sell me to fix my new windshield and got so offended I told him no - escalated so much the manager ended up taking care of my wash because the guy was such a psycho. \nSecond experience - car detail... I'm so mad I paid $100 for a car wash- took them 8+hours to detail my truck and it didn't look any different.\nThird and last experience had to wait a century for my car to get washed when the entire time they are trying to sell me to buy the car wash packages.... I wouldn't even take them if they were free!!", "business_id": "gnBgJD6LYsYhSneYVFDmhw", "stars": 1, "date": "2015-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "idiKkAoWw5a8yObEVPCwtA", "review_id": "tKnW9lXzTzEQ9-eKlAREUQ", "text": "These folks are the most knowledgeable, economical, honest and nicest people you will ever meet. You can't go wrong for all your pool supplies and equipment! They always go the extra mile for the customer and did I say the nicest?", "business_id": "yzglXr2AiSTAUVEiLgO0xw", "stars": 5, "date": "2013-10-16", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "M98ZP9vot75MQf46ulsh8g", "review_id": "6YYLoTnFgczrMYUjgasr-g", "text": "WONDERFUL. This restaurant has really gotten it right. Fabulous menu, service, five stars for a job perfectly done!", "business_id": "9AbyBqGWHYZC73GlyAuTrQ", "stars": 5, "date": "2009-09-13", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "kGgAARL2UmvCcTRfiscjug", "review_id": "kVh1fgDEBtCd7B2CSxqqVg", "text": "Time to update my review of this place.  Besides the awesome Steaks they have here, this is a great spot for happy hour.  We meet friends and associates here often for happy hour.  They have this awesome \"5 for $6 'til 7\" happy hour menu:\n\n5 Wines, 5 Cocktails, 5 Appetizers, 2 Entrees, or 2 Blue Moons for $6 ea....that's an amazing deal!\n\nWe enjoy the Wines of course and some of the appetizers we get are the Roasted Pork Belly, Carpaccio, and Mushroom Ravioli.  Our fav entree is the Prime Burger w/Cheese & Bacon...it's a huge Burger for only $6.\n\nThis is a great spot for dinner or happy hour, check it out if you can.  Best part is we love to get the gift cards from Costco....$80 for $100 worth of cards....that saves us an additional 20%.\n\nReturn Factor - 100%", "business_id": "9AbyBqGWHYZC73GlyAuTrQ", "stars": 4, "date": "2013-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "Ri_vPmanpNc2lIGAM_g9ZA", "review_id": "5EfBd99Vg5MHUK8bK8uTnA", "text": "Fantastic food. Great atmosphere and service.  I forgot to ask what wine the waitress brought me but I really liked it. I will defiantly come back.", "business_id": "9AbyBqGWHYZC73GlyAuTrQ", "stars": 5, "date": "2014-11-10", "type": "review"}
{"votes": {"funny": 4, "useful": 13, "cool": 8}, "user_id": "kGgAARL2UmvCcTRfiscjug", "review_id": "KWQJFZr1ZZrqRQtKKWniXQ", "text": "Believe it or not, I haven't had the Pizza here yet.  I'm a huge fan of Pizza, but the reason for my visit is Pizza Puffs.  Yes, those mouthwatering pocket filled morsels of goodness.....it's one of the food items I associate with Chicago.\n\nWhen I heard this joint had Pizza Puffs, I immediately stopped by for lunch one day.  I ordered an Italian Sub & a Pizza Puff.\nhttp://www.yelp.com/biz_photos/6zincCvQTb9BsuK-GHZ4cw?select=Bb3c9tM6uvXJmgaiT9B8eA\nhttp://www.yelp.com/biz_photos/6zincCvQTb9BsuK-GHZ4cw?select=32uwfuBXI-ig7g6METKPKA\n\nThe Italian Sub was served hot and came out first.  I kind of wish the Pizza Puff came out at the same time because it takes a little while for the Pizza Puff to cool off....but that's ok.\n\nThe Italian Sub was very good.  It was a nice sized portion, not too big & not too small, just right for lunch.  The Deli Meats are tasty served hot and the Bread was very good!\n\nThe Pizza Puff was brought out to me a short time later.  I couldn't wait to take a bite....hmmmm, it's just like they serve them in Chicago.  If you've never had a Pizza Puff, do yourself a favor and go out and try one as soon as possible....You'll be glad you did!\n\nOverall, it was a nice lunch, satisfying my taste for Chicago.  They also serve Pizza and Dog's here, so I will be back!\n\nReturn Factor - 90%", "business_id": "n_HvrTuGUgxXJM0yq39-0g", "stars": 4, "date": "2011-09-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "KJDymAcoPiW_vuqthGxfpQ", "review_id": "3Anbuf3yNDT9BvOyyFqIDQ", "text": "The first time I ordered, there were no real problems, other than an extended wait, 30-40 minute delivery time was the estimate and it took about 50 minutes.  Not the end of the world.\n\nSecond time didn't go too well at all.  Ordered a pizza at 12:00 p.m. and was given an estimated wait of 30-40 minutes again.  At 1:08 I called because the pizza had still not arrived.  I was told that the delivery guy was walking out the door and there was an included coupon for a free large pizza next time.  Compensation made me feel better. About 1:30 p.m. delivery guy comes with pizza.  \n\nThird time around - taking down to 2 stars from 3.  Promised delivery time of 11:45.  Pizza delivered at 1:10 p.m. - COLD.  Had to call to find out where pizza deliver was at 12:15 and was told that they had 1 driver and a lot of orders so my order would be at least another 30 minutes, but they would refund my pizza charge.  Another 55 minutes later my pizza arrives, but is completely cold.  I think it was made at the promised time but not delivered for another hour and 25 minutes. \n\nOverall: C-\nOne decent order, two bad orders - hopefully I'll be able to give an updated review as we use them more!", "business_id": "KrkeCU444Uh00fuCklyuQQ", "stars": 2, "date": "2013-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UDhQZQ5l5oIEdUGkIP6liw", "review_id": "W67K2WWNyNQaGbSI5NFT7Q", "text": "Nothing fancy but very good tacos.  I had 1 adovada, 1 carne asada, and 1 carnitas.  Meat was very moist and tasty and the tortillas hada nice fresh taste.  My son had a chicken taco and my wife had a chicken quesadilla.  My only complaint is that we were charged $1 for a tiny side of salsa.", "business_id": "F3tqTcfKnljJcSyyqN0bbw", "stars": 4, "date": "2012-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fPHLPrymsyb6WSFFKoMrTQ", "review_id": "T3SPDx5DYelD6vYSvwoB7A", "text": "4 stars on Yelp for sushi that might have given me an upset tummy?  Hmmmm, maybe I just had a bad experience and since I'm not actually sure of the cause of my upset tummy, I'll give Sakura Sushi the benefit of the doubt.  It was initially a tasty experience, reasonably priced and a cute restaurant with a friendly staff.  \n\nThe food was seemed fresh, was well made and tasted good (and maybe I was just gonna have an upset tummy anyway).  We had, Hamachi nigiri, Unagi nigiri, spicy tuna roll, Philadelphia roll and a cucumber salad.  It was all tasty.  Only complaint that I can be sure of, though the unagi tasted great, it still had some weird bone stuff on the top... that's never happened to me before with Unagi. Oh yeah and, there were only 5 pieces in each roll but, that might have been cause we ordered off a special menu.\n\nWe were lucky to catch something like a Sunday night happy hour.  I'm not sure if that's available everynight or not but our bill was under 25$.  Nice!  Unfortunately, I don't live in AZ and even when I come back, I'll probably try another joint because this one is so far from my friends house.  We only went there because it was open until 9:30 on a Sunday night. \n\nProbably won't see ya there.", "business_id": "Bjt3rB73dvSDe1XEPEWc6w", "stars": 3, "date": "2009-09-01", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "YIiQx-XtRVKWVQ4LCaEuLA", "review_id": "zZkSvpkxR3_0zZQzoiXxOw", "text": "I like the sushi here but the extra fee for \"take out\" order.  Give me a break.  Your going to charge me a fee to order over the phone and come pick it up myself?  Am I paying for the styrofoam container?  Look at it this way, I'm not using your tables, Im not using your waitresses, your A/C, your bathrooms and you don't have to hire a bus boy and dishwasher to clean up after me.  I think I'm saving you money by getting \"takeout\" dummies.  The family and i used to go here quite often but ever since I got the \"take out\" fee I will be spending my money elsewhere.  Too bad because we liked this place and its very close to where I live.", "business_id": "Bjt3rB73dvSDe1XEPEWc6w", "stars": 2, "date": "2012-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L7Fzx3mmm2WgxfdTtPa22g", "review_id": "1AGtGTw9qRqrP8j41iro7Q", "text": "Wish I was able to give no stars. A group of 5 of us went to get sushi here on Friday. I called ahead of time to ask about happy hour and what time it was over. The women on the phone told me it was all night. This is why we decided to go here over Kona Grill, which was a huge mistake. We got there and ordered. The server we had was new which was no problem, I'm in the service industry and understand that being new is hard, but the service was very slow and I could tell she was frazzled. When it came to the check it showed that none of the stuff we ordered was at the happy hour price. I asked the manager about it and she told me I got incorrect information about the happy hour times and there was nothing she could do about it. The sushi was mediocre and for the price we had to pay, it was not worth it. I will never be back nor will I recommend this place to any of my clients in the area.", "business_id": "Bjt3rB73dvSDe1XEPEWc6w", "stars": 1, "date": "2014-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "skwspOhmEDI834ZV6B8ing", "review_id": "TpNoeJ-tv40c84uP-oD6KQ", "text": "Beautiful course with a reasonable mix of Pars. I only made it to the 15 before it became too dark. Though it was busy, I wouldn't say it was overbooked. \nI would definitely go again. \nThis time of year it gets really cold towards sunset on this course, bring a sweater!", "business_id": "KHoBFKiWf0pJntUzDQPkgw", "stars": 4, "date": "2014-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "UCQNrwN4_hHHTWYa8cqe_Q", "review_id": "SstzYg96rHp66-Z2jdIXWw", "text": "Wife and I stopped here after attending a D-Back game. It was Sunday around 5:00pm. Not busy at all, we were seated very quickly. After waiting for a little time we were finally served water and asked for our drinks. Right away I asked if we can order one of their sliders so we can try it before our dinner. Waiter said no problem. Now their sliders are very good, It's like a whole meal in a bun! Don't know how anyone can eat their 12 sliders challenge! NO WAY!! Wife had their crispy chicken wrap, I had their all you can eat ribs. Wife's wrap was awesome! Very tasty, and her side dish of potato salad was just as good!! Their ribs were OK, not much meat, very fatty, even though I packed away 13 ribs!! Mom, it sounds worst than it is!! There just weren't that much meat! No wonder it's all you can eat! Now I am writing this review the next mourning and I can still feel the wrath of the ribs!! I will definitely go back. They have way too much items on their menu for us not to go back. But I will not longer order their ribs again.", "business_id": "IM-9thHqQbBK5tX5MfTzBQ", "stars": 4, "date": "2011-09-26", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "hRdhlyNVtVvcf7oLn2J1Xw", "review_id": "TvJSalxF4V9-TEls9ZjKKw", "text": "If there was a support group for individuals addicted to both coffee and bagels, you would find me there. Chompie's is my go to place for a delicious/fresh and cheap bagel and coffee on my way into the office.  They have a pretty large selection of bagel flavors as well as cream cheese flavors and service is always friendly and efficient. \nI have dined in their actual restaurant several times and never had a bad meal or experience. If you looking for some fantastic jewish deli fare, Chompie's is your best bet!", "business_id": "IM-9thHqQbBK5tX5MfTzBQ", "stars": 4, "date": "2014-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r7bMedE7Vv5KFF1M_m9QIg", "review_id": "O7LQ7q0BL0UwCiHW-HqLIA", "text": "Disappointed.  Waited over 15 minutes just to order a drink. They had costumers but not over busy for as long as it took.  Was getting ready to get up and leave.  Heard  the food was great.  Had Jewish slider combo.  It was good but the krephel soup was cold when it came out and had huge carrots and celery and only one krephel in the entire bowl.  Very disappointed.  Wouldn't go back.", "business_id": "IM-9thHqQbBK5tX5MfTzBQ", "stars": 2, "date": "2015-11-09", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "ajYMtA6UN8nn9Dz7nFbLdg", "review_id": "62o2fK53ShYyyJo5KaYC8Q", "text": "Let me sum this up: I liked the way I looked.\n\nI needed to rent a tux for a black tie wedding in about two weeks. Came in and was quickly greeted by younger looking employees who were very friendly but slightly unpolished. When I think of suits, I think of older gentlemen, preferably with accents and finely coiffed beards. Nevertheless, the young lady working the computer pointed out various shapes, sizes and selections for my tux. She ascertained my budget and attempted to fit it. Despite my ignorance, she guided me through the process of accessorizing appropriately for the style I wanted. They took my measurements and told me to come back a couple days before the wedding.\n\nTo my satisfaction, the tux came in early! Everything fit perfectly and I walked out a happy and prepared man.\n\nPolicy states that you must return the tux (in one piece) the day following the event. The nice thing is, ANY Men's Wearhouse will accept back your partially soiled attire. I made sure not to lose pieces and avoided any penalties.\n\nThe whole rental cost me about $120 (including deposit). Pricey, maybe. But, consider all the free food and drink at the wedding! And after all, isn't looking awesome, priceless?\n\nTuxedo Renting Tips:\n-If you choose suspenders, do it for function. No one will actually see them... unless you want them to.\n-Don't forget to brush off those nice cufflinks you got as a grad present years ago. Otherwise, you're stuck with the free ones they include.\n-Bow-ties are cool. The ones they give you are clip-on. Unless you're really good at tying one, opt for the clip-on.", "business_id": "NjFO0CTI1ejl2E0bjR426g", "stars": 4, "date": "2013-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rI6j_9Hmy2z_gXNtquR4Lg", "review_id": "zbMlElR2j1zxzI6-2KJt8Q", "text": "Yummy food and good service! Came for lunch, was seated right away, and served our drinks shortly after. Our server was Whitney S.  She was very accommodating throughout the whole lunch and especially when trying to find my aunt a sweet wine. My aunt doesn't know slot about wines so she had to taste a few before we found the right match. :-) I ordered the the club salad with buttermilk garlic dressing on the side.  The chicken was on the bottom of the salad. Different presentation, but I liked it. This was my first time dining here. I will definitely go back!", "business_id": "jBb5KHHAj4s8hcXVS6QXDg", "stars": 4, "date": "2011-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EZlWLUNBijCZJTBfoihYvg", "review_id": "Q9U5fdRL7G69Tbb9JLFvBw", "text": "I love the Hawaiian ribeye, so amazing!!!\n\nUsually they have a long wait but it's worth it!", "business_id": "jBb5KHHAj4s8hcXVS6QXDg", "stars": 5, "date": "2013-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "GUoFkjQ1sz5pIRR8odDNYg", "review_id": "JaGyPobsLqymZqiMjKBNUA", "text": "This has become my 'go to' restaurant when friends visit or I just want a relaxed meal. I just saw Faridahs' comments.. yes, the restaurants' menu has changed through the years and there are a few favorites I wish they would resurrect, but the quality of their current food is very good, the offerings are varied and the service is impeccable. The only suggestion I would offer them is to hire older people to run the front. The very young women who hostess and deal with reservations are not particularly concerned with customer service or being welcoming.", "business_id": "jBb5KHHAj4s8hcXVS6QXDg", "stars": 4, "date": "2015-10-13", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 0}, "user_id": "7T2ul_LOzArDKjfVRDt-JA", "review_id": "y0IqfHNdr8kIuoIYIcttmQ", "text": "This is a good place for a quick meal. We've eaten breakfast here a few times. The food is always decent, the service always prompt. \nHere's the thing - I always feel RUSHED, totally rushed. \nI'm not the type of person that nurses a drink,  takes up a table for hours or sips coffee all morning. I don't even read the paper while I'm there, although I might like to if I didn't feel so rushed.\n\nThis morning I noticed a sign that says \"During our busy times, please do not conduct your business meetings, studying..\" I can't remember the rest but I found it offensive.\n\nI can understand that they don't want people taking up a table when paying customers are waiting. I totally get that. \nHowever, the place is huge and I've never waited for a table. \n\nPerhaps if the wording was different. If people are hanging out, aren't they spending money? Even if they're drinking coffee? \nMaybe the patio could be self service so waiters don't have to miss out on customers. \n\nIt totally rubbed me the wrong way and it's plastered as soon as you walk in the door. It's like saying \"Don't enjoy your time here, get in and get out!\"\nIn this economy you think they'd be happy to have any business.", "business_id": "68_EJEA9Ibo55EDp3d-nOg", "stars": 2, "date": "2008-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UGTFtwtRVVvCwlvMD4axtw", "review_id": "sPZZyq52iBwshbszzcEBCw", "text": "Love their breakfast! Waffles are just like home cooked. If you need breakfast in a hurry this is the place, with in 5 mins of ordering your food is at the table.", "business_id": "68_EJEA9Ibo55EDp3d-nOg", "stars": 5, "date": "2014-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iYHG-cPTmTSvywygxKX6cA", "review_id": "CxUnFX0dktAPg5GLMES_uQ", "text": "what a dump!  it's a motel 6.  Marriott take your name off this cheap motel because it doesn't deserve the marriott brand.  You can hear everyone walking down the walkway because the walls are so thin plus the TV and shower next door.  The thin bedding and not even enough room to walk beside your bed makes this the worst hotel I've ever stayed in.  The GM didn't want to discount my bill because I used social media to complain tipped me over the edge because it's my right to an opinion.  She told me they are first generation Marriott which means what?  I found out 4 years ago they did a remodel....wow, they need a tear down then!", "business_id": "KT0VXcl8J7Jes9xheZTqbw", "stars": 1, "date": "2014-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-xyIqk6IT-Z2wTXYBZ10Kw", "review_id": "bGFCJFw1nR_DPD0_UBOq7g", "text": "My bf and I were in Scottsdale for the weekend and I found Spa Lamar on yelp. After reading the positive reviews I really talked it up to him and we decided to try it.\n\nI also read about the special on travelzoo where you can buy $130 of spa service for $65 (half off) The ad reads \"$65 - 'Best Spas in Arizona': Half Off Massage & Pool Day\" I called Spa Lamar, spoke with Taylor and asked about a couple massage and whether we can use the vouchers. Since the price of the couples massage was over the price of 2 vouchers, I asked if I can buy 3 and use the leftover money for other services. She said YES.\n\nI went on travelzoo to buy the vouchers, the fine print said one voucher per customer so I called Spa Lamar and spoke with Taylor again. She said she would find out for sure and put me on hold. She came back on the phone and apologized and said we can only use one per person. No problem! It was still a good deal. \n\nI bought 2 vouchers, made the appointment for the following day at 1:00 (I had a early evening flight home.) She said 1:00 wasn't available, but she can get us in at 1:30. No problem again.\n\nThe next morning, Taylor called, she said they booked a couple's facial in our room, so we can't come in until 2:00. No problem again!! We got there about 1:50 and were shown to the locker rooms then \"relaxation room.\" There were 4 women in the room drinking champagne and talking very loudly about their children, therapy, etc. You couldn't even hear the music! Now, mind you, I love a girls' day out and do it often. But, couldn't they put a party in room other than the \"relaxation room\" so everyone trying to relax don't have to listen to their conversation?\n\nThe lady (I believe the owner) came to us and told us they pride themselves on being on time, but it was 4 minutes after 2 and it would be another 5 minutes before they were ready for us. No problem!! At 2:15, she walked by us, looked at the clock and frowned. A couple of minutes later, we were called into our room.\n\nMy therapist, Karen was wonderful. She gave me one of the best massages and asked me frequently if the pressure was ok. She was the only positive thing about the place. Unfortunately, my bf felt like his deep tissue massage was just a inconsistent light rubdown. \n\nAfter our massages, we went into the steam room. It smelled musty and mildewy with about an inch of water on the floor that wasn't draining. We left and tried the jacuzzi. The pool and jacuzzi did not look very clean either.\n\nOverall, I agree with Kimberly T. Spa Lamar feels very run down and not very clean. I was extremely disappointed. We gathered our things and went into the showers. Guess what?!?!? There was no hot water!!!!!!! I had to take a freezing cold shower. I mentioned it to the lady at the front desk when I came out and she said they had a lot of guest today and the hot water probably needed to cycle through. I told her my bf took a shower in the one next to me and his was hot!\n\nTo add insult to injury of a horrible experience, when we checked out, they couldn't figure out how to discount the travelzoo vouchers so they tried with a calculator and told us we owed an amount a lot more than we were expecting. When I tried to explain to just minus $260 (2 vouchers) from the amount owed, they said the vouchers were only good for $110 each, not $130!!! The other $20 was for yoga classes. I explained the ad said 50% off $130 value and they insisted it was not all towards massages and the voucher was only good for a one hour massage which is $110. They said it would be the last time they advertised through travelzoo. \n\nI told them of my experience starting with misinformation about the voucher the day before to the appointment time, then the cold shower and they asked what I thought was right. I told them to simply honor the voucher as it is advertised!\n\nAll in all, it was a horrible and costly experience at a run down place. I will never go back again.", "business_id": "EaziHWcmjm5nGmPF-CJgQA", "stars": 2, "date": "2012-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NaNOWaZGP5oSuo-kDcCLdQ", "review_id": "LRGln3t5712x0Ajm2ME9Ig", "text": "Well, they finally changed the address on Yelp.  Up until last week they claimed this was about two miles away, which caused me big problems when I ordered and then drove to pick it up.  I was all ready to give it one star but the address is now correct so I can't really dock them on that.  But what I can dock them on is that they don't give out free red pepper or Parmesan cheese, if you want that they will sell it to you for $1.20.  That is preposterous.  Pizza was pretty good though, and the young lady at the counter was very friendly.", "business_id": "x2rDXUQhxkUE0DUQ_bFFNg", "stars": 3, "date": "2014-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r0E8n4my45ItuOaoKcy4Mg", "review_id": "VgFLJHER3A5z2en6CClVpA", "text": "The Doubletree was a great, spacious place for a business conference.  The grounds are impeccably landscaped with natural dessert plant areas with giant Saguaro Cacti, tall palm trees and colorful native flowers.  There are winding paths with pools and fountains that sprinkle the landscape.  The exterior of the building has a Native American feel and somewhat reminiscent of Frank Lloyd Wright.  My only complaint that the design of the resort is like a maze.  All of the guest rooms are exterior, and there are so many curves and corners it makes finding your way around the grounds really like going through a maze.  I don't think we ever took the same way to the lobby twice.  It's kind of like you follow the paths and hope you get to the right place.  The resort is very clean and well kept.  The rooms were decorated very simply and tastefully and had beautiful whitewashed beam ceilings.  They also included a patio or balcony to sit out and enjoy the grounds.  Everyone from the hotel from the desk clerks to room service were extremely friendly.", "business_id": "CD-2yHTSObgvAhW-pYHfMw", "stars": 4, "date": "2014-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "q9kwTYEcBxnRQK-bzBSI4Q", "review_id": "pZu9Ch90ds7bMI8CBwUtLA", "text": "I could not be happier with this Vet's office and their staff! I had my min pins ears cropped about 2 years ago and they are perfect. The service is great, the staff caring and attentive, along with the Dr's being gentle and understanding to my dogs needs. We will be taking our newest family member (Doberman) here in about 5 weeks to get his ears cropped! I don't live locally in Scottsdale, but honestly it's worth the drive!", "business_id": "S5ZcvZ7_ZeXXeDxHcEPAlw", "stars": 5, "date": "2015-10-02", "type": "review"}
{"votes": {"funny": 4, "useful": 1, "cool": 2}, "user_id": "palND-kF1qpMLhkcgAnSxA", "review_id": "A8pilDYhQA2KFqu9EOVBgg", "text": "First thing, I don't have kids. I have nephews. They are 5 and almost 7, and they're obsessed with Angry Birds, Scooby Doo and Skylanders. So of course I now have to shop at Toys R Us. I'm ok with it. The staff were friendly and helpful, the only tough part was finding them in this huge store. It's a maze! They do this intentionally, I get it, I'm not dumb. They don't make all the aisles like a grocery store because the more stuff the kids see, the more they scream and whine for you to buy it all. Clever. But I don't play your sill games, Toys R Us! No, not me! I come here alone and leave the kids with their mom. I'm too smart for you.", "business_id": "2CvVWNI__s1I7ns6w_zILw", "stars": 3, "date": "2014-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m4ZRgRGnVPjrbZuLPQvG0Q", "review_id": "v0Ryfwe_CXzM9Mp3luZCMw", "text": "Wish it could be 2 1/2 stars.\n\nIn town for business and the Hilton was the \"overflow\" hotel from the conference.\n\nThe good:\n*The Lobby Ambassador James is amazing. There is no way on earth you can't be happy around this man. Beautiful soul.\n* Location was good and central to everywhere we needed to be.\n* Most of the staff was very professional and friendly.\n* Comfy bed\n* Spacious room\n*Decent, free wi-fi\n* Good area for using a computer/printing\n*Huge bath towels\n\nThe not-so-good:\n* Super thin walls. This is a deal breaker for me. Not only could I hear my neighbors through the wall (sounding like Charlie Brown's teacher) but I could hear them intelligibly through the bathroom vent. Very strange. \n* The ceiling creaks. Loudly. This is the strangest thing. I was on the top floor and the ceiling creaked often. A couple times it woke me up.\n* All the TV channels didn't work. In fact, most of them didn't. The hotel tried to fix but couldn't so they did comp me some room service.\n*Someone prior to me had opened the mini bar and it was left open. I didn't realize until my last night.Everything was knocked over and the unit was warm.\n\nOverall, lots of things seem slightly dated.", "business_id": "ZRrIwqIUMII1b2keMI8QRw", "stars": 2, "date": "2014-11-04", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "LtnTfy4OOV-SDXxAYM2VDw", "review_id": "GNlbOTeAaZGanShOLpHCDw", "text": "Came for the fish tacos, did not get to eat fish tacos. Apparently they can only be ordered at the bar during happy hour and \"since they aren't on the normal menu, we can't make them\". What?! You have them on your happy hour bar menu and are fully capable of making them throughout the day if you already have everything you need to make a fish taco ready to go in the kitchen. I ended up getting the chicken apple walnut salad which wasn't bad but the apples were mushy and had no taste.", "business_id": "bx5Yc7-_E8wz3Lahpq88mQ", "stars": 2, "date": "2015-09-07", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 3}, "user_id": "KcI2VGSvRhLAmw6vZrc8WQ", "review_id": "IqIMR3NKe5-L4TZc1lUrPA", "text": "We walked out.  Never got to eat.  The waiter was to busy hitting on the 15 year old girls sitting behind us then come up and take our order.  We waited a good 15 minutes and no love.  \n\nNot to mention, the food looked over priced for what is was.", "business_id": "kOh8ZHf8CkFQCwyfDvVJTA", "stars": 1, "date": "2009-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TeR1SIGaqN1c8SdEivi5vw", "review_id": "aWxH0o-mWDjUnXgMXOnWUQ", "text": "One of my preferred Ross stores. It's always neat, well-organized, and they have tons of high end names at this location.", "business_id": "nRLsX5dEmYBcjhX2720y8A", "stars": 4, "date": "2013-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-UDZu8sGloFIAIeFBvqK_g", "review_id": "lVUM3V3Lr7YBBydRxCf0hw", "text": "I was approached by Erin at this gas station to have my windshield repaired.  I let them call my insurance company and set up an appointment with me to fix my windshield (between 8 and 12).  I waited--no show, no call.  I called them and the woman who answered couldn't find my paperwork, so she said she would call me back.  Guess what. No call back after about an hour.  I called again and she said, \"What? They didn't call you?\" After I had already spent four hours of my day waiting on these people!  No thanks.  I will not be returning to this station and will never do business with them again. Their gas is way overpriced, too.", "business_id": "z7W0sUbrVi2k6R2BR5jtzw", "stars": 1, "date": "2014-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "WRVEzidVMvjdrwcGyJnsQw", "review_id": "AUBxCdI0vFgYoFKwc0Bqlg", "text": "I lived in this neighborhood growing up. Every now and again, I would write down my family's order, grab the cash, and peddle my way up Granite Reef to Casella's. My mom and my favorite is their chicken salad sandwich, my brother's favorite is the pizza sub, and everyone loved their AMAZING potato salad. \n\nThe family-owned business is exactly the same today as it was when I first starting eating there nearly 20 years ago (admitting  how long it has been is hard). \n\nEveryone complains about them being cash-only.  They have ALWAYS been cash-only, and I like that about them.  They have quality ingredients, are always friendly when you walk in the door, and time and time again, give a great product. \n\nI live in Tempe now, and I go out of my way to order from them instead of the chain down the street -- gotta keep the local businesses alive!! \n\nLOVE IT!", "business_id": "kEyCMHBnohaWc81omLDfYg", "stars": 5, "date": "2013-10-22", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 0}, "user_id": "fsEXfHtekEp-6t2Eo3kdWw", "review_id": "4OxNYJfU8envhPZj8tzcpA", "text": "You do get what you pay for!!!.  Had a convention in Scottsdale and wanted to find something more reasonable then the Scottsdale resorts.  Happened upon the Scottsdale Athletic Club and it looked great.  The price was slammin' so I encouraged a colleague and client to get reservations.\nThe rooms had all the charm of Motel 6.  I was really disappointed and embarrassed for my client.  Found myself saying I'm sorry over and over again.  \nHope I can save some fellow Yelpers from the same experience.", "business_id": "FGCa6lW6f03rzJz0U3QESg", "stars": 1, "date": "2008-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8t5j2eU7dWiFXBh3AvY1kg", "review_id": "LMMBnw4NI-I5M8gvNFyiyg", "text": "Stopped in at The Good Egg for breakfast on a Saturday around noon.  I appreciated that there were quite a few other folks having a lazy late breakfast.  I had the Florentine Benedict. The size of the hollandaise sauce portion was a little bit overwhelming and a little bit too thick but otherwise tasted fine.  John had the pancakes, which were huge.  He was psyched.  Prices were reasonable for a breakfast place, which in Scottsdale is rare.  Coffee was too weak for me but they leave a big carafe of coffee and a pitcher of water on the table which is kind of nice.  \n\nHuge restaurant with plenty of seating.  Country decor but not obnoxious.  There wasn't anything here that I was blown away by but it was totally edible, homey breakfast food.  I'd have no problem eating there again.", "business_id": "GhhpkAkGl4JE_M_Szwegeg", "stars": 3, "date": "2011-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IhmZzpGicBehiBgW-1RVbA", "review_id": "1hP66mLJxO3ko8A6F6fBOg", "text": "Always liked this breakfast place.  Went with group of 8 and 5 got sick, me for 3 days.  Called restaurant to let them know was told manager would call back didn't happen... Eat here at your own risk.", "business_id": "GhhpkAkGl4JE_M_Szwegeg", "stars": 1, "date": "2015-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "T_Dn2hra4XKSd7YPoc7WVw", "review_id": "gyuak-E6cBIPKIX8YpYbjg", "text": "Staff was friendly. I wasn't impressed with the desserts. What happened to all the puddings? Ice cream or dry brownie muffin.", "business_id": "RbWAL8KYgUp9pNSeLSjXtQ", "stars": 3, "date": "2012-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "zqnAdayPsak5dbLF2gEvNw", "review_id": "R-NMuY3IDrDLq5AqmBKnuw", "text": "OK, I have to start by saying that although I am only giving this place two stars, I still actually enjoy going here....but when you boil it down, it really is kind of a two star place (and sometimes that's exactly what you're looking for!)  From the location in the Bashas strip mall, to the wooden door with limited signage to tell you where you are, to the complete lack of any windows in the whole place, you definitely get the \"tavern\" feel the second you walk in.  With one long oval bar, and just a few tables against the wall, it's definitely a place to belly up to the bar for your cocktail, because the one person working the whole room might actually see you there.\n\nThe drinks are CHEAP ($2-$3 dollars for a bottle of beer, and not much more for a cocktail).  The music is....well, you decide.  It's from a jukebox.  Want food?  Go ahead and take a gander at the take out menus from local ffood joints the bartender will provide for you.  Heck, they'll even call in your order for you!  You can even bring in your own subway sandwhich and eat it if you're trying to stay healthy and avoid all that \"bar food\".  There is a pool table, and a few TV's to watch the game.  \n\nMostly, I like this place just because it's around the corner from where I live.  I can walk over, get some cheap beer, and walk home.", "business_id": "2BSF6wu1V3KfyFJf1DQ3DQ", "stars": 2, "date": "2010-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "yneTxW_9TTRXTOgJDH9fnQ", "review_id": "vhqvhsX82R-4SEW927BAfQ", "text": "I admittedly don't get my prescription updated as often as I should, but I've dealt with these guys twice in 3 years for a couple different pairs of glasses and contacts, and I've had nothing but good experiences. \n\nTheir front office gals were super helpful over the phone, guiding me through the process for contacts, and finding a cancellation for me to come in the next day for an appointment instead of waiting for 2 weeks to get in. They were equally nice to deal with in person.\n\nI've dealt with 2 different doctors, one male one female (don't remember names, sorry) and both seemed great. I had no issues.\n\nAs for frames, i love their selection here. I'm picky when it comes to glasses - it's hard to find frames that straddle the line between not-boring but not overly expensive - these guys do a good job. I've been totally underwhelmed by every LensCrafters-type place I've been to.\n\nIf you're on the lookout for a good optical place, I'd suggest giving these guys a try. The one downside I have is their hours; it's hard to get there m-f when they close at 5. They at least have Saturday hours, but those are pretty short. (8-noon, i think?)", "business_id": "5mxob00MDhnE5kQuwQBCOw", "stars": 5, "date": "2013-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Cost-gi6BiPQljRzF8xxtw", "review_id": "xn2hVQxYhyK2Kc9wf_D8mA", "text": "I recently bought a library wall from Ladlows and I was extremely pleased with the quality and customer service. They  delivered it when they said they would and it looks great!  I am trying to furnish a room by the holidays and they carried all the items in their showroom.   I had liked  a library wall at Ethan Allen first, but they take 9 weeks for anything to be ordered! I was relived to find quality furniture that I didn't have to wait 9 weeks for.  I even asked them to remove something from the unit and they were very accommodating and didn't charge me for the labor. The gentleman who helped me was very friendly not stuffy in anyway.  I will definitely start here for future furniture purchases.", "business_id": "yVH2YCImnNebBwLQBRk9Mg", "stars": 5, "date": "2011-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Eb7NSk7DWu3CrTgs6mXdMw", "review_id": "cHhM8T9nB5zo8A27E7jvrA", "text": "My wife had a physical in September with Dr. Janis Saunders. She is the worst Doctor that we have ever encountered. She was rude, crass, and has no customer service skills or patient skills. Get this - after she measured my wife's waist she said to my wife \"that's big, you carry all your weight in your waist\". What a rude thing to say to a patient!! There are many other ways to convey this to a patient, like, oh you've gained some weight, we need to work on that, has your diet changed? Something like that. She said other stupid things like when my wife said it was hot in the examination room she said \"oh yeah that's for me, I'm always cold so I keep it hot in here\". OMG doesn't the patient's comfort come first?! She also stayed in the room after my wife had her pap smear and my wife had to get dressed with her still in the room! No privacy! No feelings!  Needless to say we are changing doctors and will not be returning to Parkway Medical.", "business_id": "-wSSZ0v9ca0TuXOLQ0TbfQ", "stars": 1, "date": "2014-10-23", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "AgKXZNfmDE4Oh2bub2ih0w", "review_id": "mNfnUB255tt5CKQekD3N_w", "text": "The staff is always extremely courteous and helpful. They truly want you to understand what you're purchasing and to feel comfortable with your purchase. The lifetime warranty, cleaning and sizing of your jewelry is just another great perk! I won't shop another jewelry store after the service and quality I received from Shane Co. The best!", "business_id": "BUsmaloKEZeOvXLrSjKWSQ", "stars": 5, "date": "2014-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "4E_nPWw89FLFHdNsEgMH-g", "review_id": "KmmEccuoD9c8bLsAWiQjLg", "text": "A decent little nail salon that I go to if the place I regularly attended is way too busy. The ladies (and the guy) are really nice and its never really busy  (at least when I go) and the only reason I don't go their more is because its just a little bit more expensive. Not by much, but I just have a great rapport at the other place as I have been going their longer.  If you are in the area, check out China Nails. They will definitely take good care of you.", "business_id": "vQQBk3jsTkbPfa-qGeF3rg", "stars": 4, "date": "2009-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GuQJUsB-24GyCAI8yCGyLQ", "review_id": "H2BiGkgvz_rPXn-HzhJX2A", "text": "Where do I start?\n\nMy daughter has been attending this center for 2 years now.  As an only child with two working adults, it has been a wonderful place for her to grow and learn.  The staff is beyond words.  They are so caring and kind.  The know not only every child's name, but also the parents.  It is just a joy to be able to trust them with the care of my little one.\n\nShe is currently in the pre-K program, and Mrs. Cindy runs a phenomenal classroom.  She has the kids respect (along with the parents).  It is just a continuation of the environment my daughter has been in since day 1.\nMrs. Ricole is the director, and she is always available to answer any concerns that we have.  She and her front desk staff truly offer a lot of help with scheduling and other minor issues that always seem to pop up.\n\nIf you get the chance to send your child here, you will not be disappointed in the quality of care.  Worth every penny.", "business_id": "OH_OHCsAual4kpWa85zl2A", "stars": 5, "date": "2014-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W_R-gVF8OHNrIhtmyhDnyg", "review_id": "XeLs3hCdcAUdcRlMLdZ6sQ", "text": "Ordered take out and went to pick up and the place is small and mainly for delivery or pickup. Ordered the following dishes :\n\nChow Fun \n\nShrimp and Lobster Sauce \n\nTeriyaki Chicken \n\nGarlic Chicken \n\nHouse Fried Rice \n\nChicken Wings\n\nAll were okay but nothing really stood out. The fried rice was probably the best, the shrimp and lobster sauce was really disappointing.\n\nIf I were to reorder or recommend anything it may be Garlic Chicken and the House Fried Rice but would prefer a few other chinese restaurants in town.", "business_id": "aI_RzGMU35cFL1St2HgPkw", "stars": 2, "date": "2015-10-12", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "0KiDoqwb6bDMgxMw62EGCQ", "review_id": "_9ZmofxGQS3u4DEDKBNa5Q", "text": "This review is of the Orange Tree GOLF course and management.  This is NOT a review of the resort/hotel.\n\nSad to say but very true -- expect a 5 to 5 1/2 hour round. Calling for a ranger to come out and help move play along brings a tsunami storm of rude treatment from the ranger and the pro shop. It is not a golfer/customer friendly experience. It's supposed to be fun???  We payed $69/per player for slow pay (quit after 9 holes -- at times there were 3 foursomes sitting at a tee waiting) and very poor treatment.  Best advice - avoid this place. Too many great courses in the area with quality customer service to waste $$ and time here.\nVisited October 2013", "business_id": "40B5TbtZbiGV4blFR9S6Dw", "stars": 1, "date": "2013-10-25", "type": "review"}
{"votes": {"funny": 5, "useful": 7, "cool": 4}, "user_id": "fczQCSmaWF78toLEmb0Zsw", "review_id": "G2aM_OB6tV0ndIchcJlDcQ", "text": "I think it had been a solid 5 months since my last visit to Benihana... and I still stand by my 3 star review.  It was just as I remembered - same waitress and all!  I took my BF's sister for dinner there on a Sunday night.  We each ordered a Benihana salad (I do love that dressing) and a miso soup.  I think they gave us a different kind of soup but we ate it anyways...\n\nWe shared a Las Vegas roll, a spicy tuna roll, and then each had our own selections of nigiri (I had ikura and she had eel) and handrolls (I had spicy scallop and she had eel).  It was all edible but not spectacular.  I recommend against ordering the Las Vegas roll - it has way too much cream cheese and sauce on it.  Other than that, go to Benihana for a quick sushi dinner that is decent quality and price for sushi but no atmosphere - don't say i didn't warn you!", "business_id": "ishjLG3Sc94ZOelXZZhaIw", "stars": 3, "date": "2008-09-15", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "o8WxZlNyvwKKRoQ8dDWX1g", "review_id": "VJ7vHsbTNleEs3N9gCCxdA", "text": "When we called to ask about reservations and wait times, the hostess refused to tell us how long the wait would be. Asked to speak to a manager, who proceeded to do the exact same thing. I guess they don't need our business, so we won't be going. Ever.", "business_id": "ishjLG3Sc94ZOelXZZhaIw", "stars": 1, "date": "2015-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9xrUAitfvzBM-xdCwGxCOQ", "review_id": "E0LaRbQvVFRsqs2tSA5Ckw", "text": "By far the best I've had in the valley! The food is always fresh, great portions of meat, and the staff members are always extremely friendly! \nPretty much the only place I go anymore!", "business_id": "FjQWjXvFCdrgdU3Rgi3b3w", "stars": 5, "date": "2015-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8RSKkWmKwNyrX0VBqToweg", "review_id": "aPAotAaoXCGTMtax8q1Y8g", "text": "The best place for breakfast, hands down.\n\nI love that they changed their stamping special.", "business_id": "nP9zQBRNSxlnU8BsbqYI5A", "stars": 5, "date": "2015-09-11", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "h7v_M_0-YVpSVZ2WD7FpAA", "review_id": "wret5OAoUtbhvpIluCfaaQ", "text": "Walked past this store dzns of times & never went in! Not sure why, but glad i finally did!  \n\nWe were greeted immediately and in a nice & unobstrusive way.  We were given a few samples, and it was pretty clear i was not going to make a purchase this time since all the products were new & different to me, I was just gettting educated :-)\n\nThis didn't hinder the salesperson, who still gave me some cupons, samples & a full bar of rosemarry soap!  \n\nThe sample ended up making me go back 2 days later, as the shave cream was the best shave hubby ever encountered!  I purchased and entire shave kit with lots of goodies, more samples, and the sales girl threw in a bamboo soap dish (bonus!).\n\nI'll be back to ck out more products after i finish using up my arsenal already in my possesion!", "business_id": "mAMeCLoTQUf3Zb808deTYg", "stars": 4, "date": "2009-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7TGUTGNJXNCtn3NQSrPbsg", "review_id": "I79loWYs9tUvDHQfgpDggQ", "text": "Very knowledgeable and professional.  Would recommend them to anyone.", "business_id": "C_XsvR-HbCPaQa79JYsGcw", "stars": 5, "date": "2014-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7lIgP58y6_Ww8yRmOFA1Fg", "review_id": "4k0KaYGjv8MFBSl6ppFgkw", "text": "Fantastic service and treatment! Always accommodating and everyone is always friendly and pleasant at each visit. Gift packs before my surgery and after braces came off. Extremely thoughtful and caring. A great team. Thanks!", "business_id": "P-VUqVXFRZ_8-2e24C6O6w", "stars": 5, "date": "2015-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RXvhYjxmZPpb1MhTbhmhQQ", "review_id": "lnyzkuYxJS4HGQOGgaPLhg", "text": "This is the second time I have bought Furniture from Creative Leather. There new location is beautiful.  Mark  who I have worked with before  is fabulous and once agin really help me pick out a new sectional and Dining room Table. I have not been to Creative Leather in 5 Years and was shocked to see all the new beautiful Tables and new sofas. Thanks Mark for making my experience easy and enjoyable for the second time. I love the couch I have and can't wait for the new one!!", "business_id": "YdsO599PzLATj8XF62-EYQ", "stars": 5, "date": "2013-11-06", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 5}, "user_id": "PShy2RYNadDUhJf4ErOJ7w", "review_id": "Eny8vicYGh_qHeWJdk86LA", "text": "In September 2008 I went to a pastry cooking class here.\n\nIt was at nighttime.  55$ a person.  from 6-9pm.\n\nWe show up, and the pastry chef was the pastry chef from Cowboy Ciao!!\n\nOMG!!! I.was.so.excited.\n\nI'm such a huge fan of the pastries at Cowboy Ciao since they're unique and weird and awesome.\n\nOk, so the class was super fun.  We had like... five or six different recipes.  We broke off into groups and each picked the recipe we wanted to make.\n\nWe made them, with the help of the chef.\n\nIt was fun, we were all talking.  They provide wine, and iced tea and water to drink.\n\nThen OF COURSE.  Once they're all done, YOU EAT AND EAT AND EAT until you can eat no more.\n\nAwesomeness.\n\nI really had a great time.  Really.", "business_id": "RvvYZthPciQNsZ6xkpYEPA", "stars": 5, "date": "2008-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p5JVI5TkPtUtKq2_J3DrDA", "review_id": "xo0aIWI_JBhhhVHsIDqC9Q", "text": "Great vibe and attentive staff.  Two must haves... the macaroni & cheese and the short ribs.  I am not much of a meat eater but you could feed me the short ribs every day (with a side of mac of course).  The wine list is extensive and updated often and the staff knows which wines to suggest.", "business_id": "GIGI8bJfN6HyPzmEW-QqjA", "stars": 5, "date": "2008-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M2MBHD0Jgz8cp3E68xRyTA", "review_id": "X1_v6KJvfpJqBkQ5k3yCPQ", "text": "Great ambiance.....nice patio area....good bar.  Nice wine list!  While not in France, it's pretty much as close as you'll get in the Phoenix area.", "business_id": "GIGI8bJfN6HyPzmEW-QqjA", "stars": 4, "date": "2011-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "rKvDBqMLL_Y_8w3bRcZ0qA", "review_id": "QTWqK1mon-RV3e7mlHj4rQ", "text": "Nice atmosphere.  service was great.  food was just ok.  ordered oysters, tuna ahi, filet, and rib eye for two.  the rib eye came out already cut up.  didn't like this as I like to cut into my own steak!  a little bit too much salt on everything for our taste.", "business_id": "GIGI8bJfN6HyPzmEW-QqjA", "stars": 3, "date": "2013-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0F0BW71WsLszqLQxcoa5xw", "review_id": "TcZ1X4C9IJ48CyecS02OSA", "text": "Love this place. I've been going to Zinc for several years and look forward to going for years to come. \n\nIt's dark?  Well yeah, that's the point! Those who are uncomfortable in the \"beautiful people\" world of North Scottsdale will not be happy. BTW they have someone the best bartenders in town. Go on a Friday afternoon/evening, sit at the corner of the bar and have fun.", "business_id": "GIGI8bJfN6HyPzmEW-QqjA", "stars": 5, "date": "2014-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "U6Uwhvf-HpigDGmQN6UVrQ", "review_id": "7LZ3ipwHjxbK36sB8XjytA", "text": "Everything I have tried here is awesome! You can't go wrong with your choices! Service is ok. Could be better. Not very personable!", "business_id": "ewZlgc22xN5NNQ1H7U6Y7g", "stars": 5, "date": "2012-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IGkoathSlJmIOBDGo9vUZg", "review_id": "0-ODs4jzKXwkNiMI_JGRPQ", "text": "Whew, garlic.\n\nBeen to a CF only twice before--once in Palo Alto, CA, and once in Hollywood.\n\nI thought that the food was okay then, but not so much now.  I'm usually a fan of pasta at most restaurants--even at Denny's it's halfway decent.  The spaghetti sauce here had so much garlic in it that it was literally the only thing that I could taste on the pasta.  If I wanted aioli and noodles, I would have asked for it.  The meatballs were pretty good, but were PACKED with onions.  I now reek of garlic and onions and my wife won't get near me.  Thanks guys.\n\nHer salad was fairly good, but nothing to write home about.  Nice bread.  Service was friendly.  It was entertaining sitting outside and watching the birds fly in after patrons would leave their tables--they would take bread and raid the sugar packets.\n\nMeh.  Not really impressed.", "business_id": "ewZlgc22xN5NNQ1H7U6Y7g", "stars": 2, "date": "2015-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "kAw0HygRTr8QJ56Vsc_6WQ", "review_id": "iTaFYWTVobCxKmGw2jhhEg", "text": "Pretty consistently good.\n\nTry a hot brisket wedge with tomato and lettuce - skip the cheese. It's available Mon, Wed, Fri.", "business_id": "8pqdYVXF17grawfgP2fZTA", "stars": 4, "date": "2008-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CbFcQNdXUpuizZpd63fm4w", "review_id": "9DsuWQxg98D3M3QTa7IYSg", "text": "I typically don't write reviews but people need to know, so I'll this time!\n\nThis happened about two weeks ago on Oct. 25, 2014. I arrived a bit late at about 8:00 pm and the manager Bradley gave me my room. \nThe room was OK but the problem is that the toilet was clogged! Since I didn't need to use it at this time I called up the manager right away and the discussion was more like this (I'm not exaggerating):\n\n\"Hello, the I wanted to let you know that the room's toilet is clogged! \n\"Well we have plungers, you are welcome to come and get it\"\nYES CAN YOU F******* BELIEVE IT? You are going to a hotel and the manager is asking you to unclog the rooms toilet!\nNevertheless I didn't get mad, or yelled at the guy so I politely said\n\"Well it was clogged from before - I just arrived, so I think that you should be the one to fix it guys\"\nHe said, \"I'm very busy I have to audit some rooms, so I won't be able to come until 10 o'clock!\" \nSince I was leaving to go out, i said \"This is OK please come to the room and fix it at 10\"\nI came back to the room at 12 and the toilet was still clogged! These people don't give a rat's ass about customer satisfaction and it's pretty obvious.\n\nSecond issue, was that the shower wasn't properly working.\n\nThird (and most important for me). If you have an expensive motorcycle or car,  the place doesn't feel safe at all! It does attract tons of shady looking people. When I went out of my room I saw three people (looking like if they were doing meth) around my motorcycle looking at it really close. One of them said, what year is this bike? I said it's a 2013 and then he turned to his friend and said \"I told this thing should be expensive\". That night I ended up having to park in a secure location...\n\nBreakfast - that's wasn't a breakfast at any stretch... seriously just coffee and a cheap small muffin in a plastic bag.", "business_id": "7tXQvYHEFKN0ThGZoY-j3Q", "stars": 1, "date": "2014-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hMTsTR_pQuNfnOWfyoXZ6w", "review_id": "cogPpZEp7giaJjTFikcYoQ", "text": "The people here are so nice and the food is so good!", "business_id": "I2_yeLfTzXHGwi8an0tL4w", "stars": 4, "date": "2011-10-05", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "TBep3v7jQCYbzgJpG1fkyg", "review_id": "9phaw9lwk8rW17ObIYfgrA", "text": "I went into Wisemagic Tattoo prior to there renovation. I had a trad. black and gray koi with some kongi done on my left shoulder. And was impressed with the professionalism and overall studio apper. I have been to other studios ( urban art ) and not impressed at all. However Tanner did an amazing job and has been my fav. tattoo that I have currently for the past 2 yrs. I have sent in lots of people who are looking for work, and my self again will be looking forward to seeing what the new shop looks like..Thanks again really amazing job..", "business_id": "nb7OvZFB1CoZCj-Yruuk-Q", "stars": 5, "date": "2013-09-14", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "DtTuVmtooVyMnGhwPrzLww", "review_id": "uQeR1EceJfD833Zg9amiBw", "text": "We ventured out to Flo's for dinner tonight. Met my daughter and her girlfriend Kylie. My wife ordered won ton soup and chicken pot stickers; Janine ordered the Chile Orange Chicken; Kylie, the Pad Thai with Shrimp and I chose the Basil and Black Bean Beef.\n\nWhen they came out with our food, they hadn't cleared the table of soup bowls and used plates and the server was standing there waiting for the table to be cleared. We ended up gathering them all up and handing them to the server. What's with that, it's NOT our job.\n\nAs for the food, the soup was tasty with enough won tons. It looks like they used pork fat, to give the soup flavor. I think the Vietnamese do the same thing in their cooking. Both the orange chicken and beef was excellent except, there wasn't enough beef for second helpings. \n\nThe Pad Thai wasn't prepared that well, the chicken on the skewer had too much peanut sauce which made it taste mushy. The noodles were over cooked and I couldn't tell if it was noodles or tofu but there was a good portion of shrimp.\n\nI've had better meals and service there...but, I still am a fan of Flo's and I'll be back to try it again. If you get there between 3 and 7 PM the appetizers and drinks are half-off. Can't beat that with a chopstick.", "business_id": "H7KzlC0-o1wIhlGg-Me5Ag", "stars": 4, "date": "2009-09-05", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "5OiNZAaTvKz-dAtHIGm7Kg", "review_id": "i3qjYxhGrueSVvcHvMIcmA", "text": "That's not Chinese Food!  This is so watered down to match the vanilla patrons in Scottsdale.  I find it offensive to be frank.", "business_id": "H7KzlC0-o1wIhlGg-Me5Ag", "stars": 1, "date": "2012-10-10", "type": "review"}
{"votes": {"funny": 3, "useful": 9, "cool": 9}, "user_id": "fczQCSmaWF78toLEmb0Zsw", "review_id": "n7h2bFD4Yzm4QJ-MIqQ2Vg", "text": "While I've been to the Westin Kierland for various occasions including drinks and dinners at Deseo, extravagant events in the ballrooms, and most recently, Phoenix Cooks, tonight is my first actual overnight stay at this huge resort.  \n\nCentrally located just a quick walk from Kierland Commons, and dog friendly too, there's nothing negative I can say about this place!  Friendly staff all around, heavenly beds, and so much more to explore...\n\nMinnie and I are hanging in the room (with an incredible view I may add) while Jared is partying it up in one of the ballrooms, but we plan on taking full advantage of our staycation here tomorrow... I'll be checking out the fitness room, the pool (if the weather cooperates), and maybe even room service.  I plan on updating, but until then, I highly recommend this beautiful resort.", "business_id": "SYqTY48DJa1cYhglvmgvsQ", "stars": 4, "date": "2009-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "ZGfbxU-9wtRDTrfLRzfiMQ", "review_id": "OvSVPTj40ce3oCQOSSGAiQ", "text": "I went here for a staycation one weekend kind of out of the blue.  I mainly picked it from the pool reviews and awesome pictures.  I have to admit, I was not disappointed.  This place is beautiful and not to mention HUGE.  It was really nice walking around the property at night...I actually felt like I wasn't in Phoenix for a minute.  Something I really liked too is that they have a 24 hour pool.  Psh...awesome.  They also had a bar on your way out to one of the patios and it had shuffle board which is only a positive.  Laid by the pool all day Saturday afternoon, the guys that walk around are awesome.  Just know that they close the pool AND the bar at 6PM...weird.  But it is amazing to spend the day by the pool and have people wait on you hand and foot by a hotel.  It wasn't full of kids, but they were there.  It's just a good place if you want to relax to spend the afternoon.  No unce unce, but there is music in the background so that was coolio. I loved the night atmosphere because it was quiet and laid back which is exactly what I was feeling.  If you're looking to party this probably isn't the spot, but if you're looking for an amazing relaxing weekend....this will do it 100%.", "business_id": "SYqTY48DJa1cYhglvmgvsQ", "stars": 5, "date": "2013-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EBMu6Noj9XZwqsxkesXo8A", "review_id": "NO-FumVlbBzHvLaYg1cyyQ", "text": "Over priced for what you get. Associates not very nice. Food was ok.  Bad move taking out pool tables etc.", "business_id": "SYqTY48DJa1cYhglvmgvsQ", "stars": 1, "date": "2015-09-10", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "DqekGNe2lrLV4UI0V5-gcA", "review_id": "Y1ftrpTkY5DxV2KGZabWVw", "text": "Review #300!! I don't usually review chain stores but I found a great pair of Marc by Marc Jacobs sunglasses here for $35 and my boyfriend found a pair of $85 sunglasses for basically free. Good Rack location", "business_id": "WowrRUKvjiLX4zT12xU_yw", "stars": 5, "date": "2012-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "7_XwjOebd1temr3CaqGwpg", "review_id": "XOn8FzuVOZHSGmjQL5J9pA", "text": "I love Cost Plus mainly for the food and wine. When I was visiting Scottsdale, they had a wine tasting on Saturday 1-4, I'm not sure if that happens every week...they have got some quality, unique trade items here and I just love coming here! but I love coming in here to buy cheap wine on vacation!", "business_id": "0Gu2cpJ5x9ZZfDDHohBY_A", "stars": 4, "date": "2013-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 2}, "user_id": "5RuEn7IONyVuvrOimjFSZA", "review_id": "DSz1PxSwwY5wrUKUetzgFw", "text": "Farrelli's Cinema Supper Club is exactly what the name would imply... a place to have dinner/drinks while eating dinner. The unspoken part is that it is FUN.\n\nManagement requests that you make reservations and it helps to secure a good seat. You place your order before the movie starts and receive your food during the previews. The staff is helpful, and operates very quietly throughout the film. \n\nThe movies are second-run. During a recent newsletter, ownership explained that the market power of the multiplex (Harkin's) prevents them from getting the first run movies. The selection is good. They generally show 4-6 movies and I have seen Casino Royale, Blades of Glory, POTC: Black Pearl and Spiderman III there. \n\nThe food is good, but a little pricey. I always order the Chicken Farrelli (chicken, artichokes, potatoes) which is phenomenal. The menu includes appewtizers, salads, burgers, sandwiches and entrees.\n\nFor something a little different and BETTER than the multiplex, try Farrelli's.", "business_id": "-fsCfTYEnJ4s6yStgBnQig", "stars": 5, "date": "2007-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9qrey_kl_L6Jn7o2D67xeQ", "review_id": "D8SwQFviymUOqKm5kp3etw", "text": "Can't remember who I had but I had a young brunette female stylist. Cool thing about here is they give you beer/wine while you get hair done. Also the mood is very laid back and they have the place decorated like a rock n roll bar. I was happy with my results and unlike some salons they don't push products on you. You have to park in back not much parking up front. I probably won't go back though to expensive for my budget I think it was like $160 for basic cut n color.", "business_id": "0nUI6eiZ5uT70qD1Ht9VMg", "stars": 3, "date": "2014-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2FtCOwNwd6UsBgScSc1_Ug", "review_id": "z90PHQv5b4j2cgQQ8Ab-7A", "text": "The Good: \nConvenient location. Lots of programs for children. Family oriented.\n\nThe Bad:\nSpotty customer service. NO information by phone or website. You have to come in for everything (schedules, updates, hours, prices). Ridiculous. Facilities need more updating and maintenance. They are not horrible, but definately could be cleaner. The bathrooms and locker rooms are lackluster and poorly stocked. Some rooms are also not functional/used (basketball court scoreboard).  There are also renovation projects left  half finished (kitchen, concession area).", "business_id": "NKKt_CxHCggMvuvrqJEjSA", "stars": 3, "date": "2014-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UWuHQC1k21VlenVdqKqTbQ", "review_id": "gRP9o2Kv5RlPZ1i0ETnuKQ", "text": "I just had my daughter's baptism catered from Arrivederci and I can't say enough good things about it!  The food was excellent!  I served it to a group of Italians and they loved it!  I called a few days before the baptism and although they open late on Sunday, they opened early for to cook my food.  I ordered shrimp ravioli and chicken florentine.  Although the chicken florentine is not on their menu, they accommodated my request.  The food was delivered on time and was warm.  I gave them my budget and they worked with me to meet it.  We had so much food but little leftover because it was so delicious.  The owner called me the next day to ask how everything went.  That was a great personal touch.  I highly recommend for catering and dinner.", "business_id": "fmWyI5ec05F8PJpx3eNpLg", "stars": 5, "date": "2013-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kZFZLOEAlP38wjZlAgG56A", "review_id": "GfmAUUJCQqrG3STb2hTVPw", "text": "My fiancé and I had a couples lesson today for our first dance.\n\nLesa helped us not only choose a song, but choreograph a dance that was perfect for our lack of experience and let us make it our own. So excited to show our guests the dance! Thanks Lesa and Fred Astaire Studio.", "business_id": "dqqGDOXRO8diBFTxvfnoHw", "stars": 5, "date": "2015-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bSxRMman23jqYU_-aMPOHg", "review_id": "Zjg9Mj9D0EGh9EYZZ2lUSA", "text": "Great bar! Bartenders are awesome, cheap drinks, great happy hour, off track betting is fun too. Small smoking patio which is also a bonus! Great place to go have some drinks with friends and hang out!", "business_id": "_TWT58PWunYIyPgpz1fuog", "stars": 5, "date": "2012-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "ap-xytOsXjrlEf4MUybyZA", "review_id": "ho_iGkm6uX_MvW2g8mnbgg", "text": "If your looking for a fun night out with the locals this is the place. Great live band. Gwen, the owner, was very kind. The BBQ food was good not great, but the reason to come is the authentic country atmosphere and the live music. I, do, recommend the pulled pork with a great sauce. The servers are old school, so get ready to mix it up and the nicer you are the more attentive. The only negative feedback was the entire night was couple 2 step and would have loved some line dancing!", "business_id": "d840tbYJSVn8Fu-n5XRJTw", "stars": 4, "date": "2013-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cl-DJJvcHp_sFollPqjyjA", "review_id": "5A9BGzhDtgtlxiD3WptKQg", "text": "October 2014\nWe have followed our TREASURED VET, Dr. Tanya Lopez to her new location with Scottsdale Hills Animal Hospital.  We've been there a couple of times now and have been completely satisfied with the continuation of our VET services here.  Dr. Lopez and Staff have been helpful and supportive in the care of our 4 dogs, Lady Bug, Bella, CoCo and Gracie.  It's not easy having a client show up with 3-4 dogs at a time!  \nAll of the PUPS love the attention and everyone in the office takes time to pet and love on the dogs while we've been there.  \nThe service has been awesome.  Dr. Lopez hides her HALO well, but it's obvious she is wearing one!\nI'd never go anywhere else!", "business_id": "ul28DO_afdK_gWDLqmudeA", "stars": 5, "date": "2014-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G7NVOlN7inKgnLpjMDIegw", "review_id": "JXvlDVJSs7r_XEcKcp9jeg", "text": "Great customer service!  I had a lamp that I thought would require drop off and potential costly replacement parts. What a pleasant surprise to be greeted warmly and attended to promptly and told the issue was so minor the person who assisted me handed me back the lamp in seconds flat, showing me how to resolve the situation should I ever encounter one like it again.  \n\nWhile there, I took the opportunity to browse around their extensive showroom that offers a extensive variety of selections in all styles and price ranges at very competitive prices. Definitely a store that I will be going back to for my future lighting needs. So glad I found it!", "business_id": "UnoVA__qAASAMbPnrm_puQ", "stars": 5, "date": "2013-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WKdZ9IjeAh-CNCwtUphj9g", "review_id": "2dZeC_9mpn0zYdJLe_BBjw", "text": "These guys are great! Marty came to our home and was very detailed in his explanation of the product, install, and quote. He even let me stand on the posts of the protect-a-child fence. I was able to fully stand on them without them snapping in the middle. The installer, Dane, was very communicative before and during the install. He called the night before and the morning of. Their quote was a little higher than other companies, but the product is exponentially better and they are actually passionate about their product. We went with the black mesh and it does not block the view one bit. It came out looking better than we thought! Very nice to work with and a very professional outfit. I seriously recommend them over anyone else!", "business_id": "WV_JBM_2QtRn40WDlQaTKw", "stars": 5, "date": "2015-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GvcCXI77qSPwddCa2_Gs6Q", "review_id": "cTG9kh7JcGlOrKwlxidIhg", "text": "Food was good, not great. You want an Italian grocer/restaurant just like this but much better......you head to andreoli Italian grocer also in north Scottsdale.", "business_id": "pmIJn8K3offcYUsrFCWAaQ", "stars": 3, "date": "2015-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lOXdWY60YDqvqKWrNKkEYA", "review_id": "ohxy8biRAUTl5_GGudoqZQ", "text": "Outstanding pasta!!  I actually dined at their new location on 90th and Via Linda (old Amarone's).  I was there with the wife, kids, and in-laws and every single one of our dishes was out of this world.  I had the osso buco special, which was rich and delicious.  My wife had the tortellini which was great.  Other peoples' orders included fettuccine, gnocchi, and penne (all great).  We also ordered their ravioli as an appetizer and it was some of the best ravs I've ever tried!  There are not too many restaurants where everyone at the table loved their food, but it was the case this time.  Not being from Arizona I am disappointed that  I will only be able to dine here the once or twice a year that I visit.  This has now become a go to place when visiting the Phoenix area.", "business_id": "gHKB66up5VluCWT4vuSZpw", "stars": 4, "date": "2010-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cxkY2fLCj5mUo_dEHJXx6w", "review_id": "Gmbv_V6D-nrstnEO7lhQ0g", "text": "cant go wrong with this place excellent service and food, I live in San Francisco and they have great restaurants there, This place is on par with any Italian joint in SF.", "business_id": "gHKB66up5VluCWT4vuSZpw", "stars": 5, "date": "2015-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qgpkAv29mkdY6OaEpPZORw", "review_id": "DtQZYiMBhJW-kRF-7inubg", "text": "I have been going to Dr. Tikey for over 15 years!  He is by far the best Chiropractor in the valley!  His staff speaks wonders and he is the icing on the cake!  I have had various back and hip problems for years and he is the only one who can relieve the pain.  What is as special is that any pre-adjustment procedures, whether it is stim, rollers, or ultrasound, it is all considered a part of the adjustment.  No extras here!  Tikey is the best... hands down!", "business_id": "TrSg3MZ-BlhqoXdYYuDxYA", "stars": 5, "date": "2012-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PnH5iWUUXmOAYYW4h6Y2Mw", "review_id": "WlIeUhcqNt_mi7yWNFmScw", "text": "Food was great! Service was the worst I've experienced in a long time. So disappointed. \n\nI went here with my friends last night for HH. I've been to RA before but tonight I had my $20 gift certificate for my half bday. I love this! I used this last year and couldn't wait to do it again. The Vegas roll is amazing! Now to the service. I initally sat inside but when my friends arrived we went out to the patio. The male server who brought me my drink inside was great! When we went outside and had a new server everything went down hill. First the server only brought us 1 menu for a table of 3 people. We had to ask for the HH menu and she dropped it down and walked away. When we ordered I asked if she could leave the HH menu there in case we wanted to order more drinks and she got an attitude with me (wasn't the first time) and told me she needed to make room on the table so she took it from me. I've noticed that the last couple of times I go to RA they leave the wasbi off of the sushi plates and I have to request for it when i receive my rolls. I had to do this last night and she again responded with an attitude and walked away. She never asked if we wanted refills. She was upset when I was trying to explain who was going to pay what with our cards. She came back with our cards she handed my check to me and mispronounced my name purposely (it's Jaime) so...  gave her my gift certificate and it seemed like the total owed was off she ignored us when we tried to call her over. She looked straight at us and kept walking. I just paid and left. I have no clue why she was in such a bad attitude but it's ashamed because I love the food and she made our experience horrible. Never going back there again and I'm going to vocalize our experience to my friends (at least not at that location).", "business_id": "nk6_ipMkmUvUtq6Xvncf0A", "stars": 2, "date": "2012-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "wRD-UOmN5K0dlX5aMjm5gQ", "review_id": "yaPNGqlIYVvnszKBfNbRjQ", "text": "I have to tell you that I have never been very impressed with Claim Jumper locations before. They have always been known to have large portions, but the service and the food has just been average. Starving after a flight and getting settled into our resorts, we ended up here for dinner. The 5 of us all got a huge booth. Our waiter was quick to get our drink orders. We ordered steaks, a pot roast and a spinach chicken salad. Two of us shared to meals and the waiter was gracious enough to have the chef split both plates so that we didnt have to. Again, our waiter was great. It turns out he is from Marin and grew up in the bay area. It figures. He made sure we always had our teas and waters refreshed and was there for us when we needed anything. Everyone was more than satisfied with their steaks. The salad and pot roast were great. I think the veggies in the pot roast could have used a few more minutes, though. If you are having trouble deciding where to eat, are really hungry, want to make several different people happy, and are near here, I recommend checking it out.", "business_id": "29g8OBj2FnklSGyl-Dnx0g", "stars": 4, "date": "2007-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mk3VP7t_47_WmRJMRu-wjw", "review_id": "nyobDmZ7aX_EpfvE1O_1YQ", "text": "One year later, I still really like this place. Tons of pedicure chairs, a great \"bar\" for manicures, and a huge staff. The place was busy and we did not have to wait for our turn. Great nail art and a hot stone massage included in the reasonable price. Very clean, cool decor, and friendly service.", "business_id": "Q-hSD_aOi3S5s2zWNvwD4w", "stars": 5, "date": "2015-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rwa9cUouOz8_BtjDfU_H0A", "review_id": "J5b33DKXKYMta2P3BrvVBg", "text": "Fantastic tailor, excellent work, quickly done at a very reasonable price. I  highly recommend", "business_id": "Njp35LiBmRenNUDn-Jbp_Q", "stars": 5, "date": "2013-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 3}, "user_id": "ynGxw3zZqAjahVou563zXQ", "review_id": "js2aCGgD-1y3CotaQ9Amhw", "text": "Being from New York, Caribbean food is always accessible.  My neighborhood there is mostly Dominican, and that's what you find more than anything else.  The southwest, logically, tends to lean heavily toward Mexican establishments.  Since I haven't been home for months, I was happy to read the reviews for Havana Cafe.\n\nI got an order of picadillo to go.  It came with white rice, black beans, and platano maduro (Ripe plantain).  All were very good (ok, the picadillo wasn't quite as good as mine, but I'm partial to my own cooking).  My friend got a Cuban sandwich that was above average.  I thought the prices were average.  I'd definitely return to eat in the restaurant, which was comfortably decorated.  The girl who took our order was friendly and polite.  The Cuban bread she threw in for us was awesome.", "business_id": "8v1MWkAeU3nEuqGd27jZeQ", "stars": 4, "date": "2007-11-07", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 2}, "user_id": "XqMkm-DD9VsdcKx2YVGhSA", "review_id": "kVsOPjMFZZa491f5X9zmxg", "text": "(Lyrics - Barry Manilow - Copacabana)\n\nHer name was Betty, she was the owner\nWith chef hat covering her hair and a chef coat pressed and fair\nShe would do Flambe and add some salsa\nAnd while she tried to be a star\nBo Bites always attended the bar\nAcross the crowded floor, they worked from 8 til 4\nThey were fun and they had each other\nWho could ask for more?\n\nAt the Cafe, Havana Cafe\nThe hottest spot north of Phoenix\nAt the Cafe, Havana Cafe\nFood and passion were always in fashion\nAt the Cafe .... they plate and ate!\n\nHavana Cafe is a long staple of the Phoenix valley and one of those gems that every foodie needs to discover!\n\nUnfortunately, for me the located is a little off since it doesn't look too appealing to the eye from the outside simply because of what's around it.  I think signage of the restaurant is fine.  \n\nMy partner and I ordered based on the recommendation of the server; the Sailors Paella and the Pulled Pork.  Overall, my favorite of the night had to be the Seafood dish - a mixture of crab, clams, mussels, scallops, shrimp, calamari, and fish on a saffron rice.  The pot came out nice and warm and my first bite reminded me of some homemade meal with love!  I wasn't too crazy about the Pulled Pork, but not to say it wasn't good.  Cooked with Habenero peppers and bell peppers this dish had some pop!\n\nIn the end, the service here was surprisingly very good and on top of things.  Very knowledgeable and my water was filled at all times.  The ambiance might need a little spruce up.  I'm no decor expert by any means, but I didn't care for the fake plants and the furniture was lawn chairs.  I've never been to Cuba, but if that's the idea then I would definitely have a makeover to capture the American style and flare. - Enjoy!", "business_id": "8v1MWkAeU3nEuqGd27jZeQ", "stars": 4, "date": "2014-09-24", "type": "review"}
