{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "o9t7nO4hUiP88FQ_WEvdOw", "review_id": "jnsG2mFZlgdU4tPXFOnsNA", "text": "I had a pretty good experience at the Doric.  Yes, the restaurant is upstairs and you have to do a little exploring to find the staircase.  The food was decently priced and the beer was pretty good.  Service was fast and helpful.", "business_id": "aFVO6hoFlOCN8pKsmJbWjw", "stars": 4, "date": "2009-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "jWcEmZE9_B_po1j_MUvfyw", "review_id": "ye4gCvcvrlLbQXYsGtew-Q", "text": "Visited April 2015:  \"Splendid palace of history\"\n\nMy friend lost her ticket during packing. We went to the check in counter, and they were able to locate the ticket, and she decided to purchase the souvenir book like I had reserved. We walked around the grounds, the ruined abbey, and the state rooms. While in the state rooms, I was taking pictures when I was approached by someone who works there. She informed me that no pictures were allowed, and I thought I was going to be asked to remove them. I was not. Therefore, I am glad I purchased the souvenir book, because the items we saw, the rooms we walked around, and the art we viewed was breathtaking. I was happy that I walked up the 25 steps to see Queen Mary of Scots chambers. The Abbey was breathtaking, and your ticket is good for a year.", "business_id": "F1-S8DkAsFIyrkfTl9MmlA", "stars": 4, "date": "2015-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ucm2FEblVVATTcigDimj9w", "review_id": "lIj1h4htoYkqglsuJz9lTQ", "text": "Good place to have breakfast. The price is fair. You can have breakfast here under 10 pounds. free wi-fi.\n\nThe service is good. The staff are friendly. I had a hot chocolate and it was amazing. For my breakfast, I had Eggs Florentine which was also good. My friend had Blueberry Stackers which was fine. I recommend this place to have breakfast in.", "business_id": "8RXIwWR34JunHKd00UU4wA", "stars": 4, "date": "2015-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Xk8WOG4_2sayloIV7A7Y8g", "review_id": "2N81taaO-s4_5brMm8Jz0w", "text": "Nice enough atmosphere... Average brunch food... Awful coffee, which in my mind is unforgivable. Wouldn't go back.", "business_id": "KqgeyLdYbfsd9veyR6UGtw", "stars": 2, "date": "2015-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "n7GxX7M8EyqSNE-Hz6Is3Q", "review_id": "5Rn8esbbXrwl61lz8YwtaQ", "text": "Service was kind of crappy both times we came here.  Once was for a meal and the second time was for a beer and dessert.  The food was okay and the beer acceptable.  Not great, but not bad.", "business_id": "zpsDyx9wh7LYjtBLTpu_-w", "stars": 3, "date": "2015-11-14", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "IJgPLtqT8bisthHezjbGCg", "review_id": "LJ0XvrzVAUKfJOXP18pXZg", "text": "Our Dynamic Earth is spectacular. And I mean that in the literal sense that it is a spectacle, rather 'really, really good'.  If you're under 10, both of those are probably true, but older visitors will probably feel in places that it's a little bit of a wasted opportunity.\n\nGood things first: it's obviously been tremendously well resourced. Divided into discrete rooms, every space in Our Dynamic Earth is a lavishly produced multi-media extravaganza, from the moment you step into wobbly-floor 'time machine' to the moment you leave. \n\nIt also doesn't seem to suffer from Millennium Dome Syndrome (too much cash + too many cooks + lack of clear vision) - the whole thing is totally consistent and very creatively executed. My 5yo spent the entire visit with his mouth open, full of questions and really enjoying the interactive elements.\n\nBut here, I suppose, is my one reservation - although I wouldn't say it was *shallow*, the actual content sometimes doesn't justify the presentation. In several rooms (the 3D theatre for example, or the section about water erosion) the science is shunted off to the side like an embarrassing necessity.\n\nFor each room like this though, there are another four where information and presentation gel perfectly, and my son really learned a lot from the experience. We've been back again since and I'd thoroughly recommend it.", "business_id": "Rza-FztnKi8YfcSkn1KxgQ", "stars": 4, "date": "2014-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6GiCNlObz5jWy9PPSAXP7A", "review_id": "1pGe3YUVDV5Nub14KZiszg", "text": "Two stars and that's really just for the cocktail. \n\nThis review won't be full of oooohs & ahhhs and other surprises. \n\nTo me, this is just another chain doing standard run of the mill attempts to get American diner experience. I don't get it. \n\nService was ok, the food came all hot and the were no problems. The beef chilli nachos barely had any beef chilli - I was expecting a little mound but instead got little flakes.\n\nThe taco tower was ok - nothing that really sang to me. \n\nOverall from this and a past experience people will have to drag me in for food as I'm not convinced.", "business_id": "u-JyVztsrx2f9sZKm5FvWQ", "stars": 2, "date": "2015-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "6rHsdkI1m788cyq8cx7r1Q", "review_id": "pMbtXCzTiXDTm2e66a7syQ", "text": "So a real ale and whisky bar, which sadly are two things I don't drink, however I really liked this place the staff made lovely suggestions for things I could drink and also it felt like a local rather than a tourist spot. Certain than I will return, (one of my best friends lives opposite), and it was just one of those places that feels like a local with warmth, I suppose it does feel fashionable what with all the signage for various drinks on the walls but this place was doing that before it was ever fashionable (been here several times before over the last 20 years or so).", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 4, "date": "2015-11-23", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "_lmmIZeJTv8roWn8qU3oIQ", "review_id": "NhJp5PPgP2B8A5QZmzlKoA", "text": "What do you want from a sandwich shop? Well, if you can start with a love of sandwiches, it's a good sign. Caffe Espresso - Bingo.\n\nThe \"Number 9\" baguette has long been legendary in my workplace and so I toddled in with high expectations. When the lady before me ordered something simple, the man behind the counter served her with cheery mock-disapproval, claiming that the order was not a sufficient challenge. When I then asked for the legendary Number 9, he lit up. \"The Number 9? That's my BABY!\" he declared in delight, and immediately set about compiling its various delicious ingredients for me (grilled chicken, taco sauce, cheese, rocket and jalapeños).\n\nI don't know about you, but for me, a fellow who can talk so passionately about a sandwich is definitely the person I want making my lunch.\n\nHis infectious enthusiasm led me to explain that this was my first sampling of the legendary Number 9, and his mood elevated still further. \"It'll change you,\" he promised, and began explaining the spiciness options. I pondered a moment over Entry-Level or Smokin'. \"You know what,\" he continued, \"I'll do you a half-and-half if you like!\"\n\nOh, I do. I do like. Thank you.\n\nI had a moment at this point to glance around the weeny shop - about the size of my bedroom, the walls covered in boards reciting the most mouthwatering sandwich combinations imaginable and some pretty spectacular-sounding smoothies. It's homely, colourful and cheerful, with even a tiny bit of space to sit and eat if you can't bear to take your sandwich away from its birthplace.\n\nFor less than £5, I was - as promised - lifted to a higher plane of sandwichness. Another previously Un-Number-Nined colleague, beholding my delight as I returned to my desk consuming the legend, ran straight out to get one for herself and found herself equally transported. \n\nI don't think I've ever been so overwhelmed with joy by a mere baguette; while the enthusiastic service and jolly establishment go a long way toward this score, the proof of the sandwich shop is in the sandwich. The baguette: warm, crusty and soft. The filling: rich and perfectly balanced. Don't expect to eat it elegantly, though; there's a lot stuffed into that baguette and it tends to behave with the same wild exuberance as its creator.\n\nI can't wait to try the rest of the options on offer, and some of those amazing-sounding smoothies. Until then... this has been a YUMinator review, starring Sarnie Schwarzenegger. And believe me, Caffe Espresso: I'LL BE BACK.", "business_id": "jNftD8BQ41UX4AImsXSsjA", "stars": 5, "date": "2013-09-04", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "WLIX8BUtQRHT7muIkVTWbg", "review_id": "_jttdP6LbFRZSDmqmoEF5A", "text": "I wanted to dance and not pay to get in a club so CCs is always a good choice on a Friday or Saturday night. The music is current top 40 and you can dance your ass off until 3 am. The place can get crowded but there are 2 floors so you can move around the place of it gets crowded. The front are of the club has seats but it's way too loud to chat and lounge so you should just get up and dance when you're here. \n\nThe cocktails are pricey... About £4-6 depending on what you get but at least they don't charge you to pay with your card. They recently renovated the place and while I think it looks smaller now, it does look much nicer than before. There's a coat check but for £2 (last time I did it) I'd prefer to just chuck my coat in the corner while I dance. It's a restaurant during the day but truthfully I've never been interested to try their food... So this is just my go to place when I wanna dance which usually is every weekend... Ha!", "business_id": "lSIyCvaWZl-Ex9y3r2nDPg", "stars": 3, "date": "2015-10-25", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "_by5qmyrZgisBF7v90JWaQ", "review_id": "oizwJrMk6GNMEBEkqSHTRg", "text": "WHOO HOO !!!  Just heard The Dome is putting up its Xmas decs next weekend. Must be the best place in town for a Xmas night out. Always make a point of popping in to see it", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 5, "date": "2013-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "igrcay6xC1S7YKefxOxfgQ", "review_id": "WOEVekZJwFilYl1XfFRp8Q", "text": "Nearing the end of my 7 day stay at this hotel and I have nothing but praises for this establishment. I am here on business and have been working some very odd hours. Each morning when I go down for my cab, I see the same friendly staff. Every time I enter through the main lobby, I am greeted by a friendly face and it was only the evening I came home at 2am that I did not see anyone. This night I ordered room service and wow was I surprised. The food was very good and just right after a hard day of wrenching.\n\nThe breakfast on the club level is delicious and I honestly think I've eaten smoked salmon every morning. This isn't due to a lack of variety, but rather because it is not common back home and is so fresh. \n\nThe room is quite nice with very modern amenities and architecture. I love the hidden lighting and full size bath. The bed is super comfortable and I've used it quite well over the past few days.\n\nI know where I'll be staying next time...", "business_id": "DIlh3Ta7-7tfjKL1apaYHw", "stars": 5, "date": "2013-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "zidFiD6K5X4Y-OQ1GqIY5w", "review_id": "E-hqS-nSgQdzyPPWa7d7UA", "text": "Stopped here for lunch before my visit to the castle.  They have prix fix menus for 30 or 15 euros.  The 15 euro lunch menu is a good deal but menu is limited.  You get an appetizer and entree with this menu.  I actually ordered a la carte and had to try the haggis - when in Rome right? (in this case Edinburgh). Well the haggis did not disappoint and it came with neeps and tatties - what the hell is this I asked myself.  Turnips and potatoes FYI to the Americans. The other stuff I tried were ok - steak tartare and the chanterelle risotto.  \n\nOverall, a good dining experience with attentive service and a nice ambience. This is a strong 3 star rating.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 3, "date": "2010-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "xMYW0-20bBTYU2R7nGP83Q", "review_id": "XlBl39iC8ogLHdaXecMkOA", "text": "We arrived for our stay last week in the Armoury Suite.. I have to say the pictures on the website does not do it's justice!  for a diehard five star traveller this place was by far one of the most spectacular places I've ever stayed in... we were surrounded by the magic that Edinburgh has always offered, not to mention their wonderful candelit breakfast in their private dining room the following morning, the food was something out of this world!  we will definitely go back...Hat's off to The Witchery and their entire staff!!! Many Thanks!", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 5, "date": "2015-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FyZrFFfuLaFA6QXbO5UbBg", "review_id": "ZIF4enFTPx7FUiNWoD95AA", "text": "Interesting and fun attraction with quite a nice meal/restaurant at the conclusion.", "business_id": "HSYVkG67Juu-G693xz2ViQ", "stars": 4, "date": "2014-10-16", "type": "review"}
