{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7XnqLCNQ0NKcRUoNKJa3OA", "review_id": "E_7udo0YA3ffjy5yXHf_HA", "text": "This place has some pretty darn good pho. The prices are reasonable and the portions are large. The broth is very flavorful. My only gripe about this place is the lack of sliced jalapeno peppers. The seating is also quite cramped if you are coming with more than 2 people, but don't let that stop you from coming here. Nevertheless, I'm looking forward to going to this place in the deep Pittsburgh winter to warm me up and clear up the nose.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 4, "date": "2009-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bghXhLvvBKx_t8Qtx-KSkw", "review_id": "ew3NM-EcI1JYfZIf7qcvXg", "text": "Pho Minh is this cool little family-run noodle shop that is great for both sit-down eating and take-out.  The food isn't the best I've ever had, but its quality is consistently good, particularly for PIttsburgh.  This place would probably still get three stars in a town with a larger Vietnamese populatrion, and in the Burgh it deserves four.  It usually has a mixed crowd of Vietnamese patrons and non-Vietnamese.  This is the place I used to regularly turn to on non-Tuesday nights (they're closed) in mid-Feburary.\n\nUntil about three years ago, the broth was a little erratic.  Some days, it was quite flavorful and others watery.  Then, the in-laws showed up (I'm assuming from Vietnam), and the consistency and quality of the soup broth shot up.  The pho is significantly more flavorful than nearby (and only) competitor Tram's, and the family that runs it is much friendlier.\n\nFood highlights -\n    The pho is above average, particularly if you order it with beef raw (aka \"rare\") on the side.\n    The green papaya salad with dried beef (#12) is spicy and fabulous.\n    The fried spring rolls, both with shrimp and vegetarian, are excellent.\n    The shrimp and BBQ pork dish (#43) is one of my wife's favorites.\n\nFood cons - \n   The chicken pho is a bit meh.\n   The fresh spring rolls tend to have wrappers that are a bit too gummy and thick.  All I end up tasting is the roll, rather than the basil-sprout-crunch inside.\n   They always have omitted hot pepper slices from their tray of pho fixings, something I tend to enjoy.\n\nNotes - If you tend to like the raw beef in your pho, it's often kept in the freezer (for Dept. of Public Health concerns).  Then, it's often best to order the pho to go, heat it up to near-boiling on your stove, then serve it so that the broth is at a temperature high enough to cook it in your bowl, giving the broth a nice beefy cloud, as well.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 4, "date": "2010-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BZx0Spj4ljD5Fi-ZbMB0pQ", "review_id": "0hN6mCsG2EV9YDu0D3wDpQ", "text": "So I seem to have a strange handicap.  My first pho experience was at Lulu's Noodles in Oakland...  and it has set the bar.  Yeah, the noodles aren't quite right, and the broth is not quite right, either...  but...  the chicken is GREAT.  It's nice and tender.  \n\nSince then I had some pho in California and the broth is better...  the noodles are better...  but the chicken is weirdly dry and tough.  I don't know how chicken cooked in soup can be dry and tough, but it is.  \n\nIn that respect...  the pho at Pho Minh seemed quite authentic.  Noodles were good, broth was good - but chicken dry and tough.  Why does Lulu's have the market cornered on tender chicken in their pho???  \n\nMy son had the beef pho and the broth was SO much tastier than the chicken - the chicken was OK but it's the beef broth that is awesome.  \n\nMy biggest problem was I thought the portions seemed kinda small, for what you paid.  I guess they are adequate, but not super-satiating, for a pho crazed adult.  My plan was to share mine with my two toddlers, we tend to be light eaters, and it was kind of tense.  I expect a bowl of pho to be giant, based on my CA experiences.  I guess if we go again, the girls are going to have to get their own bowl to split.  \n\nI guess it is a credit to this place that my two picky toddlers liked it so much!\n\nDecent pho, portions kinda small, service REALLY slow.  (I think we were in there 1 1/2 hours!  For a family of 5, not a huge group)  Will probably go back, but we want to check out Tram's first.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 3, "date": "2010-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DcQobAk5lNJw6pVI4nVN1Q", "review_id": "zZ1X7BTCPdhQR9KuTHrEew", "text": "First of all, a disclaimer. The only thing I have ever ordered here is the Pho Tai. I spent a semester in Vietnam eating Pho on an almost-daily basis, and now it is my comfort food, what I want when I am sick, tired, or sad.\nThat said, I can recommend the Pho Tai without hesitation. Out of the 3 Vietnamese restaurants I have been to in Pittsburgh (this, Vietnam's Pho, and My Ngoc), this has the best pho. The broth is quite good; fragrant and savory. \nI both eaten in here and gotten take-out. Eating in is a pleasant experience. The dining room is tiny but spotless and bright, and the free pots of tea are a nice touch. The take-out pho is packaged very thoroughly and intelligently. In a plastic tub goes the broth, beef and onions. The noodles are packaged separately in a little plastic bag so they don't get soggy before you have a chance to eat. All the fixings, including copious amounts of basil and bean sprouts, are there, including little tubs of hoisin and chili sauce.\nDelicious, authentic pho prepared by a friendly family. The only downside is the cash-only, which is a huge PITA.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 4, "date": "2010-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Jou7l2wJvM7ZgqspikTw9Q", "review_id": "YHnJZ0rmplRN-JTEQ61JYA", "text": "I had my second bowl of pho in Pittsburgh here, and although it was better than my first bowl, it was still pretty disappointing.  The broth is everything for pho.  Pho broth takes like nine hours to make.  The broth at Pho Minh is bland and almost clear in color.  Good broth should be dark and pungent, not like watered down chicken broth.  I had the combination beef with tripe pho, and there was literally about five small pieces of beef in there.  I guess since there is not much competition here for Vietnamese food, the $8 price tag is valid, even though that's much more than what I normally pay for good pho elsewhere.\n\nWe also ordered the deep fried spring rolls, and that was a disappointment too.  Mine was also still cold in the center, so I can only guess that they are frozen beforehand.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 2, "date": "2010-09-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "YTHnhkhUY9m83m915xsjJg", "review_id": "eNQ0ZjRmxJ5LQKELcRL8cw", "text": "Tram's Kitchen was closed, so my girlfriend and I went up the street to Pho Minh instead. \n\nHere are my gripes:\n- Food was WAY too salty (ie. we were both bloated like hell the next day)\n- Restaurant was WAY too quiet (they need to turn on the radio or something!)\n- Service was slow (or they often forgot simple requests like water, etc.)\n\nI will credit them for their spring rolls though... and the sweet little man who runs the cash register! (I think he's Minh's husband?)", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 3, "date": "2010-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x8He0Lb78elcW7XJGCvL0Q", "review_id": "2v_Y3vV35e-9WZnZ-5WU4g", "text": "I go to Pho Minh often, but not for their pho, which is okay but not what I would call good.  I usually get their rice or rice noodle dishes served with grilled pork/chicken/shrimp.  The food, in terms of authenticity and quality is okay, but I have to take into account the fact that we're in Pittsburgh and it's hard to find many quality Vietnamese ingredients here.  However, the food is decent and the service is good.  It's a family business, and the couple that owns the place are very nice and courteous.  When I get too lazy to make some Vietnamese food for myself I go make a quick run to Pho Minh.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 3, "date": "2011-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "MLZ9xHl8odrUaDbi1fzbAQ", "review_id": "tPHLJtYa98HIPf4tu3L4nA", "text": "In sum, I very much enjoy this place. Hence the 4 stars. I probably order out from here 3-4 times a month. It is my 2nd most favorite Pho in Pittsburgh. I don't stray from my favorites dishes below, so I can't speak beyond what I will post. \n\nFor an appetizer, I order the Crispy Shrimp Rolls. Oh my! What little pieces of crispy, shrimp heaven. They are smaller shrimps, but the price is affordable so I don't mind. In my opinion what really drives this dish to excellence is the Vietnamese dipping sauce (nuoc cham). From what I learned about nuoc cham, every Vietnamese family has their own twist on it. The ingredients in nuoc cham are generally the same, but the proportions vary based on personal tastes and regions in Vietnam. According to Vietnamese cookbook author, Andrea Nguyen, \"as you move south the sauce gets sweeter, hotter, and more garlicky.\" YUMMY!\n\nI thoroughly enjoy the Pho Meatball entree. I LOVE fresh herbs and spices. Pho rice noddles served along side crunchy and light bean sprouts. Fresh cilantro and basil. I consider myself a Pho Meatball amateur connoisseur of sorts. I only order this dish, no matter where I eat Pho at. I like the way they slice the meatballs at this establishment unlike other places. It makes it easier to grab with the chopsticks =) Also they have less grisley pieces in this meatball Pho. I've never dissected them, but assume it is part tripe. The flavor is moderate with the slightest hint of kick. Also the lemongrass in the soup broth is so amazing. It is the epitome of Vietnamese comfort foods in my opinion. Coupled with the addition of Sriracha chile sauce and Hoisin sauce they include on the side is amazing. \n\nThe staff are polite and quick. One never waits long for your food. It is a little disappointing that they open for dinner so late. It would be nice to grab something right when I get off work versus waiting for 5pm to roll around. However, I cannot deny that it is most definitely worth the wait! Oh and like others have said, they are NOT OPEN on TUESDAYS. Odd, I know.\n\nThere are two things to be mindful of 1. If you are dining in- your portion size of Pho will be larger. This is not just at this Vietnamese place it is pretty much the norm for the other Vietnamese places around the PGH area. 2. Cash only. This last one is a major pain to me. I am not the cash and carry type of person.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 4, "date": "2011-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tg2ZgoGyGVthzba7vS9M6g", "review_id": "nElgLkdDmAlnGzI4bWV46g", "text": "Excellent Pho and very reasonable prices. Excellent food. Authentic Pho - and my Vietnamese friends say this place is the real thing. Best bargain around.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 4, "date": "2012-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wAC6lUAeDDBCyMITI7dJ3w", "review_id": "5d-QvWxcwb5jkvVoEEmBOA", "text": "Craving for some more authentic Vietnamese pho. Yelped and found this place in Pittsburgh. Drive 80 miles from Morgantown, WV and found the pho is good. when I first walked in, I was a little bit skepical because everyone else was white! Lesson I learned before was that this could be a sign that this restaurant would be tailoring to american taste. But since I drove 80 miles already I decided to give it a try. the menu was pretty small comparing to mecca of Asian food (Southern California). Ordered the Pho dac bet. When the pho came out, i thought it would be like the Southern California size as the bowl was decent size. But the pho and soup were sitting at the bottom of the bowl, about 1/3 full. I was a bit disappointed. I loaded up my bean sprouts into the hot soup and did a quick stir to cook the raw thinly slice steak. The pho was actually pretty decent. The soup was flavorful and the pho was well cooked. Just wish the amount of pho and the ingredients could be more. I ended up having a roast beef sandwich at Nadine's afterward.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 3, "date": "2012-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cBlrub58cAqt_ExQ_yHdvw", "review_id": "QHp1T6nmUD0mpIhSdyMKPA", "text": "The pho is excellent! Good portion, price. The rare beef was rare, unlike most places. The soup was very flavorful and delicately spiced, and you get all the types of condiments you could possibly want. Combine that with the good service - especially that friendly old man. The free tea served in ceramic adds to the feeling of authenticity.\n\nThe haters on these reviews probably aren't from around here. You can't compare this to little saigon or something - not the right locale or resources. But it's pretty damn good.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 5, "date": "2013-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FSySr7QrtJF004UCyWCypg", "review_id": "sf7iDFDuGjTOde4Yj9-5WQ", "text": "Great pho, my favorite so far in Pittsburgh. The service was good too! It's cash only but that's fine as long as you prepare.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 5, "date": "2013-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "P53OLhwsEW09f6nnmeyvkw", "review_id": "1KXkZeeLX4aA3i4dJv2JHQ", "text": "I've only eaten here once and I had vegetarian options. I thought the tofu was flavored well. I really liked my time here and I will be back!", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 5, "date": "2015-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "fVnY5R9Wx8nhER6iWhcrsA", "review_id": "xZYg3xWMbEGJdwVqtHBJ6Q", "text": "Why did I ignore this place for so long?  I keep hearing off comments about this place.  \"It's ok.\"  \"It's decent but other places are better\" \"It's not as good as what you're use to (I'm from California)\" etc etc.  So I was never interested in coming here.\n\nToday, I was working nearby and decided to stop in for the first time.  I have to say I was pleasantly surprised.  I decided to give the pho dac biet and spring rolls a try.  I was happy to see a pot of jasmine tea waiting for me when I put down the menu.\n\nSpring rolls were good and was satisfying.  The pho has a nice light broth.  I like light broth.  Didn't feel too overly heavy and I can I feel I can enjoy it perfectly without hoisin sauce.  Portions were great and huge. The beef was good, it had chicken in it which I thought was good, and I am happy to say they use the good meatballs.  Other pho places I go to don't use the correct meatballs.  I finished my entire bowl.  \n\nThe place is small.  Restrooms are basically closets.  I get hit by the door every time I go into the restroom.  But hey, I found it to be clean.  \n\nThe decor was nothing special and they had Vietnamese music playing in the background.   They have the recognizable chairs that you see in most Vietnamese restaurants.  Everything about this place reminded me of home back in San Diego.  I felt the food was good and satisfying.  The people there were nice, checked up on us, and they were conversating with other guests even with their broken English.  I thought that was cute.  Prices here are a tad cheaper than other places.  Cash Only probably has to do with that. \n\nOverall, I found my experience here pleasant.  I liked the pho and I will definitely be back to give the other dishes a try.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 5, "date": "2015-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "AFNTPG5UmvJMuyWM7IPlPQ", "review_id": "G3OfeO-u7NesxBCuPNkoqA", "text": "If you are looking for good Pho in Pittsburgh Tram's Kitchen is the place to go.  The broth for their pho is quite flavorful and you can't go wrong ordering a bowl of it on a nice cold day.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2006-10-26", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "rKur7W37yHFJX0WTpeOyyg", "review_id": "lemnzlT15gIlR5hpFHpjzw", "text": "I've eaten Vietnamese food all over ... from Little Saigon in Orange County, CA to Seattle to NY.... and this place ranks up there with the best of em. But don't come to Tram's for decor or ambiance. Everything inside is very bare bones...you'll get a chair, some chopsticks and sriracha sauce... but  you're guaranteed to get a delicious and a very economical meal. The food was very fresh and filling, and the restaurant pulls in a steady crowd. The pho is excellent, and they also have menu options for vegetarians. This place is a hidden gem among the restaurants in Pittsburgh!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2007-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UzqOYLCssQS2FBcDq5HwkA", "review_id": "38jAfgYtgb4vhb7wLHgALg", "text": "Hole in the wall - check.  Stern (at times) owner who rules his roost - check.\n\nI don't really trust a Vitnamese restaurant to be really really good unless it is a hole in the wall kind of place.   :)  And this place is good.  Now, my one beef with this restaurant is the limited menu.  But really, they do everything on the menu so well that you can't really complain.  And the prices are extremely reasonable.  Make sure you get the fresh rolls.  I usually get the vermicelli with a little bit of everything on top.  And unless you are ridiculously hungry, get the smaller bowl - it is still a lot of food.\n\nBYOB, so feel free to bring your own alcohol of choice.  I can't remember what the corkage fee is, probably because there is none, I believe.  And bring cash.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2007-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Iseb_IvqOEfY_p1m9OwTrw", "review_id": "Ym0craSM8RqKm4JII6bZGA", "text": "The first thing that charmed me about Tram's kitchen was the tablecloths. They are exactly like the tablecloths I saw in a little hole-in-the-wall restaurants throughout Vietnam. The decor is very similar to what you'd get in Vietnam, so if you don't like the decor, you probably should never go to Vietnam. \n\nIn terms of food, the service was quick, the food was piping hot and quite delicious. I was expecting more fresh herbs on the pho, but the complex broth more than made up for any lackings. \n\nI will definitely be heading back to this cheap, tasty hole-in-the wall.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2008-09-12", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "Zff7xm0J-C7hV1z3j-JipQ", "review_id": "5k2EpfTOyUbVpY-Jl0_Bvw", "text": "Peter B. got it right. Order the Pho, order the spring rolls, and I'll add order the summer rolls. These are all good. Other things are not worth trying. I love Pho, and I have it all over the country. Tram's is NOT one of the best. However, when you're in Pittsburgh, and you have limited selections, it is the best. For that PhoFix in da Burgh, you gotta go to Tram's. \n\nSometimes I think the Yelp Rating needs to be aware of the circumstances. It's not dumbing down, it's just knowing your surroundings. Tram's - you get 4 stars from me. Thanks for quenching my pho thirst.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2008-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "BbdJmtbeiUVKlGK_bfoDTA", "review_id": "rXD-AkSDc3D1RbJwjhE-SA", "text": "Meh. I was visiting from NYC when I ate here before a show at the Brillobox. The beef pho was sub par. Food took about 10 minutes to arrive when it did the beef was already cooked through (that's a BIG no-no in my book). I could hardly make out the star anise in the broth, and the bean sprouts had seen better days. The framed PPG review says Tram's has the best Pho in Pittsuburgh; if that's actually true, then the state of  Pho in Pittsburgh is in bad shape.\n\nI also tried the vegetarian satay that my wife ordered and it was pretty decent, so plus one star for having vegetarian soups, and more importantly, actually trying to make it good. It beat the pants off of the veggie Viet place on 6th st. in NYC. I kinda have my doubts about their interpretation of \"vegetarian\" though I kept that to myself...\n\nAs others have noted, the decor is kinda dumpy and the guy that took my order was surly, but I wonder if there's some kind of inverse halo effect going on here. Some hole-in-the-walls are just that: a hole in the wall.\n\nAlso: $8 for Pho does not make for hole-in-the-wall pricing.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 2, "date": "2008-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Xc3cunuZI5XGmz8Xhthdvg", "review_id": "-Dp5zg2oImoBb6hNeY_bMg", "text": "Wow! I am so glad Miss Alison suggested this place while we were in town. She's vegan and they have plenty of options for her. We came here with friends for dinner after Day 1 of selling at Handmade Arcade. We got there just in time since it got packed shortly after we sat down. There was a slight language barrier, so instead of getting the chicken with crispy noodles, I got tofu, but you know what? I didn't even notice until 5 minutes after eating and then I looked across the table at my friend Jessica's dish that clearly had chicken and we had ordered the same thing. Oh well. I don't regret it at all. It was delicious and I ate every bite. Also the vegetable gyoza we started with was very tasty. Will definitely add this into my rotation of Pittsburghian restaurants I hit up when I am there. I heart Pittsburgh!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2008-11-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "bFXCfVe5Ln--JxeV5yoiXQ", "review_id": "q9-zUlNbCIi4uNILQhE8wA", "text": "Ok, I have to give this place a 5, and no JUST because of the delicious food.  \n\nI'll preface my story with its probably the best Pho/vietnamese in Pittsburgh...yada yada...delicious...yada yada...cheap...yada yada...great pho\n\nBUT a lot of ppl have said its no-frills, angry servers who throw food at you.  And this has been the case a few times before my story tonight.  I've never minded.\n\nTONIGHT though...i went to get some take out pho on a snowy evening.  I had to wait for a few minutes...and the owner was nice enough to engage me in conversation while I waited.\n\nI get my Pho...paid..and I get in my car...and drove away...\n\nA block later, due to the snowy weather and my inability to slow brake...I squealed to a stop when some guy ran out into the street.  I did stop in time, spared his life...BUT MY PHO WAS EVERYWHERE!  Most of it was in the bag, but a good portion was on the floor...on the seat...MORE IMPORTANTLY, NOT IN MY BELLY.  So I drove into a parking lot...had to dispose of the mess...and cried.  \n\nNow not only did I NOT have pho...my car now smelled enticingly of beefy broth.  So in a moment of frenzy, I thought...What the heck...im only a block away, IM GETTING MY PHO.\n\nSo I went back...and got my pho!  AND...the guy didn't even charge me.  He was SO nice and he was like \"You said you dropped it, I believe you! here!\"\n\nomfg, I EFFING LOVE THIS PLACE.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2008-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "h0yc9-lOhe0du42G2X7zrw", "review_id": "W_KSbnrNAD2tbE1pK7ISDg", "text": "stop 4 on our 7 state pho tour - and everything else you read is true.\n\nmy thoughts were like this...\nsmall, border line clean, authentic, no tripe?, took forever to get food on the table, excellent pho, nice little place.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2009-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "GSKY-zWTManYbMGXmRDb3g", "review_id": "vS-pM1n2Fhmd-48jfLu1tw", "text": "I'm Vietnamese and I grew up eating Vietnamese food everyday.  Let me tell you, this place is a big let down.  I don't know why people are giving it such rave reviews.  All my Viet friends in this city also avoid this place because it really is NOT good.  \n\nThe portions are tiny, and the pho broth leaves you unsatisfied.  It lacks the true flavor that pho broth should have.  I've had pho at home and in 30+ different pho restaurants and this was probably in my top 5 most disappointing.  As for the other dishes, it comes to the table looking like someone already ate it or like a jumbled mess.\n\nThis is aside from the service..I actually like the old man that works there...he's the only reason I give it two stars.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 2, "date": "2009-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wGYrpbpm9g0-ixpRS__ISw", "review_id": "mck49AWhAN57HBQ847L8WQ", "text": "Only been there once and I ordered the Pho Hanoi; I would say that even though their Pho Hanoi has noticeably  less ingredients than that at Pho Minh, the chicken was absolutely the best chicken I've had -- probably chicken breast -- as opposed to the usual chicken \"unknown parts\" that one usually gets at Chinese or Vietnamese restaurants ....", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2010-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bghXhLvvBKx_t8Qtx-KSkw", "review_id": "2ev_8J7kQ2skB4VzxTXXQQ", "text": "I've been to Tram's several times, always hoping for a better experience, and more importantly, better food.  I eventually gave up.  The food tends to be bland, the owner brusque, and with Pho Minh just up the street, I find myself going there when I'm craving a hot bowl of pho on a cold Pittsburgh winter night.\n\nFood highlights - \n   None that I can really think of.  The food is cheap.\n\nFood cons - \n   The component that makes or breaks a bowl of pho is the broth.  It is the one thing that must be good for the soup to be enjoyable.  I've never had any hint of real flavor from the broth itself (before you add the plum sauce and the srirachia and basil and lime).  This is something that Tram's has gotten badly wrong every time I visited.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 1, "date": "2010-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "HPyUAXN-Srx-VVPpznzHmg", "review_id": "isVuEDbUePORA0DcrltbwQ", "text": "Very good noodle soup and spring rolls. Great hole-in-the-wall restaurant in an OK location. Service is variable, but you probably should not be going there for the service anyway. \n\nOne thing I wish is that they had more seating. Several times I went there, the restaurant was full, so I had to eat somewhere else.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2010-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RL2AGNJcUOnlUp45gF1avA", "review_id": "NVBv8B7I7GRnghwXppvLTw", "text": "Best fish sauce everrrrrrrrrrrrrr! For the eggrolls which have alot of taro in them so its very fragant", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2010-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "86lPnxq14I4n2STeK07FEw", "review_id": "DA1lcea4csmWFMbP8U-1Sg", "text": "Trams has Vietnamese food and it's in Pittsburgh.  So if you're craving spring rolls with peanut sauce or vermicelli with fish sauce and fresh herbs, this is the place to go if you're in Pittsburgh.  Be forewarned - if you've had Vietnamese food from places with large Vietnamese populations, Trams satisfies an urge but it's definitely not the greatest.  They're stingy with the herbs and the peanut sauce; a bit on the expensive side for this kind of food (especially for being such a dive); the pork is dry; and the vermicelli bowls are pre-mixed - even the fish sauce has already been dumped in.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 2, "date": "2011-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "pF0xEzciwQKRGmnQneSDRQ", "review_id": "jZOXvaBE4eoiGvOxBNQNdw", "text": "Just wanted to briefly point out to Seth M. that the waiter with one arm is Tram's father. I was told by my sister-in-law who befriended him a long time ago that his family sided with the American's in the Vietnam war (perhaps this explains the arm, but I'm not sure). Most of his family took refuge in the states, but for some reason (not certain why) his daughter, Tram, was detained in Vietnam while the rest of the family trekked to the States. He opened up Tram's kitchen and then, eventually, Tram reunited with family in the states. Last I was there, the only two servers were Tram's father (wish I knew his name) and Tram, a father/daughter server team.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2011-10-14", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 4}, "user_id": "LFJglYRfXSdthKTcCg0qjw", "review_id": "-_72wr5Rq7EiWYUT4qaHKw", "text": "Food: Tram's is one of the true hidden gems in Pittsburgh and serves The best Vietnamese food the city has to offer.  Fans of Vietnamese food surely know Tram's by now, but those who haven't tried yet need to.  The menu offers appetizers, meat, seafood, and vegetarian options.  But there's no reason to order anything but the Pho.  There are many options, but keep it simple.  Pho real.  It's unbelievably tasty and filling.  One bowl will have you stuffed, but if you have a massive appetite, the spring rolls are also huge and delicious.  \n\nPrice: One person can gorge themselves with tip included for under $10.  The prices here are ridiculous considering the quality and quantity of the food being served.  If you're on a budget, this should be a regular stop.  It should be regardless.\n\nDrinks: the Thai iced tea is good, all regular drinks are offered, no booze\n\nAtmosphere: If Tram's was to be criticized in any way, surely this would be it. The dining room is almost but not quite dirty, and likely hasn't changed in 10+ years.  What some may see as a blemish others may view as character (me).  Hey it's Tram's Kitchen, and we're just eating there.  Wear a blindfold, you'll still taste the remarkable food.  Cash only.\n\nService: A waiter will be to your table with water before you even hit the seat, and another will be over for your order within 60 seconds.  Thats why you just order the pho.  There's no wasting time at Tram's.  Sit down, order, food comes quick, bill shortly after, eat, go home.\n\n(+): Tram's is a can't miss restaurant in Pittsburgh.  The only way to miss it would be driving past it without realizing because its so small and indistinguishable on Penn Ave.  The food and price are unbeatable.\n\n(-): Some may be slightly turned off by the atmosphere.\n\nWould I go back again? Routinely.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2011-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x8He0Lb78elcW7XJGCvL0Q", "review_id": "9PsgJN_mR6T584np60QTGw", "text": "I've been to Tram's Kitchen a few times with friends and I hear good things from people about this place.  Personally, I don't see what is so special about it.  It's kind of a hole-in-the-wall kind of place, but the food is what I expected walking in.  Spring rolls are not flavorful and has too much minced meat and not enough of veggies for a good balance.  Also, I suspect they are the frozen variety and are not made in house.  Summer rolls are meh....  They're big, but again nothing special.  I've had the pho here and once again Pittsburgh disappoints me in the quality of pho that it has.  At Tram's, the pho bowl is small.  I don't expect a huge basin-size bowl, but a bowl of pho needs to have enough noodle, broth, herbs and spiced.  The meat is too overcooked for pho tai (pho with thinly sliced beef steak that is supposed to be cooked only when the boiling hot broth is poured in the bowl).  The taste is reminiscent of pho but isn't quite right.  You need to want to take your bowl and drink all the broth at the end of the meal and you should feel satisfied and be in a comatose state after a good bowl of pho.  This wasn't it.  \n\nThat said, the service is nice.  However, I didn't feel too comfortable/relaxed eating here.  It was dark and crowded (and a little bit dingy).  I prefer dining at Pho Minh to satisfy my Vietnamese cravings.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 2, "date": "2011-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wrC5WZEPPb2IAM22kFsORQ", "review_id": "AijKYqbLXcizAlGCLImfNQ", "text": "I pretty much got my dad obsessed with pho when my family came out to California for my graduation in April. Everytime he calls me now he asks if I've had any pho lately. So, when I came back to the 'Burgh for a visit he was all about finding a Vietnamese place in the city to get some more. \n\nMy parents and I had spent the afternoon in the Strip District, and enjoyed a few beers at Roland's before heading over to Tram's for dinner. We were hungry and the portions were huge, tasty and the reasonably priced. We decided to get three different entrees and all share. Obviously, we got the pho with beef, the fresh spring rolls, a spicy/bbq shrimp plate that came with white rice, and a vermicelli bowl with pork. \n\nEverything was pretty tasty. The pho broth was a little salty for my preference, but it had a wonderful lemongrass aroma and taste. Also, usually I get fried or garlic rice with any rice dish I order from my favorite place in Cali, but the shrimp was very good and not at all over-coooked, as so many places do these days. The vermicelli dish was right on, and other than the fact that I prefer egg rolls to spring rolls, those were tasty as well, especially with the dipping sauce they provided.\n\nI'd give this place 3 and a half stars. It was, overall, a good dining experience and service was quick, despite the neighborhood being a little sketchy and the inside being a little divey. \n\nAlso, a personal comment. I firmly believe pho is a miracle cure for the cold/flu. Anytime I get sick I head over to my pho place and order a huge bowl with beef and then add plenty of Siracha sauce. I always wake up the next day feeling like a million bucks.  So, if you're feeling sick (especially around this time of year) try it out. Even if it doesn't work for you, you'll still get some tasty food : )", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 3, "date": "2011-11-15", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "-DB39x1W62_OiShDYrSfdg", "review_id": "Y2j6rCSf3Lp7_HCFQo3EcQ", "text": "Great pho. Small, vegetarian friendly and not at all boring. Go to there!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2011-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UOHbBzUVkdbANV8fz-1gNw", "review_id": "4nKfCqK0wDYdpROdMR4EXw", "text": "Every time I'm in Pittsburgh, I make time to go to Tram's. Get #17 and order spring rolls. If you've got adventurous taste buds, you don't mind the lack of atmosphere, and you aren't looking for a pampering staff, then this place is quite the hidden jewel. I highly recommend a visit!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2012-09-11", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "t07Ko8NaHv2e4fJqAXJC8g", "review_id": "cDu16CrYSbBwzZNZFu9B-w", "text": "Pittsburgh isnt a city known for its culinary prowess, but there are little gems around town that I can always find myself going back to. Its not about amazing food, its not about cheap food, its about good value, and thats what Trams is. Their spring rolls might not be something to write home about, but the coconut vermicelli is great, and something you are seldom to find elsewhere, in fact, i havent ever had that anywhere else in my american dining experiences. vietnamese coffee is like intense dessert here, and a nice sugary-caffeinated pick me up thats not unwelcomed. Go to trams! get some noodles n'at!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2012-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "o15O-dSPJmo9yz3vw82XAw", "review_id": "x0M9AfY7y2b4J8SDUlM_0A", "text": "Great food, awful service! (although some days the server has a less apathetic disposition than other days). I think that every time we've been here we've had chicken or beef curry with vermicelli, and it has been great! The lemon grass tofu was a pleasant surprise. They don't take reservations and the wait can get pretty long; come after 8 pm. BYO.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2012-10-26", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 2}, "user_id": "qaMsP2zsLnelcd4Hj60TmA", "review_id": "OLm3eTI-6Cch9p83x3DfwA", "text": "What a great place! Such remarkable, tasty food coming from such a \"dump\"? Who knew?? Been here quite a few times and have always enjoyed the plentiful, tasty, cheap food. If you need atmosphere or want to impress, this isn't for you. If you want to thoroughly enjoy some fabulous Vietnamese food, this is your place! They do great takeout too. If I lived closer, I'd be here all the time. Best Vietnamese food I've had in the city for sure!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2012-10-31", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "0P58MD0FRVI6pTVKUpd7YA", "review_id": "ZC-ed70bAVpyDZrbwGVGCw", "text": "Ok, so this place has the whole soup nazi feel. You get a little rushed when they are busy, and I get the feeling that the guy gets a little pissed if you take too long to decide. That being said, the food is awesome (if you can forget about the little food inspection mishap), the waiter has mad skillz, and if it's not busy he is also pretty cool to talk to. I say go, but be prepared and know what you want in advance, especially if you get flustered by being yelled at to hurry up...", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2012-11-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "p9OvcIakpDoDXl0Lez5CJQ", "review_id": "p53QxJJQ7j48TKo9izXCow", "text": "if you're going out to vietnamese for the food, go here. if you're going out for the ambiance, go somewhere else. when you walk into tram's, you'll be seated and handed menus and approximately 45 seconds later be asked if you're ready to order yet. the staff is pretty get-in-get-out-get-going style. it is byob though, which is pretty cool too.\ni ordered the beef pho soup. i really enjoyed it. like i said, if you're going for the food itself, you should definitely check this place out, it's pretty damn good.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2012-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3pPIgpym9ZCrvDh5TCVSNA", "review_id": "1XqFC2pvzVGju0j5BEge2A", "text": "Love the Hanoi Pho and spring roll. Nice plump shrimp too. Do yourself a favor...it's far from a fashion spot, just real good eats. Reminds of what SF's Tenderloin excellent Cambodian and Vietnamese were back before everything cost an arm n a leg.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2013-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "XNHYOiR2t2zw3TMhYjruQQ", "review_id": "dtRrKvlP7kzpb5SkXTaqeg", "text": "If you grew up in a part of the country with lots of Vietnamese food or have eaten it in such places, you're not going to be impressed by Tram's.\n\nI gave this place two tries and was disappointed both times. I will admit that I only tried the pho and a vermicelli bowl (on separate trips), but having ordered anything else on each of my trips would have put my bill in the neighborhood of $12+. Having grown up with cheap Vietnamese food in Texas, I wasn't prepared to spend that much for what's supposed to be a budget lunch, even with the understanding that I was going to leave hungry and that the lack of non-European ethnic diversity in Pittsburgh is going to automatically make things more expensive.\n\nEither way, I don't understand the hype surrounding this place. The pho bowl was small, with a tasteless broth and child-sized portions of noodles and meat. After a few bites, I drenched the whole thing in Sriracha just to give it some flavor and to try to trick my stomach into feeling a bit more like I had eaten something.\n\nThe vermicelli was not so great either--a small portion of vegetables and noodles with a few too-thick chunks of pork that were not grilled long enough for any sort of darkness or crisp (but which still managed to be dry). The color of the dish was as bland as the taste.\n\nAs for the atmosphere, not a big deal for me. The restaurant is small, with minimal seating and some dinginess to it, but that's fairly common for older Vietnamese restaurants. Most diners are young, hip, and not Asian (which could be a turn-off for some due to the perceived lack of authenticity and/or hipsteriness). Parking is a chore; if you live nearby and choose to give the place a try, walk or ride your bike, or prepare to find yourself circling nearby blocks of permit-only parking.\n\nFolks who dine at Tram's should keep in mind that cheaper, better, more authentic Vietnamese food exists out there. I grew up in North Texas (Dallas-Fort Worth area), where with one of the largest Vietnamese populations in the country, good, cheap Vietnamese food can be found all over the metro area. Pho portions down there are reasonably big, there are plenty of different meat combinations, and you can almost always choose the size of the bowl you want (usually kid's, small, large, and extra-large). Additionally, due to the presence of plenty of fresh ingredient suppliers and competition, prices are more in line with portion size, and the food is, more often than not, good. Most folks with normal appetites are able to leave satisfied having spent no more than $7 or $8 a person with tax and tip (compared to $20 at Tram's). Out of all the Vietnamese spots in North Texas that I've tried, my absolute favorite is Pho Pasteur, in Arlington: The pho, vermicelli bowls, crushed rice dishes, spring and egg rolls, and prices are all excellent. Tram's would be put out of business if anyone ever opened a restaurant like that up here.\n\nIf none of the other few choices in Pittsburgh are satisfying your Vietnamese food cravings, it might be worth it to take a weekend trip up to Toronto. You would also have access there to some other Asian foods that we don't have here, such as dim sum and Taiwanese \"small eats.\" For a slightly shorter drive, you can also find these things (though more sparsely) in the D.C. suburbs.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 2, "date": "2013-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I93LsaJIdXCp5Wr_cmI98w", "review_id": "65xpuEP3fl5WpwqVKJlqgQ", "text": "Great place for a cheap, but quality asian food. The portions are nice and big and they are not cheap with their meet like many places in town. I like going there for a casual dinner from time to time.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2013-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kRrg7nU-BJpW1xDQptNH1g", "review_id": "GYxp68K7acnUSToHnu6Dgw", "text": "We live two doors down and this is our jam. It satisfies my pho desires in a major way. Every day we see them in the backyard garden getting fresh veggies for the evening. Don't mind the one armed owner. He knows his food is good so he can be mean. It is cash only but there is an ATM in the front.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2013-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "Pe6o1SR3T98ONB_SXaHd6Q", "review_id": "ZORIh8KvyJFwmJIrRdpXcw", "text": "As soon as I feel my seasonal head cold coming on, I know where to go--it's Tram's! No better way to flush out the sinuses than with some spicy as h%*! soup. I usually go for the Mung Bean Noodle soup (with chicken) but there are several options. While the food is delicious, the ambience of Tram's isn't the best so I usually get mine to-go. This is actually even more fun in my opinion because when you get take-out, they package all the ingredients up separately (noodles, broth, bean sprouts, basil, limes, chili, sauces, etc) so you can mix how you like at home! Spicier the better for me!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2014-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YAvFN_0NaxOT74O1zqYaaQ", "review_id": "l1NvKaoOd6BWhAtZFk-lcg", "text": "I was born and raised eating Pho and this honestly was the blandest I've had. Then, to mask the bland no taste of the soup, it was smothered in black pepper. On top of that, my meatballs were quite dry, even in soup.\n\nHowever, their spring rolls were great!\n\nThe service, was not the best. We were seated and then grunted at (literally) to take our order. From there, people who were seated after us, had their food before we did. They had a very similar order to ours. Then, when I did receive my food, the man hovered near me and then started pouring sauce onto my plate, telling me how to make my pho. I know how to make it! And even if I did need help, I was barely just given my bowl and getting my bean sprouts in first. Give me a second.\n\nI had high hopes based on the reviews, but unfortunately, I don't see myself coming back here again.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 2, "date": "2014-09-15", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "IQs-rsJ8Wwad2vyzQJyB0Q", "review_id": "wM1uneUZ3XZuU9f1ksyQxQ", "text": "I love Pho, but I haven't had too many chances here in Pittsburgh to try it. On Saturday we were heading to Tram's Kitchen for lunch. The place is quite small and unnoticeable and it was quite packed. We were quickly seated and handed the menu, which is not very extensive but still with plenty of variety. We had the fresh spring rolls, the eggrolls and the fried wonton as entrees and I went for the Mung Bean Noodle soup with chicken for main. All the food came out promptly and was really good and fresh. I have to admit that it was not the best Pho I have eaten, but it was definitely something I would come back for. The staff is very friendly and accommodating as well. All in all, a very lovely and friendly environment and experience and I would definitely come back for more.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2014-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "hru2IDwSyN61sgWPtJw_hA", "review_id": "iD3DkJQ3jAAOtzq2Famgtg", "text": "The locals know:  if you want Vietnamese food, EAT AT TRAMS\n\nThe locals also know:  sometimes the service is bizarre, like ridiculously bizarre, like the time my friend and I were seated at a huge table, and we were eating our entrees and a larger party came in and they made us move and were NOT nice about it, when they were the ones who sat us there.\n\nBut the food is so good.  Its like I want to be mad, but their vegetable spring rolls and again, food is so good.\n\nThis place is a hole in the wall, I would not recommend this as a first date unless your potential date was the one who suggested going to Trams.  Cash only.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 3, "date": "2014-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YJNGJF3wZFDqT5ut0XVdkA", "review_id": "OEQcEhH8Pifrs1kXj0B2Kw", "text": "Very disappointed! Pho is ok, not bad. The pork chop rice is horrible, worst Vietnam pork chop rice ever. I had tried PHO restaurant in NY, NJ, MD, VA, PA, and NV. This is the worst. I will never try it again.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 2, "date": "2014-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q4_kY8bBeigYPVS0Ak7QGg", "review_id": "1v0I1bYxuK6EqBB9YO8hog", "text": "Given the wide array of chinese, thai, vietnamese, etc. food throughout Pittsburgh, Tram's Kitchen falls somewhere in the middle.\n\nThe wife and I decided to stop by before an Unblurred Friday on Penn Avenue.  At around 5:30-6pm on a Friday, the place was pretty slow, but that didn't last very long.  By 7pm there was a line of people waiting to get in (there isn't a waiting area, so it seemed most people just waited outside until a table would leave).\n\nWe decided on spring rolls, pho and the highly regarded pork noodles.\n\nSpring rolls - these were the star of the show.  Plump, crisp and plenty of flavor.\n\nPho - the broth itself was some of the best we've had in Pittsburgh, but the rest of the soup really didn't live up to the same standard\n\nPork noodles - not too bad...  the pork was great, but there was barely any of it on top of the noodles (maybe a better portion would have changed our thoughts)\n\nThe owners seemed nice and a bit overworked due to the crowd.  Overall, we're definitely glad we tried it, but I can't see us going back.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 3, "date": "2014-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EYAqA1-Q6kS-J9T8TyYiww", "review_id": "k4jTXzFbiM5wwwhnWfIazQ", "text": "Can't beat the food, price, and atmosphere. I'm a vegetarian and have a hard time finding good veg-friendly pho. Trams had me covered with a \"pho-style\" vegetarian soup, which smelled and tasted very similar to its beef counterpart. Another plus to the veggie pho was the incredible garlic taste added to it and the cloves floating in the bottom - yum!\n\nI can't believe how great the prices are here. It's cash only, but the day I was here the atm wasn't working and staff wasn't too empathetic or helpful for customers who had trouble with it. The staff was very helpful and knowledgable but serious and down-to-business, and not one of them ever acknowledged  a \"thank you\" from any customer during the entire time we were at the restaurant. Don't take it personally, it's part of the vibe here. Also, BYO.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2014-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 1}, "user_id": "0QBBKU8DBjmWZ5qzq7V_Gg", "review_id": "aX0DMzHzKuIorN2TFbGrGw", "text": "One day along time ago I moved from Los Angeles where there is Pho as far as the eye could see to Pittsburgh where selection is very limited. I found this place yelp first day in pittsburgh and since then has completely redefined what Pho is suppose to taste like. I ate here easily twice a week, keeping it simple with pho and fresh spring rolls.\n\nThis place gets a bad rap for having a hole in the wall vibe. Most of the best places have this look and feel! Open minded people who have a taste for more then just meat and potatoes will love this place.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2014-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fehtPlpIEgsleikdcBPsGA", "review_id": "dEPCvnz5_quAp0UU6MsHAA", "text": "I had the fresh spring rolls and the pho, both are great.\n\nConsidering prices of all restaurants in Pitt, the prices here are very nice! For a large pho, it was $7-8. Spring rolls were $1.50 each.\n\nThings to note: cash only\n\nAlso, you can get the pho with beef, chicken, or meatballs. You get a nice portion, but the pho does not include tripe, tendon, flank, and other random meats you'd normally get with your pho elsewhere. \n\nBesides this, broth was excellent and portion/taste was great.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2014-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gQXEI2GXMphvDwGoUvSbHg", "review_id": "xLWHCa5-kPoaiPfuDQJGbw", "text": "Tram's has the best egg rolls and spring rolls, hands down!  Their pho is perfect for cold weather.  I like the atmosphere also, feels like you're in someone's home almost.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2014-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aU_zecjEUd8ixDXqWrK2kQ", "review_id": "2BZdb_vitNR6R0_lMHDwWg", "text": "Come with my boyfriend when every time he visit pittsburgh! Very tasty, local, and affordable. Only problem is we have to park alone street. Other than that, foods is awesome here! Oh! Remind it's cash only!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2015-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vJbwF85YHzFZNj6ne_gzfg", "review_id": "8d8BiKcREOyF-EvDMEorkw", "text": "Tram's is delish. Found out about this spot from yelp, thanks yelp! \nService was quick, got waters as soon as we sat and asked to order a minute later. I ordered the vermicelli cocoanut combo plate. When it came I was surprised there wasn't more sauce. Came with 3 shrimp tails on and what seemed like very shredded boots of pork with little like brittle straw crunchy things, and then smaller pieces of chicken and peanuts. It was delicious. Great flavor, sweet. Added a bit of heat and it was so good. Glad to know that Pittsburgh has a good Vietnamese place nearby. Definitely recommend. You won't regret it.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2015-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NChl6bTuhngG6_R4-pp20w", "review_id": "h_vQhKuptTpFMdsfrzRU4Q", "text": "I've only been here a handful of times and while the food is good, the one-armed waiter is curt, and the smell is horrendous. I'm guessing the place hasn't been cleaned since the Nixon administration. Either that or they actually buried Nixon under the floor boards without proper mummification. There's gotta be better Vietnamese food in PGH.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 3, "date": "2015-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "v2UWj7_aLg5eBzHB7ITbVg", "review_id": "Aml0uIVTMdFVrNuk0U6VAw", "text": "My husband and I stayed in Pittsburgh for weeks and wanted to have pho. I read about good stuff here but was very disappointed.\n\nWe have had Vietnamese food in other states before but here is the worst. We ordered Pho hanoi and mixed fried rice. Soup has no flavour and it seems to have excessive MSG. EGG roll and fried rice is too greasy.\nService is not friendly.\n\nWe don't want to go back.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 2, "date": "2015-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IcTPoc1Ffd7iwXjXp37OsA", "review_id": "ok1jRv97nNG0FRMxSry1rA", "text": "What an awesome little place! My friend and I used to go here for lunch often in the 1990s, and we went today in 2015 for a little reunion lunch! It's terrific! Awesome pho and awesome fresh spring rolls! Definitely deserves its numerous awards!!!!!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2015-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fvXIzBT5JP3cbwuN3YP06A", "review_id": "rJbpQTCssPyyKreKDC4LFA", "text": "Even if you've never tried Vietnamese cuisine, and not sure if you'll like it, I can pretty much guarantee that you'll like it at Tram's.  Amazing food.  Best spring rolls in the city.  Sate soup is amazing, same with Saigon soup.  They only take cash, which is a pain in the butt, but it doesn't seem to stop anyone from eating there since the food's so good.  Everyone who works there is pretty attentive and nice if not a little hasty and rushed at times.  One of the best places to eat in Pittsburgh.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2015-10-18", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "UkRImxxzNGUGrt9OqAc3tA", "review_id": "ZjQv5dCd_J3qLrzrLnXv2w", "text": "I love Tram's. I don't know much about Vietnamese food, but it has been my experience that the best fucking Vietnamese food in the whole world is tucked away in this little gem.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2015-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bmgdjZmyp2hpBpbIH8vgMQ", "review_id": "ovzvqcjuDb7u-U24N6wV0A", "text": "I usually cook at home, and you know home cook is the best. We stop by this place to try their food out. The foods are absolutely amazing. Servers are fast, friendly and helpful. My bowl soup was still hot when i finish the bowl. And you know what that mean :) . You should give it a try.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2015-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pNdlhoYFIy77wi7OV7u74Q", "review_id": "Wj0HXbxG_NtEFg4KFb-8lw", "text": "Feels like a family diner, complete with shouting matches in the kitchen. Food simple and reliably good - best pho broth in city.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2015-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cOrbRK1ZXTGe5_rG5wFOvA", "review_id": "Q05D88Wqi6wI-b2YiRw3iA", "text": "Came here with a group and ended up ordering the regular size Pho Hanoi along with beef as the dish's meat. Was pleasantly surprised at how flavorful the broth was. It's definitely one of the better tasting pho broths that I've had in pho around Pittsburgh. Noodles were alright, what one would expect in a dish like this. Not too floury, but also not too thin (to the point of falling apart). The pho also came along with a dish of bean sprouts and basil. I mostly used the bean sprouts, which came fresh.\nIn general, I found it to be relatively satisfying. I'll have to come back sometime to try some of their other offerings, but so far a good first impression certainly helps.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2015-11-24", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 3}, "user_id": "HZeFzs42f0iGaA-sP_hUnA", "review_id": "DOG38ZUuG2buO5U4NAH8Qg", "text": "I am a long time Vietnamese food fan... this place is right across the street from my office, so I hit it up for lunch pretty regularly. \n\nI've had the beef and chicken pho, and the bun (noodle bowl thingy), not tried the sandwich yet, but I will.\n\nThe soup broth is great. The noodles are tasty. \n\nThe beef soup is my favorite - it contains the yummy viet style meatballs, rare beef, and brisket. Only complaint is that it should come with more herbs, but this is Scottsdale... not Da Vang or Maxim on the Wessyde. \n\nThe spring rolls are pretty good. I've had better, but I order them sometimes, anyway. A Viet spring roll is wrapped in rice paper, with noodles, pork, shrimp, and herbs inside. Not deep fried. Yum. Eat with peanut sauce, and some chile sauce or sriracha.\n\nThe bun (noodle bowl) is really good, too!\n\nIt's clean, the service is fast, and the food is tasty and healthy, unlike most everything else in that shopping center. \n\nTo the person who said they never saw a Vietnamese sandwich before... fail. :( It's a wonderful result of the sad history of French colonialism in Vietnam, and these days, typical Viet fare. I love them at Da Vang, and will have to try one at Tea Light some time soon. Expect an update when I do! But... the pho is so good, I don't usually stray from it. \n\nDown side: With a belly full of noodles, I want to take a nap.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2008-11-21", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "ImDYqf-OmMvQxOl-tGaH5Q", "review_id": "PjP_VdHQP1aezIUCXmB92A", "text": "Looove their pho. It's a pretty tiny place, but really clean and everyone is really friendly that works there. It's in a great location too. It's the closest Vietnamese restaurant to me so I go there the most often, in fact I'm going there for dinner tonight!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2009-09-08", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 1}, "user_id": "J9SyqyIsWyca5v3Z4GyrJg", "review_id": "FJ17LjZZF5jlCjgfAU1SSQ", "text": "Deliciousfoodandspecialperkownerblendsexoticteasfortraditionalmedicinalpurposes.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2009-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HCBo0Kvfm9yXErR-YuqVGA", "review_id": "1FDxgjLSRdkZ_FS4aG3xdw", "text": "Love this place b/c it reminds me of the amazing Vietnamese I could get in L.A.  I've been searching for it since I left and I have finally found the noodles, bbq beef, eggroll, cilantro and fish sauce combo I fell in love with the first time I had Vietnamese.  I can't say I've tried anything else on the menu b/c it's so dang good, I can't stray.  Since I was there two years ago, they've thrown a little money into the decor and it's turning out to be a pretty cute joint.  They also started doing fancy green teas, hot and cold and have made some menu additions that look tempting.  It's right next to the movie theatre and I go there any time I'm on that side of town.  I wish I lived closer.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2009-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FEdeDneIRH2IjKfneDA-vw", "review_id": "P2uI6-6hsHyZWEEUUqYphg", "text": "Got a dinner to go at the Tea Light Cafe last night and was really impressed.  The chicken pho is delicious and comes with the toppings (noodles, chicken, cilantro, etc) on the side.  \n\nWe tried the chicken and the beef bahn-mi which weren't completely authentic but really good sandwiches regardless.  Overall, really liked the food.  Only mistake was to try and pick it up on a Friday night around 7pm.  The parking lot was filled with movie-madness.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2009-11-07", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "fH9OSIlijo9Obp8ZDq8rBg", "review_id": "TAk9t_iguyzmv_U_k5IlkQ", "text": "What a great little spot!\n\nWent last night and I ordered the pho and she ordered the chicken soup. We both loved our food and would go again for sure. The pho was so good, I finished the whole monsterous bowl! \n\nThe owner (I am guessing he is the owner) was working and was very helpful. \n\nDon't be discouraged that this is located in a strip mall. \n\nDo yourself a favor and give it a try. It is cheap and worth the experience.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2009-11-19", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "VgxEe7fPMo8FpTIOnsBhQg", "review_id": "-NoyR7pw-KSply90360hZg", "text": "On a hot day, on a cold day.  Pho is the Vietnamese version of Chicken Soup for the Soul. YES, we live in a climate where 75% of the year is over 90 degrees. But really there are few things as great as the healing properties of a good bowl of Pho.\n\nMy fiance and I have been coming here for years - and within the past year - they have really made some improvements.  They've redecorated, and improved their patio furniture (yes, we've actually eaten Pho outside in the middle of summer!)  They've even gotten new plates/bowls.  Just when we thought they couldn't improve they did!\n\nTea Light Cafe is an amazing little Vietnamese restaurant located on the cusp of North Scottsdale and Phoenix.  Location Location Location:  Conveniently situated next to the Harkins Cine Capri and Buffalo Wild Wings at the Scottsdale 101 plaza - it is a high traffic area.  Perfect to grab a bite before a movie - OR, if you are like my fiance and I, perfect to grab a few beers at BWW and then head to Tea Light Cafe for some REAL food.  \n\nFor all the positives of the location comes anegative.  The menu is a bit toned down and you're not going to find the ultra authentic foods here (no tripe or tendon!).  North Scottsdale isn't quite ready for that.  What you will find is a small menu with all of the essentials you need.  A fantastic minimalist approach - offer a smaller menu but offer everything on the menu to the level of perfection.\n\nLike clockwork the super friendly owners and employees know our order.  Beef and Beefball Pho Noodle Soup for me, Vietnamese Pork and Vermicelli Noodles for my fiance, and of course an order of super fresh, light, cool spring rolls to start.  Perfect to combat the heat.  Oh - and a cup for ice tea - because they have some of the most amazing ice tea brews.  Soo refreshing and flavorful you don't even need sugar!\n\nif you decide to split the Pho I believe they charge you a split fee.  But because we always order two entrees - they bring out a small bowl so my fiance and I can share (the portions are huge and there's no way I could finish a whole bowl).  A wonderful, fresh, huge meal for about $20.00!  And let me tell you - nothing beats a hangover like a huge bowl of Pho Noodle Soup (doused in Chili Paste and the Rooster of course!).\n\nAlthough I've never had the Banh I have friends who have ordered it and loved it!\n\nThe one other thing I suggest is to eat at the restaurant.  The food needs to be fresh and hot to really enjoy it.\n\nHot or cold temps - nothing's gonna come between me and my Pho!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2010-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J9SyqyIsWyca5v3Z4GyrJg", "review_id": "A-PVKD8mCAtdO18iLujfaA", "text": "Delicious food and \"special perk \"owner blends exotic teas for traditional medicinal purposes.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2010-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "VXPg5er78K997n_cXMDRlg", "review_id": "clyL4xaqjg1LPLBWe8ld3Q", "text": "The bubble/boba tea was absolutely disgusting.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 1, "date": "2010-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hMTsTR_pQuNfnOWfyoXZ6w", "review_id": "KdWo-2hU-InJAkTI67G37w", "text": "My girlfriend and I love this place. The pho is awesome comfort food. It just feels right in the fall. Be sure to use the sauces on the table to heat things up!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2010-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "e9HWnHUYlt9758oileaISw", "review_id": "oOmItzrWHQorenkr1uZ7XA", "text": "Oh boy! Where do I start? First off, it was 110 in the middle of summer, and they didn't even bother to turn on the AC, only had fans on (#1 big no no, especially given the nice area of Scottsdale). I saw the thermostat say 92 inside!!!!! \n\nSecondly, their menu selection is pretty limited. Just Pho Bo, Pho Ga and a few of their so-called Banh Mi.\n\nI ordered their Pho Bo. Soup was totally bland, the meat was really dry (actually come to think of it, there were barely any beef in it!). Prices were pretty expensive too.\n\nI also tried their pork Banh Mi sandwich. Boy what a mistake, the bread crumbled, the sauce too sweet, the pork was dry. There was no pate in it whatsoever, definitely not an \"official Banh Mi\".\n\nThis place does not do Viet Cuisine justice. It is totally catering to the Non-asian taste.\n\nI would recommend going to Da Vang, Khai Hoan for a good hearty bowl of Pho.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 2, "date": "2010-10-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "--65q1FpAL_UQtVZ2PTGew", "review_id": "VukzLg-Q-OG76oDJQunJgA", "text": "This is a solid choice for a reasonably priced lunch and I love eating pho outside on a patio; there is just something about the contrast of warm pho and a cool breeze. \n\nThe pho itself is okay, but I've had better. As a result of most of the clientele that eat here, Tea Light plays it safe and does not serve traditional phos with tripe, rare beef and such. Over my years of eating pho, I've really become fond of the amount of flavor those pieces bring to the soup, and I can definitely taste a difference. Do not get me wrong though, Tea Light embraces their style and provides pho that is light and very refreshing. Their Tea Light special comes with with a smaller bowl of pho (chicken or beef), egg rolls and a spring roll - more than enough food to fill you up, but not enough to bring you down. When going there, I'd have to recommend that (if you're hungry), the Banh Mi selecion or the bún with egg rolls. \n\nThe staff at Tea Light is always fantastic (so fantastic that they earn an extra star for it) and they will remember your face if you're a regular. Also their teas are pretty good as well, and I'm talking about the packaged kind that they sell for brewing. Be sure to check this place out if you're in the area and need a healthy bite to eat, especially as the weather gets cooler!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2010-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rAQG7AU26ggJfFWTHdN83w", "review_id": "edcG-r7ahKFbOjnj-B3OKA", "text": "This is by far the best Vietnamese food I have ever had! Short of visiting the country! LOL! The spring rolls are to die for, the soups are always fresh made to order and that is just the beginnning! My husband and I have been going here for 6 years! So glad the weather is cooling to make the soup that much more enjoyable!\n\nLove the new decor! You can buy the real matcha green tea here as well!\n\nPamela,", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2010-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "E0WJRXk3uiwHiWiXG8kADA", "review_id": "gFQa1Ss-hbrneXUEaVPDWQ", "text": "I know a lot of people have been digging this place and that's awesome! I love Vietnamese food but... I can't warrant this as true Vietnamese food. As far as the pho, the choices are limited and the meat and broth doesn't have the traditional flavor. On the other hand, there are not many Viet places around n. Scottsdale so if you are looking for a quick fix and your in the neighborhood check tea lite out. Vietnamese food is getting a bit trendy as a healthy meal but don't let this place be the only one you visit. It's a drive but Chandler and Mesa have some real great places for traditional Vietnamese food.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 3, "date": "2010-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LdDVelkKaPyxjUbicbyuDA", "review_id": "TjWE9KGRkpu8desUNLztzA", "text": "Scant meat for the price.  I only come here because it's the only choice near my house.  The soup is not bad tasting and hits the spot but could I get a little more protein with those noodles, please?", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 3, "date": "2010-11-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cXnWZPcrtHjKXbcNzulg2A", "review_id": "F4d4-jYd2h6vXCyVxDRTsA", "text": "I have tried a couple other Vietnamese food restaurants and think Tea Lite has the freshest ingredients and best overall flavor. \n\n#1 or #3 depending if I want more beef or spring rolls. The pork ball sandwich is also tasty. The soups are great when it is cooler. Pasadena on them in summer.\n\nI usually go there for lunch. It can get crowded at 12pm so you may want to try earlier or a little later.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2011-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f1-pIw_p0ifzu03TXjPRiw", "review_id": "JnnDzBtSvAcvKCgcSAER3A", "text": "Maybe it's because I first tried this place on a day I got some GREAT news, but I REALLY like Tea Light.  I've experienced the greatness that is Tea Light twice now and I can honestly say this place hits the spot in my world.  I am so happy to now have a go-to place for excellent take out, which is not your ordinary meal.\n\nSo far I've tried the beef pho, the chicken sandwich, the egg rolls, and the beef noodle bowl.  Everything was great!  I really liked the freshness of the chicken sandwich and the awesome sauce that came on it.  The pho is great and I love that it comes with everything you need to jazz it up on the side.  Since I am not a fan of cilantro, I was happy the second time that they honored my request to not put it in the soup... yay!  The egg rolls are crunchy deliciousness, which is a complement to any meal.  \n\nBasically what I am trying to say is I am thoroughly happy to have found this place- thank you yelp once again!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2011-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9eeqmxfVfAT4oyA4y2WcNg", "review_id": "z8XN0LKWd9hV5GwQYLCBTQ", "text": "Having grown up in LA, I'm used to seeking out local Vietnamese places for a pho fix. My bf and I found this place on Yelp and tried it out for the first time a few weeks ago. We both ordered the Tea Lite Special which included one pho entree, a spring roll, and two egg rolls. The beef was good and the broth itself really made the pho delicious. I also enjoyed the egg rolls, but I will probably skip the spring roll next time.\n\nThe place was busy, but we had no problem ordering and our food arrived in 15 minutes. The egg rolls and spring roll came out even sooner. Plenty of seating with indoor and outdoor tables.\n\nGood customer service, fair prices, and delicious iced tea! What more can you ask for in a quick and easy lunch spot.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2011-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rAQG7AU26ggJfFWTHdN83w", "review_id": "F1hb5VtVZqFfQToIUKHmkw", "text": "We love this place! Never been to Vietnam, but this seems to be the real deal! Try the chicken soup! I always get extra basil and cilantro! Hubby likes the spring rolls. We really enjoy this place in the winter months.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2012-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Oba6VjQT4Tv1n_hqP-XDCw", "review_id": "blaXtGhtyBgQEo6BnZKMxg", "text": "I love the banh mi sandwich ... and of course, boba! Who doesn't love boba tea? My faves are honeydew and watermelon.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2012-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rnBDBO4NqKoCr2duRji15w", "review_id": "rXRQyfoIaCU4uXGA0wHO6g", "text": "My husband and I both loved this place! The Pho was wonderful and they have some of the best eggrolls I have ever had! The service was friendly and quick.  We will definitely be making Tea Lite a regular.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2012-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kVKmor9xpK7x0CPiziYdcQ", "review_id": "IDMqJakR3GKKhIXAbpw28A", "text": "quick service, food delicious.... good boba and good chicken pho", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2012-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kfCgyHsmSYzCPJ34AnYgCg", "review_id": "qt1PxztuXPbLmcaH8AVc6g", "text": "BEST place to eat ever! It's a bit of a drive to get to from where I am, but it is so worth it!\n Whoever said it was tasteless lies! This is healthy good food! They give you lime, basil, bean sprouts, etc to go with your meal!\nI LOVE the little rolls that come with the Number 1  meal.\nThe soup is fantastic!!! The food is the best!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2012-10-26", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 5}, "user_id": "fczQCSmaWF78toLEmb0Zsw", "review_id": "_5tDxmuBDRgtt8TmtxdTfQ", "text": "I've been to Tea Lite Cafe a couple of times over the years, with my most recent visit today when I went for lunch with Lindsey F.\n\nTLC may not look like much from the outside, (it sits in a far corner of a strip mall and it's got a tiny little storefront and sign), but it's a fast-casual concept with moderate prices, friendly service, and pretty good Vietnamese food too!\n\nI'm a huge Vietnamese fan, so it's always a difficult decision when it comes to ordering, but TLC's menu is short and sweet.  Highlights include the Spring Rolls and Pho.  If dining in, I recommend going with the Tea Lite Special which allows you to sample one spring roll, two egg rolls and your choice of chicken or beef pho soup for just $8.99.  I love all of the sauces they serve from fish sauce, hoisin, siracha, and more; I enjoy mixing them all together!\n\nTLC also offers boba, which I love but have yet to try it since I'm typically pretty full after demolishing my meal, but I will be back soon next time the boba craving hits!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2012-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ErLPIRpE5B4xscL9sB6jYw", "review_id": "_MXbPzdAD5IIVUxB4j58kw", "text": "I enjoy eating at Tea Lite Cafe several times for lunch during the week.  When I am in the area I usually stop and order the Chicken Salad which has romaine lettuce, carrots, cilantro, cucumbers, and bean sprouts and a lite vinegar dressing served on the side. It is a gluten free salad that I have had many times. It looks good and is served promptly with slices of warm hot off the grill marinated chicken pieces.  My favorite drink is the iced Matcha Green Tea which is so refreshing with orange and pineapple juice blended into the drink. The service is prompt and the staff are friendly.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2013-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dk2hdhgUuLIhTwkHvzMkAQ", "review_id": "41kGJq7HbAtnDU1L2twlwg", "text": "Our favorite place in the north valley for Vietnamese food! Great pho and bun and good service. The owner is friendly and the food is always fresh full of flavor. If you have not been here, you must go!!! The only thing missing is a beer or wine option....the it would be worth 5 stars!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2013-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Tmmzj1_OTuoKqCS4Kn5Cdg", "review_id": "4LvUjS3xUq0c9tuAe9UREA", "text": "Be careful of their green matcha tea. They will charge you around 7 bucks for a small cup of matcha green tea. They say they will add orange juice to \"enhance\" the flavor. The end result is beyond catastrophic: I got green color diluted, old orange juice. \n\nTheir pho is bland and unauthentic. All and all I'm sad I wasted time and money on such a disappointed meal.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 1, "date": "2013-10-06", "type": "review"}
{"votes": {"funny": 4, "useful": 4, "cool": 4}, "user_id": "XqMkm-DD9VsdcKx2YVGhSA", "review_id": "v3-z7HSvdFXSXFGzWYkAgg", "text": "(Lyrics - Sebastian (The Little Mermaid) - Kiss the Girl)\n\nSteam Rice Plates!\nEgg Rolls!\nWords!\n\nThere you see it\nSitting there across the desert\nIt doesn't have a lot to serve\nBut there's something about Pho\nAnd you don't know why\nBut you're dying to try\nYou wanna taste the Tea Lite Café...\n(Sebastian from the Little Mermaid - Kiss the Girl)\n\nTea Lite Café is nestle in the Scottsdale plaza off Scottsdale Road and the 101; west of the Harkin's Theater. This little gem serves up traditional Vietnamese cuisine on the North side of Scottsdale, which was rare back in the early 2000s when I moved to Phoenix. Vietnamese food was hard to find back then, but now it's starting to pop up everywhere since Pho is fast becoming a popular dish.\n\nWhen I first visited this joint back in the early 2000s, they had their Pho called beef Noodle Soup instead. I gather it was a way to better explain to the public what Pho really was. Now it's back to Pho and it taste much better too! Yah! Aside from Pho, Tea Lite Café serves up some of my classic favorites Bun Mi sandiwhced, vermicelli bowls, and steam rice plates. Voted best sandwich by Phoenix Magazine back in 2010, their specialty sandwiches, also know as Bun Mi, will not disappoint.\n\nMoreover, it is not to imply the rest of their dishes will disappoint, cause I definitely recommend their vermicelli bowls with your choice of meats; beef, chicken, or pork. Also known as, Bun Thit Nuong Cha Gio, it comes along with egg rolls and served a top of fresh carrots, cucumbers, bean sprouts and cilantros. One thing I love about Vietnamese cuisine is the utilization of fresh vegetables and seasonings like cilantro giving it a distinctive scent. Vietnam is heavily Buddhist thus having a strong vegetarian background and the usage of vegetables along with their cuisine.\n\nI'm not sure who the Chef is, but she seemed very friendly and came out to speak to the patrons. Some of the regulars seem to enjoy her company a lot. The waiter was very stiff and seemed like he was mad all the time - reminded me of my dad haha! (Sorry pops!) The place itself is cute and tiny. It was somewhat cluttered, but I enjoy that closeness to be able to see and speak to other patrons. - Enjoy!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2013-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WkrQt36X-Y-sEGl6uDwQdw", "review_id": "y7lzH4zxBww2ElJX7BVjGw", "text": "New to Arizona and have been dying to find a Pho place! I have found my new home! This is the best place I have had Pho since living in Central California! Very happy customer!!! I can't wait to come back!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2013-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BvhvBjoti8KM07qm2cWLOQ", "review_id": "i6_t1YKgrDWHaLZm-tNujQ", "text": "Close to the movie theater. Great little noodle shop. and that's all it is what makes it great is that they focus on serving great noodles nothing else.\n\n I eat here a lot before and after the movie. If it's Sunday or Monday and there's a football game going on then I eat at Blue 32.\n\nGreat food. Great price. Authentic taste", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2013-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Jsj_4S-Jee7gKanYIuMSBQ", "review_id": "vgrhbvJ5l7RW_yNWvm17gA", "text": "This is a nice, clean, friendly restaurant to get an introduction into Vietnamese food.  Nothing too risky but good flavors.  Might just scratch your itch.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 3, "date": "2013-10-28", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "588oY8EejEFCr-ym_2TR0Q", "review_id": "fFPJ6DHMbxcO8n-eX48bYA", "text": "Worth everything you pay here.  I used to drive about 7 miles for Pho, but now I come here, less than a mile away for my fix.  I love to order the beef special with rare beef, brisket, and beef balls to go.  Their broth is really clear.  Their egg rolls are really good as well.  Worth the try if you live in the area!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2013-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7knTjXA1lNJw7AMIIJi4YQ", "review_id": "k5RSMfpczosI3BXBZ6lUlA", "text": "Went to Tea Light Cafe with my wife today.  Split a bowl of beef pho (pho bo) with her (Vietnamese Beef Noodle Soup).  Also had an order of goi cuon (Vietnamese salad rolls).  The pho was very good.  The goi cuon was perhaps a little chewy.  Otherwise, it is good.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2013-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fXdskdCFDQdZh_-Fif6LIg", "review_id": "WIFF3bwXxLrLhYHA_ZkWTw", "text": "Best chicken pho in Scottsdale in my opinion. Worth the wait during lunch or dinner. Good food all around. Give them a try you'll love them.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2014-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OKeJD7fxZgZYfqzGZoT8xw", "review_id": "B92Y-vcrXOIgooUBCMg1yg", "text": "Excellent, really great place. Really awesome vermicelli bowls. Ignore any reviews that are under five stars.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2014-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cfUTbVcVh7XFULNR-MEZdw", "review_id": "UmMIvFBBzkydXAyA6HrdDw", "text": "Just a little place tucked away by the movie theater but well worth walking through the door. Always people inside which I take as a good sign. Friendly staff and fresh tasting food. The pho is great and I love t he spring rolls. Will definitely be back.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2014-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Qtro4APUHh1wEwnVhciPPQ", "review_id": "nfsR-LKhJ7z32SmRy3IM6g", "text": "Absolutely unimpressed with my latest visit today. I made an over the phone order for some spring rolls, and I was told a five minute wait. I got there and the food was indeed ready, but when I went to the counter to pay, the 10 year old boy (I know this is a family owned establishment but come on..) charged me $10 and change for a menu item that is advertised at $6.99. I asked the boy if this was correct and he said yes. So I paid for my three dramatically overpriced spring rolls and left. Once I got in the car and looked at the order they were completely wrong... Expecting the spring rolls to be the traditional vietnamese spring rolls with shrimp and pork, they were some sort of dark meat, messily wrapped concoction that is nothing similar to what was expected or what they have served there in the past. Buyer beware..", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 1, "date": "2014-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "oo-2j9mjVACyXr3rwt3ikQ", "review_id": "sqdwS0qMYntZr2Cn3FnWwA", "text": "So cheap, #3 Bun is my very favorite. I'm here 3 times a week, it's probably unhealthy. I have never eaten in, but the staff is very friendly for takeout. They don't even judge me for going in there all the time :) I would also like to try the Pho! It's supposed to be fantastic.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2014-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9IZ4Q_BdXwlVPAwf1EkZFA", "review_id": "4JMvwPOwjbC3CBWzriYAKA", "text": "A lunch staple, always good! Love the pork", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2014-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aw4lZM5Bo5arD6ZO0mihIw", "review_id": "erEuj3RjHBN3I3x64o8ekA", "text": "Great food, delicious service, personal feel.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2014-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "c7Z8G6up0P5V1hm5Ra7iYA", "review_id": "mq7GAPZc-kutsAixuiE6Gg", "text": "Dark setting but the pho was good - the noodles were over cooked and mushy. Great having the soda machine - spring rolls were made in a very messy fashion - slow down all the processes and more attention to product. Ordering process not very personal but overall I will try again.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 3, "date": "2014-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0Ug6381ebqPFhhMfE6yC7w", "review_id": "yRGZVErENh9i0BeTTodlhw", "text": "Whenever my children come to town, Tea Light Cafe is the first stop on the way from the airport. Millions of options for dining in Scottsdale, but it's our favorite. Fresh clean flavors and incredibly fast service.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2014-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Lafj9QLLmwE5ACq4ArUrFQ", "review_id": "rtRqz3an26QNX90eOYKU0A", "text": "My Family and I eat here about twice a week or more. My doctor's office order often and I was pleasantly surprised how wonderful and flavorful the food is.  Many Lifetime fitness guru's are often in for lunch as well. \n\nThis quaint, comfortable and great place to go for lunch/dinner specifically heals from within.  I'm addicted to the Chicken Phö #12 and the shrimp wraps are delish.  Extra hot for me all the time.... ask for extra hoisin and scirraci sauces.  \n\nI now have my Family enjoying it especially my 4 year old.  The staff is extremely nice  and Anthony is such a pleasant fella who runs this place.  The owners are often in Tucson so I've never met them but the food is awesome and the prices are very reasonable.  I've never been disappointed and it's a quick trip to grab-n-go.  Calling in your order is a snap and Friday evenings is nice to enjoy outside after a movie next door.  I truly believe that this restaurant has helped me heal more quickly because of the spices and Phö.  So glad they are situated in the N Scottsdale area and close to my home.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2014-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jsIjcXXB8JXFT9tHyXmENg", "review_id": "SGeKcRUAPbDmkGjuinMTBQ", "text": "This is our go-to place at least twice a month. My husband loves the pork chops and I love the pho Tea Lite Special. The food is prepared fresh and you never have to wait. Their salads are excellent and their fresh brewed authentic green tea is a welcome change. Highly recommend.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2015-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "C-IFJlE5uoq6GgLFHtCq6w", "review_id": "9L7pRlBDKB_QB1iWvJNQLA", "text": "Let me preface this by saying I am Vietnamese and I have been to VN. This place is quick service Viet, catered to the taste of PHX / Scottsdale residents.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 2, "date": "2015-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AgRQq4syFH-Bc4hz9QQFfQ", "review_id": "tQysk0A7UJ8lJhWLl4DViw", "text": "Try the marinated pork chops. I am hungry as I am writing about them. The combination of rice, side salad and pork chops is a good one. And surprisingly they are generous with the portion. Me like it!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2015-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3aMN-mb762DpZCt-xTc_4g", "review_id": "ObNsD72RpLOz1IsocrNu6Q", "text": "Waited too long to write this review! Excellent food for a reasonable price! The Pho is a favorite of my sons and I love the bowl with rice noodles and beef plus egg rolls on top! A+", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2015-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "D4vtmw1kMcH5e85DZlYZwQ", "review_id": "feJvmOc7viDd7AWVf_ONQw", "text": "Pros:\n-Got the veggie pho to go, and it tasted heavenly. The broth had a lovely ginger taste and was nicely salty. I can see the broth potentially being too salty for some, but it was perfect at the time.\n-They separated the broth from the noodles/veggies in their own containers for takeout, which was very helpful for preserving the taste and quality of the pho.\n-They were generous on the green onion and cilantro, which are my favorite veggie add-ins to asian soups.\n-They seem to have some very interesting tea choices and tea-ware, like teapots and cups. Since we were getting takeout, we didn't try these options. There are several glass canisters of interesting looking teas to the left of the registers and if you so decide to try this place, I would give some of those teas a taste.\n\nCons:\n-A more expensive than other pho places with arguably competitive quality. Our total for 2 veggie phos and 2 boba drinks was a little under $27. However, it does seem to be pretty far from other cheaper and high quality alternatives (like the ones you  find near asian markets), so the price may just reflect the lack of neighboring competitors in this area.\n-The veggie pho option pretty much only came with tofu, regular onion, green onion, and cilantro, excluding your usual bean sprouts, mint, jalapeno that seem to come with every order of pho at most places. At other restaurants, they may include other veggies like broccoli, carrots, and peas or whatnot. It's not a big deal for me, because the pho was still delicious, but I think the price should be lower to reflect the scant ingredients? The veggie pho at the other aforementioned place was about $5-$6. \n-The boba was very meh. The smoothie flavors tasted exactly like the fake-tasting powders you can buy at LeeLees and the boba was a little too rigid. The chewiness was still pretty good. Not the worst boba I had, but far from the best.\n\nVerdict:\nI won't be coming back, mostly because this was an impromptu take out adventure on our way out of town for a road trip and there's no way this place is convenient for us to stop by again, but even if I was overcome with the desire to eat pho, I would go to places with cheaper, better pho and better boba. I'm not giving it a terrible review though because all I got was take out one time. Don't get me wrong, if you just don't have any other closer options for pho and don't mind paying the higher than average price, then this is a solid choice.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2015-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cXM3cHH8NRJiia_bmaccWQ", "review_id": "-Q8cFOgXIzGBD33J5Drm2g", "text": "Clean environment,  food is of good quality,  tastes good, and friendly service.  A well deserved 5 star.  A wonderful gem in North Scottsdale especially if you are looking for a good Vietnamese food.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2015-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LwfP-eD5RvdxR2Upr6ReOw", "review_id": "Eiddbb9tK3RtC8TNzH-VWg", "text": "Came in for a bowl of soothing pho one day I when I was feeling especially sick. Pho did not blow me away but it was pretty good. I inquired about tea afterwards to help me feel better as well, and the manager steered me to the appropriate kind for how I was feeling and ended up steeping me a cup on the house.  Amazing how much a small kind gesture like this can make your day when you feel like crap.  Thank you!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2015-10-05", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "fLseWa4jvzCMaTEUpseGNw", "review_id": "Y2xkK879fWcx7-3oqdzJyw", "text": "I visited Tea Light Cafe for the first time last night with a friend. I had been feeling under the weather all day and had been craving pho for a couple weeks. Adding the two together, I knew what had to be done.\n\nTea Light Cafe is tucked (almost hidden) between a large movie theater and a bunch of other mall-ish restaurant and department stores. You've got to be looking for it, or you're likely to miss it.\n\nThe parking lot is very large but even still, it took us a while to find a spot. Not sure why, to be honest. I ordered the beef pho, my friend ordered some kind of a grilled chicken dish, then we found a seat just outside the front door.\n\nThe view outside was beautiful: A Ferrari parked beside a BMW parked beside a Cadillac parked beside a Maserati. But enough about the cars - how was the food?\n\nThe pho was just what the doctor ordered, without a doubt. The warmth of the broth of pho has always been very comforting to me. Was this the best pho I'd ever eaten? Not necessarily. But I still enjoyed it very much.\n\nMy friend's chicken dish was beautifully presented, but appeared somewhat dry. She confirmed that it lacked a bit of character, but made do by mixing sauces and enjoyed it nonetheless.\n\nTea Light Cafe is not very close to where I live, but I would consider it worth the trip. It is rated pretty highly across hundreds of reviews, and I'd agree that its rating is well-deserved.\n\nIf you haven't been, and you're into Vietnamese food, I would recommend a visit. I know I'll be back.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2015-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Vy5KMC6L9PtdRRmymvWfzg", "review_id": "FRfZw3SYf1376wrFdNiveQ", "text": "Food was really good and service was friendly and super fast. Mm mm mm. .................................................................mm", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2015-10-27", "type": "review"}
{"votes": {"funny": 21, "useful": 30, "cool": 26}, "user_id": "RsUNADZTrJ5xFXVMXJC1MQ", "review_id": "dmXo_4sJD7WklSY6anbM_A", "text": "I've been driving by Tea Lite for awhile but never had a desire to try this place but for some reason we decided to try it today. \n\nThis is a small little place with a few tables outside with umbrellas and with about 8-9 tables inside. So for a big group is can be a little difficult. \n\nSo you order at the counter and then you find your own table. They bring your food to the table. No number given, no name given. They somehow figure out what you ordered. Interesting. \n\nI ordered the Spring rolls to start it off. They looked really good. The rolls were pretty good. There was a lot of vegetables and shrimp. When you put the roll in that peanut dipping sauce, oh my goodness. Really enjoyed it soaking it in that dipping sauce. \n\nI ordered the Beef and Egg Roll. What a meal. Grilled beef, noodles, salad, and egg roll. Loved it all. They give you this sauce to dump all over it and it really brought out the taste. Nice tender beef. Nice salad. Really enjoyed the egg roll. Surprisingly, I enjoyed the egg roll more than the spring rolls. This was a really filling lunch and really good. \n\nMy wife ordered the Chicken Pho. She really liked it. Got to try the chicken. Thinly cut chicken and it was pretty good. My wife was able to finish up her Pho. Only issue was it had a little to much MSG. Little thirsty afterwards. \n\nSo the service was amazingly pretty fast. Our spring rolls came out really fast. This older Asian man rolled out the rolls on a carts and knew which tables ordered spring rolls. Impressive. All the food came out fast on this cart and the tables were cleaned up pretty fast. Tables were turning over pretty fast. \n\nSo I couldn't ask for anything more. Good food, fast service, and big portions. We really enjoyed it and will be coming back again. Enjoy.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2015-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uvMbHiVKCF8jIJLpTyUF2g", "review_id": "hLhpHzonnLHet_ho-xyKXw", "text": "Very flavorful and lots of fresh ingredients. Was a great lunch. I had the vegetarian Pho and spring rolls. I love the peanut dipping sauce!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2015-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 2}, "user_id": "kTmgld2e3NeyF81BcBTsRw", "review_id": "wVByDqo8XjCBbnR6F3HcRg", "text": "Tealight is one of those places  that leaves you longing for \"more\". \n\nChicken Pho, was flavorful as usual but a bit on the cold side which left me dismayed as I was truly in need of something warm and flavorful to comfort my soul on this cloudy and winter like day. The heaping amounts of fresh bean sprouts, thai basil, seedless jalapeno slices, and lime wedges were enough to pardon the lack of proper broth temperature. (I'm somewhat forgiving) \n\nStart off your meal off right with an order of the  crispy egg rolls! Wrap them in a lettuce leaf that it's served upon and, nestle that little bundle in the lovely clear like fish sauce and reminisce about_______. (Sigh) \n\n\n\nThey also have a nice selection of herbal teas that are served table side in charming little cast iron teapots. Reasonably priced and enough to share with a friend/spouse. \n\nThe tables are kept clean, and always loaded with hoisin sauce, red chili sauce...and the unequivocal sriracha (pardon my spelling). (Remember, when I said I was forgiving? Yeah, we'll it's reciprocal) \n\nReturn to the Tealight Cafe...you must...you shall!!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2015-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "1cKTUGVPmRJRrihjdxbPlA", "review_id": "lJov6BteBaMlp6kGR-oe0Q", "text": "We just recently moved from San Francisco, and we are happy to find this Vietnamese kitchen here in Mesa. The taste of pho (beef noodle soup) is authentic and delicious. We also ordered the BBQ pork w/ vermicelli noodles with chili sauce on the side. The restaurant is a cafe-style atmosphere, clean, and very pleasant to eat in. The Price is about $7-8 per item; it is a bit more expensive than in San Francisco due to less competition. We also love their home made dessert for $3.50 and will definitely revisit soon.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 4, "date": "2007-09-15", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "XZNKjhR2zhY00j4QiZda_Q", "review_id": "Mx7EVUJbf6HoJXe03lEsrA", "text": "Dragonfly doesn't seem to hold too dear to anyone's heart, I only say this because when we walked in there ~6pm on a Saturday night it was completely desolate (if you don't include the one person eating alone). \n\nI honestly don't have enough fingers and toes to count to the number of times I almost made a decision to go here instead of Best Hong Kong or any other restaurant in the area. That night I decided it was finally time to give it a shot.\n\nIt would be tiresome to divulge into the details of our indecisive ordering, but the waiter/(owner?) was nice enough to help us through each entree we thought to be the least bit interesting (based on name of course). After about 13 1/2 minutes of debating and almost 2 glasses of their white tea we both ordered something we thought would be fitting. \n\nLess than oh lets say 10 minutes later there it was my yellow curry chicken and her _____(I believe it was something beef? 5 spice?) and both dishes were delicately prepared, garnished immaculately not to mention delicious. \nThe waiter and staff there was always attentive to our needs and was thoroughly helpful when it came to our lack of knowledge in Vietnamese foods.\n\nI pride myself in reviewing only the places that fit the far ends of the spectrum and Dragonfly seems to have found its place in my heart at the better end. I will be back there soon to fill the newly found void in my stomach for traditional Vietnamese food.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 4, "date": "2009-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bYdUMQluPbp_zbIs_RLYDQ", "review_id": "mjvOy2_Dk1RX7lw9KxU9Vw", "text": "WEAK SAUCE...literally. Against my better judgment I decided to go to Dragonfly instead of Pho Ao Sen to spice things up a bit. I ordered the Pho Veggies and was sadly disappointed. The broth tasted like they had just started simmering it and then threw tons of salt and pepper in it to cover that up. The veggies were raw, which was fine for the bok choy but not for zucchini or red peppers or mushrooms. And another note on mushrooms, the menu says shiitake and I got raw/dirty button mushrooms. My friend and I were the only ones in there for lunch and the service still sucked. It's a good thing she is sick so she couldn't actually taste the broth (thanks to the half bottle of sriracha she dumped into her pho tai). Probably not going to this place ever again...", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 2, "date": "2009-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9RPhpa897l8ptzeQFAQiUQ", "review_id": "s0HNIv9xY3sF6WwIwk_H3g", "text": "It is our favorite Vietnamese restaurant. Never disappoints and we really love the Spring Rolls.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 4, "date": "2010-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6UJ56Kx0JtwWWGseQmknmg", "review_id": "_JU66_PqgozGAc3w9SOakw", "text": "I love this place, They have new owners now. After the new owners came in the food quality is the best it has ever been.\n\nGo on the weekend when the service is the best!", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 5, "date": "2010-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l2qZm-1Q39u-IJ3jBhgf6Q", "review_id": "mxmVz-RMXF6ybWRpluIdwg", "text": "I have a bad experience when come here before and I never come back again. The food is not good as I expected. Maybe I come back some days and retry.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 2, "date": "2010-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0beZngJ03EmIQfVcnlVK4w", "review_id": "7TJiH2m8ZCoCoD9UBzQdLA", "text": "Had dinner here last night and it has gotten better! Everything was super fresh and yummy! The food is totally authentic and reminds me of my travels in Asia. I think I will be going here more and more now that it is fall/winter for the Pho. The bbq is also REALLY good!", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 5, "date": "2011-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "JCKgyOjE4ML0685O1WTWHA", "review_id": "wS7d0zx8qtAqOPy9TSkpIA", "text": "Awesome Vietnamese place. It was recommended to me by the Vietnamese owner of a gelato shop (random, huh). The pho is really good and the spring rolls are excellent as well. \n\nGood place to go if you are looking for good, cheap vietnamese food. A bowl of Pho is under $5!", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 5, "date": "2008-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "31OZmHva7Q0dTNqpM4TKug", "review_id": "ockzMcm78LtgeGChXzj1FA", "text": "tho inconsistant at times, i always come back when i am staying on the East Valley.. perfect hangover food =)\n\nfor dinner i reccomend wehre you get the grill on your table and make your own spring rolls. it is gooood, but be aware you will smell like it for the rest of the evening", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 4, "date": "2010-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5CttQfnbWHYaHH9ivMNBXw", "review_id": "gO2sHTr4x_eOX0aKy6t5NA", "text": "They have the best pho tai. The broth is home made and not from a can. The egg rolls and spring rolls are really good. Bahn xeo is also the best I have had.. bahn xeo is a rice crepe filled with sauted bean sprouts, pork, and shrimp. You wrap it in romaine lettuce and dip it in the fish sauce. It looks kinda of like an omelette but there is no egg in it. The service is a little slow but it is well worth it, the two guy waiters kinda just float around, just holla at them if ya need anything. The fried rice and roasted chicken is also really good. Very affordable and so yum o!", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 5, "date": "2010-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5K4QOOlhDXMqEo6xOYlN2w", "review_id": "g0KdvXi1ua5x1w6qroco1w", "text": "Great food and great prices! Although I haven't ventured far from what I'm comfortable with. The 2A is my favorite soup and noodles ever!", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 5, "date": "2011-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-q0RFaCkmT6TFxgk0a9dPw", "review_id": "5GwyPftDeu565VxH1Pjpaw", "text": "Love at first taste! My buddy at work asked me if I have had lunch already cuz she's getting a Vietnamese food - I thought it was a good idea so I'm like, forget my brown bag and go for the Chow Mein! And boy was it so damn good - I always love it when the portion is enormous that I couldn't eat it all at one meal! :D The Chow Mein is packed with veggies and lotsa seafoods! For $6, what a deal! Looking forward to another Phu Thanh lunch soon, and looking forward to eat in their restaurant so I can try other menu they have.", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 5, "date": "2011-11-13", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "TQ5eVGOFr_qB5_BbEd3Sow", "review_id": "SNAvYvASJjnOE_WBUIfkVg", "text": "My meal here turned out to be a very odd experience.\n\nThe good: \nI was greeted and seated right away, a glass of water and menu were provided immediately.  The water was refilled expeditiously.\n\nWhile it didn't smell as fragrant as Pho Nhan did when I entered, it did smell good.  \n\nI saw a mix of Asians and others (including one not-too-polite redneck farmer who talked way too loud on his cell phone at the table) but enough of the former to feel this was a popular place for Vietnamese.  I wouldn't trust a pho place full of only white people.  Scary thought.\n\nThe eggrolls were delicious!  They were more garlicky than ones I've had in the past and it was that kind of garlic that you keep taking bites of and wanting more of.  The veggies were fresh and crisp, the shell was crisp and delicately flaky, the dipping sauce was perfect.  I could have eaten a whole meal of just these.  \n\nThe bad:\nAfter being seated and provided water and menu I was summarily ignored for at least 15 minutes.  THIS I'm not used to.  Someone else would have left.  The waiter was sitting a a table in full view of me about four tables away and purposely did not make eye contact or walk by, much less come to my table.  What's the problem, Dude??\n\nWell, you know what, I can usually out-stubborn anybody, though thankfully don't often need to, so I decided to sit there till Hell froze over.  Eventually an older man came out to bring another table their food.  He saw me sitting there, hands politely folded on menu, smile on my face, obviously ready to order, snapped some orders at the younger guy, who then came over to take my order at long last.  I got the aforementioned eggrolls and a bowl of soup that included duck leg and bamboo.  My phone died before I could take a photo of the menu as I sometimes do to remember the name of the dish.  The guy checked with me if I wanted the one with bamboo and I said yes, but my antennae went up.  As he was leaving the table he hesitated and asked, \"You work over there?\" Pointing to the west.  I told him no, I was visiting from San Diego because I had a new granddaughter.  He brightened up at that and was perfectly nice after, so I can only guess he thought I was someone else initially, someone not worthy of his attention.  Working where?\n\nAfter eating the delectable egg rolls and being extremely impressed, the large bowl of soup arrived and emitted such a putrid smell I didn't know if it was from the person serving it or the dish itself.  It honestly smelled like someone had pooped in it, or in their pants nearby.  I told myself not to let my imagination run wild, thinking of stories describing slaves who defecated in their owners food, ewww. I had gone through so much to get it that I didn't want to send it back.  As I took bites and spoonfuls I pretty much narrowed it down to the bamboo being the culprit causing the bad smell and taste.  And it was not inedible, just took some getting used to.  I kept telling myself I probably had just never eaten bamboo before and maybe it's an acquired taste like Limburger(sp?) cheese, or liver.  Whatever, I ate it and while I barely made it to my motel bathroom after leaving the restaurant (don't ask), I had no further  gastronomic problems from the food, and that could have been caused by eating exotic food after having nothing to eat all day.  If the food had been \"bad\" I'm sure I would have reacted to it during the night or next day.\n\nI'm trying to talk myself into giving them three stars because those egg rolls were so good but the more I remember sitting there being purposely ignored, the more I acknowledge how impolite and unprofessional that was so I'm going to make it two stars.  Sorry guys, next time tend to your customers.  I eat out every day and this place is very near my motel so I would have loved to add it into my rotation of eateries.", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 2, "date": "2012-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IBxgFchRh2VblFbqCyvOng", "review_id": "tJqnjQ4s3ztYNWxFeqT6hQ", "text": "I have been coming here for about 7 Years and even show up in February when they shut down for a month for their vacation time.. This place is about the same as Da Vang in Phoenix, which I believe is their sister company.. \n\nWe go to Phu Thanh about 1 - 2 times a week. Use to be 2 times a week minimum when i worked by the Bank of America tower... Anyways..\n\nThis by far is the best Vietnamese place in town and definitely the best value. When you go inside, here and Da Vang, it almost looks more like a gutted house. They keep the environment cheap but clean, which keeps their prices down, -- come on, do you go for the food or social atmosphere? Me the Food....\n\nMy Faves and recommendations are listed in order of my preference\nCombo Fried Rice..\nPho #1 on the menu\nSeafood Fat Noodle #29\nBBQ Pork Short Ribs Served with Rice\nSpring Rolls\nSeafood Hot Pot", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 4, "date": "2012-11-09", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 2}, "user_id": "sqLsoqm3lNxvfkOQ_wXucw", "review_id": "XWvGXmM2q4ZqmZGQY2Qxzw", "text": "This place is bomb. They actually have good Vietnamese AND good Chinese cuisine. It's like a happy interracial marriage. This place is always busy and full of Asian people and not that many white people (it's never a good sign when you see eight Asian people and one white dude at Chick-Fil-A, know what I am sayin?) Anyways, it's the closest Viet restaurant to me and plus the prices are phenomenal AND they actually refill your water here! GASP. Do yourself a favor and try the green beans with pork and house chicken.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2008-10-16", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 2}, "user_id": "P2kVk4cIWyK4e4h14RhK-Q", "review_id": "DWSpPOnsplauUysm0tDgIQ", "text": "I'm not terribly familiar with Vietnamese cuisine so consider this review from a slightly undereducated palate when it comes to the cuisine.  My oldest daughter and I decided on Saigon Pho because we were in the mood for something different.  \n\nI was not impressed with the atmosphere here.  It was pretty run-down looking.  But I'll overlook that if the prices are good and the food is enjoyable.  They seem to operate with server by committee here, with any of 3-4 different women checking on us every 3-4 minutes.  One of them has personal space issues.  Her first stop at the table she placed both palms on the table, leaned way too far in, flashed a disconcertingly toothy smile and said \"Hi\" loudly through aforementioned smile.  My first inclination was to lean away as she might go Mike Tyson on my ear or something.\n\nWe ordered an appetizer of Vietnamese shrimp and vegetable rolls.  They were served with a dish of hoison sauce for dipping.  The rolls were large and filled with lettuce, vermicelli noodles, bean sprouts, 2 shrimp sliced lengthwise and a couple mint leaves.  This all combined to produce an interesting flavor combination but they were unremarkable overall.\n\nWe also shared seafood rice soup which was served in a large portion.  I'm pretty sure the rice had been blended and it was very small bits and the overall consistency was similar to runny grits.    It had a distinct hint of ginger.  There were a couple shrimp, several bites of squid and several bites of crab.  I'm not positive it was crab.  At first I thought it was \"Krab\" but I wasn't completely sure.   They do have tanks here with live crab and lobster so you would hope they are not going the \"krab\" route.\n\nLastly we shared a chicken teriyaki over rice.  The chicken was a little overdone but had a nice roasted flavor.  The teriyaki had the requisite sweetness that always works for the kids and thankfully they did not bludgeon the dish with excess sauce.\n\nThe final analysis:  reasonable prices, reasonable food.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2008-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4JapGtmN58pZYo1ClbV8qw", "review_id": "gJRu3Vd5nzPFdIiuG8SGjQ", "text": "The hubs and I are suckers for some good Pho and we haven't found better in Phoenix since we moved here. The restaurant itself is nothing special but what does one expect when you can get two bowls of pho, two drinks, and crispy spring rolls for under $15? We've never eaten anything else there but in the cooler months we eat here at least 3 times a month... sometimes more =)", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2008-10-28", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "0bNXP9quoJEgyVZu9ipGgQ", "review_id": "3qf7Rn1bIzMy5Z-gNXKu4g", "text": "I've been here a few times a couple of years ago, back when I used to live in Chandler.  This is a place that many Vietnamese refer me to when I ask about Pho (nail artists and coworkers alike).  But this was before all the new pho places have popped up!  \n\nI've never been crazy about pho, and I can't recall if I've tried it here.  I have tried a few apps and stir-fries, and I have to say that none have been worth writing home about (or more appropriately, none are worth YELPING about).  The outdated/old-fashioned decor doesn't help, either.  I'd say the only positive thing Saigon Pho has going, at least for me, is the server Crystal.  Very friendly, efficient, and she always has suggestions ready based on what you feel like having.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2008-11-27", "type": "review"}
{"votes": {"funny": 5, "useful": 6, "cool": 6}, "user_id": "qK6qbqXcZDn0fz8Dr5Ex8w", "review_id": "PjoT2gV-oGa2MRQWaDb6vw", "text": "I've been 4 times, my sister was pregnant and the baby needed that Pho--Lucky me!\n\nBest Pho, ever.  \n\nBest spring rolls and the egg roll is served the right way--with lettuce to wrap around.  Also, fresh oil--not oil that's been around for 100 years--you know what i mean... *fresh*\n\nHuge, generous portions, fresh and authentic.  Gracious and hospitable service and the prices are insanely low.\n\nSo good that I'll drive to Chandler from South Scottsdale just for a taste.\n\nGo.  Now.\n\n-*- After reading a couple of reviews, I have to request that anyone please *not* dine here if you can't handle Vietnamese people eating next to you--I would hate for your bigotry to ruin the experience for anyone else.  In fact, you should probably not dine anywhere outside of your home if you're so consumed with hatred for anyone of a different ethnicity.  Thanks, much appreciated!  =) -*-", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2009-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z-fvuSqI5SSiZUksPJ_QiQ", "review_id": "vEHU5wQB8oKTkQjoyKjVXA", "text": "If you  love spring rolls and egg rolls then  this is the place you want to eat.\nAlso they serve food really fast.\ngreat Vietnamese food.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2009-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ROr4DQ-gxlfUKmiDC-qSEQ", "review_id": "8jq3h4k77UMuU9Pyg-Ta3Q", "text": "This is one of my regular Vietnamese spots for two things, and they are:\n\nfried rice (not on the menu)\n\n& \n\nchicken curry noodle soup\n\nTheir fried rice is OH SO GOOD and greasy, reminds me of Chinatown fried rice in the Philippines and in Malaysia, the ones you get from the hawker stand. MMMMMMMmmmmmmmmmm! \n\nMake sure you get the house fried rice because it so good, with the fried egg, the scallions, shrimp, pork, and chinese sausage. It's that good that I can always look past the dirty Vietnamese label that Saigon Pho usually gets from Vietnamese friends. \n\nand, the Chicken Curry noodle soup with the rice noodle, the richness of the coconut and the thickness of the curry gravy mixed in with the rice noodle and the chunks of chicken, with a little spice, mmmm that's good eating. Oh and if you're eating in, get yourself their fresh lemonade, it's cool and really tart!!! love it. and these two menu items alone have made me a repeat customer of Saigon Pho the last 4 yrs.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2009-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HrGCBT6-x1iFupKCWAa_tA", "review_id": "YMHLHxK5FdiqI7kcynkYOg", "text": "Saigon Pho is just down the street from where I live. I am not super familiar with the menu, but sometimes I get a craving for a big bowl of pho. So...that's all I've ever ordered there. The menu isn't super descriptive, and I have trouble differentiating the difference between the seven different types of beef noodle soup. The staff has a hard time communicating the differences themselves, so you are sort of on your own.\nI recommend the spicy beef noodle soup. It has a thicker broth, wide noodles, tomatoes, cucumbers, peanuts, and sliced beef. You also get a condiment tray and a plate of the usual vegetables to dress your soup the way you like it.\nThe atmosphere is typical strip mall, but the prices are too.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2009-11-22", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "XqMkm-DD9VsdcKx2YVGhSA", "review_id": "Pya0pbHItlFie1Dci0dbHA", "text": "Cheap eats, fast service!  I can dig.  Pho is my comfort food.  The Pho is alright, but I guess you get what you pay for.  For about $5 it's quick and yummy.  The portion size is just about right for an Asian dude like me...not too much but not too less.  Service was quick...ninja style! I just finished my water and it's full already right when I stuff my face full of noodles!  What's up with the lighting?  It's always so dark!  I'm scared!  Where's my Pho?  What am I eating, and where the hell is the bathroom?  - enjoy!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2010-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "1vnaLkoBhOoKDtvJaiUpkA", "review_id": "adqJD5Xe_fIXhszri3YnZQ", "text": "Saigon Pho has great and amazingly cheap Vietnemese food.\nMy favorites are the shrimp rolls (number 2), The Pho Tai soup\n(number 12), and the Charbroiled Beef and Egg Roll over noodle (number 25).\n\nIt's incredible how many Vietnemese restaurants there are in this desert suburb named Chandler...", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2010-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XfUbS8krsXec3nKYA63jrQ", "review_id": "4_THxHs1CclRLABPqoIjEQ", "text": "Very friendly people, and the best Viet rest. in Arizona that I know of.  My favorite is duck in egg noodle soup.  That one particular dish is even better than it is in the legendary Pho 79 on Hazard Street in Westminster, CA!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2010-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "L3XWX_dd8_pYnRSMdppjDg", "review_id": "z1LwHZXC2bYVKOR1X8tzfA", "text": "Best Pho in town! Ok, so I may not be the expert, but I have tried my fair share of Pho, and I will return to Saigon each and every time.\n\nWhat I love about Pho...\n-The flavors oh my! I know that technically Pho is just beef broth with rice noddles, but it tastes like so much more! \n-It's quick, from order to table it takes no more than 5 minutes and you have steaming flavor bowl of yum!\n-You feel like you are making it yourself, you add the lime, the basil, the sprouts, the hot sauce and you have your own special bowl of goodness.\n\nSaigon knows Pho and if you like Pho, I highly recommend you try it at Saigon!!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2010-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "27mLBPOq6ovej9LrHhs7Ng", "review_id": "6yvTlitggJyJzEIDCgZ6-w", "text": "Saigon Pho is my favorite Vietnamese restaurant!  I've been dining here for nearly two years now and love this restaurant dearly. My boyfriend and I dine here two to three times a week. The food and service continues to bring us back, and our love for Vietnamese food continues to grow! I've practically have had just about almost everything on the menu and have not found many items I did not like. \n\nThe beef salad is amazing... to die for! It is served with your side of white rice, with  lemon salt and pepper dipping sauce. Believe me, it is fantastic! You will fall in love and come back for more. Not forgetting your traditional Pho, something that is a must have and try! You cannot go to Saigon Pho and not have Pho... rice noodle soup with beef and beef balls, served with sprouts, lime, and basil leaves. There are sauces to add to enhance the flavor. Once everything is added, you indulge!  \n\nSome of my other favorite dishes are; the special crab, clams with basil, and steam flounder.  They cost a bit more if you don't mind splurging a tad to enjoy the taste of how each item is well put together. These items are normally shared-so for the price, it is worth feeding at least two people. \n\nBeside for the seafood items, everything else on the menu is affordable and decently priced. Nothing is overly priced for the amount of food served. The servers are extremely friendly, quick and nice... I've gotten to know almost every single one of them to the point where it is a little embarrassing when I walk in and they say, \"Wow.... you come here again?!\"  There are never any long waits and most of the time, we are sat right away. They come by so often to check on you... So basically it is impossible for your drink to be half empty. Good deal, eh?! I have and will continue to enjoy this restaurant. So if and ever you are in Chandler, Arizona make a quick stop here and give yourself a decent meal you won't forget!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2011-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NVZ_DCjzJhflzwsMtcF9PA", "review_id": "bDHgJqW1IiQPjti7Jc1dRQ", "text": "the price, the taste and the quality of the pho all get 5 stars!!!! \ni can't wait to come back!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2011-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zcWZrYCHaEAs-bRZVDNnbg", "review_id": "Bt0Uh84NnVE4WG6xkhDccw", "text": "I have been coming to this place for many years now (over 5 years) since I moved to Chandler. I come here atleast, if not more, once a week. I love their quickness of service and the food comes out fast too. Even on their busiest days (Fridays & Saturday evenings), the service is always great. Oh and not to forget, the food tastes great too! Always consistent.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2011-09-14", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "7cmvtJaZTJhd7yQdwu5scA", "review_id": "fnRNCjwha_p53mpnc-S3AQ", "text": "Best Bun Bo Hue (Hue style, spicy beef noodle soup) I've ever had at any restaurant I've been to! It almost compares to my mom's...almost.\n\nThey Americanize it some, in the sense that they leave out the chocolate meat and pig feet (Boo to that!), but the broth is so delicious it doesn't even matter! It's all about the BROTH! I was sooo tempted to take it home in a friggin cup b/c I was overly stuffed. Yes, it was THAT good.\n\nI'm guessing if the bun bo hue is this good, the pho is probably tha bombeezy!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2011-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_nKsyDUIdoTimDPM9aG23w", "review_id": "1ukbEl0mqghQpRPu8RBpxQ", "text": "I have been going to Saigon Pho for years, since probably when we moved here back in 2000 or 2001 .The servers are super friendly, and remember you ,( or at least it seems that way ), the menu is fantastic. The only problem is that I don't get to try other items on the menu, since everytime I want to get my favorite. My son has been coming here since he was about 4 or so years old and is a fan also. Service is fast and friendly. If you want Vietnamese food, and don't care about decor, this is the place to go.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2011-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m9Kl_CB5K5Zlmn1aNAFl3w", "review_id": "PpdTbCrghA501loT9WHwUg", "text": "I've been to like 2 Vietnamese restaurants in my life, so I'm not an expert and can't compare this to anything else.  But I really liked the food and the flavors of this food.  I could see the menu being a little overwhelming but I asked some people who'd been before and checked the other Yelp reviews and decided on the following:\n\nBeef Chow Fun - Yum.  Greasy but excellent dish.  Kind of reminded me of Mongolian beef over noodles.   Fun indeed.\n\nSpicy Beef w/ Rice Noodles - Probably my favorite of the soups I tried.  This had a little bit more going on that just broth and noodles.  Good enough that at some point, I will crave a bowl and be back for it.\n\nFreshly Sliced Beef Pho - This was what I expected.  A kind of nicely flavored beef broth soup.  A little bland for me, but my kids LOVED it.\n\nPork Bun (pork and egg rolls on cold vermicelli noodles) - I was most surprised by this one.  Cold noodles and fish sauce makes me say \"meh,\" but I really liked this dish.  Fish sauce and all.  Actually the sauce probably made the dish.\n\nAs everyone else has said, the places is pretty cheap.  Unlike everyone else... you can keep the darn spring rolls.  Egg roll... awesome.  Cold transparently wrapped bunches of tasteless lettuce... not so much.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2011-10-17", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 1}, "user_id": "omoEjYFKVV7e-DtnezeUOw", "review_id": "Zl0wGbGjBuKjoA-x6JLquQ", "text": "I have been eating here for almost 10 years.  It has always been one of my favorites.  Their Pho Ga is amazing and so are their spring rolls.  All of the dishes we have had are great and you have to try the Cafe Su Da which is a coffee that slowly drips into sweet condensed milk.  It is a real treat.  \n\nThe past three times I have been there however they seem to have changed their noodles or the way they cook them.  They are too soft and mushy which really put a dent into my enjoyment.  These small thin rice noodles are in the pho and the spring rolls (and many other dishes) so this really bothers me. \n\nThe service is faster than fast food yet it is always fresh and good.  They have great Jasmine Team and it is served in the whole pot which is nice.  \n\nCleanliness could be improved but this is a pretty traditional place.\n\nOh, I almost forgot the secret.  If you are hung over you have to come here.  Here is the miracle cure second to swimming in a cold ocean.\n\n- Whole fresh coconut (drink)\n- Pho Ga (Chicken Noodle Soup in a beef broth)  - Make sure to add Siracha hot sauce to kick up the sweat.\n\n- Cafe Su Da - nice caffeine blast.\n\nThe Pho needs to be spiced up enough to make you sweat.  After that, your hang over is gone !!!!  Whoohooo", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2011-10-21", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "_PzSNcfrCjeBxSLXRoMmgQ", "review_id": "EJjUg3FnuS-if7yC7GTFWQ", "text": "I was here with a group of 10.  We got seated in one of the big tables near the back.  We were greeted by the server and asked for our drink orders.  I ordered the Thai Ice Tea.  It was good.  Each of us ordered our own dish.  I ordered the fried egg rolls, it was ok.  I ordered #32 BBQ pork, shredded pork, egg cake, and fish sauce.  Everything was just ok.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2011-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_oCctJEJ9eR3XTGBsmzY9g", "review_id": "an-NT1KIQk2W8fCCv2kNFA", "text": "Awesome pho, broth is very flavorful, lots of veggies, and good portion of quality beef. They also have great service and reasonable prices. Best I've found in Phoenix, looking forward to going back and trying some of their other things.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2011-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "qUULztbtKHyFv-dNr5utmw", "review_id": "sGzgwf20t6Pj18kU7ntBTg", "text": "This is my 'go to' pho house in the Chandler area.  The prices are good ~5 to $6 for a bowl of pho.  The staff is friendly and the quality is on par.  My one complaint is that it is not especially clean.  \n\nMy picks:\n\n#16  spicy beef pho\n\nPho Ga( chicken pho(white meat))\n\nfried tofu", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2011-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KxMjktZ2JIFNs2dao2OHBw", "review_id": "hwtdwkCsZDgKtW60XPDjCQ", "text": "One less star for every piece of hair I found in my bowl of fake Bun Bo Hue.   Found a total of 5 but yelp requires me to rate at least one star. Besides the HAIRS, the broth was greasy, and unflavored.  Every ingredients I tried to add to make it taste better  was useless....USELESS!!!  They took it back and gave me a new one and still made me pay for the meal of hair that I had to eat!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 1, "date": "2011-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "gcl-qCpouRKl6cIc_c_fqA", "review_id": "cuhrQf-IlLVCCDawhM6ZFQ", "text": "This is our favorite, at least once a month, Pho restaurant. The staff are courteous, friendly and efficient, and the food is excellent. As far as the Pho goes, there isn't a bad option on the menu, but the real treats are the other treasures on the menu, such as the salt & pepper calamari, which is the best I've ever had. The restaurant is large, that's a good thing because it gets pretty busy at peak times, though I've never had to wait more than a few minutes. Dinner for two, without drinks, may run you $20-25 + tip, but that's including appetizers (hint: the spring rolls are fresh and delicious), but your taste buds will thank you with every bite.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2012-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KYMeny_03F8HdcoCY_kXzQ", "review_id": "tR4FQ-AWGszSFz-iBOX6aA", "text": "Been going here for over 10yrs now...my husband loves it too. Great Prices and Great Food! We try to go here weekly since it's cheaper than cooking. I love the seafood, Lobster Salt and Pepper is our Fav! And the SP Squid. The Pho is so far the best I've had. They are sometimes not as consistent on the quantity of food as for family style eating but most of the time they have a great serving for the price. My kids ask to eat here all the time, especially when under the weather and in winter for the soups! Very affordable! Especially on seafood.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2012-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zG1tYaWP2bE9mAaLzbx9GA", "review_id": "JqM012q3yQfSIDJ2mMVTGQ", "text": "One of our favorite restaurants in the Valley! We go here about once a month. Some of my favorite dishes are the whole fish, salt and pepper shrimp, Pho with everything in it, Spring rolls, Shrimp/Pork over rice noodles, and the Seafood over soft egg noodles. We also have the Vietnamese coffee as our dessert! YUM!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2012-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zEiTVy41B5c4QEiEZck_bg", "review_id": "PzAHNbXD3rrFlh7jWH0Gsw", "text": "I enjoy the Springs Rolls and the Pho soup.  The decor is nothing to write home about, but the food is pretty decent.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2012-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pQ6ij6cOBRB3yJGHbVZHUQ", "review_id": "PpVVmfZ78V6XGiRUmostYg", "text": "Service is FAST and efficient. Beff Pho was tasty, but I wish they offered the shrimp AND pork spring rolls. I opted for the deep fried egg rolls and they were much like you would find anywhere else. They came out so fast (and temperature wise) I suspect they were pre-cooked. Still overall a good experience.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2012-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "-gdDH8SMQ01tOMlUvhMcgw", "review_id": "X01rATwkRBlS0wrtI_5W-Q", "text": "Saigon Pho doesn't have a fancy sign, great decor or even windows you can look in/out of. But who cares when you have the most amazing Pho in the valley (and at the best prices)? The servings are very big and everything averages about $6 a plate. Staff is very attentive and quick to deliver the goods.\n\nAs you can read through the various other reviews - everyone has a favorite dish. I have a problem with gluttony so I can't suggest a single dish - I can only suggest them all. However, this place also has some of the best Salt and Pepper calamari I've ever had.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2012-10-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "iikqizMQyLOp-zdv8MpQ5w", "review_id": "u07sPO31CZtzOUQNi0FUqQ", "text": "The best Vietnamese food in Chandler...tremendous Seafood Pho; Seafood Rice Soup is pretty amazing as well.  Huge portions and amazingly reasonable prices...go for the food it's great...tolerate the incredibly average strip mall setting...", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2012-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6v6D3Fo69GoQyM4eQMjk4A", "review_id": "8yEc20vWZKaxhmIcxmdFVQ", "text": "Just left the restaurant , pretty decent friendly staff the food came out pretty fast\nWe ordered the Thai iced coffee. My brother in law who lives here had never had it before and he was impressed.  Ya gotta try it if you never had it before. I always order it in Honolulu. My wife and I ordered the combination pho. For the price it was decent. Honolulu restaurants have more meat and tripe, but again it cost $3 more there.\nWe also ordered the steamed flounder prepared Chinese style with ginger green onions and oil and shoyu.  For the price it was great $18.\nMy guests who had the vermicelli had to put sauce on to make it moist.  It wasn't semi moist like it should.  Maybe the noodles were prepared hours before and been sitting. Ask for extra sauce for that #25.\nClean busy \nWould go back again.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2012-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dRfuAF1X90yB-B8jTaqutg", "review_id": "yBE8LVlAEvIf1P4p5P3EMw", "text": "Great Pho, eggrolls, spring rolls, and iced coffee.  This place is always PACKED on Saturdays around 7pm and all sorts of interesting Asian dishes are going out to tables.  If you need some good Pho, you will not be disappointed.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2012-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mDS8rlDOcgRT3PMHGz3tug", "review_id": "PmC5IMLatjjTMoTadgknpg", "text": "Service was good here amidst a bit of a crowd but the food came hot and fast. I unfortunately didn't care much for the flavors of the spicy pho or the amount of shellfish throughout the menu (allergies.) The menu was a bit challenging to decipher but that's my problem, not theirs. I'm sure others out there may love this place, but I probably won't go back. Tummy issues....", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 2, "date": "2013-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1WMpiFX4oNeET9SXszBSwQ", "review_id": "h_GkMyVjXtSZ2GSDbNMxvQ", "text": "I didn't love this place... I often go to UnPHOgettable in Mesa - I think I was comparing it too much. I went with a large group (6-8 ppl), we didn't have to wait too long, but were sat in the back by some hallway or something - the table was sticky - it was just off. \n\nI ordered the beef pho, it was just good. The beef was tough and didn't taste fresh. We also shared fried rice and spring rolls. The fried rice was a little bit too greasy for my taste.\n\nI recommend UnPHOgettable in Mesa - it is way better!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2013-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h222wezpBMgBbUGaxKvKXQ", "review_id": "JLYiuk_HoFtklAzKTRq50g", "text": "Went on a Saturday night for dinner and the place was very busy which is always a good sign.  I was there with my wife and we were waiting on my sister.  We decided to order before she got there.  Asked one of the servers to take my order but he stated that he wasn't allowed to and that he would tell one of the waitresses to come over.  Waited for another 15 min until she came and took our order.  My sister came about 1 min later and put her order in after waiting 10 min.  To my surprise her food came out before mine.  I had to wait another 10 min until I got my food.  Unacceptable.  One thing that they can do to avoid all of this is to hire more help or to allow the bus boys/water boys to take the orders during busy hours.  The food was decent but the customer service was awful.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 2, "date": "2013-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "9SJvHXILGv6fBMVdV83Lnw", "review_id": "pkLf-l0df2VHJce5-k6zyA", "text": "The service here was horrible. From the moment we began ordering our server seemed to have a chip on her shoulder. When we got our food it wasn't exactly what we thought so we asked to send it back. The server was increasingly rude after this and continued to tell me that it was what I ordered. As a consumer, all I was looking for was an apology and new plate of food. Our server never returned and instead a new one arrived and proceeded to slam our plates down on the table. I can easily say I will never return and will encourage others to not even bother going! Save your time and money... Not worth it!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 1, "date": "2013-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mQGkHgBJA_M7dNVcaxJOLg", "review_id": "Yf_klSQ4Z0YXoHrjX6D0vg", "text": "Very good restaurant.  Soup, noodle,  and rice dishes are all excellent.  Spring rolls excellent.  Service was great even when the restaurant was packed.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2013-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "R4Ax3btoJ6qLXhqq6J50VQ", "review_id": "HwlIlveXNiP918DqUZtQ8Q", "text": "My boyfriend and I were on a hunt for good pho in AZ, as California natives we are a bit picky.  Our taste buds were searching for the home taste we miss so dearly.  Finally we found Saigon Pho! We got the saigon special and regular pho tai.  The broth was very clear and the meats were not too tough.  I'm comparing this to UnPHOgettable, seems that place had a lot of good reviews but we aren't fans.  We also got the porkchop rice plate, the porkchop was very moist and not dry.  Service is kind of slow but its a HUGE place! My favorite was they give you oxtail in the saigon special which a lot of places don't.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2013-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-beMkTJqbLt2l6L1xomJaA", "review_id": "RC4LNMlVCydo1B_BkwhG0g", "text": "So good! So, so good. I've liked everything I've had, especially #23 -- fried tofu with rice noodles. One note -- if you eat in and you value good-tasting water, avoid theirs; it's just plain GROSS.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2013-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "90Yv6uLku3-yCK7ei9z3dQ", "review_id": "uBADPiJx-dx9bYckxn91wA", "text": "I always order the number 11 with a number 2. YUMMY! \nThe food is good, but the service can be terrible at times.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2013-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_ua7fp2GH3fuHUwqN76KqA", "review_id": "oud_eEzDppNdF6yzulFbuA", "text": "I struggled to give this play 4 or 5 stars. It is truly one of my favorite \"hole in the wall\" places. Their food is delicious and their prices cannot be beat. My one qualm is their meat quality is a little questionable, though I must say its expected with the prices.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2013-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M02YbxCQt5OgDcHgpvukNw", "review_id": "gXYu_z8eS2ePGxhbSfF3jA", "text": "We always eat here when we crave Saigon Pho. Today was the last we eat here. Here's why .\n\nWe ate with 2 other families. One of the families got their order wrong. Instead of apologizing,  the server kept pointing at the menu telling them that they got what they ordered. Then, my friend found a dead fly in his food. Disappointed friend talked to another  server about it. You know what the server said instead of simply apologizing?  She said \"you sit by the door so the fly must have gotten in and on your food.\" My friend's wife said that the fly was already under the food.  Server replied, \"no, no, no, no!\" She should have just apoligized so they could have moved on. They even had the audacity to charge them for the plate with the dead fly. My friends paid for it anyways. I could tell that they were trying to get rid of us. The other server gave our check even though we were still eating. He kept coming back for it thinking I would put my card on the bill. Later,  I see a server putting a shaved ice desert on our table. We didn't accept it. My friend said the damage has been done. All they needed was an apology,  but instead, the rude server kept on with her attitude.  Finally, the couple asked for the number of their manager. Rude server was upset. These people need to learn about customer service and ethics. I never make reviews.  When I do, it's  something everyone has to know about.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 1, "date": "2013-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "M02YbxCQt5OgDcHgpvukNw", "review_id": "VLtBC1FXffddYOOzvh6BKQ", "text": "Update: Remember the friend thand had eaten the food with a fly? Well, today his wife just told me he has been going to the bathroom all day. I think he got food poison? They're going to be reported to the Department of Health, Chandler City, and BBB.\n\n--------\n\nWe always eat here when we crave Saigon Pho. Today was the last we eat here. Here's why .\n\nWe ate with 2 other families. One of the families got their order wrong. Instead of apologizing,  the server kept pointing at the menu telling them that they got what they ordered. Then, my friend found a dead fly in his food. Disappointed friend talked to another  server about it. You know what the server said instead of simply apologizing?  She said \"you sit by the door so the fly must have gotten in and on your food.\" My friend's wife said that the fly was already under the food.  Server replied, \"no, no, no, no!\" She should have just apoligized so they could have moved on. They even had the audacity to charge them for the plate with the dead fly. My friends paid for it anyways. I could tell that they were trying to get rid of us. The other server gave our check even though we were still eating. He kept coming back for it thinking I would put my card on the bill. Later,  I see a server putting a shaved ice desert on our table. We didn't accept it. My friend said the damage has been done. All they needed was an apology,  but instead, the rude server kept on with her attitude.  Finally, the couple asked for the number of their manager. Rude server was upset. These people need to learn about customer service and ethics. I never make reviews.  When I do, it's  something everyone has to know about.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 1, "date": "2013-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BvhvBjoti8KM07qm2cWLOQ", "review_id": "O8Su6vEa8DxibA0BxxuP-A", "text": "The four stars is definitely for the Vietnamese Pho! They have several types with the curry base as well and all I really good.\n\nThe Thai iced tea is also excellent.\n\nHowever the other food we ordered wasn't so tasty. The best thing by far are the soups.\n\nSo overall it's great food at a great price. So that's why give it four stars. I almost gave it three stars but I remembered how good the soup was :)", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2013-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rVxspdVpQiOZ20sTjb9uBw", "review_id": "W16IsVtYd-KN-QSTJWGMsQ", "text": "Everything on the menu has been a must eat so far! Love their curry chicken and fish with Saigon special sauce. Spicy basil chicken and teriyaki chicken is good too. A must go place if you are in Chandler.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Vg53jgYAzr07F6wGq15q7g", "review_id": "V2LXi-vX8QvB2XDXKSSmHQ", "text": "Love this place. If you are non-Vietnamese you will be in the minority if you go there -- which is a good sign I assume.\n\nTonight was our 3rd visit. Good family style restaurant that is reasonably priced and quick service.\n\nWe have the pork and shrimp, the beef and shrimp, and the salt and pepper shrimp. Excellent every time!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2014-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RBDtyKZikapjNSjno66Azg", "review_id": "SPSzsB5TY_EvtTLLa1NzuA", "text": "Another one of my favorite places to eat.  Very large dining rooms and tables to accommodate large parties. I live right up the street and frequent here.  I order the 12 a lot and if I remember right the 41 (beef dish)  is really good as well.   Love the shrimp spring rolls and the Thai tea.  Lots of great food,  great service,  great place to eat.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Xe56-9ZpxDSB6atCRyW8NQ", "review_id": "87GxSZAnPV0U_5Kzn1p_Uw", "text": "We've been coming here for years. My mom was such a regular they would bring her egg rolls before she ever ordered them. I highly recommend the summer rolls with tofu and the fried spring rolls to start. They are delicious. The summer rolls are light and tasty and the spring rolls are also light, with great crunch and no grease flavor. My favorite rolls in AZ. I get the number 25, vermicelli noodles with beef and a spring roll. I like the peanut sauce but I don't do the fish sauce. They also have a delicious spicy beef with sticky rice. Those are my go to orders. My mom loves the pork vermicelli with egg roll and their fish sauce. Haven't had the pho, but this place is usually packed and pho seems to be the most ordered item. The service is quick and not overly friendly, but they are patient and never make you feel rushed. The prices are amazing too! Try it, you'll like it.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E9b0YNF1_YaV7edSjBS9tQ", "review_id": "lfvGUcuyUalqqE6qI0g95g", "text": "This is by far my favorite Vietnamese restaurant.. Pho is great, and so are the egg rolls. Very reasonably priced. The good is always fresh, and comes out quickly.\n\nCustomer service has improved a lot since the last time I was here. I probably come here twice a month. It's not that the service was bad... It just wasn't friendly. \nThey would take your order-bring you water, then your food, and you would never see anyone again. If you needed something, you'd have to get up and seek someone out, which seemed to annoy them. \n\nNow, they have someone check on you constantly, not too much.. Just enough, and the girls are much friendlier. Because of their kindness, this place is now a five star in my book.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xvPjVMI8dRlK4bNZXAUmvQ", "review_id": "DZh5hIWVBLs0dG78Go69Hw", "text": "I was very impressed by this place.  The food was out standing (had the eggrolls and #14), the service was super quick, the portions were big and the price was perfect.  The place was clean and the atmosphere was great.  I can't wait to go back again.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AmwlDz7GAlv3yXdZgINo5Q", "review_id": "5BWROwxJTngqE_DhZUDnvQ", "text": "I am a fan, the food is always great and in good portions at a very reasonable price, service is friendly and fast.  My favorites are the salt and pepper squid and the beef and basil chow fun.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4I3lSlfXHFjNV_ypdL2J9A", "review_id": "yUxiwEi1FJzFwnpTeJxetQ", "text": "First time here was great and since then service quality and cleanliness has continue to lack . Dirty Tables , dirty cups a couple and inconsistent portions and quality. Had 4 people waiting on us so it was a joke they thought they where quicker but it caused confusion. Taste also changes from the few times we have been in. Chicken and rice this time taste like mush and chicken. Really like this place but the Pho at times is mixing ingredients and we have to ask or send back .. not what I like when paying to eat out", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2014-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "U3vNHFG5esyFtZAQfU32Mw", "review_id": "dXKQ_JytEleVdITTJRfsNQ", "text": "I will admit the food is good, the service is as quick as a fast food drive thru restaurant. Eventhough the service was quick, it was very unfriendly, I guess that's the price you have to pay for quick service. Another thing, they are not kid friendly. If you have kids under the age of 15 years old, do not take them there. My 1 year old was playing with chopsticks and dropped them on the floor, the lady cleaning of the tables, picked them up and ran away with them, never to be seen again. She never brought us another pair of chopsticks to replace the ones she took. Of course, we didn't need them, my wife was using a fork and I was using my chopsticks. I think they didn't like my kid playing with the chopsticks, so that may be why they took them away and didn't bring us an extra pair. \nIn conclusion, I would eat there again, but only carry out. I will never sit there and eat. There is too many other restaurants out there, to have to settle on such an unfriendly place.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 1, "date": "2014-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "sOCMCmBvtPgwdlLZKwk5ZQ", "review_id": "RXW96PuBg8ojSptEfY7rmw", "text": "I understand that they can get busy, BUT  as a regular, I'm disappointed.  Service was soooooo slow.  Food came out cold...Seriously!  Pho is supposed to be piping hot.  Also, the outside of the spring rolls were dry.  Yuck!  In addition, the Pho broth was too salty.  TOO MUCH MSG!!!  It's usually not this bad, but this time was horrible.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 1, "date": "2014-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Akl_qO-tt9rNgiRGNGrp_w", "review_id": "Go3sOfeM_wvfJLTcESfiUg", "text": "Love the fried fish and lobster!!!! The soups are okay ! They're seafood dish are better !!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2014-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_7QmbTH2TRX9wdFMOoKg6w", "review_id": "iaSMjT7f544fr6Q92caOvQ", "text": "TL;DR\nAbovu average food, very very slow services.\n\nWe had dinner here on Tuesday night, not exactly busy. The food is good. But the services is beyond slow. We waited at least 15, if not 20 before they come to order the food. We rall the waiter and they just refer us to someone else. We order 2 pho, and the spring roll. Interestingly the pho got here before the spring. The worse part is we have to wait another 20mins, call the waiter three times before we get the bill", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2014-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qZ1yfrQBm4YPjOthDdxVwg", "review_id": "8DEm7oJtOdP4xXfsBkLcww", "text": "Food and service was quick and good, but the restaurant is a bit dirty. The table I was seated at was sticky and the bathrooms are quite messy. \n\nThere was no problem with the food, but I'd much rather go to Chandler Pho or AZ Pho and Grill. They are much cleaner and the waiters/waitresses are very friendly.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2015-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EPyG0KTR4lL85yyLEHXgGg", "review_id": "6i3DRlX6ZtC9L9uPahvF2A", "text": "It's been 3 years since I've been going here I've been to every pho place possible, this place kills it with Portion,freshness,service, and my favorite...PRICE!!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2015-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YtdimxQvM1h6k0liZ4fMxg", "review_id": "0G_zs-SLMXdjudmSm1fZAw", "text": "Ill keep this short and sweet.\nPros :\n1. Awesome hospitality\n2. Fast service(when i say fast, u place order & in 5 mins ur food's ready) \n3, Food is is home-made style and quality is good. \n4. The restaurant is spacious. \n\nCons:\n1. Very busy on weekends but they use only one side of the restaurant.  \n2. One restroom stall.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2015-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZT_ENyVvJHax6rt5iBnKmQ", "review_id": "4P6sFqz0pNoX0--CObX1Cg", "text": "Everything was very good here. We had a combo of pho, fresh rolls, and rice plates and it was all so good. Finally, I have found a place near mesa that I would come back to. Being from Seattle, it's hard to find good Asian good in this area!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2015-09-11", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "tTGgmFhmZ8aWtXK_aD-l_Q", "review_id": "WrEqidQCbxEvMkAGB40feg", "text": "This is our families go to joint for pho. Who am j kidding, for anything on their menu! Good stuff all the way around!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2015-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CTedTJ6F7I4TctEVD7JpoA", "review_id": "3knr2AG7YWpSSeOuDjvJKQ", "text": "Can't go wrong with this place! \nfavorites: Pho, fried egg rolls, beef salad, their sweet and sour is unlike any other, if you are yearning for chicken, try #50 and oh don't forget Vietnamese coffee", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2015-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "DCHjsxtyJscMeTCTew0bFw", "review_id": "ZqSIICCCB_rPX3whhTUawg", "text": "I know all pho restaurants smell to the extent of the very flavorful Vietnamese dishes but this place smelled exceptionally bad to the point where it affected my appetite and mood. \n\nThey were very busy, which is a good sign but it was because there were two restaurants tied to only one kitchen, which of course resulted in inattentiveness, delay of our requests, and just bad service overall. \n\nThe food was decent but not amazing enough to compensate for the disastrous service. Won't be returning.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 2, "date": "2015-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2ox4vntazMlL9NBYlOT8Bw", "review_id": "mNJHUj1e62Vnl6qVk4Mwdw", "text": "Place was ok.. Ambiance was decent, tacky booths. Got #12 beef pho large. Nice portion size. The broth I was not a fan of, it had a very smoky taste to it. Also plastic chopsticks are never fun, but they did provide me with wood ones upon request. Recommend this place if you need a quick pho fix and quality doesn't matter. Service was excellent though!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2015-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2wkGOromHDttJOhfsNn8qA", "review_id": "HjgamfmekH4hL9ZOHYMnVg", "text": "Tried this place on a busy weekend night. Was seated pretty fast. Basic establishment, no updates and such. Our table ordered a few different menu items. \nTeriyaki chicken, fried rice, white rice, beef pho, chicken pho, and a mixed veggie stir fry plate. \nEnjoyed everything we ordered! We had 3 toddlers with us and since the atmosphere was loud, we weren't an annoyance.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2015-10-26", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "5Vv7wl3lsJyfprgaYW52sA", "review_id": "uFzllpMNJAjLdZaa3oBkYQ", "text": "I'm Vietnamese, so I know damn well what it should be like. First of all, every place with a rice dish will have short-ribs ( i didn't want pork chop). Ok no big deal, I'll take your other beef. They brought out cooked shrimp and beef in less than 5 minutes....does that sound right? I tried eating my food but my meat was cold. I poked Around with my finger and every part was cold. I politely told the lady I can't eat this. I walked out and she followed out and told me they can warm it up for you. Hell no I will not take spit in my food, no thank you!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 1, "date": "2015-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t_5H_-Y09KNPZ47-Iau8IQ", "review_id": "KZMgz8Iub3Jk6i45NH_rnw", "text": "Wow. I absolutely love this place. My dad and I have been eating here longer than I can remember. The service is as great as the cuisine. My 2 personal favorites are the charbroiled lemon grass curry chicken, and the beef ball and brisket soup. But the shareable classics for us will always be the house special chicken, the salty pepper squid, and an order of egg fried rice.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2015-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UtrachhtPgSiw-70qt_xXg", "review_id": "vox4XPCeEfIfv6zJh4B-3Q", "text": "Great dishes,  Try the Beef salad,  similar to Tai Beef salad but not that spicy.  Pho is great,  Bun is great,  Great seafood.  It's all good.  Never had a bad dish here.  Friend got vegetarian and he said it was good.  Recommend for casual tasty meal.  Really inexpensive.  You could eat for under $10 but I can't pass up the Goi Cuon, and salads.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2015-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FLdun6KWwAh-gC8VHVZGCw", "review_id": "D0C6r2d85spGGe1vR4n33g", "text": "Absolutely beautiful decor.  Tasteful, interesting, makes you feel as though you've escaped the desert.\n\nSpring rolls were tasty, salad was intense but delicious in its way.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 3, "date": "2006-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TLj3XaclA7V4ldJ5yNP-9Q", "review_id": "LX-bCgq-f9d3Rm5kUDyAnQ", "text": "I was there on opening night. Simply the classiest Vietnamese restaurant I've been in outside of the Bay Area. Definitely worth checking out! A little pricier than the hole-in-the-wall places around town, but you get what you pay for. If ambiance is important to you, it'll be worth the few dollars more.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2007-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "xjUOiQhVsKgqIa_99SRHdw", "review_id": "zc5ywi8vKHWb_Fgym2S77Q", "text": "After reading the reviews here, we decided to check out Cyclo since it's right down the road.  I can't believe we never went there before, it was REALLY good.  The food was spectacular, and the service was great.  It was affordable, and the owner wasn't quite as wild as we read.  She was energetic, but not overbearing.  We got there a little early, which was good because it got really busy later.  \n\nSPECIAL NOTE:  It's one of those rare places where you can bring a bottle of wine, or some beers if you want to.  There is probably some fee for it, but it would have made our date perfect.\n\nWe had the garlic green beans (I would have NEVER thought of eating a full plate of green beans could be so scrumptious) , the curry/pineapple chicken (yummy and not too sweet, and finely tuned), and the Bun Sai Gon (Saigon Rice Vermicelli)...  all were A+ dishes and had very intricate flavor combinations.\n\nWe had three dishes and the bill was about $25 after a healthy  tip.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2007-11-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "KI4sBf9jWLs4aGm_mIsFQA", "review_id": "1kO01L26Kpiqmlc3mhUvTQ", "text": "I was having a frustrating day at work and couldn't care less about getting back to work late from lunch.  Pho had been on my mind heavily at that time, and I decided to indulge.  I read up on some places in Chandler, and this was the closest one to the job.\nThis was a while back, but from what I can remember, the pho was good-not the best-but good.  They gave me all the fixins, the broth was just right, meat was tender, and the noodles were cooked just so.  \nThe service was...interesting.  I won't say its bad, its just very non-chalant.  Kinda breezy.  I'll leave it at that.  And since service is so important to me, I had to give the place 3 stars.  \nThe decor and actual building don't garner a comment from me.  I couldn't see anything anyway after the steam from my pho clouded my glasses up.  \nWhat can I say?  I went there for pho and got satisfied.  Not the best I had, but it hit the spot.  The menu looked like it had some awesome stuff on it though, however the prices aren't the greatest.  Honestly, I should try this place again and review it afterwards.  One visit won't give you the full flavor of any place, and this one seems like it has more to offer than what I required from it.\nGive it a try.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 3, "date": "2008-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-GYSHHxHYd6uTrqlTw_OGg", "review_id": "cr5He2pxcPFt75BCbW2dfQ", "text": "We go there often, including just last week. Justine has updated the decor, with bold colors and chairs that are much better than what they used to have. My experience is she has toned down her \"sassiness\" recently - along with dressing very fashionably she may be updating her image also.\nIt was a Thursday, we got the last open table at 6:15pm. I'm not an expert on VN food, but we love the food here. The portions seemed a bit smaller, but I suppose it's that or raise prices. We usually get several small dishes - beef salad, spicy green beans always have lots of flavor. It's casual enough my kids - ages 5 and 7 can walk around checking it out with no problems. I can see it being the type of place where service may vary depending on who is working and the customers.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2008-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kp6hGAGzjmtJvlrnGXOEjQ", "review_id": "qDgG0L56Wtl7tz4pJ-qWew", "text": "My wife and I eat out 3-4 times a week.  We have a hard time finding restaurants that consistently serve great food and have even better service.  Cyclo has both, and Justina makes dining an absolute pleasure.  We have been dining at Cyclo for 3 years and it is definitely one of my top five restaurants in the Phoenix metro area. Cyclo does not serve alcohol but has a BYOB policy that makes going out to dinner a whole lot less expensive.  I highly suggest eating here as it is one of the better restaurants that I have experienced.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2008-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "OHxLXVpmfa78qS7rjVVtmg", "review_id": "Pw8WEfobWHyp_NksB6iSag", "text": "Let me preface by sharing that I am a Vietnamese who have eaten Vietnamese food on five continents the past 15 months and I have to crown Cyclo as a gem!  Who would have guess it would be in Chandler, AZ?  For the quality and the price, you cannot beat it. I noticed a reviewer noted the price was higher than expected, but I sense the reviewer is not familiar with the finer details of the dishes which foodies won't mind paying for at a restaurant.  For example, you can order a bowl of pho at any VN restaurant, but they often only give you basil instead of the other fragrant herbs that should accompany a bowl of pho.   At Cyclo, they don't cut corners so the dishes come out complete with the love and attention as if you are family. I have to admit, my favorite dish there is the crepe. It's perfectly prepared so that the edges are crispy and the crepe itself is not doughy. But what separate it from other crepes is that Cyclo correctly includes all the fresh herbs that should accompany this dish. Most restaurants just give you some cilantro and lettuce to go with the crepe, but Cyclo gives you the complete experience!  It's analogous to eating mushroom risotto at an Italian restaurant with a shaving of aromatic truffle vs just a shake of pepper on top.  It's all in the details!  I enjoy the food so much I have been stopping by there for dinner when ever I am in town on business. My friends can't believe it because I generally tend to prefer restaurants with a 10 course tasting menu where I can linger for 2-3 hours each night enjoying my dinner.  The quality of the food at Cyclo must be good or I wouldn't be wasting my time there.  Besides, if you are trying to get the best bang for your dollar, this is definitely the place to eat.  The quality exceeds the price here.  I am trying to make my way down the menu and so far I have not been disappointed.  But my favorites are the crepes, the short rib appetizer, goi cuon (summer rolls), lemongrass chicken, and stir-fried string beans. The latter is full of flavor and your taste buds will appreciate it. \n\nGenerally, I don't order desserts at Vietnamese restaurants, but I always finish my dinner here with one of the house made desserts.  Crème Brulee was the correct texture which is important to me.  I typically won't order tapioca dessert because I think they are boring, but I was making my way down the menu so I took their suggestion and ordered it last time.  I am happy to report the tapioca dessert here was a few notches above the usual tapioca dessert so I will order it again next time. When in season, you can also order mango and sticky rice for dessert.  Yes, I have tried them all and can vouch for them.  Oh, one warning though: the at-your-table drip-coffee is very addictive and very strong.  It really rounds out the meal nicely but you will be up for a while with that boost of caffeine!  Incidentally, the best part of Cyclo is not just the food, but the warm service with a smile.  All must come together to create the perfect meal!  Cyclo is now a gem in my back-pocket.  I look forward to my next business trip to AZ so I can stop by again!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2008-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "U-x9Hx392dea8YWdgYFiLA", "review_id": "sNnkaBppmpdqc0T7zxsC0Q", "text": "I was told tonight that every person from Vietnam has a story.  Justina's is all about personalized service, oh, and a rough journey from North Vietnam to Los Angeles, by way of Hong Kong.  Some people may not like her or her style.  I thought she was funny and worked hard to live up to her claim that her food has a secret ingredient, love.  I tasted another ingredient, fun.\n\nI'm not Vietnamese, but I have a story about tonight.  I met a good friend of mine while here on business who had worked with a lady in Tucson who recommended her cousin Justina's restaurant in Phoenix.  When we told our server of this recommendation, the menu was snatched away and we were given \"owner's choice\".  Not bad.\n\nThe Green Papaya salad was excellent, the heat tempered nicely with the Thai Iced Tea.   The shrimp on the side of the salad was also very tasty.\n\nThe Pork Short Ribs were next.  They were very tender with a subtle BBQ sauce, slightly sweet and all good.\n\nA beef or pork (not sure) and rice dish came next and it was also very good.  The meat was tender and again, subtly spiced.  Not hot though.\n\nThe main dish, a mix of vegetables, scallop, shrimp and beef was less impressive.  \n\nFinally, the dessert (not something I usually do) was excellent.  As another reviewer pointed out, they are a little known sensation.  I had the creme brulee (jasmine? not sure, but very, very good) and the mango with sticky rice (covered with coconut milk).  The Vietnamese coffee was also very good.  It is allowed to drip at the table, mixed with the sweetened cream in the bottom of the glass, then poured over ice.  It's strong and full of flavor.  I may be up all night.\n\nOh, and as for price, this all came in at $58 for both of us.  I don't know if this is reasonable, high or cheap.  It ain't bad in general.  Those of you who do Vietnamese often will have make the call.\n\nI'm not in Phoenix often, but I will return to try some of the other menu items (Pho and other noodles for sure).", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2008-11-11", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "oZTUqyxr_bT-kxwR7_w-cw", "review_id": "vQM7rc09-0fdaKs98htvwQ", "text": "Great Pho and BYOB. Can't beat that.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2009-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WHjMr9qABBcf-bCCWozzFQ", "review_id": "nf3kx9fbe55Bl2oAhp3m1Q", "text": "I've been to Cyclo twice. The first time was great. The food and service was really good. Pretty reasonably priced. Really loved the fact that you could bring your own wine. Went back about a year later. Again, food was great. The garlic green beans as good as I remember. Pretty good service. The owner was there again in another cute little dress (sorry, but I notice that kind of shit). Liked the check holders had customer graffiti all over them (more dumb shit I notice). Finished the wine and meal, hit up the bathroom before leaving. Only one and it was occupied. Fine, it's a small place I understand. Wait a bit, then our spiky haired waiter comes out. He gives me a shifty look, which I didn't understand. I Immediately get it once I make my way in and look at the toilet. Didn't even put the seat up. Piss everywhere. I was so mad. Unfortunately, the bill was paid and he was tipped by the time I came out. F'n disgusting. I hate to judge the place by one waiter, but feel like if they are gonna let this ahole work here, can't help but think what else they might be letting slide.  \nSorry, won't be back.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 1, "date": "2009-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WK2Jh-uBmeqH7oI9IxfSHA", "review_id": "7dFlASIL6tuTagNAZPQCVg", "text": "The food is great, but it's a little more expensive than all the other Pho places around Chandler (and there are a lot!).  \n\nHowever, the green beans are absolutely amazing, a must have.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2009-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S4jPvmZU45O5bDaCzSrfxw", "review_id": "ukFoRKjmQ7k-M8JojXAQEA", "text": "This is not your regular DIVEY Vietnamese joint.  If I want that I'll go to Da VANG, where truth be told I'm afraid to go to their bathroom, but enough about that.  Cyclo has the best seafood crab soup! The spicy green beans are amazing and yes Justina is half the reason to go.  The prices are higher but the quality is BETTER.  There are so many things on this menu that I love.... the cake noodles are the BEST!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2010-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-QsT-5CRP2uDpQdyS7VCZA", "review_id": "M8IjYZWaGN5D671yXk5QDQ", "text": "I love Justina, the owner.  She is super sweet, funny and sassy.  It's true that she has a wicked sense of style!  My husband and I had our second date here and religiously go about once a month.  We go for the AWESOME food - the Mint Chicken is my favorite although the Crispy Noodle Cake is pretty good too.  My husband also likes the Pad Thai here.  You can't beat the BYOB or BYOW with no corking fee.  I love the atmosphere, the music and how intimate the restaurant is.  This really is one of my favorite places to eat and I always bring out of town guests here.  :)", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2010-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OESKxoNFZcKl47NrOubgAQ", "review_id": "4MHsmoiKKIOsA2S0x6ZCMA", "text": "Beautiful Justine, the owner, seems to always there in a slinky dress and 4'' high heals (Ole).  She makes you feel like you have known before you've ever met.  She is a friendly host and smiling all the time.  \n\nMy two favorite things are: \n - the long beans and \n - the beef salad.  \n\nAlthough the food is vietnamese, it seems more exotic.  I never get Pho here, which is my standard at all other Vietnamese places.  I guess I am too focused on the items above to even ask about Pho.  \n\nYou can also bring your own bottle wine and open it at the restaurant for a small cork fee.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2011-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nzzdOhWk3NmYuRJ9PFvLhw", "review_id": "bCLFJsFyBlpJvhTx5tplww", "text": "Their Pho Hai San (Seafood Noodle Soup) is great! I wasn't expecting  to having great amount of snow crab!\nThe broth is tasteful and delicately flavored. I believe their food is authentic Vietnamese, more american fusion type. \n\nThe the owner, Justina is very friendly and make us feel like we are home:) \n\nAnd you should try their fresh squeezed lemonade! No one is able to beat that!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2011-10-15", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "omoEjYFKVV7e-DtnezeUOw", "review_id": "3fKzvsTYa_l7bBeT6Q9-FA", "text": "Your gonna love it or hate it.  This place is somewhat unique spurred on my owner Justine.  She is Sassy for sure and she reminds me somewhat of the soup Nazi.  She will pick on you, insult you, hit on you, and more in the same evening.  You will either enjoy this or feel uncomfortable.  \n\nThe food is good and some of my favorites are the green papaya salad, Pad Thai, and Suon Non.  \n\nBring a six pack of a nice Asian beer if you are going because it is BYOB.  You may or may not get your left overs back  :)\n\nThe service needs work for sure but I have not found it as bad as many reference in their reviews.  I guess when you have a beer in your hand it is easier to wait or tolerate.   Enjoy!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2011-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "AuWUGOApBDh2vM0OKdXRbw", "review_id": "4n_oYdF-_Mv9lK3xkPGCqQ", "text": "I gotta say that if you have never tried Pho, you may think this place is the end all be all. It gets 3 stars from me because of the exposure it has given Viet food in the valley.  there are much better restaurants than Cyclo, with much better value and menus.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 3, "date": "2011-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SRfmo30fwefmnb4PPe2ZCA", "review_id": "cK7-cEYna3-976WPRUl0LQ", "text": "Fabulous food and sassy service - the perfect combination!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2011-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-cms2ELbzY2rSyGCVcioUQ", "review_id": "Df1_g4YgRrl9VfZcjR2TeQ", "text": "I can't get enough of this place. The food is great, the hostess, Justina is a riot, and because it is BYOB I can have a nice dinner with the SO for a pretty effective price. My wife loves the crepe, and the beef carpaccio is super good. When I'm not feeling 100% - the Pho lights my phire.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2012-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aLTl_OkLo0BFRxdz1n6sYA", "review_id": "r6dV4W3qV3WQqO7q5g9ZIg", "text": "The pho was good and a generous portion, but compared to most Vietnamese places... way over priced. The owner is very nice and entertaining :) The spring rolls were decent, but smaller than most places for the price. It still beats anything in the west valley.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2012-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UM6ARMpyqvM2aJ3Wnzwcog", "review_id": "xByuI9nlXz1YSKq-u_1hRw", "text": "We really like this place.  I love the owner.  She is fun, smart, sassy and cute.  Always attentive to your needs.  I have been for lunch and dinner.  There are things I LOVE here- the green beans are SOOO good.  I could drink the sauce!  The Pho is amazing and I always love the vermicelli at any Vietnamese place.   I will continue to come and eat here.  It is probably the best Vietnamese food in the east valley with a good ambiance.  Bring your own wine if you want a glass with dinner.  Bring your Visa they don't except American Express.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2012-10-28", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "vhxFLqRok6r-D_aQz0s-JQ", "review_id": "6MEVW4g-7My6zNeNUe5J2A", "text": "Been ages since I went in and Justina was as kind and as gracious as if I had just been there yesterday.  The prices are going to be more than Da Vang or Khai Hoan, but you are paying for the hospitality and warmth that infuses the food.  You can bring your own liquors, otherwise the drinks available are the thai teas, Vietnamese coffee, salted lemonade sort.  I think the vermicelli noodle dishes are slightly tastier than the pho.  The spring rolls are not to be missed.  Give it a whirl again.  It's been around a long time now and there is a reason it's still here.  No need for reservations but remember that the restaurant is small.  I'd go on the early side to avoid a wait.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2013-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9tAH3Vl312bwk6Yw0cnP0w", "review_id": "ap0XWITf5a-85WtTnBm4gA", "text": "I would give this place two out of five stars. The service was so so and the prices were a little high for Pho. It was ok but don't plan on going back.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 2, "date": "2013-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DPNqkX8cUIbCbAkMDKSTIw", "review_id": "CBS9MBVB_TQWGyrN_Iqzvg", "text": "My boyfriend and I love trying new restaurants and especially something that is far from classic American cuisine.  The first time coming into Cyclo, we were hooked.  Justina is there every time that we come to eat and she makes sure to go to each table to either take the order personally or just chat with the table and make sure every one is happy.  I recommend going and letting her \"surprise you\".  We have yet to actually order, everytime we go she picks our meal and I have yet to have the same thing twice.  Everything is AMAZING.  Absolutely Mouth watering.  Cyclo is BYOB so be sure to bring your favorite wine or beer and enjoy the best vietnamese cusine you have ever tasted!\nAll the staff is attentive and friendly , the artwork is local and beautiful and the feel of the space is inviting, friendly and just happy.\n\nI give it 10 stars!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2013-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "FvtPughae10_YeNVisMEuQ", "review_id": "vLQQdnpE5qc9E5AwrfuHkQ", "text": "Yes Justina is a foul mouth smart Alec and I wouldn't bring any kids in here but she is also warm and welcoming. She remembers patrons and what they like.\nYes the food is expensive - especially for lunch, but the food is great, full of flavor and portions are large - I always take 1/2 my vermicelli home. Plan on $20 per person. \nYes the service can be a little slow but the BYOB policy and casual atmosphere make up for that (although, the chairs are a little uncomfortable). \nI love this place and we keep going back for all it is and all it isn't. One time we didn't realize they close for a couple hours in the afternoon and walked in for a special celebration just a couple minutes before they closed, they put our beer and wine in the fridge served us and told us to take our time...they are good to their customers. \nCheck it out but be prepared for what it is. \nAlso, it's small and gets packed!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2013-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0q0EYyhs3_IfwsP0QLe17g", "review_id": "joQOnZJFo4oj2ilTsi2h_Q", "text": "We love the restaurant for its food and atmosphere. Justina, the owner, has a unique style and she might come across a bit too eccentric and offensive for some people. That's her personality and it is part of what you get at cyclo. We go there once a month and find the food to be consistently good. One thing we'd like to see some new dishes once in a while. Our kids love the rolls and lemongrass chicken - sure bet. They have internet access, good for me if I have to do emails. Decor is great however I am not fond of the patio chairs. We can bring our own wine at no extra charge, which is a plus. The music is Ok, ambience and at least it doesn't hit you on the head like brick - like sushi room or postino. Cleanliness Ok. I know they once had issues with inspectors finding dead roaches - but we're giving them a chance. Service - when Justina isn't there is lacking. The waiter walks around with his iPod and not really paying attention. I've never seen this in my entire life. This is a big negative. Overall, we find this to be a superior Vietnamese restaurant compared to others in the Phoenix area. Most are downright awful so the bar isn't that high. In the end, they do score some points.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 3, "date": "2013-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RA3vn0rFMhHlEPW8WKw1Dg", "review_id": "L8bu_vBFjUeWMB8-38uJLg", "text": "Love this place. Food and service is top notch. Priced right and food that makes me come back over and over. Try the short ribs and green beans and you won't go wrong. Don't forget to bring your own wine.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2013-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RMkk7R16OJjoJELP-ud7jg", "review_id": "Vu2RUmsiOvrxdKVdWEB2yw", "text": "This is a secret place that some people drive far to go to.  Great environment with colorful lights.  You can bring wine in.  Owner is a server and is great..", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2013-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4-76r_oMNqFnck851vNJDQ", "review_id": "PF2FgQkaoR_d8rnZ5Weebg", "text": "Horrible service. Asked 3 times to order, asked twice for a knife and what kind of Vietnamese restaurant doesn't have meatballs for your pho?", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 1, "date": "2014-10-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "LiBiG6G_5visF_kGdzrrHw", "review_id": "Brt0vhJyzw2w31DUVrH_8w", "text": "OMG what is wrong with you Yelper's bragging about this place!  If this is the first place you ever had Vietnamese food you have been duped!  I have been there 3 times and I am done. Today was for lunch.  Cheap plastic furniture starts it off. We sit down at a table that was soaking wet and a older guy comes over with menus. Ten minutes later he brings us water. Five woman come in and sit down.  He brings them water. As he walks by I ask him if we can order. Nope he goes and takes the orders for the 5 women who of course get there food ahead of us and we now are there over 30 minutes.\n\nSimple food ratings-\nLemongrass chicken Dry as can be and it comes with no sauce.\nPineapple Curry Chicken was terrible.\nLastly the short ribs matched the other two dishes.\n\nOther than the food runner the staff was not friendly.\n\nNever again", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 1, "date": "2014-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aqSyV_KPm1xIN1cjFO68aw", "review_id": "n14R2qFGtFAc2Qseua559A", "text": "Absolutely amazing food! I recommend the papaya salad, garlic green beans, black pepper shrimp, beef chow fun and the lemongrass chicken. Your experience is bound to be unique if Justine, the owner is working. She is fabulous and memorable to say the least. The best part is it is byob so your check is reasonable. Why haven't you tried his place yet?", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2014-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZZlsLb1mfrWo82rN07ZmFQ", "review_id": "r0-d96WuNt_UIvwjvfmAPg", "text": "Best phone in town! Always piping hot  made with love and a great menu. Check it out. You will not be disappointed", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2014-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DuchFqoxdq-9GxNutxg3PA", "review_id": "qOWyl1Y16OOZepmegWIUHg", "text": "Always the best for hot soup on a cold night. Justina is a riot and always makes me laugh. Its great too because its BYOB! Highly recommend this place. Small and quaint inside. Homemade recipes", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2015-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "5v5kfSCSxCScnevRBhIJyA", "review_id": "Q6hPaqfMShLzUFPO4BBhyw", "text": "Chic and trendy while still retaining a welcoming feel. \n\nLooking for a quiet place to enjoy an Asian meal, I stumbled into Cyclo. Walking in I was immediately greeted by the animated owner, who made me feel instantly happy with my choice in venue. She recommended to go with the beef pho which was delicious and hit spot. \n\nOh, and they offer BYOB (bring your own booze). What more can you offer?", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2015-10-09", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Op8xOO7hQa4qFVfnKARcAg", "review_id": "DJN3-CUpX-v3t7FCKedxMg", "text": "We went to eat at Cyclo on the recommendation of a close friend.  The atmosphere is fun and festive.  I'm always game for a place that serves tasty Asian food and does not feel like a cafeteria.  On the contrary, the restaurant is chic.\n\nThe food is reasonably authentic, and I mean that in a good way.  Authentic enough that I got my VN fix.  The nuoc mam is flavorful without being overpowering.  The seasoning of the food is well done.  The feel of the dishes is authentic with a little bit of fusion.  Little Dining Partner had the pho tai and really enjoyed it.  Dining partner and I had maybe six of the small plate items (salad/goi, pepper shrimps on toasts, spring rolls/chai gio, etc etc); everything was tasty.\n\nWe enjoyed the watermelon slices in the water.  We also loved that it was BYOB.\n\nWe're coming back to Phoenix for the holidays.  I'm certain we will be coming to Cyclo again.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2015-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KnhD16LRku2SFADeZodYyQ", "review_id": "aGLE3ewNKqaSc8kK20E6Og", "text": "Delicious food, and Justine is a an absolute creative beauty! Love everything about this place, including the atmosphere and food. YUM!!!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2015-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KBxjCY87ji8jlT3shQRPHQ", "review_id": "TPWrG5cadCDcz5sxeKCrRA", "text": "I am a big guy and normally don't order my own food I just tell the waitress protein please, that's kinda scary at a Vietnamese restaurant but I took the chance. She brought me out the spring roll and mixed plate extra meat and it was amazing. The fish sauce was to die for and the service was impeccable.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2015-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BhzLVPeFeeBK_YOldlyGkQ", "review_id": "2KHrJhjwJH-UbcqV4p73wA", "text": "This place ROCKS! Justina love ya girl! Outstanding food, outstanding service, great atmosphere. Trust me... you gotta try this place! :)", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2015-11-19", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 1}, "user_id": "PiIdsdEd8JrRaMv5aDzSZA", "review_id": "8EhsHlT7GXm4JHkpW_e0vQ", "text": "Pho Kim Ripoff...\n\nheinous-snail-paced service, portions smaller than Top Ramen,  Vietnamese customer priority, bland broth, owner looks like a wannabe mafia leader, and non-pho-like prices... Pho Kim no thanks", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 2, "date": "2007-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "6e0hIBnPHarTMuACQJXQLA", "review_id": "JhhgiyasvSSwQ_F8GXiVMw", "text": "\"What the Pho?\" \"Pho King\" and Pho 1-99, and now \"Pho Kim Long?\"  With the copious amount of funny sounding Pho restaurant names there are, I thought this was just another one to add to the list.  But this was actually pretty good.  I got my regular rare steak and tripe deal and was surprised to find out that it was delicious.  :)  I believe they also serve Chinese food but I didn't really take a good look at the menu.  It was straight to the Pho kim PHO for me!  Also, the restaurant itself was pretty clean.  All in all, this is good stuff after a long night of drinking in Sin City with good taste to match!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2007-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3TkafWoXa1m-o7-3oYYX6A", "review_id": "jrgt6bw4tUvQDX1PMoB3YQ", "text": "I didn't see the \"II\" on the sign of this restaurant, but I'm assuming it's the same one/sequel.  \n\nIn short,\nthe broth tasted really clean - good, but not rich!\nnoodles were too thin - we'd asked for them that way and wanted regular pho noodles, but we only asked to avoid wide-flat noodles! :(\nThe pho was good, overall, but I wish that the noodles were the normal kind and that the broth was richer.\n\nIt's slightly more expensive here than in L.A.\nWell, since they open til 3 AM, I'll give em 3 stars and a half.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2008-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OqOCMRpVNvvdPDMhoG_DCA", "review_id": "WiB9BBo2kKBKCpfydh7J3A", "text": "My father only likes Asian food and my family really wanted to Vietnamese food.  I really dislike Vietnamese food so they took the chance to ambush me so that they can get their way.  My sister read that this place was well-received and popular.  It wasn't too busy when we arrived at 6:30PM.  \n\nFor the full review and pics go to http://www.kats9lives.com/2008/07/ph-kim-long-need-i-say-more.html\n\nThe food came out SUPER FAST.  I guess for Pho it doesn't take long, but they must have a batch of egg rolls ready to go every second.  They immediately brought the egg rolls out and they were piping hot.  I thought they were good but nothing too special.  \n\nThey also speak Mandarin here.  The server was listening on our conversation I guess and started to talk to us.  It took me a while to decide what to order.  My family all got a bowl of Pho.  The soup was okay.  Same thing, nothing special but not bad.  The portions here are smaller than what we get in Los Angeles or Orange County.\n\nEventually I decided to order the French Style Steak.  It was flavorful, but nothing that I would write home about.  Apparently I would write on Yelp about though.  =9 It was alright.  A little bit on the expensive side.\n\nOverall the meal was decent.  They had HUGE signs of Live Crawfish posted everywhere and when we asked they said they didn't have it.  They really should have taken the banner and signs down.  Would I come back here?  Nahhhh... Was it bad?  Not really.  If you just want to satisfy your Vietnamese craving, then I guess this place wouldn't be too bad.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2008-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zRiz9k2brNAW-AgM_TLk6Q", "review_id": "j_VA_vgt9T_v4D-2rrCHMw", "text": "My first experience with Viet food. Problem was, I ordered a very typical dish that could be done anywhere.\n\nTo start, I thought the greeters sat us quickly. The look of the place was clean, but nothing fancy. The waitresses were attentive and did a good job of backing each other end (they didnt just dedicate one person per table, which created the appearance that you always had someone there if you needed it).\n\nI enjoyed my food and noticed that it was delicious and not overly greasy. I actually felt good after my meal. No bloating, laziness, or indigestion. \n\nI would definitely eat here again when I return to LV.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2008-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-FdS5OW4ijBTcqqIZC7Bdg", "review_id": "H0Uzunaq_OMoWTigKBO7Ew", "text": "I liked the food and the decent price.  But they really need to do something about the smell in the whole restaurant.\nUpon arrival, you will smell some dirty cloth or dirty table cloth.  It really turned me off.  The whole time I smelt the dirty cloth.  It was not just me but my parents, my hubbie and my brother and sister in law were complaining.\n\nThe dessert menu looked great but I didn't have a chance to eat them - sooooo full.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2008-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5SKqoR4nFPp9Yysb3CsnIQ", "review_id": "prK89j2lZPiQGWBgDL-lXg", "text": "I really wanted to give this place stars but when you live in the Bay Area and have access to so many pho spots this place just does not meet the mark.  Especially when they want to charge 8.50 a medium bowl..... The decor has been updated since last yet the service and food is the same.. just pricier.  I have heard that their crab/crayfish night is the fun/tasty however I have yet to experience it.  This review is based on 8 different returns to the restaurant... different times of year, different years.  Yeahhhhhh-- not again.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 1, "date": "2008-10-11", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "-V4aEsap-mu-OcZnPr1TMA", "review_id": "WCmqA0h5hssPdvn1Ue-liw", "text": "I will Pho Kim Long -er. I just wanted to say that.\n\nFood was okay - decent, I mean Im not big on buffets so pho was soothing and tasted ok.\nI ordered the CafeSuDa and it was already mixed, which I don't like personally - it was too sweet for me.\n\nThe service was good, and although we had a contagious fit of toppling over our glasses of water, the staff was quick and replaced our water promptly with no attitude.\n\nInside was decorated better than usual pho spots. And I'm glad to have an off the strip alternative.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2008-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E62APOQNiTQ6VM6DORZcvQ", "review_id": "ghjnfINor5nKxA3bUnm09A", "text": "I seriously don't understand how my friends come here in the summer to eat pho! It's freaking over 100º outside. So now that it's November, I decided to give it a shot.\n\nI would give it 3.5. It's a good place to get your quick fix of Vietnamese food if you're craving it. Price is a little higher than average. $50 for 4 people. 1 dish and beverage each person.\n\nIf I had to compare it to the Pho in the Bay Area then no, it doesn't compare. But just being able to have a bowl of decent pho after a long night adds some stars. \n\nRice dishes aren't bad. Portion was a little smaller than what I could get back home for the same price.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2008-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AxMidwv7ZyrG9cOioFs1_A", "review_id": "RRg1j7VcPbHY54FLhx3VvA", "text": "Best Pho in town! They also have tons of other yummy specialites!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2008-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "C3pC0jFEQG6zzoJA4jlkXg", "review_id": "sN91BhnEOfpLasXYRzFtdA", "text": "It was our arrival to Las Vegas from the grand canyon and my parents were super hungry. i could have gone for a hot dog. but you know some asian parents, don't like to try other things, olllld school.\n\nyeah this places pho from what my parents say and my one spoonful was comparable to my own mothers. and man it was good. it was pretty pricey for pho but you know what, the ambience inside was very nice and classy, clean and cool, it didn't even smell like pho inside. [this is where you say OMG REALLY?] Yeah, REALLY.\n\nSo I wasn't feelin pho, but i should have but i got the chicken soft noodles, beef soft noodles, and fried rice and shared with my siblings.\n\nThe fried rice was SUPER bland, and the noodle dishes didn't have that savoriness to it that you expect form most asian noodle dishes.\n\nthe pho and ambience saved its rating how ever, the other dishes messed them up.\n\nOH! and the bathroom is nice and clean! [You know i love my clean bathrooms!]", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2009-09-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "NF7fE0YLwHFzyMUqLZ9z5w", "review_id": "XunC30R15hUP_-_LqzlZSA", "text": "Needed a pho fix at 2am in Vegas. And got it. \n\nThe food was decent. I kinda wished the bowls were bigger, but they satisfied my craving after hours of gambling.\n\nThe service was nice. It was funny because my girlfriend wanted meatballs and asked the waiter how many balls are in the bowl. The waiter replied, \"yeah you get about two balls,\" and chuckled. Our table chuckled as well. The service was good and gave up water when needed. But pretty much like any ordinary pho place.. nothing too special except the being open 24 hours.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-09-11", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "DhN8xrHqTwrvqibPuD1ZwA", "review_id": "CddcPh6Cqnavv8jj9P_8iw", "text": "Your service sucks. Even by vietnamese standards. Your host is absent minded. I had to remind me him 3 times about my party and he STILL did not write my name on the list. THEN he seated parties that came after my party. Not just a few, A BUNCH. You suck pho long. Your service blows.  You need a new host, or a better one or at least train them to not ignore your customera.  I am generally very lienient on servce at PHO joints because you get what you pay for but you service was sensationally abysmal. \n\nNot to mention, your Pho is subpar, and the spring rolls are itty bitty.  ugh. never again.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 1, "date": "2009-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gk0l0y8CDCjdwGxHBe134g", "review_id": "MuYQ-GjukTG_DvrvW9rAdQ", "text": "The Pho was fresh but I'm not sure I would try extra hard to return. A little like the Cheesecake Factory of Asian food because of all of the menu choices and Average for food and service.  But there is very good side note..its open 24 HOURS! \n\nI could see it might work its way into being the best drunk food of all time.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2009-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZS_Y7GozJPOV5m9DWFTfJg", "review_id": "CIi7K25RHPg_qqQE4Jwd1A", "text": "AMAZING!\n\ni highly reccomend #32.\n___________________\n\nthat is all.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2009-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V5vRUH71XCDjBAPoj5WNlg", "review_id": "Dc5xCU8JxuPv41K8rOQ-kg", "text": "who really knows if this is good pho or not, i was hung tha fuck over and in desperate need of pho therapy. :P but it totally hit the spot and came out super freakin fast!!! omg! aaahhhhh.....\n\ni'm pretty sure it wasn't bad pho tho...meat, noodles, broth, all a-ok. the coffee was good too. thought i was gettin ripped off for a $3 cup of coffee but they gave me a big cup so it's all good! :)\n\nima make pho a must the next time i go to vegas again fo sure!!! yum! :D", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2009-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lOcwxZZEnCC1RbctNo3bDg", "review_id": "JYrVZJyvcw5foeXi-e6nYA", "text": "Not too shabby for Pho being near the strip. Open late too so that's a bonus and decently priced at $8.50. That's expensive compared to home, but it is Vegas and I've seen worst. The broth is pretty good, salty and flavorful, the way I like it. The meat was kind of chewy though, that's the only drawback.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2009-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IvVojsFPJomJw732ZZS_Zg", "review_id": "-JhXGOiPIrs_1iiQj1-ngQ", "text": "PROS:\nA large selection of delicious, authentic Vietnamese food. You can order anything from soup, to rice plates, appetizers and their iced coffee is to die for! I would have to say that this was one of the fanciest pho joints I have ever been to. Everyone was in uniform and very nice and helpful. I was in Vegas for 4 days and we ate here every morning!\n\nCONS:\nWe stayed on the strip so we had to take a cab to get to the place..\n\nFINAL ANSWER: Go!!!!! Pho is the best cure for a Vegas Hangover!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1dl4T334xmJmpps7JUL_kA", "review_id": "iItmLiZSil4kmM6VuJaKtg", "text": "After a long day of walking around the Las Vegas Convention Center - and unwilling to pay $15 for a slice of pizza and a drink - we headed over to this place for some Asian goodness. Frankly, it looked more like a Chinese restaurant rather than a Vietnamese joint inside. And the menu reflected this to a certain extent, where the offering was well beyond what you'd find at a pho place, with dishes that readily reminds you of a Chinese joint in the 626. The waiter / server was helpful, pointing us in the right direction. The pho broth was hot and tasty. Saw a lot of other people eating what looked like stir fried dishes. Definitely going to have to delve into that side of the menu the next time I'm in Vegas. Highly recommended.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iwuF9O_luA8MAWAH8DU8AA", "review_id": "cTVUtRqC_VBtPi_HgyEGqA", "text": "first off, a pho joint open 24 hrs. wha wha what?!? it gotta be good, right?\n\nin a strip mall in china town, pulled up & it was like an import car showroom in the parking lot. big place, packed..\n\nits good, dude. combo pho was on time! i ate here twice in 24 hrs., trust me. get some.\n\nbonus.  check out the bakery a few doors down (exit, take left), got 4 or 5 vietnamese pastries for about 5 bucks. tasty, great!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4B72SVOyT494OFLuZcx1ug", "review_id": "yDHNoKl7E58C2hnwRQkpLw", "text": "Have been here many times around 2am to get hydrated with some wonderful pho soup.\n\nCame back recently for a cheap quick dinner and was pleasantly surprised its pretty good while sober too.\n\nI've only had the basic pho and fried egg rolls, both of which are good.\n\nPho portions could be better though.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2009-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7tt3Lnvi1m4oYkCzqu597Q", "review_id": "OCswA9F_1IfFvTWYBnkJVQ", "text": "The pho is alright. Seems like if you ask for a large they just give you more soup. Bad service. I had asked for a refill & the waiter cleaned two tables right in front of me & still didn't get me a refill. Asked again & cleaned three more tables & yet still didn't get me a refill. Ended up asking another waiter for a refill.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 2, "date": "2010-09-02", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "pc3wRHZZd9PHpjytIpftXw", "review_id": "-dj9IJeh_TKyQ7IkDmENNg", "text": "This is the only pho place i go to when i'm in Vegas. \nIt can get packed during lunch and after club hours but you get seated pretty quick. The place is pretty big with lots of tables.\nTheir pho is good. There are many reviews about it below so...\nSince i always get pho, i wanted to try something different. I tried their hu tieu dac biet and it was not good. It was just couple pieces of meat, seafood, fish balls in soup loaded with msg that u can taste.\n\nBUT\ntheir bun bo hue is surprisingly delicious. I love the fact that it comes with so many veggies/herbs. Their broth isn't red like some places. You get the chile paste thing on the side to make it spicier and red. \nNext time i'm in Vegas, i will definitely get bun bo hue again.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "T7Unxf15tCDI3gXnzNOXHA", "review_id": "fjN0J3OKE0jxD7qVmIeTaw", "text": "Went last night Sunday labor day weekend , restaurant was busy , not expecting much in service been too lots of Asian places if u don't speak the language u get ignored, well kudos  to wait staff for being attentive . Ordered fried calamari little salty for me, house noodles very good, chix Hainan good, char broiled beef good will go back and try the pho", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M6M6LFSbkV_yehnOVbXmIA", "review_id": "2zP_NB0f-kejiCTDKk_1Bw", "text": "Pho Kim Long may not look special on the outside but once you open the doors you'll see the nice earthy decoration and will be greated immediately with a smile.  Service is fast and the place is always clean.  The menu has a variety of Pho and other types of yummy foods.\nThere tofu spring roll with peanut sauce is creamy and delicious.  Hong Kong style pan fried noodles with beef, bok choy and carrots #57 is my favorite!  The food is always fresh and the place is always busy.\n\nThis is one of my favorite noodle houses in Vegas.  Oh before I forget another cool thing about this place - it's open 24 hours!  How cool is that!\n\nOh and another plus is this restaurant listens to 98.5 KLUC!  Whoo-Hoo!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "vzjGe0X9htp1yzPvA_8udw", "review_id": "Jxa8mbvN0pFCZoqUzC1YFw", "text": "In Vegas, this is \"as good as it gets\" if you are craving some Asian food late at night after the clubs. \n\nOpen super late. Warm soup really hits the spot at 4am in Vegas. You can't find anything this authentic on the strip at 4am. On a recent Vegas trip, I went with 4 other Vietnamese girls and they took me here two nights in a row. The first night I tried the pho and the second night I tried the banh canh cua (large noodles in soup with crabmeat and fish cake). \n\nThey have a wide selection and everything is reasonably priced. Yuuumy!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2010-09-07", "type": "review"}
{"votes": {"funny": 8, "useful": 8, "cool": 9}, "user_id": "ac-LWMXfGE0ZMChLhYqnnA", "review_id": "F9HGAEAzBN0pbPci3LD_fA", "text": "I've always heard from numerous people say that this place was the best place for pho. \n\nOn a Friday night me and a group of girls decided to come after clubbin at TAO, after dropping the drunkies back off at the hotel we headed to Pho Kim Long! We didn't get here till around 4:30am and to my surprise this place was pretty packed, but they still had a couple of tables open. Parking around this place looked pretty decent.\n\nThe pho was pretty good and is always good when you're still drunk or if you have a hangover! The rice plates here are also pretty good! Prices are comparable to that of the prices we have in SF for pho. The service was good, all the waiters were super nice! Overall the pho was good, but I've had better before.\n\nNote: Ask one of the waiters to call a cab for you if you didn't drive here, because you cannot flag down taxis on the street. They will not stop because they can't pick people up off the streets, or you can wait for a taxi to enter the parking lot.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-09-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "hLuKgo7G6us4wNQoFb7N8A", "review_id": "FT58ztH8skODfDpfYln9PQ", "text": "Everytime I'm in Vegas and I want Pho I come here. But it's weird cuz I don't eat the pho. I usually come here when I'm about to leave Vegas and don't eat the pho because I don't want to stop on the way home (to OC) so I get non-water based food. \n\nLast time I got the vermicilli with meat & eggrolls. It was okay, I had better ones. I didn't like how they put the Americanized bag salad as the veggies in the dish. Then the last weekend I got the rice & pork chops. The pork chops tasted weird, it had this nasty taste after only on the sides and the part with the fat. It was not a good pork dish. ugh. they also put that fake american salad on the side and not like a real lettuce & cucumber like the real pho places in california.\n\nanyways, I heard the pho was good, so come here for pho and not the rice dishes or the vermicilli.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-09-13", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "glRXVWWD6x1EZKfjJawTOg", "review_id": "606Bc1j56JL3F2k39Lun_Q", "text": "I'm very much on the same line of Matt S. reviews.\n\nWhat the PHO do you want out of a 24 hour place? It's food, it's decent. It sops up your drinks. \n\nSure not the best pho out there, but comparing it to daytime good places and moreso places in California where I'm from is just setting myself up for never having a good night. Don't get pho then if you're a pho expert or love broth. I don't get it much, it's broth is just not consistent enough for me after having it a few times.  If I want soup, I get another kind or some congee. I think the other offerings are tasty and much better options.\n\n I tend to come here to get bun, rice plates or simple Chinese veggie dishes. \n\nLast night after some strong ales, the bun with bbq pork, eggrolls and shrimp cakes (added on) hit the spot. I think their bbq has great flavor and pretty damn good actually. \n\nIf they took out the Pho and just stayed as Kim Long, I think it actually would be a solid restaurant. What brings them down in rep  is their namesake. Most people get it and had better. \n\nSKIP the Pho, but it is a definite late night GO for other offerings.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W6rnZeAVvYWAZNWAtCXMBg", "review_id": "gH8SzAcHD032waliptzZsA", "text": "I am a pho-natic! I love the steamy broth with rice noodles, scallions, cilanto, bean sprouts and meat choices. That being said, I have tried other vietnamese food restaurants and some broths are overpowering. \nI happened upon Pho Kim Long by driving up Spring Mountain in the Chinatown area and decided to give it a try.\nWe are greeted usually immediately, seated at a table, and given menus. The floorspace is open, a mix of 4top tables and larger round family size tables. We are quickly brought water while we look at the menu.\nWe normally order pho tai (rare steak slices that quickly cook in the hot broth) or pho tai nam (rare steak with well done flank) along with chinese broccoli and garlic. It averages taking 5-10 minutes to get our soup and a few minutes more to get our broccoli. \nFruit smoothies with tapioca are available, as well as fresh coconut drinks, soda, juices, and asian style beverages. The menu is extensive with various dishes, noodles, rice, beef, seafood, chicken and vegetarian entrees. The spring rolls are fresh and tasy! I come here often, and need to branch out on the menu!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OOkeYmhdhxf_mPpPcLboRg", "review_id": "vGHh69w5oR94IffLFynO_w", "text": "Yes there is such a thing as a Pho Emergency. Example: You have a cold, it's 2am and all you want in the WORLD is a hot, steaming bowl of pho. And some Thai Iced tea with boba.  And in those situations, thank GOD there's Pho Kim Long. OPEN 24 HOURS A DAY!!!  Heaven. Their pho is perfect. The thai iced tea with boba is also perfect. There's lots more I want to try. This was my first time there, and all I can say is it's JUST what I needed and I will most DEFINITELY be back.\n\nI would have given 5 stars but all I've had there so far is pho and it was a bit pricey for pho. But tastewise I have no complaints, and a 24-hour vietnamese restaurant?...well that's not something you see just anywhere. Viva Las Vegas.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "388AKxr2e8_5-NAXPWFYxQ", "review_id": "pqmfuas2UZNBTykOYkK7zw", "text": "Not sure if this place is related to the Pho Kim Long in San Jose but I came here kinda expecting the same.. However, the service here is waaaaaay better & the pho is just as good! Perfect soupiness & proportions for after a night out.  I got the pho tai with the meat raw on the side so I can cook it myself in the soup (I HATE when it gets overcooked).  My bowl was about $6.. what a deal! My only complaint with this place is the smell.  I'd give it a 5 star if it weren't for the wet towel smell that fills the air. Oh, & it's open 24 hours!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-09-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "IRvRxAyXIB_ZZqt31j35eg", "review_id": "dEw5GVwtCf3DRZfsFCm-Bw", "text": "Phokim long the lines were not. Phokim good the food was. Phokim amazeballs service. I'm straight talking like a phokim asian Yoda, I am.\n\nI had chicken pho and strong iced coffee. Shared spring rolls with my girlfriends. Everything was fresh, the dining area is huge and comfortable and everyone is super nice. Cheap eats since it's a locals place. I would have never ventured into this side of town if it wasn't for the phokim amazing app known as yelp.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oYewMPXEOy4yfy3nPb2Wzw", "review_id": "_17bUK1M5mIRbGQW6feqpA", "text": "I first heard about this infamous \"Pho \" house from my hubby, we laughed about the name, and said only in Vegas...\nMy son said, \"this place has a controversial name...\", LOL. (we didn't think he'd notice)\n\nNormally, I don't leave the Casinos, not even to eat.     = O\n\nBut, we were on our way out, so we stopped here. (we obviously lost and were eating cheap...)   = (\n\nI have to say I didn't know what to expect, vietnamese hooters girls, \"would you like spring roll mister?!?\", while playing sleazy porno music...bada bow bow... (my lame try at cheesy porn music), dimly lit with sticky tables. But I figured, yes, I've gotta see this place for myself. (I'm crajee like that) (Korean for crazy)\n\nIt is located in an Asian strip mall, packed parking lot, so watch out, if you know what I mean...  ; p\n\nThe place is actually pretty decent inside, it has obviously been expanded from it's original layout. Looks like your typical Chinese family style restaurant. Thank goodness there were other kids in the restaurant... there could of been a screeching of disco records as we walked in with our 12 yr old... \n\nAs soon as we walked in we were greeted and taken to a table and given menus. I love Thai Iced Tea and Thai Iced Coffee.... (ask for extra half and half on the side and you can elongate your drink, I always do) The servers are pretty courteous as well as efficient, and the food was decent, the orders did not come out as fast as I would of expected from the given service. This was the only problem. They had  brought my order out wrong and we didn't want to have to wait again for the right dish. So needless to say wasn't too thrilled about that Pho Kim Long wait for the wrong food.  \n\nThat is why they only get 3 stars from me, besides the place better be \"Pho King\" Amazing to deserve more stars. \nThat's a good name \"Pho King\", or \"Pho King Good\", hmmmn...\n(probably been done....Phok)\n\nWe are all so Phonny....not. (slapping my own face)\n\nThey are OPEN 24 hrs... duh...Vegas.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l-p9y_0mx9GdzOSUioEE9A", "review_id": "HHKmYSjP4nRfzaq5QI4gug", "text": "Arrived in Vegas early in the morning and was hungry for something to warm my stomach. We had rented a car so we decided to go to the Asian plaza to check out the restaurants. We were there at 9:30am so everything was closed except for this establishment. We took a chance and tried their combination stir fried noodle with veggies, chicken & shrimp and a bowl of soup noodles with the thin flat rice noodles with beef balls, shrimp, calamari, and chicken. Service was a little slow and I got my soup noodles way before hubby got his stir fried noodles. The flavor of the soup was good but a little oily, noodles were soft, and they gave a decent amount of seafood. I enjoyed the stir fried noodles also - the crunchy noodles, meat, and vegetables was covered with gravy.  \n\nThe place was crowded for a Saturday morning and people seemed to gravitate to this place for their soup noodles. It's lively and the service was friendly but a little on the slow side. Prices were decent: range $7-$10.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-09-30", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "xthFXWIoXm06OKgXj0ROCQ", "review_id": "OILwA_lB8ip1t4su9xfQyA", "text": "Found this place thanks to Yelp! Some friends and I were craving pho late night Labor Day weekend and we couldn't be happier with this place. I have been back several times since. The food is fresh and so cheap, a good go-to for your pho fix.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2010-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "R29Yz4_15Sgn4D6dWu5mnQ", "review_id": "phio53SqGdiDVx9zxVeDPQ", "text": "I'm from Sacramento, CA so when we were in Vegas we were really craving for some authentic Viet food.  This place will satisfy your cravings but the service was horrible!!!  Upon arrival the waiter spilled 2 glasses of water on my friend.  They were very rude when we asked questions about the portion size of the pho.  We also asked for change so we can all pay the bill separately and they were really rude about that!  \n\nThere's so many other Thai & Viet restaurants in the same plaza so if I were to go back to Vegas and wanted some authentic Asian food I would not go back to this place.  I'd try another restaurant in the same plaza.  As a matter of fact, we went to the Kung Fu restaurant on the corner of this plaza and they serve Chinese & Thai food and the food was great & service was good as well.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 2, "date": "2010-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Wyy1azljqKrTZYv9wZdWjw", "review_id": "kWlsF6K_yzlvuRO9TSIIvg", "text": "Yes I'm a white boy from SoCal but I used to live on bolsa in Little Saighon  so i know Pho! This place is straight up awesome in comparison to Little Big Saighon Pho'.  I love the Pho' Tai so much here because the soup is flavorful and the portions are perfect at a affordable price. \n\nGreat service and awesome Pho'. \n\nWhen I'm back in LV I will make my way back to Pho' Kim Long for sure!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2010-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "6gdA_SywHBFSmAA7qYBogQ", "review_id": "3O52EGYXJQH4RN_ysToBBg", "text": "Well you're in luck if you don't mind terrible service...\n\nI came here the first time because Kung Fu Plaza was closed and the people I were with suggested this as another option. \n\nSo in we go.\n\nThey saw us come in. Nothing.\nSo we waited. Nothing. Waited some more.\nEventually they asked us how many in our group. 5. So we were finally seated. My seat was sticky so I moved over one. Fine. We ordered our drinks and once they came we were asked if we were ready to order. We weren't and asked for a couple minutes. I guess by \"a couple minutes\" the waiter assumed we needed a few hours to decipher the menu because he didn't come back. We talked and waited and well,by the time the waiter DID come back 3 of us were more than halfway done with our drinks. \n\nI was NOT pleased with the food or the service.\n\nI went back another time deciding that maybe I just had a bad experience that first time,\n\nYes,the service sucked.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 2, "date": "2010-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cWnnuKwY-X8cPhWoFmHvxQ", "review_id": "KIoZWCHm8Q1YbxbQtiPbuw", "text": "SoCal Pho is better than Vegas Pho. Pho sho. \nBUT for being in Vegas this place was probably 1 of the better places to get your Pho fix after a long night of head bangin' partyin'. I got the Pho Tai Nam (rare steak and flank). The seasoning of the broth was ALMOST (keyword) comparable to that of places in Garden Grove and Westminster (S.California). It's a good fix, but I definitely would not come here unless I needed a hangover bowl of pho. Service is ok, but if they know you're Viet then they're a lot nicer, so lucky me for that.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-10-10", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "FgHJ_ggl4zgKDPo7TwwQqw", "review_id": "z5dG4BJbgit_k88TcTcCZw", "text": "Great name but the experience is all downhill from there. Food's ok, but the portions are small. There's a bad mildew-y smell that knocks you in the face when you walk in and the service is horrible. It's like they're mad at you for giving them your business. And don't dare ask for a refill on water...", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 2, "date": "2010-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "NVzfe0X8IAJMISy0Id4kKg", "review_id": "eulMkdFld72REQayzB616Q", "text": "\"what?!\", \"where did you want to eat?!\", \"HAHA! huh?!\" Those are just some of the weird reactions I get when I say I want to eat here. I guess you can say it doesn't sound very nice to say, but the food here is my favorite Vietnamese cuisine. I'm not a huge fan of the pho but I'm a very big fan of their vermicelli noodle bowls! It's the perfect amount of food for someone with a middle sized appetite. They're open late night so if you're out on the strip with your friends or are looking for a late night snack (hardly the size for a snack), Mr. Pho Kim Long is your best bet to satisfy your Vietnamese craving.\n\nThe service isn't super because of the lack of personality their staff has but they bring your food out fairly quick. Does one base service on how quick you get to eat or how pleasant they make your visit? I say it depends on both but lucky for Pho Kim Long, their service is very fast and consistent.  It wouldn't hurt the staff to crack a smile or two, crack a joke, or laugh even. They don't have a problem splitting your checks as long as they get their money.  The atmosphere is very traditionally Asian and being of Asian descent, it doesn't do much for me.  In other words, you wont catch me with my iPhone in hand snapping shots like some tourist or something. Maybe, the food for Yelp but that's all ;)\n\nNever had a problem customer service-wise, always accommodated the big groups of friends I go everywhere with, and doesn't take log to bring what you ask for. That's a big thing for me when the server takes the detour to bring you something you've asked for. And having to ask for it twice really peeves me but as busy and as impersonable as their staff is, they go and get what you ask for right away. Maybe to get you to go faster? If I wanted to be In -n- Out of a joint, I'd go get a burger! Hahaha! Go for the pork vermicelli, add the sauce they give you with some of the oyster (brown) sauce and a bit of the hot sauce and you'll be good! Have some fun saying the restaurant when suggesting to eat here! Happy eating! :)", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-10-22", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "xT_27A08IgFEzCtiio1aVg", "review_id": "M4MdiZJPzCJURgEmW30C8w", "text": "If it wasn't for the food, I'd give it a 1 star.  The service shouldn't be expected here.  I asked for some lime 4 times and they still did not bring it.  .  This place is okay for late night cravings, but holy crap... You'd get lucky to get service at all.\n\nI ordered some pho and the soup had a lot of flavor, so food is okay.\nIf you do come here, expect okay to zero service.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eih46vKL3BxS3xHI9hkqIg", "review_id": "Iir55NOveVccd3ZgjYDoAg", "text": "Meh. Like some other Yelpers said, I can get better pho in SoCal. I didn't come after a night of drinking or partying, so I was of sound mind when I sat down. We visited around 9pm on a Sunday night and the place was adequately busy for a 24-hour joint. We got waters quickly and our pho came out in a matter of minutes. The broth was ok; saltier and less flavorful than the pho I've ever had before. I'm partial to deep, hearty, anise-infused broths that don't need hoisin or sriracha for enhancement. Needless to say, I was let down. On the bright side, I was happy to find something 5 minutes away from the strip, even if it's located in a strip mall decorated by a fake Chinatown facade. \n\nTwo stars for the pho, but I thought the service was fine and the bathroom was surprisingly not filthy.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-10-26", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "j9JvJxX2T2uwzJd-GPSTHg", "review_id": "RIvQcYgv6HoxOjiBFpbBWg", "text": "BEST place to go whether you woke up hungover, still drunk, or just craving pho after partying all night at the club. Sure, it may not compare to pho in San Jose (if you're ever up in norcal you've gotta try Pho Kim Long in SJ!) or Westminster, but this is the best pho you're gonna get in vegas. And it sure beats the americanized version they serve at TI.\n\nAnd I've never made it after a night at XS, but it's open 24 hrs so you can get a headstart on that hangover cure.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nna7D8sTJ5CtUISrzZ9toQ", "review_id": "y-2avTBxwkY7OVHbbatBJA", "text": "Phokimlong- time! Best pho ever", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2010-11-01", "type": "review"}
