{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "6VEID9yjoYWFZkUcP_GNBg", "review_id": "kfQftCM9V_VX5UmtNYP27A", "text": "When I moved to the area, Dr. Weinberg was recommended to me by my cousin who had been a client for years. I've had nothing but positive experiences with her and her staff since seeing her two years ago. The team is professional, nice and courteous. I recently had to reschedule an appointment due to a last minute work thing and they were very accommodating. My daughter looks forward to coming to the dentist so that's saying something. I DO wish they would turn off FOX news in the lobby as I'd rather watch paint dry but... nobody's perfect.", "business_id": "e_U_FnpdKVgNb4mUN2cU_Q", "stars": 4, "date": "2013-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "FdODIeiNDxNMq_nDQa9hpQ", "review_id": "tdM4S77aq0wktdWUXPFPLA", "text": "I began attending the Midwife Center for well-woman care about three years ago, then chose the Midwife Center as my care provider when I became pregnant with my daughter a year and a half ago.  I can't say enough good things about this place, from the inviting atmosphere to the knowledgeable and supportive midwives to the very helpful nurses and lactation consultant.  My daughter was born in the Forest Room, and it was everything I'd hoped for.  One of the saddest parts about leaving Pittsburgh for me this past summer, when we had to move for my husband's job, was having to say goodbye to the Midwife Center.  I am hoping to find someplace half as wonderful in our new city.", "business_id": "AcD5G-u_GvLSnL4Vppq80A", "stars": 5, "date": "2012-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FCMtmwJxnxKVKeIQncN3_Q", "review_id": "-5wAqMLqBA5K9CYezYMW5g", "text": "I have been a patient of Dr. Hess for over 20 years; I travel from Chicago to see him.  \n\nHe's as good as it gets!", "business_id": "59sAhagzR9x6b8-6hBhMMg", "stars": 5, "date": "2014-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GgO4Q6d3mnHFwjSmpOg3Vw", "review_id": "wSTtSflfXj5pbdiyWQd1FQ", "text": "My friend was transferred to this hospital from the south park emergency room. First of all I have never experienced a more unorganized or inexperienced staff and medical center in my life. She was admitted for uncontrollable cramps and back pain with a migraine. They kept her there for 2 nights which is unheard of. She has a history of migraines and has received certain treatment for them multiple times at Presbyterian. After telling them what they give her there cmc decided to give her a whole new round of medicine that she has never had before. They took a ct scan but we never received results, still haven't. They also did not offer her any food or drink the entire 60 hours we were there!!!!! The last straw was when the unqualified and exceptionally rude nurse was trying to give her meds through her Iv. She was in severe pain and said told the nurse that something wasn't right. She told her she felt as if her vein was exploding. The nurse said nothing and just kept going. A second later blood and the liquid that was being injected into her started free flowing down her arm as in fact her vein had blown. The nurse told her to apply pressure and when the gauze she gave us was completely soaked through with blood she handed us a PAPER TOWEL!!! Also, the entire time we were there and they did any sort of work with my friend they didn't use any clean up procedures at all!!! They're were bloody gauze and packaging left on her bed table and I even had to throw away a needle that the incompetent nurse left behind. We have already filed a complaint with the North Carolina medical board and contacted a malpractice lawyer. PLEASE DO NOT GO TO THIS HOSPITAL!!!", "business_id": "JeZRokQJYf6sV_TF7lm9_Q", "stars": 1, "date": "2015-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ESu6WCQYwQSq0kgB7WHSzQ", "review_id": "vNDtgmM-bKvce0P3J5tmAw", "text": "Having just moved to town, I was told I *have* to go check out the Dowd if I want to join a gym. Man, the guy who told me that did not disappoint; this place is bitchin'. Coming from 24 Hour Fitness, this place is everything I wish a lot of those gyms were. Three full stories, each with a weight room. An unbelievably sophisticated group workout schedule - my kickboxing classes are plentiful and if it's not at the Dowd, it's at one of the other Ys. TVs on the cardio machines. New free weights in the weight room, modern machines. Towel service in every room.\n\nI could go on and on, but if you live near Uptown and aren't yet a Y member, you are missing out. Oh, if you have kids, you can't bring them to the Dowd Y on weekdays. I don't, but just FYI.", "business_id": "b3u-GK6_xj2fJkinzLk_jQ", "stars": 5, "date": "2012-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Juwq0g0SzZGmGMf1ft-czw", "review_id": "iOyX5dsGjwa2zXe5eZlfOw", "text": "We were here on vacation and my daughter needed to train for a swim meet. It was only a 5.00 charge for her to get a day pass to use the pool. Everything was clean and new. The staff was very professional and friendly.", "business_id": "1Vm9rLnRDxJqdJDaqubIbw", "stars": 5, "date": "2013-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "sfrumTeq5CyNSOCF3o7UCg", "review_id": "4FbkvYa48nDWK8OK9VLXyw", "text": "My dad was here for 2 weeks for physical and occupational therapy and so I was there pretty frequently to keep him company.  I'd say 95% of the staff I encountered were great, super friendly and accomodating and would joke around with my dad.  But then other times you'd experience someone who just didn't seem to want to do there job, if you'd press the call button it could take over 10 minutes for someone to show up.  Other patients could be loud, yelling in the hallways and nobody would put a stop to it.\n\nOverall its a decent facility, and I'd hate to see what some of the less nice places in town are like.  But honestly, its nice to not have to go there everyday anymore.", "business_id": "HvQLLIaGh3qqXsuf8O7k2A", "stars": 3, "date": "2011-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uxBsKcDGOTwHvHOJ_EQ2eQ", "review_id": "KhuGGuNy4DPVnYSrLOWELw", "text": "I am so done with Christie Clinic. I will never go here again!! Long story short- expect a big bill in the mail sometimes even several months after your visit. They don't know how to bill correctly!\n\nI have only been to Christie Clinic a few times, but I seem to have a billing issue every time I go. My first appointment was supposed to be an preventative physical which they billed as a medical office visit. There is a big difference between the two considering my insurance pays 100% for a preventative physical. I have tried to call to resolve this problem, and all they told me is  \"you probably said something during the visit that made it an office visit instead of a physical.\" Something I said? Really? Even the labs that the doctor ordered for me were labeled as \"preventative screening.\" Even when the doctor entered the room, he said \"You're here for an annual physical right?\" Yet, apparently I \"must have said the wrong thing\" during that visit. \n\nAnother issue I had is for another annual exam. Which was also supposed to be paid 100% with no co-pay. Of course they made me pay a co-pay up front (At least they later admitted they were wrong this time and credited my account). They actually got it right when billing me for a preventative visit, but they billed the reading of the labs on a separate day. They labeled this \"reading\" of the labs as an actual visit making it looked as if I made two visits in one week so my insurance did not want to pay for this second \"visit.\" If the lab readings were billed together with the visit, I would not have had a bill. \n\nAdditionally, I had some lab work that came back abnormal. I did not get a phone call, a letter, or any type of response from the clinic, letting me know of my abnormal results. Not only did I not know of a problem in the first place, but they decided to do further testing without even notifying me first! They did further testing without my consent. The only way I found out about this further testing and initial abnormal result is from the bill I received NINE months later. When trying to discuss the bill, they told me that the bill was final and there was nothing that they could do.\n\nMaybe it's my fault for going back another time where they they gave me a 1mL injection instead of a 0.1mL injection! Accidents happen, but with everything else going on it was like you've got to be kidding me.Thankfully, there were no adverse effects..\n\nI've also known from personal experience and from talking with others that Christie Clinic incorrectly uses diagnosis codes. Christie Clinic uses diagnosis codes for what they are trying to rule out. For example, when trying to rule out multiple sclerosis, they actually DIAGNOSE you with multiple sclerosis even when it has not been confirmed by testing. Make sure you ask for a summary of your office visit and double check what they have written on there! Better yet, just find a different healthcare facility to go to!", "business_id": "bi5WD-l4DCkCEuYKOYrYtQ", "stars": 1, "date": "2014-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bNEuB6J_KjsTvWopkSIwtg", "review_id": "eEZJWC-cI1WPaFspH9jmsw", "text": "We saw another doctor in the same practice for years, and after our final bad experience (there were many), we went to see Dr. Plotnik. I wish we would have made the change much, much sooner. \n\nDr. Plotnik is fantastic with kids and generous with his time. He is more than willing to answer ALL of your questions, and thoroughly explains the different options you have available. Dr. Plotnik is a MUST-SEE for kids with eye issues!", "business_id": "h3tDZ2TBw7w_W9bA2cR2DQ", "stars": 5, "date": "2011-10-28", "type": "review"}
{"votes": {"funny": 4, "useful": 0, "cool": 1}, "user_id": "C6IOtaaYdLIT5fWd7ZYIuA", "review_id": "p3XUHoAiFiaX1iulQirfJg", "text": "I had to go here as a kid. I was busted shoplifting and sent here for a day. It was crazy, I met a guy from my highschool there and we are best-o-friends still. (15yrs later) We were the only ones there that were not drunk, loaded, or in trouble for beating someone up til near death.", "business_id": "M-4pyUDq6jWwDvvoQTIS-A", "stars": 1, "date": "2008-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "bZFRqP7s0Vszxeu8_IwYow", "review_id": "aTFX_dRsCWGhb6Bn_4JmpA", "text": "I guess you could say I have been here 1.5 times.  This is the closest walk in clinic to my work place so I have ventured here out of convenience.  The first time was last summer and I just felt ill all over.  After a total of 3 hours here they did not know what was wrong with me but were going to treat me like I had strep throat. Three hours is not too long to wait if the lobby had been full but there were only about 3 others waiting with me and what seemed like an army of employees.  I was in the actual exam room for what seemed like 2.5 hours.  They were \"kind\" enough to give me a blanket which looked like someone had vomited all over it and then it dried to a crusty finish.  The nurses kept coming in and checking on me; taking blood pressure  and temperature and demanded I take a pregnancy test.  I told them it was highly unlikely I was preggers (since I was not getting any but I felt they did not need to know all my extra cirricular activities or lack there of so I obliged them).  Finally they wrote me a prescription and I was on my way.   They never gave me the results of my pregnancy test but I was able to figure it out! \n\nSo, feeling ill and desperate I decided to give it one more chance yesterday but found myself disgusted as soon as I walked in.  There was a sign that read:  Due to technical difficulties we can not accept credit or debit cards.  Only cash or checks.  Well, I forgot my check book (since it's not 1987)  and don't carry cash so I asked the receptionist if I could put my name down and then run to the ATM about 2 blocks away.  She was at a loss for words but then basically told me no.  There were 8 people ahead of me!  I doubt they would get to the other 8 in the ten minutes it would take for me to go to the ATM.\n\nUpset and ill I remembered another clinic that I have been told is nice and I was on my way.", "business_id": "uuv2IsWkbW7zdyYfWbU_Mw", "stars": 1, "date": "2008-09-04", "type": "review"}
{"votes": {"funny": 3, "useful": 6, "cool": 3}, "user_id": "oHwgB76I654LzPW3tn3EDA", "review_id": "wwkstQeExeOWC5_5YcRaDA", "text": "I've never been to a worse medical facility in my life. Over two hour wait EVERY TIME. I came in to the er one specific time for severe back pain due to fractures, the \"Dr\" was a tall goofy Fuck with blonde hair, he accused me of being a liar and implying I was hunting for pill prescriptions even tho I hadn't had any meds for over a year and a half, I'm glad my wife was there so I have someone who was by my side to verify what that Fuck said. Parking is terrible the employees are fucking lazy and act like YOU'RE the problem not the system. Fuck the va.  Fuck the employees. And a huge FUCK YOU to the drs. You should be fucking embarrassed of yourselves.", "business_id": "-TIyxSc-lLmJzunje6MD9Q", "stars": 1, "date": "2014-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GaplVmOArdxbhtroR4sFuQ", "review_id": "nZeMPF1ohF6eFUVQ8XGNRQ", "text": "This group is the BEST!  \nI had a 'not so good' experience with one of the 'other eye docs here in town but have found a total different experience with Central Phoenix Eye Care - the best I've seen!\nDr. Stephanie Mastores listened, discussed my options and for the first time in my life, I can now wear contacts!\nAnd the staff, phenomenal.  In fact, I ordered two 30 packs of contacts this morning and Carol from the front desk just called me to ask if it was okay that she ordered the 90 pack for me instead - for only a $1 more.  They were looking out for MY pocketbook - love it!\nI went there because of the YELP reviews and I had to YELP myself.  They are THE eye-care center I would recommend above all.", "business_id": "gztTQsgq6FJwIoV4P4RNIw", "stars": 5, "date": "2013-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SlC5I7nHnF3y8-WL_Szeew", "review_id": "TIm5P5VMhd-MVFoa9c6wDg", "text": "They should consider changing their name to \"Rude Expressions\"I have never encountered a ruder staff. My sister and I went in to look at new frames for her and her boyfriend and they were extremely rude. We were greeted by a nice woman who told us to take a look. We then started perusing the different frames when we decided to ask for a particular brand, my sister asked if they carried Prada and another woman sitting at the desk waved her hand at us as if she was shooing us away from the counter and said we have whatever is out. I asked if she could order a particular style as we had a style number with us and she said in a very annoyed tone \"I'm busy and I'll let you know when I'm free\". Did I mention we were the only customers in the store? We were both shocked at her tone and lack of care/customer service and decided to take our business elsewhere. I wouldn't recommend this business.", "business_id": "RqZctFR39-ZFkBEFTA1GyQ", "stars": 1, "date": "2015-11-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "DU7aYXzXmenYN8_PK50IgQ", "review_id": "W99WEqq3003nJL8DrAJysg", "text": "Zoltan DOES NOT rock. Waited over an hour on 2 appointments. The first time I gave him the benefit of the doubt but the second time an hour went by and I got up and left with a knee I could not walk on.  I had to see him due to my great doctor leaving to go to Mayo which was farther for me to drive. I could have taken the drive and still saved myself the time I has to waste waiting for him. Save yourself the time and go somewhere else. I did have a great experience with their PT facility Heather was awesome, I did PT with her for my back last year.", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 1, "date": "2015-10-06", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "4M3ZRCLu3LfD39dbKl51iw", "review_id": "Ap-uqrb_Fz7wqKQpU-Ns9w", "text": "After having the President Mark Rosenberg call and apologize to me for a whole series of mishaps wholly Baret Dulaney's fault, nothing he promised came true: He said they'd fast lane me through the process;  it took months and months.   He said they'd make sure no more charges were involved: I got the bills and my insurance was re-charged for extra visits and some of the same exams.  He said they'd make sure I was satisfied; the surgeon called and cancelled for the forth time.  Four different excuses for the cancellations over a period of nine months because they couldn't get their act together. Now I wonder if you want a company that has employees who forget to schedule physicals, forget to do the insurance paperwork and a surgeon (Dr. Berdos) who cancels the appointments after you have waited months and months to get on his schedule?  Does this seem right or fair to you?", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 1, "date": "2014-11-05", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "7zDqr2I0-xpw9HF5Ha54cA", "review_id": "x_PeajkPuO6vwvenfKAlEQ", "text": "Fantastic!!! My first visit to Mountain View was for a follow up appointment after I was rear ended in a car accident, thanks to a friends recommendation. I loved how much information their website had and being able to see which doctors were accepting patients, which weren't and where their areas of specialty lie. I called and made an appointment with Dr. Bauer and was able to get an appt within a few days. She's been my primary care physician ever since.\n\nThe office is great and very orderly. The sign in receptionist is different from the one taking payments. Additionally, they check to see if you need to make any type of copay or payment and only call you up if it's required. Otherwise you can just sit and relax and wait your turn. \n\nYou don't need to wait forever to get in and be seen either. \n\nMy last visit involved a pretty thorough exam and some immunizations to which I informed the receptionist ahead of time when I called. I asked if it would be a problem to have all these done in the same visit and I was told no. I was disappointed when I got there and received a waiver to sign that stated I was only going in for a wellness check and anything else would require an extra visit. It wasn't the extra visit that bothered me as much as I wish someone would've been up front with me. This is my only complaint. However, I do understand I had some interesting circumstances.\n\nDr. Bauer and her staff are amazing. They are very conversational in a nice way rather than a creepy I'm -just-trying-to-start-a-conversation-to-avoid-being-awkward way and answer any questions you have and are very upfront about what is going on. My physical went well and my immunizations were a breeze too. After expressing my concern with a second visit, I was able to schedule an appt for only two days later. \n\nAlso to note, I didn't have to go to another level of the building to receive my blood work.", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 4, "date": "2009-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_KT63-iB6D5a3YLS1EtCDQ", "review_id": "Ia365JR5YM8WuBIiz-amnQ", "text": "I haven't had my surgery there yet, but I'm so impressed with the staff I wanted to write a review! They are very upbeat, friendly & still professional. In particular, I'd like to compliment Valerie & Robin, that's not to say everyone I interacted with wasn't wonderful, unfortunately, I just don't remember everyone's name. I called today with a realization about something I told them being incorrect & was worried it would affect my surgery, which is scheduled for next Thursday. Robin assured me it would be fine, they'd be rechecking my eyes anyway, so not to worry. \nI'll be posting an additional review after my surgery, so keep an \"eye\" out for it. ;)", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 5, "date": "2015-11-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Dd2l6spLt4xEplTCaYla9A", "review_id": "cI7vUR_6dZpOdvcjE3_xEg", "text": "We have been coming here for a short time and the staff has been understanding and really nice. The Doctor is thorough and very good at his job. My husband dreads the dentist and says they have cured him of worry. We really appreciated the detailed care plans because it is helping us budget etc. They have payment options and really work with you to get your best care on time so your teeth are in excellent condition. That is their main focus, my husband or I never felt pressured to get extraneous work done and Dr. Smith is conservative and respects your time/budget. For example, every other dentist I have been to pushes whitening treatments or cosmetic work. Not once have either treatments been mentioned. \n\nI had the best cleaning I have EVER had here. Your mouth will probably be sore for a day or so but it's worth it.", "business_id": "uJMwoQ0XGLr2Z4wxEFt-QQ", "stars": 5, "date": "2015-10-14", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "ixKX_0b7aa9I7z2H5g_Rqg", "review_id": "1kDJ552Ip81r2ogTgQ_-Mw", "text": "They charge an annual administrative fee that is not covered by insurance.  Basically, it's like a credit card annual fee.  This year 2012 it's $60.  I'm not one to pay annual fees at my bank, on credit cards, and definitely don't want to start at my doctors office :(  It's up to you though.", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 1, "date": "2012-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SPZdlHkpKfdZFuglpmj8Sw", "review_id": "SLeo6-Z96_oDzNOq7_Koxg", "text": "If you're like me, then your vanity is tied to your teeth. As a Survivor of Domestic Violence, eight years ago, I applied to the Arizona Dental Association for free dental work. I was placed on a waiting list and wasn't called for four years.  \n\nUpon contact, I was referred to Dr. House. Since a man had attempted to destroy my mouth, teeth and spirit, I desperately wanted and needed female professionals to undo the damage. It seemed like \"poetic justice.\" I had been on the run so long. It felt great to finally be able to sit in a dentist chair again.\n\nDr. House was very caring and professional.  Upon reviewing my X-rays, she let me know just how extensive and time consuming the work would need. Heeding my preferences, I was given referrals to (again female) a Dental Hygenist and Endodontist.  The pain of not going forward, was greater than the dental work.  I bravely faced the root canals, crowns, fillings, cleanings,  bridge and cap replacements. Most notably,  Dr. House replaced  my two upper front Bugs Bunny caps with smaller ones, more proportionate to my other teeth. \n\nWords cannot express how happy I was when my new and improved smile was revealed! I had to buy a new, pretty wardrobe to match. I've been blessed to have these professional women donate their services. I couldn't have afforded them otherwise.\n\nIt's been two years since my last visit, and I've been saving up for my next. All dental work is expensive.", "business_id": "XggHmNafIhsrmYQsDMFWfg", "stars": 5, "date": "2014-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "X_U-vPO8HHEUc0FPsckDXw", "review_id": "k_3pYO9QUCNFS8i7ym2RgQ", "text": "Dr. Patty and Dr. Alanna are two great chiropractors which I have been going to for a couple years now. They provide very strong and precise technique.  Afterwards, a couple suggestions are provided by the doctor to support a healthy spine.  The office has chiropractic service as well as acupuncture and therapeutic message services.  Lisa does very well with the therapeutic message but she is hard get an appointment for since I typically drop in on the fly. The upfront administrators are nice and greet you by your first name. They are also open on Saturday with Dr. Frank and he has a more traditional type of technique.", "business_id": "AGYchdte4sk69cFK36qaag", "stars": 4, "date": "2014-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sLo2w98hHfyc2VRyiQEy0w", "review_id": "f8TcJ--k60DqEssR1J06Rg", "text": "I've been seeing this dentist for more than ten years, now! Dr. Spilotro and the staff have always been professional and friendly and they usually run on time. The facility is very welcoming even to families with small children (they play cartoon network in the waiting room, lol!) I feel comfortable referring all my friends and family!", "business_id": "cVu1nk-5IHmSwYBBBbP4rQ", "stars": 5, "date": "2013-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "A85CoBQ6qSX8d1vVlvPgpw", "review_id": "suMdJ3JIPgeqYKwLuzcWrw", "text": "I've been seeing Dr. Keightley ever since my family moved here in 1990.  He is simply the best.  His office provides allergy shots in addition to their normal services and I would definitely recommend them to anyone who struggles with allergies,  They greatly improved my quality of life.  Usually if you're sick you can get in the same day or next day and Dr. Keightley is always very generous with samples.", "business_id": "ofQCymLeEmWpTQvx3YYwPg", "stars": 5, "date": "2012-09-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "fl6oI21uXoxVMwfR6lFanQ", "review_id": "FHynEvuK9lnVl61EjDi5Rg", "text": "Wah! Dr. Chad Campbell left :(\nI would drive by many primary care offices closer to me just to see him!\n\nEven though my favorite practitioner left (see above and previous review) I decided to give this place another try and opted to see another provider (after a rude scheduling with a receptionist whom I never spoke with before and didn't see her at my appointment). When I arrived I was greeted with a friendly smile and only had to wait about 10 minutes after my schedule appointment (it happens, no biggie). The MA was incredible with her bedside manner but the practitioner I saw was not. She never even shook my hand or looked up from her computer when she entered the room and had zero bedside manner or conversational skills. We only made eye contact when she was leaving the exam room. Upon her re-entering she was a completely different person looking up to me and making small talk. Turns out she read my chart and found out my profession and thus had more to say to me. Not impressed, I think I was spoiled with Dr. Campbell.\n\nLooks like I'll be requesting a copy of my medical records and going elsewhere.", "business_id": "0-KOpYSe9aQTAfM38f47HQ", "stars": 3, "date": "2014-10-09", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "2XBQgpmjMXvjlYRMnmmncg", "review_id": "ZlilvLeG4bEvCcoy2yb6MQ", "text": "Everyone at this office is absolutely wonderful! I really think Dr. Baker is the best dentist I've ever been to -- I have gone to him for several crowns & he has done a perfect job every time. The dental assistants & ladies that work at this office are all so nice, professional, and attentive.  I would absolutely recommend anyone to go here!", "business_id": "e7ExjMdmeF95SzrZ--dHcA", "stars": 5, "date": "2015-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wT1c1BC3ZVpXVTcjjkS-Vw", "review_id": "_DfKPLr8pGeIAggTNkn79w", "text": "This was my first experience with a skilled nursing facility.  The social worker at the hospital simply handed me a list of places and said she couldn't comment on any of them, so I chose based on convenient location to family members.\n\nThey are woefully understaffed.  I once waited 45 minutes for a pain pill after I pressed the call button.  On another occasion, I waited 2 hours for an extra blanket.  If you need assistance getting to the restroom or they tell you that you cannot go unsupervised, you can easily soil yourself and the bed before they get to you.  I had a doctor who showed up once.  After that it was a nurse practitioner.  The nurses on the floor didn't seem to have much knowledge about anything.  I saw a CNA very roughly move an elderly woman in her wheelchair in the hallway.  It was obvious they disliked her and when she protested, she was pretty much told to be quiet. Their handling of her was very inappropriate.\n\nBelieve it or not, the hospital food I had that preceded my stay at Life Care was better than what they served.  You could request special dietary accommodations only to be told the alternate meal was something like a meatball sandwich.  There is no sense of urgency there unless you fall.  Then they are all over you and make you feel guilty for falling.  Wouldn't recommend this place to anyone.  When I told a few of my doctors about my experience, they all guessed I was at a Life Care facility.  \n\nOnly plus is that I ended up with a private, spacious room, though temperature was never comfortable.  PT and OT were available most days, though the therapists said they couldn't give any notice about when they'd get to you.  They might show up at breakfast, in the middle of the day, or around dinner.  No rhyme or reason to the scheduling.  It wasn't until the doctor asked them specifically why I wasn't getting direct therapy to my injured foot and leg that they started to pay attention to that.  Otherwise it was mostly useless rote exercises they gave to everyone.  Disorganized and distasteful.  Glad to be out of there after 3 weeks.", "business_id": "Wpi5UiZuyeT3FRaBVeCPNQ", "stars": 2, "date": "2015-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XlIH9hDBXBmcLV2i2j_Dgw", "review_id": "ds4sgFvla7zkh6QA1YhEWw", "text": "This One Stop Nutrition is hands down then BEST location I have ever visited. Jaimee (sorry if I spelled that wrong)  and Leah (sorry again for spelling) are amazing. They both have great knowledge when it comes to nutrition and they take a genuine interest in your health. It makes a big difference when you can visit with someone who cares about you and takes an interest in your goals. Support local small business and purchase all your supplements from One Stop....Shakes from knowledgeable beautiful ladies who walk the walk and not just talk the talk, fair prices and clean supplements....what else guys???....THIS IS TRULY A ONE STOP NUTRITION EXPERIENCE. Can't be beat! Jaimee makes the BEST \"butterfinger\" shake you can imagine....It is my all time fav! Big thanks to everyone!!!\n\nBlake", "business_id": "RhRStt-mde_DyNFeC6vZUw", "stars": 5, "date": "2014-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "N6UMFLbwyCTTjXViWcgfCA", "review_id": "7Ws2G31iR8ieAPTZvowlTQ", "text": "At Brookstone Dental care you are treated like family! I had my wisdom teeth taken out and Dr. Goldring and Shawn took complete care of me. At first I was nervous getting this procedure done without being asleep, but they made me as comfortable as possible! Plus you get $100 bucks every time you refer a friend to the office! Works for me! Thank you Brookstone for all that you've done for me!", "business_id": "q02Giy2GKDmfG43XbJisQQ", "stars": 5, "date": "2014-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "6deNKKmohRzfvI-8Z2bLfw", "review_id": "dc7XisbMz68u8UADa5OTjQ", "text": "I can't say enough about Dr D and his staff at Team O. I have talked about this practice as an example of what to do right when running a business-from the front office staff all the way to Dr D, they bend over backwards to make the experience as positive as possible. I can't remember ever being told \"no we can't\". Every situation is met with a positive response. Both of my kids got lingual braces and it provided a alternative to a mouth full of metal. One of my daughters had some challenges after getting her braces off with wearing her retainers and movement of her teeth and Dr D was willing to do whatever he had to to get her teeth perfect so she was happy with the end results. The game room, treats and after-visit ice cream are nice touches as well. Great practice! Dr D deserves all the success he has in building a great practice!", "business_id": "iZwSI8fB_xa8nPAkwqhJwg", "stars": 5, "date": "2014-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uVEq0QEEUyaTY6bkzyHdeg", "review_id": "vUsGytwL4EkjJg4Vc9pObw", "text": "I just had my anual appointment and wanted to check the reviews. Just as I stated in my review last year, there are still no reviews below 5!  It's not surprising, as I can't believe someone could actually find a better office. Whenever I go in to see Dr. Sawitzke, I feel like I'm visiting a friend, and getting awesome medical care at the same time. I must add something to the review this year though...I was amazed at how well the front office staff was able to confidently and completely answer all of my questions about my insurance coverage. I've never had a medical office be able to answer all my questions without haveing to \"check and get back to me\". Thanks again Eye Priority for actually making my anual eye appointment an enjoyable experience!", "business_id": "O5Rm12cwxRvGILSAKwH0kQ", "stars": 5, "date": "2015-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ypswV1Ld2n38FX7SO12r7w", "review_id": "NixDRgd6m4A_EDlnPGWlJg", "text": "I went in to get some new glasses. The customer service was terrible, both times I went in the ladies that helped me were not friendly and seemed almost inconvenienced by me. I know it was toward the end of the day but when you're in sales a good attitude goes a long way. The first time I went in I ordered some frames (or so I thought) and scheduled an exam. The exam was during my work hours and they could not schedule anything later than 230. Ok now I have to take time off work no biggie. I went back to drop off my old prescription, the lady that helped me this time had me start the process all over, even though I had done everything with the lady sitting next to her who ordered my frames. It looks like that order never got placed. Once again I was dealing with an unhappy sales associate and it showed! apparently there was an issue with my previous doctor and the insurance, that wasn't mentioned last time. As we tried to figure it out, she had me call my doctor to get it straightened out. I'm no expert in the field I don't know what she was asking me to do, so the doctor sent over some paperwork. At this point I was frustrated and ready to walk out. Turns out the paperwork wasn't the right one and she glared at me like it was my fault. Maybe an expert should talk to the experts about what they need! I understand sales are a tough business, not every sale is going to go smooth but that's no excuse to give the customer attitude. After this experience I will gladly take my business elsewhere. I am a very patient person and it took all I had not to walk out.", "business_id": "eEv4wrcryRbKSCABicwk4Q", "stars": 1, "date": "2013-09-02", "type": "review"}
