{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "32-K7WW_gaB6OiXXIlHc4Q", "review_id": "o3ordS8HFLkVbTbrdFHfWw", "text": "Had diner there last night........short walk from our hotel. Wonderful place, people and food. Not overpriced. We will be back while in town. I had a dark chocolate sponge cake with a caramel type sauce that was incredible. Looks and feels like a very old traditional Scottish pub. Everything we had was the highest quality served by nice Scottish young people.", "business_id": "aFVO6hoFlOCN8pKsmJbWjw", "stars": 5, "date": "2015-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eDgIULJcPCjQA4VKmAIL3A", "review_id": "ljIjUnzkyaeWP8_udj7A1w", "text": "We came to this place for something to eat some Scottish good after the Edinburgh Castle and this place came up with good reviews...and it did not disappoint! \n\nMy friends and I split the haggis, the shepherds pie, and the fish and chips and I really enjoyed them all. I would have to say I think the haggis may have been my favorite, and it was my first time ever having it, but the shepherds pie was a close second. The service was great and everyone we interacted with working there were very friendly. Definitely worth a try!j", "business_id": "aFVO6hoFlOCN8pKsmJbWjw", "stars": 5, "date": "2015-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "eP5T7rIVRR3MNpdOUF0Ovg", "review_id": "CJm1Gmehx8WJtGdHZlresg", "text": "Came here on a rainy day in Edinburgh with three friends on a day trip. Very close to the Castle (down a lot of steps on a side street off Royal Mile).\n\nWelcoming, cosy atmosphere, the bistro restaurant is upstairs.\n\nI ordered the Salmon and capers (£8) to start and the Haggis, Neeps and Tatties (£10) for main. The salmon was great quality and fresh, although a little simple and unfussy (just a lemon wedge and buttered bread on the side). The haggis was lovely, well favoured with creamy mash and parsnips balanced the saltiness of the haggis well.\n\nIn all, a solid choice for a very hearty and wholesome lunch or dinner, right in the centre of Edinburgh.", "business_id": "aFVO6hoFlOCN8pKsmJbWjw", "stars": 4, "date": "2015-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "893laqA-MRXUZvURZbUOZQ", "review_id": "JPAjkAmDOr_ICj1LEmQwQA", "text": "Love The Doric! \n\nWe came upon this restaurant after a day of walking in Edinburgh. Sat upstairs in the bistro, which was full of charm. \n\nStarted of with the cullen skink soup, which was amazing.  It was so good, I ordered this soup all over Scotland but never did find one as wonderful as this.  The fish and chips with mushy peas were just perfect.  The only problem was I was full from the soup so couldn't finish the fish and chips - not a bad problem to have. \n\nMy companion had the upscale version of bangers and mash - it was very tasty, and one of her favorite meals throughout the UK. \n\nNext time we are in Edinburgh we will make the trip to The Doric - well worth it.", "business_id": "aFVO6hoFlOCN8pKsmJbWjw", "stars": 5, "date": "2015-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_Qnm0l0vFDS_TBi-F83iYQ", "review_id": "GbgD50rQVJJeDf2L82T5YA", "text": "Came in after a large group and was told to seat myself, preferably a smaller table. Didn't argue with that, but was not given menu. 10mins ago by, another couple comes in gets menus and orders. Meanwhile the party that sat ahead of me, ordered and I still sit there. \nI tell myself I'm going to leave in 5. \nI grab my purse and the waiter comes by and asks if I had a menu and I said no. Was told to dear myself. He apologizes for the rudeness and promptly takes my order and brings my beer\n\nMid meal he leaves, and rude bartender is back. \nTotal meal took 3 hours and I'm not sure what the deal was. I wanted to eat. Drink. And leave, but apparently they lack the attentiveness.", "business_id": "2LZtHTbbN5xA3PcPzFsXlQ", "stars": 2, "date": "2014-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Iy3WrSZxjGR0muMfNoEP9Q", "review_id": "zp4uMD3Ck_5RVpkT7C_phg", "text": "We really did stumble across this place just as we started searching for somewhere for lunch and oh my what a wonderful find. This is a Nicholson pub and I wasn't expecting it to be be so wonderful, for those who don't know Nicholson pubs, they are much akin to a nice Witherspoon, only this one was so much better. A lovely, comfy, cosy, clean and friendly place, with book lined walls. The staff were a delight with our waiter recommending a delicious whiskey to accompany our haggis, neeps and tatties. Now I have wanted to try haggis for ever, but I was adamant I would only eat it in Scotland for the first taste, I am so glad I held out.  The potatoes were real mash not dried, the mashed Swede was buttery and the haggis was rich, tasty to the point of beefy (I know it's not beef but that's how tasty it was)  moist and something I will remember fondly . The staff were lovely, really lovely, our waiter asked if it really was my first time ever ever to scotland and seemed determined to make sure I would want to return. I do, I have fallen in love with Edinburgh, thanks to its great food and lovely people.", "business_id": "2LZtHTbbN5xA3PcPzFsXlQ", "stars": 4, "date": "2014-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w6W6Db_cP8rTCONl0bcBZw", "review_id": "-olsyeGUsy_wfc4Rb7RKMw", "text": "We went here today looking for some authentic Scotish cuisine and I was very impressed. The location is very good for those exploring Edinburghs old town and famous royal mile. The decor was a bit old skool with some tacky pictures on the wall but when the food arrived you will no longer notice them because our meal was delicious.", "business_id": "f_adZ5jM1k9uABuleJmGpw", "stars": 3, "date": "2009-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "D-4CLv3wW0B7t4dGRgXSEA", "review_id": "S5KPGSeUV8gy-oC4xomZsg", "text": "I was in Edinburgh for a week. I went in on the first night. I came back every following night. ~3 bands _each_ night. Decent beer selection, including cask ales, cheap but very good whisky.\n\nMost bands were very good, the other ones weren't bad either. \n\nIf you have only few nights to spend in Edinburgh, don't miss this.", "business_id": "XeX67II3LlNJ49-sg4gDig", "stars": 4, "date": "2011-10-18", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "LfnB4N7SVSAIPOM3If_kDA", "review_id": "TzUUpui1WskoFgKvKMn2ow", "text": "Popped in one afternoon as I hadnt been in this pub for 7 years or so and fancied a quick pint, and to revisit the place too. I have not left a pint in years because it was so bad till I came here. Complained to the bar staff they didnt care. I noticed that the alcoves that I used to love have had some weird seating added to them rather than than the big tables that were once there. The seating was really odd and uncomfortable. I would avoid unless your mates bad or similair is performing here. \n\nReally disappointed such good memories of the firendly staff, good pints and drunken evenings.", "business_id": "XeX67II3LlNJ49-sg4gDig", "stars": 1, "date": "2013-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "RvyBcMVefE8BADMo0Dl48Q", "review_id": "Qy2yvH9YNm4E3dpCpFrqoQ", "text": "We summed it up: \"Whigham's is much as we'd remembered it: very hit and miss. My mussels were outstanding, but most of the rest of the stuff was pretty uninspiring. Certainly, if you're visiting for a glass of wine and someone mentions, \"shall we eat here?\", I'd say \"yes\", but be prepared for peaks and troughs.\"", "business_id": "QXUzUvUp8_sCDzp7f4_ToQ", "stars": 3, "date": "2011-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "hWD_PTfJUXjIYb1UJ0wNFg", "review_id": "so3RoyTiJ1MG9tU2eFIc2g", "text": "on a cold, rainy, and dark wednesday night i made my way down the stairs to Whighams for a quick glass of wine with the lovely Georgia A.  I was quite looking forward to visiting this bar as i'd never been before but always thought the place had some of sort old worldy type charm....\n\non arrival, the place was fairly empty, but to be fair it was Wednesday night at 5pm.  I shed my rain soaked coat, hat, and gloves dropped my brolly on the floor and picked up a drinks menu.  I was tempted by the offer of champange or prosecco by the glass, but felt the weather dictated better to a red wine sort of drink.  i had been wanting to get a glass of pinot noir, which i'd seen available on their drinks menu on the website, but when looking at the menu last night this was only available by the bottle.  thinking a whole bottle of pinot noir was a bit excessive for a weekyday evening i opted for a glass of malbec instead.\n\nafter getting my drink, i secured a table just under one of the big windows looking up the stairs to Charlotte Square and sat down just as my wine drinking companion arrived.  We had a lovely, although brief chat, in which i drank my malbec and enjoyed the ambience of Whighams. i also enjoyed the free nibbles we got at 6pm, very nice touch :)\n\nnow this was a perfectly lovely catch up in a nice location, but there was something missing about Whighams.  first off, i felt their prices were a wee bit on the expensive side.  I paid over £5 for a small glass of malbec and while it was nice, i can get a whole bottle of malbec for not much more from the co-op at the top of my road.  second, when i sent the bartender away so i could look at the menu, it took ages for him to notice me again when i was ready to order.  and lastly, while i enjoyed the bar and though the little alcoves very appealing for a romantic glass of wine, i didn't get a feeling of the character of this place.... it just sort of fell flat.  maybe it was the lack of patrons or maybe this wine bar just lacks a certain je ne sais quoi...  either way, while i'd be happy to go back, i don't think i'll be in a rush to do so.", "business_id": "QXUzUvUp8_sCDzp7f4_ToQ", "stars": 3, "date": "2012-10-18", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "27SJF_B8ofeD_6FdO6nvOw", "review_id": "MdKlD7OqQiSyGeldx2k9Dg", "text": "This was a return visit to Whighams, though neither of us had a clear memory of the first occasion. Not sure if that implied that we hadn't had a good time, or if it was that we'd had too good a time. \n\nThe place was pleasantly buzzing, with quite attentive service. The bread was delivered while we considered the menu, and I'm afraid it was somewhat dull and lacking in flavour. Slightly disappointing, but the fairly reasonable prices for wine were encouraging us to a more positive view. \n\nS had the fish pie, which was scrumptious, with lots of fish and accompanied by a good serving of mash and peas. Hot plates too, which is a particular obsession of mine. \n\nI had the special of Coley with a herb crust and velouté sauce. The fish was delicious, almost but not quite under-cooked and very fresh tasting. The sauce was nice enough, but I would have preferred it on the side as it diminished the crunchy texture of the crust. The veg was green beans, and I don't think they could have been better cooked (assuming that you don't like them blanched and soggy the way your mother used to make them). \n\nS finished with the cheese, and an excellent chutney. Not a huge portion, but decent enough. I had the sticky toffee pudding; lots of sauce, nice and hot, and a very creamy ice cream (if that's not a tautology). \n\nAll in all, very impressive, and certainly more than enough to justify a return visit. I suspect from the reviews so far that the quality might be a bit variable, but we'll let you know!", "business_id": "QXUzUvUp8_sCDzp7f4_ToQ", "stars": 4, "date": "2012-11-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "hFmn8La7fsb9BTabMvskFQ", "review_id": "Tx2LVlOPEOnaPb_esHQ_fw", "text": "I have only been here once, so maybe my views are a bit \"jump the gun\" but I had one of my best nights out in Edinburgh here a couple of months back and I whilst I want to give it a 5 star, the sensible (ex) scientist in me wants to see if the results of previous study can be reliably replicated.\n\nExperiment 1: Arrived in Whighams wine cellar after consuming a nice bottle of wine with my lovely wife and an old friend whom I hadn't seen for 7 years in another establishment one Sunday evening. The sounds of live jazz enticed us in and once we were in we were not going anywhere as the music was great, we found a bottle of tasty Lebanese wine (Chateau Mussar) and we were in our element sitting at the front, wine in hand, fine music (for which there was no cover charge by the way) and we even ended up chatting to some friendly customers.\n\nThe prices weren't cheap, yes you could get the same wines in a good wine shop at a cheaper price, but it's not very often I get live jazz in my living room for free so I don't mind paying a bit more for the entertainment.\n\nThe bar itself was OK, not too much to shout home about and I can see why a mid-week empty bar might not have the same feel as a packed Sunday full of jazz hungry wine filled people. \n\nI've been meaning to go back but haven't made it yet, will do it soon but it has to be on a Sunday for the great music.", "business_id": "QXUzUvUp8_sCDzp7f4_ToQ", "stars": 4, "date": "2012-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jLFaBKkrzh3MQcMqSooeCA", "review_id": "_axTojv5dIYAOmUK9bYjmQ", "text": "This place was hopping. I really enjoyed it but my husband was less impressed.", "business_id": "QXUzUvUp8_sCDzp7f4_ToQ", "stars": 4, "date": "2014-11-11", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "S1iRVoGzSws90OQnjDmNeg", "review_id": "t4lIV10zy5kWGJfO3McihA", "text": "I call in here as little as possible. The bar staff are tone faced. Its a working mans pub. Regulars dour faced. No sky TV, no atmosphere, no food. The only redemption I can think of is,there are two exit doors. Not for me I'm afraid.", "business_id": "NXsVHhf1WBhjNPCVlT4dEw", "stars": 2, "date": "2013-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "9h54-TfZ53Ag7d9duGrGtA", "review_id": "E6hVK8sWfAXLp2hphWylTA", "text": "This isn't a big, impressive palace but there's so much poignant and heartfelt Scottish history. Definitely worth a visit. Has way less tourists than the flashier Edinburgh castle", "business_id": "F1-S8DkAsFIyrkfTl9MmlA", "stars": 4, "date": "2011-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "MrS9e1zMPDcyMi5gBs-WQQ", "review_id": "A3CWh_f-jhLdw4aqE_ie3g", "text": "Circular stairs - ugh! Gallery - really pretty. Dining room - ok (have you seen Hearst Castle in California?) Mary, Queen of Scots area - historically nice.", "business_id": "F1-S8DkAsFIyrkfTl9MmlA", "stars": 3, "date": "2012-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IkDnVdIo3akeYLfTrIJK7g", "review_id": "-Xh4i1Bo5TJ6nTIAolfHhw", "text": "A pretty slick palace at the lower end of the royal mile in Edinburgh. The audio guide is a huge plus for those not steeped in their Scottish history, as context is everything when it comes to historical sites. The two standouts for me that moved this above your standard castle/palace tour were the abbey and gardens. The ruins of the abbey were fantastic, as they are true long-unused ruins but not so degraded by time that you lose the sense of what the place was when it was in use. The unknown graves in the floor of the church never get old for me.\n\nThe beautiful trek through the gardens at the end of the tour makes for a fantastic end to the visit. Walking through the paths with no-one but my friends and some ridiculously well-fed squirrels made for a peaceful, fulfilling end of the day. Or so I thought. Then we decided to climb Arthur's seat. Because we are idiots.\n\n(It's actually quite convenient to begin your hike up the mountain from Holyrood House; took my out-of-shape self about 45 minutes to get up there, but totally worth it.)", "business_id": "F1-S8DkAsFIyrkfTl9MmlA", "stars": 5, "date": "2013-10-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "nEOzWdlvdrQ7aEqowmrvXw", "review_id": "DdWpUmHx6ELDyS8S4WxtKw", "text": "You definitely need the audio guide.\n\nNo pictures... well you can take pictures outside, but nothing within. After walking the length of the Royal Mile, we wanted to take a gander at the fancy working palace. There was a long line up at the ticket office, but there is another one inside the gift shop that was shorter. One of the ladies decked out in tartan mentioned it while we were waiting in the longer line.\n\nOnce you pass the gates, grab an audio guide... my husband didn't really listen to his, but without it, you're just staring at a bunch of stuff in someone's house. Lots to hear, lots to see... I didn't know that royals entertained in their bedrooms and didn't actually sleep there. Also, got to learn a lot about Mary, Queen of Scots...\n\nWe were a little jet-laggy, so we thought one of our friend's fell asleep on a chair while we explored the castle. Found him outside in the abbey where photos are allowed. Walked the gardens a bit, but did not do the tour. My hubby instead saw Arthur's Seat and decided he wanted to hike up it. I thought a scone at the cafe was a better idea.", "business_id": "F1-S8DkAsFIyrkfTl9MmlA", "stars": 3, "date": "2013-10-24", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "JySNI9tIhmFFtUorc4zkwg", "review_id": "kSolV7qMeNiV1fi62ENqrw", "text": "Ah to be surrounded by creepy mannequins...\n\nI popped into this place after hopping into Oink for lunch. Because what goes better with pulled pork then a wee bit of history? (answer: a lot of things.)\n\nThis is no doubt and interesting little museum. It's free to enter and you're welcome to take pictures (obviously), so long as you clear it with the front desk before entering. It's a three story snapshot of how Edinburgh locals lived in the olden days... and the 80's.\n...\n\nThe first floor is a veritable horror shop of Edinburgh during the plague, and definitely take the time to read the information in this little dungeon. It's horrific but incredibly intriguing - an interesting snippet of a tumultuous past.\n\nThe second and third floors are much of the same - depicting the living conditions and activities of Scottish folk throughout the ages. It is exceptionally interesting stuff. But... (you knew it was coming)...\n\nWhat is a really unique story, gets sort of overshadowed by the abundance of SUPER creepy mannequins. Maybe i've just watched one too many sci-fi flicks, but mannequins give me the hebegebees and the lot that's plunk into this place is a cut above the rest. I would have much preferred to wander about and take in the history of Edinburgh, without having to teeter around plague victims and taxidermy cats. \n\nAnd the 80's mannequins were just downright strange...\n\nSo it's worth a stop in. It won't take you too long to pop through and if you're made of stronger stuff than myself, i'm sure the plastic people won't be quite so much of a deterrent. \n\nBut do yourself a favour and actually READ the information... or else you're just walking through a room of creepy fake people and that's wholly a waste of time.", "business_id": "wjytooLlvPSyo8kvJ8UfQg", "stars": 3, "date": "2014-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GOzGbiMYFIE7pydKxs9SLA", "review_id": "gktNVjSY0kDuc19JX3Wu_w", "text": "Free entry museum housed in the old canongate tollbooth on the royal mile. Very interesting. My dad was born and raised in canongate so it was particularly interesting to me.", "business_id": "wjytooLlvPSyo8kvJ8UfQg", "stars": 3, "date": "2015-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Jmvr5ojXpOVrDxuU-Sx-3g", "review_id": "e4U4S7M-zxRLsYQo2-lG6Q", "text": "We stayed here for two nights and really didn't have any complaints.\n\nPROS:\n\n+ Good location for site-seeing.  Super close to the castle and Old Town.  Lots of restaurants and (tourist-trap) shops nearby.\n+ Close to a Sainsbury Local (hurray for grocery stores!).\n+ Very clean, sleek, and modern.\n+ Front desk was very friendly and helpful.\n+ Breakfast was available for purchase.  Food was decent, but there are enough good, local breakfast places within a short walk that I would suggest venturing out.  Still, it was fine for the first morning there.\n+ The adjoining bar was friendly and had a decent selection.\n\nCONS:\n\n- You have to pay for WiFi in the rooms.  Free in the lobby, restaurant, and bar, but I would like to be able to catch up on the news in my jammies.\n- The tub.  I'm not sure if they have handicap accessible rooms available, but if you have trouble lifting your legs very high, you might inquire about an accessible room.  I've never seen a tub up so high.  I thought about calling the front desk and asking for a step ladder (kidding, but seriously, it's up there).\n- No thermostat in the room.  Windows don't open.  You're at the mercy of whatever temperature the hotel sets.  It was never super uncomfortable, but it would have been nice to be able to adjust the temp.\n\nOverall, we had a very nice, comfortable stay.  I would stay here again and would recommend it.", "business_id": "u8AHL_4-zkivi7NDv_oApg", "stars": 4, "date": "2012-11-29", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 2}, "user_id": "uq9tCNnMJxM4QNrbUC2tfQ", "review_id": "J1xxUi7oTpN3nAV_Ridn_w", "text": "My Dad is nothing short of obsessed with France, and for years whenever he has visited he has wanted to go to Petit Paris. However, foolishly, I did the shallow 'judging a restaurant by its table cloths' thing and always took him somewhere else.\n\nLast night, I finally went here with Joe A, and oh how wrong to judge was I! I wanted to try all the starters, in particular the snails. On this occasion I wasn't very hungry so I just had a main, but I did try some of Joe's black pudding starter and it was delicious! \n\nFor my main I had the veggie option, a goats cheese, red pepper, courgette and tomato pie. It was served in the dish it was cooked in and was really tasty. I also tried a bit of Joe's lamb stew and that was incredibly tender and tasty too.\n\nThe staff are all French which is nice, although the language carrier was a slight issue when asking for Jack Daniels, but of course you should just drink wine in a French restaurant anyway :) The décor inside is actually pretty cool, a relaxed atmosphere with old tin adverts on the walls.\n\nSo, next time my Dad visits I will absolutely swallow my pride, tell him he was right and I was wrong, and take him here! Oh and I will make sure I'm hungry so I can have the snails!!!", "business_id": "L5cQjBQu6qnV_grmvk-drg", "stars": 4, "date": "2012-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "exPZPOmVupBbPHV0cuBhBg", "review_id": "xXGpOVxcV1rEPo_oyXpjjA", "text": "True French restaurant. The mussels were amazing!! Had the best mackerel I've ever had. Tasted the French onion soup; flavor was so rich. Service throughout the meal was top notch. Even the dessert was the bomb.", "business_id": "L5cQjBQu6qnV_grmvk-drg", "stars": 5, "date": "2014-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pcuBMz20qCSj8SIkZwkOZg", "review_id": "tyVbDN6exRlRL7XL-ki-4A", "text": "My wife and I really enjoyed this restaurant. The food was excellent: well prepared, perfectly seasoned, tasty, and served professionally. So far the best meal of 8 in Edinburgh.", "business_id": "L5cQjBQu6qnV_grmvk-drg", "stars": 4, "date": "2015-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "YlpzPPySUxJsUJHRyRde8A", "review_id": "FeIHXp6Usrqawf-haOE6mw", "text": "Vincents is the sort of place that makes me go weak at the knees. It's tucked away, it's small, it's cosy, it serves alcohol. After a particularly depressing day at work, I was treated to an impromptu gathering of lovely people at St. Vincent, and immediately felt better. So that's another to add to the list - healing properties for the soul. I'd dread to think what it was like on a busy night, but on this particular Friday evening, it was just perfect.", "business_id": "tAoUsufHhcTRZEBTwmC68g", "stars": 4, "date": "2013-10-28", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "sJPCl0wny7omc3d9gjsPTQ", "review_id": "yKXNhVhy-fO6Wk3g3aSyQg", "text": "As a happy carnivore with a sweet tooth this place hit all the right spots. \n\nThe atmosphere was comfortably casual with staff that was courteous and attentive. They never tried to \"upsell\" any other courses or items, they only pointed out the daily specials. \n\nThe burger is hands down the best I've had on my holiday in Edinburgh. The seasonings brought out the flavor of the meat and the local cheddar provided a wonderful accent. And then I had dessert... a classic sundae stacked high with pudding, toffee sauce, ice cream, and a dash of whipped cream with wafers. \n\nMy only regret is not finding Smoke Stack sooner!", "business_id": "QopG-46G0EIeePT8q-4JtQ", "stars": 5, "date": "2012-10-01", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "hWD_PTfJUXjIYb1UJ0wNFg", "review_id": "gEMM4cTuhC7MWos5ucjuYA", "text": "a rainy sunday afternoon (which ironically reflected the mood i was in) i found myself wandering down broughton street to the smoke stack for a lunch meeting...or a lunch date, i'm not really sure what it would be called.  either way i was here for lunch.\n\non arrival at 1pm the restaurant was totally empty save me and the guy who told me to pick any table and brought over some menus.  i was a bit concerned about this as an empty restaurant usually means the food isn't that great.... i started wondering if maybe i should text my lunch date to let him know this and ask if we should move to treacle.  however, i stayed put and when my lunch date arrived we took our time deciding on what to have.\n\ni believe that the smoke stack has a specific weekend menu that has an offering of brunch all day.  while i was initially tempted by this, i was also tempted by the burger or steak sandwich.  too many choices and being indecivise made us send the waitress away with just a drinks order, mmmm ginger beer!, while we thought a bit more.\n\ni ended up with the steak sandwich and my date the chicken club.  we had a wee wait for the food after our order which was reassuring that it was being made fresh.  and when the plates did come out neither of us were disappointed.  my steak sandwich was literally a steak on ciabatta!!  a whole steak!!!!  usually this sandwich is some thin slices of steak served with lots of fried onions to mask the fact that there isn't that much steak.  \n\nafter a quick assembly of the two halves and making sure all the fried onions were secure in the ciabatta i took a bite and yum!!  the steak was tender and the onions nicely caramelised with a hint of mustard mayo on a nicely toasted roll.  it was supremely tasty!  maybe not the best i've ever had, but definitely very good.  my chips were fresh and crispy and i ate them all after taking on the majority of my sandwich.  my date's empty plate clearly reflected that he'd enjoyed his chicken club as well.\n\nwhile we were waiting for our food and eating the restaurant began to slowly fill up, so maybe this is just a later lunch spot and i was an early bird turning up at 1pm.  the service as well was very good, although they seemed a bit cautious of our table as i was visibly upset and i don't think they wanted to interrupt.  i really need to stop being the girl that cries in public places... but well done for their professional service during my upset and not making it obvious to other diners what was going on!\n\nso this place gets 4 stars as i would like to go again (maybe in a few months when they forget about my most recent tearful visit!) and try some other options on their menu.", "business_id": "QopG-46G0EIeePT8q-4JtQ", "stars": 4, "date": "2012-10-15", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "Xk8WOG4_2sayloIV7A7Y8g", "review_id": "0Qu8lHD0WD2FWpqs1ZiKBw", "text": "Had brunch here the other day...Average is an understatement...Yikes!  Wasn't our 1st choice, given that Broughton St has SO many options (however, on a Sunday it always pays to book!)! \n\nThe place was empty... should have been 1st warning.  The waitress was pretty glum... 2nd.  My friend's bacon roll had to be sent back because the bun was charred... 3rd.  Shall I go on?  In all honesty, I don't really feel like wasting much more time on this review.  Won't bother going back, and normally I give a place at least a few goes.... not this time.\n\n(And no, this review is nothing to do with side of bed I got up on!) ;-)", "business_id": "QopG-46G0EIeePT8q-4JtQ", "stars": 1, "date": "2012-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M2pXDnR9uiBT55F40N6SDQ", "review_id": "MzF7ychYeCLGiJLL4qJj2g", "text": "I can only agreewith a previous reviewer. Stay away from the ribs, i gave them a chance because \"how bad can they be (when you are european)\", well i will not have them again!!! but the steaks and burgers are still worth a visit and i keep going back", "business_id": "QopG-46G0EIeePT8q-4JtQ", "stars": 4, "date": "2014-11-06", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "g20VZMOKH3fLhApiuJYnvg", "review_id": "m06N2aeLkY-3bjKn7ISpGQ", "text": "Came here for lunch on Sunday and I was fairly impressed! First thing you think about with a name like smoke stack is steaks and an almost southern USA BBQ style food. Check with the steaks, not so much in the way of BBQ smokiness! I would have loved to have gone for one of their steaks but I felt for a Sunday casual lunch they were a bit over priced (in fact over priced any time of the day or week!). I decided to go for their rump steak salad with a soy and ginger dressing ordered medium-rare. The presentation was top notch and the steak was cooked to perfection! I really enjoyed the quality of the meat and the salad but I felt that there was far too much dressing which kind of over powered it and left everything drenched. It was definitely tasty but if I was ordering again I would ask them to go easy on the dressing. There is also a great selection of drinks, smooties and milkshakes. I went for the green machine smoothie which contained broccoli, spinach, celery and apple which I thoroughly enjoyed!", "business_id": "QopG-46G0EIeePT8q-4JtQ", "stars": 3, "date": "2015-10-13", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "0LCXUv3m25Bumj_XYilqRg", "review_id": "ushK6sw37EnPgz5ITae56Q", "text": "Veggie haggis?!?!?!  But oh so glad that I dared, it was really, really good!\n\nThis cafe is situated right off of Princes Street, complete with stone face exterior and is cozy inside.  Granted, the cups of coffee are tiny, but the breakfast special can't be beat.  \n\nI visited a couple of years ago, and the breakfast was priced well for a full Scottish breakfast, with choice of standard haggis, or veggie haggis.   The veggie version was fantabulous!  Spices of bergamont and lavender permeated through this soy based scoop of tastiness, I would love to go back to Edinburgh (again, I do love this city), and stop by here again for breakfast.  Tasty, tasty!", "business_id": "8RXIwWR34JunHKd00UU4wA", "stars": 4, "date": "2009-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2dVq0xat2wnpJ6r6wnfdhA", "review_id": "ZIJW1dBkS9pg8ynvlCJngQ", "text": "My lunch was exactly what my encroaching cold craved. Thank you so much for the delicious big bowl of parsnip soup and the brie pannini on bread that was fresh rustic perfection!", "business_id": "8RXIwWR34JunHKd00UU4wA", "stars": 5, "date": "2013-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "z3EAlt7qR9HXKK4dB5xheA", "review_id": "oJILrmiNZ076875k50ilnA", "text": "早餐時間非常忙碌，可見有多熱門，提供全蘇格蘭式早餐，跟全英式早餐相比多了一份哈吉斯。哈吉斯是蘇格蘭特色，羊雜碎肉末一樣的東西，不過味道出乎意料的好！早餐包括半個煎蛋，一片烤吐司，兩個煎香腸，豆子，四分之一個煎餅，兩篇培根，份量比較足，早餐有胃口的話，女生一個人吃剛好。另外結帳時出示學生證的話還可以享受八五折喔，強烈推薦。", "business_id": "8RXIwWR34JunHKd00UU4wA", "stars": 4, "date": "2014-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "QmvyhGsdPIPRSI_rwwl7IQ", "review_id": "GpWM4lFWd9C1j1ZXYZMi5g", "text": "Southern Cross is situated just around the corner from the Royal Mile, nestled in between numerous cute cafes and gift shops.\n\nOne quick peek of the menu from outside was all it took to lure me in. I was only after a light bite so when Chicken & Cheddar Quesadillas with Fresh Salad jumped out at me, it was a done deal. \n\nI opted for a seat in the back room, which was dimly lit, with colourful, quirky art on the walls and Vampire Weekend playing on the music system. \n\nIt took a few minutes for someone to come over and ask what I wanted to order but when they did, they were smiley and polite so I forgave them instantly. \n\nThe food wasn't anything amazing but then I wasn't really expecting Michelin Star cuisine from a small cafe. It could have been a little more flavoursome though. A few herbs / spices would have helped but it's not the end of the world. \n\nI washed it down with a glass of Fentiman's Ginger Beer then settled the bill - £7.90, which I suppose isn't too bad. \n\nNext time I'm in Edinburgh (there WILL be a next time), I don't think I'll go here again as there are sooooo many other cute cafes to choose from, but it certainly did its job in ensuring I had a good feed and watering ahead of my long and tedious journey back to Manc Land.", "business_id": "8RXIwWR34JunHKd00UU4wA", "stars": 3, "date": "2014-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "iMvcqVOQhuYWFEnvcswNZQ", "review_id": "Pa_0e3YPmoqVuWF2q08UIQ", "text": "Popped in here for a late lunch while in Edinburgh for a day out. We didn't plan to come in here but decided that the exterior looked really quirky so decided to try! \n\nAs you enter it looks like your usual coffee shop - some seating areas and a large blackboard over the till area with your menu and drinks - so there I was waiting to order at the till as you do. But turns out it's an actual restaurant which was a surprise to us as we were looking for something quick. But we decided to just stay as we were just starving! \n\nWe were taken to the upstairs level of the restaurant, which was nice as a lot of the decor and flooring was wooden so it felt a bit like you were in a tree house.. \n\nThe staff and food was lovely, however it is probably on the pricey side considering it was a sort of coffee shop with a restaurant priced menu. \n\nOverall was a good experience, will recommend :)", "business_id": "8RXIwWR34JunHKd00UU4wA", "stars": 4, "date": "2014-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xy3xmz1xh9wNiEGYvDixvA", "review_id": "ZIDIwRIvkG2uyJBQ1FXc2Q", "text": "Sehr guter Kaffe.", "business_id": "8RXIwWR34JunHKd00UU4wA", "stars": 4, "date": "2014-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "98YefJu1Km3aWJ4YUfxWaw", "review_id": "LIJhTD76ygPmAdbgekDY9w", "text": "Great place for an afternoon snack. I had a hot chocolate and a caramel shortbread which was amazing! They have outside tables so you can enjoy your hot drink and still watch people passing by. It's a great way to catch your breath and rest a little in between the ups and downs of Edinburgh! For the great location, the prices are okay.", "business_id": "8RXIwWR34JunHKd00UU4wA", "stars": 4, "date": "2015-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RevAcIDEm8bUD3lRknJ_sQ", "review_id": "bk_AhsqOB_98z6NdQvdvmg", "text": "Adorable old school cinema complete with velvet curtains!  We used to come here for the Sunday double features all of the time.  My favorite was the Breakfast Club and Donnie Darko double feature, it seems like a strange pairing but it really worked.  The cinema had some newer movies but also classics and great independent films.  I wish I had a cinema like that near me now.", "business_id": "vW_krCghxf4GYPRfkgZ06A", "stars": 5, "date": "2009-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3Q1OwE2FlVs4NPgzIlRbkA", "review_id": "IFi0q-WnETHm3DAb3lUWzw", "text": "I'm sorry. I really want to support independent cinemas and places that show things other than hollywood blockbusters but... \n£6 to see a film in what can only be described as a sauna (cinema 3), on a screen not much bigger than a pub TV....\nLast time I went the toilet smell could be smelt in Cinema 1.\nThere seems to be a sort of.  'hey its the cameo, what do you expect?' \nplease sort it out!", "business_id": "vW_krCghxf4GYPRfkgZ06A", "stars": 2, "date": "2011-09-02", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "JQnuYazKd3ifuCWC-3mzlA", "review_id": "SbnHNUEFlAJFgkxW7PgF7g", "text": "By far my favourite cinema! Where the Cineworld's and Odeon's of this world may be a mecca for big blockbuster movies, this is the ideal place to visit for those more obscure movie going experiences.\n\nThey offer a regular Sunday double-bill (free for membership holders), as-well-as special screenings for senior citizens, parents and even a regular autism-friendly screening, which is something I've never seen offered at any other cinema.  They also play host to live Met. Opera and Ballet for the culturally inclined, and if you keep an eye out on the web site, there's even an All Night Horror experience that I highly recommend for anyone who loves a bit of 'Flesh for Frankenstein' or 'Evil Dead;...they even go out of their way to find movies on 35mm print for a more authentic experience.\n\nMy first trip to the Cameo was for a special showing of 'The Rocky Horror Picture Show'; everyone got dressed up and brought toast to throw at the screen; they wouldn't appreciate this kind of thing in many of the larger chain cinema's!\n\nThere are a lot of complaints from other reviewer's about the smell and the facilities on offer; it's worth noting that they are currently in the middle of an extensive refurbishment, and there has been a great deal of improvement in recent months.  The ladies toilets have been rebuilt and modernised, and I understand the gents aren't too shabby either.  Any lingering smell in screen one is dissipating and not so noticeable any more, so you can eat your popcorn without worrying about your personal safety!", "business_id": "vW_krCghxf4GYPRfkgZ06A", "stars": 5, "date": "2011-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "9_ACsBy6NmWRtbvuw-mLmw", "review_id": "Sw5hInHSADbtg2O1KarWmQ", "text": "I love this place. The hubs and I first came here last month and saw Cameron Crowe's documentary on Pearl Jam  \"Twenty\". The movie was amazing. The theater was packed but there really isn't a bad seat in the house so it wasn't a problem. And there we sat, enjoying great film and music with our beer and wine. Yes, I come from America where you cannot bring beer or wine or, frankly, anything that you did not fork over an arm and a leg for at the concession stand. So when we got here and you could buy beer, wine, etc. at the bar, we were all in! \n\nWe went back this past weekend and saw Midnight in Paris. We also ended up signing up for their membership which is super affordable (only a few pounds more than it is for all the free tickets you get with it) and you get discounts on everything and free double movies on Sundays. Totally worth it if you ask me. \n\nAnd yes, Midnight in Paris had been out in cinemas for several months but, if you're not in a rush (which we weren't) and want to pay cheaper ticket prices (yay!) then go here! The character of the building, lobby, and theatres have a lot of beautiful character and the bar is a nice place to hang out before/after the movie. \n\nAlso, the seats are super comfy!", "business_id": "vW_krCghxf4GYPRfkgZ06A", "stars": 5, "date": "2011-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "WU45Uu7mh4e52awqYSN-vA", "review_id": "k2xfDMnf1aADF0kajPVi0w", "text": "I am passionate about films and whenever I fancy a jaunt to the cinema, I'll always check the Cameo first. It strikes a perfect balance between current releases, independent and classic movies.\n\nIt's not the overpriced, clinical, sterile cinema you'd expect from a Vue, Odeon, Cineworld ect. and is all the better for it. It has a reassuring, classical, well preserved art-deco interior. \n\nAs soon as you set eyes on the cafe area and it's cinephilic decor, you know you are somewhere that has an appreciation for film. \n\nWhich also extends to the friendly staff who also seem knowledgable and genuinely interested in talking about movies the cinema is screening.\n\nEven if you aren't going to see a movie, the bar is a relaxing space to be. They have a good range of beers and wines (which, more importantly, you can also take into the cinema with you) and good coffee.\n\nThe bar menu also offers a good selection of freshly prepared food including delicious soups from Union of Genius and their own bread.\n\nEvenings also often consist of themed TV/movie marathons, film quizzes, music bios and one-off screenings.\n\nAnd Edinburgh institution and rightly so.", "business_id": "vW_krCghxf4GYPRfkgZ06A", "stars": 5, "date": "2013-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "M4MVVzNPZHiJdnNvWjL8VQ", "review_id": "J6_yzAKqYJta8tPyRNpjPA", "text": "I've always liked the Cameo but have found myself going a lot less often in the last couple of years & so probably getting the bare minimum out of my membership.\n\nThis is mainly due to it's programming mirroring that of the local Cineworld far too closely (even before Picturhouse Cinemas cane under that chain's umbrella). As a member there too I'm not likely to pay to see something at the Cameo when I've technically already done so at the multi-plex. Competing head-to-head in the arthouse market with The Filmhouse should be more what the Cameo's about.\n\nThe place has had a re-fit of late and last night's trip to screen 2 was my first since that was completed. Having rotated the room through 45 degrees the screen is now in the southern wall with the new (in some cases double occupancy) seating arranged in 3 rows. The screen is bigger than the previous one and even sitting in the middle row it felt that it was too close. I'm also not convinced that sitting at the ends of any of the rows wouldn't leave you seeing less than the full screen. I'll be back though so time will tell.", "business_id": "vW_krCghxf4GYPRfkgZ06A", "stars": 3, "date": "2013-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "qW10n0kfwZB4Hr5U2QEwmA", "review_id": "-dodOPDmBbapOCQXThg51w", "text": "I have always thought about coming here, though it never actually happened until this summer.  \nThe cameo is small and inconspicuous from the exterior, but walk in and you're in the glamerous cinema experience of the past. My boyfriend and I didn't see the best film in the world, but the seats were comfortable and reclining, the screen room was small and cosy, and it had that independent cinema feel.\nAs a student I joined the Picture House slackers club, from now on I can get cinema tickets for £5 and a few awkwardly timed screenings for free!\nNext time I will definitely try out the cameo bar or the cute little shop at the entrance which sells retro sweets and popcorn.", "business_id": "vW_krCghxf4GYPRfkgZ06A", "stars": 4, "date": "2014-09-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "1vtX6cGPk7GM8dIWwp9PYg", "review_id": "rG3JIMbVr7_6qjMuxGgW3A", "text": "O Cameo é um cinema para aqueles que gostam de filmes não tão Hollywoodianos e blockbusters. Filmes pequenos ou independentes que não passam nas grandes salas  são bem recebidos aqui. A casa tem sempre uma programação legal e festivais vez ou outra.\n\nSe você gosta de design gráfico, recomendo passar no cinema para ver o letreiro -daqueles antigos que não se vê mais... E para pegar o folheto com a programação, que tem design lindo, de muito bom gosto! Além de ver os cartazes pendurados na entrada do cinema.", "business_id": "vW_krCghxf4GYPRfkgZ06A", "stars": 4, "date": "2014-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I9gB9ue3e0ec2pXW0DwYww", "review_id": "qHy4Up73sSxnWdDhkwepuw", "text": "Great cinema in the cultural heart of Edinburgh. They show a large variety of films, both blockbusters (I'll be seeing Spectre here) and classics/foreign films. The student membership is a great deal, with some free movies and significant discounts on all other screenings. :)\nThe bar on site is also so gorgeous, really beautiful surroundings to enjoy a drink in.", "business_id": "vW_krCghxf4GYPRfkgZ06A", "stars": 5, "date": "2015-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "gfD4mXz1mDvUpK2Lk1J1Nw", "review_id": "aR4MY1tJdIH5Qf39rPA23Q", "text": "If you only ever see live comedy at the Fringe and want to try a comedy club, look no further than this Edinburgh institution. When you don't want to pay for a big name comedian's touring show, but you don't want the open mic night at your local pub, this is where you want to go. Intimate venue with professional comedians and the occasional name you'll recognise from the tv. \n\nThey do a range of cheaper and less professional stuff during the week, but on Friday and Saturday night for £10 you get four comedians and an MC. Two hours of comedy that is always guaranteed to contain at least some top quality material, with maybe the occasional crappy bit. But the MC always holds it together with lots of piss taking of people in the front row (let this be a warning!).\n\nDoors open at 7pm and you have to be there bang on time to grab a good seat (one with a table and not too close to the stage), and the show runs 9 - 11. In the meantime you can have dinner which is pub grub but well done and reasonably priced (I recommend the nachos). Drinks are also reasonably priced, so all round it's always a reliable evening out.", "business_id": "NkyjMfpdpYBKIarzVqY6yw", "stars": 4, "date": "2011-11-23", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "nEOzWdlvdrQ7aEqowmrvXw", "review_id": "59ArZtVzildgwgFUsuhRpg", "text": "When they tell you to get there at 7pm even though the show starts at 9pm, you go. \n\nThe place gets packed... like super duper packed... I sat there almost at the front looking for the fire exits and wondering how many people I would have to shove to get to one. Our friend ran across the street from our hotel to get tickets, but instead had to call a number and buy them over the phone... even though she could hear the lady inside talking to her. They also have a Heckling Deposit: ten pounds a person in your party and you also get thrown out. I think it's more of a Good Behaviour Deposit. \n\nSince we were having dinner there, we had to eat in shifts. There were four of us to a table and they're really small. Ordering is at the bar, you tell them your table and then they bring you your food pretty fast. Our friends ordered the nachos and then some mains, so they had to have an extra tray on their laps for all the food.  I thought the food was good. I heard dismal things about the nachos and the mac and cheese, but our friends were happy with the lamb burger (words like best lamb burger ever were used) and said the burrito was okay. I had the bangers and mash. Nothing wrong with gravy, sausage and potatoes. \n\nJoanne (is that her name?) was a great host. She asked everyone in what equates to gyno row their names and where they're from. She's really funny and quick witted. I would pay to listen to her. I don't remember that much of the other comics... we saw four that night. All entertaining, but I remember the last one for sure... not his name, but he sounded like a minister from Southern USA. Pretty irreverent and that's what made him funny. \n\nWe didn't hang around after the comics were finished. We left pretty quick after that. Didn't want to lose our Good Behaviour Deposit.", "business_id": "NkyjMfpdpYBKIarzVqY6yw", "stars": 3, "date": "2013-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AKi8Zk0xvi7GB7Vf_a-Gkw", "review_id": "FaE3zmo4RumNHW_Y2MvcLw", "text": "Thoughts written hasitly in phone as I was sat in the bar...\n\n\"Busy bar, plenty of people and comfy couches, not too hard to get a seat although getting to the bar proves tricky. Smell good food, plenty of people eating up top, bit pricey but a quite good start to a night out. Would like to come back and check out the menu.\"\n\nAnd that kind of sums it up really - I'm not massively familiar with the wonderfully quaint Stockbridge side of town but after visiting this bar, would certainly like to check it out some more.\n\nThere was a good ambience at the bar and a nice mix of people too - there was some relatively inoffensive music blaring over the speakers and the table I was sat at was made up of me and a pal, a couple having a quiet drink together and three or four older ladies having a good laugh, it all felt very inclusive and I liked that.\n\nShame it was so hard to get to the bar and that the standard pints were so expensive though, then again I guess that's a consequence of the part of town that it's situated in.\n\nOh and please don't give us beer menus without prices in, thanks very much...", "business_id": "KqgeyLdYbfsd9veyR6UGtw", "stars": 3, "date": "2010-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "wx12_24dFiL1Pc0H_PygLw", "review_id": "HY_yx0Z2P3rR4K10la99sg", "text": "Friday night, 8 yelpers are looking for a post-dinner drink and find themselves at Hamilton's. It's busy, there are people everywhere: crowded around tables, draped over couches, perched on stool seats. There's even some dogs by the couches, which I did find strange for a Friday night. Waiters weave in and out of busy crowds trying to balance empty dinner dishes, as more people crowd at the bar for drinks.\n\n8 drinks were ordered. Mine a g&t, Henricks - nice. With cucumber, of course. The glass was, noticeably, a little heavy to hold whilst standing due to lack of seats. But I guess it actually means better quality. None of this disposable cup nonsense. Had I dropped it I imagine it would have shattered with quite the thud, or broken someone's toe.\n\nThe noise level wasn't too loud that we couldn't have a conversation. But as a larger group it was hard to find somewhere to comfortably sit or stand. I notice, as I write this, Joe A's 5 star review on the right. Joe and I see eye-to-eye on many things, and I trust his judgement and taste. But I simply can't agree with the 5 stars. For that my wee socks need to be blown off.\n\nYes, Stockbridge bar is busy, warm, has drinks aplenty, welcoming, seems to be a great regular bar. But that's it. There was no big winner in any regard for me. I won't comment on the busy-ness as it was a Friday night, but it seems to be very popular with the locals. It kind of reminded me of an independent All Bar One (I mean that in a good way). \n\nI wouldn't rush back but if I was in the area and wanted a wee seat it'd be good. I imagine I'd actually enjoying it more on a lazy Sunday afternoon for a spot of lunch?", "business_id": "KqgeyLdYbfsd9veyR6UGtw", "stars": 3, "date": "2011-10-28", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "OQzBfJudpl1nnmZOoBVN-w", "review_id": "vCs4eNpBmD9APnCoKzqTaA", "text": "Fantastic (if slightly 'trendy') location, brilliant food, very very good-looking staff to ogle at. I had the Chorizo salad to start, followed by the really rather wonderful crispy lamb, accompanied with a recommended red wine (I don't like red wine as a rule but my friend insisted, and the waiter's choice was spot on). It all went down very well.\n\nDid I mention how good-looking the staff were?", "business_id": "KqgeyLdYbfsd9veyR6UGtw", "stars": 4, "date": "2011-10-28", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Ij0a9He_Aq0LPjuyIGvJSw", "review_id": "YHcUm3q49n1F92P2Y90ptQ", "text": "A regular here, this is a lovely bar - great ambience, good staff and the best glass of chilled white wine you will get.  How nice to get a  nice cool glass - spritzers are good too! :)\n\nFood is also top quality!\n\nIt does get a certain type of clientele from the Stockbridge area, but, hey! I live round the corner so why complain - I suppose I am a Stockbridgian now! :)", "business_id": "KqgeyLdYbfsd9veyR6UGtw", "stars": 4, "date": "2012-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hWD_PTfJUXjIYb1UJ0wNFg", "review_id": "Rb9zCIPtXdBV7jxP9oGBJw", "text": "Oh Stockbridge such a chic and trendy wee bit of Edinburgh.  The village like feel of this neighborhood just oozes charm and it has long been one of my favourite spots in this city.  Saturday night found me paying this charming location a visit while on a first date in Hamilton's, a bar which is the epitome of what Stockbridge is all about.\n\nHamilton's is chic without trying hard.  The interior is all dark colours and leather chairs with sofas and a raised restaurant bit with walls covered by comic book type pictures.  Being in here just makes you feel like part of the in crowd.  It would be hard not to as the the bartenders and wait staff are all incredibly good looking as are a large majority of the customers.\n\nWhile this time I only had a few drinks, two large glasses of a nice pinot grigio and a gin and tonic, i have been here for food a number of times and a group near uslast night ordered burgers that both smelled and looked delicious.  so i am happy to say that both food and drink at this bar are very good.  maybe a wee bit on the pricey side though, but this is Stockbridge after all...\n\nbeing such a fabulous place Hamilton's does get very crowded on a friday and saturday night and last night was no different.  however, after a bit of waiting we were lucky enough to get a seat which i was very grateful for (i was wearing heels after all).  i feel like being overly crowded is a bit of a draw back as it's a struggle to get a seat, but also a positive as it creates a fun and lively atmosphere.\n\nreally there isn't much else to write, Hamilton's is a fantastic bar and I'll happily pay it another visit when given the opportunity.", "business_id": "KqgeyLdYbfsd9veyR6UGtw", "stars": 4, "date": "2012-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RseQp6wv6uK5AFHCUGahGg", "review_id": "lUZSX9QxwK72l3ldYkggPg", "text": "Good food (we had a platter to share) and beer. The place seems like a haven for hipsters, but with a good mix of people thrown in. We'll probably return next time we're in the area.", "business_id": "KqgeyLdYbfsd9veyR6UGtw", "stars": 4, "date": "2014-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "r-KbYMDgPLXROQ8kc2Ve2g", "review_id": "huuPsYj0eR2SEUqSGhVmtw", "text": "From the outside this place doesn't look like much but inside the interior is super funky and very comfortable. \n\nShame I don't have such positive things to say about the food and service. First, my drink order was wrong. That's ok, just waited for the right drink. And then 20 minutes later my drink arrived. \n\nThen there was the food. The burger, not too bad, my partner rates it a 7/10. The club sandwich was a plate of wth!?! Chicken and mozaralla on two chunks of ciabatta, no basil pesto as stated on the menu and cold bacon. I could not for the life of me figure out how to eat it, so enjoyed some bland chicken and mozarella with a size of overly large chunks of bread and cold bacon. Such a shame. \n\nThen commenced the 30 minute wait for our bill, whilst I tried and tried to catch the eye of somebody, anybody! \n\nAnd so was my experience and Hamilton's. The redeeming quality here is the ambience surprisingly. Nice place to sit and share drinks with friends but I'd be very wary of ordering food.", "business_id": "KqgeyLdYbfsd9veyR6UGtw", "stars": 2, "date": "2015-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "D0ZSLTVNUaz0D1YpW17jhg", "review_id": "taWJDAT0tr1hKoneeIAz_A", "text": "I've been past many times but never ventured inside. Hamilton's has been around seemingly forever and from the outside might give the impression it's a bit dated. \n\nIt definitely exceed my expectations - there is a nice vibe here; large sofas, wooden tables and candles made it feel cosy. It may not be cutting-edge hipster modern but it's definitely got something going for it.\n\nWe were with a large group and the staff were very accommodating and friendly.   I was really impressed by the service and the bar staff where happy to recommend drinks.\n\nThe food is quite aspirational making emphasis it's organic/local produce credentials. I had crab cakes, confit duck leg with peaches and artichokes and a lemon posset. It was fine but lacked refinement. Some members of the group enjoyed theirs better than others but there seemed to be a general lack of consistency. They might benefit by focusing on simpler dishes done to high standard.\n\nThere is a decent selection of gin and whisky, and I would be happy to come back here for a drink with a group. Stockbridge has a lot of competition for good restaurants and I wouldn't be in a rush back for dinner but I'd consider brunch here.", "business_id": "KqgeyLdYbfsd9veyR6UGtw", "stars": 3, "date": "2015-11-27", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "UTzpK0D8maxbXbnC8b3-dQ", "review_id": "FIyj3LklXaWeyg4EEVeE4g", "text": "Oh Greyfriars. What a lovely place. \n\nYes, as many have pointed out this has the story of a cute little dog attached to it, but honestly, it didn't feel like a tourist-trap pub to me.\n\nAs a matter of fact, when walking in on a rainy Tuesday evening it felt like a warm cosy living room, generously sprinkled with comfy chairs and tables. \n\nI love this place. It's so ... comfy, and homey. Whenever I'm a wee bit homesick, I just pop in here for a nice little read and everything just fades into the background. It's calm, (on weekday afternoons) it's quiet, and it's comfortable. What more could you want?\n\nWhy not the full five stars them? Well, when we walked in they had already turned off the espresso-machine and there was no hot water for tea available. Both being cold, we were feeling a little bit sad about no hot drinks, but settled for a cold pint. (Which ended up doing the job quite nicely). \n\nThe barmaid did tell us that there was a cafe across the street and that we were welcome to sneak in  a take-away coffee from there as long as we held it under the table. Of course she only told us this after we'd ordered and paid for our drinks. \n\nHowever, this didn't take away the ambiance of the place for me. I still like it as a cosy comfy well, gezellig (look it up, it's an untranslatable Dutch word) pub.", "business_id": "Nq_BMV7kyx9_C3w0Jip6CA", "stars": 4, "date": "2011-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MrS9e1zMPDcyMi5gBs-WQQ", "review_id": "QTvHKzW4pJ5RQgZa7pWWbQ", "text": "We stumbled upon this after wandering thru Greyfriar's Cemetery (from the downhill side) and were pleasantly surprised.  The food we ordered was fantastic - one of us had Beef Rib Pie, one had the Chicken & Mushroom Pie and one had the Cod Fish & Chips. All were more than delicious.  Our waitress was great & took good care of us.  We liked that the bar was separate from the restaurant and that we could hear ourselves talk.\nDefinitely on the \"to do\" of places to eat.", "business_id": "Nq_BMV7kyx9_C3w0Jip6CA", "stars": 5, "date": "2012-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nWfAW74fvx-GNpP43jeqCA", "review_id": "z_RsX4rpaaMNtmUJQazshA", "text": "An all right stop for some pub food. Many shops nearby were closing so I ducked in to grab some dinner. I stood for a few minutes, contemplating leaving since the only waiter was serving other tables and there was not a hostess to seat me.\n\nOnce I was seated, I was told the numerous menu items they were out of by a very apologetic waiter. I ordered a side salad that amounted to less than 1/4 cup of lettuce for £3 along with a bowl of cullen skink. Very pricey menu for what you receive, but the wait staff is very polite and fast.\n\nI would try out other places along the street before stopping here, but you can get a perfectly acceptable, albeit pricey, meal.", "business_id": "Nq_BMV7kyx9_C3w0Jip6CA", "stars": 3, "date": "2014-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "PzzgM7D2yaBJ9WmBgQEsYQ", "review_id": "6ZQ0u67EOkU_ReqK0hmPgA", "text": "The best meal on the menu is the balmoral chicken. It's haggis stuffed chicken wrapped in bacon with a side of mashed potatoes and gravy and string beans. To die for. The haggis, neeps and tatties is delicious too but trust me on the chicken. Order it and thank me later.", "business_id": "Nq_BMV7kyx9_C3w0Jip6CA", "stars": 4, "date": "2015-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-zcUihwHq2LkWAGy7Zu1lQ", "review_id": "KbNdC4xDp0KTwfbmnXeSCw", "text": "12 Year old Scottish Whiskey for £3 on the Royal Mile , a great cruising patio out front, and super nice bar help that enjoys chatting about the various blends available.\n\nI'll be back to try the 18 year old whiskeys next time around...", "business_id": "zBG2vQ0A6F5HQkv_aeWfAQ", "stars": 5, "date": "2010-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "wx12_24dFiL1Pc0H_PygLw", "review_id": "jvtDbxlZbz3dADLoAXtCmQ", "text": "Slap-bang in the centre of the Royal Mile, on the Bridges, with two doors wide open to welcome in passing punters is the Bank Hotel. I must have walked passed it countless times and never clocked it.\n\nWhen Emily V told me a friend of hers with the most amazing vocal skills was playing some live music at the Bank Hotel, I didn't know what to expect. Turns out it's like many other traditional, slightly weathered traditional Scottish hotel bars I've been in. With the exception that due to its location and the time of night it attracts an interesting mix of clientelle.\n\nFor what it's worth, the music *was* good although it's not exactly a great 'stage' for any live performer - directly under the tv screen in the corner showing rugby. I felt sorry for the guy at points.\n\nAs Jurgen said, it is dingey and dark and overall it's not got much in the way of decor. But it's warm and wasn't dirty, if that's anything.\n\nI definitely wouldn't come back here 'just for a drink' unless there were other live music worth checking out or a group of friends were convening here. But I can't envisage that either. It's not awful, I think its central location stops it being dodgy. But if it were to be exactly imitated in a less-busy part of town it's the sort of place that would make me a bit worrisome about going in alone.\n\nFor what it is - a traditional public house part of a hotel - it's absolutely a-ok.", "business_id": "zBG2vQ0A6F5HQkv_aeWfAQ", "stars": 3, "date": "2011-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "7DxQDfrnoQI9nGALyi-LyQ", "review_id": "W79PUfXCEA1blvq8CGqTKw", "text": "For a place I'm not exactly keen about, I come here quite a lot.  \n\nI come for the music - Sunday nights at the Bank used to be at least a bi-monthly event on my social calendar.  Not only is the music awesome, but the people watching is absolutely epic.  There is something magnetic about this place, the drunkest and craziest of them all flock here in droves and perform for the amusement of all around.  \nThe best night was when the mental women started stripper-dancing to the music, second best was the woman dressed in leather who started in on the air guitar.  \n\nBUT - I came here for the first time in ages about a week ago.  I paid £4.25 for a Magners and £3.70 for a bottle of Corona.  Flabbergasted.  I know, inflation and recession and all that but those prices are criminal.", "business_id": "zBG2vQ0A6F5HQkv_aeWfAQ", "stars": 3, "date": "2011-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "PeyRaaC9khY-Z6OZ7wJCjQ", "review_id": "EsgXHpp2dQl0BZ7yP-LSZA", "text": "From the traditional appearance on the outside of this hotel one may not expect the very modern interior of the bedrooms. Further renovations were going on at the time of my stay which meant no restaurant and a makeshift front desk (the only reason I am giving them 4 stars rather than 5). The location of the hotel is prime- right in the heart of Edinburgh and within walking distance of all the sights. \nI loved my bedroom with the wood floor, big screen television, very comfortable bed, in-room safe, digital temperature control, and very cool shower. The woman working the front desk was exceptionally helpful and provided excellent customer service. \nOther than the lack of facilities due to the construction that was going on the only possible drawback for me was the noise level outside coming from local students as they enjoyed the nearby bars/nightclubs during the wee hours of the night. I will definitely stay here again on any future trips to Edinburgh!", "business_id": "zBG2vQ0A6F5HQkv_aeWfAQ", "stars": 4, "date": "2013-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YlpzPPySUxJsUJHRyRde8A", "review_id": "mc2grIAjCWdhjNT6Oto0Xw", "text": "I am starting to build up a liking for this little corner of Edinburgh. Tucked away around the back of the illustrious walls of Burger King, is a collection of pubs including the Guildford Arms, Cafe Royal and the Voodoo Rooms. My visit to the Guildford Arms was through no mere accident, but nay, it was to see FC Ukelele play. Turns out, half of Edinburgh also wanted to see them and the Yard of Ale play - the pub was entirely packed out. \n\nSo what can I tell you? The bar was impossible to get to, but there was a mini bar setup at the back which we setup camp near. Less offerings, but avoided going near the crowds at the front. Win! Toilets were clean. There was a restaurant upstairs, but my arms were built for drinkin' that night. The bands had a mini stage up at the front so even those in the cheap seats could see them perform. Folks were up and dancing around us. Really, it was just a fantastic night - staggering out sozzled and nattering to ladies on the bus all the way home.", "business_id": "zpsDyx9wh7LYjtBLTpu_-w", "stars": 4, "date": "2010-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "GWtOjSP77LWbyxPkxXuDIw", "review_id": "e_nrSwCmtsCjorMyCb2NzA", "text": "A feast for the eyes and the soul. The Guilford Arms takes its place among the best pubs in Edinburgh. With a great range of real ale and good food available I can think of no better place to while away a rainy Edinburgh afternoon. Despite its location just off Princes Street its seldom too busy to find some space to enjoy its many offerings, one of which is the traditional fixtures and fittings which evoke a bygone era in these days of mass produced themed bars and restaurants.", "business_id": "zpsDyx9wh7LYjtBLTpu_-w", "stars": 5, "date": "2010-09-21", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "gfD4mXz1mDvUpK2Lk1J1Nw", "review_id": "zhtfkl6XjKpLQfx8ENNDYg", "text": "Another of my favourite pubs. Stunning Victorian interior, ornate ceiling, beautiful old bar and gantry, really nice place. Maybe not quite as strong a visual impact as the Café Royal next door due to its rambling size, but the upside of that is that you have a much better chance of grabbing a seat. It does get busy enough to be standing room only at times, but you can usually get a seat even then if you're prepared to stand for 15 minutes or so.\n\nIt's a traditional pub with up to ten real ales on the go at any one time, plus a range of lagers on tap and the usual bottled stuff behind the bar. For me the only downside is the football on the tv which can create crowds of people standing right in front of the bar when you want to get served. And again, the size can be a good or a bad thing, as it means the pub doesn't have the intimacy and cosiness of a smaller place. But then if you grab the wee snug right up the back then you're onto a winner.\n\nThis might actually be my most frequented pub because its central location close to Waverley makes it a handy spot for meeting people. And it usually has beer from my favourite brewers like Harviestoun and Fyne Ales.\n\nSo. Traditional, ornate interior, loads of good real ale, a decent amount of room and seating, central location. What's not to like?", "business_id": "zpsDyx9wh7LYjtBLTpu_-w", "stars": 5, "date": "2011-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uN0RothodqH3lQd3homTCQ", "review_id": "s7cTpOt42ZDv5XquXPstfQ", "text": "Classic, great pub. And so convenient to the train station!", "business_id": "zpsDyx9wh7LYjtBLTpu_-w", "stars": 5, "date": "2012-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oQrqjkC_5H5wrWtQU3ZBGw", "review_id": "0D_-qUZu-wI2YTpJyXDhxw", "text": "So cool inside. Huge high ceiling and awesome bar. The dining room is also on a small promenade overlooking the bar area. They serve several real ales from Scottish and further UK brewers. Loud enough to have a great atmosphere, but still no problem to hear each other.", "business_id": "zpsDyx9wh7LYjtBLTpu_-w", "stars": 4, "date": "2012-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XA67_LU72s7JHA9FCBXdAA", "review_id": "UqEn_sQx0M9tB2heKetAuA", "text": "Nice pub in Edinburgh!", "business_id": "zpsDyx9wh7LYjtBLTpu_-w", "stars": 5, "date": "2012-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QRZ89REiVlkfH3smoJ-9dA", "review_id": "Y-Zm0xrw49wN2OdlAq_v1g", "text": "Great scenery, good food, friendly and pleasant stuff. Very nice!", "business_id": "zpsDyx9wh7LYjtBLTpu_-w", "stars": 4, "date": "2013-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "RH2K7RqzkGUa0pD0nSMDcg", "review_id": "8Z3AQ8OaB7bjcru-PSmzWw", "text": "I really like this bar. It's got a good selection of real ales and has a fun atmosphere of people passing through, people from the nearby banks, and a few angry looking locals. \n\nWhile a touch expensive I prefer this bar to pretty much anywhere else on this strip and it's a great place to meet friends if they're just coming off the train. \n\nA good selection of local beers always helps make a place that bit more special and while I'd like to see their keg range expanded they still do have a good lot of try. \n\nThey do food. I don't know what it tastes like though. There is even a restaurant somewhere I think. I have given up food for lent so haven't eaten out there yet (worst excuse ever)", "business_id": "zpsDyx9wh7LYjtBLTpu_-w", "stars": 4, "date": "2013-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QoXq-BYqK1C6z44YMEdQJw", "review_id": "ddZL34m8IPCT7Wag_JjpmA", "text": "Had a fantastic pub dinner here tonight.   The pub was busy (it was a Tuesday) which is a good sign but we were concerned that we wouldn't be able to get a table.   But it turned out not to be a problem as we only had to wait about 5 minutes.   Two of us had the steak pie which was excellent.  The third in our party had the haddock and chips which she very much enjoyed.  The staff was friendly and helpful too.  I definitely recommend this place for a casual pub dinner.", "business_id": "zpsDyx9wh7LYjtBLTpu_-w", "stars": 5, "date": "2014-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "MDcqlbqfvPXOUtw_w1h4kg", "review_id": "yx-q38tXVVLxRfmUZiKSrg", "text": "We decided to try this place out based on the reviews of a couple local Elites. Fantastic experiences both nights we went. First off, the decor is Victorian-decadent and feels classy, modern and welcoming. There are a variety of places to sit -- tables, booths, nooks and crannies -- and you can expect a full house if you're here alongside the after-work crowd.\n\nThere's a large variety of ales on tap, so don't be afraid to ask the barkeeps for suggestions. Naturally, there's a fine selection of single malts available as well. Prices are very reasonable, especially for being a skip off of Princes Street.\n\nIf you need something a little more substantial than a few good ales to fill your belly, Guildford Arms also offers gourmet pub grub, from classic fish and chips to your obligatory haggis, neeps and tatties. I tried the Angus steak pie. It came out piping hot and a was a savory little boat full of meat and gravy. Comfort food for grey, cold evening, for sure. There's also a tiny dining area upstairs that overlooks the rest of the pub. Up there, they have an expanded menu featuring a number a entrees. I suppose I'd call it the American section, as that's exactly who the area was full of when we were there (ourselves included).", "business_id": "zpsDyx9wh7LYjtBLTpu_-w", "stars": 5, "date": "2014-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "QG964fm_ecqrA5hwUw5K-A", "review_id": "26Dh7ZfOIg00HF9keVz8ow", "text": "First time to Edinburgh, and found this place on Yelp and it's fantastic. Charming atmosphere. Second-level loft dining room. The haddock and fries (fish n chips) was great. The steak pie was rich and tender. Our server Amanda was FANTASTIC!!! Very helpful with the tourists.", "business_id": "zpsDyx9wh7LYjtBLTpu_-w", "stars": 5, "date": "2015-09-14", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "UTzpK0D8maxbXbnC8b3-dQ", "review_id": "JPLgLE1_XvKsc7Qw-PGTRw", "text": "What the ...?\n\nFirst I have to say that I'm aware that I'm going against the grain here, with my one star review, but despite raving reviews I had a markedly different experience. So please, bear with me and read the below.\n\nRight. I went here on a Thursday night with a group of people from what is called the cocktail society. Surprisingly I did not have a cocktail, which apparently is what the bar is known for, because I figured if I did, I'd end up falling off my chair instead of sitting neatly upright on it. \n\nNow me and my friend both decided to have a glass of wine and get this, they made the ultimate wine faux pas. Firstly, my glass of wine suddenly went from 3.75 on the menu to 4.20 in person. I asked several times if they'd given me the correct one, even pointing out the different price in the menu, but to no avail, the price was 4.20. Okay, well, that can happen.\n\nBut guess what happened next? They use cocktail measuring cups to measure out the wine for a small or medium sized glass. I guess it's fairer that way, but it sure looks a little .. sleazy. Yes, I said it. I don't want my wine in a metal cocktail measuring cup before drinking it. I'm sure that doesn't help the flavour.\n\nThey measured mine (a red) out first, and then .. oh then, the ultimate, deadly faux pas of winery: they poured my friend's white into the exact same measuring cup used to measure the red, without washing it first. That's right, no washing, nothing. We just looked at each other and sighed. This was going to be a special night.\n\nAfter that I asked for a jug of water, the waiter confirmed by asking if we'd like a jug -yes we would please- and brought us two glasses instead.\n\nThree strikes and you're out. Come on, you can't measure out wine in cocktail measuring cups that are unwashed. Gross.\n\nI'd give this a miss.  \n\nP.s. Of course it is entirely possible that the person behind the bar was new, and made some mistakes because of it. However, if that's the case he should've been supervised to make sure the quality of the drinks was not affected!", "business_id": "QPsNlmETw14k-_RqX-RULw", "stars": 1, "date": "2011-10-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "0MRlubaLu5v3sI4vu_XqDg", "review_id": "LNfBNlV1aliEOihdZ4JiYQ", "text": "Admittedly, what first caught my attention of this place was its name, because of it's similarity to my own name. The BF and I originally planned to just have a late night drink here while on holiday in Edinburgh, but after not being able to get in at a restaurant across the street on a Saturday night, we decided to eat dinner here as well. The space is very attractive inside and lit by candlelight at night. One half is primarily just a bar and open space, and the other half has tables and chairs for dining, with free w-fi available throughout (just ask the bartender for the code). It's set up like a traditional British Pub where you order your food at the bar and give them the table number you're sitting at, but service is still timely and friendly.\n\nMuch of the menu looked appetizing, and the prices seemed more than reasonable. We decided to get a couple different pasta dishes to share: Their menu has changed a bit from the menu currently listed on their website, but one was a chicken pesto pasta and the other a spicy andouille sausage pasta with peppers. Both were good, but the sausage one was one of the best dishes I ate during our entire holiday. It was so full of flavor because the meat was extremely plentiful. If you're not much of a pasta lover, they do offer a good selection of burgers (including chicken, lamb and veggie varieties), and all burgers and main dishes are 2-for-1 Sunday thru Thursday!!  \n\nNow on to the drinks...\nBar Kohl is the original vodka bar of Edinburgh. They have over 50 different flavors as they've gotten quite creative with their Absolut infusions. We opted to get a pitcher of FAB, which is one of their specialty mixes consisting of strawberry infused Absolut, Stoli Razberi, Havana Club rum, Blue Curaçao, Midori, grenadine, blackcurrant and milk. It was AMAZING!! If we didn't have late night plans, I could've stayed at Bar Kohl all night trying different concoctions from their flavorful well!", "business_id": "QPsNlmETw14k-_RqX-RULw", "stars": 5, "date": "2011-10-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "UTzpK0D8maxbXbnC8b3-dQ", "review_id": "gxKchojTVPixgdYaCjUM0g", "text": "Okay, so I know that I've just written my review of  Bar Kohl and was not that impressed, but I need to adjust my view of this place.\n\nI was here last Friday, on the Friday before Halloween that is, and it was a regular party. There were a lot of groups of the young, hot and presumably, single, milling about having a good time, and the music was spot on (pop, hiphop, R 'n B).\n\nPerhaps it was the vibe that was different on a weekend, maybe the Tequila shots that went down oh so smooth, but I liked it, I like it a lot.\n\nYes, the bartenders were a bit clumsy and didn't seem to know what a proper Tequila shot is about (with salt, and lime please) but still, the place looked very hip and dashing and most importantly: I had an absolute blast, though that may have been the company. ;)\n\nI'd say, go see for yourself!", "business_id": "QPsNlmETw14k-_RqX-RULw", "stars": 3, "date": "2011-10-31", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "8GPJ4VUxbKMhrT3V3Ql8CQ", "review_id": "8zeJDQoTWAqeIzi4yXyPpQ", "text": "Bar Kohl is a spirit bar, there is a massive range of tasty alcohol goodness, yet a surprising number of male twenty-somethings come here and drink pints of generic lager... I tend to take a more \"when in rome\" approach and happily drink random purple/blue/pink concoction be it in a cocktail glass or pitcher rather than a pint of beer or cider.\n\nWhat I am really trying to say is Bar Kohl is a guilty pleasure, it is ok to drink ridiculous things here (and some of the shooters on offer really are) and just have a laugh. For a mixed group Bar Kohl is ideal, I just don't understand why a lot of the lads don't join in the fun!", "business_id": "QPsNlmETw14k-_RqX-RULw", "stars": 4, "date": "2012-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Xp24_GebsNkgoMKFk821Uw", "review_id": "H9W9U4g_N2z1TXYZXCNLcA", "text": "Burgers and cocktails, what more could you want?\n\nSo I've been coming here for a year now, mostly with Edinburgh University Italian Society. We were given discount cards for half price food and reduced cocktails, which have been used a lot!\n\nI've always had good experiences here, but I'm going to review my dinner there last night. I was just out of work and totally goosed so my fiancé and I decided it would be a good (and lazy option) to pop in for a burger on the way home. We hadn't been since July since the discount card was not valid during August, but fortunately it works again now. We would still pay the full prices but we certainly wouldn't go as often. Paying only £4 for a burger and less that £5 for cocktails are just too good deals to miss.\n\nI opted for the New Jersey burger which had delicious fried chicken, mozzarella, salad and sauces. It was so delicious. The chicken was just good old fashioned fried chicken in a lovely batter. My fiancé had a Chicago with beef, pickles, salad and sauces. It was tasty and moist, but not quite as good as my chicken burger. Both came in a seeded bun that was fresh and toasted on the inside, just how I like them. We got them with a portion of handcut chips and a portion of sweet potato chips which has a yummy cajun seasoning on them, very scrummy. Our complaint last time was that the coleslaw appeared to be not homemade, but this time it appeared to be. It was much nicer and had more to it that just carrot, cabbage and mayo.\n\nMy cocktail (Edinburgh Collins) was amazing. Not too alcoholic, not watered down and with lots and lots of raspberries. His pint of Estrella was a standard pint of Estrella, not much to say about it really!\n\nOverall, we had a lovely cheap dinner. The reasons I give this place 4 stars instead of 5 are that, for one, the decor is okay but it can be really dark and the tables and chairs have all seen better days, you have to be careful not to nudge them the wrong way and send your cocktails flying. And, as I've said, the food is good but not everything I've had has been as delicious as the New Jersey so not all deserve 5. But I would definitely say go and give it a try. I can't see how you would be very disappointed at all.", "business_id": "QPsNlmETw14k-_RqX-RULw", "stars": 4, "date": "2013-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 3}, "user_id": "JySNI9tIhmFFtUorc4zkwg", "review_id": "W_oaioDNqWQAv79p-CkEPQ", "text": "14.\n\n14 is precisely how many international text messages I have sent about their reverse walnut manhattan. The kicker? It wasn't my drink. I had ONE sip of another person's beverage and felt it deserved the $20 in international text charges it has now accrued.\n\nIt's a damn fine cocktail.\n\nNow i'm not going to beat around the bush - I didn't try the food, I didn't stay longer than one drink and I didn't pay much attention to the place as a whole, beyond my delicious, delicious cocktail. But if exorbitant cell phone charges aren't worth a five star, well then, the world has gone crazy. I DID however, note the very funky ceiling and impeccable chalk penmanship of their menus - i'm a dork like that.\n\nHigh fives and shimmy hugs to Nathan (which i'm hoping is the correct name... there had been a few cocktails previous to this one). Lucky for us, we happened to be sitting next to this fine gent, who not only works at the place but is the wizard of all off menu ordering. If he's any indication of the rest of the staff, get ready Bar Kohl - i'm moving in. He was so personable and so knowledgable that it was an absolutely delightful stop in on our rather mischievous Saturday.\n\nI'm also intrigued by the group cocktails, which sound yummy and occasionally seem to arrive in tea pots. Anything that makes drinking a whimsical occasion deserves bonus points in my book, though i'm not i'd be a good sharer.\n\nThe one and only drink I had was a flip on a manhattan. I could not tell you the name, as it was suggested by Nathan and after knowing him for all of 45 seconds, there was inherent trust. Good thing too, cause it was delightful and boozy - just as it should be.  But the real beauty of the night was the tiny sip I had from my new buddy's glass - the reverse walnut manhattan. Flip the usual bourbon/vermouth ratios on ear, make that vermouth walnut infused (... i think) and watch while Canadians wax poetic over it for days...\n\nAnd sure, it was a little pricer then other cocktails we would take on that night but i'm willing to spend a little more when it's something i'm excited about.\n\nNeedless to say, i'll be back and I'll try more, I promise. Maybe even look up a bit too  - but not until i've had a walnut of my very own.", "business_id": "QPsNlmETw14k-_RqX-RULw", "stars": 5, "date": "2014-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "AJU7q-FHlhPNTUJp7-Snyw", "review_id": "2CzpiLnOMNBawYn7WtDfyQ", "text": "I met a large group of friends at Bar Kohl to have some drinks and hang out before a rugby game. Without a reservation, our large group of 25+ was given the private back area and great service. My 4/5 is only because I didn't try the food, but the selection of drinks was great, the ambience was cool and laid back, and the staff were very nice! I had a Hendricks tea pot which was a lot of fun, I recommend giving it a try :).", "business_id": "QPsNlmETw14k-_RqX-RULw", "stars": 4, "date": "2014-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oSA746-4MCJpWorJkzxqpQ", "review_id": "EPlPQZuiP_7yelFh3CYRIQ", "text": "i'm a little bit in love with the villager.\n\nstopped in last week w/the boy to dry off and have a drink while we warmed up. ended up settling in on the comfy leather couch and staying for a few hours! the food is far beyond standard bar fare.  i had the pesto and pinenut past and he had the chorizo stew. amazing.  the chocolate cake for dessert had the most nummy fudge sauce and just a smidge of tasty butterscotch sauce as well.  the wait/barstaff were incredibly friendly and didn't try to rush us at all.  \n\nmy boyfriend's favorite part was that they facy up their tap water with cucumber and mint.  the prices here are a bit high, but it's not terrible. and they make proper cocktails! i thoroughly enjoyed my amaretto sours throughout the night. next time we're back up to edinburgh, the villager is definitely on the list.", "business_id": "rkk2gLhqB3P5lwaGeBiDqQ", "stars": 5, "date": "2009-11-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "UTzpK0D8maxbXbnC8b3-dQ", "review_id": "2cXlyrABZBCMSbUTDx1YnQ", "text": "The Villager.\n\nSigh. \n\nNot only do they serve truly exceptional cocktails, (I laughed, I cried, I drank my glass dry), they are sensitive to what it is that you really want.\n\nNow that, boys and girls, is something you don't find often in your average pub/bar/cafe. When I walked up to the bar to order a something-something margarita, the barman quickly asked if I would prefer a traditional one (which was exactly what I'd wanted but it wasn't on the menu).\n\nOh bliss. Oh alcoholic joy. This was ... awe-inspiring. I've not had a better margarita to date. (Excepting the time I came back to the Villager a few nights later).\n\nThe food here is of a nice standard and they play classical music in the bathrooms! I don't know why but that just made my night.\n\nI love it here!", "business_id": "rkk2gLhqB3P5lwaGeBiDqQ", "stars": 5, "date": "2011-09-25", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "UTzpK0D8maxbXbnC8b3-dQ", "review_id": "Uc-QkeT06qrL5q09SjiZqA", "text": "Village burger! All the way!\n\nTook my parents here a few nights ago when they were in town and we had a full on meal here. I was so surprised, I don't know why but I didn't expect the food to be *that* good. And boy was I wrong.\n\nThe burger was inspired. That's right, inspired. My dad's Sunday roast was a work of art and the fries were gone so fast (we're Dutch, we like fries) that I had but a fleeting impression of them, but oh man, crunchy, and delicous.\n\nYou know what I also like about this place, their water. Weird, yes, but they serve these jugs of water with fresh mint, watermelon and cucumber. What's so special about that? Two things: firstly, you get a tiny hint of all those flavours in your water which is just rather delicious really, and secondly, it means that the staff took the time to sit down and think about what it is the customer would want, and then they proceeded to execute it. It's thoughtful, like bringing flowers to a house-warming party. It makes you feel, welcome, and warm and fuzzy inside. (Possibly the cocktail had something to do with that as well, but hey). \n\nDid I mention the service by the way? Fun, upbeat, engaged but never pushy. \n\nAbsolutely an Edinburgh favourite.", "business_id": "rkk2gLhqB3P5lwaGeBiDqQ", "stars": 5, "date": "2011-11-12", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "uq9tCNnMJxM4QNrbUC2tfQ", "review_id": "6O7vz2pBZXZwuS5JdUIM4g", "text": "I used frequent the Villager in my uni days and this week as I had one of my old flatmates visiting for the night, we went back here. \n\nIt is full of happy memories for us and the staff are always welcoming and totally makes you feel relaxed and at home.\n\nAs we hadn't booked a table, the waitress offered us one of the sofas which was perfect for a girly catch up with a bottle of wine and a mezze sharing plate.\n\nAll in all a great evening and I struggle to find negatives about the Villager. Oh apart from the toilets, they are in DESPERATE need of a refurb!", "business_id": "rkk2gLhqB3P5lwaGeBiDqQ", "stars": 4, "date": "2012-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "aaLXzX88QjjrlARrwIaPKQ", "review_id": "bwUqRHSNkNogRQhPQXHCMw", "text": "Quiet lunchtime, but good tasty burger and welcoming staff. Good music, but turn the heating up please!", "business_id": "rkk2gLhqB3P5lwaGeBiDqQ", "stars": 4, "date": "2012-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "JCESis-wnTic8dp_37DxMw", "review_id": "aDkEM1aWBeDo7tQNYbuZog", "text": "Delish! Popped in for a spot of lunch while on vacation in Edinburgh. Staff was attentive and warm. Food was fresh, tasty and lick-the-spoon-clean good!! Bonus: great music! Could sit here all day. The cocktail list looks amazing, maybe a pm visit before heading back to the states.", "business_id": "rkk2gLhqB3P5lwaGeBiDqQ", "stars": 5, "date": "2013-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-ARBXmBVfaiF1zq3pJl9rg", "review_id": "HOsjTnCXKPwGDaHmcvJ8UA", "text": "I really like this place. Great variety of cheese and deli meats. A little pricey but good quality foods!", "business_id": "NLjG1EDhI2Aa71ZoLFqbQQ", "stars": 4, "date": "2009-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wx12_24dFiL1Pc0H_PygLw", "review_id": "8ZKe2-RTmFXjsz-bTl5WDg", "text": "I purposely sought this place out when deciding where to eat on a Sunday afternoon. They're cafe hours are slightly restrictive, so we had to rush over, but it was worth it.\n\nI last visited Valvona & Crolla when I was 12, with family, to get some supplies for a home-made Italian meal. When I walked back in last Sunday, 13 years later, it hasn't change one bit - and for the better. \n\nDon't be fooled by the small, unassuming and slightly run-down looking exterior. It'd be easy to walk by. But once you're inside, a cavernous deli and fresh-veg haven awaits you. It was established in the 1930s and it seems it has lasted for nearly 100 years due to the divine and authentic Italian deli produce.\n\nI won't harp on too much. Basically, the deli is vast and delicious. Come here if you want to buy some top-quality ingredients from a traditional deli, rather than the main-stream and slightly more expensive (and probably lesser quality) counters in Jenners etc.\n\nI did actually visit for the cafe. As I said, the hours are restrictive. It closes at 3.30pm on a Sunday which is quite early.  However, the food lived up to expectation and wasn't overly pricey. I had the Polish Ham, cheese and mushroom foccacia: mm, mm, mmmm. Coupled with fresh-squeezed orange juice and real-leaf tea. Wonderful.\n\nOnly down-side is the decor of the cafe is a little uninspired. It's a big area, but the tables and decor is very circa. mid-90s British cafe. It seems to lose all romance and authenticity of the Deli only a few steps away. So not exactly the perfect setting for a romantic date. But for amazing, delicious, authentic Italian cuisine this is one of Edinburgh's best kept secrets.", "business_id": "NLjG1EDhI2Aa71ZoLFqbQQ", "stars": 5, "date": "2010-09-06", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "hWsetj0Vyv7sDpJkr6HAOA", "review_id": "5rZPoUbNMOB-aL4uNzkyOQ", "text": "Mortadella, arancini, pecorino ... boy, this shop is amazing. Don't go when you're feeling skint, though - its pretty expensive! Fabulous, and worth the money, but I have come out a bit shell shocked after everything got added up at the till...\nThere's every type of pasta, meat, cheese or Italian liqueur you could ask for, and some nice pre-made quiches and sandwiches too. And if you're peckish there's always a range of olive oils out for tasting, with little bits of bread to dip. That's where you'll find me, oil dribbling down my chin...", "business_id": "NLjG1EDhI2Aa71ZoLFqbQQ", "stars": 4, "date": "2012-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "R4cg3XAVxFL8joQp7y3jBg", "review_id": "GtucfeqvpdfPai_n4ytMLg", "text": "It's so nice to walk through their amazing shop on the way to the cafe as it gets you really excited about good food in general. \n\nWent there on a recommendation of a friend and it did not disappoint. Delicious wine too... and courgette flowers in a starter is cool :)\n\nLoved the olive oil and balsamic so you should def get bread if you're eating there- it doesn't come automatically, but is delicious", "business_id": "NLjG1EDhI2Aa71ZoLFqbQQ", "stars": 4, "date": "2015-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "sfJP6W0E_JThj5eXLBd6pA", "review_id": "kBhJe3SbPqtVc9DSp_WmNw", "text": "I have to remember that this place is clearly meant to cater to families. As a major science geek, unfortunately Dynamic Earth was just a bit too watered down for my tastes. \n\nHowever, the exhibits would no doubt capture the imagination of rugrats and hopefully instil a wonder of science for their future. Of which I can only give the thumbs up gesture to. \n\nFeels a bit tired now - could maybe use a bit of a cash injection to give it a bit more sparkle. \n\nStill, I don't think I am really who they are looking to capture. I bet it's a great family day out :) I just wanted more rocks under glass, haha!", "business_id": "Rza-FztnKi8YfcSkn1KxgQ", "stars": 3, "date": "2013-11-11", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "OtR7HfadZXyFYosUzjWxhg", "review_id": "X3bvW3uBihjO6nCdLAogCQ", "text": "Surprisingly good! We went on a free day, so it was swarmed with some of the world's worst-behaved children, but we still enjoyed it. It's quite involved and managed. You are taken from room to room to explore displays and view films that explain things to you. Finally, you get to explore some galleries on your own and you get to see a planetarium type of film in the dome. While all of this is very good and educational, - cool special effects including smells, temperature changes, earthquake simulations - it's also kind of dark and not terribly stroller friendly when it's crowded. The lifts are small and only hold two prams at once, so if that's a factor, come on a quieter day, midweek or opt for a child carrier. Good soft play downstairs and nice cafe. Worth a visit but best for kids over 4.", "business_id": "Rza-FztnKi8YfcSkn1KxgQ", "stars": 4, "date": "2014-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "7DxQDfrnoQI9nGALyi-LyQ", "review_id": "oJqlFyVF5Xlsz8r1N6x7hg", "text": "I used to think that British sausages were these horrible sawdust-filled fatty mouthfulls of awful (and probably offal too).  Then I realised that I was just being a cheap student and had no place judging British sausages before giving Crombie's a chance.  Oh how gloriously wrong I was.\n\nIn addition to amazing sausages, they have brilliant cuts of meat and OHSOAMAZING pies.  Their steak pie is possibly the best I've ever had.  I had to work all day Saturday so on his way home, my man picked up a small steak pie from Crombie as a treat.  The size was perfect for two people who aren't complete gluttons like we are so we felt like we could have stuffed our faces even more than we did.  \n\nI don't really understand why we don't go here more often, but I definitely know what we will be having for breakfast next weekend.", "business_id": "kRMmce-qdD06nm4ESno_3g", "stars": 5, "date": "2010-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rytPZINUkRfgYdDCtzYq5Q", "review_id": "9DSJr0jW9aISVIpvOdjGNQ", "text": "Very Exspensive Butcher and the staff are VERY Rude.\nI Will not Shop here again.", "business_id": "kRMmce-qdD06nm4ESno_3g", "stars": 1, "date": "2012-09-16", "type": "review"}
{"votes": {"funny": 6, "useful": 4, "cool": 2}, "user_id": "ZMACA2Wkla6SM3AjbG_dQw", "review_id": "dYdrgQA42szfj5BPOUogow", "text": "I have finally got myself a dictionary with enough superlatives in it that I now feel comfortable reviewing the, what should be, World Famous Theatre Royal Bar.\n\nWorking just round the corner from Leith Walk there are a multitude of options to choose from when considering what the works \"local\" after work venue should be. Having vigorously tested all options, several times each over the years, I am satisfied that the best venue is also coincidentally the closest to my work. \n\nHaving been a patron of this establishment for many a year now I really can't talk highly enough of it...but i shall give it a darn good go!\n\nFirstly, the setting. Situated five minutes walk from the city centre it is within walking distance to everything a man could need. From a run at the local gym in the omni or a bite to eat at one of Leith Walk's plethora of restaurants to being a stones throw away from St Mary's Cathedral if ever you fancy a beer to rinse off your freshly cleansed soul. The Theatre Royal is perfectly positioned. (As also briefly mentioned it is also the closest pub to my work!)\n\nThe interior itself is a haven for the theatre lover, with the walls adorned with signed posters from the various acts that have tread the famous boards of the Playhouse. \nThere is plentiful seating around the grand looking island bar, through the back there are large tables where groups of friends can relax after a hard days work. \nThe grand looking island bar, however, can cause a bit of consternation amongst patrons with slight difficulties in being always being seen on a busy night, this can lead to a bit of a wait to get served...but rest assured served you will be!\n\nWhich leads me nicely on to my second point, the staff. These are some of the nicest bar staff I have encountered in Edinburgh - and I have encountered several. They are all very friendly and chatty and ever attentive. There is very low turnover of staff which I think indicates it is also not a bad place to work. The staff at the theatre are one of it's biggest assets.\n\nThirdly, the drink. Like in most city centre venues the cost of drinks has steadily increased over the last few years. It no longer offers the obligatory bottle of wine for £5 or £1 a bottle of beer. You are paying for the location and atmosphere. \n\nAfter another seamless segue we arrive at my fourth area, the atmosphere. On any given day you can experience several different atmospheres in the Theatre royal, each giving it it's own life and personality. In the afternoon you can slip in and relax on one of the big seating areas in the back and have a quite drink or lovely meal. on a show night there will be a steady rise in numbers up until it reaches it's crescendo at 6:30 - 7 prior to the house opening next door. At 7:30 an exodus and you're left with a few locals and the bar staff starting to get set for the post show barrage. \n\nFinally, the food. The menu here caters for all. From the stunningly cook Steak via the de rigueur Fish and Chips to a personal favourite of mine - a vegeburger with cheese and bacon (just you try it before scoffing). The value for money for the food here is exceptional, the quality of food is of a very high standard and the portions are generous without being foreboding.\n\nMy overall opinion of the Theatre Royal bar is that if they had rooms to rent I'd never leave! I would very much recommend you try it out and soon. \n\nAnd when you do...I'll be standing at the bar and mines a pint of tennant's...see you soon!", "business_id": "8uMP4kv2Je6rM9ZNz0apGw", "stars": 5, "date": "2011-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "MaxaY-P91WjOtGViSLK99w", "review_id": "ckMRMNiKn324RzIXz5spuQ", "text": "When the after-work rush makes most of my other favorite Stockbridge pubs crowded to the point of annoyance, the Antiquary is usually a safe bet for a seat and an audible conversation. This basement bar is cozy and comfortable, and it's a reliable source of quality pub food.", "business_id": "71Jz93r-PIkXpAP9Od_YwA", "stars": 4, "date": "2013-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HdiWqcn-6SiBBDe2x_oGrQ", "review_id": "Y-U-5jETiv-BSba9Jl29XA", "text": "Ich fand den Laden sehr nett. Auffällig fand ich dass die Schotten scheinbar allesamt etwas früher am Wochenende damit anfangen sich zu treffen und zu feiern. Um 20:00 war der Laden schon ziemlich voll, draußen passte ein Türsteher auf,dass keine Minderjährigen den Laden betreten,dennoch passte der ein oder andere höchstens fünfzehnjährige noch rein. Gegen 23:00 waren die Räumlichkeiten aber wirklich vollends ausgeschöpft. Zu diesem Zeitpunkt hatte ich gerad einmal 3 Pints Cider intus, es gab eine RIESEN Auswahl an Cider und Cider-Mix-Getränken, die Welle hat Deutschland auch noch nicht erreicht Schade fand ich, dass es kein einziges original schottisches Bier an der Bar gab, scheinbar nicht so beliebt. Traurig, dass Caledonian 80 oder wie das hieß schmeckte schön süffig\n\n\n Die Musik war gemischt aber vollkommen in Ordnung, die Toilletten der letze Dreck, aber in welcher Bar sind sie das nicht.\n\n\n Insgesamt ein guter Ort für einen netten Abend, auch für größere Gruppen", "business_id": "VxbK-VANsEOzqxTh_GzvzQ", "stars": 4, "date": "2008-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JWwZyFHft__bHjbmpZhimg", "review_id": "vqBaZyKkSZx0O5zefmA5mg", "text": "From the get go, I wasn't exactly impressed with this bar.\n\nIt looked promising enough as a place to start our night out but once inside, you realise they're playing Westlife songs and their staff are needlessly rude. \nAfter being asked for ID for the first time since moving to Edinburgh in September, the bar man who served me literally threw my change back into my hand.\nWhen another friend joined us with no ID, the bar maid said it was ok for him to stay just not to drink. She then obviously told her colleague, who came to tell us that he couldn't stay - to be honest I wasn't disappointed to leave here and move on!\n\nWe had a good night in a few other Edinburgh establishments and had no trouble with anyone else's staff..!", "business_id": "VxbK-VANsEOzqxTh_GzvzQ", "stars": 1, "date": "2010-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "gxNLfuOCnHrH5kVVWhFDiQ", "review_id": "uOOJRnaeXVt_KjQ1NLhB3w", "text": "The Tron is conveniently located just off the Royal Mile (but not actually ON the Royal Mile, differentiating it slightly). Prices are cheap: £2.50 for a pint of Guinness, £2 for a pint of Strongbow, and 5.49 for the basic but fine burger and chips. Upstairs there is more limited seating but nice seats by the windows, and downstairs there is even more seating, making it good for couples and small groups upstairs but having the capacity to accommodate groups downstairs. The bar staff was friendly and the service was extremely quick - we had our burgers out in about 10 minutes! This is a solid a reliable pub, but not one that stands out too much and not one to write home about. Since the price is right and the location is great, I'm sure I'll be back again at some point.", "business_id": "VxbK-VANsEOzqxTh_GzvzQ", "stars": 3, "date": "2012-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "o64IkZLYluCHlDtWzQE71Q", "review_id": "IFptFZ2lRf0bwG_s0mKINg", "text": "A solid pub fayre\nDrink specials during the week\nCentral location", "business_id": "VxbK-VANsEOzqxTh_GzvzQ", "stars": 4, "date": "2012-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cXolqhlZa6lMMy0GR5UQwg", "review_id": "CXsOTeNdFyBu_xMdr3ivTw", "text": "A small, very welcoming hotel, the Howard is both friendly and elegant. The rooms are lovely, the service is perfection itself.\nHighest recommendation!", "business_id": "Mpn6AsGRp_3q00Mzjt-pVA", "stars": 5, "date": "2011-09-08", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 4}, "user_id": "6GiCNlObz5jWy9PPSAXP7A", "review_id": "SheEL4794hMwNT7aWlJScw", "text": "Outstanding for afternoon tea!\n\nButler service alone gets 4 stars and then if I could give the same and more for the actual food it would be like 10 out of 10 stars!\n\nI got the voucher via itison - afternoon tea for 2 with prosecco! \n\nFor starters, we had a canapé and sandwiches, followed by lovely warm scones and adorable sweet treats.\n\nThe prosecco was delicious too as was the Earl Grey Tea.\n\nYeah I'll be back for more!", "business_id": "Mpn6AsGRp_3q00Mzjt-pVA", "stars": 5, "date": "2015-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7GC9fVWKa4a1ZmBGLH6Uww", "review_id": "gzj3Hh6c3UPU5oLoAApCmg", "text": "A perfect afternoon and not a thing went wrong. Impressive for our very large group of ladies there as part of a hen do.\n\nWe arrived half an hour early but that didn't seem to be a problem for The Howard (really helpful as it's hard to organise 20 women arriving in the right place at the right time). The hotel and tea room is located on a residential street and seems like your arriving at someone's house for tea, not a business. Very intimate and cosy start. Our coats were taken quickly and led to a reception area while final prep was done to the room.\n\nWe had a private room, and the server quickly poured the champagne so it was there as we were sitting down. Perfect. He took tea and coffee preferences and their tea of choice was raved about so much that I switched from coffee (also great) to tea and had no regrets.\n\nExtra points for having blue tooth enabled sound system so we could play our music of choice in our room. \n\nFood was excellent, and the scones were warm from the oven. Fresh cream and house made jam was perfect. The sandwiches were also excellent and bread was fresh (no dry corners or other indication they had been made hours or days before and left out). I was not super impressed with the dessert options. They all sounded excellent - lemon tart, eton mess, a scottish-style fudge thing and cheesecake - but I just preferred the sandwiches and scones. \n\nThere was plenty of food for everyone and for the price, I was beyond impressed with the quantity and quality. We had a few hours booked, which meant there was plenty of time to sip tea and coffee and play a few party games. We could be as loud as we liked in our private room :)\n\nYelp check in offered a free glass of prosecco! The server had sense to tell us that instead of us all downloading the app and checking in he would just comp us all a glass. What a good bloke.", "business_id": "Mpn6AsGRp_3q00Mzjt-pVA", "stars": 5, "date": "2015-09-18", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "qXLte7ikUM-__NHU5RaUgg", "review_id": "mtHrhDeJbkgj4V-JC7vb4w", "text": "Came here for the Yelp eats deal with some of the wonderful Edinburgh Elite. This was my frist trip to the restaurant its a place ive been keen on for a while.\n\nThe menu they put on for the Yelp Eats caused some controversy in that nobody seemed able to decide what to have!\n\nI opted for the crab spring roll starter ehich came with a nice salsa and aioli! Cracker of a dish, light, fresh with the crab taste brautifully complimented! :)\n\nThe main....pig on a plate!! SO close to be perfect! Crispy pigs ear, black pudding, pigs cheek and pork belly!!! NOOoooom\n\nPigs ear = ace\nBlack Pudding = ace\nPigs cheek = ace\nPork belly = the meat tasty but the fat could have done with being a little crisper!!\n\nFor desert brownie with white choc icecream! - not bad!! not the best i have had but good none the less!!\n\nThe meal was great but not as good as it gets so not quite a 5 star! Small moan - waitress spilt wine over me and the table! Didnt really apologise other than to offer me white wine on a napkin! Having spilled wine across the table i thought she could have given us a bit off or a free glass of wine! \n\n£90 shirt ruined - angry Jd. Food was good though just dont let that waitress pour the wine!!", "business_id": "r3QvCj1tsgASA90GBU3eVg", "stars": 4, "date": "2011-10-22", "type": "review"}
{"votes": {"funny": 4, "useful": 3, "cool": 3}, "user_id": "xSkRwEat3107wr4mJ--1Ww", "review_id": "nxOXWT7ZxQYkNS-UjCedmQ", "text": "This review is going to be coupled with another review of ZARA's pizza place. The reason I put them together is because while I ate a meal of Coley at the Stockbridge... at 3am I opted for a mushroom pizza at ZARA and I thought it might make sense if I compared notes. \n\nStockbridge atmosphere: Freaky quiet. Little bit stodgy (did I use that right?). Old fashioned, but quite classy. Friendly greeting for Jenny and the rest of us, but still I felt a bit out of sorts (like a kid in my mom's heels). \n\nZARA atmosphere: Freaky loud. Drunken stag do-ers. Crowded and messy, and just as you'd expect it to be. \n\nStockbridge prices: Went on Yelp Eats! so it wasn't so expensive as it would have been, but a pretty penny for teeny tiny little portions. \n\nZARA prices. 5 pounds for maybe the best pizza in town. Fed 2 happily. \n\nNow the food. I'm going to wax on a bit about Stockbridge:\n\nTHE BREAD: Now I love a little taste of the upper class, but I have to admit that the weird herbed breads were my favorite thing I had here all night. \n\nThe AMUSE BOUCHE: This was meat, and I don't eat meat.\n\nTHE STARTER: This was phenomenal and I could have eaten it all. night. long. Crab meat and some other stuff... so delicious. \n\nTHE MEAL: Coley and chips which tasted so healthy that I HAD to get dessert because the Coley was just not bad enough for me. \n\nTHE DESSERT: Sorry, I'm American and while this was delicious and full of some weird caramelly pieces and nuts it was not really a brownie, was it? \n\n\nZARA\n\nTHE PIZZA: Cheesy, amazing deliciousness where the fat ran right onto the carton. No skimping on the toppings, chockablock full of mushrooms. The crust is the kind that NO ONE throws away, crispy and light and maybe tastes better than the pizza itself.\n\nRESULT - ZARA: 5*****/Stockbridge ***\n\nFor the money and deliciousness the unsophisticated in me comes out and says - Pizza over Posh.", "business_id": "r3QvCj1tsgASA90GBU3eVg", "stars": 3, "date": "2011-10-23", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "UTzpK0D8maxbXbnC8b3-dQ", "review_id": "QJa4YbdaCwa5xVCa8vanlQ", "text": "I went here for the Yelp Eats Event and had a wonderful time.\n\nI'd highly recommend this restaurant for a quiet dating evening as it's just one of those places where you could have a romantic dinner without being disturbed by shouts for more pitchers of beer from the bar.\n\nNow onwards fishies towards the food! It was amazing, the starter was the crab spring roll which was all kinds of delicious and subtly paired flavours. My main was duck egg w/ Hollandaise sauce, the which I found to be lovely, absolutely lovely. The wine was nicely paired with the food, the food was nicely paired with my mouth (what?), and I felt calm and relaxed, yet strangely fulfilled when I floated out of the restaurant. (This does not happen often, I assure you). \n\nI have no complaints about this restaurant, the food was very well done, and the ambiance was much to my liking. The only thing I'd mention is that our waitress seemed incredibly flustered for most of the night. She was obviously stressed and had a difficult time preserving her calm, and I think in part because of this, she managed to spill wine over Jurgen, my bread plate, and various drops over the rest of the table. Poor thing.\n\nNot a big deal, just, slip the waitress a Xanax before sitting down, she'll mellow out soon enough and you'll have a lovely meal.\n\nDon't tell anyone I said that.\n\nAnd don't wear white while ordering red wine. ;)", "business_id": "r3QvCj1tsgASA90GBU3eVg", "stars": 4, "date": "2011-10-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "UcYLVPCul-ZQVEdGJLEBdw", "review_id": "BZh724YbDpUB6ocQvTXw9g", "text": "My second time here and this time with Yelp Eats. \nI was happy to return after a good first experience and also for the wife and I to take two friends over from Australia out for a meal.\nI thought the set menu had a great choice and to be honest it was the abundant of pig on offer that sold the restaurant to me. The crab spring spring rolls for a starter were lovely but only made me hungry (the perfect starter perhaps?). Then the main.....pig cheek, pork belly and more pig only thing missing was that it wasn't wrapped in bacon. So good.\n\nLove the interior, and the details and the art work. Could see my paintings hanging on the walls *hint hint*\n\nBig thanks to Jen and Yelp for organising Yelp Eats Week (look forward to the next one)", "business_id": "r3QvCj1tsgASA90GBU3eVg", "stars": 4, "date": "2011-11-25", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "oQhJxpTQryIP83fOJ_UWvw", "review_id": "OUIHEwvuiFg-C3XWOe7_BA", "text": "Well, this was my 3rd trip here - this time for the girlfriend's birthday.\n\nIt's always been one of my fave spots in the city, and I've never had a bad experience there. In spite of the seemingly low score, that's still true now - the food was perfectly enjoyable, staff were all great... I was just left a little underwhelmed this time round.\n\nI went with scallops to start - seem to be eating them a lot recently - and they were amazing. Brilliant texture, incredible flavour, and wasn't OTT with the accompanying apple either.\n\nMy main was the grouse - it was well cooked, good quality produce, but I was just left feeling a bit \"meh\". If I'm honest, I got the same feeling looking at the menu too. When I go to places multiple times, I like to see changes and evolution with the menus, but this felt no different to what I had the first time 2 years ago. Nothing seems to have moved on. It was good, it just didn't wow me anymore.\n\nThe only other sticking point was the atmosphere - again, my third trip and I'm yet to see the place busy and bustling. You end up feeling like you're eating in a library a little, which is a shame as its a great little spot.\n\nAll in all, still good, but just feels like it's gone a little stale at the mo.", "business_id": "r3QvCj1tsgASA90GBU3eVg", "stars": 3, "date": "2015-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3giyV4-TR17VsdfS4HJZEw", "review_id": "LZ-lxDs8JZWMaTI_iq7IHw", "text": "Susie's is vegetarian comfort food at it's finest. Generous portions and a laid back, funky environment. I felt right at home here. The veggie burrito was outstanding and the staff was super friendly. Convenient location close to the University and many Fringe Festival Venues. A great place to relax and refuel or just hang out.", "business_id": "nqZXFkRTH_vsGvOzRVWI8g", "stars": 5, "date": "2009-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M4MVVzNPZHiJdnNvWjL8VQ", "review_id": "LHTrqJog6bOZ1Nt9MKAk5A", "text": "Very accomodating staff as my party of 12 was delayed so we pushed the booking time back twice on the night.\n\n\n Good range of comfort food along the lines of what you'd expect in an American Diner combined with good meal deals and swift service make for a pleasant and unpretentious night out.", "business_id": "u-JyVztsrx2f9sZKm5FvWQ", "stars": 3, "date": "2008-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hlpE5HSOLLkc5V6ZJjC4jQ", "review_id": "qbAZAl5EIAVYVUNQCfUeaA", "text": "We ate here whilst on holiday in Edinburgh. \n\nWe were seated immediately and ordered drinks. They don't do any alcopops so that was a disappointment for me. I had a cocktail instead which was lovely. The kids ordered cokes and the soft drinks were bottomless however no one ever came to ask for a fill up and my husband went to the bar himself for it. The restaurant wasn't busy so I thought they could have been more attentive.\n\nThe food was lovely though and its a very comfortable place to sit and eat.", "business_id": "u-JyVztsrx2f9sZKm5FvWQ", "stars": 4, "date": "2014-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ES1XgC0SPGsNsUuYYbLrXQ", "review_id": "_k3SOgyzV-PQlczZarW8OA", "text": "The staff are friendly and I enjoyed the Haggis, neeps & tatties special.", "business_id": "2Yd7GEhU7uqzraztlLpWKQ", "stars": 4, "date": "2012-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "S47-djzrm2PfmsqzZQguCQ", "review_id": "Xaxv_LUIVdmrZadAXnONHg", "text": "This is a decent-size neighborhood pub with a good, comfortable atmosphere.  The staff when friends and I visited was friendly in general, but extremely inattentive when it came to service.", "business_id": "2Yd7GEhU7uqzraztlLpWKQ", "stars": 3, "date": "2012-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NsUNe1BHPkqj3HcFzE8uTA", "review_id": "YEnYsrzgp7_inRpFqk348g", "text": "My daughter and I were in Edinburgh in October and had dinner at Black Bo's. This place was such a pleasant surprise. We felt so welcomed, so relaxed and the food is excellent. It's quaint, warm and delicious. I look forward to returning. Try this place, I am sure you will feel the same way.", "business_id": "-rwVxBOV0VNXB12of1N6hg", "stars": 5, "date": "2010-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "q6-XUsL3dg9zi2-2b60Lbg", "review_id": "A5WjeYRZoTLD2SkiBBr5XA", "text": "Words cannot describe how fantastic this food was! This place lives up to all of it's reviews. Phenomenal vegetarian and vegan food that most meat lovers would love.", "business_id": "-rwVxBOV0VNXB12of1N6hg", "stars": 5, "date": "2010-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M4MVVzNPZHiJdnNvWjL8VQ", "review_id": "q3B4_ENNFTIn0QWOdusSwA", "text": "Knowledgable staff, well kept ales from all over the country with a regular turn over of guests (the Wiltshire Pigswill I had a few of this week was a very welcome addition to the ones I've tried in my time).\n\n\n No chance of the place ever getting any larger so at times it can be a chore to pass through the crowd, let alone get served - if you plan a long visit you have to decide whether to sit close to the bar at the front or close to the toilets at the rear and then stick by your decision.\n\n\n Winner of the Best Whisky Pub in Edinburgh 2007 (or some award along those lines) so I think that speaks more eloquently of its abilities in that area of the business than I can.", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 4, "date": "2008-10-24", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 5}, "user_id": "wx12_24dFiL1Pc0H_PygLw", "review_id": "gnjNfLdfFZsefym6E5Q0eQ", "text": "This is, for want of a better expression, but what most people would call \"an old man pub\". Meaning a traditional Scottish public house whose usual clientelle is the older generation, for several reasons: it doesn't play loud music, it has the 'local' feel to it where everyone \"knows your name\", it has a great selection of real ales and whisky (amongst other things), the staff are friendly but not overly preppy. It lacks the bells and whistles that is so common in bars nowadays (drinks offers, cocktails, duke boxes, games machines, staff who show their underwear etc.) but this is all to its merit. Instead, it does what public houses were originally meant to do: serve the local people in a homely, familiar environment some damned good drinks, with a genuine smile.\n\nNow, I'm not normally an 'old man pub' type. Despite my previous comments on the bells and whistles bars of today, I admit I'm a sucker for them. Or more specifically, margaritas and 5 types of rum. I like cocktails. I'm not a huge fan of beer. I like a bit of music-atmosphere. And about 90% of old man pubs are sticky, grungy, grimy, dark and one you wouldn't go into as a solo female. Not that they're dangerous, just everyone really *is* an older man who's been drinking since 11am and it smells of cigarette smoke circa 1984.\n\nBut not in The Bow Bar. This is an 'old man pub' in only the best sense of the phrase. It has all the good whiskies (hunners of them!), beers, dark wood, traditional interior, no music, familiarity and friendly staff, locals but without any of the bad bits I've mentioned. It's clean, it's fresh, it's upbeat, it's light (and yet 'moodly' dark at the same time, in a cool way). It's clientelle isn't exclusively of the older generation, and yes there are regulars, but friendly ones.\n\nAND they do feature rotating guest spirits such as the the only gin to be brewed on Islay (where my favourite whisky comes from). The gin was amazing. And they have slim-line tonic. And coke out of a bottle, not a tap. I usually avoid old man pubs as I don't like beer, and anything else comes as diluted syrupy water with a splash of one type of vodka. Not in The Bow Bar.\n\nThis is one of the rare old man pubs I will not only frequent, but go out of my way to visit. I do love whisky (Scotch for any visitors) and they have an epic selection here, some of the best around. Mike, the Manager, and all the staff will be more than happy to tell you about them, ask you your preferences and help you choose one.\n\nFor a real taste of traditional Scotland in the ever-so-picturesque Victoria Street, head to The Bow Bar. Slanté!", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 4, "date": "2011-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qXLte7ikUM-__NHU5RaUgg", "review_id": "IRTZmac_2FwEQUiZYyIe0A", "text": "Saddens me to write this as I honestly think this can be a great place...!\n\nThe bar man last nigth showed spades full of a trait no bar man should put on show.......arrogance!!!\n\nHaving gone in last night with two friends one 28 the other 26 the afore mentioned bar man demanded ID. When I tried to explain that well I am 27 he told me to get out!\n\nNow this in itself is absoloutely his right what really irked me was his attitude around the whole I have to ID anyone under 25 policy.\n\nI am 27 I am nowhere near looking 17 show some common sense and perhaps gain some customer service skills!\n\nIts hardly a surprise that they were empty if this is their approach! Very furstrating as its a bar I have enjoyed many time sin the past!", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 1, "date": "2011-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "YlpzPPySUxJsUJHRyRde8A", "review_id": "rc6F1HM-oErAk3V2XhOd4Q", "text": "I don't think we saw the best of Bow Bar, which is a shame, as I had been looking forward to visiting for ages. It was a relatively steady night, not busy by a long shot, but bar one table when we entered, all other seats were taken. The barman was busy doing a crossword in the corner. We waited for him to look up. \n\nAnd waited. \n\nAnd waited. \n\nAt the point of 'bugger it, we'll go home, not worth waiting anymore', he looked up and came over to serve us. We got our drinks, sat down and drank them, then left. The barman went back to his crossword, another guy appeared and then seemed to be the only one working, while the other guy remained focused on his crossword. \n\nWhile I am cool with the low key vibe of a pub, I still like being served, and when it isn't busy, don't expect to be forming a queue of one at a bar. Unlikely I'll be back, not a particularly positive experience this time around.", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 2, "date": "2011-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oQrqjkC_5H5wrWtQU3ZBGw", "review_id": "JAnJHp4bPfpsKYdaldpypg", "text": "Ran in here on a cold and rainy day for a pint. Bartender was very friendly and made some great recommendations. I had the Black Isle organic porter, which was delicious. Good selection of real ales as well. This place is a real fireplace away from a 5-star rating (the fireplace is a fraud).", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 4, "date": "2012-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "o64IkZLYluCHlDtWzQE71Q", "review_id": "H2mMpDN8oKslomflUT1EZQ", "text": "Friendly, inviting,\nPub stop on the whisky trail\nGreat beer slection", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 4, "date": "2012-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "8GPJ4VUxbKMhrT3V3Ql8CQ", "review_id": "70l_xHS9o8c1sAt2uOSOPQ", "text": "The Bow Bar is very simply a good pub and it is only a stones throw from the Grass Market. They offer well kept draught ale/lager/cider and a good range of whisky alongside a fair range of rum and gin.\n\nNow it does get busy (admittedly a mostly male clientele) and it is fairly small, however if you are after a good quality drink in the area this is the place to go. What you won't get here is generic beer or lager, rather they offer quality drinks from smaller brewers, if you aren't sure what to try the bar staff know there stuff and will help you select the right drink.\n\nIn short, a good pub and probably the best of the group it is part of (the others being The Stockbridge Tap and Cloisters, both rather good pubs too) so next time you fancy a brew, don't be put off by the hustle and bustle of the place give the Bow Bar a chance.", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 4, "date": "2012-11-27", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "LEL1_6acicC5d-HFZ02ZLQ", "review_id": "GOr0ZZY_jyimk_wG8BYhQw", "text": "We were looking for a place we could sit and have a drink in the Grassmarket area, this place seemed to busy, so we decided to give it a try. My friend is more of a beer drinker than I am, so this place was perfect for her. I can't drink warm beer, so I was out for trying the cask. I was daring, hoping not to get hit upside the head, and ordered the Maui Brewing Coconut Porter, this was delicious. At 6% alcohol, it took me to where I was looking to go. After a couple beers, we started chatting with some locals, and we got to talking about my love for gin, he had recommended I try Gin Mare. The rest is history. My love affair with Gin Mare began that night, and the Fever Tree Tonic blended oh so nicely. The bartenders were able to keep up with the demands of the crowd, and yet they all kept a nice attitude towards everyone. \n\nIt's small and noisy, I like that there are no TV's and I love the sign on the door proclaiming, \"no hen parties\". We ended every single night at the Bow Bar during our stay in Edinburgh.", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 4, "date": "2013-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "vBZtYQU5t19g151bh3TyCQ", "review_id": "v3DALB_RC5CLSKzHjxhmXQ", "text": "Try the Black Isle Organic beer. Dark, smooth and creamy! Just a dream:-)", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 4, "date": "2013-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ioftUg9CwWLy8ewfYlxwig", "review_id": "EIHK378KliJhUVbQffLg0Q", "text": "Lively,fun, bright atmosphere( as in lights all the way on all night) tons of beer on tap and loooooooots of Scotch. Minus a star it closes at midnight with last call at 11:30.", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 4, "date": "2013-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "KJKNffnOEXds-554D3nn5A", "review_id": "t0f1d0U_au9Qkf_4ZFwHdQ", "text": "Good selection of scotch \nStaff seem helpful \nDecent prices \nGood amount of room \nBusy with locals", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 4, "date": "2014-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xkDFZNIqyC6235UvlIi7vw", "review_id": "cTiRJ7zNXz8rB3Ljeco9Bw", "text": "Perfect local bar... Really. Just not a cocktail bar (at all!). Whiskey selection is amazing, beer selection (including American ipa woohoo!) is fantastic, no tv, great crowd, great staff who knows whiskey and gives an f, and lastly good prices. And what... 2 minutes walk from the mile? Yeah no brainier. If u like sports bars with crappy beer and many tvs, don't come. If you like class and people, come. Simple right?? Just be warned its crowded as it should be. \n\nAnd as some other reviewer mentioned if you want your scotch in a Coke (I am assuming that comment was a joke) I would believe that indeed they would not serve you. You would belong in a sports bar. Just sayin.", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 5, "date": "2015-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "52WyjUqDJbLR6JlNoJQSsg", "review_id": "X5vw6b56prue4uTf21ZweA", "text": "Popped in for lunch and a pint, exhausted after climbing the hills of Edinburgh for a few hours. A comfortable, cozy, no frills pub with great beer selection and excellent bartenders, who also recommended a fine whisky. And the pies were tasty, too. We could have sat here for hours, but there were more hills to climb.", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 4, "date": "2015-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nSxLSuHq0PlTz2TRkY3s3w", "review_id": "6gvF3aB1nkJJwA1agB7EbQ", "text": "Perfect place for a dram. Knowledgeable bar keeps and a huge whisky selection. Oh, they have beer too.", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 5, "date": "2015-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "eDVvQOX9z-Zm7n9CVXrlSw", "review_id": "To43_HzL5kY1MaTRkZNIhw", "text": "Small bar behind the castle.\nBeer selection is by the loch ness brewery plus sone bottled beers.  The bar excels in its whiskey selection as they could be in excess of100.\n\nSeating is benches along the wall with a small narrow table in front. There are sone chairs as well.\n\nFood is extremely limited to a small selection of pies 5 on the day of my visit.  No gf ones but it is the place to come for whisky.", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 4, "date": "2015-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B9p4cnBr3YPedWA8Gh104Q", "review_id": "sIuigjod9zHXZw1zg5rJeg", "text": "Busy at weekends but does have very good music playing and does very good deals on both food and drinks. Good place to start of the evening before heading of to George Street bars.", "business_id": "5v2WUEmIPU8jTmOQ9xhcGA", "stars": 3, "date": "2008-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "sfJP6W0E_JThj5eXLBd6pA", "review_id": "HPhmLMYP-QSxF_af9hk4Sg", "text": "This has become my local haunt for lunchtime goodness. I'm limited to commenting on the soup, which is without exception really good, and the morning rolls, which are excellent. But every time I make a pit stop here I always admire the tasty looking main courses and meals. \n\nThere is loads to choose from sandwich wise, and some seriously yummy looking cakes up for grabs too. Grab a loyalty card and rack up a freebie for every tenth spend. Nice! \n\nThere are a few tables to sit in at also, so if you want a wee sit down there's space to relax. \n\nBest part is probably the lovely, friendly staff. This place is always really busy, so I think it must be a local favourite.", "business_id": "VekKmagfcsfq0UOeX_7RPg", "stars": 4, "date": "2012-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XV6347X2iSGMb2gICfyXcA", "review_id": "VH7B7Q09j-bo187UExPflQ", "text": "After using this shower even walking through the worst of Scottish winters seems more apealling.\n\nI've witnessed a driver at the Gyle refuse to let a gay couple on the bus simply because they were holding hands, complaints were made but that driver is still to be seen on the buses large as life and twice as nasty.\n\nThe seating is often awful, so crampt that I have to sit angled with my knees poking into the walkway. How hard is it to apply some fabric freshener to the upholstry? I smelt nicer odours when our spetic tank backed up!\n\nI do wish the drivers would tak the care they are meant to and not speed off when a number of people are still climbing the stairs. On one occassion this happened and several of us got knocked flying and I received most colourful bruising as a result.\n\nEven as you try to escape one of their vehicles you are not safe. On one occassion the doors were closed without checking resulting in my arm getting trapped and the contents of my bags being smashed. This was caught on their cameras but I did not even get an apology.", "business_id": "9mW3X0VkQ61QWlJWWSGs7g", "stars": 1, "date": "2011-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AyRz7EWRPPyv957aHcgH_A", "review_id": "o5Sd3xHxq4MWDCnRmimVRg", "text": "I'll have to agree with David that the Hilton service here is not at all resemble worldwide hilton standards, however the service you get here is probably on the good side of what you'll get at other hiltons in the UK. There were some pretty terrible and mediocre level of service here. It's not bad service, it's more like a holiday inn attitude rather than an expected hilton attitude that you get from the staff. To me the majority of the staff just feels 'lazy' and doesnt really love their job. All in all, i enjoyed staying here. There are 2 buildings for this hotel, the Hilton building and the grosvenor biulding across the street, all belongning to the hotel and combine to 180+ rooms. The grosvenor is alot more run down and old thus a cheaper rate. The Hilton side is more up to date with modern decor and renovations. The rooms are nice and clean and offer and classy modern look. They're spacious and comfortable. The lobby and lounge also boast a great feel and atmosphere. The restaurant looks fantastic with the same new age touch in interior design but the food is lacking a bit. First night i had the chef recommended Pollack with capers sauce, although the fish was near perfeclty grilled, the sauce ruined it for me. The way they made the capers and cream sauce was not a good combination for the taste buds. It added a bitter and almost starchy taste to otherwise good fish. The next night i had the 8oz sirloin, what a steak. poor quality meat with horrible cooking technique. It seemed to be microwaved and then thrown on the grill for 10 seconds to put some marks on the outside. It was bland, dry, and unfresh. Then along came the desert sorbet, although i'd say it was more a ball of shaved ice than sorbet icecream, it seems the kitchen staff let it sit in the freezer for a few months over the expiry date and crystalized. Comfortable stay, but stay away from the food here. It's also not 'prime' location on the strip of downtown edinburgh, but its within a 20 min walking distance, not so bad.", "business_id": "e8wCD4XNCcxSeTSrAU6xLA", "stars": 3, "date": "2009-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JObj0AtxMfkzXc04-s2e8w", "review_id": "GSt2OZpY6_UJA1-OOIyINA", "text": "Front desk: slow, understaffed, and some do not know the IT systems. Avoid at all costs -- pro tip, they use the old magneto keycards, keep them away from EVERYTHING as they erase very easily, then you have to stand in line behind the tour group from Korea.\nPublic areas: need refurbishment\nRooms: redone ones are lovely, large (approx 350 ft^2), 12 foot ceilings, nice redone bathrooms with tile, quite good. Huge windows (8 foot double-hung) overlooking a garden in the back. BIg desk on which to work.\nServices: asking 60 quid for 5 days wifi. By comparison, you can get a very good package from Orange at the shop around the corner for 7.50, and since it is on your phone, you can just walk away. Plus, you can talk and text. The worst internet deal I've ever seen; you can get round this if you are a regular Hiltonian (affinity perk) or pay extra on your room.\nFood's pretty good (haggis for breakfast), room service takes 20 minutes.\nLocation: convenient for conventioneers.", "business_id": "e8wCD4XNCcxSeTSrAU6xLA", "stars": 2, "date": "2012-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "slJrbI92rtg04ybQmOiEcQ", "review_id": "UbsAwKv9OI-YEzt7lR13ZQ", "text": "Due to my job of traveling a lot, I have been to many Hilton locations worldwide so I have seen some of the best and the worst they have. This was an older property and although  some others have called it very tired and aged, I thought it had an old charm about it. Yes the room and bathroom was old but everything worked and it was very clean. Our room had a large vertical beam holding up the ceiling at the end of the bed but no matter. The room was actually quite large. The service at this location was very good and attentive not to mention friendly. Location was a little bit of a walk to Price street but not bad and the price was expected being moderate. I'd stay here again if possible.", "business_id": "e8wCD4XNCcxSeTSrAU6xLA", "stars": 4, "date": "2013-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mMYoZlzKIFYyr-kypUYQgw", "review_id": "e65ut4YcQ2IYJl6g6WmG_w", "text": "Stayed here 2 times before on company business. Each time is worse than the last. This time I walked out. \n\nThe smell of the room is what hit me first: an open sewer smell with a sad attempt to perfume it. The room was freezing cold as if the window were open - which it was. Presumably to try and get the stink out. The drapes were torn. The bed a dingy double, sagging in the middle. Stains on the carpet revealed a recent crime, and probably the source of the smell, but I wasn't about to bend down and find out. No way we could stay in that room. \n\nI returned to the front desk to complain. They were very apologetic, but alas the hotel was completely full and that was the last room ( for a good reason). We ended up going to another hotel. \n\nAs for others have mentioned, this hotel is old, noisy (slamming doors, creaky floors), small, and outright dismal. I'm done with it.", "business_id": "e8wCD4XNCcxSeTSrAU6xLA", "stars": 1, "date": "2015-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uTj9v9XjrCH1U2wMUFQTHg", "review_id": "aVi6yBHOV3MQXOXixrVasA", "text": "Small but very friendly bistro that specialises in the sort of food you might have at home, but with a distinct upmarket twist. For example, their 'beer battered cod' with chips is no ordinary fish and chips, but a succulent chunk of top quality cod accompanied by superb hand cut chips.\n\n\n I have lunch here several times a month, and pre-theatre dinners too, and keep coming back. The menu is short, but all the better for it, as you know it will be freshly made, and not hauled out of a freezer.\n\n\n Very friendly service from the proprietor, Roland, who serves all the customers single-handed with great efficiency.\n\n\n The wine list has recently become rather pricey, and the coffee is rather ordinary but plentiful, as he will top up your cup with free refills.\n\n\n At busy times, such as during the Festival and the Christmas season, booking is essential.", "business_id": "UmOeVhicD3cTepEDC6p4jw", "stars": 5, "date": "2009-11-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "kufqCcUhbXfmXiwbF47wRg", "review_id": "j_4dwgZ2UCt0xLBSwYTF6w", "text": "I popped in here with my partner on our anniversary tour of Scotland. Honestly - it is the friendliest pub we have been to so far in Edinburgh. \n\nWe were early on a Saturday night and stopped in b/c I had recognized it from searching gay friendly pubs online. We were very pleased with the bartenders and beer prices and will stop back in before we leave the country. \n\nGood mix of people and age groups - friendly staff, good atmosphere. Really good time (minus the one Really drunk guy  - but that happens)", "business_id": "Rphay8MhjPIGMcSVVucB8w", "stars": 4, "date": "2012-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NGLOgDMuhMx-XFUaUw7o_g", "review_id": "lHoGYn1fqjInG74O0WaB9A", "text": "So this is an LGBT friendly bar we hit on our merry tour of Edinburgh.  As you walk in its set up on two levels with the bar and a little seating downstaris and further seating upstairs.  The staff were lovely if a little slow with our drinks but the choice wasnt the best for spirits.  They had to search for a dark rum and i can only guess its not something thats ordered much as they only had ovd.  Im not picky and soon had many of these.  \n\nThe place has a tired feel to it and could do with an uplift but is clean and ha da good sound system.  The drinks were pretty cheap and the staff were lovely, even charging one of our parties phones behind the bar for them.  Id happily go here again as the atmosphere was really nice, had a good buzz about it and seemed quite fun.  The plus points are the bar staff, the friendliness of the punters and the price of the drinks.  The bad points are the toilets (you go down a back stair to gvet to them, dangerous when drunk lol) and the range of alcohol.\n\nGood middle of the night pub to get you stocked up before you ehad off to your final place of the night.", "business_id": "Rphay8MhjPIGMcSVVucB8w", "stars": 3, "date": "2015-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "TagBtzWc8YsEpRY9fL3WVA", "review_id": "HKe-QOyO3l2e2VAa-nONUQ", "text": "We were drawn into this place by its attractiveness and a signboard offering a pre-theater dinner at a very reasonable price.  There were some glitches: The waitress did not know that they offered local beers, but on the other hand she was nice enough to ask one of the other staff so I ended up with what I wanted.  The green beans in the side dish were overcooked.  But the meat and the fish were excellent, and we got a good value for our money in very attractive surroundings.  I would definitely recommend this place, but be aware that the wonderful atmosphere leads you to expect perfection from the food, and what we experienced was just a teeny notch below that.", "business_id": "WN2QUFWxIiTtUgW-oczrQg", "stars": 4, "date": "2011-09-07", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "V82uNi4U5NNWkvdgj0AfsA", "review_id": "FckM7MTjvkDr2q4NYesPKQ", "text": "The best dinner we had and on our recent trip to Edinburgh and we had some good ones. This intimate restaurant fills up quickly because everyone there from the out-of-towners like us as well as the locals get to enjoy the food that is prepared with care. Definitely call ahead to get a booking. You'll risk waiting awhile or not getting a table at all just dropping in. They take children which was a plus for us.", "business_id": "WN2QUFWxIiTtUgW-oczrQg", "stars": 5, "date": "2012-09-24", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "gfD4mXz1mDvUpK2Lk1J1Nw", "review_id": "rrvDQOobuS9S9Iqa2mQCbQ", "text": "This place had been on my radar for a while but for some reason the name put me off. I associate cafés with coffee and cake rather than a hearty lunch on a rainy Sunday. But when I looked in the window and saw the sophisticated interior, I suspected they had more to offer. A quick check on Yelp revealed a 5-star rating so we knew we were in safe hands.\n\nIt turns out that the simple name conceals a classy French bistro serving a short menu of elegant dishes. The menu is hand-written and simple, with about five starters and the same number of mains to choose from. The wine list is reasonable and bread and water at the table on arrival just add to the experience.\n\nWe shared some grilled goats cheese with apple, salad and hazelnuts to start - simple and delicious, classic French grub. Gillian's sea bream main course was excellent but I really lucked out with my choice: lamb rump with polenta, cherry tomatoes and salsa verde. See the photo to drool over this delicious dish, its stylish presentation suggesting a much more expensive restaurant. Two large pieces of lamb, grilled to perfection, crunchy yet creamy polenta, and they bring steamed vegetables on the side at no extra cost. \n\nWith a glass of wine each and tea/coffee, the total bill was only £32. The interior is stylish but comfortable, the food is simple, classic, unfussy French food done well. It's difficult to think of anything they could do better.", "business_id": "WN2QUFWxIiTtUgW-oczrQg", "stars": 5, "date": "2012-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dMNex88xg0EsAda_O7Jphg", "review_id": "x4rBNLQ_Is7hX2oXI6JJjA", "text": "I have to say that I was quite smitten by this place... after a failed attempt one weekend to \"pop in\" it was clear a reservation is a must on most busy evenings... armed with this knowledge I came back a few weekends later with a friend to see what all of the fuss was about.\n\nI believe the menu changes over time, but we didn't even make it to the mains on this occasion... what we did do is order every single starter, and I mean every single one... that is not an exaggerated statement, and I think we actually ordered two of one.  The mains looked great as they went by to others, and I remember a whole cooked fish of some sort that looked fantastic, but we couldn't decide on starters as they all sounded too good... luckily the waitress was quite nice and happy to oblige us with our mini on request buffet... to be honest I was a bit worried about it because the place seems \"fancy\" to a commoner like me, but the worry was unfounded. \n\nThe standout starter for me was the \"Hand Dived Scallop with Garlic & Pernod Butter, Toasted Almonds\"... come to think of it, I have no idea what a \"pernod\" is... but the dang thing was delicious!  I made a note to order a scallop anytime it's on the menu here.  I also really like the \"Parma Ham with Salami served with Homemade Russian Salad\"... think parma ham and salami on top of potato salad and you'll get the idea, odd sounding, but tasty.  Their \"Gazpacho topped with Parma Ham & Olive Oil\" was a treat as well, a bit different than I have had elsewhere, but that seems to be the norm with restaurant made gazpacho... I certainly wouldn't hesitate to order it again.\n\nThe only starter I didn't really love was the \"Salmon Carpaccio with Soya & Sesame Dressing, Chilli, Spring Onions, & Coriander\"... but, to be fair, I'm not a huge fan of most types of salmon, gravlax being the exception.  It's not that I wouldn't recommend it to someone that liked the sound of it, don't get me wrong, it was just such a good showing for the other starters on this particular night.\n\nThe hidden joy about having a bunch of starters between two people is that there's room for dessert!  Well, at most places... I guess that highlights that the starter portions weren't huge here, but definitely starter appropriate.  For desert we split a \"Frangipane Tart\", and as someone new to such a dessert was pleasantly surprised... it had a great texture and just the right level of sweetness.  \n\nUnfortunately I can't remember the cost of our little adventure, but I know it wasn't bad despite all of the dishes ordered.\n\nAll in all this is one of the places that I would like to take friends visiting Edinburgh, assuming they have had enough time to try some local stuff of course, and I'm personally hoping to get back soon... I might even try I main if I'm daring enough, but I certainly wouldn't be mad at myself if I went all starters again. ;-)", "business_id": "WN2QUFWxIiTtUgW-oczrQg", "stars": 5, "date": "2013-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5jkmbSOaVAIk8KsVWgIFdA", "review_id": "QsnP8rc3Mi7rM6OldsHQQw", "text": "Modern presentations of classic french fare. Hearty portions as well (you're in Scotland). Small restaurant with quaint decor and staffed with some very friendly folks. This was my dinner after a long day of travel and a battle with jet lag and it pretty much hit the spot. Pate. Lamb. Decent wine list.", "business_id": "WN2QUFWxIiTtUgW-oczrQg", "stars": 4, "date": "2014-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EVxbI_iKt2JcognQJS8EcA", "review_id": "Af3mqD-hWIpahvAqblmf6w", "text": "After a great experience just down the street I was ready for another excellent restaurant in Edinburgh. Unfortunately, nothing really clicked here for me. The presentation was nice for my fish plate, but the side bowl of veggies was just pure laziness. I only finished my soup out of principle. \n\nSome people next to me had meat dishes and those looked good.", "business_id": "WN2QUFWxIiTtUgW-oczrQg", "stars": 3, "date": "2014-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uGrEoSMEtFGrwVPhWrDzQg", "review_id": "JyeIzl0d1bmcMeU2nG5f5A", "text": "Just a fantastic dining experience.  Small,  intimate room, fantastic food, very nice wait stsff. I'd like to see a bigger wine list.  But for 2-4 people,  either work or socializing,  it's just a great venue.", "business_id": "WN2QUFWxIiTtUgW-oczrQg", "stars": 5, "date": "2014-09-22", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "MabZWiZuw442YqrfIWj3NA", "review_id": "oiwaaD5K-jFmbSUhTWH2Bg", "text": "After returning home after a 3 week vacation I can confidently say this was one of the best meals we had while we were traveling. While not the most adventurous of eaters, I ordered the steak with mushroom sauce and the hubby had the duck. Both were cooked fantastically, and served with the best veggie and potato sides. Everything tasted so simple and fresh, I wanted to come back again and again. For dessert we each had white chocolate blueberry cheesecake and despite being stuffed, we finished every last bite. This place is a MUST visit!", "business_id": "WN2QUFWxIiTtUgW-oczrQg", "stars": 5, "date": "2014-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "KdUZomMtmpsT8u4MJAEGZA", "review_id": "z9bCwDXbh0lBna9EEvp9UA", "text": "The best French restaurant in town. I am French so hopefully that will reinforce the previous statement but may I had I used to work there and am totally unbiased about this place. Yes I might not have agreed with the employers on many different aspect, one thing I would never argue is the quality of the food served. The meat, vegetables and fishes are all freshly delivered daily which explains why the menus are always hand written and changes regularly. The prices are reasonable and they have desserts to die for. Go for the baked honey and vanilla cheesecake for pure decadence or their unbeatable sticky toffee pudding. The place is small but it is adding to the rustic look, my advice would be to book well in advance and don't book table of more than 5 people to avoid being crammed in. One negative from me, the chef has limited options for vegetarians so if you don't eat fish or meat you may want to avoid as you may get a boring risotto as an alternative.", "business_id": "WN2QUFWxIiTtUgW-oczrQg", "stars": 5, "date": "2015-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gvHjyuCo25MgpRTWiMqBxA", "review_id": "bQSxyoENpy60dBYGkroHfw", "text": "This is an awesome French Restaurant. If you're on the fence and wondering if you should eat here, stop thinking and do it. I started with fish broth soup that was served with my favorite sauce in the world - Rouille!  Smear some on the crusty bread and float it in the soup and you'll wonder how you're parents could be so cruel as to not give it to you in bottle form. Wife also had a delicious blue cheese soufflé salad. The next course was another favorite, Cassoulet. So good! Again, So Good! This is French food done right. Yes, I love this little restaurant.", "business_id": "IImme8H_HNUNNbPeTQwT_Q", "stars": 5, "date": "2014-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "lKKNoVPM8DYstCRBUc5bxQ", "review_id": "NKd6wTCr1PHNZb8EYi-s7A", "text": "Apparently La Garrigue is an Edinburgh institution but as I've lived in Glasgow for the last hmmhmm years I'd not heard of it before.  The restaurant is very, very French, right down to the ladies loo with it's odd saloon swing doors (thankfully there is an outer lockable door).  All the staff we encountered were authentically French but despite that very friendly and helpful.  Vibrant colourful paintings of the owner's home village hang on the walls.\nThe reasonable fixed price lunch menu was suitably interesante and I started with rabbit rillettes with celeriac and carrot salad followed by sea bream wrapped in smoked swordfish with mussels and puy lentils.  I'd never tried fish with lentils before but it was delicious as the smoky fish stood up well to the robust puy lentilles. A classic chocolate mousse with mint cream completed the experience.\nThere is a well curated wine list with several available by the glass.\nHolding back the final star is a bit mean of me - I enjoyed the food, the room was comfortable, the service was good, the bread was excellent but somehow it all felt a bit too safe and didn't blow my socks off.", "business_id": "IImme8H_HNUNNbPeTQwT_Q", "stars": 4, "date": "2015-11-25", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "tZs84cKAUSOtP_nAiSdreQ", "review_id": "CI8lBya6Ie1d7egvOMGDZA", "text": "Second visit to this restaurant. First visit was a little underwhelming but I was willing to give it a second chance. Wrong. They were busy enough and they have many 'regular' visitors that are being treated as family. This enthusiasm was however not reserved for our group of 9. Our table (like the first time) was crammed and our number 9 seat was squeezed at the end. Service is on a familiar basis and a little too much on the miss side an lesser on the hit side. Granted our payable drinks were served promptly, but we had request jugs of water twice before they were actually served. \nThe starter I took was the prosciutto and melon - the melon was tough. The prosciutto was very good. Main course was Spag Carbonara - to which I added mushrooms and that was made very well and good and creamy - I really enjoyed that! Once that was finished we waited - table cleared and.. waited. Until one of our group requested a dessert menu from a flyby waiter. no no no .. we should be offered not asked for! - I ordered a banasplit (as you don't get that very often these days) in my experience a banana split is vanilla ice cream, nuts, banana and chocolate sauce. - or if you will a dame blanche with banana. Anyhow.. we were served a very colourful plate of 3 different flavoured ice-creams (vanilla, strawberry, chocolate) - some green colouring and a variety of fruits that DO NOT BELONG in a banana split. I did not ask for figs, kiwis, pineapple nor green apple. This is NOT a fruit punch cocktail. Coffee was served but no cookie or chocolates. (which we did got the first time I was there - so no consistency. In the meanwhile the place was packing up and somehow we were left, forgotten? Several times we requested the bill which eventually came. Nice of them to separate food & drinks - made the calculations easier. \n\nI have now vowed not to go there any time soon, as for the monies paid I could have had a much better experience in another establishment", "business_id": "Yly8lmMDbqqznWJxpez2hA", "stars": 2, "date": "2012-11-16", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 3}, "user_id": "fywLB4coGY9eyHOpPSvGsA", "review_id": "z0pBaUuln_AakLNSGYygdQ", "text": "I went there for an afternoon pint with a mate and was pleasantly surprised to see A RECORD PLAYER.\n\nYes a good old 33rpm record player that anyone can use and play music on. They have a decent selection of 70s/80s music, but you can also bring your own records, or come into have a play with your newly purchased vinyls from the nearby \"Unknown Pleasures\".\n\nFancy. The bar has a good selection of ales and the staff are friendly, too.", "business_id": "01lSqf42wyNaiEmNgIrutg", "stars": 4, "date": "2012-10-17", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "YMiyQZPapCLaykDIzQ2GRw", "review_id": "LhX903VvuAvQ8OWeLFNOGw", "text": "My first meal in Edinburgh, and you set the bar fairly high.  We had gotten in fairly late, so we traveled into Edinburgh just to walk around and get food.  This was one of the food places we looked at, and agreed that there was definitely items on the menu worth eating.\n\nI had the Venison Casserole, along with a Scottish ale (No.3 I think ... it was part of the UK beer festival occurring at so many bars during this trip).  It was tender, and it wasn't gamey at all.  My friend had the Scottish Salmon Taglietelle, which I tried and was quite impressed by, as Salmon is not one of favorite fishes, unless smoked or as sushi.\n\nWish I had known about the Record player there ... love Vinyl, and would've played one of the records.\n\nI would go back again if I'm here.  Good food and good staff will always bring people back.", "business_id": "01lSqf42wyNaiEmNgIrutg", "stars": 4, "date": "2012-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b36A6NSiLeIlOkgFGp9CrA", "review_id": "u1hkIcOZZpYLYTdHaRD7JQ", "text": "The Camera Obscura bit is a show that is at the top of the tower that the attraction is located in. Its basically a very simple device that uses lights and mirrors to project an image on to a paper/wall/flat surface. In this case the image was a view over Edinburgh. The other floors in the buildings is dedicated to Optical illusions including funny mirrors, optical illusion pictures, holograms, those 3-D pics that used to frustrate and were all the rage about 12 years ago, etc. You can also do all sort of things like merge your photo with your friend and see what a person would look like with your forehead and nose and your friend's eyes and mouth. Because the nature of it is interactive it engages your senses and imagination. Good fun for all not just the kids and therefore I can safely say that it was my favourite attraction! Oh - good vantage points for spying on people too!", "business_id": "-UwZsTF1q2xaSm4bI_Azqw", "stars": 4, "date": "2008-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ctLGrdAXvVy64OHvxNg3QQ", "review_id": "qLxSF54hJ-KJnIkpuDZMzw", "text": "Fun afternoon out. Really interesting. Well worth it. Great views of the city", "business_id": "-UwZsTF1q2xaSm4bI_Azqw", "stars": 4, "date": "2012-09-05", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "YwwdbliJQkau_USNEHC3Mg", "review_id": "klVTcxK6HZsRs5Iz5iIAWw", "text": "I kept seeing this place as we walked by it in Edinburgh, and I managed to convince the other half we should go. I'm glad we did! (And he is too!)\n\nIt seems a bit cheesy at first, and we had a show with the camera obscura about twenty minutes after we bought our tickets. We started checking out the stuff on the second floor (as you have to climb up to the fifth floor for the show!) beforehand. It's full of those really cool optical illusion-y things I loved as a kid (and still do I'm afraid). Stereograms and 3D images abound!\n\nThe actual camera obscura show isn't the highlight of the place, that's for sure. It's kind of cool though to see how they make an image on a rounded table using only three lenses and a mirror. They also show you a bit of Edinburgh and tell you bits of history (whether they're true or not is another story). The rooftop also gives good views of the city.\n\nThe hands on activities were quite fun. We enjoyed taking pictures in the room that makes people look giant sized or tiny compared to each other! Also I have a photo of the other half with his head on a plate. \n\nWe had such a good time, we bought a few things from the gift shop on the way out. Something for home, and something as a gift for a friend back in Alaska for Christmas. I definitely enjoyed it, and it was well worth the price of admission.", "business_id": "-UwZsTF1q2xaSm4bI_Azqw", "stars": 5, "date": "2012-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "pWN5qUExm_SA5iM_78QD7w", "review_id": "K-lRrF8372lbGE4zCvt24w", "text": "Fun Fun Fun!!!......\nCost £11-12 for an adult admission, but a great way to spend a few hours!! It will\nbring the child out in you!", "business_id": "-UwZsTF1q2xaSm4bI_Azqw", "stars": 4, "date": "2012-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rcnxJ6HQOFrznw2KlsfY7A", "review_id": "4BgBk5k_SG6Dm5ojWB3igQ", "text": "Boring for adults. Totally not worth 13£. The only bit i liked was the room of mirrors. It got so repetitive and uninteresting after a while that we walked past the exhibits without even bothering to try them out. A lot of the same optical illusion stuff that you ought to have seen before. The worst part was the last 15 mins show. I felt like i was back at the university attending a boring class that i couldn't escape. The projection was so dark that i couldn't see anything that was showing on the screen. The guy presenting was extremely annoying. He kept insisting that people laugh and appreciate his lousy jokes. I am surprised why people have rated it so good. Giving the 2 stars for the mirror room and some beautiful light effects. Don't go if you are not thrilled by optical illusions.", "business_id": "-UwZsTF1q2xaSm4bI_Azqw", "stars": 2, "date": "2014-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ImnHLkTlqLzMOFogauvgEg", "review_id": "b8UHF-AaXHmzDtLc_-tFSg", "text": "On a vraiment apprécié notre visite a la Camera Obscura ! Le musée est très interactif on peut tout touché et s'amuser avec tout ! Tout les effets d'optique rencontrés sont géniaux ! On a même eu droit à notre visite de la Camera Obscura tout seul avec la guide !", "business_id": "-UwZsTF1q2xaSm4bI_Azqw", "stars": 5, "date": "2014-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sPapc_wKzAKUfY2Uul48vw", "review_id": "RdwTFPt-Q-jQUGMWfM4E8A", "text": "Probably the most fun we had whilst on our trip to Edinburgh!\n\nThis place is fantastic for children and adults alike, it really lets the big kid inside of you out. Every floor of the museum is packed with fun and quirky things to do and see, you could literally spend hours upon hours fiddling with everything. My fiancé and I went and had a really good laugh - it was like our childhood had been revived.\n\nMy only quibble is the price - if you were to go as a family it would really hit your pocket. But that said it is really worth a visit. I think children would love this place! I highly recommend, definitely a must see. Also the views from the top are breath taking!\n\nPlease note this museum is not wheelchair/disabled friendly. There are a lot of stairs and no lift.", "business_id": "-UwZsTF1q2xaSm4bI_Azqw", "stars": 5, "date": "2015-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "9VontjCoxNY5V3Uktby39w", "review_id": "sSo6CABskg0ehmhxodSCMQ", "text": "Played tourist things when I first came to Edinburgh and was pleasantly surprised as right it might just be enjoyable for kids. The Camera Obscura show wasn't as good because the visuals weren't clear and it was dark, perhaps due to the angle and the crowd and guide seemed a bit rude -  guide had little patience when someone talked over her the first time and then someone in the crowd pipped up rudely telling the person to \"act properly or leave\". Then chattering was fine later on so it seemed peculiar!  It's good for tourists as the guide points out some landmarks such as the Pentlands,  Arthur's Seat Calton Hill and the Scott Monument.  and touches on some practices that being the past alive like the calling of \"Garde Loo!\" forming the sewage filled lake which is now Princes Gardens. \n\nGreat views from the top,  lots of interesting illusions,  mirrors and whacky participatory things to do so kids (and adults) will love it! My favourites were the maze of mirrors and the twirly bridge at the end and always give it another go bit would avoid if you're prone to nausea & dizziness!", "business_id": "-UwZsTF1q2xaSm4bI_Azqw", "stars": 5, "date": "2015-11-25", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "Hyd9alOhZmXSgCwt2qzfvg", "review_id": "wt0hemKQc3KM90kNgDeaUA", "text": "All the reviews so far have been by straight girls. So I thought I'd try to redress the balance.\n\nI come not to praise CCs, but to right a few errors. Stephanie said she didn't realise it was a gay bar. Situated in the heart of Edinburgh's gay district this place doesn't look gay, it screams gay in your face til your eyes go rainbow. \n\nAlso apologies for gay couples snogging so openly inside a gay club, but you can experience much worse in CCs and I have. This is a cheesy, trashy place, you go after having been to several other places. It can be a bad idea at the end of the night or a good idea that is very much the beginning of the night.\n\nThere's no cover charge, the drinks prices aren't bad for a club, but don't spend too long at the bar there's no great selection and you really need to get on one of the two dance floors and start making eye contact or avoiding it. It is it's own worst enemy as since meeting someone there last year, we've barely been back.", "business_id": "lSIyCvaWZl-Ex9y3r2nDPg", "stars": 4, "date": "2010-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w7fMsfvBAo3346Sj7LI-8g", "review_id": "ffiQo-g-KFaHEYqoo6Q22g", "text": "Now, I've never been here but a few of my boozing buddies have. What I hear about the partying and music sounds real great. From what I've heard I can only say round 2 out of 5. I'd need some first hand experience for higher marks or a better review.", "business_id": "lSIyCvaWZl-Ex9y3r2nDPg", "stars": 2, "date": "2010-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kufqCcUhbXfmXiwbF47wRg", "review_id": "JX05dBZGYqurnXui6jpaoA", "text": "While visiting from the US we stopped in for a few drinks - and were ignored. The bar was virtually empty, maybe 8 guests but it was early. We walked in, I said hello to the male bartender, he made complete eye contact and turned his back on us so we sat at a table. I finally had to walk up and ask the female bartender if they had table service or if we ordered from the bar. \n\nNot a friendly lot, really - and pretentious for no reason. I'll gladly spend my cash elsewhere during my stay in Edinburgh and would discourage other tourists from bothering to stop in here...unless you like being ignored and treated like a bother", "business_id": "lSIyCvaWZl-Ex9y3r2nDPg", "stars": 1, "date": "2012-10-20", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "_lmmIZeJTv8roWn8qU3oIQ", "review_id": "IahAxW3pakOIeelSYHahNA", "text": "CC Blooms, besides its main function as a host of scene club nights, is practically next door to the Playhouse and therefore ideally situated to serve a pre-show dinner menu to musical theatre enthusiasts. I'm aware that later in the evening it becomes an altogether different affair but since it also puts itself out there offering a pre-show dinner option we went for it. At £8 for two courses, how could we refuse?\n\nAfter I'd surprised my brother by waving a ticket to the Lion King in his face - thereby placing myself strongly in the running for the Sister Of The Year award - we decided to hop along there early and toast my award nomination with dinner. And, friends, it grieves me to report a slight fault in the proceedings...\n\nThe seriously cheap dinner deal offered on the blackboard outside was what had tempted us in, and the carrot and coriander soup starter was, admittedly, decent enough, served in a sweet little pot with nice bread on the side. However, it all fell apart when the mains arrived. I had spinach and ricotta ravioli, which normally gets me very excited  - but alas, I found that it was little different from something I could have bought from Tesco and blasted to temperature in my own miniature domestic radiation chamber. The waiter appeared little more energised by the whole process than the poor old pasta did and I can't blame him as the place was almost completely dead. Those of you who read my reviews frequently will know to fling your hands up in dramatic sympathy when I say this: we didn't stick around for dessert. *sigh* Yes, that Sister award might be slipping through my fingers...\n\nI'm sure this place is mighty fine at its primary objective, but they've got a nice place and a great location and so they could be doing a lot more to make the most of opportunities earlier in the evening.\n\nClosing irrelevant-yet-interesting fact: it's named for Bette Midler's character in Beaches, Cecilia Carol Bloom. Did you ever know..?", "business_id": "lSIyCvaWZl-Ex9y3r2nDPg", "stars": 2, "date": "2013-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UJJHfH1bCN19Id_Z49rCQQ", "review_id": "kVYcqxmZAhQ5lB6ORv2uuw", "text": "This restaurant/bar is 2 doors down from the Playhouse in Edinburgh.  I had seen it on the internet but as it was not doing any \"deals\" didn't pay much attention. Mistake. \nThe lighting is just right with well spaced tables at the front, booths across from the bar and funky stools and tables at the back. It is clearly a gay bar but not in your face and certainly not important.\nGot there at 12.30 and no one hassled us as we ate our slow way through the meal.  My friend has a throat difficulty and is a very, very slow eater but we were never made to feel we were taking up space they could use.\nService did get a trifle slow as it filled up, mostly with people going to see Jersey Boys and needing food quickly but staff were buzzing about doing their best.  Suited us as we had made sure we had plenty of time and needed space between courses.\nThe Pre Theatre 2 courses for £8 and 3 courses for £9 was ideal with lots of choices and good portions.  Soup was Tomato and Basil with a lovely thick slice of bloomer type bread and butter, followed by lasagne with garlic bread. The Aberdeen Angus lasagne had less meat than I usually like but lovely nonetheless and piping hot.    Friend had Red Thai chicken skewers with a fresh piece of lime and sweet chilli sauce, followed by Spinach and Ricotta Ravioli with garlic bread.  The plate was cold so the food cooled very quickly but was immediately taken away and heated with a smile and an apology.\nFriend managed a piece of Red Velvet Cake (baked fresh daily by the owner's sister) which had been saved for her when she noticed it was the last piece.  She asked for pouring cream and that was no problem.  I had a tiny piece and because it was cherry it was ok.  Friend was drooling over hers.\nCappuccino and a latte and a small glass of baby jelly beans to finish.  Lovely touch.\nWe really liked this place and our waiter, Brooke, was a joy.  Seems we amused him too which was nice to hear.\nWill return and recommend it.", "business_id": "lSIyCvaWZl-Ex9y3r2nDPg", "stars": 4, "date": "2014-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "NUCUzF4aE1U5gWD2e5e6jg", "review_id": "O-0K4usLem4qCneurVj47Q", "text": "Pleasant enough pop place with a generally kind staff. No complaints. Edinburgh doesn't have the largest gay scene, so one should be thankful for any establishment that caters.", "business_id": "lSIyCvaWZl-Ex9y3r2nDPg", "stars": 4, "date": "2015-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xTNGDNMZ_TgSCPBbaQ6tVA", "review_id": "YKt9b58hVX5FYlp1HU_R-g", "text": "Das Hotel ist \"okay\", wenn man keine großen Ansprüche hat. Zimmer sind sehr klein, Fenster extrem zügig (nicht im Winter reisen!) und die Einrichtung sehr abgewohnt. Das Frühstück sehr Schottisch, d.h. kein Wurst und Käse sondern Haggis, Bratwürstchen und Spiegeleier. \nFazit: Zu einem Schnäppchenpreis", "business_id": "EDEZNi_8fgQnQK7U98pCeA", "stars": 2, "date": "2010-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gqhL-ZofN840fq6N0ZaJZw", "review_id": "wPKBUogKYHaurhrGOl-r8A", "text": "I don't hand this out lightly.  This hotel was simply awesome...cool, fun, and clever.  Free scotch, marshmallow cookies, and awesome waters...TV behind the mirror, awesome showers, great location, charming, unique.\n\nRunning out of synonyms...they just got it right...and I am a hotel consultant so I know when it was done right.  Congrats G1 on a job well done.", "business_id": "EDEZNi_8fgQnQK7U98pCeA", "stars": 5, "date": "2013-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5xup0JWKGeq6hhoNTG2QGg", "review_id": "PXes6UCW4A7xrH9sIYnbcw", "text": "Really nice setting, beautiful decor, staff were lovely :) \nOnly had drinks with family so I am looking forward to trying out some food in the near future", "business_id": "EDEZNi_8fgQnQK7U98pCeA", "stars": 4, "date": "2015-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 3}, "user_id": "Ry_hy9B1LDhpTCLq3WEhNA", "review_id": "TkjIu1wH9L71chwnxxBzBw", "text": "Bam. Best falafel on the south side hands down. If you're the kind of person who finds themselves in Palmyra or Zenobia but is a bit underwhelmed (or even think they're pretty awesome) I challenge you to get down to The Nile Valley. It thoroughly owns. I don't know if they make their own or source them from somewhere more interesting that the same place all the usual falafel providers get it from, but it's SOOOOO GOOOOOD. \n\nThey also serve a whole bunch of delicious other wrap fillings, and they switch from cafe to restaurant at some point in the evening. I think it'd make a pretty cool alt date location from the more typical spots in town.", "business_id": "jgUtE_lFxqhMcG4ubWCQLg", "stars": 5, "date": "2015-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4r-Z4tfq1-mEL11IkGTfTQ", "review_id": "NpMFfz9L1qRhOsclT-jEEA", "text": "The food here is always amazing! Everyone who I asked about Nike Valley love it and love everything here! It's quick it's cheap it's delicious. \n\nThe dinner type food is also great! But lunch here is fantastic! A must come and eat. Not to mention the staff are amazing and oh so nice!", "business_id": "jgUtE_lFxqhMcG4ubWCQLg", "stars": 5, "date": "2015-11-20", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "LfnB4N7SVSAIPOM3If_kDA", "review_id": "qj1-lFyxdGyEmzmuzgRkmQ", "text": "I have been coming here for years now and it never fails to deliver. The food is amazing and I posting this too close to lunch time and I am too far away to be thinking about how good there sandwiches are.\n\nI always opt for the soup and a goats cheese/peppers bagette. The bagettes are rustic and the cheese peppers are a perfect combo to this.My friend always grabs a Croque Madame, whcih here is bechamel and cheese done over a grill. She is never a big eater so I always fall air to half... yep she is the perfect lunch companion! The coffee is the main reason I keep coming back large cups of americano with swaths of \"la crema\". They really know there food and drinks here. The couple that own the place are the nicest people you could meet. Thumbs up from me.", "business_id": "7jqK8QfIj5PN2HFKgDKBfw", "stars": 5, "date": "2012-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HdiWqcn-6SiBBDe2x_oGrQ", "review_id": "ISyvTFS6A5CpvOhrvDOl9Q", "text": "Wow, die Weihnachtsdeko ist der Hammer!!!\nSo etwas Übertriebenes in so einem schönen Gebäude habe ich selten gesehen. Selbst die Toiletten haben einen Weihnachtsbaum\n\n\n Das ehemalige Bankgebäude läd in der sehr schönen George Street, unweit der vielleicht etwas bekannteren, jedoch weniger netten Princess Street zu einer kleinen Pause zum Verweilen ein.\n\n\n Die Preise empfand ich für den eigentlich sehr noblen Rahmen relativ günstig, Cocktails für 7 Pfund, nichts zu Meckern.\n\n\n Ich hätte mir vielleicht ein wenig mehr Auswahl gewünscht, ansonsten war es wirklich ein Erlebnis.", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 5, "date": "2008-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gvCKuuAkH3dk7_kmqicJQQ", "review_id": "hsa3feGMWXPaCBb74MASGw", "text": "Have drunk here often, usually with my partner in crime after a meal out. Many nights where I can't quite remember exactly what I drunk - but it was good - all too good! Lots of Hendricks not so much mixer! Happy times!", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 4, "date": "2009-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WimGas8NvHRSiYzKM9o0vQ", "review_id": "AKFjkW7RjYmFUhPy-CVAcA", "text": "Can't rate the food because I didn't have any, but what an amazing bar! The Christmas decorations are breathtaking, the staff is very friendly, and for being as beautiful and centrally located as it is, alcohol prices were very reasonable. \n\nEspecially if you are traveling/passing through, take an hour or so to stop by this bar. You won't regret it!", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 5, "date": "2009-11-02", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "UTzpK0D8maxbXbnC8b3-dQ", "review_id": "NNJp9aZHzyA8OwLV9rPcLg", "text": "This review is regarding the Club Room in the Dome.\n\nWell, I went here with a friend of mine and both of us were casually but neatly attired. This didn't seem to be a problem however, we were clearly younger then the expected crowd.\n\nNow, let me just say, this is one of the most gorgeous places I've ever had a half-pint in, I can tell you that much.\n\nThe central bar has a huge spinning elemant with an elephant on it, and the stained glass dome is amazing, however, it was a bit noisy for us so we popped into the club room.\n\nWe were greeted by a friendly gentleman who had us seated. Then, a weird thing happened. Our waitress was incredibly friendly, but the manager clearly thought we were not her preferred customer. (I was going to call for a clean up on aisle floor since the disdain was dripping from her face, but thought the better of it.) Now, we were really not shoddily attired, quite fashionably actually, but it was as if she could smell the \"student\" on us. (Even though one of us is not, that's the look she gave us).\n\nIt was such a mixed experience that I don't know what to think. I'm sure that if I came here on a date with someone, there'd be no problem. But somehow the manager really was incredibly bitchy. \nWe also had to ask for our bill twice.\n\nI like it here, but the place doesn't seem to like me back if you catch my drift.", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 2, "date": "2011-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "kDvKwCKOB96pVm4-f08_pg", "review_id": "r0Y-ixm4EHI9B9AYmWd50A", "text": "The wow factor is in the atmosphere - not the food or service. Well worth having a drink there, but only if you can get a seat.\nArchitecture, lighting and ambiance were all superb. The food and service fell far short of expectations. Wait staff reaching over us, impolite, unfriendly and indifferent. When asked for a recommendation between two entrees the waiter shrugged his shoulders and said \"they're both OK.\"\nNothing about the food at our table stood out and my party of 12 left disappointed. I had the chicken breast stuffed w haggis. The breast and accompanying mashed potatoes were average at best. For desert I had apple pie - it was good, but again only average.", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 3, "date": "2012-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "wuZeOi38z0HWx1uAfc3-8Q", "review_id": "oikvob_S_yEu2jrffGl4Xg", "text": "Here's one for the bigger outlets.\nWhen one goes into the building you can be overwhelmed by the opulence and obvious in your face glamour of the place. However this does not mean its all high prices and poor service.\n\nI had a very nice pot of coffee with a scone etc and my fellow business visitor also had a similar light tea from the extensive menu. It came to less than £10 and that included a service charge of 10%. Everything about the place was clean and attention was given by the staff to anything you asked for.\n\nDownside was the attitude to being offered a debit card for a bill less than £10 which only shows the owners have not checked around the market for less service charges on their merchant account (something I know a lot about).\n\nSo if you want flash along with good service when in central Edinburgh try this place. If you want higher prices in less clean and pleasant surroundings there's plenty to choose from near by.", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 4, "date": "2012-10-26", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "hWD_PTfJUXjIYb1UJ0wNFg", "review_id": "mbmxBbiYPFjY6wM1jRSJRw", "text": "It was friday night and Lou V and i were on the hunt for a bar we could get a nice drink at and be able to have a conversation without shouting at each other.  being near the george street area, i happily accepted her suggestion to head to The Dome as it was nearby and 4in stilleto heels don't allow me to walk overly far....\n\ni've only ever been to The Dome once before and this was to have a pre-dinner drink in the main bar.  however, upon entry I was quickly diverted to the left and into the Club Room which is a haven of class and quiet conversation.  we were shown a nice table right near the bar and promptly brought two glasses of water and a little dish of fancy prawn crackers while we looked over the menu.\n\nwe only ordered two drinks, a glass of prosseco for me and a margarita for Lou, but you would have thought we'd ordered a 5 couse dinner with the level of service and attention we got from the wait staff.  i think this is what really sets The Dome apart from other bars on george street.  you are treated like you're paying for an expensive meal even when you've only got one drink and we were never made to feel like we had to order more.  also they kept replenishing our little dish of prawn crackers even though we only got a refill on our water.\n\nand the atmosphere of the Club Room...just wow!  it's so incredibly different from any other bar i've been to in edinburgh.  it exudes rich decadence and old time class.  i absolutely loved it!  especially now that the place is totally decked out in christmas decorations, seriously it even smells like christmas with all the cinnamon sticks about.  this is literally the perfect place to get a few post dinner drinks, enjoy good conversation, and relax in the luxurious and festive atmosphere.  i'm already looking forward to going back!", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 4, "date": "2012-11-04", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "pWN5qUExm_SA5iM_78QD7w", "review_id": "1AluQPMKe4htigI2WRezsw", "text": "Love Love Love!\nWhat more can i say?!....... Well, let me start with the wonderful smell of mulled wine and cinnamon that hits you as soon as you walk in then to see the most spectacular entrance with a dazzling chandelier! The chrsitmas decorations thay have up are nothing but lovely and warming. We opted for cofffee, unfortunatley the Club Room was too busy but we got seats no problem on in The Georgian Tea Room on the 1st floor. We  ordered a latte and coffee, and recieved 2 little tasty mince pies free! Total spend £6!!\n Service was fantastic and to top it all off they had the snow machine on outside! Now my favourite place :)", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 5, "date": "2012-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DsDcvBq_3-TmUIXLhEB1GQ", "review_id": "wbb6lYZvyp3DJU28zQm9Gg", "text": "Lieu étonnant dans une ancienne banque. Déco de Noël impressionnante ! Rien que pour ça, c'est vraiment à essayer !", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 4, "date": "2012-11-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "tZs84cKAUSOtP_nAiSdreQ", "review_id": "hs7HIdxmsoLc0oRrn2MsiQ", "text": "Yes, the place to take your friends from abroad to show off some granduer of Edinburgh! I like the time around Christmas when they go all out and install the theme to the max. Decorated pillars outsite? Check! Massive tree in the main bar / restaurant? Check! Good atmosphere, friendly waiting staff and free nuts or haggisballs?! Check, check and check! It is a good place to start of your evening on George street (if a little expensive) You will be well impressed.", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 5, "date": "2012-11-18", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "2hadaoWYlGieNJt3Hz7_CQ", "review_id": "NJPvr6lyfmisS4Qt7G62ZQ", "text": "First time in the Dome and will be paying another visit soon, cannot rate highly enough such an amazing place at Xmas. Decorations are superb they have spent a lot of time and effort to get it looking this good, it even smells like Xmas due the amount of cinnamon sticks intertwined within the decorations. Never had time to dine but sampled a few cocktails and they were top notch, bit pricey but worth every penny for the atmosphere alone.", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 5, "date": "2012-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7ffNncatXdTpX1P9RI-A8Q", "review_id": "HUWpS3TesWPmQUKRbO0nrw", "text": "Made a reservation at the Dome based on all the good reviews and we were not disappointed.  The ambience is upscale with jazz music playing and a stellar former-bank dome overhead.  The  salads were nice.  The onion soup was terrific. The fish we had for dinner was cooked nicely.  Overall, the meal was very nice without killer prices.  Next time we are in Edinburgh we will return.", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 4, "date": "2013-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "-iybCAWa4QYOkTq0g2MnKQ", "review_id": "5AKL_ErP7QIR-s0mdNJSfg", "text": "Lovely cocktails in a nice relaxed atmosphere", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 4, "date": "2013-09-22", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "3P9Y7hKlLzbXjXn_vPqHgw", "review_id": "jA9ENdkUDiHzmjRjQ8k_6g", "text": "Beautiful place to have a cocktail in. I went there for a drink with friends whilst in Edinburgh. The drinks are quite expensive so wouldn't recommend going here all night. A round of drinks for 5 people (with one diet coke) was £17...not the cheapest but I  sure there are more expensive places in Edinburgh.\n\nThe main reason we went here were for the Xmas decorations. They are just spectacular. I know it is only Oct but they are a must see whilst in Edinburgh. The whole place smelled of Xmas too, gorgeous cinammon smell everywhere...not too over powerful, was just right. \n\nIt is a mixed crowd, with people of all ages in there. Everyone was really friendly and people gave us a heads up that were leaving so could get their table. The place does need more chairs and tables. There were empty tables but no chairs as people took the chairs as big crowd sitting round one table...bit annoying.", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 4, "date": "2013-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "KgMYkTMH9jXFKWAl7j8DNA", "review_id": "eAmIhiN_Q0ipL-ozfzgNvA", "text": "5 stars for the BEAUTIFUL Christmas decorations! Totally got us in the mood for the holiday season! \n\n3 stars for service- it was nice, but sloowwwwww. Our waitress actually forgot to bring the tea for our \"afternoon tea\"... Though, I was perfectly happy with my champagne, but still... \n\n4 stars for the delicious afternoon tea spread: smoked salmon & cream cheese, roast beef & horseradish, egg salad-my fav, and ham & mustard sandwiches, scones with jam and clotted or whipped cream, and cutesy little cakes and macarons on the top! Yum! It was so much and so filling, we couldn't even think about having dinner. \n\nIf you're thinking about a great holiday tea with your family or with the ladies, the dome is the best!", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 4, "date": "2013-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "E2qnvet6lDaJiHcU8e-k7A", "review_id": "luHHk7W_dNxDZWQj-oWejw", "text": "This is paradise for anyone who loves Christmas!  Their decorations are magnificent and it smells like happiness inside. Me and my boyfriend went there after being recommended and shared a club sandwich.  Sharing was a good idea since it was huge. We must go and try their afternoon tea,  we saw others who had it and it looked amazing!  Great place to take visitors!", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 4, "date": "2013-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "i1KQXj_sBAHgvhRRZK6azA", "review_id": "xX0X6oQbbuzBbnYr35i3EQ", "text": "Lovely wee bar on the Shore in Leith. Great atmosphere and friendly service. My pal's into his ales and reports a good and varied selection of guest ales here. The decor is busy with badges, currency from all over the world and lots of breweriana on display.\nIf the weather's good you can sit outside and watch the world go by.", "business_id": "MQo3FnweaE37sEDoG7hU5w", "stars": 4, "date": "2008-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "gfD4mXz1mDvUpK2Lk1J1Nw", "review_id": "kDKgEsIeKSa9odwIF20r9w", "text": "Another of my favourite traditional pubs. Located on the shore at Leith, surrounded by gastro pubs and Michelin-starred restaurants, it maintains its traditional pub interior, with brewery mirrors, real ale brand badges and hops decorating the walls. It has a fireplace going in winter, and it serves up to 8 real ales. It's low key, a bit scruffy (and the toilets are a bit shabby), it's worn in places, a real pub with character. \n\nI'm thankful that the Malt and Hops hasn't yet succumbed to the gastropubisation of Leith. Not that I have a problem with gastro pubs, but I don't want every pub to be one. Walking along the shore and looking at the menus in each pub is a sobering experience these days (or even looking for a place where you can get a seat if you're not eating a meal). So whether you're popping in for a quiet pint after a stroll along the shore, or you're settling in for a session on a Friday night, this is the perfect mix of local bar and welcoming pit stop. And did I mention they have hops on the walls? (ok they're fake. I think. But still! They're intertwined with fairy lights!) If you like traditional boozers, this is one of the best.", "business_id": "MQo3FnweaE37sEDoG7hU5w", "stars": 5, "date": "2011-11-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M4MVVzNPZHiJdnNvWjL8VQ", "review_id": "uZLEzmO9Y97U2W141Npu4A", "text": "No idea why it took me until the weekend just past to go for a drink here. Such a pleasant pub in terms of service, atmosphere, ales & music that I'm tempted to make it a regular Friday night pit-stop.", "business_id": "MQo3FnweaE37sEDoG7hU5w", "stars": 4, "date": "2012-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qIuvmwmuUeNPjdyp7a4aYA", "review_id": "Gocb_lI__CRHWTdQUObVfg", "text": "happened to live the manager of this bar through airbnb. So I try the beer here and feel interesting to see people standing while drinking. Scottish bars are brilliant.", "business_id": "MQo3FnweaE37sEDoG7hU5w", "stars": 4, "date": "2015-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "YslVzCJPQoeOwqnYduJlyQ", "review_id": "BfnHF_yOCseoIioeOkV_zQ", "text": "Great little theatre!\n\nSuper modern from the outside, all glass and shiny, the traditional theatre is a surprise! Beautiful detail, gorgeous red theatre curtain and velvety seats, it is clearly well maintained.\n\nI think there are plays, operas and even concerts held here and the acoustics were great and our stall seats had a great view. \n\nHad dinner and drinks before coming here so didn't buy anything else. Bar area is quite small so gets crowded quickly. Traditional style toilets that were clean but starting to get a bit overwhelmed with the demand.\n\nWould go and see things here again. Another lovely Edinburgh theatre.", "business_id": "0FlLe1SZKZqf5Tg9VK1-gQ", "stars": 4, "date": "2015-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S1dF-Y0s9BafAykxrPcaGA", "review_id": "axD3cUDV7DoN3BBelMqSqA", "text": "It may be a bit out of your way, but with the massive garden bar fully exposed to the afternoon sun, this is a great place to drink cider and soak up some UV. It is spacious, with two bar areas (one with large TV screen for watching your sport, and the other with a couple of comfy bench/couch seats) and of course the large outdoor space. When I last went, children were running around the garden, and the large umbrellas were up to shelter from the strong (yes, strong!) Edinburgh sun.\n\n\n The food is standard pub food, but delicious, and even when busy, is served quickly.", "business_id": "-Ub3g_uP6XqUtZwy5k8jPg", "stars": 4, "date": "2010-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zOnEGhcXDW0yz-P0Wg0l3w", "review_id": "mIz3aehuPvKws5TxmAS3iQ", "text": "Great staff, live music every night, not stuck up or stuffy, not as expensive as some pubs on the Royal Mile. You could do a LOT worse in Edinburgh. Especially if the wankiness of George Street just isn't your thing...", "business_id": "LrQlUZI63FLf6SjiiJbu5A", "stars": 5, "date": "2011-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LBMyNpMTrdauFbaFHJ1d0A", "review_id": "O8hJ72IztLOSvXotFC5jUg", "text": "Cracking boozer, staff all friendly and prices reasonable for city centre . You especially have to go when Acoustic David is playing . Guaranteed good banter n tunes", "business_id": "LrQlUZI63FLf6SjiiJbu5A", "stars": 5, "date": "2011-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "wsATQgOHIp1EFdLgdkwS6A", "review_id": "Z0SKTS4let-BY0exz6d-DA", "text": "My wife were there during the 2015 Fringe Festival, so everything was really crowded, but we did find a nice table upstairs. We really enjoyed our meal. I had  a Veggie Wellington Pie. My wife has the Fish and Chips. Both were really good, and the quantities very large. Service was prompt and friendly", "business_id": "LrQlUZI63FLf6SjiiJbu5A", "stars": 4, "date": "2015-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "pcuxCOaGfzbZjN52Rs394g", "review_id": "newzKpyfTPIJ4d6_bp0mug", "text": "I have been to this place twice, and both experiences were quite good.\nDuring week days they offer several meals for only £7.\n\nThe first time I went there the place was rather crowded, but still the service was quick. The food was delicious! My friend and I tried the sausages and the Highlands chicken. \nThe second time, we had mac and cheese and haggis. They were very good as well, but this time the service was slower despite the fact that the place was not as full as the first time I went there.\n\nIf you are on the Royal Mile looking for a nice, traditional pub to have lunch, this one is definitely worth going. Also, they have live music from 9 pm, which I'm sure is very nice!", "business_id": "LrQlUZI63FLf6SjiiJbu5A", "stars": 4, "date": "2015-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "YlpzPPySUxJsUJHRyRde8A", "review_id": "zacsDyUcY_xGtGgMwsC4Yg", "text": "I last visited Shakespeares probably about 10-15 years ago, a few boyfriends ago, a degree ago, a paint job ago. It's satisfying at least that I still can find the bathroom. It's not a place that will wow you, but for a quick drink as we were looking for, it fit the bill nicely. The food was better than expected, although the fish finger sandwich was more bread than fish, it was decent bread, so not terrible overall. The fish and chips was a plateful by the look of it too. It works as an after work quickie, but quickie it is, and equally unmemorable, but it has it's place, and probably a good reason why it has hung around for so long.", "business_id": "kzy5m93T7mbZJe9heq4PUA", "stars": 3, "date": "2013-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hBBsNczFacbbQDsTe9y9PQ", "review_id": "GJSk7XDYv09vMWvhCxjPvg", "text": "Food was almost tasteless, but cheap. The environment is fine, nice design, but service is almost inexistent. Cocktails are made out of pre-mixed convenience products. I probably won't come back.", "business_id": "kzy5m93T7mbZJe9heq4PUA", "stars": 2, "date": "2014-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4zbFNyiMxDY3GYmiGAW0Ag", "review_id": "mX2iNsOGo3vNrBYfm1w9sQ", "text": "This could be a bit unfair but...\nOkay pub but the price for two beers was absolutely ridiculous! £9.80!? I say unfair as my friend that now stays in centre of Edinburgh says that is standard for the centre, been in Edinburgh a lot and never been charged that much before unless I'm treating myself to a nice strong beer. Ale selection was pretty poor.", "business_id": "kzy5m93T7mbZJe9heq4PUA", "stars": 2, "date": "2015-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "c9_3dVhvO524ZI5RVwRLsg", "review_id": "jefkqPCo5dccLqgzyhKVRA", "text": "Great service, quality food, and quick turn around from order to serving!\nI came in on a Saturday and ordered 7-9 Tapas for 3 people, ample food. My top 3 choices were empanadas, potatoes, y the paella de carne. I suggest staying away from the American type food such as the wings and fried fish. The traditional sangria was a tasty treat!", "business_id": "9lF6-JrS2PvTkw9KVxn3Yg", "stars": 4, "date": "2012-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "NW9mFdWAJpw9ArnnyU37rQ", "review_id": "DU4sT562fvG-iw3mrZNnLg", "text": "My husband asked me to rank this hotel among the other high end hotels we have stayed in previously and there have been plenty, primarily in W Hotels. I rated this hotel #2 in the list, just behind the W in Washington, DC. The W only beat out this hotel because of its location, roof top bar, and general posh-ness of the hotel. The W DC is a place to be seen where this hotel is a place to go have a spa day and relax.\n\nThis hotel is incredible.  The service was incredible. The location is very good. The hotel was under a full renovation when we stayed and never once did we hear any construction noise. Sure, it was a mild annoyance to have to use specific elevators and pathways to get to our room as a portion of the hotel was closed for renovations but that minor annoyance was nothing in the big picture.\n\nWe had a king room with a view of the castle. The room was gigantic. The bathroom was swanky and modern. Everything was new. The rooms have wood floors which I thought was a very nice change from the standard. \n\nThe club lounge on the 7th floor was very nice as well. They could have done with a fireplace, better juices to mix with alcohol (ask the attendant and she can pretty much hook you up with anything you don't see on the counter), and better seating arrangements (more sitting tables instead of low side tables). The food in the lounge was a bit lacking as compared to the food at Hyatt or Hilton lounges but still sufficed.\n\nWe asked a member of staff when the renovations were expected to be complete (we knew that it should be end of 2011) and she said that they were hoping to be done early 2012. Again, I wouldn't let the construction woes put you off.\n\nThe hotel is located within walking distance to both train stations, Edinburgh castle, Edinburgh High Street, Starbucks, New Town, Old Town, George Street, Thistle Street, and all the other popular places in Edinburgh. We were in Edinburgh for 3 days and walked everywhere - never once took a taxi.\n\nWould definitely stay here again and would highly recommend. It was magnificent!", "business_id": "DIlh3Ta7-7tfjKL1apaYHw", "stars": 5, "date": "2011-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "3nWwai-6-kgH2wg9oeEPQA", "review_id": "tLu1YoanG6s8Jky4Nni23Q", "text": "I love the Sheraton!\n\nThanks to my Mum me and my family had to celebrate in style after placing a order on the \"dress of my dreams\" at Kavelle Bridal. We were in the Bar and had some drinks, Cocktails along with food from the Grazing Menu. \n\nFood is very nice, Haggis Truffles and the burger tasting platter. Had a lovely evening! Feel like going back tonight.\n\nRecommended to all x", "business_id": "DIlh3Ta7-7tfjKL1apaYHw", "stars": 5, "date": "2012-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "NKiVz6dkziFJPjTAENDl1Q", "review_id": "wa7ctO7US3vXn-MIZ1Cwow", "text": "The hotel is modern and clean. The staff are lovely and helpful. Location central \nRoom is fantastic and view of castle spectacular. Can't say enough about hotel and staff. Highly recommend", "business_id": "DIlh3Ta7-7tfjKL1apaYHw", "stars": 5, "date": "2013-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hBBsNczFacbbQDsTe9y9PQ", "review_id": "mvixpP9uwTnfd934rTHJ9Q", "text": "Very nice hotel for a Sheraton. Service is very good here and the rooms are fantastic. A truly luxurious place - but also the prices.\n\nI didn't like the lack of SPG recognition. Being a Platinum member, no word of it was mentioned during Check-in. No upgrade, no question whether breakfast or points. I did get Cub access, though. And the club is worth its name: They serve delicious afternoon snacks and drinks. Always a good spot to catch some interesting people.\n\nBreakfast in the main restaurant was good but far from excellent. A standard selection of things that didn't change over the course of one week!\n\nFood at the hotel restaurant was pretty standard, too. No surprises, and just what you would expect from \"hotel food\".", "business_id": "DIlh3Ta7-7tfjKL1apaYHw", "stars": 4, "date": "2014-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "C5RFKpMmCuWlewt2GHsscQ", "review_id": "uf_rR-scDLLSVoJ5KZBlOA", "text": "Very nice hotel and confortable rooms. The layout of the room is very practical because you can enter the bathroom from the bed or from the front door. The toilets are separated and there is a bathtub and a shower. The only negative point is that the hairdryer is located in the desk in the bedroom and is also attached to the desk. Not very practical when you are a woman.\nOtherwise fanstastic breakfast, come hungry. Their bar is good as well, for a last drink :)", "business_id": "DIlh3Ta7-7tfjKL1apaYHw", "stars": 4, "date": "2015-11-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "MQ1QQ8WVVAI3EZpMyP_6yg", "review_id": "EKU-BeTomStTzkHRySaXYg", "text": "Note to anyone who is reading this and thinking I have never heard/seen this place before........ check. it. out! I ended up here after a wee stroll round town this Saturday afternoon, now this place does have only a few seats so I wasn't expecting to get one, but I got a lovely stool by the window to watch the world go by.\n\nMain reason I am rating this place, the salads........ YUMMERS. I had a hot smoked trout, crayfish, creme fraiche and salsa salad, man alive was it heaven for my belly! Plus they are not stingy with the fish, which I was half expecting as it was only a fiver which seemed very reasonable. Another reason..... everywhere these days seems to do paninis, not that I have anything against that whatsoever, but it was nice to see something different. Instead of your usual toasted panini, they do toasted wraps, with a selection that sound devine! And I would imagine you can mix it up a little and choose your own. \n\nService was good, friendly and efficient. Nice, interesting interior, free newspapers and they have a specials board, always a bonus. I already have my eye on a toasted wrap with parma ham, mozzarella and pesto for next time!", "business_id": "mV2qIJvhYuHTI0_to25nrQ", "stars": 5, "date": "2011-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mcL8rap5hd0Vx-ZpM8bZmg", "review_id": "T3g2nHa647tLXn-Be3HpAg", "text": "I work from cafes so I see alot of different ones. The most important thing for me is fast internet and cool staff that don't give a shit about me being a bit of a weirdo.\n\nThe internet's ok, and the food's pretty good, but the staff are super nice and I love them. They gave me a free cinnamon bun at the end of the day that they were going to otherwise throw out. 5 fucking stars for free cinnamon buns.\n\nCome here and say hi. They're pretty cool characters.", "business_id": "mV2qIJvhYuHTI0_to25nrQ", "stars": 5, "date": "2015-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "i1KQXj_sBAHgvhRRZK6azA", "review_id": "C-9Ts-hlB-PrH8YZg6sjuw", "text": "The Mal is a sumptiously furnished and attractive dining destination by the Shore in Leith. Part of the Malmaison Hotel, the brasserie menu features a range of interesting and delicious dishes most of which feature local produce. A well appointed bar will supply just about anything you desire, from a range of champagnes to your favourite brand of cigar from the humidor.\nThe brasserie lunch menu, although somewhat abbreviated, still manages to offer a good range of tasty sandwiches and the like. The burgers are very good.", "business_id": "VErgzjUEsusmil_DR4IYbw", "stars": 5, "date": "2008-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "v6jG8hIrOnVYXVCb9SjJPA", "review_id": "q0IRLCWQDTpEYX1lez-PZA", "text": "I had a spectacular stay here. The Brasserie is first rate using local and sustainable beef and local fish. \nThe breakfast buffet is just outstanding with fresh cut fruits, homemade jams and, for an extra 2 pounds, you may add some hot options to your morning. \nThe amenities are what one would usually expect, but the decor is just delightful. Rooms were well appointed and comfortable.", "business_id": "VErgzjUEsusmil_DR4IYbw", "stars": 5, "date": "2010-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "yP7y53vQxxFBeTyEQjF-Bw", "review_id": "6AmHCktbslZV3bai0R3EgQ", "text": "We enjoyed our stay at this modern hotel in Leith.\n\nOur room was spacious and comfortable - quite stylish beyond the typical chain hotel.\n\nWe ate both breakfast and dinner there, thoroughly enjoying both. The salmon Benedict was particularly tasty.\n\nThe service was very good with a friendly and helpful staff.\n\nWhile the neighborhood has some nice restaurants and pubs, the hotel is 10-15 minutes taxi ride from the Castle and Royal Mile.", "business_id": "VErgzjUEsusmil_DR4IYbw", "stars": 4, "date": "2011-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "-ZtHkOGsagtYTsx0J8Trbw", "review_id": "5l20ZAbYhIBCUucXOJ15uQ", "text": "Never tire of this place. Food is to die for. Mixed fruit pavlova is a must. There are regularly deals from the usual coupon outlets and you can access these at the quiet times of year or the middle of the week. Last time we were in so was Ronan Keating! Clearly the man has good taste...", "business_id": "VErgzjUEsusmil_DR4IYbw", "stars": 5, "date": "2015-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "R5u8BBzho2JdmC0CVZEx8Q", "review_id": "A8kzpVu1hUTZuuG4ZEaE0Q", "text": "I beg to differ.  Had a very nice experience here.  I had the sea bass-- fresh herbs and lemon, nicely done.  Husband asked for a dish not on the menu and it was prepared just as he asked.  Also a nice panna cotta with good texture.  And good espresso.  Friendly service as well.", "business_id": "5pA0bK3x-8TWzWzbZRUJew", "stars": 3, "date": "2011-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "MaxaY-P91WjOtGViSLK99w", "review_id": "TL2i5VKhNaHJvcVUHPTQfQ", "text": "Have we lived in Europe for so long that our standards for Mexican food have dropped, or is Blue Parrot Cantina actually a good place to eat? I think it's the latter. The menu isn't extensive, but all the staples of a quality tex-mex place are there: burritos, enchiladas, chimichangas, and more. On our most recent visit we started with the black bean soup, which was well-spiced and interesting. I continued with a vegetable chimichanga, which was every bit as good as I remember the chimichangas at our regular Mexican haunt from my stateside childhood. The melted cheese was plentiful, which is exactly how I like it. \n\nThe margaritas were tasty but not quite the right consistency - too little time in the blender left them at this awkward stage that was neither frozen nor on the rocks. \n\nService was fast and friendly, and the food was obviously all prepared fresh in the small, open kitchen. The decor is simple yet appealing, and there's a certain coziness to this low-lit basement dining room.", "business_id": "nEM1MVODyaZCWOg7Cya4EQ", "stars": 4, "date": "2014-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "xazVwU4K_jSZu5rkDxyfgw", "review_id": "pi21EHwsuW9MSclxUq_tVA", "text": "Just a bar, nothing that great I'm afraid.", "business_id": "ZRYZBtiRjjYqA8ohMoRn-Q", "stars": 2, "date": "2012-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "sfJP6W0E_JThj5eXLBd6pA", "review_id": "RXZKsvKeLNoHgzOgwzH2sw", "text": "Ah, Wash Bar. Always the beacon of mediocrity. Look up \"meh\" in the dictionary and a photo of the Wash Bar awaits. \n\nWeirdly, it's been an Edinburgh staple for at least eight years, if not more. How is it still here?!!\n\nI've been a couple of times. Always a below average experience. The decor reeks of student and the food has a lot to answer for. I opted for a plate of nachos last visit (how can you get nachos wrong?!) and although I polished off the entire plate because I was absolutely STARVING it was a painful experience. \n\nApparently there's a good area you can book out for groups and events etc, so I think folk find this a useful addition to the bar. But going here for a drink and catch up? Ooft. There are so many better places nearby you can frequent instead. Don't do it to yourself!", "business_id": "ZRYZBtiRjjYqA8ohMoRn-Q", "stars": 2, "date": "2013-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "MQ1QQ8WVVAI3EZpMyP_6yg", "review_id": "1fLuFgvyU1v8FJiSDMfETA", "text": "Sigh. Ended  up going for lunch with some class mates after a very exciting lecture, there were about six of us so there were several different suggestions - Mine being Peter's Yard (I will go soon!!) but there were no takers and we ended up here. It is literally a two minute stroll from the university and apparently do a good breakfast.\n\nWe were really quite indecisive, but I must say the service still was not great. It was average. From what I could tell the one and only waitress was also making all the food - how is that ever going to be conducive to good service!?!? But the menu is extensive I will give them that, and I can see why you could be tempted to come when you need that little bit of breakfast grease to ease the hangover. Other than that I was not enthralled by what was on offer, it is just the usual. So I decided to have a chicken, chorizo and cheese panini and a strawberry milkshake. When me food arrived, I immediately recognised the potato wedges as these horrid frozen things they used to serve in a cafe I briefly worked in. They are just so salty, and taste processed and just not my cup of tea?! Panini was alright, a little dry, but I was hungry and it did the trick. Milkshake was nice and thick, but lacking a good strawberry flavour. \n\nSo, to sum up, this place is fine. It is average. I doubt I will return as the quality is a little lacking and I begrudged paying at the end. Never a good sign.", "business_id": "Z9NI8AJnZULUD_kQBXMKwg", "stars": 2, "date": "2011-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "i1KQXj_sBAHgvhRRZK6azA", "review_id": "MVm2RSWpAavTjDXPI6f8cg", "text": "Wonderful food, in a lovely setting. Great local produce used to prepare great dishes, presented without too much fuss. Service was great. The restaurant is beautiful too, old stone pillars and opulent decor, with plenty of nooks from which to watch other diners.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 5, "date": "2008-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_5Im2bb5oCFdXiop2CL7dQ", "review_id": "nZy9b-FqyGeenLvDwaH6Lw", "text": "The platter of Scottish seafood and crustacea ... exquisite ... there is nothing else to be said, but bon appetit.  When in Edinburgh, don't bypass the Witchery.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 4, "date": "2009-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1K4UBnRo6PkpMn5M7C5AAg", "review_id": "VPtz6esI3df3NK7ceO5guA", "text": "Lured here by Clarissa Dickson Wright's recommendation, I discovered a bewitching restaurant down a stone passageway near the Castle. Making a rez for later in the day, when I arrived I was directed downstairs where the Maitre d' awaited me. Placing me at a 2-top near the kitchen, he proffered menus and left me to read. What a great selection of foods and drinks! Sheer delight in reading the wine list while enjoying a perfect Grey Goose martini led to several small plates, oysters of couse, and a wine to match each small plate. Wonderful experience, right until I noticed a detail in the tapestry next to me that showed a dog about to lick its gaping a**hole!!!!WTF!!! Jarring to say the least. I laughed out loud and wished I brought some narrow black tape...very expensive meal and a good chuckle to boot. When I left the Maitre d' said he was envious of my meal and was quite warm. It's not often I drop USD $200 on a meal, but it's Homecoming year and I was in Edinburgh for one dinner and this was the best, hands down. Enjoy!", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 5, "date": "2009-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6Y8n_mrc9xNZYYD3PhM5cw", "review_id": "EriB5MRNngrFUjHL556IVA", "text": "The Witchery is my MOST favorite restaurant of all time in the entire world. When I visited Edinburgh for the first time, I decided to have dinner there on my first night--and I loved it so much as I decided to make reservations there again during my last night in Edinburgh!\n\nThe service is unmatched, the food is DELICIOUS, and the ambiance is \"fairytale-like.\" Dining in the Witchery makes one feel like living out a fantasy in a place that's a cross between a Braveheart castle and a Harry Potter novel. The stone floors and all-candlelight arrangement is so romantic and so lovely that you'll swoon while you're dining.\n\nMy meals included the stuffed chicken and the Loch Duart salmon. I started out with the foie gras (heavenly!) and my desserts included the Burnt Cambridge Cream and the Witchery Pudding Selection.\n\nSpecial thanks to the entire staff of the Witchery for 2 VERY memorable evenings!\n\nI am already planning my trip back next year...", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 5, "date": "2009-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "410eIzGhb5LWf3MArntZVg", "review_id": "vaQkdCqkrQQin8uxgvh27A", "text": "We came here during our trip to Edinburgh on recommendation from a tour book. I tried to make reservations for dinner but there were no tables open until 11 pm, so I had to settle for coming during lunch.\n\nI had their herb baked scallops with smoked Iberico pancetta and garlic, with a side of salad and mashed potatoes. The scallops were so tender and delicious. My boyfriend had the light lunch with duck egg florentine and pork sausages with a side of mashed potatoes. Initially I was worried it wouldn't be enough food, but their portions are huge. \n\nThey also have really good service. Overall a great dining experience.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 4, "date": "2009-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "wulP0LzE_oJx_b-7J3XEhg", "review_id": "8M25lSWhMZHHHuXftkmuRQ", "text": "Have eaten here three times now, in both of their dining rooms, and the place is an understated gem despite the opulence and hype.  The food has been superb each time and the locally-sourced ingredients highlight fresh and delicious Scottish influences while the kitchen clearly tries to bend international.  The guest rooms across the street are unique and a one-of-a-kind experience.  If you're in Edinburgh, want to be pampered, and don't mind wandering up by the Castle, check out the Witchery.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 5, "date": "2010-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RlrNLLP9ayRvcUFJF7LVAQ", "review_id": "TMnD8j33ohkeaiAnYI0Ngw", "text": "Wow, just wow. Don't eat here without ordering the steak tartare!", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 5, "date": "2010-10-27", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "SQ93ximbtY5QoHruVHfdqg", "review_id": "WPdHuWCE4uFlQyGD0Vgq7A", "text": "I'd heard only wonderful things about the Witchery and was in no way disappointed when I went here for dinner with my family. Even my Dad, a hard to please foodie, raved about the quality of the food.\n\nThe decor and ambience is unusual with a gothic feel and low lighting, however this created an intimate, relaxed atmosphere and it made us feel like we were escaping from the real world for a while. It would be a fab place to go on a date - the flattering lighting is an alternative to beer googles.\n\nWe all had the haggis starter and I've yet to have bad haggis but this really was extra tasty. I then had a generous fillet of salmon and it was ridiculously delicious. I eat salmon quite alot but this was by far the best I have ever had, I was going on about it for days. 'Remember that salmon... '\n\nI was too preoccupied with my life-changing salmon to really notice what my family were eating but I do remember my Dad thoroughly enjoy his faggots (yes, really). \n\nI'm a real sweet tooth but the main course I had (salmon, salmon, salmon) was very filling so that was the end of my Withchery culinary experience. This place is a real treat and worth every penny, the food and service were wonderful. They also had Molton Brown handwash in the ladies room, I like that sort of thing :)", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 5, "date": "2010-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kGZyHYYOEm-J1LA2CJvR_g", "review_id": "sRt_uO1096-A6L-kknhtaQ", "text": "So it was the boy and I's first time in Edinburgh and we were on a traveler's budget. I had read wonderful things about the Witchery's food and ambiance, but knew the dinner menu was way too pricey for us, so we decided to head over for the (much more reasonably priced) lunch one day instead.\n\nThe atmosphere is delightful, as other Yelpers have attested, and would make for an excellent special occasion meal (but suited us just fine for a nice lunch while in town). Service was flawless as you'd expect in such a place (although to be fair, it wasn't exactly packed as it was a weekday around 2), everyone was wicked friendly and every staff member who interacted with us was professional, kind, and very cheerful. Of note is the bartender who cared enough about his drinks/customers that he came over to discuss what kind of liquor to use in the boy's Manhattan (he recommended Whisky, which ended up being delicious, and was even the same price as the normal Manhattan, £8).\n\nIn a beautiful setting like this, often the food takes a back seat to the ambiance... but I'm happy to say we were quite pleased with the food (love love love the commitment to locally sourced ingredients!). The boy chose the reasonably priced (£15.95) 2 course prix fixe lunch with the pea and ham soup and the venison burger, and I deviated at the last minute and went with the pricer smoked grilled Scottish salmon on the normal menu (because really, if you're a fish eater and don't have salmon while in Scotland, you are definitely missing out). I was in heaven with my own meal, that salmon was soooo fresh and flavorful, with a nice smokey flavor and grilled perfectly, accompanied by delightful sweet potatoes and green beans. Totally worth the £21 splurge. The boy was similarly happy with his meal, the soup tasted like the peas were just shelled a few minutes before, and the venison burger had a great flavor (he especially liked the cranberry relish). Even the complimentary bread and butter were tasty (that butter was so fresh, mmm).\n\nAll in all, we had a great meal and would recommend it to anyone looking for a cool/romantic atmosphere and excellent food for lunch.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 4, "date": "2011-10-17", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "yP7y53vQxxFBeTyEQjF-Bw", "review_id": "ahEYUMEHpluVczqXdDhyKQ", "text": "A beautiful restaurant located in the shadow of Edinburgh Castle. Superb food and a nice atmosphere made for an enjoyable evening.\n\nTook a bit of a chance with venison in a chocolate sauce, but it really added a nice subtle flavor.\n\nThe bread pudding was also nicely done - even for a traditionalist like myself.\n\nThe service was very good - friendly and attentive.\n\nThe Witchery is well worth a night out.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 4, "date": "2011-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "PtgpOz-EOyKXaJtrjh4Wmg", "review_id": "Og92IpGp9bsg1x_vXxNhvw", "text": "I had really high hopes for this restaurant as it was recommend by many people familiar with this restaurant and my dining preferences.\n\nIt is a beautiful room, we ate in the older wooden section, simply called the Witchery Restaurant, rather than the Secret Garden(was worried about the weather),  \n\nReserved two weeks in advance online, could only procure 5:30 pm or 8:30 pm, and we wanted to eat early.  The restaurant did not really fill up until 7:00 pm, so I wonder why we couldn't have gotten 6:00 pm reservations.\n\nWe arrived early, and the kitchen did not open until 5:30 so we settled into a glass of white wine for my wife and a whisky for me....the Maitre D' rolled his eyes at us when we showed up.\n\nWhen we did order, I think my wife had the crab cocktail, I ordered the Smoked fish from the Inverawe smokehouse for £13.50($21.75 or so, US) this is Loch Etive trout with Isle of Mull crab crème fraîche, eel with pickled cucumber, andhot-smoked salmon with beetroot purée.  It was very tasty, and literally two bites of each....for over $20.00, I would have preferred three bites.\n\nFor dinner, I'm pretty sure that my wife had the scallops, I requested the Rump of Borders roe deer, £27.00($44.00 US) Pommes Anna, roast squash, purple fig, wild garlic and chocolate oil....I made it very clear to the Maitre D' who took our initial order that I wanted the deer MEDIUM, not rare, as it has been my experience that for some reason these days, chefs prefer to serve game, pork and duck on the rare side, which I find unreasonably chewy.  \n\nIt came out rare, and I sent it back, they took my wifes plate as well, which was very classy.  When it came back(about 10 minutes, right on time, afaic) it was delicious and my wife was EXTREMELY pleased with her dish.  I don't recall any amuse bouche.  For dessert, we shared a kick butt sampler, with about three items, they were all delicious and I had Armagnac to accompany it.\n\nWould I go back?  Yes....I would check out the Secret Garden, and I would be \"firmer\" in my requests.  I had also checked my umbrella upon arrival, and they did not offer it back to me and I forgot it, and had to purchase a new one upon returning home.\n\nFood was great, but definitely sized and priced to a European sensibility(smaller, expensive portions) and the service was lacking a bit.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 3, "date": "2012-09-15", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "dtDeiFwL_BO9KDgAyTo_-w", "review_id": "S7-nOf63RE3-9WrZ6nWpvQ", "text": "went for lunch. had the set menu. was reasonably priced and decent food. \n\nwhat made it for me was the surroundings. like eating in Henry VIII's court. chandeliers, table settings, tapestries, candles. beautiful.\n\na must for fine dining in edinburgh, even if its not 100% fine.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 4, "date": "2012-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "vn7VSEmT1mqJxzWpTKsREA", "review_id": "a3y6qxo0teTHWSHkBqxmUg", "text": "For a place with their reputation, the only acceptable review ought to be five stars, so the stars are theirs to lose. Thus this review will have a somewhat negative tone even though this was a very nice meal. Here are the two chief reasons I find it impossible to award them five stars: 1. The bread. It was nowhere close to the quality of bread I have had at much less reputable institutions. Is this what their mainstream clientele wants? I hope not, and thus they need to up the level of the bread significantly and it wouldn't even be difficult. 2. My daughter's scallops were served with a very nice tarragon sauce and nearly cold, unimpressive mashed potatoes. I have no problems with mashed potatoes, but even I can make better mashed potatoes, and serve it warm. (If this was truly the intention by the chef, then I guess we will just have to disagree on it being a good idea.) 3. This is a bit whiney but here we go: They were out of the vintage port wine by the glass and instead of corking up something else, they would only suggest that I go with the LBV instead. Nope. Not happening. But a true five star establishment would have opened some other bottle (or just make sure they don't run out).\nHaving said this, here are some things they get right: 1. Very impressive wine list. 2. Very nice interior. We were in the \"Secret Garden\", so if there is a next time, we will try the original dining room. 3. Great (though not perfect) service. 4. My main dish of monkfish was delicious, as was the cheese plate, and the chocolate tart.\nSo, if there is a second time, and I hope there will be, I expect them to have perfected their glitches and be a true five star experience.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 4, "date": "2012-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EjDSRC7TXkDN0y4evEimqg", "review_id": "cFqjCOENYHe9CeJwNSqW6g", "text": "The Witchery in Edinburgh\nWer in dieser Stadt ist und sich die Kritiken durchliest, kommt am Witchery nicht vorbei. Der erste Eindruck nobel, nett und mit Herz eingerichtet. \nDie Menueauswahl sehr verlockend, das Essen gut; die Weinauswahl international z. T. sehr expensive. Leider gibt es einen Punkteabzug bezügl. des Personals  eine gewisse Überheblichkeit kan man einzelnen Personen nicht absprechen. \nAber in Summe immer ein Besuch wert.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 3, "date": "2013-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DBi0o_FCmkvIRExH5XId2w", "review_id": "rQDhK4Ng3EOQpVILCVr0rg", "text": "Was looking forward to this place ever since we planned our trip to Edinburgh.  Food was exceptional, service was even better, and the ambiance is as good as it gets. Not the best dining experience I ever had, but close. Not to be missed in Edinburgh.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 5, "date": "2014-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "--4fX3LBeXoE88gDTK6TKQ", "review_id": "p1SSwvvf9i4yUXb45OrszA", "text": "As I've always wanted to go here, my fiancé surprised me by taking me the The Witchery for my birthday this evening. Maybe I came in with incredibly high expectations but I found that the hype of this place far outweighs what you get. I was not particularly impressed with any dish I received, to be completely honest. While the restaurant is not \"bad\" by any means, it seems as though it's coasting on a name, rather than the quality of the food. The Witchery seems to do food that is very classic, which is great if that's what you're looking for. However, I was expecting the classic food to have something which set it apart from other restaurants like it. In short, I saw nothing like that and was served a few fancy looking dishes that were not nearly the calibre of food I would expect from a place this \"legendary\" or in such a price point. I have eaten at several world class restaurants and have experienced better dishes at a fraction of the price in more cosmopolitan hubs (Vegas, NYC, etc). \n\nNot only that, but I found the service to be dismal overall. The servers were very kind but not attentive enough. I recognize that there can be a cultural divide between American (which I find far too hands on) and British service but this didn't even begin to straddle the line. We were left to our own devices with only a check in every half hour (if that). The last straw, which I'm not sure was intentional or not, was that I wasn't asked if i wanted my credit card charge to be in dollars or pounds. For most people this isn't a big deal, but I travel enough to know that establishments make extra money if one pays in foreign currency...I would think a place of this calibre would know exactly what they are doing when hey run something like that, which I find dishonest. \n\nThe Witchery gets extra points for acknowledging and doing something sweet for my birthday but overall, I'd recommend people look to other places in Edinburgh for great food. This place seems like a tourist trap that's lazy bc of their legacy. Personally, I felt it was a waste of money.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 2, "date": "2014-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 1}, "user_id": "HlsO3jpo5GbfrIBfqE7g9A", "review_id": "uyy3TJ7oTGE3b9cKW6qMLQ", "text": "If you check my history, you'll see I don't often give low reviews. 1 and 2 star reviews, for me, are reserved for when I think it's important to offer would be patrons a word or two of caution.\n\nWe chose The Witchery for its ambience and we were not disappointed. The restaurant has two sections, each with separate entrances and no connecting spaces (completely independent dining rooms with independent staff). One is the new section and the other is the historical section; make sure to request the historical side (much more beautiful). If the entire review were to be about ambience, then this would have been 4 stars, but it's not just about ambience.\n\nThe food portions were so small that we were both still hungry for dinner after we ate dinner. As a starter I ordered \"Scallops and Mussels with broad beans and chorizo\", what I received was roughly a dozen beans, 1 small scallop, 1 very small mussel (sans shell), and a single small slice of chorizo which was then cut into quarters (when I say \"slice\" I mean it was a single slice from a sausage. It was 2.5 centimeters (1 inch) in diameter,  1/2 centimeter (1/4 of an inch?) thick, and then reduced to 4 rounded triangles once quartered). It was a ridiculously small starter.\n\nFor the main course I ordered a white fish, but received salmon instead; not what I wanted. I would have sent the dish back, but by this time I was quite hungry. The fish was a reasonably sized portion, but bland in flavor and completely forgettable; I don't even remember how the bed of white rice was seasoned.\n\nFor desert I ordered a strawberry dish with a wonderful description and I was quite excited to taste the treat; what I received was 3 strawberries cut in half and a single shortbread cookie ... again, completely disappointing and forgettable.\n\nI love Scotch Whiskey and ordered a very nice Lagavulin 1995. I requested a double, neat - what I received was a skimpy singly shot of whiskey in a generic glass and it wasn't even the whiskey I requested. When I inquired, they insisted it was a double shot of the Lagavulin 1995, but as I said, I love good Scotch and this absolutely was NOT what I ordered.\n\nAlmost as soon as we finished our disappointing meal, the maitre d' arrived with the bill and informed us they needed the table to seat others and he encouraged us to pay the bill while he waited ... WHAT?!\n\nNow, add to this evening the near complete absence of service as my water glass sat empty for the entire meal and received no refills. We were also afforded no opportunity to order a second round of drinks.\n\nAll in all, a truly unfortunate experience. Were it not for the beautiful setting, this would have been a 1 star review.  If you're thinking about going to The Witchery for dinner while in Scotland, I would like to encourage you to entertain nearly any alternative restaurant this beautiful city has to offer.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 2, "date": "2014-10-23", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "LFiRa2Bs2bsze9hL9et3ZQ", "review_id": "nLA9JEP2SwRJDnNq1QatVQ", "text": "The setting is magical and the ambience is very romantic.  Lots of dark areas illuminated with candlelight.  The staff are super efficient and not in your space so it makes you feel at ease in this posh place.  We had the lunchtime set menu £18.95 for 2 courses.  \nTo start the pea and mint volute with Mull of Kintyre scones, delicious and a really good size starter.  We also had the Scottish & Iberico cured & smoked meats again tasty.  Main course Hachette of Cairngorm venison with duck egg, this was ok but basically a posh burger without the bun.  Skate wing with black butter, lovely.  For pudding we had The Witchery pudding selection, this had 5 small potions of creme brûlée, sorbet, chocolate cake etc this was fab and although £11.50 the deserts were gorg and worth the price.  \nOn the negative side- when they brought the desserts out although I had my place setting for pudding, no dessert was brought for me.  I do feel if they had been on the ball they should have picked up on this mistake they had made.  I did get an apology when I pointed out the error but considering the amount of waiting staff and the high expectations this should have not happened.  \nThe timings between courses was just right but we had been sent a text the day before  advising we only had the table for 2 1/2 hours due to other bookings.  \n\nThis place Did not live up to the high expectations I had.  I did enjoy the meal but I have had better and although it did not break the bank, I've had better for less.  I have marked this restaurant 3 but it borders on 4 stars ars as it was so pretty inside and I loved the aesthetics. Xoxo", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 3, "date": "2014-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "kiLsA2JnNMHcOHqaonug4A", "review_id": "ezMI4tElaDgipb2_puNk0w", "text": "We made a reservation at the witchery for our first night in scotland (our only night in Edinburgh) and after a very long trip from nyc and a very long day packing in as much as we can by the time we sat down to dinner at 8pm we were beyond exhausted and also not that hungry (at 5 we decided we needed a snack and stuffed our faces at a pub ). We got a table in the back section, I believe it's called the garden, and the room was absolutely beautiful. I had a side of mushrooms served in the cutest cauldron and a salad. Both were delicious. The service was excellent and when I'm back in Edinburgh I will 100 percent be returning to the witchery when im awake , hungry and in my right mind. My only complaint is that it felt like forever we waited for the bill, but again part of that might have been because we were so exhausted.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 4, "date": "2014-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Iy3WrSZxjGR0muMfNoEP9Q", "review_id": "ktkeZzGENTpwe8XwZ-s3nQ", "text": "I can not recommend this place highly enough, one of the best meals I have ever had. Hubby had the rabbit turrine to start, it was delish, I tried a nibble, I had the steak tartar with quails egg, this was amazing, the steak was seasoned beautifully. Main course was scallops for me, one of my favourites seafood but if overcooked can be spoilt and rubbery , if undercooked a tad it's a shame but these were perfect and so fresh. Hubby had the salmon, I tried another nibble, it too was sweet, succulent and delicious.  The meal was lovely and in a delightful setting, all the tables have candles, no overhead lighting so very romantic, crisp white linens, waiters who are attentive, polite and very friendly. I wish we lived near enough to visit more often, I am really struggling to understand the reviews that do not rate this 5stars. 2courses for 2people, wine for me, juice for hubby and water on the table with change from £100. This is the sort of restaurant that makes you swell with pride when you hear the American diners as its good to know the UK can serve world class food.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 5, "date": "2014-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ZstnZSvHPtlm-wFj4AIzRg", "review_id": "FMzJRk_Cq54BiohxV_RBuw", "text": "What's great:\n- The atmosphere and decor is amazing.  We ate down in the Secret Garden (it's the same restaurant, just a different room).  It was dark, candle-lit, and very romantic.  Tons of amazing stuff to look at.\n- The location is ideal.  It's just steps from the castle, Whisky Experience, and Camera Obscura.  It's really easy to see sights, then have a nice dinner right there.\n\nWhat's okay:\n- The food was uninspired.  It was okay, but we feel it didn't quite measure up to the ambiance and price.  For example, I was expecting something amazing from the flat iron steak, but the cut wasn't that tender and the flavor was pretty basic.\n- The service was uneven.  Some of the staff were very friendly and casual, and others (including our waiter) seemed competent, but a bit stiff.\n\nConclusion:\nIf you want a fancy, romantic dinner in Edinburgh, and you're not a foodie, I don't think you will really go wrong with The Witchery - but you'll pay for it.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 3, "date": "2014-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "28d-5BM7srDDB7RTADMCjg", "review_id": "QQh8uvfL1O0GEciPANT28w", "text": "Save your money. I had fairly high expectations as I heard this was a place for fine food and I had been in Scotland for 10 days with all excellent food. I ordered the fixed price 3 course for 35 pounds.  My starter was red mullet on cucumbers with potato salad. The potato salad was mediocre at best and I didn't finish the mullet. I enjoyed my roast chicken main but given that it was called pot roast on the menu I expected potatoes and carrots... A roast of some kind... Dessert was a dry pistachio cake that lacked a theme between that and the rhubarb stalk laying next to it. My 3 girlfriends had the same experience... One not even finishing her main. The service was bad in that they were completely absent. When they were available it was ok....but overall Serious lack of attention making it the worst service at this price point I've ever experienced.  I had some excellent meals in Scotland but this was the worst $60 USD I've ever spent-ever. I would take it back if I could. Save your money.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 1, "date": "2015-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tiMkOMF5MdCN2KBNw8cS1w", "review_id": "5gu3dkAhdJjblWsKOjymyQ", "text": "Great food, even the Haggis was good. Had the Salmon which was great. Nice atmosphere and the service was on spot. Highly recommend .", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 5, "date": "2015-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "98Yoen-Byw19n1LDlXaTnA", "review_id": "rQDgE8WZmLNcwds9UdZmPg", "text": "Well there is nothing bad to say about the atmosphere here in the secret garden dining area,dimly lit,crisp white cloths,shimmering silver and perfectly coiffed staff you would almost think you are dining with the royals. We had a late late night booking so we were the only ones in the restaurant which was special. The food was just ok. I had The Fillet of Scotch Beef Rossini which was nice but nothing amazing.The foies Gra was rich but definitely too much and to the distaste of some of my friends that I was partaking, but I did. \nThe star at this place is definitely the wine list, filled with an amazing collection that stretches far and wide and if it wasn't such a late booking we could have stayed (and payed) for many more bottles of liquid gold! And to top it off a dark Belgian chocolate tart,simply made no fine gold trimmings.\nIt's definitely worth a visit once,you will pay for it but then you can say you did it!", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 3, "date": "2015-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FmGWTcKqY3vAfbzTEK2ToA", "review_id": "60r38W0HMZRHF-0o_AbrbQ", "text": "incredible atmosphere, food and service!  I highly recommend this restaurant if you are looking for a very special night. For either a romantic meal or a nice meal with friends; This little restaurant is the place to go.   Make reservations!  We went our last night in Edinburgh and it was the perfect way to end a wonderful trip!", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 5, "date": "2015-10-19", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "L4ncKdBIshatD4-gW2-H7g", "review_id": "xZEnrnNLfgXfdmAtobkoyQ", "text": "Excellent end to a good day!\n\nThe Witchery by the Castle was our posh nosh place after seeing a musical at the Edinburgh Playhouse. The idea was to go for the £35/head set menu after we'd ordered a couple of G&Ts. But, and it's a shame for them, it was uninspiring. \n\nWe then ordered steak tartar and lobster bisque followed by Pork and John Dory. To drink a reasonably priced Pouilly Fume.\n\nThe waiter provided us with some bread; considering this place is not cheap and the ambience wonderful you'd expect at least warm bread but ideally their own bread. What we got was poor.  \n\nThe steak tartar was fabulous and my wife's lobster bisque perfect. The steak was perfectly seasoned and there was plenty. My wife's bisque was exceptional. \n\nOur main course arrived and again both good. My pork with smoked mash was really good. The fish was very small but at least fresh and perfectly cooked. \n\nNot cheap but good service and ambience with nice food makes it worth a go.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 4, "date": "2015-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5pjG1kDzpQGKEFDPZs0y7Q", "review_id": "s6sXyWN4hP0kfD276ZzUng", "text": "Nice romantic Ambience \n\nServer was perhaps having a bad day.  Very curt. No interest in answering questions.  No refills on drinks. No upselling.  No recommendations.  \n\nFood average.   Portions small.  Bill high. \n\nYes go here for the best restaurant in Edinburgh part and romantics warm decor.  Maybe you'll have a better experience with your server.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 3, "date": "2015-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "VGcQ0MwMdBJWZfskzWvZ4A", "review_id": "W_lIED8BccpFDLrPL5Ozqg", "text": "We came in to the Witchery last Monday night - we got one of the later reservations so my first tip is to plan ahead.  Once you're there, you can see why it books up quickly.  First, the location near the castle on the Royal Mile is GREAT!  Second, the ambiance and decor is something else!  It's really romantic and beautiful.  Food, service...all amazing.  The steak tartar will open your mind to a new way to do steak.  It's more of an experience than a dinner and one I would highly suggest doing!!", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 4, "date": "2015-11-04", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "GPX6mF45XnVN9TGcEUMPQA", "review_id": "mkQVv-RaSwiTzcbcArV6ow", "text": "What can I say, it was good, but it didnt blow me away.\n\nSo let me see, we walked in tot the Witchery, or did we? There was no signage, so we ended up at the Secret Garden, and so did a couple behind us, when we all wanted the Witchery. So be mindful of the hidden entrance.  Anyway, we make it into Witchery...not a back spot, especially if youre into dark, throwback kind of spots...Dont expect a view as there were no windows down here....I didnt mind the decor, kind of playing off the name and the hotel and all, but just because you have a hades theme, you dont have to keep it as hot in there (it was really really hot)\n\nI think my biggest disappointment with the Witchery was that I frequently order in batches, to slow the service down a bit...nothing I dislike more than having my plate cleared the second I take the last bite of something and then having the next course immediately delivered. As such, I will usually order apps, then soup/salad, then main course....So, there I am, 40 minutes after ordering some oysters for my app, still not enjoying my oysters. Finally I flag down the waitress to inquire about my only to be told that they cant do that and the whole order has to be placed at once or \"the chef gets mad.\"  So much for letting the customer decide how they want to eat. Pretty odd for a \"high class\" restaurant.  I understand about turning tables over and all, but we had an 830 pm seating, so I highly doubted there was another seating after us.  \n\nAnyway....the food.  After waiting 45 mins for the Oysters (to order), I was too hungry and hot to do the whole course dining experience, so I just went straight into the meal.  I had the pork chops.  The Pork Chops were good, very good, I just dont think they were worth ~$45 US (29 pounds).   My buddy had the venison and he said it also was good, but not amazing.\n\nBecause of the heat in the place, the time, and honestly, the lackluster looking dessert menu, we skipped dessert, so no comment there.\n\nOverall, it was certainly an OK restaurant...a bit pricey for mediocrity, in my opinion...If you live here Im sure its worth checking out, maybe for the pre-fixe menus?  Traveling through, I may look for better?", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 3, "date": "2015-11-24", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 2}, "user_id": "YlpzPPySUxJsUJHRyRde8A", "review_id": "ziZSWWGHcPqFdKbCUv87-g", "text": "So good I am going to have to review this place twice - once hereas a tribute to the place and once as a tribute to an event held here last night. \n\nOn one hand, I'm delighted to announce another notch on the cool club belt of discovering this little place tucked up a side street behind a heavy  door... honestly if I had found this place on my own I would have thought it closed. On the other hand, how have they stayed in business so long (the establishment has been running since the 70's, but the present owners only for the past 3 years) being so hidden and so small? Perhaps you can attribute that to it being a great wee find!\n\nMy favourite part of the NYSP is the metal curving staircase into the teeny tiny restaurant. It's like emerging into a magical old world, with cruiser memorabilia everywhere you look, from the posters on the walls to the brass fixings on the benches around the walls. With an open kitchen, you have full access to watching your food being made. Well, in theory, as the event last night had the walls jumping with yelpers eager to try chef Kev's fare. \n\nAnd the food is good. For me, the highlight was the mussels that Jurgen D. waxed lyrical about in his review - so succulent and tender, they were an instant win in my book, which is against the norm with me when it comes to mussels. Other highlights that I had the opportunity to try included vegetarian enchiladas and a vegetarian burger - the burger, a little dry, but tasty all the same. \n\nWhen the dessert platter came around, we got to try all the desserts available - cheesecake, dime bar cake, pecan pie and chocolate cake. For me, the chocolate cake was far too rich and needs something to take away from the heaviness, but eh, who needs chocolate cake when you have Dime Bar? That cake bitch slaps all the other dessert options on the menu. \n\nThe boy wasn't available to test out NYSP last night so it is clear what I must do. Take him to NYSP and lucky for me, he doesn't like cake....", "business_id": "XyYSroXLSCtQIK0taL9-fw", "stars": 5, "date": "2011-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "o4MPZ7LQVjA0I_x2RB1tVg", "review_id": "M-0eYK6sak8M2W4s7zNI2g", "text": "Fantastic food, great atmosphere and would definitely eat here again. The  burgers and steak are two of favourites. generally id say to give it a go!", "business_id": "XyYSroXLSCtQIK0taL9-fw", "stars": 5, "date": "2011-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M4MVVzNPZHiJdnNvWjL8VQ", "review_id": "HnkNtLSXMqYygTEvFWz9Bw", "text": "Hadn't been in here for quite a while & definitely not to eat. Picked it fairly randomly as it's close to a friend's flat.\n\n\n Service was good and just shy of intrusive up till it came time to pay the bill at which point the staff were nowhere to be seen so we had to hover at the bar to settle up. My gnocchi starter was tasty although there was rather too much tomato sauce, the tuna steak main course was also good but could have done with a potato or two as spinach as the main veg accompaniment was a little bit boring. Only one Rose on the menu but at £11.50 it was as well priced as it was drinkable (a Fair Trade product to boot).\n\n\n A good selection of tunes at a comfortable volume further enhanced the experience & I can see myself venturing back here.", "business_id": "dXPmE2ncXbQTPBVNRODuNw", "stars": 3, "date": "2008-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "UTzpK0D8maxbXbnC8b3-dQ", "review_id": "neQbv9IQJHkR1GxeC-MMTw", "text": "I've had two markedly different experiences at this place. When I went in on Monday evening with a girlfriend of mine, the service was very good and the drinks were excellent.\nI actually found myself craving another one of their margaritas last night! \n\nThis time around I showed up with a guyfriend of mine. I wouldn't mention this if I didn't think it had some effect on the service. So here's what happened: last time, me and my friend ordered at the bar, and the bar staff took great care in making our cocktails. This time around, my friend offered to get the drinks. Now, he's not the best lookin' guy out there, and he was a bit underdressed for the occasion (but he wasn't wrapped in a blanket carrying a trashcan, underdressed). \nHe ordered the drinks at the bar and when he got back with them, my margarita was clearly watered down. It had not been strained as it should've been, so I had an embarrassing coughing fit because some of the lime-skins got stuck in my throat (yes, that's me being clumsy, but still). Also, there was no lime part on top of the glass, as there had been last time. Instead, I found a squeezed out lime drifting halfway down the glass. \n\nNow I don't know if they thought he just didn't deserve good service or drinks, but what I do know is that I won't be coming back here again. If we pay that much for drinks, we expect them to be good. Yeah, he's no Brad Pitt, but this just felt really unfair and discriminating to me. (And I could tell that he was embarassed as well).\n\nIt's such a shame too since I had a great time on Monday and was thinking of making this one of my more regular fancy-cocktail hang-outs. Guess it's time to move on!", "business_id": "dXPmE2ncXbQTPBVNRODuNw", "stars": 2, "date": "2011-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "UTzpK0D8maxbXbnC8b3-dQ", "review_id": "YZrLvizrzBCwu0-3LPBYcw", "text": "Hmm, strange. The quality of your experience here fluctuates with the quality of the staff.\n\nToday, I had a small  bite at Biblos and, you know what, it wasn't half bad. I expected it to be much worse than it actually was. (A friend of mine suggested giving it another shot). I really was quite surprised.\n\nWe had the fish and chips which was A-ok, not superb not bad, and the waitress had made a small mix-up with our order, but was nice enough to come tell us about it and checked in on us a couple of times. Not in a pushy manner either, but in a friendly \"I'm only here to help\"-way. Very refreshing from the careless manner in which I've been handled (man-handled even) in this bar in the past.\n\nIf this girl continues to work here, I might actually come back. Be warned though, I've seen the waiting staff of 20-year old girls ignore me and my friend for a good 20 minutes, chatting behind the bar, before so much as raising their eyes at us.\n\nAnnoying.", "business_id": "dXPmE2ncXbQTPBVNRODuNw", "stars": 3, "date": "2011-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "aaLXzX88QjjrlARrwIaPKQ", "review_id": "hsHv9dSEKrmZA12n12mRQA", "text": "Nothing special but just OK. I was worried that the offer of cheap food was to good to be true, which it was. You get what you pay for and I paid very little for a cheap burger.\nNo real character to the place and it didn't seem to be too clean either. There is better to be had in Edinburgh.", "business_id": "dXPmE2ncXbQTPBVNRODuNw", "stars": 2, "date": "2012-10-02", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "RH2K7RqzkGUa0pD0nSMDcg", "review_id": "6LUlnvNmL1xnUk4iMHdjPA", "text": "I wouldn't have reviewed this place as I hadn't been in in years as I was fairly sure it was whole heartedly shite, however I went in on Friday night for some beers after work and it was actually quite nice. There is new ownership, the food looked better, the service was better I was on the whole fairly impressed with the whole thing. \n\nHowever I only drank the beer and noticed that the wine was fairly expensive by the glass. This needs further investigation, however I thought I'd pop up my initial thoughts to start with!", "business_id": "dXPmE2ncXbQTPBVNRODuNw", "stars": 3, "date": "2012-10-08", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "4NS8XCo1pXk9Ag16PatwdA", "review_id": "UWzW2rrNUSliQVL80PcqVQ", "text": "I had Biblos with a large group of classmates (Around 30 of us) at the end of a very intense week of study. Glad to report that Biblos was a great choice to end such a wonderful week.\n\nBiblo is a pretty large restaurant, it has 1 and a half floors, we took the \"half floor\" upstairs as the place was already packed downstairs.\n\nWith music in the background and its dimly lit ambiance, it has a fine-dining feel to it but its prices, while high, isn't outrageous. (Psst, I also heard that they have student discounts if you have your student ID with you)\n\nA huge selection of food, all of which, sounds interesting. All of us had a hard time deciding. The poor staff had to keep coming back to us as we indecisively looked through the menu over and over again.\n\nThe staff were very friendly. When our professors needed to make some final announcements, the staff were kind enough to temporarily turn down the music until we were done.\n\nThe portions of food is rather large and it tasted great! \n\nI'd say it is a good place for groups!", "business_id": "dXPmE2ncXbQTPBVNRODuNw", "stars": 4, "date": "2012-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "o64IkZLYluCHlDtWzQE71Q", "review_id": "a75pCMFU0t4NGbglaCDtVg", "text": "Usual pub food\nNo cards allowed for our group\nStiffed us on discount", "business_id": "dXPmE2ncXbQTPBVNRODuNw", "stars": 2, "date": "2012-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Rv0yI-OQGvVaqyIVYmtYzQ", "review_id": "6dgQJObZeSzYAgtZQkwK5Q", "text": "student discount is really good. save money a lot. nice locatiob. really convinient for my classes.", "business_id": "dXPmE2ncXbQTPBVNRODuNw", "stars": 4, "date": "2014-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iMjfcCdA3QhZcQ6vHtZGSQ", "review_id": "sTXzmPqCclaYUA7De2srIw", "text": "Great food at good prices. Had fish and chips, was huge portion. Offers 25% student discount.", "business_id": "dXPmE2ncXbQTPBVNRODuNw", "stars": 5, "date": "2014-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b36A6NSiLeIlOkgFGp9CrA", "review_id": "2_7fA1sasoeP3lTlqwoT7g", "text": "The Royal Yacht Britannia is in Leith at the Ocean Terminal Shopping Centreabout 20-30 minutes bus ride away from the city centre. The tour is basically self-guided with these super huge walkie talkie type things that you have to put up to your ear. If you're into this sort of thing I would definitely recommend going in the quieter periods so that you have time to listen to your guided tour and the space to wander around and look at whatever you want. It was surprisingly more interesting than I thought it would be but yet another example of how different the life of a royal is from mine.", "business_id": "HSYVkG67Juu-G693xz2ViQ", "stars": 3, "date": "2008-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w6W6Db_cP8rTCONl0bcBZw", "review_id": "1oiCzJ7jjU3onctAfCVXqg", "text": "We found this by our hotel manager giving us a discount card. The Royal Yacht is berthed at Ocean Terminal in Leith and is a very beautiful and unique insight into the lives of the royal family. Addmission price is £10 and it's worth it to climb aboard this amazing vessel. Alot of money has been spent by the trust to peserve the yacht and the Royal family have let the trust use alot of treasured items in recreating the look and feel of what day to day life was aboard the yacht. What I enjoyed was that visitors could sit in the rooms that the royals used and you could touch and feel most of the items on show. There were also lots of locations to take photos of where the Royal Family posed aboard the yacht. The staff were also very knowledgable with the boats history and the audio guide that you are given as you step aboard had alot of information about each room and those who crewed the ship.", "business_id": "HSYVkG67Juu-G693xz2ViQ", "stars": 5, "date": "2009-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vdJVzQs-T5eNfdqfeAZ56w", "review_id": "tAQdXYsUK0CuadE6B5gJRg", "text": "This was exceptional.  The seemingly unlimited access to an historical artifact was a pleasant change.  Often one can only view limited portions of an exhibit.  \nThe audio handset (included with the admission price) was exceptionally helpful.\nIf you are in the area don't miss this opportunity to see how the \"other half\" lived.", "business_id": "HSYVkG67Juu-G693xz2ViQ", "stars": 5, "date": "2014-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GKtq8ynkR5MJk83WP1jGjA", "review_id": "wdE-Ca0mxwCypXbAuhFf8w", "text": "First and foremost the trust that looks after the yacht are to be congratulated on the way they have presented the experience, parking is easy and free, a short walk take you the reception, from there you have an interesting museum, pick up an audio guide. The tour starts on the bridge and goes through the living quarters, state rooms, crews quarters, hospital and kitchens, the engine room is a must it does not look as if it has done a million miles. Well worth a visit.", "business_id": "HSYVkG67Juu-G693xz2ViQ", "stars": 5, "date": "2014-11-18", "type": "review"}
