{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zo_soThZw8eVglPbCRNC9A", "review_id": "5kttkNS9zOO5f6ZLkyVgtg", "text": "This SnS and the one in Bethel Park are my two favorites.  Staff always friendly and the deli staff in both locations are great!  In my experience, if teen staff don't know where something is, they ask another staff member.  Shopping these two stores is as pleasant as it gets.", "business_id": "yXuao0pFz1AxB21vJjDf5w", "stars": 5, "date": "2015-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jEJYKnFHHXzHlESRAlSl2g", "review_id": "4hiuu3hbAaXtDS5pasBynQ", "text": "The beer is good but the food is nothing to brag about at ALL. I've tried many things on the menu, and if you have developed a \"foodie\" palate, don't even bother, because you will be very disappointed. If you feel comfortable with chain restaurants and their lack of innovative touch (which, nothing wrong with that!) you will most likely enjoy Rockbottom. The only entree I did enjoy were the lobster and shrimp enchiladas (minus the repulsive beans and rice) and the asiago crab dip as an appetizer. Otherwise, you are better off skipping it.", "business_id": "McikHxxEqZ2X0joaRNKlaw", "stars": 2, "date": "2014-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2cQrK_qA2DGZQcjlTTdKFA", "review_id": "Z36WR8G0o7L9i2CUGwidFg", "text": "Minerva has awesome cakes! They are cash only. Stop and pick up a delicious cake! I have been enjoying this bakery my entire life!", "business_id": "hnHt6EinzC-IX6y3GSF7jw", "stars": 5, "date": "2015-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EOEjJ8qG_RJNSGkngGC33A", "review_id": "jzDXaYoAKszVpmKDmnP1gw", "text": "Being from Illinois and in town to attend a Steelers game we needed beer.  Found out grocery stores only sell basically a 12 pack per person/visit. Nothing like Illinois where the sky's the limit. So after that education we ended up here.  Good selection of beer when you need more quantities that 2 six packs.  We stocked up on IC light and was reasonably priced.  Friendly service.  Only con is parking is scarce but that seems to be par for the course in Pittsburgh.  I would visit again if in the area.", "business_id": "s74Tq6WKV1b91UFRr7ch7g", "stars": 5, "date": "2015-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JLS56V5lhErpFUjZ8N8VrA", "review_id": "Bt2M3m7ZJG_9_KI9v7YDjw", "text": "This is a quiet little nook in Highland Park that is perfect for tea, coffee, snacks and getting some work done or catching up with an old friend. I used to frequent this place much more when I lived in Pittsburgh, but I still make an effort to come back a few times a year for the ambience. It is great in the summer and fall because they have a few tables outside.  The staff is great and the prices are reasonable, too. The only change I could think of would be to put on some soft easy listening music. It'd make the vibe a little more comfortable!", "business_id": "83_p9vIqOq1TUIf3_GD7bA", "stars": 4, "date": "2013-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SDlLqXn4IEtMzNwt9sV98w", "review_id": "ZdNKIcZFhjpk8RMDD2ptVg", "text": "I recently discovered this place upon strolling around Highland Park, my favorite East end 'hood and perhaps, my future home area ...\nI always get coffee at Tazza D'Oro but this place also serves coffee and most of the items they create/bake are perfect with coffee ...\nI think the stand-out item is the cheese-cake brownie and perhaps the 'scotcheroo'.\nTry both of them ...\nI've been to Europe and experienced the patisseries in Paris and they're as good as confectionary/sweets/dessert food gets but, places like Food Glorious Food are the  next best thing, state-side ...", "business_id": "YMEtEsUDQKOYJOcE5Fx3gQ", "stars": 4, "date": "2015-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8qjdFatMwwMNgXXUE3ueLw", "review_id": "ohIiuCxRuqQ9hKDEO0CEaw", "text": "I don't shop at Whole Foods that often since it isn't that close to me. There's a Shop n Save a block from my house, so I buy most of my food there.\n\nOne thing about Whole Foods is they specialize in fresh fruits and vegetables.  Their produce is definitely impressive. All of the oranges, lettuce, berries and bananas peppers are perfectly ripe.  They never have spoiled or bad fruit.\n\nThe pastry section is definitely worth checking out.  They have fruit tarts and a lot of different flavored cheesecakes and cannolis.\n\nWhole Foods seems more expensive than Aldi but less expensive than Giant Eagle.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 4, "date": "2014-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hLuDfkQrpS5nwM_RUE1cXA", "review_id": "FhwO_tWdNTsRjL9Ge2j3Ug", "text": "Nice little coffee house with good food.  My only complaint is that the food was NOT HOT ENOUGH, which is a bigggg turn off for me. However, it was still so good that I'm giving this place 4 stars.  The apple panini was a delicious hot mess clearly invented by somebody who got the munchies and only had raisin bread, apples, cheese, and seitan around....the result is amazing.  This place just needs to make sure the food is warm!\n\nDip is a huge ripoff, btw....$5 for a tiny portion :/  they should lower the price on that item.\n\nThe salsa that came with my sandwich is some of the best salsa I've ever had, though. Dunno if they make it themselves.", "business_id": "PzG0XmAmtXFs6Fdnubf41g", "stars": 4, "date": "2010-10-23", "type": "review"}
{"votes": {"funny": 5, "useful": 1, "cool": 0}, "user_id": "uKlA738TMH1uj3yVPJX-Jg", "review_id": "l79qOS4GWStHxFA4cAeHtQ", "text": "anything you need you can find it at the market :)", "business_id": "EPILrBqmgQxd-R1gZ1EWJg", "stars": 5, "date": "2011-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7IPdr4DfB5TizGvUGZeozA", "review_id": "QUvMAULwE-L_skdsw7AwNQ", "text": "The best place for an artic swirl. :)", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2009-09-27", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "tpgGohAAQXMM9lEuI9iqtw", "review_id": "E_84evfOcNQLJMhr6saNIQ", "text": "I was fortunate enough to enjoy a Saturday night Oktoberfest celebration here this past weekend. A friend of mine is a member of this private German heritage club, and got tickets for me and our lady friends for this celebration.\n\nWe brought our own steins (which cost varying prices to fill throughout the night depending on whom we asked), but were always full of beer from excellent breweries like Spaten and Hofbrauhaus. We enjoyed a phenomenal buffet, with two delicious wursts, pork cutlets, potato pancakes, sauerkraut, and a whole mess of tasty German sides dishes. And we spent the next three or four hours in a handsome ballroom with folks as much as three times our age, drinking beer and enjoying awesomely German music from \"Fred Zurich and His Sound Machine\".\n\nWhat a great time this place was! I've never had so much fun being 1/4 German in all my life. If you have a chance to visit, take it!", "business_id": "OjzR6hUYasFReo0vhVn0-w", "stars": 5, "date": "2012-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "DLu1Bum8EXNE62xno-v0VA", "review_id": "C12l014KavLO7M6EZ5yQ-w", "text": "So I have to ask myself, why don't I shop here more often? My family and I tend to shop at Giant Eagle, partly because of the large size of their stores and partly because of their GetGo rewards. Kuhn's has somehow become the place we stop when we don't have time to drive to Giant Eagle. \n\nWhich is totally a shame, because whenever I DO stop in here I'm reminded about how nice the place actually is. Today a simple trip for milk turned into a fall-themed decoration shopping spree that went really well (yay super cute owl pillows!) and I ended up picking some breakfast and lunch items as well just because of how cheap they were. I know from past experience that the produce is fresh, and between the wonderful aroma and colorful display the bakery here is absolutely torturous to pass. There's also a ready-made dinner/lunch shelf with sandwiches, chicken wings, pizzas and a few dessert items if you want to grab those on your way out; I've actually gotten dinner here a few times on my way home from the city when I was too tired to cook. What's not to like about affordable and delicious food, right?\n\nHowever, there is at least one thing that does keep me from wanting to be a regular here and giving Kuhn's a 5 star review: the blasted parking lot you have to deal with to go here, which I've cursed in other reviews. This lot is the one that fills up super quickly, creates miniature traffic jams like no one's business, and is a time-stealing trap. Sigh. Suddenly I think I understand why my family always goes to Giant Eagle.\n\nSorry, Kuhn's. Your prices are wonderful, your set-up fantastic, and your options well varied and impressive. But can you blame a girl for hating a poorly constructed parking lot? (Don't worry. You're still great. I'm sure I'll see you again!)", "business_id": "9NL2GL4jSPVj9SKijH5PqA", "stars": 4, "date": "2013-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cFD42nNaAT3Mcw5m_EK9jg", "review_id": "z9J3bcQl5eqfxymkyGQP4g", "text": "Don't waste your time. Incorrect orders are the norm. It's fairly disgusting (sticky tables, trash everywhere). The last time we stopped in there were seven people working...but maybe actually three doing work. The other four were checking their cellphones or standing around talking. There is one young girl there who works her ass off but the rest contribute to the chaos.", "business_id": "9aw0t0rlACKkMaxsX0KlKA", "stars": 1, "date": "2015-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_SRuFa3jMq10L6jQhLacyQ", "review_id": "85NdmJCYFj5taso2fCRtAg", "text": "My boss and I once argued about who had the best donuts.  I said there was a place in the West End that had the best.  He claimed the best came from a shop outside of Crafton.  Of course we were both talking about the Better Maid.  For cake donuts, it doesn't get any better than Better Maid donuts.  Always fresh and should be be named Best Maid.  Get there as close as possible to the opening time and don't be disappointed if there is a wait.", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2014-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "3d0Vw3hPiUEWMwrlnC-IOQ", "review_id": "efWmcX79GooJItt3mF1eeQ", "text": "Beans, glorious, beans! So many many beans. Great Northern, Black, Kidney, Pinto, Pink (pink?), etc. etc. and so forth.\n\nOk ok, Reyna's is more than beans. Lots of different types of dried chillies, prepared salsas, chorizos, frozen tamales, different types of soda pop and drinks that you won't find in a regular grocers. \n\nI haven't tried the taco stand yet but the coup de grace of the grocers itself though is the fresh tortillas, both corn and flour. Delicious! (And beans).", "business_id": "buVALudg30kgkDusqB3yJw", "stars": 4, "date": "2011-11-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "u1KESST6ATusVrn7F6HUvw", "review_id": "dcsDADNXDowUUvw6ydsuGg", "text": "I knew it was going to be a fail as I watched the 'Barista' slopping together a latte for the customer in front of me.  I ordered a coffee of the day instead--meh, I've had better.  My wife got a soy latte:  he dumped the milk in, without technique, and over-heated the milk.  It was a watery, soppy mess.  \n\nWe want Nicholas to be great--or now, better.  Train the staff!", "business_id": "J7I85lTCEGr9-qp6AXPUjQ", "stars": 2, "date": "2013-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "fa6cVDkqoUWthieEtP0C9w", "review_id": "fVK2UVszTegEH1bP7OVmzg", "text": "I used to buy La Prima espresso for my Pavoni all the time so I was pretty excited to actually get a cup of coffee here.  I ordered a cappuccino.  It tasted like milk and no coffee.  I was exceptionally disappointed.  So while the place has a great reputation,  even they can screw it up if they don't pay attention to detail, and  at this level they should never screw it up. I had a better cup at Martys Market for crying out loud!", "business_id": "SWzCFTM7KHc-MncD6xxOYQ", "stars": 2, "date": "2013-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "tH4brXlghqKn_9GbahrMTQ", "review_id": "PUoTcDMCcRLsKF7FqL-lzA", "text": "Place to go to get Asian groceries in Pittsburgh. They are surprisingly well stocked and have mostly everything you would need. I think I only ran into the problem once where they didn't sell something I needed.\n\nThey have a great fresh vegetable section, restocked every weekend, with most if not all the common Asian vegetables and even uncommon ones which I thought I would never find in Pittsburgh including tung ho, suan miao, loofah, etc.\n\nThey have a decent freezer section which includes some frozen meats. They even sell some prepared foods like zongzi, stewed bamboo, and other meats.\n\nTheir bakery section is very small and I think they ship their breads from Chinatown in NYC, but there's almost no place else you can get Asian breads besides Sumi's bakery and Bubble Pi in Squirrel Hill.\n\nOn weekends, they sell fresh tofu which they make in house. Relatively speaking, Lotus is very small compared to an Asian food market not in Pittsburgh, but being that Pittsburgh lacks a lot of good Asian restaurants and groceries in general, this place is great.", "business_id": "lVB0HB2PxC9OTtMcz0wagA", "stars": 4, "date": "2013-10-13", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "udT5L2wjSQC0AnlFx_pZjQ", "review_id": "pGh0loZPSNiNq2NvVfB0tQ", "text": "Cheap! doesn't necessarily mean bad - at least not here at the Stan's Market. However, you will definitely have to check, double check and triple check on some occasions before you buy anything.\n\nWe stop here twice a month to do our groceries - mostly for less likely perishable produce like the garlic, ginger, peppers, baby cucumbers. However, we usually end up buying a lot more than that since we cook on a daily basis. If you happen to buy some of the soft fruits like the strawberries, blue berries or the grapes - you will most likely need to finish it up with in a day or two. If not, you can always freeze them to make smoothies.\n\nLet me say this again, this place is cheap. The prices I pay for the produce here are usually 1/3 of the price I pay at Giant Eagle. So, if you know your produce - this is definitely the place to stop.", "business_id": "UQSGL98JH8346Uv9B9Ec0g", "stars": 4, "date": "2014-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dyFP7vRPhUofhQMzID_h_g", "review_id": "7OrR5U8339vSov97R4BFzg", "text": "Fortunes is one of the few places in the strip to grab a coffee or espresso. They also supply general coffee goods: beans, pots, etc. and I've bought glass french press pot replacements from them. Prices are reasonable. \nStaff are friendly. Not really a place to hang out so much as a shop and a get and go for coffee. Table and chairs are set outside in good weather.\n\nAtmosphere is functional more than aesthetic. Discount if you bring your own coffee cup.", "business_id": "HmG9zkBtRwttGE291q9b6g", "stars": 3, "date": "2008-09-01", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "rL7tj-6DtdzGpwC6WW1umw", "review_id": "6m92eAkOfLms0lkigDk73A", "text": "Penn Mac is a fun shopping experience. I used to do a lot of my weekly shopping here, but now that I live in the North Hills I've got that can't-cross-the-river syndrome and I only get there every other week or so. It's miles above a Market District, though, in terms of entertainment value and pricing.\n\nThe cheese counter is pretty good. It's not the most amazing selection ever, but it's great for Pittsburgh. For example, they don't carry a variety of aged cheddars or Stiltons, opting instead to offer one or two basic and many flavored versions (with apples, with onions, etc.) They do let you sample, which I recommend; like another reviewer, I've gotten over-old blue cheese here once or twice. They've always enforced the half-pound minimum for me. The fresh mozzarella is great, and I can't resist it when tomatoes are in season. I hate to even mention it, but one time I got home and found... well, a hair in my mozzarella. It put me off for a few weeks but seems to have been a one-time incident (and no, I never brought it up to them).\n\nThe deli has fantastic prices and does proper thin slices, nicely laid out on paper sheets so it doesn't stick together. Daniele prosciutto is amazing, and the domestic is pretty good at a great price. Iberico and Serrano jamon? Yes please.\n\nService at both the cheese and deli counters can take a pretty long time if you go on a weekend. However, I've been able to walk right up on weekday afternoons, and the weekend logjam is kind of fun once in a while.\n\nIn the same room they have the amazing olive bar. I pretty much only buy olives in the Strip. I know the Iggle has an olive bar, but everything I've ever bought from one tastes off in a way I can't put my finger on. Castleventrano olives (a bright, clear light green) are amazing: buttery and briny and fruity with a firm texture. Cerignola are good, and the various stuffed olives on offer are nice if you don't feel like dealing with pits.\n\nI haven't really bought many of their bulk goods aside from Jordan almonds, to which I am shamelessly addicted. They have a variety of pretty colors, as well as the \"seconds\" which aren't as shiny but taste great anyway.\n\nI love the selection of anchovies, tuna and tomato products in the dry goods area. They also have a good variety of hot sauces, though I can't say I've ever seen Pickapeppa there. Full range (I think) of Dave's Insanity, and lots of other brands as well. Important: They do sell Blennd concentrate, which you can also pick up at the Iggle. I have fond childhood memories of drinking Blennd at the KMart cafeteria growing up. I introduced my Michigan-born husband to it and he never visits Pittsburgh without getting Blennd at least once. (You can also get it premixed and cold at Wholey's, FYI.)\n\nIn the next room you'll find baccala (yum), pour-your-own olive oils at a reasonable price (not a huge selection, but the Spanish is fruity and a good everyday sort of thing at $4.99/12oz). I pretty much never buy bread here, opting to hit up the double rustic baguettes at Mancini's instead. The anise love knot cookies are great.\n\nThe last room has produce, normally at a good price but not the best selection. They do have fresh figs in season, thank God. I have to admit I've never tried the fresh pasta, since that's one of those things I just make at home. I should probably remedy that so I can offer an opinion on it. They sometimes have refrigerated and ready-to-go San Pelligrino Chinotto, a bitter soda that comes in a pretty bottle you can use as a small vase afterwards.\n\nCheckout is straightforward and efficient, but you will be in line for a while if you go on a weekend. It's nuts, just like everywhere else in the Strip. If you can, visit all the shops both on a weekday and on a weekend to enjoy two totally different experiences.\n\nThey do have a small parking area behind the store on Liberty, with which I wish you good luck on a Saturday. Otherwise it's street parking, but there's a ton of that, and walking past and through the other shops in the Strip is so much fun it shouldn't matter anyway.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 4, "date": "2011-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HmKmTSvTRa8b8dfv0Ns92A", "review_id": "0EbqmUv2brHwkxoz2FPGyA", "text": "This is Suncha fun place to visit when you're at the strip district in Pittsburgh. Definitely go into the area where you can order meats and cheeses at the counter. Look up to see all the many many many many many types of cheeses on the chalkboard sign. You find a lot of unique things here, some important things, dried salted fish, fresh made pasta, fresh made breads, you can fill up a bottle of olive oil or balsamic vinegar.  They also have a variety of pasta flour and bread flour and pizza flour and a produce section. When you first walk in there are a lot of things you can buy in bulk like nuts and spices. \n\nAlways stop here when in the area!", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2015-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "cNsuaATGLVUUpDSkChEk-g", "review_id": "YDiz2T8fUI7UFq_wzJ06Tw", "text": "We stopped in this morning at Paddy Cake Bakery to sample some donuts/treats/whatever caught our fancy. It wasn't the nicest place on the inside, and the ordering process seemed kind of chaotic. It looked like they did have a \"take a number\" kind of system, but weren't using it when we were there. I ended up getting a cinnamon roll and a cake donut, as I couldn't decide and we were heading to the gym anyway, so I didn't feel guilty. Wife got a chocolate frosted longhorn style donut that was covered in sprinkles. I feel like a good measure of a place that claims to have amazing donuts is their plain cake donut. If you can do this properly, then good things are to come when you order other things. This was probably the worst plain cake donut I've ever had. It was dry, not at all crispy, and had no flavor. I couldn't even finish it. And I love pastry. I would have rather had a cake donut from Giant Eagle or Dunkin Donuts, and that's a sad statement. Those are honestly better. The cinnamon roll was just ok, until I bit into the center, where the dough was almost raw. I understand not wanting to over cook your cinnamon rolls, but this was not a fun surprise. I sampled my wife's donut as I wanted to be able to comment on it, and I found the chocolate icing to be artificial tasting. This is the first time I've eaten donuts and thrown pieces of everything away.\n\nThis place was...well, edible. I didn't find it to be anything special. We didn't sample the cookies or cakes, but if the donuts are any indication, I don't want to try them.", "business_id": "Msfys8NloDpAsWmhvC9T6A", "stars": 2, "date": "2012-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MxvEWq0_fpFTaZwsjhS2hw", "review_id": "7N-a6jnzIPpQg2Husp1LIw", "text": "This place is such a treat!  My husband's family is Lebanese and he loves coming here for the meat and spinach pies.  They also have amazing grape leaves and salads.  Last we were there, they gave us a fresh pita off the conveyer belt.  It was still puffed and warm in my hands.", "business_id": "gCiKiqPGAC_ZVt5bBcwnrw", "stars": 5, "date": "2013-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "N64vMKFomI8c_ma1RPopUw", "review_id": "XECzOhybMnCeHtlqhZdi0g", "text": "A recent discovery of mine and I'm glad that I found it!  I loved the home-y feel of this place. There were lots of tables to work on, each with it's own individualized lamp! The artwork on the walls were fun to look at. The cup sizes for iced drinks are really big! A small is the equivalent of at least a medium (if not bigger) at a place like Starbucks. I'm lactose intolerant so I get soy milk but they don't charge me extra for it! (Usually $0.70 or more elsewhere). Parking is tricky but I always find a spot..plus the location is on a nice strip with other stores and offices so parking further down the street is worth the stroll.", "business_id": "DJKpwLp4mISNDNDpNz67tw", "stars": 4, "date": "2014-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4B3hc20yaGaSvWYmJInMiQ", "review_id": "cs7NGfsfDWgsqosvyp5BPg", "text": "Lots of seating area, open windows and coffee related gifts. I ordered the chai and wanted it without sugar but they gave me a sugar free version with sugar substitute.", "business_id": "1qUYk564SajvwTtkNM6KJA", "stars": 3, "date": "2014-09-29", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "iIBP5ooP6KmbCNQwkEvz7Q", "review_id": "EUpqQNTZ_EraB-rmj9DJmw", "text": "This place is the BOMB DOT COM.\n\n{does anyone still say that? I'm 30 and so out of touch with reality}\n\nBut I do know dessert and it's official. This place has the very best burnt almond torte ever. If you're reading this and thinking that sounds gross, it's not. It's basically a piece of the most moist cake you'll ever eat covered with slivered almonds and other goodness I can't describe. All these people below me can't be wrong.\n\nSo good that you'll rip open the box in the car and realize you don't have a fork but devour it with your hands because it's that good. I might have some experience in that department. Mayyyyyybe.\n\nEat cake.", "business_id": "yWVY1Bq19lDxu3BP7_96EQ", "stars": 5, "date": "2012-11-30", "type": "review"}
{"votes": {"funny": 5, "useful": 9, "cool": 6}, "user_id": "9OZH1Ecw-qUkCW5MS0NefA", "review_id": "lVRZUqT-kgJ9gkEOYh9I3w", "text": "I just came back from a visit to Jitters, and it has totally changed in layout from how it used to be two years ago.  The counter, which used to be against the wall on the Negley side, is now across from the main door on Walnut. I think the new layout is a lot better and more intuitive.  While the space is bright, clean, and welcoming, it's quite small, only containing six tables plus a few lounge chairs inside.\n\nI ordered a small cinnamon-cardamom herbal tea, and it was served nice and hot.  I didn't add anything to my tea, but condiments and napkins can be found across from the barista's stand where you order.  I also wanted a snack, so I decided to get a potato chip cookie, since (1) it looked the most appealing and (2) it sounded interesting!  It was saltier and crispier than a regular cookie, but was still also sweet, and had a drizzle of chocolate icing on the top.  While I liked the sweet-salty combination, I would have preferred for it to have been a bit sweeter to offset the extra salt--if there had been more icing, it would have been perfect.  It was definitely different and interesting, and worth a try, though!\n\nBefore I ordered, I overheard the barista saying to other customers that she didn't know where the baked goods that they sell come from, which didn't sit well with me.  (If you read the other Yelp reviews, you'll see that they come from Prantl's.) Employees should be informed about the product they're selling.  Having said that, she did describe the potato chip cookie accurately, which partially redeemed her.", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 4, "date": "2014-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "59A-ZxUMOgIl2MAnySh-Aw", "review_id": "5PbtDTc9Se1MRXZaxfNFyA", "text": "First, Giant Eagle is convenient. It open early and closes late on a daily basis. I have yet to find another store that sells the same variation of food in a unitary complex. And despite its size, the supermarket is clean, and the employees are knowledgeable on the status and location of most items.\n\nSecond, the prices for non-produce items are competitive if not better than nearby competing stores. The produce items tend to be more expensive, but, to be fair, nearly all if it is fresh.\n\nThird, Giant Eagle offers a brand guarantee and a return policy which assure customer satisfaction; that is, you can return items you are dissatisfied with. Obviously, this is a technical component that is rarely considered when food shopping or dining; however, it is nice to know that the company has a firm faith in the products it sells.", "business_id": "Tfysaq2SdZAc5_TyPpuyLA", "stars": 4, "date": "2013-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "n-EzYQ1fWf3DLkb5g6F0vQ", "review_id": "044eUjvTOl1IFewZd4HYBA", "text": "I'm visiting the Shadyside (Eastside) area this week for work and decided to swing by Le Mardi Gras on my first night.  As I was walking down Walnut Street, I passed by this place and after an initial glance I didn't really think to stop in.  However, thanks to some quick Yelp research I decided to give this place a try and I am definitely glad I did so.\n\nRight out of the gate I noticed that this place proudly bears the exuberant charm of an old school Vegas bar - between the jukebox, the cigarette machine, and the velour decor, I was instantly transported back in time.  I would be remiss if I didn't mention the fully functional retro gold-plated cash register that looks it like a dropped out a time machine from the 60s.  Definitely one of my favorite features adorning this establishment!  I should also point out that this bar has a strong allergy to plastic - no credit accepted so be sure to grab some cash on the way over to avoid the $2 ATM fee per transaction. Not terrible but worth mentioning for the exceedingly budget conscious folks.\n\nOne of the reasons I chose this place was due to its reputation for very strong drinks.  I completely concur with other reviewers that the drinks are as strong as I've ever had any establishment.  Every drink was pretty much a double or even triple compared to any other typical bar.   As you may have imagined, people don't come here for the food.  In fact, the only food they serve are small bags of chips and pretzels kept behind the bar.  I had to leave after an hour or so to go get dinner, though I definitely came back for more nonsense after eating!\n\nThe jukebox has a wide selection of music from the 60s all the way up into the 90s - plenty of options to suit anyone's taste really. Also, as another reviewer noted, this place seems to be popular with hipsters and men in their 60s. In any event, everybody was in good spirits and seemed to be pretty outgoing and open-minded. Most people I spoke with seemed genuinely happy to converse, and either already knew or wanted to get to know one another.  I had some interesting conversations about Pittsburgh and its history with some locally bred patrons.  The bartender was absolutely phenomenal - very sociable and was obviously a big hit with all of the regulars.\n\nI'm staying in Shadyside the rest of the week, and am planning to check out some of the other local spots. That said, it seems Le Mardi Gras is a bit of an insider's secret - a sleeper, perhaps - where only those in the know appreciate it for what it is.  I definitely recommend you stop by next time you're in the area, at least for a drink or two. As long as you don't mind the smoking, a couple drinks will put you well on your way for the evening whether you decide to stay or move on!", "business_id": "TIPebazlAGJsp8zAwhNkcw", "stars": 5, "date": "2015-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rWbf1_mdXUylzI3jLKKbig", "review_id": "bERboNn1T7gBKRsUmZ8XWw", "text": "Convenience is always important", "business_id": "P_Ks4SYvo_m4pHlPE8rOUQ", "stars": 3, "date": "2012-10-23", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "J5kidvVDdJ5AdnaPZhhLFA", "review_id": "1Cus8S_e41PnbHkEQXP1fg", "text": "Forget about Starbucks. Coming from Miami for a business meeting I stopped here. These are the friendliest people you can find and the coffee is the best. It was a refreshing experience.", "business_id": "frnJyUd335JCPDjKHc75OA", "stars": 5, "date": "2011-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "xQs52Mg9CfccwDjZ2oxAOA", "review_id": "hFHVxnwmaXXBfV6rVmk5iA", "text": "This place is great for someone like me who drinks tea and not coffee. I cannot tell you a single thing about their coffee, but I can say they have  a much better selection of teas than Starbucks. They also have unique flavor shots like lavander to create an spunky and unique drink to suit your personality and taste bud needs LOL!", "business_id": "3rhh2kvu3F45jD_yCxdW6Q", "stars": 3, "date": "2010-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "UHy434M0cCViYjNYBnLnkg", "review_id": "LM0ZlzCkm2Ie-r-fkQ2ETA", "text": "About me: female, New Yorker, foodie, design-lover\n\nLa-Tea-Da's did the reception catering for my wedding. Kelly Matthews was my catering lead and Jessica also helped on the day of the event.\n\nMy expectations were dramatically exceeded. I would recommend them to anyone for these reasons:\n\n1. Flexibility - As an out-of-town bride, Kelly was quick in responses, edits to estimates and suggestions to queries via email since I couldn't attend in-person meetings too often.\n\n2. Professionalism - Team worked so I didn't have to think about anything on the day of the wedding. They even prepared plates and drinks for my husband and I so that we didn't wait in the buffet line and had a few minutes at our table to eat before crowds arrived. Jessica helped by directing us during the event as well and giving us heads up on timings. In addition to food, they helped set up decor - even lit lanterns and candles on tables!\n\n3. Fair Prices - I wanted interesting food combinations, which doesn't usually go hand-in-hand with reasonable pricing for a big event. However, Kelly was great in offering many choices and speaking to the chef several times to ensure we had great variety.\n\n4. Presentation - Food was displayed beautifully. Kelly gave helpful suggestions on how to set up the buffet for good crowd flow throughout the event. My favorite presentation was a small bamboo plate with a BBQ slider and homemade potato chips - delish!\n\n5. Quality - I received a lot of questions about who did my catering from friends who are also in the wedding planning mode. Guests loved the food and flavors were appealing to all.\n\nAgain, can't recommend them enough - definitely add them to your list when interviewing caterers!", "business_id": "GIqmLJsJYuzwrj7oviJ_KA", "stars": 5, "date": "2011-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dlwI0b45ia67-Yp4oMG8Pw", "review_id": "xJayjChOK0FJzy-Z2kyRDg", "text": "I love D & D.  Everything is always delicious and fresh.  It's your one stop for movie snacks, a quick bit before you catch the latest Ryan Gosling flick or just a chill evening on the patio with friends and a bottle of wine.  D & D has a lot to offer from sandwiches and salads to massive brownies and lattes. I like going to Dean & Deluca when I want really good food without the fuss.  Just pick what you want at one of the counters, pay for it at the register and your done! \n\nD&D also serves a pretty decadent breakfast.  I went for brunch the past Sunday.  The chocolate chip pancakes are amazing, packed with dark, milk and white chocolate and cooked to just crispy perfection.", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 5, "date": "2013-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s9I4KMcrHKki44g_eTrYqQ", "review_id": "s26GOtHSbnSMKy4iXs-bPQ", "text": "As the other reviwers have commented, this store is a lot older and dingy-er than the South Blvd. store...and echoing Cathy, I wouldn't want to shop here at night.  Still, it's nice to have this store as an option. Also, I have found some really good stuff on sale at this location. \n\nIn addition to the vast vitamin/supplement selection, I like their vast selection of bulk spices, pet food items, and health & beauty items. This store has a pretty decent wine selection as well. \n\nIt would be nice if HHM would open a store somewhere out on the I-485 perimeter between Pineville & Matthews. I  believe that this area can support several more healthy stores.  Even though consolidation through mergers & acquisitions is the name of the game in corporate America these days, competition is certainly good for the consumer!", "business_id": "I3oqfVYgp9_xCMXnGUsmHg", "stars": 3, "date": "2011-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uc4QurS1XrvyiIpne2IbhA", "review_id": "HmDR9zhK4TsUAgvH47jlVg", "text": "Came here for a to go order for lunch. I got a ham sandwich and potato salad. Ham was melt in your mouth. Potato salad was ok, nothing spectacular. Restaurant was really clean!", "business_id": "kCFGPmD5fP8YsmSTPjaCyw", "stars": 4, "date": "2015-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2-uR7a5losM7P_PAZdws3A", "review_id": "dKc_-awQf1YqgPbTDdY9Ew", "text": "There's a wide variety of sandwiches to choose from.  The chunky chicken melt kind of tastes like Thanksgiving, I don't know how to describe it better than that.  It was just really good.  The ice cream was pretty good.  I've had better, but not very often.  The service could have been better.  The people just kind of seemed uninterested, if that makes any sense.  Overall, I'll probably be back if I'm in that part of town, but I won't seek it out.", "business_id": "M8CC5_9vEvt1yOI2pnkvKA", "stars": 3, "date": "2008-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VnFl_8krq7W6t1XuB9OcYQ", "review_id": "sFBr1xVECQFR6C07AEZWTQ", "text": "Great customer service experience with Chris who works as bagger / cashier. Great attitude, knowledgeable, hard worker.", "business_id": "yP20Y-TVGZ2sUNGGLzJ5Fg", "stars": 5, "date": "2014-11-21", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "OtpHvQFGbZ4sONaQAXankg", "review_id": "PfR8qMNCIL8uKVJC7u6onw", "text": "This is a sorry excuse for a grocery store, and it stinks that it's all we have in De Fo. The redheaded stepchild of the Copps family, this Pick N Save can always be relied upon for brown, slimy produce, generally rotten selection, and long check out lines. If I have shopping that involves any serious produce, I head to Sun Prairie. I mean, any store where you find LETTUCE and BROCCOLI in various stages of wilt--seriously, this is basic stuff, folks!!!!--has no justification for being in existence. The other day I grabbed the only remaining spaghetti squash in the store and neglected to notice (as did the checkout person) that one entire side was completely soft and rotten. I guess spaghetti squash is EXOTIC for these parts, but STILL. I've decided that the produce department's MO is to either sell the stuff or wait until it dissolves into sludge. Preferably evaporating afterward. \n\nAs an added bonus, the ethnic section is a joke. \n\nCan we PLEASE have a new grocery store already????", "business_id": "z4UT-fCutzV_LBdhxhVHAg", "stars": 1, "date": "2014-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gQu-piYPLc3sUgnd7sVbwA", "review_id": "y2R-dnI2MEQ4v2S_JlgFNA", "text": "Looks great. Smells great. When they told me it would be a 30-40 minute wait for a breakfast sandwich I cancelled my order. Seems like an unworkable business model. \n\nHire another cook and install another stove. Came all the way here from Spring Green--sad face.", "business_id": "ShEYKerTwb2LSORE5o_s7A", "stars": 1, "date": "2013-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "R04P35fYVS4HASyBuMcElg", "review_id": "Y9r6tGwMNdfT9kiQPsFNRw", "text": "Culver's famous Butter Burger is a great step up from classic fast food options like McD's or BK's, but isn't at the same level as Red Robin, In-N-Out Burger, or Five Guys'. That being said, it is still delicious, and, since there are Culber's restaurants all over Wisconsin, it's convenient.\n\nThe real reason to go to Culver's is for their custard. Concrete mixers are where it's at, and, if you're not careful, you'll move to Wisconsin 40 pounds lighter than when you move out.", "business_id": "kiAsweI4sOjDzGyz3Y_HsQ", "stars": 4, "date": "2014-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q9pS5hPEYqraNORB8gLbLQ", "review_id": "XGefhSmuU91M2ujIEn8ULg", "text": "The beer garden rocks.  Whenever I've gone there has always been plenty of servers, the prices are reasonable & many times there is live music for a minimal cost.", "business_id": "Wn8NhS-L1ck6jbTjX88Kkg", "stars": 4, "date": "2014-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eOLeiz-4SQZEscz5PjAxdQ", "review_id": "PvCJolLtHHwkskBoHcqiSg", "text": "SO happy we stopped here. Wisconsin cheese, wine & beer...perfect for dinner!!! We tried about 10 cheeses and fudge. ..they were all so good.The dark chocolate caramel salted fudge was delicious. Glad we stopped here and so will you. :)", "business_id": "jpxlSFhdrtbNyxS6vB036A", "stars": 5, "date": "2013-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fTy3bA0439l01Q8Hd1O8Vg", "review_id": "HUPWRhHr03YO9YcNTrnwgQ", "text": "If you go here for the muffins only,  it's 5 star. The food is never as good as I want it to be.  The cheese in the ham and cheese omelet seemed processed and the ham seemed canned.  The turkey is processed butterball. Stick with the bakery.", "business_id": "yYIEKwgQUHJpySOcVdCAkg", "stars": 3, "date": "2014-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1CSsDXtGl2Tfh9iEJBJjLw", "review_id": "J9fr5PMphe7ZBDuSH7Mv_w", "text": "Jennifer Street Market is the ultimate example of a neighborhood grocery store.  It is a short walk from my house so we go here all the time.  They have a great fresh meat counter, produce section and overall selection.  Even though the store is small you can find pretty much anything here, including a lot of local and organic options.  I have a fun time coming in because the owner is continuously adding new products (although many don't stick around) and there are often nice sales.  Prices are comparable to most larger supermarkets, cheaper in some cases.  The staff tends to be friendly as well.  This place does not take cards of any kind although there is an ATM on site and they will refund the $1 ATM charge when you purchase your groceries.  They do take checks and cash.", "business_id": "MLD-FXAHLbdiHOcyeoW-Fg", "stars": 4, "date": "2015-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "j94qbZMCz4b4pbgm1U4PVQ", "review_id": "qSXWMzw8q8535NKcM45_pA", "text": "Jim's completely rocks! John (part owner & tall, friendly guy behind the counter) will take time to talk with you about your wants & needs, and will special order anything you wish. I say this because he did it for me many times over the years that I lived walking distance from the store. Their fresh, Amish turkeys are the best you can get for Thanksgiving. You do need to order those in advance, however. If you don't see what you're looking for in the display case, just ask. He would custom cut a chunk of center sirloin for me - he always had a primal in stock, not frozen. \n\nHe would let me hang out in the lobby and talk meat on Saturday mornings, between customers. I wanted to help out behind the counter, just to learn from the team, but they hire young people to work the counter, and I couldn't take a job as a hobby that someone else needed to get thru school, etc. \n\nLong story short - If you like/love meat, but can't tell a ribeye from a strip, this is the place to go. They will help you make a decision, and how to treat the meat if need be. \n\nRemember - the only stupid question is the one that never gets asked. You needn't worry that you will be looked down upon if you ask a novice grilling question. This is not a pretentious boutique. It's a friendly, helpful business that truly values your business, and they will help you make some killer meat!", "business_id": "WxfedycTcbQO_GuXHo9Ypw", "stars": 5, "date": "2014-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1RveMKg4_GYE3HL9aUX-rA", "review_id": "YiX_jw5TTlBu4GXbxIFKHQ", "text": "I love Cafe Zoma. I just discovered this place about two months ago and have visited about a dozen times since then. I really love the outside yard in the back where there are several tables and a play area for kids. This is very important to me since I have a one year old and a two year old. I also love the access from the bike path. I would highly recommend a smoothie, they are great. However, if I go in before work I usually get a Cubano, cause I need to caffeine to help wake me up in the early mornings. I've also had two different sandwiches and both were very hearty and delicious.\n\nWhen I go I'm usually there between 7am and 8:30 am and I've never had to wait more than a few minutes for my drink. I will actually come here over Starbucks when I'm in hurry because Zoma is always quicker.\n\nI'm giving five stars even though I have had one problem with a drink I ordered not being hot enough, not even close to the temperature of the times that I ordered the drink before. However, I'm am not counting that against their rating since the employee I talked to about it was great and offered to give me a free drink the next time I came in.\n\nI think that have a great staff and great customer service. If you haven't been I highly suggest you stop by sometime and give it a try.", "business_id": "UV9c6A16IXXA7JmkTor8Tg", "stars": 5, "date": "2011-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "4_6Q7K5Dm0rEj7ksOnYUbw", "review_id": "zK502In3lNqL-2LHm6IPrw", "text": "This is the place.  Now known as La Rosita. The grocery selection is fine, great hot sauce selection BUT go on a Saturday or Sunday when you can order freshly prepared taqueria food as good as any I've ever had, and I lived on Milwaukee's south side most of my life. \n\nThe carnitas are terrific, just had to say it.  I bounce from the torta with your choice of meat (and bear in mind this is a butcher shop, so they make their own barbacoa and carnitas and marinated chicken, lengua, etc), to huaraches when you can get them, to just a simple soft taco.  This is the real deal, no Taco Bell Doritos taco here.  At $1.75 a taco, and they're huge, wow.  Oh, and the salsas they make are great, the red has a mighty nice zip.  \n\nOh, final word - house made chorizo.  Holy crap.  OK, that was five words, but it's unlike any I've had before.  Complex, perfectly spiced, a slight hint of cinnamon, not greasy, simply great.  You can order it on to-go food at the taqueria on weekends, or by the pound in their butcher shop (raw).  I use half, freeze half.", "business_id": "Py2Jmwm7QXZRCVJ5hnPXgw", "stars": 5, "date": "2013-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eSq-LyRk_RsYjbeSKVWFhA", "review_id": "KN6qhuA6Y1GxK4PNh-keag", "text": "I've been going here for nearly a decade. Their meat section has definitely improved! They sell even the \"throw away\" cuts! I love organ meats and the odd bits and quality items are difficult to find in the Madison area! Their cheese section is quite good as well; they sell small ends left over from packaging cheese and it's a great way to try new cheeses! \n\nI do miss when they were open 24 hours. They also used to sell Bawls (favorite energy drink!) but I haven't seen it here for a few years now.  \n\nOver-all, I'd come here for more uncommon meat cuts, cheeses, and their excellent selection of fresh produce. Oh! And their to-go sushi is actually very good! I have never had a problem with their quality!", "business_id": "OxR3b_qcMJlzwzGPU5fmdA", "stars": 4, "date": "2014-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bzNg-1AhkueCCXnRUtzSww", "review_id": "zhjKlfJ32IGAHqsw0pEVqQ", "text": "Incredible coffee! JBC has opened my eyes to another world of coffee I'm excited to explore.", "business_id": "yg-a8RuKe-_uiPyrwmGogA", "stars": 5, "date": "2014-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nuDluohucnGMT2K0Id8jYA", "review_id": "qedsROLCbn4TvoGiq_1MCA", "text": "A little pricey for what you get, but a cute shop close to the action on campus.  Baristas were a little cranky, but not overly so.", "business_id": "40KhR3J9snVooFfTdc-8ZQ", "stars": 3, "date": "2011-10-21", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "HANb8-8InWnju-XzBQQSBw", "review_id": "5jQ82CcVdymq17uUzmk88Q", "text": "Join the co-op, work a few hours a month, get a nice discount on organic foods and bulk items, plus eco-friendly cleaning and paper products.  Meet great people.  Simple.", "business_id": "Q9eZS4qDdJo1ker0w3wnMg", "stars": 5, "date": "2005-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Xc1dIj1B5KEMGI0kpK1j6w", "review_id": "MT0shTg3xTWXHrY2tCQeQQ", "text": "Yes, this place may have a wide variety of groceries to chose from, but the quality can be horrible. Be careful to find the expiration dates, because you can often see cans expired for years and still on shelf. Also, be aware that some of the bakery stuff be moldy before you even open it. \nI still shop there when I must, but usually AmKo or Green Onions are  much better.", "business_id": "BnHVssX00VthoSNsMVO51g", "stars": 2, "date": "2008-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BvGV9lMMUmB5hLWkNlY3vw", "review_id": "RdWkE_neoEGhWcebwrAkAg", "text": "Love this place. I used to live basically upstairs and this was my go to spot. The atmosphere is very chill, the coffee is always good, and the food is perfect for a light lunch. No compaints here!", "business_id": "yzInxReAkf7r0aRbwj02Yw", "stars": 5, "date": "2010-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xkOQUAqnU-u6qSj9pBtukA", "review_id": "UTXV5958X86G2kOBF3dEdA", "text": "The donuts here taste stale and the employees aren't the most welcoming people. This location seems to be out of the donuts I want consistently. This place is really fast with their drive thru service and their indoor service. I enjoy getting the $1 coffee. Their breakfast items are good. I like their egg and sausage croissant. Dunkin donuts coffee is best enjoyed with cream and sugar.", "business_id": "xky2rWT8kpsdyJ4YgZB3Jw", "stars": 3, "date": "2014-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "sUrU9l3_f1iWYZdLmop0Rw", "review_id": "vvNYMybEr5InwTu2CwCfNA", "text": "Custard Cup was my friends and I's place to go in the summers! They have the best tasting Custard around! You can create your own mixture with their large variety of toppings! It kind of reminds you of a Dairy Queen but sooo much better!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2005-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "XOnwygK-EerILmQSxP2K6Q", "review_id": "dYCpAu5aB0pohLkWxhkFQA", "text": "Apparently this is THE place to go for custard, and I agree! Jarlings has the largest flavored custard menu including fan favorites like vanilla, chocolate, strawberry and I believe, orange. They also offer a weekly specialty flavor.\n\nI'm still not the biggest frozen custard fan (hence the three stars), but Jarling's, nonetheless, is still satisfying. They offer sundaes, scoops, concretes (custard with mixed in candy or flavors, i.e., they make a \"grasshopper\" concrete).\n\nJarling's also has a classic, 1950s ice cream drive-in spot feel to it. There's limited seating inside, picnic tables outside, a drive thru window, ample parking, and high school kids in tye-dyed t-shirts taking your order.\n\nI also suggest getting a pint or quart to go. It's much cheaper than eating an order there.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 3, "date": "2011-10-22", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "NfqZsolVYraWFmaco8D9Nw", "review_id": "kz1DEQpOjWeMS7eHcYEcqw", "text": "It pains me to say, this Safeway is HORRIBLE. Usually, Safeway is my favorite place to shop. Over the years, i have had countless wonderful experiences at various Safeway's across the state. And I have been known to express my love for Safeway numerous times in public. I don't know how it's possible for a manger to screw up a grocery store more than this. Doesn't corporate come by every once and a while? \n\nI am grateful to read that I\"m not the only one with this impression. Every time I go, they're out of something. And I\"m not talking about Peruvian Wild Goats Milk or some other obscure specialty food. I\"m talking basics. Bread, milk, soda.\n\nBut my main issue is their Signature Sandwich Deli. It is atrocious. A few years ago, I remember people would be lined up to get their sandwiches here. Not anymore. The service is incredibly slow, the sandwiches are made poorly and there is always something missing, or low. And getting a bin refilled seems to be a monumental task, so it just doesn't get done. Today, they hadnt' refilled the artichokes. When I asked for artichokes, instead of refilling it and giving me artichokes, the guy behind the counter took the artichoke JUICE and dribbled it on my sandwich, making it impossible to eat without a fork and spoon later. I just don't ever recall that a sandwich required silverware. \n\nThe time prior, I went and they were out of tomatoes. Huh? IT\"S A GROCERY STORE! Walk over to the produce and pick up a tomato!\n\nThe time before that, I just wanted a chilled Coke. Sounds simple. Popular brand. Large grocery chain. What could possibly go wrong? Well, for one, they hadn't stocked the refrigerators by the registers. When I inquired about getting a coke, the staff looked at the cooler that had 2 Dr. Peppers left and asked me, \"Well, do you want a Dr. Pepper?\"\n\"NO! I want a Coke.\" \n\nNo matter what I go there for, I can't seem to get out of the store without some type of issue. But sadly, it's the closest store to my downtown office. \n\nRegardless, if you have a choice, skip this Safeway, there are plenty of others that will win you over.", "business_id": "7Z7IkR_-94AjUuDw0fbI7g", "stars": 1, "date": "2008-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0LuN0DGTCkzpjAD3NyNN8w", "review_id": "lzeyxhDbKY-zV19e2sPCYQ", "text": "Places like this are the highlight of living in Arizona. Good access to cheap, delicious and authentic Sonoran food. I tried Chilaquiles here for the first time and they were amazing!! The horchata was pretty run of the mill but the empanadas were fantastic! \n\nI also really like the market they have. A really great place to have in the neighborhood.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2010-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YXiTWdPwuY5uXSUPfZZhRQ", "review_id": "d_cpAYbkFmcYIDFANSfrjw", "text": "We are from out of town and was staying at a local hotel. Our family loves hole in the walls. On our way out of town we saw this place and decided to stop in. I love the smell of the authentic Mexican establishment. We were behind 6 fireman that were ordering their lunch. Watching their food be prepared was a treat. But not as much as our treat when we ate our food. We had the shrimp salad, shrimp burrito, and chicken taco. Everything was great, great, great!", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2014-11-17", "type": "review"}
{"votes": {"funny": 10, "useful": 8, "cool": 7}, "user_id": "eshIqohS-9FMLdKOhTr2Ng", "review_id": "V1J2SB02PYq7q5Nw6sl-WQ", "text": "This place is the place to go for when you plan to throw a BIG MEXICAN/LATIN FIESTA!!! Si, si, si!!!!! :) \n:) They are awesome, It reminds me of Mexico and its Open-aired local markets. Great prices, freshly made corn Tortillas and its also the perfect place to request freshly grounded masa. Thats if you know how to make Tameles from scratch.\n I have never dined there, but food looks good!!  I LOVE THE AGUAS FRESCAS!!! OH SOO AMAZING Horchata, Fresa, Sandia and Papaya water!!!! :) YUM, YUM!!!\nGreat service, big smiles everywhere and a large variety of products and produce!!", "business_id": "VXIkI9_EbDbYHeO9IzKjJg", "stars": 5, "date": "2012-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6Md4YISMG26N004XSHhUqw", "review_id": "BeV2SpoaVBb_HhpKaUHZlQ", "text": "My husband and I had a hankering for donuts one afternoon.  So we decided to try rainbow donuts. We've lived in the area for 10 years and never thought about this place. My husband is a die hard DD fan. \nI decided on old fashioned and buttermilk. The buttermilk was so good! Crunchy on the outside, moist and buttermilky on the inside. Yum yum! My husband got the jelly and Boston cream. The Boston cream was a Boston cream - delicious!!", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2014-11-24", "type": "review"}
{"votes": {"funny": 2, "useful": 8, "cool": 6}, "user_id": "0bNXP9quoJEgyVZu9ipGgQ", "review_id": "5Zy-Mbr_A9EWyzpjqe84Yg", "text": "07/01/10\n\nAfter my overall disappointing meal (had high hopes after reading rave reviews) at Tortas El Guero, I decided I'd check out the ice cream here- thanks to the recommendation of the TEG server.  Again, the Mexican rep behind the counter didn't speak English, so it took awhile to convey my wish to try a couple of flavors before settling on one (she kept asking if I wanted the flavor in a cup or a cone!).  I was at the point of giving up and just walking out when she finally figured my question out...\n\nBoth flavors were so good, I really had a tough time deciding!  Ah, but I do love coffee ice cream, so...  I still dream about the coffee here, so a return visit is in order very soon!", "business_id": "9pYBiLe3k5Gi-AJqRklXcQ", "stars": 4, "date": "2010-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Q6FaSZpCtVv7PXECwDL1bg", "review_id": "yPKhzxCfbSKzTN4XIqYi0A", "text": "Costco has pretty much everything you could possibly need, including \"food-sample-giver-outers\". I like to purchase gas at the Costco gas station next door and then walk around inside, sampling each and everything available. I have to admit that I have snacked for free at Costco numerous times.", "business_id": "XLqnjlLYt0_q_NG7l_BpMA", "stars": 4, "date": "2012-09-10", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "IP3nF56J-9NEuW7fq29SQA", "review_id": "2lUJRZNhv06uASM-w2AeOQ", "text": "Great food in the mornings to eat in house. It's like a grocery store/restaurant. Omelettes and baked goods, coffees etc. my omelette was great, coffee was fine. Massive portions. \n\nAs for groceries, they have an okay gluten free section which is why I go there. If you like to bake they have a million and one different types of flour. The fresh food is good but get there early by the end of the day it's more slim pickings. Prices are very high on most things because they are fancier brands and a lot of organic etc.\n\nCashiers are kind of slow and they offer you a bag of ice and then charge you for it, without telling you they will first...so that sucked but otherwise this place is decent.", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 3, "date": "2013-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wQAIt2AwAnX8XKJ1JiNzAw", "review_id": "jFMcJZbIJDUn-PK3ZvXmog", "text": "This Walgreens was in major need of renovation and boy did they hit this one out of the park. Walgreens new company style and service has far exceeded my expectations with this location. I've been here numerous times for numerous reasons and have never been disappointed with selection and customer service. I highly recommend anyone who wants to check out the new revamped Walgreens at this location.", "business_id": "HfWkdqxegjiGEXzI8j7Wwg", "stars": 5, "date": "2013-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QBQlErZajdIyXX84dvFUnQ", "review_id": "FRB3W0Dq_7fSs8ILV_7t2A", "text": "Dam I wish I would have known this place was here sooner. Really good sandwiches. They use Boars Head meat which I am a huge fan of. They have so many different sandwiches it took me a while to figure out what I wanted. The menu is kinda all over the place. There is a menu board but its old and fadeed but they have white papers with all the sandwiches hung up all over the wall. The staff  are very friendly and I'm sure this place has many regulars. Inside its a tight squeeze with limited seating. The macaroni salad is great as is the potatoe salad. I love the sicilian sub. The italian dressing on it is so really good and I think thats why I like this sub so much. My other fav is the club on wheat. Oh yeah I think Ill go there agin today. Sanwhiches range from $5.95-6.95.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 4, "date": "2010-10-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Snr-iImWYYD_a_7Iar3E0w", "review_id": "OdL7DGXushbKPfT6zYeGfQ", "text": "Went there for lunch because I heard this place has sandwiches. I bought the Southwestern Chicken flatbread for almost $5. When they pulled it out of it's little bag to cook it  I just about asked for my money back. The thing was small for the price but I guess they are basing it on the calories. It isn't really that bad but I'm still hungry. Probably would not go there for the sandwiches anymore but just for the smoothies.", "business_id": "a5N-FJqNPOmhoTV5JkQrww", "stars": 3, "date": "2012-10-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "2uIF-P-YkMt6aFMV0zVskw", "review_id": "k4g3Gz2TvnMByKA4zKF9HA", "text": "I had there light rail creme ale BBQ chicken wings and to beer& what else to wash it down accept the light rail creme ale brew. That is def my fave light beer. The wings were flavorful,crispy and delicious white meat. Small factors that i didn't like:the cardinals game was not on the tube,slow service but over all I say there are more pros than cons'. GO AND CHECK IT OUT", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2010-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TOAn9VLmBZJEvzerHgha6Q", "review_id": "UmrdDTSLsjfkHCzij7mGGQ", "text": "So many better breweries than this! Attempted to use a 50$ gift cert and was told (after I ordered beers ) that they could only be used in $15 increments once a year... I was still responsible for the beers because she had poured them. She conferred w mgmt, same response. I explained I don't live anywhere near there and would never use them again. Her response was \"well.. You can always... Well... Uh, just give them away.\"  Great, I'm sure that was the intended use when a friend gave them to me for my birthday.  If the \"mgmt\" of a local place doesn't have the  sense to make it a worthwhile experience for their paying customer, then what is there to do? Very disappointed in their service. Ps I've bartended before and never seen someone grab the ticket and then dunk it on top of the drink they have going out.  I witnessed this time and time again. She would grab and hold the ticket, then dunk into the top of the beer. The waitress would grab the beer and scoop out the ticket. Necessary? No. I will not be back.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 1, "date": "2013-10-18", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 3}, "user_id": "wy8Yd_vCWDjiz9rMo4HfqA", "review_id": "XAxjfYqDkOVDrSXsb61-SQ", "text": "Just was not impressed - with the food or their beer.  The service was friendly - but everything that came to the table left me wanting more, with the exception of their fries - they were spot on.  It just kind of has a feel like it's someone's hobby rather than passion if that makes sense.  There are some amazing breweries here in the area so the competition is incredibly stiff, you kinda have to do something to stand out among the crowd.  I can't with good conscience recommend this to any of my beer friends, so the only time I'd consider coming back would be for a happy hour.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 3, "date": "2015-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oEEmCHxVTjj9012Nz-XVMA", "review_id": "4X6eyQ_OH8CIn8ma2dFcug", "text": "Schreiner's is a definite triple threat.  The staff was not only cute but extremely entertaining and best of all they have slab bacon.  By the time I got out of my car it had a great hickory/bacon aroma.  I can't wait grill this up with some filet medallions.  I definitely will be back to try out the sausage.", "business_id": "XRBTHOXaJK_AJ2wy5mX_1A", "stars": 5, "date": "2008-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "NNdfPF-UhvLB8FxbsuSC5A", "review_id": "fBWRpoZhLp3U_aUfQtp80w", "text": "Anything you can think of that has to do with baking, this is the place to be.  They have everything you are looking for and need.  Boxes, decorations, candles, and supplies.  Their prices are very reasonable too.  If you own a store, make sure you apply for their resale program where  you can get almost everything at the resale price w/o paying for taxes.  For boxes, if you get the bulk sizes, you will save even more.  I've been shopping from them for about 2 years now and I can't think of any other places where I would get all my baking supplies.", "business_id": "XAaXT0e70-USVYVKcnljsg", "stars": 4, "date": "2013-09-20", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "_PzSNcfrCjeBxSLXRoMmgQ", "review_id": "g4m194qtpdk7OCX1poWE4g", "text": "This Starbucks is a bigger place than the ones I normally go to.  And everyone there has a laptop, ipad, or holding something electronic.  I felt the need to take out my cell phone and hold it.  he he he...  Everyone (customers and employees) are friendly.  They got the order spot on.  \n\nWhen we were leaving there was a GOOD dog sitting by the door with his leash not tied to anything just waiting for his owner.  Awwwwww....", "business_id": "TGb6D6zmx1KP4aDDH5Aihw", "stars": 4, "date": "2012-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hl9v4UgOeNw7cbUD6P5xMg", "review_id": "Ut1A5dcy2st7i_8ja9hSiQ", "text": "Pharmacy: They only have 1 person staffing this location. Takes more than 30 minutes to fill a Rx.", "business_id": "Qbt8Y1Ra3RDtHPUyW7no5w", "stars": 1, "date": "2012-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pxSJnxAYE6PwUiyvMIWSjg", "review_id": "5hwFIRAoJX8TkrRepTr2XA", "text": "Awesome Polish Pastries", "business_id": "jSEcE8AY-mzGq9EOiyrtng", "stars": 5, "date": "2011-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RRf7-87rgLPLPd66fiJJWQ", "review_id": "CfKZ-U9_Y__czHLp122g2Q", "text": "We had some solid meatball sandwiches and the service was excellent. I found the homemade bread no better than supermarket though.  The prices of the menu items on the were high side and the grocery items outrageously expensive. I'll probably be back just to try something else.", "business_id": "T5HYqRADhAL6VPRAacz74Q", "stars": 3, "date": "2015-10-18", "type": "review"}
{"votes": {"funny": 5, "useful": 5, "cool": 4}, "user_id": "gyq22D54Y8qoj8VQ7JU0Uw", "review_id": "4f9iuReXivloHq6xL6WimQ", "text": "Not sure of why I stopped in here today, curiosity maybe? I had to shop at Ritz Camera then Best Buys for electronics and I found you in-between.  Now I have my favorite(s) Sandwich stops that I frequent (we should have just driven over to the Vermont Sandwich Co) but curiosity killed the cat, i now know why.\n\nUpon walking in, we noticed it was desolate, but very clean (extra stars for that). But found we were having a language barrier problem here... I spoke English, not really sure about the other side of the counter. Now I know the workers know what's on the menu and the proper way that they'd like to receive that order, but never being in your diner before, I found them very short tempered and impatient with a newbie. Not outright rude, but cold and unwilling to explain. Anything.\n\nYour cafeteria food was very very bland, I order the Corned Beef, cup of Chicken Noodle soup and was TOLD fries came along with the sandwich (I wasn't told that I could have picked another side, other than your fabulous stale fries) I shouldn't even mention the bread choice fiasco. The pie was disappointing and your 'fresh' brewed iced tea tasted like someone left the dishrag in the bottom for added flavor, at least there's water. I didn't try the Mac & Cheese my son had, but that was left behind too, I guess I should have for the re-cap discussion in the car ride home.\n\nSorry guys... I wish you tried harder.", "business_id": "fmuj7u1gflmEjW-h0v9bwg", "stars": 1, "date": "2010-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Pjs5Fq7n6wJ9zSoGJGhWJA", "review_id": "nXq_7sovszohJhfu2gSxew", "text": "Had the stuffed cabbage. delicious!!!!!!! Side of veggies and water. Will definitely be back.", "business_id": "fmuj7u1gflmEjW-h0v9bwg", "stars": 4, "date": "2014-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "3uU_6L8GnFOHTsO4I3oedg", "review_id": "4LM2n_IoQMlMHql-Fe7uqw", "text": "I do love the Cheesecake Factory. You can't really go wrong here, Pretty much every dish is gonna be good. I had the Mac & Cheese Burger. FANTASTIC! Just picture a juicy savory burger topped with a patty made of Mac & Cheese. I loved it.\n\nMy only complaint is the menu is too big! Takes me forever to pick something, Everything sounds soo good. Not a bad problem to have.", "business_id": "2r8jGeuYvMkyP2ik_X-Bxw", "stars": 4, "date": "2013-10-27", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "hjJPKQ1Ah91h3fVbc8GsOg", "review_id": "mknjQozHkvM6eYgKY9QL_A", "text": "La baguette was très bon! pardon my franglish! I have more reason to frequent here now, to improve my francais!\n\nI was glad to know that my \"Bonjour!\" was elegant enough to the native ears of the French owner.  :)\n\nIt's been a little while since I last heard the authentic tones of a Frenchman/woman, so I was immediately pleased. woohoo!\n\nAlthough I have not tried everything on the menu, just by the look, vibe and first indulgence of their \"sandweeeesh\" I will critique it now!\n\nI had the Parisian (Paree-zee-ahn) baguette and it DEFINITELY did not disappoint. EPIC PASS.  I was very impressed on the tastiness and freshness of the ingredients.  The bread itself had the desirable softness and texture that I would expect from a genuine baguette (as I had in France).  The saltiness of the ham, the balance of the mayo, the eggs and lettuce was just superb! I truly enjoyed every bite!\n\nI had a side of pasta which tasted kind of fresh and dressed with I thought was bleu cheese (I didn't clarify with them).  For beverage, I had a very good tropical tasting, iced tea.\n\nI thought the decor was friendly, warm and inviting with French artwork while music played in the background.  The owner and his wife basically run the show.  They were very friendly and attentive.  I will strive to come here as often as I can so I can fine tune my French.  I have a feeling I will make it through most of their menu! The smoked breast of duck sounded intriguing! j'adore duck!", "business_id": "wftoNIA0Q8nX-Da47psBCA", "stars": 5, "date": "2010-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "_JUAxvr5DSEcHTvvXnUsxg", "review_id": "HVzSEn8bjnzUsn44yARLLw", "text": "Trader Joe's is the ultimate place to buy delicious, healthful, and sometimes organic foods. If you are someone who doesn't like cooking but also doesn't like eating out all the time, you gotta go to TJs. The frozen pizzas are great, the hummus is delicious (excluding the spicy pepper) and they have awesome naan. Besides frozen foods, there are a lot of cold prepared meals that are easy to heat up.\n\nOn the down side, their produce is mostly pre-packed and can tend to be overpriced, although there are still some bargains.\n\nThe wine department is great for any time you are looking for a fun bottle under $10 to try. They are always changing selections and the staff is generally quite knowledgeable.\n\nI also love that I can randomly grab beautiful flowers on my way out the door...and the flowers are always something interesting and exciting.", "business_id": "Sy-hmzSH1OmWpHmAfZtxRA", "stars": 4, "date": "2009-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t-27_YZKsk9tMbAiwQKCwQ", "review_id": "I3DaMruBWNAojrHY7zzqGQ", "text": "This is my stop on the way home 1-2 times per week.  The staff is always friendly and helpful.  We love the natural selections and variety that can be changed up every week or so.  Hope that they get the TJ's Coconut Water in again soon!", "business_id": "Sy-hmzSH1OmWpHmAfZtxRA", "stars": 5, "date": "2014-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qHCEXMPiIuT8gyPCVce5AQ", "review_id": "EzlMOcf9RzEpZawb0LB1CQ", "text": "I am frequently near the Camelback and 32nd St area and this place has become my favorite place for a cup of joe...or an americano to be exact. Great little place, always busy - but in a good way, no long waits - they provide service outdoors as well as indoors. \nAlways greeted by friendly staff and fellow customers are always willing to chime into other peoples conversations - overall great atmosphere. Plus their banana bread is dynamite! highly reccommended by this yelper.", "business_id": "2h9LsLPdJ7OvZrYJZhVdAw", "stars": 4, "date": "2013-09-27", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "n6chlQCERdcs7A-VoOeoLQ", "review_id": "6AX2joQQiKeFn6DY6EOEtw", "text": "Should I stay or should I go??? \nThis is the question that ran through my mind as we walked up to this run down establishment! \nSince it was my last day in Arizona, I went for it!\n\nWalking up to the door, I saw that the sign did say \"open for business\", so I held my breath and walked it.  DING! Ahh! I jumped at the sound of the loud door bell! My fiance couldn't help but laugh! \"Hello\" said the owner as he walked in from behind the store.  \"Hello!\", we responded respectfully!\n\nOnly two separate sets of shelving fit and fill in this small shop of Cacti but enough for the visiting tourists like ourselves! It only took about 5 minutes to look around and decide on a few souvenirs.  As I handed him my items he offered us a few samples and tossed in a free gift!!! WOW! What great guest service! \n\nI highly recommend a visit to this shop when in AZ! \nNot only was it a memorable experience but his prices are cheaper than retail stores!", "business_id": "wxPOlYC155x-RLfk1kVdfw", "stars": 4, "date": "2012-09-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "jJdhgnj3q2GSHrcBgpIJgQ", "review_id": "1Tb-lRLabUk6hw5Pk3liVA", "text": "Seriously this is the BEST bakery EVER! They made our wedding cake and Angela was such a pleasure to work with and could not have been more accommodating! The cake was not only beautiful but so darn good! Everyone asked where we got our cake. Sooooo moist!!!\nOne special thing we had Barb's do was make iced wedding cake shaped cookies for our wedding and each one was in a cellophane bag with darling ribbon and our wedding date. Such a hit!\nThe other thing I love that Barb's do that you just don't see anymore and that is make iced seasonal cookies. They are off the charts delicious. And so cute you almost don't want to eat them. \nTheir petite fours are classic too. Vanilla is my favorite. \nBarb's keep up the GREAT service and wonderful goods.", "business_id": "vv1uvJRBUqi707TA5GuhCg", "stars": 5, "date": "2012-10-27", "type": "review"}
{"votes": {"funny": 6, "useful": 6, "cool": 4}, "user_id": "APLIPfq1Rf8QyhHHk2uAyA", "review_id": "x9JFxBkFY3-bpuy8BUd2TA", "text": "Hi, my name is Alicia and I have a migraine. In fact, I've had one for 7 straight days. My wonderful doctor just wrote me two prescriptions so I can kick the pain in the pants. Groovy. Prescription Drop-Off = No problem. 15 minute wait? I can swing that. What's another tick, tick, tick of the clock as my head throb, throb, throbs. \n\nI mosey around the aisles. Nice. Latex gloves on sale - 3 boxes for $10. Oh, look, espresso chocolate. \n\nTick, tick, tick. \n\n45 minutes later without my name called over the loudspeaker (bummer), I head to the Pick-Up. I'm anxious for my meds. It's been a long day anyway, and this is the final stop. Or so I thought. \n\nI take a seat and stare at the floor. After all, the overhead lights hurt my eyes. I glance up and the pharmacist smiles at me. That's pleasant. I continue to wait.\n\n\"What's the name?\" I answer her. \n\nThat's when I hear they have 3/4 of my prescription ready but that one drug (my drug of choice to tackle the migraine) is out of stock. Would it be okay if I waited until Monday? \n\nUhmmm... \n\nMy mind flashes back to another Walgreens on another day when I'm waiting - in agony, mind you, after oral surgery. I want my narcotics like the children of rock wanted their MTV. I was told they were out, and I'd have to wait... or take my carcass to another pharmacy. I opted for the latter, for the claw marks in my palms were evidence enough that I couldn't stomach this pain any longer. \n\nSo, needless to say, when I was told by this particular Walgreens that they were out of my gonna-make-your-boo boo-all-better meds, I had an emotional hiccup. WHAT? \n\nCount up the minutes. One hour in this stinkin' Walgreens and I'm really no better off than when my peds walked through the front door. Double ugh. Why couldn't they have called my name over the loudspeaker like they said they would? Then I wouldn't have waited in vain. \n\nStupid pharmacy. I want my drugs!", "business_id": "0vYp6ITH7FsBtlpFcWTdRA", "stars": 2, "date": "2007-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3Mm_Kl6cXOPpRJYYpE9_AA", "review_id": "QamwbR_Ik0xLpoAL_PdMBw", "text": "Shame on you for stealing from a child!  I will be sharing the news story with everyone I know so no one ever steps foot in your business again.  How low of a human being are you to not pay an employee, a child, the money she worked hard to earn.  I hope all your employees and past employees rally together and you get what you deserve... A FAILED BUSINESS AND AN EMPTY BANK ACCOUNT.", "business_id": "XTtNevBI5G5x_GjFqSBMpA", "stars": 1, "date": "2015-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "gz71Hy61sfZaMKFd1kpyPQ", "review_id": "zo_fhtnn1MUw5EUlhtBMoQ", "text": "My buddy and I have gone there a few times now for the lunch special and the pizza is amazing. It's New York style. The crust is amazing, not sure how to describe the taste but maybe all that matters is that it actually has some taste to it. Love the sauce, the meats and all. The last time I got it well-done and I couldn't stop making this-food-is-amazing sounds. And it's family-owned - 'nuf said.", "business_id": "j0Uc-GuOe-x9_N_IK1KPpA", "stars": 5, "date": "2015-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t-27_YZKsk9tMbAiwQKCwQ", "review_id": "N9NQVi7LWCaREzMvc_95ig", "text": "Many grocery stores to choice from in the Arcadia / Biltmore area, none compare to this Safeway though.  AJ's is pricier, Albertson's is laid out oddly and not as nice, Trader Joe's doesn't always have the savings or selection and Fry's is over-the-top ( Winebar? In a grocery store?)\n\nCourteous staff, great selection, good savings and convenient location assist me in my monthly grocery habit.  Just stocked up again this evening for under $100.  Mangoes were priced at 2/$!", "business_id": "a7OF5WBirAFlVH7Xp1885g", "stars": 4, "date": "2011-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "prNDsstT2y8g5lT2LG9NPw", "review_id": "jx7AVMCP-is_0_GJK2jYWg", "text": "nice atmosphere& the drawings & it's convenient because it's on campus(:", "business_id": "S8R5c7-plWe3NtmijYAJvg", "stars": 4, "date": "2010-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "0rRTTYnjOtMDD32RvlxPow", "review_id": "bGykAhEzGAG0oSEQ2zsOBQ", "text": "another place that i really like but whose coffee is totally sub par. bitter shots, bubbly milk in my macchiato. good for other kinds of drinks, i'm sure, and i love their book selection and their general seating area. it's very spacious. if you're looking for poetry slams and traditional folk company, this would be the place for you.", "business_id": "Mb46iSlA4qmTwXf-WrqtQA", "stars": 3, "date": "2009-10-19", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "GUrPmYze-oF6NFDJusiSNw", "review_id": "8rvUmVFzGvw7jL1lBWNVjg", "text": "Wow, this place was fresh, tasty, and reasonably priced -- a great trifecta! Add in fast, and you've got a winner. Right after my arrival into PHX, Gabi K. brought me here, one of her favorite places for lunch.  I knew she had good taste!\n\nI grabbed an avocado BLT, and I couldn't even believe how generous they were with the bacon -- there must have been 6-8 slices piled onto that sandwich, and it was just the right crispness. Bacon is to credit and blame for my fall from 12 years of vegetarianism, so this much bacon still feels truly indulgent! \n\nThey have a great assortment of salads, sushi, and beverages.  They also have loads of specialty foods, including jams and spreads, as well as some gift items. On the gift side of things, I admired some cool and colorful re-purposed magazines that were made into decorative vessels. \n\nIt really seemed like a wonderful one-stop place to have in the neighborhood. I like the idea of being able to pick up a quality sandwich, some groceries, and a present for someone, all at once!", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 4, "date": "2008-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iwZ_7QuZ1tzT6pIZmOlDQg", "review_id": "Nncsz0WTdN7h4_mNztjtDw", "text": "Wanna know how to tell when your lunch salad is REALLY good?\n\nWhen you \"drool a little bit\" in between bites, like I did today with my Chopped Turkey Salad from La Grande Orange.\n\nI went there on Sunday 10-24, and to be honest, the setup is a little confusing for newcomers.  Order on THIS side, pickup food on THAT side, come back to THIS side to get dessert.  It's enough to make you want to just get in the car and drive home.  But DON'T !!!\n\nIf it weren't for the \"Drool Event\" which occurred today, I probably would not have posted this review at all.\n\nI shared the Green Chile Burger with my daughter, and we were both underwhelmed, really.  Nothing awesome about the burger.  Oh, it's FAR better than fast food burgers, but it's not comparable to Lobby's or Chuckbox (my two top burgers in town, probably.)  The french fries were a little thin and not too memorable really.\n\nMy son had the wings and loved them  But a hitch - I SPECIFICALLY requested RANCH for the wings, and they came out with Blue Cheese, which I then had to take back and get exchanged for Ranch.  Not a huge problem, but just a little annoying.  The Ranch was very good however.\n\nThe \"Olive Oil Cake\" that everyone RAVES about?  Meh.  It's just an extra-moist version of your average pound cake.  Tastes just like the pound cake I grew up eating in Texas, but it was a little \"oilier\" than your usual pound cake fare.  It was good, but not \"Oh My God!\" good.\n\nNow for the best item I had from there:  The Drool Creator.\n\nIt was mostly an afterthought, really.  While standing in line to get the Olive Oil cake to go, I saw the little section where they keep their \"to go\" salads.  I looked around at the varieties, and thought the Chopped Turkey Salad looked promising - bacon, boiled egg, turkey slices, cheese, lettuce, tomatoes, and two different dressings - Blue Cheese and some sort of yellowish vinaigrette.   I decided to take one home and eat it for lunch at work on Monday and Tuesday.\n\nGreat.  Decision.\n\nI don't really know what the magic was.  Maybe it was just a good combination of flavors.  Maybe it was just all fresh.  Maybe they use some sort of Magical Salad Crack.  I don't know.  But it was a DANG good salad.  Even on the third day, when I ate the last of it.\n\nI just combined both dressings ( about half of each little container each day ) and it was marvelous.\n\nNot too many meals cause me to drool in between bites.  This salad had some serious Mojo.\n\nI WILL be back for another one, hoping to recapture the Magic.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 4, "date": "2010-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m5o-T-WvDFIaNT7-tEpjtg", "review_id": "HHlQtXHSj3ARF-H64-LSMw", "text": "Ok, so mostly we just go to LGO to have brunch or lunch and it's awesome for that with a couple of important notes. First, be prepared to wait and feel crowded for a WHILE till you can escape to the outside with your foods and drinks. Once outside, finding a good table to enjoy at may be somewhat challenging or....just not possible. I've never tried to eat inside to my recollection. It seems pointless to eat in LGO where its wall to wall products and people when you could go outside and enjoy the weather. The food is always delicious. The menu is inspired but accessible and reasonably priced. On a side note, LGO is a great place to stop and pick up quality treats like breads, cakes, cookies, specialty sodas, beers, wines, cheeses etc. It's like a boutique convenience store for foodies and that is always handy. Too bad about the too cool for school crowd but I generally don't let them bother me.\nTo be clear this review is on LGO Grocery only. Although it is adjoining and affiliated with LGO Pizzeria, I am treating it as its own separate entity.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 4, "date": "2011-11-05", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "wm48MHuJ9O8yWGyNoBxmhA", "review_id": "aFfobIFZ_PtqVeFaBn9EMg", "text": "This is always a highlight of my business trips to Phoenix.  There is a location in PHX in the Southwest terminal but it just does not compare.  Every time I come here the parking lot is full and the staff is slammed.  The couple in front of me literally ordered $300+ worth of food/wine to be delivered when this isn't a 5-star restaurant.  \n\nI always manage to find so many things to buy in their small ecclectic shopping area....cute stationary, luggage tags, scarves, Voluspa candles...the list could go on.  \n\nEverything is freshly made and there are many vegetarian options.  Plus the desserts are abound...I couldn't choose just one yesterday so I bought two!  Campfire brownie (think S'more on top of a darkish chocolate brownie) & old fashioned chocolate pudding with whipped cream and chocolate chips.  You'd think my pudding was my entree as I gorged myself to the point of rolling out of the place.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2012-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XS_9sDzN1GxOMEI6FAUExw", "review_id": "nzQV-XELQye12t4-OgnL4Q", "text": "I am always pleased with LGO!  I'll fight for a parking space any day just to get my coffee and a Commuter sandwich (bfast), Orange and Fennel salad or Stacked Turkey sandwich (lunch), or my favorite Mother Earth pizza for dinner!  The vibe is fun and busy--not the place for a quiet time of solitude, but perfect for any other occasion.  Kudos to LGO for innovating and creating such a great neighborhood spot! :)", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2013-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hktHrBsVx8kIn_y4yddIXg", "review_id": "YESKYBpT7yKj_jqO-liqVw", "text": "It is the coolest neighborhood joint I have ever been in!  I stop by nearly daily bc the atmosphere is cool and laid back, and the food is yummy!  I never go wrong with take out salads, a quick breakfast granola parfait, or spending the evening socializing with some friends over a one-of-a-kind, sourdough pizza!  \nThe noise can be loud but its part of the fun!  Parking can also be challenging so I recommend biking or walking, if local.  If not, its well worth the headache of finding parking to enjoy the LGO experience.  \nDon't forget my favorite dessert --the salted chocolate chip cookie!  You won't find it anywhere else!", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2014-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8vrN-9uX6y5NM6Woc6mtcQ", "review_id": "Nb7cUbSXg8NgPOx7KQBK7Q", "text": "Don't leave any personal items behind here (purses IDs, maybe even your kids!) they are the most disorganized organization. I called this morning and was told My ID was here and that I could pick it up in the morning... Now I'm here at 5pm and they can't find it! Nor can they even tell me who was working!!! \n\nNot only are they disorganized but they are ALWAYS out of strawberries, and don't you dare ask anyone to go back and grab produce for you because they tagged it incorrectly because they'll put their nasty disgusting a hands all over it!", "business_id": "5WQhLNpG6xZryVCla4gMRA", "stars": 1, "date": "2015-10-21", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "wUEp87FqOB9ew27Iz6zk_w", "review_id": "qmHMBiggSFowWfKVLDlRoQ", "text": "Mmmmm... glazed donut.... I feel like Homer Simpson with how much I love the glazed donuts here.  Being from Texas, I am sorely missing glazed donuts from Shipley's.  Anyone from the south knows that those are the BEST DONUTS EVER!  But since Shipley's isn't in AZ, this place is a good second.  The donuts are soft, the inside is moist and doughy, yet light at the same time.  The glaze on the outside is sweet, but not sickeningly so like at Krispy Kreme.\n\nand WAIT... I just saw that another review said they have Texas kolaches??  I need to get back there stat!", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2014-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1jJktRMj1OfMDo-clbYvrg", "review_id": "wko0t-Dbpt2ajfu61etipA", "text": "Superb Coffee. Pathetic sandwiches and paninis. Hated the place after i ate the sandwich. i was told there were not veggies available at all. Then why sell a sandwich? They threw some chicken on the bread and gave it, after which i threw it in the trash.", "business_id": "4eFIVmbeCvJGCrhzmd-VYA", "stars": 3, "date": "2012-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "oMGWeM12E8vy3ytmflf9bA", "review_id": "gi7-qVmZeOT2RSWe6Y9K7A", "text": "Italian hero was decent but probably wouldn't come back for it.  The pasta salad was old and some of the pasta was starting to get hard.  No bueno.  Overall I'd say they are coming up short in too many levels. If you want a real Italian deli go to Niccolis not too far from here.  They have one of the best sandwiches I've ever had!", "business_id": "unPzS1QJJctlZyLGFSk_HA", "stars": 2, "date": "2014-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "X_U-vPO8HHEUc0FPsckDXw", "review_id": "XVtc2VWi4puf3kv9FTuLjg", "text": "I really enjoy shopping here.  Thank you", "business_id": "zk3T2VVl2Vcdg1tKD6SNhg", "stars": 2, "date": "2013-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J1niRymvJLXztyMtYa9BKg", "review_id": "59IsNpB5iZW_6mRPCFqX6A", "text": "when they dont give a fuck about how you want your drink; \"i can scrape the whip off.\" ughhh can you scrape the milk off too wtf is this shit lmao. \n\nJust remake it you lazy twat waffle, this shit was 6 dollars for your hippy coffee.\n\nYou are now on my shit list 7th st and bell Starbucks.", "business_id": "9ZLbuJ8q5k7l-3CJJeAfSg", "stars": 2, "date": "2015-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fl6oI21uXoxVMwfR6lFanQ", "review_id": "CzP7PeZR2w-zqTRlqDiyGg", "text": "ooh, yeah, another Starbucks review. So this would be one of three Starbucks locations within a mile radius of my house, but its my favorite! This place has a few tables and chair inside and a little bit more outside on their patio which I love! They have a decent selection of equipment and drinkware to purchase (like I even need more, but I'm a junkie so I'll buy the new design, sigh) and their baked goods are always equally as tempting. The baristas have always been super friendly and welcoming and offer different  drink suggestions when I go \"um, I don't know what I want, but I always get a carmel macchiato, but I don't want that today, but I don't know what I want\". Drinks are made pretty quickly, even with a line and the bathroom is always clean, so when your espresso diuretic kicks in....you're good. Woot Woot!", "business_id": "UHIL-Sp2VtYkxDa3_8hH3Q", "stars": 5, "date": "2011-11-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "0oRtnPHtvZIE1UNxCDDTPw", "review_id": "YEIzT82S48c2_OiPo45h-g", "text": "I know Whole Foods is expensive, but this place is beyond pricey. I went here since it's the closest one I can get to because I ran out Bragg's Apple Cinnamon Vinegar drinks. I always stock up and buy them in cases. (I'm addicted to this stuff) \nSince all Whole Foods are too far from where I live, I borrowed my brother's jeep and drove up here. \nI have to say that I am not really impressed. The Bragg's here cost $2.39! It only cost $2.19 or $2.29 at other locations! Whole Foods at this location sure know how to rip off people! I compare prices when I shop and always bring my I-touch, so I can google my way around the area especially if it's my first time there. I was disappointed again because this store does not have Wi-Fi and although the employees were nice, they don't know the area either. \nThe only reason I'm giving it 3 stars is because the salad bar had organic kale and my salad was delicious. The hot entree bar was a disappointment. They had 4 entrees there that consisted of pasta, mac & cheese, breaded fish and tofu casserole. That was it. sad.\nSo I drove to Luci's Healthy Marketplace and got 4 cases. Not only is Luci's less expensive, but they also give 10% off discount if your purchase is more than $30. Sorry Whole Foods... I like your other stores, but not this location. No Wi-Fi ? I won't be visiting again.", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 3, "date": "2010-11-13", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "FktbKOzznpoKTNXMVtc8EA", "review_id": "zb2_lqUlXXV72Sm-oWGVvQ", "text": "You may say to yourself someday, \"Self, I swore I'd never return to this Walmart, but I am right by it and need to get a - insert product here - that they do carry at the cheapest price, so I'll just...\" Just Stop.  Drive further, even if it grows your carbon footprint, even if it costs more.\n\nWe'll start with the parking lot.  You WILL almost be hit by someone before you park.  There's always a group of employees congregated by the door on smoke break.  They look miserable.\n\nThen there's the overall atmosphere.  Quiet, like a warehouse.  No smiles, not even on employees' faces.  Even though it's the middle of the day, it's not crowded, making you wonder what's wrong and a bit scared for yourself.\n\nProduct availability is akin to what I imagine it was like in Communist Russia.  Lots of empty space on shelves and the most common basics you need might not be there...like romaine lettuce, for example.  There's a good chance you'll have to go to another store after shopping here because Walmart didn't have it.\n\nWalmart's prices are no lower than anyone else's overall.  They wanted $1.99 a pound for a whole chicken that I ended up buying at Trader Joe's for $1.29 a pound...for an organic chicken.\n\nWe haven't even reached the worst part yet.  Checking out.  I stood in a line, 3rd of 4 customers.  Customer 1 was trying to pay with some kind of check that the cashier couldn't identify.  Wait for manager, wait for manager.  Line at dead stop.  During this, Customer 2 with his \"girl\" and baby was yelling into his cell phone how he \"can't hang right now because I'm at the Walmart with my girl and baby...\".  Cashier still waiting for manager, holding check up to the light as if it's going to show her a hidden Presidential face to prove its authenticity. \n\nIt's got to be more than a coincidence that the rapid rise in antidepressant use happened right about when Walmart went national in the U.S.\n\nDon't go here.  Go somewhere happy.", "business_id": "1OigyqVxIfE6AGKNGWZjnw", "stars": 1, "date": "2014-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0lyVoNazXa20WzUyZPLaQQ", "review_id": "zfLMrGUcmivtBXML98qSFQ", "text": "So torn about this review because it wasn't the food that was bad, it was the young man at the register. He was very nice but my God was he scatterbrained, unorganized and just plain not good at his job. He seemed too overwhelmed for the small lunch rush that was there. We ordered the cranberry turkey sandwich and the Yucatan salad. He brought out the sandwich and never gave us the salad. So we waited....and my friend finally just gave me the other half of his sandwich and after 20 minutes, just asked for our money back. The sandwich was so good and the pastries looked amazing but we just wanted to go after being there for so long without so much as a heads up about an ETA of our salad. Restaurants run into problems, but it's the way you handle it that brings people back. We overheard the guy behind us as we were leaving say to the young man...   \"hey, can I please just have my damn sandwich\" . So, obviously, we weren't the only ones with issues. Small businesses like that are usually a popular spot, they need to hire someone up front that knows what's going on especially in that restaurant and test them on the menu. He was absolutely clueless.", "business_id": "j5HLcBru7FEirYJPbKFVWA", "stars": 3, "date": "2014-09-19", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "Kkz3_bpUzA3nIHGp1GWUgw", "review_id": "883fssIFhzFPG_dKm_Ny3Q", "text": "I love the clearance section at this store!  Mentos $.29 , Trident $.69, Plenty of AZ team spirit wear! The store is clean and well organized. Free WiFi, leather sofas, flat screen tv, refreshment area, and a few table and chairs.\n\nThe only reason they don't get 5 stars is because they don't seem to have the ability to handle large quantity purchases 10+ of the same item...they have to ring each separately by hand...tick tick tick ...time is money... MY money.\n\nYou will find a few homeless people begging outside on most days that you go to this location.", "business_id": "n9c5ezcwz0k4F8_oIAjpbg", "stars": 3, "date": "2011-11-04", "type": "review"}
{"votes": {"funny": 6, "useful": 5, "cool": 1}, "user_id": "U7PC8wYKmtplZu-oUGk8MQ", "review_id": "6ry0jKacAhK9XNNhrZColQ", "text": "Worst. Fucking. Place. EVER.\n\nWalked in with a Romo jersey after the Cowboys won, the bartender yelled at his buddies at the bar Homo. AMERICA, the.land of the free.", "business_id": "-xLwGUmmyKgsTtFOOXzjeg", "stars": 1, "date": "2014-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "il7Ov6AJHA4br6Bfv1_o7Q", "review_id": "8M0qKyRDFcyFhW6IJ1hqww", "text": "Bagels are good. Waited about 5 minutes before they started my cappuccino. 10 minutes after that when it was still an empty cup I told them nevermind and left. This location seems to do an ok job with 3 or fewer people in line. The one at Desert Ridge does better with rushes .", "business_id": "IcuPhhH7QCOCT19EDEppEw", "stars": 2, "date": "2013-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GXt1b29IAQulijQWBwUPNA", "review_id": "Y6UJb9Q6OmTcFQt-ICNGmQ", "text": "One of the best donut shops in the valley. I live very close and have been here many times. The quality is always consistent. Prices are great. The selection definitely diminishes as the day goes by...but of all the times I've been here, there has never been a line. Maybe one or two patrons sitting down. My favorites are the maple bars and the cake donuts are amazing too (and I never used to like these much!) I've heard ravings about the croissants but I haven't tried these...yet.\n\nUpdate: Went back for a croissant on a Sunday to try it for the first time. They were OUT before 9am AND there was a line. If you go on Sundays, just beware they will likely be out of your favorite items.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 4, "date": "2015-09-13", "type": "review"}
{"votes": {"funny": 8, "useful": 9, "cool": 9}, "user_id": "eshIqohS-9FMLdKOhTr2Ng", "review_id": "u1o6I45RamzaHuio1jTFHQ", "text": "I FREAKEN LOVE SPROUTS!!! \nI AM A HUGE VEGGGIE AND FRUIT'S LOVER and Sprouts is the spot to go!! It always offers fresh produce and great service!! \nAlso I can't help myself to mention that they offer Scrumptious and simply delicious sandwiches at their deli made to order for just $2.99 each, what a bargain for a super fresh deal!!!! YUMMY and Bon Appetit!!!", "business_id": "hHE4OHAc8dONTV8QsGLbWg", "stars": 5, "date": "2012-09-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "vN25DTdMDr718zMCAgJvQQ", "review_id": "GdryTePMbZSMStga9L56qA", "text": "Yes, I want to go into Coldstone every time I pass it. And yes, I am always very happy with anything I order. The cheesecake ice-cream with graham cracker crust and caramel. To-freaking-die-for.\n\nBUT\n\nI must say, I always feel cheated when I leave the store paying more than it costs to get 4 gallons of ice-cream....for just 3 \"like it\" cups of ice-cream. Yeah, that part...do NOT \"like it\". I guess having an 8-year old whose begging and pleading often leads to my purchase of this over-priced dessert doesn't help, but I resent Coldstone for exploiting our taste buds' desire for something cold in the middle of the desert. \n\nI miss Mr. Softee, where a cone brimming with soft-serve ice-cream (WITH sprinkles) was a mere $1.25. \n\nSo for the ridiculous prices, I took away 2 stars. I still love their ice-cream though (dammit).", "business_id": "8WPCqC0Y-yszJi7eqfSllA", "stars": 3, "date": "2010-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S5IPiMgR8LESjrpmeU5avA", "review_id": "tdOLkMrDYmS651BY1kbg_g", "text": "Considering I work in the airport, I know lines are long and most of the employees hate their jobs. I get it. But when you ask for no mayonnaise because your ALLERGIC, you'd think to include that part on the note so it can be conveyed to the sandwich maker. Nope. Never happens, the managers are sweethearts, but the employees they need to check into. 4 out of 5 times I get mayonnaise & a dirty look . And sometimes if your extra lucky they will even leave the plastic on the cheese slices for you when you bite into your sandwich.\n\nHonestly the one star is for the managers. If I could give the restaurant less stars I would.", "business_id": "Cm1jT60fxb1DjwpqjWJ8EA", "stars": 1, "date": "2014-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5m55KNmkpgUk0PhzooJ98w", "review_id": "CUj2skhkbikI7siuhSGh5g", "text": "I use these vending machines about once a month when I travel. I got in the habit of grabbing a bottle out of their machine just past the security line at Phoenix Sky Harbor. Always get a cold bottle and never had a problem with the machine. Love that I can swipe my credit card and be quickly in my way!", "business_id": "wb2-TN8B1vXt-cbMBIufuQ", "stars": 5, "date": "2015-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "g9A9krUcmPuO3Uv8WnGP4A", "review_id": "PvFn0r92GYBUYmnNEaMydA", "text": "I love the atmosphere here but the food has taken a turn for the worst.  This used to be my favorite breakfast place but something has changed.  The food looks like the chef does not care.  There was no garnish on the plate, my eggs were cold.  My friend's waffles were burnt.  This is a lovely place to visit with a friendly wait staff but I do not recommend the food.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 2, "date": "2009-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BaHlhZ4dUO1AUY87ZXY6Tg", "review_id": "ofkiZjxk-Tc7kQbIl2aAMw", "text": "Atmosphere is awesome\nTree lined picnic table area.  We brought badmitton set to play, other ppl had frisbeez & footballs.  Leashed dogs are welcome.  Food is very good bu a tad pricey.  \nI will definitely be back to spend a sunny day, but ill probably bring my lunch & purchase a drink or dessert only\nQuiessence looks like it wld b an amazing place at nite.  We will for sure check that out some evening", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 4, "date": "2012-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vJIa_dDimpjIrBD6N02Fjg", "review_id": "PdTcoY2IJhzVynedCpgB1w", "text": "Looking around the Farm at South Mountain, one could easily forget you were in Arizona.  With the large grassy field and mature pecan trees offering ample shade, it feels a bit more like the Midwest!  It offers a great backdrop for 3 great restaurants.  We have eaten at the Farm Kitchen twice in the last 2 weeks!  The soups are usually good.  Loved their turkey vegetable and black bean, but the enchilada soup was a bit greasy and one dimensional.  Desserts are very good.  My favorite is the chocolate cake! Da bomb!  However, the coconut cake is ho hum with little flavor.  The sandwiches are good.  The turkey was probably the best, and a recent special Grinder was good as well.  Good selection of chips and small sides to complete your meal! All served in adorable wicker baskets.\n\nGreat place to take kids!  Plenty of room to run and play and dogs are welcome too!  Great place to walk around or roll in the grass!", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 4, "date": "2015-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "3BgtD103H9j11W_-0INumw", "review_id": "nY1UtzNvP9n_Naic1JoSdg", "text": "The Nosh is the spot .. Great people , Great service and great food . I've been coming here for over  3 yrs and  every time the experience is AWESOME . Everything is wonderful . Bagels , Salads , Soups etc . If you get a chance please try the Southwest Corn Chowder . Awesome !!!!!", "business_id": "8H1DwdAAgSBtwDeb2R-hmA", "stars": 5, "date": "2014-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DwU7KVfebA70AlVtX0iOWw", "review_id": "o06Mw2_B6UP2OdnolK74wQ", "text": "5 Stars for what it is...Dairy Queen! Who doesn't like a Blizzard? Fast and Yummy. In and out with a Blizzard Meal Deal. I was spoon fed a Hawaiian Blizzard on the drive home...it doesn't get much better than that.", "business_id": "fRtuc2k17r6aZMJWEMcXFQ", "stars": 5, "date": "2010-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "QIPn_akIS1TLx8kSuPjLxA", "review_id": "6hPi0kSwvgPjhNX4Ywl6vw", "text": "Bought a White White Chocolate cake from here yesterday, really delicious, really super moist and their signature frosting is the best cream cheese tasting frosting I've ever tasted.  The store closes at 6 p.m. and we were stuck in traffic so we called and told them we'd be a little late and they were super understanding, they had GREAT customer service and were super nice when we got there at 6:07 to pick up the cake.  My only gripe is that the cake didn't taste like white chocolate at all, just like white cake, but the most delicious white cake I've ever had! I've had a mini bundt chocolate chocolate chip from here before also and it was very good. Their prices are actually super reasonable too!", "business_id": "vPJ4iCOSuxCxHPtb18gwWw", "stars": 5, "date": "2009-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4TKLNJc88B-EttxI5LktIQ", "review_id": "RO3pi9283kr00DKjNI_JxQ", "text": "The car wash behind the building is great, and you should really use it. The 4 sons store isn't all that clean but for a convenience store it is, well, convenient.", "business_id": "R7uXlMl62qWUzXDt38fUJA", "stars": 4, "date": "2012-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3c-HTCk1jSGU7NYaNgIYtA", "review_id": "iWx6ivIBzgDtKaiMG1eWFQ", "text": "I really love getting smoothies and checking out small smoothie shops but I was a little disappointed with this one. \n\nMy smoothie was bland, tasted mostly like the soy milk ingredient, and I noticed that all the smoothie are juice and sherbet based and don't actually have fresh fruit in them. bummer.\n\nI tried the acai smoothie, which had acai juice, raspberry juice, sherbet, and soymilk in it and it was ok. \n\nThese smoothies need fresh fruit ingredients!", "business_id": "dA64XqxzgKiDx_PA-V30HQ", "stars": 2, "date": "2010-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "JiSt1mjxvz-nTYHk3A2vbg", "review_id": "wchmO_uTnwlewApRjGkzWA", "text": "Great beer, food and service! Best sports bar type place in Desert Ridge. Love their happy hour and mug club! Great place to meet friends and watch a game :) Highly recommended!", "business_id": "d7V3ykQHqChv0KtXEanKLw", "stars": 5, "date": "2011-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "KJDymAcoPiW_vuqthGxfpQ", "review_id": "pMH-EgPEB5jhaQl6wMGTJw", "text": "Pretty standard Walgreens locations - nothing to complain about here! The staff was friendly, the store was well organized and things were easy to find. They had a decent amount of seasonal items if you wanted to go and check them out from now until the end of the year you may find some decent decorating deals.\n\nOverall: B+\nStandard location - definitely makes shopping predictable and easy!", "business_id": "cwXlbuifzbdn5ITys6B6BA", "stars": 3, "date": "2013-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "87PyuaVWNZEyeiMD6yrDtA", "review_id": "ZXZMnZGBrguhvAhNMNlo5A", "text": "Bathroom is filthy, gasoline is 50 cents more per gallon than everywhere else, the cashier was slow and rude. About the only thin positive I can say about this place is they fill Growlers, the prices do look pretty high though and I can't speak for the freshness as I only looked, didn't buy.\nTwo Stars.", "business_id": "uPRz5JI11QQpwgNnSZZzaQ", "stars": 2, "date": "2015-10-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "Rg4gzsz3w00vRlIOXcGUIA", "review_id": "Es9IMlWc4eafp_1Fdn768g", "text": "This place is near where my kid swims, so we wanted to try this. My 8 year old ordered the turkey sandwich which was perfect. So healthy and yummy for a child. I had the country friend steak which wasn't anything special but I was craving it. \n\nProblems I had were all service. It took FOREVER to even get the lady to show up to take drink orders. When she did, it took her FOREVER to come back to the table. I asked for their beer selection and she said they only have Miller or Bud or something like that. I opted for ice tea that was never refilled. Ugh. I'd try again (no, it wasn't packed) to see if it's better next time.", "business_id": "1DDTdvU06tng7o0vU7-rig", "stars": 3, "date": "2013-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DOJM58OkGSsIdk2qCUZnLQ", "review_id": "4tULJurbX-tx2HQbUGpO8g", "text": "The food here is pretty amazing. The service, not so much, is very slow. I might not go here for lunch anymore unless it was take out. But the food alone keeps me a fan! Then you can stock up on whatever Mediterranean items you need in the attached market!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2013-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L2uBgbc8EqURu3FJApX5mg", "review_id": "GZ4HB9mIPLl4NfDqQZJ5tg", "text": "Ordered thru Yelp for pickup and it was all ready to go 10 minutes after I ordered. Very friendly staff. As for the food, very good authentic dishes. I try all kinds of hummus and theirs had great texture and flavor! Also had the fatoosh salad which was excellent. Definitely recommend and will be returning plenty of times.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "--rlgfAvvi0BtfRDA1p-VQ", "review_id": "L-n-mCza362pOBWzsgcOvw", "text": "One of a kind around here. Legit. Classic.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 5, "date": "2011-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RzqB_3ZlnddwwhC96z6gtQ", "review_id": "KIeo147OpzMrOxFOlBMDwA", "text": "I live near trader joes, i like it. It's  very clean, clerks are nice, quick and helpful. They always have something on sale for a great price. And I have 4 kids so milk is a big thing and the kids love it. It just taste fresh.", "business_id": "4EeLblEpJc2VeBowa94YPQ", "stars": 3, "date": "2008-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fPehGlmrNXtgd9Yc40TMeQ", "review_id": "iFvflSLFdCQu9_bGxv8sGA", "text": "I would consider myself an icecream/yogurt condiseuer.\nnow.... this place i have been going to since i was a little peewee! \nThe store actually used to be located on McKellips and Gilbert road and then moved to where it is now.\nAnyway... this is a local family owned FANTASTIC yogurt shop that has evolved and adapted (to competition) to a yogurt, smoothie, hangout type place. The staff is soo nice and really care for their customers. Always smiling and taking time to ask \"how your day was\", etc. \nNow lets talk about the yogurt.... SOOO PERFECT!!!\nthey offer various flavors every day. they do have a calendar they hand out so you can put on your fridge. \nThey make great yogurt pies too!!!\nAnd the best part of all this is that it is very cheap compared to the chain yogurt/icecream shops!!!!\nIf you live around this area (mesa high school) you definately need to take a yogurt break... makes for a great date or dessert stop after dinner because they have plenty of sitting area in and outside and they have a PACMAN game that you can play while enjoying your delightful treat.\n\nThe absolute best place for yogurt!!!!", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 5, "date": "2009-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HaShQiLUaqiCD0_YH5BGxA", "review_id": "xq9ZHgwEgGgI2frY555vDQ", "text": "This review is for the pharmacy. The guy who works behind the counter named Kevin has the worst customer service skills ever and his staff are just as bad. The Indian guy that works there is cool but everyone else sucks big time. If you are sic good luck getting any sympathy they treat every one like they are all on accces or just druggies trying to get there fix. They actually tried to say I didn't call in my scripts when my wife is the one who called it in from doctors office were she works at.", "business_id": "OdXjGy_iU6MpbDUmXDU8pw", "stars": 1, "date": "2014-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "R4Ax3btoJ6qLXhqq6J50VQ", "review_id": "okC3B9DA4ugdt1kU21kBQg", "text": "Who doesn't love ice cream?  Nothing special about Baskin-Robbins except the workers are very nice at this location.  Always a good place to stop by after getting gas", "business_id": "_3xR-RAnabwTj4Drsdfjgg", "stars": 4, "date": "2013-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4q4GBS0Uj04ZKAwHGAJzug", "review_id": "YVvHMpRSWx3kPZ4j0TSW0A", "text": "Great produce and cheap prices-not to mention friendly staff-could not ask for more!", "business_id": "qL954pD4Buq4fK0zN-ZgTw", "stars": 5, "date": "2010-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "poVxDmOPrxbnmvKp6eCs3Q", "review_id": "MPoWKesELqOPFsrUmfHG5A", "text": "I live pretty much behind this store, so it is SUPER convenient. The staff is great and remembers the regulars. The store itself is always stocked and clean.\n\nThe deli staff is fantastic. I'd like to see some different options in the case. The family used to love the sunshine salad, but as luck would have it, they stopped carrying it. The bakery is ok. Sometimes it's hard to find someone to help you. Same with the meat department. I hate ringing the bell and seeing the butcher in the back, hard at work, having to break to get me stuff. The butchers are great though, and will custom make or cut anything you'd like.\n\nMy only negative about this store really is the selection. They don't carry much of what I'm looking for, and are very \"white bread\" grocers.", "business_id": "TilePFEc9glsU-QGbSfG5Q", "stars": 3, "date": "2015-10-12", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "tdNV2Wb0LrFpm1Yfov_Klw", "review_id": "kmWXtCC67iS1B_pkv6Uv4w", "text": "Hey what is the deal not being open on Labor Day ??? If I am going to drive over here from NW Phoenix , the least you could do is open up! Don't worry we were able to go to another Gelato place close by.", "business_id": "XWpkTxBLgRXxl7g2Hw62Qg", "stars": 1, "date": "2009-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Rq9lyWr4hl5odX5yRoHdow", "review_id": "01YGykEbnJmY_VA6XRLaeQ", "text": "This is the best Circle K in the entirety of the Phoenix Metro area...\n\n...as long as the (I'm assuming)manager isn't there. The bearded gentleman will either make snarky comments about what you're purchasing, scream at his employees in the middle of the sales floor(seriously dude, you have a back room. and you shouldn't be yelling at fully grown adults. have a conversation with them), yell at you for parking in front of a fuel pump and coming into the store, or a variety of other absolutely horrid things I've seen. \n\nI instantly turn around, walk out of the building, and go way out of my way to the QT at Arizona and Germann if I see he's working. The rest of the staff there is awesome. I feel bad for them having to work alongside that guy.", "business_id": "WQ9oz6C0ZW5AQjjQfQgl7g", "stars": 2, "date": "2014-10-03", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 4}, "user_id": "ODhV53XhesCBLJVfGsJGNA", "review_id": "G0-9KSle59-YBx43jI6E-A", "text": "I've been a Coffee Rush fan for years.  I had first stumbled upon this quaint little shop when my friends whisked me into this coffee place.  I'm so glad they did!\n\nI love me some fresh baklava and a Caramel Rush.  Prices are always great and the baklava...  YUM!\n\nThe atmosphere is very nice and cozy.  I've never really ever sat down inside or out on the patio though.  I normally take my drink and walk around the man-made lake with a friend or two.  Sure you have to jump two low walls.  It's so worth it! \n\nAnd might I add... go punch cards!", "business_id": "l1MZjZK2tLxfFRB62lQmsg", "stars": 4, "date": "2009-09-28", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "QNuKebSaAD-ycWvaXL1G3A", "review_id": "48ediL2pJkJkUb2bxhfPTA", "text": "It's a good alternative to Starbucks, but the taste isn't that much different. The guy with the weird ponytail (not the owner) is kinda annoying though.", "business_id": "l1MZjZK2tLxfFRB62lQmsg", "stars": 4, "date": "2013-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5eOjREaDIXXiOOdjuFSEhw", "review_id": "foKCr1yDbaqd8ENmmQjwbQ", "text": "Great location, so close to my home. The staff is extremely friendly and fast service. The shop is very clean and has a lot of retail products available for purchase. I LOVE this location!", "business_id": "_9JDgUdXbCn1Vx-nj49VJg", "stars": 5, "date": "2011-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0beZngJ03EmIQfVcnlVK4w", "review_id": "2WrR1B1wQS3UmVOnv4Rnug", "text": "Had a great coffee there this morning. I really liked the location and the open-air feel of the place. It was very comfortable and easy to find. The coffee was good. I had the vanilla latte and it was a bit too sweet for me but the texture of the drink and the taste of the coffee was pleasant. The service was a bit slow considering it was not busy, but overall I had a very positive impression. I will definitely go there again, however, it is a bit pricey.....FYI.", "business_id": "iwzHQ7aBPrxKybarW5q5TA", "stars": 4, "date": "2010-10-27", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 5}, "user_id": "0o0VMEJeQY0pAAZ9nxErBA", "review_id": "QTwkihjQgicNPqewlt7QPA", "text": "What is going on here?!?! \nThe last few times I have gone into Lee Lee they don't have what I want. They never have clams anymore and they didn't have the shrimp I wanted or the live Dungeness crabs. Every time I come in here I always have to go to Mekong to get what I really want. So from now on I'm just going straight to Mekong. \nGet it together Lee Lee!", "business_id": "5KG0A3WlC7K3DAXtrIFFjg", "stars": 2, "date": "2009-10-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "hGvHc3YnSvAgUhSGEum5cA", "review_id": "2rGsdPLHpogSD1bFkgIuPQ", "text": "When I moved here from the east coast three years ago, I got homesick quickly until I heard about Lee Lee's.  It doesn't make up for all the cultural things I miss back East but it will do. It's like a field trip every time I go there with something new to try and see.", "business_id": "5KG0A3WlC7K3DAXtrIFFjg", "stars": 5, "date": "2012-11-18", "type": "review"}
{"votes": {"funny": 1, "useful": 6, "cool": 3}, "user_id": "fczQCSmaWF78toLEmb0Zsw", "review_id": "GjPoO7KdBHLEDNc4ifpcMQ", "text": "If you've driven near Tatum and Shea, you've definitely seen signs for Paradise Juice... they really do have the freshest smoothies, juices, sandwiches, and salads around.  \n\nI love going to this family owned business.  They work hard and deserve every penny they make.  I feel great patronizing Paradise Juice, not only because the owners are really friendly, but because I think they make really healthy, quality, fresh smoothies, etc...\n\nMy favorite smoothie on the menu is 'the works.'  It comes with orange, strawberry, banana, protein powder, calcium, vitamin C, and wheat germ.  If I'm in the mood for something more sour, I have them replace the orange juice with lemon juice... mmmmmmm!\n\nI recently ventured out and tried their house salad with tuna - for $7.50, it was a yummy, healthy, and filling lunch.\n\nGo give Paradise Juice a try... I think you'll be happy you did, and your body with thank you too!", "business_id": "5D1DG-EUUO3pMvMOuY6U9Q", "stars": 5, "date": "2007-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_4lqpCYCqOQzbB6xQGGhrQ", "review_id": "SyP9SNDR0gWdEbqShsQdFg", "text": "Great place and the people there know how to make your special drink.  What's awesome is that we go there so much that they know our name and drink.  That alone makes ya feel special.\n\nThe only thing that I hate about this location is they close at 7PM.. I know?!\n\nGet there early in the morning!", "business_id": "yMkXrAbKr3C1BjXIj6CIzA", "stars": 4, "date": "2010-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jZjS5R0KEFTkWOlk5-3N6w", "review_id": "1wdHClyysQ6awiBl0nWSpg", "text": "The food at this A.J.s,  is usually fantastic but tonight it's very bad. the salmon was cold, the mashed potatoes were mushy and tasteless,and the vegetables were overcooked I got no receipt from the cashier but did call the manager and they will replace it on my next visit I hope they get it together for next time.\nI can hope that food is better. A.Js is one of my favorite places normally 5 stars....  but not tonight stay away from the Sam and everyone", "business_id": "oOo0xGOVq7cYTP1fORdoFg", "stars": 1, "date": "2015-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bli5yHYNCZzdnRg8s7a6cg", "review_id": "Gcu76wQXyGLbe03f63VPOg", "text": "Jacob rocked!  We sat on the patio, we love the patios in Arizona! Jacob engaged our two children, which is always the sign of a great server and creates great dining memories for the kids! \n\nWe started with dessert first and Jacob brought our cheesecakes out super fast. Very attentive and courteous to listen to our kids' drawn out stories. He even had extra bread sent out to us, yummy!  \n\nThe food is always great at the Factory, but the service Jacob provided made our visit Fantastic!  Thanks Jacob!!", "business_id": "78IaYCf9ktUep4UhhjXbTg", "stars": 4, "date": "2010-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uQhFPUYfoljQykVEycgYBA", "review_id": "xLt991na33c0mMBTT9dkLg", "text": "Nice atmosphere and friendly server, but blah food. No one in our party reported liking the food. Maybe it was the prices. I don't think that we will return.", "business_id": "78IaYCf9ktUep4UhhjXbTg", "stars": 2, "date": "2014-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LqFgaXHwHfhTkc9TL2rQVQ", "review_id": "oUSGqu4nm9fLHwz6kAX5bQ", "text": "Over all food was good. Definitely over priced. I expect to pay extra for cheesecake but not for a sandwich and salad. Service was good and the hostess was nice as well. Not amazing but definitely not horrible either.", "business_id": "78IaYCf9ktUep4UhhjXbTg", "stars": 3, "date": "2015-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "t7Q29WBtZOY7kqDMKKWmhQ", "review_id": "cfl6wWch-ocmLimu3piRsg", "text": "The owner of the store made the situation right by contacting me. I wish more owners would realize this is a good way to make things right and keep customers who had a bad experience.", "business_id": "U9iWs_XQ88IEj_Cgawyz4w", "stars": 4, "date": "2013-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bj9wNeEIdJulpKiVYZhYdw", "review_id": "DgtNk6X4Kr0s2eZ5yxTfqA", "text": "This place has some great food. I haven't yet found anything on the menu that I don't like instantly. The pizza, the sandwiches, the appetizers, the desserts... all good. Despite this, my favorite item on the menu is definitely the Berry Burst Cider. I haven't yet found any other decent cider in the valley.\n\nAtmosphere: good\nService: good\n\nMy only beef: I did once have the jambalaya and that simply left me wanting authentic Cajun.", "business_id": "IMGW6y8wHQCfr_6k-YXg_A", "stars": 4, "date": "2009-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XBt1WQrKFWJ4WyhV3B9i3g", "review_id": "Dliu3oht-4myHnJaYb3WuA", "text": "I ordered the avocado roll as usual but this time it was complete mush and have the worst a flavor ever this has always been my favorite dish and I always order it...\nas a main dish I ordered the barbecue beef sandwich .....the bread was hard ,as a rock the cheese wasn't melted and the beef was overcooked and crunchy this was terrible food at this restaurant this time I won't be back.   \nthis BJ Brewhouse was the most disappointing I have ever been to.", "business_id": "IMGW6y8wHQCfr_6k-YXg_A", "stars": 2, "date": "2013-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9hbMY5VFLA8o7-pXLs3-LQ", "review_id": "-qZXNzIs05D_CEsK2qCNgQ", "text": "The menu is massive.   Great atmosphere and very clean restaurant.  I ordered the unlimited soup and salad and my boyfriend got the chicken Parmesan.   The chicken Parmesan was very tasty but just not enough of the sauce on the plate.    The chicken tortilla soup was fantastic!   However, I did not care for the house Italian dressing.  It was too vinegary for my taste.    The ranch dressing was much better!   A little pricy.", "business_id": "IMGW6y8wHQCfr_6k-YXg_A", "stars": 3, "date": "2015-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-7LfdqX286W8zJ01ljY_SQ", "review_id": "NTjd3xpKUz0yAnbkeLbQLw", "text": "I'm afraid to admit- my wife and I visit this Einstein way too often. We're 100% dedicated drive-thru users, and stick to a usual regimen. Two toasted bagels (typically garlic, sesame, or everything) with two specialty coffees. My wife prefers their hot vanilla latte and I'm the iced caramel machiatto addict (asking for the caramel to be melted and mixed into the espresso to make for a smoother drink). It's a $15 tab and we spend it at least 2-3 times per week.\n\nThe drive thru is typically speedy, with nice service. Obviously weekend mornings are  a little busier than others but that's to be expected, right? The staff still gets you through quickly and with a smile. \n\nThe breakfast sandwiches are a good alternative- and offer some calorie conscious eaters options (turkey sausage and no cheese anyone?)... if you are calorie counting stay away from the blueberry muffin bites. Just trust me on that one.\n\nYou're always apt to see folks with their pets camped out on the small patio space, so it's cool to see the pet-friendly space. Even though it's a typical breakfast chain, it's a great alternative to other fast food places like McD's or BK. The coffee is good, food is great, and staff friendly! \n\nAnd don't forget they offer lunch items- lunchmeat sandwiches served on a bagel of your choice. The taste options are practically endless. Enjoy!", "business_id": "BKEvR0umqWp7q8_q4hTpWQ", "stars": 4, "date": "2012-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MI_ZFuJ55bRnaarjYzkKRg", "review_id": "S2jxGbune1d4cvyITNkytg", "text": "Dont listen to Gail....she must have been having a bad day and didnt see how great this place is.  The food was awesome and the service was great!  We got in and out for $20 for two and would def! go back. :)", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2008-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mlBC3pN9GXlUUfQi1qBBZA", "review_id": "vLnJg0M9FoAdKsqdssSKqw", "text": "Have tried the chicken sandwich recently and absolutely loved it. It really is the best chicken sandwich. I love the vinegar sauce that is on it!!!", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 4, "date": "2010-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gwWEsyhOz3Ed95evHRAEwg", "review_id": "7ICZFoAgLVlQHLA7_5PTjQ", "text": "Upscale, urban and very clean.  Food very nicely done and tasty.  Fair price and pleasant staff. One thing that could use some improvement was their expresso.  It was bitter and lacked richness.  They have a bakery area and the goods looked decadent and professionally prepared.  I will be back!", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 4, "date": "2011-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qFZkU_iO6KjU-_5BptIu9A", "review_id": "Bo5r1aRuzzX4Ewyr5qpM9Q", "text": "I've never been to Liberty Market for dinner, though their dinner menu always looks amazing, but I have enjoyed many a breakfast/brunch/lunch there.  It is the type of restaurant where you place your order at a counter, find a place to sit, and then they bring your food to you.  They can get quite busy during peak meal times, but they are efficient at finding open tables for you, so you're never wandering around looking for a table after you've ordered.\n\nThey are locally-owned and use a lot of fresh, locally grown ingredients, so that gives me a warm fuzzy feeling when I eat there.  Pizzas, salads, and sandwiches are all delicious, but what deserves an extra special shout out is the dessert case.  The gigantic cinnamon roll is perfection.\n\nCan't think of enough good things to say; just go check it out for yourself.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2012-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PrxsXR_5YB7dlOGpaZq1jQ", "review_id": "zrja2y796GE6sD9oo6llcA", "text": "We're big LM fans. They have great costumer service and a great social media presence. We go several times a month. The burgers are very good, I love their margarita pizza, amazing rice pudding, the Cali Cobb salad with ranch is a favorite. There's has rarely been a time I've tried something and didn't like it, although I'm not a big fan of most of their desserts.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2013-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kzhxHT7HRKLGFIoFr7XiDQ", "review_id": "OLB3BoWsuaekUw7hV6O3kA", "text": "I love, love, love this place. My favs: cortada (espresso drink), picnic salad or sandwich (both are great), maiden lane sandwich with extra horseradish aioli, and the sweet potato salad. My only complaints: BEING BACK CUPCAKES!!!!!!!!!!! Especially the lemon ones. Also... they need a kids menu. I hate spending around $12 so my six year old can eat a burger.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 4, "date": "2014-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1gtrVrujCQGLsBewmGI4xw", "review_id": "YH3IY9R6ef7T2HejA9JEAQ", "text": "Liberty Market can't be beat for fresh ingredients, wonderful flavor combinations and a fun atmosphere.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2014-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NNdfPF-UhvLB8FxbsuSC5A", "review_id": "kM-fNUmUBO8kvJ6H4joK1A", "text": "Ordered The Tower Burger for my birthday, up to $10 value, just pay the difference if your food is greater than that.  Love the special sauces.  The burger was too big so I had to cut it in half.  It was super busy as well since it's on Thanksgiving weekend.  I didn't know I have to order first and get a seat so I was a bit confused there but good thing I was there with my friends and not by myself.  I live in North Scottsdale and it was worth the drive for me to drive all the way down to Downtown Gilbert.  Definitely coming back again soon.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 4, "date": "2014-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HawXXCKNDNuw_yLO4qrzKQ", "review_id": "US7Aj0AnH2K0krbfX3krag", "text": "Awesome coffee.  Well prepared and roasted by Stumptown. Also had an amazing dessert. Ice cream sandwich... Mmmmmm. While I wouldn't write home about the Liberty Joe, I would definitely come back here.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 4, "date": "2015-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w2PHi7zToHIxEWEC0SWqGw", "review_id": "hb0r1wuJxpGvx9hTgCS4Bg", "text": "The coffee bar makes this a regular meeting spot for plenty of town folk.....add in a pastry and Liberty Market becomes a must do for townies and visitors alike!", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2015-11-13", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 4}, "user_id": "lPaYMDmJbAnv_3pmZH_inw", "review_id": "ZJNPk7uTQcKirSrdU_V4IQ", "text": "Oink, oink! If you love pork this is the place to go! They have pretty much anything pork and at extremely fair pricing. They also have bbq pulled pork by the pound as well as ready made green chile burros. Let me tell you what, the green chile burro was so darn good that we ran back in there and bought 4 more! \n\nThey use corn fed all natural hogs from the Midwest and smoke and cut on premises. The place is seriously awesome!\n\nWe bought.. \nBaby Back Ribs (The meatiest Ive ever seen, seriously!)\nSt Louis Style Ribs\nSmoked Hamhocks\nJalapeno Bologna (nothing like the stuff from the store)\nPork Roast (Having tonight with white bean puree and acorn squash)\n5 Green Chile Burros\n1LB of BBQ Pulled Pork\nPeppered Bacon\nOld Fashioned Hot Dogs\n\nSpent only 90 bucks!! Oh were set on pork for a long time to come..\n\nWoooooo Pig Sooie!", "business_id": "oyzi74AxIx4Ln9R597F9kw", "stars": 5, "date": "2007-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B56BxhcG9c-YhOOrYRIuiQ", "review_id": "Sw4h8bvv5op7X2ci2gMJkw", "text": "Great pie! Great pie! GREAT PIE! A nice train ride for the kids. The peach festival is loads of fun in the spring & pumpkins in the fall. The owners are super nice. Don't forget to take home a pie.", "business_id": "1V8f3A7p3HV2r0BgAbqvaw", "stars": 4, "date": "2010-11-25", "type": "review"}
