{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bFXCfVe5Ln--JxeV5yoiXQ", "review_id": "aExY-_J51Lrtwmj_Oyb3ow", "text": "So I am currently sitting here with Pho Minh's Pho tai...and I honestly have to say I am not impressed.  Its a monday and my favorite Pho place (Tram's...in pittsburgh anyway) is closed.\n\nI decided to give this place a go...and take out their pho...\n\nThe broth is actually good, very light yet flavorful.  But the noodles are a disgrace.  They are lumpy, smooshy and not at all chewy...they just kind of dissolve once you put it in your mouth, and they take up none of the broth's flavor.  I also ordered some fresh shrimp spring rolls that were halfway falling apart when I got them, and barely any shrimp.\n\nAll in all, I'll come back if im desperate for Pho on a Monday, but otherwise...nay", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 2, "date": "2008-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0-y6EzeIBSmqM99APOvRCw", "review_id": "5EkrtDwV3ZSfz7PZHprJyQ", "text": "Cheap, tasty, filling.  We tried the pho, spring rolls, and lemongrass chicken; all were well worth ordering again.  This was, however, my first Vietnamese meal, so my thoughts are necessarily less discerning.  \n\nThe owner is indeed a character, and he more or less ordered for one of us.  Luckily, we're pretty easy going, and generally happy to take a proprietor's advice on what's good.  He struck me as amusing and endearing rather than abrasive.\n\nThe place was packed, though we went at 7 on a Friday.  Given this and the fact that they take no reservations, it'd probably be a hassle to go there with parties larger than 4.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2008-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "suRGJir2NmSZVnixdIN22Q", "review_id": "LTy1JC7gEQDPZxuDXOW94A", "text": "Does this place have the best Vietnamese food I've ever had? No. But does it hit the spot? HELL YES! \n\nThis was our go-to for hangover pho in college. Coming back the Pittsburgh after trying countless Vietnamese resturants, I was afraid to try the food again. I thought that the great taste I remembered was more of a memory and lack of food savvy-ness than anything else.\n\nHowever, Tram's did not disappoint. The rough-around-the-edges owner is still there, pumping out customers.\n\nThe pho lacked a little depth, but satisfied the craving. The portion was bit small for the price (Vietnamese is dirt cheap, even in NYC), but fine. The lemongrass tofu was a little on the salty side, but very tasty! The spring rolls, like everyone has mentioned, is packed with goodies inside.\n\nMy favorite dish of the night was probably the Split Rice dish. It comes with shredded and grilled pork and a lovely egg with runny yolk on top. The fish sauce that comes with it is sweet and delicious.\n\nHardly a wait on Saturday night? BYOB? I would be there every weekend if I was still in the 'burgh. One minus: cash only.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2012-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t1VtOVP11TqlzsMcngms1g", "review_id": "EWUHrWFAuyGU6bdTJZJr1w", "text": "Went there for dinner tonight. It was delicious. The spring rolls and egg rolls are amazing. Really might the best of both of those that I've ever had.  The service definitely leaves something to be desired but it's not horrible and they're friendly there. They just kinda need help with their customer service. But the food is great and fast and not at all expensive so I can overlook bad/weird service. Recommend this place!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2015-09-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "fKYP2YKR5yp_cNHPzBxxKw", "review_id": "ZHCi8eRC_VqPtNPS2ERvjQ", "text": "Here's the thing: The service at Tea Lite (i swear it says Tea LIGHT on the sign, but maybe not) is great, everyone is super nice, food comes out real quick and it's also real healthy. You also get a great meal for your dollar. What is keeping me from giving them a higher rating is that it's too safe.\n\nI love to come here for a quick, healthy, inexpensive lunch, but if I want the real stuff I'll go to the competing restaurant a little ways away. The phô at Tea Lite Café is sorta gentrified, a product of the neighborhood that it's in. There's no tripe or tendon in the broth, and there's no option to add it in if you desire a dish a little more adventurous. There are plenty of options if you want to spice it up, but not if you want to add more general flavor to the soup that i expect to enjoy when i go to a Vietnamese restaurant. Maybe it's because their specialty is a quick lunch and therefore a more streamlined menu? I am however super grateful that's one of the few places in the Airpark vicinity where I can get a boba tea!\n\nNow, I am no way condemning this restaurant, and in fact I recommend that you go there for lunch and support them, and if you like, request some of the omitted goodies for your phô so that someday they'll change their menu up and I can grant them a couple more stars.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 3, "date": "2010-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "R4Ax3btoJ6qLXhqq6J50VQ", "review_id": "ma4sHJPY8Vf7dx9yD3RRCQ", "text": "I decided to come here for dinner after reading numourous good reviews.  I was disappointed.. though the pho broth was very clear, the noodles and meat were not so good.  The noodles were more like rice noodles and the meat was as rough as sandpaper.  The eggrolls were decent, very fresh.  I'm still debating to go back and try the porkchop.   All in all I would rather drive down to Chandler for a good bowl of Pho", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 2, "date": "2013-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nFp0JHmDdWQNdZYM_iBimg", "review_id": "wG7rmgvxqVnWp3uzAAm_Uw", "text": "Went in tonight to try this place out. The egg rolls were pretty good, just a traditional egg roll with a crispy thin wrapping and a meaty filling. But the pho....so disappointing. Just bland....none of the complex flavors in a good pho broth were there. Yuck. Never going here for a pho fix again that's for sure.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 2, "date": "2015-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "a1DUUGOKHbjuoL_Z90AnuQ", "review_id": "vvnqfU-ABijJybxjj3eZrw", "text": "This is \"Old Home Week\" on my latest visit to the Phoenix area... This Vietnamese Pho restaurant was one of my regular haunts when I still lived here. And Saigon Pho has not changed one bit.... some of the \"old\" waitresses are still there, and not one new decoration to adorn the walls. This restaurant has not changed one bit!\n\nOn the menu today....\n\nBeef Chow Fun #39 (***** $6.50) As good a dish of Chow Fun you will find... even at a strictly Chinese restaurant. One of the added ingredients I request... even at Chinese restaurants... is the addition of Black Bean Sauce (or more of it). This will make this entree tast quite a bit better, IMO. Unfortunately, I forgot today.\n\nMinced Pork with String Beans #47 (**** 1/2 $5.95) Very fresh String Beans with some sweetness that Vietnamese like, and just a little bit spicy with some Ground Pork... which is a carry-over from Szechuan cooking! I asked the waitress what the vegetable was that was cooked with the Ground Pork... She replied that she couldn't tell me that... as it was a restaurant secret! She was just kidding with me, of course! She thought that the vegetable was preserved Radishes. I think she \"remembered\" me....\n\nChicken Rice Soup #51 (**** 1/2 $4.50) A Vietnamese variation of \"Jook\" - Chinese name for Rice Soup. Contained quite a few hand-separated pieces of meat from Chicken. Not as much Ginger as I would like, though. But very good, nevertheless...\n\nVietnamese Ice Coffee with Condensed Milk #54 (***** $2.50) No where in California... AND I mean NO WHERE... will you find a Vietnamese restaurant that would invest the time and energy to construct this Vietnamese Coffee for you... A Vietnamese Percolator filled with triple-strength French Roast over a cup with Sweetend Condensed Milk at the bottom of the cup. Once you try Vietnamese Iced Coffee you will not go back to that Italian Capuccino stuff. I guarantee it! The waitress told me that the restaurant will only offer to have the customer \"make\" his own coffee at the table if they're regulars or Vietnamese. That's nice to know!\n\nOther recommended entrees...\n\nCrab with Ginger and Onion (Market Price)\nClam with Black Bean Sauce (Market Price, not on Menu)\nOysters with Black Bean Sauce (Market Price, not on Menu)\nAny of the Pho's ($5.50 to $5.95)\n\n\"NEW\" dishes I want to try...\nLive Lobster (Market Price)\nLive Crab (Market Price)\n\nMy waitress, tonight, was one of the \"old-timers\"... She wouldn't like that phrase because she's only thirty-something. Back when I lived here, she was still attending ASU... now she's graduated and has a degree in Business, and a more advanced degree besides that!\n\nAt the end of the meal, I asked her if she remembered me... I used to kid around with her when she was attending ASU. She replied that she had a recollection about me... because I used to kid around with her a lot... But she wasn't sure. Now, that I asked that question was the verification that what she thought was correct... the old \"kidder\" was back in town. Even though it's just for a week!\n\nEspecially Recommended by an \"old\" customer... And some of the most affordable Pho in the Phoenix area... or any area of the country!\n\nFYI: to anyone that's interested... Boba or Tapioca Balls or Bubble Tea is actually a Taiwanese innovation that was introduced to the Western part of the United States over a decade ago in large metropolitan areas with a large Asian population. I remember my teen-age kids introducing this drink to me while living in Las Vegas. A few years after that, the proliferation of Boba was accentuated by Vietnamese restaurants offering these drinks, with the addition of their own unique ingredients. Wikipedia article: ( http://en.wikipedia.org/wiki/Bubble_tea ).", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2008-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xdYphPCFlkk7UD0Gq72rkQ", "review_id": "wGss_qeln_qiYFqCjGklcw", "text": "Really Good Pho. \nTheir sweet and sour chicken is better then any Chinese Rest. \nKind of a hole in the wall, but never judge a book by it's cover!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2011-10-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "mR4JOr7uw_99MSDHRRbLzA", "review_id": "nVS_aCwdGt3E3vJoF05NAg", "text": "Put your head down and get your slurp on!\nWent for lunch today. Ordered the shrimp and veggie\nspring rolls as an appetizer. I don't know why I do that, the soup is enough for two. My pho choice was #17 Spicy beef (Hu Tieu Sate). Lots of flavors in this one and it has the big wide noodles, very filling. The restaurant is pretty big with lots of tables. They were almost at capacity @Noon. Service was friendly. Great value at $5.95 for the soup. This is not strictly a pho joint. They have a variety on thier menu, check the website.\nWould not hesitate to go back if in the area.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2013-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QNE7a9cRs5vGFIKCOmN84Q", "review_id": "nFPTY1cK4AmS-NC03MhJ7w", "text": "Yes, we schlep down here almost monthly for a Vietnamese fix \nYes, we order by numbers - 29, 31 etc...\nYes we do get wild once in a while and order the salt and pepper squid (delicious).\nYes, its open all day so if you are channeling your inner nana, you can stop by for dinner at 3pm.\nNo, It's not 5 star\nNo, you will not get clothe napkins\nNo, alcohol is not served\n\nBut......\n\nThe service is exceptionally fast and this place is inexpensive.\nThe Vietnamese coffee will keep you buzzing for the better part of your day.\n\nSo if you are after a quick, inexpensive, Vietnamese meal..I would recommend Saigon Pho", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2015-09-03", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 1}, "user_id": "lsjrxHDriP2W4vIvzg8fDg", "review_id": "WPl0AWRUS6I4sMRhOfktkg", "text": "I went here for lunch this week with my 65-year-old mom.  We were impressed by the atmosphere, but the prices are the same at lunch as at dinner, which seems like a bit much.  The hostess/waitress/owner?? was very friendly and personable, at first; then a little *too* friendly and didn't seem to take the hint that we weren't into that much small talk.\n\nHere's the best part:  when my mom ordered, she asked if she could please have a fork.  The h/w/o said, \"No.\"  Not even apologetically!  She said: \"Nope, you're going to learn to use chopsticks.\"  We laughed awkwardly -- ha, ha! -- and when the entrees came out, mom said, \"Seriously, can I please have a fork?\"  And again: \"No!\"  She didn't explain, and she didn't apologize.\n\nWe thought it was weird, but you know what, maybe they didn't have any forks, and mom did fine, and whatever.  BUT as we were paying our bill, we looked across the room, and there was a guy in his mid-twenties or so USING A FORK!!!! \n\nCyclo, why give some dude a fork and not a nice older lady who asks you politely TWICE??  If I had been there with my inlaws, you better believe they would have stormed the hell out in a hurry.\n\nDon't know if I'll go again -- food was nice, but expensive, and I don't want to embarrass any future guests I might bring there. \n\nSo, BYOFork!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 3, "date": "2009-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "weYT-xJwz8o7mLNWIhD6HA", "review_id": "8w9DeoL5sGyxdhupwVmPZg", "text": "If I could give zero stars I would.  Stopped in for lunch. No one in the place (not a single soul), that was probably my first warning. I sat down anyway, on their hard, uncomfortable plastic chairs (seriously, the decor is very cafeteria like), and started to look over the menu. Pho for $10?? It better be some amazingly good pho! So I sat and I sat, waited and waited. The server/owner/manager/whoever that greeted me when I walked in had gone in the back and after waiting 10 minutes I decided to just leave. Give me a break. There is NO ONE in the place. I'm your ONLY customer and you're going to just let me sit there forever? No thanks. Went to my usual go-to for pho at Pho Van and had an awesome lunch.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 1, "date": "2013-11-11", "type": "review"}
{"votes": {"funny": 3, "useful": 0, "cool": 0}, "user_id": "AHsfTiLmnTBRoPDaolhv-g", "review_id": "zBqZwnwjK33TTQsZj0IByA", "text": "I had just gotten off a plane that smelled like cheese. After I got over that olfactory overload, I was starving. Friends picked me up from the airport and we were off in search of food. After circling Las Vegas for about an hour, we finally settled upon Pho Kim Long again. I mean, why fight it. It has decent pho, it's fast and it's open no matter what time of day.\n\nThey redecorated or something, and now everything is varying shades of diarrhea brown.\n\nThe help were very angry here. The waiter was not amused with us and was not very happy to answer our questions about portion size. The pho was again decent, so that's all that matters, but they got a new menu and raised prices slightly. \n\nAnd it smelled like feet in there.\n\nBetween the cheese-smelling plane, and the feet-smelling restaurant, I was done for the night. But phull of happy-pho-ness.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2008-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qq2t1EwAa3AUPJvFVGsrog", "review_id": "5JQ7xT0TywopSC5xHeq_4w", "text": "This is the place 2 go after u've been drinking & dancing all nite long... I'm so glad they're open til the wee hours! It's not a very clean place but the food here is great! I get either the pho tai or grilled porkchops on rice. The food always comes out fast, so u're in n out quickly, just in time.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m4oc-yghCtBGnT2fZE1BPg", "review_id": "Tz5OYg-aZFRaqu-NF6Q2dQ", "text": "I don't know if it was a fluke but my pho tasted like cinnamon soup. I had the Pho Dat Biet and the combination of the meats were way off. They put mostly flank and steak meat, 2 pieces of the meatballs, and none of the other stuff. There is only one sized bowl, so be prepared to pay around $8 for a Pho bowl made for a giant.\n\nWhat really stuck out to me were the eggrolls. They were really good. \n\nOver all, I liked the setting, food, and the service. Would come back to try other things on the menu. Pho, however, is a no thank you.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-11-03", "type": "review"}
