{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "D6UIGLlDEz9x1l33oF3xmg", "review_id": "fKmPl9idQU3nY2GIiRQGPQ", "text": "We ate here on a Sunday night and it was surprisingly slow. The wait staff was okay, not the best I have had at a Morton's and the same goes for the food. Don't get me wrong, everything was good just not as good as say the Morton's in Portland.", "business_id": "90Fqfzd8zD9AuuNBSv9lAg", "stars": 3, "date": "2008-10-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "zWli0lD5TNKpTSHjXWdHxA", "review_id": "lEGqzcWzvIwUkS133mDbnw", "text": "I wavered between 4 and 5 stars here. If the rating was strictly based on food, I'd go with 5, easily. But, it's based on service, too, which is why I had to knock one off. Here's the deal...\n\nI love Morton's. Its old-school interior and no-gimmicks shtick is awesome. Plus, of course, the food is fantastic. However, I wanted to branch out, and Ruth's Chris had some great reviews, so I utilized Yelp's oh-so-convenient Open Table reservation feature, and scored a table for two on a Saturday night. \n\nOur reservation was for 8:30. We arrived right on the dot, but were told to go to the bar and wait. So, my boyfriend and I both got cocktails -- he had Glenlivet, which is obvs hard to mess up, and I got the Peachy Pear-tini, which was delish. And then, we waited. And waited. Around 9, our table was ready. \n\nOur waitress was Kristen, and she was fantastic. Very attentive, friendly, witty, and knowledgeable about the food. Here's our food rundown:\n\n- Barbequed shrimp app: I initially thought was BBQ sauce + shrimp, but it ain't. It's succulent li'l shrimp in a deliciously garlicky, white wine-infused sauce with a cayenne kick. Kristen suggested that we dip the bread in the sauce after the shrimp were gone, and we happily took her up on that. \n\n-Ruth's chopped salad: Holy crap. The most memorable salad of my life. I rarely rave about salads. In fact, I think this is the first time I ever have in my life. But, this salad was incredible! It has crispy onion strings on top, hearts of palm (which I love), and this amazing lemon-basil dressing, among other delicious things. So awesome.\n\n- Filet mignon: My boyfriend and I both opted for the filet. I got mine with extra butter, he got his with a bleu cheese crust. Mine was phenomenal. The sizzling butter really adds an extra dimension of flavor that puts it beyond Morton's. My boyfriend found the bleu cheese to be a li'l too generous, and he wound up scraping some off, but still enjoyed it.\n\n- Broccoli au gratin: Again, phenomenal. I've never enjoyed broccoli so much. Granted, it was swimming in bubbling, gooey cheese...\n\n- Potatoes lyonnaise: We took a risk here, as many people rave about the garlic mashed potatoes, and we saw mountains of them carried past our table. But, it paid off big-time. These were, hands-down, the BEST lyonnaise potatoes EVER. Pamela's has nothing on these. Every mouthful was a medley of crusty brown potatoes and caramelized onion goodness. I dream about these potatoes.\n\nSo, based on that experience, we went back again the next Saturday. Different waitress, same food (literally, we ordered exactly the same items, 'cause they were so damn good). I don't remember the waitress' name that we had the second time, but we waited longer for food to appear, were checked on far less, she took the cocktail shaker with my extra martini in it before I'd gotten to pour it in my glass, our steaks were not done correctly (he got my medium-rare, I got his medium-well), and it took forever to get the check. I really think it ruins the experience when you're done eating and ready to go, and you're just sitting there, drumming your fingers, looking around the dining room and wondering, \"Where the hell is the waitress with our check?\" \n\nThat said, we will definitely be back. We'll just request to be seated in Kristen's section! :)", "business_id": "0FgwBx7pgmNdUtsd_T8UYQ", "stars": 4, "date": "2011-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Zff7xm0J-C7hV1z3j-JipQ", "review_id": "9P9lZ8jqy3kEgGuS-YXj2w", "text": "Tessaro's is definitely the best burger you'll find in Pittsburgh. Their sides are also delicious. If you have vegetarian friends that protest, they have vegetable kabobs that are actually really good as well. If you love burgers and you're in Pittsburgh, you'll have to try it out. If you've been but haven't gone back in a while, what are you waiting for?\n\nDuring peak meal hours, the wait can be about 15-30 minutes. The staff is friendly and helpful - they know that they serve a mean burger, and they are happy to be part of it all. \n\nOne warning, be prepared to be stuffed.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 5, "date": "2008-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 7, "cool": 0}, "user_id": "tAKjY3bQXH51msJbOHYPmQ", "review_id": "HGOARXt-EyFcMRK8DZgTtw", "text": "I have to preface this review with two factors. One, I moved here from South Florida, where the best burgers in town came from your average diners.  They were the last bastion of American food in South Florida, so they served up REAL American food.  If you wanted a real burger, you went to a diner.  After returning to Pittsburgh, I found that every diner here has turned to serving up those frozen gray hockey puck patties and passing them off as burgers.\n\nSecond, (until the recent explosion of good burger joints in da burgh), I actually HAD been a fan of Tessaro's, until their hostess/manager flat out offended the hell out of me and my party of three.  The result is that I have never, and WILL never return to Tessaro's.\n\nMy best friend is a 62 y/o blind woman that I met doing theater in the 90's in Pittsburgh.  She lives with her 91 year old mother, and her father (the driver) passed away several years ago.  I don't drive, and rely on the bus system that Steve Bland is intentionally systematically destroying, so any outing that we make must be carefully planned.\n\nShe and I had met once at Tessaro's.  It was her first time being there.  She took the Access van for the disabled, and I met her there after work via bus.  I walked in, she was seated, having a drink, waiting for me to join her. No problem.  We had a great meal, with an awesome burger.  I can't say enough...they really do have mouthwatering burgers.\n\nMonths later, we decided to go again, and the plan was pretty much the same.  She took the Access van to the restaurant, and I was going to meet her by bus, and this time a new friend was going to join us, coming by bus from Oakland, and new to Pittsburgh.\n\nMy best friend called me at 4:30 (we were supposed to meet at 5) and said that her van had come early, and that she was already at the restaurant.  I told her I would get there as soon as I could.  I left work a few minutes before 5 pm, and arrived at the restaurant 5:15.  They were busy, but I was surprised to find my friend still standing in the doorway.  The blind woman had been standing there for 45 minutes.  \n\nI made my presence known, and the hostess/manager acknowledged, asked about our other friend. I explained that he was ten minutes away and coming by bus, new to the city, but WAS on his way.  She walked away from us.  We stood in the doorway fro another twenty minutes.\n\nFinally, the manager came back, and I caught her attention, and motioned my head toward my blind friend, and asked if we really had to keep waiting?  She'd been standing there in the doorway for over an hour.\n\nThe next statement sealed the deal on us never returning to Tessaro's.  The manager slapped her hands on her hips, and started barking:\n\n\"LOOK!  We don't have many rules around here!  In fact, we only have ONE, that you don't get seated until your whole party is here!\"\n\nAnd THIS is what really sealed it:\n\nThe woman thrust her thumb in my BLIND friend's direction, who had only been to Tessaro's ONCE before in her life, with me, and said:\n\n\"And SHE oughta KNOW that!\"\n\nShe oughta know that?  Exactly HOW should she 'know that'? The only other time she'd been there, she arrived before me, was seated, waited, and I joined her.\n\nAdditionally, the 'rule' was posted...on a piece of 8 1/2 by 11 copy paper, taped to the wall at the end of the counter, behind several rows of water pitchers.  I couldn't see the 'rule'...a blind woman certainly wasn't going to 'see' it!\n\nFinally, after another ten minutes standing there, the manager 'allowed' us to take a table and wait for our friend, who came five minutes later.  We ate our meal, paid our bill, and we left.\n\nAnd we will NOT return.\n\nYou can treat me badly, and if there's something I really love about your business, I might come back.  But do NOT badmouth a blind woman, or anyone else for that matter, who is disabled, and in need of a slight amount of extra consideration.\n\nTessaro's, you might make good burgers, and you'll continue making a fortune off them.  And I'm sure you really don't give a crap about how your manager treated this lady.  But we will NOT drop one dime more in your restaurant.  We'll take our business to Burgatory.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 2, "date": "2011-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y9Q2mHM8av_2fiqvvers-Q", "review_id": "cs9CR9YbLNcz0-IPX6NfTw", "text": "Perfectly cooked burgers, outstanding service, and a wonderful, homey atmosphere. If you ask to split a burger with someone at your table it comes out pre-cut with your side evenly divided on separate plates. I've been here multiple times, and this place consistently lives up to its stellar reputation.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 5, "date": "2014-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7OUeRpDMgK_tCf1kJc8qcg", "review_id": "zDZN39y38KPwF86bJs3_rA", "text": "I normally avoid chain steakhouse as they always overcook my steak.  This place cooked my steak perfectly and service was very good.\n\nAppetizer\nfried green tomato - $7 - 4 stars\nbowl of Lobster Chowder - $5.5 - 4 stars\n\nEntree\n18 oz Outlaw Ribeye - $25 - 4 stars\n\nSide\nStrawberry salad - paid extra - 4 stars\nGrilled Corn Cob - paid extra - skip this - too hard - 2 stars\nMac & cheese - paid extra - skip this too - 2 stars\nbroccoli - too raw and bland - 2 stars", "business_id": "AUDuCSWYzzRP3H2w7TxtuQ", "stars": 4, "date": "2015-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "xaWoYklGNxjvgFUVG97yrw", "review_id": "PWIhUb7Q9H8t7NkYY_YePw", "text": "Service was awful.  My friend had a birthday get together,  we met in the bar,  about 20 of us showed up but there was no one else in the entire restaurant.  The bartenders had no desire to serve \"us\".  With attitudes and reluctance they assisted.  When I asked about a menu item, I was looked at like he saw a ghost.  After being treated with blatant disrespect and asking for the manager,  my table was thrown the check,  literally.  The manager did come and try to make things right by taking off part of the bill but I would rather pay full price and receive service as any human being should.  Shame on you mortons for such horrible service.", "business_id": "Lt9o2RmacVY2L-IWLA8uTg", "stars": 1, "date": "2015-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-S-QKLMFEu8cir0RAp8HVw", "review_id": "ZPkrzW6Wavx_kj12DJpYDg", "text": "Really exceptional restaurant. Great service and michelin star quality food.\n\nGood steaks are expected from a quality steak house, so it's hard to break the standard and really impress me. Their dry-aged steaks are phenomenal. Just for yukks, I used my fork to cut the last half of my steak, and it cut like butter!\n\nGotta reiterate how great the service was. Really top notch professionals - not once did I have to look around for a server when I wanted something. THey anticipated without \"hovering.\" I hate hoverers more than I hate servers who ignore you. There is a fine balance, and Capital Grille hits it squarely.\n\nAgain on the service - they were very busy, but it didn't seem like it because they were so unflappable.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2012-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zw_xNzWexXC0FS4wbgH_OQ", "review_id": "yrKXu8_3G0eNX5vmZlA49g", "text": "This is my favorite steakhouse! Their appetizers, salad are well made and delicious. The steaks are cooked to exactly to the diner's request. Great place to begin night on the town in uptown Charlotte or celebrate an important event.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2014-09-21", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "0cX4Z7MtAs3_ODuGO76oGQ", "review_id": "QrSE7VxOpXl6yUVWLwhSmw", "text": "Last night my boy friend and I dined at Capital Grille for his birthday. We were incredible impressed by the food and even more so the service! We are both young and we usually get shoved in a corner and nearly forgotten at nice restaurants, but not here!\n\nOur server was Ken and he was wonderful! He was funny and professional and provided just the right amount of assistance. The manager stopped by on several occasions to check in, and everyone was handing out birthday well wishes. \n\nI had the citrus seared salmon and my boyfriend had the Kona crusted bone in sirloin. We shared a Caesar salad and the au gratin potatoes. Everything was cooked just right and delicious. By far the best Salmon I've ever had! \n\nWe tried the signature pineapple martini, which really packs a punch! And we were given cheese cake and flourless espresso chocolate cake for the birthday boy. Both desserts were amazing. I would definitely order the cheese cake again! \n\nIt is an expensive restaurant, but I really felt like the expense was worth it! Great service and great food can't be beat!", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2015-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ncHyBw9G0ez6bpbZtaFtjQ", "review_id": "TnsTSnD6mNSDwN0fRajqfw", "text": "I have been to The Palm in L.A., and had an amazing dinner experience there.  I decided to go there for Thanksgiving dinner this year, as there were only two of us, and it's not worth the mess to cook for two.\nThis wasn't my first choice, but Sullivan's was not available.\nThe Palm had a Thanksgiving menu, or the regular menu was available.\nBoth of us went Thanksgiving.\nThe first course was great:  I had the arugula & apple salad, and my girlfriend had the lobster bisque.  Both were excellent.\nSecond course was the main entree:  sliced turkey breast, stuffing, cranberry sauce, gravy, plus our choice of veggie.  We had whipped potatoes and green beans.\nEverything was very good.\nThe last course was dessert, which we got to go.  The choices were pumpkin or chocolate pecan pie.  We both chose the pecan pie.\nAt home later that evening, we learned that this dessert was nothing more than store-bought pumpkin pie with chocolate chips pressed into the top.  The crust was awful, and had the tell-tale pattern of a machine-made pastry.\nReally?!\nI am disappointed that a high-end steakhouse does not have a pastry chef.  I left The Palm in L.A. with a piece of carrot cake that was worth fighting over (or at least arm wrestling).  \nYou are not getting out of The Palm for less than $75 per person.  I was shocked that was the best they could do. \nAdded frustration:  Thanksgiving is the day that everyone from age 80-120 has dinner at The Palm.  It is impossible get from A to B outside or inside the place.  \nWe'll go elsewhere in the future.", "business_id": "1gKBusJMk66ypwEKF0vOAA", "stars": 2, "date": "2013-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-3LE-Vd2EEPTL6it8-ONAQ", "review_id": "o8cjW-BCJp_MJMjqFFkIGA", "text": "Went to this Applebee's location two times. The first time was a few years back, and the bartender had terrible customer service (I'm not sure if she still works there, but I think it's worth noting). The second time I went, my girlfriend specifically asked for no onions on her sliders, and they came out with onions anyway. Also, my second round of sangria tasted like the bartender poured half a bottle of what ever they use to sweeten it, and barely any wine. I'll stick to the location by concord mills mall", "business_id": "98hOHm56D0Boz2LCg0-irg", "stars": 2, "date": "2013-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1bOrK1JhfXYoMJqPLWFg8Q", "review_id": "Mjb70efEokcQxjGHnXznqw", "text": "Giving it 3 stars for the outdoor area.  The only food I've had is their spinach quesadilla which was okay.  Nice place to grab a drink and listen to some live music. outdoor on the lake.", "business_id": "Zc2IwSzGY63zkyhfNrr7HA", "stars": 3, "date": "2011-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Zx8O_5Ix9Sl-CL-Cj-gqLQ", "review_id": "93C-SZ2d8iM71kGVZk-9NA", "text": "McGovern's is a old school supper club and bar. They have nice wait staff and bartender's and there outdoor deck is a relaxing on a pleasant day, and ya they make a nice bloody Marys.", "business_id": "zgxNUxS8eIyhkrXegDLtjQ", "stars": 4, "date": "2015-11-14", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "fU87SONDhYLDZK7soXSjLg", "review_id": "Tp6bz7P4iUhZnCf7iznFaA", "text": "Don't know how to give 1-2 stars or I would downgrade the rating. \nIf you're gonna name yourself after a cut of meat, I believe the meat shouldn't be substandard. Ribeye is my favorite steak but this did not cut it. \nAdded sautéed onions and mushrooms to the meal and to my surprise they were button mushrooms. \nThe small loaves of bread were hot coming to the table.  I had one slice - average. \nThe best thing going on was the salad bar and even it lacked. By that I mean the lettuce was tired. However a good variety of other things were there. \nLarge portions - that's the best I can say. And that it was walking distance from the hotel. \nBut if it's meh, who cares?", "business_id": "SoyigEmlt4JYwnOqR_cqUw", "stars": 3, "date": "2014-11-09", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Zg7PKlCh802rdfrLjsfHpg", "review_id": "mdtYhPxORlXNF3XSuIi_Lg", "text": "Went for late lunch with my aunt & cousin after my aunt had a procedure  done on her heart at  Good Samaritan Hospital.  My salad wad good & my aunt's lunch was okay but my cousins was cold and she had to have the fries remade because they were cold. Sorry but don't remember the waiters name but he acted put out when we asked him for anything. Don't care to go back to this location but will go to the one in our area.", "business_id": "cjUmPLRT43wN9Z87A9BOpg", "stars": 3, "date": "2012-11-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "B8XnHZxbMD01KOo0mnz9wg", "review_id": "zlpO9eZyg9Z9ENR8E5K7Pw", "text": "Um......I've been coming here since i was a child. I still love coming to this amazing establishment.  If its not business cards or trucker hats hanging from the ceiling that get your attention. Then its the amazing Chicken Fried Steak you can get there!!!!! If you have friends from Texas visiting Az. Definetly take them there......They will love it!!! hahha...", "business_id": "18TUn9oiW0k0yB6lheiOvw", "stars": 5, "date": "2008-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Be0ub24uIWh9FIFLYj_-zw", "review_id": "4ZOzL636jget4hcAwW3ANQ", "text": "Great good great service. We took are 3 young children there tonight. The customer service was top notch.Waitress help led my children there steak while by wife was busy with our 1 old. Manager came over a few times to entertain them. It just made eating out with the kids more enjoyable", "business_id": "18TUn9oiW0k0yB6lheiOvw", "stars": 5, "date": "2011-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y6T6_K29ksQMfocjl929HA", "review_id": "kWm_trLWlQA0DRLIb9RyNg", "text": "Because of the owner's handsome apology and offer of a meal on him I am upgrading the rating to a four. Anyone can make a mistake, but offering to correct it  shows the measure of the person.", "business_id": "18TUn9oiW0k0yB6lheiOvw", "stars": 4, "date": "2014-09-02", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "y0kTrVVLQBIyPEH2lNCK4g", "review_id": "0JlzHccBII_aLWOYh5wpmA", "text": "This place has the best smoked prime rib! But the whole mashed potatoes and their gravy topped everything for me. It's not much to look at but the food is fantastic. The staff is great too...", "business_id": "18TUn9oiW0k0yB6lheiOvw", "stars": 5, "date": "2015-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "D8TlrpLhMPPdgS21HeYObQ", "review_id": "yDFqoeUgXtzViVxkVwTQ6g", "text": "It had been awhile since I'd been to a Lone Star and I really had no memories of the experience, so a few friends and I decided to try it out as it was the nearest steakhouse to our location.\n\nWe were extremely disappointed. Although the service was just fine and the bread & cheese fries were tasty, the rest of the food was either wholly unremarkable or completely unsatisfactory.\n\nI ordered the 8 oz. sirloin (so cold and purple throughout that it could walk off the plate on its own; I know, go ahead and make a face...), with sautéed mushrooms and a house salad (no onions, extra ranch dressing) as my sides.\n\nThe salad was very plain and had nothing about it to distinguish it from any other salad anywhere (including one you would make at home or one that you would get from any buffet salad bar anywhere in the nation). I did not expect the salad to be the highlight of the meal, but usually there is something (a spiced up ranch dressing, flavored croutons, etc) that add to uniqueness of a 'house' salad. Not this time. Meh.\n\nWhen my entrée showed up, the steak was warm, light pink throughout, rubbery, and absolutely flavorless. No rub, no marinade, and the cut had clearly either been recently frozen or sitting in a fridge for an extended period of time because the flavor of oxidation was rife. Please note that I never expect there to be marinades or rubs on a steak, but then I do expect the cut to stand up on its own (which it did not in this case).\n\nThe sautéed mushrooms were particularly disappointing. I love sautéed mushrooms. Adore them. I require nothing more than a little butter or oil on them and then just go to town in that pan! The mushrooms I received were a mix of mushrooms that had been sautéed to the point of shriveled brown lumps and those that had been held over a warm microwave for 15 seconds. On top of this odd culinary spectrum, there seemed to be nothing but water on them, which didn't do anything to assist in the flavor. A quarter through the meal, I'd had enough and claimed a full tummy (a white lie... forgive me).\n\nAlthough the server was kind and competent, the food was a severe let down and I would never return to this or any other location. Sorry, Lone Star.", "business_id": "gQjTs4BDNYSu9oJhkEsssw", "stars": 1, "date": "2013-11-01", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 2}, "user_id": "HuGmiFh9v-YxY9FUGx2xHg", "review_id": "GF8MVHri2JJnNYcih4MivQ", "text": "Went to Capital Grille for resturant week Pre Fix menu. I guess I was expecting more. The atmosphere was plesant and the service was not all that bad (waiter was at our table a little too much, interrupting conversation).\nThe salad was ok. I could have had better elsewhere....lettuce was wilted.\nThe filet was ok. My steak was not cooked very evenly and for a five star steak house I was expecting a perfect steak. It also had very little flavor itself. The port wine reduction helped with the flavor.\nThe side was nice a truffle mac and cheese...but again nothing to write home about.\nDessert was good. Pumkin cheesecake, my husband had the apple crisp.\nWould I go back and pay full price. NO. This is not a place for something new or different and the quality was below par.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 2, "date": "2009-09-28", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 1}, "user_id": "ZrpsUVbEkuzhCqRfjM3pGw", "review_id": "aR7VXyIYt5RM-rhELwSWjw", "text": "I have gone to Capital Grille over the years in other locations and have always had a nice experience but the Biltmore location gets a \"D\" in my book!!!!\nThe bar area and bartender were friendly and attentive :) so that part was great! The dining experience was TERRIBLE!!!!  The waiter was not only very rude, he constantly forgot simple things and was totally unattentive... so after 5 things and 2 hrs into dinner we requested the manager who was just the same and sarcastic on top of everything else! For a $300.00 meal that was average at best. Thank goodness the company I was with was wonderful!!!! Too many other choices to be treated the way we were :( I was so disappointed that I wrote corporate headquarters! To be continued when I hear back from them!!!!", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 1, "date": "2013-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rq4PijrrXCCn9MbGCKtIfg", "review_id": "EL_DpuIhA_nSQ2b2Fifpmw", "text": "This is by far my most favorite restaurant! The service is impeccable and the food is awesome! I've celebrated my birthday here and special occasions. I experienced issues with one of my reservations and the hostess helped me out and provided me stellar service.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 5, "date": "2015-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4TKLNJc88B-EttxI5LktIQ", "review_id": "Pw7c3RdAZ4sM6N_KaUFWow", "text": "This review doesn't have to be long, so here's what you need to know: This place is great! The food isn't amazing but the place is pretty quiet and it's a good place to have a casual conversation.", "business_id": "iDoigI3605ixHl_qHly3Tg", "stars": 4, "date": "2012-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "LUpAB2SyOhYOuErp7wUmCw", "review_id": "hqIwhjGz-XZqlDF2gpE72w", "text": "We wandered in here around 6pm on a Monday and the place was DEAD.  This always worries me:  is the food lousy? The service bad?  Is it overpriced?  The answer is no, no and no.\n\nThe server was pretty quick to get to our table and was very friendly.  She brought some really good roasted salsa and a side of some veggie stuff, and a big basket of chips.  She took our drink order and was a little delayed in getting back to us but apologized for the delay and took our dinner order.\n\nDinner was HUGE.  I mean seriously!  I had the Chicken Chipotle and my finance had the seafood dish.  REALLY, really good; especially the Chicken Chipotle; spicy and a lot of flavor.  And the prices were very fair.  And their HAPPY HOUR has really cheap prices for drinks and appetizers.\n\nSo why is this place so dead?  I have no idea but I liked it, and I'm pretty picky about my Mexican food (salsa makes or breaks a restaurant IMHO!). Food was fresh, hot, and served in volumes.  Service was quick and friendly.  Price was reasonable.  What am I missing here?  Check this place out because unless I came in on an unusual night, this place is good. No, not amazing, but good. Yeah, I see the other reviews.  Maybe the place is under new management or something?  Seriously, it was a good place.  Give them a try.", "business_id": "5MlUPatQxg4GZhkPwGIvrQ", "stars": 4, "date": "2010-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JcUaRMayY0Krg6Y4ehYCuw", "review_id": "DwIkyHWr-hydVP1UO7W4Eg", "text": "Excellent food  excellent service.  It was a bit more expensive than their online menu shows. But it was already pricey. Good portions of food but we were not overstuffed. Had the chateaubriand. Yum!!!   Really lovely interior", "business_id": "7U8TYNW4Mvx6m3zexsO0sg", "stars": 5, "date": "2014-09-14", "type": "review"}
{"votes": {"funny": 1, "useful": 6, "cool": 3}, "user_id": "0bNXP9quoJEgyVZu9ipGgQ", "review_id": "48mUnXEiWBc4wV4xf-0gUg", "text": "Good fry bread.  I actually preferred it over the corn muffins that were also in the bread basket.  Salmon was ok, nothing to write home about.  Price-y menu for little young me who wouldn't be able to eat enough food to justify the pricetag.  \n\nI'd say the best thing about this place is the view!  The resort has other restaurants with better-tasting meals, so try the happy hour here, but grab lunch and dinner elsewhere.", "business_id": "wZwZcte4lcbu51NOzCjWbQ", "stars": 3, "date": "2008-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6qxNeUpK9NjIOYIWZA6e1w", "review_id": "wVmGYpW3ihOfwaEvIGRbpQ", "text": "beef ribs were perfectly spicy and sweet.  the indian fried bread and biscuits with whipped cinnamon butter are great.  i loved the whipped butter served room temperature.", "business_id": "wZwZcte4lcbu51NOzCjWbQ", "stars": 5, "date": "2011-11-22", "type": "review"}
{"votes": {"funny": 4, "useful": 3, "cool": 2}, "user_id": "JnEpFNLnj0TWOO9ZZ_Q4-w", "review_id": "T9mxS3vBYrIFiqRWP0QqTw", "text": "Kind of like Disneyland (Frontierland actually)  The prices are pretty low for the food described, but the quality and prep is mediocre at best.  Stuck at the AZ Grand Resort for a family wedding and avoiding the rehearsal dinner by saying I arrived too late.  Naughty me - maybe this is my punishment.\nWell, it's not that bad, but I would only come here for a birthday party for a child under 10, or when I'm a captive audience, like now.  We tried the rattlesnake with prickly pear cactus fries.  Definitely the highlight of the night.  Prime rib was cooked as ordered, but the meat was awfully chewy.  Sides included:\nBiscuits and fry bread with butter and spiced butter:  only had it one other time, but this definitely didn't measure, and the biscuits were not very good\nGreen salad:  Fresh greens, but flavorless dressing and very little of it\nGreen beans:  Overcooked, but tasted as if they were fresh\nCorn on the cob:  Watery, soggy\nBaked beans:  Pretty good, but very small quantity\nBaked yams:  Fresh, and well prepared, unfortunately, I'm not a yam fan\nService was very artificially friendly.\n\nEveryone raved about the view, but I was unimpressed with the lights of Phoenix.  I think I'm jaded.\n\nFood:  20/40\nService:  15/20\nintang.Atm:  14/20\nValue:  16/20\nOverall:  65= D+= 2 stars", "business_id": "wZwZcte4lcbu51NOzCjWbQ", "stars": 2, "date": "2013-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9SWZWQrBRk7KRsKVd_XBsw", "review_id": "VC7YA3Y1zj5bJRLndtd-mA", "text": "For years I heard about this place and always wanted to go, so I thought for a \"date night\" it would be a nice change of pace. \n\nFirst off, the cell phone GPS got us lost. It took us through a community and right to a locked gate. I could see the restaurant on top of the hill but could get to it. I ended up calling the restaurant and spoke to a confused young girl. She didn't understand how I could be lost and had no idea houses were right below them. \n\nAfter a few minutes of searching, I located the place. The parking lot was packed (it was Saturday night) but there was a nice gentleman there with a shuttle to help us to the top of the hill. \n\nThe restaurant itself is pretty rustic. There's a huge long horn steer outside, so the smell was a little strong but manageable. Inside was a live band and unique designed layout with a kid slide and all. \n\nWe had a nice window seat which overlooked the city lights. The view was great and so was the friendly staff. The issue I had the most was with the food. \n\nI was not impressed to say the least. We ordered the \"Cowboy Stuff\" which was basically a sample of ribs, chicken, fish, shrimp and filet mignon. The sides were potato wedges, spicy baked beans, pineapple coleslaw , corn on the cob and a side of veggies. The meal also came with rolls, biscuits and a salad. Overall cost was $47 and with a tip, about $55 total for the two of us. \n\nEverything was pretty bland and nothing that stood out as great tasting. I would much rather have gone to Pork on the Fork, a local BBQ place two minutes from my house. Instead I drove 40 minutes across the valley for this? Very disappointing to me. \n\nIf it wasn't for the cool atmosphere and helpful staff, I would give this place a two star rating. Save your money and enjoy something close to your house instead.", "business_id": "wZwZcte4lcbu51NOzCjWbQ", "stars": 3, "date": "2014-11-15", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "Gf-7bqM-dTaImuvfZGhJ2g", "review_id": "fgEOSA-kUsUJX_WoTuaTwg", "text": "This is one of the strangest places I have ever been.\n\nThis restaurant has a cow that lives at the front of the restaurant. He looks concerned.\n\nThe space is split into two, but I'm not sure how. I know this because when we asked for a table, the lady said that we could sit in some seats now, but other seats weren't available until later. I wasn't clear on which seats were available and which weren't, which concerned me greatly because then she said I could have a seat, and later I could have a different seat, which meant I had to figure out which seats were ok so we just sat near some other people. Eventually we switched to other seats, at which point, luckily, someone showed us where to sit.\n\nThe entire theme of this place is like, inside a barn or something. \"Western Cowboy\" or something like that.  Lots of wood, lots of steaks and meats, and people dressed 'country' style or something like that. People were wearing boots and I don't think it was because they were outside hanging out with the cow.\n\nThe food was pretty good. People complain about their meat not being done like they ordered it, but for the love of dog, you're sitting in a giant barn and there's a cow outside - the strangest thing going on here isn't your meat being cooked a bit off.\n\nThe service was ok - they weren't busy at the time, but when we needed a spoon to dish out the sides with, that took about 5 minutes, which isn't a long time, but it feels like a long time when you've got food sitting in front of you. I'm also not saying the waitress didn't have something better to do - she did a good job - I don't know what was going on during those 5 minutes. Might have been problems with the cow or something. Just saying - it wasn't speedy.\n\nBut hey, the place has a great view. I'd say to check it out, but it's not the kind of place I'd bring a date unless I was already drunk. More of a family place or maybe there's some whole kind of country-western thing I don't know about, so if you're into that you might like checking it out too.  Check it out!", "business_id": "wZwZcte4lcbu51NOzCjWbQ", "stars": 3, "date": "2015-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cBJqlNzyoJFak3_XRe2bvw", "review_id": "kwTSOqa03U3MbGIlmxSUFA", "text": "I've been here a few times and have enjoyed myself each time. I am reminded of Texas with the country music, laid back decor and of course, the food! You walk in and see steaks in the chiller...mmmm beef!! You are immediately greeted with amazing rolls ad cinnamon butter as you sit down...both are amazing! Service is attentive and prices are really reasonable. If you don't eat meat or are on a diet, I really wouldn't suggest going here because eveerything is meat and butter here. I've ordered the BBQ chicken and filet medalions, both are cooked perfectly and taste good. I haven't ordered their speciality cocktails but they look amazing!! Good beer prices though...overall a thumbs up for me and will keep returning!\n\nTIP: If you go on a weekend night, expect a wait. Last time I went on a Saturday, the wait was over an hour. But, if you go on a week night, there isn't a wait at all!", "business_id": "Mm8x_jzeLrWlvDEnqhuCBQ", "stars": 4, "date": "2012-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JV-gyp7CnQTx80yRDrBsNw", "review_id": "wFw7yLSiFlbVTEK5MWudKQ", "text": "We have been here numerous  times and had a good dining experience.  Tonight was perhaps an anomaly.  We always try and sit at bar to get faster service.  So we sat down and waited,  waited, waited for the bartender to greet us and ask what  we wanted to drink.\nThe bartender was busy talking to another coworker with her back.to the bar. The conversation went on and on. I waved at her coworker to get the bartender attention. The bartender turned around and waves back and went back to her conversation. She came over after she figured I been put in my place.  The flatware that I got the.steak knife was sorry I tried to clean with.my napkin but the food particles  were baked on.  I asked for another knife and it was as dirty as the first one\n  I ended up cleaning with a wet napkin.  The food arrived and problems.  The ranch dressing was so thick that it pound in clumps  and the prime rib was extremely dry.    Maybe it was an off night for restaurant but  it ruined our dinner and movie night", "business_id": "Mm8x_jzeLrWlvDEnqhuCBQ", "stars": 2, "date": "2015-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EbK5D6EeyFnGEmsy7DNILA", "review_id": "ziii2C2qQYcDtAUE77zePA", "text": "This is one of my favorite places to get what I think is the best Prime Rib in the valley. The service is always very friendly and efficient and the atmosphere is lends itself perfectly to couples looking for a little romance. Everything is a bit pricey but worth every penny. When you order Prime Rib you get a salad and a choice of two sides. Plus their spinach dip is awesome!", "business_id": "Rus-ewyqLj2D1RlqK-je4w", "stars": 5, "date": "2010-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m10HUfbNuZ45D0wN130VVw", "review_id": "MPTGrb9ZOrb573LjqZkW_Q", "text": "Not impressed at all. Came for lunch and spent $60. Mediocre food and rushed service. Won't be back.", "business_id": "Rus-ewyqLj2D1RlqK-je4w", "stars": 3, "date": "2015-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4S8alC_W4FO79OXM0VYZKA", "review_id": "-u-jb_rtbDzf5PeBp0zRGA", "text": "We decided to go to Outback and a movie. Unfortunately our dinner took to long so we missed the movie. When our bill arrived the server gave us 2 free movie ticket and free dessert!! Talk about amazing customer experience!!! Thank you Outback!!!!  Not to mention some amazing food!!!", "business_id": "0VyvlA1mZsDoYd3kkRjevA", "stars": 5, "date": "2015-10-28", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "rz8FmDqRFCs7UYupU_r9Mw", "review_id": "F0fWpttieqJnbP7CDMHEQw", "text": "Hmmm.....can you get cheap sushi here?  Sure.  It's OK sushi, for Arizona.  I've had fresher sushi before, including at Nagasaki/Toh Zan Grill in Mesa, AZ.  But the sushi's not too bad, and it's definitely cheap.  However, if you order anything else, you may end up paying for that cheap sushi.  I've been twice now.  On neither occasion did the restaurant have green tea.  Seriously? at a Japanese restaurant?  On the second occasion, I ordered a sake.  It was watered down.  My daughter and her friend ordered the mochi ice cream, which is ice cream balls inside a rice-based batter.  The menu said \"two pieces\" of mochi per order.  What arrived was ONE ice cream ball, cut in half, NOT two pieces of mochi ice cream.  Will I go back?  Maybe, but I probably won't order anything but sushi.", "business_id": "rHFWPJML2WlGbad0Tqevxw", "stars": 2, "date": "2012-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FPljkW6R0DXXbMFfKtTCXQ", "review_id": "2CWaKtbvFcoiFJHtqoGyCw", "text": "SAVE YOURSELF!!\n\nDon't be lured in by the coupon you received!!\n\nTruly awful steaks! Bad cuts, bad cooking!\nWhy did my steak taste like fuel?!\nWhy couldn't I cut it with my knife?!\n\nWas that green thing with the oily white stuff a salad?", "business_id": "OjNTZTZ6HYQghJN-3jmwnA", "stars": 1, "date": "2009-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "2HSgtnq66GhAzR7bnXStbw", "review_id": "ItK-gLDlEwMrTj9Qq_gkbQ", "text": "This is a perennial favorite of my husband and I. We love the atmosphere, the food, drinks and juicy slabs of beef we can choose from. Their patio also has a nice vibe to it when the weather cools off some, the fireplace prevents things from getting too chilly during our short fall and winter seasons. \n\nMy favorite has always been the prime rib, medium rare almost to the outer edges with a generous helping of horseradish and au jus. I also can't eat here without the Mushrooms Neptune. We each get an order to avoid sharing.", "business_id": "xMK01ZbVUYLLoyqoeWAIVw", "stars": 5, "date": "2011-09-01", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "aeoL948dq7zXoaSRqQLjqw", "review_id": "v00Ff8_R8IodzhYc6VqpgQ", "text": "It was our first time coming here and I must say the appetizers are amazing as well as the drinks and service! One huge mistake in our meal though. Both my husband and I ordered the rib steak cooked the same way. His came out about a half inch thicker than mine and perfect med rare. Mine on the other hand looked more like a pork chop. Thin and gray throughout.  Both steaks were covered in so much pepper they were hard to eat. Especially mine! We took them home and gave to dogs. Unfortunately they ate a very expensive cut of meat and not us. If it wasn't for this huge mistake everything else was definitely top quality!", "business_id": "xMK01ZbVUYLLoyqoeWAIVw", "stars": 1, "date": "2014-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "bqIl82S8vBXL2kF-uOHEmA", "review_id": "gMUGODNvrhh71-mc6cIg4w", "text": "WOW talk about customer service! Came here for my engagement, was such an awesome experience and an amazing meal. Danny Sanchez the gm came over and was more the gracious, he went above and beyond into making our very special night truly amazing. Couldn't thank him enough. Our server Matt was also really genuine and nice, will definitely be coming back here more and would recommend The Keg to anyone!", "business_id": "xMK01ZbVUYLLoyqoeWAIVw", "stars": 5, "date": "2015-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "WORShVhq7IwMY4iizc1dAA", "review_id": "KFvySZqGW0EFPGJ6MZo6JA", "text": "It was my Birthday and my wife, her mom, a dear friend and I headed to Fleming's Steakhouse in Chandler, AZ. We heard only great things about this place and wanted to experience their 'unforgettable' steak dishes. That, we did, unfortunately. \n\nThe restaurant was lovely dim-lit, adequate atmosphere for an expensive steak place. We were seated immediately and tended to by the waiting staff. The small roll of bread and two kinds of butter were good but insufficient for four hungry souls and we polished it up right away. No one offered to bring more. Our waiter told us about the daily specials, after which we ordered food and wine. After a short wait, four large dinner plates arrived. I was the lucky one, my steak (a large  rib eye steak, ordered medium-rare which tasted very good despite two large blobs of fat) was sitting pretty in the middle of the large dinner plate. Nothing else on my plate, just the steak. I looked around at my wife's plate and couldn't believe, her fillet mignon was laying there, in the middle of the large dinner plate without anything garnishing it, be that a glaze, a leaf, a slice of whatever! At the prices asked by this restaurant, it felt like an insult to each of us to have such a poor presentation of a steak!! We asked our waiter for a side dish, mashed potatoes with Parmesan, and when they arrived, we couldn't believe it! There were no more than two scraggly potatoes turned into mashed potatoes, or about a tablespoon of mashed potatoes per person. Mind you, they tasted good, but at over $9.00 per side dish? In short, we left hungry and wondering why we spent over $200 for the entire meal.\n\nNext time, we'll go to a well tried place for steaks and more. Durant's, downtown Phoenix and worth the drive.", "business_id": "0ONypOKIhttBz9IJzBE8jg", "stars": 1, "date": "2012-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Mb0psF4WQF7gZSuZafVr-g", "review_id": "lfxsnjzBusCvD9UROUkwoQ", "text": "This is sort of a tough review.  Flemings puts themselves out as high-end, and they charge high-end prices.  So one expects more from them than, for example, a Black Angus.\n\nNormally I wouldn't go to a high-end steak house.  Frankly between my wife and I, we can do as well or better at home.  She does a couple of different seasonings depending on her mood, and I am pretty good at grilling them.\n\nAnyway...we were invited to a seminar and the deal was they would feed us here.  Flemings does have some menu options you won't see at Black Angus, which is fine.  On this occasion I had the filet medallions (I think that's what they called them) with mashed potatoes and green beans.  Really nothing that fancy, but done properly this would be really good.\n\nFirst point...I ordered medium well.  We agreed (the waiter and I) that this meant there would be a little pink, but not much.  Just a bit.  So when it come out it's medium rare.  VERY pink.  Not even medium.  Gotta mark them down for that.  Lots of places do that, and it's annoying.  I've given up asking anyone to cook it more because it always comes back either dry or burned.  Not Flemings specifically, but any steak place.  It's like they're annoyed...\"you want it done more, I'll show you 'done more', you cretin!!\".  Instead I just live with it.\n\nFlavor-wise the filet was good.  Basic seasoning, nothing fancy.  But \"nothing fancy\" works in this case.  Nice flavor.  The potatoes were a bit cheesy, not much garlic.  They were fine.    Nothing special.  I think a bit more garlic was in order as I couldn't really detect any. The green beans I thought were a little under-cooked but I know a lot of people like that crisp snap.  The seasoning of the beans was good.  More than just a little salt, they really jazzed them up.  I liked them.\n\nSo the verdict?  Well, given how they bill themselves and what you pay I simply expect more.  I expect exciting flavors (even with potatoes), and I expect them to know what \"medium-well\" means and how to achieve it.  The meal was fine.  Even good.  But was it truly \"high-end\"?  I don't think so.  I've had high-end a few times, and this wasn't it.  So they're \"OK\", but I can't go so far as to say I'm a fan.  Three stars.", "business_id": "0ONypOKIhttBz9IJzBE8jg", "stars": 3, "date": "2015-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IYJg3a-NTaymcYPOfRrcsg", "review_id": "eSOmx01vY6hEgNdlRzw0FA", "text": "FAN-FREAKIN' -TASTIC!\n\nYes, it's a Great steakhouse... but they also have a Great wine selection... and Great bread to start... and Great desserts.... and Great service.\n\nRich and Richie took exceptional care of us.  They were attentive and fun to talk to... too.\n\nI had the Prime Rib and it was huge and perfectly prepared. I ended up taking the rest home and having it for lunch the next day and it was just as good the following day.  :)\n\nThe Bread to start came with 2 different flavored butters.  You could easily fill up on bread before dinner.... so go easy on this as they will keep bringing out refills if you let them.\n\nThe Dessert.... we got the Chocolate Lava Cake... and the cake part was good... but the sides that came with the cake... they were Amazing.  The Chantilly Cream they serve on the side of the cake is freshly made and it's a Little Pillow of Heaven.  Rich brought us more when we ate all the cream and still had cake left.  And then they have a little homemade pistachio cookie with vanilla ice cream on the side too... these were great too... So, net, net... I wouldn't order the Chocolate Lava Cake for the cake part.... I'd order it for the things that come WITH the cake.  :)\n\nGood for special occassions and if you are looking to have a lovely evening out.", "business_id": "9AbyBqGWHYZC73GlyAuTrQ", "stars": 4, "date": "2011-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "C3FWSFITkFJPBy_joSAHuQ", "review_id": "GLXXmYuCD4nw5KrIs4riPA", "text": "My girlfriend and I went there this past Sunday for the second time.  We went previously for my birthday and had a great experience.  The food is always great and very hot when it comes out.  I love steak so it is always right up my alley.  This past Sunday's experience fell short.  Our waitress, although nice, was not attentive and did not listen to what we had to say.  We ordered an appetizer and needed it prepared in a certain way, but it did not come out as we ordered.  We saw our waitress all of three times the entire night.  My girlfriend ordered a bottle of wine which was on the \"last call\" list.  We waited 20 minutes before she came to tell us that the bottle was not available.  The busboy that was associated with our waitress might as well have been our server.  He was great.  He made sure everything was to our liking and even refreshed my girlfriends wine glass.  \n\nWhen the food did arrive, we were satisfied with it.  The two times that we have been, the food is always exceptional.  But, you can't help but notice the lack of service.  I have to say it did affect our time there on Sunday, but won't hold us back from coming back.  We can only hope that the service will be better the next time.", "business_id": "9AbyBqGWHYZC73GlyAuTrQ", "stars": 2, "date": "2014-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xMahigsiVJAETwglFXrUIA", "review_id": "p_1s0tM6n6IvKU7_6FtSrQ", "text": "Stopped by last night shortly after opening.  Seated immediately. \nThe water and bread guy was there right away.   My server only appeared to have two tables and it seemed to take forever between visits.\nI ordered the salmon,  she said it's served, \"medium plus\".  I also ordered the green beans which were advertised as spicy. \nWhen the food finally got there,  the salmon was more like medium plus,  plus,  plus  and the green beans needed some help.   I flagged down a guy to bring me some cracked pepper which helped.   Guess I was hoping they'd be more like the green beans at their sister restaurant,  Roys.\nFor the money,  there's much better restaurants in town. \nBtw, my last trip to Flemings, on Ray Rd. was way better.", "business_id": "9AbyBqGWHYZC73GlyAuTrQ", "stars": 2, "date": "2015-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BhiRY4wv4j_5iIuP__Po3Q", "review_id": "IKodDq-Jv1t_fnTvcSXW9g", "text": "Here for a conference and tried the cheeseburger, based on a fellow conference attendee's recommendation.  AMAZING!  The fries, I know just from looking, were not good for me...could see the oil on them, but they were still crisp and perfectly seasoned.  I couldn't help but wolf it down.  Will DEFINITELY return on my next trip (or maybe again on this one)!", "business_id": "jBb5KHHAj4s8hcXVS6QXDg", "stars": 5, "date": "2011-11-02", "type": "review"}
