{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zo_soThZw8eVglPbCRNC9A", "review_id": "UzMViMQZuSxOr5wrru3LwQ", "text": "I visited this store several months ago to simply ask about smartphone plans. The agent was pleasant and helpful. I would recommend a visit to this store.", "business_id": "HZdLhv6COCleJMo7nPl-RA", "stars": 4, "date": "2014-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ZQN2rcFAxhBVQkkDd0E2iQ", "review_id": "xlRG7miUZ_8gc72XRRHkKg", "text": "Ever shopped at a Thrift Shop that sells high end labels, some brand new and gently used items like backpacks for $5? This is a great place to discover unique things. They also have daily deals such as 1/2 off of certain color tags. Have to dig through other things though to find something interesting which is part of the adventure!", "business_id": "kKmvSJ6Z8UVPdrnL74bqrg", "stars": 5, "date": "2012-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "kMJAITuqfdBmr3O6Acq10A", "review_id": "KSvHrAv9G9iUrB9sNmZO8g", "text": "What a disappointment!! Evening started pretty badly and did not get much better.  \nWe had reservations for 5 people at 7PM this past Saturday. Two of us were there early and rudely treated by the hostess. She was vague about seating us and we decided to wait at the bar. When the rest of our group arrived (on time!!), I informed the hostess and she looked at me blankly and then the packed restaurant.  She told me it would be awhile. Huh? When asked what \"awhile\" was, she said 20min.  But then seated us in 5 (she had to bus a table which I take it as one of the things she dislikes about her job - that and people).\n\nFood was a let down. Potato latkes were greasy and blah.  Fish tacos were recommended and were basically fried fish sticks.  Pumpkin risotta was heavy and confusing flavor wise.  Others had the same sentiments.\n\nService was rough.  Long waits and lack of attentiveness. Noise level (couldn't converse at all) made the night just a bit harer to tolerate.\nNot sure Pino's will get a repeat visit.  Disappointment:(", "business_id": "ZL6DNzyenFm9Kpz6uADlNg", "stars": 1, "date": "2010-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h2kyXtLyfOiS5AmRepUSWQ", "review_id": "TLsvU7CQbKy9wpHLC83ovQ", "text": "Love this place, really nice people willing to help and pretty decent prices..", "business_id": "l-dc5DeNBiHYJA1XO4cFPA", "stars": 4, "date": "2014-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "6Mflt7fworNLu031TDrDSA", "review_id": "2FVSXVoLtKzwHlt-N-Sbtg", "text": "Blown away at how Mike's turned an awful situation into a very unexpectedly pleasant experience!  Let's face it - everyone hates taking their car to the shop.  ESPECIALLY when the reason you have to is bc you were in an accident on the return trip from the airport after your amazing Vegas Vacation (no injuries or serious damage to either involved party, thankfully).\n\nThe customer service is stellar.  The staff at Mike's genuinely love their jobs and it's evident pleasing their customers is priority one.  I have to echo my fellow Yelpers, as my car left Mike's in better shape than before the accident. When I drove my freshly cleaned and waxed hatchback back (hatchback back-lol) to Bloomfield, I swear I could feel how happy Baby Bluey was and all was forgiven with the fender-bender.\n\nDid I mention they left a gift bag full of goodies on the passenger seat, all pink-themed?  My only small complaint is my car wasn't ready when originally told, but is it ever? I'll def be back to Mike's!", "business_id": "f_e6RWJIERK708E4Cod1wg", "stars": 4, "date": "2012-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CT7kzHHF9SpS96mkCvwqWQ", "review_id": "fSwj3yKIL4G-TMdCOltixg", "text": "I experienced three main issues with this Goodyear location while purchasing/installing a new set of tires:\n\n-They did not have my name or appointment in their system when I showed up. Fortunately, they still honored my appointment. \n\n-They did not install tires correctly. Left for a business trip the following day, and once I got on the highway and my speed passed 65 mph, the car began to rattle (with my new \"comfort tread\" tires). Booked an appointment, and they fixed the issue.\n\n-Two months later, I went to my Toyota dealership for routine maintenace. The dealer mechanic found that the lugnuts on the tires had been over torqued by Goodyear. So the Toyota mechanic had to saw them off of each tire and replace them with non-security locked nuts. (If I had a flat on the side of the road, I would have been SOL).\n\nAll of these issues were entirely preventable. The lack of expertise and techincal skill at this Goodyear location is abysmal. I do not recommend.", "business_id": "UFhcxnTzfLO-ROftyP_ukw", "stars": 1, "date": "2013-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Pko7-1W-Ahj8cm0AG8glnA", "review_id": "S67OcEsLZEwkd7HPoSZyqw", "text": "Everything I want in a bistro!  The sandwiches are delicious, the service is wonderful.  Love that pastry guy!  Ambiance is great!  The only thing is... it's a little crowded because everyone loves this place!", "business_id": "83_p9vIqOq1TUIf3_GD7bA", "stars": 5, "date": "2013-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "fXvQ1rMiVJufxc3ZDwF15A", "review_id": "t7sZ4_XYImd5x-ARAZq9tQ", "text": "The hot and sour soup was ok. Everything else was basically inedible. Water was not noticeably hose-y as per other reviews. More than 1/4 of the buffet was american food, and a lot of the rest was seafood that almost had to be \"krab\", considering the price of the buffet. No pot-stickers, no pork egg rolls, no spareribs, no won-ton soup.", "business_id": "UtWJ8NGMg-3z28s0RzlUoQ", "stars": 2, "date": "2012-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sgnZCcZLaSyFq3H3aL3eAQ", "review_id": "t4JKZgHaeVSkcpTn8KBupA", "text": "As the Survivor song says \"THE SEARCH IS OVER\"! After years of being taken advantage of by countless mechanics who care nothing about you or their workmanship, in Tim I have finally found a true gentleman who is a master at his craft. My situation was complicated and he accommodated me at every turn. Not only did he care about the cost, he twice came in on his day off to service my vehicle. I could sing his praises for an hour. I am a young widow, mother of three and know little of automotive repair. I live 90 minutes away. I will  EAGERLY return as needed without the fear that has accompanied me so many times before. Walt's Automotive is a dream come true.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2013-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "DTR6IhUzdJj6szgEXAALwA", "review_id": "dKAZNkvkAu3SSd94LtCc8Q", "text": "This place fills a void in Pittsburgh: a genuinely from-scratch bakery in the East End. I got a sampling of cookies, a quiche, a ham and cheese bun, a raspberry kolachie, and a cinnamon bun. Every item was uniquely simple and delicious.\n\nI ordered a pan of biscuits for my Saturday brunch and I can't wait to pick them up.\n\nI felt like I was in my great aunts kitchen. It's an extremely inviting and personal experience, I'll be a regular here from now on. \n\nLa Gourmandine is an amazing French bakery, but the atmosphere and quality at Food Glorious Food is something more than panache, it feels like home.", "business_id": "YMEtEsUDQKOYJOcE5Fx3gQ", "stars": 5, "date": "2015-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x1tqIO9G1RX3qd6Y4TsHXg", "review_id": "K-4k5pLxDBdihNE6fV3k9w", "text": "Much better than I had expected for a home improvement store within city limits! Staff were helpful and knew exactly where to point me when I needed some guidance. The organization of the store is pretty much like Corporate dictates - the same as the rest. The items offered are reasonable quality, although most aren't super high end when it comes to fixtures and appliances. That being said, I have always been able to find a great many items that are key to maintaining my home in tip top shape. They keep a nice supply of LED bulbs, garden tools, hardware, and regular tools, so I am satisfied. I haven't ever consulted with them for a home improvement project, so I can't really comment on that aspect, but they definitely advertise the services! Will definitely be back due to it's convenient location.", "business_id": "qA1PXTv0snTO1gpNPm-Jfw", "stars": 4, "date": "2015-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "-u91UNssob3wy6rTu7CYxg", "review_id": "A3_S3iVUGiPokFnrbA10sw", "text": "Worst parking lot in Pittsburgh. Bring popcorn to watch middle-aged, self-important mouth breathers gun their BMWs at one another to illegally park in the handicapped spots .If one didn't know better, one could mistake the parking lot drama for a permanent, outdoor performance art installation (allbeit an extraordinarily douchey one). Snotty clientele, over priced prepared items, no longer have a monopoly on ANY product in Pittsburgh. That being said, they do have a great selection of produce, probably the best in Pittsburgh, but you'll pay dearly for it. 1 very large, organic, honeycrisp apple you ask? Try $5, for real. If you want to sum up Whole Foods, just remember it's a place where you can literally spend $5 on an apple. Also, the CEO John Mackey voted for MItt Romney (http://www.nytimes.com/2013/01/20/magazine/john-mackey-the-kale-king.html?_r=0), so if you think you're shopping in a mecca of neo-progressive, pre-utopian bliss, think again.  Waste of time AND money overall.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 2, "date": "2010-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zJQ9S8kZzVEKARfGke7xJA", "review_id": "A-14PE1JjmP5ek3iCKy-hw", "text": "I've been to many whole foods market particularly in CA. I was really excited having a Whole Foods market near my apartment; however, I am really disappointed with this location. The deli (pre-made/salad bar/hot bar) selection is limited and the food is subpar. The parking lot is teeny tiny. If I had a choice, I would go to the Wexford location.  Definitely should stop by if you're in the area.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 3, "date": "2015-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "0xIQG-NrqMx5id6yJpQp8Q", "review_id": "oXPiJBTHbFxmFD9O2xlI7w", "text": "Excellent excellent brunch spot.  For review #100, a 5 star review for a 5 star restaurant is definitely fitting.\n\nCasbah does brunch, lunch and dinner, but brunch is my favorite meal and also what they do best.  I ordered their prixe fixe brunch option which is a choice of an appetizer, brunch dish, and drink for $22.  I started off with smoked salmon and had the waitress recommended braised lamb and eggs as an entree and a mimosa to drink.  My companion ordered butternut squash & apple cider soup, wild mushroom omelet, and a glass of fresh orange juice.\n\nWhile waiting for our food, we munched on their complimentary pastry basket consisting of super moist mini-muffins, scones, and super rich and buttery biscuits with honey butter.\n\nThe smoked salmon came with capers, minced red onion, crumbled egg, a drizzle of aioli, and a beautiful fried potato cake.  There was just the perfect amount of everything on the dish; the potato cake was just big enough to balance out the saltiness of the smoked salmon and the capers of course paired beautifully with the smoked salmon.  I tried some of the butternut squash & apple cider soup and it had some a pretty complex flavor.\n\nMy entree reminded me of an eggs benedict with a twist: grilled  sourdough topped with spinach, braised lamb shoulder and two poached eggs.  I love braised meats because braising can do such wonders to tougher cuts.  The braised lamb shoulder was flavorful, tender, and super rich.  The best part about poached eggs is sopping up the extra yolk with bread and it just tasted better with the sauce of the lamb soaking into the sourdough to soften it up a bit.  This dish itself is enough to make me a regular.  I tried my companion's home fries which came with this slightly spicy ketchup (I think it's house-made) and also a piece of her omelet which was pretty good too.\n\nService was good, ambiance was good, portions were big, quality was excellent, AND they take reservations.  Sometimes I don't mind waiting the half hour it takes to get seats at some restaurants (Point Brugge, Coca Cafe, etc.), but most times I'd rather spend time with people in the restaurant at a table rather than waiting outside, especially now with winter approaching.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 5, "date": "2009-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "combFPPT06VTOG453ZBXww", "review_id": "_tqY7cA7-WMFc1DZKT_ptA", "text": "Casbah is fast becoming my favorite restaurant in Pittsburgh. I have been there twice now and both times the service and food was impeccable. \n\nThe calamari and the proscuitto appetizer are a great start to the meal and not too heavy or filling and I could eat a whole basket of the warm bread. I'd love to know where they get it from as I can't imagine they bake it there, but maybe they do! \n\nThe pork chop is their signature dish and does not disappoint. My husband had the duck the last time we were there and it was juicy on the inside and had a great crispy skin. I had the red pepper casereccia and was thrilled with the amount of seafood in the dish. There were 4 HUGE, delicious scallops and a ton of lump crab. Very impressive. I was there with a group of 6 this time and everyone had clean plates at the end of the meal. \n\nI like the fact that it seems like the menu changes with the seasons. The proteins may stay static, but since they use a lot of local ingredients, the accompaniments/side dishes might be different every time you come. Honestly, this is one of the best restaurants in Pittsburgh. I plan on trying it for brunch or lunch sometime soon.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 5, "date": "2013-09-23", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "jfoGqXOWHPmsE7X5yZc_Rg", "review_id": "TD1gbHi5FobFrZKilkuUPQ", "text": "I believe it was Aristotle who once said, \"Holy craaaaaaaaaaaaap!\" Based on the dining experience I had last night, I can only assume that he'd just eaten at Casbah when he said that.\n\nPittsburgh is a city that has no shortage of *amazing* restaurants and among those, Casbah is one of the best.\n\nI went with my two kids (foodies at heart and who are both up for anything, always--no chicken nuggets for these two) and our experience, from the moment we crossed the threshold til we floated out after we were finished, was damned close to perfection. \n\nFirst off, THE WINE LIST. Sweet niblets. I had a glass of Michel-Schlumberger Pinot Noir that was so good that my eyes actually crossed. CRAZY good. And the rest of the selection was just as impressive. \n\nWe were served a basket of hot-from-the-oven bread with sea-salted butter and this otherworldly strained Greek yogurt stuff with lemon that was so yummy I seriously considered licking the plate. Seemed reasonable at the time. \n\nAppetizers were flatbread with hummus, baba ghanouj, and red pepper muhummara (sublime) and veal/pork meatballs with crispy Brussels sprouts that earned a resounding \"OMG!\" from the young uns.\n\nThe girl child ate--and swooned over--short rib ravioli, the boy devoured (and waxed rhapsodic over) his orecchiette with Elysian Farms chicken, and I lost myself in (and have pledged my troth to) the best cioppino I've ever eaten (San Francisco, eat your heart out).\n\nBut wait! There's more!\n\nDessert. Holy yum balls. Kid #1 had raspberry-chocolate bread pudding with crême Anglaise, Kid #2 had the chocolate cheeesecake bombe. Both kids were over the moon and doing things like pledging to clean their rooms every day (that must've been SOME dessert). \n\nOn top of all this, the service was AH-mazing. Every person who came to the table was funny and smiling and bending over backward to make the meal all it should have been. And it was.\n\nI've eaten at a great many of this city's best restaurants and this was one of the best experiences I've had here.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 5, "date": "2015-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0uM8pwyBMrAtxKJ9Ufvv_Q", "review_id": "KZX2ZyNLtwX9WMH6Rw-5lg", "text": "I am not a vegan and went there to meet friends and enjoy the atmosphere. I must say the hipster 'tude of the place was intimidating at first, but it's super friendly and retro-feeling.  Servers were fairly friendly.  We had some great lattes and chai teas and chatted for a long time without being bothered.  Didn't try the food, but there were lots of vegeterian and vegan options.", "business_id": "PzG0XmAmtXFs6Fdnubf41g", "stars": 4, "date": "2012-09-24", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "FvD0O2h9rf2O9HtpIu2cCA", "review_id": "kE8dT2Gm-Yzb-ExNyX2v8Q", "text": "I was a bit disappointed with the pizza I got. I ordered the Milano special pizza, which had pepperoni, bacon, sausage, bell peppers, mushrooms, olives, tomatoes, etc, and the popcorn chicken. The order itself arrived within thirty minutes which was great. Although the pizza tasted decent, the crust was not crispy at all, the slices were pretty floppy. They also skimped on the toppings a bit. I was hoping for a more loaded pizza. I'm not watching my weight--I can handle it. As far as the popcorn chicken goes, it was too salty, even with the honey Dijon dipping sauce. Probably not ordering from here again.", "business_id": "lHP5STO7aomlEQixH8m1aA", "stars": 2, "date": "2014-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "uNEUDSbFeNL_-ReWEz0PkQ", "review_id": "hg3qqYN8Rcu4UKj4li7i4g", "text": "It's disappointing that you got lukewarm service, Erina.  I've had pretty consistently good vibes (har har--get it?--hippie reference) there from the staff, who've been enthusiastic about helping me find what I need.  Hands down, this place beats Whole Foods for price and general atmosphere, and their salad and hot bar is my go-to when I don't feel like cooking.  Absolutely GREAT bulk section with a wide variety of grains, legumes, and pastas.  Killer cookies and baked goods.  \nOn the other hand--if I lived on my own, I could do all my shopping here.  But, since I don't--I can't.  It's tough to stock a household kitchen solely from the EEFC--I mean, I can't really afford to regularly buy $15 laundry detergent.  \nRealistically, the Co-op can't serve most of us for one-stop shopping.  But it's worth it to put down a few extra pennies for potatoes or juice to support a genuinely community-oriented business.", "business_id": "-iVcmhjfq79QoTWzrb6pKg", "stars": 4, "date": "2010-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "wCJbSEmMeZ0mAnJRQEyfCQ", "review_id": "IWfYMKqS1QK4IL1IgZqO9A", "text": "A great place all around whether you are looking to donate or buy something.   If you are looking for an old door, tile or quirky part for a home project this is the place to go.  I recently bought a new vanity and was able to donate the cabinet portion (do check the website for specific requirements on donations). They make it easy as you back your car up to the large warehouse doors and a helpful worker will unload. Don't forget your receipt for tax time!  I  live 4 blocks away and often go to drop off recycling another great benefit of this place.  They have large bins for many different recycling options from card board boxes to plastic. \n\nAlso  this place is nonprofit and they have an amazing fundraiser every year in September called the Big Pour.  $75 ticket gets you all the beer and food you could want for 3 hours.  Best event in Pittsburgh!", "business_id": "PavTvJ4JSe9rAwjlr-wrsg", "stars": 4, "date": "2014-09-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "Co6CK5n5Bi3yjLWf11GcPQ", "review_id": "XiNB4RdUQAtXvh_CSorVQQ", "text": "I've eaten here once after having it suggested by numerous people, I was totally disappointed with the service, food, and the place itself, I will not be headed back......ever\nSave your money, or starve either would be a better option", "business_id": "l_Wey2YC6NvVUIH8vTygGg", "stars": 1, "date": "2011-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JLS56V5lhErpFUjZ8N8VrA", "review_id": "2E0MuWuvVfrSaahpOzFA1A", "text": "I've been going to Izzazu for a very long time, almost 7 years now. I have ALWAYS gone to Cesare and will never stray from him! The first time I went into him, I was 18 years old and had some crazy red, blond and black hair. He really helped me go back to my natural color without damaging my hair (even with color stripping!) \n\nHe always knows exactly what I want, but isn't afraid to give me suggestions to liven up my look. He literally does the best color and cut in the city. And believe me, I've done some crazy stuff with my hair with a lot of hair dressers. \n\nThe atmosphere is very hip/chic and makes me feel like a celebrity when I go there!\n\nAlso, I LOVE their product line. I still only use Izzazu leave-in conditioner, hairspray and dry shampoo, even while spending over half of my year away from Pittsburgh at school.\n\nThe loss of one star goes to the attitude at reception. I understand it has compelled people to give them 1 star, but it IS a salon, meant for cosmetic services. You aren't going there for the reception. But, It wouldn't hurt them to smile or be a little less brash.", "business_id": "cuuJJ9W3tYmidaLvlzvPBw", "stars": 4, "date": "2011-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "UiSbtYgqi1AVf0yrakaHvg", "review_id": "JutOeeLPuWuJm871Pu1pgA", "text": "Maybe I went on a bad night, but the service was stunningly bad.  Water glasses stayed empty for almost 15 minutes!  Ordered 5 dishes, all pretty average.  The tab:  $300+.  I won't be back.", "business_id": "qUeBDN0D8SC93KeAHhiL-g", "stars": 2, "date": "2008-11-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "H_AKKEnEcuYrujI7xSxyeA", "review_id": "-Bw_S2ViOLrN8zQjYk9vsg", "text": "I enjoyed my meal at Alla Famiglia. The service is great and the atmosphere is OK (a little oddly decorated for such a high-end eatery). However, I don't know that the food was so good that it justified the high price point. This place is expensive and reserved for special occasions, which I knew coming in, but I wasn't really that blown away by my meal. You do get A LOT of food, but walking away with $300+ bill for a group of 4 just seems over the top when you consider the fact you're eating mostly pasta.", "business_id": "qUeBDN0D8SC93KeAHhiL-g", "stars": 3, "date": "2015-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "irxameXdL2nj5k5s39Rh3g", "review_id": "JT-_A8AjNtBlIQ1FWrzzdQ", "text": "Great little dinner. Food is amazing. Price is very inexpensive.  Recommended to everyone I know.", "business_id": "QIJa5h2d65Bgh82zct7c7A", "stars": 4, "date": "2014-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "0_ApKTgsq76Oalc6fo8Szg", "review_id": "7yL-EilJ6SHRLW0QB_s3zQ", "text": "I moved to the North Side in July, and this has since become my \"place\" in the area.  The atmosphere is your typical small, dark, old tavern, with lots of charm and character. They always have a great craft beer selection on draft, the bartenders are friendly, fun and super helpful, and the live bluegrass on Wednesday nights is totally worth coming out for alone ($2 Yuengling specials for a girl on a budget does not hurt, either.)  I've also come out for their trivia night on Tuesday with friends, and that is most assuredly an excellent time.  Honestly, this has become my bar security blanket, it's fantastic to be walking distance from a place that's always there for me on an otherwise uneventful Tuesday or Wednesday evening, ready to provide entertainment and good feels.", "business_id": "YRDKsBFYP7G0E8BLJKIkvA", "stars": 5, "date": "2014-09-24", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 2}, "user_id": "nEYPahVwXGD2Pjvgkm7QqQ", "review_id": "v8OZHBWXPg7bCNYuI5tM5w", "text": "Let me preface this by saying that my understanding of goulash came from what my mom called goulash.  Goulash in the Contrucci household was made of elbow noodles, beef and spaghetti sauce.  I guess you can't believe everything your parents tell you right?  \n\nSo going in here, I was thinking, great...mom's goulash!  What was set in front me looked NOTHING like what I was used to.  It was a mish mosh of veggies,noodles, gravy and some random unidentifiable food items.  I usually eat whatever is put in front of me, so I wasn't scared to dive it.  Sadly, I just didn't like it.  I thought it was actually not very appetizing at all.  I know, I know, this is like \"world famous\" goulash, but I was NOT into it!  \n\nWhat I was into was the German Potato Salad.  I love it, and honestly, I feel like I never get the same version of it anywhere in the Burgh.  This was a no frills version, with scallop sliced potatoes and a thick vinegar sauce.  Maybe a bit too much, but not enough for me to eat it all!  \n\nWould I go back? If someone else really wanted to go there, but I wouldn't suggest it nor would I go on my own.  Oh well, on to the next one right?", "business_id": "IxQ1ATP_Wg_QujO9nywzcQ", "stars": 2, "date": "2011-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KSS6v5fcZNoelu4eEZCFcw", "review_id": "2Mh-skbN3bFEcfsT50Gi_g", "text": "It's been over 5 years since I had been to Max's but we were in the area at lunch time so we decided to stop in. The menu is big and printed on a newspaper. They have all kinds of German food.  I decided to order a Reuben with a side of homemade chips. The sandwich came on rye bread that was toasted. It had lots of sauerkraut, Swiss cheese, and sauce with the meat piled high. It is one of the best Reubens I have ever had. The chips were thinly sliced and very crispy. There was no need for a dipping sauce, the chips were very good just plain. They had 3 or 4 desserts that looked good but I chose the German Chocolate cake. It's one of my very favorite desserts. There were 3 layers of chocolate cake. In between the layers of cake there is coconut, chocolate, and pecans. The outside of the cake is frosted with a chocolate whipped frosting. It was really good. I need to go back to try the veal.", "business_id": "IxQ1ATP_Wg_QujO9nywzcQ", "stars": 4, "date": "2015-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rOhY5632lmZnF3-ZFH20JA", "review_id": "FqoXGj_Ielqt1ODo6LiMwQ", "text": "Super nice, very patient and helpful. Did a title transfer and called ahead. She told me exactly what to bring, the exact price and payment forms. Definitely will go back when I need a notary!", "business_id": "Q0Mb1wtXrza1nKWHqiLfDQ", "stars": 5, "date": "2015-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "OD1zfOrexwZoxJjTowGDfw", "review_id": "LIi2SfEo50Vlbf7saSI-WQ", "text": "This place was a total surprise to me. I didn't really know anything existed on Troy Hill aside from Penn Brewery until I went for a ride through the area this past weekend. While passing through I noticed Billy's, it was open, the steeler game was about to start.... Why not check it out?!\n\nThe interior is dated, but clean and has some character. You enter though the bar and the dining room is on your right, this being a Sunday afternoon though, the dining room was not open. No biggie, I'll saddle up to the bar which seats about 12 people. The bartender was very nice, introduced herself and wanted to get to know me. \n\nThis seems like a mostly locals only bar, but they are very happy when people from outside the neighborhood stop in. One thing I heard several times while I was in there was \"Troy Hill is getting better, more people should come here and find out.\"\n\nI tried the soup of the day, chicken and corn chowder, and an order of their wings, $.60 during the Steelers games. Both were very good and made me want to come back to try more of the menu. The beer selection is a bit limited, they mostly stick with the big name domestics, but that being said, the beer is pretty darn cheap. Sam Adams Octoberfest was $2.50 a glass or $12 a pitcher! \n\nI'll certainly be back to Billy's and I think you should go too, turns out there are things on Troy Hill!", "business_id": "6AnorAMPkTdSDbUkOoV1Rw", "stars": 3, "date": "2013-10-14", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "hru2IDwSyN61sgWPtJw_hA", "review_id": "XAfneoCRYDf5DoIWbKfOBA", "text": "Its okay, but it was just ok.  \n\nThere's a $4 per person corking fee which caught us off guard.  We were expecting that would be for the table.\n\nWe started with the polenta and the mozzarella.  The mozzarella was unremarkable, deep friend mozzarella in breading.  Of course it was good, it is fried cheese!  But it was nothing special.  The polenta was a real stand out, tasted home made and was delicious.\n\nThey give you garlic olive oil and garlic bread sticks to dip in the oil.  This was free so I'm not complaining, but that just seemed a heavy and oily combo to me.  Also, the breadsticks were covered in rosemary, and I loathe rosemary.\n\nMy friend had the special, pan seared shrip over pesto penne, and she loved it.  I had this chicken dish with apricots and it was ... alright.  It was good but I felt like the searing on the chicken could have made this dish excellent.\n\nOverall I would come here again but maybe I'd stick with a staple like chicken parmigana.", "business_id": "q_BKmbdlYfQJroJVHfYMUQ", "stars": 2, "date": "2012-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 3}, "user_id": "J_q8jN623uew8ZzMChXBCA", "review_id": "Zu_IwcIJmsFFkQH2HP1NOw", "text": "It's upsetting that this Giant Eagle is in disarray.  The shelves are not stocked well, and last night there were broken bags of loose food in the frozen food section.  This neighborhood deserves better!  \n\nThe location is convenient for me, I just wish the store was cleaner and better managed.  I've stopped in several times when the store is closed, the hours are not as expansive as many of the other Giant Eagles that I shop at.", "business_id": "cZl7-Um4HiJWFgDVmMan2Q", "stars": 2, "date": "2015-11-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "PVXDSaBckF7vXt87XcP2Hw", "review_id": "Rsz-3MMwWKiwBaOdDNg9LQ", "text": "We had a fantastic time at the Children's Museum!  All of us had a great time - adults, a 5 year old and a 9 year old. So many great things to get our creativity moving!!  My kids really enjoyed making their own paper, screen printing and painting. They played for a long time in the climbing zone as well as the water zone. \n\nThis is a really great place for kids of all ages as there is something there for everyone. The workers were very thoughtful and kid focused. The Big Red Room cafe was convenient for snacks and drinks. Loved the hand washing station in the cafe. \n\nWe would recommend this attraction to anyone visiting the Pittsburgh area with kids.", "business_id": "-Gfj1gA0Ir07zToO-4fBpw", "stars": 5, "date": "2012-11-10", "type": "review"}
{"votes": {"funny": 6, "useful": 7, "cool": 8}, "user_id": "fNuz9eZKFwHPmrOKuJ69HA", "review_id": "bg7HN3izwjCvqXqn9rjLzg", "text": "BEST REVIEW EVER!  \n\n(Thanks and apologies to Marzan for shamelessly lifting her words - hey, if it's done right already, why change a good thing =)\n\nForever Steeler Faithful. Why?\n-5 time superbowl champs!\n-The birth of the STEEL Curtain defense - possibly the most potent 3-4 defensive scheme that has endured to this day - Steelers still #1 in defense. Thank you, Chuck Noll. \n-\"The Immaculate Reception\" - to beat out the hated Raiders no less - in your face John Madden Ha ha!!!!\n- An NFL dynasty.\n- Hall of Famers (i.e. Terry Bradshaw, Mean Joe Green, Jack Ham, Mel Blount, Franco Harris, Jack Lambert, Chuck Noll, Mike Webster, Lynn Swann, John Stallworth and many more)\nGO STEELERS!\n\nIf this review looks familiar, I admit - mine is the copy =)  After all, imitation is the sincerest form of flattery, right?\n\n#15", "business_id": "5GS5sBSscgcex0IFTDL9Bg", "stars": 5, "date": "2008-11-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4x141McSkvQSzMj3CfeweQ", "review_id": "9KHx4_CPy2oQePjK6Mu8EA", "text": "This is a gem in Pittsburgh.  The owner, Tom, and the workers will remember your name.  Its just like being in a small town.  Fresh meat and friendly people.  The meat is the best I have found in the city and is affordable too.  The best steaks I have ever eaten have been purchased from there and cooked in my own kitchen!  They are also very knowledgeable.  They can answer any question you have about what cut of meat to choose or how to cook something.  They're also more than happy to share tried and true recipes, which have always worked out for me.", "business_id": "obAdXU3RULuUOww759_h_w", "stars": 5, "date": "2012-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "83z7HNEAi63DRmHSy5VxdA", "review_id": "CWv3WVvfPEnc8yyLYrq5Rg", "text": "I was recently married at a venue that listed them as one of their four caterers to choose from. My partner and I did a tasting of their food, thinking we'd try to meet with at least two to three of the vendors, but after tasting the food (and getting zero response from the other caterer we'd outreached to) we decided to go with All the Best and we were both so glad we did. They were the most reasonably priced of all the listed caterers and I have to say,  going with All the Best, we really felt we got a lot of bang for our buck.\n\nThe food was delicious and plentiful and the service was truly great - they thought of things my partner and I never would have. All of our guests raved about the food. Even though we got the stereotypical \"wedding food\" it was GOOD wedding food. I highly recommend them for catered events - plus, as a bonus, they own Pittsburgh BBQ company, so we were able to get mini pulled pork sliders as an appetizer, which everyone loved!", "business_id": "4KJhRKocVPhrkdQQX2KVCw", "stars": 5, "date": "2014-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1VMTfE5MlQyDIRGWDSNsvA", "review_id": "VWOFfYpgkHOdTqazkCHzUg", "text": "Kuhn's is a great little market. Priced fairly and if they don't carry an item that you just have to have , ask them! They are really a lot like the old type grocery store. The meat is always really good, and I have no complaints about this store. No, it's not Giant sized but that's one of the things I like most about it.", "business_id": "9NL2GL4jSPVj9SKijH5PqA", "stars": 5, "date": "2014-10-01", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "D-DouujWwNBxwtqZTpOCTg", "review_id": "ZjLChhRyouk0jCVfrYKqJA", "text": "I would only recommend if there is a power outage and everything other food establishment is closed within a 30 mile radius. \n\nI love diners.  In fact, I'd say I've easily eaten at over a thousand diners in my time. They are great. You know what's not great?  Going to a diner and not being able to order a grilled cheese. That's right, Tom'a stops making them at 10pm, I'm assuming because the grilled cheese specialist's shift ended. Oh, but I can order a club sandwich, which, oddly enough has the same components as a grilled cheese.\n\nOther highlights of my visit:\n\nInitial state of confusion everyone seems to have when you first enter as there is no sign instructing you to seat yourself.  Wait, there is a chalkboard right in front, but it's blank. \n\nToo few waitresses, who were outside smoking as much as possible.  I can't say I blame them, working here seems stressful!\n\nBathrooms are prison like, and shared with the bar in the basement. \n\nHole in the ceiling.  If there was a ladder I would've considered using it to escape. \n\nThe waitress rolled her eyes at me when I asked for a box.  Look lady, I did that because I came to the same conclusion as you: I do not want to be here.", "business_id": "m61vZsAxmTEq3uiCjFjM8Q", "stars": 2, "date": "2015-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kxFyieYMntRXPUGCrmfbLA", "review_id": "NkiRwckPIVlWcpSbtXC7pQ", "text": "So you walk in and proceed to the counter.  You order the pizza with whatever toppings you so desire.  You get handed your drink cups and a number to put on your table and try and find a seat.  Maybe a 15 to 20 minute wait for your pizza.  Your pizza comes out and...... \"what the hell is this?  Take this back!  My cheese ain't melted and the pepperoni ain't cooked!\"  Chill my man.....take a few deep breaths....it'll be ok.....just TASTE it......there ya go.....holy cheese right?!  What a blend....It's all over the place and people actually order extra!  That sauce, nice.....sweet and chunky....yummy.  And the crust....the crispy, chewy wonderful foundation that holds it all together.   It's a bit different.  But different in the best way.  There's some great pizza out there.  Different styles and different tastes.  Do yourself a favor.  If you're in the Banksville Rd./ Dormont area stop in this place....it's just delicious.", "business_id": "93UCt9OgWYmypZCpXtUu8g", "stars": 5, "date": "2012-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Tr-tmaHdRUOeXF_FIojuAg", "review_id": "hN4eIe0NyJHtba-7LLX53Q", "text": "The pizza here is different from your traditional place. They only bake the dough and sauce then pour on the toppings cold. It reminds me of the those Lunchable pizza snacks I used to eat when I was little where you have the ingredients separate then you put it together yourself.\n\nThis pizza joint isn't one of those places you fall in love with immediately. Eating pizza with cold toppings is a bit strange at first, but once you get over it its pretty good actually. It took me a few tries until it started growing and now I find myself craving for it often. Its pretty awesome how they give soooo much topping on each slice too.\n\nI usually get take out from this place but there is a small seating area to eat at. This isn't one of those places where you must eat at the restaurant since the pizza is cold anyways.", "business_id": "93UCt9OgWYmypZCpXtUu8g", "stars": 4, "date": "2015-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zk0SnIEa8ju2iK0mW8ccRQ", "review_id": "7Ob_a2RKr9HJyiFtqpzzoQ", "text": "Went here because the Chinese restaurant a couple of doors down from Cain's that we were going to was closed. The noise in this place is over the top, so much so that we couldn't have a conversation. We were hungry so we stayed and I'm glad. I got the \"Cod father 2\" with a side of onion rings. This comes served with french fries and coleslaw and hot sauce served on top. I asked if all the stuff be served on the side because I'm picky about coleslaw. This is a great sandwich, even deconstructed. The cole slaw is creamy without being soggy and the fries are fresh.The onion rings were stellar. My companion got a rubin and she said that it was pretty good.I was too full, but she got a brownie with ice cream and she was very pleased.", "business_id": "5Udv4CASAXB2eH66TefWPQ", "stars": 4, "date": "2013-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "yDI6oPaX_7WvLkzg1yQ0CA", "review_id": "qtWTlKODGjmQqjHhz-JaQQ", "text": "I use their wash and fold service. I drop my laundry off Monday morning before work, and pick it up after work in the evening. They only charge $1.20 per pound, and I get everything back washed, dryed and folded. I've been going for awhile and nothing has ever been damaged or lost. It's super convenient, affordable, and I imagine it's what having a housewife would be like. Love this place!", "business_id": "l4zq494c6zfNUJrMcd9Y1w", "stars": 5, "date": "2013-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ixh6D-PpyTyfSJmyDhGvtw", "review_id": "jB1r_ybPPl0D6sTDvTUeTg", "text": "Went here for a co-workers bday, will be a lifer!\n\nHad the raspberry french toast, it was the bomb.\n\nWater was ice cold, service was quick, prices were cheap. And as i said earlier.\n\nTHE FRENCH TOAST IS THE BOMB. \n\nPancakes looked really good too.", "business_id": "2Igiyhi82R8_QaaPplRmCw", "stars": 5, "date": "2013-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KGtOFqqD4MDwA6aYTwwcSA", "review_id": "aGXAoU7vR9kWaUHbjkqaPw", "text": "Fantastic! Not from around here and felt right at home!! Food is amazing, awesome hole in the wall local spot! It's a must try!!", "business_id": "2Igiyhi82R8_QaaPplRmCw", "stars": 5, "date": "2014-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G1OpOeHgc4g5LVBUOZjPHg", "review_id": "NPoc9qjDxdA4L1A-5YGjbA", "text": "I usually find it difficult to commit to Campiti's with Fiori's right down the road, but I love the fact that they are inexpensive and from my experience, always friendly.\n\nSauce and cheese are both great but their dough is a little bit thinner which can sometimes result in a crispier dough that isn't my preferred style, but still good.", "business_id": "Cex2R008tMFg8R5fAtf77w", "stars": 3, "date": "2015-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q7MrNVt1FE23rwtWmPYWHg", "review_id": "5NOoEqxY3aTeZAK1gX_A2Q", "text": "As you may know, the people who own Las Palmas took this over. It will still be an IGA but with a Mexican flair and the Las Palmas location doors away will close. The tacos will be sold outside the IGA now near their free and big parking lot. \n\nAs for the tacos, I liked their pulled pork and chorizo ones best. The ground beef tacos are gummy and gristly and unseasoned and the steak and onions ones aren't bad. They double up each taco with corn tortillas.", "business_id": "21hqlWgjmNgW4pBZJDuziQ", "stars": 4, "date": "2013-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Q2dmPx_6caLpdk1OhqzWBg", "review_id": "taRh9FjlPZoYwyKLMRKTRw", "text": "Had the gnocchi delivered. Absolutely terrible. Gnocci's had to have been 2 years old. Delivery guy was shady too.", "business_id": "iudRNo5Q8W7firUBYJEqQQ", "stars": 1, "date": "2013-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HC1zr2aBxtgiQXLhfpaRlQ", "review_id": "WkkxVeDUJ4HlN25dLrcjMw", "text": "D's is a legend in beer in Pittsburgh. The selection can't be beat and the food is unique and a style all its own. Thanks's for the years of beers, D's", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 5, "date": "2009-10-17", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "So32N7bSbUd1RwhFtI6jTQ", "review_id": "ynOtIUMl7dMCWufFOVO-sw", "text": "My three stars are for the decor, wow so much to see! There was a giant mural on the wall to the left of our table with just about every iconic figure from Kermit the Frog, to Einstein really it was a sight to see. My little sister, little bro and I had a blast playing where's Waldo, while we waited for our order's to be taken. The  decor and wall murals were about the most interesting thing about our dining experience.\n\nFor a meal for 3 people I spent $50 ouch that's a little high for a hotdog shop and something I wasn't expecting such a high bill.\n\nThe kiddies did enjoy their meals, we got cheese and chili fries, a mason Dixon dog, a red alert dog,  two beef dogs with mustard and ketchup, two drafts of pumpkin ale(for me) and a Philly cheese steak. \n\nThe dogs are  bigger than average, but the chili tasted like your standard chili from a can, I was hoping that with the price tag of $5.00 a dog the chili would have more character. \n\nMy little bro proclaimed at the end of his meal, \"I'm full, I've never  been full off of two hotdogs!\"\n\nI'll do anything to put a smile on kids face, even though the food fell flat, the restaurant was fun and we smiled laughed and jokes through a rather mediocre meal.", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 3, "date": "2012-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "SlKJNLm1SQdgaaKtqD--1w", "review_id": "UYzFu1awMdzrDgPGAkPwMg", "text": "The best hot dog I've had. Ever. I also have to say trying to decide which hot dog I wanted was by far one of the hardest decisions I have had to make (food-wise). Eventually, I got the chihuahua dog because it was out of the box and I wanted try something new. It comes with avocado spread, salsa, cheddar cheese, and jalapenos. The dog itself was perfectly crunchy on the outside and juicy on the inside and really just the best I have had. The toppings were great and I was happy I gave it a try. My friend got the bacon and cheese dog. I was expecting bacon bit type bacon, but they were full strips of bacon that were perfectly crisp and the melted cheese was right on. I am certainly going to come back and try a new hot dog. I am very exciting to finally have a hot dog place that I know produces fantastic tasting hot dogs. \n\nI would definitely recommend you give this place a try.", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 5, "date": "2014-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tQjvFcsbpUre8zRRpK7zMw", "review_id": "ppGKa3oWiBx-mXMLkAm49Q", "text": "I just moved to the neighborhood and needed to find a dry cleaner close by. Regency Cleaners is fine for dry cleaning but do not entrust any tailoring or hemming to this place! I had the sleeves of my coat hemmed and the tailor (or whoever) did a shitty job (THANKS).\n\nThe owner (larger woman) is rude and dismissive of my questions.\n\nI won't be coming here again.", "business_id": "1PcoOrAavnik-f_Epp9v0A", "stars": 2, "date": "2013-09-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "6QhWTugzBJ3cdv2N4WZcSA", "review_id": "nllTwxz1fScBDA-jUF0vig", "text": "I visited here for the first time today, although I've had drinks from here before. The kid at the counter was nice enough, so service was not an issue. The atmosphere inside pretty much sucks though...and you have to work pretty hard to make a cute little neighborhood coffee shop have zero atmosphere. \n\nThe first thing you see when you walk in a sign alerting you of the \"RULES\": to not use your cell phone at the counter, and that you must pay for something to sit inside, use the restrooms, or use the WiFi. Now, I understand the sentiment of these rules, they are common sense and fair. But it's a rather negative note to start off your experience being yelled at by a sign assuming you are there to steal their interwebz. It just doesn't feel warm or welcoming somehow. The front counter is poorly organized and rather unattractive. If it ever gets busy in there I'm willing to bet it gets rather chaotic.\n\nI ordered an iced vanilla latte, so I was quite surprised when the kid pulls out a pitcher from the fridge of what I can only guess was refrigerated espresso. That was rather disappointing; there's no reason an iced latte shouldn't be prepared with fresh espresso shots. Not surprisingly, it tasted bitter like...old espresso. Then I finished the drink to find the cup was 90% full of ice. I mean, come on. My lemon almond biscotti was delicious. The rest of the offerings in the pastry case appeared pretty underwhelming though; standard prepackaged muffins and cookies. With the number of excellent bakeries in this area, I don't see why they couldn't partner up with someone to provide some higher quality foods.\n\n\nI think this place could learn a lot from Square Cafe as far as decor and atmosphere go. It needs a little pep, a little warmth, SOMETHING. And they need to learn how to make iced lattes correctly. And they could also use an upgrade on their website...it's pretty amateurish and has a 1992 flair... Basically they just need to show a little effort.\n\nI love to support local businesses, but there should be more of a reason for me to return than the fact that it's the only coffee shop in town.", "business_id": "D9sHwmqlNkrVxmX-057i1g", "stars": 3, "date": "2011-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V4RiPpr91RxwlcNt4xLU6A", "review_id": "JrVaz5F82HA50KQepFnqbA", "text": "my dad always raved about the battleships, and often we would make the drive just to get them. Very fresh ingredients, and simply delicious.", "business_id": "DzOPHyrG2XuVqKEvHCnN7w", "stars": 4, "date": "2015-11-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "gSLy4fdXb2smyGGJ7TAxNQ", "review_id": "hwU1IxjoB4KJF--Ji7WWWQ", "text": "This is the WORST Hibachi I have ever had.  We came here for a friends birthday, and I will never be going back. Service was mediocre, but the food was the real travesty.\nYou go to Hibachi for a show, but it's not fun when the cook makes the SAME Giant Eagle joke the entire time.  He also couldn't perform all the tricks that are pretty standard from Hibachi chefs.  The food. Not good.  My boyfriend ordered tofu and it was cold in the middle.  He didn't bother to have the guy heat it more, b/c it would have just been a hassle.  The chef forgot one friends meal completely and got rude with the server.  Then after everything was cooked, he looked at me and asked did you eat all your shrimp. I replied \"no, you never served me any.\" (I had ordered the chicken and shrimp.)  He then sends the server back into the kitchen to get more. By the time they were cooked, everyone was finished eating.  Come on.  To make matters worse, when we left we saw that he was the head chef. That doesn't say too much for the rest of them. \nI don't know how people keep coming here.  There is WAY better hibachi in Pittsburgh, for a lot less money.  I mean honestly, I paid $9.50 for a glass of Kendall Jackson. No. \nThe best part of the meal were the cupcakes that my friend brought.  Do your wallet and your stomach a favor and go to a different Hibachi place.  Benihana is not worth your time or money.", "business_id": "1vQLTKwmcmZXtNzfKEvMmA", "stars": 1, "date": "2014-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y3tvIOiiu4OWVWPPEVp_WA", "review_id": "D8csZLyjH2lt4RNS6cE03Q", "text": "I think its time to sacrifice time and convenience. When we visit the area....this place always lacks the experience that we receive from ShadySide, Robinson, and Ross Park. Even though it closer to my Dad's House when visiting...its time for us to part ways. The food and service is never as good at this location. I love, love, love their tofu tacos...but this was just eh this time...it was as though the thick pieces fell apart and they were small and too crunchy and maybe just old...bleh. I couldn't even finish them, even though I cannot wait to eat them the 3 times a year I get to have them. Total Bummer.", "business_id": "hhNlQWaKqGbMPoeZHoL-IQ", "stars": 2, "date": "2014-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "N_XFO8FzEfUCFl6Q1RZ59g", "review_id": "H9G4po4c4ZTfYPqjmnlYcg", "text": "Since there is no where to leave comments on the restaurants website, the following are more of suggestions/comments (let's hope they read these). The comments should be obvious to those with any common sense, but unfortunately, I find myself having to state them anyway. First and foremost, and I feel like i am stating the obvious here, the cinnamon & sugar (c&s) bagels are very sticky, especially on the bottom. With that being said:\n1. Do not store c&s bagels underneath any of the following bagels: onion, poppy seed, sesame seed, everything, or any other bagel that has \"loose parts\". When the loose parts fall off  they stick to the c&s bagel. Biting into a sweet c&s bagel and getting a bite of onion (which I dislike) is AWFUL. \n2. either wipe off the counter or place a new sheet of wax paper on the counter after prepping one of the above mentioned bagels with loose parts. Again, when you place a c&s bagel on top of these loose parts, they stick to the bagel. \n3. when someone orders a tub of cream cheese to go with a c&s, please wrap the bagel. If not wrapped, the container becomes sticky and messy from coming into contact with the bagel.\nI was a \"regular\" at the Market Square location before changing jobs and never had any of the above issues. The C&S bagels were kept on the top shelf and they wiped the counter off after EVERY order.The only good thing I can say about this location is that it has drive through.", "business_id": "uwiD9jxs09xxXG0by_xKuA", "stars": 2, "date": "2014-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gH2C8RhA36R1G3uejvblrQ", "review_id": "4UeS1zKQEZwAQeJNh2popw", "text": "Great place!! Tried a different bar in town and was highly disappointed by it so we tried this place and we love it!! The only problem is, they close too early on Sunday, lol. We didn't have the food to eat, but everything they have brought out for other customers looks and smells great! But definitely good drinks, great atmosphere and super friendly staff!! Oh! And they have carry out beer!!", "business_id": "KZXtzoI84iI1CEcAnD7OPA", "stars": 5, "date": "2014-09-14", "type": "review"}
{"votes": {"funny": 4, "useful": 4, "cool": 3}, "user_id": "iTmWHtltCtk0Gm55AOxrUA", "review_id": "bDVdKLtNWZDdyCPAj2zlKQ", "text": "Yeah, yeah, yeah, I know.  Why go to the Olive Garden when Pittsburgh has so many great local Italian places?  Hey, it's convenient and the food is decent.  For lunch, Olive Garden ain't bad in a pinch!   I had business to go to near the airport and I stopped here out of necessity.\n\nI had the basic spaghetti & meatballs in marinara sauce.  Not bad.  I wish they had cups of soup 'cos the Zuppa Toscana was mighty tempting.  \n\nOkay, so I admit I like the Olive Garden.  But my husband better not take me here on date night!", "business_id": "zpNGtjBlIkDq_PLGSCPlAg", "stars": 3, "date": "2010-11-22", "type": "review"}
