{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vGI3dbg5zFRXBg4eVVmGSg", "review_id": "e2YxtsZJE3w6DdNP8yMs7w", "text": "Ive pretty much been eating at various Kings' pretty regularly since I was a child when my parents would take my sister and I into the Fox Chapel location often.  Lately me and my girl have been visiting the Heidelburg location. I love the food, it really tastes homemade, much like something a grandmother would make, complete with gobs of butter and side dishes. Prices are low, selection is great, but dont expect fine dining by any means. \n\nService is hit or miss at pretty much all of them; if you have lunch at any Kings, you will likely be waited on by a sweet but sarcastic  older lady who has been doing the waiting thing for 30 years and knows her game. Seek out this lady.  My experience with the younger crowd at night isnt the same.\n\nIm in my 30s now, and very little has changed, other than the Fox Chapel location was remodeled about 10 years ago to look less like a diner, which was a big fail.  Any girl I meet has to enjoy Kings or she's out.", "business_id": "wJr6kSA5dchdgOdwH6dZ2w", "stars": 4, "date": "2010-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "boLuWufcpuiu-djrz17SlA", "review_id": "rJYOpqdhAeL_eGY6W7TpuA", "text": "Oh man, this place is awesome! You get to choose what type of pancakes you want, so I chose banana chocolate chip and they were delicious and huge. You get three pancakes and I had to take two home to finish later. My friend got the stuffed French toast with bacon and again, delicious.\n\nThe food came fast but the waitress wasn't all that attentive. She was pleasant enough but we received no coffee or water refills. That's pretty much the only complaint. If you're in the area, definitely stop and check this out.", "business_id": "2Igiyhi82R8_QaaPplRmCw", "stars": 4, "date": "2009-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aGfuU1Os9yXjKLshTkoyug", "review_id": "DLAAM1huVxmihSQj4XGWrw", "text": "I stopped in here after seeing the place on Diners, Drive-Ins and Dives. I had a late breakfast with my boss, as we were both in town from Miami to do some research for the travel section in the magazine I edit.\nUnfortunately, this was the first DDD meal that didn't leave me wanting more. The marquee dish on the show was the Jumbot. I had it and it didn't do very much for me. That said, it wasn't bad either.\nOn the bright side, my boss said that Dor-Stop's was one of the best eggs benedicts he'd ever had. He's very critical of restaurants, so I take that praise pretty seriously.\nService was as friendly and informal as yo", "business_id": "2Igiyhi82R8_QaaPplRmCw", "stars": 4, "date": "2014-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9HzBRZrv_oaNs8gqL04gZQ", "review_id": "EvvAVoqp9SWeppQHdpoAFA", "text": "Dor-Stop Diner is a gem!  Make sure you come hungry.  The apple oatmeal pancakes were delicious and perfectly prepared.  My friend had the raspberry French toast.  Both were excellent choices.  The waitress was super nice and prices were very reasonable.  Great spot and a fun new find!  I'll definitely be back.", "business_id": "2Igiyhi82R8_QaaPplRmCw", "stars": 5, "date": "2015-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "o9XGClSBzCsQxbcCzTPdnQ", "review_id": "bHmFuWcnpXI2D9ZyIjjIfA", "text": "The staff is very friendly at this location. I love the create your own salad option, and the produce is always fresh. Skinny bagels have become quite the trend, and Brueggers does it justice. At times, the coffee can be mediocre, but the bagels are always fresh, and Brueggers really is a Pittsburgh staple. A skinny zesty egg white breakfast sandwich is the perfect way to go for a lite breakfast.", "business_id": "sQWSHCIH_HUT4HUXaxDaBA", "stars": 4, "date": "2013-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "nvtGOilRudNHkusp8Y546w", "review_id": "uOHeotbakPKT8xfXFPf95Q", "text": "Mmmm. Crepe pancakes. What an idea. 4.25 stars (sure, I can give quarter stars, why not).\n\nPer the bf's suggestion, we went to Pamela's for brunch, on our first stop of our day trip in Pittsburgh. Hmmm..... a brunch place, you say? Why not! Cool decor inside- half hipster, half well....midwest diner. Our wait wasn't really that long- we put in our name at around 11:30am on the Saturday of Labor Day weekend, and was seated within 30 minutes. In the meantime while we waited, we checked out the cool Mexican place above Pamela's. Cool.\n\nHe got the standard breakfast special - which was standard, there's no way to really rate that stuff- and choc chip banana hotcakes. I ordered the blueberry hotcakes.\n\nHis choc chip banana hotcakes were so so good. Bananas stuffed into a thin crepe of a pancake with the chocolate all melting inside.....omg, it was good. My blueberry crepe pancakes seemed to be extra crispy (which I liked, by the way) with brown sugar and sour cream in it. I felt like there needed to be more stuffing in it, but it was still pretty good.\n\nCoffee was standard here as well. But I LOVEEEeeee diners, so this was a place that was above your normal diner. Cool. I still crave those crepe hotcakes....", "business_id": "TxKmAsKQjND5vbhBdUSyIA", "stars": 4, "date": "2011-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aU_zecjEUd8ixDXqWrK2kQ", "review_id": "0VDKL_pPeFhBhqCMUAcCsw", "text": "Recommend by several senior student of mine in CMU, finally I came here today for my dear friends birthday. Food in here really amazing and served very fast. Associates in Pamela's also very kind and sweet. But they only receive cash no credit card such a pity.  Love this dinning experience and will come back very soon :D", "business_id": "TxKmAsKQjND5vbhBdUSyIA", "stars": 4, "date": "2014-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L2ne7hSJDy0U6sBD8wVaQA", "review_id": "lUlVCReyklS3ggpgbTSQ8g", "text": "Amazing crepes!\n\nMy wife and I love this place.  We often stop by and try different crepes, my favorite has to be the Russian blintz and her's is the Nutella and banana.  I highly recommend getting a Cafe Au-Lait with your crepe.  \n\nNo complaints about this cozy little creperie.", "business_id": "cmGR1HS9ms233roSllcglw", "stars": 5, "date": "2012-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8ED8BPCXKXZnGsVMyl5Bhw", "review_id": "E5Wfs0Uxs96pWvc0Z5koog", "text": "I'm a fan of the Leonardo di Veggie sandwich, but I like to get it without the onions so that I can still talk to clients for the rest of the week. The Brueggers red onions are a little crazy. \n\nThis location can get a little busy around lunch time, but the staff is smart and efficient and ready to handle it. I also like Brueggers' soups, when they have one that is vegetarian. They do a lot of chicken and Italian wedding and such, which I'm sure are lovely...they just don't float my boat. \n\nThe coffee and tea selection is also great here, which is nice. \n\nAnd best of all...the wireless is fast and free! If you get here at a time that isn't overrun by the lunch crowd, it can be a great \"office.\"", "business_id": "LUylwiKNsS7_iumytRgAmw", "stars": 4, "date": "2008-11-08", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "ts7EG6Zv2zdMDg29nyqGfA", "review_id": "V-PAoBrxtS1fJj2TM78J0Q", "text": "Always have been a fan of Showmars but never tried the breakfast there.  I wasn't dissappointed at all!  I had a turkey sausage, egg and cheese sandwich and loved it.  Along side of that I had a bowl of grits made perfectly.\n\nThe service at almost every Showmars is what I think really sets it apart from other chains.  It's always friendly and I feel like they are eager to please.  Not for nothing, the stores are almost always very clean.\n\nIt doesn't take a lot for me to be impressed but Showmars does it for me if I'm looking for something as close to fast food as I feel like getting without the terrible food of a typical fast food joint.", "business_id": "8PsQqhrAH5uqJ7HODOmXYg", "stars": 4, "date": "2012-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1bOrK1JhfXYoMJqPLWFg8Q", "review_id": "y6YMoeNxjQ3cOdhlXUjCHg", "text": "This use to be the go to place because the food was always consistent.  I hadn't been in about 2 yrs though due to the quality/service had dropped.  So this weekend I was in the area and decided to give it another try.  I had the Ahi Tuna.  The tuna itself was good but the noodle salad had a strange  taste, like it was old.  The green salad was soggy, as if it had been sitting in dressing all day.   I never thought I'd say this but the Harpers @ Carolina Place mall seems to have upstaged this location.  Their food is always good.", "business_id": "hIQRiE3UsYH7UsrsDwJwLA", "stars": 2, "date": "2011-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uFhapvzjcoWXpzVkczs9YQ", "review_id": "78O9rgoF4Xtm7yeo1ZLrOA", "text": "Great food,great service,great atmosphere,sometimes has a wait during peak dinning hours so your best to try call ahead seating.", "business_id": "hIQRiE3UsYH7UsrsDwJwLA", "stars": 5, "date": "2015-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "J0h_oB2VEhMTlcqKmspjWQ", "review_id": "UojdUeY_Xsd1JeE75YJqpQ", "text": "For you bacon lovers, they have bacon pancakes! \n\nThe restaurant is in a busy location but this was not a problem when I arrived. I like the warmness of the restaurant.  I ordered two buckwheat pancakes and two eggs over hard.  Buckwheat is a type of flour that is supposed to be pretty health.  I enjoyed every bit of the meal as it was just enough for my stomach.  Service was fast and courteous so we were able to run in, grab a quick bite, and be on our way.  I look forward to my next visit to OPH; the location, however, is far from home.", "business_id": "UzMMpUFwJhwUkHOyeXeWsQ", "stars": 5, "date": "2013-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "r-yfwsugJKWgJJhfRAD3yQ", "review_id": "x_guIekg-kMx78tvMOEinQ", "text": "I have been eating at the Sunrise on Albemarle Road for more than twenty years.  It is one of the most consistent restaurants in regards to the taste and quality of the food in Charlotte.  If you order something you like, it will always be good.  If you order something that doesn't taste right to you, it will be the same next time.  For me, a ham and egg breakfast with toast and tomatoes is as good as it gets.  All of this for less than $8 makes for a fine morning.\n\nYou should be aware of some of the patrons.  They are not your normal uptown crowd, they're more like country comes to the city type folks.  You are not likely to see any ties or fancy dresses here, just good ole Americana.", "business_id": "KQqkkg5jaxIbdMIG4MJCIw", "stars": 4, "date": "2010-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nHsj0cHOiroAsmDfF50BtA", "review_id": "G4F8AZ1DG5YZiSnlNMpZ1w", "text": "Good Ol' Days is a throwback to the 1950s, poodle skirts, cruisin' cars, and jukeboxes.  It's a pretty decent and clean 50s-style diner with neon, chrome, checkered floor tiles, and bright pink colors.  \n\nI've been to Good Ol' Days a few times for breakfast but I have yet to try anything from their extensive lunch or dinner menu.  The menu is like a book.  There's a lot to read just for breakfast alone, so I can't imagine having to pick something for lunch or dinner where your choices extend way beyond eggs.  I usually get their Western omelette for breakfast, which is their \"most popular\" according to the menu.  Sure it's popular.  It offers the most ingredients in it, and I like my omelettes loaded with \"stuff.\"  That's why I order it.  Wash that down with some bottomless cups of coffee and I'm good to go!  \n\nI've taken out-of-town friends and family to Good Ol' Days for someplace different after I've already taken them to my favorite breakfast place (Pewter Rose) the day before.  You can't go wrong with a 50s diner; there's something for everyone.  And this one usually offers great, fast service and delicious food.  Just be prepared to have a make a tough decision with all their menu items.", "business_id": "ttsxQ4P_jEqKLxwkLUI8_w", "stars": 4, "date": "2008-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FAHBjRlfQmQqPN560x--Pg", "review_id": "rjMTCgS527b74KL-dJUAiw", "text": "Great atmosphere. Higher end suburban location. Prairie style decoration. Went there on a Friday morning and it is definitely the retiree  hot spot! You stand in line to order but made to order plates are delivered to you by table numbers. I ordered the corned beef hash.very corned beefy--ok with that. It's shaved meat not ground up. Very oniony--not ok with that. And it should have been crispier. Weak on the potatoes in my hash and hubby's side to his eggs. Overall, lots of food though!  I got the multigrain baguette as my bread choice and it was a lot! Scrambled eggs also seemed like more than the promised two eggs. Nice staff. Less than $20 for two of us and they took my credit card.", "business_id": "ShEYKerTwb2LSORE5o_s7A", "stars": 4, "date": "2014-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ht43WIt1vNIaodW-u8Xxng", "review_id": "3LC8j8FJdr48ScDUzLDUPQ", "text": "I nicknamed my \"lunch special\" the \"recession plate,\" as my portion was significantly smaller than my table mates. The food was okay, just kind of fatty. The corn muffins had so much butter it was nauseating - and i love butter. \n\nThe only thing that saved this place was the chocolate bar i purchased in the store area. That shit was good.", "business_id": "QF14BFUVHRODxGNVflgm3A", "stars": 2, "date": "2012-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tpeM-40ZXMMloIhTQoz5qw", "review_id": "ZFh-ObiI2tIsifa055vtsg", "text": "I went here for the first time this afternoon (a Sunday), about an hour before closing time. I sidled up to a rather short stool at the counter and was quickly greeted by one of several waitresses who were busy with their end-of-shift chores.\n\nHaving read a Yelp post about the Chorizo Platter, I immediately ordered that, with a baby pancake on the side and a bottomless cup of coffee. It came to less than $11.\n\nThe wait time was average. The coffee was a little better than average, with refills aplenty. The main entree was fine but overall bland. Even a healthy dose of Cholula didn't do much for it. I think part of this had to do with the chorizo, which is always a letdown wherever I order it.\n\nThe star of this meal was the \"baby\" pancake, which reaches the edges of a normal-size plate. It was not too thick, not too thin and had a perfectly smooth bottom that I love. I did detect a slightly \"dirty\" taste, but I'm not sure what that was from. It might have just been my tastebuds acting up.\n\nThe ambience reminded me of every small-town breakfast/lunch place I've ever been to in the Midwest. The waitresses, while clearly looking forward to heading home in an hour, were all still very polite. (One, in particular, kept checking the Packers score and was bemoaning the fact that their team was trailing.)\n\nFor anyone familiar with Middleton, C's Restaurant is a good comparison to this place. Although, I would rate C's higher after dining at each place once.\n\nConsidering I live less than a mile down the road, I definitely foresee myself returning here anytime I'm in the mood for a no-frills breakfast.", "business_id": "MONajnUQ5-IRtv8PSPn_yA", "stars": 3, "date": "2015-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3zxHXzxP6D6K6kvDImzMAQ", "review_id": "8NlP8slfpYb8ZbJQ3Et44g", "text": "This place is nostalgic. It's got that classic diner booth setup where the servers pass plates right from the center, and they're both friendly but abrupt like a diner should be.\n\nIf the coffee even tried to be good here I'd probably be here more often (they usually always keep it topped off!). But it's consistently the worst coffee in town. You can taste the stale.\n\nEven so, it's a diner. I still go back for friendly people, cheap eggs, the clanking of dishes, and the grease rolling on the edge of the plate.", "business_id": "vBg5V39Vf4eTx1JVgl_5Pg", "stars": 4, "date": "2013-10-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "m8u49f6BQbnLBPujd6twaQ", "review_id": "AcZZdMoft0LNbMF_Za3T9A", "text": "This is a solid place and I don't understand why it's gotten such bad reviews! It's a lovely place for brunch... the garden egg white omelette was yummy and  the coffee acceptable. Overall,  i  like!", "business_id": "6HKjKhgDLBpuZFNBOCzVQw", "stars": 4, "date": "2009-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DJhCX7TvKetUR8aBYZAT_g", "review_id": "mYOmdDfUB3d8e04QG3R8lA", "text": "My wife and I eat here after every horse back ride and it just makes the day so much better. The atmosphere is definitely more upscale than a greasy spoon but the cooking feels much more down-home. I've never met a bad wait-staff or hostess here. On Saturday, even with a line out the door, we are usually sitting not long after arrival. I love their waffles and I can't stop ordering that punch drink they make. Also, grab a glass of the raw cider. It's intense. \n\nAbsolutely love Le Peep", "business_id": "6HKjKhgDLBpuZFNBOCzVQw", "stars": 5, "date": "2015-10-15", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "XAAs2Y77fUqV26C2ec5-7g", "review_id": "A5PYOgL8uHHeoF2UwnDdZA", "text": "A grad school fav... This place has stood the test of time, which is the best indication of restaurant quality.", "business_id": "AB5RgQ0ZnMThdqgFS3cPuw", "stars": 4, "date": "2011-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8A8wyMRO82vSxLlzoRwA1w", "review_id": "cpB-pMD95JE1TutiaL148Q", "text": "Been there many times over the years, and the restaurant went down the hill. Service is awful and very slow, portions small, ingredients often inferior, and food overpriced for its quality and portion size. Seared tuna was not even chewable, lamb balls dry, potato tapas prepared ma-a-any days before we visited. They used to have tasty ox tail as tapas; now it disappeared, though remains on the menu, and the waiters lie that \"we ran out of it today.\" The only reason to go is a huge list of draft beers.", "business_id": "AB5RgQ0ZnMThdqgFS3cPuw", "stars": 2, "date": "2015-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CYKhZ11zVTMgsHkmnFmyNg", "review_id": "SupTCgGCZoM3YAbtPBhwrg", "text": "First of all it only gets 1 star because there isn't an option to select NO stars. DON'T GO HERE!! we came in about 2:45am after leaving a concert in the area and getting back to our car. We pull up to the parking lot which looks empty. We go in, there are about 10 tables of seated customers. At least 5 of them had no food and 4 of those didn't even have drinks yet. There is 1 couple waiting to be seated ahead of us. We wait about 20 minutes to be seated. The manager finally seats us at a dirt table for 6. There were only 2 of us and plenty of 2 person tables avail. We didn't complain. Another 15-20 minutes goes by. The manager comes back to us and see we haven't gotten drinks. He asks if we have even put in a drink order..nope. So he takes our drink order and send a waitress over with our drinks about 5 minutes later. Who bring us each our drink and a second drink each. (knowing she wouldn't be back in time to give us a refill) at this time we place our order. We wait and wait and wait for about 45 minutes. Many more people have arrived and been seated by this time but still there same 5 tables that didn't have food when we came in still had no food. So about an hour since we had been seated a waitress walked by and we asked her how much longer our food would be. She said it should be ready. We told her to just go ahead and box it up. By this point it was almost 4am and lots of obnoxious drunks being loud. She gladly said okay. About 10 minutes later she bring us our bags of food and says its on the house. We were so upset at the whole situation by this point but we nicely said thank you and left. Got back to our hotel to eat our cold food and none of it was even right. I don't know who's order we got but it wasn't ours. We attempted to eat some of it but it tasted horrible. No flavor just plain bland cold rubbery eggs and bacon. TERRIBLE. then only reason we stayed was because we were starving and it was all that we could find open. I don't know how this place is still in business or how the IHOP chain hasn't closed them down yet.", "business_id": "P7wKlbSRsoRrfH3DFOY08A", "stars": 1, "date": "2015-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JVtHJzW3sq5se-5jh9pKzA", "review_id": "KYrr5TJRaDM3HF5oEWhgmg", "text": "The grllled cheese is never grilled to crispy.  It's two pieces of mushy bread with the false hope of it being crispy by the faint grill marks and semi- melted cheese in between.  The fries are usually lukewarm.", "business_id": "I4L_MJOZsnux3xCU2bLP8Q", "stars": 2, "date": "2015-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "39TNBuv4Um0rG3LEv-4xPQ", "review_id": "4ogt0uPpcUR4bNyjoH0HoA", "text": "The atmosphere here is very nice. Not sure what the building was prior to becoming a restaurant, but it's pleasantly decorated. And the food quite tasty. This is my first visit to The Good Egg and I will have to keep it in mind for future breakfast visits.", "business_id": "SkNUbFJiJtbZjY-S_S0u7g", "stars": 4, "date": "2014-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PuTmcfPDLNUAKo68LmdZOA", "review_id": "eV37qRjU8ZOdxp5goJIr0g", "text": "I love this place, we actually went twice this weekend!  \n\nThey have some veggie options on the menu which is nice, and they are happy to change anything around to make it vegetarian if you'd like.  The service is friendly and the prices are great.  \n\nThe meat eaters at my table said that the meats were fantastic and we all left very happy!", "business_id": "PxeX1M8WtyPxX1MuuGIh-g", "stars": 5, "date": "2011-10-03", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 3}, "user_id": "UG0gkwl621U29BWpgSYRlg", "review_id": "L_wXhRHpjqbhQFmz71EjXA", "text": "Since I manage to find My BadSelf in here at least once every few months I suppose You need to understand ~ OMG, Why? ~ \nFirst off; Nostalgia! During the 70's My Friends, along with a Guy in Gold Lam`e UnderWear, a Girl in a JC Penney's Bra and Slip and occasionally Myself would end up Here. Every Weekend after the LateNight, DoubleFeature, PictureShow (RHPS) @ the Sombrero Theatre. This is where You would find Us gathering, it was Our; Arnold'sDrive-In / FrostyPalace / Mel's Drive-In. \nThe fact that it is Still Here, unlike The afore mentioned; SombreroTheatre, Sambo's (on 1st Street and McDowell), Caf`e Casino along with Cin`e Capri (at 24th Street and Camelback), LuntAvenue MarbleClub (on the NorthEast corner of Central and Camelback), Willy&Guillermo's, OscarTaylor, The MasonJar, The (Original) Monastery, et cetera...... After Developers, Speculators and their ilk were finished generally tearing up the place, there wasn't a lot of recognizable, comfortable landmarks and haunts left for Us native & semi-natives. So once ~ facebook ~ starting bringing Us all back together, what better place for Us to reminisce with old friends than with Our old hangout... \nThe food is not \"world-class cuisine\" it does not need to be, it's the old comfort food We remember, golden eggs, fluffy pancakes, tasty O.J. and fresh, hot coffee. Added bonus; on Your birthday, breakfast is free!!!!!", "business_id": "FKHv7FkblONv9qqBndJUrg", "stars": 4, "date": "2010-10-04", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "QT-7jpsEuCR-pFro59KBtQ", "review_id": "J6ml5-aAfWcsEuZWn5n0YQ", "text": "I love visiting D & D. This place is about the atmosphere as well as the food. On the weekdays the place is bustling with corporate America, moms meeting up and exchanging baby stories, a few networkers collaborating on a project and one or two snooty folks. It make up a wonderful array of folks having lunch. \n\nOn the weekends there are families, dogs, children, babies, old folks, young folks sharing stories and sitting outside listening to the great performer chosen for that weekend. There are misters around the patio area.\n\nI love the nooks and crannies where you can sit inside or outside. The sandwiches are good. I love the turkey on dark rye with avocado. They are generous on all fronts. Yes the place is pricey! Drinks, sandwiches and chips can run almost $30 for two people! However you get a free small concert on the weekends. The kids run loose, the dogs bark and it is fun! The wait staff is incredibly friendly and several folks have been working there for years. \n\nThis is not a place for those individuals looking for a fancy dancy sandwich. This is a place to have fun, relax and enjoy some good food and a great atmosphere!", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 5, "date": "2009-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "mEgD2AGWGKD_gs-Jf3Ypew", "review_id": "eMN7Vq43SAyJhJGn67HIzQ", "text": "Wow this is a really cool place.  Im not sure if the Duck would qualify more as a deli or a grocery, but its got a pretty wide selection of products.  Nice selection of beer and wine and  cheese.  The architecture of the building is pretty neat as well!\nI stopped by here for the Local First event and it was really impressive!  There was a beer tasting going on on the patio of the bar and samples of cheese and tea provided for free.", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 4, "date": "2011-11-12", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "bKKVpwp1ERdWUl4lqc8ChA", "review_id": "h_dEcL76YJFzQBSCZXB5tw", "text": "Tried it again. Still not good. Great service! Cute store. Sandwich just not good. I tried the tuna on white rye. First of all not sure why he recommended that for a to go and eat in the car option. Not easy... But the flavors were just not there. Oh well.", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 2, "date": "2015-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eA7hkwrrknhxhqs-dOhDYg", "review_id": "lFbJE27B903gNY039_aU0A", "text": "I went to Wrigley with the Network of Business Women.  It was my first time there.  I had no idea where it was, but once I got there, I was pleasantly surprised.  The atmosphere was so beautiful and relaxed.  It was a great place to have lunch.  I had a steak salad and it was absolutely yummy.  \n\nGreat history on the house...I need to go back for their free tours.  I think they are at 10 and 3 everyday they are open.  (Check on that first)I heard they have a great Sunday Brunch, so I will be making my way out there again.  I would love to hang out on their patio one fall morning or evening.  Either way it would be awesome.", "business_id": "yPfvOB63thP5t3pGZPJExA", "stars": 4, "date": "2009-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wqQ-50Sjf9ol3SYaPbA1YQ", "review_id": "eO4BB0J2KxNCz7gZpTgvXw", "text": "Sure we only go with a DealChicken.com coupon but it's always great! Sit in the bar area as the dining room is very dated due to the mansions age. The bar area is much more, how would you say? relaxed and romantic. GREAT views from in there also!", "business_id": "yPfvOB63thP5t3pGZPJExA", "stars": 5, "date": "2012-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yEdoJsi3f0IEar6FOHgwjw", "review_id": "2_PMx2e4eicO5DUZ2Pu-ZQ", "text": "I am amazed....the foregoing reviews cannot possibly be speaking of the restaurant we visited during restaurant week.  We had 7.30 pm reservations and arrived on time to find probably 12 guests standing around waiting for their tables....we joined them. My husband became bored and walked around the small place, counting 10 tables waiting to be cleared.  20 minutes later, no one had offered us a drink, no cocktail serving person was to be seen, but at last we were seated! 15 more minutes passed slowly by. No acknowledgement of our presence...no welcoming smiles,hellos,eye contact.....ah at last water was poured into our glasses.Yes, there is some liquid refreshment available in this arid place.....WATER! Still no acknowledgement. The water bearer was silent and did not look up from his task......hello here's the waiter asking us for our order......er,\"may we see the menu first?\".\nDo you serve drinks in this restaurant?  May we order something to drink? Yes we had to ask.\n  Let's speak briefly about the food.  SALAD.......a salty undressed mess, Brie and figs......NO FIGS. Tomato leek tartlet....very good.  Filet steaks....tasteless. Lobster and pasta.....it wasn't lobster it was langoustine.....no flavor.  Salmon....ok. As for the desserts great pecan pie, ruined by pouring caramel sauce over it.  We all know that pecan pie is sweet enough, don't we?\n After all this, the final straw was the very annoying waiter, who hummed incessantly as he served.  In all fairness he was totally unaware of his habit, as was everyone else who worked there....otherwise surely he would have been told to STOP. No we will not be returning.  So many great restaurants in the camelback corridor....why would we?", "business_id": "oc0Wl6ktfMLb5VZ2Uz6M2A", "stars": 1, "date": "2011-09-28", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "D9aj6AjCyLp-zp8fozL8aQ", "review_id": "l8QJ0aUzbVzv-Q9Vmp0t3g", "text": "Postino has nice food, but the lack of parking necessitates that you use a valet which I really dislike. Plus it is so noisy that it is hard to be heard. The trendy people all coiffed and pretty means that people ARE noticing whether or not you are in Gucci's or something you got from Marshall's. On the plus side, there ARE loads of  \"pretty people\" to oogle. :) \n\nThere are many nice places to eat in this part of town that have less attitude, ample parking and where you can actually have a nice conversation.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 2, "date": "2007-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "caaDd2cesCsm1LzOS-x-xw", "review_id": "HZ27p_QGgsB94MSHhO6jmQ", "text": "I love this place!!!  I love their Happy Hours...  Great place to go with friends and have a glass of wine at the patio", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2009-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9LVYioS3Om_cCWcr03mbdA", "review_id": "MYbW-FnJvcMNBEOu8s4rLw", "text": "I really miss this hot spot for lunch. You can not lose here. Really...\n\nMy fav would be the bruschetta. Such a hearty, italian treat served ontop of a wooden cutting board. The cheese boards are brilliant for snacking and socializing. \n\nThe building is an old post office. How unique!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2010-09-09", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Znu5KKqytHfmjbXfQo3f4Q", "review_id": "WHB1t2687wVKrFLQEtxWBA", "text": "Since moving nearby to La Grande Orange, I've lamented the amount of money I've spent at that most tasty place.  Now that I've finally made it to Postino, my lamentations will only grow.  Yeah, it's wonderful.\n\nCarla greeted me at the door, chipper as only a Saturday night can create, and gave me a quick tour upon hearing it was my first time. She handed me off to Maya, who was also supremely patient with my many questions and general ignorance of wine.\n\nYeah, I'm not a wine snob. I have little patience for sniffing and swirling. I've good wines and bad wines, but I'm fairly convinced anyone talking about the boquet of light oak with a strong raspberry melon finish is making it up or part of a cult.\n\nDidn't matter, though. Maya recommended a fantastic wine, and between her and Carla I sorted out which of their famous bruschetta I was going to try (proscutto + fig, salmon + capers, tomato jam + goat cheese, apple + brie).  \n\nThe garage doors were open and the weather was fantastic. Loved the decor, loved the staff, loved the food, and loved the... what's that other stuff they served.., oh yeah, the wine.\n\n(sigh) Between this place and LGO it may be cheaper for me to just move again further away.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2010-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bG-r4zndr1xuon0pHbUrcg", "review_id": "_gBab4sE-iTvlDCEMbFX-w", "text": "I'd been hearing about Postinos from some food snob friends of mine so I decided to try it out this past Friday night.  Got there at 7 p.m. and scored a table with no wait in the middle of the dining room.  Immediately I realized it was a little too loud for the audience with the music playing, but stuck it out.  I was meeting my friend's parents who were in town on vacation and thought it would be a nice, casual place with hopefully great wine and food.  They loved the architecture inside, with the exposed pipes and brick and large, open garage doors.  The patio was probably not quite as loud, but was full so we were definitely stuck inside.  \n\nI had a glass of $11 Malbec, which was fantastic.  We ordered the bruschetta and I im in love with the artichoke version as well as the apple and brie.  I was not blown away by the mozzerella and tomato, which I thought I had heard was a guaranteed good time.  I also got the turkey panini though which I got with a salad.  It was bigger than any panini I've ever had and I took half of it home.  It had  a pesto sauce that made it the best panini I think I've had in my lifetime.  (Maybe I've had ten paninis though in my lifetime so take it for what it's worth.)  The salad I was not blown away by and was not disappointed when the waiter took it away while asking if he could take it away.\n\nService was a little slow, but again it was a Friday night.  The wait staff is a friendly, helpful group and didn't rush us as we sat and chatted while eating for three hours.  \n\nValet is $3, which is fair, but what is a riot is when you walk out, if you had your keys, you could walk the twenty feet and get your car yourself.  But instead, you have to wait behind five people for the valet to hand you your keys and THEN you walk to your car.  AFTER tipping of course:)\n\nOverall, I will go back for the paninis, maybe try a few other bruschettas.  It will be hard to not to to LGO next door though...", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2011-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8V_6svfJGZ4haWbObwtNnA", "review_id": "Pe2SjK0Pvb9JA3yJ3MHHLQ", "text": "This review is way overdue. And since I am not a regular Yelp reviewer, I am making an exception to this one....\n\nI am in love with the quality and range of bruschetta they had at Postino. Figs, honey, almonds, pistachio, goat cheese, prisciutto and sooo much more!    Bite after bite felt like heaven on earth. Their creativity with the menu blew me away. Hip  ambiance. check. Originality. check. Scrumptiousness.  triple check.  \n\n I need to find a place like this in the Bay Area!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2011-11-21", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "lMsucBpaRXPKlKgx_q1w-g", "review_id": "RpRsiYFg_sRwqt0wsoztPw", "text": "Bonjour amigos!\n\nThis here Italian place is THE best Italian place I've tried in Phoenix! In fact, it's the ONLY place I've tried! The staff is friendly. We sat at the bar with a stranger and had a memorably delightful time. The food isn't the most filling, but it is DELICIOUS. Everytime I think of Postinos Arcade, I'll always remember the fun conversation we had with that stranger, and the good food.\n\nPROTIP: We went there on a Saturday and if you want to park you need to valet, which is a whole $3. Do you know what I could do with $3? I could buy bubblegum, get 64% off a DVD at the Walmart $5 bin, and I can even buy a used book! Outrageous!\n\nThe only problems was there is no post office to drop off your mail, nor is there an arcade. I think that's false advertising.\n\nAree Va Dare Chee!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2012-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "egX5GYzZeJgHdFP1pxsU8Q", "review_id": "1NNWMBf88Nzf8PBYzW-M-Q", "text": "Grea food and wine.  Lovely atmosphere.  A bit overpriced and entirely too loud, but that's the price for popularity!  \n  My largest complaint would be that the service is a bit slow, and the servers seem incredibly overworked.  They should be paid more as without them the experience isn't worth showing up for.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2013-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jr726FPXkz7k2Fqi9rvafQ", "review_id": "Tj1fFoTsz0toWEO1n9LX_g", "text": "Wines are from all over the world. Sunday morning, they used to serve a fantastic Sangria (not my normal drink) and had a menu promoting several wines. The door was rolled up and there was a lone guitar player playing  reggae. We had mozzarella and tomatoes and an olive mix. It was a cloudy semi-cool day to top it off. Parking can be tricky, but worth it. I described one trip of many here. One of my favorites!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2013-09-30", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 3}, "user_id": "zQE0aulnd-gcfVw17HeULg", "review_id": "KoR3vr1gvzwN0phDNSOGJA", "text": "I'm hesitant to give 5 stars. I do it only when a place offers and experience I cannot get elsewhere.  POSTINO does that , their Bruschetta, ambiance, service and VALUE are a combination that is unmatched in Phoenix. \n\nDid I mention value? Mon & Tues you can order 4 diff types of bruschetta and an entire bottle of wine and pay $20, TOTAL. I challenge you to find a better deal.    \n\n\nBack to service , JAKE our server was great tonight, he has a very friendly demeanor and  made excellent recommendations. I've Been here about 10 times before, he was part of the reason I was compelled to write this review tonight.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2013-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "56hdZzodbCYYJIMqVm6edw", "review_id": "zHet1n7WQfGKB8PPlmAPkw", "text": "It has a nice place that I can recommend to my friends who needs to drink and to unwind. To eat and to relax. The food is good. Personally, I love Autostrada Panini.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2014-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ADtC8529e0V4CGgNLaHQXg", "review_id": "APBzEbrwZNiarHMdsnUEAA", "text": "First time here. Having a great brunch. Extremely attentive and knowledgeable staff. $5 mimosas. How can you go wrong?", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2015-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "mPlKZ7qLA8DXvVzlQc3I0A", "review_id": "izTxJlbGQ_HIBgNt-XMfEQ", "text": "Postina Arcadia deserves more had the service not been absolutely dreadful. Which sucks because i have eaten hered before and loved it. Our server was a blonde older looking Woman and she was very rude and was hardly at our table. I had to flag a busser down for everything i needed and when i asked someone to send our waitress over she still went around to all her other tables.The food however is always really good!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 3, "date": "2015-11-12", "type": "review"}
{"votes": {"funny": 16, "useful": 13, "cool": 11}, "user_id": "du6KeE54IFbPiXpU3LOd1g", "review_id": "Id2T7kd3-LCOsmsCvt6N8w", "text": "I'm out of the closet!\n\nYay!\n\nNo more hiding who I really am!\n\nI'm a proud member of the Rainbow Donuts coalition.\n\nIt's not a choice...not just a lifestyle selection (although the donut selection is, in fact, quite robust)...no, it's how I am constructed!\n\nOK, actually I'm bi...I enjoy the occasional \"breakfast burrito\", but if I'm pressed to choose...I'll take the hole and the \"Old Fashioned Glazed\" that surrounds said hole.\n\nThat and a good cuppa.\n\nAnd that's one of the things that separates Rainbow from the rest...the coffee...outstanding Italian roast, well made and very inexpensive...with enough refills to take a bath in.\n\nAnd I would bathe in the coffee (and possibly the donut glaze) except for the inevitable \"dust-up\" that always occurs when I let my impulses run wild and free!\n\nDon't get me wrong...the donuts are terrific and the nice young lady behind the counter was almost as sweet as the apple fritters.\n\nI had a client meeting there this morning (I know, I spare no expense!), and my clients were just as charmed as I was with Rainbow...the great coffee, the terrific donuts and fritters and the pleasant service (not to mention free wi-fi for my meeting) all combine to make Rainbow Donuts a significant step above the rest.\n\nMost of all, it's the place where I can feel free to be my real, authentic self...out, loud and proud!\n\nAnd growing a little with each fritter.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2010-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rC3bBXBrk0h71NmJnpPq6A", "review_id": "yDB75F7kRjYCFrKzLeZRbQ", "text": "While the staff was excellent, the food and beverages were highly average. We had wings, tomato & mozzarella, burger and salads. The wings had a pomegranate BBQ sauce, which was good. The bill came to $24. I think the Hilton Tapatio staff are exceptional, but the food here lacks imagination. Not overly memorable.", "business_id": "Y3a3RkR97J_ReiKgiMXeJg", "stars": 3, "date": "2011-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5PTruBzQ66veJ-QtereHgg", "review_id": "lmNgVfhzgz_g9P-Y3WvH7A", "text": "I came here tonight at 10 pm, and the resteraunt was full of a bunch of panzy, animal like, horizon high school kids. Now I know that sounds mean, but they were literally standing up and yelling, throwing things, screaming across the reateraunt....and not being polite or respectful to other quests. The thing that bothered me the most is that I told multiple waiters to get a manager to ask them to act like humans, and that never happend!!! The food was good, and our waitress was sweet...but management needs some help, if they are allowing this behavior. I was informed by multiple employees that these kids come every Friday night so I would avoid this location!!! I Won't Come Back, I Don't Have Enough BOTTLES Of advil To Handle That, nor do I Have the patience.", "business_id": "p1ntTC9-CI6x5Y_nUoo6Ag", "stars": 2, "date": "2014-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IBHIB59epUFRXPOhwN_LqA", "review_id": "6CSvae34f3yvOd7thc68IA", "text": "We had a craving for bagels and stopped by pretty late in the day (just after 1) for a dozen and some cream cheese. The sesame seed ones are my favorite. The selection was a little low but they  were yummy. The place was dead so the young man behind the customer only had to worry about us and delivered excellent service. We were in and out of there with our dozen sliced bagels in under 5 minutes.\n\nThis is out local Einsteins so we have been here many times before without problems. I see that many people complain about the service but I have never had any problems here. I may have to wait a bit when I come in at my usual time around 8 on a weekend but it's usually packed as well so that is to be expected.", "business_id": "IcuPhhH7QCOCT19EDEppEw", "stars": 4, "date": "2015-09-06", "type": "review"}
{"votes": {"funny": 5, "useful": 3, "cool": 3}, "user_id": "fev0iI-XDrteD4SYRKjiUw", "review_id": "DNJG4CuYg2M3OzsK4Wsl8A", "text": "Waffle Houses are bomb but this one is my favorite.  Not only is it 24 hours but it is super clean and well lit.  There are totally some seedy people who go here but their conversations just make for very interesting background noise.  \n\nAs far as the food, the prices are cheap, the menu is semi-a-la-carte and the the waffles are amazingly crisp and perfect.  This is THE Waffle House to visit.  Go now, do it.  How good does a waffle sound right now anyways?  That's right, Pretty Damn Good.", "business_id": "sh1-BzB29lIOA2qQ_PxN-A", "stars": 5, "date": "2009-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 5}, "user_id": "rg5pRVVh-mtBjNqKB1N2Tg", "review_id": "4__lRiU03djhIPYI94HSRw", "text": "I can't say enough good things about this place.  I was introduced to it when a couple of friends of mine got married here.  I am still impressed by it five years later.  There are a few eating options here, a couple of restaurants and a large picnic area.  It's an oasis in the middle of south Phoenix.  The area around it is nice too, the old farming lifestyle all around.  If you weren't around in Phoenix twenty years ago, you can see the type of farming pockets that used to exist in more frequency around the city.  The only thing missing is an orange orchard with the trees painted white at the trunks.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 5, "date": "2007-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9OsD0gC4-jDkXeDHhexHGw", "review_id": "VBia83upkeAi2kgBKP41uA", "text": "Went to Morning Glory and had their french toast with candied pecans. It was delicious! Loved being outside and enjoyed the atmosphere so much.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 4, "date": "2010-11-09", "type": "review"}
{"votes": {"funny": 1, "useful": 6, "cool": 2}, "user_id": "1JlPVFzAp6kIUVph80EKjw", "review_id": "GEyV47A_0aWYBHfprwOfNA", "text": "My favorite place to eat Sunday morning. I love the spinach eggs Benedict. It's also dog friendly which is a big bonus! When the weather is cool and perfect the patio is filled with cute adorable friendly dogs. The staff are all nice and attentive. The whole flower garden by Morning Glory automatically puts a smile on your face. Sometimes you even get to make your own bouquet of hand picked flowers and choose a vase. If you're luck they also sell homemade goods and produce straight from the farm. I also love how this is a wedding venue as well. I hope one day I can have my wedding here! The area is so romantic and lovely.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 5, "date": "2015-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GgHZJckDEk6gyalZzVD7LQ", "review_id": "ziXqcFb1Xrqvt8oF_7XDMA", "text": "My husband and I came in early Friday morning. Our server was AJ, he was fantastic. He went above and beyond to make this a memorable experience. He was fast, friendly, and always had a smile on his face. We will be back!(:", "business_id": "lq2iZK7epi23byzcejjqTg", "stars": 5, "date": "2015-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gxNdsze0ikjsGD7bKVgERA", "review_id": "XSQYZ-3cfZq7OPVtVcHW_g", "text": "Here's the deal. The lox works bagel sandwich is off the charts. I have mine double toasted on an everything bagel and it is ridiculous. Perfect amount of salmon, cream cheese, capers, and red onions. Comes open faced,as per every appropriate cultural guideline. \n\nYour breath will smell for days. Worth every bite!", "business_id": "8H1DwdAAgSBtwDeb2R-hmA", "stars": 5, "date": "2014-10-31", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "z30hYvXYGme6uU4fpzaisw", "review_id": "7UbS6pdlugtlxX_pL3CEOQ", "text": "I ordered take out for lunch here today and I had a great experience. I called and placed my order and the girl that answered the phone was really friendly and nice. She said that the order would be ready in ten minutes and when I arrived ten minutes later, she had it all packaged up waiting for me. I asked her to throw in some bread to dunk in my soup and she kindly added it, no charge. Suuweeet! My coworker had ordered the chicken strips and the girl told me that they were small today, so she had them throw in a few extra. Who does that? This chick rocks!\n\nMy throat was really sore, so I opted for a cup of french onion soup! It is awesome here, definitely the best I have had. They serve it with a baguette and raisin bread that is to die for. \n\nI only ran in to get my order, so I can't really comment on the table service or the restaurant itself, but that chick totally made my day by being so nice, so this location gets 5 stars from me!!!", "business_id": "NX5YHSIyesufcsI7Rg5NLg", "stars": 5, "date": "2008-11-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "i0A-c2yoHySmFhRV2sDR1g", "review_id": "Oh2zZhXm0Ujhm_qaGZlS4w", "text": "The fish and shrimp tacos here are very good! Service was excellent and very friendly. I went around 2pm on a weekday and the resturant was about 1/3 full so I didn't have any trouble getting a table with my friends. This is not a real big place, they have about 10 tables. Everyone had tacos in our group and everyone liked them. I love their hot sauces, they are very good! \nI realized when I hit my navigation this place is close to Goodspeed Performance Lab where I hang out alot so I plan to be back often.", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 4, "date": "2009-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vLMwisRi7IWPooI9YZ1znA", "review_id": "YrXQc5euR8_KaFICX-N7ag", "text": "I'm all about the local haunt, and this one being literally down the street from me, I had to give it a try.  The one thing that I LOVE about Los Taquitos is that in Arizona (where people mistakenly assume that the Mexican food is good no matter where you go), they are proving that a delicious plate of food doesn't have to come at a premium.  You could go down the street to Macayo's and get a meal for twice the price and half the flavor.  More than price, value is king these days, and Los Taquitos knows the drill.\n\nI tend to judge the quality of a restaurant on the goodness of their machaca, and Los Taquitos does an excellent job for the low price point.  In their burritos, quesadillas and tamales, the meat is flavorful and moist.  I second the vote of others on the rice and beans being tasty - I particularly enjoyed the rice in its fluffy, flavorful goodness.  It didn't taste like an afterthought.  Spring for the side of guacamole - it's a welcome addition to the plate, particularly if you're sopping up the whole mess with a bag of chips.\n\nMy husband and I ate like kings and didn't even manage to kill a $20.  That's some real majesty.  We'll be back for seconds, I promise.", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 3, "date": "2010-11-01", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "k4-6lakq7t3kCgbvPxcuvg", "review_id": "eo0dBoOvk9_ynuugT3ymQg", "text": "Not a bad lunch.\n\nPros:  \nThe food was flavorful, hot and cheap\nThe shrimp chevice tostada was DELICIOUS\n\n\nCons:\nThe location is too small and the line was literally all the way to the door and there is no convenient place for those waiting for their food to stand.  Very awkward.\nI didn't like the seasoning on the carne asada street tacos.  I wanted to taste the meat without some unexpected, red seasoning on it.  It was too spicy and when I order carne asada I usually expect it to come unseasoned, or at least without some weird red seasoning all over it.  (That's not what the carne asada street tacos I get in Mexico taste like; they are served unseasoned with shredded cabbage, a lime wedge and some pico de gallo.)\n\nAnyway, aside from the super crowded place and the weird carne asada street taco, I did like it.  I'll be back for more of those delicious, shrimp cevice tostadas.", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 4, "date": "2012-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mR4JOr7uw_99MSDHRRbLzA", "review_id": "O8h3cBSzj5OKeJuGbphTEw", "text": "Just had the 3 street taco meal. That was great!\nThey were quite busy when I arrived and it was standing room only so I ordered to go. By the time my order was ready the place was only 1/3 full....bad timing on my part, friday@12:30. I got one pollo, one carnitas and one pastor. They were all great. The meal also comes with rice and beans. Im full for $7. There are 7 tables and some outdoor seating so its a small place.  One wall is adorned with some cool murals.  I'm keeping this place on my list for sure.", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 4, "date": "2013-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 8, "cool": 8}, "user_id": "G72bs75BqgW9NAVv00ADTw", "review_id": "1IbEBONway61s665qOmN3g", "text": "I really wanted to like this place : (\n\nHubby had tacos (lengua, asada y pastor) and he said they were the best tacos ever.\nI did not have any because the extra taco I had ordered for myself... was not actually in my order, so disappointment number one.\n\nService was OK but not particularly friendly.\n\n2 - We ordered, sat to wait for our number, and people were coming and going... they seem to pay more attention to people with to go orders than to the customers in their dining room, which is a big turn off for me as a customer. Even a person in a neighboring table made conversation and asked what we had ordered, because he thought we were waiting for a while. \nHubby got impatient and went to ask (they were like 10 numbers over our ticket number) and he was told the delay was because of our 'big' order... yeah, 3 tacos, a bowl of menudo and a drink.\n\nWell, the menudo was super hot... (are there any regulations about food temperature?  hehe) and in fact very tasty, but super stingy with the meat, I think they were leftovers and honestly they should have said 'we run out' instead of selling me a bowl of hominy. Well, I would have taken it at a discount, but not for regular price.\n\nSo, it would have been great if it was a regular portion, but it was like 90% hominy, 10% pancita, so that is a big no-no in my book.\n\nWe don't live anywhere close to this place, so I do not see ourselves coming back. Unless hubby really craves those awesome tacos one of these days.", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 3, "date": "2014-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wYbQrDwuImtmXmKvB_xp8w", "review_id": "r16aJJAbcdIyts7TQrMwhA", "text": "Saw this place on DDD and knew that when we moved to the area we would have to try it.\n\nFresh food, quality ingredients and prepared perfectly. \n\nCarnitas street tacos are to die for. Their hot sauce is great. \n\nService is fast, but don't always expect to get a table. It's been very busy each time we've come.", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 5, "date": "2015-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZMM4cWMU5WtOnkNrpw84gQ", "review_id": "_UWso4T-H5UMvnDM0Vemtg", "text": "Good food but not the best service. They need to work on their customer service. I'll eat here again but I wish the girls were nicer", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 3, "date": "2015-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f437xTueQ6024shVJpodkw", "review_id": "8f112G1VDCDqpQcGxGk-yQ", "text": "I've had hit and miss experiences with Cracker Barrel food.  This location however, is good. Our server was Aaron, and he was courteous and willing to put up with an obnoxious manchild and his mother.  He was attentive and I couldn't ask for better.  The food was about what I expect.  It's ok diner type food.  I had the country boy.  My ham was good, hash browns were good, and grits were well, grits.  Eggs were cooked a little too long but nothing to throw a fit over.  The atmosphere and the store make for a good dining experience.  Thank you Cracker Barrel, much appreciated.", "business_id": "dGcVT0WGenhh8Np76ta6AA", "stars": 4, "date": "2015-09-23", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "XciwJMCqGyw1O70hoKH2WA", "review_id": "1pJdVp5TsddVocAXyo0rjQ", "text": "The SLOWEST Einstein staff ever! Full of excuses... Every time we come they apparently are down a toaster or multiple staff members. I just want my ONE bagel... I don't even get it toasted, and yet... 16 mins after we order... I'm still standing here waiting for the food I just paid for. uggggh", "business_id": "IYWTOj970XqG2z9Xft_8SA", "stars": 1, "date": "2014-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sjAlUFbh2eX739mErf-l0w", "review_id": "XzN0XdFU3kRImK-TGpJNSQ", "text": "I feel the meal didn't justify the price. If locally grown meant it can reach an elitist price, than I learned something new for breakfast. Before, I thought breakfast was about getting full to start a good day. When I  was served nearly a carbon copy of Denny's, I feel vexed knowing I agreed to a 30% price hype. Service was alright though.", "business_id": "8aPTQeDYOMNEu907WfflCQ", "stars": 3, "date": "2014-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TouZvN0GpE8Ngm8_cWOK1w", "review_id": "qgoDLmr1JIpL_Xj8O-zn2w", "text": "We had not been here for a year+ or so, and things have improved greatly. Everything that I tried was pretty good, except for some Asian styled chicken bits that was old and very tough. Probably reheated too many times. \nThe staff is, as always, friendly and helpful.  \nWe stopped for dinner, then came back for lunch a week later. Dinner offerings were a little more upscale, but lunch was acceptable as well.\nEverything but the previously mentioned chicken chunks was fresh and tasty.  \nThe variety seems endless.\nWe'll be back.", "business_id": "9ocGgALmbzTZWOS7f7SYcA", "stars": 4, "date": "2012-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "F66ALXcvZJcpGMbJ90zS8g", "review_id": "gH8l_DDWIVZRcVWEovjRaA", "text": "We have been here several times and to be honest it just lacks a lot. The food is okay, nothing fancy. Concerned that food is not very fresh some times. Lacks service a lot, especially if you come in when the northerner's are here.", "business_id": "SS073W0tN3nvG36Qy6n0qg", "stars": 3, "date": "2014-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WditeVOxm9LcK4COOWZ-qg", "review_id": "w_Tnofaq2WxQe7IaLcootg", "text": "My favorite thing to get at Mimi's is their hot chocolate 'bucket'. It is the best in town (from a connoisseur like me!)", "business_id": "qLXxp0rpzT4kG9tT3wZwfA", "stars": 5, "date": "2010-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x4XrM7EdrXdPbRaIkyd2kA", "review_id": "GHlL552sd5SItux4R3GlfA", "text": "Great breakfast, great lunch, and a great atmosphere!  One of my favorite breakfast destinations.", "business_id": "qLXxp0rpzT4kG9tT3wZwfA", "stars": 4, "date": "2015-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dc3XOXCmEwhdjKwVSiEaPw", "review_id": "WUZ8N4cNNrN8X1XmYbsLSw", "text": "Cracker's & Company has always been a favorite breakfast destination. The food is always delicious and the selection more unique than other restaurants. My husband and I came in for a quiet Anniversary breakfast and although the place wasn't terribly crowded, we were seated right next to a table of ill mannered children and their mothers. I would have asked to move but our waitress was missing in action from the start of our visit. Before our waitress went MIA we ordered our drinks and entrees. In the past I have been given a small carafe of coffee but was only given a cup today which was disappointing. I ordered a carrot cake muffin when I ordered my entree and asked to have it served right away with my coffee. I also asked for the hollandaise sauce on the side of my \"New Princess\" omelet but it was spread over the top when it was delivered to my table along with my muffin. So much for enjoying my muffin with my one cup of coffee.  However, the food was wonderful as usual. The service was horrible and the ambiance was equally as poor. I'd hate to see a wonderful restaurant such as Crackers lose their edge in this competitive food service industry. I'm hoping today was a fluke and the service will improve to its previous caliber.", "business_id": "2nzUx_M8Szyzsf4CszHasw", "stars": 3, "date": "2011-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Xe56-9ZpxDSB6atCRyW8NQ", "review_id": "O0r9m9jPEi2MpEby1xHBjQ", "text": "This brunch spot has the most amazing eggs benedict I've ever had. The California benedict (I think that's what it's called), has spinach and bacon on it! The potatoes are great too. The entire meal is filling and will leave you full for hours. It's only opened for a few hours and it fills up quickly on the weekend mornings. Service is always friendly and quick, without feeling rushed. Prices are a bit higher than a Dennys, but the quality makes up for that tenfold! Highly recommend.", "business_id": "2nzUx_M8Szyzsf4CszHasw", "stars": 4, "date": "2014-09-12", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "_l_XgovHJDKn0yCmBjBLkQ", "review_id": "I-b1RJqfzVoSehPg9WntPg", "text": "Crackers and co was so good .this was my first time having biscuits and gravy and my fiance said I was lucky because this was the best he's ever had. The biscuit was so fluffy and the dish was to die for. I'm so happy I found this place its like a hidden gem in a business park. Everything was cooked perfectly, seasonsed perfectly. The staff was extremely welcoming and nice. Really good vibes. I thought it was very affordable as well .I will definitely be coming back for lunch and there deserts looks great", "business_id": "2nzUx_M8Szyzsf4CszHasw", "stars": 5, "date": "2015-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h5qZR_-zLIBRMLrw83sU_g", "review_id": "Pj0JUIiuYPM6MMMvCQkkqg", "text": "Breakfast anytime ... and it's hard to mess up breakfast. It's a step up from franchise fast food (McDonald's, Burger King, etc.) on the road but not what I'd call a giant step. The big difference is that you get to sit down while they take your order (as opposed to standing in line at a counter). The coffee is OK but not what I'd call gourmet. Service is friendly and helpful.", "business_id": "g5csdtYUt97hkexFMCVf-g", "stars": 3, "date": "2010-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "D2f_4biRTsqbHfdGY1KncQ", "review_id": "zReEf3wyP4ZuAB4loGd7tw", "text": "OK, No more Denny's for us! Last time we went for the new Banana specials, they had no bananas and then they got my order wrong. Today, we went and they were busy and the mgr was busting butt, so we took seats at the counter. Our waitress was loading a tray with our food, when another waitress started playing with her. From where we sat it appeared she stuck her finger in our syrup and my pancakes and was teasing our waitress saying it is warm enough? your pancakes are cold, etc. When I said, \"Hey get your fingers out of my food, she laughed, Vic said it's not funny, and she said, \"Oh, I didn't know it was yours.\" Like that matters - it would have been okay if it had belonged to someone who didn't see it? That made me more upset than touching it in the first place. Then the mgr came out and Vic brought it to his attn. Our waitress said she didn't really touch anything, and the mgr brought us more syrup and came back 2x to see if we were ok. Then Vic's pancakes were burned on the bottom. Wasn't even worth discussing any more, we paid our bill (of which nothing was comped) and left.", "business_id": "Mx_IcFzTaPiPMm5SQY743w", "stars": 1, "date": "2012-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "0obsNDlDjiQoOSc5jhI5gQ", "review_id": "oac_YqgwUqHJPvCwImd99g", "text": "Too bad you can't give no stars as they earned it.  It's totally on their snobby service.  Stopped in on Black Friday and to our surprise the diner was about half full but plenty of the wait staff was doing busy work and we figured it would be a quick in and out.  We asked for a table and not a booth as I have back issues and booths are uncomfortable for me.  The hostess said they had none and there was at least one empty not 20 feet from her!  We asked a second time and she said they had none available and we said whats wrong with that table and she said our tables are only for large parties!  So it was off to another restaurant that would appreciate our money.  I won't come back either as I don't give 2nd chances to places that treat you bad right off the bat!", "business_id": "kNnk3xy9eb4ym8nljQUGlA", "stars": 1, "date": "2013-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gOJXTfQf_s34_abnpLbX_A", "review_id": "aWbNeduOJdQpgcHi055QDA", "text": "Been dining here for years. Proudly owned and managed by a wonderful family. Pride of ownership shows in the service, cleanliness, and quality of the food. It's our go to place when we want good food in a hurry. Very reasonable as well", "business_id": "qgJZUKNVY-LbGKk6XEP3JA", "stars": 5, "date": "2015-10-09", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 3}, "user_id": "MnDHJvePh4cWMrBgOp0_Ig", "review_id": "wuK91ImO_2jDLl3sfLpovQ", "text": "I have to say this place surprised me. I have been here before and was not all that impressed. Mom had a coupon and wanted to go so who am I to say no. I figured I could find something I could eat. When we got there it still looked the same but then we got the menu. They have pretty much completely redone the menu from what I remember. It is all French cuisine now. Which I was questioning at first. Really this place is French now? This ought to be good. I finally decided on the Croque Madame. Which is an open faced ham and Swiss cheese sandwich with a fried egg on top. It was really good. I was shocked. I really was. Very good flavor. Everything worked together. The ham was seasoned and cooked just right. Was this the right place.\nI say they have changed for the better. Don't know how popular the new menu will be because the general public seems to be leery of food they can't pronounce but I hope it works out for them. I will be back and will tell others about it was well. I really was shocked.", "business_id": "-6Roo-EHgSdUa4rP3tWyRw", "stars": 4, "date": "2013-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JNR1eft74S3fU3LixP89_A", "review_id": "ERLEgkOwR9KRfwIN2G2WxQ", "text": "Perhaps the worst experience in a restaurant ever. We waited for over an hour for a table, never got one. They claimed to be short one cook, but they were clearly short many staff. Many tables were left on the bussed. If I could give it zero stars I would.", "business_id": "-6Roo-EHgSdUa4rP3tWyRw", "stars": 1, "date": "2015-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qkBk5nThQ2HdcWPzFncQbA", "review_id": "qFwy2VVyyNvjYipMozURPg", "text": "This place was great and everything I could've asked for in a breakfast! I had my first eggs Benedict here and it was amazing! The place is really cute inside and the people working there were extremely nice! Really enjoyed this place and would recommend it to anyone!", "business_id": "oSDf6BHiMlKGZdFFmIo6NQ", "stars": 5, "date": "2015-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jtTqpIqHbqqtBWwtCRGPBg", "review_id": "2HOOcPPB6rbjO6Q7sbHKLQ", "text": "Food was average, service was slow however. Wasn't busy, 930 AM, maybe 7 tables active, but service was slow. Waitress was nice. Food was average. Would return.", "business_id": "PBcsBfduHaCBVLsgVvAkJQ", "stars": 3, "date": "2015-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3S6jzL8bfOxUKGIN4G24lA", "review_id": "Z8Rjtbrv4NVFcHIekBvClA", "text": "LOVE Lulu's!  Once I get a hankering for some Lulu's I have to go.  My favorite is the cheese quesadilla on a flower tortilla, chips and salsa and a strawberry margarita.  My husband gets regular tacos, nothing fancy, but he loves them!  Great food and I always head home with leftovers.  The churros are pretty good too!", "business_id": "CRvVvR6aE1eWVRtzQ0UC6g", "stars": 5, "date": "2015-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NqjJrT2dGRvVyn9aycy_lg", "review_id": "IpVCuReht-bnMfYUsrrP4A", "text": "Small town feel, but too cramped. I swear my scrambled \"thing\" had one egg, and way too much cheese. Not in any rush to go back, though the service was ok and the ambiance was still nice.", "business_id": "7WGBi29_vj_7RcPVxpLNHA", "stars": 2, "date": "2010-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4uw7hCPC3owbFuhAkyxrAw", "review_id": "NNbeB0IYMkF0KG3htlcpWQ", "text": "One of the best truly local breakfast restaurants I have been to. The belgian waffle was very good as was the chorizo green chili omelette.  Be sure to go early if you want breakfast as the place is very small.  Not sure I would wait outside like most, but I will be back, early in the AM to insure a good seat and some of there yummy food!", "business_id": "7WGBi29_vj_7RcPVxpLNHA", "stars": 4, "date": "2012-10-20", "type": "review"}
