{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "T_wjLgPOPXry7Bea4MzoVQ", "review_id": "uHLsTyhQN5LDc8ptZICyfw", "text": "Mmm...peppermint mocha\n\nIn my quest to visit every Starbucks in the USA I have stopped at yet another location.  This one is located in the center of a circle road -- very cache and in a newer part of the area.", "business_id": "3gmBc0qN_LtGbZAjTtHWZg", "stars": 3, "date": "2009-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Pko7-1W-Ahj8cm0AG8glnA", "review_id": "S67OcEsLZEwkd7HPoSZyqw", "text": "Everything I want in a bistro!  The sandwiches are delicious, the service is wonderful.  Love that pastry guy!  Ambiance is great!  The only thing is... it's a little crowded because everyone loves this place!", "business_id": "83_p9vIqOq1TUIf3_GD7bA", "stars": 5, "date": "2013-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hLuDfkQrpS5nwM_RUE1cXA", "review_id": "FhwO_tWdNTsRjL9Ge2j3Ug", "text": "Nice little coffee house with good food.  My only complaint is that the food was NOT HOT ENOUGH, which is a bigggg turn off for me. However, it was still so good that I'm giving this place 4 stars.  The apple panini was a delicious hot mess clearly invented by somebody who got the munchies and only had raisin bread, apples, cheese, and seitan around....the result is amazing.  This place just needs to make sure the food is warm!\n\nDip is a huge ripoff, btw....$5 for a tiny portion :/  they should lower the price on that item.\n\nThe salsa that came with my sandwich is some of the best salsa I've ever had, though. Dunno if they make it themselves.", "business_id": "PzG0XmAmtXFs6Fdnubf41g", "stars": 4, "date": "2010-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EqLgkiXEkP1w0o9uhUen3w", "review_id": "uEfDlhRyFYfIwBHFurX4bA", "text": "Coffee and atmosphere are great... but my God, the cupcakes are the worst EVER!!!  There is a bakery right beside them; they should really consider selling the bakery's sweets or none at all.  I think a fake/display cupcake would have been fresher... and maybe even taste better.  Yes, it was that bad!  Mr. Manager... try your stuff before you sell it!", "business_id": "uie9L4ZrCvDdkSdByOVTLQ", "stars": 1, "date": "2013-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "TbUzjXVKCWTEW1W56Ayiyg", "review_id": "skvm5AsKwJUCVEUGwsADuQ", "text": "This hidden gem, tucked away in the corner of Market Square in downtown Pittsburgh, offers more than just coffee.  Sure, it's easy to be lazy and unadventurous and go to Dunkin Donuts or Starbucks, but why not take a chance and support a Pittsburgh staple since the 1800s?  They must be doing something right to stay around that long.  They also roast their beans in-house...in Market Square.  Amazing.\n\nNicholas Coffee Co. has a unique ambiance.  I'd say it's vintage bookstore chic, but your opinion and description may differ.  With a HUGE selection of coffee, fresh baked goods from local vendors,  friendly staff, and a humidor for the casual cigar aficionado, there's a little something for everyone.  \n\nThe coffee by the cup is very reasonably priced, and you can buy coffee in bulk, or buy a few sample packs to find your favorite brew before buying by the pound.", "business_id": "J7I85lTCEGr9-qp6AXPUjQ", "stars": 4, "date": "2014-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ht5myYvx_JciCCprq8qlHw", "review_id": "6UTcnbPWca_Z-0SqBJsHsA", "text": "This is the best Italian style espresso in Pittsburgh.\n\nIt's not third wave, but it's not trying to be.\n\nGreat atmosphere, wonderful pastries next door, and fantastic coffee.", "business_id": "SWzCFTM7KHc-MncD6xxOYQ", "stars": 4, "date": "2015-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B2OtS_ijmzmLDU-ho_MQsQ", "review_id": "kWa0VrWFIwud-ARxsbURcw", "text": "Fantastic roasters. I keep trying different beans ,but always go back to the Cuban Blend.\nReally like the mediterranean and trio blend too.People who work here are the best!", "business_id": "TASUnYvk_nvTUyKtroCJSA", "stars": 5, "date": "2015-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nCy31UqpvcAe6zyzeFgtLw", "review_id": "scXvmnpdj7QO2Mu_GWZA8w", "text": "In the summer or early fall, it's a great place to hang out as the windows are open and you can feel the nice breeze.  The service is pretty good and took my order quickly as well as serve it promptly.  The prices are competitive and the muffin was fresh.  Despite being busy, it did not feel overcrowded with their 2 levels of seating.\n\nI also ordered a bag of beans.  They had a vast selection of beans at very good quality and had no problem with a coarse grind for my french press.  Overall, a very solid place for coffee and baked goods.", "business_id": "1qUYk564SajvwTtkNM6KJA", "stars": 4, "date": "2012-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UD7Y1CqfY6mDmRwIuCf6nA", "review_id": "TePYKwthzZ7B8AOqiOsbeQ", "text": "Sorry folks, I'm not a fan.  When out with my family we decided to get something frozen for a treat.  The one good thing about this place is that it serves Dave & Andy's ice cream.  But that is possibly the only good thing about the place.\n\nThere is no order in here.  Especially with three possible ways to enter.  The proper entrance at the front of the building, the side entrance or if and when the doors are open, walk right through the front of the store.  With that, no one seems to know where the line starts, if there is a line at all for service.  What should take just a few minutes to order your item easily turns into a good ten to fifteen minute wait staring down the person that just cut in front of you and several other people.\n\nThe pricing seems a bit high here too.  For two scopes of ice cream the cost was equivalent to going to a frozen yogurt place and getting a cup filled with not only frozen goodness, but mixture items as well.\n\nThe place is nicely set up, but it does feel a bit crowded in here.", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 3, "date": "2013-10-07", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "J5kidvVDdJ5AdnaPZhhLFA", "review_id": "1Cus8S_e41PnbHkEQXP1fg", "text": "Forget about Starbucks. Coming from Miami for a business meeting I stopped here. These are the friendliest people you can find and the coffee is the best. It was a refreshing experience.", "business_id": "frnJyUd335JCPDjKHc75OA", "stars": 5, "date": "2011-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Al_lV54KFnRgAqDO-qVIuw", "review_id": "UCak5GmzMd7lZinM7MXJ3A", "text": "This location is always slammed, but they do a great job of moving people through in a timely matter. I've always encountered polite employees here, and I've never had a bad drink or an incorrect order yet! Good job SBUX team!", "business_id": "Q9j-sZXJI5cqpNo4vJajWA", "stars": 4, "date": "2015-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1yerL0y2L4SyH5E7wVu4dQ", "review_id": "lWIvCuYf_ntieHivsK0BpA", "text": "Seemed like a nice place. However, after waiting in line for 20 minutes and taking quite a while to give our order (because it was VERY loud) we were told that it would take about 30 minutes to get our food. Not exactly what I wanted to hear after waiting 20 minutes but fine. When I try to pay I am informed that they do not accept debit/credit cards. Cash or check only!! No where on the door or while in line does it say cash or check only! There apparently is a very small sign on the register that says that but there is so much other crap posted in that area 99% of the people there probably never saw the sign. This is just ridiculous in this day and age to not accept cards. Even worse is the BS sign on the register. I will never eat here again just because of this!", "business_id": "ShEYKerTwb2LSORE5o_s7A", "stars": 1, "date": "2013-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2_OIo9KHuot8U6HuQ3U8Rw", "review_id": "GJec9EJ-9xfm244I7_sk_g", "text": "This place is cute, very comfortable inside and the staff is really nice :)\n\nI got a breakfast sandwich and a white chocolate mocha both were so delicious!! skip the starbucks and head over here, I would highly recommend this place!", "business_id": "JPFzpR5PvZWqHXQMIZFk2w", "stars": 5, "date": "2013-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4yv4bQSnx2R2kzeSo0XJwA", "review_id": "MihdcMOC1jSGKUd6V8aXBw", "text": "Everything about Zoma is, uh, OK. The coffee adequate if not excellent and not roasted here. The space quiet, if not warm. The chairs mostly comfortable but tables wobbly. It's not dirty, but not exactly spotless either (although I accept that for any coffee shop). On most visits, the counter staff are friendly and the outdoor space wonderful. I don't eat many treats here, but they smell terrific most days.", "business_id": "UV9c6A16IXXA7JmkTor8Tg", "stars": 3, "date": "2011-10-20", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "vH2sg0f65vc2xBMAE6ngCA", "review_id": "wE4kGQlDKHXsLC0WLsNabw", "text": "Third strike, you're out! I've given this place three opportunities to 1. Provide service with a smile and not an attitude. And 2. Provide a drink that I could actually swallow. Ick. Sop. Bring the mop! I can drink anything, and I actually threw out a pumpkin spice latte from there. It tasted as if it were loaded with white pepper. Sick. I won't return. Starbucks became Starbucks for a reason. It taste good.", "business_id": "40KhR3J9snVooFfTdc-8ZQ", "stars": 1, "date": "2014-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cRZVABuN4Dt_lxa1FGJffQ", "review_id": "st_BMNa0Zc_xY2JtBrpZ-w", "text": "I have enjoyed Kopi for a number of years. However, the expansion has made it much more comfortable to stay and have a drink. The coffee is always decent. I enjoy the tuna melt as well. Both are not fantastic but very solid. However, I love their chai bomb. It elevates my rating from 3 to 4.  Although I would love a 3.5. Depending on the day, I sub in orange cinnamon tea for the chai teabag in the chai bomb. Highly recommended. Kopi is always a place to stop when in the CU area.", "business_id": "yzInxReAkf7r0aRbwj02Yw", "stars": 4, "date": "2011-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "HJZfQadmdoa9qsZ4R1xEGQ", "review_id": "X70KSMqKrn-WzIQmdhsIDw", "text": "Moonstruck is a mixed bag of goodies for me.  On one hand, they have some amazing drinks, especially their hot chocolates.  On the other, though, everything they offer is pretty expensive, don't even get me started on their chocolate prices.  A lot of the times, their drinks are so sugary or...something...that if I don't brush my teeth immediately afterwards (particularly the tongue), it'll start hurting within several hours, so bad combo if you are pulling a desperate all-nighter studying.\n\nOh, and no wi-fi.  They do have a very nice second floor, though.  But still, no wi-fi.  Are coffee places even allowed to not have wireless anymore?", "business_id": "31LKw0AjFdCvGH2fIE0cwQ", "stars": 3, "date": "2008-09-18", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "lz6V_bpLpPI1-gxUZJU9Lg", "review_id": "UyjvWLiIeZZOnewH5yYyMQ", "text": "Didn't feel like coffee, tea or food today.\nJust craving some good orange juice so I\nbought a 15.2oz bottle of \"Evolution\" brand cold pressed, high pressure processed orange juice for $5+tax. They saw me coming that's for sure.What a joke!\nDidn't taste any better than $.99 generic orange juice concentrate you can buy at any store! Boooo What a rip off!\nActually the flavor wasn't all that bad but not $5.00 worth, maybe $3.00.", "business_id": "dSQh1Hx2BiSrYog4ad740A", "stars": 1, "date": "2015-11-19", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "rEIa8CC8IjjS8eU_f6zLkA", "review_id": "6wgc2SGYD4QuXyb0X_o7Jg", "text": "Nastiest strawberry smoothie....it tasted more like banana and barely barely could taste the strawberries a side from it being brown not pink.", "business_id": "mOwAbR9_RgBQuFtr71UtzQ", "stars": 1, "date": "2014-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r-V8c-fQEHU__BtLD0kKfg", "review_id": "hBky92UQ369hdM77zjvS4w", "text": "I walk to Hava Java almost every morning with my dog.  I enjoy a coffee and bagel and my dog enjoys a treat from Jake.  My dog knows the way to Hava Java and on morning that I don't have time to stop my dog always makes it known to me she is not happy that I didn't make the turn for our Hava Java stop.", "business_id": "2h9LsLPdJ7OvZrYJZhVdAw", "stars": 5, "date": "2013-11-10", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 3}, "user_id": "9Z05mtXrXJ-22PElwp1ahA", "review_id": "n1rGO4TS2-b40H-cZp0a2w", "text": "Exceptionally comfy and attitude-free coffee place. Plenty of evening entertainment, free wi-fi, and the friendliest staff around. Definitely a neighborhood mecca for those of us in Arcadia or the Arcadia-ish area. Meet your neighbors or sit and chill -- free will is the essence of Mama Java.", "business_id": "Mb46iSlA4qmTwXf-WrqtQA", "stars": 5, "date": "2006-11-02", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 2}, "user_id": "vn3lecMsL3kXVe-7hg3gLg", "review_id": "q7VROm8OvQKoevlV4cDcIw", "text": "I do love Dunkin Donuts..... specifically the Toasted Coconut and Chocolate Frosted cake. :)\n\nPretty much 99% of the time I get the Coffee & 2 donuts combo (of course the Toasted Coconut & Chocolate Frosted cake). \n\nI used to go here WAY too often -- so often, that they know it's me when I order at the drive-thru. Cause I get the \"Toasted Coconut & Chocolate Frosted cake\"..... \n\nAnd seriously, I have to say that everytime -- cause for a long time they would mess up and give me a chocolate glazed donut or chocolate frosted glazed donut - - def not the same. \n\nFriendly staff. Make sure you get the coffee punch card if you order alot of Medium-sized coffees here...", "business_id": "T-AAN0CizEBOTtHinTuvrQ", "stars": 4, "date": "2011-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "0rRTTYnjOtMDD32RvlxPow", "review_id": "rO2GYD4DxLvkRQngrhE6rg", "text": "a nice place. kind of amateur service, but i'm sure with experience they'll improve by leaps and bounds. mediocre espresso and milk, but a nice atmosphere. i wouldn't make the drive if you're not already in the neighborhood, but i'm sure it's an asset to the area nevertheless.", "business_id": "4eFIVmbeCvJGCrhzmd-VYA", "stars": 3, "date": "2009-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "faVvuyxRutEkKX1hK1GuQA", "review_id": "tXkfWIbKpPK_iugK1UXCow", "text": "I was hopeful...beans roasted on site - check.  Hipster baristas - check.  Drinkable espresso shots - ummm...barely...really meh espresso, and, seeing as they're Grinder's Coffee Company, it seems that this would be the most important thing.  Kind of seemed like they didn't tamp the grounds enough before pulling the shots, maybe?  \n\nIf I'm in the area again, I may give them another shot at shots, but...I wouldn't go out of my way to do so based on the first impression.", "business_id": "4eFIVmbeCvJGCrhzmd-VYA", "stars": 2, "date": "2015-11-13", "type": "review"}
{"votes": {"funny": 6, "useful": 6, "cool": 7}, "user_id": "P2kVk4cIWyK4e4h14RhK-Q", "review_id": "vJO6dgy75O1Lemqu5VlulQ", "text": "I'll call it 3.5 stars.  Convenient location, pretty good iced cafe mocha, free wifi, punch-card so every 10th espresso drink is free, outdoor seating.\n\nWhat more could I ask of in a coffee house?\n\nOK, I could ask for really good pastries and I could ask for toddy drinks.  In fairness, I haven't tried any pastries yet so I don't know if they are good or not.  I could ask for the atmosphere I might experience in a street side cafe in Tuscany.  I could ask if they would wash my car.\n\nObviously I'm getting carried away.", "business_id": "C5TGxBqOae4uKCtpHGFMEw", "stars": 4, "date": "2008-10-14", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "hdZ3rlgFXctCOUhzoOebvA", "review_id": "PNnLGANW7-7lixSgW-caiw", "text": "I love Starbucks, I go to many locations through out the valley but this one has a cute outdoor area!", "business_id": "uFR7CpDJlW-gNdmk-zhIGw", "stars": 5, "date": "2013-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bwmXfjwrogAaGqV33kSVpQ", "review_id": "oVM7XxegqRTCmV7PUJselA", "text": "This location is so slow. I went here a couple weeks ago with over 30 minutes to spare before class and ended up barely making it. Orders were taken slowly because cashiers chit-chatted for way too long. And the barista (I think her name started with an M) was taking her sweet ol' time. Employees here need to be retrained and put through some speed/efficiency tests.", "business_id": "5kW3gHsqag1WD6Z1_HD54Q", "stars": 2, "date": "2013-10-03", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 4}, "user_id": "ODhV53XhesCBLJVfGsJGNA", "review_id": "G0-9KSle59-YBx43jI6E-A", "text": "I've been a Coffee Rush fan for years.  I had first stumbled upon this quaint little shop when my friends whisked me into this coffee place.  I'm so glad they did!\n\nI love me some fresh baklava and a Caramel Rush.  Prices are always great and the baklava...  YUM!\n\nThe atmosphere is very nice and cozy.  I've never really ever sat down inside or out on the patio though.  I normally take my drink and walk around the man-made lake with a friend or two.  Sure you have to jump two low walls.  It's so worth it! \n\nAnd might I add... go punch cards!", "business_id": "l1MZjZK2tLxfFRB62lQmsg", "stars": 4, "date": "2009-09-28", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "QNuKebSaAD-ycWvaXL1G3A", "review_id": "48ediL2pJkJkUb2bxhfPTA", "text": "It's a good alternative to Starbucks, but the taste isn't that much different. The guy with the weird ponytail (not the owner) is kinda annoying though.", "business_id": "l1MZjZK2tLxfFRB62lQmsg", "stars": 4, "date": "2013-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5eOjREaDIXXiOOdjuFSEhw", "review_id": "foKCr1yDbaqd8ENmmQjwbQ", "text": "Great location, so close to my home. The staff is extremely friendly and fast service. The shop is very clean and has a lot of retail products available for purchase. I LOVE this location!", "business_id": "_9JDgUdXbCn1Vx-nj49VJg", "stars": 5, "date": "2011-09-25", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "hORy0O17fXiPM5g_ouY3-A", "review_id": "FrEg9r5LEOatQLRFtZ53Ag", "text": "Come here every morning! What's not to love.", "business_id": "yMkXrAbKr3C1BjXIj6CIzA", "stars": 4, "date": "2013-09-13", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "DMCGCo1D88u61SBx8jXAWg", "review_id": "vwOLLB0h_1mbHr1suqAOBg", "text": "Dear cooks of liberty market, \n\nPlease visit and work at any village inn to learn how too cook eggs. This is the second time I've ordered over easy eggs and they were very over cooked to the point where they were brown on the bottom and brown on the top. I was at one time early in my life a cook for years so this task is the easiest you should have mastered and it was not busy at all. While I sat across three ladies having a nice breakfast I could see that her scrambled eggs were also brown and burned. \n\n1. Grill too hot? \n2. Not cleaning the grill between orders? \n3. Using olive oil or butter or non stick spray? All three behave different under different levels of heat.\nSo owners of this business spend a few dollars and have them learn the ins and outs of different ways to prepare eggs and not to burn them.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 3, "date": "2009-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Pv7DGHzZ-uqIUdOsqPpsVg", "review_id": "c5ZrmBoyR1kXZPj_iF1R8A", "text": "Maybe my expectations were too high after I'd heard so many good things about this place because I can't say I was blown away.\n\nThe boyfriend and I are loyal fans of the Farmhouse which is right next door. But we'd been curious about their neighbor for a while so we finally decided to check out Liberty Market. It was a Sunday and I think there was a show at the Hale Theatre because the place was packed. We stood in line for quite a while. \n\nI ordered the demi-breakfast - eggs, biscuit and bacon and the boyfriend ordered the breakfast quesadilla with chorizo. We also ordered a slice of chocolate chip banana bread and a slice of red velvet cake to go because that's just how we roll.\n\nI thought the banana bread was pretty good, boyfriend thought it was too dry. My demi-breakfast was okay but my biscuit was too powdery, like they didn't mix the dough well enough. There was actually a clump of flour in part of it. Considering how amazing the biscuits are at the Farmhouse next door I was disappointed. Boyfriend was not impressed with the quesadilla either.\n\nLater that afternoon we decided to try out the red velvet cake. Like the breakfast, it was just okay. Nothing I would crave or make the trip across town for.\n\nOverall, I like Joe's other places (Joe's BBQ and Farm Grill) much better. Although I will say the staff was very nice and I liked the atmosphere. Maybe their lunch is good? But for breakfast in Gilbert, I'll stick with the Farmhouse from now on.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 3, "date": "2010-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sOhtJDy7nOuVK3Zchxhg_g", "review_id": "YtnAZc8LsF78mLbQ5Furdw", "text": "Love every meal I've ever had!!!! That's quite a few!!!", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2011-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "t5EStHZ9ckQfXAgJdu5CMw", "review_id": "v5kBKJViadxY7M1hLWbeEQ", "text": "Ordered the margarita pizza with roasted veggies and jalapeños. It wasn't that bad but then again not the best. Liberty is not known for pizza however the crust was thin and buttery which made the experience worthwhile. The pizza was decent and refreshingly light which made my Sunday brunch all the more pleasant. \n\nLight, affordable, and simple. Good work Liberty.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 3, "date": "2013-09-01", "type": "review"}
{"votes": {"funny": 3, "useful": 12, "cool": 4}, "user_id": "cRyNICH0mhjxagvSyVr60Q", "review_id": "orMp4eCNL2DCqyNA8GrnXg", "text": "What an odd experience. :-/\n\nI seriously dislike the waiting 20 minutes in an order line, getting seated, then waiting another 30 minutes for food after we were seated. Why not just take names like every other restaurant and seat people as the table opens up? My thought is that you're standing in line right next to the display cases the whole time, when it's your turn to order, you've been eying that slice of cake, scone, or other baked dessert for so long that you have no choice but to order it. Will power won out this time - no scone for me!\n\nThe food was decent and the service was also pretty good. I ordered a chicken salad sandwich, being more in the average category than extraordinary, I don't think I would get it again. Having to serve my own drink from the fountain, waiting in line for so long to just make our order, getting taunted by all the baked goods, the general chaos of the place, and me personally living so far away (in downtown PHX), I can honestly say I'm not going to be making this a destination for dining. If you're close by and it's not a weekend, I imagine this spot is a lot less hectic and easier to deal with.\n\nHappy Yelping Phoenix. See you on Yelp!", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 3, "date": "2013-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mKjh-AG8Z0NXKtfCjZ5P3w", "review_id": "oOlcswS_fzTsn1MORIUyXA", "text": "Food is amazing everytime! Service is always great! Prices are higher than I usually like to spend for lunch but worth it!", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2014-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TLNZWkAXvGH4onmM15QgGg", "review_id": "Iqleb2LuEHIYaqKBRFMf4Q", "text": "For the most part, the atmosphere, food, service and location are up to snuff. I always enjoy the Picnic Salad but the grilled cheese sandwich was a major disappointment.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 3, "date": "2014-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6FyYYY0EMYVnWN-LXRzxlQ", "review_id": "mIYwul7HawhfnmnGoLYFtA", "text": "Environment is nothing special and restaurant is pricey for the accommodations. Service is slightly above average. The pasta dish was fantastic  and minestrone soup was excellent. The pizza was the worst I've had in decades (from someplace other than a chain fast-pizza place), with little sauce, sparce toppings, and bland flavor...and most went uneaten.\nMight venture in again sometime off peak hours for the pasta, but not worth standing in line for..", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 3, "date": "2015-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "U_wazvZULRk3AT38Higt2w", "review_id": "lNwZ122AQyj_ymdwtASt_w", "text": "We go here every week and just love it.  Food is excellent.  People are super friendly.  You feel good just hanging out there.  The only complaint is because it is so good, the line is long and it just takes a bit too much time if you came later in the day.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 4, "date": "2015-10-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "zXEFIJe7yg-EFOYJtcQh0A", "review_id": "QMeJJi6KbJ_siyhP58RQoQ", "text": "I couldn't find this place!\n\nIt in a strip-mall.  It's busy.  They have indoor and outdoor seating.\n\nIt's warm out - it's Scottsdale.\n\nBonus points for people watching.", "business_id": "VcrO_pqKMxllolvEk0Gq6Q", "stars": 3, "date": "2015-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-UyNlq8TwNTY0faXlAgJOQ", "review_id": "3TJIBKGxRhT-3UebocXmzw", "text": "Best croissants outside of France, no exaggeration.  Wonderful muffins (peach are my favorite but I'm told the pistachio are divine) and the focaccio is superb, but only if you get there early enough before they sell out.  All their bread is made by hand on the premises and they really know what they're doing.", "business_id": "o4v2m2kwWRVvrwYFjYcKaw", "stars": 5, "date": "2011-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZidF9PMIjfIpyn93BT2Jnw", "review_id": "IAK211qYb6hX6TSC7EiIHA", "text": "Consistently poor customer service every single time I am here. Starbucks CEO offering a free cup of coffee for all those that pay it forward to someone else during the government shutdown... \"Nope, we're not doing that here.\" Nice. Where's a Dutch Bros when you need it?", "business_id": "2jCyo55dFgGzYpoIX8TwgA", "stars": 1, "date": "2013-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yhZxCcGyhltqsJN6foL_Wg", "review_id": "ll5_MEZ78kck6b6m6RSQkg", "text": "After driving by this place a million times, saying \"we still need to go there\", finally stopped in.  Boy was I glad I did.  This is a very mom and pops kind of place that you can't help but be behind.  I've read that this place does most of it's business for wedding cakes and specialty cakes, however they do have a case of fresh goodies to choose from a la carte.  This being my first time, I decided to try a few options. I ended up with an individual apple pie/tarte, a chocolate cake with espresso mousse, and a black forest mousse cake.  Honestly they were amazing, and at about $4-$5 it was very affordable.  Can't wait for my next visit.", "business_id": "YgqexscIgNoMBAO__J97zA", "stars": 4, "date": "2012-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "GjYhx_UBsndqJ5O0P7y3cw", "review_id": "THJtp_T7WbtGqz8o9AT8fQ", "text": "The Xtreme Bean has a really fun atmosphere and I enjoy going their to hang out with friends.  Everything I have tried there has been good and not overpriced, but to me that is less important than the fun atmosphere.\n\nIt feels like the kind of place people come and randomly meet their next best friend or their true love.  It seems so friendly and calm and fun for some reason.  Probably because, unlike a lot of coffee shops, customers come here to socialize, read or play games rather than to pick up a latte on their way to work during the times I have been their.", "business_id": "IoFggnoj1P4EcmNEP2K6Ng", "stars": 4, "date": "2007-10-21", "type": "review"}
