{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q_jNEFRQfYunkJlqEITSHw", "review_id": "3c6FajImFevxx159Z7YAPA", "text": "Probably the best Korean restaurant in Pittsburgh, which, to be honest, isn't saying much. However, it is pretty solid, and the kalbi is pretty good. The service is pretty good as well.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 3, "date": "2009-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "7XnqLCNQ0NKcRUoNKJa3OA", "review_id": "FrluS8UzeNNTZeLnY9DPjA", "text": "I wouldn't call this place authentic Korean BBQ. I was disappointed that the \"grill\" at the table was essentially a frying pan. How can you even come close to delicious Korean BBQ if there is no open flame? Every other BBQ restaurant I've been to has had either charcoal or gas grill.\n\nThe quality of the meats were terrible, though one shouldn't really expect much from a buffet.\n\nI will say, however, that the service was friendly and accommodating. It's spacious, and thus great for large groups of people. Just don't expect fantastic Korean BBQ.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 2, "date": "2009-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Q6PGJ1UylVz9bby8wQqEPg", "review_id": "1MM92O-Q5xUyrNJaQjDbIw", "text": "Went for lunch.  No one wanted to go in on a sushi platter so I had the spicy seafood udon.  Not sure what I was thinking, I generally avoid shellfish this far inland as a general rule... anyhow, it was a decent red broth with one scallop, two shrimp and one clam.  For $8.95 and a dollar more than the vegetable udon, I'm not complaining but it was not very spicy but the noodles were hot enough to burn my mouth!\n\nLarge, good for big groups.  Lunch service was okay, but not very attentive given how slow it was.\n\nAnyhow, I'd like to go back for the BBQ or sushi and hopefully have a 4 star experience.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 3, "date": "2009-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oSo_3ARkzud3Wjc7evC2tg", "review_id": "A4HHtQaJ2AtTY_8-x7XCuw", "text": "First off, this restaurant is absolutely HUGE. there are a ton of tables, so i'm going to say that this place is good for groups..  When we went on a friday night, there were only about 7 tables occupied, with my friend and I sitting alone at the sushi bar.\n\nWe came here because we wanted sushi and rolls.  None of the pittsburgh restaurants seem to specialize very much in rolls, and of the sushi restaurants near shadyside/oakland, this one seemed to offer the most number of rolls (please let me know if you know of other ones nearby that offer more!)  We got a 12 piece combination sushi platter, a kim's favorite roll (which actually seemed like two separate rolls totaling 16 pieces), and a spider roll.  While the sushi and rolls were of acceptable size, the fish was definitely not very fresh.  the spider roll was probably one of the most repulsive rolls i've tasted in a while.  the soft shell crab was fried beyond recognition, and it took too much effort to chew as the crunching resounded loudly within my head.\n\nMy friend and I also split a soon doo boo, which came with a bowl of rice and a few miniplates of banchan.  while the soon doo boo was acceptable, with a lot of tofu inside, the banchan was pretty underwhelming. broccoli, pretty weak kimchi, bean sprouts...\n\nand sadly our bill came out to be way too much for a regular sushi dinner. after tax and tip, my friend and i each paid ~35.  while the service was friendly, i will probably not be coming back here again.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 2, "date": "2010-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aJEjMk7BfXeLO4kuKJSGOw", "review_id": "GKErNRvEJht7Q8COIXQnJg", "text": "My family and I had the intention of visiting another restaurant in the area but they were not open of lunch so Sushi Kim was our lunch alternative. \n\nWe were pleasantly greeted when we entered the restaurant and seated in a corner table. The service was attentive, we were brought water and green tea before our meal started. Their menu is a cross of Japanese and Korean. \n\nWe ordered a mix - my brother, the Korean beef, my dad and sister shared a sushi platter and my mom and I both got beef bulogi. Portions were reasonable, I was surprised they were not American sizes. My brother enjoyed the beef, but it did not come with rice thought. My dad and sister said the sushi was average. The beef bulogi was ok, filling but have had better across the border. \n\nEach entree was under $12 and the sushi platter was about $15. Not bad for lunch prices. \n\nAn ok place to visit if you are on Penn Ave. I would like to compare to other japanese/korean places in the area.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 3, "date": "2011-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CPkA6WUnCZfZ0md0imq3pw", "review_id": "0EEHXQVQES6svQQUv7hCyQ", "text": "I'm new to Pittsburgh with a job on the North Shore. I had a craving for some Korean food and went to the place nearest my office - Sushi Kim in the Strip District that boasts both Korean food and sushi.\n\nLet me say up front - the food I received was delicious. But, I was a bit disappointed with the portion size for my lunch entree. For $12.95, I received just a few portions of ribs (I ordered the kalbi), just 3 ban-chan (side dishes of kimchi, sprouts and broccoli), a small serving of white rice and a miso soup.\n\nDelicious food, small portions and a bit overpriced.  I was thinking of coming back to try to sushi, but I think the price structure needs to be reworked before I return.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 2, "date": "2011-09-14", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "bZC1KXe6vw8k6REIVs-iuw", "review_id": "P2o2RCNCMlhVVLbNQw8JVA", "text": "I have been ordering takeout a lot from Sushi Kim recently, because they are quick, close to home, and consistent.\n\n3 rolls to split and an order of edamame usually comes to about $20. I have been on a no fish kick, so usually get some vegetarian options and sometimes an extra specialty roll for the bf. Their simple rolls are nicely done - the avocado roll has big, healthy chunks of avocado (my fave) and is tightly rolled. I also love the tofu roll. Also, these are big rolls (8 pieces I think) so one could pretty much fill me up.\n\nMy order is usually ready in 15 minutes and the service is friendly. I've eaten in several times as well, sitting at the sushi bar is the best spot, in my opinion. The owners/staff are very friendly, and they have good sushi!", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 4, "date": "2011-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G-vLhSSWPOYQ3xZKOSeg-Q", "review_id": "Axm3K5F-HvuYnuwo-D0V8w", "text": "In the past, when I was still living in Pittsburgh, we would go here for the Korean BBQ almost every weekend. I have since found out that it is extremely difficult to get in as it is always reserved by one large group or another (I'm calling you out CMU Korean Student Association). Maybe I'm just unlucky with the timing of my visits. \n\nRegardless, I find it hard to believe the upstairs is exactly filled by these groups. Rather I think they are actually allowing them to reserve the whole floor, which is unfortunate and bad long term business IMO.\n\nThe menu food is OK, a tad expensive, and there are better places.\n\nI'll reluctantly give 4 stars since I haven't actually been able to eat here in over a year (Maybe next time I'm coming to Pittsburgh I will call ahead and put in a reservation, but other Yelpers seem to indicate they will push you out in favor of larger reservations).", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 4, "date": "2012-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SET17kMN92mdNeuOl9rHSA", "review_id": "Pv-rbTu0OuI5snqlLBOpQQ", "text": "I make it a point to walk down to suski Kim when I'm shopping in the strip district.  I love there sushi.  If you like hot make sure you get the after death roll with an habenero sauce.  It spicy but not going to kill you,  actually has great flavor.  Service is always great anytime I've been there.  Be sure if your craving sushi when in the strip take the walk down.  Only about 5 min past wholeys!", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 4, "date": "2012-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q4lPk78kqkUhz4C8JTOAHA", "review_id": "jW8ziU4wLoic8eTnvmMyQA", "text": "I have been to Sushi Kim numerous times each year for nearly two decades now, and have yet to find another sushi restaurant in the Pittsburgh area that can compete with the freshness of their fish, healthy portion sizes, or reasonable price points.  It is not a swanky asian-fusion joint which commands top dollar; but, a family-owned and operated restaurant that serves numerous traditional Korean dishes in addition to the sushi bar.  The Korean BBQ upstairs is a treat as well, but you better be hungry...", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 5, "date": "2012-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FYdpS8hpJUzzKD1VT1z3iA", "review_id": "A6524BlrZTYDNlJuDGwCDg", "text": "Ate here last night and it was absolutely the best meal I have had at Sushi Kim. Wife got the usual pork bulgogi and I got standar dol sut bi-bim-bap. \n\nIt was unbelievably good. It wasn't because I was really hungry. It was perfect. Every single bit of both meals was perfectly proportioned and seasoned. And the side dishes were GREAT except I really missed not having sweet potato and little omelet ban chan. I will cut out Dosani and Korean Kitchen as long as Sushi Kim keeps this up!", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 5, "date": "2013-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qywVBBmOW9fbqWDi3XO8rQ", "review_id": "08ENdCKruIoO90jlRWJ_TQ", "text": "I had a lunch there once. The food is ok but it's on the pricy side. I don't think I will be back.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 2, "date": "2013-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J_q8jN623uew8ZzMChXBCA", "review_id": "2smmyGuU3BjybQzcd_h50Q", "text": "There are much better sushi choices available.  This place is just okay, but I like sushi to be spectacular.  The employees were lots of fun, they had the best sense of humor, and the service was excellent. The prices were very good.\n\nI was there on a Monday, so I just tried the sushi.  I might go back for the Korean BBQ.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 2, "date": "2013-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wyxucIoNsdo4t2qLlMshkg", "review_id": "QrVSMGFQl5r0c2gIk3r3-A", "text": "Don't bother with the sushi, can't speak to the Korean BBQ.\n\nLong story short: I ordered delivery. Never had sushi delivered before, so maybe this is just the way it goes, but it took almost two hours to get to me. There was condensation inside the sushi container from the rolls sitting on top of the other entree I'd ordered (which was hot) and being held against it in a small bag. Assuming that the rolls were made long before I got them, I just threw out the tuna roll, which was warmer than room temp anyway. Vegetable roll was good, but not exceptional. Fried rice was...just not what I expected, not exceptional either. In short, I paid almost $40 for a cucumber roll and two bites of rice. \n\nMaybe this is better when you dine in. Still, would not recommend. Pricey and doesn't live up to it at all.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 1, "date": "2013-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xX3MsHLR-8vpnBSUd04Cyg", "review_id": "kxmssPNwVnXmVYsAUvVkAA", "text": "Being Korean and my kids and I visit all the Korean restaurants when we are out of town.  Since my daughter goes to PITT we wanted to treat our daughter to Korean food.  My family including my wife who is non- Korean always order    and if this is how they want to represent Korean food to others they are doing disservice to our heritage.   was the worst I have ever had.  Their  had lettuce as one of mixing choices and their meat was hamburger meat?  Will not go back.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 1, "date": "2013-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tH4brXlghqKn_9GbahrMTQ", "review_id": "TsMVDv43Pb7durqWuSblPw", "text": "I came here about three times for the all-you-can eat Korean BBQ and twice for a regular meal. \n\nFor the BBQ, it is expensive but at least you could try to eat ~$22 worth of meat and kimchi. They do ask you not to waste meat, which makes sense. I really like the kimchi and pickled daikon radishes they have on the side. To grill they have galbi, bulgolgi pork, spicy chicken, regular beef and pork, squid, shrimp, and mushrooms. You can also make your own sauces and add garlic and onion to the meat.\n\nI would not recommend coming here for the regular food. The food is good, but the portion sizes are ridiculously small, especially for the high prices. Their bibimbap doesn't even come with rice.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 3, "date": "2013-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8uNss5SDvtfH8LFOVXZtrQ", "review_id": "4lg8UKaeSRvQxRLOjw5l6Q", "text": "Went here for the ayce Korean bbq. I'm from LA where KBBQ is kind of a religion, so I was looking for a place to fill my craving. Flavor wise, it was pretty good and there was a descent selection. It was kinda of pricey though. 25 after tax. For the lower selection and high price that I'm used to, it's not somewhere I'm going to be coming to regularly.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 3, "date": "2014-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oolWxkuiaGjgh5wv6_Xh-w", "review_id": "FBwvwi8-ayA-T9ZdpDsLuA", "text": "I've had the korean bbq (2nd floor) several times now, and it's consistently good. We probably go once a month now. \n\nService is great, and the restaurant is very clean. \n\nWhile it's not a very comprehensive korean bbq in terms of banchan (none really) and grilling selections, each item they have is top quality and delicious. Kalbi is great, the bulgogi is great, shrimp and marinated chicken is good. There's some other assorted seafood and pork as well. Then you have some kimchi/radish, lettuce for wrapping, and each person gets a bowl of white rice. \n\nBut in any case, you should fill up on the meat at korean bbq, not the banchan right? So I think overall it's pretty good :).", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 4, "date": "2014-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vYkqkhsEtp1BjrDU-y6K5A", "review_id": "YdhSik4zaLqoqwdPFf8arg", "text": "I love sushi kim. The little owner always welcomes me with open arms. She is kind and always on top of providing good service. The owner watched the steeler game with my boyfriend and I while we ate our food. He joked with us and was very personable. The food is delicious and I always leave with a full stomach. The sushi is unique and beautifully plated. AND THE KIMCHI IS THE BEST IN PITTSBURGH HANDS DOWN.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 5, "date": "2014-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l5SH2Wkxl-g8wRSDrJnC2Q", "review_id": "GxynLybVyPn6bmuFXQW_Lw", "text": "The positives:  $5 glasses of wine and super-cheap entrees.  The sushi was good but not the best we have ever eaten.  And the spice beef noodle soup was tasty--not very spicy like we were told.  My favorite part about the whole place was the mini bowls of side dishes they give you with your meal--the kim chee was quite good!\n\nThe negatives:  The decor--I don't think that it has been updated since the 80's.  The cleanliness--didn't appear to be very clean either, I was afraid to look around too much because I didn't want to see anymore than what was in front of me.  The wait staff--not too pleasant!\n\nI don't think we will be back--glad we tried it because we heard so much about this place.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 2, "date": "2015-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vZ52JWe3gIU7PUsQJ4MNlw", "review_id": "UzTBnm0na9GqwCjurXIEzA", "text": "Man... Really bad from start to finish. Service is slow and horrible. Sushi is not flavorful at all. The rice was some of the worst I have ever had. I honestly would rather eat day old gas station sushi than come here again.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 1, "date": "2015-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yyl151cWJrL33FeOCuSi1w", "review_id": "E-XpBzoHPhOMPUjn_X3KpQ", "text": "By far the best sushi place in Pittsburgh. The service is amazing, seriously the friendliest people ever.  The fried tofu rolls are delicious.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 5, "date": "2015-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SthDEaueBEQb9I5NAqpSXQ", "review_id": "nsxElbdvTmNs9GK3xr6bHQ", "text": "Sushi Kim is a decent place of you're looking for sushi, especially if you live in the area. Since sushi happens to be a top 3 food for me I had to come here. The boyfriend enjoys sushi equally so we opted for the giant sushi boat that was filled with hopes and dreams. So much sushi I felt lost in the ocean. The quality of the rolls were good... The service was okay. I would eat here again.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 4, "date": "2015-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "P3u4qNtcOHQQTkBnzIh9Pg", "review_id": "ZowGuibHBRO_F6snbf5nGw", "text": "I'm a HUGE fan of the combination bulgogi plate.  Chicken, pork, beef...all on one plate.  I'm getting hungry for some right now.  Too bad I'm two hours away...*sigh*", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 5, "date": "2007-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "Ol_24OcKx7UI0_4FnlQDew", "review_id": "z_al32KLMg9Hr1oGLbJwKA", "text": "When we first walked into this place, we went to the front to order. Hmm..I see this is a trend with the korean restaurants in campus town. So first things first, they don't accept cash. My, we need to get with the times people. And I ask the girl at the front (who's spacing off) \"what's good here?\" She looks at me completely puzzled as if she's never been asked that question and shrugs looking at the specials saying \"here are the specials\". Um, okay.. So I order one of the specials, which is tofu soup and fish. I actually enjoy the salty fish and the kimchi is alright, not the greatest, and the tofu soup could be better. So yeah, the food is okay, not too bad. But yes, this place looks like a cafeteria and it was packed with college korean students..why? I don't know.. Maybe there aren't too many korean restaurants around here? I'm getting deja-vu from woori jib but the food was better here.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 2, "date": "2008-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "W9Et1PM6R9PQ9g04zgR3Rw", "review_id": "dv3mXhWLqmXqqh3PxwOd5Q", "text": "Judging by the percentage of Korean customers, it must be the most authentic Korean place in Champaign, and it's better Korean food than I expected to find in such a small town.  A-OK - three stars - seems about right.  The food was a little bland, but the flavors were generally right and cooked well.  The ingredients seemed lower-quality as compared to Korean places in larger cities, but still very edible.  If I had a jones for Korean food while in Champaign, I'd go here without hesitation.  If I just wanted some good food, I don't know that it would cross my mind while in Champaign, though.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 3, "date": "2009-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iZ9y3v-wo3Elt4NNRnQH5g", "review_id": "b1saexwfss_AuJP0Agkz6w", "text": "Good Korean restaurant and close to engineering labs.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 5, "date": "2011-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "83zqgCH5V0if3X0L_DVgug", "review_id": "_7_5rEfYqU0qova-JIoPTw", "text": "I don't know if they gave us the flavor-less version because we are not Korean. But we had soon doo boo and dwenjang chigae and they were so-so at best. I had to add salt, gochu powder and gochujeon to mine to give it a little flavor. The owner was irritated as promised in other yelp reviews. The dining area was cramped and uninviting. I will definitely find another Korean place to go to in the future.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 2, "date": "2011-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MJCBX00fARCnICrNCy8I5w", "review_id": "azR4wdCsuc7i3ucLjhL3oQ", "text": "Food is pretty good, though rather pricey for a campustown restaurant in my opinion", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 3, "date": "2011-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8Hep7KAAmWtXbhCLRQdbwQ", "review_id": "b95j2GhUrslI6mQQFYuPzw", "text": "like the Tofu soup and Kimchi fried rice Here! l", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 5, "date": "2012-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UO5eCeTNpnUekttaryBCNw", "review_id": "RmLr77OAAmNCwqlPvJaVwg", "text": "I've been to A-Ri-Rang several times now and I have to say that I am not a fan. None of the dishes are particularly great, and I would even dare to say that most are vastly bland by Korean standards (my S. Korean friend really didn't like the beef bulgogi). \n\nBeing that it takes a very long time to get your food, and that finding seats for groups larger than 2 people is nearly impossible, I am not likely to return -- There are definitely better Korean restaurant in the extreme vicinity.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 2, "date": "2013-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ejIbC7g_Fa_J-ipPuGXCOw", "review_id": "4tV9GbhzIVhistC7hs5mhg", "text": "Food is decent. Serving time is mediocre at best. Bibimbap sauce literally redeemed my meal. Price is somewhat higher than expected.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 3, "date": "2014-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bNBh7k2ccmF3ImKOLmi-Eg", "review_id": "6MjbEssXymxI4UeFRZXi6Q", "text": "Daily special number 1 is the way to go! It comes with half a mackerel, and a decent bowl of tofu soup. The mackerel can be dry at times though. The kimchi jjigae has a large portion and tastes good too.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 4, "date": "2014-10-11", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 4}, "user_id": "0bNXP9quoJEgyVZu9ipGgQ", "review_id": "_5ZtYsQhaWoBWZBegeWcYQ", "text": "Good bulgogi, and a spicy octopus platter I forgot the name of.  I'd visit again, but my eyes tear whenever I walk into the place- not their fault I'm allergic to *.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2008-09-12", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "3VrsuHI2bSdRQJH_5kI2yA", "review_id": "IjMpZZG4RKPIGbRKHdKNYw", "text": "3 words:\nSoon.  Doo.  Boo.  \n\nthat is all.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2008-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "9bfryXyHC9-hZyuibVWQlw", "review_id": "3crPwYVdSpiR0NYe2Yr9qA", "text": "Really good Korean food.\n\nIf you are Asian you probably have already known about this place through relatives!  It's has the best tofu soup in Arizona. The meat dishes are also yummy too. One thing I've  tried and didn't care for much were the Korean pancakes... they weren't very flavorful at all. \n\nThe ambiance is average, the music is bizarre. If you really are looking for a true authentic experience I would try visiting Takamatsu, but overall good food!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2008-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "iwv2iafHe23KSlwBEKIwFQ", "review_id": "eYwr_JdMpKbpEc5C0VfKuw", "text": "First of all, I want to state that the food is pretty good and the portions are huge. I would've been ok with a bit less food and less pricey.\n\nI have been to this place twice for lunch with coworkers. At first I just thought the service is awful, and it takes a LONG time for the food to arrive. Eventually I realized that this place might actually be racist. If you are not asian/korean or if you come with people that are not asian/korean, you get served last. I have observed that Koreans that came in way later than we did were already served with their meals while we waited, waited, and waited some more. This observation really hit home when it was independently verified by a friend as he mentioned he observed the exact same thing. And he's half Korean. So there you go. If you are not Korean, expect crappy service and get your food after all the Koreans have been served, even if they came in way after you did.\n\nUpdate: We did an experiment the other night after playing tennis with a group of friends. We went there with majority of asian people (3 of us asian and one non-asian person, with one that can at least pronounce the food in Korean). And surprise! Prompt service. So...food is good there, service is to be desired depending on who you go with....", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2009-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LdJFjb2w0yJOxH1_0JAqrw", "review_id": "0pR3dKoXuurzCeQAj73nUQ", "text": "Finding good Korean food in the Phoenix area = not easy, and this place is more than decent. I love the tofu soup and the kimchi/pork pancake, although both could be spicier. The dolsot bibimbap is also good and the kalbi well-seasoned.  Good selection of panchan each time I've come in.  I miss tabletop grilling, and the food is a little pricey for what you get, but definitely worth it!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2010-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CspGWs3w1CYkCI94f0MOsA", "review_id": "80HS3fd_CrqKSMfzK3S2eA", "text": "My favorite Korean restaurant in town.  My favorite dish is the spicy kimchi and pork.  Out of all the korean restaurants in the area this one just has the best food!  Service is average but I'm not very picky about that.  If your looking for good food this is the place to go!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2011-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qQns9dP75RNOWOVWI_ZKZw", "review_id": "_xzGB2fJ62ZOtd3jISKxBw", "text": "I ordered the spicy pork. The flavor of the sauce was good and the meat was cooked well, but it was also very stringy and fatty. Overall, the food was mediocre. The food prices are too high for the quality offered. However, the portion sizes are quite large, so there should be leftovers for extra meals.\n\nOur service was terrible. The servers would not look in our direction for 20 minutes at a time. They did not once visit during the meal. They brought two dishes out 10 minutes before the others and brought one person's food out 15 minutes after everyone else had their food. We had trouble paying, since they would ignore us and wipe down an adjacent empty table even though we were clearly waving and yelling to them.\n\nThe combination of terrible service, average food, and high prices ensures that I will not return.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 2, "date": "2011-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mAxVo2_v6k9pk9MaRfMH_Q", "review_id": "8uRleFSvyFLkqGvpCCQWkg", "text": "the only thing i ever order here are the balgogi and seafood tofu soup so i don't know how reliable my review is going to be. i need to talk about the balgogi though. i went here last month and ordered the balgogi and i felt like i ordered a dish of seasoned fat with brown food coloring. i didn't enjoy it at all, but i thought maybe they ran out of the good meat, or the chef just suck that day. well, that's obviously not the case because i went back a couple days ago and ordered the balgogi again and this time it was worst than the last. i understand the economy is down, but gezz with the prices they charge shouldn't they be able to afford to offer a decent quality of meat? \nthe service here isn't that great either. it has never been great, but it didn't bother me because this is a busy restaurant. i always thought that they should hire more people but that's their business.  \ni'm giving this place 3 stars for what it used to be.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2011-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IBhsXQq5oN4SGy_XXuUyVw", "review_id": "7s6TW96jtwQsmq9ugnklQA", "text": "The Food is ok.  It is not easy to get the waitress's attention.\n\nThe most terrible part is we saw a cockroach crawling on the wall next to our table.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 1, "date": "2011-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "S4VveSuTnOSV8IxXNGrd5w", "review_id": "u2HkNxM-nBVBskeKIgOL5A", "text": "The korean population of arizona eat here, that alone should be enough to check it out. If not, the foods damn good too.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2011-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "OMC3DRyGrDbq-oMtdRAH8Q", "review_id": "LD-vlfZdVmGTGv2IYs1pcA", "text": "Took 5 minutes to get a menu.  Another 5 to get our drinks.  We ordered what we always order at our favorite Korean place which is the Bulgogi, and mushroom tofu soup.  I figured these are very popular dishes, and easy measuring sticks to compare different places.\n\nThey give complimentary salad which includes iceberg lettuce... and teriyaki sauce.  No thanks.  \n\nBulgogi:  Really wasn't good at all.  It was too thick, the onions were 100% raw and there was no flavor beyond intense onion and poorly bbq'd beef.  It should be THIN, and TENDER, and FLAVORFUL.  Failed in all aspects\n\nTofu Soup:  Server asked how spicy we wanted it, and we said normal.  Apparently that means zero spicy or just adding 3 jalapeno slices into the soup.  That's authentic right?  They also use a very runny type of tofu, not the more firm stuff I have and like at my other spot.  It really had the texture of egg whites.  In fact, it had the exact texture of the egg white that was also in the soup.  So it was just watery flavorless broth, with textureless tofu and textureless egg b/c it wasn't hot enough to properly cook the egg.  Factor in the tough mushrooms that were obviously re-hydrated and you have a very poor dish.  \n\nThey stiffed us bowls or plates, unless they expected us to reuse the salad bowls so we had to wait around for a while to ask for something to eat on.  They also brought the dishes out at different times which is bad form.  \n\nThe best and worst parts were actually the sides.  What the hell are those shrimp, and why are they on my table?  They were dis-gus-ting.  Kimchi didn't taste fresh, bean things weren't that good, bean sprouts were too mature to be good and the cucumber thing probably sat around too long and got soggy like cucumbers like to do.  The daikon kimchi was the only solid side.    \n\nMy go to place is Cho Dang in Chandler for my Korean BBQ.  It blows this place away on all levels.  Their meat is of much higher quality, they actually include stone rice with their soup, serve amazing sides, and the atmosphere is a lot less cafeteria like.   To top it off it is about $5 less for the same exact order, but with larger portions of sides, rice, and meals.\n\nReally isn't a whole lot of good to say about this place.  I'd give it 1.5 stars, not quite bad enough to get a 1, but certainly not good enough to simply earn a \"meh\" rating.  I actually started this review by giving them 2 stars but as I started writing I realized there really wasn't anything positive I took away from the experience.  Couldn't even get an iced tea refill for the last 10+ minutes we were there.  Guess I'll still have to drive 15 minutes down to Chandler rather than 5 minutes to Mesa for Hodori.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 1, "date": "2011-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iJUVamUkqL6VfEMfyQoujw", "review_id": "H45EJHeCXUQDfiRfMZRsng", "text": "Get the kimchi fried rice....almost like a bibimbap...with the hot pot and egg. I would not get the cod soup....the fish eggs are not that great. Other that good place to see asians enjoy a good meal", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2012-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "XA_lIArLNis1tzrqSywzHQ", "review_id": "iuv2QctuvIPIXJwZoOgNMg", "text": "This place has AWESOME kimchi Chigae, kalbi is ok but kinda overpriced. The service is hit or miss here. \n\nBut probably one of the best korean places on the east side.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2012-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "Tlrv1rxNnU1YY3PsLFvqZQ", "review_id": "mVRJ0olnMvgYGFCUMnf3cA", "text": "I'm a huge fan of this place. Great service, great Korean dishes at very generous portions. I really just enjoy the regular-styled Bulgogi (thinly sliced beef served in a hot stone plate with caramelized onions). Also really like the bipbimbap (veggies, ground meat, and rice in a hot stone plate). Bring that out with an unlimited supply of kimchi and we're good to go!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2013-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "XfUbS8krsXec3nKYA63jrQ", "review_id": "xR5gLu10Mg1qzrnJ_kAtUw", "text": "I just got back from southern Cal, including Koreatown South (Garden Grove) - and I think this place is better than the places I went to out there.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2013-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "FUMdzARf71drXyDZ7lkpWw", "review_id": "MRLkqrlbvQh33lQJU6HvJw", "text": "Hodori is set in an all asian strip mall, with 2 or 3 other restaurants. That being said, it was the only one PACKED on a tuesday night. I ordered the kimchi fried rice, being my first time there, I didn't want to go too crazy. Despite being busy, it came out in about 5 mins in a hot stone bowl, with sides of pickled cucumbers, daikon, kimchi, sprouts, tofu, and potatoes, all of which, I stirred right into my rice. It could have used a touch more beef, but the fried egg on top was marvelous. As you get to the bottom of the bowl, the rice is more caramelized and crispy..soo good. I took a bite of the kimchi as I left, and as I was riding my bike home my pallette became the CLEANEST it has ever been, the taste in my mouth was like sweet watermelon. Crazy. Best fried rice ever.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2013-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lFuuyO2gM4_9pCcPdUNRmA", "review_id": "d2Hj5o356ClSoZDGXCRLvA", "text": "Had dinner on a weeknight, seemed like we had to wait a little too place our order.  The food was good, liked it and will be going back.  I love Korean food.  I had the kalbi and my wife had a tofu and pork soup was really good.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2013-10-12", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "V4dRqmyUjLcLBqJ8E_1aew", "review_id": "039tc6plfXPsxnBzVZqhsg", "text": "YUM! For Arizona, this place is AWESOME. Seriously. It is really difficult to find any good asian food in the area and this place has wonderful food. I love the banchan and have ordered the tofu soup as well as the larger meat and seafood dishes. They were all really good. Whenever I am missing home, this is my go-to place for comfort food.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2013-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "90Yv6uLku3-yCK7ei9z3dQ", "review_id": "usBrGPxM10aEKhveUW3rxw", "text": "The korean food is delicious overall but it takes FOREVER for the food to come out and a bit over priced.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2013-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "bwmXfjwrogAaGqV33kSVpQ", "review_id": "cz8GxYS6giFpzZu8hV9b4w", "text": "I miss LA's Koreatown terribly but this definitely hit the spot. Pretty wide menu with familiar items mixed with more traditional Korean dishes.  Plenty of tables but the place still got packed on a weekday. Korean restaurants tend to be more spendy than other types of Asian food so be ready for that but they have some special deals posted on the wall at certain times. I will definitely be back to Hodori.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2013-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "ci67CmnSsnvjiC3xlG_N0A", "review_id": "0JYLu-sYRQZZypZs7zbPbg", "text": "No longer a Korean Cuisine Virgin . . . and even though I have nothing to compare this place too . . . it was fabulous.\n\nFirst the Service . . . Seating quickly and our drink order was taken immediately.  When the waitor return with the drinks, he walked us through their menu . . . pointing out his favorite dishes . . . but more importantly . . . helping us decide between the two  dishes we were interested in . . . this is great since at that point I was still a korean cuisine virgin.\n\nMy choice . . . with my wiater's recommendation . . . Nakji Dol Pan . . . Octopus stir fried in a spicy sauce and served on a sizzling stone plate.\n\nSecond the Food . . . the food came quickly and was unbelievable . . . though spicy, not too spicy . . . however, the spiciness does grow on you over time.  The octopus, was cooked perfectly and almost melted in your mouth . . . and the side enhanced the overall taste of the dish.\n\nI will now definately try other Korean Restaurants . . . but it will be hard to surpass the experience I have here at Hodori Restaurant.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2013-10-23", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "JuTPZZS1hieijwl9l_mJdg", "review_id": "xwbfThyhRTyUiVfYk_X0VQ", "text": "Review from a korean guy.\nLunch/dinner time expect understaffed poor service because its typical at any asian restaurant.... Especially if not a big party of 6 or more.\n\nBut I get great service because I go there from 12p-4p suckas!\n\nCompared to takamatsu...\nTakamatsu has better lunch specials, and just as tasty.\n\nI just come here for the convenience.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2013-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tDCQerUB2EBEp6VeYEvkqw", "review_id": "eRHixYTo-ezVA12IkscJ6g", "text": "Its alright.... the seafood hot pot is not enticing at all.\nThe chicken grill is bad choice for us as well. I taste nothing but salty overly done chicken meat.\n\nDaorea serving is so much better... larger side dishes served as well. \ncome to penang and I will show you what is good korean food", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 2, "date": "2013-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "R4Ax3btoJ6qLXhqq6J50VQ", "review_id": "Lj7EpdGEtwRseQSrlBAxsQ", "text": "I was having a strong craving for korean tofu soup. It was ok, their soup is enough to get me by until I have to go back to So Cal for some BCD. I got the assorted special, there were a lot of clams in it.  The bibimbap we ordered was tasteless, the sauce it came with just kept making it taste weirder as we added more.  We had to opt for some soy sauce with the rice at the end.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2013-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eOiICBfgIB7RjIQ9pZRWOA", "review_id": "BARCaTj74m1X4iKneWX5Vg", "text": "I'm giving Hodori a 4 mainly for the food, not the service. Sometimes they do good, other times I'm sitting there just waiting for a menu. I know I'll keep coming back because I love the food however! Must try the spicy beef and mushroom tofu soup, the Kalbi BBQ ribs and even the potstickers are great!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2014-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2MDXH2Ka2uxcuwNg72KhvA", "review_id": "u6ezqMNmUOFrNLfsIk43hw", "text": "I was looking for a Korean restaurant in the Tempe area. Found this place through Yelp so I decided to give it a shot. Ordered the bulgogi and was a little disappointed. The flavor was a little bland, normally the bulgogi flavor should really stand out but not this. The appetizer had less selection than other places that I have been to but the problem was that the flavor was also a little bland. \n\nThe pros about this place is the service and the portions. I think they may specialize in the tofu soup. Seemed like a lot of people ordered that when I was there.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2014-09-06", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "fRuflKntKfMY62EyScXLhw", "review_id": "8K6K-_v6PRRw2b2hVRZ1mw", "text": "We used to go to Takamtsu on Arizona Ave and was never disappointed. Then, they changed owner and food quality is not as good anymore. A friend of us told us about Hodori, so we decided to give it a try. OMG, it was the worst dinning experience we had for a long time. First, bad service; you seat yourself and wait. The two waitresses were running like crazy. Good luck on getting their attention if you want your water refilled. The price is at least one third higher than Takantsu, but the potion is at least one third less. The seafood pancake had only a couple of tiny shrimps in it. My husband was stationed in Korea for years and knows Korean food very well. Koreans are known for garlic loving, but non of the dishes we ordered had garlic in them. That was a big surprise and a big disappointment also. With no drinks, one 4 inch seafood pancakes and  clear noodle (which they call appetizer) and one dish to share, our bill came over $40. Well, I guess before we find another Korean restaurant, if we really want Korean food, we just have to go back to Takamtsu again.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 1, "date": "2014-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vqPpdUmFxd43rgm-j517Sg", "review_id": "IxEka6VHJcDFM2JOE-P1FQ", "text": "Very traditional. This could be a plus or a minus. If you want authentic Korean food in an authentic Korean way, this is the place to go. If you want a comfortable atmosphere, fast service, or a \"fusion\" menu, this is probably not the place for you.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2014-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-IA6qgrB0Wgy_CnWKV371Q", "review_id": "nh3Hi0wJoK5e_stqCgQUFA", "text": "Food is authentic but hit or miss with the flavor. Staff are friendly and I can tell they are working very hard. I went there with a couple friend's and their friends on the day classes were cancelled due to rain, and I sincerely apologize for their behavior. At one point one of them yelled across the restaurant at the cooks saying he wanted ice cream, (oh my goodness, I am so sorry, that was very embarrassing)... I saw them advertising seafood pancakes last time I was there and plan to go back to try it since I really like seafood pancakes.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2014-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5kxoeubFw7AS1mCPL-QElA", "review_id": "Nbzsc_dpeGNOnaGpI6v48A", "text": "If your korean it's doable  taste but not stellar but can't complain I think not many choices in Phoenix area. It just tasted bland and soup was soso. I am so use to good korean food in wa and LA..service was excellent and fast!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2014-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7oqsyjcgzchonHTTh7rfBA", "review_id": "0c0ICFOm_w58QMN6-Q0Wsg", "text": "Their side dishes have very little flavor.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 2, "date": "2014-10-06", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "4i-mHrOHOWinc9vIXq6joA", "review_id": "7AjQTnqcfnwQrx35SxSWzw", "text": "This is one of my favorite places to visit on a weekly basis if possible. Me and my best friend, Emily (who reviewed earlier), come here very often. Even one of the waiters recognizes us! I don't remember his name, but he's the one with glasses, lovely young man! I love that they play kpop and not only their latest singles, but so many different songs. I try to eat something new every time I come here, but I always come back to my kimchi jjigae. Everything else I have tried has been fantastic. Yuk gae jang, soon dubu soups, jun, bokum, fried rice, cold noodles, you name it and it's fantastic. Great happy hour, too! I really can't get over how much I love this place! Plus, my boyfriend and I had our very first date here so that will always stay in my heart! anyways, if you're looking for great authentic Korean food, this is your place!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2014-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G-bS3DjLRYV2BSlRdMpvpQ", "review_id": "FqUJDxONT6L9dk_6snfHYw", "text": "This is my current go to place to get Korean BBQ (bulgogi).  If anyone knows of other spots, please let me know.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2014-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FEJt4rZgikhJqPXnnyld_Q", "review_id": "oyHXR5456k5_Oe6_1yfRmg", "text": "They make really good tofu soups. I like how they hand out Yakult at the end when paying.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2014-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "X8LzH3gWUIoLOBIxa5XjBw", "review_id": "O6JU1yThWV_mDO81Q0IBtA", "text": "I pretty much now come here regularly for the soft tofu, beef & kimchi soup. It really is fantastic.\nOne day I'll branch out and try other foods, but for now, the tofu soup is what I need.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2014-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3sS1aT8pfZnokBtNwiTqrw", "review_id": "3DDFTsEyWEac3TTb4klkaw", "text": "Food is just so so, definitely over priced. We've been here several times and I guess the only thing that has been ok was the service. But it got turned down today, we asked for extra kimchi THREE times and it never came, I guess the old lady who works there just keep forgetting our table. Will never go back again.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 1, "date": "2015-10-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "8Knppc9FtlyJNi9ySRz8XQ", "review_id": "hqr4-SYqmNKDa1KLTZ265g", "text": "I found this to be the most authentic looking Korean restaurant. Typically a majority of the patrons speak Korean. They have great lunch specials with a good variety of dishes, soups, and stews.\n\nI ordered the Sol Long Tang and loved it. It reminded me of Gahn Mi Oak in NYC. All the ban chan were very fresh and tasty. The servers were very quick and polite. I definitely will be back in the near future.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2015-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fD3Ri9amkmUTD5WBqj6LEw", "review_id": "JGznxfljfMcW6jj3OJPysA", "text": "I have never had Korean food before and I was a little skeptical about trying it...But it ended up being AMAAAAAZING! They're huge portions and very well priced! I will be sure to tell my friends and family about Hodori.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2015-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MZS37pBU8JFiPZmRYi-W2w", "review_id": "EMxztJjL49pEPQ78lgVgSA", "text": "Excellent food, friendly service.\n\nI came here with a big group from work for my boss's birthday. He's a big Korean food fan, and he's shown before that he makes some pretty good food choices. So I was pretty excited about the potential for this place, especially considering that I hadn't found a Korean restaurant here in Mesa just yet.\n\nWe were all sat quickly at lunchtime. Considering that there were about 12 of us, that's pretty good (and the place was mostly full). Our server was very attentive and came back regularly to make sure that we had everything we needed.\n\nThe menu is extensive. There are all sorts of choices, and there are a lot of choices that really piqued my curiosity. At some point, I'll try some of the more exotic items, but on this particular visit, I kept it rather basic and had #63 (Mae Un Dalk Bulgogi, which is Korean BBQ chicken marinated in a spicy sauce). To start, we had a few orders of #49A (Goon Mandu, which is pan-fried potstickers). And of course, there was kimchi and a variety of other sides that come with the meal.\n\nThe potstickers were tasty. A little crunchy on the outside, and with some of the sauce that comes with them, quite good. I normally don't eat many potstickers, but I had 3 of these.\n\nThe chicken comes served with white rice--nothing special about it. The chicken was nicely done. The marinade was excellent! The spice level was perfect, and the flavor was really good. I definitely enjoyed it.\n\nBut as I have often found with Korean food, the stars of the show for me were the sides. The marinated cucumbers, the kimchi, the seaweed--all excellent, all with really great flavors. Best of all are those potatoes. I don't know what they use to flavor the potatoes, but they are great! I could eat a whole plate of those potatoes, but unfortunately, they come as a small side. I'm sure that I could have asked for more, but with the size of the chicken platter (lunch portion, mind you) and the potstickers to boot, I was quite full.\n\nTo finish off the meal, there's a little dessert that I believe is a probiotic drink. It has an interesting and good, albeit a little medicine-y, taste to it. Always nice to encourage good digestion at the end of a big meal!\n\nI'll be back. And I'll try out some of the ox knee.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2015-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "XfUbS8krsXec3nKYA63jrQ", "review_id": "spuMXliTtPlzpsa889bL6Q", "text": "I saw a few comments here saying that this is a bad area for Asian food so they're surprised to find Hodori.  Are you serious? I think thisDobson Rd and vicinity area is great for Asian food - Korean, Chinese, Vietnamese, and more.  Hodori itself is very excellent.  I've been coming here for years.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2015-11-16", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "vy0nm2MYGayJ2JcRtfaWxg", "review_id": "NhsHb1_dkO6JeWpThJ1nGQ", "text": "The food here is awesome. The bulgogi and bibimbap were very enjoyable and kimchi tofu soup was perfect for the cloudy and chilly day that we went on. Although a little bit pricey, the portions are a good size and the customer service is great. I recommend this place for fresh, good korean food.Lots of choices and in a great area. Right next to Asiana market as well, so double score :)", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2015-11-25", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "p7dvahRPZIWL7T6pFA_0dg", "review_id": "m53hYJ1P0IBmK04kxj739g", "text": "This review is based on only one lunch time visit. \n\nThe day I came this casual Korean Eatery was packed with people (a good sign..?) but only had two servers working as a team to wait on EVERYONE. \n\nOur order was taken in a timely manner and we waited around 25 minutes for our lunches to arrive.\n\nI ordered the grilled Atka Mackerel. As tasty as this fish was....and it was...this meal was almost impossible to eat because it was filled with hundreds of tiny bones. I don't think fish with this many bones should be on any menu anywhere. I do note the side dishes with kimchi, cucumbers and four other sides were tasty and mostly delicious. I thought they seemed above average. A better choice would have been the Black Cod with Radish but the price difference was just too much difference for lunch time. Mackerel was $13.99 and the black cod was something like $26.00. \n\nBack to service I wanted to ask questions about a few of the sides but nobody was able to check on us during the lunch.\n\nMy husband had the Kimchi Bokum Bap.(Ribeye in a hot stone pot with egg). We both thought the ribeye was tender and tasty but lacked any heat. I think some sort of hot Korean Sauce should have been given with this dish?\n\nThis is a place that I would re-visit but I do have some reservations about some of the dishes such as the mackerel and the lack of service. So for me that's three stars. Still a positive rating. \n\nI do note this was a holiday weekend and it's possible they might have been busier than expected and short on help.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2015-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DhPUvStf9BKMs8aLTFaOKw", "review_id": "qw6UAlQSrjd7BbJSEo4xJA", "text": "Not a big fan... They nickel and dime you. I ordered the lettuce wraps and they do not serve enough lettuce with the order.  I asked for one additional piece of iceberg lettuce and they charged me $1.00!!!! I could have walked to Albertson's next door and bought an entire head of lettuce for 59 cents!!!", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 1, "date": "2010-09-03", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "knBiWPrGuS6Ih0ysqYn4UA", "review_id": "FNVOtpm2gjE5zvHdax6nbg", "text": "Best Chinese food in my LIFE. \n\nIs that going too far? I don't care, because I love this place! I grew up eating here, and now I come here every single time I visit Scottsdale - AND I recommend it to everyone I know who visits as well. I've probably eaten twice my weight in Szechuan Stringbeans over the years, and triple my weight in Szechuan Eggplant + Tofu.\n\nHere's why I love it:\n\nIt's NOT OILY like most Chinese food places. It TASTES AMAZING (I highly recommend the Szechuan dishes). And they are willing to add or substitute items to your dish to FIT YOUR CRAVINGS. Beat that, Panda Suck-spress! And it's all MADE FRESH and FAST in a hot wok, right there in front of you!\n\nRecommendations: Get the loose-leaf hot tea, it's delicious and served in a fun mug. Get an order of the Szechuan Stringbeans (with your choice of protein, I recommend tofu), and an order of Szechaun Eggplant (also with your choice of protein), and douse everything in some healthy scoops of chili sauce to hike up the spice factor. You'll notice that the Szecuan sauce varies from dish-to-dish. The stringbeans are very sweet and savory with a thin sauce, while the eggplant's sauce is much thicker and more savory. Totally different, but equally delicious.\n\nHaving moved to LA, China Lite is like the \"one that got away\" - I measure every other Chinese food restaurant I try up to them, and everyone else can't help but pale in comparison.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 5, "date": "2010-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "LABKzJqIEuzXmmik8AUi8g", "review_id": "6iiCm6KCF6IGxP4g3vHOUA", "text": "I don't understand why people call the food bland. If you want flavor full chinese food go to PF Chang's, but expect the heavy doses of salt, butter, unsaturated fats and other stuff. For me they deliver exactly what they promise, good food, low calories and salt, with very little fat. Unlike a meal at PF Chang's you the food settles in your stomach without that heavy feeling.  I eat here often.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 4, "date": "2011-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V1995Thbyn7iu38xPKAA8w", "review_id": "UurOWX9g1_pLNvCxLgoKww", "text": "This place is the bomb.  I've lived in this area for 7+ years and if there's a place where you can get quick, inexpensive and HEALTHY food that's better than this, I haven't found it.  It's sorta like Pei Wei only much better food.  If you haven't been there since October, 2013 - check it out again.  They recently remodeled and it looks much more upscale than before.  I was getting the Korean soup but the fish is really tasty so I'm starting to order that now.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 5, "date": "2013-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xQZE-L4aLQXoIUyrcFbreA", "review_id": "4xWNB0FRoRuwCpWW8Ygj7Q", "text": "The food here is excellent and healthy. Some dishes don't have oil &  they don't use MSG. The Mongolian chicken is one of the tastier dishes as some can be a little bland probably due to the health conscience nature of the food. They recently updated the interior so it's a lot more inviting and they now have Pho soup! Great prices on lunch too!", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 4, "date": "2013-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "MrPOzC4Fz_xEwJkA051V8g", "review_id": "YbewRPv-AgPki84NjhRWyw", "text": "I ordered the crispy tofu which comes with an assortment of veggies and is drenched in a brown garlic sauce, but I also added a little spice. It was good, and I'll definitely come back for it again. The service was friendly and speedy -- a nice little lunch find.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 4, "date": "2013-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "X4iuq4vCgyuZSRcT5T5_-g", "review_id": "zm1CBeBTCpSR-9iYMIKDQw", "text": "This is good stuff.  Tasty, healthy and very pleasant service from the woman that owns it.  Some of the best Chinese in the Valley.  It's definitely worth a try.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 5, "date": "2013-11-19", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "EdMSrn6los8M7sAekab7Ew", "review_id": "URkEniso2-TI70QsuyRyAA", "text": "First the good: The staff is very nice, the food is prepared fast, and even though it's small, it's a nice atmosphere. I've had a few meals here and unfortunately, the food tastes very bland to me, like there are no seasonings at all (except for the Tom soup, which was spicy). The chicken pad thai was just covered in peanuts and the chicken smelled and tasted bad. The chicken and shrimp in the soup were dense, like overdone, and didn't seem fresh either. If the food were fresh and they used lots of spices, then I'd be a regular takeout customer.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 1, "date": "2014-10-01", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "Z-XRnwJxPFqZmW14lHjy6A", "review_id": "QtzbtqCYIrzQp1LEXPqeaA", "text": "This place has figured it out.  Great food at a reasonable price.   and special request are their specialty. They love to please their customer.   And all their food is cook to order and fresh. \n\nWe live in west phoenix and found this place several years ago from a referral from our doctors office in Scottsdale and have been coming hear every time we come to Scottsdale.\n\nThis place is worth a try.  I would have a hard time believing you would not like them, unless of course you think panda express is really Chinese food.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 5, "date": "2014-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "L0XzCJwhb-weYexSmp1_nw", "review_id": "ifwCaCYl9dELqJUjUzWtlg", "text": "This is one of the better Chinese-American restaurants at its price range in the Scottsdale area. \n\nPros: most dishes have good flavor and come with large servings. The restaurant uses a lighter sauce than what you will get at Pei Wei or Panda Express so you don't feel bloated after a full meal. \n\nCons: some dishes lack a distinct flavor so you leave  feeling underwhelmed. Stick to the main entrees and you will be fine.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 4, "date": "2014-11-03", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "QaguvugBJtqK7-c58DRs4Q", "review_id": "TUQnTTLQFehNXoUEhF3NsA", "text": "If you want to get reasonably priced tasty Korean food this is the place for you. I don't understand all the negative reviews about this place. Many Koreans actually come to eat here, which should be a good sign. And yes, they may give you only 5 banchans plus a salad to start but their banchan is tasty. We usually get the Tofu soup and Galbi and it is delicious. Just don't order the Mul Naeng Myun. You will be disappointed.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2008-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xB4MUNnTuxzvKS6W2E-GzA", "review_id": "4NAnqbZX5aqxtrEGZZ7iMg", "text": "Their tofu soups are 5 stars, I either order the seafood or seafood beef.\n\nEverything else is very average, and their kalbi (Korean BBQ beef short ribs) is yuck.  Almost seems like it's going bad.\n\nGo for the tofu soup and you're A-OK but anything else, your call.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2010-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nDdA0CMd-HLYBvaryw5_xg", "review_id": "t67-kTO0ToPTAvcL2j38xw", "text": "The Kalbi was very good, but nothing else really stood out for us. The place is small, and nothing very special on the inside.  I would prefer to head across the street to DJK, or down the street to Mother's or Sura myself.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2010-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ZG20T3cdkQ6fLSawEwuhjA", "review_id": "2CiwEoxtevtYJUBoKY1HPw", "text": "I've been coming here at least 6 times a month and I finally decided to write a review.  \n\nWhat can i say about this place.  They have all you can eat Korean B.B.Q....  Their menu is small but the all you can eat has it's advantages.  \n\nThe service is good as long as they are not busy as they do in the weekends.  They are open till 5am, at least that's what they advertise.  \n\nI usually go there by myself and they have been very accomidating of my needs and I am greatful.  However when they get very busy they do not let any party less than 2 people come and eat which was a turn off for me.  Since i have been going there for years now.  and the last time they would not serve me.  oh! well...  that's the only reason they get only 3 stars from me.. otherwise they would have gotten 5 stars.  I can understand that's their business but the way they just brushed me off is unexcusable in my book.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2010-09-21", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "pfXgHbPpVXB23wlu__Uvfw", "review_id": "ucq9GobCas9c_VsyjNkKjw", "text": "Come here with an empty stomach because seriously.... you're going to need all that room for all that damn protein! Oh, and make sure to wear a shirt that you don't mind getting scented on with \"pork\" and various other meaty aromas.\n\nAYCE Korean BBQ. You know the drill, they bring out plates of raw meat and you cook it at your very own grill. Get the thin cut meats, they cook much faster! \n\nThe salad was pretty good and I helped myself to many seconds. \n\nThe service was mediocre. They seemed to be a bit short on the wait staff so we practically had to jump up and down to get more meat! \n\nOverall, a nice experience.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2010-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NIplwoHjKO4b_R8BBHkLfw", "review_id": "A1NXNhHHhTz9jhDcY2hP8w", "text": "(gonna say this yet again) LA has definitely set my par for kbbq. tofu hut is one of those places i like to go when im reeeeeeeeeally craving it. \n\ni like this place more that sura because the meat is sliced to order. service isnt the best, but it'll do. as mentioned in some reviews, they seem to be short handed. although, we had one of the male servers wait on our group table of about 8 of us, and we have excellent service! \n\nthis was probably my first kbbq spot (actually, my 2nd. the 1st one i didnt like at all! must find out the name of that place!) in vegas. i asked them if they served rice paper, which to me, is essential for kbbq. it gives you that rice taste but doesnt fill you up as much. apparently, \"its an LA thing\"? but anyway, that definitely made me change the way i eat kbbq out here. meat, salad and sides!\n\nthey've very good about the sides you get, as well as when i request bean paste and garlic (two other necessities when i eat kbbq). \n\nalthough it doesnt compare to my new favorite spot in LA, o dae san, it definitely fills that kbbq void that i get every once in awhile. definitely not expensive at all. normally order pork belly and ribeye (wasnt a fan of the marinated one). they do have other meats which i am just not a fan of in general. \n\nthank you, tofu hut, for filling my kbbq void in LV!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2010-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IgXUM_WyCgqyzA01mN5HKg", "review_id": "CZmjnk69F-DncIXQykeYxA", "text": "Service here is horrible!  They always seem to forget that were there. And there's always an Asian guy here who gives attitude as he's serving us.  Maybe because we always get all you can eat KBBQ and we can eat like bottomless pits.\n\nAs me and my friends quickly eat the first serving of brisket, we ask for another, we notice something different, turns out they gave us beef tongue instead.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2010-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ioVObQy5ObZXsp-2nElv2w", "review_id": "zdXBvF6z_h7sAANPhWBsMg", "text": "surly attitude, inept service of decent food, but all is spoiled by the incompetence of staff. our second order of hot saki came out as something totally different from initial serving, turned out to be sweet saki which would gag a maggot. no checking back during meal, which would have been nice, since rice was forgotten! final straw was when bill was obviously wrong, as individual items did not add to total. excuse was that a service charge had been added - without notice of any kind, of course. an ultimate rip-off joint! avoid like the plague as there are so many other venues in the area which appreciate their customers and are gracious.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2010-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "NVzfe0X8IAJMISy0Id4kKg", "review_id": "qhP2JnZ8aWPCXFTsS-3lBw", "text": "Compared to most KBBQs here in town, the variety and setting does it for me at Tofu Hut. I stumbled on it after a get together with some friends after our first semester of radiology school ended. It was my first KBBQ outside of California and after trying the others like Woo Ché, Korean Garden and Kimchi Korean BBQ on the strip, Tofu Hut satisfies my palette and leaves me with a pleasurable stomach ache (from being soo full)! ;). Each and everytime I've come to this place, I'm with a huge group. Now, this place isn't super big but the staff, especially Rachel, is very accommodating and helpful. I'm not talking about groups of 6 or 8-- I mean groups of 12 and 15!  If you've been there already, you know what I mean.\n\nMost of the time, we visit this haven of BBQ late at night and go for the 13.99 special of AYCE. Aside from AYCE, they do have an ala cartè menu as well. Their side dishes and salad are a bonus to the festive and colorful flavor of Korean cuisine.  My favorite is the pancake.  The pancake is a mix of vegetables fried with batter usually served warm.  The starchy texture brings more of a soft and chewy feel to the crunchy bunch of little appetizers they bring to you.  If you come a little earlier in the evening, you can order steamed egg that I like to mix my rice with! A twist for the Asian folks or anyone who likes fried rice. What can I say? I work with what I got to make it the best! Haha! And now for the meat:\n\nBrisket-- It's the most popular choice from the AYCE menu! The thin slices are easy and quick to cook and serve. They seem to burn really quick if you leave them on the grill for a minute longer as soon as they're browned.  Add a bit of soy sauce or lemon while it's on the grill for extra flavor! ;)\n\nRibeye (bulgogi) -- The meatier of the meats!  My personal favorite from the meat department.  The ribeye is very tender and takes a bit longer to cook. The flavor is exceptional and I suggest adding a bit more to the \nmajority of your choice of meat.  You can also order some garlic slices on the side that you can brown on the edges of grill! BOMB!\n\nMarinated Chicken-- My least favorite. It takes a while to cook and you can't eat chicken when it looks like a vampire bit into it's neck. Unlike the red mea of the meat family, the chicken isn't as flavorful but if you like chicken with a bit of a spice to it, take the patience to cook it off to the side and get back to it when you can because it does have kick!\n\nBeef tongue-- I was very skeptical about this one at first but after taking a chance to try it, it's really flavorful. It looks like the brisket so if you are only comfortable with having your own tongue in your mouth, ask your friends what's what before you start shoveling it into your face! ;). Burns quick, so pull it off the grill fast and enjoy!\n\nSquid-- you have to be with someone who knows how to cook this right. if you aren't and you decide to be Mr. Iron Chef, just know that if you over cook it, you'll feel like Fido at home chewing on rubber! Add some vinegar and hot sauce with some garlic chips and you're set!\n\nPork belly-- Looks like a big slab of bacon and it tastes pretty much the same. I like to cook this one extra crispy like I do my bacon! Add some sesame oil (the stuff in the tiny dish with salt in it) for extra MM MM flavor!\n\nNote: If you aren't a radish fan, don't eat the square vegetable in the reddish sauce, that's called daikon. But I always suggest trying everything once. Other yelpers will appreciate you taking one for the team! Oh, and if you decide to take your date here, give them a courtesy reminder that whichever car you decide to take will smell like BBQ for a few days! Hahaha ;) Happy eating!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2010-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8sTGEonsjyL23rrVI9kUhg", "review_id": "8bUw00p2lbaNlv1lmFZ9LA", "text": "I like this restaurant.  The Spicy Tofu soup is amazing, I haven't been able to find better in town. \nI always go for lunch as I think it is a little pricey, and the service isnt the best.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2010-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "czWwoB_mL22IXf110_oEOg", "review_id": "huYfpAR1G9Tp2joJg4Sg2w", "text": "This place is really good, they're open very late.. the BBQ is excellent.\nif you go late, it get's cheaper..\nmy wife always orders this tofu soup thing, not my favorite but she seems to love it..", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2010-11-04", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "Kj0CdQuSneqnroybaC1sOg", "review_id": "F0mH1lsdG27PscExxExW-w", "text": "Ahh.. Tofu Hut. \n\nThis place most often comes to mind when finished drinking and partying on the strip, mainly XS, Tryst or Surrender nightclub, since it's right down the street. That being said, my most recent visits here have only been during these late night hours (open until 3am), so my review is based among these parameters. \n\nWith a name like Tofu Hut, you would imagine that this place would be a vegetarians' Shangri-la. Well, it used to be when it first opened about 5 or 6 years ago, serving mainly piping hot, Korean spicy tofu dishes. It seems now as their main focus has shifted towards catering towards the AYCE crowd, as 9 out of 10 times, diners are grilling meat on the table. This doesn't bother me much, as I'm an avid carnivore, but I understand how it can bother some. \n\nThe AYCE pricing during it's special hours is set at about $13.99 per person, but excludes certain items such as Kalbi and certain side dishes, which are available at an increased $16.99. The banchan (side dishes), are of your average bunch and are of average quality. The meats are also of average quality. My only gripe of this place is their kimchi is of the \"just-made\" type, as I prefer my kimchi aged and sour. They do still serve their full-menu at night, and the spicy tofu soups never fail, neither does the charred rice bowl at the end (Noo-roong-jee).\n\nThe service can be hit or miss sometimes, depending on when you go. Usually, if you're there after midnight, there is only one server working, so if there are several tables being serviced, it is a tad frustrating to wave them down if you're in need of something. \n\nRegardless, Tofu Hut is a good place to go if you're in the mood for some tofu soups, crave Korean at wee hours in the morning, or if you want to fill-up on Korean BBQ for a very reasonable price.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2010-11-07", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 4}, "user_id": "ifFTbGgwjXALO1PgMHzrTQ", "review_id": "Cx9_C6yiu1RJaz1WE0sHaA", "text": "I've been eating too much lately. Way too much. So what do I do when I get a text invite to do Tofu Hut AYCE at 11:30pm?\n\nIt was my first time there. I really didn't know about it. At $13.99, this place kills the $26 table-grilled item I ordered at Pho So 1 just a few nights ago. (Then again, you're probably supposed to share that one). For $13.99, you get to choose from everything but the last two items (short ribs and steamed egg); those are available at the $16.99 AYCE price, but we were happy with sticking to $13.99.\n\nWe started with Sliced Ribeye, Brisket, and Beef Tongue. The ribeye was the most flavorful, but I have a soft spot for beef tongue, nay, I freakin' heart beef tongue! The brisket was OK. We liked the ribeye so much, we ordered another plate. I also added Tripe Honeycomb to the mix. I love tripe too. It had a nice spice to it and charring it on the grill added nice flavor.\n\nOn our final round, we went with the Squid and Marinated Pork Belly. The squid was OK, but not a lot of flavor. The pork belly had good spice and went well with the steamed rice I had left (I wasn't eating much of it up to this point). Speaking of steamed rice, they bring out a plethora of side dishes to go with the meats - Kimchi, Pickled Cucumber, Pickled Radish, and other stuff I can't name. Everything that hit the table was delicious.\n\nOh yeah. My friend wanted to order OB, but they were out, so we settled for Hite. Not a bad beer, but nothing memorable.\n\nOverall, I have to give them four stars. Granted, it was my first time at any place that does that style of AYCE, but I fully enjoyed it. It was a fun time with some photographer friends that I hadn't seen in a while. Jason put it best when he said, \"I don't know if I needed the giant meat fest, but I sure enjoyed it.\" That's what she said?\n\nOne last thing: your clothes will definitely smell like food when you leave!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2010-11-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "6Zx0BbhtKl8sVE21uFOYyQ", "review_id": "SZpteMCyAbjfAqytYLZJYg", "text": "*sigh*\nI really don't like the service here.  I've been here twice and both times were horrible.  They usually take a long time, and you can just feel the unfriendliness.  \n\nThe food is ok.  They gave our brisket frozen once.  And one time, they gave the wrong meat.  We ate it anyway though.  Usually, I'll give a place slack for having good food.  This time, the food didn't make up for the service.  it was just ok to me.\n\nIf you're looking for a good AYCE KBBQ place, I suggest WooChe.  I'll only come back here if I'm having a late night craving.  They open late and the price is pretty good after 11.  Other than those reasons, I'd rather go elsewhere.  Lol.. ^_^", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2010-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p2ohQbKqTBPwIbNGHk81Tw", "review_id": "7HOnpnL5AxMe3GroeCJnJA", "text": "Tasty juicy meats and as much as you can eat.  At $17/person, it is a very good deal.  We had pork belly, short rib, brisket and marinated chicken thigh.  Service was friendly, but on the slow side.  I come here when I come to Vegas to visit.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-09-01", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "NOpZ-oyDbHXEqUh9Fno-fg", "review_id": "eiRWd3mYb3Lvl2RP1-jZaA", "text": "I love the food at this place but the service definitely sucks! We got here before a large group came in. We got seated, but the server took orders from the larger group first. Come on, we got here first. We waited for another 10 mins but still nobody came to us. We don't even have anything on our table. The other server didn't even care, he started to clean the other table. We got pissed because we are so hungry and we didn't even got serve at all. We finally left. Now, I don't know if I will come back at this place. But If I do, I want better service.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2011-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "stCLuJHy69Dj1TSEsz3XKQ", "review_id": "w-5JfzpQ8BL7e51iaXaDHg", "text": "Empty your stomachs, ladies and gents, because you'd want to fill up on as much as you can in this generously tasty ALL-YOU-CAN-EAT (and die in a food coma) BUFFET!\n\nIf you love Korean food, you'll love this establishment even more. Pay a small price for a huge meal. OK so I know I am petite but I will devour a whole cow if the flavor is on point. And it felt like I did at my last visit at Tofu Hut. Alongside the Korean BBQ Short Ribs (Gal-Bi), I also had their soup and their steamed egg -- a MUST have. The server will give you the \"All You Can Eat\" menu and there are a slew of things you can order from and they do not skimp out on ya. Ahh I love my meat, who doesn't? (except for those vegetarians and vegans)...\n\nI am usually slightly picky on the ambiance and decor on the establishment (especially their restrooms) but you will overlook all of that once you grill the variety of meat and it will magically manifest into this heavenly, beefy aroma. It's like you're your own chef! As many Korean restaurants, they will also bring out the traditional little side dishes. You ought to try (and load up on) the salad as this is part of their side dishes too! Their dressing is a bit spicy but oh-so-flavorful. And going back on the decor, not that it was a dirty and ugly place, I would just recommend it to be more modern and more aesthetically pleasing to the eye since it is Vegas after all. Updating your look and adding another restroom wouldn't hurt in my opinion. :)\n\nAnyway, I am salivating as I am reminiscing and writing this review...so remember empty your stomachs (not your pockets) and your taste buds will be forever grateful as you enter and leave this restaurant!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E0pX1m97QSVgxLWTbUTnBA", "review_id": "jhBCyngTIO_Jsdhs4Cb12g", "text": "$14.99 ALL YOU CAN EAT KBBQ and I'm a semi - Vegetarian..   So I had the Vegetable Tofu Soup. Extra SPICY!\n\nSoup base and spice level is perfect! A bit spicy but they don't make it spicier by adding Chopped Jalepenos like some other tofu houses.   It's Bold and has a great kick.  The sides were great too, kimchi had a sweet tang to it, this pancake thing is tasty with the dipping sauce.  Food is a 4 to 5 rating.\n\nI seldom give a 5 rating even if the food is really good.  The service has to compliment the whole experience.\n\nThis guy seems like a manager or owner, but he is like a 1 man team. Does the seating, register, serving and all that.  He left a water pitcher at our table because we were 5 hungry and thirsty people. He always came and topped off our water anyways.  Came  by multiple times to ask if we needed more KBBQ and my friends were sooo stuffed. I was very happy with my tofu soup.  And this guy even came out and asked if I wanted the soup base cooked a different way to omit the beef broth.  As he probably assumed im a full vegetarian, but I said no it's ok, just make it the standard way and I really appreciated him taking the extra mile to make sure food is up to par for the customer.\n\n\nWill be back soon with all my so cal friends since they all like KBBQ!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2011-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZO2KKVs4S2TPX31ey3RWhw", "review_id": "9Jcv6HKWcY1BIaTOsQmugg", "text": "Everytime I go to this place, I come hungry and leave happy. Not only is it the cheapest AYCE KBBQ that I know of in town, it also boasts of great quality meat (90% of the time).\n\nMy girlfriend and I get the following each time we go to this place:\n1. Ribeye\n2. Brisket\n3. Pork belly\n4. Short ribs*\n5. Steamed egg*\n\n*We only get these if we go before 11pm, since they charge you 16.99 instead of 13.99 if you get these items after 11pm.\n\nThe meats are almost always fresh, the brisket always has that bright red color, and of course it tastes great!\n\nOne thing that really made me a fan of this place was when we ate here one afternoon, the server actually taught us the correct order of cooking the meats. She said that you cook the non-marinated meats first before you cook the marinated ones. Being non-Korean, that was a very useful piece of information that she gave us, and it changed the way we ate KBBQ since then.\n\nThe thing I really don't like about this place is that it gets really packed during the weekends. They only have so many tables for AYCE BBQ, so the wait can be very long and gruesome (especially since you have to come hungry or else your dinner won't be worth the price). On our last visit here, they told us there was at least an hour wait, even though the two long tables were open, because they had a party of 20 coming in. We were starving, so we decided to get out of there and try out the neighboring KBBQ place. *Disappointed at Tofu Hut*\n\nAnother thing that I'm not a fan of is the service when it gets really busy. A few times, I had to practically hold my glass up in the air just so I could get a drink refill. They rarely ever come to check on you unless you signal them to do so, which makes it so hard to order the great meats and banchan that they offer. Speaking of banchan, their fishcakes and pancakes are soooo yummy. They're the best I've had anywhere.\n\nOverall, I've been to this place enough times for Yelp to call me a regular, so I must really like, maybe even love the place.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lH-E2EuvEHi6TWNEYG4veg", "review_id": "HI4zfjvGVXDw0vO1cNYD5A", "text": "Go in hungry, leave unbuttoning your belt. All the meat is good , but the short ribs r ridiculous!! Add  the 15$ price and its the best deal in town !!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "EM2_KriAT5eV4CVS37N0bQ", "review_id": "-yRdmbLiC0cXJ474a1fXXA", "text": "My favorite place to go to whenever I'm craving alot of protein. The mamasan there is really nice n helpful when the comes to cooking it yourself. The pork belly is a must, and I love that they give all those sides. I admit...i go there at least once every two weeks. I hope they never leave.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2011-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-7ovGk7674qWAtmdwqHoIQ", "review_id": "t0SDloBuUxj47zmfOotYZw", "text": "This place satisfies my appetite every time I eat there with my friends. The brisket.... AMAAAAAAAZING! Their salad is AMAAAAZING as well. \n\nSome of their staff needs some better customer service training. I understand it gets hectic and busy, but that doesn't mean treat your customers like nothing.\n\nAnyway, one night, me and my friends decided to go eat some tofu hut. The guy that was seating people told us,\"Sorry there are no seats\".. alright.. cool.. we dont mind waiting.. so we asked the guy how long the wait is. He responds in a tone where it sounded like he didnt want us eating there at all. He replied with, \"I dont knowwww.. uhhhh.. could be 2 hours .. i dont know i dont know\"...\n\nYeah, we were pretty pissed off, but ended up eating anyways. And guess what? It WASN'T a 2 hour wait. Other than that, I enjoyed my meal.\n\nOverall, food is great.. and service could be a bit more friendlier.\nMinus one star for the customer service....", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-10-31", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "8JC-Yb3UDUv2FUl5ym1nVg", "review_id": "HAdrkjJbQecNlx38eHTKog", "text": "AYCE Korean BBQ, and it's open til 4AM? Sign my hungry face up. \n\nThis review is summarized in 10 tips.\n\n1. If you are making a post-club visit, be smart like me, and leave your club clothes in the car. Come in with just a t-shirt and pants. Your clothes will smell like Seoul when you are done.\n2. Bring your hunger. Drunk. Sober. High. Low. Whatever. \n3. Order the salad with your banchan (side dishes for you amateurs).\n4. This place is the epitome of an ethnic restaurant. It's not fancy, it's not pretty. Leave your pretentious bitchy friends outside. In the cold, winter weather. Or in the hot, hot heat. Make them more miserable. :D\n5. Marinated pork belly, beef tongue, brisket are excellent choices.\n6. Get rice.\n7. It makes sense to order some Hite (Korean Beer)\n8. It's all you can eat, so don't be shy. Have no shame in your food game (I stole that from my friend Kurdy S.)\n9. The grill is at your table, so you grill it yourself. You run the show!\n10. Don't plan on doing anything after this meal because you will be so full!\n\nI love this place!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5HiyH0ZWaWOsTo7J-DNAlQ", "review_id": "gDMygOJ_tfC3WwDHMhShqg", "text": "Cheap and good. Love the bulgogi combo with tofu soup. Nice variety of ban chan. If you do the grill, the meat as well as the salad are my fav. Nice service too. Don't dress nice here cuz the smell's gonna ruin ur clothes.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sXhy3NgNOlu7UXg1dbcefA", "review_id": "GfFNRSWzPezST5qUkoBuXA", "text": "We have been here couple times already but never got around to writing a review until now. Anyhoo, my husband & my son loves this place.  Cheap AYCE korean bbq with quality meat. The flavor is great. We specially like the ribeye, short ribs and the brisket. My son loves the steamed egg. I did not like the squid and the chicken. The sides are good as well specially the long noodles. One thing I did not like is the long wait. It gets really crowded on their bbq area. I wish they turn the other dining area into bbq area as well.  Also, when they get busy...you will wait for your meat to come. Couple times the servers forgot about our meat coz they were too busy and not enough servers. It is still one of our fave korean bbq! Love this place!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "jINbhO0tD7505n_FxmOnhQ", "review_id": "mlj_R6N3tp94F_WNOIAj4g", "text": "I forgot that Mr. Tofu was closed on Sundays and my sundubu craving had to be pacified so we made our way across the street to Tofu Hut.  Half of the restaurant have stovetop tables reserved for patrons having the AYCE korean barbecue, while the other half of the restaurant has tables for the tofu eating patrons.  Although the bbq smelled enticing, I was there for one reason and one reason only: sundubu. \n\nI ordered my go-to: the mushroom sundubu.  The menu described it as having 3 different kinds of mushrooms, but I can guarantee that I only saw 1 type in there.  The enoki and the oyster mushrooms were no where to be seen.  And on top of that I ordered \"medium\" spice level, and there was no heat at all.  Nor was there any flavor.  I poured the entire kimchee side dish and some bulgogi into the soup in order to create an edible bowl.  Only after those measures, did I start to enjoy my sundubu.  However, it wasn't my original order.  \n\nMy husband seemed to enjoy his kimchi sundubu, but the \"spicy\" level, tasted more \"medium\".  So be warned, that you may have to order a higher spice level just to get some heat.  The bulgogi was very flavorful, and the banchan was not my favorite. My kids, however, devoured the korean pancakes, although they are a lot thicker than I am used to.  \n\nAnd I don't understand why almost every korean restaurant that we dine at, there is only one server.  Poor guy is running around like a chicken with his head cut off.  He was trying his best to meet everyone's needs, but we had to wait a while for extra napkins, extra chopsticks after my son threw them on the floor, and water refills. And then we waited a while to pay our bill.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2012-09-10", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "ow-KMup0Nnu7ZuB1ibCLkw", "review_id": "Gf_nkU5ov4E42eKMpdKx2w", "text": "**Summary**\n       - Korean BBQ - This review is on the Korean BBQ part of Tofu Hut where you get to cook your own meats and eat them.\n       - Minimum 2 - To get the AYCE, you have to have at least 2 people getting it.\n       - Quality - The quality fluctuates. When it's good, it's great. When it's not, it's not you get small pieces that look less than fresh. However, I've never gotten sick yet (cross fingers).\n       - Price - They're quite a bit cheaper than your average Korean BBQ place.\n**Price**\n       - $13.99 AYCE Lunch (Short ribs & Steamed Egg excluded)\n       - $16.99 AYCE Dinner\n**Ordered**\n       - Marinated Sliced Rib eye\n       - Brisket\n       - Beef Tongue\n       - Short Ribs\n       - Steamed Egg\n**Notes**\n       - Korean salad and side dishes are provided at the beginning of the meal.\n       - The rib eye and short ribs come marinated. They're quite flavorful, but I like to eat them alongside un-marinated meat.\n       - The brisket and beef tongue are un-marinated and you usually dip them in this sesame oil/salt concoction. If it tastes too plain and they didn't put enough salt, you can ask for more.\n       - The steamed egg, Korean salad, and side dishes make a nice non-meat compliment to the rest of the food.\n       - Sometimes the heat from the grill leans to one side of the table. If you're with one other person, then both of you can move to one side. If you have more, than someone's just screwed.\n**Recommendations**\n       - I'd recommend this place if you're looking for a cheap Korean BBQ place or feel like rolling the dice. Their quality fluctuates so it's a gamble. At their best, it's better than the other Korean BBQ places.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2012-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jrrglP13EWwd9Dr9_gfZDA", "review_id": "Waptwj5skSqIVpI_KbWGNA", "text": "A small Korean-owned restaurant that is very well priced and offers good standard food. I ordered the beef-kimchi-tofu soup and it was definitely worth the price (9$). The service was very quick, there was Korean t.v. own to add to the authentic vibe. I am going to have to go back to try the All-you-can-eat.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J-Y5Un73DpZbSFMEykmnHw", "review_id": "JlK5_OEpH5o0n9viuwzQJQ", "text": "First of, the food is delicious. I recommend the bulgogi. I can eat and bbq at my leisure with the all you can eat. Despite that it's busy anytime, it's understaffed with two waiters running around like crazy, taking care of 7 BBQ tables and another (maybe) 7 tables.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Z6mx5OClrvg_C0xBW34kxA", "review_id": "dxiFB8g1m8RteCBAKGObEA", "text": "So I've been back here a few times since my initial review and I've decidedly like it better now than before. The service isn't perfect all the time, but I've been pretty satisfied recently. Of course, their salad is a plus. I ADORE THAT SALAD. I still need to get an order of it to-go. It's amazing. My favorite salad of all time :D.\n\nI don't usually come here unless it's for the late night $13.99 special. I'm not much of a bulgogi person so I always get just pork belly and tripe. Tripe isn't everyone's thing but it's definitely MY thing. I'll eat brisket if ordered but I don't really care for it. It's not like I can eat that much in one sitting so just pork belly & tripe will do for me.\n\nCome with a few friends so that you get a variety if you wanna try everything (in case you're not a big eater).\n\nThey'll do split checks, no problem. No troubles there so far. The bill also adds tax in it so it's a nice surprise. \n\nThis is definitely one of my to-go place for KBBQ. And their side dishes aren't too bad. Love the pancake one. :0D", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2012-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1aNyBVJe2hNSXrVY5zsR1Q", "review_id": "RcovmMi5sv7movkCg-Wi7A", "text": "I would only come here for the AYCE bbq.  I usually go after 10 for the 13.99 deal.  It's normally 16.99.  They have a lot of different meats, but my personal favorites are brisket, beef tongue, and pork belly.  My friends like the bulgogi.  I forgot what the term was.  They have really good salad that I adore.  I also love the different side dishes that they have.  You can also order the soup. It's really good.  \n\nI also like the steamed egg and short ribs, but they only serve those for 16.99.  The customer service is really good. They are always on top of making sure people have water.\n\nThey also have a non-Korean bbq side which serves meat items, bibimpap, and soondubu which is tofu soup.  I would not come here for the tofu soup because the soup has too much spicy pepper taste and doesn't really have a good soup base.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nn3iA6eL8yK59udW4tGVsQ", "review_id": "LNl2xPC0X6PlK3Unfwq7UA", "text": "I usually come here once every month. Service is hit or miss. Food is good, we always get the ayce (pork belly, squid, beef tongue) their side dishes are ok, i've have better kimchee. The only thing that keeps me coming back is the price.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-09-17", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 3}, "user_id": "8Shq04iyq7kFsa7PTzqj_A", "review_id": "vaYzd0IurVS75BTHLTNisg", "text": "Drinking all day and all night really calls for something that isn't buffet food.  Don't get me wrong, I love my AYCE, however, a tummy full of alcohol doesn't sit well with a tummy full of food that is mass produced such as buffet food usually is.\n\nOur cravings led us to tofu soup, and a Yelp search led us to Tofu Hut (in all honesty, we wanted to go to another place close by, but it's closed on Sundays).  Not going to lie, we were a bit weary of this place.  Knowing this place was an AYCE BBQ, we were a bit worried we'd come out smelling like BBQ, which would require more preparation for that night's festivities (a quick shower to wash away the BBQ smell).  Thankfully, they actually separate their BBQ side from the tofu side.  We were able to stay well away from the wafts of BBQ smells floating in the air.\n\nThe tofu soup was good, although, I should have probably not been so chicken and actually gotten at least medium instead of being a wuss and getting mild.  The spiciness would have definitely added more flavor and kick to the soup.  Not to say it wasn't good, it was.  I had the Beef and Seafood Soup, which made for a great blend of flavors.  It was also good know they didn't skimp on the fillings.  Had plenty of beef and seafood, as well as, of course, tofu.\n\nFour stars, because it was a hot day in Vegas that day, and I was downing my glass of water like a beast.  After I flagged them down the first time for a refill, they definitely kept my glass full the rest of the meal.  Major plus points!!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-09-17", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "yb-84fk0Li-GNn4ofTqDDQ", "review_id": "LstWkwKBAuKxGUlzm4GOdQ", "text": "WORST Korean Tofu soup place EVER!  Its pretty hard to have a bad tofu soup, i mean most of the time, the general tofu palces are just average, not too good but not too bad, its something you can tolerate. but man, this place has the worst EVER, how do you mess up on tofu soup? AND you are called Tofu HUT?!!?!?\n\nI stumbled across this place because my usual resturant, Mr.Tofu, was closed already, i was really in the mood for tofu and notice that accorss the street was Tofu Hut. So i thought hey, perfect! WHAT A MISTAKE!!!\n\nI think the only reason people come here is for the BBQ and because it opens late.\n\nThere is no way people come here to have the tofu soup, its so tasteless and suprisingly DRY...\n\nDo not recommand, stay way, go accross the street to Mr. Tofu! you won't regret it!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2012-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bKVzfJHS2EYSicm3ECHRWA", "review_id": "H3jQA4YZqsHn_N2QFB5F3g", "text": "I love this place with all my heart. I love this place", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2012-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "EJLXnp1ehDzu8togKhSZGA", "review_id": "iVytjSz0-tygjWPWybx55g", "text": "AYCE specials after 10pm.  Service  bringing the meat and salad is quick. We had a large party and we only waited a few minutes to be seated.  Small restaurant, not greatest for decor, it is a yakaniku.  If you want tea or coffee you have to have coins to buy it from the dispenser machine! I will be back, after 10... Lol", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "OldskeQ-d3sonyBvgqP5fQ", "review_id": "6HLJPlLFJrLIxjIOy_ZE0w", "text": "Good AYCE Korean BBQ for a great price.  For only $16.99, it is a good deal compared to Sura.  I have never had a steamed egg before, but I loved it.  The only problem was the service.  There was only one other table of guests there, so I guess it was dinner time for the employees.  They were busy eating and we were neglected.  The server was nice, but she needed to be around a few more times.  I will try again and hope the service is better next time.  If not, I'll really rip them a new ass on my next review...", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "38JK-SfO9NkAGs1RwlH2Gw", "review_id": "VBA9VzEsPHNSennhobwa-A", "text": "We usually choose to cook on the grill in this Korean restaurant, but decided to try a few kitchen prepared entrees for a change of pace.  Orders of spicy chicken with mushrooms and onions on a hot platter and shrimp & scallops barbecue with Italian squash, mushrooms, green beans and onions served in a pan were shared.  We also received white rice plus 6 banyans (side dishes) - kimchi, scallion pancake, cucumber salad, fish cake made with cod, and rice noodles. Everything sans the fish cake was delicious.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HvCtDYDlLDdfSOBKj354Qw", "review_id": "bRIBl4qq5O-IE5j7qtaVAg", "text": "Great food for a cheap price. Don't pay more at other places for lower quality.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rprUFN9Qnx5hC8Gs1-JIyQ", "review_id": "T83216Ul8eoECNofEWPKQA", "text": "I've been going to Tofu Hut since my high school years and I've always had such mixed feelings about this place. There are times when my friends and I loved this place and would have a fantastic time, but sometimes we've gotten such terrible service that one of us actually stood up and left. The food, for me, was always good. I actually never tried ayce korean bbq until recently--which I enjoyed very much. For $13.99 (lunch price) I got beef tongue and pork belly; and I also shared brisket and sliced bbq with my friend.  They came in huge servings, which made it difficult for two girls to finish all that meat haha. Banchan's were standard. I've always like fish cake, so that was my favorite out of the rest. Sundobu, or however you spell it, was also okay. Their customer service is so bipolar that sometimes, even though I will be craving to go back to this place from time to time, that I would just avoid Tofu Hut all together. I think ever since I've graduated from high school, I would only go here once a year. Which is sad since the food CAN be worth the trip. Bad service included: wait staff showing attitude; wait staff seems to be non existent for quite a while during our visit; complained about splitting the check; forgetting orders and kept reminding of order; had trouble asking for refills; and last, was that they kept giving my party dirty looks because we stayed there for hours (even though we'd still order some food). This place just needs to be consistent in service and food, and I'm sure this will become a new-found favorite of my friends and I to eat at.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2012-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VDdBBtpz0m71QDPg-mATpA", "review_id": "Q1pEu1vBJg3uOdWdTff-hg", "text": "$16.99 for all you can eat Korean buffet with the normal a-okay AYCE service. \n\nIt comes with steamed egg, bean soup, and plenty of banchan. The best part... everything I listed is unlimited and a part of the AYCE! This is a must-try for a Korean AYCE restaurant!\n\nWe usually order plenty of brisket, squid, and short ribs (better than the marinated ribeye-bulgogi).\n\nPlease cook brisket first, while you have squid cooking in the corner. Then cool any and all marinated fold separately. The pork and chicken will take a while, so put it aside while you cool the marinated beef dishes!\n\nP.S. Fishcakes and kimchi!!!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "XUuugPgaTWn3_zreYjK2Dg", "review_id": "_OpXk06i9X2CHhMMC6WHtw", "text": "One of the more popular, long standing KBBQ places in town, located fairly close to central Chinatown. They have the option of doing al carte or all you can eat KBBQ. \n\nThe AYCE KBBQ is i believe 13.99 (after 10pm) or 17.99 originally (or if its after 10pm, the 17.99 price gives you the option to order steamed egg and kalbi). \"Limited\" selection of meats (brisket, beef tongue, tripe, pork belly, kalbi, bulgolgi) and its not a buffet style type where you get your own stuff. The waiters will get everything for you. AYCE includes the typical side dishes you get at normal korean restaurants. Lately i havent been much of a marinated meats person, so if i go with my friend, our grill stays perfectly clean. All we order is brisket and beef tongue. Both not marinated, straight up sliced meat. Usually mainly the marinating sauces is what causes the burning and dirtying up of the grill. Rice and salad is included. \n\nThe al carte menu is not bad. I havent ordered anything other than the tofu soup or the tofu soup and bibimbap combo. Tofu soup is priced at i believe a little over $8 each. You get the normal side dishes, the tofu soup of your choice, and rice. The tofu soup and bibimbap combo, to me and a few friends, are a pretty good deal. The bibimbap is a typical korean dish with a lot of cut veggies and beef, served on top of rice, and given their gochujang? sauce (spicy sauce) for you to mix everything with. The tofu soup that it is combo'ed with is a mushroom tofu soup. Still good. Definitely fills you up. Price for the combination is i think only like $10. So not much more. Good deal. \n\nLove coming here for tofu soup or KBBQ if its late at night and SUPER hungry. In a lot of cases, its quite full but ive never had to wait that long, if any.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-11-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "iRg71EvOjegzZkGgJUfW4w", "review_id": "cytvhXjMqafmqeQ98keFpw", "text": "Friendly servers (well at least the same guy I see every time - he's witty too!) and super cheap AYCE kbbq.  I always wonder how these people make money. Although Tofu Hut isn't the cheapest place around Vegas, I think it's most worth the price if you take into account the variety and quality. I always get the pork belly and marinated sliced pork belly (a must-have wherever I go) and share everything else. I love the oh-so healthy idea of dipping already-oily meat into oil and salt. I also love that they have good beef tongue and tripe, which I have recently taken a liking to. The bean paste soup and egg are pretty good as well.\n\nAnd the best part of AYCE at Tofu Hut? DAT SALAD.\n\nBy the way, this is solely a review for the kbbq. I came here for tofu soup (soon dubu) one time and it was meh. That was before I discovered they had AYCE. My life has changed irreversibly since that very moment.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2012-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "T_SR4nmgB6NMWJrjwopTyQ", "review_id": "9Uq4YLBX5MKWatiD9Z_IKg", "text": "I believe I come here mostly for Korean BBQ, at least out of all the other places, I've been pretty frequent here. The staff are very friendly, I like the one guy (I need to find out his name) who always tells jokes, he's the friendliest of them all. \n\nThe prices here are pretty decent, which is probably why they're pretty popular for AYCE KBBQ. $16.99 normally with a late night special of $13.99, but the late night special price doesn't include steamed egg or kalbi, if you want either of those you'll have to pay the regular price. \n\nThey bring out the meats as you order and you can only order a max of 3 items per table. Which they have a limited selection of meats, brisket, beef tongue, tripe, pork belly, kalbi, bulgogi, spicy chicken, and a few others. They pick and cut the meats how they want to and bring it out, sometimes I've noticed as I order the same dish, usually brisket and beef tongue, the sizes either get smaller and smaller or the quality of the meat decreases as well. \n\nRice and salad are included, but I usually wouldn't recommend the rice unless you're getting marinated meat, because you'll fill up on it and eat less meat. =] \n\nThey have an al la carte menu which is decent, I usually get it if I'm going in for lunch or late night and just want some tofu soup. They have a variety of tofu soup all at the same priced, slightly more than $8 each. It's a good deal, you also get rice with it. Just don't dump all the rice in at once, otherwise the soup will disappear very quickly!  Oh also, they put the egg in right when they bring it to the table. \n\nI've gotten the spicy chicken and bulgogi from the al la carte menu, don't really remember the pricing, but it wasn't too bad. A friend liked the al la carte menu better because it's cooked on a stove top so the meats retain more of their juices and she found it more flavorful. \n\nEverything you order comes with some side dishes, which include kimchi, seaweed, this type of fish thing (sorry I forgot the name), korean panakes, jap che, and a few others.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YXVeyn2AFXIqiFP_YWUlfw", "review_id": "D8_C4CakLz4RHI2ieDjw9Q", "text": "This is 1 place I actually like even though yelp only has 3 and a half stars for it. This is a Korean BBQ spot to hit up if your in Vegas. You can order by entree or if your feeling adventurous you can cook your own meat. Like most people we want the food to arrive cooked. I ordered the bulgogi and short rib both dishes were amazing. Bulgogi is my favorite Korean dish. If you never had it, it's shredded like beef seasoned with Korean seasonings. Our entrees came with 5 or so side dishes like pickled tofu, beansprouts, kimchee and other goodies.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vtsZXQ93cizEeEdwYIzMFg", "review_id": "E4gVQMsFZ2zeJ2xmV1BIzQ", "text": "13.99 ayce. Or 16.99 if you want egg + short rib. I always order marinated pork and chicken grill them together, ask for jalepenos, onion and garlic to grill with it. The salad and kimchee I mix with the egg and rice and it's awesome. Great value and great food. It's always packed so expect a wait.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2013-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3fk-l4Ov3avXZfAXVdF1MQ", "review_id": "W61PwHkU8Ey--eUMCljMvQ", "text": "Well what can I say about this place.... Its not that bad. But not worth going again...\n\nThe food was alright but the service could be a lot better... At most kbbq joints, I never had to ask for a bowl of rice to go with the meat I cook. They did not replace the grill until we had to pull someone aside (which is hard to do) just to do it. Whenever my husband wanted to ask for something they walk by as if there were no hands raised over anything. Now I'm not going to pull out no race card (even though we were the only *cough* *black* people there in the entire restaurant) but everyone else seemed to have been taken care of more than we were. (Sigh) it doesn't matter... I won't dwell on that.\n\nOverall, the food was good but it wasn't ALL THAT. Soju and beer was great! I would prefer to spend my money elsewhere for Kbbq... Or I wouldn't mind going again if they would have better service....", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2013-09-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "2og8bPmCjlj5RreNzRGL9A", "review_id": "Z5VYNelqyJWrtkTwlDwzDg", "text": "I've been here a couple times, especially during late hours when I want a bite to eat. I enjoy their beef tongue and their brisket. The service is okay, the workers can look a bit angry but I think that's just how they are. Other than that, the food is good and cheap. If you leave a lot of left overs, they can charge you a lot. So be careful and if you want just a little more, ask for only a little otherwise you won't be able to finish it all and be charged extra.\nIf you're planning to eat here after 10, expect to wait about half an hour for a seat because it gets pretty packed.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-09-21", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "N7wNlo3_EaHUWHiFDyGh5g", "review_id": "6cU5Benm2iTmtD3ZBj9NCA", "text": "Because my mom is an amazing cook and restauranteur, her food has become the very high benchmark to which I compare all Korean restaurants. That being said, there are no restaurants in this valley that surpass or even meet that level. However, when I do want Korean food and my mom isn't here, Tofu Hut is very comforting.\n\nWhat brings me here is their Soon Dubu Jjigae (soft tofu soup). The type of tofu that is used in this particular soup is difficult to purchase non-commercially, so soups made at home will not be able to mimic this silky offering. The flavors are so delicious and indescribable. You can also choose the type of soup you want like Kimchee or Seafood, changing the overall flavor of the dish. I always go with Pork because I think its flavor really transforms the broth to something amazing. The spice level can also be chosen (don't let the red color scare you, it's a non-spicy spice they use). The best part? It's around $10 for the meal! It comes with a bowl of rice and unlimited Pan Chan (side dishes).\n\nWhen I dine with certain people, I will also do the AYCE BBQ. It's not my favorite thing, but for $17, it's pretty awesome! My favorite cuts of meat to order are Beef Tongue, Brisket, and Marinated (Spicy) Pork. They give you the traditional sesame oil/salt mixture to dip your unseasoned meat in and a refreshing salad of cabbage and romaine lettuce. It's a modern twist on the traditional Korean dining method of wrapping the meat and rice in lettuce leaves called Sang Chu Ssam. I thought it was weird at first, but I've really grown to like it! Bonus: Soon Dubu Jjigae is only $5 with your AYCE meal! Score!!\n\nExpect a wait during busy times for AYCE since it's only available on one side of the restaurant. Fortunately, the longest I've waited was about 15-20 minutes.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7yomvbvjbkWEHsKdf_GjtA", "review_id": "U9392_WAmZdCVTtR4k_uZA", "text": "Looking for a late night spot to fill your craving for some kbbq? Look no further than Tofu hut. This is the go to place for kbbq for my group of friends and I.\n\n16.99 from opening till 10pm\n13.99 from 10pm to 3am \n\nThe food here is not bad, the meat, depending on which one you choose, is usually frozen unless it is marinated. The marinade they use is good but like any marinated kbbq causes the grill to toast over. The meat is fresh and is yummy when it's really late. Finally, the sides that come with the food are good. \n\nThe service is there is hit or miss. Some days it is really good and others it was a bit lackluster. This is understandable, people have their good days and their bad days. They are very quick in taking your order and brining your order out.\n\nOverall not a bad place to grab some late night kbbq, I know you can find me there after my work for some late night munchies.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "R3rxtRRHD28Y6lrDAP0ddQ", "review_id": "M4LeYWrSjCfKsvgYPXh26g", "text": "I'm a bit late with writing this review.  I was last there a few weeks ago, but I'm also a frequenter of this place. \n\nYou can simply not go wrong here.  Korean Short Ribs are one of my favorite things in the world and can eat them without getting full, but that's just me.\n\nIf I recall it's like $16.99 for all you can eat Short Ribs.  The ribs are soooo tasty, the service is great and all the accoutrement they bring with your meal are delicious!\n\nI also love that this place is open super late.  \n\nI've been to a few other Korean BBQ places in that area and they honestly didn't hold a candle it.  The only other ones I liked better were ones you had to pay a good $10 more for.\n\nSo again, for the price and quality you get here, you can't  go wrong at all.\n\nMy only tip to those who have never been to a Korean BBQ place before is to not wear clothes you plan to have on for the rest of the night.  Since you are cooking right in front you, you will smell like the fumes after.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j_hiAL6qQB932DFtZWP3rg", "review_id": "KPRyii618G94ft-aLHBb5A", "text": "Good Korean BBQ place. A bit less expensive than others... I like their sreamed egg, bigger serving. My family enjoys good eats, and they surely enjoyed this place...", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2013-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KwWdUGnosPyrtkHaIwgBMQ", "review_id": "BAkXtX2OAtLkNKsGIDHpMQ", "text": "Really nice people. Great service. After 10 pm, the cheapest and the best AYCE korean bbq I've ever had. This might be a really simple review, but it's just that good. Grab some soju and a couple bottles of Hite and it only makes the experience better. Thumbs up.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2013-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Vsjk2FzEOLo4A_wbzbP82Q", "review_id": "81Rsdxjsqj6ySWNbxLbrMQ", "text": "You can't beat the 13.99 price! The japchai is godly. Bean paste soup is delicious. The marinated rib eye, beef tongue, and pork belly is to die for. You will not regret coming to this meat paradise.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2013-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "2Z8sRKfFi6bx8LxCpwFbeQ", "review_id": "22sjamGO8EdCpX9vKTTpRg", "text": "Tofu Hut is really cheap and affordable for an AYCE DIY Korean BBQ. The food is high in quality and definitely tasty. I would recommend trying the steamed egg, short ribs, and most of all the briskets. I LOVE THE BRISKETS!! After 10pm, which is when happy hour begins, the line begins to build up. Tip: Go before 10pm.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2013-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "0XAe7pIKev2HLxskuWjLvQ", "review_id": "trAAEr1n9PTedZWhekS9Gw", "text": "I've come to tofu hut at least a handful of times and finally decided to write a review because I feel like it's such a hidden gem.\nJust on the outskirts of chinatown, tofu hut kind of sneaks up on you.  It's an all you can eat korean bbq for just around $17/person. Ladies, if you're entertaining your guy friends from out of town and don't want to spend a bunch of money going dutch take them here! \nThe short ribs and ribeye are outstanding and they serve all kinds of small plates (kim chi, potato cake, bean curd, seaweed, rice, and salad) with your meal.  I don't know what it is about the salad but it's delicious.  Overall, even if the meal was ten dollars more the quality is still excellent.\n\nThe only reason I can't give this place a fifth star is because service is never really that great.  Always just kind of so-so and seating is always a hassle.  Tip for first timers: try to wear something light that you can cover up later because of the heat and fumes from the grill since you are cooking right in front of you.\n\nI didn't know they were open late until reading others' reviews but know that I do I'll be stopping by more often!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0YK4IQaSF9bLjRSA6cLQWw", "review_id": "s150GHZ1bQUWg1BBdGdc-g", "text": "Don't waste your time at any other Korean BBQ. Best appetizers and the best price. Only thing that sucks is that you might have to wait for a BBQ table, but it's worth it!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2013-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UZtEzOs4nzyE-a998jpNFg", "review_id": "1txAlmfXtK5_aLKsM3Zbzg", "text": "Takes a long time to clean up table. But its understandable cos grill is hot n need cool down, i suppose. The price is really good but the meat, especially the short ribs are not tender. \nI would not be a regular here, just because the smell afterward in your clothes is horrific, we suppose plan go Hakasan  right after dinner. But once i get in the car, that BBQ smell is just a turn off. So word of advice is that make sure your next stop is shower lol.\n\nI wish there is a 3.5 start, because that is what it earned.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "K3m325UGdRN9BouZRk5nGg", "review_id": "bgpSRRtgN-pYPlv5kQTMlA", "text": "Everyweek my co workers and i always eat here sometimes twice a week or once. $15 All you can eat KBBQ where else can you find this? \n\nNo need to ask for refills our server does it automatically! GOODJOB!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2013-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VD4SSsRzAK52j5UHdYPE6w", "review_id": "CRnIACQOc2hNtMfsjnj01g", "text": "This place never disappoints. As frequent diners, the marinated ribeye is superb! We usually also get brisket and beef tongue. We shy away from the chicken thighs because it takes too long to cook and tends to be dry. The salad is incredible and so are all of the sides! The price after 10pm decreases to only 13.99$ for AYCE, which is a great price for how much you get. The only downside is they close at 3AM with a last call at 2, and there can be a wait on busy days since seating with grills are limited. But nonetheless, extremely recommended as our favorite Korean BBQ place in Vegas!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2013-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TLBcaQ48xDNw-rGXaTt_Bw", "review_id": "LwMFYo-1Pp1pkJgi_yOlyg", "text": "I love this place!! I just wish it was bigger or less busy so there wouldn't be a wait when I want to go.  Sometimes the wait is over 30 minutes and I just can't be hungry that long.  However, when we do eat here it's amazingggggggg! I LOVE the green salad they bring plus all the sides.  It is the best Korean bbq in town that I have tried!  Meats are delicious! All you can eat is fine, I like it for all the sides you get.  I don't have a need for all you can eat but it is a nice option.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "UufdWMdHBZxcTzEotBx6mg", "review_id": "QcV-M1bchwktICVSTG39uA", "text": "This place was good. It had a nice selection of meats. \n\nWe ordered the squid, tripe, Spicy pork belly, and beef tongue.\nWhen your order the squid you get the whole squid which is cool, The tripe also had beef intestines which were really good they cleaned the intestines pretty well because you don't get any of that strong flavor that you would normally get if someone didn't clean it out well. The beef tongue was very tender as for the pork belly, which i like a lot because it had a nice kick to it. Yum. I thought the side were good as well. You could as them for more without being charged extra. \n\nService was ok. But that is only because it was busy. i'm pretty sure if they weren't busy they service would have been a little bit better. But that's for any place.\n\nWhat i really love about this place is the quality of everything was really good for the price that the offered. Well worth it!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1aNyBVJe2hNSXrVY5zsR1Q", "review_id": "_sRVzcATxHhdDBBLd1Zk7A", "text": "I went to Tofu Hut the other night for the late night special. I got there around 10:00, and signed my name on the list. Boy was the wait long. We had to wait 30 minutes for a party of 3. Once we sat down, we ordered out food quickly.  Our food arrived pretty quickly because we were cooking it ourselves. We ordered my favorites which is beef tongue, brisket, pork belly, and sliced ribeye (my friend assumed ribeye was a good thing. She didn't know it was bulgolgi.) The beef tongue slices were pretty small, but everything else was delicious. We also ordered the soup which is a bean paste soup. Over the years, they have tried to reduce costs. They no longer include tofu in their soup. :( I love Korean bbq.  \n\nI love when my pork belly is crispy and I love to dip my meat in samjang which is a sauce you are able to ask them for as they don't automatically bring it out.  I love the salad that comes with it. It tastes awesome!\n\nService was a little lacking. They were super busy, which I can understand. $13.99 is a great deal for Korean bbq.  At first it didn't matter because we were just eating and enjoying our food. But eventually we did want our waters filled, and we did want squid.  They do have pretty awesome bancahn. I love the japchae and the fish cake. I prefer my kimchi to be riper. \n\nPretty good deal for $13.99. I think the tofu soup is horrible here. Go to Mr. Tofu for that. It's just across the street! For Korean bbq, this is a good deal!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2014-09-08", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "zrRllWRRPvMEzdbtBDCqhg", "review_id": "pZUFTrNohxNEfX3x-Rg8HA", "text": "I actually like it here despite the sometimes unfriendly staff, long waits and questionable cleanliness lol. I mean c'mon, you get what you pay for and so far this is the cheapest ayce Korean bbq I've been to that's open late. I think they have a lot of potential to be a really good restaurant but it doesn't seem to stop people from coming!\n\nI love the salad here! Wish I knew the recipe so I could just make it myself. I also love the beef tongue and brisket. The ban chan is good too. \n\nIt's a cheap choice for kbbq and an even better choice after a drunken night at the club-so win win.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2014-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "u_rtbgGqmu3vkmCi0AUZfw", "review_id": "miv8qCAOY2xsawHIJYMflw", "text": "Hooked on the short ribs. ....so tasty...and ban chan is yummy..wish they had meat jun. No need to order mandoo cause lots of ban chan. So far my second time here and the server was good.  Came after work at midnight and BBQ side was crowded.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2014-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bG3c8lkYIJxandUyfYxqgw", "review_id": "5EvdGxMRkiI38rcJjnc3cw", "text": "This place is great. It's always busy but they  don't have a reservation system and very few tables for the AYCE so you will have to wait for a while, but it's definitely worth it. They have the best marinated pork belly I've found so far. It's also very reasonably priced. Grill your hearts out.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lToI5oX7oe_FUV8cLESEPg", "review_id": "mZg_Un6cxIY1l0GmFBFOeA", "text": "Soon dubu was pretty good here.  Small place so if you don't do the all you can eat bbq, you get seated faster at the regular tables.  I also really liked the bibimbap here.  The pot was perfectly hot so that I got a lot of the crispy rice.  However, we didn't like the ojingo bokum which was too spicy and salty.   Also, the kkakdugi was a little old tasting.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2014-10-04", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 5}, "user_id": "iBB1TXnAL_PKHWTXzv2Trg", "review_id": "N6CYZ80wPpd7-mKsBM9DFw", "text": "Came in a group of 6. It's $17/per person for AYCE, and since they added gratuity already, it came out to be $21/per person. We had a great time. The food was good, the service was good, and the facilities were good. \n\nComing with 5 other guys, we had voracious appetites. We probably ordered roughly 4 orders of kaibi, 4 of brisket, 4 of ribeye, 2 of beef tongue, 1 small order of squid, 1 order of chicken, and 1 order of tripe. We also ordered egg soups, rice, and lots and lots of refills on the salads and side dishes. Despite us sitting there for almost 3 hours, the waiters were really nice to us. They also changed our grills 2 times. \n\nI would come back. The food and service were both very good. So far this is probably my favorite korean bbq in Vegas.\n\nTip: They don't take reservations. So try coming when it's not busy, unless you don't mind the wait.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PEvXaSL6bFINLeOQ8AHvKQ", "review_id": "H6SiR1oLxEPSKACY1RX8pA", "text": "Service was blah. Super small building for A.Y.C.E But meat portions are big you can't even complain for the price. They have a late night happy hour.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LOk61OGVMW-p_Q39GspiVA", "review_id": "VTwvvXvWJ1EzgNfYyI-PQQ", "text": "This place is alright... I go here when I want my korean bbq fix. The price is spot on, but EVERY SINGLE TIME I come here (6+ check-ins), I get a pretty bad stomach ache. My boyfriend also gets pretty sick every time we come here, but the price is just so tempting. Overall, you're getting a great deal, but honestly the quality of the food is not really there. There is usually a long wait at night time for all you can eat because they have a happy hour. Service is never really impressive here. I don't recommend this for a date or anything. If you and a few friends are starving and you're nearby, maybe hop in and give it a try. It's just not the best place for korean bbq.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2014-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9EQrPVfOMVLTdZU0RZdjMA", "review_id": "KfKqWdkO4lb4XwVzJ0tYaA", "text": "This place is good every once in a while. The servers are easy to talk too not much into customer service but its still cheap I think.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "n4sKtyo0p078mIl0szNMgw", "review_id": "V0cWd8frV_qM453unRUtTg", "text": "This is my first time eating at Tofu Hut. My friend and I got the tripe, boneless chicken thigh, brisket, rib eye and beef tongue and they were all good. The place lacks in customer service but if you don't really care for customer service and just want a cheap all you can eat restaurant then this is for you.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "maAEjcvpah83XKG8QkcjFg", "review_id": "DNA-_9cMSth3pnRMvulrEw", "text": "My family and I have always wanted to try Tofu Hut, and most of the time we stop by they are always busy with a long waiting list. Sounds like a pretty good place to have AYCE Korean BBQ right!?. We came for lunch and tried the AYCE BBQ. My first impression of the sided dishes were just ok, nothing to rave about. We ordered the brisket, chicken, marinated ribeye, and the marinated pork belly. The brisket and chicken were not marinated so it tasted like brisket and regular chicken. The marinated ribeye was very sweet and the marinated pork belly a little salty with a small kick of heat. The dipping sauce was generally oil/salt/pepper yet nothing to brag about. The service was ok and the restaurant seemed clean. I went to pay the bill and we were charged $18.95/ adult and $9.50 for our 5 year old. The menu stated $16.99/ adult so I was a little disappointed.The salad was the best part of our meal, but I would not return for just the salad. I would recommend Korean Garden a block down the street. They have a less meat selections, but the cost is $15.99 for the \"Vegas\" and you can get extra selections for $19.99.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2014-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jPoMdGq_MWiAUkpcjQ-4BQ", "review_id": "TIyl4FSkRbGqzaAQuA2MpQ", "text": "This place had some amazing soup! I had Spicy Beef Soup for lunch and boy o' boy was it delicious. The lunch came with rice and some asian sides (including kimchi) it was all delish! I would definitely recommend their soup here. I gave only 3 stars because customer service was so-so... They didnt talk at all except \"what your order?\". They didnt refill our drinks. And i had to ask for napkins. Other than that, food is amazing!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2014-11-07", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "yN-s8_b1t1AgOtjAvIeiFA", "review_id": "Nb6W2sxxe_rXpj7hEP09Iw", "text": "Favorite Korean restaurant in Las Vegas. I have been coming here for several of years now for their delicious kimchi tofu soup and bibimbap. However last night was my first time trying their AYCE KBBQ! After 10pm it's only $13.99, cheapest in Vegas that I know of. My favorite choices were the honeycomb tripe and pork belly. I am absolutely in love with their salad! So good!! Defiantly will be coming back!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2014-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "qx6wIkhTHScRnzNGzhARPA", "review_id": "_U3cRiEfQakAdVA0xrXqyw", "text": "I don't usually like going out for korean BBQ, because I can just eat it at home with my family. On this night, I decided to go with some friends, because we had just finished date night at some paint and wine thing. After three hours of drinking wine and painting, we were hungry. We had decided on Tofu Hut, because of their AYCE option. Also, starting at 10pm, the AYCE is cheaper than normal during the day. It was kind of busy, and we ended up waiting around 20-30 minutes. The old korean ladies are never very pleasant or nice, they never smile. Whenever we ordered meat or food, they would give us a blank stare and walk off. Also, the salad was so bland and tasteless. Part of the korean BBQ experience is eating the yummy salad that comes with it! The salad had no flavor and it was really dry. It felt as if we were eating bunny food - ugh. Next, our grill was burning so much that the bottom started to burn. We thought that my boyfriend's pants were on fire at first and started to freak out. The bottom part of the grill had overheated or something, and there was so much smoke and it smelled of gas. We thought that it was going to blow up - might think im overexaggerating, but for ten seconds or so, we did. The old korean lady rushed over, took off our grill, then dumped ice on everything. After this, we all lost our appetite and did not want to eat anymore. We had asked for our check, and not once, did they apologize for what happened or even give us some type of discount for us not even finishing our food. NEVER coming here again", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2014-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tbYqJSG_tkSe7RbxAJljGg", "review_id": "y5aQJHAyWxhB3fKoFPcW3w", "text": "I have been going to this place for the past 5 years, and i have never been disappointed with the food or staff. No a days there is a wait but i don't mind the wait, because the food is worth it!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2015-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UbsGuu9QuLOoBWElzdQp7w", "review_id": "itg1VthzDYJKcTReSfMjvg", "text": "Food is amazing as always but the service is complete shit as always too. To the asian dude working right now, learn to smile and have better customer service. Oh one more thing, don't tip yourself when you didn't do crap", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2015-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EeAvJUMEpN4AqCmF8amSwQ", "review_id": "DXkGvWM9eBx6ODBEYyVg2Q", "text": "If I ever want Korean BBQ, this is the place to go! They usually have a long wait, but it's totally worth it. Service is slow, but good. I wish they would open more BBQ tables instead of committing the other half of the restaurant to Tofu customers. That side is never full, and there's always a wait. \n\nThe food is delicious, and they always take special requests. We don't like the salad dressing, so they give it to us dry and we enjoy it with the BBQ.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2015-09-09", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "GDfED_aKORWTTBesMk3kVw", "review_id": "IxV5j32IVkSnzkWultq_1Q", "text": "One of the best kbbq places bc of its cheap pricing (only after 10pm). I personally love the brisket, beef tongue, pork belly, squid and salad.\nThe salad compared to other kbbq places has this amazing dressing! I'm assuming that it's a sesame oil based dressing and its delish! The brisket is more on the fatty side but fat always equals more flavor. Everything else is pretty much the same as other kbbq places. \nCustomer service is ok. Depending on who's the servers. I've been coming here for about a year now, I would say at least once a month. They've been improving on their customer service. Especially the guy server! He's really nice. I wish that they would check up on you a lot more and refill your water without asking. \nOverall, the food and pricing makes up for their customer service. Also, be prepared to wait if you're coming from the late night special. It's totally with it though! So far tofu hut is my #1 go to for kbbq.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2015-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ed19m0iYHBkPwJTNkShBDA", "review_id": "-jxfSO7-0XzgFVzQ10Pb5g", "text": "Underwhelming. The food quality has declined considerably. The bulgogi looked like its been sitting for a few days, beef tongue is sliced into sad, thin little dots. Pork belly is mostly thin subpar pieces that really doesn't hold much flavor. \n\nPrice is great but it's sad to see once outstanding Korean BBQ joint descend into this less than mediocre mess.\n\nEven though we came after midnight, the place was still pretty busy, service is slow but attentive. \n\nto sum up: come here if you are looking for great price, but there are many better alternatives.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2015-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Yl1KNtHzUmj79QMYMhmQnQ", "review_id": "QQwEwGUhSpvIYvEwRUqbpw", "text": "Few things come close to the satisfaction one gets from dining at an establishment with all-you-can-eat meat. Tofu Hut was a surprise to me, because in Hawaii the price of yakiniku is normally in the $20-30 range. Here it's about $17 for dinner per person. \n\nThis must be a very popular restaurant, because the wait time was almost 30 mins for every party and no one seemed phased. (And good luck finding parking!) However, it was worth it. Lots of selection on meat and the meal also included unlimited salad, rice, and sides. \n\nService is a little weird here because you cook your own food, so no one constantly checks up on you for water refills etc. They're not inattentive but you might have to wave them down if you need to order more. \n\nAll in all, a pleasant experience.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G6aol26hSwJYhiSPmOQZow", "review_id": "m2qesFKMJoMNES-IKdj8EA", "text": "Pretty good for the price! Honestly, coming from New York where cheap KBBQ is at least $30, seeing AYCE KBBQ for $17 (!!?!?!??!?!?!?!?!) is insane. \n\nPlace is small, but we got there at 5:10 on a Saturday and probably had to wait 10-15 minutes. The line didn't get too unmanageable during the time we were there until the time we left (probably around 7:00pm).\n\nRecommendations: short ribs (obvious choice, well seasoned and marbled, so good!), rib eye, and steamed egg! Would avoid the sliced pork belly as it's pretty salty and the regular pork belly is probably what's more of the standard. Brisket was ok, but there was way too much of it.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FdQPLJ388kIW3pmCVoX51g", "review_id": "_b0wLpvYLNJ_uQaZRxy5Ug", "text": "I've been here many times.They serve good food,but when we're on our way there i called and asked what time do they close and the girl on the phone said 1am and she said there's no available seats so they close right away.I was so hungry and It's my birthday.And it says online they close at 2am", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2015-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lI2nhWMqFAGIMcnmP3SO2A", "review_id": "Ay6Wd36EExpiWLyb40StOw", "text": "Priced well for an AYCE place. The meat and chicken in marinated nicely and tastes fresh. The restaurant is well ventilated and service is really good. The only thing that I can think about that was bad is that there was a chunk of seasoning in the salad that they provide, other than that everything delicious!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cH81Ij25v9Hn5WWcOicTaA", "review_id": "hFg7D_5Zjd6Ep42HuQyohA", "text": "The service is terrible, no smiling on face at all, when you ask them for something, they never look at you, which is so rude. Also the price of all you can eat should be $16.99, but when we check, the price is $18.30. Really really bad experience, never come back again.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2015-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0kLv_E6G0VEuuANPV7CBUw", "review_id": "nJX7eWLFlIy1x2ljX66mHw", "text": "4 stars because the food was great.  We were very satisfied.  For the two of us our total bill was only $36...way worth all everything they give. We did all you can eat.  The salad was very good and so was the kimchee. All the other sides didn't do anything for us. Our favorites were the marinated pork belly, short ribs, and marinated ribeye.  Forget about the other cuts of meat. They are bland and unseasoned. \nIm taking off one star for atmosphere..it could have been better ventilated. I came out smelling like korean bbq from grilling the meat. Also because of the wait staff.  They weren't the friendliest group.  Like...sorry I asked for more kimchee and meat! I dont need the smug attitude. I asked for one thing!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "c71OUkiTsDQaS5tiuYx71g", "review_id": "o2D680sZKKCj8S8iyVyXTQ", "text": "Always love coming to this place. Finally did the AYCE and it was pretty good for the price during lunch time. I love the salad that they bring out as well.  Will definitely come back again. This place gets packed though so when it does you cant go wrong with the kimchi soup!!!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-10-08", "type": "review"}
{"votes": {"funny": 10, "useful": 13, "cool": 6}, "user_id": "ZC15ae4FRzjO0rHvV2rh7Q", "review_id": "6Hy4Kei060-ZfV-5KCcJjg", "text": "I really hate to do this, because this once was my \"Go-to\" spot for KBBQ.. it has the best late night price in Vegas for $13.99, and even there regular all day price for $16.99.. I mean really you cannot beat that price!! \n\nBut why 1 star?! Why am I updating my raving review about them?! Why am I probably never going to return to my once favorite KBBQ spot?! why you ask.. lemme tell you, it's because a little critter called a COCKROACH crawled its way across our chair we were seated at, and made it's way up against the glass window.. while we were still eating!!\n\nHad to get the attention of the servers that we had an unwelcome guest trying to join us.. and he quickly grabbed two menus to scoop up the critter to have it removed, and tossed it outside.. but I'm sorry my friend, where there is one seen.. there are always more to be found. There is NEVER just ONE COCKROACH.. and this one that was trying to join us was not full grown.. so somewhere are its mommy and daddy COCKROACH and siblings roaming around. \n\nThe server apologized.. and we could see the rest of the servers quietly talking about it among themselves at the register. To EXTREME disappointment, no management came to approach us to apologize for the incident that totally ruined our meal and appetite.. I was even about to order another round of brisket, but after that.. I could barely swallow what I was already chewing.. \n\nMy bf's dad, who works in hand with the health department and the USDA, was NOT HAPPY.. he asked to speak to the manager after they gave us the check.. which nothing was compensated for the horrific experience, and the server he was speaking to was playing dumb like she didn't understand what he was asking.. so he calmly said, \"Well, when you do speak to your manager, please let him know everything was really good. The food all tasted great and was good up until the COCKROACH.\" \n\nTo make this story even better.. is that this was my first time having dinner with my boyfriend's parents, it was their first time eating here at Tofu Hut, and it was their first time having KBBQ grill style, oh and it was me that recommended the place :/ I was SOOOOOO embarrassed because I had explained the concept of the restaurant and raved about how good it was, and the parents were even saying on the car ride there that they were excited to have AYCE meats.. \n\nMy boyfriend's dad was really upset and super disappointed that no type of management came out to apologize and talk to us, there was no sense of urgency, sincerity in the apology, or showing that there would be some kind of action taken. \n\nI originally gave this place 4 stars because I really did love eating here.. DID is key word. I had taken off 1 star for the decor being run down and old and menus being sticky, and the bathroom being nasty.. but after this experience yesterday on 10/07/15... that's something you never forget, and it really does make you sick to see COCKROACH running around while you're eating. And something needs to be done. And to physically see a cockroach run around with my own eyes, while I'm eating in a restaurant is something I would never wish on anyone to experience. I literally almost threw up right there. \n\nSo to end this review.. I'm sadden.. and disgusted to say that I will never be returning to Tofu Hut, no matter how good the meat is. It honestly saddens me to give this review and rating, but it's one thing to bitch and complain about terrible tasting food, or shitty service while dining.. but to be accompanied by a COCKROACH while eating raw meat that is being brought out to you is one a whole other kinda level. Oh, and my boyfriend's dad today did make a call to the Health Department.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2015-10-08", "type": "review"}
{"votes": {"funny": 4, "useful": 3, "cool": 1}, "user_id": "-nLjtmcUaJXUPTricNUlZA", "review_id": "6T2ywm54RqkxBlQ40SVGXQ", "text": "First time doing korean bbq so I'm not expecting too much. This place is pretty cheap for how much food you get, and the little side dishes are cool. The reason why I'm giving two stars is because when my bf and I were eating, this lady was cleaning a table across from us. I kid you not, she took a napkin from that dirty table, dipped it into someone's water cup that was already on the table as well, and wiped the frame of the grill with it. I know it's just the frame, but that's still so unsanitary! I didn't even see her clean the grill itself, our grill was kinda oily and had burnt bits around the edges. I wouldn't come back again just because there are so many other Korean bbq places in vegas.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2015-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EeAvJUMEpN4AqCmF8amSwQ", "review_id": "eEdihHOrkOpS3rpIQb7KoA", "text": "If I ever want Korean BBQ, this is the place to go! They usually have a long wait, but it's totally worth it. Service is slow, but good. I wish they would open more BBQ tables instead of committing the other half of the restaurant to Tofu customers. That side is never full, and there's always a wait. \n\nThe food is delicious, and they always take special requests. We don't like the salad dressing, so they give it to us dry and we enjoy it with the BBQ.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2015-10-10", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "32O2u2zgtJRoD3Z2BbLagQ", "review_id": "RIGNPtoFzcoPM8uuSrZjDg", "text": "Horrible customer service.  Not only did they bring us someone else's order, but after we let them know of their error they ignored our table until our correct food arrived 20 mins later. They didn't apologize for their mistake. The waitress never spoke one word to us or make eye contact. \n\nWhile ignoring our table several of the waitresses were sitting down eating behind the counter because they would get up still chewing their food. Horrible. Not coming back.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2015-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MEHQ4-HTrB5WoAsx7Y9q5A", "review_id": "SqQbgitD-yuuPZKLQYJFXQ", "text": "Fantastic! So good we went twice during our one week stay in Vegas. It was an added bonus that this was also our cheapest dinner out while we were here as well. We tried the marinated ribeye, short ribs, marinated pork belly, regular pork belly, and chicken thighs. Everything was excellent, but the marinated pork belly was a little salty for our taste. The banchan were not as plentiful as other Korean restaurants we've eaten at, but the ones we did receive were delicious. I've read complaints about the service, but we found our servers to be attentive and quick.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2015-10-17", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "OOXBLPU826cVJv-mfIcShg", "review_id": "WtQQAIilYWvnCuRhvRuL6A", "text": "Cheapest  Korean BBQ buffet restaurant in vegas. They serve unlimited kalbi(most places are limited to one)  You order off the the buffet menu. Comes  with side dishes and salad. It's not bad for the price you pay. Very busy at night. 30 minutes  minimum  wait. Price drops from $16.99 to $13.99 after 10pm. \nService is mediocre.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2015-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PPGjSnVY_lr1p6BoIxep0A", "review_id": "iWvIpG2fItGBSY7kdq4p4w", "text": "Took my sister out for lunch and we Loved their bbq! Very yummy. Just wish that it wasn't such a long wait for the bbq table.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_ipbt70Z5p9KYU58drpCNg", "review_id": "_paW5I-_dr-Rp43kfO7N6w", "text": "I think I have found my new Korean place to go. I loved the selection of meats and the price not bad at all. $16.99 for all you can eat and special $13.99 for the late night all you can eat. The food tasted much better than other all you can eat Korean restaurants. The service was very fast and our table was ready with our ban chan and the grill already heated up. Love and coming back definitely.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2015-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fCz_aXXY77mF8JfKw5cHxg", "review_id": "m-cga5rDAKEddDtugBAHTQ", "text": "I finally came to Tofu Hut, friends and family were always talking about the experience they had with this colossus place of KBBQ. Food was super, short ribs are the best and the experience was worth the wait. The price is right!!,. So for that I give it a 5 star place", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2015-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "cehgMjUHqE11uo25rjueAA", "review_id": "4nhKTJsg1GAOSXW3xVcb0A", "text": "I went to Tofu Hut again for the first time in over a year just to see if it got any better and I was proven wrong. The food was okay but what really grossed me out was seeing a roach crawling around on the floor. Not planning to come back here again.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2015-10-29", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Pgxc6dHGUstF3YyzIcrReA", "review_id": "chlj6Ogv3OMDc5zquDOV7g", "text": "The food is good but the service was absolutely horrible.  This bitch was hiding behind the counter so she doesn't have to bring us more meat and whatever else that we needed.  And when we finally got her attention she gave us attitude and horrible gesture.  I lost my fucking appetite after that and didn't eat. And it's the same bitches that work there all the time.  But what do you expect from cheap Korean restaurant, cheap food=shitty workers", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2015-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jBpPeHuxkk3JwTnp7p33tw", "review_id": "oelivK7bVMFdXnY1LhVJHg", "text": "This is our favorite place to go to on a cold day! We do not do the traditional all you can eat BBQ as most people do when they go there. We always get the tofu soup and it is always so good and filling. Our favorite is the seafood beef. We love that it comes with a variety of yummy sides and the service is always on point.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TjFa1dbcsuCWeR4JrCINqQ", "review_id": "KPRkLqEI5BWnM9ETOY1d4Q", "text": "I love this place it's the best price in Chinatown for all you can eat BBQ gets crowded all the time come weekdays!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2015-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dS-U4LzjQ4HEx7Vodp7TLQ", "review_id": "R_bKp5bFeaO75u3NwCvQNQ", "text": "This is probably the most disgusting food I have ever had in my life and I am a big fan of McDonald's and street food so please don't think I am rich, snobby, and only dine where the rich and famous do, lol.\n\nThe wait was horrible. About 45 minutes. When we were seated, the server did not explain ANYTHING to us. This is one of those places where you cook your own food. We had to GOOGLE instructions for how long to cook certain things. I have been to other places where you cook your own food and they explain the minutes to cook certain foods for and are generally available with any questions. We never saw our server again.\n\nYou guessed it...it came out awful. But it wasn't just our awful cooking skills (which I do take partial blame for) but the meat was incredibly disgusting. Dry, room temperature, grey, sometimes brown, just looked like it had been sitting out for a long time. Also the sides were equally disgusting so I know it wasn't all because we cooked it badly. It just tasted like they left yesterday's food out on the counter and brought us that to eat.\n\nI didn't get sick from it but it just left a disgusting taste in my mouth and my stomach. I actually found myself purposely vomiting as my own vomit tasted better than their garbage food. I wanted it out of my system immediately. The thought of it makes me want to hurl again.\n\nI don't see what the hype is about this place: bad service, bad food. Will never return. I don't have other Korean BBQ spot recommendations but don't come here.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2015-11-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "NsJksrBBF0y3zkj97PaTLA", "review_id": "isAfAcbxwMEO0-pjVnYniQ", "text": "Good place to get your KBBQ on! Late night ayce is very affordable. The only thing that sucks are the long lines! Hope they expand their restaurant to accomodate more people at a time. They tend to lose customers when there are long lines since there are a lot of ayce kbbq nearby, yes probably you'll pay a little more but ill take that anytime rather than waiting for an hour to eat! Especially when Im really hungry....or buzzed... =P", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2015-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UR_4OrKDxrU0nz6ROmcndA", "review_id": "fMMf_mgRUiG8H2K6sUKjeg", "text": "I went and had there all you can eat late night bbq the other night, and let me tell you.. this place was sooo good. I brought my friend visiting from Houston & we we're both amazed with the quality and pricing of the food.. Definitely will be returning !", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2015-11-11", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "_mFZ5T_0GwOFaHN9utn2LA", "review_id": "R84riBdiG5mznFQiID8XvA", "text": "The server was horrible especially Korean waitress don't know how to speak English. They gave me attitude when I tried asking them questions and when I tried to placed a Togo order, she hung up on me like wtf what kind of customer service is this ?.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2015-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UAn3uItlXdhF0NskPwIeTQ", "review_id": "s0YZ4tXxuk1XEqHcSfBk-g", "text": "I've eaten at a lot of Korean BBQ places in Vegas and Cali, and this place hands down has the best salad everrrrr! Other joints just can't compare. I've always enjoyed coming here with friends. It's cheap, open late, and the food is good. Plus I've never had a bad experience and service isn't bad either. I usually just fill up on the briskets and I really can't complain. \n\n\nSerious bang for your buck", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2015-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ER2oRV5oQ47kt7yei61Z6Q", "review_id": "90mFi659_fs-09Qv01ToMA", "text": "Price is very reasonable and all workers are very nice.\nAll you can eat buffet is $16.99+tax. Tofu soap is $8.33+tax. Tofu soap was so delicious.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2015-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uTSrBSKr8H7xpWobsAgkgQ", "review_id": "QBnImiQM4FXvEDm-oTDk9A", "text": "Oh my.... this is not the same shilla I knew few years back.  Horrible service and NO taste.  This is NOT the same Shilla of the glory days.  I think they are trying...but need to try harder if they want to stay in business.  Over priced on most of the menu and the few that we had, 'Mixed Seafood Jungol' and other dishes were forgettable.", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 1, "date": "2010-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "-nqAModjbf3x7tSOf-Zn9A", "review_id": "rvC5_rI5nPWoqfxuDtDtGw", "text": "TIME SPENT\n1 meal @ Dinnertime\n\nLAYOUT\nsmall, adequate wooden furniture...  some tear in booth seating.   i was seated near the bathroom and noticed a mildew and strange odors.^^;\n\nSERVICE/FOOD\nprompt, attentive, and friendly...  my waiter was VERY talkative after he found out my party knew about the Nintendo/Atari era.^^;\n\nthe food was not bad and the sides and salads were surprisingly good.   but the mildew and odors may have ruined an otherwise good meal. T.T\n\nPRICING\naverage.^^  actually, kinda lower than average...  maybe the owners of Shilla knew about the sub-par LAYOUT and decided to save themselves with good pricing.\n\nCLOSING\na good meal cannot substitute for a bad overall experience.   i'm willing to pay a couple more dollars for less smell and better furniture.^^;", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 3, "date": "2011-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Vrf8ecE6OtIWpjiQ8E38eQ", "review_id": "G6M6M20kdMe7vFOsDi-_-A", "text": "Ok... I'm kind of indifferent about this place. The food was pretty good but in my opinion it was overpriced. The atmosphere was nice at first but if you really pay attention it loses its appeal. The waiter was nice but barely spoke English and being a foreigner myself, this really annoys me. I believe the novelty of these places is that you cook your own food but the two waiters kept coming over and messing with the heat and flipping our meat. I am a chef and trust me when I say that about half of the time it was unnecessary. Over all it was a good experience but I must say it is extremely doubtful I will return.", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 2, "date": "2011-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "30IMJ4BYN52lEenyu8VWew", "review_id": "zQpbrZ5Famy7fi0eAGO1Qw", "text": "I was here 3 years ago when I throw a farewell party for a couples that going to move to Colorado. They were the one who chose the restaurant. To be honest I do not like the food here.To me the food here(except Japanese food)tasted like they has been influenced by western cuisine.\n\nThe service is pretty slow.The bathroom is not so clean.The restaurant is kind of dark and stuffy.The price is ok.\n\nI am kind of wonder why it rated 4 stars in Yelp. For me I am not impressed.", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 2, "date": "2011-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7g7WYUDajb-CFM2Sp1TtPQ", "review_id": "UKK2hKWIhCNIci920w4vNA", "text": "Was driving around Vegas with a friend from Torrance who was kind of homesick.  We decided to try this Korean place.  It was around 8:00 pm on a Saturday night and the place was mostly deserted.  We thought it might be closed, but the door was unlocked so in we went.  The decor was kind of old and cheesy.  It reeked of BBQ and the floor was properly greasy like most Korean BBQ places, so we decided to stay.  The service was adequate.  They only served Korean and American beer.  I asked my friend what he'd like, but he couldn't make up his mind.  We settled on standard fare:  Bulgogi and Kalbi, Kim chee jigae and Hite beer.  Overall the food was just OK, nothing to get excited about.  Banchan were below par in my opinion.  Overall, just an OK meal.  However, when the bill came I was shocked.  Over $100 for that meal?   I paid and left.  The food was just fair, the price was way too much.  Now I know why the place was mostly empty.  I don't know Las Vegas that well, but I'm sure there are other Korean places there that don't charge so much.", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 3, "date": "2012-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HyfkFIEnuhECaA6Eu9yL8w", "review_id": "VI9FdZbkUK-wLhp9UUkLOg", "text": "after reading the reviews about this place...i was a bit hesistated \noh well our server was very very nice and attentive!\nfood was good overall. too bad they only open at night??!?..", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 4, "date": "2012-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tnQLku0Ua2r87YMwhvvRxg", "review_id": "5gSbWMPdQMdJrU4zz0EREw", "text": "This place was great! Me and a friend got the Shilla A and his girl got the all you can eat sushi. His girl loved the sushi. She said it looked great and tasted even better. I got the thin sliced beef and the chicken while my friend got the pork belly and the rib eyeand everything was really flavorful! The lady attending us was super friendly and was very helpful. All this for my first time trying Korean BBQ!\n\nDefinitely coming here again when I visit Vegas next time.", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 5, "date": "2014-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8isMOnHzF91KJUx18iYn_Q", "review_id": "Fs_tK5-B_OQsthfFRvPBfw", "text": "Shilla Korean BBQ has been around for quite sometime in the city of Las Vegas. I remember this being the first Korean BBQ restaurant I'd ever tried when my family first moved to Las Vegas in 2005. \n\nThat being said, I fell in love with their potato salad which needless to say - is the only place in town that serves this as one of their appetizers. I'm too nervous however to ask the Korean women how they make it, I'm sure it's a secret recipe. \n\nI however, recently went back there with my older sister for Sunday supper and the place was completely dead (perhaps because it was Sunday and everyone was at church is what I'd like to assume)\n\nAnyhow, I order the Kalbi Tang my sister order a Seafood Sundubu and it was great. The food is on point the establishment is clean and tidy. The place has good customer service and I think the only thing preventing Shilla from getting more customers on a Sunday afternoon is probably the restaurant location. It's a bit tucked away on the corner of Sahara.", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 4, "date": "2014-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6xrk6A61OWwOtmQAErZTvA", "review_id": "_HdOePv2Lc2D8ZVbtfBung", "text": "The food was pretty good, but the place was filthy and the wait staff was beyond confused.  We ordered Korean BBQ, but instead of the normal metal grate over the flame they offered us a thick glass dish to cook our meats.  This worked less than okay, resulting in longer than normal cook times and much greasier meat.  Furthermore, obtaining water refills was quite a challenge.\n\nLater in the evening when we attempted to use the restroom, it was in poor repair, as well as poor cleanliness.", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 1, "date": "2014-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_FfZHWAZGrJViZOb5GXzaw", "review_id": "m9bYIqeF6Hrjg2784filSQ", "text": "My husband and and I have been going to Korean Garden since we were dating and love it.  We always bring our family members here.  Love the beef, pork and chicken bbq as well as the great side dishes and mandoo.  And the have the best salad dressing.  YUM!", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 4, "date": "2008-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pohOrw04qI6sIX07ZpuIGQ", "review_id": "6dFZsKCg6Iy16avuXxnrYw", "text": "This was my first time at a Korean BBQ AYCE restaurant and it was good. The service was good, they leave you alone enough, but they also show you what to do when you need it and the variety of meats are wonderful! The green salad could use less dressing (ask for it on the side).\nThe side appetizers are always coming, and the fact that you are cooking it to your liking isn't too bad either. The portions of the meats are pretty big so choose carefully, I don't suggest getting chicken, because chicken on a BBQ should only be cooked for chicken, but other than that, this is the place to go whether your'e a local or a tourist.", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 5, "date": "2009-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PZOSzR6fS3utCB9UlLXs-Q", "review_id": "Ym5QgmTzwY-ssFF828-iyw", "text": "I think this place is great.  A little pricey but worth it IMO.  When we went here the service was very attentive.  Our drinks never went empty, the amount of food was excellent and the server even helped us put our meat on the grill.  This has become one of my favorite Korean BBQ spots.  That Daikon soup was great and I got 8 Banchan dishes, I love those sprouts.\n\nOverall the service was good and fast, there was a good amount of food, the restaurant was clean and although a little pricey I think it was worth it.", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 4, "date": "2010-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PuW93FmHmLaU1hrWOXrvjQ", "review_id": "lK_siNOV7gg8pYLULxdtFA", "text": "have you ever visited Korea or gone to a very traditional Korean restaurant that is run by Koreans with Korean servers?  If you have, you are well aware that their service isn't all about smiles and chatting, but one of diligence and speed.  Some reviewers before me complained about the service being awful, but I assume they aren't used to the way things are run in places like this.  It may not be an excuse, but as long as I get my drink refills and food on time and they pass by and glance at our table to ensure that we are constantly well kept, I don't care if Chung Li smiles at me or not.  If they do their job well, I'm happy.\n\nWith that off my shoulders, let's get to the juicy review!  This is the sister restaurant of Maru in Summerlin, and I have to say that I prefer this place over Maru any day of the year.  We discovered this place on a whim after trying the restaurant below this one (it was horrid). We walked in and there's a faux well in the dining area and everything is clean and well kept.  That's always a good sign.  They seat you or you tell them where you want to be seated, you get the menu and begin the experience.\n\nThey have a variety of traditional Korean dishes, and with the Korean patrons eating there when we first arrived I knew this would be good.  We ordered our typical dishes--bulgogi and kalbi, shrimp tempura appetizer to start.  We asked that they cook it in the back, and they did.  Our tempura was out on our table within five minutes along with the usual side dishes.  I personally love the picked radish and croquette.  Their rokio is good, too, although not the typical white pearl onion version.\n\nOur food arrived promptly, and we waited no more than ten minutes (if that) for the food.  It was good.  I mean really, really good.  When the waitress brought out the salad and then--wait for it.....the radish beef soup,. i wanted to cry.\n\nLet me explain my need for this soup.\n\nWhen I was five years old my parents took me to a Korean BBQ restaurant back home.  They served this awesome clear broth soup with what I assumed was thinly sliced potatoes and maybe a touch or two of beef.  As simple as it sounds, it's a traditional soup appetizer to have with a Korean meal, and I've eaten it every time I had BBQ out at a restaurant.  For two and a half years we searched Korean BBQ places in Las Vegas for this appetizer, and for some reason none of them serve it.  Finally, after 2.5 years of searching, when the girl brought the soup out in its traditional low-rimmed bowl and I had to use the typical long-stemmed spoon to eat it, i teared up.  My childhood wafting in my face with the smells of radish and beef broth.  It was a great moment.  The soup is simple and contains nothing but clear brother flavored by the radish and beef, with thin slices of radish and one or two pieces of shredded beef in the bowl.  It's simply yummy.\n\nAfter eating two bowls of it along with the great BBQ and appetizer, I was stuffed and thoroughly happy. I craved the BBQ daily for a week and satisfied my craving for dinner that week.  I never get sick of bulgogi and kalbi.  \n\nWhen I finally cooked it at our table one night I decided that was the way to go from now on because I could burn my bulgogi a bit more than the cooks in the back would to get that sweeter flavor.  If you ever go to a Korean bbq place, cook it yourself.  It's fun and tasty!\n\nOverall, a great experience, and my only BBQ place where they serve my childhood soup.  I'm looking forward to more of their food again next week, and the week after, and the week after that.  I know that I sing high praises over the soup and the food, but it honestly is that good and is the only spot we will eat Korean food from now on.", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 4, "date": "2010-09-21", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "8DSu9Rp3l5uhQajp6JeUag", "review_id": "3u8xLmJG4_7MqyFxaU4CRw", "text": "Ok...\n\nMy wife needed her monthly Korean dinner fix.  She is not Korean, but man, I bet she was Korean in another life.  Funny thing, she weighs less than 90 lbs, but eats everything in sight.  Yes, a walking garbage compactor... And, I love her still.... as long as she does not become Mrs Piggy times 10... :)  call me Kermit (yes, the green lovable fella).\n\nBack to the review.  O.K.  This restaurant was a bit hard to find.  It is actually up on the second floor.  When you walk into the restaurant, it is very open, clean, and inviting.  It was a cool place.  I give Atmosphere a solid 4.\n\nService... well, let's say that our waitress started off strong.  Got us the water, the appetizers, and extras.  As the meal progressed, she kinda forgot about us.  We had to request more water, more food, and the check (we had to track her down).  I give this a 3.... should be lower, but she was sweet.\n\nNow, for the food.  Well, for $19.99, you had all you can eat.  However, they provided you with the variety tray.  After you finish the variety tray, you can add more of the one's you like.  Personally, I do not like this.  There are just some items that we do not like to eat... instead of wasting them, we ended eating anyways.   I rather CHOOSE the selection.  Most Korean restaurant provides you with a buffet cart to pick from.  I was a bit sad to not see Galbee ribs.  They had boneless instead.  Trust me, one of the great joys of eating a Galbee rib is sucking on the bone.  Yes, a bit disgusting. sounds a bit \"gay\".  hey, I am married, I can say that without thinking otherwise...LOL... and, by the way, like the Seinfeld episode... nothing wrong with being gay... they just have a different preference... okay... moving on... the veggies and appetizers were good/average.  This was a solid 3.\n\nOverall, the price was decent.  Food was very average.  And, Service was average.  As a result, a 3 sounds just about right!", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 3, "date": "2010-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DBjPbmmHD4HG0xLwjtn53w", "review_id": "PfkaXN4iMf40HX6xJJIgWA", "text": "My husband and I frequent Korean Garden regularly.  I enjoy the soups especially the yuk gae jang (I request it medium spicy, otherwise its extra spicy) and kim chee chigae and my husband enjoys the bulgogi and nang-myun.  The food is delicious and normally comes out pretty fast which we love!  The staff is always friendly and provide excellent service.   Its not as good as the food in LA but pretty darn good for the Korean restaurants out here.", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 4, "date": "2010-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QKRPUGUUymeekeXGR-RrbQ", "review_id": "KIMCRvuaDciNec7V2Zo15w", "text": "If i am craving Korean BBQ this is the place i come. They always have great tasting Bulgogi/Kalbi and the Banchans they offer are great. The service is always good and attentive.", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 4, "date": "2010-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-nqAModjbf3x7tSOf-Zn9A", "review_id": "QRBQxU5G8vcVhb1LZzT66g", "text": "TIME SPENT\ncouple times for dinner\n\nLAYOUT\nspacious, good comfy furniture, well lit...  pleasant.^^\n\nSERVICE/FOOD\nprompt seating...  a bit slow on service, but nothing bad.\n\nall the meat orders have always been tasty as well as the sides and salad.^^\n\nPRICING\npricey pricey.   seems like everything has to be priced $3-$4 above other Korean BBQs in Chinatown...\n\nCLOSING\nbecause i think Mother's Grill offered me better service and comparative quality in food service - i could not bring myself to give it the full 5-star...   the pricing maybe a con, but korean BBQs are generally expensive anyway.^^;", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 4, "date": "2011-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "MpecPnVL5lokDVoyXKV3TQ", "review_id": "Z3N6M6ar5Tj6xjwcYkk1Vw", "text": "The quality of the food is OK, however quite pricey, especially when you consider you get a very small portion of meat with your order.  We found ourselves ordering twice as much, just to get enough.  At the prices they charge, which is at least 25% more than comparable restaurants, it is all a bit much.\n\nThe service here can be spotty,  as we have found after trying the place off and on for the last few years.\n\nBe prepared for the lack of English speaking proficiency, leading to the most basic of service.", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 2, "date": "2011-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aUljdclFwC05xp9W0KkdjQ", "review_id": "UkPYvN9OdCxirAwhNmXkRQ", "text": "We were here for lunch and there were NOBODY there, except us. I guess everybody shows up at night for shabu shabu. We ordered 2 bibimbap and they were pretty tasty. I think it is their paste or something. Also, they don't give out a lot of side dishes.", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 2, "date": "2012-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "APmIiQ_rCBx6QPZr-dYLqQ", "review_id": "Trl_qXp4nBCsEwMHcqFtow", "text": "All you can eat meat is available at Korean Garden BBQ House. I have been to many Korean restaurants and I had not been amazed by any of them. As a Korean, This place serves the best \"all you can eat\" deal. There are price ranges from $15.99 to $23.99. If you want their signature \"Galbi\" just add $5 more. Quality of food is spot on. All food they serve is made from the scratch and their kimchi is the best I ever tasted in Las Vegas.\n\nClean and cozy atmosphere welcomes customers and allow them to enjoy the meal. Service is amazing. We got some free meats and KOREAN BEER! \n\nThere is nothing more I can say. I can't wait to go back.", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 5, "date": "2012-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-uP6DbSN8jBWMbs-INTegw", "review_id": "4Oc5axEUdqXs1fAu5HNVGA", "text": "I ordered one dish here, the shredded beef spicy noodle soup, and it was fantastic.  This is a fabulous dish done right at this establishment.  The portion size was suitable, with a good amount of shredded beef, put in a spicy and flavorful broth.  I would come here just for this soup at least once a week if I lived in Las Vegas.", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 4, "date": "2013-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cMdcrS9nWwFW0J4lQIzocw", "review_id": "qdJuIBOtFTZ8zwjB0xtofg", "text": "Solid, though not overly impressive. The spicy pork was my favorite. The brisket is just that- meat. There is no marinade on it at all. The sides were good. Definitely recommend lunch- cheaper prices, same menu.", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 3, "date": "2013-11-01", "type": "review"}
{"votes": {"funny": 6, "useful": 9, "cool": 7}, "user_id": "GPIV41wpKGS5XNvQeBtYjQ", "review_id": "mTqFOA4gJro4Xu1ag3hHqg", "text": "MY FIRST REVIEW AS AN ELITE MEMBER! WISH IT WAS A 5 STAR REVIEW BUT...\n\nI have never been to a more disgusting place ever. I do not want to go into the sanitary and cleanliness of this restaurant due to Yelp rules but I will say that \"Dirty Dining\" should definitely investigate. \n\nHonestly not a big fan of Korean BBQ but family wanted to eat here. It's a All You Can Eat BBQ. You pick 1 out of the 3 menus they have which is of course 3 different prices. We went with the Vegas menu which was about $20 per person. You get to choose the meats that is on that menu. We went with Bulgogi, spicy pork, spicy chicken, and the family had cow intestines. Yes, INTESTINES! you already know I did not touch that at all. We also got an order of shrimp for the kids that is not included in the Vegas menu so it was an extra $25. They bring out little small plates, kind of like appetizers in the beginning. There was fish cakes, spicy broccoli, kim chi, jalapeños, mashed potatoes, horse radish, house salad, and soup. When the meats come out, There is a stove on the table and you actually cook it yourself. \n\nwe had a few different waitresses assigned to our table because we were a party of 14. One of them pulled the table without acknowledging my phone was on there and dropped it. Good thing it didn't break or else I would have went crazy on her. Our drinks came after we got the food which was pretty unacceptable. I was thirsty! So we were eating spicy food without any waters for a good 10 minutes. \n\nNever will come back & I do not recommend this place to anybody!", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 1, "date": "2014-09-01", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "rYn_p-krKaMsBUiAYSImvw", "review_id": "NPLBkkNb2rUJbWyEHYkarw", "text": "First let me start by saying... TAKE YOUR JACKETS OFF. TAKE WHATEVER ACCESSORY YOU HAVE ON AND LEAVE IT IN THE CAR. I DON'T CARE HOW COLD IT IS OUTSIDE. I say this because you will come out smelling like the restaurant and grilled meats. It's inevitable...\n\nThere are many all you can eat korean barbecue restaurants in Las Vegas. I would like to consider this place as one of the best ones here. When considering all you can eats, the value is everything. They have a 3-tier menu. Honestly speaking you don't need any other meat except the brisket (cha dol baek ee). This is because the others are pretty thick and heavy or heavily marinated. They also just don't taste good. The brisket is thin, light, and full of flavor. If you need more flavor then use the sauces that they give you. \n\nThere are ladies who come around to help you cook and what not, but you honestly never need any of their help because come on.... if you're a man, you know how to grill, if you're a woman, you know how to cook. Let's be real. There is no need to review the service because it is an all you can eat. They will be there when you really need them. \n\nThe all you can eat is only 15.95. If you are looking for Kalbi (Korean Marinated Beef), then you would go to Sura. You would be paying over 20 dollars there.", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 4, "date": "2014-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sMb0tXEoAcAIDCV_5CbdYg", "review_id": "Z-uQK2ZYFdnzCssr7rldrg", "text": "We did not order the AYCE and did a la carte. This bbq place is on the second level in the plaza with tea station!\n\nGoods - \nThe restaurant is large and can accommodate bigger parties.\nThe galbi was good quality for the a la carte\nseafood hotpot is good! - if you are not a spicy fan ask for less spicy!\n\nCould be better -\nPortion for price I think could be a bit more\nThey ran out of the kalbi with bones. ?!?\n\nguy kept cooking our food... could be good or bad\npanchan was average", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 3, "date": "2014-09-15", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "AnUDCemTDC7i_NoGPkNVNw", "review_id": "TItMkUpzK3Gnb-EDiWFcMQ", "text": "I thought I try this place out since my go to place was Tofu Hut every time I want Korean BBQ. When I came here with a friend, it was empty with only a few other parties around us. \n\nThey have different combos you can try from 15.95, 19.95, to 24.95. We decided with the 24.95 combo and ordered brisket, shrimp, rib finger, beef tongue, two steamed eggs, and beef tofu. One thing I liked was that they let us to small orders of everything so we could take our options! I thing I wished they had were kalbi ribs! I mean I paid 25 dollars I expect the option to have galbi on there. \n\n\nThe service was okay but could of been better since the place was empty. She came by once in a while to take more orders but other than we had to flag her down for more bachan and water. Also I think they forget about is when we got our check.", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 4, "date": "2014-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lvAlEb6WqwOHmN3_NxW70g", "review_id": "55XF8JBt8Hi3TKFq21M38w", "text": "I used to come here all and then switched to tofu hut. I don't remember why I decided to make the change but sadly tofu hut made me horribly sick. I self diagnosed myself with food poisoning. after that i came back to Korean Gardens and I don't know if its just my horrible experience at the other place but Korean Gardens stepped up their game. not only was the food delicious (we got pork belly and brisket) but the service was unexpectedly great. the last time I was here I had to flag someone down. Now, not only was my server constantly up beat she was very helpful. The highlight is the steamed egg. Oh My Goodness. It is THE most delicious thing in the world. its Soo fluffy and creamy and just eggy heaven. Sometimes I just come here when I'm craving an egg.", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 4, "date": "2014-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9v6VLmlKm6XSNFfsu1q-7g", "review_id": "REqJVSdg-dSziMhcoSbFKg", "text": "I'd say 3.5 stars for this one lol\nLike I mean the food was good an all but the fact that they charge 18% gratuity for parties OF 5 AND LESS! Is bs, we had a group of like 15 so we split into about 3 tables and what do you know? We got charged. \n\nThe service was alright. After they seated us they took their time to ask us if we were ready to order with out giving us a menu.\n\n\nIf someone does go here please please read the menu at the bottom \nThey charge gratuity for parties of 5 and less so what I'm guessing is we have to show up with a fck load of people in order to not have a service charge.\n\nThere's also 3 different menus \nNevada 15.95\nLocals 19.95\nAnd I think vegas 25.95\n\n\nThe selections were alright for the prices but I mean is rather go somewhere else than to be told you can only have a certain selection with a certain amount of money.\n\nThe signs they have in the restaurant are also old, I've been told that it's a new management therefore everything else in the restaurant is old and it's being managed by someone else with the semi old policies", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 3, "date": "2014-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "P4VZKli0kL4eoZNJKhiNoQ", "review_id": "veiizIXeQPRX32YvAbBxkg", "text": "Good place for a lot of food at a good price. Had a all you can eat lunch.  The food is BBQ in front of you. Tons of food and you can't eat it all.", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 3, "date": "2014-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nnzpNABsNOSniQnliVKl4w", "review_id": "lZjpFqa4OW1hU-rsO42Yzw", "text": "Food was AMAZING. Reminded me of the last trip to Korea, great sides and tons of meat. All you can eat for $15.95, so the price is right AND quality is high. One star docked because our service was a bit slow. When paying for all you can eat, the good should keep coming. We will definitely be back though! (And bringing friends here next time - such a good place for a group!)", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 4, "date": "2014-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W9u6p92RuWR_RtjmN94uqw", "review_id": "snTp_QkTatTDetnqF5m3oA", "text": "Awesome experience every time we go.  I'm usually ordering the bulgogi, pork belly and bbq brisket.  What's cool about this place is that we can cook it ourselves at the table and it's a great deal.", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 4, "date": "2014-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zVOckoxm8-n098bwWbG6jA", "review_id": "0GPvaF_Ma_G9VDi5vR7IHw", "text": "This is our regular place food is good and service is better than Tofu hut.  They are not skimpy with portions and keep your sides coming.", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 4, "date": "2014-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r-XQXLx50g2S7n9tFKgMiA", "review_id": "jhD1-VBM4-bJPHjtS26kgA", "text": "Automic gratuity for a party of 3? Really? \n\nIt would be fine and all expect the gratuity charge was separated from the actual printed receipt and was just hand written on a different piece of paper. Kinda weird.", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 2, "date": "2014-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bsOB5BrYHtwzeyQVDcvZ1w", "review_id": "w9Ytf6QKBYLaHFoDZ-OS5w", "text": "This is where we go when we are in vegas.\n\nI shouldn't begin with the sides; but that is what I love most about the korean meal. Every one is excellent and high quality. \n\nThe meat is also of a pretty good quality as well. \n\nAll in all; I'm glad that my boss found this place. It is quite enjoyable.", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 4, "date": "2014-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KwE_Byqp6TqKNluBQconrQ", "review_id": "Ke_mIUZs7XNmdvUkxiloRw", "text": "We had Yukgejang, Tuk Mando Guk, Daegi-bulgogi, Danjang Chigae, and all was outstanding.  The restaurant was clean and open, and the staff were all friendly and attentive with smiles.  Our primary waitress was Esther, who was excellent and made our visit relaxed and fun.  Also, we had a great view of the strip from our table.  We will be going back soon.", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 4, "date": "2014-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BYTBDEF2iP9ZgmsWVKLaSw", "review_id": "rnJsS6lPmmSIKYvK0OFN2w", "text": "Nice place.  Best priced in Vegas (that I am aware off).  Great service.  Tasty food.   I love it and eat there all the time.", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 5, "date": "2014-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bTkhGBk0Exrdi8S4Kj24mg", "review_id": "rQKLrUmyF8aPJVFU-OpKbQ", "text": "I love this BBQ. Service is very good, they play Korean dramas while you eat !! I love to get the BBQ, the meat is thinly sliced, the steamed egg is so good. The kimchi and bean paste goes great with the food. Definitely a great place to go with a big group of friends or just with one other person.", "business_id": "v8TQwyxEj4or2Yng6y0S7A", "stars": 5, "date": "2014-11-22", "type": "review"}
