{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "ay9H1RpjbBkaiXGxfh7LaA", "review_id": "v_uEDbK5fP1UJpkXNPwXpQ", "text": "This would be my local haunt, if I were ever to relocate to the Pittsburgh area. What a great little place! Such friendly staff, and some damn good eats!\n \nIt was so great, that we actually went there twice during our 4-day vacation to catch the Steelers/Ravens game. \n\nThey have daily sandwich specials. On Thursday night we went and had the special roast beef and cheese sand., and the .35 cent wings. Very, very tasty. I'm sorry, but this place kicks Primanti Bros. butt on the taste factor. They have about 8 different types of wings... reg., garlic, and I can't remember the rest - we got the regular, and I was wishing we would had ordered more.\n\nGoing back on a Friday night, we ordered the buffalo chicken pizza and a pepperoni n' mushroom.  Wow! That buffalo chicken pizza was awesome.\n\nThe other thing that stuck out for me was one of the customers. An older gentleman; he seemed to be a regular. I really, really wanted his SPAM t-shirt.", "business_id": "KayYbHCt-RkbGcPdGOThNg", "stars": 4, "date": "2010-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "X_nHaeK9P1CX7Hvd0l4-tA", "review_id": "oiDRt46oHFo0ozLZXaVicQ", "text": "Had an awesome time here with my hubby the food was amazing but the games cost so much an the prizes where ok but all in all a good time I'll be bring the kids with next time", "business_id": "sbW8qHJgzEIH42B0S-3New", "stars": 3, "date": "2015-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bEIXIfk1Zys1r_nmGNiF9A", "review_id": "3mp5jXdxC2yqSK6sgRQfEg", "text": "Normally the food is outstanding, no more salted bread sticks, but they did bring back the ball park pretzels.  Not very good, cool to low warm. Hard, dense.  Mango ice tea is wonderful.\n\nWill see how the chicken comes out.\n\nTo be continued...", "business_id": "McikHxxEqZ2X0joaRNKlaw", "stars": 3, "date": "2013-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jF6fYwa2CMJXHHtS47a7eg", "review_id": "Mna2zx7Lu5T3w4uIGKqf-g", "text": "Was very disappointed with the food. It was overcooked and not seasoned very well", "business_id": "6p9TlP2I8S4agxYMNFSDjg", "stars": 2, "date": "2014-10-01", "type": "review"}
{"votes": {"funny": 6, "useful": 10, "cool": 14}, "user_id": "bhZ13wN_5lQrKX278AP_aw", "review_id": "fNjU90_okckiJwwYIvuq6g", "text": "The Rusty Nail is a neighborhood diner-style restaurant that serves Pittsburgh-centric comfort foods.  Meatloaf, pasta, and hot roast beef all grace the menu.\n\nI came here with my dad who ordered a hot roast beef, and I ordered a bowl of spaghetti and meatballs.  Both meals were right around $10 and delicious.  The portions were huge, and the waitstaff was very friendly.\n\nI'm guessing it was the owner, but a nice guy came around asking everyone how their food was and making small talk.  Nice touch.", "business_id": "ucKQlQvOeJxETLNkpKcaSw", "stars": 4, "date": "2015-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "vHGMUYLLVH6DssAvTAfBdQ", "review_id": "cRA5vSKC4v4pdBF5f5hUYw", "text": "Came here for lunch with my cousin. The hostess Lay in our waitress Tia  (I believe that was her name) are very nice and accommodating to us. Before our food came out an emergency came in would have to leave. Tia had our food packed and ready to go within minutes. Thank you", "business_id": "h3la53L9-OX_HlfeAySh0Q", "stars": 5, "date": "2015-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cT60APDQLgJZ6atLZPz1VA", "review_id": "5MisCMXU0QXuXgQ6ucO-ZQ", "text": "I had lunch here with a friend and it was good.  The hostess and bartender were great.  They great you with a smile and pleasantly wait on you.  The food is just OK.\n\nThe hostess greated us with a smile and mentioned it would be about 15 minutes.  We asked if we could eat at the bar and he said of course.  We found a small booth at the bar.  On our way back we noticed that there were several empty tables available.  We found this strange and that is one reason I gave them 3 stars.\n\nWe were greated by the bartender, who was quite nice looking, with a smile.  He had alot of tables and still seemed to manage pouring drinks and delivering food.  He was great at his job.\n\nI ordered tortilla soup and salad with raspberry vinaigrette and it was good, delivered with a smile, and timely.\n\nThe bartender kept our drinks full as well.\n\nI would give the service 5 stars, food 3 stars, size of the restaurant is large but they never seem to be staffed for it so that i would give 1 star.\n\nGreat place to go for a quick lunch!!", "business_id": "uUorjstNslr3gkIsVGtQAg", "stars": 3, "date": "2011-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "T_wjLgPOPXry7Bea4MzoVQ", "review_id": "csngrK1aFzljgD6MJWGkVQ", "text": "Ritter's will never be a fine dining establishment. It will always be a diner. It will always be a standby. It will always be home-cooked, open and ready to accept you regardless of the time of day or the day of the week. All that is truly required is that you find one item on the menu that you really enjoy. For me, that one item is the Grilled Chicken Breast Dinner. I almost always get this item with the veggie of the day, sliced tomatoes or sliced cucumbers. It always tastes good and it never breaks the bank. Sometimes I might get breakfast, but usually it is the grilled chicken breast.\n\nEveryone should try Ritter's at least once.  They only accept cash, but they do have an ATM present at the entry. Every now and then, I do allow myself to order a slice of the freshly made banana cream pie. Wow...it is tasty.", "business_id": "--UE_y6auTgq3FXlvUMkbw", "stars": 4, "date": "2012-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "X8fz9ZUvFVErPb8XGAfTfw", "review_id": "HZOT4OTgXJPdckTuW2v34g", "text": "Zero , service was terible... i know food i love food but i have honestly  had better food out highway restaurant bathroom than what was served to me today.", "business_id": "--UE_y6auTgq3FXlvUMkbw", "stars": 1, "date": "2015-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r8AulMAwAIrVrdJGHQcllA", "review_id": "bY5rd-Ug5_IGUtpFRPq5mg", "text": "Delicious burgers- freshly ground beef and hand-shaped and cooked on a wood-fired grill- amazing. The burgers arrive and look enormous, but are so good, before you know it, your plate is empty. Only downside is it can get very busy and you'll have a long wait outdoors.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 4, "date": "2009-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "f9LuLzqLMNJJoV3zmu6dBA", "review_id": "6Bd75Fe7yXnQoE3_l51jqg", "text": "You when you hear about a place for years and you finally get the chance to try it out but it's bound to not live up to your expectations? That was my experience of Tessaro's. Had I never heard of it before, it may have gotten an extra star. But, this restaurant was on the Pittsburgh's top 25 a few years back. This is supposed to be the best burgers in the 'burgh. If that were the case, I'd stick to making my own. \nHubs and I stopped at T's on a recent Friday night after conducting some business in the area. Baby on board, we walked in and waited to be greeted. The inside looked a bit old and run down. Tip: they do not have highchairs only booster seats which is impossible to get a squirmy baby to stay in. I would not suggest bringing a baby here. The tables are also very small and close together. We actually had to move the table out to get in and out of the corner booth. I decided on the basic cheeseburger and ordered the boiled red skin potatoes for the baby and a side of chips for me fully expecting homemade chips. Not the case. I got a handful of what seemed to be a ruffles knock off. The potatoes were very bland despite being served with warm butter on the side. Great for a picky baby. Bad for an adult who is looking for something tasty. Now to the burger. Huge, yes. Juicy, not even close. Despite ordering my burgers well done, I expect them to still be tender and juicy. This was not the case. My burger was as dry as a burnt piece of chicken. I ate half of it. We were in a bit of a hurry so I didn't mention it to my server, though I'm not sure it would have made a difference seeing hubs medium burger was also dry. Overall, Tessaro's fell flat and left me hung out to dry.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 2, "date": "2013-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6jVrGOl04TGIRmwCf7BW-g", "review_id": "Wv3cesjGvMiXcAAsxmQ5DQ", "text": "I haven't been here in a couple of years but have been there numerous times in the past. Absolutely the best burger in pittsburgh.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 5, "date": "2015-09-25", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "FWJi1_n10IU3uTRi_pjSNg", "review_id": "Fb6XZ-1WMxm0RFPpzNJiFw", "text": "Just there last evening after a 12 hour shift at work. ordered a Rachel sandwhich...received a reuben. The server apologized and offered to get the correct sandwhich for me to go. She brought it to the table packaged to go. I drove all the way home to moon township opened my container and found another reuben sandwhich.....disappointing to say the least.  The fries were great however.", "business_id": "3zgswf_NfBJpeAoWeTkgMA", "stars": 2, "date": "2014-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AbC7-uNS9c3_BZX2w2GBGA", "review_id": "bhzx7HUfrZeDjZQD8fSGXg", "text": "The best place in Bloomfield! Love the new decor & outdoor seating! Food is to die for...delicious! Highly recommend!!", "business_id": "7XXmky6YYjsvKFwho_eavg", "stars": 5, "date": "2015-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2yAAeVQbhiMz9M-TgjB1GQ", "review_id": "hoZyyWFCYRw_Y8zzyzIS6Q", "text": "harris grill, i think  your menu is trying too hard.\n\nfirst place i went on my visit to pittsburgh.  menu was a little overly silly, waitress was a little underly friendly/helpful/timely, and food, while decent, was overpriced for the quality.\n\ni may be back to pittsburgh, but won't be back to harris grill", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 2, "date": "2011-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "MXBkWsjYApPzYUf3gwbPug", "review_id": "M2SnZcPM_WKxtpkzzm776Q", "text": "After the woeful Stillers game vs. Tampa, we did some Yelping to figure out where to go.  Hey 'Burgh...what's up with all your decent establishments being closed on a Sunday?  Harris Grill wasn't, and we're certainly thankful for that.\n\nThis review should actually reflect 4.5 or 4.75 stars if possible- just a neat place.  We ventured over and found parking without issue.  I can imagine on a Friday or Sat evening this might be a little more challenging.  Since it was a beautiful fall evening, we opted to sit outside and we were approached quickly by our waitress with water, and asked for a moment to review the hysterical drink menu.  Much props to a place that doesn't take itself too seriously.  Just read the menu and if you have an ounce of humor in your body, you should at least salts (smile a little then stop).  I salt because LOL is so yesterday.\n\nI opted for the manly Sangria, which was outstanding, and she got some lemonade concoction with vodka.  Both were hits.  We also read a lot about the hummus, so we were followers and went with it...very pleased we did.  A great appetizer.\n\nShe went with the skirt steak mac n cheese.  I went with the lobster and crab mac.  I'm just going to laugh at my kids when I make them microwave mac n cheese from here forward.  THIS is mac n cheese- it's creamy and fattening and has a crunchy topping and soft noodles (but not too soft) and well...it's perfect.  There were generous portions of lobster and crab in my dish and it was delish.  Her steak was seasoned and cooked to perfection.  I was almost jealous I didn't get it, but then I'd grab a huge hunk of seafood and quickly realize the mistake of my ways.  Both are very rich dishes.  If you can finish the big plate of mac, God bless you---you're a better person than I am.  However, it does make for a wonderful breakfast.  Don't judge me.  \n\nShe finished with a dessert type drink that featured Rumchatta and strawberries- not my thing (said the guy who ordered Sangria), but she enjoyed it.  Dessert looked tempting, but the button on my jeans was already stressed, and not wanting to hold my pants up on the walk back to the car, I shook off the waitress and asked for the check.\n\nIf memory serves, 3 drinks, an app and 2 fine dinners came to roughly $75 plus tip, so, roughly $90....and if I lived there, I'd do it at least once a month or more.  The menu is diverse (and funny).  The service is timely and I saw a manager deal with a couple 'difficult' customers in a way that I'd want my manager to treat any customer.  Pittsburgh's lucky to have this place.  When we're back in town, we'll be going here again.", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 4, "date": "2014-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZSKihABr6_EKlyVPZDLSQQ", "review_id": "AzIA7LKXdLE0U0p-gaqIwQ", "text": "Wish I came here yesterday too!  Atmosphere and decor are cool throughout establishment including lips urinal (sorry ladies, trust me)!  More importantly staff is extremely friendly and answered all 50,000 of my questions! Thx for patience and information!   Tuesday is Bacon Night!  Free bacon at bar after 630!  Happy Hour (430-630) is throughout the 2 story restaurant including  $5 apps (Dry-Rub Bacon Wings are fantastic as well as calamari ) and half price frozen Cosmos!  Yum! Menu is fun to read!  Here on business but if ever back in town, this is my go to place!  Thx for great food and service!", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 5, "date": "2015-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aJf2Efw3pilH26zmSn2lPw", "review_id": "_u5xZfO95I9ZUcGC9jC3Hg", "text": "One of my favorite places in shadyside! Such a chill place, and the staff is always so friendly. I love taco Tuesdays. I also love their brunch! Those shadyside skillets are pretty much the best things to have happened to walnut st. \n\nI think what I like most about this place is that the food does not pretend to be anything more than it is. It is food you could easily make yourself at home. It is nothing special, but it's good. It gives you no more and no less than what you need. \n\nI like that their \"fried\" food isn't actually fried. It's probably not healthy, but at least it's not fried!\n\nTheir dinner specials, while they do not really change often, are pretty solid. I always have a delicious meal when I'm there!\n\nLastly, the owner seems incredibly nice. I like supporting this local business!", "business_id": "DkX3YoxhH4uADsgVgQThew", "stars": 4, "date": "2013-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "maadokk3SGGKscG9_-FAyg", "review_id": "8LcDe8ws2bhh2RgUAlwo6A", "text": "Wing night is the best! Have yet to try the rest of the menu items which all look amazing. The bar is a bit smokey but hey, it's worth the food.", "business_id": "ufyh6h4GsR-RYY2lC_Iz7w", "stars": 4, "date": "2015-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "NmsQwksP_1uireDRzhcKJg", "review_id": "omM6wcF3qM7twqkQVGaGfg", "text": "We like Longhorn, but not this location.  The service here is mediocre at best.  Tonight it took 10 minutes to order drinkes at the bar, 10 more minutes to get them and 10 minutes when we had to pay to go to our table.  When we go to the table, it was not ready for us to sit and we had to wait until cleanup was finished. When we eventually got the appetizer the bread, there were no plates around.  10 more minutes to get plates.\n\nWhen the food finally arrived, there was only a passing similarity between the menu pictures and what we received. My Caesar salad was sour and otherwise bland.\n\nWorst experience in a long time.", "business_id": "AUDuCSWYzzRP3H2w7TxtuQ", "stars": 1, "date": "2009-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "ezMIBbU-FATJrkyTEF6SYA", "review_id": "gkat0EuzRZ7mw-bnSYX6ng", "text": "One of my favorite spots in Charlotte. Definitely a locals spot. They have the best wings in town (Texas wild wings). They remembered my name after my first trip. Can't say enough about the place. Check it out.", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 5, "date": "2010-09-27", "type": "review"}
{"votes": {"funny": 2, "useful": 9, "cool": 4}, "user_id": "W6LTsXcY1R76M9EdeN0G6A", "review_id": "Sp_StsqUJ0pSNv1GJxc9UQ", "text": "Need a good, unique date spot? Here's the place. Great little hidden gem in uptown's historic 4th Ward neighborhood.\n\nFood: First things first... whatever meal you get make sure to get a cup or bowl of the spicy crab soup. Money. Not so hungry or just want a snack? The fried pickles are spot on. The London Broil is just fantastic. The marinade they use on it is super delicious. Dinner version comes sliced up in entree form... lunch as a sandwich. You get a side item with both.\n\nBar: They have a good selection of local beers. If the restaurant is busy and you can't get a table... sit here. The service is always top notch.\n\nParking: there is a lot less than a block from the restaurant between Graham and Pine. There seems to be a lot of confusion surrounding parking here. I think a lot of it is because the signs are kind of confusing. You can park there for two hours without a parking permit. Bonus: had too much to drink and need to take a cab? The A Mike's staff will you show you where you can park your car overnight.\n\nI love to bring out of town guests here. Such a charming place in a great neighborhood. Warm, welcoming, homey atmosphere.", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 4, "date": "2013-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FRaoMuo8kbnPP2dHveK1wg", "review_id": "voPhSrD8iBVfASWYc9jk9w", "text": "Atmosphere and food were amazing. If you only have a chance for one dinner in Charlotte, this is the place!", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 5, "date": "2015-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lcn-f0e2dlcEPbGAbrTRVQ", "review_id": "HZ6AwgtxZREFDAjCn3fmTg", "text": "Haven't been to a Morton's since they left what was to become part of the Arena District in Columbus several years ago (yeah, smart move guys!).\n\nService was surprisingly fast. Filet Mignon was perfect. Onion bread and chocolate soufflé was as good as I remembered it. A friend had the bone-in pork and loved it.", "business_id": "Lt9o2RmacVY2L-IWLA8uTg", "stars": 5, "date": "2013-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EPCnL_c63KjmJ9EVB6kM5w", "review_id": "f-ku1joXKH93rCOMY8f70w", "text": "I've been here quite few times and while F&H isn't perfect it's better than so e of the reviews here make it sound. First the bad, like other reviews have mentioned, sometimes the service can be bit slow. It's usually fine but it admittedly has a few more bad days than some other places. On the other hand they have pretty solid lunch specials, great wings (the Hot BBQ are delicious), and some nice beer specials ($2.50 drafts on Thursday ($2 domestics), Yes Please!) They also have plenty of TVs and a pretty good customer rewards program and when it comes to a sports bar, what more do you really need.", "business_id": "-6JY1T0w4XETux5kGOj84g", "stars": 4, "date": "2012-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ccwqKR10BUUaFcDL4A9-Hw", "review_id": "5TASdRhuFUxoilCNUVMhGQ", "text": "I have been here on numerous occasions with a variety of people and the one thing I must say about this place is inconsistency.  You can go there one night and have great food and service, whereas you could go there on a totally different night and experience the complete opposite.  The same goes for the food.  Some dishes are awesome (shrimp and grits, stuffed chicken) while others I would definitely shy away from (pizza).  If you are a beer lover, they have some good brews which are actually crafted on site.  The beer can be better than the food more times than not and I would recommend people to go here for that more than the food.  The Southern Flyer is great for pale ale folks like myself.  If you give this place a shot, prepare to roll the dice because you don't know who you will get, or what the food will be like when it comes out.  The one thing you will be guaranteed to have if you are so inclined is a nice brew made on-site.  Can't beat that sometimes...", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 2, "date": "2012-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EhAdrPwZUkQPGfNlVRyiqw", "review_id": "2GGzVI0ZmBT0o_lEUYRLxA", "text": "Came in with a buddy of mine to a familiar place that always delivers during my travels. We sat down, not too many clients in the restaurant and service started out well with our server Imani. However, it became evident that either we were placed in a section different from the areas she was working as we kept seeing her less and less or I can just ignore my guest because I think I'm cute and smile and everything will be okay. At the end of our meal, which was very good, she offered us dessert, we opted for another beer which never came. We would catch a glance here and there of her for the next 20 minutes and finally she came over and asked if I beer made it to us. Did you bring me my drink? Then no, I have not gotten my beer. She would look for it right away, but I asked her to just close us out as it just wasn't nice to be there any longer, no excuse, no apology, just said okay, smiling away and walked away to what I hoped would be a quick return with my bill. She again left for another 10 minutes. When she returned I asked her what exactly happened that our drinks never made it to us? Was someone else supposed to bring it, did she forget? She said that someone else usually brings it, she was helping out the bar by bringing our drinks, someone must have taken it, oh my god, i'll just smile at these guys and everything will be fine.... no.... i just want good service. The server who was on our side was taking care of all his clients, bringing them drinks so im pretty sure I was getting the run around. I asked her who the manager was and she said Michael and again walked away. Pretty disrespectful attitude to have in a customer service environment. Next time I come to Charlotte I need to stick to the many many other places with great food and folks that want to take care of their clients. My opinion is that the food here was darn good and consistent, the beer is excellent, the service which is the most important, was \"rock bottom\".", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 2, "date": "2014-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2DXlHdiBXue4BxExhfo76Q", "review_id": "zZOwubFuN0W4zo9lF1YDZw", "text": "Sat outside near the bar. The service was very slow and obviously not very interested in being there. After waiting for 15 minutes we decided to ask the hostess for service and menus.\n\nThe food was also disappointing. Ordered the avacado chicken sandwich and though I prefer smaller portions, this was a bit ridiculous. The chicken breast was so small. Worse was that there was no flavor. It was just all around bland. \n\nOn the brighter side,  the bbq wings were good, so maybe I just ordered the wrong item. Would recommend not sitting outside or at the bar if you want food.", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 2, "date": "2015-10-26", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "F8rOtCtfmhBeBQRK6gyD0w", "review_id": "68MiYmVEZJmlrovaLPrReg", "text": "Okay, it's a 2 star trending 3 stars in my mind. \n\nI went there before a Bobcats game with some friends. We were the only people in the entire place. It was kind of nice, but a little bizarre, as we'd expect atleast somebody else there, but to no avail, we were alone.\n\nThey have some good stuff going for them: Practically TV's for wallpaper, half price apps (yeah and it's better than that Applebee's garbage), a solid location, and a pretty large bar.\n\nJust wish they had more people going in and out, but hey, faster service for me.", "business_id": "t5l-H2KdY4MQgLDMENz9WQ", "stars": 2, "date": "2010-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zhyaf-zfdXvWvM7jov8tAw", "review_id": "i6XbIspf1MGhS3Qdv6ZsPA", "text": "Service: okay\nWait: very long\nPrice: way too high\nMenu: waaay to many choices; \nFood: sub-par for your money.\nAtmosphere: smells like a public restroom, tried to make it look nice but kinda failed.\nFree bread: none.\nName: too cliché\nDrinks: Pepsi brand (ew)\nHealth rating: 90.5", "business_id": "b856Q36EWKbwbm_XdJER8Q", "stars": 1, "date": "2015-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h9CPrQhMWbo0kdvSKvBXAg", "review_id": "G381ykXlX5S4SU_5YzlwTA", "text": "Good food, simple decor and good service. Old style Greek restaurant in the Charlotte tradition.", "business_id": "FjSYyID6pInYVsG-vADNzg", "stars": 5, "date": "2014-10-25", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 3}, "user_id": "vE4TIv-AEsFalZ4faTRH-g", "review_id": "U8e84r9kCNIfw-gzpQeq6Q", "text": "I have been going to Harper's for years - YEARS, I tell ya.  Unfortunately I have noticed a marked decline in the quality of their food (at both locations).  Though the portions have remained relatively generous, I would rather have a smaller amount of better food, if that is what is required to up the quality.\n\nAfter an especially harrowing few weeks, the boss decided to reward me for not going on a homicidal rampage by giving me a gift card for Harper's.  So, on a Wednesday evening right after work, off to Harper's I went to spend the balance of my gift card.  I say this only in that if I were spending my own money, rather than the boss man's, I would not have ordered a steak at Harper's, I would save that for a steak place.\n\nTheir menu is on the smaller side, but it contains a variety of beef, chicken, pork and fish dishes.   I decided to splurge and try their prime rib served with a loaded baked potato ($25).  It was an inch thick, medium as requested and looked delicious.  Upon cutting into it - bleh.  Tough and chewy, and the dull knife was not helping out.  I had to saw at the piece of meat to get bites cut and immediately dipped it into the tasty au jus (salty meat juice, yum) to get any kind of flavor.  It honestly tasted like a hunk of meat taken off of the roast beef carving station at some kind of buffet.  Harper's isn't a \"steak\" place, but I expected better.  The loaded baked potato was delicious.  \n\nFor dessert, there was a \"homemade\" pumpkin cheesecake ($6).  It was fine, nothing special.  It was not very creamy, and not very pumpkiny, but that might be a personal preference of mine as far as cheesecake consistency and flavor goes.  I wouldn't bother to order it again.\n\nMy server, Tonji, was spectacular.  She kept my ginger ales coming and continued to check on how my meal was going, without being interruptive.  The manager did stop by and ask how the meal was and I should have spoken up, but I hate being \"that girl\".  \n\nI have spent all of the $50 gift card and wouldn't intentionally return to either of the Harper's locations any time soon - the meal from the Carolina Place location on Saturday was mediocre and the dinner at the Southpark location on Wednesday wasn't anything to write home about either (though the wait staff at both locations was quite good). \n\n(Another piddly comment I have - wait staff shouldn't set up in the rest room changing clothes/getting ready for shift and gossiping.  As a paying guest, I shouldn't have to shuffle around them to get to a stall and then again to wash my hands.)", "business_id": "hIQRiE3UsYH7UsrsDwJwLA", "stars": 2, "date": "2013-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nK_KdyKQ_c9Ib9rQn5h_cg", "review_id": "Q8RqCpwS7MB3q8KXVKEsXw", "text": "Just tried their black bean burger. Sooooo good!", "business_id": "WkD7OrSIHLzgOQo9wQHu-A", "stars": 5, "date": "2012-10-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "PqRPuVEWCxQfR7OTXp1efw", "review_id": "kiIQfHJCugrbg-7KrjxcfA", "text": "I had breakfast here today with my Cousin, childhood friend and of course the Mrs.\n\nWe arrived at about 9:30 and had a 15 minute wait. It was a good way to catch up with the family. \n\nWhen we were seated our waitress Teresa came right over to take our drink orders. She was also very helpful answering any questions we had about the menu. \n\nAfter deliberating over the menu my wife had the Jr plate (three pancakes, one egg and two sausage links). I had the buckwheat pancakes with scrambled egg beaters and corned beef hash.   My cousin had the two by four platter and my friend had the pigs in a blanket. (I was tempted to try the Dutch baby as mentioned in other reviews but then I would have needed a nap). \n\nEveryone was very satisfied with their food. You get a lot of great food for a great value. When we left there was a thirty minute wait and now I know why. Timing is everything when coming here.", "business_id": "UzMMpUFwJhwUkHOyeXeWsQ", "stars": 5, "date": "2013-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "P96fJArqj1iGQTrtLJOxjg", "review_id": "MK2q4WdzDi4QqKZpBV8jqQ", "text": "Where do I even start?! This is my go to place for breakfast in Charlotte. I've even came here for lunch when I worked in South Park. It's the bomb. My favorite is the egg combo with turkey bacon and buckwheat pancakes. Don't forget the strawberry or Apple syrup depends on what mood I'm in. We keep saying we're going to try the apple pancake. But it's so huge. I'm scared lol. Go here! It's my favorite and will be yours too. It's one of those places where you become a regular and don't need a menu to order after a few trips.", "business_id": "UzMMpUFwJhwUkHOyeXeWsQ", "stars": 5, "date": "2015-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "JNC6wibJ_NdGlK0drLjcTQ", "review_id": "iQhKvSQPPDS3JxenJdq03A", "text": "Great idea, good menu, service is inconsistent, prices are slightly high for beer, average for food.\n\nSo there are different aspects of this place.  First off, the menu.  Their menu is very vegetarian friendly.  Hummus, spin-art dip, soft pretzels, tater tots, pizza, cheese plates, 2 veggie sammies, some salads and a Spicy Beer Cheese Soup that I wish I had tried.  So I definitely give credit to a place that tries to be veg-friendly.\n\nI ordered the Hippie Burger (veggie patty).  It was OK.  But the thing was that it came with a side, and I asked the server if the potato salad had bacon in it.  She said no.  But the first bite had bacon in it.  So, I'll just say that I was very dissatisfied with that.\n\nWhatever, I kept trucking.  And anyways, the real reason to go to this place is the beer.  I'm sure other reviewers have gone into great detail about their gigantic beer selection, so I'll keep it short.  While the idea is great, it falls a little short.  While the size of the menu is supposed to be its selling point, its just too big!!!  And it has a lot of filler.  I noticed one reviewer who said that this is the biggest beer selection in NC.  Well, maybe, but biggest is not necessarily best (innuendo unavoidable :)  It's hard to take a lot of pride in a beer bar that has a bunch of macros and second rate micros, but (if my eyes don't deceive me) not a single saison?  And barely any lambics to speak of.  Whatever, they still have some pretty good stuff, I'm just being picky, but it seems like with a little quality control their selection could go from good to great.\n\nThis one was a little tough to rate.  Part of me wants to give it a 2 (bacon), part a 3 (atmosphere), part a 4 (beer and food menu), and part a 5 (the idea).  So take that 3 I gave it according to what you want out of this place.\n\nOh yeah, this place can be REALLY loud inside.  Like uncomfortably loud, so might want to grab seat outside if that bothers you.", "business_id": "F-e-sWfVd3eCYll3BP1QFA", "stars": 3, "date": "2011-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "YqHP-3AYGkW0-Pztbh42GQ", "review_id": "HoWDsrbnD-Rn4VHkD4oRQQ", "text": "This is a cool spot to come before shows at the Charlotte amphitheater, as it is close and has just what you need if you aren't prepped for a long tailgate. \n\nThey have a HUGE beer selection.. and apparently if you try all 200 of their beers, you get a gold plate with your name on it on the wall. Granted... this achievement would take some time... but hey, who doesn't like a challenge? \n\nI had one of their Cottonwood pumpkins and it was delicious. I highly recommend that if you like beers of the fall/pumpkin variety. \n\nOur party of 6 shared an array of appetizers that spanned from brat corndogs to pizza to bacon-wrapped jalapenos, in addition to an assortment of dips and such. All were pretty good and did the trick. \n\nAll in all, a good stop before a fun show.", "business_id": "F-e-sWfVd3eCYll3BP1QFA", "stars": 3, "date": "2014-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UzqQwLskASDvCwWh0FYYsg", "review_id": "zX20JlRxU8hhsA7AFtwzIA", "text": "Friendly staff...good food...good prices, comparable to IHOP...will visit again if in the area, but would not go out of my way to come here.", "business_id": "687wG68J1XicP5YzMqKqFQ", "stars": 4, "date": "2015-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Oa9kSAF8Qe-sOL3agTuCtg", "review_id": "Xh9Js0UUW3wuilRBN3AGrw", "text": "It's now fox and hound. Great place great staff !\nTuesday's and Wednesday are good along with Friday. Pub food at its best. Drink specials every day. If your in Pineville well yu should make it your stop on the way home.", "business_id": "IbWfpebkP64zWgc9-ZVtZA", "stars": 5, "date": "2015-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w3z4wuv7CXCfl8u7Ikz23g", "review_id": "cUWHW8eFWbYhmbqmXzJHvA", "text": "The worst I have had on the road. I stood at the entrance way for 3-4 min, and that was with 3 workers, then another came up, turned her back to me and started talking to the crew. Then finally a crew member ask, how many to your guest? I then said I'm here to pick out an order... \"Oh, just go to the bar\".... Then I get to the bar, I don't drink or smoke, but that was jus t another 5-10 mins more. Even though my pice up time has past by 10mins already. So I get my food and walk across to the hotel that I'm staying at, get to my room, go to eat my food it was the correct order..... But..... The food was COLD....... TGI, on WT HARRIS, in Charlotte NC, please get it together,, you never know who is in your presence.", "business_id": "qZ1bDtcercwUw4w7trpVjQ", "stars": 1, "date": "2014-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E04MYo80yAzWbj_ny_RIrg", "review_id": "GB831jYNVhjIr8VAxF99FQ", "text": "My friends and I always meet up here when I am visiting from out of town. The service is usually mediocre but last night was absolutely terrible. One of my friends got there first and a soon a he sat down at the table in the bar area he was presented by the blonde female bartender with a $150.00 tab. He politely told the girl this wasn't his tab and she proceeded to literally scream at him and fly off the handle.  Luckily the tab owners had just stepped outside for a moment, but from that moment on we had the most terrible service from her. I ordered a margarita and it was disgusting with nothing but mixer and a few cubes of ice. The guys were ordering beers and they literally had to approach the bartender at the bar for two different rounds of beer because the bartender would not return to service our table like she was servicing the rest of them. We had to ask for menus because we were not offered any and anytime we attempted to speak with or get the bar tender's attention she just glared and smirked and acted like everything was just a big inconvenience to her. She was literally snatching money out of out hands while we were paying. Ridiculous.", "business_id": "5odPoosll36dti3xbSwuJA", "stars": 2, "date": "2013-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_2hxhko32waTcfzeUWI-rw", "review_id": "3_2DQDQOxrlosGj65ImrLQ", "text": "For the price my just warm baked cod was okay but had little taste sitting in  water. Sides of hot baked potato and basic iceberg lettuce salad were fine. Waitress Amber was courteous and attentive. I enjoyed dinner until our party of 5 was asked to leave because they needed the table. Really? We were quite dismayed and told the male cashier whose response was defensive and frankly, rude. He even said if he were here co-owner Al would have asked us to leave just as the other co-owner did tonight. Wow. If true I am disappointed, Al. Your staff just lost us as customers including the other party waiting in line who walked out after us upon hearing our complaint and the cashier's response. Boo, bad customer service and not worth the food.", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 1, "date": "2014-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "-xy0uCxgmazm7kWm5e3xZg", "review_id": "BRc7nY-Ov_y4YYLfVmn-hw", "text": "Moved to the area and was looking up local places to eat. Saw the website, saw the menu, and saw that they did carry out. So we decided to call and ask about getting something for carry out. Asked the guy the answered the phone if we could order something for carry out over the phone and come pick it up and his response was, \"Uhh no. We don't do that. Got burned too many times. Yeah.\" \nAlright, understandable (although the website says they do). So I ask if we came to the bar and ordered our food there, if we could get it to go? His response, \"Uhh. Well. No. We're kind of busy and it'll be a hassle. So yeah, no.\" CLICK. \nI looked at my phone and my boyfriend who was listening in was like \"Did he just hang up on you??\"\nHOW. RUDE. Excuse me for wanting to try your establishment. But don't fret, you won't be burdened by our business or by the people who come visit us. \nSo disappointing that's how people think a business should be run.", "business_id": "c5awCF5eu0ZkxUf_i94uPA", "stars": 1, "date": "2014-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "KePU8E7-3yewR8475eb1jQ", "review_id": "uPSvGAyK9dPa88RozO8UkA", "text": "The Village Green restaurant was great. I was having a tough time figuring out what to order and could not decide. Then, my good buddy George recommended the Prime Rib Sandwich and I could not be more impressed by the choice. I was in love at first sight when I saw this sexy sandwich. I wanted to scream at the top of lungs and express my love for this prime rib. Waitress was great and pin ball machine kept the kids in check. \n\nP.S. The cheese curds gave me a semi.", "business_id": "G1qUGBNYNS220jKlPAlFsA", "stars": 4, "date": "2015-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "1yNjafzgIe_SUUEPlZi4Fg", "review_id": "W5aERiRYB7GPIbeqX-LjIA", "text": "Surprisingly delicious and authentic. Stopped over for breakfast while over near The American Center, and was very pleasantly surprised. Jukebox, great corned-beef hash, and a delicious scrambler. Healthy? Maybe not so much, but come on, that wouldn't be authentically diner would it?", "business_id": "O_Pu4mKGOqQVlmH07Zbnhg", "stars": 4, "date": "2015-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p4f6hOp9DQOwsxBPJXhpYA", "review_id": "WvznXXdJEvj_9SfA7BCwyQ", "text": "Pretty good breakfast. Good service - I didn't wait at all to be seated or to receive my food.  I really like the food came exactly as I ordered it.", "business_id": "yYIEKwgQUHJpySOcVdCAkg", "stars": 3, "date": "2013-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "m9Id4zZtLvU8DndLGXZkOQ", "review_id": "TSe5IHeMyTtf2l2_YdnRew", "text": "I have always valued Applebee's, price wise and quality. We ordered their nachos with pulled pork or brisket, we had to go with brisket of course! The picture looked great, nice size pieces of brisket per 3 to 4 chips. What we got was a liquid with chunks of meat in it, maybe a chunk per 10 chips. I asked if they had forgot the brisket and she said she could bring out more if I liked... I liked. So she brings out this plastic cup the size of a jello cup with this liquid in it. Then went on to say that the the cooks usually put 4 to 5 of these on but since the regional manager was there that they had to go by the book and put on 2.  So congratulations Applebee's, if this is how you run your company you just lost a customer. I am not a fan of false advertisement!", "business_id": "JdCFcgw4yk4M1ZRhAhBIag", "stars": 1, "date": "2015-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "CBz3J2zFpWvwZioEv4oc6Q", "review_id": "Xw747TBYXepksY7krd6vKQ", "text": "Monty's Blue Plate Diner is one of those funny contradictions-in-terms that is a restaurant which is both good but overrated.  Overall, though, it is far and away my favorite Food Fight place and a fairly reliable spot to get a good meal.\n\nMonty's food is better than hit-or-miss but not quite consistently good.  Most of the things I've eaten there, especially the breakfast foods, have been delicious (and huge), but I've had a couple of very sub-par meals (one was so bad I literally could not eat more than a couple of bites).  The things that I ate and disliked are now off the menu, so that does say something for their ability to identify what's working and what isn't.  What I can say is that the egg-based breakfast-y menu items are almost universally good.  The \"scrambled something-or-other\" never fails to disappoint, nor does the newer Blue Plate Omelet (the one with cheddar, avocado and bacon... good lord!).  And the breakfast burrito is especially good, even without chorizo (which is how I usually order it).  As for the breakfast side items, the potatoes are just okay; the biscuits are great.  Most importantly of all, the coffee is superb (even my mother thinks so and she drinks a hell of a lot more coffee than I do).  Unfortunately, I tend to shy away from the lunch and dinner items so I can't really speak to their quality.  The pies, though, are heaven.  And it's certainly worth noting that the menu pays special attention to including veg*n options.\n\nThe atmosphere is pretty awesome.  Outdoor seating is spacious and comfy.  Indoors, the blue-topped tables are fun for making patterns with the wet bottom of your water glass.  Get a booth if you can; the tables are a bit cramped.  The waitstaff are generally friendly and attentive.\n\nThe upshot is that if you think you'll enjoy eating at a diner that's 70% greasy spoon and 30% hipster hot spot, and if you like breakfast foods and are a \"good orderer\" (you choose from menus wisely), Monty's is an excellent choice.", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 4, "date": "2009-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "011Ny5tOdSs_ZI_EzILaRA", "review_id": "HODyc6Q02dp83NvPPMRxIA", "text": "One of my favorite breakfast places in Madison.  The salmon hash is a dream.  And Tim bakes the best biscuits in town!", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 4, "date": "2012-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bucAFsIX4chOLptnVFpSTA", "review_id": "6nLWsPqHETb9ibcfQ2Yk4A", "text": "Monty's is amazing. Try to get breakfast at Monty's every time I'm in town. Which over the past 15 years has been a lot. Love the atmosphere, the staff, the cleanliness of the place and most importantly the food!", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 5, "date": "2014-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MrB_SR346mYE7gL7Ti4OOQ", "review_id": "iL_3ZjGkT5sO3n1TDQoqLw", "text": "The food is amazing!\nIt was my first time here. Saw the food ordered by the people next to us. That biscuit and gravy looks so good and so creamy~\nI ordered the Wisconsin Salmon Hash (in the breakfast item). It's like having hash browns but with LOTS of salmon in it. Never thought that they could mix so well together. For every bite, you get that smell from the potatoes but at the same time you get a mouthful of yummy salmon.\nMy friend ordered the turkey sandwich with waffle fries, which also tasted very nice.\nThe pies and cakes from the front desk also look so yummy. But we were already too full to care for dessert :( will definitely try that next time!", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 4, "date": "2015-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kYZ2ShA_IqTgsWRUI6dY-w", "review_id": "teArIkq8-OBgXjKHXSQcWQ", "text": "I have been a food fight customer and visit all of there restaurants on a regular basis. My favorite is Monty's blue plate. The meatless loaf of the gods is my favorite. Have tried other things and have always been happy. Every year they sell gift certificates and for every one hundred dollars they give you a twenty five dollar certificate. Can't beat that. I load up a gift card with five hundred and eat all year. I would never agree with the people that have bashed their places. Try it you will like it.", "business_id": "nE51k932dNFc-gClgPguVw", "stars": 5, "date": "2013-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "_xf2ECTRftPV4bzK4mGYEg", "review_id": "AeG6YnlSOoafRWkV_82UAQ", "text": "Horrible service, inedible food, tremendous swivel factor. But, my drink was fine.\n\nTheir advertised drink specials are good, but most concentrated on shots and low-end liquors (think Smirnoff for $3). The \"service\" at the bar was hard to come by, although there were at least two bartenders working.  I asked for a minute with the menu, and spent the next 20 minutes trying to flag down a bartender to take my food order.\n\nOrdered the shrimp special which was not very special at all.  Although there were 6 grilled shrimp that were actually pretty good, the rest of the plate was a mess of flavorless, watery rice pilaf and a virtual stalk of broccoli, steamed but otherwise unadorned.  At $12.99 it was definitely not a good value.  Plus, it took for-ev-er to arrive. The gentleman next to me ordered the meatloaf special, and his cafeteria-style serving arrived in about 30 seconds.  That didn't make me very happy for him, however, as it looked equally disgusting.\n\nI cannot recommed this place for anything other than a drink, although the pool players seemed to be having a good time.", "business_id": "kOXJrbuB1a1Na6sf_WQnDg", "stars": 2, "date": "2010-10-28", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "NyTsYp24p3N0u9r0Q_VUpQ", "review_id": "yYxBGpsy7IGGpC4YRi-dXg", "text": "Horrible service! Crappy food! We waited 45 min at our table before we even got any type of food.", "business_id": "FIR1SRvSAMNTO3VvNaJn2g", "stars": 1, "date": "2014-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2lLNnEeWDTTVo4wxLuu8Sg", "review_id": "P-mZdnOZtZHztzpL7r6rUQ", "text": "Stopped by here after seeing a movie across the street.  The place wasn't very busy for a late Saturday night and I think we were the only ones sitting in the bar area.  This place had some New Glarus on tap which is a must anytime I am in Wisconsin. \n\nOur server was great and got us everything we needed quickly.  It wasn't till after we were served our food that we realized we didn't have any silverware.  It took a while for our server to come back into the room but once he did we waved him down and he promptly brought out silverware for us.  \n\nWe both really enjoyed our pasta dishes.  And there was plenty of food and I ended up taking half mine home.", "business_id": "R825-NTAI2wG2C4mN-dtNA", "stars": 4, "date": "2013-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "1eH2_ObWm1O660OaEiEp3g", "review_id": "XAWBQrwO8aPNRb8AK6lWRw", "text": "We catered Hickory River for our wedding and were so pleased with the whole catering experience. They were so organized and helpful during the process.  Their staff was great at the venue.  And we cannot say enough wonderful things about the delicious food.  All of the guests really enjoyed it.  Thank you!!", "business_id": "0kRBRm5xOWclzemsLl9iQA", "stars": 5, "date": "2015-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Kuk0ody1l9jtj_dnnRc3nw", "review_id": "RdPrWP8ATWMidlkWSjlr4Q", "text": "They get a 4 star just off the buffalo chicken dpi and they are playing the pacquio fight. I'm a woman so I can't go higher than a 4.... Even if the food is bomb... A little difficult to find compared to others. Set up is a little awkward. I nearly walked past the hostess booth", "business_id": "JhEA8qHfNmIh8c6OHXnaYA", "stars": 4, "date": "2014-11-22", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "urDog6OhPoNKPJFUDob7AA", "review_id": "vbbOSBFVbAI40FtH1Yv_TA", "text": "I came back here with a friend on a random Thursday night as we both felt it was too early to call it a night, but weren't looking for a venue with dance music blaring in our ears nor were we interested in having to shove through the crowds to get a drink.\n\nAt Esquire, we managed to secure a pool table (only $6 an hour!!), got cheap drinks, and just had a relaxing low-key night.  Plus, I got to work on honing my pool-skills (or lack thereof =P).", "business_id": "pPWre8lbVAssER6CN0uWMw", "stars": 4, "date": "2009-11-10", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 4}, "user_id": "HOleI3jz1MLNUJ6cc1x0Pw", "review_id": "Brq7olx6X8-x3cP0J5Xx1w", "text": "My pub crawl compadres and I stopped at Majerle's after having a brief but terrible experience at Networks. I was definitely impressed by the modern stylings and decor. To give Majerle's some credit, they did actually honor their agreement to participate in the pub crawl, offering a drink special, but it turns out that the disgustingly sweet $3 Stoli strawberry lemonades were available to everyone. There were also no food samples. Why did we buy pub crawl wristbands again? \n\nWe attempted to make up for the slowly-worsening pub crawl experience by ordering vodka shots. There was some miscommunication between the bartenders because when the girl we ordered them from disappeared and another bartender approached us to ask if we needed help, we somehow ended up with two rounds of shots. Naturally, we didn't want to pay for both, a statement that got us quite a bit of attitude from the bartenders. The mistake wasn't entirely their fault (we could have been clearer, I supposed), but I could have done without the 'tude, especially since you can just pour vodka back into a bottle. No harm, no foul, right?\n\nAnyway, I wouldn't refuse to come back to Majerle's before or after a game, but I definitely wouldn't choose over 15-20 other places in a 5-mile radius that have great food, cheaper drinks, and friendlier service.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 3, "date": "2008-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eqAksZCqLS_wOwkj-Uf6bg", "review_id": "cc7dbVLR-RX7CWAY0hF_hg", "text": "Hit Majerle's on the way to a Dbacks game yesterday thinking we'd get better and cheaper food than at the game. Boy was I wrong!  The wings were okay, but the chef really needs to work on his/her knife skills. I ordered the chicken sandwich with sprouts and avocado. It came without any other condiments. This was a problem since it was the driest piece of chicken I had EVER attempted to eat. Luckily the waitress hadn't cleared the wing plate and I was able to use the ranch to get 1/2 of my sandwich down. I would have returned it but our waitress had disappeared after my husband didn't order a second beer.\nSpeaking of my husband, he ordered a burger that also came without condiments. He waited patiently for 15 minutes for our waitress to reappear, finally asking some other server for mayo. She also refilled our drinks. When our waitress returned with the bill and to clear the dishes no apology was made for her lack of service nor were any questions asked about the food remaining on my plate.  I would have given it one star, but they have really cold beer and great thin fries. \nSo, remember if like something besides catsup on your sandwiches you'd better ask, and stay away from the chicken.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 2, "date": "2013-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZgBoLnaT8QO7SlAv2LSyhA", "review_id": "us3PWe9dy9pC2zsPbfu1gg", "text": "Went in on a very slow Wednesday night. The place was fully staffed, though, no one wanted to acknowledge us. There were only about 7 other customers. After 5 solid minutes of being passed by, I finally got my own menu. The server who FINALLY came over couldn't have been more rude and obviously didn't want to be there. The food was good, which is why it's getting any stars. The experience itself was awful! Every person working there should be fired! Even the couple sitting next to us came over on their way out to ask how our server was! They wrote her \"comment\" on their bill. Lol . If your desperate for food while downtown then go for it, but otherwise, stay away.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 2, "date": "2015-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5J1IyvKtZ8ZGCoBlnyvR-A", "review_id": "0MwhX4AAY0Y1Xryk0vmX7g", "text": "Absolutely TERRIBLE experience. I spent over $70 here on a takeout order, not only were the traditional wings overcooked but I asked for the wings with extra sauce and recieved them with NO sauce AT ALL. I lived with that and picked off the burnt skin eating only the dry meat inside. Well, that was last night and this afternoon I am still feeling sick from their food. I'm in the military here for an event and truly upset that I will be feeling this bad over the course of my work day and even more so knowing that my fellow service members will be settling for the mediocrity of this restaurant simply because of our hotel location and lack of transportation.", "business_id": "qsWxbgQwuomXvMseg23DGg", "stars": 1, "date": "2015-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "JJFGa6WXDdhV5Zh8wMvD7g", "review_id": "T1Y23pze9IyCerDz1bkvzw", "text": "Service was great, unfortunately we called in for 20 people (xmas party) more than a week in advance,when we arrived (5:30pm) it was announced they were out of: Ribs, Meatloaf, Brisket, Half Chicken (how do you run out of chicken by 5:30?)   Keep in mind this is a BBQ joint - with no BBQ.  Enjoy for lunch if your by the capital but eat dinner elsewhere.", "business_id": "2I666dqzs1XB6xigIKa9bA", "stars": 1, "date": "2014-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jeVJIhhPh4mNYJGCW3BMcQ", "review_id": "j6JttyeTYT8kzH5f6zZwuA", "text": "Horrible service  and they don't care. Sat 15 minutes and all I got was a water and it was NOT busy.  So disappointing. Great view and place but not managed and horrible lack of service. Never again", "business_id": "1-1VcGTL3GyCqUpXZLFTZA", "stars": 1, "date": "2015-11-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "o8J-ergbGYjrUy85I_rxzw", "review_id": "KDaxtpd0oiTAxKtizhpqfA", "text": "Tucked away into an old central (and scary) neighbourhood, it was a bit hard  to find in the dark. Glad we did, though!\nGot a lemonade (made with fresh lemon juice), the fried chicken with cheese biscuit sandwich and split an order of bacon cheddar fries. The chicken was perfectly cooked with a crispy outer breading, thick and juicy meat inside. The biscuit was really tasty and flaky. It came with a few cubes of watermelon but I don't like melon so those went untouched. \nWe sat inside at the bar and everyone working inside was super nice and friendly. They have quite a few regulars and I could see why. The prices were a bit higher than I expected but they use totally local sourced ingredients and everything is prepared fresh so you're paying for the quality just as much as the quantity. \nAn order of cheddar bacon fries, a biscuit chicken sandwich with watermelon side, lemonade, and tip totalled to just over $21.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 4, "date": "2013-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EG1DRLG5ehpc86B4Cqzqag", "review_id": "UnNSznXDEb3tj4benAQ2eQ", "text": "A hole in the wall that blows the mind!  Incredible food and fun atmosphere.  We sat inside and watched the master Jose  work his magic. Unusual combinations that awe and inspire. \n\nJohn and his girlfriend are delightful and definitely NOT hipster.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2014-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rpIy_5JKPdsTqmNtQaRCSg", "review_id": "jrFovk1e7eWdEe67_h0s6Q", "text": "I'm only in Phoenix for a few days but I'm tellin ya I will be coming back here before I leave. Hospitality: the best. Ever. Food: I tried the welcome burger medium rare AND IT WAS SO GOOD. Definitely gonna try the Mac and cheese with chorizo next time. The people that work here might as well be family; they're a really tight knit group and we had two of the employees come talk to us--Mike and Wayne: really cool chill guys. You might at first be weirded out by the location (it's in the middle of a bunch of houses) but it adds to the homely feeling that I experienced while at the welcome diner.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2014-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CAYUEYtXgBesm4X11hAy0Q", "review_id": "kdsP7O7zfwetU7ewK65OTg", "text": "Coolest place downtown! I'm sure them staying open for food until 2am has something to do with it. My sister and I shared a burger after a concert and it was so good we wanted more! Next time we will not share, that's for sure! Thanks guys for working so hard at 2am at night while everyone else is having a good time! We were so thankful you were open because we were starving! Awesome place and great food, will recommend to everyone and can't wait to go back and try the fries with gravy!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "tJqUqHnwcSe2BCIPDrC3Fg", "review_id": "EQ7-CpG1630jH2vGPKIv7w", "text": "My expectations got dumped on after I came to Welcome Diner. We came for some passable late night grub. Instead we got kickass grub and some really nice drinks.\n\nOf course we come on a Tuesday - clearly the best day because it was happy hour all day. Between my group we had a Hurricane, Gin and Tonic, Whiskey Sour, a Little Birdy, and an order of Poutine.\n\nHappy hour drinks at $5-6, you don't expect much. But these staples actually hold their own against bars that would sell theirs for $10+. The gin and tonic was refreshing with the addition of lime juice. The Whiskey Sour had a nice balanced tart flavor from the fruit. And the Hurricane was basically alcoholic juicy goodness.\n\nFrom the food, literally comfort food at its finest. The Little Birdy - that in house biscuit, plus that awesome succulent fried chicken and slice of cheese - some of the best $5 I've ever spent. And the Poutine is glorious. Probably some of the most conservative, it's close to the traditional sense of just gravy and cheese, but they opt to use a peppery country style gravy and cheddar cheese. It's makes you feel a little worse and better at the same time.\n\nThe fact that this place is basically in the middle of a sketchy neighborhood actually added to the appeal for me. It's a bright spot with outdoor seating that makes you want to have a good time. Can't wait to come back.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "8p8HZNmrkUBtMx_vmW9dNQ", "review_id": "lHBUCorJ-4aTCKCqp4UDyw", "text": "Walking into MacAlpines is like stopping the clock and turning it back to the turn of the century.  You can get ice cream goodies there that you simply can't get anywhere else reguardless of price.\nMy wife and I have been here bofore but only for ice cream.  This time we ate at the little tables in the back.  Service was quick, efficient, and very nice.  Wife had a Reuben (she always has a Reuben which makes her an expert on Reuben's I guess.) She declared it one of the best she's eaten.  I had a seafood salad sandwich.  My sandwich was delicious.  \nBoth came with really GOOD potato salad.  I mean good!!\nAfter that we each had an ice cream soda.  A real ice cream soda.  Rose's was cherry with vanilla ice cream.  Mine was chocolate soda with Chocolate ice cream.  We were both stuffed to the gills when we left.\nTotal price: 30$ including ice cream, and drinks.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 4, "date": "2010-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LE6Yajmx2Db20gA99iu-IQ", "review_id": "47slLdaReOJplorNE_sBfA", "text": "I love this place.  I'm not much for the soda fountain offerings, but that's because I am always stuffed after I've eaten whatever I ordered.  I love the 'old' standbys...the egg salad sandwich and mushroom soup!  or the blt!   The wait staff is adorable.  And we get to do a little vintage shopping , too.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 5, "date": "2013-09-04", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 2}, "user_id": "2AGGIi5EiVLM1XhBXaaAVw", "review_id": "wYOn4gNjOpBezp9CS7YbMw", "text": "MacAlpine's, established in 1929, is a Phoenix treasure. It was still an operating pharmacy and soda fountain as recently as 1991, at which time the pharmacy side of the business surrendered to new era competition. Fortunately, the soda fountain remains. \n\nI'm awarding five stars, partly out of annoyance with snarky one and two star reviewers unaware of the spot's historical significance, but mainly out of love for MacAlpine's ice cream concoctions. Moreover, how can you not award five stars to the establishment where Wayne Newton was discovered in 1962? Note to the one and two star reviewers: Wayne Newton is an American singer and entertainer who is best known for his 1963 hit song Danke Schoen and more recently as a surgically enhanced Las Vegas headliner.\n\nI must confess that I'm not a huge fan of the food at MacAlpine's. How often do you read that in a five star review? Let me clarify. The menu is fine, but why would you want to risk eating a Sloppy Joe and not leaving room for a sundae? Another note for prospective one and two star reviewers: The ice cream at MacAlpine's is not hand crafted. It's basic ice cream, served in a manner consistent with the tradition of a soda fountain. Just as it should be. If you want Sweet Republic or Churn like flavors, go to those establishments and please don't write a negative review for MacAlpine's. \n\nMacAlpine's is amazingly kid friendly. Also friendly for anyone else who still has a little bit of kid within. There are roughly 100 flavors of soda from which to choose. One hundred!!! Want a sundae instead? How about Bears at the Beach, a Carousel or Dirt & Worms? They also have a variety of sundaes that cater more to adult tastes (if you must). Or instruct the waitress construct the customized treat of your dreams. The location on Seventh Street is an ideal stopping place before or after a downtown trip to the Science Center, a Dbacks game... Note to one and two star reviewers: Sure, there is a lot of dusty and worn old stuff on the premises. Just remember, you too will one day be old and worn if you're lucky enough to make it over 80 years (and it wouldn't be polite to point it out to you). I suggest you travel back in time and embrace MacAlpine's quirky nature. Be sure to budget a little extra time to enjoy the antique/vintage/retro store located on the premises as well.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 5, "date": "2015-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "p8ME1ISUazvvNBzK0v6yjQ", "review_id": "o8132p3upUAYdqvVncEByw", "text": "So sick of WAITING while tables sit empty & the \"cutsie\" little greeter girls act like they are working. No idea of organization or time management. Used to love this one but not anymore.  After waiting, kids meals came when we were done eating and they were stone cold!  The one manager is very condescending & could care less.  Could be a major reason this Applebee's is going downhill.  I'll be happy to drive to north Scottsdale or even Elliot. They both have more responsible employees & managers that care.", "business_id": "hzUOqxpcnYYBgLlrgvjQYQ", "stars": 1, "date": "2013-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M_ANCS3xO0F5B0CwrpWcCA", "review_id": "Lab_hCST5K1vWlYXEtT5-Q", "text": "Came here for a birthday party with about 13 of us from the office. Food was good and the price was right. I had the lunch combo with the 4 cheese Mac & cheese with bacon and honey pepper chicken and the California shrimp salad. Both were tasty. The best part though was the $.99 brownie bite with a tiny scoop of ice cream for dessert. Just the perfect size! Service was good especially considering how big our party was.", "business_id": "cjUmPLRT43wN9Z87A9BOpg", "stars": 4, "date": "2013-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RAWy3YCE-jwfyuGvwzUaqQ", "review_id": "lNV6j2o3PEIbo9TLd1rmrw", "text": "Long Wongs. How do I Love your Chicken Wings. Well these are pretty near heaven. The price seals the deal. Really don't need to say much else. Oh their Cupcakes rock and the Cheese sticks too. They sell other things too but why? Not so keen on the $5 12\" pizza though. Ugh.", "business_id": "BT2Vls7h6sWrCKa5gGXbKg", "stars": 4, "date": "2010-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iVeqN7iqrjY9knZSX9NbVg", "review_id": "OCHX_8VUSSl4tfJC5moI3w", "text": "The New York Sirloin was cooked well, but it was pretty tough. The online menu said they had prime rib, which is why we came, but they don't even sell it. Our server Bryan was very good", "business_id": "gQjTs4BDNYSu9oJhkEsssw", "stars": 3, "date": "2013-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UQLWaa3K8ajDq0J2zSltnw", "review_id": "BssOf1tpwKN-87scxT8cxw", "text": "This is our favorite local restaurant. We've been coming here for dinners (and a Mother's Day brunch) since mid-2009, when I found it on Yelp. It's in a nondescript shopping center, and if not for the constant traffic jam outside, you probably wouldn't even notice it.\n\nI particularly like the lighting inside the restaurant; it's very relaxed and seems classier than it should be, given the location.\n\nThe burger is great, but the chicken sandwich is easily the best I've had. I also enjoy the PCG Pasta. And they have a lot of great beers on tap.\n\nWe live in Chandler now, but I'll make the drive to PCG any time I get an opportunity!", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 5, "date": "2010-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Wazr2FXSFHNebPvTO42z-g", "review_id": "UoIkLqBCQDRtLJZxNZmO7w", "text": "We had an amazing Valentine's Day dinner here this year. All the food was amazing. Warning!: The homemade margarita is more like a shot! Very delicious but very dangerous! ;)", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 4, "date": "2013-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "lgYDQKLxFyX74M0KfSOIjA", "review_id": "5PptqWkFx92q5FGtvmfoxQ", "text": "What can I say about my local happy hour/dinner favorite in Phoenix. They effectively cover all the bases for a great local resto. Chef prepares great apps, get on the email list if you are not already, and has a perfect range of entries that cover most appetites. Food is always prepared perfectly and the bar is a great place to gather. Can't go wrong here. Planked Salmon, bacon wrapped shrimp and the Hummus plate are faves!  Get some!!", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 5, "date": "2015-10-29", "type": "review"}
{"votes": {"funny": 3, "useful": 0, "cool": 0}, "user_id": "dfprRWlHx_GRUyCY5vmCbQ", "review_id": "43Y86yoZsQoqNMHw_KU1cA", "text": "The server was off putting, but that always happens when you wear that much mascara. \n\nThe bf and I ate here after our hair person told us they had fried pickles.  We sat in rush over traffic after our day jobs and parked in a handicap spot in order to totally fuck with the system.  Actually, the paint was faded on the spot and we just couldn't tell either way.  We didn't get towed, but you might.\n\nThis place is bigger than you'd think and when we came in we were seating promptly by some chick whose probably a junior in high school and really proud of herself for working AND going to school AND doing yearbook AND trying out for the musical this year. \n\nThe reason this place is worth trying is because the happy hour, as far as happy hours goes, it's pretty fucking awesome.  Half price FULL size apps is alone worth the trip.  Since they were cheap, we ordered a shit load of stuff and tried to act like we had NO IDEA how much food we were ordering, but we did.  We got the calamari, the wings, the spinach and artichoke dip and the fried fucking pickles.  We also got some beer and some Long Islands and talked about why Waterworld ruined Kevin Constner's career.  \n\nThe calamari was mediocre at best, mostly batter, but you know, it's calamari, what do you expect?  It wasn't horrible, it was edible and after two Long Island's not bad at all.  The wings were a bit cold and we ordered honey hot but got barbecue instead (I don't send shit back, I silently sulk and drink more), but overall they were okay, especially for the price.  The fried pickles were better than the ones you get at Lucille's but you have to be a fan of fried pickles to like them either way.  The star of our meal was definitely the spinach and artichoke dip especially since spinach and artichoke dip is some Chili's Applebee's Ultra American bullshit that usually tastes like kitten vomit.  This stuff was good though, a little spicy, creamy, not to clumpy and served in an 80's style bread bowl with tortilla chips and slices of bread that should have been toasted but weren't.  \n\nOur tab was about 50 bucks with a tip which wasn't so bad for how much food and booze we got.  I'm not giving it more stars for a few reasons.\n\n1.  they fucked up our wing order\n2.  it took us like a half hour to get our food and they brought ALL the apps out at once which seems retarded when you're just ordering apps.\n3. it was fucking dark in there.\n4. soooo much mascara. \n\nOverall, I'd go back just for the dip and some drinks.  I'm pretty drunk right now actually, I could go for some fried pickles.", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 3, "date": "2010-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ss0rgALq_wJAPgqUhwdGmw", "review_id": "xxcvwDq7X9UHyg6u9oR3Yg", "text": "My husband and I love this place, the food taste amazing we have had the beef stroganoff and the white chicken enchiladas among a few other items. We drive all the way from Youngtown to eat there I would defiantly recommend it to anyone.", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 5, "date": "2014-09-19", "type": "review"}
{"votes": {"funny": 5, "useful": 4, "cool": 4}, "user_id": "Lp_Ykqfbv5Q-oyGYlMGJRg", "review_id": "HYDjzBC8FaoviM2VKwZlBA", "text": "Don't even bother. This place is a ghost town with less than bright servers.", "business_id": "JxgoluY8hnC34cys_f80xA", "stars": 1, "date": "2009-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dNrCMfRRZ5ZgRG1NeaAQxA", "review_id": "RgpScijs15xpskX3rZTn7A", "text": "Not my \"cup of tea\" -- too Yuppie for me!  Atmosphere way too \"sanitized\", and servers have little or no personality.  The food is fair but not worth the price IMHO!  What ever happened to pasta or pizza with RED sauce?  Seems they have every color and concoction known to man except red (well maybe one or two)- being of Italian descent I need red!!  I ordered from  the \"Small Bits Menu\" because I wanted a light lunch - believe me - it definitely was \"Small Bits\",  good thing they gave out bread because I needed a second helping of that just to let me know that I ate something!  My suggestion is to order from the dinner menu if you want a full meal - of course most folks are much more sophisticated than this old country boy and can figure out what most of the fancy California stuff is on the menu - sorry!", "business_id": "ut-kla-EA23nJOij_dcL0Q", "stars": 2, "date": "2010-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wSiZa_6c4VX_WMjmRLzblg", "review_id": "LZo9R7s6Xxnahj_D8S8eLQ", "text": "I think cheesecake should be at the top of the pyramid but only if the food pyramid was flipped over!!!! Went here for lunch with my Candy friend, yes that is her name and no she doesn't take her ropa off for a living. :) Anyways, I had the Thai Chicken Pasta, which I loved. She had the Pasta Da Vinci. We both enjoyed our pastas, but the main event of the lunch was our \"Dulce de Leche\" cheesecake. Ahhh....did I mention cheesecake should be at the top of the food pyramid, but only if the wide side is at the top? On a side note, I really like this place because I can connect with their history. Small beginnings and look where the business is when you have vision. Gotta love the Overtons for that!", "business_id": "2r8jGeuYvMkyP2ik_X-Bxw", "stars": 4, "date": "2010-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "LDnttgbyTsjTxgKvrrlWwg", "review_id": "8ahglKNjkfZZgALGBD2Ing", "text": "When going to this restaurant location specifically I recommend parking in the paid parking lot across from the entrance. It will give you a little yellow token that you can validate when you are leaving and will save you the hassle of trying to find a spot in this busy location. \n\nNow for the restaurant! This is one of my favorite restaurants to go to and the only Cheesecake Factory location I really like. The atmosphere is very lively sometimes noisy and most workers are very friendly and helpful. The lighting is rather dim in certain seating locations. I would say it is \"too romantic\" when it comes to the lighting if that was a lighting setting. \n\nAlmost all of the servers I have had in the past were great with timing, knowledge of the vast menu, friendliness and attention to your needs. The food is always great and I have never regretted my decision when ordering. The Red Sangria and Moscow Mules were perfect for drink choices. I even ordered an A.M.F. (a dangerously blue heavier alcoholic drink. Those who know understand) which was not even on the drink menu. I was surprised on how accommodating this location was. They even bring an extra plate if you are sharing a dish and have split it up before. I recommend the Shrimp Bistro Pasta or Chicken Madeira for a main entree and the Portabella, Avocado and Zucchini Fries for an appetizer. Those are just my go to choices. \n\nThe only problem, as with every other Cheesecake Factory or Man vs. Food competition, is trying to reach that last bite and in this scenario it's the cheesecake. This cheesecake is probably more total calories than all the food leading up to it and it's worth it. If you ask for a cheesecake to-go container you will put it in the fridge only to open it up before bed and finish it.\n\nI highly recommend this location and restaurant chain and don't forget to validate before leaving.", "business_id": "2r8jGeuYvMkyP2ik_X-Bxw", "stars": 5, "date": "2015-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aAOosIA2598fl8v2mcWoWg", "review_id": "dVTayLehNXfEfD4hgvQEig", "text": "I went here on 9/7 with an old family friend.  The food was good, the drinks were good, and the service was excellent.  Our waitress was very attentive and pleasant.", "business_id": "rVUEZpHQfWI_3kt0lBwaxQ", "stars": 4, "date": "2012-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ya4TRuI4azrp_Ju-QZMliQ", "review_id": "fXVeO3PCe87lOAgDoI-W8A", "text": "Dropped in here relatively late on a Saturday evening for a fast dinner for five, but it turned out to be nearly an all-night ordeal.  The service was just awful, what with an inexperienced waiter and staffing that did not match the number of people on a Saturday night.  Our order was simple- burgers, etc., but it took nearly a half hour to be served.  The restaurant is relatively large but only one small area was open to guests and that made it very loud and gave a crowded feeling to dinner.  When we did get our order, there was little or no  follow-up with more coffee, etc.  The evening was full of apologies and reassurances.  It may have been a fluke, but that evening, the place was not even up to  the moderate service standard at most Coco's.  The coconut custard pie was excellent, though, when it finally arrived.  I'd give them another try, I suppose, but there are lots of other places in Phoenix.", "business_id": "2gMx4KnXbNtpoCuVCmyo3g", "stars": 2, "date": "2008-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "pgGz8bNMXQPMi-4A9pr1rQ", "review_id": "AS-F_eFCAbqf0Rb0WdlrWA", "text": "Tired of the $15 burgers in old town decided to log a few extra miles to and wander over to a tried and true favorite.  It happened to be $.95 cent taco Thursdays and while my friends indulged in several of the other menu items I went with taco's which were a great value and 2 filled me up as they were accompanied with the right mix/amount of lettuce, tomatoes, cheese and some spicy salsa but I'll admit my friends grilled chicken sandwich which came with a generous side salad looked tempting and will be on my list for my next visit.   For an Arcadia dive bar \"if there's such a thing\" this place is clean, servers quality food, and has had a nice remodel since first discovered many years ago.", "business_id": "qz4ZOcv-840UjfCEYI4qZg", "stars": 4, "date": "2015-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "9ebaAGLVIgGKpDLFwmvaiQ", "review_id": "wx5414EUXPZQJcjG98xIjA", "text": "I have been to this place for drinks and possibly food over a year ago. It was time to stop by for a casual dinner. I was eating light this night so ordered a salad which said : field greens, apple, berry, fresh mozzarella, and I added chicken. This dish was an embarrassment to salads. Hardly any greens, maybe half a chix breast, and mozzarella u could barely notice. \n\nHusband had chix parm: nice size dish he liked it. \n\nThis is a cool place to have a drink but the food NO WAY. It is not memorable and there are too many other food places close by.", "business_id": "To5CjntVFawXM_hpAhvVdQ", "stars": 2, "date": "2011-11-28", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "TZbyfvyV1Bx9H48pwVLaJw", "review_id": "mSUrg5QQel-kCppvihGPqg", "text": "I had great expectations for this restaurant as I have stayed and dined at various Point Resorts and restaurants in the valley and heard nothing but great reviews for Different Point of View. I even liked the cleverness of the name and was looking forward to a nice experience, but unfortunately I was sorely disappointed. While the view and atmosphere were very nice our service there was inexcusably poor. We ended up with a guy named Larry who was extremely inattentive, unfriendly, and all around just unprofessional. When he would finally come around he would walk away literally after two minutes WHILE we were still speaking. He was curt and abrupt in his responses and almost hit me with a knife when he dropped the silverware and did not even excuse himself or apologize. Unfortunately his brusque, rude behavior was not merely limited to our table. However, the hostesses, bussers and other waiters around us were all great, so much so we were tempted to move to another table. Maybe he was having a bad night, but for this type of establishment and for the amount of money you're laying out you would expect half-way decent service. The food was hit and miss. The Kobe short ribs were great- flavorful and tender- the tangyness of the balsamic reduction was a nice foil against the mild sweetness of the perfectly creamy polenta. Consequently, we had great expectations for our entrees- if the service was bad at least our food would be good, but alas to our dismay again we were somewhat disappointed. The central elements of our meals, the steak and halibut, were both flavorless and overdone though the supporting casts of sauces and sides were very flavorful and well prepared. The shrimp with the lemon fennel reduction was fabulous, but it could not mask the dryness and lack of flavor in the halibut. The steak was tough and flavorless and when sent back returned somewhat less tough, but still flavorless. Definitely not at all in the caliber of a Ruth's Chris, JnG, or even Fleming's or the Keg. The creme brulee was nice though nothing outstanding and the chocolate amandine had a flat pre-packaged taste- after a few bites we left the remainder. There are too many other great restaurants in Phoenix with fantastic views and ambience to waste this type of money on poor service and mediocre food.", "business_id": "3Zsjlum5kl5N5KV712aTMQ", "stars": 2, "date": "2009-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Ej5PQiLP0rKi91OJ1pzyhw", "review_id": "OAuUlDqvLGhMhYF-q0jPoQ", "text": "This review is for the Terrace Room downstairs from Different Point of View.  Yelp doesn't seem to have a separate listing for it.  This review is for the bar/lounge and wine list.  Although I do get food when I am there, they change the menu often so i don't feel it's fair to review food that won't be on the menu in a few months.\n\nI have been going here for five years now and I never get sick of it.  They have a fabulous wine list and one of the most breathtaking views in all of Phoenix.  This place is a hidden gem and I'm always amazed when people say they have never heard of it.\n\nThe bar/lounge is completely walled with glass so you can see the city view from any seat within the bar/lounge.  The seating outside is a fabulous set up.  You can sit in a circle seating area around a fire pit, at a communal couch area, or at separate tables right at the edge of the mountain.  There is also a hidden seating area off to the West side that gives you a completely different view of the city.\n\nSometimes in the winter the chef will make homemade marshmallows infused with different liqueurs.  The cocktail servers will give you sticks to roast your marshmallows at the fire pit and they also provide different dipping sauces.  This is one of my favorite times of the year!!!  Don't miss out if you are there in the winter time!\n\nThe only complaint I have about this place is that it can be rented out so it is frequently closed for private parties.  ALWAYS CALL AHEAD TO  FIND OUT IF THEY ARE OPEN!\n\nThe staff is always amazing.  Bill, the manager, is always making sure you are enjoying your visit and April and Richard down at the Terrance Room are fabulous! \n\nDon't miss out on a drink and view at the Terrace Room!", "business_id": "3Zsjlum5kl5N5KV712aTMQ", "stars": 5, "date": "2013-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ez4crqA1jxTLP5v8nxq2oA", "review_id": "Igh_quefH6VahneaKDz0Pw", "text": "The view is amazing.  Menu is really blunt, best dish  would be duck confetti. Nice place to go on a date.", "business_id": "3Zsjlum5kl5N5KV712aTMQ", "stars": 4, "date": "2015-10-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Uv3RSyAICxvML4-T2WMZkg", "review_id": "5ca1fkuJ3gX7c7TP030TUQ", "text": "I came for lunch. Very clean,  nice ambiance, the food was very good. But the service was slow.  We had to get back to work and we were late getting back.", "business_id": "F-ykHfGY9lWr12OJ_Ofy7A", "stars": 3, "date": "2014-09-11", "type": "review"}
{"votes": {"funny": 4, "useful": 6, "cool": 6}, "user_id": "8dbRf1UsWp2ktXHZ6Zv06w", "review_id": "GCEDOhAAS39fkTRFzM4rxQ", "text": "A girlfriend of mine told that a few of them are getting together for some drinks and laughs and that I should join them, so off I went to meet up with them at Gallagher's. When I got there I knew I was lied too, this wasn't just about getting together and sharing come laughs.\n\nYep my friends were there, but there was no laughter, they were deep into their football games. They are some sport lovin chicks, but the cowgirls where losing (why did they expect it to be different) and they needed to drown there sorrows in beer, well not really I was the only one who ordered a beer, got me a Blue Moon, which was cold and great tasting! \n\nI did order there bake potato, random thing to order I know, but I did. Ordered the veggie baker; it had bell peppers, onions, mushrooms & cheddar cheese. It was good. Also ordered a gooey chocolate chip cookie Sunday, oh man that was delish; a gooey warm cookie topped with ice cream & chocolate syrup, man that was sweet heaven! \nGallagher's had great service, and they have lots, I mean lots of TV's, you can catch whatever sporting activity your heart desires! It was a fun time with my friends.", "business_id": "PkBkqQpAoeX3Ogo5HBthQg", "stars": 4, "date": "2014-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r-Won07YVdp6iyOGhQPl3A", "review_id": "kgfiHtP57gAhzOvawlEi7Q", "text": "I've decided that this is going to be my new Sunday football hangout.    Nothing fancy, kind of a dimly lit place but they show all the football games, have a solid, good-quality menu, the burgers are decent, the prices are low, the service is top-notch and I can sit back, enjoy whatever game I'm watching and not be bothered.     I've been to their location on Thunderbird as well and this one by FAR is a lot better.     Not sure why it is, but the service seems better and the food sure as heck tastes better.   They make some pretty good BBQ here as well.     Not a gourmet dining experience but they live up to the expectations of a sports bar and then some.", "business_id": "vFJmFFfPVhHkC3bWOeZnNA", "stars": 4, "date": "2010-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vYOQtYfrTIf5F-ggG4kKRQ", "review_id": "i_GjzpXDPI1wiezM0zK-hg", "text": "This is a solid sports bar. Very local and charming. They have a model train that circulates just below the ceiling on a suspended track. They are known for the Philly cheesesteak and it didn't disappoint. It is thin sliced prime rib with onions, mushrooms, jardinara peppers,  (jalapeños are optional)and all a hot a gooey delicious mess. The bread is fantastic on this sandwich. They have a great. Homemade spicy mustard wings sauce. They have a nice assortment of beers on tap. They have very good service and personable waitresses. Lots of TVs to catch all the games.", "business_id": "vFJmFFfPVhHkC3bWOeZnNA", "stars": 4, "date": "2015-11-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "NJp1gOlPGya_iw_NIXe45g", "review_id": "MeLbNgL7oBgSN6wzA0F1Rw", "text": "I love this place!  We have eaten here multiple times and have always had great service whether it's middle of the week or a slammed Saturday morning breakfast. Food is always out fast and hot. Keep in mind it is a Denny's after all and I've been to them all over the country and have to say we love coming back here!", "business_id": "UYHa5iKUddnZrlxF7taI0Q", "stars": 5, "date": "2015-09-26", "type": "review"}
{"votes": {"funny": 3, "useful": 6, "cool": 5}, "user_id": "C6IOtaaYdLIT5fWd7ZYIuA", "review_id": "tEtF2VPVmRavAtvtOMZJIw", "text": "This year marks the 15th Year 40th St has been open. This year marks the 1st time I have been there......That is a sad thing. This place is exactly what I want. \n\n1. Homemade food. I am not talking about just the soup either. \n\n2. Small and friendly \n\n3. Good prices and portions to match \n\nI had the meatloaf open faced sandwich served with mashed potato's and corn. It was the best I have had in years. Maybe the best ever. They wrap the ML in bacon while cooking it. It gives a good flavor to the meat and they even slice some of the bacon in with the meal. \n\nPS the biscuits look amazing.", "business_id": "2RxIERKZi5gjLW76MkFotQ", "stars": 5, "date": "2008-10-31", "type": "review"}
{"votes": {"funny": 16, "useful": 31, "cool": 26}, "user_id": "RsUNADZTrJ5xFXVMXJC1MQ", "review_id": "JjfKvjebodUFx1LSm1l5xw", "text": "I probably wouldn't have come here but for some reason I was reading the Yelp reviews and bookmarked this place. Checked off. Seen this place before and very very unassuming cafe in the strip mall. \n\nWe walk in and not sure what to expect. One of the waitress tells us to just take a table. So we sit down and there is crumbs on the table. Wife is freaking out (Scottsdale woman)  hahaha. One of the customers gets up and says I will get that cleaned up for you. Man is this place different. It seems something like the 60's or maybe like home. Waitress are just talking to the customers. Joking and everything. Just like home. Not your normal cafe. \n\nI ordered the ultimate skillet. It had home potatoes, bacon, ham, sausage, onions, peppers with eggs on top with a side of English muffin. I really love home potatoes. I thought it was pretty good. Tasty, huge portion and filling. Not bad. \n\nMy wife for the Caesars chicken salad. This was very very different salad than other places we visited. Nice chunks of chicken, bacon, and egg. I was able to sneak a few bites and it was really good. It comes with Texas toast. My wife really liked the salad and toast. Usually she doesn't eat the bread with her salad but not today. She really like it. \n\nAs for the service, these servers are like your family. Seemed like your aunts or something. Take you order, fills you water glasses and coffee but never asked how everything is cause it's seems like home. Like family. Very homie place. \n\nOnly talking at this place was with the waitresses. My wife was a little uncomfortable cause it's such a small place that everyone hears your conversations so no one talks too much but with staff. \n\nI liked the place. Huge menu. Let's put it this was family atmosphere (your treated like family), good food, huge portions. If you come here just be ready for a different environment. Loved it that on the walls are pictures of veterans. Leave your Scottsdale attitude out the door and just enjoy this different cafe. Enjoy.", "business_id": "2RxIERKZi5gjLW76MkFotQ", "stars": 4, "date": "2015-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XZikpyc0OdDHhXfT36XvzA", "review_id": "Bw_hiCTAnS_IKUF-XvPXIw", "text": "I hadn't had whataburger in over a year because they don't have it in Las Vegas.  This location wasn't busy, staff was helpful.\n\nIts great that they have spicy ketchup all year around now!", "business_id": "GTVneiUeIyRL8Wa_WmEQ0g", "stars": 5, "date": "2015-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "H2cZDkDiVszLutRl5_4eRQ", "review_id": "Jz7Co1mPWImMcJJuz171kA", "text": "This place is a gem! It offers separate restaurants for breakfast, lunch and dinner. Came here on a Sunday for brunch which ends at 1pm. You just have to be seated by then, and from what we noticed, a few came in after that and were able to be seated.\n\nThat being said, it would be tough for a wheelchair or elderly people to make it to the brunch restaurant. It is all the way in the back of the property and the parking lot is across the street. The rest of the trek is gravel and dirt.\n\nEverything they serve here comes from the property you are at. You can truly taste the freshness and your body will thank you. I had the chorizo scramble and it was excellent. A very filling meal, the flavors were vibrant and the atmosphere wonderful. For drinks, they have a self serve, station with lemonade, teas, coffees, etc. The speed of te service was excellent and very courteous.\n\nThis is a great place for groups or a couple to dine!", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 5, "date": "2009-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yKVwsx01p1IPvIHR4UNLfQ", "review_id": "ezUpPcjT_Q-mhY6gIcBYGQ", "text": "The Farm has such a special place in my heart! I love going there for lunch and feeling like I am getting out of the desert and the city. It is so peaceful and quiet there. I have only been to Morning Glory and The Farm Kitchen, so I can't speak for the dinner restaurant. My cousin also had her reception here for her wedding and it was beautiful!", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 5, "date": "2014-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MeMcg3wyRAEjq3Y5apNTnA", "review_id": "eCiIoJ91FPIJJCVDXjn03Q", "text": "Pancakes are sooo good!!", "business_id": "lq2iZK7epi23byzcejjqTg", "stars": 4, "date": "2011-10-28", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 4}, "user_id": "AirVzN1BVQBmq5zY0YMNYQ", "review_id": "ietM2-8PYwrFWZxcSjv59g", "text": "Keegan's is still one of my favorite places and I have the receipts to prove it.  Yep, three times in the last four days. Don't judge. =) \n\nCheck out the Football Gameday Specials! First beer is $1, happy hour prices after that. Plus, the 12oz M.O.A.B (Mother of all Burgers) is only $7.95 with fries! Monday, Saturday and Sunday during college or pro games!!\n\nSee you there!", "business_id": "SgTjnyElc26gPUghVuCuSQ", "stars": 5, "date": "2010-09-27", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "5S9qsoHWUcMeahMtBwuX3g", "review_id": "Rl-x7DdxO9EF7RZ39SCLHA", "text": "I like to think of this place as a step above Applebees but overshadowed by its cooler big sister Chili's. It's the middle child that never gets any attention and in this case, we really should just forget about it because its only contribution to society is to make us feel pathetic as we leave with our wallets empty and our stomach even emptier. \n\nWe had the Yankee Pot Roast. If the Yankees liked their food made with 3/4 of salt, they got it just right. I ordered the pasta and if I were to describe it, it's more of a watered down cream with fusili. Maybe the other location on Camelback is better, but this is the first time we've ever eaten food where it was so bad, we were laughing as we force-fed each other lovingly.  We laughed even more and cried in a fetal position at the same time when we got the check. It wasn't that we weren't expecting the price since we did order an appetizer and drinks - it just hits you that you seriously ate horrible food and can't do anything about it.\n\nI mean I guess you could, but nevertheless you would still lose because you're just a bitter jerk who still ate a horrible meal. You're better off going to Boston Market across the street.", "business_id": "SgTjnyElc26gPUghVuCuSQ", "stars": 1, "date": "2015-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kw8py3MrNYdCyWrNvL5M6Q", "review_id": "5He4H_aT6oErsSHzxDpHuw", "text": "Awesome place.  Great staff, very friendly. Service was top notch.  They do free \"seconds\" on the soup....awesome!   Food was good. Plenty of choices. Reasonable prices.  Can't go wrong.", "business_id": "fsQFHGMbqWf7MT6KYMuJxQ", "stars": 4, "date": "2014-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yuPBS3fak77lgwO_9SXVYQ", "review_id": "7WfCXlESsKwxIq4GqtnivA", "text": "You know, the older I get, the less and less I'm inclined to eat at chains. Even if they're pretty rock solid. Why you ask? Because I suppose it's bc mentally I know that if I fly to any other major, metro city, the same chain will be there and that's not fun to me. Sorta like eating vanilla ice cream every damn day.\n\nBut, CPK does do it up just right. Salads are phenom here and service is pretty impeccable. Always, always a fan of patio seating as well. Clean and good quality go along way to me.\n\nOk CPK, you're a chain - I ain't mad atcha I guess. XOXO!", "business_id": "UpYva_zhJ6pRGfdTruIYIg", "stars": 4, "date": "2013-11-04", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "lbpUMHGpeCT06sZXFraOZw", "review_id": "PpwaG-s6RO1gRRKNuvJjIg", "text": "Came today with the whole family and from the service to the appetizer it was a disaster.  We left and even had to go up and ask to get our check then we left and high tailed it to the Yard House.  Ashley was the server and she was either way to busy or just didn't care. Fries greasy and customer service poor. You can tell when management isn't there.  Where were ya' Christian?  Last time I came in it was fixed to be good because you were there and we had good service - not the case today. Pass if you want good food and customer service.  I left out that when we went up to get our check Ashley was texting when we had to continue to wave across the bar just to get our check..... Hmmmmmm", "business_id": "e0vubCKi8KD8zC2C6FdbuQ", "stars": 1, "date": "2015-09-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "z30hYvXYGme6uU4fpzaisw", "review_id": "uUBQ4kNWqhUP7YogSCgIPA", "text": "Me and a friend of mine frequent this place a few times a month. We always sit out back on the little patio and enjoy the weather. We usually go on Friday nights and this place is always dead. I would not recommend going here if you are looking to socialize or party it up at the bar. I like that about it though. We can sit on the patio, chit chat and enjoy our food and not be bothered. \n\nWe usually get half priced appetizers for happy hour and a few drinks. It ends up being pretty cheap. I love the nachos! They are really good here and they put lots of crap on top and don't skimp! \n\nCouple of negatives...service tends to be really slooooow on occasion. We went here last Friday and our server only came out twice and we had to hunt him down to get our check and then another 15 mins later when he never came out to grab the card to run. (he was pretty cute though and apologized, so all was forgiven!) Other bad thing is on the rare occasion when there are other people on the patio, it gets kind of awkward because the placement of the tables are so close. \n\nOther than those few little issues, I really like going here to grab a bite and hang out.", "business_id": "OmxAvtMyIvCVm16NFIOOUA", "stars": 4, "date": "2008-10-30", "type": "review"}
