{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0kRiaCs6damnnCpjPNOqRw", "review_id": "DtWoMT9VcFX9ycdZFpZoow", "text": "Don Don is atleast as good as (although I personally \nhappen to think better than) the majority of \ninexpensive Chinese places best equiped for \ndelivery and take out.  I've frequented many \nsimilar establishments in different parts of the\ncountry, and have also spent a few years in Japan.  \nSounds odd, but they have some amazing Chinese\n food out there.", "business_id": "SQ0j7bgSTazkVQlF5AnqyQ", "stars": 4, "date": "2011-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "1a62xckjW2f4F_ol92QDug", "review_id": "gAB0hSXO4IxI99692w_0DA", "text": "Ok this is my first yelp review, I never left any reviews for other restaurants, but I am writing it because I want others to know about this place more.\n\nRestaurant run by family. very friendly, clean cooking environment, and Great food. I would come to this place again and again whenever I visit Pittsburgh.\n\nIts less than 10min drive from Kennywood, if you are visiting Kennywood you should definitely try this place.", "business_id": "iBZRphMDFcS2aMbawc1OvA", "stars": 5, "date": "2014-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ekbz0z0tlpwF4m8_t8mTDw", "review_id": "t25iuWPRe1ABLV59jsuGVQ", "text": "Horrible food. It's hard to get a good Chinese restaurant around Pittsburgh. I wouldn't recommend to my dog", "business_id": "81sqVj0xHyJXGYT0ip5fmQ", "stars": 1, "date": "2015-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KSS6v5fcZNoelu4eEZCFcw", "review_id": "s23AVxUQqNmA13gx1WLFbw", "text": "Their food is delicious!  They also have fresh sushi. The only thing I've had that I have not cared for is their hibatchi. I had the hibatchi chicken and my friend had hibatchi shrimp. They were both dry. We were disappointed because normally the food is outstanding. Lesson learned. Stick to the Chef's specialties and the sushi.", "business_id": "vs3UrHaSnzFOxmFU2UAfxQ", "stars": 4, "date": "2013-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0RNjwIoruU0aQ3yMGiZBdA", "review_id": "-aV5zfLmDRXUT7xSSeIOjw", "text": "Best Crab Rangoon! Haven't had a bad meal from there yet. Fast delivery.", "business_id": "7QBJDNVH6VPAStSvOM_lZA", "stars": 5, "date": "2012-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AdOk5GS-93PX4nk4wr_LWQ", "review_id": "blelyoX-kN2O0xysuGU8bg", "text": "Not ordering here again. Very rude and food was not worth the hassle. Didn't get what I ordered and was yelled and hung up on when I tried to resolve. The food was very greasy and just ok, nothing special. I will not bother ordering there again, the food and the customer service weren't worth it....", "business_id": "Zm9uQ4SYpZzUb3epDMeb7A", "stars": 1, "date": "2013-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "US1xYmsm4L3kh_5Sck2Byw", "review_id": "tq1svw8oQxDX6zOOikhCDw", "text": "I last reviewed Soho Bistro in mid-2011, and last night my young daughter and I popped in there for dinner before a show.  I thought I'd provide an updated review!\n\nThe place is still awesome.  The atmosphere is still peaceful and quiet, and the wait staff efficient and polite.\n\nWe ordered four items off the menu: scallion pancakes, crab wontons, tangerine chicken and sesame shrimp.  The scallion pancakes were just as good as they ever were.  The crab wontons were a bit disappointing - we were expecting something closer to crab Rangoon (based on the description) but these are more grainy than creamy.  The filling almost looked like cous cous or quinoa.  Despite this, we ate all but two of them, so they were still good.\n\nMy tangerine chicken was OUTSTANDING.  From first bite to last, it was delicious and is my new favorite thing.  My daughter's sesame shrimp was also delicious (she let me have a bite) although she thought it was a little too sweet.\n\nStaff was quick to refill drinks throughout the meal, and our total bill for dinner was $38 - a relative bargain considering we had two appetizers, two entrees and multiple refills on my daughter's soda.  \n\nI continue to recommend this place for good Chinese food at a great price.  Can't wait until my next event uptown so that I can dine here again!", "business_id": "rT-iPtIXMKj3dTcl87lbOw", "stars": 4, "date": "2014-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WDeusx9SLtGa_JUKgsEKZA", "review_id": "7lCzg7P7DiLieHxf5Li_Xw", "text": "Delivery was excellent,  and arrived piping hot. When I ordered and it was stated delivery would be at least 40 minutes I had my reservations. But the food was well worth the wait.", "business_id": "cibtubYc6gd8T6Y-nPPByw", "stars": 5, "date": "2012-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "smidHR3NEAnd6UJUl_6h0g", "review_id": "JWXh_P6lOMv2SmGpp13OWw", "text": "My friends and I were looking for a decent but relatively inexpensive Chinese restaurant and we found it in Taipei South.  We arrived around 730pm and while the place was bustling with patrons, we were promptly seated with no wait .  The service was extremely efficient, with appetizers and soups brought within a few minutes of ordering.  There was a bit of confusion when ordering some sweet and sour sauce and this took quite a while to figure out, but other than that the food was well worth the prices (ave of about 6 or 7 bucks per dinner!).  I'd definitely go back for some inexpensive, decent Chinese!", "business_id": "IKUVWL75eSoC71G2fBphmA", "stars": 3, "date": "2010-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4522K1jh68XVpUsPh-5I7A", "review_id": "MrqxEOmdxWKg6LAW8Wfv_g", "text": "This has to be my favorite place to eat.  The food is always consistent and worth waiting for.  I have never had a bad meal here.  I crave the orange peel shrimp occasionally and have to go get my fix!  Their lettuce wraps are the best around.  I've tried them from other restaurants and they don't hold a candle to PF Chang's.  \n\nIt is very moderately priced and affordable but the ambiance of the establishment gives you the feel of a more upscale and expensive dining experience.  If you haven't been yet you have to try it!", "business_id": "4CPrhBc4Ado90fj7PG6jrA", "stars": 5, "date": "2011-10-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "9P_5UGjc3t3Bo_yJ5A7iAQ", "review_id": "x8DOYPdGukQ6sb8S33oIUA", "text": "This restaurant has been around for quite sometime. This is the first time I've eaten from there though. I was in the area last week and wanted to bring some takeout home. I called in and got the yellow chicken curry with veggies and the steamed veggie dumplings. The curry was nice and had a little kick to it which I appreciate. It also came in a two-parter take out container; rice on one side and saucy curry in the other like that. The steamed veggies, not my favorite. Baoding, like Akhana, serves their veggie dumplings in spinach skins/wontons and I just don't like that. They aren't sticky enough. Skip those. \nOverall, fast, hot, ready when promised and friendly. I'll go back but only when in the area I think.", "business_id": "s-cFWOk9LXXZCrm4lKpjEg", "stars": 3, "date": "2014-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TJjAvV6-MizV-R0DDgwB0Q", "review_id": "c80LpTjas6oRojNd2L0jYg", "text": "Wan Fu is excellent. The food is atypical of your usual Chinese restaurant. They serve an outstanding variety of Chines food. Nothing here is common place.\nThe service is marvelous.", "business_id": "i-tKO0n-1Tq6sTFUrhg9-Q", "stars": 5, "date": "2013-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7te0-N4hkrcZTTGtAcHuzw", "review_id": "PxsUc3ZZCW93MeSJBT49nQ", "text": "I was not impressed.  The food was bland.  And we left hungry.  I was under the impression that this place was really good because it always seemed packed and they've been there forever.", "business_id": "i-tKO0n-1Tq6sTFUrhg9-Q", "stars": 2, "date": "2015-11-13", "type": "review"}
{"votes": {"funny": 4, "useful": 6, "cool": 1}, "user_id": "-_1ctLaz3jhPYc12hKXsEQ", "review_id": "wa0oH2Afl_Xbj7pyMdMAkw", "text": "The buffet is of a good size, and it does appear to be kept relatively fresh, but I'm going to have to say that the quality is... questionable.  I'm not trying to say that the food is undercooked or anything along those lines.  Just that when you bite into a piece of teriyaki chicken on a stick, it should generally taste like chicken (or at least a meat that tastes like chicken).\n\nDoing so here tasted like, well, something else.  In fact, just about everything here tasted like something else.\n\nAgain, it wasn't that the food was bad or out-of-date or anything.  It is just that everything - meat, vegetables and even sauces - didn't taste quite right.  It's quite possible that the taste buds in my mouth were off or something, but a bite a short while later at the bakery was just fine.  So my money is on the Lotus Buffet.  You can draw your own conclusions.", "business_id": "rHl7fCXz78i89rEaflTPvw", "stars": 1, "date": "2009-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0y6iB4sPScZKHSHUXCdVGA", "review_id": "EaAKMbf9Vs5Nxd0FYv-ZkA", "text": "Chicken teriyaki is good. Ordered cashew chicken, hot and spicy beef and Kung Pao chicken. Sauces were extremely bland - no flavor and zero spice in the hot and spicy beef. The beef was slimy and had the texture of pre-chewed food. Do yourself a favor and go to Masa right next to the Bi-Lo across the street.", "business_id": "51Tvv-QOiFeEcELzDuO1fQ", "stars": 2, "date": "2012-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TbrTV-oYi-jYXMgAWZoEQg", "review_id": "AenbDe8_NOlo_x55lYwdkg", "text": "I've been to Imperial Gardens countless times. It's one of the few restaurants in Madison that's not a burger joint that's not \"too spicy\" for my Mom. So Imperial Gardens has become a go to sort of place when there is a reason for a family outing. \n\nOn to the meal, there were six of us (ironically dear Mother didn't make it). We ordered: Grilled Pot Stickers, Green Beans with Garlic, Moo Shu Chicken, Governor's Chicken, Beef Epicurious, Sweet and Sour Pork, Eggplant with Garlic Sauce, and some sort of Shrimp Dish. \n\nThis isn't a Chinese place with bold flavors. But it's consistent. Each dish was distinctly different but mild, even the Governor's Chicken.  Surprisingly the best dishes in this mix were the simplest, the green beans and the eggplant. \n\nThe menu seems to have recently been reorganized. It seems smaller but all the usual dishes all seem to be in place. Also, you can order brown rice in addition to the standard white rice. If you're looking for the Classic Americanized Chinese Restaurant Imperial Palace is your kind of place. \n\nHopefully dear old Mom will make the next outing. We did get an extra order of dumplings to go with the leftovers for Mom.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 3, "date": "2014-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p4ySEi8PEli0auZGBsy6gA", "review_id": "_0G7KGx5ZP8gEwknrzT68A", "text": "Pretty bland for Chinese take out.", "business_id": "NDAxF0_RCZBQedVO_d5WnA", "stars": 2, "date": "2010-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "fl3z1szzUcpzuWEiy2mr3g", "review_id": "ZtojsL_qtqtitqPCnGc5jw", "text": "Excellent Ma-Po tofu, I usually do not order this because of how simple it is to make at home, but was very glad that I did. The service is always extremely good. Speaking of which, the waitress I have had both times I visited is one of the best wait staff I have had anywhere, including much pricier venues. \n\nPrices are great and everything I have tried is very well done.", "business_id": "uzJ2Vefb951El2oneQI8NQ", "stars": 4, "date": "2010-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HJZfQadmdoa9qsZ4R1xEGQ", "review_id": "ZNaNLRP0ifmW16ya6zaCcA", "text": "My preferred place to eat Chinese on campus.  Although, I will admit that I haven't eaten at every place around town, there aren't too many great Chinese restaurants around here (this does not include buffets).  Their General Tso's chicken is amazing.  Giant quantities for prices a bit on the high side, but not too bad considering how much you get.  Anything bigger than a small and you're guaranteed to take it home in a doggie bag tray thingy (are the trays seriously called doggie bags, too?) unless you're sharing it with someone else.  I usually only order the General Tso's or Vegetable Lo Mein (my default Chinese food preferences), so I can't really say much about the rest of the menu, but I did order soup there once and they gave me it in a giant bowl, with a decent amount of noodles.  It tasted okay, but not great.  It can get kind of crowded in there with limited seating and the atmosphere isn't too great, but it's acceptable.", "business_id": "6M1F5AECDtWff1Tu3uLEWA", "stars": 4, "date": "2008-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "YTC7VLRjjgvGgMy_X0RgeQ", "review_id": "ksVlb3n30DAHQqJi5H-inQ", "text": "This place is under new management and is much improved. Huge crowds, but fast takeaway service.", "business_id": "u06X5C_pIAVuOXOznIcPYw", "stars": 4, "date": "2012-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bz72H3uYMxkcVs1RzwlKog", "review_id": "Vzwp0WyY_KR3NVhohWmC-A", "text": "I can honestly say this is my favorite Chinese restaurant I've ever been to and I've been to LOTS. You sometimes go to restaurants where they have the picture of the food and you get it and its completely different. Not at Number One. Every time I order it comes exactly as expected and exceeds taste wise. The fried dumplings are a MUST if you ever visit this place. \n\nCouldn't be more happy with their service either. I order for pick up and it's always ready right on time.\n\nPERFECT.", "business_id": "pygZcdPZ-XMp8CY8_5tE8A", "stars": 5, "date": "2013-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XbR2Fx-waSWhLNPE5TK8Dg", "review_id": "JWthvREX3d3X9OhjbhVKiA", "text": "I must say Fate was the only positive thing I gained from an otherwise awful date. The food was fantastic. I had the green chicken curry. It had the perfect mixture of spices and it was not too spicy for a curry dish. I wasn't  expecting the curry sauce to be creamy. The sauce had a light green split pee hue, but despite the odd color the flavor was amazing. The meals were fairly priced. I believe my dinner was around the same price as my first drink...$10.00-$12.00. I enjoyed the artistic ambiance. The staff was polite and our food and drinks were delivered to us promptly. I have read other reviews about the hostess's being rude...luckily I haven't experienced that. Even if I had e negative staff experience I would still recommend Fate for the food alone.", "business_id": "VsO_rhXi5lgbaGxNwoEZsQ", "stars": 5, "date": "2008-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cbekF4ugVTPgox62gTvouA", "review_id": "t-WDk_5PrWk0If7L6pPUfw", "text": "There was a time when this place was decent even if never great, but it was cheap and the vibe was cool.  But now the dinner menu prices are what you might pay at much nicer Chinese restaurants, and the TV on in the dining area only reinforces the impression that some bad decisions have been made.", "business_id": "ykfTh6HI219NoMsWBxulxw", "stars": 2, "date": "2014-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SidlCcmFSTZGb5mlgGmFfA", "review_id": "LJoMuvVgW4OFORkCoDt83A", "text": "Fabulous flavorful, food with a great balance of heat, spice and complex flavors.  I ordered \"off menu\" their Szechwan cucumbers which were fresh, crisp, slightly salty with a great hot oil and many red chilies tucked into the dish.  I added a little of the table chili sauce to compliment the heat already in the dish and it was a great appetizer.  I ordered the Water Boiled Beef ... even though it came with a warning to \"some customers\" that it might be too spicy and oily ... and it was delivered bubbling hot with lovely slices of cooked beef and vegetables in a wonderful stock with a chili oil and pepper flavor that was perfectly balanced.  Heat, taste and a great texture all combined for a really wonderful entree.  This is a spicy dish without a doubt, but the warning is unwarranted as it allows the great flavors to come through and when combined with the generous portion of rice served, it is a perfect meal.  My waiter Paul was very excited about the dish and when he found out I had liked it so much, he promised to make me a \"special dish\", not on the menu next time I come in.  That will be very soon!!  The \"Chinese Menu\" is more complex as are the specials on the board coming in.  I am looking forward to another meal here shortly to keep sampling this well executed food at Szechwan Palace.", "business_id": "yQONzVpX-DEpGSuKMIov6A", "stars": 4, "date": "2009-09-10", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "FGqV8j_iUCQ-Mqr_WFpA8A", "review_id": "lco_lUSBYCVbetyecJF4Nw", "text": "I don't remember eating here. Strange that I checked in.", "business_id": "yQONzVpX-DEpGSuKMIov6A", "stars": 3, "date": "2012-11-18", "type": "review"}
{"votes": {"funny": 5, "useful": 1, "cool": 2}, "user_id": "iwUN95LIaEr75TZE_JC6bg", "review_id": "YE0hQzYPbuBjB-3cHDA6gw", "text": "The menu reads like a novel with its many offerings. Too many in fact.\nSo I did what every other non-asian does - order fried rice and some kind of chow mein.\nWhat a waste.\n\nAll the nearby diners had ordered dishes resembling images from pages of Bon Appetit, so I sat there eating my rice and watching them eat some really cool looking stuff.\n\nAfter you eat, visit the Ranch Market next door. \nThey sell live frogs. \nHang out long enough and you'll get to watch as the butcher takes you back to 7th grade biology where the only thing missing is Lauren Shockey screaming in your face when you commence to chopping away at his shit.\n\nAnyway, it's a good field trip. \nSzechwan and Ranch Market. In that order.", "business_id": "yQONzVpX-DEpGSuKMIov6A", "stars": 4, "date": "2015-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "saiZmxzBIowJbMgPBW1Now", "review_id": "Hksd-eHezz_InPKW53pFJw", "text": "We ordered Hot and Sour Soup, Salt and Pepper Prawns and Honey Walnut Shrimp.  It was very good and quite inexpensive. Their dinner selection is more extensive and more authentic than their lunch choices.", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 4, "date": "2009-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9bP3urjM__IP5csFh9ZsuQ", "review_id": "ALxvTjYe_cWV_L_LXKf5oQ", "text": "Go there for lunch about twice a week.  Portions are great and the service is very good too.  Their food is also very good and different in some cases where I've been pleasantly surprised.  Will continue going there and will recommend.", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 4, "date": "2013-10-15", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "yH7joEG4ufNG9MYzJ57Sww", "review_id": "WPuKTrN7SN9lARysVqenCQ", "text": "Food is good but dishes are a little high in price.", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 4, "date": "2014-11-16", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 0}, "user_id": "RHVQKadQlSME5jeiFwKnGA", "review_id": "NV4d5Wz7dG-LM6RYn_S36Q", "text": "DOES NOT serve dim sum- only chinese takeout. Had to put the stars (I did not eat there) otherwise I cannot leave this comment.", "business_id": "m9k4BhXgNTBTguxvLNUaEg", "stars": 3, "date": "2012-09-30", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "nDBly08j5URmrHQ2JCbyiw", "review_id": "bmoA9XODBsLe2dyrZokl1w", "text": "Soup's not the same. Place kinda looks post-apocalyptic. \n\nThis neighborhood needs a good traditional Americanized Chinese restaurant. They used to be all over the place. Plenty of people -- now having gotten the pretensions of \"Asian Fusion\" out of their system-- would be willing to come back. They could do a steady lunch biz from the local office workers and be a destination for dinner, but they're going to need to spend more than $20 a month on maintenance.\n\nFirst time I've seen a sign on a buffet line reminding people not to dish food up with their bare hands.", "business_id": "UxMnY3Dxafucv5cXHyfBSA", "stars": 2, "date": "2013-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "czJSEb0Xzf9ViyR4YTGKoA", "review_id": "0HWcFXy0VE8hc-27SpPM3Q", "text": "Great Chinese place.   Took our order quick,  came out quick,  was presented nicely and tasted amazing!   One small thing that I didn't enjoy is the hour after I was done eating I could feel my heart racing from the saltiness of the food.   I guess you have to expect that from most Chinese places but if I find one that isn't salty and tastes like this place,  it will be a 5 all day!", "business_id": "3DMvGD8ZmlMQmhwV66hdSA", "stars": 4, "date": "2015-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "va0CpyGqJsF26ZHHn7-dAA", "review_id": "aq-hgEG5QFZteZFD86B66Q", "text": "You can't go wrong here  .. they have been around for more than 30 years, same free standing \"Hunters\" house decor inside the dining room , but always GREAT FOOD !  open til 11:00pm,  best place in the neighborhood , Owners are super friendly . ! great place for take out service weekly !   totally recommend the (  HUGH ) Shrimp Egg foo young, feeds 2 !", "business_id": "m9Wqqma30o-hH2fAX7dnug", "stars": 5, "date": "2011-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "JC7nd7_Vf3QL9-PAnEpU7Q", "review_id": "J_6OPKj_nG9sy-Aq9mD1Rw", "text": "I have been going to this place for the last 7 years or more. It is what you expect for cheap Chinese food. It is even referred to by my wife a \"The Cheap Chinese Place\". The Sweet and Sour Pork is a staple. The egg rolls are awesome and the Ice Tea is cold.. most of the time. The \"To Go\" Order is an amazing amount of food for the price. I highly recommend this place for a try. Don't go in expecting the best but it's better than most.", "business_id": "sMD2HPNh7m0hgCxHDzGTzQ", "stars": 4, "date": "2012-09-06", "type": "review"}
{"votes": {"funny": 6, "useful": 4, "cool": 4}, "user_id": "tlSSQwfHYJany7wPoTH46A", "review_id": "vtT7d4mX0QTHMmYkv_Aicg", "text": "I don't think I stopped smiling once the entire time I was at Little Shanghai. This place is so reminiscent of the Chinese places I used to go as a West Side youngin. It's a composite of everything that I adored at the age of eight.  Someone could have reconstructed this place based off odds and ends plucked from my noggin. Dinner here seriously made my night and was a trip down nostalgia lane.\n\nI suppose it doesn't hurt that the decor hasn't been remodeled since the mid 80s or early 90s, and is therefore in keeping with everything I think a Chinese food place should be and more. Splashy, geometric tablecloths and carpeting, tall cut glass dividers, raised dining area, strage L shaped booths and large circular tables.  All of which looks like it was designed around the needs of Delta Burke and other Designing Women lunching on Peking duck in their shoulder-padded power suits. For serious.\n\nNow everyone needs a bit more pomp in their life, so make temporary peace with the nemesis that is fried food and indulge in The Flaming PuPu Platter of Delight.  Fried shrimp, fried chicken wings, fried crab rangoon, fried wontons and to be (relatively) health conscious, beef strips on skewers.  In the middle of it all, towering above the fried feast is a small iron grill all aflame, so you can roast your little beefy sticks to sizzling perfection.  Try to imagine how effing cool that is to a six year old's fruit fly attention span, and how pretty effing cool it still is 20 years later. Fire! Caveman brain grunts, \"Good.\"\n\nSo resign yourself to the fact that you're totally going to mow down a thousand calories in PuPu platter form.  Believe me, sometimes it's just the right thing to do.  Now if you really want to dine in style and have a friend in tow, pay 14 bucks apiece and order the supreme super deluxe dinner special that includes: One glorious PuPu platter, your choice of soup, two entrees, and fried rice.  You'll feel like a king sitting down to your feast of plenty. You'll be full after the first two courses.  You'll have more leftovers than you'll know what to do with.  But again, sometimes it's just the right thing to do.\n\nThis is my new go to place in the Arcadia district for Chinese. With this, Mama Mia, The Vig and Over Easy all in the same intersection, I've got breakfast, lunch, dinner and my drinkin' needs met. And it's cheap enough to order out and have an awesome Chinese dinner at home. Recommendations: The house sesame chicken, the house lo mein, the wonton soup and The Flaming PuPu Platter of Delight. Seriously. Do it.", "business_id": "BicQSnGZnY_yuGEDkhVfnA", "stars": 3, "date": "2009-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "XBHJCDzNh--mBhJkzyM_iA", "review_id": "dqtvTDNj-nkhTnxf8lDqSA", "text": "So disappointing.  I do not know what happened to this place... it has progressively gotten worse over time.  I ordered the Mongolian Beef with brown rice-- my very favorite and it didn't taste very good.  It was okay- but just not as good as usual.\n\nThe 2 star is for my dish and the zero stars are for my fiance's soppy noodle mess called Chicken lo mein--- ewwwwwwwwww!  I think Ramen noodles tasted better and cost only 11 cents.  They were so mooshy that they barely could stay on the fork-- really gross.  They were tasteless.  We threw it out.  \n\n\nPei Wei-- I miss the good times.", "business_id": "PxqufEwqzIHAbQGRdZ3bUw", "stars": 2, "date": "2007-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2IjVMqVUix2E8D24UYLtKA", "review_id": "K_E-uGRJt_4lTuqzOSIO5w", "text": "The food is good yet with the service I had to give 4 stars. The best service in Phoenix by far! The servers go out of their way to make sure your taken care . The second you sit down they give you water (everytime I have been here) and they give you complimentary soup :)", "business_id": "F3SEkW6v2LJ5y6Ldo5pPaw", "stars": 4, "date": "2014-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iJfCLNGFwEZdee9st9P7Ww", "review_id": "_2yUA6ZFfucBabYOk4FdFQ", "text": "We've been coming to Flamingo Palace for years and they are always just as good as we remember. Even my kids love this place, when we give them a choice to go out anywhere Flamingo Palace is always on the list.", "business_id": "aozcOaCMwOHG8s-lbZ6_gA", "stars": 5, "date": "2012-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2yQDGEFR5qubh6aA0vuYYg", "review_id": "wpnnSeSuhiMAr4NPvhNmFw", "text": "Yelp. You let me down. We ordered the General Tso's Chicken and a side of brown rice. The rice was way overcooked and still had a ton of moisture in it. It was nearing the state of porridge. \n\nThe chicken was very bland, and it was indicated as a spicy item? I found ONE chili out of the whole large batch. The chicken was supposed to be deep fried and covered in sauce. However it was soggy and not crispy what so ever. Almost as if it was sitting out for an hour. Ive come to realize that this soggy texture only happens when theres too much water in the sauce. The breading absorbs the water much faster than if it were a thicker sauce. \n\nIve eaten had a grip of Chinese places and for some reason there are NO good Chinese food places here in AZ. \n\nIf you want chinese food head to Pei Wei or something because this place is bad.", "business_id": "aozcOaCMwOHG8s-lbZ6_gA", "stars": 1, "date": "2015-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "WVvu15Qem7gpNOzCpYc0Pw", "review_id": "P2iv1UOJTvg5zuzbxzgH-Q", "text": "This hole in the wall quite possible has the best Chinese food in Phoenix.\nDeffinitely the best Wor Won Ton soup and pork Egg Foo Young.\nGreat for carry out and they have a large delivery area!", "business_id": "Pv1H9KIGZTDgSaCDuTUjdQ", "stars": 4, "date": "2010-10-01", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "bSxRMman23jqYU_-aMPOHg", "review_id": "LqcOx0Cy-wSTI3CJttObIQ", "text": "Good food, great prices, and quick. Hubby and I got the dinner specials and shared, mongollian beef and sesame chicken. Both were yummy. Came with egg rolls and wontons which were also great. Super cheap. They have lunch specials for $4.99 which we will come back for. Only thing is the soups are huge, only $5 bucks though, but wish you could just get a small single serving. Excited to have this great chinese joint so close by!", "business_id": "oMtqDDzpMcFrQwHfeYc1iA", "stars": 5, "date": "2014-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "JAZdlhObAesA9Pb5G4FEPA", "review_id": "MiAsAKPLhCP_gtLY1S-8jQ", "text": "I can't speak to the whole menu, but I will often judge a restaurant by whether or not I find a dish that I crave and just simply have to buy every so often. For me, that dish exists here. It is the Sundevil Chicken. I have literally been buying it periodically for over 10 years and still love it. I highly encourage you check it out!", "business_id": "-nHYKkSJuQ7zzFZ1veRfPg", "stars": 4, "date": "2015-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aoWEW9HptH9SDZ5gG0kSlw", "review_id": "23WMo8RL8jkehm_HTrgicQ", "text": "i ordered a poo poo platter  was not enuff to satisfy their min to deliver. driver was late and had to be brought to my home like a jet landing at airport.. the poo poo platter did not live up to name. the extra crap  puffs were under cooked. both me and a good friend got sick. and parffed parrfed the poo poo.please unless you need to lose weight by dysentery an ralphing at 2 am please go ahead aN ORDER", "business_id": "dvjYiddhJ2HrosdSBAqngg", "stars": 1, "date": "2013-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XvWLq99JG5FKl8yjy6WO6g", "review_id": "8UO9I1fC-S24nf8GFJmVGA", "text": "Since moving back to Arizona from California 5 years ago, we've tried out many Chinese food restaurants in the valley.  This is one of the best that we've found so far.  \n\nThe decor is a bit tired with a little TOO teal walls.  In fact, when I eat there I find myself thinking of simple ways to update the interior to make the restaurant a bit more fresh and friendly.  Dark decor aside, the service is great, the food very tasty and the prices quite reasonable.\n\nMy husband and I often pick up take-out to eat at home and our favorites are the \"Sauteed Happy Family\", \"Crystal Shrimp\"  and the \"BBQ Sliced Pork\" appetizer.  The \"Moo Shu Pork\" is also delicious and the PuPu Platter for 2 at $7.50 is a smokin' deal!\n\nThis spot is well worth a visit if you're in the mood for Chinese food.", "business_id": "lAGDe38li38fyf971CslFg", "stars": 4, "date": "2009-11-08", "type": "review"}
