{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1i4Dx_83rJEP8OTriIynkA", "review_id": "deZd_w6b9mjd6dqw-vNEDA", "text": "1 star for Associated. Associated has screwed over myself and many others close to me time and time again. They always make sure to screw you over in any way they possibly can. Make a purchase and know it's going to take 5 days for it to go through so you make another and get paid in two days? You better believe those transactions are going to go through early and your paycheck is going to go through late.\n\nConstantly travel out of state and tell the bank not to flag your account if you go there? Welcome to your new world of pleading with the cashier to not take your card from you while you scramble around trying to make calls so you can pay for gas!\n\n\n5 stars for the personal banker Kiefer! My boyfriend got me a gift through his account and we never got the purchase. We put up a dispute and got denied it. The company the gift was from apparently likes to lie and told us it was Associated's fault (screw you, BlackMilk Clothing). That's a long story, but after dealing with this issue for 10 months now, we decided to go in and meet with a personal banker until the problem was solved. Enter Kiefer. Kiefer spent quite awhile looking through their system and talking on the phone. He talked to a higher up that we had been dealing with. The guy tried to just tell him all the same things he told us, but that didn't solve the problem. So Kiefer kept at it. After coming up with nothing, he suggested that maybe BlackMilk was lying. I wasn't sure about it, but Kiefer gave so much proof that the bank wasn't at fault I really didn't think it was Associated. He signed and notarizing papers for us stating the bank didn't have our money. He was so terribly nice through out the whole process and so legitimately wanted to help us. I was incredibly impressed and thankful. \n\n(Also, to end the story above. BlackMilk was lying, tried to blame it on PayPal, and finally admitted they should send us money.)", "business_id": "tOXZrihuRjPnyJK_O6iH1A", "stars": 1, "date": "2014-11-05", "type": "review"}
{"votes": {"funny": 9, "useful": 5, "cool": 3}, "user_id": "lC0KGXmIhyjzghBUlVnkhQ", "review_id": "Zpyal15mZ8JRS-4C_ZTHSQ", "text": "This is an actual conversation that took place in lane 11 one dreary Tuesday in October. \n\nBONNIE\n(Looks at six 8 1/2 X11 certificate frames with paper inside that reads \"Certificate Of Excellence\") Alright, alright, alright... looks like someone has some congratulating to do, am I right?!\n\nCOREY\nActually I'm using them at an event next week, I'm printing menus and signage for this event and putting them in these frames then propping them up on tables for guests to read.\n\nBONNIE\nOh shoot! That's incredible, just incredible. You see that on Pinterest or something? \n\nCOREY\nNope. I just sort of thought of it. \n\nBONNIE\nWell you are something, really something. Who thinks I'm going to take this frame and it's going to be a menu. That's... that's just really wild! \n\nBonnie makes Kristen Wiig's Target Lady look lame. She's a friggin' hoot! I hope she's not seasonal because I'm at Target two to seven days a week and I hope her cheery demeanor and inquisitive nature continue well past the holiday season. The only thing that would have made my visit better, is if Bonnie busted out from behind her register and hoofed it to the home section to pick up a stack of frames for herself. I can almost hear her...\n\nBONNIE\nI'm having my friend Betsy over for brunch Saturday and I'm going flatten leaves and put them in these frames with our afternoon menu that I'm going to write out in cinnamon stick!", "business_id": "5FlmcwCLqFveKQ-GVeolig", "stars": 5, "date": "2014-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "P95Vo7RBRU0QiH709gliGg", "review_id": "atu-9HXwGIVERVP8FzWgbQ", "text": "It was all right.  The vegetable egg roll was great.  The fried rice was ok.  I had chicken lo mein and the noodles & vegetables were good, but the meat was yuck.  I'm not sure what it is... I think I should only order items that do NOT have meat in them when I go to restaurants, because I commonly end up unsatisfied with the meat and it ruins the whole meal.  The checken was bland, tasteless, kind of gummy and some pieces were extremely gristly.\n\nThe fortune cookies were the good kind :) and they gave my boyfriend real pancakes w/his order (moo shu pork I think?)  He seemed to like his quite a bit.\n\nPS it was delivery, not eat-in, and the delivery time wasn't horrible, but not super great.", "business_id": "xZwaUcrFMSY1O9dK2dAUpA", "stars": 3, "date": "2007-11-18", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "oSA746-4MCJpWorJkzxqpQ", "review_id": "ps1EtfSbf0ybx4waH_wvAA", "text": "While not as big as its West side counterpart, this little JoAnn's packs a punch. It's got a very good fabric selection and the gals (and occasional guys) at the cutting counter are nearly always super helpful. It's rarely very busy and the sale sections are fabulous. Today a very polite employee braved calling the busy superstore location and stayed on hold for nearly 10 minutes while she and an employee there tried to locate a product for me. Well done!", "business_id": "fBSd-fl9-9LkitwrFRcBng", "stars": 4, "date": "2012-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UJP3jPnR70Kbhm44QeCnXA", "review_id": "1sfMsJKzUtJTCniOX9KSkg", "text": "Arlo Guthrie, Henry Rollins, Toots and the Maytals are just a few of the bands on the line up this month. It's a great place to see a band, and they have good beers on tap too.", "business_id": "f5ntGOT9_0pCdeUaUVi9cg", "stars": 5, "date": "2007-10-08", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "1Ie25LhajosgATPgBMkOHg", "review_id": "L5gBuWkUy-ecAQwOk4a-4g", "text": "Unfortunately, we had to stay here during the week of Epic's UGM 2013 conference.  \n\nMy room was dirty.  The rooms had a stale, mildew smell.  The shower/tub looked like it had a layer of grime that needed a lot of scrubbing and disinfectant.  \n\nThe few positives about this place are: 1) free HBO; 2) it is located near a handful of restaurants.  \n\nI hope this will be my first and last time staying in an Econo Lodge.  Ugh.", "business_id": "Wk8sSxmxDdj_n4WJJRRLwQ", "stars": 1, "date": "2013-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uH94fyG1rNqxq6zzL8RH0w", "review_id": "imBD8SHWXJVCe9r7lAzA0Q", "text": "I'm from South Florida and we know good food so while in Wisconsin for training for work and wanted to eat really good food and this spot did not dissappoint. Although I couldn't try everything I did have the Etouffé and as long as you like spice this is hands down 1 thing you need to order. Plus the employees are very pleasant people. Wish I had found this place early in my trip.", "business_id": "cpGv6ES2hzPCtCUQgipwXw", "stars": 4, "date": "2015-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6ZRdju_zadPisjtqbeT-wQ", "review_id": "gCh5dsCFmUeTfuMRpnkzYA", "text": "Standard family diner. Nothing surprising here. A decent place to stop for breakfast.", "business_id": "yYIEKwgQUHJpySOcVdCAkg", "stars": 2, "date": "2011-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "yxp9i_wQo9wd6PE09IjT7A", "review_id": "-0SElJq1dM1ga5fCbcl4hw", "text": "During a week long visit to family members in Madison, I needed to book a cab to get to the airport via the Badger bus at Chazen Museum.\nI was able to book online, receive updates regarding the cab, pay in advance.\nI had a great experience: when I saw the 3 minute update in my phone, I headed to the sidewalk with my bags and lo and behold my taxi was there.\nI got to the Chazen in plenty of time to catch my bus and the service was great. The lady who took me into town was helpful and friendly and knew answers to questions I asked about the local area and the bus stop.", "business_id": "5TQQy_x_ArR3_5L5L0fFVQ", "stars": 4, "date": "2013-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fTy3bA0439l01Q8Hd1O8Vg", "review_id": "Dz9t4Dqvnyir1SCRSwojtQ", "text": "It's on par if not better than some of the nearby chains. Sometimes not sure of the identity they're going for.  Most things are American but the theme revolves around south west food. I like that they have non typical sides.", "business_id": "oudTF4EN_C8thENGiTQf-w", "stars": 3, "date": "2014-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "ehh697zs5Ao_RAGjdudA6Q", "review_id": "xgggM7nsu2t9UVQCcnK04g", "text": "I love Half Price Books. They have dvds and TV seasons, but too pricey. I get better deals at Amazon. I've found favorites and books I'm hunting for. Ofcourse Amazon  is the go to but sometines HPB has books I want cheaper or same price. If same price, hey, I get it right away instead of a week later from an Amazon seller. The Young Adult section is excellent. They have most of the popular books. And yes, I do have YA good reads I look for. \nI built up my book collection with HPB but now good finds are really getting thin. I stop in every month because they get new books in and it might be one thats on my ever growing list.", "business_id": "qTzXFsBjMmOQHeRrWnJYLg", "stars": 4, "date": "2015-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sy97wf-JK25eLHXSX58Ysg", "review_id": "L74R3bcf99oHQMIRFXknxw", "text": "Room was clean, employees friendly, bed comfy, and room was up to date.  They had a pool, hot tub, and even a little make-shift gym.  I left early so I was unable to try the breakfast.  The hotel is located right next to a bunch of shopping strips and restaurants, so it's a great location.  They sell beer and food at the hotel.  The beer is a very fair price, the food pricing is outrageously high.", "business_id": "i9JeI7bd1qXGi15FoD45GA", "stars": 4, "date": "2014-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1dy19ZwpJ9Rkz-A_3M-L8A", "review_id": "z2molNy_vqMMxUJm5daeRw", "text": "My husband and I have made several trips to Dexter's and have been satisfied every visit. We initially went there because we'd heard there were numerous microbrews on tap.\nOur most recent experience was on a Friday night for fish. There were more than the usual choices for a typical \"fish fry.\" I had the beer-battered fish and my husband was happy to see two shrimp  choices. We both had salads and fries. (Speaking of fries, each of our servings was more than enough for two people!) We will go back on Fridays again.\nOther times we've been there have been on Wednesday nights or Saturday nights for a quick sandwich & beer and have always been satisfied with the menu choices and service. The staff for the most part seems to be on the young side but cheerful & efficient. When I asked questions about a beer at our last visit, I was offered a tasting glass without asking. Time from order to our table seems to depend on what else is going on at the time. On Wednesday nights, there's a DJ for the trivia contest that's kind of loud but seems to attract a crowd. (The trivia seems to slow down the food orders for some reason.)\nIt isn't a real big place so I could see how Tim B's group might have had issues. I wouldn't call it a dive, however. It's a great place where you don't have to dress up to get a decent meal& beer.", "business_id": "HTplzElel_F_U_qhWuDKdg", "stars": 3, "date": "2009-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vUpY0PcCCNb3J6x40jqZeA", "review_id": "SD4ZwfzFFVbPqfcuBJkeGQ", "text": "I have been coming to this Noodles and Company for YEARS and have been of many others.. This is still the best quality Noodles, hands down. All clean, and the food always tastes like it was just made, not pre cooked like a lot of other Noodles I've been to.", "business_id": "0oQFFOdPZycIBmGkoBrlbg", "stars": 5, "date": "2014-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "em6GWyKHpHBjRZg5G9o8dQ", "review_id": "D-DkzlHVcKZr1J5_2IUJEg", "text": "I pop in here on occasion because they have a lot of craft and holiday supplies. I don't do a ton of crafting, but they seem to have what I need when I need it, for the most part. I have also used their framing service, which is good and the staff are knowledgeable. Overall, the pricing is on the high side and service is very much lacking due to not having enough staff. For example, today they had 3 of 6 registers open and a HUGE line. I counted more than 40 people in the line. The people at the registers were very nice and accommodating. I felt badly for them, but was unhappy with management for not doing a better job staffing the store.", "business_id": "k9KL0ClKt37VZ2E6eXs32Q", "stars": 3, "date": "2015-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "hiJQnR90oBQCgzwE83SsyQ", "review_id": "mTQlGa-cr4DzwM03tZN-yg", "text": "Jeff came highly recommended by a whole slew of friends. After getting a few estimates for my muffler that were between $400 and $500, I took it to Jeff, who came in at $170. I was highly suspect of the other places trying to rip me off, including the place that had replaced the entire exhaust system a year prior. The repair was done quickly and flawlessly. No one is there to answer the phone, so leave a message and Jeff will get back to you pretty much right away. This really is as good as it gets.", "business_id": "Slv6Y4kw_wzZjbiVERII5g", "stars": 5, "date": "2014-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "K_nrZRDnIM1LH1HPVX1_6Q", "review_id": "6worhQP-ihTszmwfkrEjQA", "text": "Another great local cafe found by the power of yelp! This cafe is right by the major highways and was on my way driving through IL. Its on your right side after you turn into the street and the sign is easy to find. This place has lots of seating, a great big fireplace in the middle with couches around it makes the environment very inviting to sit down and chat with friends/coworkers. I tried an iced mocha with whipped cream topped, they offer their coffee in 3 sizes. With my iced mocha I also ordered a chocolate croissant. Both were delicious and there were so many different choices in dessert that i want to try! Next time Im in the area I am definetly going to have to try their tiramisu!!", "business_id": "JPFzpR5PvZWqHXQMIZFk2w", "stars": 4, "date": "2013-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1utXSQleTTrayLp-BlscQQ", "review_id": "n6rDIJqa5DY9uypjLNz24g", "text": "This is my absolute favorite restaurant and anytime I come home for a visit I have to stop by to have some Meatless Loaf of the God's or a Gobbler!\n\nTop it all off with a Cup of Mud or an off the hook slice of pie or cake and you have one amazing meal that can only be found in Mad-town.", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 5, "date": "2008-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "S2ZI0Jy2NTp1SuJYm2j2jw", "review_id": "XaCUOjoWlP0-hLDi2Q7jAw", "text": "The great thing about this diner is the diversity of the menu. There's tons of options to choose from so it's hard not to find something that you like.\n\nI'm guessing that it was just a fluke, but my biggest complaint was that the diner was cold! It was colder inside than it was outside. My wife and I (the people at the tables around us) had to wear our jackets the whole time. I had to scarf down my food, only couple minutes after arriving at the table it was already getting cold.\n\nI ordered the Wisconsin Salmon Hash and it was pretty good. I was expecting a nice fillet of fish with my hash, but the salmon was pretty skimpy. Small pieces scattered throughout. It came with some pineapple, melon and a biscuit. The fruit was fresh and complimented the hash well. The biscuit wasn't bad but would have been much better if it had been served warm.", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 3, "date": "2012-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FGIHgB1qNhenNglR_dqQ5g", "review_id": "v8W_wFhgtttjwKwrUvtheA", "text": "Consistent food and service.    Breakfast is the favorite in our family.   Oh,.  maybe its  the pies....", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 5, "date": "2014-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "em6GWyKHpHBjRZg5G9o8dQ", "review_id": "mjcjI_q_8O-chigqY-K4yg", "text": "Everyone already knows how awesome Monty's Blue Plate Diner is, so I don't have to tell you that. Your carnivore and herbivore friends will love the menu. They source local ingredients, cook \"real\" food and even bring in local products such as YumButter and create extra, super-duper healthy menu items by partnering with Jon Hinds at Monkey Bar Gym.\n\nHowever, I write this review because I recently ate the most amazing curry dish there. I've been craving it ever since and cannot wait to return. I'm serious, it was a hot, steaming bowl of freshly steamed vegetables with rice and a fantastic curry sauce. I want to eat this every day! Our server even told me that she actually DOES eat this every day and has since they put it on their menu. It was a huge bowl, so I took half of it home with me so I could enjoy a second meal of leftovers. \n\nNow drop everything and order this curry!\n\nAnd order a piece of pie or enjoy an iced sugar cookie, too.", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 5, "date": "2014-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "j94qbZMCz4b4pbgm1U4PVQ", "review_id": "qSXWMzw8q8535NKcM45_pA", "text": "Jim's completely rocks! John (part owner & tall, friendly guy behind the counter) will take time to talk with you about your wants & needs, and will special order anything you wish. I say this because he did it for me many times over the years that I lived walking distance from the store. Their fresh, Amish turkeys are the best you can get for Thanksgiving. You do need to order those in advance, however. If you don't see what you're looking for in the display case, just ask. He would custom cut a chunk of center sirloin for me - he always had a primal in stock, not frozen. \n\nHe would let me hang out in the lobby and talk meat on Saturday mornings, between customers. I wanted to help out behind the counter, just to learn from the team, but they hire young people to work the counter, and I couldn't take a job as a hobby that someone else needed to get thru school, etc. \n\nLong story short - If you like/love meat, but can't tell a ribeye from a strip, this is the place to go. They will help you make a decision, and how to treat the meat if need be. \n\nRemember - the only stupid question is the one that never gets asked. You needn't worry that you will be looked down upon if you ask a novice grilling question. This is not a pretentious boutique. It's a friendly, helpful business that truly values your business, and they will help you make some killer meat!", "business_id": "WxfedycTcbQO_GuXHo9Ypw", "stars": 5, "date": "2014-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hBWS69N8Gca-Sx0bACNhvg", "review_id": "9XvR6YGlKdBt07mQEqBpiA", "text": "The perch was delicious, but we went at 7:30 p.m.  on a Friday night and with the wait we didn't eat until 9:30 p.m. The wait was just too long and the service did not make up for it. If we did go back it would have to be at 5:30 p.m.", "business_id": "J2AiPQnKWBxBwc4MMkbH8w", "stars": 3, "date": "2015-11-07", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "uLF25xKZvkCJv2X98E5-pg", "review_id": "yNA5tBHK8zPep-VSrwSuXg", "text": "They are the best. Great flavor, it can not get more mom and pop, the owners are great the only issue I see us that it  is hard to stop eating them", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2014-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HUScWPLvduRTV770LrilRg", "review_id": "Zq0hOpzF3toGuORHtdUOzQ", "text": "They are nice enough on the phone, but they suck. They don't know what they are talking about and they make you send e-mails to change things and then don't comply with the e-mails. I'm not sure if they lie or are just stupid because they don't apply payments the way they say they do on their website.\nIt's bad enough the federal government gets away with charging high interest rates on student loans. Do they also have to cost us money by using an inept company to receive those payments.", "business_id": "CjHMXSaXttTv4jZSQnmyEA", "stars": 1, "date": "2015-10-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "C16vy9Z3VcNArNZEthU5uw", "review_id": "A8Gid7X-UrIf2rwSfDLLzg", "text": "Take me out to the ballgame! Coming from Milwaukee, our experience of a night at the ballgame WAS Miller Park. I love Miller Park, but, we had just as much fun at the Madison Mallards game. Here are some of the reasons why...\n\nThe parking was easier and cheaper. We had our wallets pulled out and ready to go, but never found anyone to pay...because the parking is free! \n\nThe stadium is small and easy to navigate. You can get there 15 minutes before a game and still get to your seat.  \n\nThere are really cool between inning activities. Fruit races (small children in costume), baby crawl, T-shirt toss. This was awesome. I looked forward to the end of each inning just to see what would happen between the innings. \n\nFood was good. The pulled pork was recommended to us. We got it, it was good. Overall, a great night with friends and a great game! Go Mallards! We'll be back!", "business_id": "4N7dN61pyPfcxmKgXWQPfw", "stars": 4, "date": "2013-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3tN8PxFCOK7G2XuLEirbCw", "review_id": "fsiCufw5u0NysrK8e3MKPw", "text": "We went in mid-Nov so the outside grounds were a little bare, but that's our fault. The grounds are still beautiful, and the indoor conservatory is lush. I am sure in season t us a beautiful place!", "business_id": "Q3GGB4ZMajP-Qmtdr1cVZw", "stars": 5, "date": "2015-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AaOyW6VkLy_eU3eaf3EVfg", "review_id": "U-foqdfV9uIBqwA3fccqZg", "text": "At first, I loved the Esquire Club for how old-fashioned its style and clientele were.  This is the closest I've had to a Wisconsin supper club, and in the winter, it seems especially comfy.  But, the food -- outside of a couple items -- is really substandard.  Never, ever, ever, get a \"broiled\" icelandic cod, it comes charred to a crisp.  The lake perch is fine.  But, that's about it, really.  Simple presentation and simple food, but it never elevates to the level of being phenomenal.", "business_id": "68JsiWNLKs8NDCrBCxIWMA", "stars": 3, "date": "2009-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "u5QzROy6fEndOB9Kjes5IA", "review_id": "hJ-Ie5rn60uimQ_ZXMGp1w", "text": "No fortune in the fortune cookie! Are you for real?!\n\nSo my friend and I are scoping out all the Chinese restaurants in Madison, and this one was not impressive. Although it looked promising when we arrived because of how many people were here, we quickly learned the truth. This place ... is whack. I ordered my go to - cashew chicken - and my friend ordered one of her go to's - fried rice with beef - and we were both NOT impressed. Second bite into my chicken, and it's HARD. Like BONE hard. Eew. And my friend's fried rice had so much egg in it, it took up a quarter of her plate after picking the egg out of a third of her dish. Like, we know protein is important, but there are other food groups too, ya know? The best parts of my cashew chicken were the cashews and the white rice - which if you don't know - are impossible to mess up. So we wait for our bill, like forever, and when we finally get it, there are our fortune cookies! I open mine, and it has the fortune sticking out, and she opens hers, and BOOM. No fortune. That's like the whole reason we're doing this. We love those fortunes. Disappointment. Wah. Anyway. The chicken was bad quality, I've had much better. The pieces that weren't hard were dark meat - very spongy. But they fill up that soy sauce bottle real good, because we used over half of it, so that's a plus. Prices weren't bad either. Overall, we decided not to come back.", "business_id": "eC4iEcRR3p5NLq9Zf80ZGg", "stars": 2, "date": "2014-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "O0lAQazaL-veJv8FCux37Q", "review_id": "8nbFWgAv3yRndH0sQiMkHA", "text": "Oh how I miss you, Harmony Bar!  I never miss a chance to grab a walnut burger and hot chips when I'm back in town.  \n\nThis is just a wonderful neighborhood bar.  The food is still \"bar\" food but it's quality, tasty and made fresh to order.  The pizza is good, too.  Good beer selection and a truly local atmosphere.  The Harmony fits right into the vibe of the neighborhood.\n\nOh how I miss you, Harmony Bar!", "business_id": "KHOHjA8HOcTlFBCtMQFv8A", "stars": 5, "date": "2010-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "nAcKWYGMhnyOwUEdCOO34Q", "review_id": "0VCzHuHlJJlBf-uZuv-Rbw", "text": "Came here for an oil change on the weekend and an inspection. Overall, it took about 2 hours which isn't bad for a Saturday afternoon. When I returned to Firestone later that afternoon, they gave me a huge list of things wrong with the car which I knew before I came in the place. I didn't get my car completely fixed but I had a wonderful conversation with a woman named Christine who works there. She gave me so much great advice and I appreciated her honesty! If I asked a question about the car and she was unsure, she would walk through the garage to find someone who knew. I appreciate that more than anything because some people will just tell you what they think you want to hear.", "business_id": "Yn89vJYXcdprx9U_w1qmMw", "stars": 4, "date": "2015-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 3}, "user_id": "lC0KGXmIhyjzghBUlVnkhQ", "review_id": "LSl0lWMHrgjdhoVljcwqMw", "text": "Thumbs up to an 8.95 sandwich platter that includes two sides and fills me up like no other. Seriously. The amount of food. The quality. That sauce! Go grab yourself a brisket sammie with corn and fries. You'll thank me tomorrow.", "business_id": "HLWtNcf3l-wKb6v9duteMQ", "stars": 5, "date": "2013-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ky5-rv7r3nnbnRuA_m3UZw", "review_id": "cF-PSpm57_DDNBBUSnXcQA", "text": "Best bbq in the area.....bar none! ! Excellent food and ya can't help but enjoy the wit of the help.\n.looking forward to going back.", "business_id": "HLWtNcf3l-wKb6v9duteMQ", "stars": 5, "date": "2015-11-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RFh9kcejWmIJhSPMEZ2neQ", "review_id": "zbvnjEqJoMcVlhrvzhq_Eg", "text": "No wait this weekday morning. Amazing views. Salmon omelette was delicious. Reasonable prices.", "business_id": "j515klfbCAEF3KPiKvHz9g", "stars": 5, "date": "2015-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "CLKSlbyP_NL-JS6CNCGnFA", "review_id": "xxTuaBSca2U2nB2UJ2Fn5w", "text": "The worst customer service I have ever experienced.  Trailers and trucks all over the place, so I had to make a place to park.  Ended up getting cursed out by a maintenance guy.   Nice job U-haul!!!!  Will never be going back to this place again.", "business_id": "tgGaaLuFPbeiwPZcAKFxGA", "stars": 1, "date": "2011-10-12", "type": "review"}
