{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5reyAZvTrjr_QV8Qq-ScGw", "review_id": "84WQJWTrTrMbKCQIzBG2dw", "text": "Heaven in a donut!  This place is a hidden gem.  \n\nThey are closed Monday and Tuesday.  They open at 6am on weekdays and 7am on weekends.  Get there early!  Once they sell out, they close.  Weekends the line will be out the door at 7 am!\n\nYou just have to try them!  I can't say enough about how amazing these donuts are!", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2011-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_SRuFa3jMq10L6jQhLacyQ", "review_id": "85NdmJCYFj5taso2fCRtAg", "text": "My boss and I once argued about who had the best donuts.  I said there was a place in the West End that had the best.  He claimed the best came from a shop outside of Crafton.  Of course we were both talking about the Better Maid.  For cake donuts, it doesn't get any better than Better Maid donuts.  Always fresh and should be be named Best Maid.  Get there as close as possible to the opening time and don't be disappointed if there is a wait.", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2014-09-13", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "6jVrGOl04TGIRmwCf7BW-g", "review_id": "Ex0nHGBWag4-bgAhypi_Dw", "text": "A while back my Mom bought some donuts from here and they were really stale by the next day.  She called and mentioned something about it to them and they didn't even seem to care.  I like to try and support local business but with an attitude like they showed I have no use for them.  Doesn't seem to be any real set hours so you never know when they will be open.", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 1, "date": "2014-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_DIfyJOqbgLOmKYmWjdHNQ", "review_id": "rUvsjeGZ7byZC3HfUPCAmw", "text": "Please please please come back soon!  A few months ago a van actually drove THROUGH the store front.  No one killed, but some injuries.  We miss the donuts and the amazing owner and staff!!  Come back soon!", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2015-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cSWE541AsNf3O5Rbm_N--w", "review_id": "1VoULdg4dxfHgZYRqy47mQ", "text": "It's open again!  Same great donuts as always (and a lot brighter inside!?), glad to see a good guy was able to make it back!", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2015-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Uh8h58NLcWoy5thJm3Vzig", "review_id": "HANAnhNiwTWoG_0Y4Ne2VA", "text": "Donuts are you always fresh at 7 am when I go.  best donuts in pittsburgh. My favorite donuts glazed. I am glazed customer!)))", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2015-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F7CkTfv0Bg_fS0vgPjIp8w", "review_id": "gr_5GfsXIEscGLJBJveGFA", "text": "C's is a FANTASTIC place for breakfast. Family owned, this restaurant makes all the breads, buns, pies, and bakery in house. I had the eggs benedict and was pleased to be given a choice of ham or turkey, but of course I had to try the more traditional ham. I also made my hashbrowns \"C's hashbrowns\" by adding cheddar cheese and onions. The eggs benedict was delicious, the hollandaise sauce was also homemade and was the best I have ever had and the freshly thick shredded hashbrowns were very tasty and not greasy! C's was busy on this Sunday morning, but the service was quick, friendly, and delightful. C's has quickly become a favorite for Sunday breakfast.", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 5, "date": "2011-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ObGWRIaJS1tLF-YZ4i5I4g", "review_id": "Y7UQa1Gl_GGFidKYKAQSVQ", "text": "I would love to give this place 4.5, it is very friendly and inviting. They serve fresh baked toasted bread with the breakfast items, try the sourdough or rye. They give you a nice sized portion and they quick, not rushed. \nThe place is always busy which is a good sign in my opinion. Ihave never had to wait more then a couple of minutes for a table and if push comes to shove there is a small counter. \nThere is seating outdoors for the nicer days and they are constently changing the decorations to the season or athletic event.\nI keep coming back and have yet to be disappointed. \nIf you like tabasco withyour meal you might want to bring your own as they will bring out a botle but it is the habanero type. It may be to hot for some palettes.", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 4, "date": "2012-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "tIfN58Ihq0DeUIWqBS6pgw", "text": "Update - this was the fourth or fifth visit to C's over the past few years; my coworkers have a breakfast club where we frequent various places once a month or so.\n\nThe breakfast grub is straight-forward, no-nonsense, standard fare. Think: eggs, bacon, hash browns, pancakes, and skillets. Filling and satisfying. The breads remain excellent, as are the bakery items.\n\nI've bumped it up a star from the earlier review because the service has been stellar with our past few visits. The waitstaff is friendly, attentive, and fast. We've never waited for a refill of coffee or water - they're on it right away.", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 4, "date": "2013-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RFCz1TQGisK5MgVgDHaGPQ", "review_id": "5EPtZHX6NhBNeKsBP6iguQ", "text": "My girlfriend and I checked out this place on Labor Day right after the Mustard Museum.  It was closing at noon and the nice waitress let us eat quickly.  I had the steak and eggs with toast.  My girlfriend had the peach n' French toast plus the eggs benedict vegetarian style.  Well, we took home the French toast after eating half of it.  However, everything else was heavenly and the bread was amazing in my mind.  We were the last to leave but glad to have stopped here instead of McDonalds or another chain restaurant.", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 5, "date": "2014-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hVciSGoyya69c8q67_nRJw", "review_id": "fuRVCxVQIW_FrwLzusbQHQ", "text": "This is by far the best breakfast place in the Madison/Middleton area.  Great food and outstanding service.  Definitely has grandma's kitchen feel to it!!", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 5, "date": "2014-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "qy9xGKT_77fekC7Tt2eYqw", "review_id": "EIqge9rQPZOZpIEwzSkf0A", "text": "Fresh hash browns. It has been so, so long since I have had fresh hash browns cooked to perfection. And C's does them right! They are so good. If they don't come with your meal, you must get them as a side.\n\nBesides the hash browns, this is your normal breakfast joint. My boyfriend and I meandered into C's after stopping at the Original Pancake House and finding out about the 45 minute wait. I was way too hungry so that wasn't going to work. So we made our way here and were pleasantly surprised! The menu offers many different options, including a cinnamon swirl pancake that I can't wait to try the next time we're in.\n\nI had the Eggs Benedict, and although the sauce was a little broken, it was tasty. The eggs were cooked perfectly, and the English muffin was toasty and yummy. My boyfriend had a smoked sausage skillet, which he subbed in bacon for. He also said his meal was delicious, and finished the entire thing. Like others have said, the bread is amazing!\n\nDon't expect the ambiance to knock your socks off, but the stellar service makes up for it. I cannot wait to be back. We've already decided to stop here the next few Sundays to try other things off of their menu!", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 4, "date": "2014-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "1yNjafzgIe_SUUEPlZi4Fg", "review_id": "YsVwB9rw-B4PQHzn9fYfQQ", "text": "Hash browns are delicious. The egg dishes are filling. Coffee is actually not half bad! This is truly great diner food-- the spot is busy, the food is inexpensive, and service was quick and friendly. We were very pleasantly surprised!", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 4, "date": "2014-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mtmQKsiupD3X6r1VScMIOQ", "review_id": "A94naSuP7d9YJQgLIPabQw", "text": "Deliciously Amazing! I had the banana bread French toast and the biscuits and gravy with and over easy egg on top! Sooooo good! My husband had the eggs Benedict, also delicious! Service was very fast and really friendly!  Eventually although the biscuits were gone I had to ask the waitress to remove the gravy from my table, otherwise I may have licked the plate clean  which although it would have been totally worth it my husband would have been severely embarassed", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 5, "date": "2015-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E1xwBQJ6t0tyYkC8ZcLE2w", "review_id": "BNa9CDcVrJRQaLK6nIdsZQ", "text": "Very friendly staff with a fun local feel. Inside seating is cozy and nice alternative to a chain like Perkins. Adorably prices, but food just being average.", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 3, "date": "2015-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YOhFBQ0e_SzO0OjgwBWUJA", "review_id": "sdysKc5gnXw9hICDfxWUcg", "text": "One of the best breakfasts I have ever had .I had the pecan waffle and it was the best waffle I have ever had in my life", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 5, "date": "2015-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "8T6iavHlEu5lDctMtyM_cw", "review_id": "-iWPExMsw2-dCU4hI804-A", "text": "LOVE Oakhouse.  I have not been to their store location on Mustang Way, but they are the only bakery I buy from on Saturdays at the farmer's market.  Their cookies and cinnamon rolls are delicious, and their cheese bread is to DIE FOR.  Seriously, there are two locations that sell cheese bread at the market, Oakhouse's bread has more flavor and cheese, and it is cheaper than the other location.  Two thumbs up!", "business_id": "IvOeqnZZrGKjUxj6fW2P7Q", "stars": 5, "date": "2012-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "USSanBgta8EEQrzPY-64Bg", "review_id": "FLC8YylzPkmkok6oDLCeBw", "text": "This review is for Oakhouse @ the Capitol Square Farmers' Market (CSFM) location.\n\nThey are not exactly an underground bakery at the Farmers' Market,  but they certainly don't get their deserved props.  Oakhouse's delights include breads, donuts, scones and specialties are loaded.\n\nThere are other bakeries at the market including Stella's.  Based on the crowds and the number of reviewers on Yelp, Stella's gets all the love.   However, based on my consumption of their breads and pastries while also comparing prices and customer service, Oakhouse backhands Stella's with a silicone pastry brush (granted, Stella's has the moistest and most flavorful cheese danishes in the area).\n \nI have always appreciated Oakhouse's efficiency and consistency.  They are very organized package bakery perfectly.  I never had anything smushed by being jammed in (like other places).  They rarely struggle with stocking or maintaining an attractive display.  I have never felt ignored or frustrated by cash handlers.  These are amazing accomplishments factoring in the madness of the CSFM.\n\nMy change your life recommendation is their Napoleon. It is the eclair's hotter sibling. Oakhouse's offering is a ginormous & gorgeous pile of puff pastry, vanilla cream and vanilla/chocolate glaze decadence.  The layer offers dynamic and perfect flavor combinations vs. the eclair's often disappointing cream to pastry ratio.\n\nNext time you go to the CSFM... sting Stella's and make a beeline to Oakhouse.  They may be -1 on product marketing, but more thank make up for it on their delicious delivery.  Once you save time, a little cash and make your sweet tooth sparkle, you can thank me later.", "business_id": "IvOeqnZZrGKjUxj6fW2P7Q", "stars": 5, "date": "2013-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xhmPs7Seaca_xa8vFSDAQg", "review_id": "XIhMQudqlXgvQsCHFeCDtA", "text": "Dunkin Donuts iced coffee is cheap and rad. This location is convenient and is hardly ever busy.", "business_id": "xky2rWT8kpsdyJ4YgZB3Jw", "stars": 3, "date": "2010-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xkOQUAqnU-u6qSj9pBtukA", "review_id": "UTXV5958X86G2kOBF3dEdA", "text": "The donuts here taste stale and the employees aren't the most welcoming people. This location seems to be out of the donuts I want consistently. This place is really fast with their drive thru service and their indoor service. I enjoy getting the $1 coffee. Their breakfast items are good. I like their egg and sausage croissant. Dunkin donuts coffee is best enjoyed with cream and sugar.", "business_id": "xky2rWT8kpsdyJ4YgZB3Jw", "stars": 3, "date": "2014-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8ZchNx1nHZMXe1WpVTbDcw", "review_id": "K0NFbZFfI_bjsCb9I1WbFA", "text": "Best donuts anywhere. Krispy Kreme has nothing on this place.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2010-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ghrJ6XmpeBhYqmIWT8PYPA", "review_id": "7HaIR_tuZrKeGgy7yBRP1w", "text": "RAINBOW DONUTS IN DOWNTOWN PHOENIX SELLS BOBA TEA AND SMOOTHIES.\n\nThat's all you need to know.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2010-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AKNRJ5YuUVixrj6P-ORofg", "review_id": "0LoLY69MxWPffGYuXGXKcQ", "text": "I can't comment on the donuts (which is pretty ridiculous seeing as that's the main draw here), but I was satisfied with the boba smoothies. They're definitely not anywhere close to being great, but for someone who's not picky about boba, they're really refreshing. The boba itself was kind of mediocre, but it had a good flavour and wasn't too sweet. I got a taro smoothie and a honeydew smoothie. \nThe honeydew tasted surprisingly good for being from a powdered mix, it was just like drinking a fresh honeydew melon. The taro was even better, although the drinks were a bit too icy for me. They were a lot better after I let the ice melt a bit, but who wants to wait?", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 3, "date": "2010-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2nXVVKX3K4Httr7-IU1Rew", "review_id": "3PwbWNTG2XEi7wK3lc8yOA", "text": "I was really excited to try this place: old-school donut shop in my new hood? Score!\n\nWell, Meh indeed.  The donuts were stale-looking and picked over by the time I got there (11:30am) so I opted for a croissant sandwich.  They went back and made it as I stood there for about ten minutes.  Which I wouldn't have minded if the sandwich was great, but it was just ok--sloppy with lots of cheapo mustard and low-level dairy meats.  \n\nI don't plan on going back any time soon, but maybe I'll give it another try early in the morning and see if it's better.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 2, "date": "2011-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DrWLhrK8WMZf7Jb-Oqc7ww", "review_id": "Yh60Rb55NXnmZrOzj_WnDw", "text": "In my many donut eating years, the best has been in Santa Clara, CA at Stan's and Voodoo in Portland. This place tries to recreate the maple bacon experience, but it seems to be the only doughnut that they decided to get creative about. On a personal note, I usually walk out of donut shops that are asian-owned, just because through the years, I never have seen anything but run of the mill stuff from those places. I tend to gravitate to the old white guy making donuts. \n   Rainbow tended to follow the same script, except for the maple bacon concoction, which turned out to be very good. The bacon was crunchy and every bite was a good experience. Also liked the vanilla creamer available for the coffee and tried the buttermilk also, but although it was big, it tasted like any other buttermilk donut in the world. Go for the bacon or go somewhere else.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2012-11-11", "type": "review"}
{"votes": {"funny": 14, "useful": 19, "cool": 18}, "user_id": "8dbRf1UsWp2ktXHZ6Zv06w", "review_id": "fMLRw4pbNGX_GQJywI-pYQ", "text": "MAPLE BACON DONUTS!!!!!!!!!!\n\nI have been hearing about Rainbow donuts and how they have maple bacon donuts, so I was in the area and I made a stop for them.  It was about 11:30 on a Sat morning, and I knew that my odds of finding them where pretty slim because I have already been forewarned that they sell out pretty fast. \n\nI walked in and saw the display case of donuts, the normal kinds you find at a shop, and I was going to give up on my search for them, but the lady behind the counter asked me what I had wanted and I told her it doesn't look like you have what I came for and told her what I was seeking, she asked me how many did I want, told her 4, she said give me 3 minutes and I'll have them for you! OMG she was going to make me some right then and there! This lady rocks in my book! \n\nShe came back out with 4 maple bacon donuts, they looked sooo good, I thanked her for making them just for me and took my donuts home.  \n\n3 out of 4 loved them! The picky one (my oldest daughter) said I know that's not bacon on my donut. She couldn't get her mind wrapped around it!  The donut was perfect! The maple and bacon melted and blended beautifully!! I am a fan!", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2013-09-23", "type": "review"}
{"votes": {"funny": 10, "useful": 15, "cool": 13}, "user_id": "kffxYQVQsEpF1DVlQlcGCg", "review_id": "SaQuYR5JV5LS4Yd4bwB20A", "text": "I cannot belive I have just found myself coming into this place.\nI have passed it many times through out the years. I cannot remember if it was always call Rainbow or not. But, I remember it being there.\nAnyway, it is colorfully painted ,so you will not miss it as you drive by.\n\nI was in charge of picking up some doughnuts for work. I almost forgot, so I was on my way to the job and saw the sign.\nWow, I was surprised how nice it was.\nSmelled like fresh baked goods inside.  They say they bake fresh doughnuts every day. I say they are better than Duncan!\n\nApple Fritter was fantastic. I got a dozen to go in a lovely pink box. As well as a couple of coffees. I was a popular guy that day.\nBy the way they even have breakfast and lunch food , not just baked goods.\nLook for the brightly colored building.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2013-09-24", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "HUVjbOg-g-qHqRa6drSE4w", "review_id": "HLMEDo8xNrGfzerS8lL8cw", "text": "Two stars for poor customer service. It doesn't matter how good your donuts are, you probably shouldn't ask a pregnant lady if she should be drinking coffee. It's none of your business and quite rude.\n\nFor the record, everything is okay in moderation, including donuts and a little iced coffee!\n\nI told my husband we won't be coming back here.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 2, "date": "2013-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "49zOPRrFCHvQOKZ0bRohew", "review_id": "Emc02IHxJNUOK-jmoZY7rQ", "text": "Consistently delicious.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2013-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6Md4YISMG26N004XSHhUqw", "review_id": "BeV2SpoaVBb_HhpKaUHZlQ", "text": "My husband and I had a hankering for donuts one afternoon.  So we decided to try rainbow donuts. We've lived in the area for 10 years and never thought about this place. My husband is a die hard DD fan. \nI decided on old fashioned and buttermilk. The buttermilk was so good! Crunchy on the outside, moist and buttermilky on the inside. Yum yum! My husband got the jelly and Boston cream. The Boston cream was a Boston cream - delicious!!", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2014-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qv5v8LlD53i2FKXBdON7bQ", "review_id": "jKSvNw4zQ_8F1Ke2qjhgYw", "text": "I went here because I was craving boba : ) the place looks like a hole int the wall but the boba was ok. I had the Thai iced tea it was good not the beT but definitely not bad. It was worth me making a detour for.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 3, "date": "2015-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2EZflOnGGx0DfMTjXj0rng", "review_id": "jedgovelve0C9SDUlP_3Dw", "text": "Great apple fritters ! Bring cash!!! They charge for debit/ credit. What is this am/pm or the early 90's? If the doughnut was not as good as it was I would give this place less stars because paying for debit/ credit is DUMB!!!!!!", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2015-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xeoiVm1Yhl1vQiX2L8quHA", "review_id": "UwZ7Yb-PQMW1epkSxodVGg", "text": "Best donuts in town so far! \n\nWe used to eat at bosa then found arizona donut company which was even better THEN started coming here due to the whipped cream glazed donut sandwhich, only donut that exists! \n\nIt's just as good as az donut co.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2015-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oNG8N-zf4yqdGstLERThuA", "review_id": "yi8JSUnQLmv68x54FixCSw", "text": "After 2 years in Phoenix, I finally found a donut place which churns out consistently high-quality simple donuts. Located in an unpretentious building with super-friendly and efficient staff, my average wait time was less than 3 minutes over the past 6 (yes, 6) visits.\n\nThe Good:\nGreat variety of donuts.\nThe simpler ones are the best (Chocolate & Mapel Glazed, Old Fashioned & Cruller).\nInexpensive (paid $3.xx for a bagel w/ cream cheese + 2 long johns).\nStaff is friendly yet efficient.\n\nThe Not-so-good:\nThe more complex donuts tend to be sweeter (understandably so).\n\nOverall:\nGreat place, excellent donuts, superb service. Stay away from the jelly-filled, super crazy donuts and go for the simple, fluffy and fresh glazed donuts. Your taste buds (and to some extent, your waistline) will thank you for it. :).", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2015-11-19", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 2}, "user_id": "2_HfgANoSydelB2FSExqWw", "review_id": "EEZKPTRByAqyoVAIE1qH1w", "text": "Awe man.. This Rainbow led to disappointment.\n\nStopped in for two dozen Saturday morning to treat my work team. 6am and the place was poppin! The donuts are good looking and the place is clean.. Also, I see they sell sandwiches.. Cool! \n\nPicked out my teams favorites- long chocolate bars, maple iced, strawberry iced, chocolate iced, and a few others. The actual cooked dough is good. Not very sweet which I imagine some people enjoy, but not me! The not so sweet donuts with icing all tasted the same! I am quite certain their icing is just a thick glaze with food coloring! Zero flavor! Yes, even the chocolate! \nI was looking forward to that artificial strawberry taste! \n\nI feel this place is cheap with their product but not inexpensive for donut lovers! \n\nSorry to tell ya my fellow Yelpers! This rainbow has no gold at the end :(", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 2, "date": "2015-11-21", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 2}, "user_id": "vn3lecMsL3kXVe-7hg3gLg", "review_id": "q7VROm8OvQKoevlV4cDcIw", "text": "I do love Dunkin Donuts..... specifically the Toasted Coconut and Chocolate Frosted cake. :)\n\nPretty much 99% of the time I get the Coffee & 2 donuts combo (of course the Toasted Coconut & Chocolate Frosted cake). \n\nI used to go here WAY too often -- so often, that they know it's me when I order at the drive-thru. Cause I get the \"Toasted Coconut & Chocolate Frosted cake\"..... \n\nAnd seriously, I have to say that everytime -- cause for a long time they would mess up and give me a chocolate glazed donut or chocolate frosted glazed donut - - def not the same. \n\nFriendly staff. Make sure you get the coffee punch card if you order alot of Medium-sized coffees here...", "business_id": "T-AAN0CizEBOTtHinTuvrQ", "stars": 4, "date": "2011-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "O0JgW6Tg6R0n-rtJP2GMzg", "review_id": "XoG6Tz3RrmM7eDhVQjTCKQ", "text": "Not the best run Dunkin' Donuts.", "business_id": "T-AAN0CizEBOTtHinTuvrQ", "stars": 2, "date": "2013-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-4vNbuGCH0MPYg_zVAWxgQ", "review_id": "o1eTpgwowYpwHvcBao0ZnA", "text": "at this Dunkin Donuts they definitely take care of the drive thru before the walk ups. Everytime I come in here there are at least 3 or 4 cars that were in the drive thru as I walk in that are driving out f the drive thru before I even get served. I'm a honestly never come back to this location. It happens every single time I come here and it just happened again today right now. It's really aggravating when you have two clerks who are working their asses off to get the drive thru taken care of While totally blowing off the walk up people.", "business_id": "T-AAN0CizEBOTtHinTuvrQ", "stars": 2, "date": "2014-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "USrFZl4eSnQjAu7TQcbOyQ", "review_id": "_cDNI8s0FxTsmMGjjOSUzA", "text": "They got rid of the marmalade filled donuts!!!! No!!!!! I'm sorry to say that this is the last straw for me, I will be forced to look elsewhere for my daily morning cheat meal...... :,(", "business_id": "T-AAN0CizEBOTtHinTuvrQ", "stars": 2, "date": "2015-11-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "m6p5Pnj5GImTTi6R4Kg7Gw", "review_id": "MnORSVeMIX6fxOepBbOWfA", "text": "Love their blueberry cake donuts. Its soft, flavorful, and not too sweet. Too bad that it is only a weekend special, I guess I have to stick to chocolate frost and sugar raised.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2010-09-09", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "VH1WbmbrUvgvSWQr68QA6g", "review_id": "a5y65_fmzrEJ7MoQGghqmg", "text": "The BEST fritters anywhere. Seriously! Apple is my favorite. I used to live in the neighborhood, then a crack-head jumped my wall and tried to steal my bike. I was so over living cheap and we moved. \n\nBut as I sit here in Surprise in suburbia safeness and chain hell, craving a donut this morning, this location of Rainbow donuts is where I wish I could be. \n\nI also miss the sandwiches/Gyros from the Shell Station at Central and Dunlap-best Gyros too. But, I digress... \n\nTried all the various donuts and loved them,but the fritters haunt me- cheap price was a bonus. For $5 we had Saturday morning covered for breakfast. Sigh, missing the donuts...", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2010-09-25", "type": "review"}
{"votes": {"funny": 16, "useful": 13, "cool": 11}, "user_id": "du6KeE54IFbPiXpU3LOd1g", "review_id": "Id2T7kd3-LCOsmsCvt6N8w", "text": "I'm out of the closet!\n\nYay!\n\nNo more hiding who I really am!\n\nI'm a proud member of the Rainbow Donuts coalition.\n\nIt's not a choice...not just a lifestyle selection (although the donut selection is, in fact, quite robust)...no, it's how I am constructed!\n\nOK, actually I'm bi...I enjoy the occasional \"breakfast burrito\", but if I'm pressed to choose...I'll take the hole and the \"Old Fashioned Glazed\" that surrounds said hole.\n\nThat and a good cuppa.\n\nAnd that's one of the things that separates Rainbow from the rest...the coffee...outstanding Italian roast, well made and very inexpensive...with enough refills to take a bath in.\n\nAnd I would bathe in the coffee (and possibly the donut glaze) except for the inevitable \"dust-up\" that always occurs when I let my impulses run wild and free!\n\nDon't get me wrong...the donuts are terrific and the nice young lady behind the counter was almost as sweet as the apple fritters.\n\nI had a client meeting there this morning (I know, I spare no expense!), and my clients were just as charmed as I was with Rainbow...the great coffee, the terrific donuts and fritters and the pleasant service (not to mention free wi-fi for my meeting) all combine to make Rainbow Donuts a significant step above the rest.\n\nMost of all, it's the place where I can feel free to be my real, authentic self...out, loud and proud!\n\nAnd growing a little with each fritter.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2010-11-05", "type": "review"}
{"votes": {"funny": 4, "useful": 4, "cool": 4}, "user_id": "PYtryNSk30ytqOc_36sLPw", "review_id": "kB6jF69sZsGkQYIIB5u4LA", "text": "These donuts are the best ever!   I don't care if they shorten my life 5 minutes...it's worth it!  You can taste every light and creamy, fluffy layer when you bite down into a chocolate long john...with just the right amount of delightful chocolate on top!   Try a buttermilk bar...crispy on the outside lite and tasty in the middle...there are no better in this town!  O boy do I want one right now!", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2010-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "5lq4LkrviYgQ4LJNsBYHcA", "review_id": "myMnAHr2RDmuJic4fOOIuw", "text": "Items selected included:\nBlueberry Cake\nButtermilk Cake\nStrawberry Raised\nApple Fritter\nChocolate Oreo\nMaple Bacon\n\nFor their last day in Phoenix I took my mother and aunt to La Grande Orange - easily my favorite spot in The Valley - but being late risers I decided to grab some donuts beforehand just down the street at Rainbow Donuts, an independent branch of the local chain that many claim to make the best donuts in the area.  Opening early - I believe 4am - and at least by 5:15am when I arrived on 12/31 the shop is small and anything but trendy, the only other patrons during my visit a trio of old veterans who apparently meet there daily, but with a friendly staff and an interesting selection of classics and novel options alike I have to say I was pleasantly surprised.\n\nSelecting a half dozen donuts and taking portions of each home it likely comes as no surprise that the warm cake donuts were my favorite - the buttermilk bar literally still dripping glaze - and with the blueberry subtle and light plus the fritter less greasy than the average with a great crunch giving way to cinnamon apples within I enjoyed all three more than those that were raised - the dough a bit less wispy or raised than I prefer and the frosting on both the maple and the strawberry a bit too artificial, though the Oreo option was admittedly quite good as the frosting approximated the flavor of Nestle Quick.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 4, "date": "2012-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "E5qFR0RBQBoXx8FbrOkdbw", "review_id": "OGylkncujWzhvZPQLsswCA", "text": "Always fresh, and always a hit when I bring them in to work.  The cream filled donuts are wonderful.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 4, "date": "2013-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yPt75JannRRFuUgAYQkX5w", "review_id": "6wYt7Wh1JEJtCI0c70f1zw", "text": "Great donuts! Don't see what you want? No problem, they will make it for you on the spot! You won't get a fresher donut than that!", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2014-09-13", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "wUEp87FqOB9ew27Iz6zk_w", "review_id": "qmHMBiggSFowWfKVLDlRoQ", "text": "Mmmmm... glazed donut.... I feel like Homer Simpson with how much I love the glazed donuts here.  Being from Texas, I am sorely missing glazed donuts from Shipley's.  Anyone from the south knows that those are the BEST DONUTS EVER!  But since Shipley's isn't in AZ, this place is a good second.  The donuts are soft, the inside is moist and doughy, yet light at the same time.  The glaze on the outside is sweet, but not sickeningly so like at Krispy Kreme.\n\nand WAIT... I just saw that another review said they have Texas kolaches??  I need to get back there stat!", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2014-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "07pUh-U0FXJ9XYhQbZoJIQ", "review_id": "lUsxqGzo-4MtEGmSe9vkfQ", "text": "Good selection, decent prices, pretty good donuts. Worst iced coffee I've ever tried in my life, though!!", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 3, "date": "2014-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sBYqjFQwEVTM0qJk9RIUFg", "review_id": "af0fDODvhv7fHJZJmdXQbA", "text": "Not often is it that I wake with a crave for donuts. But man, today was something else! Yelped donuts, found this spot, drove on over, and even tried the BACON DONUT. Yes, you read correctly. It was aight :) I would have flavored the frosting differently, but won't bag too harshly for their brave experimentation. Oo! Speaking of donuts... I still have some left. Gotta go! :)", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 4, "date": "2015-10-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 3}, "user_id": "G6_jz0IRsmAWKEEmBVewEA", "review_id": "5MLYhgYX8m89px94BY7SOA", "text": "Simply, The best donuts around", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2008-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "m9zDNvpl_9Cy3hEoYdyCzw", "review_id": "uZj6wfqE16tMySFaYt-5bQ", "text": "I admit it I eat donuts almost everyday and twice on Sundays. Today a I found a new addiction, french crullers, uhhh they are soo good. Melt in your mouth.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2009-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iRj5f7z-FLBmr4yTovx6hw", "review_id": "IwcxSzvnoIGpyHCN4d1gNA", "text": "Good prices. Drive thru ... But always Fun sitting with the old folks on a Saturday morning.   Recently discontinued the Smoothies - the boy was disappointed. Fresh donuts!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 4, "date": "2013-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7h_sLNMML8qpvdmXEKXvtg", "review_id": "9lh0Dz3Qe7UGE1Wjs4AVuA", "text": "So....my husband decided to bring me a half a dozen donuts while I was taking a nap today. He got a variety box with some classics and something that looked like a chocolate cake doughnut but turned out to be the most delightful blueberry doughnut I've ever tasted. All the doughnuts were crispy and wonderful on the outside and soft and fluffy on the inside. Absolute perfection; I'm in love.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2014-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SKqR-l-Dmy0grYfeF9ECAg", "review_id": "dVCFs7dsoqnzPA5djSUf8Q", "text": "Boo, we went here for a cronut today, but we must've come too late (they close at 2 on Sundays-not 4!) and we were stuck with a raspberry filled cronut. It was waaaaaayyy too sweet, and just a little \"old\". Same goes for the chocolate croissant. I've yet to eat the cinnamon roll or maple donut, but I'm sure it's the same. I just need to get there bright and early!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 3, "date": "2014-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_-Lbs5aXiJyXtfE6ff17rQ", "review_id": "9Bm4VRC-XcxXEtni-ptQtg", "text": "I am not really sure what the hype is about. We went by in the afternoon and the place was cleaned out. We managed to get a few of what was left plus donut holes (my fave!). The donuts tasted fine - nothing spectacular and nothing I would drive out here for. We were pretty underwhelmed *sigh*", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 2, "date": "2014-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PA7iyQYEtzvzqeqIOjxPKw", "review_id": "Z5t0_dnXOtzRsE09uUf2wQ", "text": "I had a mango smoothie and a s'mores donut and it was so delicious. They also sell boba drinks here too and real cheap! Now I dont have to drive 30 mins to get boba drinks. The staff here are very friendly too especially the Manager lady and her daughter. Theyre both adorable and very pleasant to talk to. I will definitley go back :)", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2014-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PA7iyQYEtzvzqeqIOjxPKw", "review_id": "G-Ft6dVvuSxkQ83j01Xkkg", "text": "I got a milk tea boba and it was delicious! The boss lady always seems so happy its like she never has a bad day :) I think I'll get another boba and donut tomorrow, definitely worth the carbs haha oh make sure you get there early for the best stuff because they tend to be cleaned out by the afternoon. The earlier the better :)!!!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2014-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aBaxhJLZ7Ds6-usD_tLGmA", "review_id": "D8g0r8ARe7xOnttgjGPOog", "text": "I didn't even get a chance to take pics of the delicious looking doughnuts. First off they are open super early!! Bonus points there. And then they were fantastic. I got a cream filled chocolate glaze, Apple fritter, and a toasted coconut. Each one was exactly what I was craving. Thank you for the great service and wonderful breakfast!!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2015-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "MUHoBFzwRoXpCpgYSN8KRA", "review_id": "jI14AzwRkYx-rfoU-peGnQ", "text": "Man this place has good, smooth coffee.  I normally stay about a mile away from brewed coffee, but this Saturday morning, I was not in the mood to hang around the pretentious Starbucks across the parking lot and wandered over to the newly-opened Dunkin' Donuts to blow a few minutes.  Wow I'm glad I did.  Really, really good, smooth coffee.  Maybe it's just totally weaksauce, or maybe they put a ton of cream and sugar in the cup, but I thought it was possibly the best cup of brewed coffee I'd ever poured down my throat, which certainly isn't saying much.  I had a glazed donut, which didn't seem extremely fresh a la Krispy Kreme's old \"Hot Now\" thing, but was still light and good.  \n\nThe service was solid and pretty quick, although the staff seemed to have a bad attitude, which was odd given the brand new location and the fact that the franchisee was standing behind the customers and watching everything.  I predict the manager doesn't last very long.  I only spent a few minutes in line, guess it doesn't take very long to pour coffee and grab a donut.  And charge me a whopping $2 and 50 something cents.  Total steal!  \n\nLooks like they're also getting into breakfast \"food\" sandwiches served hot.  I'll have to try them sometime.  Now I just have to see if there are any DD on my way to work...", "business_id": "AhXcP_o5YAmCePKl0jxBXw", "stars": 4, "date": "2008-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "VDRYPEY-zSs3pbetLkGiiw", "review_id": "iOOB6cYoXNIkJE8HK-bLWA", "text": "No more Coolatta. The Coolatta machine is broken. At all locations, apparently. Why the (*bleep*) are you still selling Coolatta if the machine's broken? Does corporate office know they're scamming customers? Horrible customer service.", "business_id": "AhXcP_o5YAmCePKl0jxBXw", "stars": 1, "date": "2011-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3z0xSwEI7GOfYH9FQpGtUg", "review_id": "Sd3y1tZg-PYhP18WWm4puQ", "text": "After going there every week since it reopened I was treated like dirt last week.  After being treated so poorly we were on our way and opened the bag to find an order that was wrong..... AGAIN!!!!", "business_id": "AhXcP_o5YAmCePKl0jxBXw", "stars": 1, "date": "2012-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NNdfPF-UhvLB8FxbsuSC5A", "review_id": "cjWv0feCM54p34IrlCQAkg", "text": "Went there after hearing about the Arizona Cardinals promotion, if the Cards won, you get a free medium coffee the day after the game.  Well, I went, didn't know about the app for the smart phone.  Was told that I need the app and the phone wasn't with me.   Didn't get the coffee, walked away unhappy.", "business_id": "AhXcP_o5YAmCePKl0jxBXw", "stars": 1, "date": "2014-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z-4fysyVelPSG9lehMe0dA", "review_id": "t8duODsqAp8fAMno3PZC4w", "text": "Today was the last time I'll ever come to this dunkin donuts. The first time we came here my boyfriend got food poisoning and today the guy took my boyfriends order then walked away and when I tried to order all I could get out was \"bagel with cream cheese\" and he walked away without letting me finish ordering. Then I noticed I hadn't gotten my coffee and when i got my food it was missing an item. The guy said(with attitude) I had to pay for it, which I did after the fact. While waiting for my item the man preparing it was on his cell phone complaining about how much customers are complaining that their order is wrong when it's busy.", "business_id": "AhXcP_o5YAmCePKl0jxBXw", "stars": 1, "date": "2015-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "e3wjGyeeT2woxS698LBi-A", "review_id": "P6fBpHiJZNaD017t_GpLKQ", "text": "GREAT coffee, horrendously slow service with other employees not interested in helping knock down the line. If you are just getting coffee, hit the drive-thru - you'll be less frustrated.", "business_id": "YDeM8-M4GwxyymCoV7Y-Tg", "stars": 2, "date": "2011-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "cBJqlNzyoJFak3_XRe2bvw", "review_id": "rgbvrVYYMdZGwgORndL0Sg", "text": "If I had to rate Dunkin Donuts soley on their beverages and donuts, I would rate it much higher than 2 stars because this place is great for that. But for lunch and service, I was very disappointed. I went through the drive-thru today for a vanilla chai and a turkey, cheddar and bacon sandwich. There were only 2 cars ahead of me and somehow was in the drive-thru for a total of almost 20 minutes. The girl at the drive-thru window did apologize for the wait but still, not the reason why I go to the drive thru...I go because it's supposed to be fast and convenient!!! When I took out the sandwich, it had some sort of sauce all over the wrapper and the paper was sticking to the bag. When I opened the sandwich, I bit into stale bread and a horrible tasting sauce on the turkey! It was so nasty!! On top of that, I opened up the sandwich to wipe the sauce off and noticed a torn off piece of notebook paper stuck to the turkey!!! The chai they gave me was also sticky and had brown stuff floating on the top. The drink was also warm, even though I ordered it iced. I do like the flavor of the vanilla chai (I\"ve ordered it before and obviously like it). Completely disgusted and will not be returning for lunch or to the drive-thru!!", "business_id": "YDeM8-M4GwxyymCoV7Y-Tg", "stars": 2, "date": "2012-10-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "55jhGhaLoUJI9EJByQoNaw", "review_id": "hleAcii1PE-UzZTq4q77zg", "text": "The donuts here are fresh and amazing. In my opinion, the best is the blueberry donuts that they offer.The tea is great too. The salad bar is basic and iceberg based. The sandwiches are fine, if it weren't for Eugene who gets upset when anyone tries to make a change or substitution on the sandwich. He even barks and passes this anger onto Kim, who is the one who actually makes the sandwiches. The guy seems like a pretty mean person, but if you steer clear of getting him mad, the place is good. Best for donuts, OK for everything else.", "business_id": "oyxtTTQFGwCTkDrXAAPELw", "stars": 3, "date": "2012-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sjdQ7sAT6G3ibRRkFKrDlw", "review_id": "UFo7cSzCgQNjYMfHAJBSTw", "text": "Melt in your mouth, so good you want a bakers dozen, can't get enough of these bad boys donuts.\n\nIf you order a dozen, they'll throw in a freebie.\n\nThey open at 4am!!  \n\nThe bagels are not fresh in-house.  They come from Chompie's or somewhere like that.  \n\nGet the glazed!!!!!", "business_id": "3wkH1sL4tojmaveP1jNiIA", "stars": 5, "date": "2012-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 2}, "user_id": "ZvvxtxeTad9t3ZoxdNYe_g", "review_id": "03-5vimlo8TCIKUddxftLw", "text": "Thai tea and a doughnut.  Aside from not being what the diet doctor ordered , the sweet on sweet may not have been the best combination idea I've ever had, but separately, both were good!\n\nPop was out but definitely a mom'n'pop kind of place.  Nice down-homey little doughnut & sandwich & coffee shop.  Very nice lady behind the counter, her young son hanging out unobtrusively nearby.  Worth a stop if you get a hankering for sweet fried delight while you're in the hood on south side of Olive at 47th Ave.", "business_id": "3wkH1sL4tojmaveP1jNiIA", "stars": 4, "date": "2013-11-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "W-hPWK-F7OzfM-rXMMBpsw", "review_id": "UbQjrngwNDi3S5ESScPQrg", "text": "Not the best but not the worse. Their bread to me is not as soft as other donut places but it is still okay.", "business_id": "bZPEg3lCFSbJn_PczJyRBQ", "stars": 3, "date": "2015-11-18", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 7}, "user_id": "ePxzwqgNLQnYoObzLYhYvg", "review_id": "XXDGZU6_9hHM-OjrhKkvWQ", "text": "I really liked this place, my son requested donuts and at the ripe age of 3.75, I figured now is a wonderful time to introduce my little man to them. I got him a kids pack, he LOVED IT, he inhaled his donut, was fascinated by watching them be made and really enjoyed the car ride there! \n\nI liked it, it was clean,friendly staff and yummy samples.\nI wish they weird guy trying to sell my little boy a toy would have gone away faster, freak.", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 4, "date": "2012-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-cms2ELbzY2rSyGCVcioUQ", "review_id": "UFHvsnlkMf95SVwcAKklZQ", "text": "These are addictive, and best donuts you can get fresh. Try a 6 pack and put em on the seat next to you for the drive home. They won't make it.", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 5, "date": "2012-10-31", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "oOayyTrVO-PbVeXXsh_JEQ", "review_id": "u9dDaDtyishytJ132CwClw", "text": "I remember when Krispy Kreme Doughnuts opened on the west coast.  I remember these doughnut shops were found in almost every city.  One thing about a Krispy Kreme, the quality and taste is consistent.  \n\nFirst from the inside, you get to witness how a Krispy Kreme donut is actually made.  It's actually pretty cool to watch the process. Because of the assembly line process, it's no wonder why their donuts are always consistent.  \n\nService here has always been great.  When it comes to their donuts, the glazed is what they are known for.  \n\nTIP:  Whether you're going ordering inside or drive thru, request for their fresh batch. Nothing beats a fresh hot glazed Krispy Kreme Doughnut.", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 4, "date": "2012-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bc-lEKlxF_n11XWQV53oCg", "review_id": "AYbm9mgIhvZTUinklYe2nw", "text": "There's nothing like a fresh, hot Krispy Kreme doughnut.  Except, however, when you're going to use them to make bread pudding.  Then they go from the exceptional to the sublime.", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 4, "date": "2013-11-27", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "-k-juS7vkLZVqQJj2WzIRQ", "review_id": "YHFtmfEA28340qUrBJKD2Q", "text": "Real Donuts? They should have called it, \"Real Awesome Donuts.\" \n\nI stopped in to try the 45 sized donut mentioned in the previous review. How disappointing to find that they don't manufacture these donuts until 7:30-8:00 am. Guess I was a few hours too early. So instead I opted for the whopping box of day old donuts for $4.50. I wouldn't normally buy a day old donut, let alone six pounds (no joke, this box weighed at least 6 lbs!!) of donuts but my cheap bastardness got the best of me. \n\nI proceeded back to the office where I cut several of them in half and enjoyed at least 5 variates. At this point in my life I would almost consider myself to be a connoisseur of the Apple Fritter. Although this was not the best fritter I've ever had, I would say that it ranks in my top 3. It had many more apples than your standard fritter and that is a plus in my book. The bear claws come in varying sizes which I liked, however, the filling was more of a spread than a pie filling...not too impressed here, thus the one star deduction. The other donuts I ate were very good, although It is rare that I come across a bad donut. \n\nReal Donuts is open 4am  - 5pm  (HECK YES!), so get on in and get your Donut On!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 4, "date": "2010-10-12", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "L4ZUrCdmIhkaleIyQ9P6rg", "review_id": "TXW82Cvay8Q0R1aLpZfBdw", "text": "The last stop on my \"Vegas Donut Hunt.\"\n\nVery good donuts and wide selection at 4am (when they open).  I tried the old fashioned, buttermilk, and chocolate raised and they were all great (I didn't care too much for the chocolate glaze, but the donut itself was good).\n\nI can safely say, out of all the places I've tried this is one of the best, along with Donut Hut, Master Donuts and Friendly Donut Shop.  Try either one of these places and you're guaranteed something good.  (I'd recommend coming EXACTLY when they open though, if possible.)", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2011-10-08", "type": "review"}
{"votes": {"funny": 5, "useful": 6, "cool": 3}, "user_id": "gBID8jIwsQIE5W_Zr0Vhjg", "review_id": "qcNYqefVzK-_3_IY3AIizQ", "text": "Two words: giant donut.\n\nOrder one and you won't regret it. That's all I have to say.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 4, "date": "2011-10-22", "type": "review"}
{"votes": {"funny": 5, "useful": 4, "cool": 2}, "user_id": "lMMmbnlkaoK_WGkMOAcxlg", "review_id": "vF1toWQJ9UQi-m7QZxMGLw", "text": "If you love the corporate, cookie cutter donut made by a machine, that tastes as bad as it looks then you have come to the wrong place!\n\nI have been eating donuts from different establishments in Las Vegas for the better part of 20 years and have not had the pleasure of eating a REAL donut until today.  \n\nReal Donuts (#1) is a police officer's heaven and a donut loving fiend like myself's daily go-to. \n\nThe cake donuts are so moist and flavorful you will skip the traditional cake for your birthday and stick candles in a blueberry old-fashioned donut instead. One bite into that particular donut and your mouth is swimming in a volcanic ocean erupting with the perfect, natural blueberry flavor I desired.\n\nThere is also a version of this donut with a thinly glazed vanilla covering to it which is equally incredible in its own right. It mixes together perfectly and leaves you craving another and another.... and another. \n\nGet them early because they sell out fast!\n\nThe old-fashioned coconut is another I must rave about. \n\nIf you will, close your eyes (after you read this) and imagine Harry Potter and Hermione Granger in potions class attempting to transmute an old fashioned cake and a coconut into the world's most perfectly balanced donut. \n\nHarry and Hermione failed countless times but, Real Donuts got it right the first time. It is slightly more robust than the standard cake donut and has a coconut cream layer on top that is dying to melt in your mouth. To tantalize you further, fresh coconut shavings are placed on the very top of all that. \n\nI am an old-fashioned, cakey kind of guy of you hadn't noticed. I have tried the cinnamon rolls, bear claws, apple fritters, standard donuts with center holes (chocolate, sugared, frosted, sprinkled, nutted and glazed), maple and chocolate bars, raspberry filled, apple filled, tiger tails, chocolate glazed twists and standard glazed twists, chocolate cake with chocolate frosting and cake with sprinkles. And they are all beyond exceptional. \n\nMy unconditional favorite will forever remain the plain ol' old-fashioned cake donut with the rough edges that break off into bite sized pieces so well. \n\nI am officially addicted. AA here I come.\n\nTo make matters worse, there is an adorable little thing here named Tanya that is eager to deliver to you your edible promise-land from 9am to 6pm Monday through Friday. They do open at 4am on weekdays and 5am on weekends, however. \n\nSee you there!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2012-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Vd1lAHzl7UUr9BawFHjOoA", "review_id": "xoXXL0A2VMOWOmB0pvNL3A", "text": "There are a number of donut shops to choose from in town but if you want one worth buying, don't bother with any of the rest. Yes, you heard me...drive here from wherever in Clark County you are. I promise it will be worth it. Yes donuts are bad for you, but if you ARE going to eat them, why not eat the best?\n\nThe girl behind the counter was very friendly and happily explained prices and quality of the donuts. We picked up some day olds (which are a bargain, at 2 dozen for $5) and brought them to work. They were gone within 2 hours and no one ever suspected they were old.\n\nMy evaluation is based on the fresh donuts we tried. It was incredibly early in the morning and I was pleased to see that they were open and ready for business. I tried their large maple twist and had some of my girlfriends chocolate pecan roll and a bearclaw that we split. \n\nI was blown away by the juiciness of each bite and the consistency of the dough. That's not to mention the sheer novelty of their large specialty donuts-- the Texas and The Alaska. You'll never return to Winchell's, Dunkin, or Krispy Kreme after you've become privy to this place. I can't wait to return and try their monster donuts out.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2012-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "uGBA4cvszHgqBNU4t-Ovww", "review_id": "mdhsyaX-sGFvVLBDRaqhkg", "text": "After reading the reviews on YELP! I decided to try this little place out. I'm new to LV and always looking for places to replace my home town loves. \nI am 100% happy I chose this bakery. It was clean, the guy at the counter, Brian, was super friendly and the prices were terrific! It is a little out if my way from where I live and work but it is totally worth it. I will be a customer for life! :)  \n\nP.S. Thank you for listening to my story about the Bakersfield, CA bakeries and for the super duper delicious blueberry donut you gave me!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2013-09-01", "type": "review"}
{"votes": {"funny": 8, "useful": 11, "cool": 10}, "user_id": "xQpO4Jfi-Np3HLmJrQAe0Q", "review_id": "q9hlNCM3XUX4FB9YNKxXmA", "text": "donut  - noun\n a small cake of sweetened dough, often ring-shaped or spherical with a jam or cream filling, cooked in hot fat \n\ninverted cinnamon roll  - noun\n  a cinnamon roll with swirls of devil's food cake, found at Real Donuts on W. Charleston and Shadow Lane, across the street from UMC Hospital.  One bite and you're in love.\n\n* I stopped by this family-owned business and Pat Gallagher assisted me in picking out two dozen tasty delights for my office.  \n* Two dozen mixed donuts came to $18\n* If available, you can buy a box of day-old donuts for $5.  Each box contains 18-24 donuts.\n* The drive to Henderson was a little torturous with the smells emanating from the boxes in the back seat.\n* You had me at the inverted cinnamon roll.\n* I'll definitely be back for more spheres and shapes cooked in hot fat.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 4, "date": "2013-11-06", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "XjHVXGOmu_MiL1gFovqT4A", "review_id": "weNKfrt0KfLqxuk-Me96jA", "text": "Fresh, soft, flavorful, giant and delicious...what more could you want from doughnuts?  Look no further, if you work anywhere in the downtown area this is the doughnut shop for you.\n\nThis family owed little store tucked into a strip-mall across from UMC was probably the last place I expected to find my favorite doughnuts but ever since a co-worker introduced me 3 years ago I have never wanted doughnuts from anywhere else, even (dare I say) Krispy Kreme!  \n\nThe variety is endless, although I like the cake and regular (glazed? it doesn't actually have glaze, just the doughnut) with chocolate topping.  The plain glaze and the old-fashioned are also delicious.  \n\nThe doughnuts are baked fresh every day and the staff at this family owed shop will remember you and become friends after just a few visits.  They also have milk to go with your doughnuts and coffee (if you drink it).  A couple of small table allow the morning regulars to sit down and enjoy but they offer quick service for those of us running to work.\n\nThis may be a downtown secret but once you're in the know, you'll see from the Friday morning crowd many others are too :)", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2013-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "vffqpHA6almhiZZeJ-kfhw", "review_id": "JJQQYbP5vwspAHChB_oMbw", "text": "It was a quiet little donut shop with a very friendly lady working there. She was nice and greeted all the customers by their names. It smelled so good like fresh cooked goodness. I bought a dozen and a half donuts and a dozen donut holes for the people I work with. It was a reasonable price at $15. The donuts were very fresh and warm. I had the lady working just give me a mix of everything. I had a round one with chocolate frosting and orange sprinkles for Halloween, it was very tasty. I also had a few (or half the bag) of donut holes and they were just as tasty. I would definitely go back and would recommend this place to my friends.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2014-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G97McVF2HsjZ871FM1Sfpw", "review_id": "2nOzKeG90CH3tfC1WOpb_Q", "text": "Donuts are consistently great!  Always fresh and never too greasy.  They always have a huge variety to choose from also.  Love this place!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2014-09-28", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "JzHR73t53PGn6p_-6B_DiQ", "review_id": "D31KERqa1yUrUSKoETW7Ww", "text": "The employees made me laugh the entire time I was there! I appreciate entertainment while I wait. The donuts were mouth-watering and fresh. I bought three dozen donuts to feed a class of folks and they were nearly gone within an hour. People, including me, were going back for seconds!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2014-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XXTwK0TwCZeZ8BejuZaUdA", "review_id": "wozmAUA28A7sODMg9gIxFg", "text": "I have been going here for years. The BEST way to start your day. Fresh, yummy and the prices are great!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2014-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sBz2kvEJy3kks1Br0Q0Tjg", "review_id": "3xwQGEzeJCPwVNN-SRVyvw", "text": "Good donuts! Really good! Super fresh. The place was crowded with locals. Staff was friendly. Would go back for sure!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 4, "date": "2014-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1EbyRr58fP-uPoTAFuIvew", "review_id": "2aU8nej1tcI_9fhi2wNsDw", "text": "Awesome place. Swooped in right before they closed and I tried an orange frosted donut!! I already love pink frosting but Orange is my new favorite!! Lady was super nice also. What a sweet place to have sweets ha!!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2014-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fZYoaasjAeRcZwEGWUh7Hg", "review_id": "3qw-ngcj9jkO5JYkxUBo3g", "text": "I couldn't believe it.  We checked in and we got 8 specialty donuts for $6.50!!!  How is that possible? ?  Owners are super friendly.  Everything was very tasty,  we especially liked the fritters (blueberry and regular) and the apple filled.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2014-10-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "gHz4JxGE6yNuGoRfEYUtvA", "review_id": "0APHnhYPREm3PU2NVMMWeQ", "text": "First time at Real Donuts, the costumer service was fabulous!!! Really enjoyed my time ordering donuts lol \nOur clinic went on a donut adventure, we order their top sellers and let me tell you they are all worth the calories!!!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2014-11-12", "type": "review"}
{"votes": {"funny": 22, "useful": 23, "cool": 21}, "user_id": "uO8iD4P9kHpzkSXLLK27bA", "review_id": "29n8ojQp0ct65L969Kql_A", "text": "Before JayZ and Kanye West, there was RunDMC, before Justin Timberlake and Justin Bieber, there was Michael Jackson, before Coldplay there was U2....before root beer float donuts and maple bacon bars, there were Real Donuts.  Not to say the course of donut history hasn't taken a turn for the delicious or creative, but sometimes it's good to remember the original.  A stroll through this little shop across the street from the University Medical Center, one does not need to crank their DeLorean flux capacitor to 1.21 gigawatts to go back in time to taste how donuts were made back in the day since the folks here have been making them the same way every day without infusing pop rocks into their custard or sprinkling green tea powder or ruining a perfect slice of bacon on top of their donuts.  These are the donuts that sat atop Starsky and Hutch's dashboard or within the nuclear power plant control room of Homer Simpson.  \n\nOld school donuts done correctly and beyond reasonably priced.  Not the subtle sweet/locally sourced ingredients/brioche dough, modern donuts that are all the rage, but the sinfully sweet unabashedly artificial variety that melts in your mouth due to the embarrassingly high sugar content  made fresh every morning perfect for dunking into a cup of cheap drip coffee.   Highlights are the airy french crullers, the impossibly crispy fritters (the blueberry variety is exceptional), as well as old favorites like the sour cream donut, buttermilk bar, and the enigmatic inverted cinnamon roll which contains a stroke/streak of genius/devil's food cake.  The folks behind the counter are extremely friendly and they open at the crack of dawn so you know they take great pride in starting every local Las Vegan's day off on the right foot.  Grab a dozen for your coworkers and you will be the most beloved person in the office.  It's comforting to know some things are not meant to change, so be sure to support this local gem.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 4, "date": "2014-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Md20_5-lpgQSesqCoSIt3A", "review_id": "OLeKFCN0mpBZqW_uWZC41Q", "text": "Maybe it depends on what you get.  I tried the blueberry fritter and tasted very crispy, like burnt.  So luckily I also got the inverted cinnamon roll type of donut and that was superb.   Very soft and chewy, sweet and cinnamon-y.  The donuts are priced right and the guy was super nice at the counter.  I can see people being fabulous and getting some for their coworkers.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 4, "date": "2014-11-23", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 3}, "user_id": "9A2-wSoBUxlMd3LwmlGrrQ", "review_id": "d5oBb_I2AlTOLHZlTRUkHg", "text": "The first thing you'll notice when you walk in are the two glass cases full of beautifully decorated old-school donuts. To be fair, that's probably all you'll pay attention to at any donut shop, but the variety here is pretty extensive.\n\nRegular and \"inverted\" cinnamon rolls (they kind of resemble brains), classic and cake donuts a plenty, sprinkle- and frosting-topped versions for purists, and \"fancies\" like maple bars (no bacon here!), buttermilk bars (a surprise hit!), giant bear claws, and eclairs. Anything with fruit is generally really well done here, too.\n\nI'm not even really much of a donut fan, but this place gets an extra star for not pulling that cash-only BS that other places do. Also, they're open til 6PM!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 4, "date": "2014-11-28", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "-yQde9YbRGu_JbEfK_YOTw", "review_id": "M5XMvkCsvJ4SyOpcyNfu1g", "text": "These are straight up delicious donuts. None of that fancy crap, just the good stuff. It's a hole in the wall establishment and you'd miss it if you weren't specifically looking for it. The price is good, nothing outrageous. \nThe cake donuts are crispy on the outside and soft on the inside. I just got the blueberry muffin cake donut and it rocked my world. Seriously. \n\nThe service is amazing every time. The guy (I don't know his name, I feel like a jerk about that) even recommended a great band (Portugal the Man).", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2014-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "u-a2jdGzlOFN_VZcAvlrrA", "review_id": "2zaukpUNj-huoVpfOTiltw", "text": "My partner and I stopped in to grab some donuts for my family at UMC. We noticed the good reviews and the location, so we had to stop in at check it out. Once we stepped in, we knew why the reviews where great. We were greeted w/ a smile and kind words. THEN she asked why me and my and my partner weren't in school; a compliment that we look young. What personality!! We had a blast picking our donuts and so should you.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2015-09-04", "type": "review"}
{"votes": {"funny": 14, "useful": 18, "cool": 17}, "user_id": "RD8Zt5M0ej2Ql-vzA27uqg", "review_id": "b6BB4rleV303uZafh1WrFQ", "text": "Came here to pick up some doughnuts before heading back to San Diego. This was the last stop before going home. \n\nI know I shouldn't be having doughnuts for breakfast but I had to have one. You check in on Yelp and you get a free doughnut. How cool is that? \n\nThey take credit card which is a must for me. I hardly carry cash. \n\nAs we entered this doughnut shop, you see an array of doughnuts in the display case. I didn't get a chance to take a photo because we were in a rush to leave. When it was my turn to order, I showed her my Yelp check in. I got glazed for my free doughnut. I had to give them my business, so I also got a dozen glazed doughnut holes along with a bottle of water and an apple juice for my daughter. Total was $4.07. That's awesome. The lady ringing up my order was super nice and friendly. I didn't catch her name but she had a great personality. \n\nThe doughnuts are fresh and delicious. Highly recommend coming here for your doughnut fix!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2015-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AQUo8sSfcQM1S51XIHorFg", "review_id": "XJ9jy0FPwxBD1TBGAIgo-A", "text": "Good donuts and you can use the check in offer every time! Friendly and I happened to be waiting for a friend so it was close. I would definitely come back.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2015-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5xyAJWZJqOoJGaaV37GQrg", "review_id": "vUqtqzytt04UZU_KIEsWkw", "text": "Real Donuts is really good ! They have  donuts and buns which are really fresh. They had a dozen for $7.00 special which is a real bargain considering the quality and size of the donuts. I would suggest arriving early, I was there around 1 pm and the inventory was starting to thin out. However I did purchase some filled donuts, chocolate with frosting, apple crumb (which was amazing ) and a few more equally tasty treats.\n\nThey have coffee and lattes advertised I will have to try next time.The store is small but feels welcoming and the customer service was outstanding. I will deliver be back the next time I'm in the area.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2015-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WfwVo8TcksG8j1x6HlYXnQ", "review_id": "TvJZ7DzRzA6Eiu5JnWRJvQ", "text": "Best doughnuts that I have had in a long time!! They bet the doughnuts I grew up getting at the local doughnut shop by a long shot. The old fashioned glazed and blueberry doughnuts are to die for!! The staff is also super friendly. I am willing drive from henderson to this doughnut shop. Must try!!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2015-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mT21Vd6ABB6otLo2OT7eXA", "review_id": "Xu33cVc5ukwjghq-lzs1PQ", "text": "I really like the donut shop because I have really great deal time to time and this is my first time reviewing on it because I think today was a really special because I had a coupon and it was so amazing I got to use it today cuz I was short on time. But even so they did a really amazing time job quickly service", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2015-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nPiNC5ia2W5CfsWW56B7xw", "review_id": "6uzCkSzQNCT7nDvczD5mtA", "text": "I've been here a few times and always had a good experience. Donuts are delicious. Its a great old fashioned donut shop that reminds me of the places from back home. If you're debating I say go. Really cant do much better than them.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2015-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Xzl3sw1hZya3_e2niAqxZw", "review_id": "2dyrgmO8N524nSSSo00TUQ", "text": "If you are a donut fan you have to try Ronalds.  I think the review by Myke R. says it all...drink the KK haterade.", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 4, "date": "2007-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "XXc7EeUxqh_I1qOOyJ6xEw", "review_id": "LOJoDdSx-fdySVT037Rh7A", "text": "No offense to those that wrote other reviews, but Ronald's Vegan Donuts beat those in Portland from Voodoo, those in Seattle from Mighty-O's, and those in Berkeley, CA. These are the best VEGAN donuts anywhere. I won't even compare them to store bought ones. \nThe fact that Voodoo Donut's in Portland can't even make a cream or jelly filled donut should tell you something about Ronald's!\nThese are the real deal, Dunkin Donut fried style, not the cake-like vegan one's you're used to. I drove all the way from LA during my vacation just to go here...and let me tell you, 4 DOZEN later, it was SOOOO worth it! They best part is that they are incredibly cheap!", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 5, "date": "2007-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "ferTm6yn15l5Cme-eTug5A", "review_id": "KI4j4Iz7-Sm0VQZcHDdXLQ", "text": "Whenever i forget to have breakfast and i am with in a 5 mile radius i typically hit this place up. I have been there and seen people come in from all over the country to eat there vegan donuts. i have bought dozens for people and tell them later then where vegan, i can't recall what a \"Normal\" donut might taste like but i am sure they are no different as everyone loves them. They have won best donut's in Vegas numbers of times. \n\nDo yourself a favor and if you have not had there donuts try them.\n\nNote. This place is a bit \"Ghetto\" and is located in the heart of China Town.", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 5, "date": "2008-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "38JK-SfO9NkAGs1RwlH2Gw", "review_id": "0XvhcM7I1q7jNOzPIjU5jg", "text": "We enjoyed the best ever apple fritters plus a crown donut and buttermild donut.  Ronald's is vegan friendly.", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 4, "date": "2008-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "0y9qZZLauQ3sPp-G-NcE7Q", "review_id": "D2KgwGZXwEHHmUmGTjjAKw", "text": "I came here with my nursing buds after MSG intoxication at Pho Saigon 8 and Milk Green Tea from Tea Planet, since Theresa B. wanted to try this place before we left Vegas. I couldn't tell the difference between the vegan donuts and regular donuts. I had their glazed vegan donut, and it tasted just like the good ol' mom and pop donuts you would get at those small donut shops. It was definitely good though....yum...\n\nDon't forget to bring cash here, as it is cash only!", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 4, "date": "2008-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Lc3XHZZQ9aKl48CnRut4Kw", "review_id": "8H5g6aKgNgRH2BAug7JzqA", "text": "Yes! I can finally cross this off my To-Visit list! We came at 2pm but seriously, who gets donuts in the middle of the afternoon!?!?!  Anyway, I had the vegan glazed donut with the chocolate icing! Wow...it didn't taste any different than Winchell's!! I was expecting some sugary donut...but it was actually ok.  But then again, I ate only ate half and saved the other half for later!\n\nHow do they even make these?!?!", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 4, "date": "2008-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y14YW3Y0dMDQS3PwitIYRQ", "review_id": "q2uwNW5yREUmBi3bNVKksw", "text": "Its all been said, but its worth saying again.\n\nVegan donuts, in Vegas no less.\n\nThey taste like regular Donuts, and for those of you that are not, or have never been Vegan, you cannot understand the rarity and splendor of this gift.\n\nOf course, that means that I eat at least 5 donuts when I go here, and proceed to feel like garbage for a few hours afterward.\n\nIts also sad that they sometimes run out of the crown jewel, the cream-filled donuts.  Is it really Vegan?  If not, keep lying to me Ronald.", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 5, "date": "2008-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cEu60KdbwgIFUGT5vfGqVA", "review_id": "vCJNHWnigTS3r3quMGpI6g", "text": "HEADS UP: Cash only!!\n\nI'm going to second what Andy C said .... CASES filled with vegan donuts\n\nAgain, I'm not vegan but my daughter is... and as I started to t ype my next line I see that Andy C also said the same thing - there's no reason all donuts couldn't be vegan. These are really very good.\n\nI wish I'd got a cake donut too, because they're my 2nd favorite, but I got the maple bar. ... ... mmm mmm good. We also got an apple fritter, an apple turnover, an apple burrito, a plain glazed and lemon filled.\n\nCan't imagine anything being bad.", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 5, "date": "2009-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-S9b3p-jZiKvmPa1fA380w", "review_id": "_WB2aDRn8OucxF5anQN4iQ", "text": "I don't get to eat donuts often, and i don't really want to, but when i am visiting vegas it is so great to have this treat of a place.  soooooo many different vegan donuts.  the creme filled was the best, the cinnamon rolls were soooooooo good too!  the people working were so nice.  \n\ni'm not even sure if most of the people there realized they were eating vegan donuts, it just seems like a regular donut shop till you ask.", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 5, "date": "2009-09-26", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "Iurm6He6yjJ6eTAaATJgeA", "review_id": "YUkQZn3fKO7SbV6AKA5Qew", "text": "Round trip cab fare from Treasure Island hotel to Ronald's Donuts = $15.\nOne dozen mixed vegan donuts = $10.\nLook on my friends face when I told them that the delicious donut they just stuffed in their mouth was vegan = Priceless.\n\nYeah, it cost me more to get there than the donuts themselves but I just had to try Ronald's while in Vegas. I've had vegan donuts in Oakland but they are the cake kind and not the fried kind. Ronald's donuts taste just like your regular donuts but without the use of any animal products. I'm sure the vegan donuts are not exactly healthy, but eating vegan things makes me feel better about eating junk food. \n\nI don't know why more donuts aren't made vegan. If the taste doesn't suffer, what stops all donuts from being vegan? The owners of Ronald's (who were super nice by the way -- when I told the lady that I took a cab all the way from the strip, she said \"Thank you, I appreciate it!\") would make a killing if they opened up a shop in the Bay Area. I want to steal their recipe and open up my own vegan donut shop. That's my new goal in life. Don't judge me.", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 5, "date": "2009-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "62-ja5AGLhZJ6HZi5_K9tA", "review_id": "996SZltXgIck_WGUa9npWA", "text": "Absolutely delicious!!!  I'm still not sure how these are vegan, I didn't really see anything on the menu stating they were vegan, but whateves.  They just melt in your mouth.  Perfect.  Next time we are in vegas we will for sure visit Ronald!", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 5, "date": "2009-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_5DehTLyFIH5kQv18Iv_qA", "review_id": "s0OuKwnXbV8IQl2z3yH5Vg", "text": "OMG AMAZING VEGAN DONUTS!\n\nThese donuts tasted like non-Vegan donuts! My friend had to try these when we were in Vegas. The one thing I want to say is that I wish I could eat more than one donut at a time [I have a problem eating sweets in large quantities]!!! The owner was incredibly nice and although the place seemed older, it felt very welcoming and/or comfortable. We even met some \"regulars\" who were sitting in the dining area - they were the nicest people ever! If you're in Vegas, it's seriously a few miles off of the strip and is well worth the little drive!", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 5, "date": "2009-10-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "eymC6gFmLZ-v_BNKG65u_A", "review_id": "6j-eLHKLe6t37Fqgp2rqUA", "text": "vegan donuts!!\n\nmy vegan boyfriend comes to vegas for two things - dunkin donuts and ronald's.  whenever we drive to vegas, our first stop is to get these donuts.  i'm not vegan, and i still love these donuts.  these are as good as any donuts store you drive by on the street.  i don't know how they do it, they are so good and don't taste vegan at all.\n\nmy favorite is the apple fritter and the sugar coated.  the cream filled donut also seems to be a big hit.\n\nwe went on a saturday around noon and there were a ton of vegan donuts to choose from.  but when we went on sunday around the same time, they were almost cleared out.  i guess they do a lot of their business early morning, so if you want your donuts get there early!!\n\noh and it's cash only.  so bring your dolla bills.", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 4, "date": "2009-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QFCHxbxG7JJevfTyV4noZw", "review_id": "oH3S7jV528nDHn7ZcyOMZw", "text": "Simply a perfect execution of what a vegan donut shop should be. \n\nCheap\nTasty\nNot pretentious \n\nThe fritters are the best, although I haven't tries them all. \n\nOn our way out the delightful owner packed us up an extra 6 donut holes in a very kind (and calorie filled) gesture!", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 5, "date": "2009-11-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0A8dH64bMVQCYN-RniCKBA", "review_id": "cFvYCLXHpsEqUSd5xDXqmw", "text": "Straight up, one of the only places in the West Coast for Vegan Donuts.  Amazing prices, and my non-vegan friends could not even tell the difference.", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 5, "date": "2010-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "y9NvtHUzizvWFYSZ5FV5_g", "review_id": "SLgk0-kgd_S2Q5ssOO0d-g", "text": "The doughnuts were dry. They weren't superior to any other doughnut shop. \n\nApple fritter was good but left a coating of fat on my tongue.", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 2, "date": "2010-09-14", "type": "review"}
