{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "IbvOxKSps_K5wa3a2_jc-Q", "review_id": "yNd0OR-ViprHVplGDe1NAQ", "text": "I think the only thing I appreciate about Whole Foods is entering the store and seeing their fresh cut flowers.  Let's see why.....\n\nI attempt to drive to Whole Foods only to be caught in a line of 5-6 cars attempting to get into the parking lot.  (I guess I'm not cool enough to ride Pat Transit from the South Pittsburgh home).  When I find a place to park, after the Lexus SUV (HA!) pulls out, I find that they didn't put their cart back.  \n\nSo I enter the store and admire how their design is very appealing to the eyes (how DO organic oranges get so ROUND and so ORANGE) and everything is stacked so neatly.  Then I read that a pound of these oranges are $1.99...  Then I go to the meat section, which I don't even eat, to find that the prices are double those of Trader Joe's or even Market District (see future review).  So I walk around and debate to see if I should buy Clif Bars and Naked Juice (which happens to be on sale) because LORD KNOWS I don't need bulk-blanched-almonds.  But then I decide to buy \"fresh\" CHUNKY peanut butter because it would be fun to try.  (When I get home later, however, I bought Valencia peanut butter, whatever the hell that is, and cannot stomach it.  Gimmie my Jif.)  So while I am waiting in line, I see the  bikes (those rebellious urbanites moved from Quiet Storm) and wonder if my money is better spent elsewhere.  \n\nRegardless, I whole-heartedly (no pun intended) support organic and sustainable farming, but I'd rather go to the farmer's market or drive a bit further out of the city to go somewhere real to buy my \"whole food\".  And at least I put my cart back.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 2, "date": "2007-09-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "qezuW5Y1_wxwMceSMSvcVA", "review_id": "50-4RYHI2oFG_TNs9GvHeQ", "text": "I found out the caterpillar in the romaine bag. Eww it climbed up on my arm. Goosebumps :( BUT at least it can be the proof of \"organic\" besides the bug was green!!!! So healthy !", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 5, "date": "2015-09-04", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "H4NhdCLWClmdNFe7ej7Njg", "review_id": "kg_ScrViOFTEDhVuw7-2AQ", "text": "A lesser known Whole Foods type of market with its own charm. \n\nThis place is pretty cool. There is so much to see and consider buying and I was intrigued at every corner. Listen to the reviews! Their selection of veggies, meats, fruits, frozen items, nuts and pretty much everything is amazing. You'll have so much fun exploring even if you're not looking to really buy anything. Boyfriend got dried mangoes and almond butter. A bit pricey, but we expected it to be. I got some food from the hot food and salad bars. They are small; you might find something you like. (Their mac n cheese is good!) They also have a juice bar, which I'd love to try next time. \n\nEast End Food Co-Op is an excellent place to do your weekly grocery shopping. You can find everything you need here and more.", "business_id": "-iVcmhjfq79QoTWzrb6pKg", "stars": 4, "date": "2015-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "hru2IDwSyN61sgWPtJw_hA", "review_id": "8kspYO7qBP4bU6DPoPBlvg", "text": "THIS is my favorite grocery in the Strip District and in my completely accurate and correct opinion, it is better than Penn Mac.  I dont know why.  I just like it better.\n\nTheir dips are amazing.  I once had a party and put the dips in bowls and then said nothing when people asked if I made the dips, which was great until people wanted my red pepper hummus recipe.  : /  then i fessed up.\n\nYou can sample the different dips and cheeses, they have them all set up for you so you can just try whatever you want.\n\nEvery Friday its wine & cheese night at my house, I stop in Stamoolis and pick up different cheeses.  They sell pasta and pastries as well and I think though they are a small store, they have just about everything you'd need.", "business_id": "tyXvO1G2qK3MUfaap30auw", "stars": 5, "date": "2014-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "pjI4wXdKTMePI0A3rVzLxg", "review_id": "8VY5H0M9Gg_VCrU43sIS7g", "text": "Awesome little store.  Well, actually it's not that little.  Obviously they kill it when it comes to pasta, but they have all kinds of stuff.  It's a full market where you can buy produce, cheese, sauces, etc.  We came here once during our visit and had a blast just looking around.  Didn't even buy anything.  Whether you are a local or a tourist like we were, it's worth checking out.  Iconic grocery store.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2013-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kDYpTc-yc8UAxCs_LhX1yA", "review_id": "0_XxjvkdbU3ZwSP7KntIcA", "text": "We love Dean and Deluca and head there often, especially the one in the Philips Place area. I tell you, everything there is so convenient, and there's everything: nice dining, cheap dining, movies, shopping. But I digress. \n\nDean and Deluca, too, is great for everything: gourmet shopping, prepared food, or a nice snack. My girlfriend always complains that it's too pricy, and she's kinda right: a small container of potato salad was like $10. But it's soooo good, and so hard to turn down. \n\nI love their grilled chickens and their various salads: the salad bar is amazing, as are their tuna salads, eggs salads, pasta salads. If you're a lover of all types of salad, this place is perfect for you. It's your heaven. \n\nThis D and D is huge, so you can really stock up on every nice thing you need to fill a pantry or fridge (if you've got the bucks). Great coffees, too. It's the best, really. I go back too much.", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 3, "date": "2008-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VpKYx5oNJc-inG0ytUCHGw", "review_id": "hs1AqdZdT84dXTHsFK6MSg", "text": "I found these guys while looking for an affordable supplier for popcorn for an outdoor party. I had a tough time deciding what flavors to get. Individual red stripped bags were included for guests to fill and refill with the various flavors. The popcorn was very good and was a HUGE hit. People are still talking about what a wonderful addition it was to the backyard movie / party. Will be using them again this year.", "business_id": "JrlQeSad3Dzf2IV8umZ9ow", "stars": 5, "date": "2015-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "Y-nr6eaHwP3HF1jV4JKDJw", "review_id": "0YDbV9OuRzd_uXAGEMXyYw", "text": "This place is easy to miss, but make a point to stop in. \n\nIf you live in Wisconsin, you've had yourself a brat or two...\n\nBUT--have you had a gyro brat, or a chicken habanero brat, or a Hawaiian brat? \n\nYou can if you go to Jim's! I talked to the man behind the counter(Jim?) my first time in, and he told me that he tries to come up with a few types of brat each season, and then he keeps the favorites. His goal is to get to 100. ONE HUNDRED KINDS OF BRAT, PEOPLE. There are fresh seasonal types, and of course your classic. In the freezer, you'll find the mecca of meat selection.\n\nOf course, there are more than just brats...otherwise he would have called the place Jim's Brats. You get the idea.", "business_id": "WxfedycTcbQO_GuXHo9Ypw", "stars": 4, "date": "2008-09-01", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "HANb8-8InWnju-XzBQQSBw", "review_id": "5jQ82CcVdymq17uUzmk88Q", "text": "Join the co-op, work a few hours a month, get a nice discount on organic foods and bulk items, plus eco-friendly cleaning and paper products.  Meet great people.  Simple.", "business_id": "Q9eZS4qDdJo1ker0w3wnMg", "stars": 5, "date": "2005-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Xc1dIj1B5KEMGI0kpK1j6w", "review_id": "MT0shTg3xTWXHrY2tCQeQQ", "text": "Yes, this place may have a wide variety of groceries to chose from, but the quality can be horrible. Be careful to find the expiration dates, because you can often see cans expired for years and still on shelf. Also, be aware that some of the bakery stuff be moldy before you even open it. \nI still shop there when I must, but usually AmKo or Green Onions are  much better.", "business_id": "BnHVssX00VthoSNsMVO51g", "stars": 2, "date": "2008-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "cXhs6BawP6L_V59zKb9dOw", "review_id": "jgQm9xcRApAgGbv6fj_aAQ", "text": "The best Mexican food that I've found in the valley, and absolutely worth the risk of getting shot while driving down Van Buren.  All the food I had here was incredibly fresh, delicious, and flavorful.  It seems that everything is made in-house, including the tortillas, and it shows.  Prices are great too - I got two tacos and a burrito for about $12.  I also love the huge charcoal grill in the middle of this place, although it does fill the restaurant with smoke on occasion.\n\nWhat I ate:\n\nLengua taco - super tender and fantastic.\nCarne asada taco - extremely flavorful and just really awesome.\nChile relleno burrito - a MONSTER made of delicious.  The only reason I was able to eat this and two tacos is because I'm a fatass - I'm pretty sure a normal person couldn't even finish the lone burrito.\n\nI also tried a bite of someone else's fish taco and it was awesome.  Most places deep-fry their fish for tacos, but La Tolteca grills it, which gives a different flavor and texture that is absolutely fantastic.\n\nThe salsas are also really fresh and delicious.  Even though I prefer spicier food, the mild salsa verde was very flavorful and delicious.  The salsa habanera had a good kick to it and satisfied my craving for something hot.\n\nLa Tolteca is awesome, and it's unfortunate that I didn't find it until after I moved out of Phoenix.  I'll be sure to stop by every time I visit though, as this place is worth it.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2009-10-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KcsMtJk4ggrAXoCRIUhFwA", "review_id": "Ji-KOVWRniETJ3ctufDACQ", "text": "I love hole-in-the-wall taco joints ... usually. Not so here. I got the shredded chicken and the carnitas tacos. Soft corn tortillas, of course. No flavor on either - I guess they really rely on their salsa bar. The carnitas bordered on inedible due to the very hard crust on the meat. Might try this again someday just to try to see how it got so many 5-star reviews, but this trip was barely worth 2.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 2, "date": "2014-10-01", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "4MnVm1LWQ2ZXso4ORe_fZA", "review_id": "CQ24m91UntgfGWp2qcghjQ", "text": "Well, there are two reasons to go to AJ's: you have plenty of money to waste, or you're looking for a certain product that's not sold elsewhere. My friend and I came in for the latter the other day: me, for some of my favorite foaming bath, and she, for some flowers.\n\nAvoid this store at ALL costs in the afternoon. It's rich kid hell. A mob of Xavier girls fills the patio and coffee area, while even more clog up the lines inside. \n\nMy friend gave me said flowers because I was having a rough pain day. She handpicked the bouquet. The florist beheaded one of the flowers and impaled it with floral wire, and it was dead by the time I got home. The other flowers only lived for about a day. I was pretty surprised, because when I buy flowers at Trader Joe's, they survive much longer.\n\nI'm sad to say, AJ's is phasing out the Fruits & Passions line. Well, now that Wal-Mart carries Nathan's Famous pickles and I won't be able to buy my bath products here anymore, I don't suppose I'll have to stop by this place at all. What a shame.", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 2, "date": "2014-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "JL_cervg7k-NB199arXIdQ", "review_id": "h_rOG3ED9tKZTlpDAmxDaw", "text": "This is as local-business as it gets - this deli has been around for decades. For Phoenix, that's like a millenium. I've been to Cheese and Stuff for lunch about 8 times in the past year, and I've always had a delicious sandwich. They have a huge menu and I'm sure if you want something that's not listed, they'll make it for you. I can't remember the owners' names, but they are always friendly and happy to see you. The dining room does leave a bit to be desired so plan to take your sandwich to go - the only suggestion I'd make for cheese and stuff is perhaps tout yourself as to-go only, lose the tables altogether and make a little more room for unique German gifts and such. Perhaps add a delivery service instead? Okay, now I'm dreaming.\n\nPS in the summer time you can get a fresh squeezed 32 ounce lemonade for a dollar. It is FANTASTIC.  And the iced tea is delicious and always fresh.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 5, "date": "2009-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dqmXlUQyDh6d5U2_Zjb-Iw", "review_id": "ZRKhvGap1joTF_BBFWK3Xw", "text": "They make great sandwiches  customize.  The prices are reasonable  and staff friendly", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 4, "date": "2015-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "8WQubmP7G0NM3IyzyMnCEA", "review_id": "ywtjFdO9ZjJ7M3Q6mOHpiQ", "text": "A carnivore's delight...virtual cornucopia of meat and more meat...most of it in sausage form of course...blood sausage, white sausage, hard-smoked sausage....this is the right place for the answer to those sausage cravings\n\nIf you go...and you should go...have your cash ready ...the German Sausage Company closes early (5pm on weekdays) and doesn't take credit cards.\n\nYou can also sample some of their sausages next door at the Black Forest Mill.", "business_id": "fhLb0v5NBj93D7PLQpFXfQ", "stars": 4, "date": "2007-10-04", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "GnZWh25MyJD1d5FMKl3QmA", "review_id": "id0DrZ0LaZlXFAozGbsDDQ", "text": "I buy ingredients here, and a few splurge snack items, not regular grocery runs, prepared foods, or wine, so take this review from that frame of reference... Today I needed ingredients for baking, including King Arthur flour (only one I'll use), rye flour, ww flour, yeast, baking powder & baking soda.  An example of why I like WF - they carry King Arthur, and they have other flours (a huge variety -rye, barley, potato, soy, you name it) in small bags!  Yeah!  No more tossing 3 lbs of rye flour because I haven't used it in months.\n\nI needed anchovies for making salad dressing - they have a nice choice from $3.00 to $12.00.  Need some juice... check, nice selection. W ant a nice cheese to munch on the drive home... got it.  No, the cheese isn't cheap, but when i'm craving a good one I'll pay a buck more rather than run over to TJs.  \n\nIt seems whenever I'm doing a special dinner and want specialty, high quality ingredients, I go to WF first, and usually leave with everything i need. I've had no problem with anything being out of stock.\n\nThe downers?  The lack of some \"normal\" thinks I'd like to pick up whole there, i.e. those toilet scrub sponges on a stick; hit or miss produce quality; terrible parking lot for maneuvering when it's full; and an over abundance of snotty customers.  Hardly anyone says \"excuse me\" when the want to get by (they just shove or tailgate me with their cart), or says 'thank you\" when I move to let them access the same shelf at which I'm looking.... very different from my local F&E where people are generally much more courteous and friendly, albeit not nearly as well dressed.", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 4, "date": "2009-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-ZyH3DX9dgUILqk4j6pJQg", "review_id": "s4b-r_xR3p5eajGhgNQgHw", "text": "This place is awful. Go somewhere else. The sandwich was not good and was expensive. We didn't even finish our food. Also, they were out of a lot of things that we wanted and that we saw people come in to buy.", "business_id": "Xhrg9t7GGokrQecxXSOvUg", "stars": 1, "date": "2015-11-30", "type": "review"}
{"votes": {"funny": 3, "useful": 6, "cool": 5}, "user_id": "0bNXP9quoJEgyVZu9ipGgQ", "review_id": "3NX2ea140m3jz6OVMeABXw", "text": "Morning Glory offers great French toast http://www.yelp.com/biz_photos/8rlTOw0IA1TENURMBJpaXw?select=-4feMjhfMVa68yPeJJeZ1Q#-4feMjhfMVa68yPeJJeZ1Q and good omelettes.  The Farm Kitchen sells great sandwiches and a few tasty pastry selections.  Side salads are pricy considering the size portions.  Haven't had a chance to dine at Quiessence, yet, but I've read great reviews.\n\nBTW, one can also get massages here at The Retreat!  I've never been, but there is a sign that says \"by appointment only.\"  There used to be a giftshop where one can buy natural beauty and skin products, but that's long gone (I used to get e-newsletters).  Those products used to be sold at a location next to the vegetarian/vegan restaurant that used to be on Goldman and 5th in Scottsdale, but that also closed a year or two ago...", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 4, "date": "2008-09-12", "type": "review"}
