{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3Pbz5qgSP5WLgbTNTB6Z9A", "review_id": "8wBhPuttonKuSqyTywXPEA", "text": "Very disappointed. Delivery was late, our gyros were cold and fries were soggy. I wont be ordering from here again.", "business_id": "PSlOtPIo28BvWOzdLmRRRQ", "stars": 1, "date": "2014-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hehZdQ-fMtGIislW16S2aQ", "review_id": "_-04xUPPTAuF3h_PaI0bkA", "text": "Christos was one of the worst experiences I've ever had while dining in Pittsburgh. They call this a Greek restaurant but they don't even have a normal gyro on the menu. My boyfriend and I decided to split the platter, which was horrible. The gyro meat wasn't off the spick, the dolmades were the worst thing ever eaten in my life and they charged us 4.00 to split it which we didn't even ask for in the first place. The only pleasant thing about this place was the cook who ended up serving us our food after our waiter went out for what seemed like a drug deal. Over all, everything was bad and I would never return and would advice everyone else to do the same.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2013-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "8ED8BPCXKXZnGsVMyl5Bhw", "review_id": "fg6EQ_PuiK3MoOeH6h1HQQ", "text": "I really, really want to like Showmars because it's local, but it's just kind of icky in the environment. It was probably a unique spot before they spread all over the area, but now that Charlotte is super-saturated, it's just not that interesting. \n\nThe french fries are ok, I guess. The veggie pita is no good...clearly designed by someone who has never eaten food without meat on it. Maybe I was disappointed because I had high expectations, and maybe it's an alright place for the meat-eaters...but it's just not good for me. I haven't had a good experience, and I've been to a few locations. I won't be going back.", "business_id": "8PsQqhrAH5uqJ7HODOmXYg", "stars": 2, "date": "2008-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x_9gKlt-7uRIQNoALPEIrA", "review_id": "e8INm6rzgmWEafoFuhoFXw", "text": "Good solid home style food at a very reasonable price served in a place that is quite possibly the friendliest I've ever experienced in CLT... honestly. The overwhelming majority of patrons are on a first name basis with the staff. \n~Mel's diner... renamed Showmars", "business_id": "bffCUYaQ4FejTfu_xFwjyQ", "stars": 5, "date": "2013-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DC5yifhqWT1gQdcazBA0jQ", "review_id": "wRM0j-7otNVwvh3ZAmfKLQ", "text": "Zorba's is still my favorite gyro place of all time.  The food is delicious and they have some pretty unique sauces.  The meat is always tender and flavorful, never dry or bland.  Definitely check out the Groovy Tuesday deal = $1 off original gyros (lamb + beef mix) and half off fries.  The fries are the best I've ever had--crispy yet not too skinny, and always piping hot.  Check them out!  I always stop by for a bite when I'm back in town.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2013-10-30", "type": "review"}
{"votes": {"funny": 7, "useful": 12, "cool": 10}, "user_id": "P2kVk4cIWyK4e4h14RhK-Q", "review_id": "DWYIQ0Y-hppjhjPxKnujSQ", "text": "A Phoenix original if ever there was one!  Total gem in the lower Grand Avenue area.\n\nI love the unique atmosphere here.  Post-industrial meets shabby-chic meets post-modern meets trading post.  Or something like that.\n\nI wanted something different and ordered the Panini Cubano.  I thoroughly enjoyed the shaved prosciutto, black beans, melted swiss, pickles and chipotle mayo.  I also sampled the sandwiches of my wife and daughter and they were very tasty as well.  They had the pesto chicken and the lamb gyro, respectively.\n\nThe Paisley Violin is now firmly  entrenched on my list of cool, reasonable and unique places to grab lunch and to take visitors from out of town.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2009-09-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "eCtkMHrbM8j0R5yabfrRzg", "review_id": "MQfOn80E29h_ZQfa3fABsg", "text": "All I can say is greek salad, potato salad, and Zoe's signature slaw.( not all together though, you'll explode)  I hate picnic food, but this place puts a spin on it that you wouldn't believe. I practically go broke stopping here after work every day, but my job is so demanding that I fast all day...it's worth the wait!  And if you're ever in a rush, order your food ahead of time and just pick it up...then you don't have to worry about waiting all day for your food at the high rush time (around 11pm-1pm)", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 5, "date": "2010-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "llkm_iXQszkN5DZvmqjNqA", "review_id": "D-DkKI6mNiA9utTtNFtqpQ", "text": "This is a great place for lunch.  Everytime we go we always see firefighters and police which means that it is good and cheap!  I found the food very fresh and the hummas was great.  Almost eveyrthing is homemade.  I did try the chicken sandwhich and found the chicken kinda dry, but the freshaness of everythign else makes up for it.  Definatly reccomend this place if you are around downtown for lunch... but with the consturtion now it is kinda pain to get to, but worth it!", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2006-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L-Ozz_VcyF8SIZmqkj8kAg", "review_id": "yPb9TbcB4D0h1jikcY0ESw", "text": "5 stars on entertainment and fun. 3 stars for the food.  Live band, belly dancers, and accomadating owner that is there to have fun.  Food was alright, but we had a ton of fun.  If you want the same bland Phoenix dining experience, then don't go here.  If you want to be transported out of the heat exhausted norm of Phoenix, then go to this lively plate smashing venue.  Anytime I hear OPA, I think of this place.", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 4, "date": "2010-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "R9FyRhL305takxCWbzstvg", "review_id": "I9Ac60A_-AhvNKmF_6o5OA", "text": "I live nearby  and have driven past this place many times. Today my wife called me and asked that I bring her lunch. Needless to say, we were not disappointed by these gyros. Savory meat piled high with the right amount of sauce atop a a fresh pita was a great lunch.", "business_id": "bxpzP73A7gauvxFEyd_8xA", "stars": 4, "date": "2009-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OaqnrdmDVX5cwc6OwZg_cw", "review_id": "KkSOZfJm4ATFc2HTvcD7vg", "text": "Great food, chicken and gyros were fantastic!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2012-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "V5SOpcPoul01FuTZdwj59A", "review_id": "PNtkkObYoFgZEoFpxVAsXQ", "text": "Yum. In the North Phoenix area, there are about two Middle Eastern restaurants, one of which is Pita Jungle, but I've never been a fan. I drive by Saba's all the time and finally had the opportunity to stop by. I was pleasantly surprised.\n\nThe lemon-rice soup was divine, and they offer a truly vegetarian option as well. There are also numerous vegetarian choices on the menu. We started with saganaki, which was passable, and my main dish was a pita with tabouleh, hummus, feta, and pepperoncini. I'd never thought of putting that in a pita, but it was a great choice!\n\nService was quick other than that I had to ask for a water refill. The prices were fantastic. I will definitely be heading back to try all of the other veggie choices, and this will be my first choice in Mediterranean fare in my neighborhood.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 4, "date": "2010-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fugK_sUNZfU43A2Kv6_Mkw", "review_id": "986JkJH0Gv13rdQuuYBH9w", "text": "Best food in this town if you like Mediterranean that is. Run don't walk and get over here it is scrumptdillyious!  Sleepy Gyro Salad is my favorite!", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2014-10-17", "type": "review"}
