{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z3uWp25_a0to6p7meH3sWw", "review_id": "Ati4o3Hp7FbfUZegQwQMew", "text": "I'm in love with gyros, and have been to all the places that server gyros within 25 miles of here.  This place has by far my favorite gyros in this area.  It is also the cheapest too!  As far as pastries, I really love their doughnuts and their baklava.  I've never had a bad experience here, and have gone maybe 20 times or so.  It's just one of my favorite places to eat around Madison.\n\nThe people that work there (I assume the owners), are super super nice.  I'm pretty cheap, and don't usually tip over-the-counter service, but I always tip here because they are so nice!", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2010-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "uxLef8dQeOE5puaQ-pvbsw", "review_id": "UFfi2Hmy-Vde9fADiriDKw", "text": "wasn't sure what to expect, but the food was EXCELLENT.  personal service from the husband & wife owners make you feel right at home.  the tabouleh and hommos definitely rival anyplace i've ever tried.  they actually make the tabouleh to order!!!  incredibly fresh and delicious.  delicious baklava!  and, although i didn't try any, the donuts also looked amazing.  might have to stop back and pick up a dozen, for the road.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2012-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 3}, "user_id": "Ffa864LL90s6oxImKPI7pw", "review_id": "h1HWUCVx9aJup0aGE4VaFw", "text": "Went for dinner the other night. We have found our new gyro restaurant!\nHubby & I both ordered gyro. One sammy, one plate. Man, was it good!\nTook a raspberry fritter home for dessert, and that was great as well.\nWe will definitely be back!", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2013-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "B_UefrVB5Xw2X1WRZPRkbw", "review_id": "DOrdwtt93Au4VBoPRrKxzQ", "text": "Living 1 block away is dangerous! This is a hidden treasure for sure. The owners are a sweet older couple who knock out some amazing food. Can't speak for the donuts but I promise you will enjoy the food. The falafel with fries is a bargain--5 bucks or so--and it will be made totally fresh for you. My go to I don't feel like cooking spot.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2013-10-24", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "03vp3tenQ0aQOr0AE5j8Uw", "review_id": "PHAZhZLjfe1ttUtXmyPB6A", "text": "What do you get when you combine Lebanese cuisine, baked goods, gyros, funky interior design and second hand talk of bed bugs?  \n\nThe perfect #yelpnewvember storm, that's what.\n\nOver the summer, there was a spirited debate about where to find the best gyros in town after the unfortunate demise of Dmitri's.  After fellow Yelper Tawnie R boldly declared the People's Bakery as the worthy successor to Dimitri's, I knew a trip to the People's Bakery was in the cards for me.\n\nIf you are looking for elegant digs, this place is not for you.  It's a kitschy, little greasy spoon nestled into a strip mall at the corner of East Wash and East Johnson.  There's not a lot of seating and if someone is on the phone, you're going to be privy to their conversation.  In my case, I got a comprehensive update on a bedbug infestation of a family member that the owner's wife was describing in painstaking detail.  And while the chairs and tables are mismatched and the floor tiles are coming loose in places, the eating surfaces were all impeccably clean and the pictures on the wall gave the joint a homey feel.  And the husband and wife team that run the place have a great rapport with the regular customers getting their lunch fix. \n\nI ordered the $5.50 gyros and fries and grabbed a seat.  About ten minutes later, a massive foil wrapped gyros was delivered to my table.  I swear that an entire herd of sheep were sacrificed for this meal.  In terms of quantity, the People's Bakery delivered big time.  \n\nOn the quality side, things were a little less clear cut. First the negatives:\n* The next time I visit, I'm going to ask to have the pita spend a little time on the grill.  This dish deserves better than a cold, doughy pita.\n* More tzatziki sauce please!!!  When you give me a metric ton of lamb meat, I need more than a tablespoon of sauce to balance out the dish.\n* The same can be said of the tomatoes.  I need more than two very thinly cut slices.\n\nNow the positives:\n* The meat was served piping hot, moist and well seasoned.  It was clear this meat wasn't sitting under a heat lamp awaiting the lunch time crush.  The only thing I would have changed is to have a little char on some of the pieces to provide more textural contrast.\n* The onions served with the dish were pure awesomeness.  I'll be honest, I usually pick most of the onions off my gyros because they can overpower the other ingredients with their sulfuric pungency.  With a medium dice, these onions were fresh and sweet and complemented each bite.\n* I l-o-v-e-d the fries that accompanied the meal.  Salty and crunchy on the outside and hot and moist on the outside.   Yummmmmm.\n\nSo, does the People's Bakery unseat Trader Gus as my King of Madison Gyros.  I say it's too close to call right now.  What I do know is that I plan to return to the People's Bakery to conduct more extensive research.  And if you find yourself on the east side with an empty stomach and a light wallet, People's Bakery is an option worth considering.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2013-11-16", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "uLF25xKZvkCJv2X98E5-pg", "review_id": "yNA5tBHK8zPep-VSrwSuXg", "text": "They are the best. Great flavor, it can not get more mom and pop, the owners are great the only issue I see us that it  is hard to stop eating them", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2014-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "ocUayw1Ih7W_mHSR1RDdGA", "review_id": "EYdsdhpEKAqJ3M2GZZUgjQ", "text": "I can tell by the way it tastes that the falafel sandwich, baba ganoush and tabbouleh are totally vegan, and delicious too. I didn't bother asking them about ingredients because it's so obvious.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2014-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "5akrRpgnj3l_ia16gr0gHQ", "review_id": "TxROeiV9klqnL5sOIxu4Qw", "text": "Great donuts topped off a tasty meal. A little hard to find but like Arnold I'll be back.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2015-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "faACrzLJR0tK0ZqHi2jEuA", "review_id": "OL6ibnYk5-utLyrjzeibcw", "text": "A great couple who serve great middle eastern ethnic cuisine. I just bought a bunch of baklavas for my office potluck for a great price. \nEven though the decor and all is pretty modest, a true food lover will love this place", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2015-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "O0lAQazaL-veJv8FCux37Q", "review_id": "MZR2KiYUrK8xLPBl6BURuA", "text": "Yelp and the restaurant itself states that this establishment is open until 8 pm. So I was confused and disappointed that they were closed when I pulled up shortly after 7:30 pm. Lights were out, nobody home. Hmmmm... \nHopefully I can update my rating in the future :(", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 1, "date": "2015-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tRyQgiTBg2RjiTt4K0-56A", "review_id": "aYO5xIcZWWVrbGFKDWQTJA", "text": "I've lived in squirrel hill for two years and yet didn't know about this place until recently.  if you go, its in one of the stores between coffee tree roasters and the PNC bank, but the restaurant itself is in the basement so all you see in a small sign. \n\ni had the gyro platter, which to be honest wasn't great.  the three other people with me really liked their dishes though, so maybe I just picked a bad menu choice.  The hummus was fine as an appetizer, but nothing great.  \n\nI would probably rank this below aladdin's, which is just down the street closer to shady.  \n\nBYOB, corking fee is $2 (i think)", "business_id": "atG_rkb3fONGcw4fupbY9g", "stars": 3, "date": "2007-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r8AulMAwAIrVrdJGHQcllA", "review_id": "5WKv8_j8xJ7UxNszXoJqzw", "text": "Total hole in the wall- ok, it's a space in the basement of an office space, which is totally bizarre- but it's a regular spot for us.\n\nLove: the hummus, falafel, feta cheese, and  the amazing lemon-garlic salad dressing! \n\nDon't love: the baba ganouj- it's just got a weird flavor- I prefer Aladdin's baba.", "business_id": "atG_rkb3fONGcw4fupbY9g", "stars": 4, "date": "2009-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "CagJNYXhX0O4v3y9ZpcPzQ", "review_id": "lCmwLP6e-6lf-To8zHdf0A", "text": "This is hands down the best middle eastern in the midwest. I visit pittsburgh almost twice a year, and I can't not go there. It tastes just like mom's food!!!!! Can't wait to go back for more\n-hb", "business_id": "atG_rkb3fONGcw4fupbY9g", "stars": 5, "date": "2010-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DsyZHVwKYsBBihDNGvO1lw", "review_id": "FJxKKVSquDSMEuIfSS3Ptw", "text": "I had grape leaves wrapped around rice for an appetizer. Not sure what it's called, but it was pretty tasty. I had falafel in a pita for dinner. It was good, but the dressing was a little rich. The rest of the pita was good, so I would recommend the dressing on the side. This place was extremely reasonable in price and the staff was favorable. Solid restaurant.", "business_id": "atG_rkb3fONGcw4fupbY9g", "stars": 4, "date": "2011-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "2BYoshOhxZHTdn_Cmpr7qw", "review_id": "h5Hsg12_p3e_7QqZcTWN9A", "text": "This restaurant is hidden in a basement location near Pussycat and The Chocolate Moose in Squirrel Hill. The food was pretty good--not spectacular, but good enough. We had the mezza platter (hummus, baba ghannouj, tabboolee, feta cheese, and olives) and falafel. Hint: if you plan to order this, save the warm pita your server brings you for your dinner. The baba tasted a bit too smoky but the falafel and tabboolee (the restaurant's spelling) were pretty good. The falafel was crispy and delicious. You'll see the option of ordering feta fries on the menu. We did this out of curiosity but probably wouldn't again. This is American-cut fries sprinkled with feta. Only in Pittsburgh can you order fries with Middle East cuisine. With cheese on top. Only in Pittsburgh.\n\nAnyway, it was a decent vegetarian dinner and the service was excellent.", "business_id": "atG_rkb3fONGcw4fupbY9g", "stars": 3, "date": "2012-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qkVi1ego30vr8P4UWi1tHg", "review_id": "zyhnhlY1Nn7IK-QgnCKeaA", "text": "Underwhelming food.\n\nMy gyro platter was just okay. It came w/ a tomato-based sauce that I thought didn't go well w/ the meat. Asked for a side of tzatziki sauce instead but the flavor wasn't very good.\n\nDon't think I will be back.", "business_id": "atG_rkb3fONGcw4fupbY9g", "stars": 2, "date": "2013-11-27", "type": "review"}
