{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L6y73vaWaSvqYUKq6Rsr2w", "review_id": "kok-RqupEj7hlT2I-6BEdw", "text": "I really liked this food. I'm not Indian, but my boyfriend is. He liked it too! \n\nWe stopped in on a Saturday afternoon. We ordered from the menu instead of the buffet. We ordered the chili chicken, chicken 65, lamb biryani, Lamb vindaloo, and tadka dal. It was delicious. The chicken 65 wasn't spicy or flavorful enough, but everything else was incredible. We spiced everything at. 7/10. It had a bite, but wasn't too hot. \n\nErythema was freshly made. There were only two other families in the restaurant when we were there, both Indian/Pakistani? \n\nService was slow and grumpy. But it was totally worth it. It's hard to find good Indian food in Pittsburgh. Udipi is ok for pure veg... Corriander is greasy... India gardens dishes all taste the same... \n\nI would return. \n\nPortions were small, but I like that because then you can order more things to taste! Although, prices were relatively high. Every entree was about $12 and were ordered 4. It was worth it regardless.", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 4, "date": "2012-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SDlLqXn4IEtMzNwt9sV98w", "review_id": "BeLvqDROamySPutMnQzCJQ", "text": "My go-to Indian buffet in the South hills for simple, non-pretentious Indian buffet food.  My prior fave was Billu's which recently CLOSED.  : (\nNamaste is run by a family of Sikh Indian folks who are friendly and accomodating.\nThis is not Indian food at the gourmet level of somewhere like Tamarind or The Mintt but it's good enough for govt. work as the saying goes .", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 3, "date": "2012-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1zJL9PogiFyd_NhGcbgs7Q", "review_id": "pQGqxoRZGCC8Dl2piKEmyQ", "text": "I have dined at Namaste for the final time.  I am tired of being served by an individual that does not speak: who treats the customer with disdain and indifference.  The words \"thank you\" and \"how are you\" are not part of the lexicon here.  The buffet items reflect economizing.  Virtually no cauliflower is used, thus my favorite dish, aloo gobi, is never offered..  There sometimes is no rice pudding, and in place of the India staple buffet item, chicken tandoori, the cheaper and less appealing chicken wings are offered.  It is s shame that such a beautiufl, comfortable restaurant space is being wasted.  For a mere $1.01 more, I can receive a spectacular and delicious array of the finest Indian food in the lovely atmosphere of All India, North Craig Street, Oakland, where I receive gracious, personal attention from the owners.", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 1, "date": "2013-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Tdx_4prHlYxmY60gkGKVug", "review_id": "Nmc3txcWTKaBXZsISmO_Gw", "text": "Shockingly bad.  I know it's Pittsburg so my expectations were low, but there is no call for rudeness.  The old lady should retire.  The young waiter was ok but clearly  scared of the woman.   I went to the dinner buffet at 530 pm, the food was obviously left over from lunch, the rice was so old it was crunchy, all other food was very low quality and mostly cold. I always like to say something nice so the sweet carrot dish was not horrible.  My search for quality Indian food in the 'burgh continues.", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 1, "date": "2014-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6cgr-z4jfUNQwbTLrhrDrw", "review_id": "iYaRLq_VzGM73-clImGAGw", "text": "I think the quality and flavor of the food keeps me coming back even though the old woman is very unpleasant, I have never been there when there was more than three or four people in the whole restaurant. I don't know how long they could survive and that is unfortunate.  On one occasion I was waited on by a young man who was very friendly and pleasant , where did he go? This place has potential but the old lady must go.", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 3, "date": "2014-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bu1DaGdy-eawKYzYB7RinQ", "review_id": "lVj8S8ujWwOsdXkFbUihzA", "text": "Restaurant is difficult to find. You need to go through the hotel. Place is OK, simple interior but clean. They have buffet and menu. I went for salad and chicken saag. The taste was good but I bet that it was not chicken.", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 5, "date": "2015-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Jf9io1aFE62exMP4-abgGg", "review_id": "9B4dgZH0d3Dk3xFUmd2b0Q", "text": "I wish I could give them 0 stars...total waste of money. Food was so bad that I threw it in the trash. Hope no one falls sick after eating food here.", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 1, "date": "2015-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EvNdZDSReZNRkPYjKjvtzw", "review_id": "GdzVfjyuFW8eJs7WzxqVXA", "text": "We love this place for some reason.  We've been to India Garden, Taj Mahal, Tamarind, and Flavor of India.  I'll admit that sometimes it's really great and sometimes it's just good, seems to depend who is doing the cooking.  The service is pretty much non existent, which I'm fine with, don't have to leave a tip!  So for $9 or so you get a nice lunch or dinner buffet with mango lassi, pop, and chai tea included.", "business_id": "8tBfgYCI6Fz9xrSYCYCYXA", "stars": 4, "date": "2010-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "2mxbdNzBsShhHdKRApE7Hw", "review_id": "Q1vSqKtDq7d_ktuvfRNpug", "text": "I am disappointed.  I have lived in the neighborhood for over 6 years and I keep giving them a second chance (and a third).  The take out menu says in big letter on the front 15% off take out.  So we ordered again, although we generally get poor service and the food is average at best.  \n\nThis time we ordered 2 entrees and and a few sides.  When I went to pick up the order they had given us 15% off ONE ENTREE.  So it was no discount at all.  When you mention something to them about poorly worded menu and the principle of false advertising they argue with you.  \n\nSo we are done with them, no more peoples we will drive down to Taste of India from now on.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 1, "date": "2009-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tAvItzf9f-eZ_GgCEAfB_g", "review_id": "Dq4qhMMmNjQPxAJ_KQH24Q", "text": "Delicious food and reasonably priced, especially if you go during there happy hours!", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 4, "date": "2011-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ue1mORJxBTla-mOOguxcXA", "review_id": "i9kmTpBbfqKkubffV8bfog", "text": "I've come here for as long as I can remember. This restaurant will most likely be my favorite for years to come. The service is good and the food is always pleasing\nAnd you'll never run out of water!", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 5, "date": "2012-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "NK4NVkePvLTSLysqKvKfRw", "review_id": "iBGmys2HDe9jQqfK1X_2tg", "text": "I would write a \"0\" review if I could. I cannot review the food. I did not get a chance to eat there. Me and my Hawaiian friend went there to grab what I heard was some great Indian food, during one of the \"Unblurred\" Friday evenings. The concierge looked at us disdainfully, and was talking about how the 3-4 empty tables we saw was reserved. No \"reserved\" signs were in sight on these tables and dude did not mention when any seating would be freed up. \n\nWhether or not he was prick or or a racist prick, I have no idea. He seemed more interested in getting us out of there than he was in trying to serve us. It is Garfield, so may be he has had issues with the local denizens causing trouble, who happen to look like me. Dunno. All the white people get to eat, we do not? \n\nWith the exception of the Awesome Spak Brothers, I would not bother eating anything on Penn Avenue. Ever. I spend more time focusing on the surrounding crap than I do with actually eating.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 1, "date": "2012-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rfJDc0W9Q-6q_AuFsWVeKA", "review_id": "a41VC_I7ZV-GsMDMqHcsUQ", "text": "I've been hearing how great people's is from friends, so decided to check them out. I went for the lunch buffet. I arrived around 1pm when it ends at 2:30pm. There was still fresh food on the buffet. They refilled while I was there. As a vegan I appreciate Indian food & had many options. Usually my gauge for any Indian place it the Chana masala, my favorite dish. I was super impressed with theirs. Perfectly steamed  chickpeas with right amount of spice & cilantro! A second favorite was the Aloo Pang which is spinach potatoes & spices. The nan was fresh & hot. Also, the service was great, I never once had to ask for water. \n\nFor my second experience with people's I decided to order take out. They do free delivery to the surrounding area! (I live in Stanton Heights) it came within an hour of calling & was freshly made. I had no complaints. I order Chana Masala, Aloo pang & nan....it was about $20, lasted me dinner & lunch the next day ! Plan to\nOrder again soon", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 4, "date": "2012-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_vS9qNQvx8wVUOIkj4qfAg", "review_id": "DCj1828610ikOBTicqVFaQ", "text": "I take back everything I said in a previous post (about all Indian restaurants tasting the same and that it all tastes like something out of a box)!!\n\nI was so completely wrong! \n\nPeople's is amazing and fresh, vegetarian friendly, pleasant staff, warm and inviting.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 4, "date": "2013-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tx9t2inv77vIX2Dc0rg5uQ", "review_id": "3QXoLHEfe-K8monzEYR-iw", "text": "I am in town for work and I decided to order food from here. The food was awesome! I ordered the People's Special Biryani and they brought the food right to my hotel room. I will definitely order from here again the next time I'm in town.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 5, "date": "2013-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AjQOyzdWx5MbfODCC_VrIw", "review_id": "pggDyjkuZPc16sGWBCyFgw", "text": "This is a great place to get a lot of amazing Indian food at a decent price. Their buffet is great and they add quite some variety. Their food is flavorful. Definitely recommend this place.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 5, "date": "2013-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IhJwl1XxFThj5V5kjsCJ0g", "review_id": "K6YUYZbHVVd-nFzIDBFeVg", "text": "Love this place! The fact that it's incredibly close to home is a wonderful bonus. I'll completely stuff myself at the lunch buffet from time to time, but my real weakness is calling in an order and running down the street to pick it up. I may do this a little too often. I like to try new things every so often, but even sticking with my go-to of Chicken Curry never leaves me anything other than happy. I'm so thrilled they've stuck around during the awful construction on Penn Ave.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 5, "date": "2014-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "SfrDwnQpTWNs0R-oewFn4A", "review_id": "u0xOI7OtyIFkJc69TlKNZw", "text": "It's a travesty that I haven't written People's a review yet. I may have dined in or taken out from People's over 100 times. That is not a joke. At one point, years ago, I'm pretty sure they knew our take out order by heart. At which point, all we had to do was call and begin to order the first item and they completed the rest. \n\nSo, People's is great. The staff there are super friendly and the lunch buffet is a great deal.\n\nI tend to stick to several favorites on the vegetarian menu like the Vegetable Korma, Palak Paneer, and Matar Mushrooms. Their naan is super tasty as well.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 4, "date": "2014-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KBHmjpcMB3-4WeGMlxqhYg", "review_id": "ccfUnwu2U2RdW1pJmBvQ3A", "text": "You cannot go wrong with the $9 lunch buffet. So reasonably priced and the food is unreal!! The samosas we so crispy and tasty. Since I did the buffet I got to try a little bit of everything and it was ALL fantastic! Ended it was some killer rice pudding and Gulab Jamun (the sugar milk ball things)...great price, great food. I was in heaven. And not too busy on a Saturday afternoon which was nice.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 5, "date": "2015-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ZqKg4O7EXci7SR_UUS2J_g", "review_id": "ixxsYdzP8cc0kd19FTmzMw", "text": "I keep coming back to this Bloomfield gem. The spicing is always fantastic, and the staff are wonderful. I have had a few experiences when the service was a bit slow, which would be my only complaint. Don't come and expect a quick meal unless you call ahead for takeout. However, they are BYOB, which has led to many memorable special occasion dinners for us here. Do yourself a favor and get the Bagan Bharta, and then try any of their saag dishes. The naan is divine and comes out crisped and perfect every time. The best deal for dinner is the vegetarian meal platter, which offers 2 entree items, rice, naan, raita, dessert, tea and pickles. I will be back. The food is so good, you'll dream about this place!", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 5, "date": "2015-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Z-DJQpsAa164SoZhLOEP5A", "review_id": "EdZBldq9i53DP1X22kfk7A", "text": "This is the go to place during lunch. All you can eat buffet for a very reasonable price food is delicious and they carry a wide variety my favorite is the price with the cheese masala and salad with yogurt cucumber sauce it's delicious I recommend anyone to come here for a classic Indian experience", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 5, "date": "2015-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fvXIzBT5JP3cbwuN3YP06A", "review_id": "2jIL6vrL2t6ffY69mxGJEg", "text": "People's is the bee's knees.  Best Indian in Pittsburgh and they deliver.  Always very efficient with our takeout orders and so we order from there regularly.  Really delicious food.  Highly recommended.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 5, "date": "2015-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4jGnjQUArjFKOnxShpGLXw", "review_id": "GH5JBmtXwDOrQF2BXbdI8w", "text": "Cozy and dim lighting. Food is okay - large quantities for take-out, watch out!", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 3, "date": "2007-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Aj-mNc7k3ZvHRjlbZfFNUg", "review_id": "sWE76pTr8v1NPQ3oTsxYig", "text": "Love this place. And they have coupons too. The bonus is definitely the amount of food, you get enough for delicious lunch leftovers!", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2007-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "wNtyBJa_qaRYUew_TWplgw", "review_id": "c5B42gPXzK9Z8AfR4kXlqg", "text": "We ordered take-out from here through Meals Delivered and couldn't be more pleased.  The portions were large and flavorful, and it was a great value ($31 with delivery and tip for an aloo gobi, a chicken tikka masala, plenty of rice and 2 samosas).  I ordered the aloo gobi with a spice level of 5 and thought it was a touch too spicy, but other than that it was very good.  My boyfriend said that the chicken tikka masala was one of the best he's had.  The samosas are just the right size and delicious.\n\nWe will definitely be ordering from here again!", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2008-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Vy6oxUFDSGCLmNA6GoA1tQ", "review_id": "iIPXPKciFs7eHPesBy1yDA", "text": "It's nice to know that there's decent Indian food that isn't far out in the boonies like Udipi (which, btw, is worth the trip).  I can't say I thought the restaurant aesthetics were that fantastic.  The acoustics in there are horrible, and it seems kind of dark.  But the service was nice, and the food is great.  Beware the stairs of death when you go to the bathroom.\n\nI haven't seen Chicken Muglai in years (they call it Muglai Korma on the menu) and the version they have is excellent.  We also had the sag paneer and a number of other dishes I can't even remember.  All I can recall is that I got my chicken muglai and it was GOOD.  The rest was good too.  I should also note that the portions are pretty large by Indian restaurant standards.  One dish goes a LONG way.\n\nThe nan is a little eh.  A little overcooked, in my estimation.  The garlic nan had lots of garlic on it but little garlic taste.  So, you get all the downside without any of the upside.  Too bad.\n\nIn any case, I will most definitely be coming back.  I", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2008-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eovwN_EDnxVc4UZgYJId2w", "review_id": "QoJOgfGbe12mPXGpNCAUYA", "text": "Good, solid, and strangely inexpensive. \n\nWhile I didn't find Taste of India to be amazingly awesome, its currently in the running for my favorite Indian option in Pittsburgh. Service was fairly attentive, the naan was hot & crispy, and the chicken tikka was really tasty. \nA surprise: the veggie samosas have just a bit of spice-- unexpected and fun! Parking can be a challenge due to the location (directly across the street from Children's Hospital), but there are lots of meters around (and parking is free after 6pm).", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 3, "date": "2010-10-16", "type": "review"}
{"votes": {"funny": 6, "useful": 6, "cool": 4}, "user_id": "3d0Vw3hPiUEWMwrlnC-IOQ", "review_id": "UDgXjdaVJJa2-rRbQAQM9Q", "text": "Food from the motherland is a weakness of mine so despite good feedback from some friends, I tried to resist coming here when I first moved to Lawrenceville. So much for that!\n\nTaste of India is flat out great. Prices are reasonable. The atmosphere is simple and tastefully done (unlike another restaurant in Oakland, cough cough).\n\nThe staff are courteous and accommodating. I called out for take-out one night and when I walked up to the restaurant, I found that they had mixed up my order and I'd have to wait a few more minutes. As an apology for waiting, they threw in free samosas! (btw, the samosas here are delicious). Rest assured, this isn't a regular occurrence; the next time I ordered from here, the order was promptly ready.\n\nThe tandoori is very good. The chicken tikka masala is nice and creamy with good flavor. The palak paneer is also delicious. My taste buds are very happy to have found good Indian take-out within the city limits. (My waist-line is NOT pleased).", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2011-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "fSL20coJsOi_69A3u2OKcA", "review_id": "ZAkC3c13wFYx5KYMTLlbOg", "text": "This place knocked me out.\n\nI had garlic naan and the lamb Shahajahani.  The sauce was so good, I used all the naan to sop it up.  (The waiter told me it was OK to do that.  Not sure if it really was, but I don't care.  I wasn't gonna leave any.)\n\nI travel a lot, and enjoy finding little places like this that are inconspicuous, where you can get great food, great service at a really decent price.  I had what I described above, plus a half-carafe of their house wine (not spectacular, but who cares) for $29, tip included.  And it was a good tip.\n\nThe server was very friendly and helpful and took time to help select the best choice for what I was in the mood for. And, he thanked me about six times for coming in, which was really refreshing.\n\nThis beats Indian I've had in Boston, New York and Berlin.  Will definitely be back on next trip to Pittsburgh.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2011-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RgcPq1iMYd4lwOL4lG6e0g", "review_id": "YUj4SgBUqU9Zb-ggpbZsEQ", "text": "I might have just found my favorite Indian place. I went with two friends for a feast and we were not disappointed! We were greeted warmly and told we could sit anywhere.  The space is a little small, but that actually adds to the atmosphere of warm, delicious Indian food, friendly owners and staff, and good friends!\n\nI ordered the Malia Kofta for my entree.  These are vegetable balls with raisins and and almonds in a creamy sauce.  It was out of this world!!!  The veggie balls were slightly crispy on the edges but soft in the middle and packed full of flavor.  The sauce was not too creamy and the raisins added a sweet taste throughout.  Both of my friends have since gone back and ordered this!\n\nI wish I could remember what they ate, but this actually happened a few months ago.  I remember the Malia Kofta like it was yesterday, though!", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2012-09-19", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "0LzlRSXLhEsVSWFEvW_5yg", "review_id": "VHcyaMBre4kCGLkSyTX8Qg", "text": "Had a great experience here.  Service was super friendly and prompt.  The chicken tikka masala is excellent as well as the paneer naan.  I also tried the chicken curry, which used dark meat.  I thought it was just OK because of the poor quality of the chicken.  However, the curry was excellent.  I can't wait to go back!", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2012-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Fd73R_dpOFVKXWh_I0aBWA", "review_id": "zQMa8baiT4SGsPLE2C_d8Q", "text": "Delicious, intensely flavored food. I've had a variety of chicken, lamb and beef dishes and liked them all. Friendly service, cheapest glass of wine I've seen in a decade, and I even love the anise assorted crunchy things you get with the bill--beats the heck out of starlight mints! They gave me some extra rice to take home with my leftovers. Good naan. Very reasonably priced. Wish I lived close enough to walk but I've always snagged a parking spot, which I attribute to my Squirrel Hill training.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2014-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6i-m61aS_Itac7Q4-wncCQ", "review_id": "gyYhxwxeckSStP43sUg86A", "text": "Comparatively mediocre to other indian restos. Not very flavorful. Naan is really thick and dense. Channa masala just tastes like it's chick peas soaked in tomato sauce instead of masala sauce. And daal makhini is similarly too saucy and not in a yummy sauce way. Kind of a bummer since there aren't many indian restaurants in the east end area. So my final thought post-dinner is \"meh.\" And I'm not even excited for the leftovers tomorrow.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 3, "date": "2014-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NChl6bTuhngG6_R4-pp20w", "review_id": "94F5phqtnC9zXiXhwS0wbw", "text": "Finding a good Indian restaurant can always be a challenge. Taste of India is certainly decent...nothing more nothing less. Figuring out the optimal day/time to hit the lunch buffet is like trying to find Gujarat on a map. It's really hard, and you're usually wrong the first few times. That's my main complaint with TOI, somedays the food is really good, other days it's just downright criminal. I think I've figured out their system but trying to explain it would be like.....never mind, you get the picture.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 3, "date": "2015-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z87LDPDwZXCjsl-dvbEE4Q", "review_id": "8VCNt0MUOEr7uL9EG7F6MA", "text": "Just moved from Pittsburgh and I miss Taste of India - this place is great.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2015-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j2UOrL-m5tvtqKXV4-RkYw", "review_id": "-AfMVl_dMAYZE3T5xsob0g", "text": "Loved it! Absolutely LOVED it!\nThe BF and I went here over the weekend and it was wonderful. We started out with the chicken samosas. I would have probably preferred the traditional potato and pea, but the chicken was still delicious. Delicious enough that I finished mine first and kinda wanted to grab his and run out the door with it. For our entrees he got the Tandoori grill, which is basically an amazing array of MEAT! (when you see this plate, you'll understand why it cannot be called just 'meat'.) Now, I am by no means a vegetarian, but when we are taking Indian Cuisine, I usually opt for a veggie option. Simply because they are so good. While I can say his was a carnivore's delight I prefer something to accompany my MEAT! He suggested I get the Tikka Masala, so I did. Words cannot describe how much I loved this Masala. I would have to create a new word, like fanterrifayummuniciuos...ness. I wanted to lick the bowl, and then ask if I could lick the pot they made it in. He had the kheer for dessert. It was pretty good but I was still obsessing about the Masala, so I'm not sure I got the full effect. The service is mostly provided by an older Indian couple (I assumed the owned it) and is exemplary. Now, it was empty on a Saturday night, (which makes me nervous) so it should be exemplary, but quickly you realize that most of their business is take out. Eat in or Take out, but I would seriously try this place. \n*Although we did not get it, I would try the dinner for two. It comes with tandoori chicken, a meat dish, a veggie dish, dal, rice, kheer and a tea of some kind- all for $36!*", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2015-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_dSUxSeCbIGR6Au5SFNOOQ", "review_id": "RGYg5Liyho_WhsW-E7f0vQ", "text": "SUPER delicious! Tried the dinner for 2 and we couldn't finish it... so much food for a great price!", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2015-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "K5dxGhJ99TmS6La6krwkcg", "review_id": "YWifscYhwtNH-ZGfMgWs1Q", "text": "I ate here recently during lunch and had the lunch buffet.  They had a decent selection, about 8 hot items, as well as some relishes and rice pudding.  There is also plenty of naan available.  I eat here at least a couple times a month.\n\nThe dinner menu is awesome too, I haven't tried anything I didn't like and we even took new comers there for a joint summit between mine and my boyfriend's families and every one was pleased.  I would also say the attire is not dressy, casual is fine.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 4, "date": "2007-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "NbEe0F-Frp_N3Sov368o4w", "review_id": "DENkgQbhkF_HiGbgnVCjMA", "text": "I've had curry and vindaloo but I've never really had Indian food beyond that and I never been to an Indian restaurant. All I have to say is I'm going nvm because now I have to eat one of everything on their menu. It was delightful. The ambiance Id perfect and the experience is one that feels authentic. I'm definitely coming back this restaurant for more Indian food.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 4, "date": "2009-11-23", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "3IOQbdQ2z7TKWOnBjAnkew", "review_id": "aUcdWZ1zQLRHbuO9i-uakQ", "text": "I've yet to try Woodlands, so Maharani is currently my go-to Indian in Charlotte (mostly because it's right around the corner).  I've only ever had their lunch buffet, and I've been pleased both with the price (LOVE) and number of vegetarian options.  Fully half the buffet is veg, which is more than I can say of other Indian buffets.\n\nThe curries were decent but less spicy than I would like.  With that said, I have to echo others in raving about their samosas, which were the spiciest thing on the buffet and were truly revelatory.  I would go back to Maharani simply for the samosas, hands-down.\n\nThe people that own it seem nice.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 3, "date": "2010-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "36OARfWD_lMcZJ101lEhAg", "review_id": "8gMz_DZvLQfSdkVhQg2U3g", "text": "The service here is great. We went on a Sunday and were the only people there for a while, but even as more guests arrived to the restaurant, they were still very attentive. I have to agree with other reviewers that the curry is VERY mild. We asked for them to be a bit spicier than they might normally make them, and they were still very mild. Good, but mild. However, the veggie samosas are mind-blowing! Spicy and smooth and not greasy at all - highly recommended. The kheer was also really yummy. Spicier (cardamom and nutmeg spicy, not hot spicy...) than I've had in the past, but good. Go for the garlic naan as well, delish! The only negative that I can think of is you don't get all of the free \"extras\" (a pekora to start you out or some kheer and chai at the end) you get at some other places, but I haven't heard of anywhere in Charlotte that does, so I guess it's an even playing field. Good wine selection, good food, good service.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 4, "date": "2010-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "V0mCFwCzkSWC_-htGIPtjg", "review_id": "JuTEUt2QLimpncEfHrVapg", "text": "After visiting a number of restaurants for the buffet, I have had some great ones...and some good ones.  Marahani's buffet was a good one.  A quick stop for lunch on the way to the theater provided enough nourishment to keep me from filling up on popcorn!  It was good...the butter chicken, the aloo tikki were very good. I was slightly disappointed with the watery tamarind sauce.  I love the sauce when it has a thicker consistency.  The service was sub-typical for buffet.  Not once did the wait staff ask if all was OK...or if we needed anything else.  OK...I am spoiled by better service....but you have to expect it when you are out at a restaurant.  It makes you feel like you are having lunch or dinner where you are really appreciated.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 2, "date": "2011-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xbqMUNEwNgrhwJkUvK9wXQ", "review_id": "cz-fFL5AH47y_rZAYqgW3Q", "text": "I love me some Indian food and so far this is the best I've found in Charlotte. Great portions, easy atmosphere, very attentive staff. So yummy! They have a dish called Shahi Korma with lamb in an almond sauce...AMAZING.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 4, "date": "2011-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yvlU1IzAqn1qK-pIlHW1ug", "review_id": "CVh1bACfnFOo4zBxxBL2Vw", "text": "I ordered carryout at Maharani on my way home from work; I ordered the Murg Curry and garlic naan. The chicken in the murg curry was extremely dry and tough, the sauce was pretty bland and the garlic naan tasted like it had been baked the day before and left to sit out overnight before it was put in my carry-out bag. \n\nThe bar for Indian food has been set pretty high for me; I've cooked many Indian meals at home and have tried dozens of different Indian restaurants, but even still, the food at Maharani was pretty poor. \n\nI give it two stars instead of one because the staff was very friendly, and the decor when I went in was very tasteful. I'm hoping at some point I can brave going back and dining in, perhaps getting a different dish, and can raise my rating to 3 or 4 stars.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 2, "date": "2012-09-30", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "nK_KdyKQ_c9Ib9rQn5h_cg", "review_id": "yDv9IJ9jOIIn6G3WXx1TMw", "text": "It's okay. Nothing to write home about. I thought their portions were good, but their food wasn't spicy enough (even after asking for spicy) and it wasn't much better than the heated Trader Joe's Indian meals.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 3, "date": "2012-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3q8rUOcsOWH_v4Q6s6k1YQ", "review_id": "cZaTfwqfOigvli8JnEp36w", "text": "I've eaten dinner here a couple times.\n\nFor the most part, the food is good, and they have been consistent.  One item I like about their menu is the \"Indo-Chinese\" section.  I think this is something unique that reflects the regional differences that often get glossed over in Indian cuisine.\n\nThe food is flavorful, and service is fast.\n\nMy two complaints:\n1) something always seems to get miscommunicated to the kitchen regarding the spiciness of the dish.  Not too hot--_too mild_!  This has been verified when I look at my cheque--they list the spiciness requested next to the dish.\n\n2)  While quick to refill water, if you order any other beverage, it gets forgotten.  My soda/tea glass is empty, and I eventually have to ask the waiter for a refill.  In terms of service, this is a big issue for me, personally.\n\nBottom line:  good food, pretty good service.  I hope to one day be in Charlotte to try the lunch buffet other reviewers have raved about.\n\nOne last item, this place is in a _tiny_ shopping area with a _tiny_ parking lot, so be forewarned.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 3, "date": "2014-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GUNwYoQ_2rgwnMn0rScUEQ", "review_id": "N4uF1fO2NworbhNibcjPqQ", "text": "I've been here tons of times and NEVER had a bad meal or bad service. In fact, I find the servers to be overly attentive at times. I always order vegetable samosas, garlic nan, and chicken tika masala. The food is always above average and consistent. I've yet to find better Indian in Charlotte.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 4, "date": "2014-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bU8jYmPPau-ts0JJcxgpfw", "review_id": "it0IFra6w4Wqx0mQgONb3w", "text": "Very few items on lunch buffet. On menu was aloo tikki, salad, plain rice, butter chicken, naan, chicken tandoori, chicken curry, palak paneer (paneer was hard to find), kheer (was good), finni that's it. None of the items were cooked properly. Very very disappointed. Price: $10.25 plate", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 1, "date": "2014-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bRk-VK1A8D-6qCEGWm8sjQ", "review_id": "P_v3-yjt121aivFPUBApdw", "text": "I went with a few friends for dinner and the food was \"good.\"  Good sauces, rice, but slightly dry chicken, tough palak paneer.  Nice/traditional/bright/clean atmosphere but no music, service was good but we were the only party there.  Good for family and friends, not so much for dates.  Have you tried the frozen Indian meals from Trader Joe's just down the street?  They're just as good, and more tender ;)  Honestly this is good Indian for Charlotte.  I'll keep looking though.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 3, "date": "2014-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "VVRdmMIXZC6OJNtxscJjew", "review_id": "XXtPILEIbWvF8j7701hOHw", "text": "The smell of this place was a striking mixture of chai masala tea, cardamom and curry spices. The wait staff sat our group of four in a small middle table. This was a bit uncomfortable and we had requested a booth, but hey, they were busy.\n\nWe started off with two appetizers along with two bottles of La Crema, a delicious white that quenched the flame of the hot vindaloo dishes. My favorite appetizer was their sweet peshwari naan with cherries and coconut. This stuff tastes like pie filling!  Add to that the freshly baked puti (puffed bread) and we were on our way to fantastic meal.\n\nBombay Cuisine shines when it comes to curries, offering seemingly endless variations. Plus, you can choose the level of spiciness to suit your own tastes.  We ordered a five, not American five, but Indian five. The extra chilies cleared my sinuses and made my temperature rise.\n\nAs a vegetarians I found nirvana in the muthia (Indian dumplings) in a  vegetable cream sauce. We ordered three different curries and the carnos ordered tandoori chicken. The curries were served with basmati rice.\n\nOverall the best dish was the peshwari naan. Never had I experienced a bread product that thrilled my taste buds in such a way. If you go try this naan and surely you will walk away satisfied.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2009-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rBKzVWM6AGVfLqB-OiqIig", "review_id": "vPseVVhrgu7JS3eogbt63g", "text": "Great Indian food! There is always great food on the buffet. Great for take out or dine in. Kid friendly.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 5, "date": "2012-09-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "TJsGF3uUTC2nLMfYi6GtIQ", "review_id": "xodQu5riJXSIpHIfspJOsA", "text": "We had a GoPlaySave coupon for The Bombay Grille and decided to give it a try tonight. So, so glad we did. \n\nThe food was delicious.  Awesome service. Nice environment.  No hassle at all using the coupon. \n\nNo complaints at all. We will be back.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 5, "date": "2012-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "oAueXm0NC0n8IL6DiBmNpA", "review_id": "B8G9jGWCzGq4_V7rnbg7uQ", "text": "Bombay Grille has excellent chicken korma. Their weekday lunch buffet has really tasty food as well. You can find authentic tandoori chicken , an assortment of curries, sauces, rice, fruity, and vegetarian options. Their naan is pretty awesome as well. What I really like is that their staff are very friendly and knowledgeable! Their prices are very reasonable too. Great place!", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2012-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2jFwEhojzPQayTiWfz7QhA", "review_id": "wWsVppYwu5VYcW-4h_NTjg", "text": "Dinner from the menu is leaps and bounds better than the buffet at lunch. Otherwise pretty good Indian food. Love the staple Indian dish, chicken tikka masala. The naan is great too.\n\nThe staff James good. They're very attentive and the restaurant decor is great. Indian restaurants are known for their lunch buffet. I enjoyed dinner at BG but the restaraunt's buffet wasn't great so I couldn't give it 5 stars. I actually debated giving it 3, but ordering from the menu will result in a great experience, so I will go with a 4. \n\nAlso, while the atmosphere is definitely kid friendly, almost all of the buffet options are fairly spicy, too spicy for almost all kids. I love spicy food so I enjoyed it and it wasn't overwhelmingly spicy for me and wouldn't be for most adults. Again, when you order from the menu, this is not an issue. \n\nCooper on East Blvd is a great Indian cuisine option.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2012-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "t7tun46aDgJ3dYW8gsQm6A", "review_id": "1Hi3gGu6Fww27NpTObVpnA", "text": "I love the food here!\n\nI have tried many dishes here and everything has been solid.  My favorites being the vindaloo, korma, and palak paneer.  The rice is perfectly seasoned and everything tastes fresh.\n\nI usually get the food to go.  It takes a while but I prefer that everything is made fresh, so I don't mind.  They always give you plenty of rice and will not hold back on heat so be careful what you ask for.\n\nThis is my Indian spot!  I drive 25 minutes for take out and do not seek closer Indian restaurants because I doubt I will find one I like as much as Bombay.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 5, "date": "2013-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "72i1-qAJMmxCstXK9233yQ", "review_id": "eQu-jLjglql5OSLsnBtJfg", "text": "The food here was amazing. Service was great and the overall atmosphere was very nice. I had the lamb madras, with aloo paratha, which went really well with the Taj Mahal Premium beer I was drinking. Overall the food was extremely flavorful and had just the right amount if spice for me, and when I got back my hotel I slept like a baby. Thanks for an awesome experience.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 5, "date": "2013-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "1oRoKURXAaThwrzt2DsnTA", "review_id": "v4HsjTFsIGlj-GwRFVUAQA", "text": "I love Indian food, and this place used to be my favorite.  But starting 2-3 years ago the food went downhill. We tried it again recently and sadly I won't try again for quite a while. The pakoras lacked flavor, like something microwaved. The entrees were very disappointing -- Chicken Palak was the worst I've had anywhere. Bummer to need to post a negative review of a previous favorite. Hopefully the food returns to its prior quality someday soon.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 2, "date": "2013-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pipqvDQ7vORBKaweq6Z48w", "review_id": "t5hUEt3bUAGcfQUw6e5mdw", "text": "Probably one of the worst Indian  food I have ever had in USA. Went there for Sunday buffet and the food was terrible. Serving is bad and avoid this restaurant.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 1, "date": "2013-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RbSPl5bMKm_INZKn_Y05FA", "review_id": "xy1jac47WSVCyVmHYzU-MQ", "text": "Visited on a Wednesday for the lunch buffet and arrived around 1120am. When my roommate and I first got there, we were the only patrons there!  I thought perhaps we were early, but throughout our meal only one other table with two customers were there and when they left a mother and daughter came in towards the end of our meal.  Our waiter was friendly, he came to refill our waters twice.  Other than that we really didn't see him.  I was a bit disappointed in the selection. There were 3 vegetarian /vegetable options, 3 chicken options and a couple of of other things like soup, potato wedges, and rice pudding that was extremely soupy. I am a vegetarian, so I was already limited in my choices.  At one point I went back to get some more rice and the rice was never refilled, so I was literally scrapping the bowl!  I mostly ate a dish with broccoli in a tomato sauce, which was by far my most favored item on the day's buffet menu.  While I did have an enjoyable time with my roommate, my taste buds were not jumping for joy as I had previously imagined that they would.  I love Indian food, but my experience at Bombay Grille was although not horrible, was also not what I would envision as something to be repeated.\n\nNormally at buffets I can usually eat between 2-3 plates.  Their food was extremely heavy and could only eat one full plate.  After leaving the restaurant I took a nap and very long walk afterwards, and I still was full to the point of being uncomfortable.  I am grateful that I did not have to work that day, I would have been miserable.  I even thought that possibly they put heavy cream in their food, but of course I am not in their kitchen, so that will go unknown.  Food has never made me feel that way.  \n\nKey points that I was disappointed in were:\n1. Buffets usually have a great selection, so that a person can sample several different dishes- Bombay Grille failed here.\n2. Indian buffets usually have at least one dish with paneer- Bombay Grille failed here.\n3. Indian buffets are supposed to have several different curry dishes (mild, medium, spicy and different kinds of curry). There was only one curry chicken dish.- FAIL\n4. Bombay Grille- FAILed to refill the rice.. there were only 4 people in there at any given time!!!!  I'd hate to see what the buffet would like after 20 minutes if it was packed or even half way full.\n5. Where were the spices? It's bad enough that there wasn't any good curry or paneer, but I couldn't taste any spices.  In my opinion, this is an Americanized Indian restaurant. I could not taste any pepper, cardamon, anise, cumin, cinnamon, cloves, saffron, tamarind or turmeric! -FAIL\n7. Naan- didn't taste like it was homemade.. looked and tasted like store bought and it was plain.. they didn't have garlic naan!  By the time I had some, it was cold, chewy and blah.  No ghee and naan!  No spices or raisin and naan.  NOT SATISFIED!\n6. The price for the selection. - FAIL\n\nThe decor is slightly plain.. the only redeeming quality was what I was craving for over a month since moving to Charlotte.. a Mango Lassi.\n\nOverall, I would not return to this restaurant.. the food quality, selection and price were less than stellar.  I've heard great things about \"Passage to India\" in the University area and can't wait to check it out!", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 2, "date": "2014-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tM4x9sx_dmfNczg00_vFcA", "review_id": "PUWPyDhZGjZGY-PecavR8Q", "text": "Great service for the price point. friendly, helpful staff. Great authentic taste and presentation. Some safe choices available for those unaccustomed to Indian cuisine.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2014-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iAOyEnsNLVgtov0_PjjbDg", "review_id": "PCgCdDJGfiAodon4SQT7Jw", "text": "The food is not real Indian food, everything they made for native people. If you really looking for tasty, spicy Indian food this place is not worth it. On all food items are sweet and more creamy.\nThis is place is not meant for real \"INDIAN FOOD LOVERS\"", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 2, "date": "2014-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "IXT5Zav19plCxiLHh5ZyVw", "review_id": "wtHHb6s71CjkVKlKkxmehw", "text": "Worst indian food I have ever eat in US.  \n\nIf you read my review I bet you that you will regret if you give a try to this place. \nit's a joke of indian food. I have been eating paneer kadhai from 20 years and I know how it should taste. It was horrible. first time I went for dine in and the food was horrible , customer service was awful.  After 6 month we taught we will do take out order and will order something else than we ordered last time. I honestly thrown it in garbage as I felt horrible taste and smell in food. I didn't wanted to go sick after eating that.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 1, "date": "2014-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FY9Cl4ws26yYjUU5kLhg-A", "review_id": "Sw7qtwRXdkEqrBEfeyspag", "text": "I dropped into this place for lunch, when they had a buffet.  The food was ok, if limited in choice, but the service mediocre.  Like in the buffet, they had, among other things, tandoori chicken, of which I took a few pieces, just freshly in.  I got the first serving of naans, and had to wait a bit between finishing the first basket and  getting the second.  By then, the chicken had gotten cold.  As for the naans, they were flat, and some slightly crispy, instead of soft.  The tamarind chutney was okay.\n\nIn terms of drinks, they are surprisingly limited - only mango lassi/sweet lassi or the sodas.  No fresh lime sodas (lemonade variants) that one would expect from an Indian place\n\nConclusion: might be worth trying out for a la carte meals, but certainly not the buffet.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 3, "date": "2014-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eMb6qTf1HJK_hvA3YOhK0Q", "review_id": "OzFp8idosmxVzx81pS8b8A", "text": "This restaurant is awesome! I loved every bite of food! The naan bread is perfect, the Samosa appetizer is incredible, and my Panak Paneer was sooo creamy, spicy, and delicious. The wait staff is so friendly, attentive and makes the experience even better. Highly recommend!", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 5, "date": "2014-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XrtH5v5SsKc9ohLN6x6AuQ", "review_id": "Yy4AftCgCw1-mGUZ-Yz9HQ", "text": "We had the Saturday lunch buffet. The spread is average, quality of food and service unimpressive.\nFirst time I have seen okra cooked without even taking off the tops.\nOverpriced & overrated", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 2, "date": "2015-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3asRSf_Rq8aMxNWvKnIt5Q", "review_id": "ukhqOjxvNPmItUmyl4vFzg", "text": "Great Indian food with reasonable prices. Lunch buffet is very good but just need to keep the naan stocked. I enjoy eating at Bombay Grille regularly :)", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 5, "date": "2015-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YME1rcRmmVI1r_T7MagFMQ", "review_id": "Cye28c0XXncdLFy1lSIzSg", "text": "Saw a huge roach on the wall. Mentioned it to my waiter who grabbed it with a napkin and said they are attracted by the Indian spices. Saw another on the booth. Called the manager who looked dumbfounded at it. Said I would pay for the bottle of wine we ordered, but not the food we hadn't received yet. No apologies or comment as we were paying the bill.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 1, "date": "2015-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LP0bl3GKToABt3lnpSvA2w", "review_id": "hx1rMYp5X5hijOBuZSXQTA", "text": "Delightful food and service! One of my friends was visiting from out-of-town and we were wanting an authentic and comfortable dining experience. Bombay Grille fit the craving and made for a relaxing night out. \n\nOnce we ordered we realized that they were running a Living Social deal. Within minutes and a couple quick swipes of the finger, we snagged the deal. Bonus. We ordered a side of naan, the vegetarian mutter paneer and the chicken tikka masala, both level 2 spicy. The spice definitely packs a punch, so if you are sensitive, then don't go above a 1! Very delicious, generous portions.\n\nService was attentive. Each staff hustles to get tables served, waters filled, leaving patrons full and happy. \n\nIf you are craving quality Indian cuisine in a humble atmosphere, this is your place.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2015-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w2JrGGqTaQ12-ohj76RXdQ", "review_id": "Pu4zNmbjsx1sslQlbLGwNA", "text": "We gave this a try while in the area. Overall really good. We had simosas which you could tell were fresh and really good. My husband had vindaloo and I had tiki Marsala. Usually vindaloo comes with dark meat and they did white here which was awesome. We prefer that and some places won't even substitute. Was really good. My tiki was great as well, very creamy and decent portion. Add in the naan and overall we enjoyed our meals. Service was a little slow for a week night but would come again.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2015-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uc4QurS1XrvyiIpne2IbhA", "review_id": "pad4R0qF5pOGBRzoEQbQVA", "text": "Came for lunch buffet. Not too crowded. Good mix of food and selections. Good was hot and fresh. Tandoori chicken was good!", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2015-11-17", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "OH71gTLUc2BduDdY069Yog", "review_id": "j9KmdVaiEOFe51HCF-l4HQ", "text": "I would go as often as possible! The staff is friendly, the food is delicious and reasonably priced, mango lassi excellent, and the atmosphere is great. Every time I've been there's been enjoyable Indian music in the background and just the right amount of crowd to say this place is worth spending some time with friends. There have been occasional mix ups with the order but everyone is human afterall.\nOh! If you want separate bills- ask when you order. It's much smoother that way.", "business_id": "ULvDCr7r9sMU1iSwgTHXsA", "stars": 5, "date": "2007-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0bNXP9quoJEgyVZu9ipGgQ", "review_id": "SJjLX_zQuBs6YzxsKWckpA", "text": "Decent lunch buffet.  Large selection, good price, but the food is a little on the bland side.  I remember thinking that the tandoori chicken was the only flavorful food I tried.  It's been about two years since my sister and I tried dining here, so I'll have to come back and give the food another try.\n\nI do love the furniture here... lots of dark engraved furniture and beautifully-colored fabric (at least, that's what I recall).  Made me think of the beautiful mahogany furniture I remember as a child living in the Philippines.", "business_id": "ULvDCr7r9sMU1iSwgTHXsA", "stars": 3, "date": "2008-11-27", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "Qe1l1ln6bf_pcWUUuLswFA", "review_id": "S9zwsCIKglB-m1ROwIfn2A", "text": "The location that was at Park and Woodlawn is closed already.  The WT Harris location is still going strong.", "business_id": "ULvDCr7r9sMU1iSwgTHXsA", "stars": 4, "date": "2009-11-02", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "F4tMgFhpn1-KqKq_OxzLlg", "review_id": "SznD34tVrfIrOP3HoTZ3Aw", "text": "How do you write a review for a restaurant that has great food but had a cockroach looking bug on the wall right next to my head....??? So I am just going to put it out there: bugs... \n\nThe food is amazing though. I had some burrito looking appetizer with chicken in it and the Butter Chicken as my entree. The garlic Na-an was some of the best I have ever had. They bake it in a wood fire stove so it has this pizza crust texture but is way softer and super garlicky. \n\nThe service was ho-hum...I really don't think I will ever be back due to the little critter issue...I hope they figure that out, because the service is forgettable with the food being so good.", "business_id": "ULvDCr7r9sMU1iSwgTHXsA", "stars": 3, "date": "2009-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5Oz8BZbvdhkUmKXIS4sMNQ", "review_id": "aHvoEPM6COgQhU7Ot-oSgA", "text": "Tired of \"phone-it-in\" lunch buffets, with the same 6 dishes day after day?  Then Maharaja might get you out of your funk.  I've been to their lunch buffet about 5 times, and EVERY time there is a new dish or two that I've never seen before.\n\nGreat price on the lunch.  Wonderful dessert selection.  Good variety between meaty and veggie dishes.  Love the goat curry.  If you like Indian food at all, you can't go wrong with a lunch at Maharaja.\n\n(And for facebookers... No, I did NOT eat 4 times tonight.  Just catching up on some restaurants that deserve a good review.)", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 4, "date": "2009-09-11", "type": "review"}
{"votes": {"funny": 5, "useful": 1, "cool": 1}, "user_id": "FuqjqlT3lGH2_TN3TfEvQg", "review_id": "KGM94olCuvzZSErWnQKm5Q", "text": "I have a love-hate relationship with this place. Let me explain what I meant by that. \n\nHere is a scenario: \n\nYou go in hungry and feeling like ready to chow down all the food display. After two plates, you start to slow down but you sill go for your thirds. then, you have to have the dessert. The mango ice cream is calling your name over and over. While you are near mango IC, why not, scoop up some of the pistachio ice cream and hey don't forgot those sweet balls.They are a must. Then, you are really stuffed and can't move. you look around the place and when you think no one is looking, you unbutton your pants and try to get up slowly. Thinking you might explode if you move quicker. You feel really bad that you had eaten all the food that can feed a small village. Then, you hate yourself for eating like a pig. You regret the whole thing ever happens. You go home and feeling sorry for yourself for putting 10 extra pounds in a matter of minutes. \n\nThe next day comes and when the food is digested, you crave for Maharaja buffet again. Eh!! Circle of life. Does it sound familiar to you or am I the only one? Hmmmm..........", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 5, "date": "2009-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "A0Qfr98pLOSlnpUDnVfTJg", "review_id": "EGLgv07ZJrYBbK045vtrUA", "text": "You'll be treated like royalty at the Maharaja. \n\nI first came upon this place by chance. I was in town for work and noticed that there was an Indian restaurant nearby. After reading the great reviews on Yelp, I knew I had to try it for myself.\n\nI ordered the Chicken TIkka Masala along with Naan bread and a cup of chai. I ordered the food to be Indian hot. The waiter replied, \"I like your confidence!\" It was very tasty and hot just as I like it. \n\nThe restaurant was well kept, the staff treat the guests as royalty so the service is wonderful, and the prices are decent for what you're getting.  \n\nDon't forget to stop by the Indian grocery that is located next door to this location! It has a large selection of items so that you can make your own Indian dinner at home. \nWill I be back the next time I'm in town?\nAbsolutely.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 5, "date": "2011-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "MHS-pQ5QxKI5N5_Z54zvhw", "review_id": "xeiLzSzdZMx4n83VVDDXKA", "text": "We did takeout and we ended up with large portions of excellent chicken tikka masala, garlic naan and veggie pakora and they gave us free chai for the road!", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 4, "date": "2011-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KacDtnCV5PFTZf7mEY-ekg", "review_id": "A5fiEWK-DN3CMUoSCpG_qA", "text": "Best Indian food in Madison. Interesting, delicious, diverse buffet. Wonderful service. Very attentive and friendly staff.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 4, "date": "2011-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AlkwJyam3fAQ-xRkbQdT4w", "review_id": "FS_QaORswyE5tlztHnjmsQ", "text": "Excellent, excellent! Very impressed with their assorted curry dishes. Highly recommend. Don't expect fancy atmosphere. The staff moves at their own pace but that doesn't matter when the food is soooo good.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 4, "date": "2012-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1Uhy0IGBZ0fzLpXD7VEpbQ", "review_id": "bHJH9hB0onL5mtH5HTeepQ", "text": "The neighborhood felt a little sketchy, and as a solo diner, my service wasn't very good.  Food was OK though.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 3, "date": "2013-11-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "C16vy9Z3VcNArNZEthU5uw", "review_id": "FGOAee1_w_Hay_sO6F-gvA", "text": "I had been hearing about Maharaja's from friends for months. One big win for them is that they deliver to Sun Prairie. Sun Prairie peeps, good news for us! \n\nWe stopped in a for a mid-week lunch buffet. The food was good, the prices were right on par with other Indian buffets. \n\nOn the top of the list for yumminess for me was the breaded fried Paneer cheese and the \"general tso's\" of indian food - tandoori chicken. The cheese had a great texture and what's not to like about cheese! It was tossed in a sweet and spicy sauce. The tandoori chicken was creamy and had a flavor to it that I haven't found before in tandoori chicken. Very flavorful. \n\nPlus, on an extra note, they let my 20 month old eat off the buffet for free. Yes, he only ate grapes and mango ice cream, but hey, he loved it! :) I've been to some buffets that charge for one year and up when they only are going to eat grapes and mango ice cream.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 4, "date": "2014-10-16", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "QBKzfolWUTa0Ka9ujSm4gw", "review_id": "yzCywBKuD5oZ_qq4qNrBcQ", "text": "Let me set the scene... Coming back from the Packers vs Panthers game. The trip is interminable. As we get closer to home we realize we are starving and need to grab take-out or else we will die.\nMy Pakistani guy suggests Maharajah East. There are 3 of us. We order two orders of Samosas, naan, parantha, chicken mougali, and palak paneer.  We swing by, grab the bag and before you know it we are seated at my table unwrapping our treats.\nThis is no easy crowd to please. We taste the crispy samosas which are filled with mashed potatoes and peas. Dipped in tamarind sauce they were downright heavenly. We nod silently in approval. We move on and find each dish to be equally yummy. The palak paneer (creamed spinach and cheese) was quite spicy and the mougali was very similar to tikka masala. Both dishes were quite rich. The naan and paratha were used to wipe up every last bit. As a treat, the restaurant threw in two little servings of mango ice cream. Thank you very much!\nA great meal to end a great day. Go Pack!", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 4, "date": "2014-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hToSCVEg2CfejHYst9cRhA", "review_id": "JBVFj0ApjZtzv7IFW6iPcA", "text": "DISCLAIMER.......I ordered Takeout and ate the food 1.5hrs after getting home\n\nI was staying in a nearby hotel and was really craving Indian so based on the reviews I headed to Maharaja.  I ordered Chicken 65 and Chile Chicken and Garlic Naan.  The food was ready when I got there, about 25min after making a call.  The food was well packaged and they included a plate and plastic silverware.  I also got some free mango ice cream, and a bunch of chutney's.  \n\nI'll start with the chicken 65 was well prepared with a smattering of raw onions and lemon.  The flavor was very good, but the chicken was chewy.  I don't know if this was because of the delay between preparation and consumption.......OR if the chicken was a little suspect.  \n\nThe Chile Chicken was a masala based curry that was well prepared.  The chicken was not chewy but still did not seem A grade.  The flavor of the gravy was excellent, with the proper amount of spice and flavor.  I did ask for it spicy and they did not hold back.  It was the ideal combination with the garlic naan I had ordered.  \n\nOverall....I feel guilty giving 3 stars, but I think if the chicken had been of a slightly better quality I was have loved the food.  \n\nOn a side note, there is a grocery/liquor store next door which has a great selection of Indian beers, about 4 including Taj, King Fisher, and Royal Salute.  They also have multiple liquors, and obviously a good selection of indian vegetables.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 3, "date": "2014-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "hToSCVEg2CfejHYst9cRhA", "review_id": "AXlEOyRuFvgeekUMpgYjcg", "text": "I feel compelled to write an additional review for this restaurant because the food I received on my second takeout experience was AWESOME. This time I ordered exclusively vegetarian. To start with the mixed veg appetizer is a great deal. For $8 you get a samosa, 4 spinach pakora, 2 paneer pakora, and 2 other pakora. All of them were excellent, not oily, and curry in the samosa was fresh and tasty. \n\nFor dinner we tried the Tandoori paneer and paneer jalfrizi. Both dishes were excellent . The combination of the spices with the vegs and the paneer was out of this world. The quantity was huge and one dish was plenty for two people. We also tried a ginger naan which I have never had before. Careful because it does have a kick to it, but I loved the flavor. \n\nWe also received two complementary mango ice creams which were also very good. Perfect quantity cups for each person. \n\nOverall I was extraordinarily pleased with the level of the vegetarian food that we had.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 4, "date": "2014-11-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_WDrLSQXMgKmJbbTWMbJxg", "review_id": "omhrw9l4AJ4zSnr377QmvQ", "text": "I have been going to this lunch buffet about once a month for a long time and have always rated it high. Not so much anymore. The last three times things were just average. My main complaint this time is that the food is not hot enough on the buffet line. It was the same the last time I was here and it hasn't improved. I actually mentioned it to the cash register  person but nothing has changed. Some of the things that I really liked are now missing like that potato thing that I don't know the name for that was always there until now. The lentil soup is different  as well. Just doesn't have the same taste. One really irritating thing that happened this time was that I was criticized by a server for using the wrong spoon for the mango ice cream. It was in the ice cream when I got there so someone else had left it there. It was supposed to be in another dessert. The ice cream scoop was there in a bowl of water that looked filthy with the water and ice cream all melted together so I don't blame the previous customer for not using it. Either way the guy should have just moved the errant spoon and not criticized me, a paying customer, for using it. I suppose I am nitpicking but the other Indian places are now a step or two above Maharaja and I don't think I will go back for a while. Something has definitely changed here, at least for the buffet lunch.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 2, "date": "2015-10-23", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "SpKVX3rt892E-BrL-yeqiw", "review_id": "HEMzpsPhEmEPENB_JmrcwA", "text": "I have no pretensions to being an expert on Indian fare, but Bombay does what it's supposed to do: fill your belly in a reasonable fashion while remaining tasty. The naan is fluffy and delicious, and any of the chicken dishes (I've tried several), are excellent.  However, the lunch rush is pretty intense, and the staff make no bones about letting you know that they are not there to indulge in your lunch hour relaxation.  Expect to see your plates taken away and your table cleaned as a *hint* to mosey on along, partner.  Seriously, a bit awkward to have my table wiped down in mid-sentence.  Still, decent food for what it is, a tiny lunch factory in Campus Town.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 3, "date": "2008-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lgNGOlBYaxoWIAPeydQ8cA", "review_id": "_tKy3GRIuR628QahbnbgiQ", "text": "Food is always fast and fresh here. And I've noticed the naan has gotten considerably larger since I last set foot in here in early 2007. But I'm not complaining!", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 4, "date": "2008-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "irnzN5lDB32mVrSPiPw7nw", "review_id": "lx0uiGnfgb04Ls4V24_JYg", "text": "Bombay has been one of my favorite restaurants in Champaign for almost 5 years. It's dark and cozy inside and smells of masala and fresh yogurt. It seems to be popular, too, because every time I have gone it has been absolutely packed -- but I've never had to wait long for a table, and usually there is no wait at all. They also give you so much food, and I always have enough left over for lunch the next day. Great selection of vegetarian entrees, too, for those that are into that!", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 5, "date": "2009-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "_hz_dF3yYAUdbD8rwqbVPg", "review_id": "BSMxMYk4dvFT4jTmlENFdw", "text": "Well, the first week I went here somehow I ended up going three times. I really like the food here. I wouldn't say I'm a connoisseur of Indian food, but it tastes really good to me, and they really do give you a ton. I had the biryani the other day and I was able to eat it for three more meals. The only complaint I might have is that it's a little expensive. (I'd rather have less food and pay less money) Also, I love really spicy food. I've learned my lesson in the past--don't tell Indian or Thai restaurants that you want the food spicy or you might not be able to eat for a week. But I feel like the food here is just not that hot. One exception was this one appetizer...it had big old chunks of jalapeno. Pretty tasty! I'd love to come back.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 4, "date": "2009-09-24", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "vDF0lq9W2BlW17-dbPMwfQ", "review_id": "6FYoQ6rRA5Oic6zh05Z7Zg", "text": "For my grad program I have to spend a few weeks in Champaign every year. When I'm there, I go to this place all the time. The food is great, and it's really cheap at lunch - for $6.99 you can get an enormous amount of your entree, plus either the biggest piece of naan in history OR a giant pile of rice OR some of both, plus a couple pakoras and a salad. What? Fabulous. And it is more than enough food to last for two meals, which is another huge plus.\n\nIn case that weren't enough, they frequently give me free stuff. I don't totally understand why. I'm not really a regular, and I'm not a supermodel. If this place were on the east coast, I'd guess it was because I'm polite, but this is Champaign, where everyone says \"please\" and \"thank you\" and smiles. So...I don't really understand it, but every time I go there, I get some of another entree, or an extra piece of naan, or a dessert, or a soda. Maybe everybody gets free stuff. Whatever. I'm not one to look a gift daal in the mouth.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 5, "date": "2009-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1XiPnPQ56kcJzSwrsSnGmw", "review_id": "Svrg4Mn_9ng4hxR2D2oDFw", "text": "Nicely seasoned paneer and enormous naan.  Very good and reasonably priced.  Only con is that they serve it on styrofoam plates which isn't very environmentally friendly.  I'd be back once a week or two if I lived on Champaign.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 4, "date": "2010-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xJrEPz81yEFxnFw0BPCmNw", "review_id": "lQuLI8vHQmxIp3_uqefdFQ", "text": "Great indian food; spiced well and not Americanized.. The naan is fresh and amazing.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 4, "date": "2010-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3DXQC2JALx0UQhpzSPMi6g", "review_id": "r-SDZQxLdLn5hzzVJA0_NQ", "text": "I would highly recommend the lamb curry which is spicy and comes with fragrant basmati rice. The naan is really great too. I also enjoy the aloo tikki appetizer, as well as the samosas. I am not an expert on Indian food so I can't tell you how authentic it is, but I can tell you that it is delicious.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 5, "date": "2010-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "--YaJOk3UrAdXXUWHNGAeg", "review_id": "0g9CxyKQg-v2AX3vQnwDmw", "text": "I've eaten at a lot of Indian places and I love Indian food. I must say, I was very pleased with this place, especially given its location. The food was delicious and pretty authentic. I gave it four stars because the service was so-so and there was no ice in the water.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 4, "date": "2012-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5x-D9LqS0VDZlSosk2c3Fg", "review_id": "M5mZ9FKY3IlB_6lxF1I2xw", "text": "We love Bombay on Green St! Really delicious Indian food, can't go wrong!", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 5, "date": "2013-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iZXnZSzTUWdXe_ZNIixgUA", "review_id": "Vh1THd0XaPclZ6hGfkmqcw", "text": "generally okay place, a little overpriced for the settings:(  noisy and place is too small, not looking very neat... food portion is below average. maybe not again.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 3, "date": "2014-10-11", "type": "review"}
{"votes": {"funny": 4, "useful": 2, "cool": 1}, "user_id": "LN3fB5hx6aWqcpJ9_fOwIQ", "review_id": "RcslfReUg298BFohyelVjw", "text": "I ordered my food online with my credit card at about 6:30 PM. \n\nAt 8PM, I called Bombay Indian Grill, and asked about the status of my food. I was told that the delivery guy should be picking up soon.\n\nAround 9PM, I called again. This time I was told I had to call delivery.com. I tried calling, and no one picks up. \n\nAround 9:30PM, I get a call from the delivery person. When I go to take my food, he says, \"you're supposed to pay with cash.\" I explained that I already paid via yelp's link for online delivery with my credit card. He said, \"it says you are paying with cash.\" I proceed to stand there for fifteen minutes, while he calls various people to finally get to the number to call to confirm my method of payment. He says, \"do you have your credit card?\" I respond, \"no.\" He says, \"you'll need it because they're going to want to confirm the payment.\" Mind you, I am in the law building. My stuff is on the other side of the law building. I am not wandering around looking for my credit card, while he calls people to confirm my payment. I just stood there. At one point, I said, just void this I don't want it. Then my hunger snapped me back to my senses. \n\nAfter some time on the phone, he is told I paid with my credit card already. I told him I would not be using their services again, he said \"okay.\" He walked out unaffected. \n\nAround 10 PM, I called the number on delivery.com, and heard no apologies. \n\nThanks Bombay Grill, for providing me with the distinct pleasure of paying $23 to have cold mutter paneer and wilted garlic naan delivered to me more than 2.5 hours after I ordered it. The lack of silverware and napkins was a nice touch.\n\nThanks delivery.com, for demonstrating that incompetence and a lack of care is possible at all levels of an organization.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 1, "date": "2014-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aX8hmnedCsrLJ7HmD8hwvQ", "review_id": "uy-O-0ayYlx69HPcMLBKKw", "text": "Okay Indian food. Bit overpriced. The naan is big and fresh. The service is sub par. I ordered an aloo paratha once and the owner brought me a regular paratha. Did you think I didn't know? The vindaloo tastes okay. The lassi is waaayyy too thick. They do have mango kulfi, which Ambar does not. But 10 out of 10 times I would go to Ambar.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 2, "date": "2014-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "dzKYG04n0nLXv6tGFvJX0Q", "review_id": "qclsNhXdrW3OXQpCoZO2YQ", "text": "Bombay Grill is hands-down my favorite on-campus restaurant. I know that among my friends, I'm a lone voice in strong favor of them, but trust me, it's so good. \n\nThey have excellent vegetarian options, the portions are substantial, and the owner is sociable. He demonstrated to me that he is serious about separating vegetarian from non-vegetarian food (at the very least, beef from non-beef): \"I'm Indian. And Hindu.\" And he had a religious tattoo to show that he meant it. I only asked because I've heard of some places using animal broth for vegetarian dishes. Anyway. \n\nThe curry is always creamy and flavorful. This is the only thing I get so I can't speak for all the dishes (though my friend and I ate at the Bombay buffet on First St... and subsequently puked from superhumanly gorging ourselves on their divine food). \n\nSo you're probably wondering, \"Jessica, if Bombay is so bitchin' why didn't you give this place 5 stars?\" Okay, truth time. I hope not to offend the manager but rather to have my vexation understood. I got a $9 chicken korma with no chicken. I substituted paneer.  When I became suspicious that I was shortchanged, I asked for a receipt, which I wasn't initially given. I suspected that my substitution was equivalent to something else on the menu that cost more. Turns out, I was almost right. The receipt indeed showed a higher price. But nothing like paneer korma was listed on the menu at the price shown-- there were no paneer extras nor paneer curry dishes at that price. So basically the manager kind of waved a hand and whipped up a price on the spot. I was purposely trying to stay under $10. But that's not my only source of frustration. It's just not knowing what you're getting and making prices willy nilly.\n\nThe food is truly delicious though. I will still probably come back. But I'll ask what it'll cost before making any substitutions.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 3, "date": "2015-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "iKt9RWLOS_PE4SKBRFkKww", "review_id": "Kvik2zeax0oXq0Ef6PVnUA", "text": "Food is delicious.  Hands down, it's fantastic and based on food alone I would have given this place a 4.\n\nThe reason it's a three though is that the service tends to be lackluster with the servers not really offering recommendations (which can be a problem if you're not that familiar with Indian food) and honestly... no matter when I've been in there the place has been virtually empty.  I'm not entirely sure I know they stay in business.  The ambiance is definitely lacking enough that I take down a star.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 3, "date": "2015-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yD8IVbVV8mOaydNJOawJFQ", "review_id": "qvEgmfmeUAcf3pxXD7Bq9Q", "text": "One of the best indian restaurant in Champaign. ..the food is so fresh and authunthic. ..servers are friendly", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 5, "date": "2015-10-28", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "YtbXNQJEJAHZK_2DFXSa6w", "review_id": "0tkckbC9cbQwB43SrCRmEw", "text": "Bombay Indian Grill is one of those places that turns its city block (without much else on it) into a feast for the senses.  The spices alone floating out of this place is enough reason to head on over.  And generally the food is pretty good, my only complaint is that I've gotten what I think is food poisoning from this place twice (namely, I'm 100% a-ok prior to the meal, and then about 30 minutes to an hour after, I'm sick as could be!).  That's not always been my experience, but it has a few times, and I think it's something to point out.\n\nOne of my favorite things here is the warm, toasty (and yes, buttery, like all good ;D) naan.  I mean, I'm pretty sure it's everyone's favorite.  They do a Tiki Marsala that's ahhhh-mazing, especially with the rib meat chicken that's tucked inside it.  So good!\n\nWhile I agree with some of the other patrons, the service can be a little lackluster, the person who owns it is truly nice.  \n\nThe restaurant is spacious, and well maintained, but, unfortunately it's starting to show its age.  It has been quite a while since they've updated it (I'm not sure it's ever been updated, to tell you the truth).  \n\nRegardless, if you're a fan of the Indian cuisine, and have an urge for a Marsala or a Curry, you should check them out!  On their best days, they're amazing!  Unfortunately, on their not so best days, you might expect a problem or two. =X", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 3, "date": "2015-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I6pt5_JaBdUtjvFfSsjZlw", "review_id": "FGFnvx85Pbh2c6TVA--ljw", "text": "Really disappointed today as I ordered a Bombay mixed biryani for takeout during lunch hours. As I am paying for it I notice I am being charged dinner price and I remark isn't it a lunch special right now. I've ordered takeout before during lunch hours and was always charge lunch price. The person/owner then remarks it is a dinner biryani which has me really confused since I've ordered it for dinner as well and there is no difference from what I've experienced. As I get home i open the box to see that it's actually only half full. So if I am paying for a dinner portion why is it even less than a usual lunch portion. Very disappointed by this experience.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 1, "date": "2015-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HANb8-8InWnju-XzBQQSBw", "review_id": "U3RtF3f2SZX92FkHyla27w", "text": "Most dishes are Indian, but they serve food I would categorize as middle eastern as well - hummus and others.  I enjoy a good biryani, and they've got it here.  Several dishes are vegetarian, but meat dishes are prevalent.  The saffron rice is sooo good.  The food is all pretty good, so the buffet might be the best way to go.  The service is decent but sometimes pretty slow.", "business_id": "mtQHSFxx35emKstqMxp9Cw", "stars": 3, "date": "2005-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sUrU9l3_f1iWYZdLmop0Rw", "review_id": "pJcCgOyR6xp9tcHswUkAQQ", "text": "I'm not the hugest fan of Indian food but if I had to eat it this is where I would go. They also have a few other dishes besides Indian which is nice. The food tends to be spicey and pretty authentic!  A lot of what they offer is geared toward the vegetarian crowd.", "business_id": "mtQHSFxx35emKstqMxp9Cw", "stars": 3, "date": "2005-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Bq1WRSGLdj3OmM309sVhYg", "review_id": "Iu8De3dE9sHqG1ypZDQUpw", "text": "I think this place maybe the best Indian food in the valley but if compared to the DC area,LA, Chicago, or the Bay area, it would be at best average", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2008-10-11", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "eYoB6mEOCkraWM2vhYikvQ", "review_id": "vtkhuygrNetq2Br0VKZnbQ", "text": "We arrived at 2:30 with a craving for something that wasn't mexican food or contemporary food. We were seated and told there was a lunch all-you-can-eat buffet going on. We looked over the menu but decided after all on the buffet, it was a good idea to try some new things since I always get matar paneer. \n\nI filled a plate and proceeded to stuff my face.. in classy form, of course. The Aloo Mattar had the perfect amount of spice and an immense amount of flavor. It was impressive, as was the chicken curry, the rice, and the chicken masala. I was in heaven! The garlic naan was perfect. Everything was right with the world..\n\nThen the bad news came. Not fifteen minutes after we sat down with our first plates filled were we told the buffet was going to close soon. Had we known earlier, well, I'm not sure what we would do. But it sure is lucky we are a couple of small ladies who can't really eat more than one overfilled plate.. I thought.\n\nI finished my plate and decided to have more aloo mattar, rice, and then some raiti and fritters. Then I got some of the coconut basmati rice. Oh everything just.. sighhh. I think it was the first time I've really been rendered speechless by food in a long time. \n\ntl;dr Service was friendly but didn't come around often enough to fill our drinks, food is incredible, the place is relaxing and aesthetically appealing inside.\n\nThey lost a star for the failure to tell us we had fifteen minutes to enjoy the buffet and for being a little lagging on the refilling of drinks.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2009-09-23", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "sALB8-F04S9VcZMF_GkGUA", "review_id": "SbkDr507y6pRUrv-vVBgow", "text": "A craving for Indian food.. popped in here about 230p...The waiter seemed a bit annoyed when we didnt sit and jump right at the buffet..BUT I hadnt had time to look..buffet or no..offer the menu! All in all....since I couldnt decide, my friend and I opted for garlic naan and the buffet.. Chicken curry is a fav of mine..but maybe Im spoiled..I like it to contain more than chicken legs .. Ive actually only had it boneless.. (probably not traditional.!).. I liked the curry , but not the chicken.. Im kind of a white meat girl... Loved the daal... the fritters, the raita.. the mango lasse.. the aloo mattar... yum... a new fav... NOW heres where they FAIL... not 5-8 minutes after agreeing to the buffet and serving ourselves... the waiter comes back and asks if we are done with the buffet.. Kind of a WTH look came across our faces?? I mean did he kind of lure us to buffet it...away from menu...just to rush us ?? Yeah...no.. wrong... SO, we proceed to get another selection of items on another plate.. small table now full.. as they took away the buffet.. I mean, are you serious!? Just let a customer know that when they sit... 'oh btw, get your buffet.. if not its going away...'.. \nThe naan rocked.. its large and enough for 3... I just always feel at a buffet per norm.. I dont get my moneys worth.. I dont eat alot.. So I sample when at buffets... this lunch buffet, for the short time it was 'there'... was priced right..", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2009-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 3}, "user_id": "HjhR3u17OjxD4s8t3toTfg", "review_id": "IQsnf3_sFo0IiW12pv1URg", "text": "Two reasons for coming here: \n1) You love Indian Food\n2) You love to sample a variety of dishes \n\nMy first visit to the palace was on a Friday, for the lunch buffet.  For $7.99, you have your pick of Tandoori Chicken, a delicious chicken Curry, Three Vegetable Curries, Basmati Rice, Daal, Naan, and. Salad. To complete your feast, they offer Kheer (rice pudding with almond and pistachio) and Gulab Jamun (Two balls akin to donut holes - made from cream of milk in scented light syrup).\n\nThe greatest thing about this buffet is that it is \"western\" friendly.  This means that none of the curries are too spicy, and even the mint chutney is not over-powered by peppers and chilies.  For your first experience with Indian food, this is a terrific spot.  If a seasoned veteran of this cuisine, you may be more picky where flavor is concerned.\n\nI personally feel the buffet had very slim pickings, especially for someone that enjoys diversity in dining.  However, I thought the tikka masala, chicken curry, daal, pakoras, and saag were sooo delicious.\n\nI am interested in returning here to explore its dinner options.  For example, along with the varying lamb, chicken, and vegetarian dishes Indian Delhi Palace offers - they have complete dinners for under $20.  For instance, the chicken dinner includes One Papadum, One Tandoori Chicken, Chicken Curry, One Daal Maharani, One Plate of Basmati Rice, One Naan, One Ratia, One Dessert, Chutney and Tea.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2009-10-04", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 3}, "user_id": "LMqKXdbwYdCqCCF64QbVkA", "review_id": "fnWo800vaq8qac6A9KARdQ", "text": "I was very surprised to see that this location is a great advancement from the Tempe location. I love the Tempe location (due to it being the best in proximity), but everything about this location is better. \n\nAs far as the food goes, it's just as \"top-notch\" as Tempe. All the food is hot and fresh, and they are constantly bringing in warm bread and new refills.  The chicken curry is even better with the addition of red and green bell peppers, but everything else is just as tasty.\n\nThe building the restaurant is located in is perfect. It looks like it was built for this restaurant alone, and I gotta say I was impressed. There was even an Indian Grocery inside which was cool to look around in.\n\nI had a great experience here and I'm sure anyone else who enjoys Indian Cuisine would as well.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2009-10-13", "type": "review"}
{"votes": {"funny": 9, "useful": 10, "cool": 8}, "user_id": "YzNZNgpOy9tthDnczS_ajg", "review_id": "1RJfJIOtuMAp6yYvPElYiw", "text": "Coda B. and I both crave Indian Lunch Buffets when we're hungover. Him more so than me. He's actually called me at 12:30 at night, from a bar, talking about how he wants Indian Food. It's as though he can already feel the hangover coming on and wants to make sure his priorities are in check. 1) Get home (or wherever) safely 2) Indian Food. I may have mixed up the order.\n\nThis Indian Delhi Palace is apparently under the same ownership as the Tempe location, but I like this one much better. For several reasons:\n\n1) The Chicken Tikka Masala is AMAZING. Like, I've never had buffet food this good before. I don't really like Tandoori Chicken. Honestly, the color kind of freaks me out. I know it's from the sauce or whatever, but chicken, on the bone, with a kind of fluorescent pink glow is weird. I'll pass. But boneless chicken in a delightful red curry sauce? Don't mind if I DO!\n\n2) This location has a much larger variety of dishes, especially vegetarian dishes, which are usually my favorite offerings at an Indian lunch buffet (see above about tandoori chicken freaking me out).\n\n3) Um, hello? It looks like a freaking palace. These guys did not hold back and I freaking love them for it. I actually think more places offering a lunch buffet should treat its patrons like the hungover royalty that we are. I wouldn't mind if Souper Salad and Sweet Tomato hopped on this trend already. I mean, how hard can it be to add a few fancy door arches and some gold plated silverware? Not that hard really. Up your game, guys.\n\nHowever, the only complaint I have about Indian Delhi Palace, and the primary reason why Flavors of India remains my favorite Indian Lunch Buffet has to do with the atmosphere. Yes, I appreciate the super sexy high-class water goblets, but Delhi Palace doesn't have any booths. And when I'm hungover, I need a freaking booth. I need my own little eating sofa. I need to be able to kick off my flip flops under the table and sprawl out like I'm enjoying their delicious naan on my own little loveseat. That's what I need, and that's what Flavors of India gives me. Oh, and some Bollywood wouldn't hurt either.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2009-10-13", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "_8KAa1lhcX0JEmDqvODwFg", "review_id": "1L-vUr3TQelcj63s4_wvXA", "text": "went here with my bf and his friend. came in at 7pm. took 10 minutes for someone to even realize we walked in the door..then took about 35 min to even get our food. they didn't seem very friendly. luckily, the food is pretty good [i've eaten indian food in europe before and it almost stood up to that.] i just didn't care for how slow they were.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 1, "date": "2009-11-13", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "jt8jtEY1K6TD1FBzYa7HGw", "review_id": "93dxQn8YxAtRdx0hc2bsKw", "text": "Delhi Palace saved my dinner party! I was getting over a nasty 24-hour bug, and was panicked about how on earth I was going to be able to pull off a vegetarian duel birthday dinner party for my Scorpio-signed, non-meat eating folks. \n\nMy boyfriend suggested ordering a bunch of food for everyone. I was non-too-thrilled by this suggestion, but felt I had nothing better to offer. Cooking, cleaning and preparing for the party would have surely put me over the edge, so I went along with it.\n\nThe responsibility of ordering for everyone sort of put me in a state of quiet anxiety, but I knew I needed to bite the bullet.  Ordering for 13 people I got the following:\n\nAPPS\n3 Vegetable Pakora (6/order) apps - too salty, over done, wouldn't order again\n5 Samosa (2 large per order) apps - we split them in 2 so there would be 20. They were gone in minutes.  So delicious, and really reasonable at $2.49/order\nDINNER\n1 Vegetable Korma - excellent, should have ordered 2 of them\n2 Daal Maharani - excellent, and there was nothing left\n2 Bengan Bharta - too salty, wouldn't order this again, hardly touched\n2 Palak Paneer - excellent, a true hit\n1 Malai Kofta - delicate and delicious\n\n\nOh, how could I forget, we ordered lots of Garlic Naan, and a platter of Basmati rice.  The apps came with mint chutney and tamarind chutney, and I ordered raita (cool whipped yogurt) to drizzle over the spicy preps.\n\nDinner was around $170. It was entirely worth it.  No stress, no mess, and everyone was thanking us for the Indian treats. Plus, we had Indian food for dinner the next night!\n\nWhat I gleaned from this experience was I could have definitely ordered less food.  There was tons of left overs.  I would say that one dinner dish safely satisfies 2 guests.  Favorites were: Palak Paneer, Vegetable Korma, Daal Maharani, Garlic Naan, Samosas.\n\nOne last thing, this place has the best Indian Buffet in town... if you're into that sort of thing (wink).", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2009-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M6kAQ2anG2c8-fcoHEC_1A", "review_id": "Jiee5Ve8Twi4lgXuv17YyQ", "text": "I may be biased as this is the first Indian restaurant I've ever eaten at but I love it. My sister and I have \"date night\" here about once a month. We look forward to gorging on their delicious naan, chicken tikka masala, palak paneer and rice. Those dishes are so good, wonderfully flavored and full of awesome. I love spinach, my sister hates it. Once I got her to try the palak panner she was hooked! Now we fight over who gets the last piece of cheese. Their chicken tikka is the best I've had. The chicken is flavorful and the sauce has a creamy and silky texture, perfect to dip your naan in. We've also had their butter chicken and chicken curry. Both were excellent. They also offer traditional Indian dinners (vegetarian and meat) which have a little bit of everything. They're great for introducing Indian food to first timers. Oh, and the mango lassi is delicious! Since everything is a la carte it can get pricey, but the portions are generous. I have yet to try their lunch buffet.\n\nIt has a really nice atmosphere and is never overly crowded so you can have a nice conversation. The decor is also lovely. The staff is very friendly and helpful. They have a small market attached full of spices, medicines, bangles, hena kits and other various food items.\n\nReally great restaurant!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2010-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 3}, "user_id": "hq0WUfau1Mh3GyHn8oVdNQ", "review_id": "mERsc3hJ_LUeUptC_pWQuw", "text": "Nice little lunch buffet at a fair price. They had a fantastic chick pea salad and I really liked the Tandori Chicken and rice pudding. I even got a $5.00 off coupon on their website, which made it a very economical lunch choice.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2010-10-26", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "7tA04v45dzG8tADZGLrCzA", "review_id": "kD6qtb2i_jtqHRAItd1kqQ", "text": "It's a good lunch buffet and they don't take you to the cleaners.  I enjoyed the Chicken Tandoori and Curry Chicken,.  I would have preferred that they would have used boneless chicken but it was still good.  I also liked the rice pudding!  As my friend Jessica F stated, make sure you print the $5.00 coupon from their website!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2010-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NSu-sX5ZAcnWN5Sy0QDohg", "review_id": "u4JmOuFfNC0fxIqctJM9UA", "text": "We've recently moved to Phoenix and we've been looking for a fantastic Indian restaurant (and I think we've found it!)\n\nThe restaurant is nice, with nice decor. The service was friendly and quick. The waiter was a pro and we loved one to ten spicy-scale for our dishes. I ordered Veggie Korma, he got the Chicken Tikka Masala,  and we shared some Naan and the 'assorted snacks' (Vegetable Pakora, Samosa, Sheesh Kabab, Papadum). Everything was DELICIOUS. Giant food baby. We'll be back for the lunch buffet and we can't wait.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2010-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kEVun6y2Rvs-wNGIghD2FQ", "review_id": "uMAmR_yzPF0pVA8sjiM79Q", "text": "We went back last night for dinner after taking some time away from this place.  We were in strong agreement with other reviewers about the bad service.  We were always pretty fond of the food (although you could find quite a few funky bits in some of the chicken dishes).  Well, last night the service was great!!!  Yes, I said it....  Now it may be that we were one of only two tables in the place, but the staff was very attentive and the food came out quickly.  It was hot and fresh and tasted great.  They even came back to the table to check to make sure we were happy with the meal.  Hopefully they have seen some of these comments and made some changes for the better.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2010-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nhysTbkA09SymSrCjdTaVw", "review_id": "1zX4s-lbU5HC1SkS9wHWKA", "text": "Had the buffet.  Loved it!  Food was hot but not overcooked like so many buffets.  Will be back again.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2010-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LDjGfxmYvf-_lGRmOEhBjg", "review_id": "cs-6hDDt0G_UZwEfA8aEug", "text": "I  just ordered Malai kofta a vegetarian dish. The quantity was so little for the price and it was really salty. But the chicken biryani I ordered along  with it was not bad.  I still would not be ordering from this place again.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 2, "date": "2011-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "weYT-xJwz8o7mLNWIhD6HA", "review_id": "S9eMcnplqzqtlhcFcrgS6w", "text": "Stopped in for lunch, and it was definitely a solid \"meh.\"  Lunch buffet is $8.99, which was a bit steep considering the lack of selections (only 2 chicken dishes, chicken curry and tandoori chicken, neither spectacular).  The vegetable curry was fine but again, nothing special, and everything else was quite bland.  I won't be returning.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 2, "date": "2011-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LuD_tkfvz2C-ATVZKIrOBA", "review_id": "Shx9Okj5qALyRZgbc2fdRQ", "text": "My all time favorite at IDP Chicken Tikka Masala, Peas Rice & Garlic Naan!!! Yummm", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2011-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rlcJkEoYzuiS7iF5XfXCMA", "review_id": "tZ_slEGK0vJYE34VX9GRuA", "text": "I was checking the reviews when I saw the yelp coupon and bought it! We ordered: Samosas, Chicken Tikka Masala ($10.99), palak paneer ($8.99-spinach and \"cottage cheese\"), and goat masala (11.99?). \nI'm not a frequenter of Indian cuisine establishments so i can't really compare it to others but the chicken tikka masala was AMAZING! Palak Paneer was also great. The goat masala was good, not gamey at all! They definitely don't clean the bones away very well so be careful not to chip a tooth.\nServer was not overly friendly but good enough between him and the 2 bussers who were prompt to refill our waters from ordering a little too high on the spicy scale :)\n\nI need to come back for the lunch buffet for $8.99 sometime!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2011-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wUEp87FqOB9ew27Iz6zk_w", "review_id": "_ElIIVS6FSE051k9qKD8vQ", "text": "came here last Saturday night with a friend. the food is very good and you get a large portion - I had leftovers for lunch the next day. my only gripe is that the naan was a little more burnt/crispy than I like. I will be back to try their weekend buffet though.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2012-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2HBaogoNJB4RX3cozqBHUw", "review_id": "JyptAu8rEcd9sDaYWY0Oxw", "text": "I am hoping for a little bit of London here in Phoenix with this Indian Resturant. Fingers crossed!!!!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2012-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GcNfuT79_GrreDibwGS2vQ", "review_id": "Hg-GUMLvNP49wdHOty9LQw", "text": "We used to love this place, but the food has gone way downhill. I ordered the Vegetable Korma, and it looked like they used a bag of frozen mixed vegetables - it had corn and green beans in it, something I've never seen in any other Korma dish I've had. We also ordered the garlic naan, but it hardly had any garlic on it at all and tasted like it was reheated. I'm very sad because we used to go here all the time, but we won't be eating here anymore.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 2, "date": "2013-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Pcvs0q09NEAVUj0f8nf8rA", "review_id": "XV3xUn6OirZF338-BjZqMg", "text": "They did not make a great first impression and I don't think I will be back.  I took some friends to try Indian food for the first time. The service was not good at all. We had to go to the kitchen to get service for our drink orders. My friends enjoyed the food although I have had better.  But the naan was good.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 1, "date": "2013-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6NuTbiFBEKKMkBCL5Aj3pw", "review_id": "IziLkQzXgyyFw21S9pweEw", "text": "This place was phenomenal, the food was amazing. They catered to me which was amazing. I can't handle spicy food and they took that into great consideration when I asked what they had that was not only low on spiciness but also vegetarian. I thoroughly enjoyed my meal there.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2013-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XREwm62YjlubaZjO0o240w", "review_id": "9Z2HjEzNWAAl815eJFXjzg", "text": "Came with friends and ordered med hot for all our dishes, they were fantastic! Everything we ordered was delicious! Ask me what we ordered and i couldn't tell you, we asked the waiter to order for us!!! He brought a great selection. Now the wait staff were really in need of some customer skills training. sorry to say but true. Our older gentleman waiter seemed annoyed with us because we really had no idea as what to order. Sorry. it was our first time. and next door to the place is their store where you can buy goodies, just make sure to check all expiration dates before you purchase anything. Will definitely go back, this was a wonderful out of the ordinary place to have some amazingly different food.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2013-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "81Q5kqtLfYVJTedSP5b-uQ", "review_id": "dDc1khNRYGHBy230lQarfg", "text": "The appearance and cleanliness of this place is really nice, however there isn't hardly any variety what so ever for there buffet. There is one table of food and that's it and most of there food was cold and tasted exactly like those canned foods that you buy at the grocery store. Price is outrages for what they offer as I went to golden corral with my spouse, and spent the same amount, exact same and got a ton and I mean a ton of options, and best of all there food tastes great! Sadly I do not and would not recommend this place to anyone. If you are looking for a buffet try golden corral or the mandarin, but don't be lured in by the appearance of this Indian place as you will leave disappointed.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 1, "date": "2013-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CHZpi_PT8ru3ZUnp-fJypA", "review_id": "gNyHTnTu0l3AXQj1FPeXjA", "text": "Nice place. Food was pretty good. Great service. Very respectful. Be careful if you are not used to eat spicy food.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2014-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BEbmHkHNOHZCqs3YHcoKig", "review_id": "AsFba43jcz4SvL74uKHKTw", "text": "Amazing food and even better service. Also has a great atmosphere where they take good care of you and do not rush you. Really nice place to sit down and have a great meal.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2014-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tgQ2nak9ypgAV_KC2wxqRQ", "review_id": "4Gbz6io89WsfL0Y1ZkuKAw", "text": "Good spice levels. Chicken tikka masala and samosas were the most popular with our group. Did not enjoy the shrimp curry.\nGreat friendly and helpful service.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2014-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hDXf-W-EigLjGcjn08rKxw", "review_id": "KOamb1ZXytPxZiOY_tEayQ", "text": "Delicious food, not too spicy, lovely decor, pleasant service. I've been here many times. Great place!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2014-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yEQ96ibrgRxUaJP_wv5cbw", "review_id": "9y-1nemA-ZTqgO5u386nlQ", "text": "I love their lunch buffet. \nI always forget what I love most, so dinner is very hard for me.. Decisions decisions.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2014-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0uVqnhouGRH4dmzIYQkkag", "review_id": "XTpSUxLXdU0_Xhbjw0UCKA", "text": "Excellent service, beautiful atmosphere, and the best indian food in Phoenix. Highly recommended!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2014-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Av4TyDGgVR2wRuXhU_TTVg", "review_id": "L1WZsP5wy2gIwo2nwNa3Cg", "text": "This is an exception Indian restaurant! My fiance use to deliver clay ovens to all the Indian restaurants in the valley and said this place had the cleanest back of house! The service and food are great! I've been here for dinner several times and my go to meal is shrimp korma, basmati rice, garlic naan, and a mango lassi to drink. I can't wait to try the lunch buffet sometime!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2015-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AbqB3wB6wmXF4ciCW0o3Fg", "review_id": "woh1__QVJfzTFN3DmXZPog", "text": "Decent. Food is a little pricy, but gets the job done. The ambiance is nice. As far as taste is concerned, I'd recommend the Tempe Dehli Palace over this place. Regardless, this restaurant is nice and centrally located.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2015-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5JMtqZgprlzJS6rqTB0onQ", "review_id": "ZhOSAz_VBCYJ0e6fnavN-A", "text": "I went for dinner on a Monday night with a business colleague and ordered the snacks appetizer and non-vegetarian dinner.  Overall, everything tasted like dried-out, salty left-overs from the lunch buffet.  The service was also very poor with only one other table of guests in the restaurant.  Our drinks came at the end of the meal after finally getting a hold of our inattentive waiter.  I was here many years ago before they put all of their money into the building.  I guess none of their investment stayed in the quality of the food that I remember.  I sought this place out again while on my business trip, but now I regret it.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 1, "date": "2015-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bkFh_Ul7Bsn06zdBBVTifQ", "review_id": "0svCfz5XArnEBdVSiQjBOQ", "text": "So I have been to this place many times before and I have never been unhappy, but today was a different story... THEY PUT GREEN AND RED BELL PEPPERS IN THE INDIAN FOOD! I couldn't believe it. I love spices and Indian food has a lot of them and they are very tasty, but bell peppers make me nauseous and give me indigestion. They few things that didn't have peppers, like their spinach dish, were oily and not really creamy like they should be. Overall- inauthentic and disappointing. I've never been so full yet so dissatisfied. I told the shift supervisor so hopefully they will fix the bell pepper issue, until then my advise is to go somewhere else. It's not worth the $30 bill.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 1, "date": "2015-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YJTgkdOcjPi33TbLP6F0tg", "review_id": "mzoJW8Gr_bS8AHCrfKZCAw", "text": "Interesting take on chicken tikka masala. I've traveled a lot and probably eaten at 20-30 Indian restaurants in the past few years and this is the brownest chicken tikka I've eaten. The flavor was decent, just not typical chicken tikka. The buffet was small but ok. The tandoori chicken was a bit dry.  The nan was great and fresh but they were slow in bringing more out. \n\nWhy is the Indian food in the greater Phoenix area so mediocre?  \n\nI'll probably be back since it's close to my work but I'm still looking for great Indian food in Phoenix area!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2015-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YJTgkdOcjPi33TbLP6F0tg", "review_id": "Mjr6giiMABYpg2Uej5qnAQ", "text": "Interesting take on chicken tikka masala. I've traveled a lot and probably eaten at 20-30 Indian restaurants in the past few years and this is the brownest chicken tikka I've eaten. The flavor was decent, just not typical chicken tikka. The buffet was small but ok. The tandoori chicken was a bit dry.  The nan was great and fresh but they were slow in bringing more out. \n\nWhy is the Indian food in the greater Phoenix area so mediocre?  \n\nI'll probably be back since it's close to my work but I'm still looking for great Indian food in Phoenix area!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2015-09-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y8cJznzsIn39YM0jkQFhbA", "review_id": "s-5kqv9TZyL5JMD3Ln1HIg", "text": "Three words: chicken tikka masala. I've been to many Indian restaurants before and after eating here and no one even COMPARES to the chicken tikka here. We go for the buffet pretty much only for tikka masala! We ALWAYS receive extraordinary service, and the waiters always bring fresh, hot naan to us within minutes of arriving. ONLY complaint is that when we first started coming here years ago, there was actual cheese in the palak paneer. No more. There also used to be pistachios on the rice dessert. No more. I understand they may be trying to keep the price low, but I'd rather pay a little more and have the palak paneer made correctly. We will keep coming back and driving from Chandler because this place is always on point. Support your local businesses!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2015-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tzVo2p2Tu3Z_qwg75ZVTYw", "review_id": "nravoUKqXOo3AZ4KTXlQow", "text": "They served beer that was expired by 6 months. Always check the date on your beer if you order. They seem to stock old beer. Mediocre food. Service can be better. I came late afternoon that maybe the reason for the bad service. Ambience was good.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 1, "date": "2015-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CSYxRrCXBCL8HudaDCC92A", "review_id": "-gKqcoByDszRYelYhgTw6Q", "text": "I highly recommend coming in for the buffet! It was the bomb! For $9.99 you can try pretty much everything on the menu. It's expensive if you do a la cart items. \n\nService was excellent. Very clean restaurant. The buffet is fresh items. If you feel like anything may have been sitting, they replace it immediately, no questions asked. \n\nMy favorite was the chicken curry and garlic nan. To. Die. For. I'll be going back for sure.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2015-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "59o0SwHLYM4rB_OBS046oQ", "review_id": "AM1bIoRcaPSB1yfFt-J_SA", "text": "Being south asian I always to to at least one restaurant to try their food every time i visit a city.   I was in Scottsdale area and by looking at the reviews I decided to go to Indian Delhi Palace.  \n\nTheir food relative to other south asian restaurants I've been too was very mediocre. We ordered two dishes for dinner (Lamb & Chicken) and they tasted stale. The chicken curry was really salty and reheated from that day's lunch buffet. The lamb tasted so bad that I ended up not eating it. The naans however were good, but then again how can you mess up naan.\n\nOverall I'd say this place has very whitewashed bland south asian food with no flavor. If you go to a lot of south asian restaurants and know what the food should taste like then do not visit this place.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 2, "date": "2015-11-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pxCBt2FM4nc9Vf3-khcAPQ", "review_id": "Fs4-dEy96wuk0hoNyHtERw", "text": "My wife and I (both vegetarians) stopped here at the end of the lunch buffet while traveling through Phoenix. It was a very pleasant surprise. The buffet was divided clearly into vegetarian and meat dishes. Vegetarian items were all familiar but some with unusual labels: saag paneer, \"vegetable fritters\" (pakora), \"yogurt curry\" (aloo korma), dal makhni. The spicing was very mild, as is customary on a buffet, but there were a variety of pickles, chutneys, and salads to create interest. I suspect that seasoning would have been higher on menu orders, but I have always liked to taste the actual ingredients as well as the spices, so I don't believe eating should be a macho competition to see who can make the spiciest food.\n\nStaff were very friendly and pleasant. The buffet is $9.99 per person, so pretty inexpensive for lunch in Phoenix. The neighborhood is a little seedy, and the traffic leaving town (westward) from here was awful, even at 3PM.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2015-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F19Jy66oD4bCpNwZzqamZw", "review_id": "lb4ASAJ_FRr3cb2V2ElqCg", "text": "Very good food. We orders the butter chicken and tandori chicken. Only thing you may consider is to go spicy. I went med and it was not spicy enough for me.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2015-11-22", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "vy0nm2MYGayJ2JcRtfaWxg", "review_id": "hJLbUDc2uw5wqKrB7UbEWQ", "text": "$10 unlimited and quality lunch buffet with fresh naan bread brought to the table. It can't really be beat. What's extra nice is the cleanliness and decor of this restaurant. It feels much fancier than you'd think with their maroon tablecloths and dark wood furniture.  The lunch buffet is very good, it has chicken tandoori and chicken masala, but also had all the regular vegetarian options and good chutneys. Everything was fresh and the servers were really attentive. I'll be back!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2015-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "HzOXWuppsLyjy2iXEuXjRQ", "review_id": "KFMnqwBSRUTEVGT8j0J0-A", "text": "I love the ambiance and think its cool that there is a bar there too.  The owner is very gracious and accomodating.  The food was very fresh and I like spicy...which is how they made the food.  I like the Bollywood videos and the ornaments around the room.  Very comfortable and good food!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2006-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "cxjTpWMPg7u5Bb9OPWqaFw", "review_id": "AhmO1cC-Fbz82lRxQFBI8w", "text": "Our family really enjoys Flavors of India.  The paneer tikka masala is awesome.  I am also a fan of the onion kulcha and poori (bread options that really compliment the meal).  The aloo gobi is quite good too.  But the paneer ticka masala....that's the best. Yum.\n\nI have not cared for the lunch buffet much.  I prefer to order my favorites off the menu.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2008-09-03", "type": "review"}
{"votes": {"funny": 10, "useful": 9, "cool": 10}, "user_id": "ca2Sa9Enqg2GlWFQ95p8bw", "review_id": "HSbZ5ZK4h6upKEfV3vUy4w", "text": "I used to be scared...I used to be petrified.  I was never one to branch out with my variety of cuisine, which meant that I never had Indian food before...until a couple of months ago when I was invited to a dinner party. And at Flavors of India...my Indian Food cherry was broken.\n\nI decided to review this place now...since I have experienced other restaurants since.  I tend to always come back to this location.  The place seems very clean, I love the Bollywood videos that they play, and I love the service.  And I think that they have the best buffet!  \n\nNow, I am really bad at names of the food that I order there (which is why I end up at the buffet...I may not know the names, but I know what I like looks like)\n\nSee me there at lunch real soon :)", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2009-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RE_h-saaso1RXQNGKG-Raw", "review_id": "sUtYfNnwH1EnAGneNXDz6w", "text": "When the boyfriend and I get home after a long, tiring day and we just need to curl up with some comfort food, we invariably agree on chicken tikka masala from Flavors of India. It's the best, and the standard size feeds 2 easily with rice and naan. They used to give me a bit of a hard time for always getting the same thing, but they've let up. To be fair I've only gone there for takeout, but they always have cool Bollywood movies playing in the background.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2010-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cxjTpWMPg7u5Bb9OPWqaFw", "review_id": "6otPKAKkP5KUDHOaHqAccg", "text": "I'm not sure what's going on with Flavors of India.  The last few times we went there, it was mostly empty and it just didn't feel good to eat there.  The food was okay but the experience was not enjoyable. Too bad...we used to enjoy it.  But based on my most recent experiences, I just can't recommend it anymore. :(", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 2, "date": "2010-10-17", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "8-98T_0Z1l9hBYXHfaHFPQ", "review_id": "0HgqQY_UyiGLuHAVs1zd-g", "text": "I don't know what they've done, but this place has SERIOUSLY improved their food over the past year. I was wary to try it again since the first time I went (yes, over a year ago) it was less-than mediocre. I live less than a mile away, was jonesing for indian food one day, and didn't want to drive far. I forced myself to go here and am now completely ecstatic that there's an indian food joint I can walk to, gorge myself, and roll my arse home. \n\nThe menu is standard, but somehow a little better because they offer dishes that have subtle differences. HMMM, let's see. I don't know if i'm going to describe this correctly:\n\nOkay, I'm a vegetarian - DON'T STOP READING THIS, DAMNIT! I know what good food is!\n\nStarting over - I'm a vegetarian, and I eat A LOT of indian food, and I have eaten at a lot of indian food places. I don't claim to be an indian foodie, but I do know that the vegetarian dishes have subtle differences so I think some places omit the dishes that are similar and just hope that people who come in order the thing that's closest to the thing they really wanted. There's one dish I always order - paneer (tikka) masala, that some places don't have so I order the closest thing to it, and of course I can't remember it right now but it's another paneer dish with a tomato base that's similar. The thing that's awesome about this place is that it has BOTH, as well as other dishes that other restaurants sometimes don't put on the menu. You know what I mean?\n\nWho cares if you know what I mean - FOUR STARS!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2010-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WI4DyaHOz9SMhngG83QbNA", "review_id": "1TT9tmtJZX-ZWj8KzNfmrA", "text": "Had friends staying down the street from this place last Fri.   We ordered take out, this was my first time ever ordering Indian for take out. We ordered Chicken tikki masala, paneer tikka masala and aloo matter, all we pipping hot and super yummy, we all ordered med spice and the heat was spot on, made our noses run a little but didn't numb our mouths. The nan was good,  its better in house when its warm still but tasted good. Some of  the appetizers did not travel so well we ordered chicken pakora and it was very odd with strange little pieces of mystery meat with soggy breading. the vegetable pakora was OK and did stay a little crispy and the veg samosas stood up the best of the three and were tasty. All the portions very very generous, we could have split an entry but ended up being pigs and ate it all ourselves. Will make the long drive down there to eat in and get some more super yummy tikka masala sauce .", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2010-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uOdEsOgPW48Ky4j8U8CEcw", "review_id": "4Iud4IVvkiOvjjjlt7oIwA", "text": "Service and Food is R&R!\n\nI make this short and sweet. Lets find the real places in Phoenix and lets support the authentic, creative, and traditional restaurants. \n\nTrue, it feels a little awkward because of the metaphysical transportation from USA to India. After 10min its like you are in India. Cliche, but lets be honest, if you have have been there its kinda the truth. \n\nService: Very approachable, knowledgeable and sincere. The table next to us for some odd reason didnt like the food, she said it was \"too different.\" Uh? Ok..its Indian food! Its meant to be different. Nonetheless, the ?manager? insisted on offering dessert. The patrons denied his generous offer multiply times. GREAT SERVICE!! (Our service was *5stars*)\n\nFood: Sadly, I don't know what I devoured because I arrived late and they just placed the food down as soon as I sat down. That being noted, what ever it was ...it was goood!!!!!  The chicken fell of the bone, the sauces were savory and spicy, and the rice was moist.\n\nWell R&R (Recommend & Return)\n\nR \\_\n\nNOte: Lock your doors, the Flavors is in a exasperated area.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2011-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zKpW4UQ7BYTSWOCVkF7qTg", "review_id": "S1MXzF6f7gOcj2levFm5QA", "text": "Excellent food...nice and spicy (when requested)! We have gone twice and being Indian...I can recommend this place as a good source for a buffet and selection of food. The malai kofta is AMAZING!!!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2011-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "htUqnu_j9CmOqXxilbK4Sg", "review_id": "4fhWBVXsxt0rtuuoIAfQIw", "text": "This restaurant is near our home so we have visited it on quite a few occasions - always for dinner. The food has always been pretty good, though in recent months, we've noticed that the recipes have been substantially improved. We find that we are more frequent diners nowadays.\n\nToday, flavors are more distinct and better balanced. The Vindaloo has has an appropriate tartness against the spice. The tomato-based curries are richer, with a good balance of salt and sweet. We like hot dishes, but usually order them \"medium\" for our friends - and that has worked very well, with everyone enjoying the dishes. \n\nTheir location in a strip mall off 16th street doesn't look like much in the evenings, with all the other businesses closed and standard LED open signs flashing, but inside the restaurant is clean and nicely appointed, though admittedly it can be a little too dim for some folks. We could live without the endless Bollywood clips on the TV screen in the dining room (just the bar would be okay), but they do make for comical dinner conversation on occasion.\n\nService is always genuine, efficient and friendly. Big, cold Indian premium beers are always welcome on a hot Phoenix night and they are served with tall, cold glasses.\n\nTake it from a long-time Phoenix resident that loves Thai, Indian, Cuban and Mexican food -  if you're looking for good Indian food in the Central corridor, try this restaurant for dinner. It doesn't look like much on the outside, but there's always parking and it's very good.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2012-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RE_h-saaso1RXQNGKG-Raw", "review_id": "SQuQB3qoEi5u_JfIg63WjQ", "text": "They've changed their chicken tikka masala recipe at least twice since my original review, and each time I've liked it less. The sauce used to be creamy. Now it looks like there's no cream in it, and it separates easily so the fat floats on the top. I'll have to find another restaurant to sate my chicken tikka cravings.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2012-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uQH9iZ1R8dQstIxYNcix2Q", "review_id": "gjqdFZVqhI86Lhk6xz0nqg", "text": "Have went here for Dinner before, it was okay but not great. Went to lunch buffet and it's terrible.\n\nNot spicy. The dishes taste nothing like they should.\n\nIf you must eat here, the Tandoori Chicken isn't bad.\n\nHowever, if you really like Indian food, stick to Chutneys in Tempe, or the really good Indian Market with a buffet on 7th street near Thomas.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 2, "date": "2012-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "25hEQTBIqvXoJYVPUMRREw", "review_id": "c6c-4qYrQmvp27imAt_THg", "text": "One of the best Indian buffets in the valley.\n\nLove their chicken makhani (butter chicken). It makes an appearance on their buffet table fairly frequently (as much as i love tikka masala, it's a nice change). Their naan, palak paneer, and chana masala are all perfect cooked and seasoned. \n\nService is quick and friendly. One of my favorite spots to go for lunch. Go now:)", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2013-09-01", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "pI8_qiRoAAi_rLhNHh6-Rw", "review_id": "pLkaanHSvM_fHMVA9mOdYw", "text": "Flavors were decent. They had about 7 different tubs of dishes to scoop from and a salad-type bar on the side. All the flavors weren't too different from one another - one more herby or one more spicy. The chicken dishes were well seasoned and relatively moist. They give you naan upon seating and you can ask for more. The naan is plain or... buttery? I typically love love love rice pudding, but this place makes it... interesting. It tasted ok, but it was thick. It had other goodies in it like almonds or something. \n\nStaff was attentive, but don't expect any smiles or warm fuzzy freindly feeling. Also, check your silverware... I changed out my fork 4 times because there was still dried food on it. The last fork I got still had dried food on it... but I was actually able to scrape it off with my napkin for this one. yeah...", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2013-09-07", "type": "review"}
{"votes": {"funny": 9, "useful": 13, "cool": 7}, "user_id": "3FRzcb41y7LYr5yRMQSoqw", "review_id": "txj_a40j7mV6JHKt4M2qPA", "text": "Yesterday was my first time trying Indian food (don't judge meeeee!) and I'm now HOOKED! Anyone who hasn't tried Indian food, or is curious and wants to sample - go here. \n\nThis review is based on the lunch buffet, which beats out Chinese buffets any day of the week. You have a selection of 9-10 choices, plus dessert. The neatest part is the variety of food switches every day, so you're never eating the same thing over and over. Yesterday's buffet consisted of chicken masala (chicken, spices, tomato sauce cooked), daal makhani (lentil soup), bhindi (bombbbb okra!), chicken curry... and a ton of other goodies (dessert was shahi kheer - basmati rice pudding with almond and pistachios). \n\nMy only complaint was the bread, as it felt like it was covered in oil. However, for $11.99 and all you can eat - I don't really care.\n\nSide note: they play this channel on their TV that's an Indian version of MTV - so freaking entertaining.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2013-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gQm2p1gmBPQ4f1sHxgRlbw", "review_id": "CJvA4sIUKFjk1Ji8TbNY1w", "text": "Quality has really gone down the past few years. I've been coming here since the day they opened up in 2003. Please bring back the original cook!!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2013-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bjm0U-K-rb9lKV6Sx-hliA", "review_id": "ZmYdlR0D3a22sVR4Naldow", "text": "Lamb tikki masala and garlic naan are delicious. I try to come at least once every couple weeks for lunch. Great food every time and the owner and his wife are hands on and very kind. Definitely recommend this place.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2013-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZRlEIarl64DYooddYVrodQ", "review_id": "G0ZMNZ6ol82ysqFPhxMMJg", "text": "We went in for lunch today.  Parking lot was full and several people inside -- always a good sign that the food is good.\n\nWas planning on doing the lunch buffet but found out they don't have Chicken Tikka Masala on buffet.   Sad panda.\n\nSo, we ordered Chicken Tikka Masala with some Garlic and Plain naan.  Service was very good.  The plain naan was excellent, while the garlic was a little too garlic for our taste. \n\nThe chicken tikka masala was decent, however it was more of a soupy texture instead of a paste that I'm used to.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2013-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uMcn1U_b4D_u2-1mgeCd_g", "review_id": "xktKeVh0jhRmbqIhVms52A", "text": "Great Indian food here. It's been almost 6 years ago since I've eaten here. Their buffet food never disappoints. Even their gulab jamun (the little donut hole-like dessert) tasted fresh. Unlike the ones I've had before from other Indian restaurant in the valley that was cold and stale. Everything was great!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2013-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4aVaM_5SG6V3uW9bJ5sglA", "review_id": "JEEk3o1O5Pg0rOJBVlma5Q", "text": "The food is pretty tasty, no complaints there.  The atmosphere is quiet and a little awkward at dinner time. Also, I asked for a side of chutney and they charged $3 for a little cup.  It really feels like you are being nickled and dimed. It isn't really a good value either.  I would recommend taking the food to-go or maybe going at lunch.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 2, "date": "2014-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3-BSw8IDiP6UY52mGE9rpQ", "review_id": "Mhbfc4ao5mKA0153Hj3XVA", "text": "The food here is AWESOME!!  The Chicken Curry is especially delicious.  The  staff is very attentive, and the decor is very nice.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2014-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZYukgpD2GE5PZOP4dcdfLQ", "review_id": "2K6m4Gd06Ojwfu-lyB0D2Q", "text": "i like the quality of food here and icome here every 1-2 weeks. My favorite dish is chicken Makhani. chicken Masala and some of the lamb dishes are also worth trying. Good atmosphere and kind owners. downside is that it takes about 20-25 min for food to be served. prices are somewhat high.  did not like their buffet because there is no variety of food.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2014-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4OXb9Ggo3Bg7M_1U2IWFXw", "review_id": "xJCOnKtDw5kGjGOWyzv78A", "text": "This place is a run down dump. I felt like l was going to get a mersa infection just sitting at the table. The food is terrible, even for lndian food. The buffet is over priced. There are some great Indian places in Phoenix and this is not one. You can just tell that they do things as cheap as possible and don't care about quality. My guess is that the chef is mexican and not lndian! Move along.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 1, "date": "2014-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BtwLotZdbWBQ6-dTDIT-Ow", "review_id": "dSY1zwoToJ4vhQd9tcHRdw", "text": "best lunch buffet in town. only $10. my favorite place.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2015-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_GUOd6P6ZJwugRtUV_tdbQ", "review_id": "JvQvpBvMM0Xfmg6WWuFk3A", "text": "Last night 9/19/2015 was the second time I had eaten here. The first time was a long time ago and I remember the food was good, the staff as being a bit rude and the restaurant itself was a bit warm inside.  Last night was wonderful all the way around.  Upon entry we were warmly greeted, exchanged pleasantries and were promptly seated. We got our waters and bread quite quickly and our orders were taken shortly there after. I got the chicken tikka and my partner got the lamb vindaloo we shared some garlic naan. The dining room was not crowded as it was only about 45 minutes to closing time. We received our food in an average amount of time and it was TOTALLY delicious, the portions were large and I have NOTHING negative to say about my most recent visit. In fact it will become a regular in my restaurant rotation due to its incredibly convenient location. Don't pass this place up.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2015-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M-KICWx1RbUlO7unS1fIEw", "review_id": "tui4Tm7xzM-ep00m2LDazg", "text": "Fresh and delicious - very happy to discover this place! We had the chicken tikka masala and aloo gobi. We ordered them mild and they still had a nice kick to it but not too spicy for us. The chicken was moist and nothing was greasy or heavy.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2015-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QYmJhWqj6VVe0_xKkO1xrQ", "review_id": "1bJoQTn-9EdqmSkSmo9dfg", "text": "The bread served was either left overs from other customer or was eaten by some rodent , when we brought this issue to staffs notice ,  The staff was very very rude . when we asked for owner , The owner itself was rude and asked us to never visit the restaurant again .  So be careful what you eat", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 1, "date": "2015-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CuRAwGZuPahJk3TOTBmPCA", "review_id": "SHmRE1n5giGY0QwzptTtWA", "text": "Oh my gosh, I haven't tasted anything this delightful in years. Service was impeccable and friendly. This restaurant is a MUST VISIT!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2015-10-28", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "_8KAa1lhcX0JEmDqvODwFg", "review_id": "t201ln3iiLxgPw50gBqFoA", "text": "i used to eat at this place every month back in 2005-2007, since then they have completely gone down hill. really slow service and the quality has faded, i feel badly i hope they can fix that soon.", "business_id": "vA9aCw2kTgN8p2SLdm2mDA", "stars": 1, "date": "2009-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "F55sgaqHq2KE1LsixSKxAw", "review_id": "L0kWtvfjECN-AQJlNp9iZA", "text": "I think this place closed.", "business_id": "vA9aCw2kTgN8p2SLdm2mDA", "stars": 1, "date": "2012-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FLdun6KWwAh-gC8VHVZGCw", "review_id": "E_OJh4GCOB5FlQyXB3rHeQ", "text": "The mild chicken tika masala was pretty good but not excellent, its sauce more buttery and less creamy and tomatoey than I'd prefer.  \n\nPortions are plentiful.  You'll have leftovers.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2006-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "0bNXP9quoJEgyVZu9ipGgQ", "review_id": "8hilb4JXeicRJX-PyaIZqg", "text": "It's been almost two years since I last visited Star of India, and my absence is due to other reasons and not bec. of the food.  Some good eats I've tried here are the chicken tikka masala, basmati rice, and chicken naan, the latter of which was overflowing with chunks of tender, marinated chicken.  Add a side salad and you've a delicious meal.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 3, "date": "2008-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "7htYqcN-F-c3LwKTEG1Mfg", "review_id": "SX-JbeygQe4iighmh2WQLQ", "text": "Went here for the lunch buffet, which was about $12 a person.  The papadum were nice and light. The pakora were cold and soggy. Of the two chicken dishes in the buffet, I tried the chicken tikka masala which was ok. Instead of having the chicken Korma, I had the vegetable korma which was tasty. My favorite of the vegetable dishes was the chickpea dishes which had a bit of spice to it but was not overwhelming or overly spicy - I would have liked to try a spicy dish. I was disappointed in the sag paneer - usually one of my favorites but hadn't tasted one like this - not sure why I didn't like it as much as  I usually do. It tasted like spinach and a little mint of something like that but couldn't figure out the rest of it.  The other vegetable dish was ok.\n\nA couple of minutes after we sat down freshly cooked Tandori chicken and Nan were brought to the table. Both were tasty. I tried both of the desserts - the galub (i can't remember how to spell the rest of it) and the rice dessert - both were very sweet and tasty. One of us had the mango lassi which was sweet and good.  \n\nOverall the buffet was ok - don't know how long the food was sitting out so I can't comment on that.\n\nI think I would come back for dinner to order from the menu instead of having the buffet again.  I gave three stars more because in comparison to other Chandler restaurants its a bit better than what I've been having here lately - as far as compared to other Indian restaurants I've been to out of state - this was a little disappointing. I'll try something from the menu sometime to see how it compares to the buffet.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 3, "date": "2008-11-29", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "ohRev2g3tvXpV3gBnhC-og", "review_id": "4t1509_UdGZuE9aLdrmMUw", "text": "Well to start  I now have a new favorite east Indian buffet. Went here for lunch today with Rand H. and this place was small comfy and with lots of nice decor. As far as the food goes everything I ate was great. The service was real good as well. Not much more to ask for ,  woo hoo!!! as good as it gets. they should change the name to 5 star of India. yumm yumm yumm!!!!!", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2010-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h2gDiGBhAHBe4rxefiFIAQ", "review_id": "avAB2qMBuFeJbM74DBn9iQ", "text": "Found this restaurant on Yelp tonight and it did not dissapoint. The food was delicious and the service top notch. The atmosphere was lovely.  Definitely will be going again in the very near future to sample more of their menu. Thank you for a great meal.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2010-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DN5GgGgpr4Fy7TFe41QLrw", "review_id": "SE9QYVFbqx6LlstJFKuPqQ", "text": "Great atmosphere.  Great help.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2010-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YPk47NcyWSkk-541OxyzMQ", "review_id": "olmCUqLklK3s0DmfEWOQ1A", "text": "Above average. The Korma and Vindaloo were tasty. We ordered spicy, and boy, it was. Whew. Definately one of the better Indian places in the East Valley. Oh, the staff was friendly but slow.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 3, "date": "2010-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sEURxOp8LQNM_lZ7IlEmUQ", "review_id": "hyGWQ4yk7Kr7dM4f3WrInA", "text": "5 star service, 4.5 star food, overall a super enjoyable experience.  We'll definitely be going back!\n\nMy boyfriend and I went to Star of India for dinner.  I got the chicken tikka masala, while he got the channa masala.  My chicken tikka masala was absolutely perfect, all buttery, with tender chicken and a spiciness that was tasty and not overwhelming.  His channa masala was really good -- he asked for medium spiciness and it was considerably spicier than my mild. \n\nWe ordered a parantha and a naan to go with our entrees. When the very nice owner asked us how our meal was, my boyfriend offhandedly said the parantha was a little different from what he was used to, that it's not as fluffy and tender as parantha from other cultures.  The owner immediately set out to find us a bread we would like, giving us a free order of roti, and free order of rice to pack with my to-go box for my chicken tikka masala.  \n\nThe owner was gracious and eager to please, and really fun to chat with.  That made all the difference, and with the great food, we'll definitely be going back!  \n\np.s. get the gulab jamun -- it's delicious!", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2011-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WrZ5jcP4MKO8oYNqHS6MWw", "review_id": "J0mCQb8vL3BzbYN8fKbvmw", "text": "I tried the Malai Kofta, garlic naan and vegetable biryani. All of these were excellent. The prices are amongst the most economical in Phoenix\nMetropolitan. $8.95 for most curries, only $2.50 for the garlic naan.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2011-09-23", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "ijydPFR9dhpqNst3RQB_IA", "review_id": "cbpUjUyu1KJCW6aCUxbKkQ", "text": "I would eat here again! The prices are very affordable and the food was delicous! We ordered the combo appetizer with was bursting with different flavors and spices. The tandoori chicken was good, but the portion was skimpy and there was more bone than meat. Our lamb saag was awesome! Perfectly cooked lamb that was fork tender and the sauce was yummy. I was so happy they didn't skimp on the meat. Our portion had a lot of tender lamb in it. Best mango lassi I've had in a while. We completed out meal with the gulab jamun. Delicious! I'm not used to it being served cold, but the flavors were spot on. Great service and a fun atmosphere due to the musc played.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2011-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gyff5D1aNOqtGDB-XOz0UQ", "review_id": "Xdt7_sCLOMrqBmco-g9huA", "text": "Our favorite Indian place - nice, simple atmosphere, great Tikamasala, decent prices.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2011-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uQeOiwIoIn7sypJJm27ZjQ", "review_id": "pZcV3LEKEftdFpfRzDFgsg", "text": "Love the buffet, the folks that work there are great, we usually hit this at least once a weekend and our table is always ready and he knows what sort of naan we want. Small but worth it.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2012-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-H7hd6l1GIEyyAWe0uCybA", "review_id": "yV-duLSaFn9bQVNpKYkZmQ", "text": "Wife chose this place and we went late Tuesday (9pm) for dinner after I got out of school.  Owner was attentive and very helpful and helpd us order.  he explained dishes and brought usu a few different breads.  Dishes were VERY colorful, tasty, piping hot.  I asked for spicy and WOW..., on that scale, I should have asked for mild.... Yummy food and Great time.\nthe owner's family children were playing (read: screaming and running around jumping on boothes and staring at us over the wall) the whole dinner, which was mildy annoying in a quaint way..:{\nwe'll be back. maybe once school starts?", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2012-10-17", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "uka4CT7-Jp1lJk-lB1unHw", "review_id": "PYrLX-Rh-qb1GSAKNVhqpA", "text": "I was unaware of this little gem of a restaurant next to Trader Joe's in Ahwatukee, and the only reason I ventured there with my wife was that there was a Groupon deal for it. Thanks Groupon! \n\nHere are a couple of things I thought were worth mentioning about my experience:\n\nFood:\nI had the Chicken Tikka Masala with \"medium\" spice levels, and it did not disappoint. The curry was fragrant, rich and spicy! Just the way it should be. I'd be hard pressed to recommend a better Indian curry to my friends. The garlic naan was also well done and was a decent portion, be it for a slightly exorbitant price (more on that below).\n\nSpice Level:\nSpice levels are more spicy than the the typical Indian buffet, so beware if you have a delicate constitution. My wife was tempted to get \"hot\", but lucky enough she settled for \"medium\". It was just right  for her, and she likes spicy food.\n\nPrice:\nThe meal was a little on the pricey side due to the fact that we had to pay $2 - $5 for rice/bread on top of the entree, as it is not included with it. \n\nOnion Fumes:\nWhile waiting for the food to come out, I started tearing, and started wondering if I was just having a \"moment\". ;) But as it turned out, it was onion fumes wafting into the dining room from the kitchen that were making my eyes water. Yes, the fumes were that strong! Then again, we sitting right by the kitchen door and it was a little stuffy as it was cold outside (winter) and they likely had the heater on. I did cease to notice it once the food came though, because I then started crying tears of joy whilst stuffing my face. Nom nom nom!\n\nConclusion: \nI would likely return, and bring a couple of friends or family members back with me!", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2012-11-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b6CL_FrloEX5BdDE10UlcA", "review_id": "jk_wJP4IBm82eZkphA2Snw", "text": "We love this place! Best naan bread ever and the chicken Makhni is excellent! We normally order our dinner to go but it is also a nice place to eat in, nothing spectacular but cozy and romantiquish... If you are around you should give it a try!", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2013-09-15", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "68sf6hDqko8gb_bRh7KsVA", "review_id": "x8U0IYFeC9zVnZevql_wLQ", "text": "My husband I LOVE this place. Sure, it's not a five star restaurant, but they aren't claiming or trying to be. Their food is very, very good, though. My husband is Indian and has probably tried every Indian joint in the valley and we always end up back here. Their Chicken Muknee and any of the saag dishes are our favorite. The naan is also hot, a little yeasty and chewy- melt in your mouth yummm... \n\nBy the way, if you don't like buttery food, why are you eating Indian cuisine at all?", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2013-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "qRQRrsQ_F1e8KKWZQHLYCA", "review_id": "hibTTjrpJiWA8OFErIaXzA", "text": "Just had them deliver. Very good chicken tikka, very flavorful and I love the garlic naan.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2013-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4CZPRG0edErHIHRxr-Xsog", "review_id": "xroDHfPK2eo5LORK3C1MvA", "text": "Service: A+ came on a Friday night couldn't believe how busy such a small place could be but now I know why. Was brought a drink while we waited for a table staff was happy to see us and very friendly. \n\nAtmosphere: A+ small restaurant but very cozy and authentic the walls are filled with Indian art and the music was authentic and cheerful. \n\nFood: wow! Let me say it again! WOW! We were first brought out a complimentary taco shell looking appetizer with a few sauces it was delicious. I then ordered chicken tikka masala (hot), regular rice, and garlic naan. I think I've found my favorite food of all time. Everything was so hot and delicious I will definitely coming back very soon probably twice a week. I've eaten at a few Indian restaurants most recently the \"curry corner\" and this place is hands down 100% better in every way shape and form. \n\nPrice: extremely reasonable for the quality of food. I heard they even have an all you can eat buffet from 11-2 I will definitely be checking it out soon! \n\nOverall for me it's the best Indian food in phx and most likely all of Arizona if you are over on 40th and chandler blvd GO CHECK IT OUT you will not be disappointed.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2013-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JTz1ccucKPe5g64PZ-gq4g", "review_id": "Ds-iUKgh0nWT5-QjUNvKGg", "text": "We love this place, the food is fantastic. Great spices and good quality food for the price :)", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2013-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M6oU3OBf_E6gqlfkLGlStQ", "review_id": "pDhbCxeqnI8oZlpecvs48Q", "text": "The flavors here are truly great, if you like garlic and spices this is your place.\n\nSo if you have a 2pm business meeting you may want to find something else, but if you want to make your tast buds hit the international disco floor give the lunch buffet a try. There were the usuals, pakoa, aloo tiki, raita, and then mostly common food but well executed.\n\nFor me the winners were the saag, a green spinach based concoction packed with garlic and exotic flavors which may even be healthy. The korma was my other favorite with clunks of veggies paneer and a creamy curry sauce.\n\nThe meal also inclues garlic naan (nice touch), chai tea and desert.  For desert may I recommend the rasmali. a sweet creamy milk sauce with balls of cheese that have the texture and taste of cake.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2013-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "N06HG1iOZlOctvI-5mzj1A", "review_id": "iqkqi2DamHDfYDpF1uGX5A", "text": "The buffet was pretty good, nice selection, though the flavors were a bit understated. I can understand, for a buffet needs to have wide appeal. I just think if people are going to an Indian restaurant they should have a good general idea what they are in for. As such, I would have preferred the food have a bit more of a kick. \n\nService was decent, casual but friendly. Clean, well set table and and nice ambiance. Maybe a good place to take someone experiencing Indian or the first time, but if you are looking for spice like I was, you might be disappointed.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 3, "date": "2013-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hS2oT9lhnFzvuY9EfIi-ww", "review_id": "YgZHXpQogltUxvtXj_aALA", "text": "Super friendly service! The friends we were dining with go here a lot so we were definitely treated very well by the staff. Shrimp tikka masala was delicious! Garlic naan was also great! The veggie samosas were yummy. The cracker and spread that was brought to our table when we arrived was super tasty, but I don't know what it's called.\nAt some point during the meal I swallowed something very sharp. To the point that I went to the bathroom bc I was worried I would have to try and get it out of me. Ha. Needless to say, I did not need to do that. It has now been two whole days an I'm still alive despite sealing a sharp morsel. I'm guessing it was an accidental piece of shrimp tail and not the jagged check chicken bone I thought it was. Ya ya, never mind I was eating a shrimp dish. \n\nI did also try the mutter paneer (sp) and another chicken dish that were both also delicious.  \n\nDespite the swallowed sharp piece, I will be back!", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2014-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mCNDvn_mJotc4Md6wVa25w", "review_id": "5CRjqSbbjQWIxCWnruR39g", "text": "You'll see a lot of different \"Star of India\" restaurants but they're all different. However, this one is the best! It seems like this is a family-owned business and are very friendly. We always order the same things: chicken tikka masala, tandoori chicken, or chicken biryani. Plus their garlic naan is AMAZING and a must have especially when you're eating the chicken tikka masala with a side of rice (if we don't order the chicken biryani).\n\nThe tandoor chicken comes on a big bed of grilled lettuce, onions and a few big pieces of tomatoes which is a necessary component that adds to the perfectly seasoned/grilled chicken.\n\nTheir chicken biryani gives other biryani's a run for its money. With raisins, cashews, chicken and other herbs/spices, it's a great dish even to eat alone!", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2014-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OC7uIqAI6K6FhKNR4zHutA", "review_id": "oGvircEk9EU0UigFM4XmuA", "text": "This has to be the best Indian food I've found in Az!!! The Tandoori chicken was incredible as was the bit of lamb korma and chicken tikka masala that others in my party ordered and I tried. The staff was also competent and very understanding, (seeing as how a member of my party was almost an hour late). I really enjoyed my meal at Star of India and I plan to return, repeatedly!!!!", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2014-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GAeWcPZN7Upsjtf6RTgm-g", "review_id": "a_iQOUq-JpsHhjVwCZ4mWg", "text": "This place is excellent!  I come here every time i'm in town for business.  Love it!!", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2014-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "4VfhBQmNRQVuJxG9WWHIig", "review_id": "lyUxvfpqb5pEgSO0g6Eajg", "text": "Great place and amazing good! I ordered take out from here twice as I work very close by and they gave me a great deal and even delivered food to my work! Tried the chicken tikka masala, rice, and garlic naan and it was to die for! Unlike any other Indian good I've had. Truly authentic and I asked for extra extra spicy and boy was my mouth on fire! It was delish!", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2014-11-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Mb0psF4WQF7gZSuZafVr-g", "review_id": "hzR0hURTm6b_ceKb0jF4vg", "text": "We bought a restaurant.com voucher.  It was good only for menu items (not the buffet).\n\nThe ambiance is sort of divey.  Clean, but shabby.  My wife got a buffet, I ordered curry off the menu.  They curry was fine.  Nothing special, but fine.  I ordered \"medium\" hot, but it was't hot at all.  Which is surprising because Indian food can be very spicy.  My wife snuck a few buffet bites to me (technically not allowed, but we didn't abuse it...just a taste).  The items were OK.  Again, nothing special.  But fine.\n\nI can't say I'd come back because I know of at least two other Indian restaurants that have tastier food (though one is much pricier!).  But the food is not bad.  You could do much worse.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 3, "date": "2014-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gI4K9HiRGqsWRnpQ5x5F-A", "review_id": "EcqoU8-6QMtx7WhR4xrf6A", "text": "First time here for me and one of several times for my wife. We ordered the chicken tikka masala and another dish with chicken and spinach along with a little dessert at the end. Our senses were poised for a good time as we approached the restaurant. The quality of the food did not let us down. It was perfectly spiced and seasoned and gave the impression of a carefully and skillfully prepared meal. My wife was not very fond of the rice pudding, representing an area of compromise between us as I differ. Upon noticing that my spoon was now invading her cup of rice pudding, the owner provided my wife with two other alternatives to sweeten her pallette. My wife and I spent a nice weekday dinner escape and found quality food, service and care for us as customers all for what \"the average Joe\" can expect to spend at a high volume and taste deficient place like Applebee's. That's why I'll be back to the Star of India and I may yet again have two servings of rice pudding if my wife allows me.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2015-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ufQ5hbXSfhethWGDxaVQgw", "review_id": "Zxw0S29oZxyolBRfrvMYZg", "text": "I like this place a lot and they offer take out if you just want to pick up food and go home to eat. I always get the chicken makhani and my husband gets lamb curry... and garlic naan (so good you should get it!) Every time the food doesn't disappoint. The decor leaves much to be desired but I could care less about how the place looks as long as its clean and yummy. The people that work there are always very nice and welcoming. We'll continue to go there in the future.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2015-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gdHs2LPhNi7pfCmwCIDbDA", "review_id": "qnw7M_MDUoGvjDbBSzoTqw", "text": "This was my first time trying this restaurant. I ordered takeout I had the Shrimp Curry, rice and garlic naan. It was very delicious. I had the curry done with medium spice level. Just the right kick! Who ever the male was the brought out my food, was very nice. I will definitely be back!", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2015-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZhnXBRziSyXZHG5B3GebcA", "review_id": "c9gdUEivBtkBqanMGGR5jw", "text": "Love this place! One of the best Indian restaurants in Phoenix! Aloo Gobi, saag, chicken korma, and their mint chutney are my favorites. Lunch buffet is very good. I usually do take out. Dine-in service is also pleasant.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2015-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hw-9I3-vVeiGHQAOo0jWFA", "review_id": "-P3SH7R2npSRYaeoMq8ZJQ", "text": "The food is fairly good.  That's why it's such a shame that the service sucks!  Every time I have gone there, they take forever to bring you water, take your order, bring out food, everything - even when you are the only people in the entire place.  They are always unfriendly.  Out order has been incorrect on a couple occasions.  I really wish they had better service.  I just won't go there anymore because of that.", "business_id": "H-99nG_KfynWPXh84TKj8A", "stars": 2, "date": "2009-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LHQ2fuC2RDS-Md_dN2O1IQ", "review_id": "bhD3fgKbl9rKYlKCJ7MjXQ", "text": "I know this place a little too well. Hmm lets see, most Indian ocassions I attend get their food catered by Copper Ketle. So, over the course of a couple of years, I've eaten this food over 30-40 times. That's a lot.\n\nThe naan and chicken is good. This is the staple of good Indian food. If you can't do good naan and tandoori chicken, you fail as an Indian restaurant. They also have pretty good qorma, tikka, etc. Biryani is hit or miss, its never terrible, but its never 5-star. \n\nIf you eat the food at a catered event it is very hit or miss, sometimes the meat in the qorma is just BAD. Either its too fatty, or too boney, or not enough meat. At the restaurant its a much different experience.\n\nThe only other issue that keeps this from getting 5-stars is the cleanliness. I hate to bring this up, but there are rumors that the restaurant shut down due to food inspection (and they only catered until the restaurant reopened). i'm not picky about cleanliness, as long as i don't find out about it i don't care, but this is somewhat troublesome.", "business_id": "H-99nG_KfynWPXh84TKj8A", "stars": 4, "date": "2010-11-06", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 6}, "user_id": "4UUIpbOTPmu43wuC2aSGkg", "review_id": "gE7pm3y0HwYjtWBpJBniLg", "text": "I just recently had my fourth visit to India Gate for the lunch buffet. I must say the place has grown on me. The selection is large and the food is hot and fresh. The lineup changes often for the buffet but usually consists of a couple curries, masala, a chickpea dish and maybe some goat (which I have yet to try)and rice pudding for dessert.  Service isn't always very friendly or outgoing, but it's all very functional and efficient. Naan is refilled quickly and regularly as are the drinks. \nTake time to enjoy the jamming Indian music that is played. You might catch yourself doing some toe tapping. India Gate is a great place for lunch if you want to give Indian cuisine a try or if you're a regular. I highly recommend.", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 4, "date": "2008-09-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "sqLsoqm3lNxvfkOQ_wXucw", "review_id": "yNKx_GivdTdTdpM87mxb8Q", "text": "I think this is the worst Indian food I've ever had. Went in there last Wednesday and we were the only people. I should have taken that as a cosmic sign from the universe and back out the door but alas, I decided to go against my woman's intuition and gave it a try. The food looked like they were cooked around Valentine's. The taste wasn't much better. It didn't even taste like Indian in any sense of the word. To add to that, the staff were strangely enamored with my party. It felt like they were literally hovering around our table, eyes wide and beetle-like. I was actually pretty scared now that I think about it. I just smiled and gulped down the meal as quickly as I could and we high-tailed it out of there.", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 1, "date": "2008-10-17", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 1}, "user_id": "mjP_3XwUXdptvOpQd0OjBw", "review_id": "JgjNzfbfZOVZmlfxnPXNqA", "text": "This place is good for a quick scoff and run. The food is pretty decent (the Chicken Tikka Masala has never let me down here) although their onion Bhajis need some work and the service is usually prompt and efficient. Don't come for atmosphere though, talk about over lit! It's like eating under the spotlights of an evening sports event.", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 3, "date": "2008-10-18", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "GkWuTgewni9bzPM4HUCO-g", "review_id": "JxFouJfIqXV22jmwMlg5Ig", "text": "In Phoenix, there are essentially 3 types of Indian restaurants. None of the restaurants in the valley can compare to good ones in real cities but there are some good ones: Royal Taj, Guru Palace, Dehli Palace. Then there are tolerable ones: India Palace, Tandoori Times, Indian Paradise and then there is everything else (places you shouldn't go to).  India Gate is one of these places.\n\nI'm Indian and we tend to be picky about which Indian restaurants we eat at. Just like you wont find a Sicilian at the Olive Garden, yoy won't find a Desi at India Gate unless they work at Intel and are too lazy to drive to a decent restaurant.", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 2, "date": "2008-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mD585hyIrXDZPz8wFAvY-g", "review_id": "M7NQ_LAvZ0EZ8SJzFsv2Iw", "text": "I actually really enjoy this place, and I'm kind of a brat about Indian food. The food isn't the best ever, by any means, but it's always been pretty damn good. The service has always been attentive, friendly and lighthearted- they always make sure that we have a good time. I've never been to their buffet (buffets make me nervous at restaurants where that's not ALL that they do) so I can't comment on the quality there, but my dinners have always seemed fresh and high quality. The ambience is nice and I, personally, found the lighting to be at a nice dim level. The price is good too. \nA great place to take first timers who are afraid of Indian food.", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 4, "date": "2008-11-28", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "1IF1mrKtZqbkfkYGOTy8sg", "review_id": "PUH1r2QDwweFyGggEC4kLg", "text": "Very good food, great service.", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 4, "date": "2009-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nMwgC0DuMsBR0V5v4-J8wg", "review_id": "D005iRoxVXwQg5jU4FbmcQ", "text": "I'm still on a buffet binge and Indian food sounded like a nice change of pace.  After driving around \"the hood\" aka the 24th St. and Thomas area after a meeting today, I was unable to find a suitable buffet.  So, I headed back to Chandler.  I thought I remembered driving by an Indian restaurant on Chandler Blvd. at one point and was pleasantly surprised when I found India Gate.\n\nThe atmosphere is sort of cozy ethnic,and  reminds me of the Bay Area .  I was seated quickly and I thought the service was friendly considering the language barrier.  I was impressed by the selections on the lunch buffet and thoroughly enjoyed everything I tried.  The food was hot, fresh and with what appeared to be good quality meat (tried lamb curry and chicken vindaloo) and the heat factor was moderate.  The best part about the meal with the garlic naan....pure carb heaven.   It's $9.99 which is somewhat higher than some other buffets at lunch, but I felt the overall experience was well worth it.", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 4, "date": "2009-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YPk47NcyWSkk-541OxyzMQ", "review_id": "lO1q6yWiwRPHIfUodyxYmQ", "text": "Unfortunately, the trip to India gate restaurant in chandler was a waste of time. The only good thing was that we had a buy one get one free coupon. The staff stood at the bar and stared the entire meal. They even brought us items off of the buffet... and we didn't order the buffet. i expected my food to be freshly prepared... all of it. even the naan. Maybe we hit them on a bad night. None-the-less, we wont be back.", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 1, "date": "2010-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LHQ2fuC2RDS-Md_dN2O1IQ", "review_id": "KKN2HO0yVwvC6iuDcmRHHw", "text": "This is like the 4th Indian food review I'm writing in one night...So, I'll make a rubric:\n\nfor the buffet:\nNaan: indian food staple - 5 star\nTandoori chicken: another indian food staple - 5 star\ncurry selection: bleh, i'm a little picky, it was a decent selection -3 star\ndesserts: decent selection, gulab jamun was good, not a fan of the other stuff - 4star\nservice: good\n\nby the way, i just made the cardinal sin of referring to curry as 'curry'. there is no such thing. qorma, tikka, salan, etc are all your 'curry' dishes, but they are all very different and using those words makes it much more apparent as to what you can expect from the sauce.\n\ndecent indian food if you're in AZ. the search continues for some indian food that compares to the stuff you get in cali.", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 4, "date": "2010-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8T0evnkvRaTomru7ghPGeg", "review_id": "g9IBBdlaiScPoPKMt13O7A", "text": "Indian food.\n\nLunch Buffet.\n\nRice pudding.\n\nNuff said.", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 4, "date": "2012-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uZG-IiG2fE7LSoEtlWp2Sw", "review_id": "Erf3-foWTX1nBAMq6AOZqA", "text": "Go here for sure!\n\nIf you like Indian food then India Gate in Chandler is a sure stop. They have a daily lunch buffet and dinner buffet on the weekend. They also provide a menu from which to order.\n\nMy husband and I love to eat here ...we usually opt for the dinner buffet as it makes for an instant dinner and it is very reasonably priced. Also the food is really flavorful and delicious!\n\nThe always have a variety of non-vegetarian and vegetarian dishes available which is really convenient as I lean towards a vegetarian diet whenever I have the option. My husband - a born carnivore - prefers the complete opposite.\n\nThe service has always been very apt and we have only had good experiences at this restaurant. I know that another India Gate was planned to open at the corner of Higley and Baseline Rd.", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 5, "date": "2012-09-23", "type": "review"}
