{"votes": {"funny": 1, "useful": 9, "cool": 0}, "user_id": "27aGnUabXY23OH5oilHe7g", "review_id": "TcOyTcILBOGss0oieOIPVA", "text": "Well after many problems with this office, I have now been \"dismissed\" from the practice with the reason being \"a recent communication through their patient portal\"\n\nLet me tell you what the communication was about.\n\n I had a full physical with PA. Christopher Jenny. During which I told him that the Ambien he had previously prescribed caused a \"zombie like\" feeling the next morning. I take care of my 11 month old on the regular by myself, and do not want to be in any kind of \"off\" mental state. This was a lengthy discussion about the Ambien, during which I told him I did not want to take it anymore, and asked if we could peruse different options, that would not have such a lingering side effect, as I did have trouble sleeping. He replied, to take more of my prescribed benzodiazapam to help fall asleep as needed, and to follow up if I needed something else.\n\nAbout a week passed and I messaged him via their patient portal. Stating my concern that I was using too much of my benzo, and that I would need something else, or more to compensate for my lack of sleep. His response almost 48 hours later (even though their website clearly states that messages would be returned within 24 hours) informed me that he had called in a prescription of Ambien for me at my local pharmacy. Ok....did I imagine that whole appointment....and conversation about how I DON'T WANT TO BE ON AMBIEN.\n\nWell in response I expressed my concern over the lack of note taking and listening/attentiveness during my last appointment and that I was concerned about that. It is a little disheartening to learn the person who is supposed to be caring for your well being obviously had no idea,  or didn't care enough to look at my chart or even take notes in the first place. I am an EMT, i know the importance of patient history, and it is clear that Carolina Family Healthcare has zero concept of that.\n\nI was also approached during my last visit about my negative review about the practice, The office manager asked me to stay after my appointment to talk. I explained that everything I wrote in my previous review I still felt true, and that the reason I even came back after they screwed up one of my wife's appointments, as well as scheduling my then 6 month old while the office was at lunch leaving us standing in the rain, was to give them a second chance.\n\nWell it wasn't until I removed my more positive re-review of the practice after my terrible experience with PA Jenny that I received my certified letter informing me that I would no longer be treated at their practice. The kick is that it was signed by Dr. Kanelos, who never even had talked to me or approached me about anything. I have never even seen the man in real life, but he dismissed me from the practice. I believe this has a lot to do with my Yelp review. Although I may be harsh with my reviews, I tell the truth, and have not lied about a single thing written here. \n\nAMA guidelines establish and I quote \"Discontinuing patient-provider relationships should be undertaken only after a serious attempt has been made to clarify and understand the expectations and concerns of all involved parties.\"\n\nThis NEVER HAPPENED, or even close. Again proof that this office JUST REALLY DOESN'T CARE.\n\nI will spread the word of the complete lack of professionalism, as well as the dismissal based on a yelp review. I do not believe questioning why I was prescribed Ambien, after telling them I don't want to take it would get me dismissed during the middle of a new prescription plan, leaving me to find a brand new doctor and office to try and continue what has been prescribed. \n\nGood luck dealing with this office, and good riddance. They lost 3 patients because of this already within my household and as many more as I can spread the word to.", "business_id": "2yBBmcVEbhrGrk-hAUAfJg", "stars": 1, "date": "2013-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VkgLupJTf7AMBHfVYFblWQ", "review_id": "uUaq4_hH71Z6_zerWZ8PBg", "text": "The bagels was nice but I was the only one in there and I asked for a toasted gable with cream cheese and lox. I got back to my office and the bagel was not toasted. How hard is it to get that right when its the only think i ordered and the pace was empty?  Wish they also carried sable . The staff or lady was nice, I just really wanted a toasted bagel since I don't have them very often", "business_id": "Gw5POFxBRoJxN_ZYhk6lgQ", "stars": 2, "date": "2015-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "afTF61m7-hcOWAZ-FXc86Q", "review_id": "gvzsobteZDUwzZBTdfYFZA", "text": "Loved this place.  It isn't the nicest/cleanest place in Charlotte, but it the best bang for your buck.  I love hot dogs and they know how to get it done!! These dogs are delicious!  The green dog is so special because it is so simple.  A long time tradition, this greek owned hot dog joint knows what they are selling.  Give it a try for an el cheapo luncho.. Trust me.\n\nEnjoy.\n\n-Ian M.", "business_id": "LT0AgHTpDifuHSXgyLmJwg", "stars": 4, "date": "2010-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Ar0ANKWO6J_vrq_edLd8Sw", "review_id": "mHo7_zQgqAhJnLbkjf2AbQ", "text": "My wife and I went for our anniversary the year before last, but as other reviewers have stated, I remember the experience like it was yesterday.  For a proper experience be prepared to pay in excess of $200 per person for the entrees and wine pairing.  My wife and I opted for the Chef's tasting menu, which if memory serves me correct was 9 courses.  I highly recommend this choice, what is an extra $20 per person when you are already spending so much?  It really is about the experience... and Ellen and company make it an excellent, nay, perfect experience!", "business_id": "USdRzNk14UdjZWFgBJb0wA", "stars": 5, "date": "2012-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I1WILQ2Ok1U8igHUE9iIdQ", "review_id": "UDtPaYpLHHZe5d0Wn_kJEQ", "text": "Live across the st quite literally.  Great neighborhood place with standard predictable pub fare.  Quite busy during lunch which is surprising since it is a bit more of a walk than other Uptown restaurants.  Service was prompt, can't go wrong with a burger, salad, or any of the sides.", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 3, "date": "2010-11-30", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "fW0eVXKzwg8Bgbl2AJDEjg", "review_id": "UYy-tYkVF2dMUNyNO08ptw", "text": "This is our neighborhood tavern and I love taking out-of-town guests here.  The food is great and has a homestyle quality.  Our favorites are the fried pickles app, Beef Stroganoff and \"What it Is\" (a nicely spiced chicken in a Cajun cream sauce over Rotini).  It's a feel-good place that definitely notices you when you walk in and remembers you when you come back.  We love the bartenders...nothing like having your favorite drink poured and ready for you AS you settle into your barstool!  And...they carry Gentleman Jack : )", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 5, "date": "2013-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UpdAuxn_6oxYpSsMowmgbA", "review_id": "GBHR1_Cqb-VYQGILg6SCtw", "text": "I was with a group of 4 and we ended up at this location right before closing. The staff was very nice even though we showed up about 10 minutes before closing. We were with a lady who lived in Charlotte for a long time. She insisted we must have the sweet tea...makes sense because sweet tea in the real South is what I call diabetic coma sweet and just how I like it. The sweet tea did NOT disappoint...matter if fact I drank ALOT of it. We joked with the lady that she should just leave the pitcher. Lol. She thought we were crazy...we were...crazy for sweet tea \nFor my actual food I had the original pita burger...a burger served in a pita with some kind of greekish sauce (I think). What ever kind of sauce it was it was good. The fries that came with it were just basic and seasoned with salt. Maybe seasoning salt would add a little flair and taste. The onion rings were cheap and just okay. To me they taste as if they didn't have any seasoning. \n\nOverall we received exceptional service, especially since we came before closing, good food at a great price, and awesome sweet tea!", "business_id": "ASwN3Ih0Eh1oH0npLbzVjA", "stars": 4, "date": "2013-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6wrnG5setc3GYFiKrxl3Hw", "review_id": "llR_sCMBA3zM858Gzehjvw", "text": "When I first moved to Charlotte in 1996 Morton's was the best restaurant in town.  Since then alot more restaurants have opened up.  I no longer live in Charlotte and I have ate at other Morton's but the Charlotte one is still the best.\n\nI am not really sure what sets it apart.  No matter what city I am in Morton's is always the best place for Steak.  I have been to other places like the Palm (in Charlotte and NY) and I always feel rushed. Morton's makes dining out an experience and it is always fun. The menu presentation is always a  highlight.  \n\nI once had a Christmas party for my team in one of the rooms. We had a great time and the staff treated us very well.\n\nDo not fall into the trap of ordering the dessert before you get dinner.   This is a rookie mistake.   If you want dessert after your meal there are still plenty of options and I think they are better than the warm Godiva popup that is suggested at the begining of the meal.", "business_id": "Lt9o2RmacVY2L-IWLA8uTg", "stars": 5, "date": "2007-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "jvpd48tfHfatu3Ttc5DuEg", "review_id": "qEUiuygl6WZVeQolDm0RTA", "text": "I love a good dog.  Matt's Chicago dogs always look and taste very fresh. They have a broad variety of sandwiches, burgers, etc. but I only go for the hot dogs. Pleasant setting by an artsy greenbelt/park tucked between bldgs in Uptown. I make a point to have lunch there on my fairly frequent visits to Charlotte.", "business_id": "gpCtDCSXIoQx70cq9itfNA", "stars": 4, "date": "2009-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lDf5IrZf_jTdaz_JRfHgbw", "review_id": "Uy5DSG__QcaWbEquRAAftQ", "text": "I love hot dogs but I don't eat them very often.  So when I do splurge for one I want it to be goooood.\n\nThis place is right across the street from the Charlotte Convention Center.  We walked in right at Noon.  The line was almost out the door but moved quickly.  You order at the register and they give you a number and bring your food out to you.\n\nOur \"dogs\" which were Carolina style (mustard, chili and slaw) were promptly delivered to the table.  The buns were perfectly steamed (that is so important).  Chili was just right !!!!   The slaw was just a bit too mayonnaise for me but it was good.  We chose the fresh cut fries (just like Five Guys).  Hot and delicious.\n\nThis place was a home run !!!  Many hot dog and burger choices.    They even gave us a free refill on our sweet tea !", "business_id": "gpCtDCSXIoQx70cq9itfNA", "stars": 5, "date": "2015-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kDYpTc-yc8UAxCs_LhX1yA", "review_id": "3M-AOizQ3hTd824quPFuaQ", "text": "My girlfriend and I came to the Blumenthal Performing Arts Center (shamefully) for the first time last night to see Traces, a new show that came in from NYC. As a snooty New Yorker, I always thumb my nose at what Charlotte has to offer in a cultural sense--which is normally dumb. Yet again, I've been proven wrong. \n\nThe Blumenthal Center is awesome: modern, new, clean--just a really awesome performance space. Honestly, with the exception of its size, it's pretty much identical to any stage or symphony hall in a bigger city. There's also nice bars and concessions, so it really does have a great feel. We'll definitely be going back for future performances. \n\nBe sure to get there on the early side, though: the entrance area can get a little backed up pre-show (understandably).", "business_id": "IFwRwGoz4B7glSzA84NWcg", "stars": 3, "date": "2008-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BxM2sc176XP7Qz8avM0iSQ", "review_id": "U3l9GRkrI_SSGPykJ-2y7g", "text": "Have been to Ri Ra's a few times now and the food has been great. The roof patio is awesome when the weather is nice, I love all the wood and pub feel of the place.  I haven't gone for just drinks yet when it's busy, but I have the feeling it's a good vibe. Great burgers and sandwiches!", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 4, "date": "2010-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bIOg3bUfk_2NfjhdPV6YZg", "review_id": "tK1O2ZcdmUfdS6K6NZZqjw", "text": "Just average unfortunately.  The good:  My drink...dark and stormy is going to be my new standby.  The mediocre:  Everything else.\n\nBurger was just so so as were the fries.  The burger was the 704...I honestly can't remember if It even came w/ the pickle chips.  The really really low point of the meal was the desert. The bread pudding was ice cold and hard as a rock. It did come smothered with a caramel sauce, but that couldn't save it.  When asked how our food was I was honest and could tell the waiter was taken aback. I mean seriously, don't ask me if you don't wanna know.  I was polite about it, but said that the dessert was just average.  And questioned why it was cold.  Bread pudding is always warm no?  He also got docked a few points for twice trying to take my plate while I still had more then half of my food left.  He actually removed my girlfriend's drink while she was still working on it!  \n\nIt was nice to have a late night eating option in uptown, but unless someone else wants to go I won't be back.", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 2, "date": "2014-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6YGJZN-unDth3y_Kf7dwOg", "review_id": "azj6RsQBNEPHgwAmww3G3w", "text": "It is my opinion there are no good Chinese restaurants Uptown, and Soho Bistro continues to prove me right.\n\nI have been here two or three times now, and I tend to order the more \"authentic,\" or less popular items such as the beef noodle soup, Japanese ramen, and they have both let me down.\n\nAlso, whenever I come here for dinner I am literally the only customer in the dining area. I think that Soho Bistro must really be only a lunch place.", "business_id": "rT-iPtIXMKj3dTcl87lbOw", "stars": 2, "date": "2012-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Vtun-rLOZBnfQWqcnBxtOA", "review_id": "KiNd3jxn04LAUq440p7iCQ", "text": "I had some time to kill this afternoon and was in the Downtown area looking for some lunch.  I was planning to catch a movie at the Epicenter and wanted some grup nearby.  It was a toss-up between Hooters and Champions and since I'd never been to Champions I decided to give it a try......\n\nWhen I first entered the place I stood by the hostess booth for about 5 minutes and nobody came to greet me or show me to a table...... or anything.  Then, some more patrons arrived and were waiting in line behind me.  This is when a waitress who was taking orders at a nearby table told is we could sit wherever we wanted so I decided to sit downstairs since the upstairs was crowded with kids.  So I make my way downstairs and sit a a table for about 5 minutes and no one notices I'm there.......  So I make my way over to the other side of the room and sit at a booth literally 3 feet from the bar and no one notices me........  The guy that was waiting on the booths was busy watching a college football game with some patrons..... So I get up and sit at the bar where the bartender quickly got my drink and took my order.  I got the classic burger with bacon, lettuce and tomato along with a side of fries.\n\nThe food came out fairly quickly.  The burger was very good!!  And so were the fries.  I really have no regrets about the food or the bartender, but the place is kind of dark and relaly is a '90s relic, I mean, they have a mural of LJ with David Robinson and BJ Armstrong among others.......  I understand having LJ on there but Robinson?  BJ?  Shouldn't Kemba and Big Al be on there?\n\nOh well, I thought the bill was fair.  I think it was $10 and change for a very good burger and fries with a pepsi and refill.\n\nI might visit again if I'm in the area and want a good burger, but I'd also like to see what else is out here.\n\nHappy Yelping!!", "business_id": "vIXUw1cLG84-m8LzOg3f-w", "stars": 3, "date": "2014-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "K6QnU0X3fA11DshHMn_Xqw", "review_id": "ih3CxJWTJbXgdLSaGGyA1g", "text": "We looked up Japanese and nearby for something different and I have to say, we were blown away! The food was amazing, service was courteous and very quick and friendly, something that we did not see at our normal Japanese restaurant which is why we decided to change.  The food was spectacular, the Playboy roll was out of this world and was so good, my entire family has a new roll.  I am half Korean so when I ordered the spicy Bulgogi, the meat was not the normal cheap and fatty stringy meat you see at many Korean restaurants but were tender and chunky high quality beef with a great but not too spicy marinade that went far for taste yet was still very hearty and savory.  The vegetable Tempura appetizer was very crispy and not greasy with great flavor.  Again, the magic is the high quality of ingredients.  This is now our new favorite Japanese Restaurant.", "business_id": "4glD2-evDFddHjQaEVpCPQ", "stars": 5, "date": "2013-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pQlaNZ-qw9532cTokxMvRw", "review_id": "O_WYER9N8jGboCVx8-Iurw", "text": "Stopped by here during a recent swing through Charlotte on biz. I was looking for an relaxed \"Pub-food-plus\" type of joint with good beer and in Rock Bottom, I found it. \n\nThe bar staff was helpful and generous with samples from their 8ish original beers. The Brown Ale is delicious (and award winning) and my favorite of the group.\n\nWhile Rock Bottom features beer, they hang their hat on food. The nachos were loaded with fixin's, and the chili is chunky and decidedly above-average. \n\nIt's a relaxed, inviting and warm destination for anyone looking for an afterwork drink or evening out.", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 4, "date": "2008-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vE4TIv-AEsFalZ4faTRH-g", "review_id": "Dch3092qfBR0gJb53SEtzw", "text": "A friend and I had dinner at Rock Bottom on a Saturday evening prior to attending an event at Spirit Square.  The bright red signage makes it easy to spot (we parked at the 7th St garage and it was a short walk).  Surprisingly when we arrived at 5:45, there was already a 30 minute wait (Bobcats game, Panthers game tomorrow, a few other \"events\" in addition to the small venue concert that we were going to were going on).  But true to what the hostess said, exactly 30 minutes later our buzzer buzzed.  \n\nLovely restaurant, although very dark.  And when walking to the restroom, I though I was being led out into an alley, it's a hike.  Wide selection of menu items, it was hard to decide what to get.  Comfy seating. \n\nWe decided on the Jalapeno Spinach Cheese Dip which is served with tortillas to start with.  It was DELICIOUS.  Creamy and cheesy, the tortilla chips held up to dipping without breaking and they weren't overly salted.  The dip had a little bit of a kick to it without being overwhelming.  Very good start.\n\nI ordered the 2:00 am burger, which is a burger topped with a fried egg, cheese and bacon, with a hashbrown underneath and mac n' cheese as a side (mac n' cheese is an upgrade from the fries side, so you'll be charged a buck for this - it says it clearly on the menu, so no big...).  The burger was meh - not bad by any means, but lacking flavor.  I ended up asking for some ketchup to try and do something to it.  The bun held up well to all of the toppings though, so I didn't even up with a soggy mess on my plate that I would need to eat with a knife and fork, so points for that.  The mac n' cheese was very good.  Nothing fancy, but well done.  \n\nThe food was more of a 3.5, but our waitress was amazing, great service even with a packed house, so I will go with a 4.  If another Spirit Square event comes up, I would definitely eat here again.", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 4, "date": "2012-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "CE-qyoF0U-CrdIoM9uQzig", "review_id": "CAPfWe1tkeLHq4C1Zruxrw", "text": "After an ACN convention our team went to this brewery to celebrate for dinner... We have a pretty large group about 40+ and was seated at different tables. Upon closing  he tabs, Andrea with management decided to call the NCPD because she couldn't manage her host  to close out all the tabs before we had to leave and there were one or two open tabs left. The police informed us about the situation and wouldn't allow the rest of the group to leave until the other tabs were paid and closed out. \nAfter soaking with Andrea the \"manager\" who couldn't manage her host to close out the checks beforehand... First they said one of the table didn't pay for the food and after an hour of deliberating with the cops they figured the table that left already paid for their food but management is now stating the drinks have not been paid for. \n  I have never experienced such incompetence when it comes to dealing directly with your customers about closing out tabs for large parties. Andrea the manager could have approached one of us to resolve this matter before calling the cops... Seriously don't these officers have something else better to do instead of dealing with a problem or miscommunication like this? What kind of manager would do that specially of there is still a large group left behind even though some table have left already to head back to their hotels after a long day of convention... \nIn my opinion this is just plain poor management and my group were 95% Japanese from Japan. This was a very poor impression by getting the cops involved and not being able to handle this while my group was still in the restaurant and the cops informing my group that we would be all going to jail if a $120 tab was not paid. \nPointers for Andrea the \"manager\" communicate directly with your clients about open tabs left before calling the cops. Learn how to manage the floor to close out the bill since everyone at the table is no longer ordering. And last calling the cops to resolve issues you should handle yourself should be your last resort if the group left the restaurant already. \nSeriously, these were our VIP Japanese colleagues and we did not come to Charlotte North Carolina to get a free meal... There are no free meals in America Andrea! \nAnd if you fear about losing your job because you couldn't manage the floor to close out tabs... Then you don't belong in management! \nWe will never come back here for any meals on our next convention and maybe be corporate will not care about it... Maybe they will....\nBottom line is #Rockbottombrewery will never have any of my business or my colleagues business of patronism ever again when we come back to Charlotte, NC ever! \nI wouldn't even give this place a star for this reason!", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 1, "date": "2015-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gVGu5DHk5iI4CQ2tX7ka6A", "review_id": "aUSCK41IThAT-eE_Hly7yg", "text": "A great visit and Very educational for me, after 30 years of wearing glasses, this doctor helped me to really understand the options available to me with today's technology", "business_id": "3agV-iW8yukcXpbHom3p3Q", "stars": 5, "date": "2013-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "whKpnugMnWTz3UjlrN71yg", "review_id": "w4lHYVdDgZGjKdVx6KcciA", "text": "Oh Presto...how I've driven by you for 3 years and never popped in. Well thanks to a restaurant.com gift certificate we checked it out recently. First impression...where are the people? Granted it was a Monday night, so I let it be. We sat upstairs. Service was good, but my food was just ok. \n\nOrdered the Chicken Martini, which was described as chicken w/mashed potatoes and spinach. I guess I expected something different (thinking healthy for a moment), as the meal came out bathed in gravy all over everything and the chicken was breaded. My comment, was \"ooo, bummer\". The chicken was cooked nice after I scraped the gravy off. This in essence describes the majority of the menu...smothered food/cream sauces. \n\nThe calamari appetizer was good, though more than enough. Be careful not to get full on it prior to the entree. If so, think sandwich or salad for the second course.", "business_id": "9fxTX1uyyYF4ugx68AG2sg", "stars": 3, "date": "2010-09-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p_UL2xmQRWkk4CaGT1FZUw", "review_id": "jAvgdQHr6rRrxzeqE6faKw", "text": "First, let me say that I travel frequently both domestically and internationally and have stayed in a variety of hotels. This is the first time I feel compelled to write a bad review. The hotel rooms were dirty and service was terrible.  Bathroom had hair on the floor and smudges still on the mirror. I left a New Tempur-Pedic pillow in the room and called the hotel to recover it. Each time I was transfered  to the security desk and they requested I call back later and see if housekeeping had turned the pillow in. After about 5 or 6 calls they did say they found the pillow and I had to give my credit card info to get it shipped to me.  It was not my pillow.  I called management and received a curt response that they would refund the shipping charges. (but they have still not done this 3 weeks later). I can only say that this hotel has zero commitment to customer service. I will never stay here again.", "business_id": "4nFqPL-glgDm9v7bZptskQ", "stars": 1, "date": "2010-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "vjyom6j4MT0hLKC5XeSzDQ", "review_id": "q7t9KqMr__dZ2Tscaa0w_A", "text": "Very nice hotel in a pretty good location - you can walk out the door into downtown, you are just on the  outskirts.   Super clean, the lap pool is the perfect temperature, gym has lots of equipment.  The restaurant is closed for repairs, so unable to comment and that was a bit inconvenient.   Parking is rough through - $20/day.", "business_id": "4nFqPL-glgDm9v7bZptskQ", "stars": 4, "date": "2015-09-18", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "8ED8BPCXKXZnGsVMyl5Bhw", "review_id": "nXEX_Q8eDbxSuJ0HazUykg", "text": "I also love Elmwood Cemetery. I used to work at the NC Music Factory, and we'd go for coffee breaks at the Dunkin Donuts on Graham Street, and we found a cool back-way through the cemetery one day when we were trying to get around the train. It's a beautiful place, and we sometimes would stop and walk around for a second to avoid going back into the dungeon, I mean office. \n\nIt's kind of a surprise to find it, so close in the middle of uptown, but it's a great spot. I'm a little bit of a creepy woman, so I enjoy weird spots like this one...but if you work uptown and are craving a little nature and a little memento mori with your lunch, pack a blanket and eat your grub at Elmwood. I find it to be really refreshing.", "business_id": "ZCkgKNFAVHYQNam4I_T5Cw", "stars": 5, "date": "2008-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "mo9rFaTDTTbpPcVZZ6fz2A", "review_id": "OTuA9xa9RXwMV67kEZPLbw", "text": "Terrible customer service.  I wanted to change my services, after an hour and a half on the phone, the change I wanted was not done and I was disconnected.  Called back and was told wait time would be 30 minutes.  I gave up.  If I could cancel service on line, I would, but that is not an option.  The only way to cancel is to call their number wait forever and pray you dont get cut off.  If you are looking to subscribe look at other alternatives first.  I read somewhere that Charlotte has the highest Time Warner rates in the country.  Avoid this company if you can.  Once they have you they make it hard to escape.", "business_id": "vKtMsWeAaThimXGo9Ic_Og", "stars": 1, "date": "2012-11-26", "type": "review"}
{"votes": {"funny": 1, "useful": 6, "cool": 0}, "user_id": "QG_xAsQiuLe4bOOpds3x5g", "review_id": "fAsBUuuSrK_bEls40pvDlA", "text": "Ok, so I went to my first haircut appointment since moving to Charlotte and was EXTREMELY nervous about it. I'm a freak about my hair and have always kept it long, I mean LONG - anytime a scissor gets near it I tend to hyperventilate and stress way too many times that I just want \"a dusting\". Well, I came here, and was very happy with the result. \n\nSamantha cut my hair, and she was so sweet, and a very talented stylist. We both agreed that I needed more cut off than what I did, and that I'd be back in a month for her to give me a nice shaping. But for now, she just cleaned up my ends and gave me a blow out. I was very happy with it! Also, one quick comment about the price - I know some people feel this salon is pricey. But for my cut and blow dry, it only cost me $26 - granted, it was just a trim, but my old salon in NY used to charge $40 for this, so I was happy here. I'll update my review once I get my next cut and dry, but in the meantime, feel great about booking an appointment here! You're in good hands. Oh, one more thing - for all you guys out there, my fiancee came here for a cut and style and Blake did his hair - he LOVES it, and it looks great!", "business_id": "I9S-4czHzMVfKejCiAuXag", "stars": 4, "date": "2008-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lpPKuX0_pY1_QI7VWC5zLQ", "review_id": "6CUGAue810Jw8S2KLoiAMw", "text": "Hey, I'm honest guy this dry cleaner has some real service quality issues. First off, some of my work colleagues and I had pants hemmed there and they were\nNot measured correctly - very angry!! The ticketing system is almost Third World country like. on my last visit there they lost all my clothes and had to look through everything and told me to come back... They finally found them but of course I did not return. The staff there isn't really friendly and away as they don't really communicate at all do not speak very well English. overall my sprints was not very good with the drycleaner. Would not recommend...", "business_id": "11MER50CkgrVLeL64v9Okg", "stars": 1, "date": "2015-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "n2LrQTGA67QgG7gXybyGQA", "review_id": "tetpsWTK-l-t0DmtUZSIsg", "text": "They had a free if you come before eleven policy; only reason my friends and I started going there. They changed it without notice, I'm a little bitter. It's 10 or 20 bucks now after 11. It's not worth it. The swing is cool.", "business_id": "jbUu0Mtu9QUjyyeOn6RIHw", "stars": 1, "date": "2015-11-06", "type": "review"}
{"votes": {"funny": 4, "useful": 1, "cool": 1}, "user_id": "oUc3Q11cZEFkqK0A7YUgFg", "review_id": "7s3L7-6covq84cp_rQOfGQ", "text": "Fried pork chops, why did you taste so good?  I had already had too much fried food...but you were too delicious to not be eaten.\n\nThe worst part of the meal was when the waitress came over, while I was gnawing on the bone, and took away my plate, where there was an ungnawed on bone still sitting there.\n\nDelicious memories, yet so bittersweet.", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 4, "date": "2010-10-20", "type": "review"}
{"votes": {"funny": 5, "useful": 7, "cool": 5}, "user_id": "iXpKKeeiXjBncJyDWbfhxw", "review_id": "oAqVe8suBCHpBXOMKpJc0Q", "text": "We've been living in Charlotte for a year now, and we've been to quite a few restaurants in our time. However, while I have found that perfect BBQ joint I dreamed of, I had not yet happened across the quintessential place for good ol' Southern cooking...in particular fried chicken. Well, that is now a thing of the past, for I have found Merts.\n\nYou could tell just from walking inside that it was going to be a great Southern food experience. The interior of the restaurant is colorful and eye-catching, and the art and decor screams Southern. The interior was full to capacity, but we were able to snag a table outside. The outdoor area is a mixed bag. While it's nowhere near as crowded as inside (with only four tables or so) the Charlotte pedestrians take it upon themselves to walk through the outdoor area. It was a bit disruptive to be eating a nice meal while people constantly walked right against your table. \n\nI wasn't a fan of the beer list since Merts does not carry any drafts, so I stuck with unsweet tea. After placing our orders the server came over with a small loaf of cornbread for each of us. This cornbread was spot on for me! Not gritty, a little sweet and extremely crumbly. You could tell it was fresh from the oven, and that made it super awesome!\n\nFor dinner I ordered the beef ribs and leg quarter fried chicken combo. I wasn't crazy about the ribs themselves, as they were a bit tough and chunks of bone kept flaking off. I did enjoy the sauce, as it was a sweet and tangy sauce and not vinegary. Now the chicken was THE BOMB! I've been searching for fried chicken down here, and have been disappointed time and again. So far I am confident to say that Merts has the best fried chicken (though I haven't made it over to Price's yet, so don't jump on me for that yet.) The battered skin was light and crisp, and not greasy. The interior was that moist and juicy you expect from fried chicken. I was in heaven scoffing that chicken down, and I wish I had more right now! \n\nThe miss' ordered the catfish and fried chicken breast combo, and that was also pretty dang awesome. The catfish was a huge filet just plopped on the plate. The meat came right off and was so light and tasty. The batter was also perfect, with not too much that didn't take away from the soft flavor of the fish. They serve it with this spicy sauce that was a good compliment to the fish. The chicken breast was just as good as my leg. Even the white meat stayed juicy and tender! The miss' didn't eat too much of it after filling up on the fish, so there are plenty of chicken leftovers in my future!\n\nThe other thing that Merts does damn good is sides. One problem I've had at BBQ and other places down here is that the meats are perfect, yet the sides are extremely lacking. Merts has some of the best dang sides money can buy. We both ordered the mac & cheese and it was simply the best I've had down here. Some places I've been to make it watery or oily or just not flavored right, but Merts had it all. It was a firm consistency with a great cheesy flavor, and the cheese crust on top was awesome. I also tried black eyed peas for the first time and loved them. They were cooked perfectly and were served in this kind of gravy that was also tasty. The miss' ordered the collard greens and I have to say that I liked those too. I'm generally not a fan of collards as they are bitter, but these were cooked in such a way that the bitterness was taken down a notch or two. They had some citrus flavoring to them that helped tone it down and added a different level of flavor to. All in all, the sides kicked butt! Unfortunately we were so stuffed from this massive meal that we did not stick around for dessert.\n\nI have to say, when I think home cooked Southern fare, I will always associate it with Merts. They can fry up some mean chicken and fish, and their sides and veggies are top notch. It's a busy place but it is definitely worth the trip.", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 4, "date": "2012-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HpJ3wBLoGVU3m4XA08m9vg", "review_id": "fXWTuy6RULE9lFNhkYsKFw", "text": "Service was great! Servers had awesome personalities and were very hospitable. However, the food..... Sucked. The collards were not cook well and my salmon patties were burnt. The corn bread (which is what they are known for) was extremely dry and tasted like it came out of a box. We waited over an hour and a half to be seated (granted we did have a party of 7) only to be disappointed. This was not good Soul Food at all.", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 2, "date": "2013-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "PM2jXrlVzik1jDwwahLJJQ", "review_id": "WKixAT4S5Qv3MJv37SsVRw", "text": "So it took three trips but I think I'm finally starting to become a fan of Merts.\n\nMy first visit was to pick up some catering for an event and I didn't get a chance to try anything. The second visit was a bust I ordered the chicken wings, cabbage and seasoned rice. Meh, I've had better everything. The chicken wings were just okay, and the cabbage and rice didn't have enough seasoning for my tastes. \n\nBut this last visit was much better. \n\n\nWe started with the Soul Rolls which come stuffed with chicken, rice, greens and black eye peas. They come topped with a spicy honey mustard sauce and were very good. They were crispy and packed with the filling. I'd recommend them. They also bring out some cornbread and that was definitely a highlight for me! It was warm and with some butter....it practically melts in your mouth. \n\nFor my meal I had the pork chops, macaroni and cheese and mashed potatoes. I was impressed with the amount of food you get! Two juicy and well seasoned (yay!) pork chops blackened with delicious seasoning. Very good. For me, the sides were just okay again. I'm not sure what to get that will give me that \"amazing\" feel but I guess I'll keep trying....\n\nI couldn't leave without trying some dessert so I ordered the strawberry cake. It was very very moist and delicious. \n\nSo overall a much better visit this go round...I'll make my way back and give this place another try to see if they can officially win me over.", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 3, "date": "2014-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UWjzXbOgAdd68be-TQVyIw", "review_id": "Qdgil8pYK1BIWrWEJLWryw", "text": "The Soul Rolls will soothe your soul", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 5, "date": "2015-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L2yPFRB6hsfh849pmvvVRg", "review_id": "UeQZ2A2jGEtvm2JUKDWqQg", "text": "I have no idea how this place has so many good reviews. Maybe we went on an off night or something but there wasn't anything left ( no fish, no salmon cakes, no Mac & cheese, no mashed potatoes, etc.) and the chick failed to mention that until we were actually trying to order our food. They only had  chicken, pork chops, ribs and greens left for the most part. The chicken looked like it was good, I ordered the pork chop and that thing was cooked beyond repair. I felt like I was chewing meat flavored rubberbands. My fiance had ribs that were mostly fat and gristle. The greens were under seasoned and undercooked (and why were they garnished with raw tomatoes??). I mean, we went in there with such high hopes and were so disappointed. I'm gonna just assume that we came on an off night and I may give it another try cause I wanna try those salmon cakes everyone raves about, but I'm skeptical. \n\nOn another note, the cornbread was DELICIOUS. We were pretty  living off of that until it was time to go...", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 2, "date": "2015-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "do-fO-EruYVP_FQPMNWmZg", "review_id": "C2QP2qCPyCbgeD3Thk5E4w", "text": "I typically hit the East Blvd location, but downtown for lunch I decided to check out this location. The line was almost out the door! Although it moves somewhat quickly the service is very chaotic and I was charged for the order behind me. Overall, I enjoy the subs, but this location was a little more disappointing than my other experiences.", "business_id": "6ICGve6UyGPuLaGrKQBVuw", "stars": 3, "date": "2013-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jYr_BkhLsStl47bGRb0TEw", "review_id": "I4H-2M5CfWqb3mN8jIGSaA", "text": "Making a reservation was easy. Arriving early and asking to be seated - not so much. I'm not sure if it was the hostess policy or just the hostess herself, but when I make a reservation for a business dinner for 9 people, I don't understand why you'd make us wait until everyone arrives to be seated. You can assume we'll spend a few hundred dollars and it seems that seating us sooner is in everyone's best interest.\n\nNow to the dining experience...our waiter was great. The food was also delicious. The drinks were strong. The prices were reasonable (for a nicer restaurant). The ambiance was quiet and quaint. I'd go back, but probably not with a reservation so I wouldn't have to deal with the hostess issue again.", "business_id": "NTfUFk8GyOLL1uPbEO-pVg", "stars": 3, "date": "2012-10-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tzU2aXAAwavQN1MAH76-Gw", "review_id": "rzPOnQn_rgDDvvH5Yt9rxA", "text": "Went here for the first part of a date-night that concluded at Fahrenheit.  The atmosphere was great, nice and quiet restaurant with an up-class feel to it.  \n\nWait staff seemed to not be overwhelmed but for some reason took quite a bit of time to wait on the table.\n\nOrdered 3 appetizers to start the night with.  We got the small Jambalaya, the Brussel Sprouts and the P.E.I Mussels.  \n\nThe Jambalaya was great and the rock shrimp were cooked perfectly.  The rice was at a great texture and the sausage really added to the flavor profile.\n\nBrussel Sprouts were nice and crispy, served without sale (had to add some).  Good order with them.\n\nVERY disappointed with the Mussels.  I am from Maine and have been used to the freshness of these mussels.  The mussels were all open, but seemed to have been cooked to fast.  They were not firm, lacked flavor, and in all honesty, it seemed like I was eating a cooked clam and not a mussel.\n\nThey took the mussels off the bill which was nice, but the waiter seemed to delay any response to our table afterwards.  A manager did come to the table to see what was wrong with our order which was nice.\n\nCould have been a 5/5 stars if the mussels were cooked fresh and properly.  Great atmosphere and quite a few quality selections to choose from on the menu.", "business_id": "NTfUFk8GyOLL1uPbEO-pVg", "stars": 3, "date": "2014-11-12", "type": "review"}
{"votes": {"funny": 7, "useful": 3, "cool": 2}, "user_id": "zRiz9k2brNAW-AgM_TLk6Q", "review_id": "oXh_HF4AGjS9uZ2b_Q1bTA", "text": "Anyone who knows me knows that I'm not one for strip clubs. However, if more were like my night here, than I might change my mind.\n\nNo pressure, relaxed atmosphere, in a very nice looking (and clean) venue!\n\nBest part of the night? A 400 lb. (at least) man being brought on stage by a bunch of dancers and they slowly took all his clothes off down to his underwear. Probably the best night of that guys life next to his wedding (he was the bachelor).\n\nThe guy was a real champ! It made for an awesome show!", "business_id": "qxaoJ2cd7-cvEPTmSgBAyA", "stars": 4, "date": "2010-11-28", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "E0kMurifbL5vPlZ7ZbYRjw", "review_id": "Ri8g2qLQCkQTQVDxrCaqug", "text": "Went with a large group on a weeknight and were instantly wowed by the elegant decor.  I ordered the Osso Bucco which was delicious.  Thumbs up!", "business_id": "z24h6ZYnZiWjlDTuLXG9jw", "stars": 4, "date": "2010-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Scdcf0tblMI9RlrMuzwT4Q", "review_id": "oH0VsapGzOmb1IhJkr401A", "text": "Exquisite service and phenomenal food describe this hidden gem!  Walking down the street, you might not even see this \"hideaway\" restaurant but I assure you, they are not hiding flavors. Everything from the beef carpaccio to the agnolotti was perfect, and I truly mean perfect. The Agnolotti were like little pillows of pasta stuffed filled with veal, Swiss chard, butter, sage and a jus. I don't think I have had anything better!  I highly recommend this place.", "business_id": "z24h6ZYnZiWjlDTuLXG9jw", "stars": 5, "date": "2014-10-08", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 4}, "user_id": "nHsj0cHOiroAsmDfF50BtA", "review_id": "Hr7FXxBV_NuhWgPCLlTj6w", "text": "Hartigans is a casual, easygoing Irish pub where you can hang out with a few friends or a large group of friends and have a great time.  It's primarily a lesbian/gay pub, but on days that the Carolina Panthers play (that's football, they tell me), it becomes a full-fledged sports bar/pub filled with sports fans of all types (the pub is right near the stadium).  \n\nThe pub is under new management this year and they've made a lot of improvements to the menu, nightly drink specials, the interior of the restaurant, the schedule of events, etc.  It's returned to the fun place it once was.  \n\nTrivia on Wednesday nights is a blast.  If your team wins, you'll get $25 toward your bar tab!  \n\nThe food is all very reasonably priced and tastes great with a nice, cold frosty beer!   One of my guilty pleasures?  The loaded french fries -- smothered in cheese and bacon and served with a ranch dipping sauce.  They're the best I've tasted anywhere. \n\nOn the weekends, they open up the downstairs area, which turns into a dance club.  Fun for late-nighters!  \n\nSay hi to Christa for me! :-)", "business_id": "EwuvZCcVHkICgTbqCEjikA", "stars": 5, "date": "2008-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "F8rOtCtfmhBeBQRK6gyD0w", "review_id": "YOYCWTLGihG4eDOzE_LlwQ", "text": "Brixx= Primetime Happy Hour. Working in the ITC, this is a primo location for a place with 15 different beers on tap. Walk across the street from work, stumble back out with immediate access to the \"train.\" Can't go wrong.\n\nGotsta order the BBQ Chicken Pizza. There's no better drunk food in Charlotte. Last night, got shwasted off their special (you get a free glass when you order a special) and munched on some BBQ Chicken Pizza. I stumbled down 6th, hoping not to get hit by stray bullets coming from the Breakfast Club and made my way into my apartment. \n\nDefinitely go to Brixx with coworkers, sit at the bar, and watch PTI. It's a good time, I promise.", "business_id": "kAid56AY_laxGYslMdsYJw", "stars": 4, "date": "2010-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "81JxxgXpWa8CrRlQ_NolGg", "review_id": "ymWNPKkC7mBfu2PVLjwb4w", "text": "They have new management. New owner , AJ and his wife are pretty cool. The same one day service. Overall good service. Been with them for about a month now", "business_id": "QBS7wyalMkUmPFhIBm4MPg", "stars": 5, "date": "2015-11-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "sfrumTeq5CyNSOCF3o7UCg", "review_id": "grVdKacTbtb7719yzq85Bw", "text": "Review for drinks only\n\nStopped in on Saturday before dinner across the street.  Was sort of taken aback by 2 customers seated on the patio.  Both guys had on sports jerseys, jean shorts, or jorts if you will, and were seriously blinged out.  Just seemed so out of place with everyone around them.  \n\nWe sat at a table in the bar area and the bartender came over with some cocktail menus and got us all waters right away.  I had the grapefruit buck and it was sooo delicious and refreshing.  I believe it was gin, campari, ruby red grapefruit juice and maybe something else, served w/a grapefruit slice.  I loved it.  Tried someone else's drink and wasn't a fan so was def happy with my choice.\n\nHad to run to make our reservation so it was just the one round.  Wasn't cheap for 3 cocktails and a beer it was $46 I believe.  But it was a nice atmoshpere and we saw they are running for prix fixe in October so we might stop in for dinner before Chelsea Handler at TW.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 4, "date": "2010-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NESzjLpjWixicUlFd5Oxtw", "review_id": "k0ZMRUSNFUpWu9aTXf4Zxg", "text": "Went for friend's birthday, my first time. The service was amazing, they went above and beyond to ensure we had an amazing dining experience. They brought out a bread basket to start, I highly reccomend the bread with the carmelized onions on top. We both ordered the current special of Waygu burger and glass of wine for $25 (we chose the Silver Oak Cab) served with parm. truffle fries. Burger was juicy and very flavorful.. served on a perfectly toasted bun with an overeasy egg and soft butter lettuce. We got a side of their dijion mustard and it was a perfect compliment to the burger. No need for ketchup for the burger or fries for sure. Dessert was a flourless espresso chocolate cake (friend loved it, I dont 'do' coffee) and a 'not-NY style' (as the server put it) cheesecake with a brulee top served with fresh berries. The food and the service made dining here an 'experience'... the price point is on the higher side (IMO!) so if you would normally not spend that for dinner I would definately reccomend for a special occasion... it will be my go-to spot for birthdays for sure!", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 4, "date": "2013-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w2JrGGqTaQ12-ohj76RXdQ", "review_id": "IbdX_NKc05062UwoucnxMw", "text": "We visited during restaurant week and one thing to note is the service was outstanding. She was awesome, attentive, helpful and don't find service like this much. Overall the food was good. We got salads to start, nothing special what you would expect for a Caesar salad. The filet was good but could have been a little more tender. I find many steak restaurants have an issue cooking to med-well. It was good just not great. The side were really good, we got potatoes, beans and man & cheese. The mac & cheese is to die for...awesome!! Desserts were good, the chocolate flourless cake was great but super rich. Overall good experience.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 4, "date": "2015-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "llkm_iXQszkN5DZvmqjNqA", "review_id": "idQy2kUwqgYYAjokTjZdwA", "text": "Nice sports bar... not all of the seats allow good angles of the game but it still not a bad place to watch a game... the food is desent... i would stick to the fried stuff and bar food... they have good drink specials and alot of TVs...  Had a few too many wasted nights in this place...", "business_id": "t5l-H2KdY4MQgLDMENz9WQ", "stars": 4, "date": "2006-11-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "XAEUmXaxMn6Ipw1oZlvW6g", "review_id": "1a4UhEotj2Y2QII2lCMoqw", "text": "Awesome all around (food, service, atmosphere).  Very intimate setting, we were there on a Saturday night and there was barely anyone else in the place.  This may bother some people, but we enjoyed the first-class attention from the wait staff.  I don't understand why it would matter if the place weren't packed, as long as the food and service are top-notch, it shouldn't matter (anyone who thinks otherwise seems to be searching for something other than a great dining experience).  One of the best dining experiences that we've had.", "business_id": "C9CF7p53Y0L5ErKRhhFhng", "stars": 5, "date": "2010-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mUl_ILpoX2YyrfEAic9t2g", "review_id": "vAbPy1WW0XEm96d2siUt9g", "text": "Bring your own cigars and pay the cut fee. The atmosphere is great for intimate meets. However, if you are looking for a place for you and the guys, there are only a few spots to sit. No more than 5 people and you'll love this spot.", "business_id": "7BVCmaxhvXgEpx7J-SQ4QA", "stars": 5, "date": "2014-10-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "ineofepQ8hUM0WOzBWgWbQ", "review_id": "cV3TNPjITtVhDohLMMz-rg", "text": "Still five stars.  Had the opportunity to take chickie's son to his first game Sunday.  Awesome experience even though we were blown out by Tennessee.  Amazing to see how the fans act in Charlotte.  So much class and comraderie.  Go Panthers!!!!", "business_id": "g-Q7G5Q2zHb1BqoF8pq-OA", "stars": 5, "date": "2011-11-15", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "gRKiX_9JUqi4Jy8KjtsehA", "review_id": "Q9hxPihtjaV19E5rZzQf8A", "text": "The new upgrades to the stadium are awesome.  Of course the best part is the escalators, but the new tv and improvements on the inside are a welcome change.  This seriously is one of the best stadiums in terms of viewing,  There isn't really a bad seat in the house even at the 500 level", "business_id": "g-Q7G5Q2zHb1BqoF8pq-OA", "stars": 4, "date": "2015-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nvxnH3oDaQdvgtbgyJrJGw", "review_id": "zHbIlxAwlVdQqHlBuL7osQ", "text": "Classic spot for a pint with friends!", "business_id": "jmzPbvE_02SzTAjwZCTgYA", "stars": 5, "date": "2011-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "do-fO-EruYVP_FQPMNWmZg", "review_id": "1CJAtF3M7e47pr6hvTzk0A", "text": "Although Arthur's offers a good variety of options, the service and execution, and wait time has diminished the last few times I was there. I ordered a six inch turkey hoagie, with chips and a drink, $12.00, ugh! The sandwich was brought with no tomatoes and lettuce and they forgot to add the onions I requested. The bread was stale, and after waiting 20 minutes I was definitely disappointed.", "business_id": "nkNdTqpv1m5GBKx8xrpluw", "stars": 2, "date": "2013-10-26", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 0}, "user_id": "c1qSD6NRfWkiI4lT9IBesg", "review_id": "wQPSL2K9_iP7R3kzN4rNjg", "text": "Went here as the \"fancy installment\" during a recent trip to Charlotte.  We went based on local word of mouth, and armed with the knowledge that the Yelp reviews were mixed.\n\nTurned out that Lavecchia's is okay.  It's . . . okay.  The decor seemed like it was aimed toward the tastes of early 90s Miami drug dealers.  I would not have been surprised if Crockett and Tubbs had come in and raided the place.\n\nGot the house-style lobster, which is prepared well, and it's interesting how they remove it from the shell. It was lobster, so it was pretty good, but it did not stand out.  I got mussels, which were presented well, but unfortunately, it was one of those batches of mussels with the faint gamey/fishy taste.  Maybe the chefs should taste a couple when they make a batch.\n\nTwo things did stand out:\n\n1. The Lavecchia salad.  Pretty cheap on the menu, but the salad was delicious.  The candied walnuts were a nice touch.\n\n2. Oysters with tuna.  This was a really interesting dish.  Six blue point oysters on the half-shell, each with a slice of tuna sashimi draped over the top, then topped with this honey/rice wine/wasabl mixture.  Popped in your mouth all at once, it creates a flavor that was unlike anything I've ever had.  Refreshing but also complex.", "business_id": "TLrX4FECQDFz-E45TI_9ow", "stars": 3, "date": "2008-11-15", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "smidHR3NEAnd6UJUl_6h0g", "review_id": "y5E8ZcE1ZQL48shz8Ba0Yw", "text": "About 10 of my friends and I decided to head to uptown last night, and this was our first stop for a quick bite to eat and a few drinks to start the evening.  Most places are pretty terrible about accommodating 10 people, but not here, they put a few tables together for us in just a few minutes.  The server was really fast and attentive - the drinks were great, 3 dollar well drinks on a Friday night - can't really beat that in uptown!  We all got a variety of food, ranging from fries and calamari, to sushi and salads - everyone seemed pretty pleased with it, my sushi wasn't out of this world, but was great drinking food I'd have to say.  I really like the look and feel of the bar, feels a lot more upscale than what the prices actually are - it was surprisingly not very busy for a Friday night either.  I'd definitely recommend Cosmo's if you are going out on the town and want some food, drinks, or have a large group of people that want to go out and have some good times!", "business_id": "e5J3s-xxs1S6PPHJhldBEA", "stars": 4, "date": "2010-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Zwsq31eNUo2HpdkV2h9aig", "review_id": "Hc0WXbAoMnH5D6-KWX-3Yw", "text": "I used to go here all the time on field trips in elementary school & I always looked forward to those trips. But like some others have said, this place isn't just for kids.\n\nIf you do have kids then by all means you should head here on a weekend . They have exhibit after exhibit, teaching kids with displays & interactive features about all things science. I used to love being able to make things happen in the displays, then watching them come to life.\n\nBut even if you don't have kids, then head here for the many exhibits they have on display throughout the year. Right now, they have Pompeii, which I really need to get to. I've seen Body Worlds here & it was crazy to see that stuff so up close.\n\nThis place is full of great knowledge & hands on displays for kids to learn all things science. It's a great place for kids, but even if you're older, it's still not a bad place to check out exhibits year round.", "business_id": "ZBQWSsUXwixFmm3lpegMiA", "stars": 4, "date": "2008-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "Zwsq31eNUo2HpdkV2h9aig", "review_id": "5Dg4nTKuQ3o21af1bkxEPA", "text": "While this bar is a consistent weekend visit for me & my friends, it still holds its own & I have fun every time I go there. We usually hit this bar near the end of the night & it provides good times without the huge $'s.\n\n1st of all, there is never a cover, unless they have some sort of concert going on outside, so that is a huge plus. It's actually one of the only bars I've been to in Charlotte without a cover charge. 2nd, there are always beer specials, usually a beer of the month for $2, so you can go there without racking up a huge tab. And 3rd, the music & dance scene is pretty on point. You wouldn't think a \"country\" themed bar would have good music/dancing, but Dixie's gets it done. Plus, you can always head out onto the patio to get away from the \"dance\" floor.\n\nBut I think my favorite thing about Dixie's is the people. The bartenders are always pretty quick, always friendly, & the other people in the bar don't seem to be too worried about much besides having a good time.\n\nIt's a safe bet to say, on a weekend night, head to Dixie's Tavern & you'll have a good time without breaking bank.", "business_id": "XeFNQqz5vVsVIcTjNuXcTw", "stars": 4, "date": "2008-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_KkpUThfMiRafOmTmVcNSA", "review_id": "KRVXP2JceVwX4x7cs4OsLg", "text": "Be aware.  Be very aware.  There are other options in uptown Charlotte.  I suggest you use the other options. Extremely unethical business practices.  They'll ticket you for not paying (paying on app or online you could be a few minutes behind),  you'll return to your car, see ticket, and think...oh, we must have crossed paths.  Do this a couple of times, and the boot will be on your car to the tune of $195.00.  If the app doesn't work, they want you to pay at another parking lot (that would be yours to figure out) or pay cash.  If you call when you're paying late, the parkmobile people say, it's alright, we've got it noted.  But that's not the preferred parking office.  They will boot your car, charge you to park and charge you for the ticket.  I've parked with them for over 4 years, and this is the customer service they deliver.  The Manager also said she would not send anyone out to remove the boot, with payment, until I apologized to her and calmed down.  Blatantly against the law.  Yes, I have reported to BBB and the Attorney General's office.  It will be my life mission to unmask these thieves.", "business_id": "nGXmyYLv7mS30A0BMyemvw", "stars": 1, "date": "2014-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "N9uToahkLQ14P9XTjbEuZA", "review_id": "JMKkYW0JJhz88zc0gLPfiQ", "text": "Amazing service & attention. They took it upon themselves to fix my day after Delta Airlines did a bang up job of making me hate them for life. I was tired, miserable, and 5th level of Hades ticked off. Omni, conversely, gained a customer for life on his first visit. \n\nWho does that?! These guys...thank you.", "business_id": "QThlnQ7AvzZwXHKD5DjdCw", "stars": 5, "date": "2012-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ITwewV_k1EcFgxfWNlssqQ", "review_id": "YdXu1SaXiZ2jw9kUWqw6OQ", "text": "If you're searching for specialty foods, check out Reid's at Seventh Street Station. They've got a great selection of wines as well. Their cafe also a good option for lunch if you work nearby. \n\nI'd suggest having a glass of wine there and sitting outside, watching the light-rail train go by. If you're not usually uptown much, you might not think to go to Reid's. But if you shop there, they validate your parking stub for Seventh Street Station, eliminating one of the hassles of going uptown.", "business_id": "Ak6ThDexfSFwoajgOpio8g", "stars": 3, "date": "2008-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z89zLtkHdvYwMw7ikLAigw", "review_id": "rgCP6AcNJWM1ZHTdd1ZehA", "text": "Great spot for a quick, cheap lunch uptown. The daily specials are great as you get a full meal including a tea for around $10 with tip and tax. The restaurant is unbelievably fast as I don't think I've ever waited more than 10 minutes before. The Shrimp Creole and Baked Chicken my 2 favorite lunch specials.", "business_id": "376PDtBpGi74Os08TvCkhg", "stars": 4, "date": "2014-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sAz5HV1WZcUF9Dy_wKt7TA", "review_id": "HAMFY9AGMCwVhnFHl2tuWw", "text": "Arrived and waited for 10 minutes before I grabbed a menu and asked an employee if the guests were supposed to seat themselves.. He responded \"You can\" and walked by with out furthering assisting me.", "business_id": "ePogmFFQkAy68Ne0VVUGBg", "stars": 2, "date": "2014-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DjrhDnmuoqOcEuxz0iETRA", "review_id": "5QhbdY9zEgo5GiYt8gMFDQ", "text": "Wow- similar experience as other reviewers.  Purchased Lg\nDishwasher from Best Buy. On the 2nd load every it refused to turn off. Called LG and they sent Carolina  Appliance. First go around - not too bad. After it was fixed - same thing. LG and BEst Buy promised a replacement but Carolina appliance had to sign off on it as a lemon . \n\nthe owner was beyond rude!!!! Made many promises and failed to keep them. Claimed his repair guy  was out of cell range all day. \n\nHe started taunting me -Serves you right for shopping at Best Buy he says. Maybe you should call the Geek Squad.\n\nAsked hubs to call - 30 seconds into the the call, the guy is out if control. He get Threatened him and hung up. \n\nWe were also being held hostage by This guy at Carolina Appliance - as they won't release us so LG could assign another repairman. \n\nI'm really thinking this guy has some serious anger management issues!\n\nThe final result - DW was used two times- Best Buy took it back and we are waiting for our Bosch.", "business_id": "pbuSIs6lEKkDpFCQbpOcbA", "stars": 1, "date": "2013-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "U5qUwsCNyo8vKBrhBUEzbg", "review_id": "4EmPzNshMnF7fzh7dhdVHQ", "text": "I'm absolutely floored with the service Griffin Brothers offers.\n\nThe other day I realized I had a flat tire about 5 minutes away from home.  With the wheel on the ground and no car jack, I wasn't sure what to do.  Much to my dismay, my AAA membership had also run out.  I had my tires and oil serviced at Griffin Bros the week prior, so I figured I would give them a call.\n\nNot only did they send someone out to air up my tire, but when I drove to the shop they put my car immediately on the lift when I told them I had a meeting to be at in 30 minutes.  Unfortunately they didn't have the right size tire in stock, and it was going to be an hour before they could get it. \n\nRealizing I had to make the meeting, I told them I would need to jet, and offered to pay for the roadside service...which they waived.\n\nGriffin Brothers was there to help me out in a time of need, and helped me for the sake of it being the right thing to do for a customer.\n\nHands down, I will continue to do business with and recommend Griffin Brothers for anyone needing automotive service in the University Area.", "business_id": "mnOTw4P5NaLbzFp2bTsm9g", "stars": 5, "date": "2012-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8ED8BPCXKXZnGsVMyl5Bhw", "review_id": "uQc4X_6SEhymNTNMs1M_MA", "text": "I'm not a huge fan of theme parks in general, but it is nice having one close by. My sister, who has a four-year-old daughter, visited a few months ago, and we took my little niecelet to Carowinds. She enjoyed the Nickelodeon-themed rides, especially the Dora the Explorer train. (It's totally lame for grown-ups, but she had a good time. My sister and I rolled our eyes while she shouted, \"Estrellas!\" because Dora told her to find all the stars.)\n\nThe food was expensive and soggy, like amusement park is meant to be, and there are lots of places for kids to freak out because they want their parents to buy stuff...it was just what you'd expect for a theme park experience with a four-year-old in tow...kind of annoying, kind of cute, and certainly memorable.\n\nThe best part of the whole adventure for my sister and I was talking the niece into going on the log flume ride. She was nervous that it would go fast and that she might get wet, and we assured her that it would, indeed go fast and that she would, indeed get wet...but that we'd make sure she was safe in between the two of us. I sat in the front on our log, and my niece cuddled in between my sister and I. She liked the ride until we got the the freaky last hill with the steep, gut-wrenching drop. She got off crying and actually said, \"My mama scared the piss out of me!\" when she related the whole experience to her father on the phone. It was probably mean, but my sister and I laughed and laughed at her mortified little face. It was so funny, we couldn't even teach her not to curse. Good times with family fun. Hah!", "business_id": "n9iK0s1dKxv5JLi3u1eTkQ", "stars": 4, "date": "2008-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G8HZ3w8D9OyLG9duJ6b-cg", "review_id": "Lyhydl-cjSSh83ICPrq11Q", "text": "This place was awesome! I went here for the first time last summer.  I then caught wind that they were building a new \"giga-coaster\"(more than 300 ft tall). This is the famed Fury 325 and it lives up to the hype. The first drop is literally like free-fall! In addition to the insane speed and the 150 ft tall \"turn-around\" element, it's actually RE-RIDIBLE!!!(you don't blackout).\n\nThe other pros for this park are Intimidator, Afterburn, and the drop tower. They recently built a new entrance which is pretty darn cool!\n\nI live near DC and this park is about 400 miles from me.  I, however, will gladly pass up Kings Dominion and travel the extra distance to come here. That's how great of a time I had.", "business_id": "n9iK0s1dKxv5JLi3u1eTkQ", "stars": 5, "date": "2015-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UzqQwLskASDvCwWh0FYYsg", "review_id": "UNHhG-LE7cEhpPygJUixbQ", "text": "Average $50-$100 range motel...comfortable beds....very good staff...fast WiFi...book online via hotels.com to save money. They will put a hold on your card at check-in which will almost be equal to the amount you pay. For example, stayed 7 nights for $306, the hold was $273 and was not disclosed prior to booking. So I was charged a total of $579 ($306 by hotels.com and $273 by super8). The $273 was not returned into my account until 5 days after check out!!! So that money was tied up unexpectedly for 13 days. May not be a big deal to some but it was to me. Other than that I had no other issues.", "business_id": "qi3If1JcIP9JLusFpEmtog", "stars": 3, "date": "2015-09-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "PVDDpiuz5pK87SM3gG5J6A", "review_id": "9Ey8C1XZvBN38qJ10BJdWQ", "text": "First of all, the last thing I would do is rate a gym poorly for being crowded. It's obvious right away that the Dowd is a VERY popular place - for good reason. Although parking came be very limited, arriving with that expectation makes coming here at 5:30pm every other day much easier to swallow. This gym is flat out awesome. Many different rooms, great free weight area, great nautilus section, hybrid machine section, etc.\n\nBut, the best part about the Dowd, for me, is the lengthy class schedule. Every day of the week, many throughout the day, and very accommodating to different sections of the body. Spin classes are awesome, just make sure to sign up for a bike early - they will and always do fill up. Convenient location on Morehead, close to many other parks in the area, and pretty easy to get in and out of. Overall, I love it here and couldn't recommend it enough!", "business_id": "b3u-GK6_xj2fJkinzLk_jQ", "stars": 5, "date": "2011-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VSPrG5s0jSmbFyqiZBXDCg", "review_id": "1jCGYwo_WvuiCqJh9ZmoJA", "text": "it was ok.  \n\nmussels were good.  service ok.  ambiance seemed dated.  worth a trip, but not sure i would go back.", "business_id": "eaqJQP6bp7rQJQt5KqfvxQ", "stars": 2, "date": "2010-09-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "QNBH_vCAirfXXlUf1MEKZg", "review_id": "iwt6abxIGOh1hl1mJrNi-A", "text": "Amazing, amazing, amazing! We had our rehearsal dinner here and everything was perfect beyond words. Ashley did and incredible job making us feel so welcome and special. The cocktail and dinner menus were customized with our photos. The food was delicious and the wines with paired with dinner were just right. I have the   mushroom bolognese, my husband has the salmon. Every single person loved the apps, their salads, entrees, and their desserts. It was such a pleasant experience with fantastic service. I could not have asked for a more perfect rehearsal dinner!", "business_id": "eaqJQP6bp7rQJQt5KqfvxQ", "stars": 5, "date": "2014-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9tLddRlTbVJJ0IdBb3OSng", "review_id": "rTnDRNMFBEBupQFRx9xdSA", "text": "Was taken here for a welcome luncheon. Their sushi lunch special is fairly priced. I had a bowl of soup and two types of sushi. I selected avocado and veggie. I'm not into eating raw seafood. \n\nMy meal was pleasant enough. Interior space felt crowded. Refreshments were continuously refilled. Waiter checked in only once. Overall, nothing impressive.\n\nThose that ate entrees complained of stomach issues later.", "business_id": "hBscDTusN57Ai0SnkQK8Sg", "stars": 4, "date": "2014-09-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "PDVT8Lshz0z6Cy4A4Ee3zA", "review_id": "1YHqfBY1aTr2qfs8HFEhYg", "text": "\"Meh. I've experienced better\". Don't go for the jerk chicken. It looked like brownstew, and It just wasn't that good. The greens were okay. I would try something else...IF I go back. Also the lady at the register was holding a personal conversation on the phone while I placed my order and waited to get my food. What's up with that?", "business_id": "CDH2dyRcJUDPM1xj4AD0lQ", "stars": 2, "date": "2012-09-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ITwewV_k1EcFgxfWNlssqQ", "review_id": "JDXSa0MZGnYeSytBUEOhmg", "text": "I've had good experiences with Uptown Cleaners. I believe they only charge a couple dollars per piece of clothing. But mostly I appreciate their persistence. I dropped off a few sweaters right around the time I was moving to a new apartment. With all the chaos of packing and moving and unpacking, I totally forgot to pick up the sweaters. After a while, they called and reminded me. When I again forgot to pick up the clothes, they called again. I just appreciated the good customer service. I'm sure other dry cleaners might not have been as patient.", "business_id": "CEjRGMhQiWCY3McyAsJMBQ", "stars": 3, "date": "2008-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AAa6cUUBzZnAIbPFc2dHig", "review_id": "eUzixVhi4Ev--OtWzP6W2Q", "text": "This place is amazing. Not only did the bartender explain to us newbies the whole menu process as we were waiting to be seated, but when I went to order my drink I asked for Mello Yellow because they told me that they had Coke they said that they didn't have any. Next is what shocked me, when the waiter came back he told me they ran to the gas station next door to get me a Mello Yellow. How awesome is that?!?! The food was amazing the wait staff was spectacular and I can not wait to come back! Also at my table was a card for mine and my boyfriends anniversary signed by a lot of the staff! Definitely an A+ experience  love it here and highly recommend it!", "business_id": "uDoTFFud2mXE3VT1Jt9L5A", "stars": 5, "date": "2015-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7lT178za1lYfHnF1EO8gIA", "review_id": "jm7PL9keoeGW5gKLgzQ65g", "text": "Stopped in for breakfast. The server, while a bit harried, was charming, friendly and helpful. The food was totally fine. In fact, the biscuit was pretty good. I'm a non-Southerner, so maybe the biscuits aren't spectacular, but I liked mine. Price is right, and service was quick. Don't hesitate to go, but don't expect more than decent diner fare. That way, your expectations will be met or, dare I say, surpassed.", "business_id": "FRYCe6Yc0rPzzloSWSsl1g", "stars": 4, "date": "2015-11-06", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "-3akdU5UTDn6dwiTCO2cAw", "review_id": "2jk9Axe7exURLjPTJJt4Fw", "text": "If you are looking for great Italian in Charlotte that is NOT a chain like Carabba's or Olive Garden, you have found it at Mama Ricotta's! How could you not love it with Ricotta in the actual name! I first went on a date with a boyfriend and really enjoyed it. But it wasn't until, when I eventually tried the Goat Cheese and Marscapone dip months later, was it necessary that I return weekly to satisfy my craving. If you are a big fan of cheese or pizza (who isn't?) then you will LOVE this. It's like creamy little salty, sweet heaven on a crustini. Dang, now I'm hungry... \n\nMoving on now... the service is always impeccable and the people are very friendly. I always spot the same two men observing and attending to the guests in the dining room. I could never figure out if these men are the managers or the actual owners, but I like that they are always visible. \n\nI have frequented Mama Ricotta's on busy weekend nights but seem to never have to wait for a table. The prices are reasonable. I suspect you could dine there for 2 at about $50 to $70. \n\nI highly recommend Mama Ricotta's if you live in the uptown or Dilworth area for awesome Italian but I also highly suggest fitting in lots of cardio the following day. ;)", "business_id": "MQnNtW1lHS-eid3QNUoUIw", "stars": 5, "date": "2010-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6j4iopXcGj0atZNCNcHD9A", "review_id": "r1vgaHPJjQP0I3aupBaIOg", "text": "We were in Charlotte this past weekend and we were in the mood for Italian, so we went to Mama Ricotta's. I am glad we made the choice to come here. From the moment we walked in, the staff was pretty friendly and accommodating. We got the Burrata & Prosciutto appetizer, it was lovely. Our entrees were Penne Alla Vodka and Rigatoni with Meat Sauce. The ingredients were fresh and flavorful; just like Italian food should be. \n\nWe noticed that the dessert portions were enormous so we asked if we could be served just half of a tiramisu. Our waitress was absolutely accommodating and she made it happen. We weren't expecting to pay half price for the dessert we just didn't want the rest to go to waste, but she did charge us half price. I wish this place was in DC, we would be here all the time.", "business_id": "MQnNtW1lHS-eid3QNUoUIw", "stars": 4, "date": "2014-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "eM68n2pLhouhLs_AicnqBQ", "review_id": "uKtHP5J0INrhx5p4TBt8pw", "text": "I freakin' love this business! It's so hard to describe why I love it though. Just check them out. You won't regret it.", "business_id": "STcLx0y_X89TsC0m2gVgHw", "stars": 5, "date": "2012-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "ITwewV_k1EcFgxfWNlssqQ", "review_id": "sZ7BGxzofZ01OGoGaZqL7Q", "text": "I went to Femme Fest at the Visulite and saw some great female performers. I really like the Visulite - with its cool but cozy interior. The only downside is that the floor is pretty tiny. I've stayed on the level just above the floor every time I've been there and ended up sitting at a table (and I'm normally a stand-right-by-the-stage concert-goer).\n\nI've also been impressed with the service at the bar each time I've gone. I guess I just expect to wait forever for a drink, but I've always had fast, attentive bartenders at the Visulite. Definitely check out a show there.", "business_id": "eNIDbboNe7W_rAnNHoveEA", "stars": 4, "date": "2008-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "C0BBxW9ykTqSd4XOHu8nDQ", "review_id": "mhRKcBQUCBb5z_1QImoiAg", "text": "Giving birth here was one of the worst experiences of my life. I feel like the staff went out of their way to make the process as miserable as possible. \n\nWhen I was checked in, a nurse named Susan rolled her eyes at me every time I asked a question and was sarcastic every time she answered a question. If you don't have an answer there are polite ways to say so. Don't make me feel stupid for asking. \n\nNext I was placed in triage for over three hours with no information about when I would get a room. This was one of the questions I asked Susan that got an eye roll. The triage staff were cold and unfriendly but not outwardly rude.\n\nWhen I finally did get a room I had the sweetest and kindest nurse named Liegh (sp?) but only for an hour, then the real nightmare began.\n\nWe had another nurse named Susan. This Susan was massively overweight (I only note her weight in case someone at Presbyterian cares enough to read these reviews and wants to know who these horrible people are. The eye rolling Susan was average size and very old). This new Susan made an already confusing and anxious situation absolutely terrifying. Her rude remarks and uncaring demeanor set the stage for the rest of my stay in labor and delivery. \n\nI wish I would had just left. CMC is just down the street and delivering in their emergency room couldn't have been worse than my experience at Presbyterian. \n\nThe nurses in recovery were great, especially Melody and we loved NP Judy Grubs (sp?). However, Presbyterian had arbitrary rules about pain medication. If you were asleep when the meds were due they wouldn't give them to you when you woke up, I had to wait for the next dosing time. I went without pain meds for 16 hours and was in terrible pain. \n\nAlso while we were here, they sent someone in to ask for money. We were current with all of our bills at the time and have never made a late payment so there was no reason to come in with their hand out. This is supposed to be a joyous time for people not a time to worry about money. We had the money and paid before we left but I'm sure some people might have a hard time coming up with $3000 (or whatever their bill is) on the spot. I just thought it was tacky. \n\nI certainly won't come here for the birth of my next child and my family and I will switch to CMC for all further health care needs. \n\nI do not recommend Presbyterian Hospital.", "business_id": "Vmw4amlubvfDnIpkegvKKw", "stars": 1, "date": "2015-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "-I3jkiArijGlqIUYpVPIKg", "review_id": "INqlmBeeMAz9j9uqmA2WkA", "text": "One of the BEST Asian restaurants in Charlotte hands down. I was shocked it was not already on Yelp.\nThey specialize in Malasian Food, but offer a fusion of Japanese (sushi & hibachi), Chinese, and Thai inspired dishes. Honestly I have not tried the Hibachi, but the sushi is among the best, even over sushi specific restaurants!\nDon't be scared of the term \"Malasian\", if you are not familiar with it. There is not a single person I have ever taken there that has not loved it, and become a regular patron. Even the \"standard\" Chinese Restaurant dishes are really good- Kung Pao Chicken or Shrimp, Chow Fun, and fried rice. Try the Roti Telur for an appetizer. It's a savory Curry Broth with potatoes (don't think of Indian Curry), it's mild and I think it tastes similar to Thai Massaman curry. Comes with homemade bread pancakes for dipping. Also the Beef Satay is very good.\nThe wait staff is usually very helpful to new customers that are not familiar with the dishes.\nThey do a great Lunch Menu and are very fast with service.\nLocated next to CPCC campus downtown, this place is a must try!", "business_id": "MMNBgMQCdwyVoNaHg0h_QA", "stars": 5, "date": "2010-09-14", "type": "review"}
