{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "B5WkNWDxZ-baWoQc6DBNHA", "review_id": "Z1gkobmbvDYstY1RUjffNw", "text": "Finally, I restaurant in Pittsburgh that I can give 4 stars!! Mitchell's is located on the Waterfront and is one of the nicer restaurants in that area. The interior is a classic, clean, modern seafood restaurant-- dark wood, glass, etc... The menu has really great seafood selections and is printed daily.  But here's what's great about this place: after 4pm you can get \"small plates\" at the bar for $3 each, and these ain't no Costco fish sticks! Two of these small plates would make a sufficient meal (along with the sourdough French bread they bring out). Finally, while the drinks aren't cheap, they're creative, tasty and fresh. All in all, I had a great experience, and I think this place would be perfect for a date or a happy hour with the girls from the typing pool.", "business_id": "usSROUMiAgPcxV3Ym0OxMQ", "stars": 4, "date": "2008-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ei83TiI1GQJoct53DszEjA", "review_id": "q4zWKFNw_yBXVm1lt8DV2w", "text": "I want to like this place more than I do. Its definitely at least decent. It's a family style seafood restaurant that has a bit of class to it. Pretty nice visually, and service is good as well, especially at the front desk. I've taken a couple of people there for birthdays and they do a nice job with that without being obnoxious with the ceremony. If you make a birthday reservation you can actually get \"Happy Birthday Bob!\" or whatever printed on your menus for the evening. Nice touch. \n\nFood is just solid, that's why I don't give them more stars. I've had a few things here and there's nothing special about their flavors, although their presentations are nice. I've been a couple of times and haven't had anything I'd be excited about. Basically a safe, family style, classier mid-scale seafood choice.", "business_id": "usSROUMiAgPcxV3Ym0OxMQ", "stars": 3, "date": "2015-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WwvZxFhFdBx5EXaKzSYwXQ", "review_id": "I_zgngMUut_mAgmCKTn7PA", "text": "We had a frustrating and disappointing experience at Roland's, a dining out experience on a recent 4-day visit to Pittsburgh.\n\nFirst, all of the food was extremely overpriced. The quality was what you would find if you were ordering from a bar...but it was twice as expensive. The $16 I paid for fried cod got me two soggy cod filets, steamed bland vegetables and boring roasted potatoes. I couldn't have tried to make food this poor. It was a Sysco food operation gone wrong: runoff from Houlihan's mixed with Joe's Crab Shack. \n\nThe service was so slow that we were cancelling orders due to the delay in bringing them to the table. My dish arrived without any sort of sauce, and we even had to get up and order beer from the bar because our waitress was so behind. It was her \"second day on the job,\" but this is unacceptable. They could have at least comp'd our beers, or offered some other way to make it up (besides coming over to informing us that they had charged the beers to our bill).\n\nRoland's had space available on a Monday night, unlike the other restaurants in the neighborhood. This was really convenient initially, but I now have an idea of why this was the case.", "business_id": "wHi8ODv7TGmeUB02XoX-mA", "stars": 1, "date": "2011-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mAEwUdVJ3vhA_L-MKqLGpw", "review_id": "dPjaWiEAh3x20fIqLm2oMg", "text": "I'm surprised Roland's has such bad reviews. I've never had anything bad here. Their lobster rolls are very good and you get a large portion of lobster in it. The clam chowder is good, their seafood pizza is awesome. I honestly have never had a complaint about their food. The only reason I'm giving them 4 stars is the service is usually pretty slow. Even when we go when not a lot of customers are there, the service still seems to be slow. I would definitely go back.", "business_id": "wHi8ODv7TGmeUB02XoX-mA", "stars": 4, "date": "2014-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "DXnFLwB3wetH3uAV1zaDrg", "review_id": "MSe5aGVSCwni5xCcFHfcxQ", "text": "I stopped here for dinner with my boyfriend after an evening exploring and photographing Washington's Landing.  I've dined at Redfin Blues once before, but it was several years ago.  We are always up for some good seafood and figured Redfin Blues would be a good choice since we don't really get out that way all too often.\n\nLately, we've been hooked on oysters, but I was disappointed to find that this place doesn't serve them at all.  I was willing to look past it after seeing plenty of other seafood items on their menu, and we settled on a cup of the Redfin Bisque each  and decided to split a large shrimp and crab pizza.\n\nThe Redfin Bisque was absolutely delicious... my only gripe is that it's a VERY small portion for the $6 price tag.  For that price, I expected a large bowl of soup, but instead it's just a small cup that I downed in about 2 minutes.  The flavor was great, it was the perfect temperature, but the portion size for the price might make me hesitant to order it again next time. \n\nThe seafood pizza came out shortly after and it smelled heavenly.  Even the waitress commented on how good it looked.  We ordered the large pizza but probably could've gotten away with the smaller size, since we ended up taking about half of it home.  The portion of the crust that wasn't covered in toppings was yummy and cooked well, but the crust underneath the toppings and olive oil sauce was a bit too thin and soggy - definitely couldn't eat the pizza without a fork and knife.  The quantity and quality of toppings was great for the price and the flavors were great, I just wish the crust had been a little more consistent throughout the whole pie.\n\nOverall this is a nice place to grab an outdoor bite along one of our three rivers, but I wouldn't necessarily say it's somewhere I will go out of my way to visit.", "business_id": "41CXLCeB8z2oNdIOvnrzIA", "stars": 3, "date": "2015-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UFELn1urSyrY7gOVqGDMzQ", "review_id": "PQdZm7ztB17s2ZCjsDcn7w", "text": "Don't waste your time stopping at this establishment the waitress serving the tables is rude and you will die of dehydration waiting for a drink at the bar.", "business_id": "-KQ283hJkBO12u8XOrlCcQ", "stars": 1, "date": "2015-09-12", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "qfYvV435EIQzv2FEQvix9Q", "review_id": "y6hOswwOTHr3HwUjfYkOCA", "text": "We went to the Red Lobster at Carolina Place this past weekend. The quantity of the food was great; quality was adequate. Service was abysmal. Just as an example, our server brought our ticket to the table. 15 minutes later, she ambled by to pick up the ticket with our credit card. 10 minutes later, she finally brought it back for me to sign. This was after an hour-and-a-half dining experience which should have taken half the time but due to our waitress' slowness and lack of attention, was stretched into painful wait times. Never received a refill on my soda. This was not during prime time, either - we arrived around 4:30PM on Saturday.\n\nAs far as the food went, it was good - I had the Admiral's Feast, which I took half of home because it was so much. My wife had the Crab Feast, which she did enjoy. The Cheddar Bay biscuits made up for much, but if I get in the mood for those again, I may just phone in an order and pick it up.\n\nI just hope our server never goes to a zoo; I would hate for her to get dizzy watching the speed of the tortoises there.\n\nAs far me, I'm going to give this location a miss moving forward.", "business_id": "BO0zz8gort7o-6KuecIv3Q", "stars": 2, "date": "2013-10-15", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "whKpnugMnWTz3UjlrN71yg", "review_id": "Xsrgd9pKl3G4OgwRUdJgmw", "text": "My favorite steakhouse in Charlotte! Yes it's a chain, but not every Capital Grille gets 5 stars from me. For example, the one in Chicago is 4, mainly due to ambiance. The was the first restaurant I went to when I moved to Charlotte and continues to be a place to go for dinner or dessert after dinner somewhere else. For me, the best cheesecake in town. Great patio for outdoor seating. Great open bar with top notch service. This is a place to indulge for dinner and wine. Both menus are impressive. Open kitchen concept makes the feeling in the restaurant a little more lively.\n\nThe Delmonico steak is great as well as the filet. Depending on the size of the lobster tail that night, getting it as an appetizer is a sure way to make the bill skyrocket, but hey, we only live once!", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2010-09-24", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 3}, "user_id": "W6LTsXcY1R76M9EdeN0G6A", "review_id": "UX6YTAXc0nSKeB630EXHlQ", "text": "For me, Capital Grille is one of those places you hit up for a special occasion or restaurant week. I mean hey, I make hundreds (baller)... so it's not in the budget all the time. The friends and I ventured here last night for the gingerbear's birthday.\n\nLet's start with the service. My oh my is it amazing. From the bar, to the table and everything in between... absolutely top notch.\n\nDrinks: My knees go weak for an amazing filthy martini. They make it just the way I like it. Bonus: they bring the shaker out to the table and pour it in front of you. Double bonus: blue cheese stuffed olives. I also recommend their signature drink the Stoli Doli martini. Great cocktail. But beware: it's so good you may forget about the fact that it is pure booze. For the wine lovers, the selection is overwhelming... which is a good thing.\n\nFood: the pan fried calamari is CG's signature app. My problem here though is that I can not partake in appetizers or else I stuff myself full before the main course arrives. Last night I went with French Onion Soup, split a house salad with my friend and the Sliced Filet Mignon with Cipollini Onions and Wild Mushrooms. We also got the lobster mac n cheese and grilled asparagus. It was all pretty amazing. I may or may not be still thinking about that mac n cheese. Wow, that's a must get side item there.\n\nDessert: I was already full at this point... like throw-a-white-flag-in-the-air kind of full. But then it happened- they brought out a tray with every one of their desserts on it for the birthday boy. I had no choice but to try them all. My personal fav was the cheesecake with berries and a caramelized brulee topping.\n\nMany thinks to all of the staff... especially Alisa... at Capital Grille for another great night. I'll be back as soon as my wallet forgives me.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 4, "date": "2013-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zI6ab435CVx84G4AiAY-Nw", "review_id": "UNFJ7cvpJqh1oSnvqeVp4A", "text": "I went for lunch with some colleagues and had the tuna. It was a bit overcooked and clearly not fresh. The ball of rice was also okay. The green beans were steamed fine. My colleague's ribeye sandwich was apparently pretty good but why go here when youre not on business?", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 3, "date": "2015-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0Qu2RKgxnbEn1Z6F5KC7JQ", "review_id": "xZgCZRwCi4pJS01qO3tSxg", "text": "We were headed to Ri Ra's for Corned beef and happened to spot LaVecchias - hadn't been to the new location, and never got a chance to eat at the old one. We were early, so we walked in. \n\nDecor is Cat In The Hat meets Mondrian and Captain Nemo, but in an oddly good way. I don't usually care about decor anyway. \n\nShe got a terrible martini of some fruity kind, and I got Woodford Reserve. Ten bucks each, no surprises. \n\nShe ordered the Watermelon Salad. She liked it a lot, I found it a little plain for delicious nonetheless - I might have simply salted it if it was mine. \n\nShe ordered the Pecan Crusted Golden Snapper, and I ordered the Lump Crab Stuffed Shrimp. \n\nThey gave her the Almond Crusted Tilapia (boo boo), and she started eating, completely forgetting she ordered something else. She was a quarter of the way done when they came to give her the correct dish, and apologized profusely. \n\nBoth were fantastic in her view but the tilapia was better, and I agreed, tasting them both. The tilapia is a better crafted dish, for me. \n\nMy shrimp were perfectly cooked, I enjoyed the ride and pineapple, and I was surprised how much I liked the striped of berry compote painted onto the plate - a little swipe with the occasional bite, and it totally changed the taste for a great difference. \n\n$120 for both, 2 drinks for her, 1 for me and coffee to finish. 4 stars for the quality - the food really was quite superb, but I left hungry. Should have gotten an appetizer, then we'd be at $135+ and perhaps still in 4 star territory. I recommend - best seafood i have had in Charlotte.", "business_id": "TLrX4FECQDFz-E45TI_9ow", "stars": 4, "date": "2011-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J98vrJf8zg0z-J4vF8PGDw", "review_id": "9m_GVVH66I4eSMQetAVU_g", "text": "I like the restaurant itself more than the food. $100 for a less than 4 pounds lobster is a little pricy but taste good, so it's fine. But the hamburger was dry, I can find many tasty hamburger only cost 1/4 price. So if ever go there again, I might just order some appetizer and drinks.", "business_id": "1gKBusJMk66ypwEKF0vOAA", "stars": 3, "date": "2014-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "Dc0v3ANOi1e6UbCmeXC-Kg", "review_id": "y3pCxiC3c6LmgPXu1q911Q", "text": "I really wanted to love Upstream, but it totally fell flat. We sat in the bar for some apps and drinks after a movie, and it was one disappointment after the next. The biggest disappointment of all was the management (and this is speaking from two people who worked and lived off of tips in the service industry for years). We weren't looking for anything but an acknowledgment and somehow felt like we were the ones causing problems.....so what happened...\n\nWe ordered shrimp dumplings and they came out raw. We sent them back and somehow were left to feel like we were being unreasonable. Call me crazy, but expect food to be cooked and want to make sure there are no risks to eating said food. New ones came out (they were great) but TOTALLY different than first ones of which the management said were \"slightly undercooked\" and he was \"trained that most food was sushi grade.\" Call me crazy again, but just admit the mistake and we all feel good. \n\nLastly the bill came and Upstream has the audacity to charge $3.50 an oyster for Wellfleets ($42/dozen). Whaaaat!! I'm a Boston gal who knows her seafood. Never in my life have I seen someone charge that amount. Nevermind that the menu says they are $2.50 but they all of a sudden claimed it was a premium oyster at a different price.\n\nI can forgive mishaps and mistakes - it happens to the best of us. I cannot accept management who is so cavalier and dismissing to their guests.\n\nPrices are high here and that is no issue for me for great food and service, however not acceptable if you can't deliver on those fronts.", "business_id": "BOp3jcpYy31M85H1DLnEEw", "stars": 2, "date": "2014-10-03", "type": "review"}
{"votes": {"funny": 1, "useful": 7, "cool": 4}, "user_id": "sOZK11vtg6BowI6ulQu1Ag", "review_id": "Jrrd6U5YtDmO0gI-Z2kTYQ", "text": "This little place has been on our list for awhile and we finally made it last Friday night!  It was a cold windy night, so descending into a warm cozy basement space seemed to fit!  We were greeted by a cheery hostess who promptly seated us at a corner table.  Johnny Chimes was at the piano, which set a perfect tone for the evening.  Our waitress greeted us and we ordered up some fabulous food!\n\nThe shrimp and corn chowder was perfectly creamy, spicy, and loaded with shrimp.  Our entrees were the Etouffee with crawfish and the roasted shrimp.  The etouffee was deliciously spiced with a generous portion of crawfish that tasted like mini lobsters!  The roasted shrimp were outstandingly fresh and served over a bed of lightly wilted spinach with balsamic glazed onions and topped with parm...so fresh and delectable.\n\nFriendly service, cozy space, outstanding cajun cuisine...we will definitely be going back!", "business_id": "koRLvzIl-4fCybOIdk56jA", "stars": 4, "date": "2014-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iVIG4Sg5X-DmvPNNoORNHg", "review_id": "znSoi83UsjTXquStrnQwaA", "text": "We stopped here for dinner one night coming home from the Wisconsin Dells. There was no wait. We were seated immediately. We had 3 adults and 1 child in our party. The server was amazing. I think she was one of the best servers we have ever had in a restaurant. We all had different drinks which were kept full. Our cheddar biscuit basket was kept full. Everyone knows Red Lobster has the best cheddar biscuits. We all ordered different entrees. They were all brought out hot and were delicious. The manager stopped by to check on us. It was overall the best Red Lobster experience we have ever had.", "business_id": "v5a-Mj4eO1E--HmgwEWo7A", "stars": 5, "date": "2014-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eeijYsqhg45gcWlnks_eiw", "review_id": "EFcQ6yTQHC4BKcN4nHSlZQ", "text": "Best fish tacos I had in AZ! Workers were really nice and the food was really good.", "business_id": "NYBx4sdSVrN-I5Q8RfLMPg", "stars": 5, "date": "2012-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KT0cm-KvhlR3qxBkWmcywA", "review_id": "loWAtWEiW1N4QOpnFXFFnA", "text": "Our visit to Mariscos made us feel like we were on vacation in Mexico. The salsas (rojas and verde) and chips that we were greeted with were tasty, as was the ceviche. We started with the Mexican Shrimp Cocktail (we each had one), very nice with lots of shrimp and avocado. I had the green cheese enchiladas - LOTS of cheese and sour cream - yum! My husband had the octopus rancheros - he proclaimed it delicious. Both were served with rice, lettuce salad, and beans. The beans were much better than the usual.  We were too full for dessert, should have shared the shrimp cocktail.  House red wine was good and prices were reasonable. It's a long drive for us since we are near Pinnacle Peak, but we will be back.", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 5, "date": "2013-09-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "X_ANOrTu8YoOET3Ria67GA", "review_id": "6fLDihelDwp8QBXbZlVuVA", "text": "I was in Arizona for the weekend visiting my cousin and this was the best last meal we could have together! I can honestly say those are the best fish tacos I've ever had plus their cilantro/lemon/guac salsa is amazing! The waitresses went out of their way to make sure we where comfortable and that my cousins kids where happy. Plus, the place wasnt packed at all and the atmosphere was wonderful with all the bright fun colors.", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 5, "date": "2014-10-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nzpVK65KOQvsRib5_hk1mA", "review_id": "G58V8BF-hrihelcY4apTHg", "text": "Absolutely wonderful restaurant! Great food; the shrimp cocktail was delicious! I will be returning & highly recommend!", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 5, "date": "2015-10-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "K9sG2F8VWs0Fl9O35LJHjw", "review_id": "NWk6VU0C-LoiXTlnCEZJFQ", "text": "I go  to Christo's about 3 times a year.  This place is great.  The food and service are well above standard.  They really take care of you.", "business_id": "3CSaqRNvYg7ZdN2zwxwzVw", "stars": 5, "date": "2013-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "3-8tz7eUL0M9wE4kbV7jqQ", "review_id": "fI77_qgdtuzaQ1sMChvJoQ", "text": "This is the only place I found that will actually prepare my steak rare. They have a fabulous ribeye!! Definitely a great place to relax, have a couple drinks, and enjoy friends and a great steak!", "business_id": "gQjTs4BDNYSu9oJhkEsssw", "stars": 5, "date": "2014-10-24", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 2}, "user_id": "HuGmiFh9v-YxY9FUGx2xHg", "review_id": "GF8MVHri2JJnNYcih4MivQ", "text": "Went to Capital Grille for resturant week Pre Fix menu. I guess I was expecting more. The atmosphere was plesant and the service was not all that bad (waiter was at our table a little too much, interrupting conversation).\nThe salad was ok. I could have had better elsewhere....lettuce was wilted.\nThe filet was ok. My steak was not cooked very evenly and for a five star steak house I was expecting a perfect steak. It also had very little flavor itself. The port wine reduction helped with the flavor.\nThe side was nice a truffle mac and cheese...but again nothing to write home about.\nDessert was good. Pumkin cheesecake, my husband had the apple crisp.\nWould I go back and pay full price. NO. This is not a place for something new or different and the quality was below par.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 2, "date": "2009-09-28", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 1}, "user_id": "ZrpsUVbEkuzhCqRfjM3pGw", "review_id": "aR7VXyIYt5RM-rhELwSWjw", "text": "I have gone to Capital Grille over the years in other locations and have always had a nice experience but the Biltmore location gets a \"D\" in my book!!!!\nThe bar area and bartender were friendly and attentive :) so that part was great! The dining experience was TERRIBLE!!!!  The waiter was not only very rude, he constantly forgot simple things and was totally unattentive... so after 5 things and 2 hrs into dinner we requested the manager who was just the same and sarcastic on top of everything else! For a $300.00 meal that was average at best. Thank goodness the company I was with was wonderful!!!! Too many other choices to be treated the way we were :( I was so disappointed that I wrote corporate headquarters! To be continued when I hear back from them!!!!", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 1, "date": "2013-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rq4PijrrXCCn9MbGCKtIfg", "review_id": "EL_DpuIhA_nSQ2b2Fifpmw", "text": "This is by far my most favorite restaurant! The service is impeccable and the food is awesome! I've celebrated my birthday here and special occasions. I experienced issues with one of my reservations and the hostess helped me out and provided me stellar service.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 5, "date": "2015-11-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GlyZqaff1iXpY91JH9gYcA", "review_id": "mQNWrGsMmpxr-1XzNNyCcw", "text": "I can not give my opinion on the fish cause I only get the shrimp cocktail and hush puppies. I just can't get passed it. I have to order them. If my view on the menu is limited then so be it. As far as the shrimp cocktail and hush puppies are concerned. I love this place.", "business_id": "YxMnfznT3eYya0YV37tE8w", "stars": 4, "date": "2011-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E0QvHiJ5TnqgmV6bvNDo7A", "review_id": "pD339xZGgeF4FMLXAXfBlA", "text": "Lived hear all my life loved the shrimp and chips I felt loyal to  them since I've been going there since my parents took me and now you go there and you get 7 pieces of shrimp the size of chicken nuggets.  I'm getting the 10 piece and  they still barley filling me up.   Soon I'll  need the 15 piece to get full were paying more and they keep getting smaller. The 'shrimp is good but the price keep going up and you get less for your money.  They are family owned and now it seems  its all about saving  money . Its not about keeping your customers happy.  As soon as I find another fish chips I'm done with them.", "business_id": "NXPuaH5R8rMfYqnnP5s1WA", "stars": 2, "date": "2013-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "u3DA1oEIWi8C_OtQMiTIOA", "review_id": "vpli2jL1rGrW9ZFZZk3Bdg", "text": "I came here at the recommendation of my friend, he said it was the best sushi he had ever had, I was skeptical to be sure. Upon arrival the  staff was very friendly and we got  our food quickly. The california rolls are the same  as you'll find just  about everywhere (that is, filled with mayo), and the vegas roll was good, but way too crunchy, almost burnt, it  should have come out of the fryer about a minute earlier. I got the  eel nagiri and it was delicious, although it had too much sauce on it.  Overall sakana was decent  but certainly not the best sushi.", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 4, "date": "2010-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "ghucXeAVEgBeTs0KKdg83Q", "review_id": "_4ocqqFB7jD-ht0KkMkaQQ", "text": "Love this place!!!! Great FRESH  sushi!", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 5, "date": "2012-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "prIWCmDD7by48qnLvOg_1A", "review_id": "7KWlvwLv8Qqci3h5nAzrhw", "text": "Great sushi, but the service here lately has been painfully slow and it's hard to get the attention of the servers when they're not even busy.", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 4, "date": "2015-09-11", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "QTR42Jd_k_AKLNAoKH4Syw", "review_id": "fRCzoGW1OOE322hnpjVRgA", "text": "Best oriental buffet I have experienced yet. The selection of foods is exceptional. Quality is also quite good.\n\nUpdate: Went back recently and quality has gone down hill. Too bad this place was quite good.", "business_id": "-Ogv7rpcgUHkFaSy3vD8Sw", "stars": 2, "date": "2010-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "x6-vmFpTUX6a34j4iUI8Ww", "review_id": "fZgJR8Ev3AzUEXpcxvA8UQ", "text": "If you ever needed ANOTHER reason not to eat at Hong Kong Buffet at Chandler and 48th St, I've got one for you. My husband went there today at 12:30 for lunch with our 1 year old daughter. \nHe got his food and sat down just to notice that none of the food was hot. It was barely room temperature. He advised the waitress of this who got the manager. The manager proceeded to berate him about taking food he wasn't going to eat. My husband explained he wasn't going to pay for food that wasn't fresh or stored at a proper, safe temperature. The manager became angry and followed my husband out of the restaurant where he then called my husband derogatory names, using expletives. \nIt is not surprising they didn't pass their health inspection, and it's not surprising that they were nearly empty in the middle of peak lunch hours. Don't want food poisoning? Don't go to Hong Kong!", "business_id": "-Ogv7rpcgUHkFaSy3vD8Sw", "stars": 1, "date": "2015-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eoHRVWFl0sGc5ABljL079w", "review_id": "8x5L9JxOzxUXd-hjh7Na4A", "text": "I've heard great things about Roy's before but I wasn't super impressed.  I sat at the bar where there was little ambiance.  The butterfish tasted a little metallic but the miso sauce more than made up for it.  The lobster maki was delicious but the rice had far too much sake in it.  Overall, it wasn't worth the price for me.", "business_id": "corPOxxIBRJ7DSpryYvorw", "stars": 3, "date": "2012-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Zx49GNgxBRWqin1ui8AONg", "review_id": "7SVgOqeLdd0GB00SqCn8DQ", "text": "Perfect evening.  Great happy hour w friendly bartenders, Zac and Charles.  Dinner was wonderful! Hubby had  the Ono and I the wagyu meatloaf which was fantastic.  Our server John was attentive and knew the menu! The pineapple upside down cake.....", "business_id": "corPOxxIBRJ7DSpryYvorw", "stars": 5, "date": "2015-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "X3Ms_gpaWLRQB173Z73TQg", "review_id": "rFUUjm3lNev5ALC5ey_Yhw", "text": "Absolutely bulletproof , we have been coming here for 15 years, and have never been disappointed . I have favorites but don't mind stepping out of the box because everything is so good. Service is 5 star also.\nKeep it up Carrabbas !", "business_id": "k-KhKfLPjBxjSHppWoUyOA", "stars": 5, "date": "2015-09-20", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "Ha4pc2q3HqczrifpU2K7pg", "review_id": "UBEba99n1aUIjn-3qHOp_g", "text": "Very disappointing.  Had to go to Phx for a training and arrived later than expected last night and HUNGRY.  Our hotel was super close to RL and we were excited to get dinner.  I'm not sure if the fact that we arrived at 8pm explains how lacking the food was... or if I'm just trying to find an excuse for RL and how bad the food was.  L and I have been fans of Red Lobster for years.  We don't often get there but when we do, we are all set with our regular order of the popcorn shrimp.  Our server was very quick to get the food out,  which seems like a good thing but was also ready for us to leave ASAP.  I'm a bit confused by this because the restaurant is open until 10 and we left by 9:15. \n Back to the food. Generally, I love those warm biscuits that are absolutely terrible for you. Last night, I only had one because it was neither  warm or tasty.  The salad was meh.  The popcorn shrimp was on the cold side and the fries were not terrible but were very salty.  The salty fries may have been my favorite thing and that is just plain sad.  Decided to go all out and have a specialty drink, which was really nothing special.  i ordered the Malibu Hurricane and it sure wasn't anything to excitedly Yelp about!  \nRed Lobster does an excellent job of tempting you with yummy looking commercials and endless shrimp for $15.99 but the reality doesn't come close to expectations.", "business_id": "k8q3ypIoIzchdp3RoRUsJw", "stars": 1, "date": "2011-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "APLIPfq1Rf8QyhHHk2uAyA", "review_id": "8QxFMdT8meIuM6Adx41C9Q", "text": "Owie. My belly hurt after eating here. \n\nI was looking forward to steamed veggies, but they didn't have any. Said they were out. Total bummer. So, I ate some shrimp spring rolls and sampled others. I steered clear of fried stuff, but it didn't seem to matter. My belly was upset almost immediately. Maybe it was the coconut bread. I couldn't help myself; it was super tasty!\n\nAfter my friends had plucked something off the dessert cart, the server brought us some bok choy. I thought they were out, but I guess they had some hiding in the kitchen? Anyway, I ate that happily. It was the first time I ever tried bok choy. I'm a fan! Not of this place but of the super healthy veggie. \n\nI think I'd rather go to YC's Mongolian Grill again before ever coming back here.", "business_id": "z4KFTJQsAdxqMZA7Fx0A9A", "stars": 2, "date": "2008-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ey1e9lVFzTQJTiZvla5PGw", "review_id": "dS8yZyIVFE54xth9gUJ6Ow", "text": "I'm sticking with a 3 rating for now. I will definitely try this place again to get a better feel for it. I did an online order and ordered the C-FU Chicken. I didn't realize that there was a lunch option. I think it is only on their take out menu in the restaurant. The online menu is a little bit more vague and harder to manage. There are also no descriptions of what things are. \n\nI figured C-FU chicken was like a house special and had more involved. It was just tempura fried chicken swimming in a really runny vinegar sauce and some cut up chilies on the top. Would not order this again...Especially if you want vegetables in the dish. Although, I suppose it's not likely that you get many Chinese dishes with tons of veggies unless you are getting a veggie dish.\n\nThe plus side, one of these dishes is probably enough to feed 2 people if you are both willing to eat the same dish. \n\nUltimately, was not a fan. I still give it a 3 though and will go back because it is close to work and I want to compare something that I know like orange, cashew or almond chicken to get a better feel of what's going on. I'm also going to try a lunch special to save a couple dollars and get an egg roll or crab puff that comes with it.\n\nWill let you know what I found out, again.", "business_id": "z4KFTJQsAdxqMZA7Fx0A9A", "stars": 3, "date": "2014-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-29OE0d9ov1InVX6a3hgsQ", "review_id": "3chletm9K6XOVHfxmAtm_g", "text": "I can't say enough about the service!  Our waiter (I forgot his name! ) was amazing! 2 of us got the endless shrimp and we couldn't keep up with him!!! We tried every type and they were hot, fresh and deliciously! My husband wasn't very  hungry and got the potato soup, which he didn't care for, but our waiter did everything he could to make it right.  I hadn't been to Red Lobster in at least 5 years after the continuous poor service and sub-par food. But that has CHANGED!  We will be coming back for sure!", "business_id": "txCJurIIrE9ZoHu3gZUvnQ", "stars": 4, "date": "2015-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Tiz_0dI9qAILxcL_lGN0Uw", "review_id": "zLjbDHlclw8JGNdZfaixEQ", "text": "My wife and I went to this Carrabba's and usually tip very well. I could not bring myself to do so this time. The service was awful. We did not get what we ordered when we ordered it. We didn't get checked on... no refills and kind of rude attitude. \n\nThe ambiance was very wrong for a Carrabba's. It is far too bright in this restaurant and there were way too many high school kids talking about contraception.\n\nWe need to get one thing straight. Tiramisu is composed of ladyfingers soaked in espresso and marsala wine with coffee liquor layered in marscapone cheese. What was brought to us was dry sponge cake  with whipped creme layers. Do not spend 7.90 on this dish.... or better yet go to the Carrabba's in a better part of town.", "business_id": "cKxXBvOithS-Ic5KnhEKrg", "stars": 1, "date": "2014-10-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dKx6EdEQZ3-ngWOTd0AFpA", "review_id": "7AtaptpYWlADlu7dXCeixg", "text": "One of my favorite late night dinner places.\n\nGenerous portion sizes of a variety of steaks! I also love their French onion soup with crisp bread and melted cheese goodness. Their salads are huge and very very reasonably priced. Great place for a date. Also, be sure to pick up one of their dinner mints on the way out. It's the only place that has it! Mint hard shell candy with gooey chocolate in the middle. Love it.", "business_id": "xMK01ZbVUYLLoyqoeWAIVw", "stars": 5, "date": "2011-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FNyudWWNhByQ7Qpte6cYKg", "review_id": "p2I3G5dVaEPcRidVx6ie0Q", "text": "I was pleasantly surprised with the Keg. I wasn't expecting too much from the outside. Looks nice - stone building. Location is right next to the mall.\n\nOnce inside.. whoa! I can't see anything! It is so dark inside it's really tough to see the person across from you. At least in the lounge area. I was here around 5:30pm, and it was still very light outside, and extremely dark inside. The service in the lounge area was ok - a little slow. \n\nDinner service - was better than the lounge. However, I sat at a table with 7 other people and they brought 4 pieces of bread. We had to ask for more, which  seemed to frazzle the waiter a little. Serving the food was a little jumbled - one of these \"raise your hand if you ordered the Caesar salad\" type of things. \n\nOverall, the Caesar salad was good, my sirloin steak was good - a little over-done for medium, but still good. I was pleasantly surprised.With a name like \"The Keg\" I really thought this was going to be a divey-beer joint - which it definitely is not.", "business_id": "xMK01ZbVUYLLoyqoeWAIVw", "stars": 4, "date": "2014-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G72bs75BqgW9NAVv00ADTw", "review_id": "UjnsxjGCDxGOHOGXfNeW-w", "text": "Went there for dinner today, seated immediately, good service, good food, the cheese bread is evil.... lol...\n\nWe shared the spicy buffalo bites (or something like that) with blue cheese, and a blackened cod. Garden salad.\n\nFood was good, as a side we selected baked potato and it also came with broccoli. Broccoli was exactly right, not too soft, not too raw.\n\nBuffalo bites were spicy and flavorful. The only thing I didn't like is that the bed of lettuce (which I usually eat) tasted bad, like old :(\n\nOther than that everything was good and our server Mike was great.", "business_id": "YgRCJtt7pGvwlb9Ktumeeg", "stars": 4, "date": "2013-10-26", "type": "review"}
