{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7IPdr4DfB5TizGvUGZeozA", "review_id": "xyCU39E0Vo-OW5G45WuKkw", "text": "I am not impressed.  The food was so-so and my boyfriend and I had a coupon purchased that morning from restaurants.com and they wouldn't accept it. I bought it that morning, sorry if it should have been taken off the website but you should honor it. I would not pay their full price for it, but with a nice coupon then maybe it could be worth it. The quality of the food was not good enough to outweigh the service.", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 2, "date": "2009-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UhLaUJbGQ-ZkBHqjV3vJuw", "review_id": "_H6-1YRkBUmAXVSkI9wIyQ", "text": "Excellent, balanced, homemade cuisine. Impressive balance of flavors. Very reasonably priced lunch buffet. Even the chai was delicious.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 5, "date": "2015-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kDYpTc-yc8UAxCs_LhX1yA", "review_id": "aOL4jg2hyrHlDA6XDK6QpQ", "text": "Though I'm a Copper enthusiast when it comes to getting my Indian fix in Charlotte, I'd heard that Maharani was a cheaper but tasty option, so we ordered from there a few nights ago. \n\nCopper is definitely still my place, but Maharani was fine enough. First of all, the food came very quickly, which is rare. Usually indian food, good indian good, takes at least 30-45 minutes. We got our order in like 30, which was great 'cause we were starving. \n\nThe Tikka Masala was spicy and pretty good, but it wasn't as thick and saucy as i like. The salad was just so-so. The Naan were all amazing. Definitely the highlight.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 2, "date": "2008-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QFf4tCRk2C9dSn9ILZERUQ", "review_id": "dFG-7f1UeIudwoIO58_LQA", "text": "The best place for Indian food in Charlotte. I tried lamb briyani, gobi lasanwala, naan, chicken tikka. Everything was perfect.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 5, "date": "2013-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nOa46hNJPUkp-33br-7hMg", "review_id": "f4oH75H3hs6XgH0aneVfqA", "text": "The staff here make the experience. Since I am not a fan of buffets, I can only tell you about the meals here. DELICIOUS. I don't eat meat, my boyfriend almost only eats meat, we both found things we loved. it was the best! We liked to eat here once a week since it was so amazing.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 5, "date": "2010-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RmQn2jSDW4fYEKU5OG3tEg", "review_id": "Ic7jaH_3zLJWlMLk1KEuhw", "text": "So good!  Solid Indian food!  Lunchtime special cannot be beat!  Note - it gets busy so be prepared to have to wait if busy meal time.\n\nIf you are concerned about spice tell them and they will show you the options for non-spicy dishes.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 4, "date": "2013-09-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NsIoM2PlaL28E-jbrs4Zlw", "review_id": "eFjhTKsY32budYE462QQOw", "text": "It was our first time here so we had to have the defaults to judge the quality.  Everything was well prepared and spiced well.  You can actually taste the flavor of the spices and the heat doesn't kick in till you stop eating.  Any other restaurant we can normally eat super spicey, but we went conservative of 4 out of 10 and that was perfect.  The food is hearty stick to your ribs.  Two dishes, a rice and two naans was enough food for three plus enough leftover for a fourth diner.  So even though the prices are a bite high, it works out in the end.\n\nMango Lassi - creamy and refreshing, not too sweet\nChicken Masala - sauce was a little thick but well spiced\nMalai Kofta - sauce was a better consistency but was not a fan of the homemade cheese balls\nPeas Pulaou - ok\nPlain and Garlic Naan - both good but the garlic one kicks it up a notch.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2010-09-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "67J3LhKWWKA38Q2345axCg", "review_id": "K2DBhlFes6ALbTDZAYcM6Q", "text": "Really nice indian. Location could be better, but that's just nit picking. Delicious food, hot is important, service adequate.But again GOOD FOOD.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2014-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5oLghpNAIeYA40RQ6645rg", "review_id": "OxIttWNhzs-N2qqXQrfiCg", "text": "This is the first Indian restaurant we've tried in Phoenix since we moved here from Washington, D.C. I wouldn't say it was the best I've had (nothing tops the Clay Oven restaurant in Frederick, MD-we may be biased because of a huge indian community there), but it was good enough to suit us. We're vegetarians-we ordered the eggplant dish and lentils dish, both which were tasteful.  The naan bread was a bit too crusty compared what we've tried before. The samosas  were unusually small, but good-I liked the spices they used on them.  The huge plus was they put fresh herbs on the dish.  The prices were reasonable for two dishes, and we had plenty to left over to bring home. I was fairly entertained by the Bollywood playing on the tv. (I just LOVE bollywood dancing!).", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2009-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_4lqpCYCqOQzbB6xQGGhrQ", "review_id": "koujhWhA6Xg3_6JQRKN_XQ", "text": "$10 for a delicious lunch buffet?  Yes please!  The owners are super nice and the food is quality.  Love this place!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2014-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "x8y1nxyvDJ7fOySblW8mww", "review_id": "HxpowgxC7R4elYJ56q1MPQ", "text": "Visited last night with the wife.  She is a big Indian food fan and she has been introducing me to the cuisine.  I have to say this place was great.   The only thing I would say is that we ordered each dish medium heat and it tasted as though there were no spice at all.  Food was great and the price was very reasonable.  Snagged up a coupon on restaurant.com and  we ate for a very low price.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2011-10-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AhfLEVQ0fESI5doCb9L7Lg", "review_id": "-Sey2O3wt7pVrr7qy5OEtA", "text": "I'm Indian and this is some of the best Indian food in all of Arizona BY FAR! Best north Indian cuisine in AZ for sure. \nI love the malai kofta and the lamb dishes are to die for (kadai lamb, rogan josh) and chicken tikka masala. Kadai paneer is very tasty also! The spices they use are amazing and I have never had a bad meal here. The food can be spicy, which I like, but you can tell them to make it mild if you prefer that. The ingredients are fresh and food tastes like it was made that day unlike some of the other Indian restaurants in the valley.\nDon't forget to order a mango lassi too...SO YUM!\nI usually order a la carte and get a naan or keema naan (naan bread stuffed with lamb). If you go with someone order a couple of dishes and breads to get a variety (true Indian style eating). \nI really love this place for north Indian food! I go to Chutney's in Tempe for South Indian cuisine.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2015-10-21", "type": "review"}
