{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fVnY5R9Wx8nhER6iWhcrsA", "review_id": "un9egWi0RTDbZXaWu0TpZQ", "text": "I pretty much change eye doc every year.  Each of my previous docs were ok.  They go through the motion, are professional, and gets the job done.  All of them were average and I didn't feel the need to go back to the same one. \n\nI found Pittsburgh Eye Associates and decided to give them a try since they were near me.  The staff at the front desk was friendly and we even had some small talk. I think this is the best thing about the place because every other place I've been you always felt like you shouldn't bother the staff.  Even when I made my first initial call to set an appointment was pleasant.\n\nI got Dr. Cecchini and felt he was easy to talk to.  We small talked.  He asked where I was from and we talked about off topics.  I felt I could talk to him and be more myself.  The eye exam was quick and efficient.  I'm pretty much mentioning this because the other 1-star review didn't like it.  Mostly, because the pre-test showed my eyes hasn't changed, and my prescription was pretty much the same. He asked if I had any complaints or any issues with my eyes and I said no.  Dr. Cecchini did all the same tests and inspections on me that every other doctor did.  I didn't felt once he was skimming or rushed.  He gave me some recommendations, gave me my scripts, and I was on my way. \n\nOverall, I had a pleasant experience and this might be the first doc I'll see again next year.  I don't know what else I could ask for more.  Staff was pleasant, doc was pleasant, and everything went quickly and smooth.", "business_id": "U071C9Sl-ICavtE0hUMpcw", "stars": 5, "date": "2015-11-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SDkp0xWPmA20UTj8m4R6Rw", "review_id": "rAoq9X6u0ccdxJPkiJSHvQ", "text": "The receptionist was so unbelievably rude and condescending to me I cannot believe she is employed at a medical establishment. I haven't had the chance to visit this business because this staff member was so rude and dismissive to me that I took my business elsewhere. Advice to the management, find yourself a receptionist who can speak to your potential patients in a polite and professional manner and not in the pretentious and uneducated way I was spoken too. Also, was put on hold for an excessive amount of time before I was rudely dismissed.", "business_id": "mMA6f_xF9kzTvU9kUCBo9A", "stars": 1, "date": "2014-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Dkr_ta0wE2JVXfbSi917_g", "review_id": "jv79Uhh29UqQw3QPhPWQCw", "text": "I have a great experience once I'm through making an appointment and getting through reception. Dr. Dickey is wonderful. But I have to echo what the others have said below. Whoever answers the phone is condescending, rude, and I often have to press to make an appointment. Once I was told there was nothing available for several months but when I asked her to check again there was \"magically\" another spot a week away. Dr. Dickey and the assistant staff keep me coming back but the reception has several times made me wonder why.", "business_id": "mMA6f_xF9kzTvU9kUCBo9A", "stars": 3, "date": "2014-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xH1ucQsUiHFR4Ndyzp_VGg", "review_id": "EeZOW2FJPfZwgbODtXuoVg", "text": "Dr Jim Dickey is the bomb!!!!  He has a gentle nature and great bedside manner. He told me conditions in my eyes that my previous ophthalmologist didn't.   I highly recommend him.  However, it is true about the Mt Lebanon staff being a bit rude.  I usually go the the Canonsburg office,  the staff there is great.  I called Mt. Lebanon to schedule an appt for my mom to see Dr. Dickey and the one receptionist was a big impatient with me trying to juggle an appt for mom with my work schedule.  But, in my book Dr. Dickey is worth getting past the rudeness.  I completely trust him with my eye care.  I know I can trust him.", "business_id": "mMA6f_xF9kzTvU9kUCBo9A", "stars": 5, "date": "2015-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9uhEw9Qjh_EGO8pPAJes8g", "review_id": "VI2CERuQjbg2Chlp4hzJbQ", "text": "It is impossible to get an appointment and be prepared to wait an hour before being seen.", "business_id": "ZLO5b4ZOJsBNHF0Bp1iXZQ", "stars": 1, "date": "2014-10-29", "type": "review"}
{"votes": {"funny": 9, "useful": 16, "cool": 13}, "user_id": "s_sAdwMW2aimtkrJyi0UCw", "review_id": "WVrbpM3v6CuQaH-8GwBepQ", "text": "I've been coming to this office for over two years now and I have nothing but good things to say about it. I've seen different dermatologists over the last fifteen years and for me this is the best. This wasn't the first Derm I visited in the area either. I had a horrible experience at a different doctors office (there's a review somewhere for that too) and after that visit I went looking for a different doctor and found this place. I have seen two different Drs here and one Physicians Assistant. Both Drs are Bunimovic Mrs and Mr. All of whom have listened to me and actually carried on a conversation about treatment options. I can tell you this is not the case everywhere. I also like that I can message back and forth with my Doctor. If there's something I have a concern about I can take a picture send an email and I normally get a response within 24 hours. Also when I have had tests done I have received calls from my Dr. Not his nurse or an office person but my actual Doctor. This is a rarity now a days.  I do have to say sometimes you might have to wait a few weeks for an appt but they do have a waiting list you can go on and they'll call you if a place opens up. If it's something you feel is urgent let them know and they will do everything they can to get you in asap. This particular office is more for the medical side of dermatology but they do have another location that focuses more on the cosmetics side of things. If you are like me and need to see a Derm on the regular I cannot recommend this office enough.", "business_id": "ZLO5b4ZOJsBNHF0Bp1iXZQ", "stars": 5, "date": "2015-11-01", "type": "review"}
{"votes": {"funny": 1, "useful": 9, "cool": 0}, "user_id": "27aGnUabXY23OH5oilHe7g", "review_id": "TcOyTcILBOGss0oieOIPVA", "text": "Well after many problems with this office, I have now been \"dismissed\" from the practice with the reason being \"a recent communication through their patient portal\"\n\nLet me tell you what the communication was about.\n\n I had a full physical with PA. Christopher Jenny. During which I told him that the Ambien he had previously prescribed caused a \"zombie like\" feeling the next morning. I take care of my 11 month old on the regular by myself, and do not want to be in any kind of \"off\" mental state. This was a lengthy discussion about the Ambien, during which I told him I did not want to take it anymore, and asked if we could peruse different options, that would not have such a lingering side effect, as I did have trouble sleeping. He replied, to take more of my prescribed benzodiazapam to help fall asleep as needed, and to follow up if I needed something else.\n\nAbout a week passed and I messaged him via their patient portal. Stating my concern that I was using too much of my benzo, and that I would need something else, or more to compensate for my lack of sleep. His response almost 48 hours later (even though their website clearly states that messages would be returned within 24 hours) informed me that he had called in a prescription of Ambien for me at my local pharmacy. Ok....did I imagine that whole appointment....and conversation about how I DON'T WANT TO BE ON AMBIEN.\n\nWell in response I expressed my concern over the lack of note taking and listening/attentiveness during my last appointment and that I was concerned about that. It is a little disheartening to learn the person who is supposed to be caring for your well being obviously had no idea,  or didn't care enough to look at my chart or even take notes in the first place. I am an EMT, i know the importance of patient history, and it is clear that Carolina Family Healthcare has zero concept of that.\n\nI was also approached during my last visit about my negative review about the practice, The office manager asked me to stay after my appointment to talk. I explained that everything I wrote in my previous review I still felt true, and that the reason I even came back after they screwed up one of my wife's appointments, as well as scheduling my then 6 month old while the office was at lunch leaving us standing in the rain, was to give them a second chance.\n\nWell it wasn't until I removed my more positive re-review of the practice after my terrible experience with PA Jenny that I received my certified letter informing me that I would no longer be treated at their practice. The kick is that it was signed by Dr. Kanelos, who never even had talked to me or approached me about anything. I have never even seen the man in real life, but he dismissed me from the practice. I believe this has a lot to do with my Yelp review. Although I may be harsh with my reviews, I tell the truth, and have not lied about a single thing written here. \n\nAMA guidelines establish and I quote \"Discontinuing patient-provider relationships should be undertaken only after a serious attempt has been made to clarify and understand the expectations and concerns of all involved parties.\"\n\nThis NEVER HAPPENED, or even close. Again proof that this office JUST REALLY DOESN'T CARE.\n\nI will spread the word of the complete lack of professionalism, as well as the dismissal based on a yelp review. I do not believe questioning why I was prescribed Ambien, after telling them I don't want to take it would get me dismissed during the middle of a new prescription plan, leaving me to find a brand new doctor and office to try and continue what has been prescribed. \n\nGood luck dealing with this office, and good riddance. They lost 3 patients because of this already within my household and as many more as I can spread the word to.", "business_id": "2yBBmcVEbhrGrk-hAUAfJg", "stars": 1, "date": "2013-10-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sskKDEBqKT1vxGZYq3gApw", "review_id": "sYOmtM2GIN-C8eh9KEBEsQ", "text": "I liked going there while they were located in Weddington. Now it is much larger, less personable, and I much more profit oriented. This place is no longer a \"family\" doctor place. They now target people interested in elective work that are high-income.\n\nAlso, they are dropping all insurance providers except BCBS. So if your company is susceptible to changing insurance, stay clear.", "business_id": "2yBBmcVEbhrGrk-hAUAfJg", "stars": 2, "date": "2015-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "rS4Ty6uiLESZHeocNNu6uA", "review_id": "M7mlv3mwKxcZzzEodEY--Q", "text": "After terrible experiences with two male neurologists, I went to Dr. Andrea Diedrich. I love her! So darn smart, so patient, so empathetic, honest and kind. I feel that she respects me and I cannot say that about the two guys I saw, one in the same practice. I am so grateful to have her in my corner.", "business_id": "1nUhZPE06iQRKI6_z78IjA", "stars": 4, "date": "2014-10-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "do-fO-EruYVP_FQPMNWmZg", "review_id": "jjFG31HHULLKVB65rcU47A", "text": "After my Mom moved here 2 years ago she was in need of a Neurologist and received Dr. Karner's name.  Since moving here she has had several general checkups, as well as few ad hoc appointments and calls to address some concerns that she had had, due to her side effects she has from a brain hemmorage 10 years ago.\nUpon arrival the receptionists are always very welcoming and the office waiting area is comfortable, and we have never had to wait more than 5 minutes..very rare compared to some other offices I have visited recently.\nDr. Karner is very friendly and always shows a concern for my Mom, and everything she has to say.  He addresses each area of concern in a matter that I always feel is appropriate. He weighs all the options before making any medication changes, etc.\nOverall, I have been very happy with Dr. Karner and my Mother is as well, a real pleasure, especially when dealing with this type of area.", "business_id": "1nUhZPE06iQRKI6_z78IjA", "stars": 5, "date": "2015-10-27", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "ITwewV_k1EcFgxfWNlssqQ", "review_id": "2qvnpzAA6tbykL2kMx_cfQ", "text": "Dr. Caroline Pierce is my primary physician at Mecklenburg Medical Group, and she's awesome. She makes you feel very comfortable and at ease, and you can tell she actually cares. Usually at the start of each appointment, she comes in to talk to me about why I'm there, etc., before examining me. One time I had a serious health problem and she helped get me into CMC quickly for some tests, so I didn't have to wait in the ER. Then she called me later that day with the results, which was impressive. The staff at her office isn't always the friendliest, but if I call with an urgent need for an appointment, they always figure out a way to get me in.", "business_id": "iYlGqyRNH5UYQABKsDuuDg", "stars": 4, "date": "2008-11-17", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "jp5lBxgdCpDRhSeEuRK_kA", "review_id": "pTOPbk8jcvIYCJpRcjllcQ", "text": "Dr. Wanda Robinson is one of my favorite people in the world:-) Never had a doctor that genuinely cares for her patients and is not afraid show it. I know she gets sick of me(proclaiming to be a dr in my own mind) self diagnosing myself by way of the internet.......please forgive me:-) The office is conveniently located uptown in the BB&T center and I've never had a problem getting in for a last minute appointment or if there is an emergency.", "business_id": "iYlGqyRNH5UYQABKsDuuDg", "stars": 5, "date": "2010-11-04", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "nCYa2uqoFhR1GATdMu6ltA", "review_id": "B3LpwqOwTCOxJdCEweQKQQ", "text": "The doctor prescribed me medication that I am allergic to. It was in my chart and I told her about my allergy in person. I ended up in the emergency room. The practice manager does not seem to care about the issue and their whole staff is awful.", "business_id": "iYlGqyRNH5UYQABKsDuuDg", "stars": 1, "date": "2013-09-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J0h_oB2VEhMTlcqKmspjWQ", "review_id": "u4j3vBRVzGKGjclKeCjD6A", "text": "I have been a patron of this MMG office since I came to Charlotte many years ago.  I have been with Dr. Robinson since she began with the practice.  I was wary of her being so young but we have matured together.  I like that MMG has a myriad of physicians on hand so that when I need an urgent appointment (which has not been often), I know who I would like to see vs. seeing someone who has no beside manner.  Being in that position doesn't help you when you are ailing.\n\nThe Uptown office provides free parking in the deck beneath the building so I have continued to be seen at this location although I no longer work in the area.  MMG has offices throughout the area so once you decide on a location, you can check out the physicians who see patients there before deciding.  From my experience, the physicians tend to stay at MMG so there's no so much of a rotating door.", "business_id": "iYlGqyRNH5UYQABKsDuuDg", "stars": 5, "date": "2013-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JMsDXE5LixY2dqwnqgYkjQ", "review_id": "Zy3_ZlII3eSp_svBr8DKxg", "text": "Good for the most part.  Umar Bowers is a nice guy, cares about his patients & their health and well being.  For this reason I would recommend him as a primary care doc.  He is knowledgeable, methodical, patient, & comprehensive.  One of the best primary care docs i've seen.\n\nOnly complaint is one of the personnel that draws blood in the lab.  He could have more of a customer service oriented attitude.  He tends to be abrasive & abrupt.  \n\nOverall, a fan of this practice!  Would recommend it!", "business_id": "iYlGqyRNH5UYQABKsDuuDg", "stars": 4, "date": "2014-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k6TLZQqfNKpr3L-8liC3vQ", "review_id": "-F2G_B4DUzgl5dhwXa1Zpw", "text": "The staff was  really friendly and the doctor was very helpful. Definitely staying here", "business_id": "iYlGqyRNH5UYQABKsDuuDg", "stars": 5, "date": "2014-11-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Dafb-if-dxgT2KrQbKszCQ", "review_id": "QFaOoq2x0xdOXa-mpg2eYQ", "text": "I hate to say that I have almost no ability to get an appointment with my doctor at MMG uptown Dr. Wanda Robinson. I don't know what is happening to medicine patients appointments etc. all I know is I can almost always call when I'm in need and not be able to see my Dr.  Robinson of over 20 years. It makes me very unhappy. So at this time I cannot  any longer recommend any doctor at MMG uptown because if you get one of them you won't be able to get into see them so you will become frustrated and will be looking for new doctors after you've built a long history with your doctor. This saddens me to say. So now if someone has a very good primary doctor I am in need of One at this time.too.   If you could give me some heads up I sure would appreciate it thank you.", "business_id": "iYlGqyRNH5UYQABKsDuuDg", "stars": 1, "date": "2015-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "konAl6y0BEZRXosXQdKiBw", "review_id": "-lZUJLhfbTv96nuCmEZG1A", "text": "Dr Palermo delivered my son. I absolutely loved her and her care. She is in high demand so I don't get to see her during exams but will definitely have her delivery my future babies!", "business_id": "8BOcD4EO-9hhEWps0fXm6g", "stars": 5, "date": "2014-09-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KINJ-a5KvwPwTCH0lyC33A", "review_id": "JM_WN8F_fXKeE7-HkAco4Q", "text": "I have been a patient with Rankin's Women Center for just about 20 years and I hope Dr. Palermo never retires.  My review won't do justice to the enormous amount of gratitude I have for her, she is by far one of the most outstanding doctors I've ever had the pleasure of knowing.  Dr. Palermo listens to me.  She takes her time to have a discussion, to answer my questions, she gives me support when I need it, and she is outstanding at her profession.  I've lucky to have found such a compassionate and caring Dr. in a conveniently located office (although I did prefer the other office atmosphere better ;) )\nKudos to everyone at Rankin Women's Center for standing above the rest!", "business_id": "8BOcD4EO-9hhEWps0fXm6g", "stars": 5, "date": "2015-10-16", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "CJ3h03y5eiwuDMYtoHf6WA", "review_id": "yxNNrKjsbFQ5bwbYmkY1Dg", "text": "I had the LASIK procedure performed by Dr. Ugland and highly recommend him. He performs LASIK on all of the Carolina Panthers, so if the NFL trusts him... I think you're good! :)\n\nFirst, you go in to see if you qualify. After that, you cant wear contacts for 2 weeks, put a few drops in and go in for the procedure. The prep for the procedure takes about 45 mins. The procedure itself probably takes 20 mins. Plan to be there 2 hours (includes waiting time). They will give you some Zanex to relax and trust me it helps. I didn't mind the contraption holding my eye open at all. I was TOTALLY relaxed.  Dr. Ugland and the nurses are totally warm, comforting and sweet, so that helps you relax also.\n\nThat day, you wear shields on your eyes (plastic see through covers) and go to sleep. The more you can rest, the better/faster you heal. I got up for a bit to eat dinner and that's it. Your eyes will feel slightly gritty like some sand is in them. Mentally prepare yourself before the procedure to NOT RUB YOUR EYES. Then you lubricate and put eye drops in your eyes every few hours to avoid an infection. You will naturally want to put wetting drops as they feel more dry.\n\nThe only side effect I experienced was that there's a halo around lights at night and  had some red spots on the white parts of my eyes from the pressure of the machine. About a month later it has subsided, but its normal for up to 3 months.\n\nThe result? Immediate. As soon as I got up from surgery, I could see the clock. I went in for my check up the next day and my vision was almost 20/15.. better than 20/20.\n\nToday was my one month follow up and my vision is 20/15.\n\nI can see my alarm clock, go swimming, travel with ease... its a miracle :)", "business_id": "UOLNw0-7GjxomFQiHUXisA", "stars": 5, "date": "2014-09-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ecnF-zjCn81vY7nz45UY-g", "review_id": "eA9WZRpuSoPiX7o9DoBARw", "text": "Dr. Hoover is very personable and knowledgable and his staff members are very nice. The wait time is really challenging for a toddler...an hour past appointment time. I know wait time comes with specialists but this was a bit much. I plan on returning for a follow up with my daughter and have high hopes that it was just an off day.", "business_id": "UOLNw0-7GjxomFQiHUXisA", "stars": 4, "date": "2014-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WkEAs0nUxObzNP9dNlVj8A", "review_id": "TwH2xFiLIbTLQDfQOjnGGg", "text": "My daughter was referred here to have an ingrown toenail removed.  The doctor did a fine job, but I was disappointed in other aspects of this practice.  The phone number on the web doesn't work - must be an old one.  The office building sits back off the road and is easy to find, and when I called to get landmarks, while trying to find it, the auto answering announcement came on saying that due to high call volume, all operators were busy.  Luckily we found the building about 5 min. later.  One other lady walked in the door just before us, but no one else in the lobby.  No phones ringing off the hook, one receptionist actually \"receiving\" us, and another was surfing the www, looking at dresses!  High call volume???  Riiiight!  Even though I told them that my daughter didn't swallow pills and needed a liquid antibiotic, they prescribed her 500mg horse capsules that I was supposed to get her to eat - mixed in something.  It smelled and tasted awful.  They decided to extend the length of time she was on it, but didn't inform me.  I found out from the school nurse who spoke to them about givng the meds at school.  The culture came back, and they needed to change the antibiotic anyway.  The assistant who called to tell me that they had called a new Rx in to the pharmacy said that she couldn't tell me what type of infection my daughter had.  I told her to have the doctor call me back, but to give me about 30 min. to get home so that I could write it down.  Of course that part of the message didn't get through because he called me 10 min. later while I was drivng and could take down the name of the infection.  From what I could remember of the type of infection, when I googled it, I couldn't find anything, so I still don't know what it was, and have put in another call.  When I asked him about the antibiotic, he had trouble telling me about it.  Today, I called again, and requested that they send the records to the pediatrician, and was told that they had gotten \"lost\" because they send their dictations out of state for processing and had to send them again.  I simply do not get a good feeling about practice!", "business_id": "ByctOq-Af6lAZxROXkXTXw", "stars": 1, "date": "2014-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "n2rOPk5hFZne0JalL190Fg", "review_id": "eEVd3yKEaTD-NrFowwHG-w", "text": "I was a patient of Dr. Lind.   I was prescribed a medication that needed to be specially made and sent to me and after a week I hadn't received and called and found they never ordered it.  Looked past that and this week had terrible pain in my foot. I called on Monday morning and again Tuesday and didn't receive a call until Wednesday, which I missed but called back later.  Never heard from them again.  The Park Road office has terrible management and are very unprofessional.  Since I couldn't reach Carmel Foot Specialists and they do not return calls in a remotely timely manner I went in to get my records.  I was very unhappy with them and the office manager was extremely unprofessional including a parting comment of 'Have a Nice Day' meant to be sarcastic.  I advise getting to a podiatrist who has his office managed well.  I have never been treated so badly by a physicians office.  I clearly got the message that patients come and go and none of them are important.  \nThey will not be there if you need them ,  I highly suggest you find another practice.", "business_id": "ByctOq-Af6lAZxROXkXTXw", "stars": 1, "date": "2014-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eQ5gtDF4dqKmdDw--5mOdQ", "review_id": "bwQQxCqht7E7xoBPOUKoVw", "text": "My doctor is Jessica Kaiser - she's one hell of a lady.  They have a new online system that you can make appointments and ask for refills with, which is very convenient.\n\nI think she's the greatest MD I've ever had :)", "business_id": "siixOX00BhEkUlKg3n06tA", "stars": 5, "date": "2011-09-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "j60JaPr8l-pproz4Q7BuMQ", "review_id": "N0jfzAbydu4nKOg9pspE1g", "text": "I relocated from the DC area last year and needed to find a new doctor. I've made 3 visits to Carmel Family Physicians. I was referred here. Overall I haven't had any major issues or reasons to dislike it. The staff that works the desk (checking you in and checking you out) is terrific. I've had very good experiences with them as far as scheduling, medical records, overall friendliness, etc.. and all the while, they've been very friendly and welcoming. Beyond that I can't really say that my experience has been all that great.\n\nI want preface this by saying that, if you're the type of person that wants to go to your doctor, keep it short and sweet and straight to the point, then maybe this review isn't for you. but if you're like me and you want a doctor that you have a familial rapport with then maybe this review applies. \n\nLet's just say that I don't question the doctor (or nurses) ability to treat, diagnose or prescribe things to me. I feel that the doctor I've been seeing is more than capable of doing those things. but I also believe that with healthcare providers there should be a certain level of warmth and care that goes along with the medical proficiency. And based upon my visits, I haven't really felt that. I wanted to give them the benefit of the doubt, which is why i've gone there three times. And that's why in my book they get an OK rating and not a great one. But I'm sure that different people have different experiences there and I also am aware that a number of doctors and nurses work there, so take my review for what it is.", "business_id": "siixOX00BhEkUlKg3n06tA", "stars": 3, "date": "2012-10-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lfZAzn-__8fnN6H8eQ6vuA", "review_id": "1zuvXjYi1MyhxqwxDUfpHQ", "text": "Run, don't walk, away from Carmel Family Physicians!\n\nI've been a patient of CFP for about 3 years.  I've never really been happy, but as I've been looking to leave the area, I hadn't pursued another doctor until now.  By far the biggest problem they have is their phone/support staff.\n\nI certainly don't expect CFP to diagnose me over the phone, but if I contact them for a follow up on an appointment I had, it's like pulling teeth to get a call back.  Calls typically take multiple business days to be returned - if they are at all.  This includes the time that I was in pain to the point I was spending 1/2 the day in bed.  Or the time I was traveling and forgot my prescription, and asked for a small quantity to be prescribed as I was 2000 miles away from the only bottle I had.  I've even called and spoken with management about not getting timely callbacks, but nothing has changed after months!\n\nTheir patient referral service isn't any better.  I've been called and \"told\" by their staff when my referred appointment was - without any input from me on what fits my schedule.  I've tried asking them for the name of the doctor so I can make my own appointment, only to be told they don't have that and only the referral person does.  Or the time I was in pain making it impossible to leave bed, and the only doctor they could refer me to didn't have any appointments for 1.5 months - and they had no other suggestions on where to go.  \n\nThe final straw was when I inquired about a preventive medicine for me.  The response I was given amounted to \"I've heard of that, but I don't know enough about it to be comfortable prescribing it.\"  There was no willingness for the doctor to research and follow up to me.  He couldn't even recommend a specialist who was familiar with it - and this wasn't an experimental treatment - this was a relatively new, but manufacturer-recognized use of a 10+ year old medicine.\n\nI don't think I've ever felt that CFP was customer-focused.  Rather, when I go there, I feel like I am viewed as a \"necessary evil\" for them to collect their money.  Don't go here - you will regret it.", "business_id": "siixOX00BhEkUlKg3n06tA", "stars": 1, "date": "2014-11-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pk0SyCBrnbOKZbJuEOBybw", "review_id": "d7UAucO6jb1uJ7j5MkKf4w", "text": "I've been going to this office for 9 years. Today I saw my 4th doctor at the practice. They have all been amazing. Dr. Hull is fantastic! However, I would recommend any of the doctors that I have seen!", "business_id": "siixOX00BhEkUlKg3n06tA", "stars": 5, "date": "2015-09-04", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "aNbSdk2_KPmZaeF8No01hQ", "review_id": "PqW4Gc7uG0VXR1INFtQ9bg", "text": "The front desk ladies at Blakeny leave a lot to be desired.  Arrived with a smile on my face and tried to make eye contact with any one of the three who were at the desk.  None were busy.  None would make eye contact or acknowledge my presence.\n\nSeriously, how hard is it to say \"Hi\" when a patient comes through the door, especially if one isn't busy?\n\nMaybe it was just an off day for them.  I hope so.", "business_id": "1I8gEdZk3itKxzIejjG-aQ", "stars": 1, "date": "2011-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_Pv-7L4qTjvQnIPI4ueNbg", "review_id": "LK6Z8PdyWctrEnjfQwLkWA", "text": "I had my first visit today with Dr. Roginsky and arrived very early to my appointment by mistake (completely my fault) but ended up have to wait a while in the room as well. As soon as Dr. Roginsky came in she apologized for the delay. She is very sweet and made me feel super comfortable as a new patient. I set up a web portal through their online system while I was there and within a few hours after my appointment received a message on the portal from Dr. Roginsky to personally apologize again for the delay. Would definitely recommend Dr. Roginsky to anyone!!", "business_id": "1I8gEdZk3itKxzIejjG-aQ", "stars": 5, "date": "2015-10-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-t7Fi0GcFcqgsrYM886pzQ", "review_id": "ovLiMG51LCAdZJZrZUEV2g", "text": "I had my first appointment with Dr. Mock at the Monroe office. She is absolutely amazing. She takes time with you and doesn't rush you out the door. I have had numerous doctors since being diagnosed with an illness and she was the first that took my situation seriously. I absolutely enjoy seeing her and her nurse. They are great. The only thing I have a issue with is the front office staff. Sometimes they are friendly and sometimes they have an attitude. I normally ignore them and just sit in a corner until called by my nurse.", "business_id": "1I8gEdZk3itKxzIejjG-aQ", "stars": 4, "date": "2015-11-16", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "nHsj0cHOiroAsmDfF50BtA", "review_id": "O-OvtpC_zaE-JhLC04eVBw", "text": "Although much farther away from my work or home than my previous doctor in Charlotte, the extra drive to Northwest Family Physicians is always worth it (if I leave on time and don't get caught behind any school buses on the way).  \n\nDr. William Larsen was recommended to me and I'm glad I switched my primary care to him.  I receive such great care from Dr. Larsen and I feel comfortable talking to him openly and honestly.  Best of all, he doesn't rush in and out of the room.  He takes the time to sit and listen to you to understand everything that may be affecting your current symptoms.  \n\nThe staff has always been great, too.  Doctor appointments are usually last-minute things for me (because I'm dying or something) and they can always get me in when it's convenient for ME.  I appreciate that and that says a lot about their service.", "business_id": "R-ff6qTsHb6HC7wQ2Wl5bg", "stars": 5, "date": "2008-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bAWQEp4AghEzO36WlQ0aQg", "review_id": "dTrWx8gn9wa2gILwbFFg1w", "text": "Amazing staff and doctor.  I've been seeing Dr. Larsen for years and trust his diagnosis.", "business_id": "R-ff6qTsHb6HC7wQ2Wl5bg", "stars": 5, "date": "2013-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9DrkxtImDXdC4m2aS8i6oQ", "review_id": "-dXpq7JCNbwkk0iVq1k7Xg", "text": "I went here for my yearly eye exam to get my contact prescription renewed.  The facility is clean and my appointment started on time.  The staff was pleasant.  THEY DONT DO THE PUFF AIR TEST!! My doctor was knowledgable and helpful.  All went well until I checked out.  I made sure they were on my insurance plan- which was also confirmed by the receptionist when making my appointment. Well when i check out they said I had to pay my contact exam myself and theyd give me a receipt to submit to my insurance which was $50.  Im still waiting on that 3 months later-at no fault of this office. This alone makes me debate if ill go back next yr bc dealing w insurance companies is such a pain. Id like to find an office w all inclusive customer service.", "business_id": "Z5HWuClqy4YZzvVrTRUEuQ", "stars": 4, "date": "2014-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nehEK-19WjEJpQahxHt2-g", "review_id": "ZIhSmtjWZTHk0q4SuXqXFw", "text": "I could not have asked for a better experience. They made the process so easy, not to mention everyone in their office was so nice and accommodating!", "business_id": "Z5HWuClqy4YZzvVrTRUEuQ", "stars": 5, "date": "2014-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "g8ZrlyKdgyg5j04Z6Z3v1g", "review_id": "krcZV-s-jhCm3tMoNcgqVQ", "text": "Awesome, professional, caring, great results. That's what comes to mind when I think about my experience here at Providence.  It's been a month and all I can say is that the staff is friendly, caring and professional, the technology is top notch, and Dr Mozayeni is fantastic. These all contributed to awesome results! \n\nFrom horrible astigmatism and 20/50 vision to 20/15 and virtually no astigmatism in a flash! The experience of the operation it's self can be do scribed as like \"watching a laser light show while getting abducted by aliens\" but there was no pain whatsoever, and they clearly articulate to you what to expect before, during and after the procedure! I spent less than 10 minutes from walking in to the operating room to walking out.\n\nHighly recommend and have highly recommended them to all of my friends and family! 0 regrets deciding to have these procedure done, and glad I went with the best!", "business_id": "Z5HWuClqy4YZzvVrTRUEuQ", "stars": 5, "date": "2015-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "TfmuMTyACw8bkJOzBcjn1g", "review_id": "eVS7UcMtArjtrGNr09niEw", "text": "Waiting over an hour and a half the first visit and two and a half for the second visit after being rescheduled.... I'm starting to think with all the laughter in the back ground they don't care about other people's time.", "business_id": "KgdLtB46PtgXV37IXpuu8w", "stars": 1, "date": "2015-11-10", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "ilbenZXokpf4ezafuUH0xA", "review_id": "jsN-FlWzo09lAvaLsPdeBg", "text": "I am 25 years old. I just moved to the area from Philadelphia and was looking for a OBGYN. I do not recommend Central Phoenix! My experience was terrible. The receptionist was very rude over the phone, but I decided to give her the benefit of the doubt because maybe she was having a bad day. After making my appointment I received a call a few days later that it needed to be rescheduled because the doctor was taking that day off. The lady on the phone was not apologetic about the inconvenience as I had already planned to take the day we had arranged off from work. I had an appointment scheduled at 5:30 pm however due to bad traffic I was running late. I called to let them know and no one answered so I left a message. When I arrived the receptionist at the desk was rude again and told me that because I was  little late the doctor could not see me. I tried to explain that when I called no one answered and she again was rude and unapologetic. I am currently looking for another OBGYN.", "business_id": "1acmBPmmFDovVSHHzMrJ9A", "stars": 1, "date": "2013-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ta2U-lig2Fmn_UAWM0EXFg", "review_id": "StpIt1jLv7J5NLApXJNXBg", "text": "I recently started going to Central Phoenix OB/Gyn for prenatal care, and feel compelled to write about my experiences. I originally saw Dr. Gibson after having a traumatizing experience at a different doctor's office, and immediately knew I had picked the right place. Unfortunately, after just one visit, I received a call that Dr. Gibson would no longer be in practice, and instead I would be seen by their newest provider, Dr. Dern. I was feeling really bummed out about it at first.\n\nI went back today for my 2nd appoint and met with Dr. Dern, as well as Dr. Thompson. As someone who is afraid of going to the doctor and feeling a lot of anxiety about this appointment, this was the best experience I've had at any practice. They were so thorough in taking the time to talk to me about my pregnancy and answered all my questions. I felt that they really listened to my concerns and never felt rushed during the appointment. They really went above and beyond to reassure me and make me feel comfortable.\n\nNot only that, but I was really in awe when they brought me back for labs. I'm terrified of needles, and had a bit of a meltdown. Unlike other doctors who have ridiculed me in the past and made the situation worse, Dr. Thompson ran over and gave me a big hug and both her and Dr. Dern came over to comfort and reassure me. It was seriously the best experience at a doctor I've ever had, and I can't even express how much I appreciate them.", "business_id": "1acmBPmmFDovVSHHzMrJ9A", "stars": 5, "date": "2015-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cKB3Nna6NlvGRrF9ve4MDw", "review_id": "ELvLKkMI4xhobl6iBdLbYg", "text": "Dr. Shafran is brilliant.....and once you've been to her a few times you will understand that she doesn't disconnect from you which I believe is why she can come across a little gruff.  She is the only Dr. I've seen in the last five years who treats me holistically and has a referral ready for any situation.  Like another reviewer, if quality of care was the only component she would have 10 stars of out of 5 but scheduling is a misery.  When I can schedule an appointment at leisure I have resorted to fax a request since the voicemail is always full and it is so hard to get the staff to answer the phones.  The front office staff run hot and cold as well - sometimes caring and willing to go the extra mile for appointment coordination and at other times snarling.  I appreciate them as people and realize the stress they are under, but it goes both ways.", "business_id": "PFO7RF1xz4ZBuaq46KsLpA", "stars": 4, "date": "2014-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "yGs16xQiN3dLo03OQyto8A", "review_id": "5PWsttbtamZd4O90OO3ixw", "text": "I can offer no better review than the fact that Dr. Dedinsky has been my doctor for more than 15 years.\n\nI highly suggest him to anyone looking for a new doctor. He is routinely listed in Phoenix magazine's \"Top Docs\" issue and always has surpassed my expectations.", "business_id": "kHQCZ5UQmNX2KiSU5cUpaw", "stars": 5, "date": "2009-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5fdqpLADH4TMZBAXqLmNjA", "review_id": "NGoQzkSJqQAzKAGZH5g1Gg", "text": "I have been a patient of Dr. Dedinsky's since 1997.  I wouldn't think of going anywhere else.  I told him that he can't ever retire!  He listens.  He remembers.  He cares.  And his diagnoses are always right on target.  I love his office staff (Tracy and Imelda).  Both are always so cheerful and helpful when I call in.  If I need to see Dr. Dedinsky immediately, I get into see him that day. If you are looking for a GP physician, you cannot do better than Dr. Dedinsky.", "business_id": "kHQCZ5UQmNX2KiSU5cUpaw", "stars": 5, "date": "2015-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bNEuB6J_KjsTvWopkSIwtg", "review_id": "eEZJWC-cI1WPaFspH9jmsw", "text": "We saw another doctor in the same practice for years, and after our final bad experience (there were many), we went to see Dr. Plotnik. I wish we would have made the change much, much sooner. \n\nDr. Plotnik is fantastic with kids and generous with his time. He is more than willing to answer ALL of your questions, and thoroughly explains the different options you have available. Dr. Plotnik is a MUST-SEE for kids with eye issues!", "business_id": "h3tDZ2TBw7w_W9bA2cR2DQ", "stars": 5, "date": "2011-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "v5W0f-exlDwy4QpoOAYJag", "review_id": "2NqG4urRY7m5s9EirVxXYA", "text": "The Dr. is great, but the place is absolutely filthy. I want to sanitize my girl and not let her touch anything while in the waiting rooms.  The staff is a bit on the unprofessional side as well.  This is a professional medical office...not a gym.", "business_id": "h3tDZ2TBw7w_W9bA2cR2DQ", "stars": 3, "date": "2015-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Ry7mig-kS0G8S3PtkoBVDw", "review_id": "pBLzNseylDWzxvIIQ-SSWA", "text": "I had vein disease, reflux in the vein and blood clots.  Dr. Ravi was professional and took great care of me.  His entire staff was helpful and professional.  My wait times were never long.  I hope to never have these issues again but if it occurs I will be going back to the heart institute to be take care of.", "business_id": "KXt0Iky3ybeLsbY9KC6GSA", "stars": 5, "date": "2014-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "raMSkwLdZ-kFea1fTY_-Ew", "review_id": "Vl14KcYUTOAdCXQVML3uJg", "text": "Very friendly guy and great bedside manner.  Staff was nice...but never called me back about scheduling surgery.  That was probably a good thing since it pissed me off and I found someone else...and that doc told me what my real problem was...that I had foot deformities.  Dr. Harlan just chimed in with the same old thing podiatrists have been telling me since I was a pre-teen.  So, I wouldn't recommend Dr. Harlan for a chronic injury where you need an ankle specialist or surgeon (I saw Dr. Johnsen at TOCA), but I would recommend him for general things like a wart or bunyon.  He did a top notch job of fixing up my hubby's planter's wart!", "business_id": "78ODNJ0EANVSsbgrwhl3mw", "stars": 3, "date": "2012-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "d5PxJcCSyaS8E2Kf6kxRSQ", "review_id": "CUxxWcmgRS3_zQgXcH2GCg", "text": "They have quality therapy people and many good and solid people working there that have a genuine concern and compassion for the clientele they serve. The problem is that it is not adaquetely staffed in numbers in the units. NURSES are more concerned with having power and control because they can rather than help. The administration is more concerned in the financial matrix rather than support their staff and that is both Nurses and Techs as well. Sadly there is a minority number of people on staff that are basically lacking of social skills and professionalism that bring down the quality of the work environment. I do not enjoy giving this rating and the caution to NOT work there but for the small minority that bring it down I have to give this low score. I hope that soon it can become a place that is a recommend work environment to work in.", "business_id": "r1sLMV2DfDfJZ8HJMzKhow", "stars": 2, "date": "2014-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "VNEqps27mp8-gTqTfzg7yw", "review_id": "FiZRkd14xG71O7hoJB6zNA", "text": "Appalling conditions. They put people in wards in the basement where there is no sunlight. The rooms are run down and dirty. The showers and bathrooms are completely disgusting. I would have rather relieved myself outdoors. But you have to earn the privilege of even going outside. The mirrors are warped so you can't clearly see the deterioration of your condition from having stayed there. Once you are behind the doors of the ward, the only way you will leave is if the doctor in there gives you the okay to be released, meaning they could hold you for as long as they wanted, even though the paperwork they have you sign gives you the impression you can leave at your own choosing.\n\nThe therapy there is remedial and was of little to no value there. Most of it is group therapy where you talk about feelings and is not geared toward a specific individual's needs. You see the psychiatrist for 10 minutes a day, if that. His job is only to prescribe you medication in a wait and see what works and what doesn't work fashion.\n\nThe beds are made of a very hard plastic and it is almost impossible to get any sleep in here which is not conducive to a healthy state of mind. \n\nThey run the place more like a business rather than a care facility. Providing the lowest possible care at the highest possible price. I saw what they charged my insurance for a 2 night/3 day stay and it was criminal. Upon entry they try to extract money from you but don't allow you to see the conditions where you will be staying in first. The intake and exit process has a lot of inexperienced people running it.\n\nOther patients had told me they had been there for weeks, months on all sorts high dosages of painkillers and antipsychotics. Places like these are in a position to take advantage of patients for their own profit. This place is a business first and a health care provider last! One man was undergoing electric shock therapy and he would laugh randomly and tell random jokes throughout the day as if each one were an electric shock to his brain. It was painful to see.\n\nThe food is also disgusting. The only thing that didn't taste gross was the fruit and the drinks. It's basically powered eggs everyday and then some nasty slop at night. Even the oatmeal is gross.\n\nWhen I was released I looked like a totally different person. Like a beggar. I ran out of there as quick as possible. They tried to get me to fill out a survey but words cannot describe or a survey cannot say what a horrible experience I had in this place.", "business_id": "r1sLMV2DfDfJZ8HJMzKhow", "stars": 1, "date": "2015-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DrHei8dBcbGNNyhP5qjBYQ", "review_id": "0M8PcapUY47EDynQ4kiCeg", "text": "Dr. Kaczar is perfect.  Smart, funny, caring, professional.  And his Medical Assistant Kara is the perfect compliment.  Staff always helpful and considerate...", "business_id": "OUJmtRxNkV0WT8rrr-qmRA", "stars": 5, "date": "2015-10-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hzPPytO7gfnfAa2Vtf4Y5w", "review_id": "uHHxPO9ywoQm1_eRKTuqIw", "text": "Dr. Stevens is a fantastic surgeon.  He has performed over 400 spinal surgeries and came highly recommended by volunteers and staff at Scottsdale Healthcare - Dr. Stevens corrected my 62 degree scoliosis curve.  The surgery was further complicated by the fact that I had severe osteoporosis in my lumbar spine.  If Dr. Stevens was not as experienced and knowledgeable as he is, my surgery would not have succeeded.  Don't let his confident manner scare you away.  He is the best!", "business_id": "JTiqc8D0MJpYbnObHuNA9w", "stars": 5, "date": "2011-10-04", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "E3PyHP5X5V16w1z69aavdQ", "review_id": "eCWmJ62SzTxJ9JkJzbvcnw", "text": "I've been mis-diagnosed many times by Dr. Austin. The wait is ALWAYS an hour or two and you have to keep calling the office to get results.", "business_id": "k7xAg1QhK_8wze3BYWglRQ", "stars": 1, "date": "2011-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rdr8WB0mPx-Ud91BlvThHw", "review_id": "1mq1tL18EFSrWDqikXnTdA", "text": "Been with Dr. Austin for many years, she's an amazing caring Dr. Only see her a couple times a year but it's always a pleasant visit. Thank you Dr. Austin!", "business_id": "k7xAg1QhK_8wze3BYWglRQ", "stars": 5, "date": "2015-10-23", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "zhVOlwBuEgdGlHjwgVf3Jg", "review_id": "zteeZsxzHPB5AoufkHNzbA", "text": "I have been seen by the Nurse Practitioner Christa and Dr. Laura Kimbro so far. Both experieces have been good. They are really good about following up with you. They can do ultrasounds right in the office if your insurance covers it.  They do all their baby deliveries at Banner Desert.\n\nOne small complaint...they take the whole thanksgiving weekend off. Although there is someone always on call, it would be nice if they were open that friday.", "business_id": "aOtx6bMU5M-Q_cNxhB0wYw", "stars": 5, "date": "2009-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_8eGLKjVpGK_mxwM8mlOgA", "review_id": "rGlJMccdjiA63uaWsjCzFQ", "text": "I went in back in July of 2013 for an ablation surgery that did not work btw. I was told that it was going to be $2800 total when I asked for the total cost up front. After I made my appointment and spent $130 on a consult that I didn't get anything out of I decided to have it done anyway. So a few days before my appoint they call me and tell me that I have to pay an extra 50 for a prego., 250 for a test and 500 for sleeping meds. total cost 3400.00. Well over what I was told. \n\nDay of surgery they had two male assistance that flew in from cali. to watch that I was not aware of until I was about to go in to the room and have surgery. I did not like the fact that I paid so much and they didn't even ask me before hand if I would mind. Once I got up from surgery they were trying to get me out which didn't make me to thrilled about my experience (zero recovery time) so I made sure to stay anyway and get some rest for about an hour and half. \n\nI was called later and told that I over paid by 58.00 and that they would send a check out, it has been 4 months and I have not seen anything.  \n\nOverall I am not happy about the price, care or follow up and I am really unhappy that it did not work and if I want to try it again I have to pay another 3400. They should charge half so you can have it done twice just in case and they should let you rest after instead of okay your done get out.", "business_id": "aOtx6bMU5M-Q_cNxhB0wYw", "stars": 2, "date": "2013-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1J5toBGXLnx3miZf_-2F5w", "review_id": "FWd9noo8w2gTGDcqvGnbyw", "text": "The thoroughness of their prenatal care saved my baby's life. My first pregnancy was perfect with no problems, but my second pregnancy... not so much. I went in for my 18 week anatomy ultrasound, and as part of that exam they screened me for incompetent cervix (which many practices don't do). It turns out I had incompetent cervix and was well on my way to losing the baby. Most women don't learn that they have this condition until after they have lost their baby. Because of their diligence, I was able to take the necessary steps to save my baby.\n\nThe quality of the care at SWCWC is unparalleled. I highly recommend this practice.", "business_id": "aOtx6bMU5M-Q_cNxhB0wYw", "stars": 5, "date": "2013-11-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "No_5ggN8OZkTEgvgaU_qAQ", "review_id": "_nA2w6-GTavID0xMjkk2EQ", "text": "This place has wonderful, doctors, nurses and staff!  This location is one of several offices in the valley that treats high risk pregnancies pre, post and during :)  This practice has been around for 20+ years and has had a great reputation for quailty care for many years.", "business_id": "K4yExVqUtW2sRE4grXU8Zw", "stars": 5, "date": "2011-09-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xIGZWNfRz_i31FxfVRB8cw", "review_id": "szI66p5kokxqAn4jIP3e_w", "text": "I'm changing my review after being here more then once. This dr office is absolutely amazing, dr and nurses take the time to really get to know you. The wait times aren't that bad. They tell you your appointment time as the check in time so you are not late which is awesome. I'm having to come here twice a week for monitoring of my baby. I have never waited longer than 15/20 minutes. Everyone is so friendly and helpful. I would recommend this high risk dr office to anyone that needs to see a high risk dr.", "business_id": "K4yExVqUtW2sRE4grXU8Zw", "stars": 5, "date": "2014-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Jt3EQa5TP7-r0fUAgFyFTQ", "review_id": "3GCbYvwyOwQeilrwfS6GMQ", "text": "Dr. Finberg intentionally held information from me the one time I saw him in June. My baby had fatal complications and Dr. Fin berg could see this clearly. Instead of sharing all of the information, he kept bits and pieces to himself. Later, when a doctor at a different PPA office shared this information, me and my partner were shocked. Nobody needs surprises when they're going through a loss late in the second trimester. I would never place trust into the awful PPA again. ( I've been to 3 locations and the doctors at each have been incompetent )", "business_id": "K4yExVqUtW2sRE4grXU8Zw", "stars": 1, "date": "2015-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tXDMZKziSKD0oSEe5GkLaQ", "review_id": "JvYBjYKkgMLMj7GVI9jdQw", "text": "I actually go there for psych as my previous psychiatrist recommended the Dr. when she moved out of state.  My first visit, the girls at the front desk were arguing over who put the files back because they weren't in alphabetical order.  Then one of the girls told the other girl she was going to punch her in her face.  I was shocked that anyone would EVER talk like that in front of patients.  \nIn addition, their billing office is completely separate from the office, so whenever I go in & try to describe what an HSA is, & that they shouldn't be charging me the self pay rate, their eyes glaze over.  Finally, I had to tell her that I'm way overpaid on my account & I wasn't going to pay another $125.00 for the visit until it balances out.\nWhy hire someone to work your front desk when they're 1) Rude 2) Don't know anything about insurance?!?", "business_id": "cVxig7AVvbWkHh9ZyOQyfA", "stars": 2, "date": "2015-10-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "cf8yD9WiLFrZpr3opooVEA", "review_id": "UAI_JLlbyS9Aj705vzNuSg", "text": "I love these people. I see Stacy the physicians assistant most of the time. She is wonderful and is a great listener. I do not have insurance and they give generous discounts for self pay patience. The staff is wonderful . And the man who takes my money at the end makes me feel good about it, always so sweet.", "business_id": "9JFmuEuUzt8VSUisejFrtg", "stars": 5, "date": "2012-10-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CxZjg_w4BCDnC4gA4ByJ0g", "review_id": "yI-j7Yn_LqDkDtcXQN721w", "text": "This is an update to a previous post.  My menstrual issues persisted after the uterine ablation that Dr. Sweeten performed.  In May 2015 I was diagnosed with adhesions, which are scar tissue that builds up in the uterine cavity after trauma.  In my case, it was the ineffective treatment by Dr. Sweeten.  Since she was quite clear that she didn't follow up with patients after surgery, I chose to seek treatment from a REAL doctor who is skilled and professional.  The damage Dr. Sweeten created resulted in a need for a hysterectomy.  DON'T seek treatment from this \"professional.\"", "business_id": "kOT8AO8e1e3J9pUBJ2C7Iw", "stars": 1, "date": "2015-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mM5wk-7GUaxwhfHB6WoeuA", "review_id": "Gwsyu6JS-THhox4vW5jTrg", "text": "I had an ablation surgery in January, after waiting 10 months and still having pain, I went back for a wellness exam. Dr. Sweeten was very impersonable, which I felt was unprofessional, almost like she was annoyed to be there. I asked a lot of questions and I just kept getting this feeling that she doesn't want to be there in the room with me. She gave me options on treatment and expected me to make a snap decision (um..a hysterectomy without asking questions? Are you kidding me?) I don't think it's too much to ask for a little bedside manor when you are considering removing my lady parts. I understand that everyone has bad days but kept thinking that her ego has gotten in her way of treating patients, the whole reason (I hope) she became a doctor. I think I'll be going elsewhere. When it comes to lady issues, I need some compassion which I don't believe this office offers. Even the 'nurse' seemed like she hated her job.", "business_id": "kOT8AO8e1e3J9pUBJ2C7Iw", "stars": 1, "date": "2015-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "26wW6FNWdmC23Vz-sjy9Dw", "review_id": "60kYl1_R2x2RGCLMdUpoEA", "text": "Travis is very nice and helpful", "business_id": "a-XWQ4HyxJEctlowO8rXwQ", "stars": 4, "date": "2012-11-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BZPwVUk-qO6wSRF7kjQe-w", "review_id": "2yhCx2TPi3pXTBnEwzbohg", "text": "Average services. \nThe doctor i met wasn't that helpful & courteous. He was always in a hurry. Never spent more than 2 minutes with me in any of the visits. He felt irritated by the normal questions i asked. \nHe didn't give a clear enough idea about my condition. I had to virtually dig information from him.\n\nI don't feel confident enough about the treatment i've received here.\nWon't recommend this place to anyone.", "business_id": "a-XWQ4HyxJEctlowO8rXwQ", "stars": 1, "date": "2013-09-04", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "6aGkau5mlQD98Wj8PTjkdw", "review_id": "KZzo89coXyInNISIPz44sw", "text": "I've never written an on-line review of any doctor or product ever but after reading the review written by Alicia B. I felt compelled. Dr. Spieker has been my obgyn for 17 years. She delivered both of my girls.  The staff is wonderful, Debbie has been with the office for at least the entire 17 years that I've been a patient  and she even recognizes my voice right away when I call. \n\nAlicia- given how crass sounding your review was (i.e. \"crotch doctor\"), you may just be the kind of person who is unhappy all of the time about everything. \nI have referred many women to this office and they all love everything about the doctors and staff. A doctor's office is a busy place and emergencies and other health issues that must be triaged occur every once in a while. Sure, I  had to wait longer than expected ONE TIME (in 17 years), and yes, I've had to wait a few minutes when the staff has been busy addressing an emergency, but to be honest, I like knowing that if that were my emergency that I'd be the priority and the staff would be just as focused on my issue.  That's the way it should be. It's a medical office not a fast food restaurant. \nBottom line- This is the best doctor's office I have ever been to in my life.", "business_id": "eovEq5kDSdf0WF_P_bD2Uw", "stars": 5, "date": "2011-09-01", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "YgucNL2tibnjEmDLqHPqow", "review_id": "Qr4vBoPJ4-MUMvYixPKRzA", "text": "First of all, THE LOCATION HAS CHANGED. I followed Yelp's directions because I'm a tool and didn't look up the actual address online... yup, they're no longer at 333 E. Osborn. They're at 1313 E. Osborn. So... yeah.\n\nThat aside, o-m-g. For a doctor of this sort, Dr. Cyr is AMAZING. I have been to many women gynos (sorry, no dudes up in my lady-business) and I've had good ones and I've had atrocious ones.\n\nMy atrocious experiences have all been in Phoenix, so I had been without an ob-gyn for several months until a co-worker recommended Dr. Cyr. Lucky for me, I struck GOLD! Dr. Cyr, you're not allowed to retire. Sorry. (Don't worry, she's young; she won't retire anytime soon).\n\nCut to the chase. Reasons why Dr. Cyr is amazing:\n\n1) She doesn't make me feel like a creepy weirdo for not being married nor wanting kids anytime soon. SERIOUSLY, I got grief from ob-gyns for 'not being ready for a family yet.' Um, guys, I can't even feed myself on a regular basis, and you want me to have a kid? Major fail. Dr. Cyr DOES NOT DO THIS. She didn't even bring up me wanting kids now or in the future. Thanks, Dr. Cyr!\n\n2) I didn't wait a million hours to see her! At my last gyno doctor (who shall remain nameless), I waited 2 hours for my appt. Wtf?? Here, I waited no more than 20 minutes, and that was because I was filling out paperwork. YAY!\n\n3) Dr. Cyr answered my questions professionally and fully. She didn't shirk around my more... awkward... questions, and she explained the options to me in plain English. She reassured me on some things that I was worried about, and she even made me laugh in the process. I NEVER laugh at the doctors! This is amazing!!\n\nOn a less quantifiable basis, I felt Dr. Cyr just 'got' me. It's hard to explain, but I felt comfortable talking to her and felt I could bring any issue up and she wouldn't judge me for it. \n\nShoot, I think I want to have a baby with Dr. Cyr now. Wait.. that's not quite what I meant... anyway, go see Dr. Cyr if you have lady-parts! You won't regret it!", "business_id": "eovEq5kDSdf0WF_P_bD2Uw", "stars": 5, "date": "2013-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "r_zYrQUruVvu16HlfwSHjA", "review_id": "89WYj_EyKTVi0nqBDXNnzw", "text": "I saw Whitney Padgett, one of the nurse practitioners. She was okay, but she seemed like she was in a bit of a hurry. In the past my Gyn has always talked to me about calcium, exercise, vitiamins, etc. Whitney did the bare minimum for my history and exam.  I was seen for a preventative exam and also had a small issue at the time. When I was billed it was for a comprehensive preventative exam as well as a level 4 visit. I didn't think one little test and prescription constituted a high-level office visit. When I called to get clarification, the office manager told me that their well woman appointment was just the two female areas- (without getting graphic). I'm sorry, but I am more than just two parts! They shouldn't be allowed to call themselves \"Women's Health Care\" with that attitude.", "business_id": "eovEq5kDSdf0WF_P_bD2Uw", "stars": 1, "date": "2013-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zMlvUth9nCNwJfpLEKYOiQ", "review_id": "sGaQPO6_8dLMfleOTEGNiQ", "text": "Whitney is by far the best I have every had as far as doctors go. She answered all my questions and made what is usually an awkward visit seem comfortable and quick. The office staff are very nice. I would recommend them to anyone looking for an obgyn .", "business_id": "eovEq5kDSdf0WF_P_bD2Uw", "stars": 4, "date": "2014-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Jt3EQa5TP7-r0fUAgFyFTQ", "review_id": "KBlz_NqZofBLc30aoncKmw", "text": "I'm sure Dr. Hahn is great at handling healthy pregnancies but she was completely negligent in my unhealthy one. There were multiple indication from 10 weeks on that I was not carrying a healthy child. She ignored very major signs of complication, chose not to carry on testing when those indicators were found, and caused so much more pain and suffering than necessary. When it was learned that my baby was not going to live, she sent me to another doctor, at another, unaffiliated office, to deliver the bad news. It's not Dr. Hahn's fault that my baby was sick and did not make it; but it's completely negligent that we didn't know until 23 weeks. Her inactivity lost me valuable options.\n\nAlso, the front desk staff is unfriendly as well as some of the other staff. Very little communication from the staff. Very in-and-out and impersonal, which is fine for most doctors but not in Obstretics.", "business_id": "eovEq5kDSdf0WF_P_bD2Uw", "stars": 1, "date": "2015-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_9vdIrQBlv6clAEC9xQr9w", "review_id": "st1MQj-iVvFcc2vztSO89Q", "text": "Thank you to the amazing staff at Phoenix Skin for taking such amazing care of my Dad. My Dad had questionable moles and was referred to Phoenix Skin by his Primary Physician. Dr. Laris and his staff were professional yet comforting. Dr. Laris took his time with the examination. He explained what he was doing every step of the way and then walked us through what the next steps would be. My father, who generally dislikes doctors was extremely impressed with Dr. Laris and all his staff. Cannot thank you enough!", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 5, "date": "2010-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "KfPE9klmovruOQE0jFjCYA", "review_id": "uQWzSLR26I1MVdvqX8enuw", "text": "I went to phoenix skin in August 2013 to discuss about laser resurfacing. The doctor who I had met on that day had no idea about laser skin resurfacing and she gave me details about Blanca Fergoso, surgical coordinator  in phoenix skin care. I tried to schedule an appointment with her but when ever I tried to call her all the time it went to voicemail and even called the help desk to schedule an appointment with her but of no help.  I went to phoenix skin after lot of research and good reviews but of no use. If they won't care about their patients why would I recommend phoenix skin care please avoid Phoenix skin care.", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 1, "date": "2013-09-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "KS5Dj2JYSFsPvGhpoHKQCA", "review_id": "KArB4LwjEwDPXZKagARCrg", "text": "I have been to almost every dermatologist in the Phoenix metro area... I have had  great skin my whole life, and randomly at 25 I got a pretty moderate case of acne.  I had no idea what to do so I went to see dermatologist after dermatologist who all prescribed a  cocktail of Rx's antibiotics and creams... Dr. Laris did the same thing but not until after he listen to my issues, explained to me the face wash and moisturizers that I should be using... And I can not believe the difference.  I was over washing my face and using too many products drying out my skin causing more breakouts.  The extra 5 minutes he spent with me going over the basics made a world of difference in my skin.... The staff here is always great as well!!  I only get one face, so Thank You Dr. Laris for taking the time to listen!!", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 5, "date": "2013-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "rbaZMpdTLVciiO0YkCokwA", "review_id": "kHhrG_zCEX6fMECPPCLB6w", "text": "This is one of the few locations with the brand new Pico Sure laser.\n\nHad my first treatment in Sacramento and was driving through Phoenix and for my second treatment here.\n\nIt was very very low cost since they introduced a new pricing based on size. Mine was slightly bigger than the smallest but I paid under $50 anyways. Which is why I gave it an extra star. But you get what you pay for =[\n\nAfter the blistering went away I saw 2 quarter inch long DEEP maybe 1/8 deep holes on two spots on the tattoo. On the black shading. It freaked me out but I forgot about since I thought it healed fine , (and it's on my back so I can't see it too well)\n\n - but now 6 weeks later I went to someone very experienced and he refused to treat me for another 4 weeks at least - apparently the technician wasn't experienced, or went too hard at the treatment, and those two spots are scarred. So once I remove the tattoo there will be a scar - not to mention I'm terrified to keep going with treatment on an existing scar. It's still rough 6 weeks later and not healed.\n\n don't go here for tattoo removal because their technician knows not what she does. :( :(", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 2, "date": "2013-11-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "T4LEFVa22nmvhlxiL_Ovqw", "review_id": "TO8ZFjl6mpzH834vpjrZhA", "text": "Phoenix skin has been the best place for me. The service is great and I go each month for my laser hair removal on my legs. I have received 6 sessions so far and I have noticed a huge difference. McKenzie is great and so caring! If you need laser hair removal, McKenzie is the one to go to!", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 5, "date": "2014-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fhzz3s24_HO2zkhH6-4Yuw", "review_id": "-l_NlAxvYo03-DcVAl6pvA", "text": "I came from California to have dr Laris do  his magic on my face.  He and his staff are the most professional and accommodating people.(especially Blanca and Ebony) . The value is the best and the outcome was more than I could have wished for. I cannot recommend them highly enough.", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 5, "date": "2014-10-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "c4bt6PmeKghmkr0ghmwOEQ", "review_id": "527sRq-Blk7MrevF-Gnhww", "text": "Been there as an adolescent. Attempted to make an appointment and I wouldn't even go past the receptionists bad attitude problem. When asked a question that you know the client is not going to be happy with, try empathizing. You just lost your company a regular client lady. Learn to show a smile over the phone.", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 1, "date": "2014-11-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "7yfgECKsDVAbOoBejpOrag", "review_id": "4uSNPRdcgiOynEmQXxFTjA", "text": "I've been going to Phoenix Skin for PicoSure laser tattoo removal treatments and am horrified by my results. I make sure to be very diligent with post-care and avoided the sun for 2 months before continuing treatment on my tattoo (I make sure to only go during winter months as an extra precaution since the sun can be very damaging to the healing process.) I have suffered significant SCARRING as the result of my last 2 treatments here!\n\nThe decision to get rid of a tattoo that once made me self-conscious has only been made worse by having a scar to replace it. The last time I was in the office was February/March and I noticed scarring so I discontinued treatments for 7/8 months to see if it would get better with time. When I went in to see the laser tech (mind you, this is not performed by a physician) she noticed the scarring and commented, \"oh looks like the last treatment was probably a little too much, huh?\" No sympathy for the damaged skin she caused. \n\nI initially liked Phoenix Skin and was planning on doing additional services after my PicoSure treatments were done. Now I am steering clear because of the lack of proper care I've received as a result of this practice.", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 1, "date": "2015-10-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pvLD2apxujNwwl5Ui6J1JA", "review_id": "Ki1k_8QtyuL-TIxjVWclww", "text": "Great staff and doctors!  Friendly, helpful, and timely.", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 5, "date": "2010-09-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "FcDddrQtLXyyABI8jg_Nxw", "review_id": "fypZ4x_RKAjgx4FdPGavxg", "text": "Unless you want arrogant PA's telling you what the plan of action is instead of a Doctor, I would not recommend this place.  Ego's the size of a planet.  Dr. Lederman was great, Dr. Cummings and his assistant were not.  I do not hero worship doctors.", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 1, "date": "2010-11-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "fwEPqYiyZCaB7QKY6a7h5g", "review_id": "cTH9Qc2m21Z3ILJfygvbUw", "text": "**Disclaimer: I've only been to TOCA once, but had a great experience. I will update this review later.**\n\nHave had ongoing right knee pain for the past 6+ years. As athletes, most of us aren't a bunch of wusses when it comes to pain and tolerance for it. Walk it off, damnit, walk it off!   \n\nWell, one week, there was no walking off anything. It was getting in the way of my training. After losing a season this year because of surgery, my Coach and I went into panic mode to figure out what this was. \n\nAfter an MRI  found some awesome chondromalacia and patella - femoral malignment (Thanks a lot, hammer throw), my PCP referred me to see Dr. Cummings. \n\nFront office staff was very friendly, and I had plenty of time to fill out of my paperwork. I will say they were running about an hour behind, but it wasn't a problem for me - at least not that day.  \n\nHad some X-Rays of both knees done on-site while waiting for the Medical Assistant to download the images off my MRI disc. \n\nDr. Cummings actually introduced himself to me as Dean when he walked into the room, which I thought was pretty cool! \n\nConfirmed everything found on the MRI, and told me I'm experiencing something called \"dyskinetic chain\". Cause? The joint of my big toe. INSANE! Never would have expected that. No surgery necessary, just need some top-notch physical therapy.\n\nNot once did I feel belittled by him as other reviews and peers of mine warned me. Not even a little hint of specialist arrogance. Nope! \n\nI also appreciate the fact that he didn't try to \"used car salesman\" me to use their on-site PT Clinic. \n\nHe sent me to his colleague (Dave Hogarth, DPT in Chandler), who specializes in this specifically.\n\nWhich by the way, that guy scares the holy crap out of me with his manual therapy techniques. * shudder *  Makes the PT I saw for post-surgical rehab this summer seem like a trip to the Massage Therapist (and that guy beat up on my surgical sites pretty bad - Trevor, please don't hate me for this!).  \n\nBut my range of motion is improving with this program, so can't complain. Oh, and he's a former decathlete who *gasp* actually understands the hammer throw! \n\nHopefully the next time I see Dr. Cummings, I'll be discharged. \n\nI HIGHLY recommend TOCA for your orthopedic concerns and specifically Dr. Cummings especially if you're a high level athlete. Don't mess around; go to the best.", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 4, "date": "2013-10-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XEwiXjjDLL5MmPPPh0asjA", "review_id": "OwqU-8TCbaWBlKOwJa3-3w", "text": "Did not get too far into the BS. Was on hold for more than 45 mins to make an appointment. Just want to remind you all that this is a \"For-Profit\" organization. Treat them like you would any business that serves you. They do NOT have any special product or service that warrants such crappy service.", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 1, "date": "2014-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "_qt1Eosn_Hu8Tt7vo8Lw1A", "review_id": "1Oz4wOWTDY-xSB5PQvN4QA", "text": "I saw Dr. Cummings for pain in my elbow.  He diagnosed me with \"tennis\" elbow.  He has a wonderful bedside manner, and explained things in layman's terms to me.  \n\nI was ordered to go to physical therapy 3 x a week for 6 weeks.  Every single hand therapist I worked with there were awesome (Stephen, Debbie, Loni).   They were all knowledgeable and friendly.  Even the other \"patients\" were interesting.  I definitely didn't dread going there.", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 5, "date": "2014-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dIwZBhKewU5rpmGT4IzLEQ", "review_id": "A_gnSwlIaYEtzKUQ_iSWPA", "text": "I injured my knee on a Wednesday and got in to see the PA-C of an orthopedic surgeon at TOCA the next day. I don't know why everyone is having such a tough time scheduling appointments with TOCA. I called them right after my injury at around 3 in the afternoon and got right in. I think if you avoid \"peak\" times when calling the office, you have the best chance of getting an appointment with the smallest amount of frustration. Everyone knows that traffic is greatest around 8AM and 5PM because everyone hits the road at the same time. Phone traffic is no different. Also, I tend to feel a sense of security when I walk into a busy doctor's office as opposed to one that is completely empty. The ratio of doctors to patients in AZ is fairly high to begin with. If they aren't busy, I start to wonder why and my imagination will usually lead me to conclusions that aren't good for my health.\n\nJustin, Dr. Cumming's Physician Assistant, did a great job with his initial assessment and getting me scheduled for an MRI. Remember folks, with the rising cost of medical schools, more candidates are choosing to go the route of PA or NP and it's not uncommon to be assessed by these highly skilled individuals. \n\nI had a vein issue that they did not take lightly, rushed me in for an ultrasound, and even called me the day after my visits to make sure I was doing OK. Dr. Cumming's has great bedside manner and both he and Justin took the time to educate me on the overall process and what was going on with my knee. Both of them were on hand for my surgery at Piper Surgery Center in Scottsdale, AZ. They furthered this excellent experience by taking the time to help my wife understand the meds I was taking and the care that I would need post-op. \n\nLastly, the staff and everyone involved with my experience continue to be nothing more than helpful on my road to recovery.", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 5, "date": "2014-11-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CToE3hZ2sJ9F0ip2O0bptw", "review_id": "b834xKq09K6WbcfbVC5H3Q", "text": "Great doctors but their PA didn't return multiple calls day after surgery Had to call their office manager to get help who was responsive. Their \"online\" patient portal of little help either. \n\nThis group is going to have a rude awakening as provider assessments become more frequent. Time to get a clue on customer service! Next time....Mayo!", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 2, "date": "2015-09-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "DU7aYXzXmenYN8_PK50IgQ", "review_id": "W99WEqq3003nJL8DrAJysg", "text": "Zoltan DOES NOT rock. Waited over an hour on 2 appointments. The first time I gave him the benefit of the doubt but the second time an hour went by and I got up and left with a knee I could not walk on.  I had to see him due to my great doctor leaving to go to Mayo which was farther for me to drive. I could have taken the drive and still saved myself the time I has to waste waiting for him. Save yourself the time and go somewhere else. I did have a great experience with their PT facility Heather was awesome, I did PT with her for my back last year.", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 1, "date": "2015-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "96hNqTIDnBrD3QLapNjQ5A", "review_id": "rIODvSvX-npc1EZBRmsgvA", "text": "Bad doctors, bad PT staff.  \n\nThe doctors are a mob that want to make money.  Dr. Zoltan was curt and weird.  Dr. Armendariz was a jerk, PERIOD.\n\nThe PT staff does not do ASTEM.  Astem is a physical approach to fixing an ankle.  Instead, all I did was strengthen to no avail.  Bobby from Texas was the only hustler of that group in Tempe, the rest were either not knowledgeable, casual and not willing to go the extra mile.", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 1, "date": "2015-10-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b4k22mB0xwBov6ddvdL2OQ", "review_id": "yWRaztPauKgG1Re73h3fGg", "text": "My wife went to Biltmore Surgical Center for bunion surgery. They collected $650 for our co-pay. According to EOB from Blue Cross Blue Shield, our co-pay should have only been $327. Biltmore refuses to refund us the difference and has even denied a request from Blue Cross Blue Shield to refund the difference. This place is a financial RIPOFF and I would not recommend anyone to go there.", "business_id": "rdc24noiVveKlfifEwVNvQ", "stars": 1, "date": "2015-09-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b4k22mB0xwBov6ddvdL2OQ", "review_id": "kmNJ-M3QwA4eXLEBAzhJag", "text": "My wife went to Biltmore Surgical Center for bunion surgery. They collected $650 for our co-pay. According to EOB from Blue Cross Blue Shield, our co-pay should have only been $327. Biltmore refuses to refund us the difference and has even denied a request from Blue Cross Blue Shield to refund the difference. This place is a financial RIPOFF and I would not recommend anyone to go there. Five months after they tried to over bill Blue Cross Blue Shield with incorrect medical codes to receive more money than they entitled to, Blue Cross Blue Shield forced them to refund to us the over payment.", "business_id": "rdc24noiVveKlfifEwVNvQ", "stars": 1, "date": "2015-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ndWPuz43ZqUST7IeTjUZyg", "review_id": "NHlNf1pP9GJOdJy9dagImQ", "text": "A friend of mine referred me to Dr. Zeman and I'm SO happy she did. I had this knee scoped back in 06 from another ortho doc in town and it was horrible. This experience is how it should be! I wished I would of known Dr. Zeman back then. I probably wouldn't be in this situation again if I had!  Dr. Zeman scoped my knee  Nov 2, 2011 and removed a 2 cm cyst and cleaned up the meniscus. I can't tell you how happy I am with not only Dr. Zeman but also his entire staff. I feel like I'm in really good hands and I know I am getting the best care possible. They actually really do care!", "business_id": "ZPkomfeRH2pflacWf7U3-A", "stars": 5, "date": "2011-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qDBaslzhTlpzOPg7hARuzA", "review_id": "lbCGla9eVmJ0JEeLiUkrHg", "text": "A", "business_id": "ZPkomfeRH2pflacWf7U3-A", "stars": 5, "date": "2012-11-23", "type": "review"}
{"votes": {"funny": 1, "useful": 10, "cool": 0}, "user_id": "iYdCPrElZeJKB3CyVuanOA", "review_id": "GTZrZLsQ-dbI-U3wjPA8ew", "text": "I've been wanting LASIK for years and this place was really close to where I live, so I checked them out first.  Long story short, they told me I was not a candidate for LASIK because of my high prescription.  Normally they'd recommend ICLs (implantable contact lenses) but the anterior chamber of my eyes were too shallow.  So they said there was nothing they could do for me and told me I was better off in contacts/glasses.  I was pretty discouraged until an optometrist friend of mine recommended getting several other opinions (she worked for a LASIK center that did eyes worse than mine) ... and I did.\n\nHere's where I learned the truth of BDPEC... apparently within the local ophthalmologist community, they are FAMOUS for pushing ICLs.  So let me save you some time here.  If your near-sighted prescription is worse than -6.00, they will recommend ICLs (below that they will do LASIK).  FYI - ICLs cost a lot more than LASIK, too (ka-ching!).  Anyways, if you don't fit that ICL bucket, they'd rather let you walk.  After doing more research, I discovered that a high-prescription ALONE does not a bad LASIK patient make, which is what BDPEC led me to believe.  In fact, the other doctors told me that because my corneas are way above average in thickness, my risk for complications is much lower!  Imagine that!  \n\nI'm sure that if you fit into the BDPEC business model, you will get great results.  However, I STRONGLY encourage anyone considering refractive correction surgery to do your research and get at least 2 or 3 opinions outside of BDPEC.  They operate on a business-first model vs. clinical-first.\n\nGood luck!", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 2, "date": "2011-09-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "va0CpyGqJsF26ZHHn7-dAA", "review_id": "-llO1t_yc57xPbEmdRlItw", "text": "Dr Pinkert is awesome !  He is one of the best Vision Drs in the Valley , plus he is cool as ....  I CAN SEE CLEARLY NOW !", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 5, "date": "2011-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "LAinT0IgR1rf7Ko52jIVGA", "review_id": "7_JWZnU5Ib39pFQ-ugtnoQ", "text": "I had LASIK -monovision By BD&P in 2012 and could not be more pleased. Dr. Schiff pre-op exam and Dr Finklstein for surgery. Both were excellent in demeanor and competence. I had a very high degree of astigmatism and was always told I was not a candidate. New technology changed that. the actual procedure is less than 20 minutes and virtually pain free.", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 5, "date": "2014-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RcMAc0yoEi5jeXZDEtDIaA", "review_id": "aBdbcRDK5dy-WVQAs2_iRQ", "text": "Am presently under the care of Dr. Fintleman.  I have cornea issues. Initially  did not want to go to such a large center - thought it would be like a \"factory\".  It isn't.  Staff are all friendly and professional.  Have been been back a few times and each time am very pleased with quality of the care I receive (both eye care and care of me as a person) from Dr. Fintleman, and also from the techs who work with him.  As a bonus, eyeglass fittings are expertly done also.", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 5, "date": "2014-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ezplVB5GN2pW4nyE1eMP_A", "review_id": "zAL8gLepm2S7qfZDQVK3uA", "text": "Took my wife here to get LASIK. Procedure worked out fine although she needed some follow-up surgery due to cloudiness. They fixed her all up at no charge and were very courteous.", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 4, "date": "2014-10-04", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "4oyHhFnCxNMQpbKT_mldyQ", "review_id": "nykrpGt5aglX9wZ4bHFUDg", "text": "Joshua Perkins, OD is a recent graduate of Midwestern University of Optometry. He is simply the best. He has excellent mannerisms, excellent demeanor and highest level of competence. I would recommend Dr Perkins to anyone who wants a complete, general eye examination and the best advice and recommendations possible for all your eyecare needs.", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 5, "date": "2014-10-20", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "4M3ZRCLu3LfD39dbKl51iw", "review_id": "Ap-uqrb_Fz7wqKQpU-Ns9w", "text": "After having the President Mark Rosenberg call and apologize to me for a whole series of mishaps wholly Baret Dulaney's fault, nothing he promised came true: He said they'd fast lane me through the process;  it took months and months.   He said they'd make sure no more charges were involved: I got the bills and my insurance was re-charged for extra visits and some of the same exams.  He said they'd make sure I was satisfied; the surgeon called and cancelled for the forth time.  Four different excuses for the cancellations over a period of nine months because they couldn't get their act together. Now I wonder if you want a company that has employees who forget to schedule physicals, forget to do the insurance paperwork and a surgeon (Dr. Berdos) who cancels the appointments after you have waited months and months to get on his schedule?  Does this seem right or fair to you?", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 1, "date": "2014-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3FQo4-c17rnu-PY8LnNj0A", "review_id": "n6lJfkBPJNFSNWX6F-vWqg", "text": "\"Daisy\"s review hit the nail on the head. I think that the individual people working at BDP are fine, but there are just too many of them! I've been with them for a year's worth of treatment for a serious eye issue and have seen so many people and treatment rooms that I come out feeling like I've been run through a pinball machine!\n\nI might be more complementary if my problem had been solved, but after a year and more appointments than I can count, my eye isn't much better. The practice is proud of their technological expertise, probably justifiably so, but I'll be going back to a simpler practice format.", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 3, "date": "2015-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ycHGcjAm1v6CRl7ccdnw7A", "review_id": "_RphscVftUGl0L4mBevyGw", "text": "dr bowey, yells at me on my first visit with her, because my previous doctor was available that day. However when I made my appointment a month prior I was advised that 'my' doctor will have moved to a different location and not available at Arcadia anymore. I don't want to run around for possible bloodwork and requested to be placed with a Doctor available in my prefered timeslot. \nThen Dr Bowey writes me a script, but I just found out from the pharmacy that all request for refills are denied as ' unknown patient'- funny since I've been with that location almost 15 years. \nAfter-hour care was nice enough to write me a script, but for the wrong dosage...\n\nSo now i've been without bloodpressure meds for 3 (!) days and counting.\n\nThe answering machine states that Dr Bowey doesn't do refills without an appointment, but the lady made very clear that she will not see me as a patient- so what am I to do??\n\nToo bad I can't give less than 1 star for this specific doctor", "business_id": "c_PhRjEIA2jRAvWDWsn4Vg", "stars": 1, "date": "2014-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l7su19JMiY9OJRl2dofLxw", "review_id": "C79iwGzVpQjdewH3lVO6JQ", "text": "I called for an appointment at 8am and was told it was a walk in basis today. So I walk in at 10:50 and there were four other people here 5 more walked in after me. Everyone has been back to see the Doctor but I am still here. I asked if everyone had an appointment and was told no they were all walk ins. So be prepared to sit and watch the walk ins walk right in while you continue to sit. This isn't the first time I have had to wait. My first visit I had an appointment and I waited for over an hour. As I sit here 3 more people have walked in. Let's see if they all go in before me. Urgent care would be a better option if you need to see the dr. I don't recommend this place and after today I am pretty sure I am going to find a new doctor.", "business_id": "c_PhRjEIA2jRAvWDWsn4Vg", "stars": 1, "date": "2015-11-27", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 1}, "user_id": "V1_3yModtZm-WmHs1zbc7g", "review_id": "0LxMQL4rIN8W58amBbyhZg", "text": "The summary is that I could have been better served and diagnosed by a blind monkey than I was by Dr. Lawrence Kramer and his staff.\n\nDon't get me wrong.  I'm not normally one to be negative.  But I have never left a place of business feeling more disgusted, useless, and violated than I did today.  \n\nMy experience: I made an appointment at 11:15.  Showed up at 11:15.  Didn't get in until 12:00.  Then, my appointment with Dr. Lawrence Kramer was shorter than the time the nurse took to measure and weigh me. Dr. Lawrence Kramer cares only about getting you out as soon as you come in to make more $$$$ by seeing more patients.  \n\nAnd patient beware: he'll try to get you to buy more stuff in the short amount of time he'll spend with you.  First he tried to force a chest exam on me...then it was a flu shot.  And I'm supposed to trust this guy?  He doesn't even try to diagnose the problem, and then wants more $$$ by prescribing stuff that is totally unrealated to the reason why I'm there.  \n\nAfter my experience with Dr. Lawrence Kramer, I went outside and ran into one of the workers in the building.  I told her about my experience, and she asked about the doctor.  I said, 'I went to see Dr. Lawrence Kramer.'   She said, 'Go figure.  That doctor is the worst.  He only cares about the signing off on tickets.'\n\nEnough said.  Take your kids, your health problems, and your medical insurance far away from Dr. Kramer at the Biltmore Medical Center on Highland.  Hopefully the lull in his practice forces him to reevaluate how he treats his patients.", "business_id": "9zlpLPhXYwK_STi2u8DjxQ", "stars": 1, "date": "2009-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "u2Jed1MjcTPNnVmBZvfc3Q", "review_id": "zxYocbGkiUfF6cJ6nXYlBw", "text": "Went to see him 2 times both I waited only a 10-15min in the waiting room but the 1st time I waited in the exam room for about 30min. I could hear him talking to his staff about other issues but I'm assuming he was busy. He spent about 20 minutes with me and he seemed to know what he was doing. After I spoke to him I felt better about seeing him I hope the long waits in the exam room does not continue. Other then that I think he is a good doctor.", "business_id": "9zlpLPhXYwK_STi2u8DjxQ", "stars": 4, "date": "2010-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J6tbGy-l8aBlfwM6I20g4Q", "review_id": "zczY-TMQPUSnMANbrS5S8A", "text": "I had hip replacement surgery on August 25, 2014 and within 2 weeks was walking with a cane and after week 3 was walking fine by myself and actively working.  His office staff is friendly and communicates well.  He is a great surgeon that is proud of his work and is concerned with your health..  I highly recommend this Doctor!", "business_id": "OJDtbPWAuym1iKawyuHNZg", "stars": 5, "date": "2014-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KWmPrxaVybf1mbnLDFIwmQ", "review_id": "kB9EoCeB5CDNiESS5TqVCQ", "text": "Dr Neal rockowitz is a quack, if you are scheduled for an Ime with him get your lawyer to change it . HE gets paid by the insurance company to lie. He did one on me and said my shoulder was stable and I ended up having surgery for a torn rotator cuff. He's rude and had me wait in a cold room for an hour and read my report during that time without saying a word. Had to go back a second ime a year later and  basically did the same thing but was even ruder. He would not give me a copy of the papers I brought in and even changed what I wrote down and answered himsel. He Dawgs other doctors and thinks he's the only one who is right because he's getting paid to lie for insurance companies to go against you.", "business_id": "OJDtbPWAuym1iKawyuHNZg", "stars": 1, "date": "2015-09-15", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "7zDqr2I0-xpw9HF5Ha54cA", "review_id": "x_PeajkPuO6vwvenfKAlEQ", "text": "Fantastic!!! My first visit to Mountain View was for a follow up appointment after I was rear ended in a car accident, thanks to a friends recommendation. I loved how much information their website had and being able to see which doctors were accepting patients, which weren't and where their areas of specialty lie. I called and made an appointment with Dr. Bauer and was able to get an appt within a few days. She's been my primary care physician ever since.\n\nThe office is great and very orderly. The sign in receptionist is different from the one taking payments. Additionally, they check to see if you need to make any type of copay or payment and only call you up if it's required. Otherwise you can just sit and relax and wait your turn. \n\nYou don't need to wait forever to get in and be seen either. \n\nMy last visit involved a pretty thorough exam and some immunizations to which I informed the receptionist ahead of time when I called. I asked if it would be a problem to have all these done in the same visit and I was told no. I was disappointed when I got there and received a waiver to sign that stated I was only going in for a wellness check and anything else would require an extra visit. It wasn't the extra visit that bothered me as much as I wish someone would've been up front with me. This is my only complaint. However, I do understand I had some interesting circumstances.\n\nDr. Bauer and her staff are amazing. They are very conversational in a nice way rather than a creepy I'm -just-trying-to-start-a-conversation-to-avoid-being-awkward way and answer any questions you have and are very upfront about what is going on. My physical went well and my immunizations were a breeze too. After expressing my concern with a second visit, I was able to schedule an appt for only two days later. \n\nAlso to note, I didn't have to go to another level of the building to receive my blood work.", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 4, "date": "2009-10-03", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 3}, "user_id": "7zDqr2I0-xpw9HF5Ha54cA", "review_id": "NEc2TxsTB8IsN4LGdltJjA", "text": "You never know how awesome a service or staff is until shit hits the fan and it's crunch time. For this reason, Dr. Bauer and her assistant deserve way more than 5 stars, and I owe everyone an update on this review.\n\nI've had a handful of doctor's appointments over the past few weeks, four of them with Dr. Bauer. Not once have I had an issue and every single time there is nothing but helpfulness whenever I have to have yet another crazy unheard of test ran. They've spent countless hours working on the paperwork I need to submit with all the results without appearing hassled or bothered. They've also promptly called me when my results are in or for any other status update I request.\n\nAdditionally, they are very patient when my prescription company acts like an asshat. Due to circumstances I needed to have a 6 month fill of my prescription rather than the typical 3 month I receive. When I emailed my prescription company, they told me this was possible if the doctor's office called it in. However, my doctor's assistant tried several times and got nowhere. Today I was there with her and she patiently tried one last time and made sure my prescription went through as requested. It was something that she really didn't need to do but kindly did for me despite how much of a pain in the ass it was.\n\nWithout a doubt I recommend Dr. Bauer and her assistant 110%.", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 5, "date": "2009-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "2LCrT_BOJvGV4xi_lmoRcA", "review_id": "DQ5DSvkF2CxCj60Ks8DYoA", "text": "I love my doctors.  They are so respectful.  I went in today with serious pain.  My main doctor's partner saw me, as my primary doc was out of town.  She introduced herself, asked me a lot of questions about my symptoms, examined me, and made several recommendations.  Surprisingly, one of them was to see a chiropractor for an evaluation, as the problem seemed to be with the muscles and bones of my ribcage.  Dr. Mansfield prescribed some low-key meds (ibuprofen and a muscle relaxer) and referred me to an awesome chiropractor right next door.  I got the best night's sleep in recent memory, and the pain seems to have decreased some already.  The office staff is courteous and efficient.  I hated to leave my old doctor, who I'd seen for many years, but she moved her office way out to southeast Gilbert.  Mountain View is just a few miles from my office.  I'm glad I made the change.", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 5, "date": "2010-10-15", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "BiZvuNKi0bs_YwttHhhq4w", "review_id": "XqBYieGijYqgqrzN6GS_3w", "text": "Dr. Bauer had great reviews and so did the facility so this is ultimately why I chose to come here. I haven't had a primary in over 2 years I think and need a referral to an ENT so I decided that I needed to develop a relationship with a Dr. and maintain it since I plan on being here for a while.\n\nThe facility is right down the street from my house so nice and convenient. It is HUGE but they have a map at the entrance of the parking lot. When you walk in, you are immediately greeted by the girls at the front desk. They promptly take your information and have you sign the remaining paperwork if you didn't finish it online. You then wait for another lady to take your co-pay. From what it seems this office runs like a well oiled machine, but I thought it was interesting that the woman was copying the co-pays on paper in an old fashioned receipt book. It didn't take long, so I don't really care, I just would have figured since they have online technology for their patients that they would have something for themselves.\n\nAnyway, a nurse came and got me and did the whole vitals thing and checked height and weight and what not and then I was placed in a room to wait for Dr. Bauer. It took her about 5 minutes and she was in and introducing herself, reviewing my paperwork and talking to me about me. She was really nice and straightforward which I liked - down to business. Please don't take it for her being impersonal because it isn't, shes a busy doctor and wants to give you the best focus she can and I like that.\n\nShe checked me out and everything was fine as I knew and she also quickly gave me a referral for an ENT in the same building and had me request my old records. For a first time visit, this only took 45 minutes which was less than I was expecting.\n\nDr. Bauer and the staff are great and I hope when and if I need anything more serious I can prove them right even further as to how good they are. Hopefully that's not the case but I can already tell they will be awesome.", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 5, "date": "2013-09-05", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "q9XgOylNsSbqZqF_SO3-OQ", "review_id": "RT9u4fv8KKEYVaJokCQFuA", "text": "I see Shayna Mansfield and she is a really wonderful doctor. She takes the time to listen to your issues and doesn't push prescriptions on you like so many other doctors. Her assistant is great with follow up and very friendly.\n\nThere have been times when I had to see other doctors (while she was on maternity leave) and they were also pretty great. The facility is easy to find and the check I process is fast and easy (mostly).\nI highly recommend her and Mountain View as a solid PCP/Home Physician office.", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 4, "date": "2013-10-30", "type": "review"}
{"votes": {"funny": 4, "useful": 9, "cool": 2}, "user_id": "Uk5DAoM8NJVEfeSVYPpIRg", "review_id": "k_2WZI_abU_ZG73n-nDZaw", "text": "I am shocked over these reviews. I'm going to have to assume its family or something. I was an unfortunate victim of this group of GPs for years. Because of the long list of the things I needed to see Dr. Lyndo for (no longer there) I felt like I couldn't go anywhere else.  I honestly felt trapped.\n\nThis is the wonderful help i've gotten.\nDr Daveys sat outside the examining room talking on the phone about his upcoming vacation for well over 15 minutes while I listened. It had only been an hour wait getting in to examination room.\n\nThe receptionist are the biggest bunch of rude obnoxious.......they have just about done everything but give me the finger. \n\nI can't tell you how many times my insurance company didn't ante up so they will call you up to the front of the waiting area and in front of EVERYONE ask about it and ask quite rudely. Then tell me they \"tried\" to call  so I deserve being called up to the front of the class. So embarrassing, especially when your sick. They even called me up when my husband (who had a different insurance plan) had not paid. AND told me I couldn't see the DR because of it! Thats after I had waited fifteen minutes already. I have no idea what I was supposed to do. Go beat up his insurance company?\n\nThen there was the time I was prescribed medication that sent me to the ER. Wait no hold on there was the TWO times that medication was prescribed to me that sent me to the ER.\n\nAnd the time they told my son he had loose joints when in fact he had scoliosis. Where you get loose joints from curvature of the spine is anyone's guess. \n\nAnd then when Dr. Bauer accused me of being a smoker, when I told her I wasn't. She told me I was lying....because you know thats what I do. Lie to GP's....Its a bit of a sinful delight for me. I always hope it gets me improved care......oh wait. \n\nThe long waits where always enjoyable. If I got out of there in less than a hour it would have seemed nothing short of a miracle. You better plan on a lonnnnnng wait. They are making vacation plans after all. \n\nI could go on for days. This place is awful. **AWFUL***  Please, go somewhere, anywhere else.  The homeless guy on the corner would probably give you better care. He'd be cheaper thats for sure!", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 1, "date": "2013-11-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "qgsy9qcGVpbhZ3yz6GzkIA", "review_id": "sI7ABH_bquDdxPCtlWqeyg", "text": "Been going to this general physician for about 1 1/2 years.  I have never been seen on time, average is 30 minutes to an hour before I get called in, then another 15 minutes at least waiting for the doctor.  Assume you will need to plan an extra hour at least when going in.\n\nPrescription refills are slow.  When walgreens calls in the refill, the doctors office doesn't respond - I've had to follow up each time.  When I call the doctors office to check the refill status they say \"have you seen the doctor recently\" ... what??  Obviously I saw the doctor which is why the first prescription (that was only for 30 days) was issued by him and also the refill is pending his approval.  Then they say \"oh - I will have to pull your chart and call you back\"... what is going on with this place?  Why does it take my call to get them to process the refill?\n\nFortunately I am moving so I will search for a new doctors office.   I think office take on too many patients, and too few assistants handling many doctors at a time.  Either insurance isn't paying enough so they take on too many patients, or they are too cheap to hire more help.\n\nDoctor Davies is very friendly however, and he does not push prescriptions on you.  I do like the doctor, but I cannot take the process of working with the office.\n\nGood luck if you decide to go with them.  I'm sure all the doctors are fine...that's really all that should matter... but I just can't take the hassle of their slow office.", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 2, "date": "2014-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-Rwn_JlLqNEhQIaiA8gFlw", "review_id": "ujl0d7uSjVsfH7B2weP3Vg", "text": "I have been a patient of MVFP for over 10 years.  I have a great Dr. (Roseann Collins). And I find them to be organized and efficient.  Nothing but good experience with them.\nRichard", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 5, "date": "2014-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sNozn8aPgwI-C7w16v6LGg", "review_id": "t_nvrixMl-TK8bcoiqTNgQ", "text": "The wait was a little long, which is why not 5 starts, but I believe it was worth it for the treatment I received! Wonderful staff that was very friendly and concerned with everything I mentioned. Dr. Bell was amazing. He really explained everything too me. I didn't feel lost once!", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 4, "date": "2014-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S3zdZ4PYZOWqBUHjOj3cIQ", "review_id": "Q0nhW_z0g2FiTYCWcb5dwA", "text": "This is such a GREAT group of doctors! I'm a nurse and I know what a great doctor should be like. Dr. Cornelius is one of those doctors, she takes her time to get to know you and to teach you about your disease process and explains all medications she prescribes. She encourages you to ask questions. Other docs in the practice also give the same quality care if my doctor can't see me. Minimal wait times, and prompt appointments. If it's urgent they try to get you in same day. I always have a great experience here.", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 5, "date": "2015-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "P8vFYE0taDzVSdCH4jgfzg", "review_id": "D6gH9Ca_kQ2z0oZlqt7KIA", "text": "I love Dr. Mansfield and her nurse Cindy! They made me feel so welcomed on my first visit and they actually CARE. They were very professional, personal, and kind. Would highly recommend to anyone looking for a great primary care doctor", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 5, "date": "2015-10-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "b976-zQsf-md9_G5M-oxtg", "review_id": "vUa4fME8bMhPgaKo3QPd1w", "text": "I had lasik this afternoon.  It all started last week when I went to visit this office for the exam to see if I was a candidate.  Everyone was so nice and friendly.  I was a little anxious and they were very patient with me.  They took lots of one on one time with me answering my questions and just letting me freak out a bit.  Everyone I saw asked if I needed anything when I was there.  I was offered lots of snacks, drinks and blankets.  After my meeting with them I felt very comfortable and that this was the place to have my surgery.  They booked me for the next week which felt so fast, but I was ready.  Today I went in and they took some time looking at my eyes again and answering any questions I had.  I was there for about 2 hours, but the surgery itself took only about 10 minutes.  I was so nervous, but everyone was just so nice and helpful.  The Dr. was great and explained everything as he was doing it.  My eyes are a little uncomfortable right now, but I can see!  It's amazing.  I would recommend The Lasik Vision Institute to anyone thinking of getting lasik.  The team just made the process a lot less scary.", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 5, "date": "2013-10-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "futzxGajfqrLDnrZvYsG1w", "review_id": "tpohPWX1TUNZpmfsEul92g", "text": "I had my surgery last month. I know I got a super price but I couldn't afford the additional lifetime insurance cost. I was given the year plan. Yes I was scared and nervous but kept the no glasses goal  in mind. The surgery was quick and painless, the staff was friendly, and I had no problems with the facility.  One thing I suggest they should do for all patience is give them a pain or sleeping pill to knock you out for up to 5 hours after your surgery. Thank goodness I had something at home to take. Remember DO NOT rub your eyes, use all the drops they give you to avoid infection and wear your goggles.\n\nLife after surgery, I am so happy with the surgery and the benefit of not having to wear glasses. I highly recommend this place and have had no issues so far. Just know that you will have to invest in natural tears eye drops for a while.", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 4, "date": "2013-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3x4TXstM6z-lFEXtrO3V3g", "review_id": "r_ggo02a6yUF_MsOuXo-Sw", "text": "Being born with poor vision, and a very strong astigmatism (ontop of being extremely farsighted) getting the LASIK surgery done was something I wanted to do, but wasn't sure how it would be accomplished. \n\nOn a whim, I decided to call and get more information about the procedure and what was entailed. Upon going into the office and going through the 2 hours worth of tests, to ensure that I was a candidate, Diamond and the entire Sales staff explained what was involved. The initial price was high, and was a little bit of a sticker shock for me at first -- which explained why I was so hesitant to have this done in the first place. Seeing my concern, Diamond went and spoke with Laura and was able to provide me with an amazing price that was no hassle. Laura then helped secure the financing portion for me which meant a lot considering I was super nervous about not only the surgery, but also the financing portion of it. \n\nThe day of surgery I showed up, and as expected was extremely busy. However, the operating room, the waiting room, and the entire staff was amazing. The main lobby is a little crowded, and you have a few kids running around which always makes it a little overwhelming. For the most part though, the idea that you're walking out of there and having your life changed forever makes it worth it. \n\nThe procedure itself is a little uncomfortable. You feel no pain, but there's some moments that your entire body is startled by what's happening. That being said, 10 minutes later, you're out the door, and you're home sleeping it off. A little bit of bruising for me which is understandable, but the moment that I realized I had the ability to see normally without the help of contacts or glasses made it worth it.\n\nI would absolutely recommend the entire team, including the Doctor's and Sales Staff.", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 5, "date": "2013-11-18", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "JpqCDi7ipfW_tDO39wKaSw", "review_id": "wbeep9MEakAkNqZvNfQ-ew", "text": "Had Lasik vision correction here in feb 2014, vision has been 20/15 since. This was the best $2k I have spent anywhere. Only issue I have is I wish I had seen their ad sooner. The breaking point for me to get Lasik was that LensCrafters kept screwing up my last prescription!", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 5, "date": "2014-10-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "77js9IltY3IsnDNxoP9t6g", "review_id": "5hLgCglym0OdCEwt5CTOhA", "text": "100% Satisfied. Today is day 2 of my procedure. On day one I woke up and could not believe what I saw, because I saw everything. I immediately took my daughter to our flower gardens and I saw color, shading and detail that had never been there before with a clarity I can't remember ever seeing. While I could see at 20/20 vision with my glasses, this is just different and for the better....MUCH BETTER!!! At my next day follow up appointment I walked in and asked if I get to hug everyone there. While I realized it isn't guaranteed, I was seeing at better than 20/20 vision after Lasik and they said additional improvement is still possible and that the clarity will probably get better after done applying the medicated eye drops. I'm ecstatic now. I can't imagine if it gets better....Are there negatives? Well perhaps the initial recovery. My eyes were a little scratchy/irritated after, but unlike other medical procedures where the benefit of the surgery can take months to realize, you actually \"literally\" begin seeing the benefits the moment the procedure is over. You will walk away without your glasses. By day 2 I am having zero negative effects. My eyes are not dry, scratchy, runny, etc....I'm putting eye drops in just because.  As for Dr. Kownacki and the staff at Lasik Vision Institute, they were professional and made me feel comfortable and relaxed through the whole procedure. Be assured and glad you choose them if you have the surgery. This is already worth every penny and I can't believe I waited so long.", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 5, "date": "2014-11-23", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 0}, "user_id": "Y3GZCzu_BKOl-Gt11jB_Xg", "review_id": "3RbRz4vKRltHiEfdMyEatw", "text": "I had surgery done at the wonderful Albuquerque location by the fantastic Dr. January.  He  was wonderful, comforting, professional, and got my astigmatic 20/200 eyes down to 20/15.  I bought the wavefront, and I didn't know it was possible to see so much depth and contrast, it's not just about focus.  I never had to wait more than a few minutes in Albuquerque and the staff there is friendly and pleasant.\n\nI had to have my final postop exam here in Phoenix due to a temporary move.  This is a ten minute exam.  When I scheduled the exam I let the woman on the phone know that I was an Albuquerque patient, and she said she would get my records from them right away.  \nWhen I arrived for my appointment, they did not have my records and acted upset with *me* that I didn't have them.  Everyone at the front desk was brusque and unfriendly.  I sat in the waiting room for an HOUR.  I went to the desk at about 45 minutes and asked if there was a problem, I was rudely rebuffed.  At an hour I asked how much longer and was told \"I don't know\".  I had to insist that I needed to know before the extremely rude, unfriendly woman at the desk would even check.  She and two other women stood talking in the hallway for about five minutes, looking at me frequently, then I was told another 20 minutes or so.  I drove an hour to get to this appointment with two small children in tow (which should not be a problem for a ten minute checkup).  I couldn't wait any longer and had to reschedule.\n\nThe staff implied that it was my fault that I was asked to wait 90 minutes for a brief checkup, because I had scheduled an appointment for a postop day.  Nobody told me that, I took the appointment that they offered.  When I stated that a doctor's office should see patients around the patients appointment time, they were very huffy and stated that it was impossible for patients to be seen at \"exactly\" their appointment time.  When I pointed out that we were talking about 90 minutes, not 9, they just looked at me like I was crazy.  During this exchange a couple of other patients in the waiting room nodded at me when I looked around the room.\n\nDr. January is great, but if I had to see him at this office, I would chose another surgeon.", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 1, "date": "2015-10-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "eU0zDBERw60-TU07y6e9mA", "review_id": "nyjh7CoW0z1smN-uZoWaaw", "text": "Well, had my lasik exactly 2 weeks ago now and still waiting for it to work???  I can't drive at night anymore because I cant see.  Glasses dont even work.  Doctor said dont worry about it....??  Well, I am after reading the other reviews.  When will I be able to drive again????  I'm stuck at home waiting.  Will update later!\n\n11/1/15:  Just over 5 weeks since my lasik.  Still waiting for vision to improve.  5 weeks and blurry and hard to focus.  Wishing I didn't do it but going to be patient!!!", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 3, "date": "2015-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_KT63-iB6D5a3YLS1EtCDQ", "review_id": "Ia365JR5YM8WuBIiz-amnQ", "text": "I haven't had my surgery there yet, but I'm so impressed with the staff I wanted to write a review! They are very upbeat, friendly & still professional. In particular, I'd like to compliment Valerie & Robin, that's not to say everyone I interacted with wasn't wonderful, unfortunately, I just don't remember everyone's name. I called today with a realization about something I told them being incorrect & was worried it would affect my surgery, which is scheduled for next Thursday. Robin assured me it would be fine, they'd be rechecking my eyes anyway, so not to worry. \nI'll be posting an additional review after my surgery, so keep an \"eye\" out for it. ;)", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 5, "date": "2015-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Dft8GWCG6bC6o0OCtJuGUw", "review_id": "NGpdDiIP3FT1xMCYrAQKHw", "text": "Me and my Husband had the best experience with The LASIK Vision Institute! From the very start the whole staff was super nice and courteous. At one point when my husband was having second thought about the surgery, the lady up front assured him everything would be just fine... and it sure was! Valerie treated us like family and we really want to thank her for her above and beyond service!! No doubt about it, this is the place to come if you want your lasik surgery to be done the right way. Would definitely recommend this place to everyone!", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 5, "date": "2015-11-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8fn9s8jFzf0XQBXWs2lIzA", "review_id": "pn6oFfgueUjwHsU_1yIhKg", "text": "I'm 3 weeks post-op and its the best decision I've made for my vision! I now have 20/20 vision after wearing glasses or contacts for over 30 years.\nThe total experience has been awesome from the first appointment to my 3 week follow up, the staff, the doctors, everyone in the office and the call center is fabulous, friendly and helpful!! Thank you Lasik Vision for your excellent customer service, knowledge and making me feel comfortable during the entire process. I highly recommend Lasik Vision Institute if you are considering Lasik surgery.", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 5, "date": "2015-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_KT63-iB6D5a3YLS1EtCDQ", "review_id": "cwjYgrQvudkqJ68lOh0yiw", "text": "Well, as of 4pm today, Lasik is DONE! It was definitely a weird experience, I don't much like anyone messing with my eyes, & this felt bizarre, but really worth it! When it was done, & it seriously took maybe 10 mins, I could see, but it was blurry. Had, & still have, to wear sunglasses for the rest of the night. But my vision keeps getting clearer & clearer. I LOVE where I went, the staff is wonderful, as are the doctors. They talk you thru every step, telling you what you'll feel, how long you'll feel it for. I couldn't have asked to be treated better than I was. I can't wait to get up tomorrow & reach for my glasses, only to realize I DON'T NEED THEM!!!! For the 1st time in more years than I care to admit, ok, it's about 41 yrs, I don't need glasses or contacts to see! Follow up visit tomorrow to see how everything looks, I'm sure it'll look great!", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 5, "date": "2015-11-12", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "PYtryNSk30ytqOc_36sLPw", "review_id": "vfrew953FdQZ_ZuAID45oA", "text": "Finding a Family Doctor can be difficult and I have been having a rough time doing so since my former Doctor retired recently.  The requirements I had were...\n1.  MD\n2.  Office with one or two doctors...I hate when there are a bunch of people in the waiting room( especially gross sick ones ugh!).\n3.  Friendly, staff that actually returns calls!\n4.  Doctor that doesn't make you feel rushed and listens to your issues!\n5.  Easy to access, not in a big building that is hard to park in.\n6.  Available appointments.\n\nDr. Riley is all these things and more.  I'm  really happy with the ease and the great medical care.  His nurses are good with needles as well.  I had to get my blood taken and a few shots and she performed like a pro with confidence!\n\nSo, if you are in need of a new Doctor I highly recommend Dr. Riley.  I think they also take most insurances as well!", "business_id": "BZqn7i_Z-MJ1QrxCyjFZSw", "stars": 5, "date": "2010-09-25", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "H-ZA_eRz4BzyPSH6cahFkQ", "review_id": "VUMsCAwJHozkyjWV22BXGw", "text": "Dr. Riley has been my doctor for 15 years.  He is such a caring, competent doctor - I can't imagine going to any other medical practices.  His staff is very nice and really good about working with your schedule to get you in as soon as possible.   I really appreciate all he has done for our family.  And I would highly recommend him to anyone looking for a great doctor!", "business_id": "BZqn7i_Z-MJ1QrxCyjFZSw", "stars": 5, "date": "2012-10-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ckuIliYOnczhGakX1scJVQ", "review_id": "wpX5NCi35HpsFUnEDrIShA", "text": "I have been going to DR. Riley for a couple years and I would recommend him to anyone that wants a doctor that is very handles on. He is always the one that sees you unlike some offices that have PA ect. he always takes time to call me about my lab results. I have always had great service and experience", "business_id": "BZqn7i_Z-MJ1QrxCyjFZSw", "stars": 5, "date": "2013-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "H-ZA_eRz4BzyPSH6cahFkQ", "review_id": "HrZQg98uBDOEuFnrg6Pb-Q", "text": "Dr. Riley has been my doctor for 15 years.  He is such a caring, competent doctor - I can't imagine going to any other practices.  His staff is very nice and really good about working with your schedule & theirs to get you in as soon as possible.   I really appreciate all he has done for us.  And would highly recommend him to anyone looking for a great doctor!", "business_id": "L6f65Mpp5kMBjUnUY6lQ5g", "stars": 5, "date": "2012-10-01", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "j4bxJyvIBwpL1KS-S65Mbg", "review_id": "sb7D74-MbUM_OFBZFvir3w", "text": "Dr. Wayne Kuhl has been my primary physician for more years than I can recall.  Recently, the moved \"down the street\" to a new, updated offices.  I am writing this review because it seems that MANY, many people use Yelp to find...anything.  Dr. Kuhl and his staff make going to the doctor as pleasant an experience as it can be.  Not only is the Staff extremely courteous, professional and cordial, they are actually friendly and nice!  They remember patient names; spend the necessary time with a patient when necessary, even if it means someone else will have to wait.  Dr. Kuhl, naturally, is a Board Certified physician, which should be important to anyone choosing a physician.  He is thorough, explains anything and everything about which you have questions, and goes over every test result with you, one by one.  If Dr. Kuhl thinks you need to see a Specialist, he is the first one to make that recommendation.  There is no \"ego\" involved.  I think the most telling thing I can share with you is a memory of something that happened in his waiting room when I happened to be there - many years ago.  The waiting room was full.  He was running late.  Suddenly the door opened, and there stood Dr. Kuhl.  He APOLOGIZED for keeping everyone waiting, but said, \"I have a patient that simply needs more time than we had scheduled.  I promise each of you, if YOU were that patient, I would do the same for you.\"  I think it is rare that a physician ever apologizes for keeping you waiting, even when they walk into the exam room.  This was extraordinary.  I would recommend any of the physicians in this practice without any hesitation.  Also - if you have an emergent situation, they find a way to see you - that day! That is a huge thing in my mind!", "business_id": "5mz8CUNzBGOhrkvRqcWOzA", "stars": 5, "date": "2012-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "qZZTEb2UvTQ49PfoaorX1A", "review_id": "PLLNlIMDPTYzcif-zsD00A", "text": "Dr. Johns and his staff are wonderful! They are always helpful, kind and thorough. Most doctor's offices try to push you out the door--but not this one! Also, the office is always clean. Overall the best GP I've ever had.", "business_id": "5mz8CUNzBGOhrkvRqcWOzA", "stars": 5, "date": "2014-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "KRvx3YeAa5MZZGDGHLXrIg", "review_id": "9MgYlIVScRx-rrauGRHm9w", "text": "I wait in a lot of Doctors offices. I am used to it. I am used to being treated as a number. I am used to staff looking at you with blank states of \"God is it 5 yet?\" I don't even have a heart issue. But I failed one EKG and to be allowed to have surgery (I have had more than I can count) I need a permission slip.\n\nSo I kept my 8 am appointment to see Dr. Byrne's. At 8:40 I was wondering how can he get this far behind already? Then walks in the PA (nurse). She is nice and have nothing against her. But she proceeds to do my exam. Then she goes \"ok let me go check if the doctor has any more concerns.\" I was wow this greedy bastard books so many appointments at the same time he doesn't even have time to see them all. So even though my appointment was WITH THE DOCTOR. I never saw him. What a joke. I will stay without him only because I have no heart issues. The minute I do I will find a doctor who at least shows up for his appointments (even late).", "business_id": "gVEtYzzezWoy1Jfvtv3ZLg", "stars": 2, "date": "2015-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SIt3Ond-jbL3MGFexfVv9g", "review_id": "ULVQCm4N5qe0KyLNzh1bRA", "text": "Don't waste your time\nI made an appointment today, showed up on time, waited 30 minutes before the receptionist even acknowledged me, and told me that I didn't have a appointment! This place is a joke, the staff is extremely rude and slow, don't bother going here. My wife has been here several times and it can take her hours to get through a appointment.  Find another doctor.", "business_id": "vDftL4Exl7ZcMVx2aPY8mQ", "stars": 1, "date": "2014-09-30", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "fcY1Tztpwzc600IDWBkJeg", "review_id": "FYRsdRj3gaKYACMCUjAAAA", "text": "I have been seeing Dr. Romine for a while and find her and her staff to be friendly and attentive for the most part.  I do somewhat agree that the receptionist is less than bubbly otherwise rating would be a 5, but if I can get my skin cancer taken care of by a Dr. that I trust I can tolerate a front ofiice that is competent and businesslike, but not qute friendly.  As for the freckle removal that Kathy didn't like, they usually remove only stuff that looks suspicous and my experience with that is better a small scar now than a big one later.", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 4, "date": "2011-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "qq1X_oQszdvvZwHbbheSFQ", "review_id": "6yL-iWKSHZMx8E-2cEglyg", "text": "This office is very incompetent. I asked for an annual check up but the PA Molly who is very rude, said she was not told I wanted that and spent THREE MINUTES total with me, and left without ever asking me if I had any questions. She was concerned with staying on schedule (she was already late) rather than treating me. The room I waited in was FILTHY--dirty dressing gowns overflowing the wastebasket and on the floor.", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 1, "date": "2012-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7OZDXIh7i1narjxyHbycKw", "review_id": "-LY6MriePZq7h3H9gJJBaQ", "text": "I am not a Scottsdale housewife, just a regular joan schmoe who was pretty sad about the state of my skin. Then I met Adrea...\n\nIf you need a good licensed aesthetician make an appointment with Adrea, she is amazing.  I made an appointment with her first and brought in everything I use on my face.  She went through each product and recommended new ones when needed.  She recommended budget friendly, regular trip to Target options, and provided coupons when she had them.  \n\nShe determined I needed more help and I was able to see the doctor right then and there.  Adrea and the P.A. teamed up and between the two they fixed me up.   I continue to see Adrea and she is incredibly knowledgeable and explains all the options in detail. She never tries to talk me into anything scary.  The office seems to cater to older folks with skin cancer and teenagers with acne problems, I don't fall into either category but know the office can handle issues more serious than my vanity.", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 5, "date": "2012-09-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l45QzWJhm_juNwjIUI0Law", "review_id": "5XG-fRPcyeEYzbHFYKkFHg", "text": "Doctors are great but the wait is loooooong...", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 3, "date": "2013-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "ELWPlw1kkxqgEuylNGYTSg", "review_id": "XsU-prfTtVGIbEmRKQ7nKA", "text": "I've never had a great experience with Dr. Romine's staff--they're always rude. I've only seen Dr. Romine once--for only a few seconds--in all the years I've gone to her office. She's conveniently located and usually has availability, which is why I continue to go there. Unfortunately, her employees have the worst bedside manner I've ever dealt with. I went in the office last week to have a cyst injected and when the PA, Molly, entered the room, she asked what I needed. Instead of finishing her question, she started laughing when she saw the cyst. It was horrible.", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 2, "date": "2013-10-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HtqLdQPTb5SjH_6ytxCmJg", "review_id": "lTQDmf7C1c71YpwEDmBr2g", "text": "Friendly professional staff PA was great talked to us not down to us. Made my daughter feel at ease and comfortable. The Dr. Came in gave her opinion told us what to expect IF it had to be removed felt confident there wasn't cause for alarm. Biopsy was done to make sure all was ok.", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 4, "date": "2013-10-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "CZiJ3dHE00_ztnhj004upQ", "review_id": "w4jCNpxUqZ-g0A7AxCBC1A", "text": "Beautiful new offices at 40th street and Campbell, but apparently their clocks don't work. Just sat there for 60 minutes past my 8:45 am appointment time, and no one saw me. Had to leave for a meeting. If I was in customer service there, I would remind the doctors that their customers' time is more valuable than their own.", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 1, "date": "2013-11-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KMNxwZ8e5sYVfBGuDbuU7w", "review_id": "MZ9gTNKEr4Q19MQPfMErWA", "text": "Visiting family and found this place to get the silk peel done.  Nice office, friendly and caring staff-everything was on time- dr came in at the end to say hi....\n\nAll in all,no complaints - i would recommend.", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 4, "date": "2013-11-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4SRdmzOMfzqCW3Qk9LzETg", "review_id": "0E8f-S13vOWnkKRVr1u0XA", "text": "The scoop is...an office full of staff, with yes, pretty, sometimes smiling, clean faces, however, none of which truly know anything about running an office nor how to deal with patients or customers!  Seriously, your focal point is \"skin\".  One would think that alone would be a sensitive subject but not at this office.  They are more concerned with their own image and their own appearances which detracts from the patient(s) who are relying on their team to solve issues, advise and create lasting relationships.  \n\nThe list of problems with this facility is quite a long one, starting with the initial phone call. The phone rings and rings.  You can never get through to scheduling.  Then switch over to a \"medical assistant\" line and still can't reach anyone.\n\nOne Medication after another, confusion and mix ups with medication, multiple visits that end up going/doing nothing...no empathy, no sensitivity, no details to treatment plan at hand...save yourself frustration and time....look elsewhere!!!", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 1, "date": "2015-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CtSzzeHEXsIvnrf5ANjHdQ", "review_id": "afwKue6jhObdI-ql7T3jQg", "text": "It is very disheartening when you have frequented a place and years and then have to find a new doctor.  I always have shown up to appointment early and then have had to sit and wait for 30-60 minutes after my appointment time to be ushered into the back room.  Once in the back office, there was always another waiting period of 15-20 minutes just for the doctor to come in and spend 5 minutes with you.  Let me mention also that they only make appointments 4 months out....not helpful if you are dealing with skin cancer issues.  \n\nOn this particular day I was running late for an appointment due to a work meeting.  I called as soon as I was out of my meeting (10 min past my appointment) and let them know I was 4 minutes away....I work right around the corner from their office so it was very convenient.  I was told not to bother coming in and they would not be able to see me until February!!!  I understand that I was showing up late for an appointment but how can an office that is constantly 30-60 minutes late for appointments fault a patient for being late one time?!?!  When I told the person on the phone that I had reoccurring spots, I was previously treated for skin cancer, she said sorry but there was nothing they could do.  \n\nI have gone to other doctors and once you are an ESTABLISHED patient, they work with you.  This was not my first time with this office, as I was an established patient, but now I will be looking for a new dermatologist.  If you choose to go here, make sure you plan on an extra 30-60 minutes of waiting time past your appointment, but don't you dare try to show up late for your appointment time.  In addition, if you are going expecting to see Dr. Romaine, don't bother.  Over all my appointments, I have only seen her once and then have been handed off to practitioners.", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 1, "date": "2015-11-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "THYIqfnLV54VZ_v2hCfq2Q", "review_id": "syQlUr5WzigvSGWIqhp0HQ", "text": "I love, love, love this place.  I switched from a previous office where the place always seemed to be a three ring circus.  Working together with Dr Oclair and Kate Montgomery, feels like a team.  This place is a well oiled machine!  My most recent visit with Kate Montgomery was to go over some maintenance medication concerns over health conditions she had more familariaty with, and the fact that I wanted to change, and what our next steps were.  We agreed on a change, but would do it by making sure we had the information needed to make sure the proposed choice was a good one with some additional blood tests.  She knew about the medication I wanted to switch to and provided me with well rounded information.  Unlike previous practices, this office is not change adverse, and after I explained why I wanted to change, felt we were on the same page.  This is easier said then done with most practices.  The office is a bit of a drive for me in the mornings 45 minutes which is longer than I like, but with the service received, it is so worth it.  Also unlike my previous provider, when receiving maintenance medications they provide at least 1 or 2 refills that way I'm not there additional times just to collect additional co-pays.  I feel like an empowered patient, Thanks Dr Oclair and Kate Montgomery.", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 5, "date": "2010-11-03", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "IRYpw2WKE1d7inVxa6j_dQ", "review_id": "r1ygcjalyDZ-5pgJaTHlqg", "text": "I was referred to FPS by an emergency-care physician for an MCL injury I suffered in a fall. I was seen by Dr, Francyk who immediately went to work. After an MRI and other tests, Dr. Francyk refereed me to Endurance Rehab in Phoenix. The rest is history. I've seen Dr. Francyk and his nurse Sara for more than a year now for wellness, blood pressure and cholesterol issues. The doctor and everyone at FPS has been caring, helpful and have gone the extra mile to see that I'm well taken care of.", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 5, "date": "2012-09-26", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "ixKX_0b7aa9I7z2H5g_Rqg", "review_id": "1kDJ552Ip81r2ogTgQ_-Mw", "text": "They charge an annual administrative fee that is not covered by insurance.  Basically, it's like a credit card annual fee.  This year 2012 it's $60.  I'm not one to pay annual fees at my bank, on credit cards, and definitely don't want to start at my doctors office :(  It's up to you though.", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 1, "date": "2012-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ndgp2j_vMlm8-_a8aVPdGw", "review_id": "8A1_ZXo95jNWNegSGTuepA", "text": "Ok, these doctors are fabulous, but I absolutely agree with the other posts about the billing department.  They don't answer phone calls, and they charge $60 per year, whether you see them or not!    My husband and I both go to the practice, and we get these notices in the mail about the fee constantly.  We BOTH get charged the fee....  Even though we have never NOT paid a bill, we still get pretty gnarly notices on bright yellow paper threatening to kick us out of the practice if they're not paid immediately.  Dr. Wyse is the best doctor I have ever had, but I have considered switching because of the dumb billing department.", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 3, "date": "2012-09-26", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "RG3fSnsUFnagOcJgyOzMEQ", "review_id": "c4bmWoQWfvOG26rNTmTP3w", "text": "i've been seeing dr. goldman for more than 10 yrs..  very happy with him and his staff.  about a yr or so ago, i stopped going to him.  he charged an administrative fee of yearly $35 or something ridiculous for seeing him for paperwork, etc. processing.  Really?  even couldn't be grandfathered in after i complained for being a long standing patient.  he moved from 40th & bell to camelback and i continued to see him.  i didn't ask him for more gas??!!!  i continued to make the much longer trip & nvr complained.  this took the cake.  a drs. office charging an adm fee?  argh! i have since gotten a very nice doctor around the corner i'm happy with but decided since apparently i'm still good enough for their email list and had a yelp link, i'd give my 2 cents worth!!", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 1, "date": "2012-09-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ttUG2PQuv7YQ8iHdC0KOeg", "review_id": "_NJlsZdAaltdw0EAaDhQLA", "text": "Dr. Wyse is one of the most caring doctors I have ever had.  He takes the time to listen vs. just writing on a notepad.  Dr. Wyse follows up with you very quickly and actually cares. He also goes over treatment options with you and explains options so you understand everything.  I feel very lucky to have him as my doctor.\n\nI also want to note that Carmen his Nurse/P.A. Is wonderful and give the same quality service as Dr. Wyse.", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 5, "date": "2012-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NqoaK7KuK20O8t5nLLgPLg", "review_id": "RkY5oMXISH9YMvkDDFw20w", "text": "Did new sign/graphic install here and the people were very friendly and accessible. The office was busy the day we were there for this install, which shows me they have a very thriving practice. Good to know, in case I ever have to refer someone to a new doctor's office. This one is in a nice business/medical/professional park.", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 5, "date": "2013-09-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ruTb7ZgxN0YMzNqbebe02Q", "review_id": "tui5AL6ljlAzut5RHEQ4uA", "text": "I have been a patient of Dr O'Clair's for several years now.  Wonderful doctor.  She just left, so I'm leaving too!   The staff is great, with the exception of a few so-called Doc's.  It's their practice of charging patients an admin fee annually to be a patient.  Really crazy.  I paid it the first year $39 per family member, only to stay with Dr. O'Clair then they raised it last year to $49 per member, and you know I just don't think we should have to pay for the administrative staff, that's a part of owning a business, it's called operating cost.  Also, if you don't pay the fee, they send you collection letters and then if you don't pay, you get put on the inactive patient list :(  What a crock!", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 1, "date": "2013-11-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1ZVRMlwbluX9WyT7MldWGA", "review_id": "ZsSBa47iMG7pwpCWd4BYBg", "text": "I will keep this short and sweet. I never even met the doctor. The office staff was the rudest experience i have ever had. I have called for the past month trying to get results with no luck. No one returns my calls and the girls on the phone are rude and not friendly at all. The doctor may be good but for me, it's about the whole experience and this was an awful one!!!!!", "business_id": "Y68Ysab60gJhX7YBjESgBg", "stars": 1, "date": "2014-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "KRvx3YeAa5MZZGDGHLXrIg", "review_id": "On98br7fT45Z-R2Fdz_3hw", "text": "I see Dr. Corcoran. This is the only doctor I have who does not rush you out! He will listen and work hard to find a answer for you. The office may be a bit slow sometimes, but I KNOW bad doctors.... He is worth the wait! He is easy to talk to too. For some reason I don't get the \"stink-eye\" from him. Great feeling to be believed and offered help.", "business_id": "1GXycbqgmD9TfhQFoktSLg", "stars": 5, "date": "2012-10-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rGIFxf2zOggqX743_YCrTQ", "review_id": "VwybSo2w3g_R1N_3ANAuXQ", "text": "5 stars for the doctors but not happy about the 1-2+ hour wait time EVERY. SINGLE. VISIT. Finding a new doctor because of this unfortunately. So disappointing!", "business_id": "1GXycbqgmD9TfhQFoktSLg", "stars": 1, "date": "2014-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KRvx3YeAa5MZZGDGHLXrIg", "review_id": "UzI8hcqLSjuZhJvrHh1tDQ", "text": "I really am heart broken. Today I arive 15 minutes early for a 11 am appointment. There are cars driving around in circles. People honking at each other. Elderly people were being dropped off at the door. There was NO PARKING open. This plaza has many doctors. Clearly after the employees take a large amount of the spaces there just are not enough left. The parking lot is set up very strange. There are many tight turns and it is easy to not see people backing up. I have a large truck. I only got lucky to find a spot because I have handicap parking. I still had a long walk because this space was at a different building.\n\nI am struggling as what to do. I love Dr. Corcoran. But it is getting harder and harder to see him. Add to this now you don't know if you will be able to find a parking spot? I mean you want your family doctor to be somone you keep close ties with. I have had a long ugly medical history. I expect these issues when I see specialists and surgeons. I don't expect this for your PCP. Not sure what I will do. I think Corcoran is one of the nicest down to earth doctors around. But if there becomes too many barriers to see him.... Well you start finding out you don't see him. I have a couple of times gone to a quick clinic in a drug store simply because it is just easier. Not sure if that will become the norm.", "business_id": "1GXycbqgmD9TfhQFoktSLg", "stars": 3, "date": "2015-11-19", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "OhVEgd-uyuCOV68NNTOftg", "review_id": "9Tmb4r4QCK93fUUFaamHRg", "text": "Dr. Robert Meger: Best Surgeon in the Valley. \nI had my Breast Augmentation just over a year ago and am simply in love with them every day. I had multiple consultations and I never felt confident in any surgeon until I met Dr. Meger and his staff. \nMy breasts are perfectly proportioned and the scars nearly noticeable. I went sub muscular, incision under the breast, and they are gorgeous! My recovery was easily managed with pain medication and a breezy post op check. I return for facials and Botox Treatments and wouldn't go anywhere else!\nI highly recommend Dr. Meger and his staff to take amazing care of your needs.", "business_id": "H8_d-SvwBz-Sd_ZTK7Kucw", "stars": 5, "date": "2014-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "lwxU-oSGST2PZ0NDtrRIsw", "review_id": "ATVVtSqblk30TUeQ--nDng", "text": "I did not feel rushed and they took their time. It is very low cost and were able to get me in right  away.", "business_id": "8PnmGKOTyHKp0b04w62fMw", "stars": 5, "date": "2014-09-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F-FtosdquzANwM9RPTKdIA", "review_id": "Lg-shT6Dd0hMUL7lMu500Q", "text": "This place is AWESOME! They really help women! I felt all my questions were answered. I didn't have any insurance and this was affordable.", "business_id": "8PnmGKOTyHKp0b04w62fMw", "stars": 5, "date": "2014-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rxkt-NSYPeAqnNHXihnLsA", "review_id": "K_VYayEIAIo56_QX8qcHGw", "text": "Its a blissful visits always .. very good at giving suggestions and time to new moms and dads", "business_id": "31wytPjgKJAf0QJov1Y4Tw", "stars": 5, "date": "2015-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bGYjsKlGK_4MvfCRAZeJAQ", "review_id": "YgBspx-6txE59ZkZ7TsG7w", "text": "I like Dr. Padrez., he's awesome.  The staff most times are just rude.  Everytime I would take my daughter for a check up,  she would have to see another dr. Because he was always booked. My daughters 16 months and she's seen her dr. Only about 3 times out of the 10 she's been to the drs. Not to mention everytime they have another dr look at her it was another 76 patient establishment charge I had to pay.  That was ridiculous.  When I called in to ask if I should bring my daughter in asap, they said a nurse practitioner will call me right back. ... It took her 2 hours to call back.  By then I had taken her to the hospital for a spiked fever and a stomach bug.   It happened more then once.  I switched drs and am very happy with where she's at now.", "business_id": "lgyBsM93DBchuwU-_l0Sfg", "stars": 2, "date": "2014-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "vzwS0Hy3J5r3URvQ3eJr5A", "review_id": "_KMKLQUx_vTnl1uRPUqx0Q", "text": "As an ongoing patient at John C. Lincoln, I've been under the care of the nursing staff of Four East (4th Floor) and can tell you there are many caring and helpful staff members. Doctors, nurses and Patient Care Technicians (PCTs) have been friendly and mostly sympathetic. Compassionate care, flexibility for my family and friends' visits, and a peaceful environment are all very important to me. I can honestly say that the staff at John C Lincoln has met all these requirements.\n\nI've been fortunate to have a large, private room on most of my stays. I have many family members and friends who visit, and so I appreciate having the extra space for them, as well as the flexibility when they sometimes come outside of normal visiting hours.\n\nI can tell you I've had a plethora of tests and scans throughout the hospital. Department staff have also been very kind and sympathetic-- individuals from various surgeries, CT scans, ultrasound tests and bone scans.\n\nI continue to return to John C Lincoln for my medical needs because of the quality of care as well as the staff's caring qualities.\n\n\nAs for a food review, I've also had many great meals at the hospital. Frankly, I've been surprised at the quality. As another reviewer mentions, everything from steak to pizza to lasagna and baked chicken. My family has also been impressed with the food, eating many hot and cold meals here during visits.\n\nI would not be surprised if many local residents ate here for their meals, even without the need for hospital services. The cafeteria and grill business hours can be confusing at first, so be sure to check ahead.", "business_id": "Z9ogOCIkHasuKVELa8mQ_w", "stars": 4, "date": "2009-10-22", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "yQdV1qqnFRdulJDLigGV3g", "review_id": "ONb3uTsyjEK67OU907pWNg", "text": "First the good....the nursing staff seemed very nice and attentive. The staff in ICU was great!\n\nNow the bad...a relative was there for surgery and contracted a BAD staph infection and had to be re-hospitalized in ICU. Make sure everybody is sanitizing their hands!\n\nThe waiting room was horrible; packed to the max including one family with 8 or 9 kids. One of the kids had a chihuahua under his coat; could NOT believe it. The kids were lying on the floor in the hallway , in front of the elevator and in the waiting room,. Why allow all these small children JCL??? \n\nThe snack area was way too small for a hospital this size and the entire place had that funky hospital smell.", "business_id": "Z9ogOCIkHasuKVELa8mQ_w", "stars": 2, "date": "2010-11-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "XRZoJfCa0ezYIakx4QB1Fg", "review_id": "bPl-fN7J95RhW_JZ8ASZxg", "text": "I had my 2nd back surgery done at JCL North Valley on Sept. 10th, 2012. As in my first visit there, my second was to be expected.... AMAZING! The compassion and care that the whole staff of the 3rd floor, Special Surgery floor showed my family and myself was just PERFECT! They kept me very comfortable, calm and attended to everyone of my needs and issues. I highly recommend JCL North, and that says a lot about this facility because I have worked in EMS in the valley for many years, and I do not recommend many of the PHX-Metro area hospitals. This place is a class act all the way!!", "business_id": "Z9ogOCIkHasuKVELa8mQ_w", "stars": 5, "date": "2012-09-15", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "DJ1T6ZCsG0ANSEK6YsqHBQ", "review_id": "U_g-iOlFvIz7ayR5YO2udg", "text": "I broke a bone and didn't know it. I mean, I knew I fell and my arm hurt, but I didn't think broken. So I drove an hour from home and by that time, the arm was useless and there was a lot of pain. So since JCL is close to my house, I went there--make it 2 hours now with a broken elbow. \n\nSo it's about 5am when I hit the E.R. 1 person there besides me. I am just \"this\" close to tears, tell the woman at the counter the problem and start trying to find ins. and ID--not easy with 1 arm. She said \"no no, don't worry\", got me a cold pack immediately and I was ushered back. My butt never touched a waiting room chair!\n\nIn the back I probably was not the best patient because it hurt so bad, but everyone was nice. Since I could not straighten the arm for Xray, they gave me 2 percocets ( I think it was) to relax me, but warned me I would not be permitted to drive after I took them. Sure, I'm thinking, I'm 5 min. away, they won't know. \n\nConfirmation of the break, sling since it was so swollen by then, Rx, quick stop at payment lady (very first mention of ins. and payment-nice-take care of me first, we'll worry about the rest later), then they called the cab and made damn sure I got in it! \n\nFelt well taken care of!", "business_id": "Z9ogOCIkHasuKVELa8mQ_w", "stars": 5, "date": "2014-09-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HR-KSESyaeaaQwO2JeyQyg", "review_id": "skzGWLPqJWMSE5RTNvV2Sw", "text": "Work here and love it.  No better nurses, physicians or any other speciality in the Valley", "business_id": "Z9ogOCIkHasuKVELa8mQ_w", "stars": 5, "date": "2014-11-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "oWNdQE2VA0hRbCVCrtBC6A", "review_id": "-iUjDXoDdl8I8trCANRMZQ", "text": "This hospital is the closest to my home, so when my 2 year old daughter knocked over a glass and sliced her hand open, we rushed here. We should have drove the extra few miles and went to Phoenix Childrens. This was THE WORST hospital experience I have ever had. \n\nWe arrived at 4:30. My daughters hand was sliced open and wrapped in paper towels. We had her blood all over us yet we sat in the initial waiting room for over an hour and a half while people with coughs who came in after us were seen first. I finally walked to the receptionist window and asked if it would be possible to get some sort of bandage for my daughters hand as it was bleeding through the paper towels. She said \"There is toilet paper in the bathroom.\" Seriously? 10 minutes later the triage nurse came out and looked at my daughters hand and said \"meh, its not that bad and wrapped it and went back in.\"\n\nwhen we were eventually seen by a different triage nurse she commented on how bad it looked and how she would \"fast track\" us so that we would be seen sooner. she then proceeded to tell us they are not really equipped for small children and that if they needed to sedate my daughter they would need to transport her by ambulance. So, if you're keeping track, we went from being told it was no big deal, to being told it might be serious enough that we would need an ambulance. We were completely freaked out. JCL should probably train their triage nurses a little better, as parents with small children scare easily when their children are injured. \n\nWe were then moved to a SECOND waiting room where we sat for THREE HOURS! we sat and watched people with colds, aches and pains go back before my daughter. Keep in mind we were \"fast tracked\" yeah right. we saw two nurses looking at us and whispering and one of the nurses approached us to apologize for the wait and explained they were really backed up and a mistake had been made when we had been fast tracked. We were taken to a room (that was still being cleaned) and waited to see a DR. except a DR. never showed. We got a PA. \n\nWe waited, and waited and finally at 10:30 the PA called in staff to put stitches in my daugters hand. 30 minutes prior she had a nurse come in and clean her hand and apply numbing cream that was supposed to lessen the pain of the stitches. Right before they did the stitches the gave her a nasal sedative and said it would kick in instantly. Well as soon as they started the stitches my daughter was screaming at the top of her lungs. She was in pain. They gave her a shot of lidocain and continued. She was still screaming. I asked the PA if she was sure it was numb and she said \"oh yes, she's probably just crying because of the pressure. My daughter is 2 and knows pain. She was screaming ow every time she put the needle in. it was awful. she required 5 stitches on her tiny hand. went in at 4:30, got out at 11:30.\n\nWhen we took our daughter to her follow up appointment with her pediatrician he commented on how poorly the stitches where done.\n\nNever coming back here.", "business_id": "Z9ogOCIkHasuKVELa8mQ_w", "stars": 1, "date": "2015-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "awKgSfyOYUuyE1gTEjhZbg", "review_id": "yGhIgUxGuKEQokMJWutdEg", "text": "Dr Anderson is the best. He's so kind and helpful. I have insomnia and in the past doctors have made me feel bad when I was in need of medication. Dr Anderson was so understanding and compassionate. He also remembered things about my personal life from 6 months ago, like a friend would. Makes going to the doctor so much less crummy:)", "business_id": "Z9ogOCIkHasuKVELa8mQ_w", "stars": 5, "date": "2015-11-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "yHdBD8NRxnCD1nliEEO8lQ", "review_id": "L0Z2m05SIyTt-cO6WjgN7w", "text": "Honor Health doesn't want your feedback\n\nMy family has been receiving slow service (3 hour wait times) at the Gavilan Peak Immediate Care facility over the last 6 years, they don't want or value patient feedback to improve.\n\nIt would be great if Honor Health across all their facilities posted their average patient wait times over time against goals to help patients decide on which facility could best serve their needs. I would think this would also help those facilities improve their services and reduce wait times.\n\nIt would be great if Honor Health had a mechanism for patient feedback, no patient survey process exists on their website. I must assume they don't need or want patient feedback, makes me wonder if they really want to improve their services?\n\nIt would be great if Honor Health posted their doctors health grades/reviews to help them improve their services and help patients seek out the best doctor for their needs.\n\nOverall I like Honor Health services with exception of Immediate Care lengthy wait times, the new ER Hospital on the I-17 did send me a survey, I was very impressed with this facility.", "business_id": "Z9ogOCIkHasuKVELa8mQ_w", "stars": 1, "date": "2015-11-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Ckm7vhvYdj3BwLO-8J7AeQ", "review_id": "02lrDQcZT_As2N-RI1vlvQ", "text": "Been here twice now for a family member's surgery. Love the valet parking and the staff is always so polite. My grandmother was wearing her \"Navy Parent\" shirt, and a security guard came up to us and thanked us for my aunt's service. I love how the waiting rooms are set up (volunteers write which section you and your family is in so it is easier to find you when the doctor needs to speak to you), as well as the screens mounted on the wall to tell if the person you're waiting on is in pre-op, intra-op, or post-op. Once the surgery is finished and the surgeon comes to speak to you, they walk you into another private room within the waiting room. Would 100% recommend this hospital.", "business_id": "Z9ogOCIkHasuKVELa8mQ_w", "stars": 5, "date": "2015-11-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a-stTeG1LanB9nwEwTzwlg", "review_id": "h7oCgFHHC1e1qIEdFt61Wg", "text": "Dr. Millstein is an amazing doctor.  He has such a great heart and a good personality.  I like that he doesn't just push drugs on you, he honestly wants to find out what is wrong and then go from there. \nI recommend him to anyone. The front office girls are fun and friendly as well.\nGreat Dr. great staff.\n\nBonnie Shanks", "business_id": "_SZwP-ddcBpw7aZsCQKSww", "stars": 5, "date": "2015-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "EluXzViWeIY4Jke52D3MBQ", "review_id": "GPLtqhaSxAzkzNWmX-L1fQ", "text": "I saw Dr Tindall for a knee issue that hasn't been resolved.  I usually sit for anywhere from 30 minutes to an hour each time, only for my doc to never read my chart and assume I have some other ailment, and then walk out about 2 minutes into our appointment, long before I even have any chance to ask questions.  I'll be finding a new doc that is cognizant of my time, and actually fixes the issue.", "business_id": "PzMU15mDNyXeH8p4_qm9PQ", "stars": 2, "date": "2013-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BO6vNTuZXTgKfb8Y4o93tw", "review_id": "lC40BK1YRGkwBCDdU5L8pA", "text": "worst doctor's office I have ever been too. They let the  answering machine answer calls for days on end and never call back! Left 5 messages. Prescribed me a medicine my insurance doesnt cover and 3 weeks later still have not changed it, The receptionist has no clue whats going on in office, acts like its her first day. I need referrals for specialists and told to call myself. I had medicine and finished it  and in so much pain and so dizzy and sick , yet I told doctor and they have done nothing. This place needs shut down. Reporting them to medical board", "business_id": "g0fSQ0yQ-zMAeqmLLbuoHg", "stars": 1, "date": "2015-11-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "A85CoBQ6qSX8d1vVlvPgpw", "review_id": "suMdJ3JIPgeqYKwLuzcWrw", "text": "I've been seeing Dr. Keightley ever since my family moved here in 1990.  He is simply the best.  His office provides allergy shots in addition to their normal services and I would definitely recommend them to anyone who struggles with allergies,  They greatly improved my quality of life.  Usually if you're sick you can get in the same day or next day and Dr. Keightley is always very generous with samples.", "business_id": "ofQCymLeEmWpTQvx3YYwPg", "stars": 5, "date": "2012-09-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "kHI1UedCN7pNnYEknsmqDA", "review_id": "tNCp-phceSSgfV7gt4p-_Q", "text": "I was told about this place by a good friend in the medical field.  I made an appointment with Dr. Steve Nelson.  \n\nDr. Nelson was attentive, patient, and kind.  He told me my options, was very sensitive towards my situation, and was a caring and giving person and physician.\n\nI would recommend Dr. Nelson and the Camelback Women's Health group to women of all ages.  My experience there was 5 star and Dr. Nelson is my doctor from here on out!  Dr. Nelson rocks!", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 5, "date": "2013-09-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uFqnBY38lvYYNu_LNgiAwQ", "review_id": "dACFJS3PPaKpruIAoUjSCQ", "text": "Lousy! You're a file number.", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 1, "date": "2014-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "5K-sKsjWGtgOZWVBx_moLg", "review_id": "6JN60cRBdKtoBZuManxQwg", "text": "Dr. Steven Nelson never had much time when my wife and I met with him. He was my wife's doctor for our first pregnancy and we had lots of questions. Appointments lasted 3-7 minutes. At one, I brought a notebook with several questions written out. As I went through the questions, Dr. Nelson gave answers such as, \"Google that ... doesn't matter... Google that ... Don't worry about it... Google that one... etc.\" He had no interest in giving us information. \nWe had a difficult labor/birthing process. My wife's water broke before any pre-labor or contractions or anything. We were already 6 days late, and figured the baby was on the way, so we went to the hospital. The hospital gave us a 24-hour deadline to deliver the baby because of risk of infection. So we went through different stages of induction, and none of them worked, and Dr. Nelson was not present for anything. He spoke to my wife once on the phone to scold her for not being induced days earlier, which was something he had mentioned as an option. He said on the phone she would probably have to have a C-section because she didn't listen to him. This was very frustrating because we actually did want to listen to him and get advice from him, but he never gave us any instructions, and when we were at the hospital he wasn't there, so we went along with the recommendations of the nurses. I feel his attitude toward my laboring wife was completely inappropriate. \n36 hours after the water breaking, Dr. Nelson said he would come in during his lunch in a couple hours to do a C-section. We asked if he could come in sooner. Since the C-section seemed inevitable, we just wanted to get it over with. Was he upset that we wanted him to come before his lunch? \nDuring labor, my wife's epidural did not work; she still felt the pain of contractions. This was concerning as she was about to have major abdominal surgery, so we expressed concerns. The staff assured us she would be numb before surgery. The anesthesiologist gave my wife a \"spinal\" since the epidural wasn't working. Unfortunately, this only worked halfway. They did this test where they poked the location of the incision with a needle to see if my wife was numb. She was not numb on her left side. They asked, \"Are you sure you feel sharp pain, and not just pressure.\" \"Yes, I feel the sharp pain.\" Their solution to my wife's numbness was to use local anesthetic, which numbed only the surface of my wife's skin, and Dr. Nelson did the incision. As the other parts of the surgery progressed, my wife was pleading with the staff to stop because she could feel the pain of the surgery. I don't know why Dr. Nelson did surgery on my wife when she wasn't numb. I've heard from a couple other doctors that they would never perform surgery on a patient who wasn't numb. They said to me, \"I don't know what he was thinking.\" He continued with the surgery while my wife pleaded and cried, and once he got my daughter out, he gave some signal to the anesthesiologist who pumped her with something to knock her out.\nOn top of all of this, my daughter almost died. I doubt this was Dr. Nelson's fault, but her first \"breath\" resulted in her completely blocking her airway with mucus or something. Staff had to work on her for a while before she was breathing on her own. It was traumatic.\nAfter surgery, my wife had a horrible recovery. She could hardly move or walk for a couple of days without a lot of pain, and she experienced moderate pain and difficulty for weeks. My wife's second delivery also resulted in a C-section, but the recovery was way faster and better. Every decision Dr. Nelson made resulted in more pain for my wife. The way he handled her organs and uterus; the way he performed surgery on my wife who wasn't numb, and the way he had a student or intern stitch her up all caused my wife a lot more pain compared to the second time with a much better doctor, Doctor Grayson Guzman. It was as if Dr. Nelson was taking out his anger on my wife.\nI suspect Dr. Nelson resented my wife and shared frustrations with his colleague, Dr. Erin O'Sullivan, since she also scolded my wife. At 4 or 5 am on the first night of our stay at the hospital, there was this knock on the door, and Dr. O'Sullivan came in and turned on the lights. We were both in a daze and had no idea who this woman was, but she introduced herself and proceeded to tell us off. \"Hi. I'm Dr. O'Sullivan and I work with Dr. Nelson, and just can't believe that you wouldn't take Dr. Nelson's advice. He has a great C-section rate, and you're ruining it because you wouldn't listen to his instructions. It's your fault you had a C-section and I don't think it's right that it's going to reflect badly on him. \" She said something along those lines and left. Her only intention for coming into our room was to spite my wife. I don't think I've ever experienced anything as rude or unprofessional as the actions of Dr. O'Sullivan that night. It was awful.", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 1, "date": "2015-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "0yutWww8iaeLe6w4pv0M6g", "review_id": "xhi_mCtczKWHfePP_Ee-Zg", "text": "Just say no to visiting Dr. Erin O'Sullivan.  She has a beyond negative bedside manner.  She may be adequately informed but her lack of empathy towards the customer is unsettling.  She has several negative reviews on both Yelp addresses for this practice.  They are spot on.  It seems she has a penchant for targeting people's most sensitive topics for some really inappropriate and unfeeling comments.  Could this be a bad habit, emotional obtuseness or is it condescendingly deliberate?  Unless you are super thick-skinned, you probably don't really want to find out.\n\nFrom reading all the reviews you can be satisfied with the experience here if you choose your doctor with care and don't epect much from the Camelback location's front desk.  I have been going to this practice for over 6 years.  No matter who they seem to hire at the 32nd Street front desk, they hate waiting on the patients on the phone or in person.  The nurses are nice, the PA's are nice and blood test lady is awesome nice too!\n\nI think working in the medical field is increasingly challenging.  I am grateful for the high quality care we receive in this country.  It's such a better experience if you feel someone actually cares about you.  You will have to do some work to consistently find that experience here.", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 2, "date": "2015-09-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "R6iLCpB_A16C5MgESlAQwA", "review_id": "fDiD0FxWBbfpALzH10sQnQ", "text": "I wish I'd come here and read the reviews before scheduling my appt for an annual with Dr. O'Sullivan. I'd had a bad experience with Dr. Nelson with the delivery of my daughter in 2009 (Considering him to manage your pregnancy? Don't do it. He's dangerously incompetent.) Due to my not wanting to see Dr. Neslon, I decided to schedule with Dr. O'Sullivan. Big mistake. She is bitter, angry and *unbelievably* unprofessional. This woman is a poor representation of the medical community. She started off by noticing that I'm starting a topical progesterone supplement this month. And so she asked me who had prescribed it, and I told her it was my physician who manages my thyroid condition. She asked me right away if it was a \"Naturopath, or something like that?\" & I informed her that, it was an MD, Integrative Medicine who had prescribed it for me. She then goes on to ask me what am I trying to achieve. Umm...  I told her hormone balance. Duh! WTH do you think I'm trying to achieve? I explained that we had tested my levels and my progesterone level was low. She proceeded to ask me what my symptoms were. Basically, I felt like she was grilling me as to why I would be supplementing with progesterone. Aside from the fact that my freaking blood tests showed it was low? She then goes on to say \"Well, the only proven benefit to supplementing with progesterone is sleep. It's not going to help with weight loss, or anything like that. Generally speaking, if you're still getting your cycle then you are fine, and I would not recommend supplementing with progesterone. But hey, sleep is important too, so that's okay.\" I'm sorry, but #1 I never mentioned weight loss (I'm already at a healthy weight) and #2 I'm pretty sure that progesterone supplementation is proven to correct a low progesterone level. How about that benefit? So then she is asking about other things and I mentioned that I'm in the early stages of a separation/divorce. She then tells me how she thinks happy marriages rarely exist, and how she knows maybe 2 happy marriages out of all the married friends she has. Well, that's uplifting. Thanks, Doc. So a little later in the conversation she goes on to say how awful the dating scene is today, and that \"It's really disgusting out there. These women think they're okay since they've been married/only with one person for all these years, so they go and have sex with some guy whose slept with 300+ women while you've (she's) been married all those years. And they end up with herpes.\" And then she follows that lovely story by telling me \"The only people who are dumber than my teenagers are the 40-something divorced women.\" I'm pretty much in shock at this point. So she goes on to say \"... So just be sure and protect yourself and use a condom when you're out there sowing your wild oats\". I could not believe my ears. My family life is falling apart, the last thing I'm worried about right now is \"sowing my wild oats\", and even of I were... what a $&*# stupid and wildly unprofessional thing to say to a patient, or anyone, for that matter. I think she's the most unprofessional physician I've ever encountered. Needless to say, I'll be finding a new OB.", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 1, "date": "2015-09-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "RgQ27ASb-AryOCW26oJWcw", "review_id": "dj1ojMg6WaW0tUO5a-ZTLQ", "text": "I do NOT recommend this practice if you are looking for professional, caring medical professionals. \nYou would be better off going to a FREE clinic.\nI saw a doctor named Erin O'Sullivan. After, she recommended I get an ultrasound for my heavy cycles and cramping her office called me and said I needed a biopsy and to make an appointment. I said I was not going to make an appointment for something that serious until I A) know the results of my ultrasound and B) I speak to Erin 0'Sullivan. They proceeded to tell me that she would speak to me at my appointment.  What...?? I've have never been treated that way by a doctor ever. I think the courtesy of a call from her was warranted. I have moved on to Mayo Clinic and I am so happy! There was no need for a biopsy! And, I always get a return call within 24 hours.", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 1, "date": "2015-10-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gbnna5k3WX_B2S1RDGcHKA", "review_id": "PvtcpznySWCXZZrEASBWXA", "text": "This is a horrible clinic with unscrupulous doctors and impolite staff. I was lucky enough that I found out how terrible Dr. Kathleen Schwartz was before my delivery. They are extremely unethical, STAY AWAY!", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 1, "date": "2015-11-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hbZzMfBBXIjAowj6Fh8YTQ", "review_id": "4PuznrjWHULOrlZBTIqlIg", "text": "I have called a total of 6 times to make an appointment and every time I am put on hold as soon as they answer the phone. When I was able to finally talk to someone to schedule an appt, the receptionist was talking to someone else in the background and not paying attention to me. She was short and rude. I get you are busy but this is the type of place where you want to feel important especially because this will be my first pregnancy. If I can't even get through now, I can't imagine the challenges later.", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 1, "date": "2015-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fPHLPrymsyb6WSFFKoMrTQ", "review_id": "qN2GZntvLHMpZjvmo58c_w", "text": "Now that I've had a couple of visits to Camelback Women's Health, a review is appropriate.  After finding them on an internet search for prenatal services, I called and spoke to a couple of women.  After answering many of my questions over a few calls, I was ready to make an appt.  ask me what my choice of Dr was and I simply ask them to set me up with the one they preferred... enter, Dr. Gregory DeSanto.\n\nI was always told that picking your maternity doctor was quite the chore.  It's joked about in movies and a matter of stress for many women.  I'm a lil more laid back than the average woman about such matters but, after I met Dr. DeSanto, I really didn't see the need to go to a dozen different doctors and stress.  He's relaxing, knowledgeable and does things himself that other doctors pass off to technicians - like my ultrasound.  He did an excellent job explaining everything he was doing, getting great angles of my lil baby and even showing me the gender before others say they can tell.  It was the most amazing experience to see my lil guy flipping around!!  I'd heard other women say that their ultrasound tech didn't tell them much and actually had them worried by not talking and explaining things but, there was none of these issues with DeSanto.  I'm a fan of his calm demeanor and simple, easy-going approach to things.\n\nThe reason for taking away a star is that on both visits, I've felt there could be a lil more communication with the the ladies in the office.  The first visit, I told them on check-in that I had 2 appts and even wrote in the information on the sign-in sheet but, they never sent me down to my first appt.  I didn't know there's almost no wait time at this clinic, (unlike other doctor's offices) so I sat there waiting forever and finally ask when it was almost time for my 2nd appt. because I was afraid they were going to overlap.  Luckily, they were able to fit me in for my 1st appt after my 2nd appt but that whole situation could have easily been avoided with a lil more communication.  On the 2nd visit, after my weight/vitals check, I was told to that I needed to start a test but then she left me without any instructions on where to go or what to do after that test.  I think it was assumed I knew the drill already because I am in my 2nd trimester, but that was only my 2nd appt.  \n\nThose lil glitches were barely noticeable though compared to the satisfaction I feel with the clinic overall.  \n\n* Dr DeSanto is knowledgeable, calming and explains things well.  And Jamie was so helpful with many of my misc. questions and helping me get set-up!\n\n* They have their own lab and ultrasound machine in their clinic so you don't have to run around, wait, or make separate appts for lab work!\n\n* Everyone is friendly enough and it feels like a cozy, comfy environment.  \n\n* There is little waiting time before your appt starts and they must keep gaps in the day because you can get in to see the Dr. in a timely manner.\n\nI'll be back next month for my 6 month check-up!\n\nSee ya there!", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 4, "date": "2010-11-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V38Rd3rsZk50bj74kP2eBA", "review_id": "mBLHgcswfS1PInYP4spwTw", "text": "I found this doctors office when I became pregnant and boy did i wish I would of switched doctors offices, but I'm new to the area and stuck it out. It wasn't so bad in the beginning, but now I wish I was completely done with them. The nurses are rude and complain about actually doing their jobs. They find filling out maternity paperwork to be a hassle and don't fill it out correctly. When your company calls you to inform you of this the nurse becomes even ruder to you and explain that your not their patient. Well I feel i shouldn't have to babysit and make sure paperwork that was sent back twice now should be completed properly and not blow me off. To top it off my doctor seems to now be a complete space case lately and cant seem to keep up with what week I'm on, until reminded by me. I know I'm not the only patient she has and I can understand a few slip ups but it seems to be this way for awhile.", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 1, "date": "2010-11-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SB37ySvE9n2GY0AJi47nug", "review_id": "S3XD0mc7r_0r5GnarVQuow", "text": "The office is conveniently located on Tatum near Paradise Valley. The people who work here are always very nice. Sometimes you have to wait a little while to be seen but at what doctor's office do you not? Last time around my appointment was accidentally scheduled for the other office but they were able to see me here on time anyway.", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 4, "date": "2013-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8VChq_iSlvKE-57xFXzJ9g", "review_id": "cfSxTnpk-DDh6Hazt9RC8Q", "text": "Dr. De Santo is amazing! He took care of me in the middle of my pregnancy with no questions asked and did a wonderful job. This was my 4th baby coming into the world and I knew I was going to have a c-section, I have to tell you I do not have a scar! Its amazing, this was my 2nd c-section so Dr. De Santo cleaned up my previous scar and tissue and left me looking flawless! He truly cares about your overall health as well and will make life improving suggestions to you. Great practice OH his nurse Esther is pretty awesome as well! Don't let being put on h", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 4, "date": "2013-10-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bGYjsKlGK_4MvfCRAZeJAQ", "review_id": "Li0SUxl8xFhkaiNR4JUv4w", "text": "I was pregnant and my new dr was O'sullivan. It was my first pregnancy so I was so excited.  The staff was nice buti was always waiting 30 mins to an hourafter my scheduled appointment.  Dr. O'sullivan was always very short with me and made me feel dumb for asking questions.  When I gave birth,  she told my family to shut up before my baby entered the world,  which is just plain rude.  Her nurse practitioner was awesome and that's who I saw about 90 percent of my visits.  But the Dr. I'm glad I will never go back to her clinic.", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 2, "date": "2014-10-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aSUXo7lek5A5o6OwT7GRXg", "review_id": "wiacFn4pE9dvzYkyXW6PGg", "text": "To begin with, Dr. Schwartz is wonderful! She is a knowledgeable, kind OBGYN and was a great encouragement during my pregnancy. \n\nWith that said, the general office environment is bad. The front desk staff always seems irritated and stressed. I have had multiple appointment times mismanaged and if you're going in, prepare to wait a minimum of 30 minutes. 45-50 seems to be the average. Doesn't matter if you're seeing one of the doctors or nurse practitioners- it will be a long time. And that's frustrating when you have a small child.", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 3, "date": "2015-09-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "335CYXy2BjA8cK7TSkR1og", "review_id": "qppuTZ5DqP9HQo1qIgt8oA", "text": "I was referred to Dr. Lykins by my dentist for a parotidectomy.  I had seen another Doctor prior and wanted to get a second opinion.  I appreciated the professionalism; the time taken to explain the surgery to me and the follow through after the surgery.  The only negative was the difficulty scheduling an appointment.  I had some concerns about a week and a half after surgery.  I felt like I needed to come into the office or at least have Dr. Lykins call.  I started calling at 8am on a Friday and called 3 more times that day.  No return call until 5pm that night.  I was told I would need to come in Monday at 8am or it would be another week before I could get an appointment.  I ended up going to the Monday appointment but worried the whole weekend.  I would definitely recommend Dr. Lykins!", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 4, "date": "2014-09-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UC1DS4CUE-qkuwryyDP_Ug", "review_id": "bPRs1TO6I4ZGE56Y3cZ_9Q", "text": "I've tried other ENT's only to be disappointed and see no results for my issue. Within 15 min of visiting with Dr. Lykins I felt I was in the right spot. He diagnosed my symptoms and had a plan by the second visit. I highly recommend Dr. Lykins.", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 5, "date": "2014-10-07", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "N2O03Zh03V3HtMimypX_MQ", "review_id": "pJZuogSnoh5eZMBZVAe3iQ", "text": "PLEASE READ THIS before going to this office! !!!!\nI scheduled an appointment with Dr Dyer per a referral from my pcp 2 MONTH out, was the earliest appointment with Dr Dyer.  When scheduling my appointment they ASKED FOR MY INSURANCE CARD NUMBERS, which I gave them. I asked the receptionist to please send me the forms for new patients & she told me to go to their website and download them, which I did. I noticed the forms had NO PHONE NUMBER or ADDRESS of their office.  I did complete the forms\nWhich took about half an hour. I drove from south Scottsdale to their office today for my 2:00pm appointment.   I left my home@ 12:15 pm and arrived about 1:00 pm for my 2:00pm appointment.   First thing in the door, there were additional forms to fill out that weren't on their website AND they needed my INSURANCE CARDS AND A PHOTO'S ID, which I provided.  I sat in their waiting room until 1:50 pm when the two ladies at the reception desk called me up to say DR. DYER WON'T SEE ME TODAY because he doesn't take my insurance.   I asked to speak to the office manager since I spent 45 min. Driving there, 45 min. Back home and 1 hour sitting in their waiting room .....   \nI was called in by the OFFICE MANAGER Jackie Sides.  She had EVERY EXCUSE IN THE BOOK. she informed me Dr Dyer had been out of the country,  but has had the insurance forms on his desk for months, but hasn't filled them out yet to update his status with the insurance co.  \n     I asked if Dr Dyer was in the office and Jackie Sides (OFFICE MANAGER) said he is in the office,  but WON'T SEE ME.  She offered to SQUEEZE me in with another Dr , WHICH I DECLINED. I TOLD HER, they have a lot of NERVE, wasting nearly 3 hours of my time.  \nI also SAID, Dr Dyer should see me at THEIR EXPENSE, since NO ONE CALLED ME to cancel on an insurance issue INSTEAD OF WASTING 3 HOURS OF MY TIME.\n     On a second note, the two ladies at the reception desk of ENTEGRITY ear, nose & throat were SOOOOOOO busy conversing, with NOT ONE PATIENT at the reception desk, the phone would ring and they would ask the patients to please hold.  Then a patient would walk in the office and the ladies would ask them to sign in and as soon as they were seated, the ladies would then ask them to come back up to the desk. Then ask them to come up again for things that THEY, the RECEPTIONIST missed. \n     I give this office a RATING OF (F-), I am now a senior and have been to many doctors offices and have N E V E R been treated like this.  Dr. Dyer should be ashamed of himself for 1., NOT SEEING me as scheduled,  REGARDLESS of insurance as they messed up, BUT, I feel he's putting money ahead of my medical needs.  Would it really have cost him to see me for a few minutes,  even if he had to waive his fee.  \n     I WILL N E V E R SET FOOT BACK IN THAT ESTABLISHMENT AGAIN, WITH OR WITHOUT INSURANCE. \nSIM", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 1, "date": "2014-10-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3qZWlbG4x7GGVq7KUWiXvA", "review_id": "GDx60wAG6i40cU-NEur-kw", "text": "I really like this practice.  Dr. Lindsay was very pleasant and honest with me.  My blood pressure was reading higher than it normally has but I have history of high blood pressure on both sides of my family.  I'm extremely active in CrossFit and eat well so she did not jump to the conclusion of putting me on a high amount of medication.  I liked that she wanted to monitor me by putting me on a different diet.  I'm glad that I went with this practice and I plan on making this primary care.", "business_id": "0-KOpYSe9aQTAfM38f47HQ", "stars": 5, "date": "2014-09-05", "type": "review"}
