{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IjP2TmEzOBku548h3Ms2SA", "review_id": "HdIg_cAX_PAEBEPWg5ntWA", "text": "This place is overpriced and the service is not good at all.  When we where there children were riding bikes in the lot near the tables.  One almost hit our child.  Another customer said that if the owner had been there she would have not allowed the bikes to be there.  The cone was large to say the least but the taste left something to be desired.  Not the best neighborhood either with a bar nearby.  Our children were exposed to language that would have made a sailor blush.  We will not be back.  Also they will accept a credit card but not a debit card?????  Please get up with the times.", "business_id": "Rjx8GcWuCzfVsKC5iPIcQA", "stars": 1, "date": "2011-09-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "T_wjLgPOPXry7Bea4MzoVQ", "review_id": "nybcN9uwvAxWSAElWh88Lw", "text": "Yay!  Closest one that was open since the Greentree location on Noble Roman's was closed.  The entry and exit are a tad precarious, but well worth the Dairy Queen goodness.  If you aren't familiar with the area, make certain you bring your GPS or you will get lost.  \n\nGood service and great ice cream.", "business_id": "9aw0t0rlACKkMaxsX0KlKA", "stars": 5, "date": "2009-11-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nwGJxknW4F63ICGGJuoUkQ", "review_id": "_YXLSi8HKr8nh_ldKALN7Q", "text": "Giving this place 2 stars because I like the ice cream but after my last experience I really want to give it 1. \n\nOn Wednesday, I called at around 6:30 pm and asked how late they would be open. I was told 9:00 pm. I went at 8:15 pm and it was closed! Why would you give me a closing time and close so much earlier? \n\nI called the next day to ask what happened. I could understand if an emergency came up, but nope! I was told that they had no customers for two hours and they decided to close early. I'm sorry you didn't have customers that day but you can't just close whenever you feel like it, at least adjust the timings and tell people the hours accordingly. \n\nTL;DR: I drove 25 minutes in both directions just to see a closed sign on the door even after I called to confirm hours, so disappointing.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 2, "date": "2015-10-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8ED8BPCXKXZnGsVMyl5Bhw", "review_id": "qg6keqtsGi2LlgZYA6KBmg", "text": "Great ice cream, great food, and great atmosphere! While I don't do the burger thing, they do have a great topping bar. You really get to have it your way.\n\nThe fries are crispy french fried perfection, and the ice cream is some of the best in town. I love this little area of town, so I'm kind of partial to any restaurant in the Hawthorne/7th Street area. \n\nI don't know how long Snoop's has been around, but it has the air of a place that's been in the neighborhood for years. The staff is friendly in a short-order cook kind of way, and it's fast. It's a great place to stop for lunch, and it's close enough to uptown to be able to order, eat, and get back to work within an hour. That's always a plus.", "business_id": "nhPdxY-jbf-XVQ6Hq6qJPw", "stars": 4, "date": "2008-10-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VardSIlBt8_KfXkbkcDBxQ", "review_id": "Frwoh0trzOkKT592cjsKPA", "text": "Don't go here! Worth the drive to anywhere other culvers!", "business_id": "9wsv3WwH0HtwPvD8XCdT_g", "stars": 1, "date": "2015-10-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qXiN4Gi9N0FOeQYoeiWU8g", "review_id": "hLB-WzXwrH8cFojgDxknkw", "text": "I was totally craving some ice cream and tried two other places, that turned out to be closed, before hitting up good ol' BR. \n\nI was thankful for the patience of the staff as my friend and I each tried 5 flavors... Excessive? I know. \n\nI decided on the German chocolate in a waffle cone and then the woman behind the counter let me know that since I was buying a waffle cone, my next scoop was free. Oh boy was I excited!! (Can you say cheat day?!???) After taking a so long to decide on the next flavor that the first scoop was starting to melt, I settled on pralines and cream. \n\nThe ice cream was good, same as every other BR you've probably ever been to. The place was pretty clean. I got a double scoop in a waffle cone for about $3.50.\n\nThis place isn't my first choice for ice cream around here, but their hours on weekdays are better than most, the service was good, and the ice cream rightfully satisfied my craving.", "business_id": "LWCundUtM5OWdYxCU7daXg", "stars": 4, "date": "2015-11-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "W4ojW7f30haCertr4CzFJw", "review_id": "YLMnLfwvbh9WFBRM9O5gcg", "text": "I am not a big ice cream or frozen custard fan.  I had never been to Jarlings before and I have lived in this area all my life.  I started a new job and was asked if I wanted something from Jarlkings.  Since they were buying I said OK I will try it.  I ordered the special for simplistic sakes.  I surely could not pick one thing out of all the choices they have.  The special was a carmel apple snowstorm and it is fantastic.  I ordered a small but I couldn't finish it so I put it in the freezer and ate it again the next day and I think I liked it a little better the second time because it was frozen more than the first if that makes any sense.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2011-10-06", "type": "review"}
{"votes": {"funny": 6, "useful": 4, "cool": 9}, "user_id": "Udj_a2KWaxqeOHu_1FrFAg", "review_id": "5dqsvoTtxSDfYrsnDDg5CQ", "text": "Ever since I started working downtown, I vowed to continue my personal tradition of rewarding myself with something yummy and sinful...kinda like a pat on the back for a job well done for the week. In my previous life as a PR bitch in the private sector, I rewarded myself with libations--vodka/tonics with two limes for extra Vitamin C; vodka Collins with three maraschino cherries instead of one; cranberry and vodka because I heard it cleanses out your urinary tract; a dirty martini for those super grueling weeks.\n\nAlas, when I started to work in the public sector, still in PR, I knew I couldn't pull that shit anymore. I had to re-vamp my rewards structure and take out the \"sinful\" from \"yummy and sinful.\" That's when I discovered fro-yo...that's frozen yogurt to you all.\n\nMy co-worker took me out for coffee one day and quickly mentioned that there is a locally owned frozen yogurt shop on Washington and First Streets. She said they give hefty portions, so I thought to myself that this might just be a good replacement for my vodka concoctions.\n\nThe place is called A Touch of Yogurt, and their fro-yo is yummy to the tummy. They are pretty generous with their servings, and the toppings you choose to include in your fro-yo. And then when I did some diggin' about fro-yos, I found out fro-yo can: 1. Help to overcome lactose intolerance; 2. aid digestion of milk protein: 3. help prevent and combat digestive tract infections. Okay...fro-yo had me at \"overcome lactose intolerance...\" that's all I'm going to say about that! They change their menu of flavors...you know, to mix it up a little...keeps you guessing. But no matter what flavors they have available, I am sure that you will find one so satisfying. \n\nSo Fridays, I've officially declared Yvette's Fro-Yo Fridays. I order my \"small,\" sit on one of the outdoor tables, and stare at politicians, lawyers, bums, construction workers, delivery people, while enjoying a mouth-watering serving of fro-yo. \n\nHey feel free to join me every Friday for FRO-YO Fridays around 12:30-ish. Oh but not this Friday I'm in San Francisco. So just for this week...FRO-YO THURSDAY!\n\nAnyway...I give it 4 stars...because, let's face it...it might be yummy, but it still ain't ice cream!", "business_id": "uaAMGh8gMoJD4nLFzNsM-A", "stars": 4, "date": "2007-09-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tapowpemeuVdBOB8NFN3Qw", "review_id": "C5uqLy1xmC7YjYKXafdwvg", "text": "So we stopped in here on a whim because we were in the same plaza for a different service.\n\nThe place was ok.  There were a few people in front of us and the one girl that was working seemed to be doing her best to accommodate everyone.  It took a little while but we were able to get some ice cream.\n\nWe tried a couple of flavors and settled on a couple that we liked.  From there, we headed out.\n\nOverall, it wasn't bad.  The place was a little run down and, for the most part, they had the same flavors that everyone else has.  I don't know that I would make a trip to come back but I might if I was in the area and craving ice cream.", "business_id": "XTtNevBI5G5x_GjFqSBMpA", "stars": 2, "date": "2015-11-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "S57z0SNn4AR6njDZ61SqzQ", "review_id": "wQiOfAnMPv4eH-wvSvPimw", "text": "The worst ice cream shop ever!! We ordered two scoop sundaes and they were the SMALLEST scoops I have ever seen in my life! I use to love that place. What happened??\nNot to mention the girl that helped us was a little rude. \nThis is the second time we went there and had a bad experience. We will not be going back. Beware everyone!!\nCold Stone Creamery from now on.", "business_id": "qeqrsjWXc15KmlK5Z8580Q", "stars": 1, "date": "2013-10-28", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "ByBbdJI3mfIuahKwtTnIxg", "review_id": "-ChSTnwFhYbOxCY6_D7mmw", "text": "The food and custard were great.  The 2 roaches watching us were not.\n\nI have had sandwiches, fries, onion rings and tons of custard here.  The atmosphere is very family friendly and there is sometimes live music.\n\nI will come back but I hope they hire an exterminator soon.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 3, "date": "2015-09-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YOZ6xwXXpxD0vxJiA6WC-A", "review_id": "UUsvj93LEnXkkKb38XHvQA", "text": "Nice ppl and good service. But no chocolate ice cream...really?   We only go there because they were the ONLY ones around who still have chocolate ice cream--and one of the workers assured me that would continue because the boss was really big on chocolate.\n\nWent in today--none. Only on the weekends, the guy said. No clue why the boss changed it. SUPPOSEDLY ppl don't ask for it during the week. Well, we did. And according to the workers, lots of ppl ask for it all week long; as a matter of fact, another DQ sent us there, knowing that they were the ONLY DQ around still serving chocolate ice cream.\n\nFYI great workers; quite nice, and friendly, and helpful.  BUT--it's in a strip mall and not on the end, so no drive-thru.  \n\nMy son signed up for the birthday club and they called him and gave him a month to come get his free treat. Nice.  But still, no chocolate is a big thing for me, and since I'm driving, we probably won't be going too much anymore unless he wants vanilla.", "business_id": "j5tNIkM_UbyaiAGPqqLJcQ", "stars": 3, "date": "2011-11-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lVMVYjhrEnal9qW89Tr8Jg", "review_id": "ibcVi6kMrg2frWCbOVCIkQ", "text": "Well I love ice cream and Baskin Robbins we come to this location often and the employees are great but the owners are really rude to both the customers and the employees ! If there was a location closer I would go there instead!  The owners need to understand that connecting with your employees and customer goes a long way.", "business_id": "1ctVj76TXrHpqX3px49n6A", "stars": 1, "date": "2015-09-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "imW-d-3P6nG9oSenRUSsLQ", "review_id": "MLZsaVaYZVLPlDdROrANHQ", "text": "Super friendly and helpful staff. Great homemade food and icecream. Very glad we stopped for dinner!", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 5, "date": "2015-10-20", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 4}, "user_id": "Q2jWOzEmkl6Zys2R1fFZWg", "review_id": "mSv1lIF6qzS3x6H_z5qPkg", "text": "99 CENTS KID'S CONE TUESDAY\n\nNo restrictions on size or age of ice cream lover.  Here's an opportunity for \"broke your mouth\" (808 slang for great tasting) and not break the piggy bank excuse for some crazy and old fashioned ice cream creations.\n\nYu-go chauffeur's all time favorite is of course his Rocky Road and because I'm always a kid at heart, I'm attracted to Martian green, purple and red color of the \" Razzle Dazzle Swirl. I think Yu-go chauffeur may have discovered a new favorite.\n\nSome of you may remember Baskin Robbins stores being all white and very little in colors outside of their brown and pink logo.  This store is far more playful in color and a suggestive attraction for all ages. Everything pops at you and that includes the ice cream selections.", "business_id": "Ze0mG__i-9ziEjN2gLcHqw", "stars": 4, "date": "2013-10-09", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "PIEXgVHLVG3cG7ADW-DTNA", "review_id": "BSuYfiGg9CBqQl7lul6FyA", "text": "ive known about this place for a long time but just never went because its so far from my house. i finally went and definitely wasnt disappointed. i got vanilla and the gf got chocolate. both flavors were really good. good enough to drive all the way across town? eh. this place does make for the perfect treat if youre in the area though.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 3, "date": "2010-09-01", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 3}, "user_id": "pvuA0stf3Gsj3XfX5Sd8dQ", "review_id": "JZTHdzroEmJe3IxYYhaJAw", "text": "Yum Yum in my Tum Tum.. Soft, fresh and served to fulfill.. The only downside is that it's a bit on the pricier side. But would still go back.. LOL.. \nLuv-it Frozen Custard wins this round.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2010-11-21", "type": "review"}
