{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "2KprdTqEYEzNDJo_2GOB1Q", "review_id": "BHz2b2WCmc06jAeTnQ52YQ", "text": "I've never posted a yelp review before.  This meal was so horrible that I downloaded the yelp app just so I could warn others to stay away!  We ordered food from Capri since we were going to voodoo brewery.  We ordered a cheesesteak with no mayo and an Italian calzone since the person working there talked up the calzones.  We ended up with a cheesesteak heavy on the mayo and an Italian wedgie, which was just a folded up pizza full of mayo and onions.  No sign of Italian meat to be found.  No marinara sauce.  It was inedible.  We ended up walking to kfc instead.  \n\nI want to leave a zero star rating, but yelp won't let me.  So they get an undeserved star.", "business_id": "t_gan0EXAw8csKIeFyazJw", "stars": 1, "date": "2015-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pzPEEXl_lHWcXqWGFBN9TA", "review_id": "1_R3vs-hH8pkZYB4j_EqbA", "text": "My fiancée and I have made R&B's our Friday night dinner tradition for over a year. the food is consistently amazing, and portions are HUGE. Whether you choose to pick up or have it delivered, it's always less then 30 minutes - and can we take a second to acknowledge the staff? Always exceedingly friendly, and happy to accommodate any special requests. Sadly, we're moving out of the area in two weeks, so we won't be able to continue our tradition. But if you haven't given them a try, do it! (might I suggest the Buffalo Chicken sub and the cheese and bacon fries? epic!)", "business_id": "T49ZvBa6mD4xHSmjHe-ArA", "stars": 5, "date": "2014-05-18", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "fwsJGulnozT2U6FefsLiFw", "review_id": "svMD2sVPZ3PHZ9WIw71D8A", "text": "Great pizza! \n\nI practically lived there when I lived in Shadyside. My favorite pizza is the Shadyside special. They also offer gyros, wings, salads, calzones, wedgies, hoagies, pastas, traditional, white and gourmet pizzas. \n\nPizza Perfectta is part of a chain of pizza shops that include Cafe Milano, Pizza Milano and Pizza Mineo's", "business_id": "lHP5STO7aomlEQixH8m1aA", "stars": 5, "date": "2010-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "n8hM-OtqDDqmvliqP46QJg", "review_id": "-_9NbCRBp7QKHa-YkyL0ww", "text": "Was so excited to get your pizza today. It's been a few months since last order. Very disappointed in the quality of what I got.  Pizza is burnt on 1side not done on other. How sad is this   So not happy. What happened here!!! Used to be the best I've ever had. Now have to settle for second best down the street", "business_id": "AAcw9y30cRuMo0oa8UBiIw", "stars": 2, "date": "2015-03-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Kx5iAQaVLL_NYzyLhgXPsw", "review_id": "d-v8NbOoUKyY8ECteS8iHQ", "text": "Thinking cold toppings is going to tast great sounds odd....... But, this is great pizza. \nWhen you commit to doing something as odd as cold toppings you are going to strike out or hit a homer. Betos hit a Grandslam. \nPlease stop in. It's a dive but it's outrageously good!!!", "business_id": "93UCt9OgWYmypZCpXtUu8g", "stars": 5, "date": "2014-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lmhS2YOmEDxpbhwMDFWROw", "review_id": "xIuwmX-3ZUr8ubAhoYPoMw", "text": "Aside from the quaint brown paper on cardboard packaging I just can't get into bland sauce on cardboard equivalent crust. I've had better factory pizza at $6 for a large around the block.", "business_id": "Cex2R008tMFg8R5fAtf77w", "stars": 1, "date": "2013-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "K0JEuehAT3d7wDs3J89-LA", "review_id": "1LHcyXoYgBqrxKru_vwPZw", "text": "We know it sounds crazy but this place has seriously upped its game. This used to be our go-to place when we were drunk and the other better pizza places had closed and we were at the \"anything tastes good when you're lit\" stage. But tonight we decided to relive old times and this time...the pizza was legitimately good. Like really good. Like delicious savory sauce that made Giovanni's and Nicks and other local places seem very unimpressive, a flavorful cheese blend that was melty without being crusty, and a solid crust. If they worked on their crust, they would be closer to the Apizza Badamo level, but the doughy, cheese-bread-y crust isn't quite there yet. \n\nWe don't know if this place is under new management, having a rare exceptional night, or what...but this pizza was a  delicious, quickly delivered midnight treat, and we will be back soon.", "business_id": "iudRNo5Q8W7firUBYJEqQQ", "stars": 4, "date": "2015-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "emgswPklp7bPGOyHtecDfA", "review_id": "UuLDpAnJ64Jrf8TxmjnGvg", "text": "Always have a decent lunch here. The pizza is ok.....but not my favorite....I enjoy the chicken parm hoagie....the specials are nice in an affordable way.....and quick too.", "business_id": "JcP-IIrZkW_Yyv4a0yLRCw", "stars": 3, "date": "2015-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "g45VSMs0wovGGhI5Dl_1nA", "review_id": "FdXSBdRQe9hto9cbTaTJSw", "text": "I was stranded in Pittsburgh for a few hours, actually stranded, long story. I wanted a place to eat that was moderately priced, and I was craving a sub or hoagie. I opted for the veggie hoagie sans cheese. It was average, I liked that it was served on garlic bread and the Italian dressing was great. Perfectly toasted. I feel like it was a bit pricey for a ten inch veggie hoagie and a soda at 9.75 but it was late and I was hungry. It's a small joint, not the nicest decor, but it's just your average typical pizza place. Doubt I'll be back.", "business_id": "SvoJ3Y3uqDfB4iGUaWXh8Q", "stars": 3, "date": "2012-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kWkgwRxqWD-h260dMTkHUA", "review_id": "te_SJCVn-cG8u7AOi4iFLg", "text": "I stopped by here this past Tuesday evening with my girlfriend and another dining companion for dinner.  We decided to come here after after reading all of the good Yelp reviews.  It is a pretty easy place to find as it is right on Liberty but I was a bit disappointed whenever I walked inside.  You see we were looking at eating it there and they have no tables.  Thankfully it was nice outside and they did have a couple of seats in front although that left us subjected to the cigarette smoke of the workers and a crazy group of loud people right next to us.\n\nFor our dinner we decided to order a XL cheese pizza and also a large white pizza.  We started with the white pizza and boy did it hit the spot.  The crust was crunchy, the garlic and herbs in the oil sauce were tasty and the cheese was decent as well.  Our red pizza was a similar experience as I imagine the cheese and crust were the same and while the red sauce was good, it lacked a little of the oomph that white sauce had.  Overall though they were two very solid pizzas that I enjoyed.\n\nThe bottom line for me is that I would definitely head back here in the future.  The prices were good and the pizza good as well, now if they only had some inside seating.", "business_id": "bDK_jzy3Shx7jfn8_plNoA", "stars": 4, "date": "2013-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2cFMxD9TZi-zRaJ9ghg8Ow", "review_id": "oAroE2Gq9ZIsg2T7CiGwOA", "text": "Best pizza in Pittsburgh, in my humble opinion ; )  It's cheesy and doughy w/ a sweet sauce...it's just all kinds of goodness!  Take-out is great, but eating there is fun, also.  Try the house salad, too - surprisingly good.  Parking can be an issue sometimes, but spaces usually open up quickly.", "business_id": "r8jeeS3k_diihMDSu9IjlA", "stars": 5, "date": "2015-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XXAWNimRCIygYRP4IZTTEw", "review_id": "CVk55Ktzts1lzlwnaOe0yQ", "text": "\"I can only speak for the pizza, but have it on good authority that the same attention to quality, fresh ingredients is extended to the entire menu. I'll be back to sample more of everything, and to order the Margherita DOC again, and again..and again. If you're anywhere remotely close to the area, I would highly recommend a visit. If you're a pizza fanatic - it's worth making a much lengthier trek.\"\n\nfull review with pictures on my site", "business_id": "6-rJjW6ITl5o_FliiNgZRA", "stars": 4, "date": "2011-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jdVMFac0bg91abRdmLVBQg", "review_id": "pxPVaSoAQE9c9sRItH2y1Q", "text": "They no longer cut your pizza for you.  Instead, they give yiu a \"pizza knife\".  Trust me when I say it is barely better than a butter knife.  The server explained that the no longer cut their pizzas b/c it makes the crust go soggy quicker if it is cut.  I'm sorry, but that is just plain LAME!  I guess I will have to bring my own!", "business_id": "6-rJjW6ITl5o_FliiNgZRA", "stars": 3, "date": "2014-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L53iEBBSW1gOXQX_OqPRwg", "review_id": "bFoA8xwUurKw65cxYNsT4Q", "text": "A Shadyside classic. It's a greasy spoon/smoky bar, and it is what it is. They usually have decent beer specials and cheap Yuengling pints. VERY mixed crowd;: preps, d-bags, the d-bags' girl(s), grad students, Yinzers, everything! Check out Sundays for 1/2 off burgers! Maybe once the Pittsburgh weather cooperates, they will get more business because they do have a fantastic 2nd floor deck area.", "business_id": "Oq5MyNxNi-xuXdPOWR9O_g", "stars": 3, "date": "2011-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Acb4_xgSB7urfrpHExAFqg", "review_id": "eRqluphSLcIs_NHVIRt_DQ", "text": "Tony's is a MUST anytime I make it to Charlotte!  \n\nMy sister lives less than a mile away so throughout the years we've ended up at Tony's on several occasions - lunch, dinner, snacks, celebrations.  And surprisingly it never disappoints!  Their giant pizza slices are definitely the way to go, as it only takes one to fill me up.  And their garlic knots are quite scrumptious - so plan on getting a couple orders if you're a carb addict like myself!", "business_id": "sJtGRBWYUj013nkFA4Hrdg", "stars": 5, "date": "2014-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zG4Kkbumn02cnspYaKPeYw", "review_id": "ttTwgmETmT100AcvwHBvJg", "text": "I absolutely love the family style type of dining. The staff was really friendly, the service was fast, and it felt like i was going to dinner at one of my relatives house! Pizza, pasta, salad....everything was great. Big groups are a must and they have monthly specials that cater to all celbrations that you may be planning.", "business_id": "SVKC_-gIQFkHElZ6bFsE6g", "stars": 4, "date": "2013-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "LRd5CZ8tkdV2Pa4Zz2pSbw", "review_id": "sMIyj7ypKssvc2DEw5a2ww", "text": "I was here this past weekend for a charity event.  It was absolutely packed and the bartenders were working extra hard.  I mean literally breaking a sweat!    Despite it being very crowded, the restaurant stayed clean and cool!  \n\nWe ordered a Margarita pizza which was freaking delicious.  Every ingredient was fresh and tasty.  Even the mozzerella was fresh, not the shredded typical stuff.  I would definitely order this pizza again.  Although this time I did not order a salad, I have in the past ordered the Brixx Salad and it is also quite excellent.  \n\nThe price point is nice on the wallet.  Our pizza was $9.95 and can easily serve 2 people for dinner.  \n\nIn terms of atmosphere, it is more casual but in a classy, Italian way, not a sports bar type of way.  I will be going back for sure!", "business_id": "kAid56AY_laxGYslMdsYJw", "stars": 4, "date": "2011-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "VjoGVx5aH-cDOhcTRIvW8Q", "review_id": "TjazRaOeyQ1D_IqcSeGnFg", "text": "Quick delivery and cannot stress enough to register for email deals because i never pay full price.  Savings up to 50% off regular price!", "business_id": "l3mzaesyc90rxXt2d4HpTg", "stars": 4, "date": "2011-05-29", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "4x4Hl5LN5yKzgZIt4o6_gg", "review_id": "Z0Wl1JKhaPFJXvbjbU5YgA", "text": "***WARNING!!!!!*** THIS PLACE IS HORRIBLE!  WHY?  Here it is.  My family and I went to this place Saturday evening based on the reviews here on Yelp and other sites such as Urbanspoon.  4 of us ordered chicken Parmesan, a pretty good yardstick for determining how the food is in any Italian restaurant.  After each of us took our first bite, we all lookedvat each other with the sort of face you make when you are wondering what was that.  The look was followed by universal disdain for this so called meal.  The chicken was inedible , the sauce was nothing resembling tomato sauce found on 99% of all Italian meals.  We should have been tipped off when the chicken was grilled not breaded as is the case with this dish.  BLAND.  GROSS.  TERRIBLE.  Now comes the part that totally caused me to write this.  We sent it all back.  We were asked \"would you like something else?\".  Not a chance.  If this was the indicator for the so called cuisine we wanted nothing to do with it.  The \"manager\" came to our table.  \"You have to pay for the entire meal\".  Seriously?  Seriously!  Now again in 99% of the time when food is returned, the normal proper way of doing business is to say \"sorry you didn't like your food.  We will deduct the cost from your bill\".  LADIES AND GENTLEMEN.  In the face of protecting my family from the embarassment of the police being called, I paid $83 for this CRAP. $83!!!  As I left I suggested the manager change this policy.  It was met with a smirk and defiance.  In the face of my saying the social media world will hear about this, she couldn't care less.  So, here it is. For those of you who gave this place a positive review, I have to ask \"Seriously?\". For those of you looking for something new in Italian food in Charlotte,YOU HAVE BEEN WARNED by someone who rarely sends food back and by someone who understands the customer is always right.", "business_id": "-2NCvK5807Nxs9GUb2Eo1g", "stars": 1, "date": "2012-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Sd3__-DSydKJ8S9EMB0L5A", "review_id": "gdkgX0IBEJa1VizTxndeEQ", "text": "I think their delivery service is pretty good, it was quick and the delivery guy was friendly. And the lady I ordered my pizza through was VERY friendly and upbeat. I've heard a lot of bad things about their workers? But I always go around noon so maybe those people are just going at the wrong time. Who knows! \nNow onto the food. Their pizza isn't the best pizza you'll ever have, but for the price it's good. It's a little greasy sometimes, I'll admit. But honestly I get the craving for them sometime! They have great cheese to put on their pizzas, and they usually put a good amount on. And I love their breadsticks! Yum! \nLike I said though, there is better. But if you're looking for cheap, quick, decent pizza I'd go here.", "business_id": "OC8AUJshLVimn_-P_INvJw", "stars": 4, "date": "2013-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "r4focLWu9pDjCV0Hm6pJIA", "review_id": "PHOflPNE4C4YMiygyavLbw", "text": "I grew up @ another UNO's and LOVE this place so much! I was here all the time and grew up loving all of their food.  When we discovered there was an UNO's here we were SOO excited!  The Pizza Skins app was great and the Pizza was great as well.  I do have to say we miss their old menu though (ie. Tuscany Bread, Four Cheese Pizza and Spinoccoli Pizza).  However everything was still delicious!!!  As for the service, it was not very good, and there was one other tab l taken in the place. We waited to be seated for 3-5 minutes, seeing no one till we walked around...  Then the app took 20 minutes to come out.  Ordered 10-15 min later and the pizza came out just after the app arrived.  For no other tables here at this point the wait was ridiculous. I'd give this review a 1-2 star if it were not for the amazing Deep Dish Pizza!!!", "business_id": "R825-NTAI2wG2C4mN-dtNA", "stars": 3, "date": "2015-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uKgbjPhcrS2pi9hS39Az6A", "review_id": "g0Um8ZtRZOfjzHxjCtae4w", "text": "Dude, this pizza is gross. Canned mushrooms? Such a deal-breaker. Also, they put clumps of frozen spinach on top without really defrosting it or squeezing out water. And the clumps were COLD.", "business_id": "EMjKhNWBprdlb5Obcia2uA", "stars": 1, "date": "2007-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dzKYG04n0nLXv6tGFvJX0Q", "review_id": "4ozCcZt6k-MRbOPpYshvJA", "text": "I frequent the bar next door, so I thought I might like this place. Erm. I was floored when I walked in, and the first time I came here, I left immediately. Esquire is rather hideous with an atmosphere not to my taste. Light wood? Really? Okay, that's not a big deal. I guess I'm just not used to this feel. I personally think their drink menu is shot. The positive: this is the only place I've found near campus that serves chicken tenders! Kudos.", "business_id": "pPWre8lbVAssER6CN0uWMw", "stars": 2, "date": "2015-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "lHZsCZ4KZsxeiixQ1lBxLA", "review_id": "Eyu45c8U4v9wTYLnrbh0vA", "text": "I have been here twice.  The food is OK, nothing special but not bad.\n\nI have had pizzas and salads and they were as described but nothing to write home about.\n\nMy main gripe about this place is the service.  It has been slow and innattentive on both occasions.  On the latest visit the place was half empty but there was a 10-15 minute wait?  While we stood there, two customers came up to the hostess asking her to take their money as their servers had disappeared.\n\nI like  the Arizona Center but try My Big Fat Greek Restaurant... Plenty of staff, great outside seating and a much more pleasant experience.", "business_id": "nc3IiY5LNdmEwUZCW84yuA", "stars": 2, "date": "2009-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "a7ih1A46SlSudhtKjR2GIQ", "review_id": "XIk9DKWIT8hJ005ariMqUw", "text": "Horrible! It wasn't even busy and it took the waitress 15 minutes to come to our table when we arrived. Meanwhile, she was standing at the counter playing on her iPhone. The food was the worst and we have eaten at different streets of ny before and loved their food. Bread was stale, salad wasn't fresh, pizza was just ok. The manager stood next to the bar the entire time playing on his phone. I never plan to visit this location again and wouldn't recommend it to anyone!", "business_id": "JN2qXIuDXnV2d8WnSqd28A", "stars": 1, "date": "2012-04-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "WCBz-xTApNh4u1VA_HKNLQ", "review_id": "4RO4BHHRLaAx3cJ7vGiX5Q", "text": "Since a friend of mine took me there a couple weeks ago, I've gone back 4 times. The atmosphere is unique, with outdoor picnic-style seating. I didn't have difficulty in finding a place to sit down during their crowded lunch time (11-3), and everyone is cordial enough.\nI agree with everyone here about the Mozzarella/tomato/basil sandwich being the best. As a meat lover, I also like their Soppressata sandwich (with aged provolone and roasted peppers).\nAnd there's Lux cafe right next door. Top notch sandwich place!", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2009-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mKdclgspwAWJOazQHfB2AA", "review_id": "HQu5-65egws9_RXQu13qHw", "text": "Tomato, Mozzarella, Basil sandwiches = crack sandwiches!!  I work near PB and go often.  If you are looking for a huge menu with a large seating area, don't be surprised to find a few items and the Market Fresh Sandwich of the day on the menu and outdoor seating.  That's what makes this place so great, the food is fab and there's nothing else like this place in Phoenix....or perhaps the whole world!", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2010-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "7ILhNlS8h2V63cjFIP0MEg", "review_id": "_J_cGmG7WDSn4L-RwY9xlA", "text": "Specials Tonight at Pane Bianco \n\n*Lasagna al Forno $18 (Serves 3) \n*Farinata $6 whole $3 half\n*Arugala Salad with Peaches $7\n*Meatballs in tomato sauce $12\n*Roasted Vegetables $7 \n*Ribollita Soup $6\n\nMore than worth it to come out. \n\nOpen until 8pm", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2011-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "F_W5KsGiL_sfHrkK2SC5Tw", "review_id": "LCpLppDYoct2fGEvPZtQ7g", "text": "Pizza, escarole salad and lasagna are perfection. Sauce is unbelievable.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2013-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GHIzahBu9gNGOwdmgX0epA", "review_id": "RgxaWQrjAJDiOcjioZqM1Q", "text": "I learned what a real tomato tastes like eating Pane Bianco's tomato, moz and basel sandwich.  It actually smells like a tomato is supposed to smell like.\nBut as good as the sandwiches are, my favourite is the slice of flat bread pizza they sell.  I don't know how they do it, but the tomatoes seem to meld into the bread with some sort of chemical effect that, along with the freshly-made and freshly-baked dough tastes even better than traditional pizza.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2014-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "0qIsBt4EzBDCKrIviV55Ew", "review_id": "CuzO_XelmcwFByuA6jn8tA", "text": "Great example of a four star restaurant,  Oregano's is feautred in so many credible publications.  I come from Northern IL and love the authentic Chicago feel.  The website is worth seeing.  \n\nBest Place for a first date, voted Rep and New Times,\n\nOne of the most amazing desserts The Original Pizza Cookie.  I was in a class at ASU with 29 ladies and they all voted Oregano's the best dessert.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 4, "date": "2008-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IajbWwj6l-KHrfSEwZBLgw", "review_id": "UJ9b8bfpDqFtaE7iezv13A", "text": "Stopped in for lunch last Friday to meet with a friend. Went at 12noon and was surprised to get a seat right away.  Although it was outdoor seating only available.  I ordered a sausage sandwich with the basket weave fries.. Delish.. love it.. although it takes a little while for food to come out, it's well worth it.  They also give you a huge plastic cup of soda.  Our service was ok, it seemed like our waiter was covering a lot of different tables, but then again I'm a pretty mellow person and didn't mind waiting.  But again the food was mackin, and my friend and I ordered the ice cream pizza cookie.. omgoodness, so good.  soft chewy under baked cookie with vanilla ice cream on top.. Enjoy but it's pretty big so I would suggest sharing.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 4, "date": "2011-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "JcsgdLl4HcmAHMRhgsBK7Q", "review_id": "sf-GRVhn3vQ5hoH2vwSibA", "text": "AWESOME FOOD!!!  I don't know why I've been in AZ 11yrs and this is my 1st visit  here. AWESOME, AWESOME, AWESOME FOOD!!!", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 5, "date": "2012-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "baTpFBIKBUW6cmf1Bo3K4g", "review_id": "VWZ-Nexbx8n5yk3SQJmCtg", "text": "The food is great service is great but they served my red wine icy cold, really!\nI'm not a fan of the old old 1950's music very annoying", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 3, "date": "2014-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "N7lSh49zQ13sG3Jpa9E6cw", "review_id": "dVr_OH78U-w5Sweg_6xK0g", "text": "We heard about this place from some friends when we showed up to their place, and there it was- Heaven in a box. \n\nWe had it delivered again last night, and it was still damn good. \n\nThe chicken alfredo pizza is amazing. It has just the right amount of everything- moist chicken, alfredo sauce, spinach, parmesan- and nothing is overwhelming or too rich. \n\nThe Queen Margherita was a hit too- basil, tomatoes and buffalo mozzarella- wow. I could have eaten the entire pie myself. \n\nThe prices are on par with what you'd expect to pay at Z Pizza, and it's worth it. The crust isn't greasy at all- it's perfect. \n\nThey have other things- sandwiches and salads, etc. but I haven't ventured beyond the pizza section of the menu yet. \n\nThey do deliver, but sadly for me I live two blocks south of the cut off point. Boo hoo.", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 4, "date": "2008-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yPOeth2ytk2m2TDtgC1tTQ", "review_id": "0EalRCaEuzaaDLLmi-yJzQ", "text": "We went here for the first time last night and absolutely loved it.  I am a vegan but my family is not so it was perfect for all of us to have options.  My vegan veggie sandwich was awesome.  The owner explained all of the vegan options and even gave us some delicious samples to try.  We will defiantly be back.  I can't wait to come back for the buffalo style veggie balls with vegan ranch.  :-)", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 5, "date": "2013-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MBhvsi8dJTHuaKn4v98XRw", "review_id": "lnLo3XI3viheQzA33NLzjQ", "text": "I only do take out so all that matters to me is a kind person at the register and a high quality pizza at a fair price. Pizza Heaven exceeds in every area. I am not sure how they get such a wonderful staff, but it never fails that they go the extra mile in the smallest ways. If pizza is not ready when I arrive, they offer a free drink. If I order a group of items that are on special they charge me less without me asking. They are just genuinely good people and it is for real. It is the kind of deep rooted pursuit of perfection that I have rarely encountered but always admire. Well done and appropriately named.", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 4, "date": "2015-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aiFdY34Arl6L28AkIfyHEA", "review_id": "8D_FH82LsjxWVVQVMwZi3Q", "text": "My server, River, was very polite and attended to my every need. He suggested the baked ziti with extra ricotta, and it was delectable! I highly suggest stopping by this restaurant, it is authentic and original.", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 5, "date": "2015-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "V5SOpcPoul01FuTZdwj59A", "review_id": "7lQ9eyWmkHRvQFchq7bZkA", "text": "35 minutes. That's how long my four-year-old son and I waited from the time we sat down until we received our lunch. Granted, my son is more patient than most children his age, but after about 20 minutes, he started to ask about where his food was. This occurred on Good Friday between 1:30 and 2:30 pm.\n\nI guess I should have been alerted to this situation from the moment I walked in. No one greeted us, and it took about three minutes before we were even acknowledged. We wanted to sit outside, but after 60 seconds of debating with a colleague, the gentleman told us there were no outside seats - although we clearly saw two empty tables. Then, the shirts on the employees said, \"Unique like a Brooklyn accent.\" I really should question a company that doesn't use proper grammar. (It should read, \"Unique, like a Brooklyn accent.\")\n\nThe person who seated us also took our order moments after we sat down. I asked for apple juice for my son and was told they were out, so we switched to iced tea for him and water with lemon for me. We shortly received our drinks - sans lemon. \n\nAfter we were there about 10 minutes, a large party of 10 was seated near us. Half were small children my son's age and they received lemons with their beverages, so my thought that the restaurant was perhaps out of those too was erased. Unfortunately, our waiter never checked on us, and I actually had to flag him down as my son was whining for food to get a water refill and ask - again - for a lemon. It was then that he told me he'd check on our food.\n\nFINALLY, 35 minutes in, our food arrived. I think we were so hungry at that point that dirt would have sufficed. My son doesn't usually like mac and cheese that is penne with cheese sauce, but he ate nearly all of it. My eggplant lasagna was certainly not the best I've had. Neither of our items was baked, so I'm still not sure what the holdup was. And, by the way, the table of 10 received their food before we did and came and left in the hour we were there. While I'm complaining, my son's ice cream was so frozen I almost needed a knife to cut it for him.\n\nI would like to say the poor service was because the restaurant was understaffed. Although the place was full, I counted seven employees, including a manager. Other tables were receiving much better service, so I'd have to say the problem was more with our server (who never shared his name). My son and I eat out about once a week, and I always leave 20% for a tip, but this time I left $1 on a $16 bill. At first, I felt badly about it, but then I remembered, \"Oh yeah, it's not like I'm ever coming back here.\"\n\n*** On 4/5/10, Alana, a representative from NYPD Pizza sent me an e-mail when she came across my review and offered her sincere apologies, a follow-up call from customer service, and a coupon for a free pizza / meal. I was very appreciative of the response, and as I told her, I've been to other NYPD Pizza locations with much better results; I think this episode was the result of a new or poorly trained server.", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 1, "date": "2010-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "Ifmo45-VJHNMhFQqkXH6fg", "review_id": "1gb6n_Med7sp-8OTxzR3gw", "text": "I have lived in the valley for 4 years now and have tried stupid amounts of pizza joints except NYPD until last weekend. I was watching my friends dogs and went to get some lunch and wanted to try NYPD since I have heard good things. It was midday on a Saturday and I was sat instantly in a booth and given a menu.\n\nI ordered a \"My 'Za\" 8\" pepperoni and a order of garlic knots. The knots were nothing special and I assume they bought them from Frys next door as you can tell they were pre-frozen from the slight rubbery texture BUT they were still good.\n\nThe pizza was great, the crust is my favorite as it has the perfect blend of crisp and soft. Alot of places in the valley are one extreme or the other.\n\nI literally had 3 people waiting on me for some reason but my main waitress (Stephanie?) was great and when my meal was done and I paid, the Manager (I assume) approached me about it being my first time eating there and he gave me a discount coupon for a free desert on the next visit, nothing fancy but a well accepted gesture and alot of businesses could learn from this small gesture of customer interaction.\n\nAll-in-all, I enjoyed the experience and will eat there again.", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 4, "date": "2014-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UjElHRjwqj3-QLgy0z48fg", "review_id": "62Rb5K-1gHkCkD9mjlFX9w", "text": "I had a nice lunch here today. Despite arriving at 12:30 - smack in the middle of the usual lunch rush hour - there was no waiting. The waitress was friendly, and the pizza was pretty good (I went with the classic pepperoni). I haven't been to one of these for well over a decade, but I doubt it'll take me that long to return.", "business_id": "ut-kla-EA23nJOij_dcL0Q", "stars": 4, "date": "2010-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pt4qyGxxHB9uVodhWsskVQ", "review_id": "lAiD6tlygCKqVYgcLpYvLg", "text": "Let me tell you about Frank's Pizza on Indian School. I placed my order today 3/18/2012 online at 3:15 for pick up. When I arrived 40 minutes later I was informed that their system was down so they never got the order. Got my money but not my order. I figured ok, things happen, I reordered in person this time and requested they deliver, and was told I would have to wait another 40 minutes. 60 minutes later I called and was placed on hold for 5 minutes. I hung up, called back and was told the driver had the order. 20 minutes later (i live 5 min away), I go to Frank's pizza and demand my money back. I witnessed the delivery guy return and noted he was not carrying my order. Hmmm. So on top of really poor service I had been lied to as well. While I was waiting there (both times)  i watched a really incompetent staff handling the food with bare hands, the place seems also to be in the midst of remodeling (no longer carrying the ice cream). Poor service. Lied to, incompetent staff, mishandling of the food. I'm calling Mamma Mia's from now on, a little longer wait but worth the wait without the aggravation.", "business_id": "VWcaFOSFcDwmFquycBzFyQ", "stars": 1, "date": "2012-03-18", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "KCuXFajr8xmCHSU3di033A", "review_id": "RDw62BhSWJFAvzbNssKkWA", "text": "You can't beat a $20 per fix menu in a bistro. BTW it was yummy, excellent sauces. However, if you are on the diet, this is not a good place for you, they use lot and lot of cream", "business_id": "oc0Wl6ktfMLb5VZ2Uz6M2A", "stars": 4, "date": "2011-05-04", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "s8OIZ_OQPb1smJoFcBYP9A", "review_id": "Utc-naN7kNbAqwYy0H5pZg", "text": "I have been goin to Vincent's for several years and the food is very good. I was there tonight March 11,2015. When I went to get my car after dinner the attendant said that there was a $4.00 charge for parking my car. I have never seen this at any restaurant before. I paid the 4.00 charge and said that I will never come back and that I would tell my friends about this charge. I hope that Vincent's will take a close look at this because they will lose considerable business as a result. I have never been charged to park my car to eat at a restaurant.", "business_id": "oc0Wl6ktfMLb5VZ2Uz6M2A", "stars": 1, "date": "2015-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "B-YKNNwFl5toJeUNXBj5QA", "review_id": "fx9C-0pmZmx8Z90RA70-Qg", "text": "We prefer Pizza A Metro now. Tastes great and catches you way off guard. But we'll return on occasion to Slice of Sicily. They still have a fun place and solid food. They know our neighborhood, too, so if you want to keep it local, keep going to Slice of Sicily.", "business_id": "j0Uc-GuOe-x9_N_IK1KPpA", "stars": 4, "date": "2013-04-10", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "KYCW5xpBif5eqt-jvIHTdw", "review_id": "qDvbqLh_-aE4Dn4LjPZFXA", "text": "As soon as I walked into this place, my mouth began to water.  The aroma in here just cant be beat.\n\nI ordered the special - 1 16\" pizza with 2 toppings and 30 wings.  Pizza toppings were Mushrooms and Onions.  I lamented this topping combo, but it was what my girlfriend wanted.  I got the wings hot, also ordered the Calzone sampler to try it out.\n\nWhen I opened the wing box, the steam that rose from the box made my eyes and nose water.  It smelled so good I had to eat one right there at the counter.  One of the owners told me that the wings are even better if you eat them in house.  The next time I am in the area, I will try it out.\n\nI took the pizza home and cracked open the box.  The mushrooms were thick, and the onions appeared at though they were cut by hand.  The sauce was rich, and the crust was perfect.\n\nThe calzones were great as well, smothered in marinara sauce.\n\nThe price was great, the people were friendly.  The lunch special can't be beat.  (2 slices of pizza and a free soda, 50 cent refills)\n\nNegotiate the construction outside, find yourself a parking spot and get this pizza.  My only regret was that I had to share it.  Next time - its all mine.", "business_id": "GvwDppcJLm9lso9iS2hSIw", "stars": 5, "date": "2008-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e5lNHRIN1mzzUrGgYRdp7g", "review_id": "W0jePi2VAb5tUNyd5OAF3w", "text": "Unexpectedly wonderful! We stopped in for a quick bite and I'm so glad we did! It's a quaint little family pizzeria.", "business_id": "GvwDppcJLm9lso9iS2hSIw", "stars": 4, "date": "2015-03-29", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "RxfFQxUtSIGYwTKU_rvAeg", "review_id": "ol4Sg6-ODEl2gNXWh52uzQ", "text": "I can't believe I am giving this place 5 stars but after two visits in one week, it is well worth it. After buying one of those playing card decks with restaurant discounts, we finally tried Spinato's (after living in Phoenix since 2003). Yes, I fully realize how ridiculous it is that I hadn't been here sooner. \n\nThere are so many great things about this restaurant ranging from the service, food, deals (coupon and daily deals), and conveniences (order ahead while waiting for a table). From the time we sat down (both visits), the service was top-notch and friendly. \n\nFirst visit, we had the specialty spinach pizza with plenty of garlic and tomatoes ($15 for a medium). It was delicious but way too much pizza for us 4 when we paired it when their large order of ravioli and two meatball. That was so good too! Oh did I forget to mention the garlic cheese bread that we ordered with the baked bread and butter. Both, simply amazing. Clearly I was aiming for the food going straight towards my waistline. I also had a glass of wine since they are half off on Sundays and made sure to get some of their chocolate chip cookies to go. \n\nFor the second visit (a week later), we dialed it back a bit. Of course we had to have the garlic cheese bread, kids ravioli ($5 for the ravioli, a breadstick, drink, and scoop of gelato), small specialty pizza ($10 and plenty for my husband and son to share) and I had the \"lil\" spinach calzone (7\" for $5). That calzone was so delicious, I couldn't save the half I set aside for lunch. Add two glasses of wine (half off), and two piccola brownie desserts, and our total bill was $45. For a family of four with drinks, an appetizer and 2 desserts???? Pretty damn reasonable in this day in age. And it has been a long time since I was that blissfully satisfied with a meal (or two). Well done Spinato's, well done.", "business_id": "YldXB1hRpnE1CWLF3mvgpQ", "stars": 5, "date": "2012-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J8AZ_ogTcphauZ646pav_g", "review_id": "UzHYrLUOInIxpNKolBwMOg", "text": "They said it's best to take a drink order.The little breadsticks that they gave me a delicious jso soft and cheesy.wwdgy", "business_id": "hIe65VALe8rxseYECVj08w", "stars": 5, "date": "2015-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xBJO2JzQxTnXsGy4ZmBkcg", "review_id": "LPFLzkoD8-dX2tkfR0SOFQ", "text": "Really friendly place and good food overall.\n\nI ordered the baked ziti and it was just how I like it.  I'm not a huge fan of any red sauce but they mix in a lot of cheeses which gives it more of a blended flavor.  Usually when I see \"baked\" and \"pasta\" I expect a soft, mushy mess, but the ziti had a lot of firmness to it which is what I want.\n\nI didn't get around to eating the garlic bread until an hour after I ordered and I was expecting a brick, but somehow it managed to say soft.  Nice bonus.\n\nI got a slice as well to try it out.  They serve thin pizza, but I'm more of a thick crust person, but it was good overall.  The crumbled sausage is just what I like.\n\nThe staff was friendly and they seemed to be enjoying themselves.  Nice place to take a family.", "business_id": "kxDGexkbP30fBvxVI0CzFQ", "stars": 4, "date": "2014-03-08", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 5}, "user_id": "oIVsVM8H273aoT1JUmsDIg", "review_id": "d67uqh8vOUlDOVBCImZprw", "text": "How many Ray's Pizzas does it take to have an authentic, NY style slice of pepperoni heaven?  One -- Ray's on Bell Rd. & 3rd Street! If you want to feel like your walking into a pizzeria in downtown NYC, with rough-talking, no nonsense Italian-Americans (or do I dare say... Sicilians?!), then Ray's is the place to go.  Their pizzas are delicious as are their other offerings: pasta dishes, calzones, meatball and Italian sausage subs. Decor is pretty old and run-down, with a lot of old posters of NYC that haven't been dusted in awhile, but who cares when the food is awesome and hearing the guys in the back yell at each other is hilarious!  Be warned, though, some may think the staff comes off as rude... I just call it matter-of-fact.", "business_id": "V3lQtk1LgwAEcF9j-BzchA", "stars": 4, "date": "2008-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m_2ua3IwuxhiJT1Q5BzwhA", "review_id": "emCbF0_R6aVdnMY65MYdhQ", "text": "It was what I expected of a New York Pizza. Thin, floppy crust, adequate sized toppings. A-OK in my book.", "business_id": "V3lQtk1LgwAEcF9j-BzchA", "stars": 3, "date": "2014-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "EZpRl1sc9XT_Tpn2fk-6mA", "review_id": "F8lvEyIMowdwvPBKrwRu5A", "text": "We've been going to SONY for probably ten to twelve years,  and i don't think i've had a bad pizza at this place. We get the lunch special sometimes or go there for a full pizza at dinner. I've never tried the sammiches or other pasta, although they look tasty when they pass by our table enroute to some other customer. I like that they all have patios that you can enjoy when the weather is nice.", "business_id": "rGHktXbee4CErLsMrPqbrA", "stars": 4, "date": "2012-04-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "joIzw_aUiNvBTuGoytrH7g", "review_id": "4JSix2NblHCM1XNVEfGvNw", "text": "Pizza was much better than I remembered.  Crust came out quite well with just enough crispness and golden color.  Cheese was flavorful, and diced tomatoes were sweet and delicious.  Side of sauce is necessary here because it is so good.\n\nDon't forget to try the Calzones.  I had a small hiccup with service, but otherwise this was a great dining experience and the food is consistently good.", "business_id": "pF7uRzygyZsltbmVpjIyvw", "stars": 4, "date": "2009-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XwIIa-0SeoEnH6JBpMMiUg", "review_id": "zBm432BFMY63672NMVsCvg", "text": "If I were a tasting judge for the best pizza in town, this one would be one of my top picks. I've eaten pizza in New York, and Chicago. This pie, bar none, is up there with some of the best I've ever had. \nThis sauce! OMG, tastes like home. I've found my go to pizza place! Please go and judge for yourself!", "business_id": "pF7uRzygyZsltbmVpjIyvw", "stars": 5, "date": "2012-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "kWIyJklrVAxWQ9mi_X5ntg", "review_id": "zUFkHRIvo7B1X4704lBNdw", "text": "NOM NOM NOM, the greatest pizza in phoenix Forsure! I stick with the classic pepperoni and cheese, but the ingredients are fresh and the sauce is out of this world! I can't find anything like it. I've never eaten on location, always had delivery. You know this place is good when there usually is a 45-1:30 minute wait. \nNow that I've finally read other reviews on this place...it looks like I'm going to have to be stopping in!", "business_id": "pF7uRzygyZsltbmVpjIyvw", "stars": 5, "date": "2014-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rx5Qoz43hfHv536vu2W_Ig", "review_id": "_vU-QLlJ6ejlBZBRp6T6WQ", "text": "On our way cross town. Yelp says Spinattis is great. We stopped for pizza and Yelp was right. Enjoyed the cool patio even tho temp is over 90. Also our service was fantastic. We prefer thin crust. This was perfect thin crust. Not wimpy and limp like some. Good there are other ones in the valley too. Coming back for sure.", "business_id": "pF7uRzygyZsltbmVpjIyvw", "stars": 5, "date": "2015-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "LvBkpi5iIJFY0HJIbAEQTA", "review_id": "8xvmh_laClQM7wGgZAJWPw", "text": "This was the first time we had eaten here although we have lived in the area for over 11 years. We had an amazing experience. Maria took care of us and was so kind. She is truly an asset to your team. We want to always have her take care of us. \n\nWe will definitely be back again!!!", "business_id": "pF7uRzygyZsltbmVpjIyvw", "stars": 5, "date": "2015-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "x7QYSYyc_x63-61Z9SB8jA", "review_id": "renRblITBL_5wRm4uZ5B_Q", "text": "Love the hot honey BBQ wings and the white pizza!can't beat the happy hour beer prices $1 pints domestic!!!love it", "business_id": "lf42gtgq_2_jPvjfp_K1nQ", "stars": 4, "date": "2011-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "CwMU-8VjTyNf2eDM52RlAA", "review_id": "7sOcQye2-1_QdD_bWE4sUw", "text": "19 times out of 20 when we get Red Devil it's pizza and it's take out.  The pizza a really good and perfect take out.  If I had to be critical I'd say it can be a tad greasy, but its good pizza.\n\nIn the dining room the Italian food is really good.  The Chicken parm is perfect and all the dishes are quality with generous portions.  \n\nIf you want classic Italian you can't go wrong at Red Devil (and that goes for all the locations)", "business_id": "0gQrhOYWdO0XVZEKtOrvaA", "stars": 4, "date": "2008-03-25", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "To6VfMpjPuiixoT4uq_mIg", "review_id": "u09eTwRvReH2fr0EKyl0rQ", "text": "Good pizza - my daughter seemed quite pleased with her personal veggie - but I found the pasta dishes dismal. My linguine seemed to have been cooked, frozen and  then reboiled at the point of order, garlic insufficiently toasted. Yeech. I might go back for the pizza, but I'll certainly avoid the other dishes. I thought the place overpriced for what it was, too - $15-$20 entrees in a basic, unpretentious neighborhood place. Surprisingly good house cabernet sold by the carafe. Friendly if somewhat inexpert service.", "business_id": "0gQrhOYWdO0XVZEKtOrvaA", "stars": 2, "date": "2015-04-26", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "34gJ_KlP3RM6jotNT6TcDQ", "review_id": "EbmMs-uYy3JK6r6_DL2NLw", "text": "The thin crust pizza with pepperoni, sausage and garlic is one of my favorite pies in all of Phoenix.  So good and so addicting!  I pretty much stick with that when eating at Fatso's.  I tried their wings and the Big Johnson specialty pizza.  Wasn't really a fan of either, but I'm telling you, you won't go wrong with a thin crust with pepperoni, sausage, and garlic pizza.  It's INSAAAAAAAAAAAANELY good!!!  Dip the sucker in some ranch, and you got yourself a deliciously, decadent and gluttonous meal. Damn, that's some good $#*%!", "business_id": "u5o4H8h0sIVhqa8Lcusi5g", "stars": 4, "date": "2011-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "s3I0DHItRqaGojUHwpGPXg", "review_id": "0LbRY2-c1XgYZSby_i1eNg", "text": "If it weren't for Yelp making me give it at least 1 Star, this place would get ZERO, that's right, ZERO stars.  I have had one bad experience after another with these guys.  The pizza is great, IF you ever receive it after they tell you it will be a 30-min. delivery, then you call back after 1hour and they tell you \"the driver is on his way\", then you call back after another half hour and they can not locate your order... WTF???? have you ever heard of a COMPUTER system where you LOG orders when people call????  I know, what a fantastically high-tech concept but then maybe people would get the pizza they ordered.  I am finally writing this review because i just had the same experience at a Domino's in Phoenix ( I live in San Fran and usually order from there), (COULDN'T BELIEVE IT), so this seems to be a widespread problem.  I will never again give Domino's my business.", "business_id": "wWIK4pP8eTVRiTQIUQ6O9Q", "stars": 1, "date": "2008-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "C5_Fe8CxYWLlxm44U1yrsQ", "review_id": "bgrRPbEAOOe43cnW_YY2rw", "text": "Love, love, love Nellos! This location is definitely different from the rest, the servers are wonderful, they are always uber busy BUT seem to always slide you right on into a table with a very minimal wait if any at all. \n\nIt always looks worse than it is due to the take out counter I think. \n\nThe margarita pizza is the best!\n\nTry it out you will be glad you did!", "business_id": "RYZ08XAToBaN-bS5HHVEhQ", "stars": 5, "date": "2011-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1_vJ0BIZ67U1WQ9uManX-g", "review_id": "uKC6uL_MEJqvGPdjrxVVeA", "text": "The place was packed and I think it is because they have amazing pizza.  I had the Classic European pizza and fell in love.  I don't live close by and I do not mind driving out of my way to get it.  If you do not mind the crowds then I would suggest going here.  Lunches may be less crowded?", "business_id": "RYZ08XAToBaN-bS5HHVEhQ", "stars": 4, "date": "2015-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tCVQyYHcmOrx2i81C47Tew", "review_id": "KlR7b_pVYIuDqlktABvdTw", "text": "Wanted to try because of all the great reviews but sadly a little disappointed. Service was really great but unfortunately the food was mediocre.", "business_id": "hgb1RihLYRSpFBjBhn8rZw", "stars": 2, "date": "2013-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XDZbaDpFcaHUufK8tprG7g", "review_id": "5ogVaHR5rh07OR8WwuzStg", "text": "Good food and good service every time I eat here.  It's all anyone wants when we dine out and this particular CPK gets it right.", "business_id": "UpYva_zhJ6pRGfdTruIYIg", "stars": 5, "date": "2013-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "oS5RnCDQxNS85NbnqvPXzw", "review_id": "6m_3Vq7-zjsdGFGkeVLb4g", "text": "Seriously one of the best pizza places I've found in the valley. It's in a run-down strip mall and looks a little scary, but it's fantastic. (And next door to a great Mexican restaurant Rositas.)  The pizza is delicious, the salads are pretty good and the subs are tasty.  Highly recommended.", "business_id": "m3O2EFVs3eo8s40MGGzmsA", "stars": 5, "date": "2009-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hWe9eEWvuvF-RSSGCsl9uA", "review_id": "6EXTWwmgDNYhFInAZqqjHg", "text": "been eating at bounos for 15 years and havent found another pizzaria as good as bounos just wish they had more locations keep up the good work we love you thanks for being so good", "business_id": "m3O2EFVs3eo8s40MGGzmsA", "stars": 5, "date": "2015-05-16", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "25j8Nr0qQVlLhv2BywxL7g", "review_id": "l08DUs1rXz5YKBgwDdHX9Q", "text": "I've been to Buca several times and have never been impressed with the food. The atmosphere is fun but a restaurant needs to have more than a fun atmosphere. The food is less than average. Our most recent visit was for a large group of people and we were put at a booth with a round table  pushed up against it, with the end leaf of the table slanting down, making it very difficult for the two people sitting at the end to eat. (me)\n\nOur waitress was unfriendly and all business. No personality at all. The whole time i felt like we were just an pain in the ass for her.\n\nNow on to the food. We ordered a caesar salad which i could not even eat because the whole thing tasted like fish. I'm ok with a slight anchovy flavor but this was un-eatable. Apparently the dish comes with anchovies standard or on the side. I guess there is no getting around the nasty fish taste, even if you ask for no anchovies at all. The other dishes we ordered were the macaroni rosa, manicotti, and chicken marsala. The macaroni rosa was only slightly warm and lacked flavor. I've had pink sauces before and this was no where close to them. (Maggianos has a great vodka tomato cream sauce) The manicotti was probably the best of the worst but really...how can you mess up manicotti. It's a noodle with ricotta cheese in it. The chicken marsala looked so good with huge mushrooms and a rich sauce. I took one bite and was done. The sauce was so overwhelmingly sweet that i though it was a desert.\n\nThe only reason i went was to see some family out of town and the decision was out of my hands. I thought, what the hell, I give it another shot. Buca  Di Beppo. Yet another disappointment.", "business_id": "sllZXXYijYUs-n80uSa96w", "stars": 2, "date": "2008-05-12", "type": "review"}
