{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "cEN-lL4MQfmUYLJ4K1tU6g", "review_id": "CoVjIh9YMcQ0fU9zRf5WSQ", "text": "I am a big fan of this little ice cream place.  You can get both hard and soft ice cream, so that satisfies myself and my daughter.  They also have funnel cakes for my daughter that doesn't care for ice cream.  The place is small but there is always a line and the DJ outside plays the best oldies while you wait.", "business_id": "Rjx8GcWuCzfVsKC5iPIcQA", "stars": 4, "date": "2012-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "rxYocLcwFsrHYOYwtHSv8g", "review_id": "IE3REBVqNn2CFfIb-dg07Q", "text": "It's open for spring! Was pretty chilly out tonight but that didn't stop us from waiting in line for what we have been waiting for all winter!! Tonight I tried the cinnamon bun sundae topped with Carmel and nuts!! Yum, no matter what you get you'll love it !!!", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2015-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fbDFM2yM0yfyJvvn1OTWow", "review_id": "9rPGjpWqNCLh2Rfa1aT5pw", "text": "One of, if not the best place to go get ice cream in Pittsburgh. Great flavors and endless combinations for sundaes, which are pretty damn large! The man working the counter was extremely kind and really cared about his customers. I can assure you that your order will not be made incorrectly!\n\nMy girlfriend and I went; she had peanut butter swirl ice cream with reese's and peanut butter whipped cream (yes, peanut butter flavored whipped cream.) I had mint chocolate chip ice cream with oreos and brownies, with chocolate whipped cream. Absolutely amaing--we will be back!", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 5, "date": "2015-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "d8y98FiNtI8OQFAp2tvoKg", "review_id": "wt6Xmg0OM8XnTuU26Sjt8g", "text": "Great place to take kids.  Inexpensive but all the food is made fresh in front of you.  Hamburgers are great - cooked perfectly, not greasy.  And they have local ice cream (Tony's - Gastonia) for dessert.  Nice people working there and always an interesting crowd.\n\nOH NO - CLOSED AS OF JUNE 2012 - PHAT BURRITO IS MOVING IN.  I AM VERY MAD AT YOU PHAT BURRITO!  YOU GOT SOME SPLAININ' TO DO!!", "business_id": "nhPdxY-jbf-XVQ6Hq6qJPw", "stars": 4, "date": "2010-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_sgvMx-ixRRPm9aUjHtKFQ", "review_id": "PvngkRQrmaOmbmgXVXsk7g", "text": "Culver's, at least in Wisconsin, is a great place to grab a quick meal! They are always clean, fresh, and reasonably priced! And Sun Praire Culver's is by far the best in the area! Their staff is always on top of their game, always going above and beyond! Good people!", "business_id": "9wsv3WwH0HtwPvD8XCdT_g", "stars": 5, "date": "2015-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RvweNJFVkR3ttkWsIBy7nQ", "review_id": "Tk-8FEIRZoELzYa1B46GHg", "text": "This review is SOLELY for the butter pecan. This flavor is pretty close to the traditional butter pecan. \n\nMy only request is that it was a richer butter flavor. The creaminess just wasn't there. However, a good second place.", "business_id": "FiP9q_YD5vgxu_Sflo5oZw", "stars": 4, "date": "2014-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bvw8R5PhoicozuPvvvM4rQ", "review_id": "66HtmHpNmz8f-N27dn0y_w", "text": "simply fantastic, been here 4 days straight since they opened, the lemon custard is amazing in their banana splits. i would go EVERY DAY.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2010-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AaOut_kxvC-Khd-hdgywew", "review_id": "_xVNl91EJnIyCFy5gUGyUQ", "text": "I am a fan of Frozen Custard and a bit disappointed that this place is so far from home. I ordered a Cookie Dough Snowstorm last night and have to say it tops the list of my favorites. If Ted Drew's or Ritters sat next to this place I would pass them both up and pull in here.  Gonna stop back in today before heading for home.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2014-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zwZytzNIayFoQVEG8Xcvxw", "review_id": "AY8ZjFwKSiMKgjn27wCwuA", "text": "Best frozen yogurt in town!\n\nOwners are always super nice. \n\nThey have a kids size that is the perfect amount.", "business_id": "uaAMGh8gMoJD4nLFzNsM-A", "stars": 5, "date": "2015-05-24", "type": "review"}
{"votes": {"funny": 5, "useful": 2, "cool": 0}, "user_id": "3zvGZizJ6kefgGoBNhdBEg", "review_id": "y403U9jUcCtac0HgshoqEQ", "text": "She wiped her nose with her hand and then scooped the ice cream....\n\nSHE WIPED HER NOSE WITH HER HAND AND THEN SCOOPED THE ICE CREAM!\n\nWHY DID YOU DO IT RAYNA?! WHY?! \n\nThat's dang nasty Rayna! You should know better if you have your food handlers card! Why Rayna, why?!\n\nThank goodness we were only getting an ice cream cake.", "business_id": "XTtNevBI5G5x_GjFqSBMpA", "stars": 1, "date": "2015-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Ixl4VIqhes8h6zR7BnM6cA", "review_id": "UDF23HOKQXf3nB7IUbNIbQ", "text": "We had a valid coupon and they would not honor it because they could enter it in the register. They should not put out coupons if they aren't going to honor them. I will not go back  to this location again!", "business_id": "qeqrsjWXc15KmlK5Z8580Q", "stars": 1, "date": "2015-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xU0Z7gKPCG4cSi4n9mYjPQ", "review_id": "VkCw-2nT5_R0SQqZZiGqpw", "text": "Love cold stone!!! I dont visit this one often but the ladies helping were very nice and helpful and made my ice cream perfect :)", "business_id": "IgMFOK_SOND-4b_DpvFCSQ", "stars": 5, "date": "2013-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EJzdNTvJxF7wKxfxIoZDUg", "review_id": "ZFKwhl7kQa-bKdYrEdgYRg", "text": "Actually this review is for the other Dairy Queen on Florence near Interstate 10 because I didn't find it on Yelp. I give them 0 stars. I went in and ordered a chili cheese dog. Hot dog appeared poor quality. There was no one at the counter and no customers which is always a bad sign but I was really hungry so I waited. Went to the restroom which was filthy and stunk to high heaven.", "business_id": "cG1pHlWhdSc2M9ChWZo-dg", "stars": 4, "date": "2013-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "3Zi1udoY2iT9s8Q3X6tgZQ", "review_id": "7N0jQeWN9BfMscmsDfAmxQ", "text": "I usually go through the drive-thru here... and after walking inside, you'd probably be better off going through the drive-thru as well. \n\nIt's really old and dated inside and they have a really large dining area. I found out that they sell ice cream cakes here which is kind of cool. They've got some in a freezer that you can just pick up inside and there was also a sign that said you could special order ice cream cakes as well...good to know.\n\nI don't go here often, and I'm not super huge on their food - but it's quite nice to treat yourself to some ice cream once in awhile!", "business_id": "L6Qumi_rEtOAfX2FQXm06Q", "stars": 3, "date": "2010-04-04", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "xh4mDvb0H9HjDqU60881sA", "review_id": "LLSuZmntUelt0dSLbBSfRA", "text": "Chaparral was a FIND on a long drive to Phoenix. The ambiance, food, and of course, ice cream was worth a detour off the main road. \n\nI had the bratwurst with boysenberry caramelized onions, and my wife had the jail break sandwich. They were both unexpectedly delicious (I say that because all the talk was about their ice cream, but the food delivered). There is a nice little touch of cheese and crackers that come with your meal as well. Good for the kiddies. \n\nThe ice cream was good, but not memorable. We did however, love the live musician who played while we ate. It was one of the few times where the music wasn't so overbearing that you can't hear yourself eat, and just nice enough to complement a good visit. If we pass this way again, we will surely return.", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 4, "date": "2012-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "22-jsYNEEz0Wou4hr_0-VQ", "review_id": "vCTfNPoSUluCeTfi74DMEA", "text": "If I could give this place 0 starts I would. My boyfriend and I walked in for some soft serve ice cream and stood in like for 10 minutes without anyone acknowledging our existence. 2 employees walked by and looked at us but none of them he the ability to say hello. I understand they were busy but \"hello will be right with you\" hardly requires any efforts. Needless to say we walked out!", "business_id": "SchSiNdLjuRjjrsXFeggWA", "stars": 1, "date": "2015-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "A2ehexjfPRHBbXfOAZhgJw", "review_id": "kbGtMZZPX3kUDSR0KL8o7A", "text": "Mmmm, frozen custard. Not the best I've ever eaten, but it sure is frozen custard, and not too expensive either. \n\nPut it this way - if Luv-It were located in the Mirage or some other swanky hotel, people would pay $8 a cone and rave about it as if it were something miraculous. In reality, it's just a good ice cream stand, but I'll take it in comparison to Ben & Jerry's and overpriced Gelatos.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2007-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bmkVNNQxwaCznfw8L_Th6Q", "review_id": "gjcNb1mLimxSKjnWGRulVA", "text": "Being a frequent visitor from Hawaii which lacks many of the continent's more popular eateries finding new places to eat in Vegas can be a fun and adaptive experience. \n\nLocal people appear to follow a cycle of places to eat which depends on word of mouth from other local travelers. For example, people just turning 21 who are visiting Vegas will inevitably find themselves eating at places like Olive Garden, Applebee's, In & Out, and of course the many popular hotel buffets. Eventually, they will get tired of these places and see them more as novelties with marginal food quality and as their hearts steel with courage they venture off to find new dining opportunities. That is where a place like Luv-It comes into the picture.\n\nIt is off the beaten path, semi-literally as our GPS could not get us there. We kept getting stuck in the main intersection and even ended up at Stratosphere once. When we did get there, we were surprised to find a very small, hole in the wall place. For all the good things we had heard about the place, we were expecting more of a ice cream parlor type of store. But regardless of appearance, the quality of the food easily overcame our trepidation and we have made this a frequent stop on every trip we take.  We have had many of the different flavors, but I still enjoy the Luv It Special. The pecans and other goodies just make my mouth happy. \n\nSo for those who are looking to try something new while visiting Vegas. Update your GPS maps and head for Luv It Custard. It can be a little tricky to find the first time and its appearance and dining areas may turn some away, but the quality of food is great and it is a nice treat in the Vegas heat. Especially for those from places like Hawaii, that lack a strong frozen custard presence.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2011-05-08", "type": "review"}
{"votes": {"funny": 5, "useful": 1, "cool": 2}, "user_id": "Dw6wrTR7pcorzTPzOzbYow", "review_id": "cdrVphUOuDp8zXTlqMGJ6w", "text": "Nothing is better.  Get the Western with creamy, rich, vanilla custard, salted pecans, warm delicious hot fudge and tasty caramel.  If you don't like it, go down the street to Stratosphere, go up to the top floor, buy a ticket to that roller coaster, pretend you are going to get in it, but instead just jump right out and plummet to your death.  Same goes for anyone that gives this less that 5 stars. \n\nThe only thing I miss is the older guy that used to be the only person that worked here.  Maybe the owner?  He was mean and would practically soup nazi you if you asked for a cherry on a smaller sized custard.  I really miss that.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2012-05-06", "type": "review"}
