{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m1FpV3EAeggaAdfPx0hBRQ", "review_id": "jVVv_DA5mCDB6mediuwHAw", "text": "Can't miss stop for the best Fish Sandwich in Pittsburgh.", "business_id": "mVHrayjG3uZ_RLHkLj-AMg", "stars": 5, "date": "2013-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ytgLwKzD6B4af5vW56RpJg", "review_id": "5bBzqjUTYSp9yn4mx-uqFA", "text": "Came here with a group of girls and didn't have a reservation. We paid the cover, walked in and it was absolutely packed. There was nowhere to even stand. One of our friends was having issues with an expired license and when we found out that not all of us got in, they let us get our $7 cover back without issue. \n\nI recently went with a big group who had reserved about 50 seats. People who were not in the group kept coming in to the reserved area but the staff was very helpful in dealing with the group. \n\nThey brew their own beer so do not expect to see any known brands. There are only about 6 beers on top, so if you are more of a light beer drinker you might not be too happy with the beer choices. They also have mixed drinks and wine. The mixed drinks around about $9 and they have a limited number of bottled wines (despite what it says on the menu). \n\nThe entertainment was great and I would recommend it for a group outing. But definitely make sure that you have a reservation.", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww", "stars": 3, "date": "2013-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2VqU7uoDeiE8OUL14Ce5Ig", "review_id": "qvXDgmnvJuTOy-EKKpCQcQ", "text": "This place just plain sucks\nBad management lost them biz\nDumb arcade drama*\n\n* they have recently changed their under 21 policy so no one underage can even be in the arcade or restaurant after 10pm despite having a guardian over 30 years old", "business_id": "sbW8qHJgzEIH42B0S-3New", "stars": 1, "date": "2013-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z3U9fnv8i9rA7yZYpGC66Q", "review_id": "ovpt-qc1tAwy3XD58bmrAw", "text": "love the ambiance and food!!", "business_id": "EoAY1JSVeJriBzId8lUQwQ", "stars": 4, "date": "2013-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Nf0SSRgStO8scYoPSNVqag", "review_id": "qdTtkZVgcdu3SEA6tzBPdw", "text": "Everyone's been to Fridays I am sure, but I enjoy the Yucatan Salad it's delicious. My children love Fridays it's usually there 1st choice. I also love the Cajun Chicken & Shrimp Pasta very very good.", "business_id": "tU-YtoW339PXJmUGSix_AQ", "stars": 5, "date": "2014-04-27", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "XbzKoqoB_V1mWmilax4q-Q", "review_id": "hSiRwfTcBVLreO2fCY0LBA", "text": "I've only been there a few times but it was a nice place - good staff, they mix drinks well, and it's a friendly atmosphere.", "business_id": "ZDKi3qsO8lSSogrIdbLJKg", "stars": 5, "date": "2008-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BuDpYDRm5p0aP2MfVsBvgQ", "review_id": "PsxnS9CJ3azQHnRTMyGgkw", "text": "Overall a good experience. Food was mostly very good. My sweet pea risotto was just OK. My wife's short rib ravioli was creative and very tasty. Neither of us are big eaters, but noted how small the portions were, especially compared to the price. One cup of risotto for $20+? Four ravioli for the same?\n\nThey altered the desert recipe on request, which for sure was over and above the call.\n\nService was attentive and the setting nice.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 4, "date": "2012-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "suRGJir2NmSZVnixdIN22Q", "review_id": "CSn9TtPDi2Uv36sXCplNfQ", "text": "I came for the Sunday brunch prix fixe menu - you get one appetizer and entree with a classy cocktail. I made reservations online a few weeks in advance, and the restaurant, even with decent indoor and large outdoor (with heat lamp) seating, became pretty packed. \n\nFor the appetizer, I was able to try the Granola, Fruit and Yogurt, the Tomato & Basil Bisque, and the Mushroom and Celery Root Puree, and all were equally delicious. The mushroom and celery root puree I was a little wary of, but it was delicious. \n\nFor the entree, I tried Steak and Egg, Sea Scallop Fry, and the Braised Lamb & Eggs. The portions were substantial and the flavors were all there. The runny yolk with the steak and lamb were glorious. They also have other standard brunch entrees, such as a benedict and waffles, but I felt like this was something you can get anywhere.\n\nOverall, really satisfied with the brunch we had. The outdoor seating was beautiful, and the heat lamps kept us pretty warm in the winter.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 4, "date": "2015-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jHymTnhTRlcl-z7tF-ToLw", "review_id": "BeUOzrMXCpoBv3vYhJ6m3g", "text": "I hesitate to leave this review simply because I'm afraid my favorite local spot will get too popular! The Park House is awesome. The food is simple and tasty and the beer selection is great. Not sure what you want? Jeremy or one of the other super friendly and knowledgeable bartenders will give you a taste and help you decide. Not hungry enough for dinner but want some snacks with your beer? Peanuts and popcorn are on the house. Trivia on Tuesdays and Bluegrass on Wednesdays are both a great time. Finally, I cannot say enough about the service here. Z and his staff are friendly and attentive. They go out of their way to make you feel at home and get your served quickly. Definitely stop by and see for yourself!", "business_id": "YRDKsBFYP7G0E8BLJKIkvA", "stars": 5, "date": "2015-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "SlKJNLm1SQdgaaKtqD--1w", "review_id": "P4FaOGyuZNGnE5vfuPyHsg", "text": "This place is great for brunch on Sunday! The service is great and the food is delicious. I always leave stuffed and happy.", "business_id": "IxQ1ATP_Wg_QujO9nywzcQ", "stars": 4, "date": "2014-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tZ_9zVQA-0UY_UAWiBUYfg", "review_id": "7vpLFjcTxT6tJks49Y0Ytw", "text": "Too expensive for the area. I used to be a regular here but the owner never gives anyone a break. Clientele is a pretty rough crowd.", "business_id": "7KjZ49Xrb6QWjnu5NlxzVw", "stars": 3, "date": "2014-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DY-5ZQWM4_GWSLB7kpj-Kg", "review_id": "fkmXp9l0BbGJAkyakaJGvg", "text": "Bados is a bar/restaurant located right on Beverly Rd. in Mt. Lebanon.  Great location, but it may take a few laps around the block to find a parking space.  I've been here more than a handful of times, and have never been disappointed.  They always have a healthy selection of craft beers.  My favorite item from the menu is their pizza.  Some of my favorites are the Gourmet Bianco (white pizza with feta cheese and artichoke hearts) or the Ferrari (eggplant, roasted red peppers, Sicilian olives, cheese).  Appetizers are usually good too, but I'd skip the calamari.  \n\nThe restaurant also has TVs - depending where you are seated, it can be an excellent place to enjoy beer & good food.  Also great for brunch!\n\nDefinitely worth checking out!", "business_id": "qemCNgjeYGcFsRwxW9x4xw", "stars": 4, "date": "2015-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FeUUWYc9FQAmlyZ4T3oMQw", "review_id": "EdtDzgBpdwGO-uC-5ZnJQA", "text": "Any place that has a walk-in fridge full of beer gets my vote.  Go visit the beer cave!\n\nD's is one of those places I need to go to every time I'm back in town visiting family.  I usually go for a burger or wings (seriously I need to find good wings in LA...) and beer.  The food is always tasty and the service is excellent.  \n\nRegent Square is a really cute little area that has a ton of great bars and restaurants.  Highly recommended.", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 4, "date": "2012-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5Owl5siqnImojW2u6Fivig", "review_id": "07Hn0CHUyvLfCEmApY1UYw", "text": "D's is named perfectly.  They have great hot dogs, loaded with all kinds of fun toppings.  They have a beer cave, filled with beers from all over the world.  They also have delicious pizza and fries.  So if you are in the mood for bar food, this is the place for you!!", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 4, "date": "2014-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "SDXX0zuyJHKPZzsQtUIUIg", "review_id": "M_yPn1Ab5qMMZfzIbPJeiQ", "text": "I just moved to Pittsburgh, and found Murphy's Tap room my first week here.  I wandered in on a Wednesday, when they have poker games from 7 until late.  The bartender was quick with the drinks and also very friendly, even when things got a bit busier.  The bar is big, but most people seemed to congregate up front, as an earlier review mentioned.  There are a lot of smokers, but I didn't find it overwhelming.  The crowd seemed to be mostly regulars and people there for poker, but everyone was super friendly. \n\nI saw that they offered some bar munchies (nachos, popcorn, etc) but I didn't try any so I can't comment.  The only downside I can see is that the bar is cash only, but they have an ATM on site if you are like me and only brought a card.  \n\nI liked this place overall - it's a quiet, slightly dingy neighborhood bar that is great for relaxing after work.", "business_id": "7lDNKKxMV84KIS1OVZOepw", "stars": 4, "date": "2012-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "TckShYnQa0eD3WQxdoE3GQ", "review_id": "n6RxU6KRpXYcfxVnQtIcvQ", "text": "I was here last night for a few drinks and a couple of appetizers.  I go here about 6 or 7 times a year.  The bar itself is beautiful.  The seating is great with a huge circular bar in the middle and a lot of leather seats towards the sidewalk by the open air doors and windows.  They also have seating outside which is good for people watching especially when there is some type of event in the city.  I've found the staff to be a little above average, but nothing special.  By far the best thing about this place is the space itself and its location in the city.  The drinks are pretty good, but overpriced.  Some martinis are about $10, which is fine for a stellar top shelf martini in Pittsburgh or an average martini in NYC.  This is not a stellar Pittsburgh martini.   I believe that any bar whether its in your basement or at the \"French Laundry\" should have guinness on tap (just my personal belief), and this place at least has guinness but serves it out of a can.  Another annoying thing is depending on who serves me I pay a different price.  Last night I paid $7 for a guinness (which is way too much) and then minutes later I ordered another one from a different bartender and paid $5.25.  The food is two stars at best and very inconsistent.  They bill themselves as a \"tapas\" place, but it is obvious to me they don't understand what \"tapas\" entail.  Go to ibiza on the s. side for your tapas.  Some of their selections are better than others.  I've had the quail before which was seasoned well and cooked perfectly.  Last night I tried the AHI tuna which was of good quality, but could have used some wasabi or a stronger flavored sauce to compliment the good quality tuna.  I also tried the lobster cakes.  The lobster was barely noticable and the cakes had way too much breading.  The best thing about the plate was the curry sauce on the side.  I'd have to say that the location and space of the restaurant is 4 stars, but the food is 2 stars at best.  Another weird thing is that I've been here before on more than one occassion when they simply said they were not serving food (and it was like 8 on a Friday).  They need an overhaul of the chef staff.", "business_id": "sbTF0cLKZH6_BP8BLARVDg", "stars": 3, "date": "2008-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sXLGIGuilN1ezoEPZOOgLw", "review_id": "oWAczAvZaebGB5zCRfJUNw", "text": "Only rating the upstairs friday happy hour. It had a nice lounge like feel with a lot of females. Not sure if it's always like this. The bar was trying to get rid of their excess green beer from St Pattys for just $1, so we had a couple. All in all a good chill atmosphere.", "business_id": "OxIeMVcop5oxBUWANi-1Rw", "stars": 3, "date": "2013-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "InQq0lA3jdmg4xaswIrZzQ", "review_id": "bXIjtjpjkSCzFeWwUNgwRg", "text": "Great place. The drinks were good. But the band sucks. I didn't order any food so I'm not able to comment on that... however I can tell you that the bartender was friendly and that the place has a nice calming atmosphere.... besides the crappy music I have no complaints.", "business_id": "OxIeMVcop5oxBUWANi-1Rw", "stars": 4, "date": "2015-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V995GXnlBGLj3C55CC200A", "review_id": "UqZaJx-Tct5b7O5bI1Fm-A", "text": "Excellent atmosphere and friendly service.   Food was great.", "business_id": "6xEl2PDJulIp1PfWqa7-aA", "stars": 4, "date": "2013-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "7uAOkICUg1sqoesLEooo2w", "review_id": "LLV9REJ6oUCQmMhcPGTMlQ", "text": "Awful. Just awful. My boyfriend and I went to dinner here last Saturday. We were craving Italian so we agreed to try somewhere in Pittsburghs little Italy. We looked around Bloomfield and decided on this place. With a menu boasting Italian favorites, we thought this would be great. Nope. He ordered the veal parmigiana and I got the seafood Alfredo. His entree came with a wedding soup that was ok...but when the server brought it, the crackers fell to the worn, dirty carpet and she picked them up and put them on the table...gross. Our food took forever and when it got there I was highly disappointed. My Alfredo was tasteless. No salt or cheese, just a bland béchamel. The shrimp were clearly previously frozen as well as the \"scallops\" that were tiny and rubbery. The veal was soggy and chewy and the sauce was sub par. We tried to push through but couldn't. We should have turned around when we saw the dated less then clean looking decor, but didn't. We will never be back and I would NEVER recommend this place to anyone!", "business_id": "-Nanlb7SYXObqQ6dZ49UOg", "stars": 1, "date": "2015-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bSkco4ZdB7REFtDsJUVrDA", "review_id": "wxPSTPTxkFjOKbYyaSBhrw", "text": "My mother and I just completely stumbled upon this place for lunch, and it was amazing.  We got the peppers appetizer, which was phenomenal and full of delicious tomato sauce and cheese.  My mom delighted by her steak wrap, and I absolutely loved my salmon BLT.  However, one of the best things about the meal was the side order of Brusselsprouts.  They were fantastic.  I cannot wait to come back here again.  The atmosphere was also great!  Our waitress was friendly, and the ceiling fans were old school!! Very cool bar!", "business_id": "7XXmky6YYjsvKFwho_eavg", "stars": 5, "date": "2012-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "urM4KPrwXeh64MCAaM_dHw", "review_id": "dWDH4TVpulVvG0g-luwnlQ", "text": "The Saloon is our go- to pub. Keep in mind, it's a bar, it's not fine dining. But after remodeling their kitchen last year and revamping their menu, I can honestly say their burger is the best in Mt. Lebanon, neck in neck with Bistro 19. Beer selection is amazing, 30 craft beers on draft. Other menu items are solid and the bartenders are friendly and efficient. Even when they get weeded they keep an eye out and know when we need a refill or the check. When not too busy they take the time for small talk and get to know you. We live within walking distance which is a huge plus. More of a younger crowd on Friday/Saturday nights but over all, we always enjoy going.", "business_id": "jJfTh2O3M2Q716akd9Dr9w", "stars": 5, "date": "2015-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ikjD_c5Qc4jBsTWSBq5ijg", "review_id": "wQEd1eyX0RDgynlUoba2NQ", "text": "Don't understand the hype, as this place serves slightly above-average bar food in a hipsterish, semi-romantic atmosphere. I cannot comment on the bar and/or alcoholic beverages as I did not imbibe on my recent visit, but the menu didn't do much for me.\n\nWe arrived on a busy Saturday night, but were seated within 20 minutes. Not bad, but our table was questionable. They took a big, corner booth and split it in half so that 2 parties of four could be accommodated sitting directly across from each other. It was kind of weird obligatorily staring at the couple across from me, but I digress.\n\nSome of my fellow diners started off with the Vegetarian Chili. I sampled some and it was well-spiced and hearty, I didn't miss the meat. We also started off with the Spinach Dip. The dip itself was fine, though I've never really eaten anywhere that could screw up spinach dip.\n\nThe entrees then arrived. My companion decided to have their signature Mac and Cheese. The noodles were a perfect al dente, and the cheese itself had a sharp bite. It became difficult to eat after a few bites, however, for the dish was missing a textural contrast. It would've benefited from some breadcrumbs baked on top.\n\nI decided to sample their bacon cheeseburger, which the establishment is apparently pretty proud of. It was cooked to a true medium rare, which is a rare (no pun intended) find in this city. Also, the bacon was heavenly, an ideal combination of lean and fat. They take their bacon seriously here, and it was easily the most interesting part of the burger. The pros of the burger end there however. It was, besides the bacon, pretty boring. The accompaniments (lettuce, tomato, onion, pickles, ketchup, mustard) were standard. The patty itself, while well-cooked and of a good quality, was unfortunately underseasoned. The burger could've benefited from something that gave it pizzaz, like a sauce, some spice, or even some more salt!\n\nI opted for onion rings as a side to my burger. They were large, battered, sweet, and a little crispy, though quite greasy.\n\nMaybe it was because it was a busy Saturday night that I was disappointed. I was expecting some high class bar food at this spot. The common theme of the meal was that although the dishes were competently executed, they all lacked something (such as textural contrast) that could've elevated them to true greatness. Definitely not worth the price.", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 3, "date": "2011-04-03", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "kg8vP_YFYlGKaQtc8VNUYA", "review_id": "WaXV04HLL0whbpFWYGIFWg", "text": "Atmosphere was fun and entertaining. Tuesday night bacon night was something to be seen to be believed. They had a great bar with a good selection of beers at reasonable prices. \nWhen we sat down the waiter was helpful, knowledgeable and friendly. We ordered wings, a bacon basket and the mac and cheese with Jerk chicken.\n\nThe wings were done well and the flavors we unique, not the best I've ever had but worth having if you need a wing fix.\n\nThe mac and cheese was divine. the fact that you could make any combination you wanted was appealing but we went off the menu and I was very happy with it. The right combination of cheese to noodle ratio with a creaminess that was complimented by the savory profile of the jerk chicken.\n\nI am sorry i don't go to Pittsburgh as often for work cause this place was a gem!", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 5, "date": "2013-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BaHMYvAbsUGL0_OADJWpug", "review_id": "NwMnjo7e-QYLuYpG490ZfQ", "text": "Just wow! Plate of pierogie, two baskets of bacon, and two Iron City, and I'm down $17.50!! That is just a heck of a deal!! Ask for Brian, he's a terrific and attentive server!!\n\nI'll be back next Tuesday, you can count on that!!", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 5, "date": "2015-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sI9KdxEEk8u-QxEQGnjxwA", "review_id": "bHQYwsUkD3povf7lX32cFw", "text": "Wednesday night is wing night.  So I had to go with the Yuengling and wings.  Not terribly crowded or loud as others indicated.    Attentive service sitting in bar area.  Slightly limited menu, mostly sandwiches and a few salads, wings are the primary fare.", "business_id": "vSZDiKiF8vf9zt_BcDL7GQ", "stars": 4, "date": "2014-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "4sP4SrDugKGSEgmuMgLVYw", "review_id": "HkGgmZU5-OdxVD5tjnmTYg", "text": "Stiff drinks, doubles priced like singles, a lounge (in the very best sense of the word) masquerading (appropriately enough) as a bar.  I wish I could turn down a heretofore unseen alley - or walk through a wardrobe - in Chicago and find myself sitting at the bar.", "business_id": "TIPebazlAGJsp8zAwhNkcw", "stars": 4, "date": "2009-03-23", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "9HCfCmd0t5GErgm7He6AeQ", "review_id": "ztP_lAAhOmFziuVaYSdIIA", "text": "Applebee's is a chain restaurant that you can find almost anywhere. They do offer lunch specials during the week which are smaller portions but you can pair two items and save money. Each time I visit I'm greeted at the door and made welcome.\n\nI normally order the French onion soup and pair it with a salad and it works quite well for me. They do serve it with a bread-stick which I always enjoy Service is good and waitress attentive. \n\nThey do offer a full size menu and of course there is a bar menu. They have free Wi Fi available and manage to make your visit enjoyable.\n\nIt's a good place to stop if you're traveling or just want to stay on a budget.", "business_id": "PFAOxw4Gl8gm7PGWvohCWg", "stars": 3, "date": "2015-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "yCudCxQTmGx83vY56GnxSw", "review_id": "p9fiKtCIBqh3PJ62bSbB8g", "text": "Great service. Always busy but worth the wait. The manager jeff was active and made sure our time was great. You do not see this type of attention at many locations. Food was very good also. We always enjoy coming to this location. Thank you Jeff.", "business_id": "4WsTFTH8GgnyFHwrH9nHzA", "stars": 5, "date": "2015-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8YkLAYQhhtMGEyowrABG1Q", "review_id": "fQPuoSQq_nDHf47rqyOKDQ", "text": "Great atmosphere and tucked neatly away in the 4th ward neighborhood, Alexander Michaels serves up pub food right.", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 4, "date": "2012-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9u6_IBDD3sNFfmG9k9EJJw", "review_id": "tWVIsbd_9eM2Ua4W9gD_Vg", "text": "Recently moved to Charlotte-Uptown and LOVE this small neighborhood bar! Great beers on tap and bartender was friendly and helpful! Haven't eaten here yet and will definitely be back.", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 4, "date": "2015-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mTKWYLN9PmqF7UflA7tnPQ", "review_id": "CQuTn_uqW9MAZ0JyFOLrzA", "text": "Came here for lunch, however I do want to say that I went to the deli next to the Hearst tower. It was super busy though!\n\nEach sandwich is hand made to order and it was not bad. I got the smoked salmon BLT which was actually surprisingly not bad. The prices are a little off to me, but I guess you're in the city maybe that's how it goes. This place is an in and out restaurant. Call what you want what bread you want (and make sure to say roll instead of for example wheat which is sort of just like bread) and they'll make it and you'll be out in a couple of minutes depending on how long you wait in line.\n\nThis place has pretty fresh ingredient and I would no doubt be coming here if I was working downtown. However, this place I give three stars for the wait time, the prices, and that overall it just wasn't amazing nor bad.", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 3, "date": "2012-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1FUY4gLjf0N_0J-6F8AYsA", "review_id": "ij3uxLUDUyx5KYVhlUKvvQ", "text": "Fantastic pub atmosphere both indoor and on their rooftop area.  Great place to have a pint, share good times with friends, and enjoy the great food.  Menu prices are just a little steep but worth the price as you relish the Irish cuisine with a Guinness!", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 5, "date": "2014-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ExGNvcp-E_cpJ8vNF0t83Q", "review_id": "IdV6ZTb05NfINmNvgjZBjw", "text": "The food was good, though they were out of the poutine. However, the service was lacking a little. While our waitress was nice enough, she was a bit slow to check up on us; for example, when we wanted more tartar sauce, she was nowhere to be found. She also didn't seem very familiar with the restaurant: what the name Ri Ra means, how to pronounce \"polluck\", etc. At the same time, she gave the impression that she was hurrying us out the door--she asked if we were ready for the check but failed to ask if we wanted dessert (we did). She wasn't the only poor server---after our meal, we went upstairs to check out the whiskey room, but it was practically deserted. We stood around for several minutes and there was no bartender or server to be seen. As if to emphasize the staff's lack of concern, we discovered that the satisfaction survey with our bill had already been filled out by a previous customer! Guess the staff isn't looking for feedback. Come here if you really like Irish food, but don't come if you want good service.", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 3, "date": "2015-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JaQ0XY90jUI-bFcFtcQRAg", "review_id": "8zytxOFEgWcwqJH494pD1w", "text": "You'll know when you've hit it.\n\n(Ba-dum crash!)", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 4, "date": "2011-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YqrFN18j57onNLfvlXbtSw", "review_id": "jdlik7uAW5wMl-2caGZFFg", "text": "If I could design the perfect all-around restaurant, this would be it! Casual, but not too much. Wide range of food: from wings, to burgers, steaks, salads, fish tacos, and a ton more. New and clean inside, with an awesome bar area as well as private tables. I also love their outdoor seating, both the front and back sides. I've been coming here for almost ten years now, and still love it. The perfect neighborhood restaurant, whether you want a full steak dinner, or just wings and beer with friends.", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 5, "date": "2014-05-20", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "RK1zkyAbLuxtRaG8iZQ2nQ", "review_id": "3ep0cK5iMuAbPQqu9h8C3A", "text": "What the hell, Phil's Tavern? Every time I come here (usually before a show), things just don't work out. I wanted them to, but they just didn't.\n\nFOOD: The only food I've tried here were the jalapano poppers, and then I never tried anything here again. How do you burn something in a deep fryer? Normally I'd just be impressed, but I was hungry. \n\nDRINKS: Their drink specials are nothing to write home about. The dirty martini was weak, and the tiny, shrivelled, Spanish olives skewerd on a coffee stir did not impress. At least it was only $5. Unfortunately, the Corona of the person I was with only cost fifty cents less than that. $4.50 for a warm Corona? Do not want.\n\nSERVICE: Nice, but few and far between.\n\nATMOSPHERE: Dank, dirty, sticky... these are only a few of the descriptors for this place. I fear the day where I will have no choice but to use the facilities here.\n\nOverall: \nDon't waste your time and money. I hear there's better places in this area, I just need to find them.", "business_id": "6SxAOEXHzNjWQMQ9Nnos3A", "stars": 1, "date": "2011-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "n9VFm3vfNOKr_nEY8opB6A", "review_id": "tEo6xH1stBtnWANY5QljmA", "text": "the food was excellent and both the host and waitress were excellent. most steakhouses like mccormick and schmidt or ruth's chris are pricy and have smaller portions. despite the hefty price, capital grille is the only steakhouse that actually serves you a large enough portion that you feel satisfied. it was definitely worth the price tag. not something i'd do every month but certainly for special occasions.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 4, "date": "2013-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4ja7L8bHY1rCIsQWT1xWBg", "review_id": "ZHbVQyTR49APjOWzTfBIzw", "text": "Just to let everyone know the capital grille is doing a steak & salad special. They have three different options of salads and steaks to choose from. I got the spinach salad with fire roasted tomato and house mozzarella. I forgot was how my steak was prepared but I got it cooked medium. I paired it with a grapefruit buck cocktail because it was the lunch hour after all. One of the many reasons why I'll keep coming back is the older Caucasian lady that works there. She's so upbeat and has the best customer service skills.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2015-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7Uh4OktSH6Cja3uqigVmpw", "review_id": "3pSmJtHRoXeybdDw3U5J3g", "text": "I really like the atmosphere of this pub when we first went there.  I liked how small and intimate it was.  I like dark, candle lit bars.  It just makes me feel a little more cozy. Unfortunately, the service was a bit lacking.  It took about 10 minutes to get a beer (on several occasions) when there was hardly anyone there, and they charged us twice for 2 single Jameson's. We didn't catch this until we had gotten home. It's not that big of a deal, but considering we went on a night when it wasn't that busy, you think they would be paying more attention to what was going on in front of the bar (i.e. people waiting for drinks) and behind the bar (i.e. getting someone's tab right) I have a feeling we'll be going back. It was a great time regardless, but I guess there are some things that just leave a bad taste in your mouth.  We'll be going back though. ;)", "business_id": "jmzPbvE_02SzTAjwZCTgYA", "stars": 3, "date": "2010-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "thaMYj-b1OBn8ympVdpRkg", "review_id": "KU3rOkK37TN2sN8UnHNWLg", "text": "I have been to Cosmos' twice in my 18 years in North Carolina.  I must say the first time was a better experience.  I went during the CIAA the gratuity was 20%.  \nA grilled chicken sandwich cost me $11.00 (overpriced), the taste was substandard and no seasoning.  I guess you can say we recieved third quality food at high end prices. It was terrible.  The the service was okay and I was atmosphere was not that great.  I do not see myself returning.", "business_id": "e5J3s-xxs1S6PPHJhldBEA", "stars": 2, "date": "2012-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7W_Ve1DnGa4uFMbeyC2J6w", "review_id": "ANdfJdnKy3m18gO7G72Pcg", "text": "I like Blue, not sure why I don't get here too often (the price may be a big weigher).\n\nLast time I was here is for a friend's birthday celebration. I ordered the sea bass and yum... I almost lick my plate if only my momma didn't teach me well. My companions got Moroccan chicken and some part of pig on a bone. Yes, they both are also yummy (I'm a forker and good at it!) \n\nBut definitely glad I didn't lick my plate because then I had room for dessert. They were nice enough to put all three desserts (chocolate moose, lemon bar and chocolate molten cake) on a beautiful plate with candle on it. We unanimously agreed, we will claw each other for the lemon bar. \n\nWaitress was really nice and attentive. So... definitely come and visit blue, get some wine and lemon bar while listening to jazz.", "business_id": "eaqJQP6bp7rQJQt5KqfvxQ", "stars": 5, "date": "2011-03-18", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "Ie9LBe0l2VhDc0ClKDGiig", "review_id": "L4g5NAauTK1ktj4G8neJFA", "text": "Probably the worst Mother's Day brunch in Charlotte.   I felt horrible that my husband paid 39 dollars each  for basically an omelette.   The fruit was mediocre. The salad wasn't good. The vegetable station wasn't appealing.  The beef I got was so tough I couldn't chew it. So we ordered omelettes.  There very very few ingredients to choose from for the omelet so I ordered a sausage, mushroom, cheddar cheese one and my husband ordered an bacon, mushroom, omelette.  There were very few vegetables to order with it.  We couldn't tell which omelette was which because we couldn't see the bacon or sausage. I think I got the wrong one because even once in a while I tasted a bite of bacon. We laughed instead of cry when we left because we basically paid close to 100 dollars for omelettes and crepes with tiny deserts when the day before we had an excellent breakfast at another Resturant for about 27.00.  We sure wish we had gone somewhere else. Music was good when they played.  Service was good but kept trying to convince us how good the food was when at best it was mediocre.  I don't think we will come here any time again too soon.  It's a shame. I have fond memories of coming here before after Broadway shows but I don't think we will go anytime again real soon.", "business_id": "eaqJQP6bp7rQJQt5KqfvxQ", "stars": 1, "date": "2015-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "kIUnJmctc0sr7WkNvc_54Q", "review_id": "vF_FIGITlAWybv3ToBdB8Q", "text": "Obviously, the beer selection here is great.  The waitresses are pretty good at giving suggestions, although can become a bit snobby when you keep ordering more beer.  I guess they just could have come off differently.\n\nThe food is okay, the sausages were kind of bleh.  The nachos were really small.  The pretzel was pretty good, I'd recommend that.\n\nGood place to hit up if you have never been.", "business_id": "F-e-sWfVd3eCYll3BP1QFA", "stars": 4, "date": "2010-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "GBOi2QRLWu0o0sumed_3OQ", "review_id": "8iXhlyDf5ccpmReRgbYQEQ", "text": "Two things really stood out for me when visiting the Flying Saucer. 1. The beer selection is amazing. Excellent draft selection and a long bottle list. 2. The service is top notch. All the servers were beautiful, attentive, fast, and beer knowledgeable. The food is good but not great. Had the Hippie Burger which was supposed to have a jalapeno pesto. The burger was good but there was no taste of jalapeno at all which is what I was hoping for. The group I was with shared the pretzels (incredible spicy mustard) and the rocket tots. The pretzels were good but the tots were nothing to rave about. The next time I went had the beer and cheese soup and shared a pizza, which again both were good but not great. I would definitely come back again for the beer and service though.", "business_id": "F-e-sWfVd3eCYll3BP1QFA", "stars": 4, "date": "2014-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "-_1ctLaz3jhPYc12hKXsEQ", "review_id": "mXZwcMIUPccsOmQ0IoiZAg", "text": "There are several Hickory Tavern locations in the Charlotte area, and this one is in the fast-growing Providence Road area.  This also means that it can be absolutely packed, and when there are a few college basketball games on, it's even more so.\n\nThis is because the Tavern is not only a restaurant, it is a sports bar.  That makes it a little difficult to classify, but I'll do my best.\n\nFirst, you have a largish bar area.  This section alone is larger than many sports bars these days, and it looks even larger because it's open, rather than being cramped and confined.  While there did not seem to be any smokiness to the area, there could have been some.  It was definitely loud, as most any bar will be on this sort of night.\n\nNext, you have a dining section, which wouldn't be much different than any other family-style dining area, except for the fact that it was right next to the bar.  So if you take the family, you'll want to be aware of this.  It's not exactly set up for a quiet night out, even on the calmest of times, and this certainly wasn't that.\n\nThe good news for older crowds (those without younger kids) is that if you're waiting for a table, you can wait in the bar section.  They also have these very long tables that run the length of the bar area, and you can even eat there if you don't mind the crowd.  We didn't really feel like waiting, and since the whole building had a sort of bar feel to it, felt like it really didn't matter.\n\nIn the end, it didn't.  The only problem with this was getting the attention of a waitress.  Once we did, service went along fairly well, though getting refills was a bit slow.\n\nThe food was good, and priced decently, but appetizers were expensive, as can be expected in most bars.  Wings especially were not cheap.  But it was all tasty.  I don't know that we'll be back, but it's certainly better than most bars, and definitely a leg up on most sports bars.", "business_id": "r-pBY6vR_Iu5XhPRvPnquw", "stars": 3, "date": "2007-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "eFxX1tSNLmVkAP9kNv2--Q", "review_id": "9k0LhlihwQeuRTIVwucY8w", "text": "I disagree 100% with Devin.  The saucer is much more chill and seems to be less crowded.  More of a college meat market crowd, if thats what your going for.  Seems like a lot of the people trying to play pool want to act all thug.  Food is ok, I will not go back unless thats the place my friends are going.", "business_id": "UUs667cl2g2SjmWcOYgCVw", "stars": 3, "date": "2010-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "99edqBbawRtix8w6xbQB_Q", "review_id": "3qOkmTWMscpUKiCDOOp-Wg", "text": "Location is perfect. Live music was super good on the deck.  But the food... oh my.. Expect fast food quality here. The fish taco tastes like something you get from a frozen box. There is absolutely no flavor on it.  I wish this place was more unique. Not just the typical lower end American Cuisine  (burger/fries/fried chicken tenders/fried fish..) that you get at any Walmart. Service was not bad. I only wrote this review, because I think this place has a huge potential, but I think it needs that  kitchen TV Show to come by and completely change it upside down. :)", "business_id": "Zc2IwSzGY63zkyhfNrr7HA", "stars": 2, "date": "2014-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lOu9PPbRz04z-LRfw2Ptpg", "review_id": "5TZ4CiByjntZtDJVj5ZwNg", "text": "Ate there last night with a group of friends.  The waitstaff was friendly, but that was pretty much the only good thing of the night.  I hate french onion soup that was so salty, it tasted like a salt lick.  Plus, they put so many croutons in the soup, I was only actually afforded about two small spoonfuls of soup before the liquid was soaked up.  I ordered the bluegill for my main dish.  Being an avid fisherman, I can appreciate some good Wisconsin bluegill.  This bluegill, however, was not good.  It was cold and tasted very old.  The fries that went along with it were also extremely salty.  A couple people in the group said their food was okay, but definitely not worth a trip back.  I was quite bummed about this.", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 1, "date": "2014-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ySCFtPBQEowt1T2mp-h71w", "review_id": "f7bXj5yB15z32fPAJGFf7w", "text": "I love the small town bar feel. Good food, nice tap selection. Very comfy.", "business_id": "G1qUGBNYNS220jKlPAlFsA", "stars": 4, "date": "2013-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tYD6Om1Y-5Sbm65Cda9t0Q", "review_id": "NVupLOclX7y3zeG-rcdPqg", "text": "Good food. Great service.  Ask for Waitress Aimee ~ she was friendly and professional.", "business_id": "oudTF4EN_C8thENGiTQf-w", "stars": 5, "date": "2012-05-05", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "z9QwaDCMY2ygAJpp3UI-Fw", "review_id": "FR_dqRq9ETBsbWPR2l5xXQ", "text": "Easily one of my favorite local hangouts, Dexter's is a \"dive\" bar without the \"dive.\" The beer selection is wonderful, bartenders and staff are knowledgeable and attentive, and the food is well above typical bar food standards. There are tables for dining, a long bar for sitting and watching the game, and volleyball courts out back for summer fun. If you're going for the food, I have to recommend the fish fry and/or nacho platter. If you're going for the beer, you won't be disappointed. And if you're looking for a fun place to watch a Badger victory with friends, you've got the right bar.", "business_id": "HTplzElel_F_U_qhWuDKdg", "stars": 5, "date": "2013-05-31", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 3}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "7IyiXX-B4MLl2luyhH0L4g", "text": "Holy crikey. What a burger!!!! \n\nFolks, believe the reviews - the burgers here are LEGIT. I'd stack up their burger against anyone's in Madison. They really are that good. And they're a steal. And they arrive quickly. \n\nPerfectly cooked - awesome sear, balanced seasoning, fresh, tender, juicy. Awesome bun. Perfect topping proportions. Just fantastic. \n\nGo. Get the burger. You won't regret it.", "business_id": "YlznKuAxnd7j3QfXFzoIog", "stars": 4, "date": "2015-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "KXel8HvVoD0-E1kOkASBYQ", "review_id": "4uu0QD00dussGpd5_C5Rnw", "text": "Awesome fish fry on Friday. Great weekend brunch. Cash only but ATM on-site.\nAl makes a wicked bloody Mary at brunch.", "business_id": "JJFoeKZXgi2_LeECDMkkoQ", "stars": 4, "date": "2015-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_bxCv9-IV7uLMF-fKYJEOg", "review_id": "E_S9EoJI5lyoSTNildGC9Q", "text": "I eat there every other week if not more often.  Service has been great and one of the best club sandwichs in town.  A lot of tv's to watch the games.  Friends like the burgers, but I always stick with the club.  Surprising a decent beer selection as well.", "business_id": "cRqZ_w9ImfYYIXTHpJMv0Q", "stars": 5, "date": "2012-03-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "yfRrC6MhxpIJ4-xMcrmk5Q", "review_id": "3HpDpI9ERlVc3tkFW89dUw", "text": "When I was a senior, I believed wholeheartedly that Brothers was the most ridiculously awesome bar in Campustown.  I still believe this, even though I seriously have no idea why.  I love it because it caters to the older students - I never even used to go when I was under 21, because they'd just snatch the beer right out of your hand (jerks).  The music was always the best - a great combination of whatever was popular on the radio at the time, and all those hilarious 80s/90s songs that you never thought you'd hear again.  There was no dance floor - the whole FLOOR could be a dance floor if you staked out your claim early enough.  You could creepily watch people from the top floor; it was a great place to spy on your ex, or that random hookup from freshman year.  I've munched on their mozzarella sticks, failed miserably at their pool tables, and closed out the bar more times than I could ever count - especially senior year.  Always will have a place in my heart!", "business_id": "RcHfSp2qCW8DFwpmpuNv4A", "stars": 4, "date": "2009-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5a8dkjI7yXwmBvBB7XRc2A", "review_id": "DRqgXk6nF502fhDSMTatEA", "text": "Mug club 70360", "business_id": "BP97hODPAzQvspa3NcyZPw", "stars": 3, "date": "2011-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tYg8sMFhe5iGWLq01aOdHQ", "review_id": "mDpyl-BGHEZrd2dfGtlNVw", "text": "Meh, for a college town, this is doable for drinks and bar food. Nothing special, but I'm wondering what the differences are in color for the bar tabs.", "business_id": "MVH3JOKpQvMTP4jxwBUhkA", "stars": 3, "date": "2012-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "urDog6OhPoNKPJFUDob7AA", "review_id": "_xv1djyUOoFRMfKYnmSNOw", "text": "One of the cleaner C-U bars, Legends is a pretty nice place (while keeping in mind that everything's relative).  I've never seen nor heard of this place charging cover - even on Mom's/Dad's weekend, and good bar food during the day (especially the fish sandwich).\n\nGenerally one of the less packed bars, it's a good place to sit down with some friends and play some drinking games, pool, darts, or just chill and talk - note how I said talk, not scream at the top of your lungs.  They have a full bar and play whatever the current hits are at night, but no one actually dances sans a helluva lot of alcohol.  It's also a great place to go on game days as they have a nice, big, flat-screen TV, and plenty of booths/bar stools to crowd around, watch, and cheer for your team.  Go Illini!", "business_id": "05FJCAvUFOAk8B_nIOqt7A", "stars": 3, "date": "2008-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "BvGV9lMMUmB5hLWkNlY3vw", "review_id": "JXmAwg4u-q7BHwAEWBrxlg", "text": "I used to work here briefly and I've known the owners since I was born. Good people, awesome place. Everyone here is super friendly, and it's a nice in-between campus/downtown spot. The beer is cheap, there are darts and Golden Tee, and the outdoor area is always nice, even when the weather isn't. Be sure to go here for the next Illini game and you'll be in good company!", "business_id": "518uzb7bRmoy7Ne14j4SPA", "stars": 5, "date": "2011-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Tl2Gw7MX0srZ-S0W_lCiwA", "review_id": "bWdWrHaA9hsL8FB-6vguTw", "text": "Best Burgers in CU.  Everything else on their eclectic menus also pretty rocks the most.  That will be all.", "business_id": "IUhO58Il7gUEjl1RMEncHA", "stars": 5, "date": "2012-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4WzSJpsY9K0fsiBGQPWgpA", "review_id": "7AYuUOEA8D5SdxF4PPZJQA", "text": "The Burgers and hand cut fries are amazing. Also some of the friendliest staff in town. Definitely going to come back if I'm back in champaign.", "business_id": "IUhO58Il7gUEjl1RMEncHA", "stars": 5, "date": "2015-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 0}, "user_id": "mXuPzX_vcLa8ofAtDhesjQ", "review_id": "b_jcCtILw4oE9iHbSviLmw", "text": "We left after the bar tender insulted my friend. I can see having a bad night, but do not take it out on your customers. To top off our bad experience, this place steals your money. We asked for our check after dealing with the offensive bar tender, and wrote NO TIP on the tip line. Later my cleared bank statement says the jerk gave himself a $5 tip! That is not ok!", "business_id": "mJxu0USvbwSHcGsmwWh22A", "stars": 1, "date": "2011-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_uQ7UQQvp9IkBnezPpUCDw", "review_id": "tUnKqk3kpaI_j7GkjfvNpA", "text": "The service was just okay; our server wasn't the most attentive. The pizza was good, but could've used more toppings.", "business_id": "6U94ybDpNd0fTL7TIzb5Kg", "stars": 3, "date": "2015-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qD0lZO5TynAJSjFkM0BR1w", "review_id": "FO8tkvGGLN73obrY_BRNgw", "text": "First, I love the extensive wine selection! Their bottle selection is really impressive. We had the pizzetta for an appetizer which has a great combination of flavors! I also loved the risotto, it was amazing! The overall ambiance is beautiful, altho it was a tad bit loud. The service was excellent. The prices seemed relatively fair, but on the more expensive side for restaurants in Champaign. Overall, definitely recommend it for a romantic date night.", "business_id": "h9xdY1NO4GnNijNChTy-8A", "stars": 5, "date": "2014-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AeucYo8J-rZjcq09Wuqsjw", "review_id": "THF_kjwu87C6ZCF1zb909g", "text": "Cool joint... \n\nlarge menu : sandwiches, salads, soups, wraps, burgers etc..TV's..alcohol..indoor/outdoor seating..good service. Went during my lunch hour so speediness in the kitchen counts and food came out quickly and was pretty tasty. This place is prob best for lunch and after work drinks/snacks not sure about dinner. Was hard to sit at a bar on my lunch hour and not order a drink..i have decided taking me to a bar on my lunch hour is not such a good idea. Will have to check this place out for an after work drink sometime and see what its like and maybe up my stars on it.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 3, "date": "2011-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "TlVapUorkzfMmtrM2OqZUA", "review_id": "Yt7YA8bdByfjDIsJt20czw", "text": "Stopped in yesterday for a quick lunch with the kids after a visit to the Science Center.  The service was TERRIBLE.  Worst experience as a mom ever!!  The waitress, Abriana, did not have customer service skills whatsoever.  Our orders came out incorrect, figures since she didn't even write them down.  After we informed her that the orders were wrong, she proceeded to tell us that we were wrong and this is what we ordered.  Kids have been waiting almost 35 minutes for the food now.  We had the manager come over.  He apologized for the error and waited on us the rest of the visit. Food was good, but the service was not up to par.  We would not go back.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 2, "date": "2013-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "ikYQ9uwiajq7t8VSDNE16A", "review_id": "6jsQHkPkPkDmBfqWAginow", "text": "I came to this restaurant looking for your standard \"bar food\" so I ordered the chicken fingers and French fries. It was good but nothing worth going crazy over. My biggest complaint with this restaurant was the service. When we arrived, we told the hostess that there 3 of us. She didn't even acknowledge that we had spoken and instead just walked inside expecting us to follow her in. She could have said \"okay follow me right inside.\" How simple would that have been? It just rubbed me the wrong way. Then, we ordered drinks and even though the restaurant wasn't busy, it took a long time to get our drinks. The rest of our experience was just average and I think this place has good potential if the service was better.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 2, "date": "2015-05-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "sOsFjdkH3ceOV5HKbBxOTg", "review_id": "HMv_-4N_eNNN3vjd5kbVPQ", "text": "Finally, a Hooters with actually good looking women to cater to my needs.  Great place to catch play off basketball.  The wings were plentiful and the beers kept flowing.  My waitress flaked on me because a group at another table kept drawing her attention while i waited anxiously for my food as it sat at the window for quite a bit.  Other than that, I got what I paid for. and I left full", "business_id": "qsWxbgQwuomXvMseg23DGg", "stars": 3, "date": "2008-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vpfVuYOBech1P220ho1KFA", "review_id": "DPIb51g2MbuzLOcDhp5MMg", "text": "Visited Hooters last Saturday night after the DBack game. I'm guessing it was 8:30 or 9 o'clock. We were STARVING and thirsty for a cold drink. \n\nScene.. 4 people walk up to a relatively empty Hooters. \n\n\"Table for 4 plz.\" Hostess: \"it's going to be about 20 minutes, we are giving our kitchen time to get caught up.\" \n\n\"HUH?\"\n\n\"Ok so can we sit at the bar?\" Hostess: \"as you can see the bar area is very crowded, and like I said, the kitchen is getting caught up\"\n\nFour confused people look over to a pretty empty bar area. Irritated. \n\n\"Fine, put us down for 4 please\"\n\nEnd scene. \n\nWe got a table around 10 minutes later. Lots of people walked up and turned around and left when they got the same speech. Prob not good for business not to seat people when you clearly have lots of tables. \n\nAnyway food was ok, just munched on appetizers. \n\nNothing was special. Would have been 3 stars if not for our hostess experience.", "business_id": "qsWxbgQwuomXvMseg23DGg", "stars": 2, "date": "2015-04-13", "type": "review"}
{"votes": {"funny": 1, "useful": 6, "cool": 6}, "user_id": "0bNXP9quoJEgyVZu9ipGgQ", "review_id": "mLmSRMNgtH_gW6o5UJYAgQ", "text": "Tried a mac 'n cheese \"flight\" this past Tuesday, 4/21.  One serving costs $8, or a trio $10.  I chose blue cheese, pancetta and caramelized red onion, and butternut squash.  I favored the blue cheese for huge flavor and the pancetta and onion for lovely texture.  The butternut was alright- mildly sweet and I did like it for nibbling.  At the very least, it was my veggie portion of the meal!  I thought the presentation could've been better; I can appreciate the rustic look- one really cannot control how the cheeses will boil and spew in the oven... Well, have a look at the photos and tell me what you think!  I did witness another table receive a \"better-looking\" trio of ramekins, of what I don't know, so perhaps she chose a different set from what I'd ordered.\n\nhttp://www.yelp.com/biz_photos/hU6sN5r6vayqm_RMgvPGOQ?select=4f5Y0561dLrB-69S0lH6GQ\n\nLoved the section of lemon tarte I had for dessert!  Awesome buttery shortbread with a well of lemon curd, then topped with a fresh lemon slice.  I did notice that my tarte slice was cracked in a couple of places;  Thought it \"clever\" of the server to hand the dish to me with the lemon slice neatly covering up the defects...  Still a great-tasting dessert, though- it's a must-try if you like lemons or buttery shortbread!\n\nhttp://www.yelp.com/biz_photos/hU6sN5r6vayqm_RMgvPGOQ?select=Y6gF0oMs3bwU8vjC7Kymsg", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 3, "date": "2009-04-25", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "y5_vrqIylhXMrejM_-x_vA", "review_id": "3tG1xlcs3270GKmvvw3rWg", "text": "We paid $28 for Easter Brunch last Sunday. The menu selection seemed good on paper-and the food wasn't bad-just didn't wow me enough to want to go back. I was pleased with my yogurt starter, although my friends at the table were complaining about the thickness of the avocado gazpacho and comparing it to guacamole. \n2nd course the crab omelet was pretty tasty. I was totally looking forward to sampling my mans' strawberry brioche french toast but it was a disappointment in special-ness. \nMy 3rd course was supposed to be mousse-stuffed strawberries but instead it was mousse with strawberries sprinkled on top. The pumpkin bread pudding my man ordered was better. The artisan cheese plate my friend ordered was SUCH a dissapointment. ONE piece of cheese to try? C'mon people. We overpaid.", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 3, "date": "2011-04-28", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "6hvcowqr8NYug9u-Bzw8Jg", "review_id": "hI2XXIPPfOlAPbWCozUk2A", "text": "From the late 1980s through the mid-1990s, I was a metalhead. I had hair down to the crack in my rear. I wore black jeans, a flannel shirt over a metal band t-shirt, and  the typical denim jacket covered in patches saluting heavy metal bands like Iron Maiden, Metallica, Slayer, Skid Row, and of course... Alice Cooper. I was cool.\n\nCooper's Town is part Hard Rock Cafe and part ESPN Zone. They have a small amount of rock memorabilia, signed guitars and such, hanging on the walls. They have a large amount of sports memorabilia and over 15 television screens to watch currently happening games, games of the past, and highlights from different sporting events around the country. A mix of music, surprisingly mostly not metal, plays overhead. \n\nThe servers all sport black t-shirts with a white image of Alice Cooper's eyes with his eyeliner reminiscent of The Crow. They are also all wearing said eyeliner. It looked a bit silly on many of them, but I do have to give them points for wearing it proudly and not seeming too embarrassed about it. I have to admit that I found the decor of the bar and the wear of the staff amusing at least. I give them a star for that.\n\nOur server was reasonably chipper. She paid a reasonable amount of attention to us for most of our time there, but ignored us for quite a while once the food came then a bit longer once we were done. \n\nThe food was decent, but barely decent. My fiance got the a salad with Thai-inspired chicken and peanut sauce. She said the peanut sauce was good and the chicken okay, but the salad was all iceberg lettuce. Iceberg? Really? Only iceberg? Keep in mind that her and I eat out a lot. It's only at the small hole-in-the-wall greasy spoon that we would ever expect to get a lot of iceberg, much less ONLY iceberg in a salad. \"That's the way we do a lot of our salads,\" we were told by the server. My burger, which was supposed to be cooked medium, came very well done. It was akin to chewing a meat-flavored hockey puck. \n\nThe only good point, foodwise, was the dessert. We got a sort of cinnamony apple cobbler with vanilla ice cream. It was good. It was pretty darn good. I give them a star for that.\n\nWhen we got the bill, we saw that we were not charged for the mostly iceberg salad. We didn't really expect to not have to pay for it, but were pleased indeed that we didn't. I give them a star for that.\n\nOverall, the food and the service were pretty lacking. On the upside, if you're a metalhead or metalhead in recovery, there is a good chance that you'll spot Alice himself if you visit during the winter, and you can purchase overpriced Alice Cooper t-shirts and other stuff the whole year around.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 3, "date": "2008-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "qZ_dR2o3naAhnb3-6D6sIw", "review_id": "qlZrv1BHtRODkdVQxSVPEg", "text": "First thing the hours and parking situation are TERRIBLE.  If you happen to be here after a sporting event next door the environment might be good, but when I went (7:30ish) the entire dining room was empty.  Staff outnumbered customers 2 to 1! \n\nThe food was average American food of the quality you can expect as most chains.  I was in fact one of those people who were sucked in by the Man vs Food episode and I finished the Big Unit all by myself.  To my niece - \"HAH!  I told you I could do it!\"\n\nThe best thing about the night was being with my family.  Overall, there must be better options and if you decide to go, you better check the hours before taking the trip.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 2, "date": "2011-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ExipwmneCQGPRtSZ--baVw", "review_id": "e2MdvwYai9EkGf-qv-LRzA", "text": "Hot diggity dang this place is just of the hook tasty.  The big unit is this huge amazing hot dog, with chili, relish, tomato, jalapenos, and cheese.  Also tried the brownie dessert and oh mylanta....it was orgasmically delicious!", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 5, "date": "2013-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "IP3nF56J-9NEuW7fq29SQA", "review_id": "aFNNgIJndtkOaDoKY7tRbg", "text": "The atmosphere here is just so cool. Even if you don't like Alice cooper the rock and roll feel is all around. The staff wears Alice cooper-esque outfits and even the makeup! \n\nThis is a huge restaurant and there was plenty of room to sit, mind you there wasn't a game on when we went. \n\nMy friend and I both had the Marge Simpson Mac and cheese, it was heavenly. They put some tiny pieces of potato chips on top and it's just excellent.\n\nThe service was quick and friendly. I really enjoyed my time here. It's a great restaurant for families, couples or singles and looks like it would be a decent bar in the evenings. Sort of reminds me of the Hard Rock Cafe, but I like this place better.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 5, "date": "2014-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oNPqlV84trHUrP-_b6Ytyg", "review_id": "_gBiiaSaWZoqirknSLzNCQ", "text": "Staff acceptably nice, but nothing overboard. Welcome to my Nightmare chili loaded was just ok. Crispy chicken salad again just ok. Atmosphere ok but of course in the whole place that's open they put family with two under two kids right in middle fucking up the atmosphere. Nice touch. Hey Alice, who is the brilliant shit that decided metal leg chairs on concrete floor was a good idea?", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 3, "date": "2015-04-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "OpjFNuQiyqh9Sms5Ex8Wxg", "review_id": "1X3wFcjC5Wk4sqQGFprCHA", "text": "Bar Bianco shows how fresh ingredients make all the difference. I never mind waiting for the excellent pizza served next door, at Pizzeria Bianco, because it is always a treat to order some appetizers here. I love the cheese platter because not only are both the cheese and bread excellent, but the additions like raisins and nuts are delicious too. \n\nEven though you may think that you need to go into Pizzeria Bianco with an empty stomach so you can have as much pizza as possible, it would be a mistake to not try some of the amazingly fresh and tasty things off the Bar Bianco menu.", "business_id": "JR95uaM82xBUIZ-kQ785iA", "stars": 5, "date": "2010-03-20", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 2}, "user_id": "0Dngp-JFYvvXD4cy6plvbA", "review_id": "TzxYw25AGSH4U5AbkbxN6g", "text": "I can't stand 50's retro but this place is the cuteness. Well...I haven't technically been inside. Now, I knew this was a hipster hangout, but I wasn't expecting the cute girl in the apron or the boy with tattoos to actually be working on the other side of that window. They didn't seem to mind that I was slightly drenched in sweat having walked there under the sun of a blazing March afternoon. They were quite nice and gave my sister and I a bowl of water for our doggies. Tattoo boy said he would even make us more fries if we wanted. The fries ($2) were not the best  and neither was my grilled cheese ($4) with tomato (yum!) and pickles (?). However, the food had a nice home-made quality to it and was all ready in about a minute. Peeps are right about the high-quality ingredients and the food is inexpensive. Holler.\n\nP.S. Don't forget the Ca$hM0nayyy\nor to borrow from a sibling!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 4, "date": "2009-03-20", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 4}, "user_id": "7aQvAhgpdXqkTQEp8b8Szw", "review_id": "ooeKLCQbrdMVvedVHl7WQQ", "text": "This place is darling. The patio is gorgeous with lots of comfy, welcoming, and uplifting touches. The service is always upbeat, fun, and inviting and the food... holy moly. I'll gladly gain a few pounds for you Welcome Diner. \n\nIf you want to go somewhere different, escape this silly life for a moment, and enjoy a delicious beverage I highly recommend you stroll over to this diner, order yourself a \"Hurricane\" and find a seat on the patio where you can relax while the desert sun sets. In fact, I just might head over there all by my onsies tonight. Yes, I'm going to drink alone. I'm ok with it. \n\nEverything I've ever ordered off their menu has been delicious. They have lots of southern food options and they change up their specials menu about once a week. Anything you order will be divine. I promise you. Don't question me, I have the pounds to prove it.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2013-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "r25GXBdaCjcBld3PrfDi5Q", "review_id": "9eE8uR3KyUV_iYOeo6ESPw", "text": "Went here with some friends on Saturday for brunch. Ordered the Big Jim and sunrise. The big JIM was a little salty and the sunrise just didn't hit the mark. The chorizo was excellent.  The holy puerco was the best dish, I highly recommend. \n\nI will return for lunch and dinner to see if it gets better. I would recommend going at least once, don't be afraid of the neighborhood.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 3, "date": "2014-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZR2iGbkRV0zJAvruTzwDHQ", "review_id": "rclL-QEIEcVLr5wtwUfiwg", "text": "One of my favorite spots in town. This place is amazing from the staff to the food ist incredible. The Po'boy Fish sandwich is really really good I get that and the Kiko i think... something along those lines is a breat burger.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2014-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Dk7idKMGFO_7uRZ41QSy-A", "review_id": "aGr6ZimxLhjE-5QRb8YCzw", "text": "PB&B is awesome!!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 4, "date": "2015-03-23", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 2}, "user_id": "7e1XAK4j95x-ibEy4qFKYg", "review_id": "9SMBWYkxfStZpLBxfFyJDg", "text": "We went to Welcome Diner for Easter brunch and it was remarkable... \n\nThere are two things in that sentence for which I am grateful. \n\nThing 1: Thank you WD for being open on Easter. I'm not a religious man. Easter is just another day of the week for me, however I am a man who can appreciate a day off work. That said, I am grateful that you were open so that I and my degenerate crew could enjoy your establishment. \n\nThing 2: Thank you for having delicious food. That is all.\n\nThis was our first time trying Welcome Diner. We pretty much almost tried one of everything... because why not. \n\nThe Fried Green Tomato Sandwich and the Biscuits and Gravy were my top two items. As I've declared unabashedly in the past, I'm from the south and these two items brought me back home. Very well done in their own unique way. \n\nI think the thing that was most surprising about WD is that they were churning out this great food from such an unassuming place. It looks like they just dropped a little ol' diner right in a residential neighborhood. The location is also just east of Roosevelt Row, in a slightly more rough area. Not bad, but some people might shy away. \n\nThe only issue I see, particularly with summer coming up is that, if I'm not mistaken (which I could be), majority of the seating is outside. There are sun shades, but from our experience, even with said shades, if you're sitting in the wrong spot, you could still get pretty toasty from the sun. \n\nWe sat outside on our visit because it was beautiful. Although as the morning moved along it did get uncomfortable at times when the sun would be at just the right angle to blast you for just long enough you could feel the sunburn happening. \n\nAll that said, get there while the weather is good! And if you do get warm, they make some refreshing mixed drinks (I had the Hurricane) and they also have a nice little beer selection as well. I almost forgot about that... I probably need to drink less of them next time.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 4, "date": "2015-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZuSw1YWxnqFCPhOxKOHDIw", "review_id": "hjQRzA6paNem2OQQm6AVdQ", "text": "this place is legendary, seriously!", "business_id": "JwjDSrMrKmHUXYqoIvTgUA", "stars": 5, "date": "2013-03-19", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "l53FUDHRHLg7BQ89KgAtxQ", "review_id": "CD9hpJNTJR-_K1vOwGWbbQ", "text": "Maybe it's because we were frequent visitors, but I've always pretty good service here.  Between our trips to the bar, for sit down food, and take out food - it could make sence that they knew who we were.  I worked right in that area and we enjoyed that we could just walk over there for lunch.  It also served as a great after work spot that everyone could agree on.  \n\nI know, I know, chains are evil... but there is a lot to be said for a spot that you can take a vegetarian, a burger and beer girl, a Martini girl, a \"get the party started pre-strip club\" kind of guy, a few sports nuts who'll go anywhere as long as the game is on, and some folks who just want food - and they can all find something they like.  \n\nFinally - when we said \"hey, we're here for lunch so we have to go kinda fast\" they would always hustle to get us out on time.  So is it my spot of choice, heck no.  But it's not a bad default option.", "business_id": "hzUOqxpcnYYBgLlrgvjQYQ", "stars": 3, "date": "2007-04-04", "type": "review"}
{"votes": {"funny": 7, "useful": 8, "cool": 7}, "user_id": "nc3cqVN0UuB3m50-CcMftw", "review_id": "xSHFxUqQJs1GH__jOprRiw", "text": "Riding the light rail daily to work has changed how I go about my commute home. It was by the grace of a good friend that I stopped off for a happy hour special at a Midtown drinkery. That's all it took to get me hooked on the idea of stopping off for a drink after a hard day's work. And the proximity of George & Dragon to the light rail launched what is my current obsession.\n\nWith good intentions, I stopped at G&D yesterday for an Irish Car Bomb and a Guinness, and to get some food to take home and watch a movie. At 5:15 there was hardly anybody there, but I suppose most people are commuting at that time. I overheard another patron ask about their \"Slay The Dragon\" program. Participants, it so happens, are given a card with all of the restaurant's beer listed. The steady drinker consumes one of each (there are 66 different beers!!) within a month and is awarded with an \"I Slayed the Dragon\" t-shirt. What a sweet concept! ***\n\nThe steak and kidney pie was also a nice treat, with that certain crispness of the kidney strong but not overpowering. In the past, I've also gotten the fish and chips (FanTasTic!), bangers and mash (excellent) and the wings (very good).\n\n\n\n*** I think it would be swell if we organized a daily UYE to help each other through this beer challenge. Even if it's only done during happy hour (4-7) after work,  that's only 3-4 beers a day.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 5, "date": "2009-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "gg_OKjOAl_vVmdh5ZETuiw", "review_id": "E5-IkkDOjJkWrWnuU1j9vg", "text": "Today I finally made it to George & Dragon.  I was in a pinch and looking for a place that had Telefutera so I could watch my favorite soccer team (Chicago Fire) play.  I called George & Dragon and was told they could accommodate.  One packed light rail ride later I was there and ready to get my game and drink on.\n\nGeorge & Dragon is my type of place.  The decor has been described by other Yelpers as very British.  Since I have not been the the UK, I cannot attest to that but it does look like what I think a British pub should look like.  It actually reminded me of the Winchester in Shaun of the Dead.  The football scarves are always a nice touch.  Perhaps one day I'll donate a USA or Fire scarf and see if they put it up among the UK clubs scarves.\n\nThe beer selection was not as good as I had hoped it would be but it's still better than most. Today I was in the mood to drink German despite being in a British pub so I opted to drink Spaten.  \n\nFor lunch I ordered the Shepherds Pie and it was amazing.  It's the third different shepherds pie I've had in metro Phoenix and it might be the best one.\n\nMy team lost an ugly one and it spoiled my day a bit but I was happy to have made my first visit to George & Dragon.  It will not be my last.  With easy access to light rail I plan on being back soon.  Cheers!", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 4, "date": "2011-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "isFXV201Yo5j-STWvoguZg", "review_id": "kH6ykTLFQJC4dMaTRhH_wA", "text": "I really hate to give this place a less than stellar review because I want to like it so badly! The location is great, far enough out of downtown to avoid the clutter and close enough to have train access and feel like you're in a more urban area. Big family style benches allow for friend-making outside and individual tables inside. I'm surprised I came back after the first time. On a busier night, we couldn't get service to save our lives. We made sure we weren't stepping on toes by seating ourselves and sat, staring at servers running AROUND us for 15 minutes before going to the bar and begrudgingly ordering a beer from there instead. We sat and tried to shake it off while drinking one of many draft choices and waited, trying to make any contact with a server so we could get a menu or so I could merely ask where the bathroom was at-but nothing. I even timed how long it would take to get any attention without waving my arms around and after 10 more minutes we gave up. Apparently we were also given up on because the only interaction we had was the server rudely ripping our drink menu off the table without a word! That being the last straw, our feelings a little hurt, and trying to dial down why we felt like we were refused service, we left half full beers and walked out upset. I still over analyze the situation and try and figure out what in the hell we did wrong! \nNow, we came back to meet with friends almost a year later and service was slightly more decent. For mediocre bar food and bare minimum service that I usually have to flag down or jump straight to the bar for. I don't see all the hype in my own personal experience and that totally bums me out given that I like the atmosphere and location so much and so do many of my friends/coworkers. We still go here out of convenience and a quick beer occasionally but I can't seem to get the bad taste out if my mouth. Bummersville.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 2, "date": "2014-03-17", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Ovpa3S8xD96dLE5eDxcxJg", "review_id": "94H-MN7ASiftasmUyPN39A", "text": "No, thanks.\n\nI can't help but think of Office Space's \"Chotchke's and their pieces of flair every time I get sucked into going to Applebee's. The poor wait staff. \n\nAnd the food is just not good. It could be just an unfortunate coibncidence that of the seven or eight things I have tried they have all failed to impress me but somehow I doubt it. \n\nI don't like TGI Friday's very much, but of the two comparable restaurants, I much prefer it to Applebee's.", "business_id": "cjUmPLRT43wN9Z87A9BOpg", "stars": 2, "date": "2007-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HRSBM0DWNuQXuuSnytLHiA", "review_id": "1-KtNOC3WDp5LncSSmiVbA", "text": "I never thought I would rate a chain so highly but their burgers are absolutely delicious!  I got the Standard, stuffed with bacon, pickle and onions cooked 'pink' (not rare or well-done; just right). Super juicy on a perfectly toasted bun. I would have ate 2 if my stomach had room. Fries were good and french onion soup is above average. I would give 5 stars but they were short staffed and drink refills were hard to come by and they forgot our soup so it came with the meal instead of before which we made sure to request to avoid that. Despite that small inconvenience, the burgers made up for it. Staff was very nice despite being stretched too thin. Get the burger!", "business_id": "cjUmPLRT43wN9Z87A9BOpg", "stars": 4, "date": "2015-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0VfJi9Au0rVFVnPKcJpt3Q", "review_id": "G0w4V47CWRkKBeDqaIlJiw", "text": "Atmosphere is wonderful. Outside patio dining with powerful misters. 70's / 80's music pumped in for effect. Staff is very friendly, cordial and fast. Food is good for bar food. I give it 4 stars for atmosphere.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2009-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9hV2Tf54ZFPcllBI-dwM_A", "review_id": "BypGF86Atx3eBHODqAMyGQ", "text": "Nice place over all.  The beer is good.  Other than beer, I have only had the nachos and they were average/tasty.  The waitresses are always friendly and helpful.  The restaurant is comfortable and they also have a nice out door patio.  The beer sampler is a good way to start your beer quest!", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2011-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "V6rhoTCw7S6H8eHwv2M6Vg", "review_id": "2xXTQLfF1VFT6QqY1WOR4g", "text": "I like sunUp.  I like the beer, its good, I especially love the IPA.  Oddly enough, I have yet to eat at SunUp.  I just really like that this is a nice place to kick back and have a cold one.  The services is consistently quick and friendly, and the selection is great.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2013-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yXa1HFUJ3BtSqkDwTHdAUQ", "review_id": "9--0HoeoqdLgIRUGrBUx8g", "text": "Whenever I know I'm going to be in the area I always have my growler ready for a pour. I've been twice and don't remember anything about the food to blow your mind away but their beers are tasty!", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2015-03-14", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "IRoWn-q3RTOoFVRWsUxGig", "review_id": "Kul2JnKgK0cZ9_YeP87MCQ", "text": "Been here a couple of times. The first time was to take a date there for his birthday dinner. He is Italian and I wanted to take him out for a good Italian dinner. \n\nI have little experience with Italian so after asking around I found out about this place. He gave it really good compliments (yay for me picking a good place!) and I thought it was good as well. \n\nFirst time I went we had AMAZING service! Second was decent service, not quite as attentive as the first time, but also it was a winter formal night for a high school nearby so I'll let it slide.", "business_id": "3CSaqRNvYg7ZdN2zwxwzVw", "stars": 4, "date": "2010-03-04", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "Ovpa3S8xD96dLE5eDxcxJg", "review_id": "u6qZA_KSxz5zCpBeg6dzTw", "text": "A good jukebox, a nice section of pool tables and plenty of seating make this one of my favorite old school Phoenix bars. \n\nYears ago, they had a reputation for being \"soft\" on ID's, so I was a regular when I was home from school my freshman year in college. Since then, apparently there has been some sort of crackdown but the main things that make it a good spot to kick back with a few pitchers and friends remain unchanged. \n\nYou'll find that around thanksgiving and Christmas the crowds are overwhelming, as it has become the unofficial reunion bar for Phoenix natives that have since migrated to other parts of the country and world. The rest of the year it is easy to find seats at the bar or one of the tables, and the laid back divey atmosphere makes it easy to have a good time.", "business_id": "_GS1R0LTwr6h8rMWY_8U9Q", "stars": 4, "date": "2007-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hbYYsn15_75YGgCnmklQjA", "review_id": "2o2lkSt0a4d-i39UZZJeRg", "text": "I've been going to plasma for a few years now met some amazing friends. This place is really awesome! It really is the gay Cheers!", "business_id": "lF1xl8uiYRSLCibhb31sew", "stars": 5, "date": "2014-04-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "ADtC8529e0V4CGgNLaHQXg", "review_id": "he4VkPyRfZU1RMJBTFydXQ", "text": "Had a good time today. Bartender chose to wait on a twinky boy who just walked up using a credit card who was behind me.\n\n Guess cash doesn't matter here. No more gay cash from me today at the chili cook off. See you in a year Roscoes.\n\nKyle needs to go to customer service school.", "business_id": "7srDFwPPnzBaQoPW55Dc8Q", "stars": 2, "date": "2015-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4My3PnGfcKM1mVr9jIVCFQ", "review_id": "_rc8oQaZ0O2RASGCXPaj0g", "text": "Dive bar with original bar food.", "business_id": "ntJAKLAq0cXzzdFgPoo0Iw", "stars": 4, "date": "2011-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "Odoe2LqAPrV0TjdXxkP7Mg", "review_id": "P2O6recGj1Jltg3__n-_fg", "text": "Sooo tasty! Dim lights, semi-formal. There's a bar on the left and the dining is to the right. Tables/booths are placed far enough away that you can get a nice intimate dining experience. I love the macadamia nut chicken dish. Wow!!! The service is excellent also. The parking lot is weird and it's in a strip mall, but it's a diamond in the rough :)", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 5, "date": "2008-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GP-h9colXgkT79BW7aDJeg", "review_id": "XWi1GmKmRK0LsYh1dC-EcA", "text": "Everything about the experience here is really good.  Maybe nothing unique & signature that will make you say \"I ABSOLUTELY MUST go back there\", but everything was well done\n\nGrade A service. Had a reservation, got seated immediately and by a friendly hostess. Water was poured within a minute and server was there shortly thereafter.  Service was attentive and super-friendly & helpful.\n\nNice atmosphere - classy casual, just enough energy.\n\nGreat beer list for me and nice wine special for wifey.\n\nHer almond crusted tilapia was really good (so she said) and an enormous portion - leftovers for dinner the next night. My house pasta (steak and shrimp over pasta in a not-too-heavy garlicky butter sauce) was also terrific.\n\nDessert menu looked good, but we were stuffed.\n\nWe'll be back.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 4, "date": "2012-04-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "F6Ys5UOOlA1zsBztswxsxg", "review_id": "oblP1p_JG33xh54zwF-zJQ", "text": "Service was competent, polite and accommodating. Short ribs were good, though not perfect (but I am admittedly picky about braised meats). Shoestring fries - a substitution provided without complaint - are not my favorite style, but here they were hot, crispy and delicious.  And to top it all a good local beer selection.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 4, "date": "2015-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ux7a5tbceLU6anNycjwt_Q", "review_id": "LJvaUVk-2tbBwSJbBQsLoQ", "text": "I really love the duck sandwich at their deli which I never had before.  The wine bar is treat too for washing down your food and plenty of outdoor seating for a group meet.  The rest of the place is kind of confusing in terms of the varying stuff that they have for sale. I'm not sure how it blends in with the deli but then again, this is an opportunity to try out a new place.", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 3, "date": "2010-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "X7dxykmIV9LL5ZxLtgQYXA", "review_id": "Zefe7nEMJGm6xTItX2q64g", "text": "I went to duck & decanter with a friend of mine from work on a whim, and really enjoyed it!  You order and pick up at the counter, and while you're waiting you can look around in their little shop.  They have a snack section too where you can pick something up to go with your sandwich.  I tried a bag of the popped sour cream and onion chips, which were awesome.  These are not unique to D&D though.\n\nAs for the main course, I got the D.A.M. Sandwich.  This bad boy is pork roast rubbed with southwestern spices, slow-cooked, pulled, and marinated in a jalapeño and onion barbeque sauce, topped off with their special coleslaw, and served on a onion roll.  Holy amazing.  One of the messier sandwiches I've had, but I was too busy nomming it to care.  The portion size was generous, but that doesn't mean I wasn't left wanting more!\n\nThe restaurant itself is fun, with several indoor and outdoor seating areas.  I sat in a little nook in the back wine cellar area with just a few tables.  They have a separate wine bar back there where you can choose from any of their wines, if you're into that kind of thing.  They have a good selection of non-alcoholic beverages as well.\n\nI'm not normally into sandwich places, but I really can't wait to go back and try it again.  Once I've had the option to try other things and get a better feel for the place, I may revise this review and bump them to 5 stars.", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 4, "date": "2014-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "M6Wi9pKDx-W6rGgmf9GVMw", "review_id": "inCisuGkdWyy-jk7HBh4pA", "text": "Just follow their directions and you can't go wrong here - Swizzle in and Swagger out!    It's a classy dive bar me thinks. Love its unique location between the Dreamy Draw cat hospital, the accompanying Puff & Fluff grooming shop and a Starbucks, you never know who will be bellying up to the bar on the next stool over.  It could be a hipster who rolled up on their beach cruiser from the Garage.  It could be your grandfather.  It may be a softball player who's mad b/c they lost or buying you drinks because they won.  or a peace corps volunteer alumni.   You just never know.   But what I do know, the jukebox is the best in the valley,  the beer is served in full-size pitchers (none of this mini-pitcher b.s.) and it's affordable, Dar the bartender also makes muffins so what's not to love about her?,  there is a rotating mystery shot - livers be warned - you never know what you are going to get! and the restrooms have been voted \"best ladies room in Phoenix\"  - certainly an accolade among accolades for a dive bar!       Enough to find me here regularly, and if I'm not I'll be just a swizzzzzz  away!", "business_id": "mgllPJA6NQXlJurFWAkqQg", "stars": 4, "date": "2011-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-GNcVLtPu1QlJ07cMRe4zw", "review_id": "mdtYBNzB2vQcXnvdnHngWQ", "text": "Good bar food.  We had buffalo wings and they were ok.burger and fries and pulled pork sandwich were very good.  The fries were excellent. Happy Hour on weekends!", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 4, "date": "2010-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tBvrnSCLSpUdCDm5w5GPkg", "review_id": "z2rwctgMoOuLYYRRw7hQdA", "text": "We ate here again on 4/20/13- great service again and they have the best fried pickles ever!!!! Yum!!!", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 5, "date": "2013-04-22", "type": "review"}
{"votes": {"funny": 8, "useful": 3, "cool": 3}, "user_id": "7GC9fVWKa4a1ZmBGLH6Uww", "review_id": "qeyCiGzIR5UUj9ltSUWQWg", "text": "ha ha, this was i believe the very first bar i ever went to. i was 18 or 19, and my roommate was a bartender. he got me in and, as a young punk used to drinking 40s in the desert, i was blown away.\ni think i even uttered the words to my older sister, \"why does everyone look like they're auditionin for a calvin klien ad?\" hee, hee, how young and foolish i was. for the record she did not answer, \"so they can get laid,\" possibly in an attempt to protect my youthful innocence, but shrugged and offered, \"i dunno, hey, you have to try a cosmopolitan!\" \n\ni was then in for my second big shock of drinking in bars. i again, stupidly announced, \"that drink costs the same as a bottle of Gordon's!\" (you know, the safeway brand vodka)... ha ha.\n\nso, to get to the point- pretty people, expensive drinks, imported cheese platter-type apps. and yes, i was utterly disappointed and scarred by the \"bar scene\" for years, until i made my next underage bar visit to PV.", "business_id": "peA3F-PnIfijYr8HuG-A-Q", "stars": 3, "date": "2007-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 3}, "user_id": "Wh5pL_iTBOj3R4W7cJWEkw", "review_id": "F1_X_naSjDDQlTTLHr89Hw", "text": "This is by far one of my favorite spots!! \n\nIt's kind of hidden near the theater area, so it can be hard to find. The inside is dark and chic. It's classy and trendy. This place is for almost everyone, there are hipsters and the \"I live in the biltmore estates\" and just regular people. It's great! It's perfect for when you don't feel like having a wild night and just enjoying a quieter night with friends. Their drinks are Delish! And so are the appetizers! Service is awesome! Music is good!\n\nAwesome place all around!", "business_id": "peA3F-PnIfijYr8HuG-A-Q", "stars": 5, "date": "2013-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1yWUlQIerdZ5MEcDjK-LXQ", "review_id": "n1rTBcVJtLQ1l86Oz2sgRQ", "text": "Went to CG again tonight and definitely redeemed itself. Had the lobster bisque soup for appi and shared the sliced filet mignon with cippolini onions and wild mushrooms with my girlfriend and was definitely very happy with this selection. The fresh warm hot rolls were exceptional as well. Definitely a fun time. May be even willing to give Bourbon Steak a second try...especially because it's so close to home!", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 4, "date": "2009-05-20", "type": "review"}
{"votes": {"funny": 4, "useful": 3, "cool": 1}, "user_id": "iwUN95LIaEr75TZE_JC6bg", "review_id": "GQ4Zjhy2PQ9V25Qied1vCw", "text": "Flawless service and reasonably priced gourmet cuisine are the hallmark of this fine establishment. I love it here.\nMy Delmonico was absolute perfection, as was the bernaise sauce along with the sides.\n\nMy date had the lobster and crab stuffed shrimp, which if you think about it, is the oceanic equivalent of turducken. \nNot that I'd ever eat turducken, but her ordering this dish caused me to rethink my entire value system. Maybe turducken is in my short-term future, who knows. \n\nWhich causes me to wonder why it's ok to stuff a tiny little shrimp with a bevy of other larger crustaceans in the first place. The turkey I get. It's a big motherfucker, capable of stuffing practically any other fowl inside of it. But a shrimp? If anything, they should stuff it with smaller crustaceans, like krill or something.\n\nAnyways, I forgot what I was talking about. Oh yeah, Capital Grille.\nThere are a lot of older people in here. One old woman in the booth next to ours was coughing up shit all through dinner which really sucked. I turned and gave her the skunk-eye, as if to say; 'Hey bitch, take your phlegmmy-ass outside and let me enjoy my meal', but she shot me a look right back, saying; 'Hey you little wad, I've got more money than anyone in this place and if I so choose, I'll dredge up as much phlegm as I want...now piss off and stop staring at me.'\n\nAll things considered, our meal was really good except for Sputum Queen in the next booth. I hope she gets pneumonia if she doesn't already. Bitch.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 5, "date": "2013-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7ql2NF77EjMsB7W0xFw1WQ", "review_id": "mXCML0DScxUA-Kt-cqnfyA", "text": "Ok steak.\n\nNothing special.  However,  they did put some confetti on the table for my father in laws birthday.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 3, "date": "2015-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "qrdkZvmXPd4Ts20SmUBRQQ", "review_id": "6NEk26zIhHHI4QXEjGBCsg", "text": "They have the BEST wings...not fried! They now offer grass fed and hormone free burger...YUM!", "business_id": "rVUEZpHQfWI_3kt0lBwaxQ", "stars": 5, "date": "2011-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tY-4KKfsUG6AqA0kcvsy5w", "review_id": "eH6XRoI1uGa6eiCkXct43g", "text": "Great, authentic, entertaining, somewhat scary (Good Fellas, Joe Pesci  scary) Italian joint.  And please rest assured that this reviewer does NOT consider Olive Garden as the standard (I wish we could root those folks out and sign them up to a Yelp for Dummies service)...yes, I'm a freakin' elitist, but what can I say?  I am a foodie, and Italian culture reigned supreme for a millenia.  \n\nThe owner is 100% Italian and runs all over the place making sure all is well.  The wine list is all over the place and mostly phenomenal, very pricey bottles.  We found an excellent Amarone for $60, but you can find some bottles for less.  Wait service was excellent, but totally unpretentious.  This is the real deal folks.\n\nAsk for a pasta sampler plate.  The gnocchi is out of this world.  Escargot was traditionally prepared with butter and garlic, Caprese salad was perfect.  Veal Osobuco with rissoto was out of this world (I usually resist veal as the treatment of the animal is more than I can bare, but man you can hardly go authentic Italian with that attitude!).\n\nHere's the scary part:  There were some mob-looking folks in there, with plastic-surgery wives and fat rings...I could totally picture a scene in the Godfather or Sopranos where someone is dragged down that narrow, long hallway to the bathrooms/back alley by a guitar string wrapped around their neck.  I swear I was peeking around the corner before walking into the bathroom just in case someone had put a hit on my ass!  Luckily I made it out of there alive and very very satisfied.  \n\nSpent $150 for 2 including tip and a nice bottle of wine, and we gourged.  I rarely give a place a 10 unless it's very fine dining, but this place came at it from a different angle and was worth every penny.  Enjoy!", "business_id": "vvA3fbps4F9nGlAEYKk_sA", "stars": 5, "date": "2010-04-28", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "dsv5iGdK0UILcS7d_7DgYA", "review_id": "_w3YZNAxmxwTNjBvJWhdBA", "text": "So had a gift certificate to eat here so rounded up a couple of co-workers and headed to lunch! It was a really cool place the wall of fame was solid! I ordered the Chicken and Sausage Scarpariello it was AWESOME service was good..will come back to try dinner for sure!!", "business_id": "vvA3fbps4F9nGlAEYKk_sA", "stars": 4, "date": "2014-05-23", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "6Pb0PAMhlcVwAkGfm3MSKw", "review_id": "EWCGxeATSZfwALakGoExHA", "text": "wow. horrible experience here.  \"Tina\" the bartender, rude, confrontational, a little bit scary.  sad, since we've been coming here for karaoke a lot recently, and its always been great,  until tonight.  we will be reversing the charges on our card and never returning.", "business_id": "HNXcjXTz_Ogsdpm0Kikhrg", "stars": 1, "date": "2014-05-10", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "MmPOU8kbuwkE4NedXe-qZw", "review_id": "VLOIIRfRuJ9xZz5DbSukig", "text": "I'm giving this place a 3.45...I don't know, maybe I was expecting more from the more than 50 glowing reviews. \n\nI am more of a drink and mingle kind of girl, but there is no mingling to be had at Postino.  On the other hand, I can also be an intimate conversation kind of girl, but I didn't feel that was to be had at Postino either.  The room was loud and bright - hence the lack of intimacy.  Maybe it's because I went around happy hour?  Maybe better at night?\n\nAs stated in previous reviews, the bruschetta is truly awesome!  I love the fact that they let you choose up to 4 toppings - very original idea.  The service was fabulous, we had more than 4 people attend to our table throughout the evening and our waitress was very helpful with wine & food recommendations. \n\nI will be back - that's for sure. And definitely for the $5 wines when I get the chance from 11-4.  But maybe I'll have lower expectations which will likely result in a better experience.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 3, "date": "2008-04-30", "type": "review"}
{"votes": {"funny": 4, "useful": 6, "cool": 6}, "user_id": "Hyhmpb3UnbjtSEXvgviCow", "review_id": "lDAsAafukMhMASIk8hEyVQ", "text": "Peace. Love. Drinks. Music.\n\nWhat a mission statement!  And how wildly Postino succeeds!  I LOVE this place. lovelovelove.\n\nArrived in the afternoon prior to flying home to take advantage of the generous 11-7 happy hour with 5 dollar glasses of wine and pitchers of beer.  Was greeted by a lovely gentleman who asked if we wanted a \"proper table,\" but since we did not, he escorted us to a loungey area and seated us at two super comfy chairs with a nice table in between.\n\nThe place itself is a former historic post office; the space itself is funky and fun, with lots of natural light coming in and wonderful music!  We jammed to Bloc Party, Passion Pit, and so many other great songs.  As we sampled their libations, here were some highlights:\n-Bellini: so fresh and tasty and only 5 bucks!\n-Pinot Noir: can go so wrong, but was so right, especially for 5 bucks!\n-Pitcher of beer: a yummy, citrusy wheat beer; about 2 and a half glasses to these pitchers, but again, only 5 bucks!\n-Pub Board: yummy, warm, salted pretzel bites, excellent cheese, chorizo, and corn nuts. Great with beer.\n-Bruschetta: OMG so good!  One order gets you four large bruschettas (cut in half for sharing). We loved the goat cheese with roasted red peppers, brie and apple with fig spread (swoon!), white bean with tomatoes, and salami with pesto. Oh so yummy.\n\nThe service was amazing, the vibe was oh so cool, and the food and drinks were priced well and yummy.  To me, this place is like what many LA places try to be, but they actually succeed without being pretentious or overpriced. Seriously, do I need to move to Phoenix?", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2010-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2z6iqGDKZ547BHnGwpDBFg", "review_id": "K_Q0GUmvMG4gUUPby-TNtw", "text": "Sometimes you have to wait  a little bit, and you have to valet (but its right in front!) since you wont find parking, it is all so worth it. Very cute, everyone is so friendly and makes sure you are taken care of. They have a great wine list which they change frequently and the best part about postino is.. the bruschetta!! Have to get the apple, fig and brie cheese, I am serious!!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2010-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Gy9nOzH_L8NGCjrQr-ntng", "review_id": "7a96uRaFt8qfIVqKbYaDtA", "text": "It's safe to say that I have developed a serious love affair with Postino. While both locations are exceptional, the Arcadia version in the old post office has charm that is unmatched. The patio makes you forget that you are in the middle of the desert, the waitstaff is friendly, knowledgeable and fun, and the food...wow. The bruschetta goes unmatched in the Valley and pretty much any other place I've visited. It's so good that I don't bother to order it anywhere else. Nothing compares. The chicken and mozzarella panini has quickly become my favorite sandwich in town. I sub the pesto in for the mayo, and I can't think of anything I'd rather have for lunch. The downfall is the parking situation, but with a little patience or a few dollars for the valet, you'll be seated and enjoying a delicious meal in no time. Whether it's soup inside on a rainy day or a life-changing sandwich on the patio in the springtime, Postino never disappoints.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2011-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "EduMl1ICkhWdyN4OF5FQHA", "review_id": "EX3x2qoYPr9V6l2yzDg1_w", "text": "I loved Postino's. Loved, as in past tense. Living in the area for the last several years, Postino's was my go-to place for everything from Saturday night celebrations to making a Monday just a little special. The wine is great, the menu is perfect, the ambiance is downright delightful. It's the staff that makes me cringe. On a recent visit, the snobby hostess told us the wait was 2 hours... But no one was there ... And there were empty tables ... Something did not seem right and when I asked her about it again, she rudely just stared at me. 2 hours later, we got seated and ignored. It took another hour (!) for our bruschetta to arrive to our table. We left feeling hungry  and  neglected. The worst part is that I started to ask around and I have three (3) other friends with almost the exact same experience. After so many happy years at Postino's, I won't go back to the Arcadia location. On the bright side, the Central location boasts the same menu minus the horrid staff.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 2, "date": "2011-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "J6IOwRvM6UYtJIxKR1KW7w", "review_id": "6xVZGJ8TYWemKUSO7UmMiw", "text": "This place is a very chill wine bar. Came here after flying in for work and wanted something that would be light, have a good wine selection, and a nice outdoor patio/bar area. Daily Dose fulfills each of those items. \n\nYou MUST get the bruchetta plate. My favorite was the smoked salmon, pesto, and capers and the prosciutto and fig. 4 slices of bruschetta for a single person was too much, but you shouldn't hesitate in bringing along friends. \n\nI also tried the raspberry chicken salad. Sadly, I was looking for more greens than the chicken pieces. It was still super delicious.\n\nI ended with an affogato. You can never go wrong with this choice and Postino didn't disappoint me!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2012-05-01", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "r8xfTpifZ7gP5Cd5CSQaIQ", "review_id": "3p_ORoSQZscPaSjySCS5JQ", "text": "Perfect date spot. Cute wine bar with tasty menu, good wine list and delightful ambiance. Enclosed alfresco patio out front is fantastic.\n\nBruschetta is  tasty and ranges from light to heavy, something for everyone. Would order all the below again:\n\nSmoked salmon / pesto - salmon was fresh and delicious. Just a smidge of pesto, not smeared\nBrie & apple w/fig spread - simple but refreshing. Thinly sliced Granny Smith on brie. Fig spread is jammy and adds the perfect depth.\nBurrata, bacon, arugula, tomatoes - the burrata was outstanding. would've preferred this w/o the bacon, which somewhat overpowered this bruschetta\nProsciutto, figs, mascarpone - brilliant combination\n\nThe Pub Board is a great concept and cleverly presented - sliced soft pretzels, cornichons, aged cheddar (delish), giant corn nuts (so fun!) - just lacking stone ground mustard for the pretzels! Maybe they could add this...\n\nLoved our server - pleasant and professional.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2013-03-12", "type": "review"}
{"votes": {"funny": 1, "useful": 6, "cool": 4}, "user_id": "SEDFpR4oMPKqXMjbJiMGog", "review_id": "DUJNx2JnWgUIdANEaZ9qfg", "text": "Same great happy hour and food as the central location.  I did not note a difference in the food between both locations.  \nArcadia has a nice outdoor patio, I prefer the tables that sit halfway outside and halfway inside.  See if you can get one when you visit.  Enjoy anything with fig on it. :)", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2013-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HAO-9vGR8ut7A3dIzBMq9Q", "review_id": "GpHoYjzuHPA-9B3Q9E5-TA", "text": "Hands down one if the best restaurants in all of Arizona! Excellent food and atmosphere, Postino will quickly become one of your favorite places!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2014-03-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "PZueFCVEZ_SVui6bRtQMZg", "review_id": "V3nF1RU__BbM7sxSwfl4Qw", "text": "Awesome food and wine! This is my new Tuesday spot for their $20 bottle of wine and board of bruschetta!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2014-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WJXS_n0bxiOAgsCczq-jaA", "review_id": "wShneRCWtXSBRWbUOS04vQ", "text": "Absolutely love this place. Great atmosphere. Nice wine selection too. The servers are very friendly and helpful with recommendations. Plus, their bruschetta is delish!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2014-05-25", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "8-VLDMz0nAV7dm4tFBSGTA", "review_id": "J0MCxQFBgxmYTurjHiNEmQ", "text": "have been there several times and have had good eats. had the butcher block this time...cheeses ok and meats..lots of olives and nuts. to much goat cheese and the bread? what? it was like stale bread...really..just hard dry stale bread...very \ndisappointed in that..asked for fresh..not toasted or stale..they sent out two small pieces...for 16 bucks I think they could do better", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 1, "date": "2015-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fugK_sUNZfU43A2Kv6_Mkw", "review_id": "jBOS1TSZtthhKFHrC_9wEQ", "text": "Best down home, home grown dive bar ever.. The beer is ICE COLD and the wings are THE BEST in this town....Jenny is a fantastic bartender and makes you feel like family from the minute you walk in until you crawl out the door!", "business_id": "qz4ZOcv-840UjfCEYI4qZg", "stars": 5, "date": "2013-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "mqyH3CqjMufsm5FccDrjLA", "review_id": "yJsYYESk6IQt0aj0Vpnw1A", "text": "Its a pretty nondescript dive.  Its basically a hallway, which makes its kind of neat... and there is a big fish tank with weirdly cool fish to stare at.  Otherwise its your typical dive bar atmosphere.  They do have 'fish tank specials' which means that about 10 bottles are lined up in front of the fishies and they are marked pretty cheaply (naturally the price is written in Sharpie on the bottle).  \n\nI wanted to try the 'chocolate vodka' so I basically got a really full glass of straight vodka for $2.50.  Odd drink but lots of alcohol quite inexpensively.  The bartender had to have been high on something.  No complaints though... she was hilarious just to watch.  \n\nI would definitely go back on any dive bar crawl.  - also try Darwins just two doors down!", "business_id": "4vZZjr6IZAk4riT0DB8MbQ", "stars": 3, "date": "2011-05-14", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "XLob3qacnYjxuhhqW6zFGw", "review_id": "VMamLnuD2LXU8YGXyOYSDw", "text": "The two bar tenders I have meet are amazing. Fair price on food and drinks. Fun local place. wish they would bring back poker!!", "business_id": "EUXT1vSFWaiD_BFmFK8rBg", "stars": 4, "date": "2010-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dT5JHk1aJQhOty1kwTitHA", "review_id": "aXCq1WMVKKUbx92cVIVIKg", "text": "Most of the time there is only 1 or 2 servers working, so the service is not that great.  However, I love the Tortilla Club Wrap and their seasoned fries (dipped in chipotle ranch).  Do not order the sliders... they tasted wierd.  It never gets packed.  A lot of the regulars go there for the Off-Track Betting.  During the football season it is a great low key place to watch the game if you don't want to deal with all those loud and obnoxious fans.", "business_id": "F-ykHfGY9lWr12OJ_Ofy7A", "stars": 3, "date": "2012-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EZpRl1sc9XT_Tpn2fk-6mA", "review_id": "v-vwpIH4KwZSE84Pq8nhAA", "text": "I guess as I'm getting older I'm seeing the value in things a little more clearly. I used to really enjoy going out to eat and didn't ever stop to wonder if I was getting a good deal. Lately, though, I've been paying close attention to what all of the foods cost and comparing them to other eating establishments.\n\nMy daughter's school was having a fundraiser at this Chili's last night. It was the kind that they donate a certain percentage of the total bill to the school. We try to help the school whenever we can, so we decided to make it a fun night out with the kids. My daughters enjoyed themselves and saw a few friends, and we all got to relax and let other people do the work.\n\nMy issue with this restaurant, though, and why I gave it two stars, is strictly with the value of the food. I understand that the costs of everything are increasing, so business establishments have to raise their prices accordingly, but they should still be able to offer a decent value.\n\nWe ordered the Southern Smokehouse Bacon Burger for my wife and I to split, and the kids ordered a corn dog and a quesadilla. My wife and I usually split meals because they are so big and calorie-laden, and it helps to keep costs down. Most of the time we leave feeling full and happy. When they brought out our food this evening, though, my half of the burger was tiny! The burger was supposed to contain bacon and onion straws, and according to pictures, was supposed to be packed with them. There was a tiny piece of bacon on my half, and a few scattered onion straws. I looked over to my wife's plate, expecting to see the bulk of the toppings on her burger, but her toppings were as pathetic looking as mine. The size of her half of the burger was not much bigger than mine, either. She said hers was exceptionally greasy and didn't taste how she expected it to taste. This was a little burger to start out with, and splitting it only made it worse. And it was $10.99!!\n\nThe burgers are, like most places, served with french fries. When we split meals at other restaurants, they usually give us both a full portion of fries. I know it's not the healthiest thing to be chomping down, but because we go out to eat so infrequently we don't worry about it. We want to get a pile of fries with our meal. The amount of fries delivered with our meal last night was a joke! My wife had maybe fifteen fries on her plate, and I had about eight. Seriously?! I know this restaurant is in business to make money, so they don't want to give everything away, but how much does an extra handful of fries cost for the few people that are splitting meals.\n\nThe kids meals were, in their opinion, good. The corn dog and celery sticks were quickly devoured, while the quesadilla and oranges were left mostly intact. (typical kids!). I tried a few bites of the quesadilla. It was ok, but was pretty small because of the meager amount of cheese. The kids meals, with the included drink, are $4.99. Not cheap, but not outrageous either.\n\nI like to leave every restaurant feeling that I got a good value for my money. I know that a good restaurant can give me that, while still making a decent profit off of me. When we left last night we looked at our bill and reminded ourselves why we don't go out very often. My wife said that she's going to keep the bill, so that any time she craves this type of food she can look at it and remind herself that we can eat much better and cheaper at home. Or at least at a restaurant that gives us our money's worth.", "business_id": "_BU867oRCLZnDIRmg7S6Wg", "stars": 2, "date": "2014-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "FBzdyEPwug3Pa3xulAy_vQ", "review_id": "H2kDZSpvLAnLxUUpzuHbSQ", "text": "When we were seated, the first thought I had was that the restaurant had a surprisingly excellent sound system with a wonderful selection of moody, bluesy music. Then lo and behold, I realized it was live music! A talented man on a keyboard and a woman with a great voice provided a wonderful background to a memorable evening of dining. \n\nI had the Veal Toscana. If this was not the best veal I have had in my life then it certainly was the best veal in the last 25 years. My husband had Shrimp Risotto and he was enthusiastic it as well. The entrees came with a perfectly dressed salad made with a balsamic vinaigrette that was not the usual dressing overwhelmed by the vinegar. They must have used a white balsamic because it was so subtle. For dessert we had spumoni which came encased in chocolate and was delicious and rich...nothing like my vapid spumoni from my youth in the 50's.\n\nOh we will return for sure!", "business_id": "jq_YnMQjcArdBWuwRospFg", "stars": 5, "date": "2013-04-28", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "hLi9rdbx4cXBklc4osQEJA", "review_id": "YLp7Av41P_E_1WzZXEg5sA", "text": "My wife and I frequent this local bar very often as it is close to home and Happy Hour prices are nicely done..... Always great service.. we usually sit on the patio... great place to go and hang out for a few after work, or on a lazy weekend afternoon.....had the Mediterranean Wrap with Fresh steamed Veggies( don't laugh we're on a fitness program) it was very good for splitting and was fresh and pleasantly tasting... goes to prove you can find healthy food at a local bar lol..............  Been going here off and on for 12 years wont stop!!!", "business_id": "PkBkqQpAoeX3Ogo5HBthQg", "stars": 4, "date": "2013-04-15", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "AnH84g9V10x41CXmCvcaFg", "review_id": "1cVun9kxbbJow-JiyoI_HA", "text": "Wagon Yard is older than dirt. It's been there since forever.... and it is the same now as it was back then. Wagon Yard is the least cowboy-est cowboy steakhouse in Phoenix that i know. It IS like going to Cave Creek before Cave Creek became the annex of North Scottsdale. Prices are cheap, portions are big and the atmosphere is completely unpretentious. I went the first time because i was WAAAAAAAY up on Bell (which was then the north edge of civilization) and most recently, because i had a coupon. It was well worth the stop.", "business_id": "JImJictLIE48_O1z-l2TGw", "stars": 3, "date": "2009-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "aGuFGwngJz4E5fIyjMqrVA", "review_id": "YBmfltkxsg6x682s8uVvNA", "text": "I took my son here for lunch (in order to avoid the sports fans and bar crowd) I was impressed with the variety on their menu and ordered a juicy big burger with a side of fries it was absolutely fantastic, my son had the chili cheese burger it looked mouthwatering and according to my son it was one of the best burgers he's had since we have been in Phoenix.  Service was very friendly and it was a very kick back relaxed atmosphere.", "business_id": "vFJmFFfPVhHkC3bWOeZnNA", "stars": 4, "date": "2008-03-20", "type": "review"}
{"votes": {"funny": 5, "useful": 9, "cool": 9}, "user_id": "ZmIgP4U4Ht9CYmNX0_zP6w", "review_id": "-jgb1KkAEka0dBNOlNjnJQ", "text": "We were out this way yesterday just exploring and when we drove by my daughter said that looking like a good place so we had an early dinner there.  \n\nI like the atmosphere, cool and laid back, very island like.  There is surfing stuff all over and surfing videos on and the staff is friendly and laid back too.  We had great service.  Drinks arrived promptly and we were checked on several times during the meal.  My daughter had an accident with her milkshake and our server brought her another one quickly, napkins to wipe up with, and wet wipes for her sticky hands.  \n\nI had the Baja soft tacos.  They were good but lacking something...I dont know what though.  I had guac, sour cream and salsa too.  They were good but they needed more flavor.  Maybe it was the way the chicken was cooked, I'm not sure.  My daughter had a kid's meal of a hot dog and fries and she ate it all.  I would probably go back and try a burger sometime.\n\nMostly I thought the atmosphere was good, very island ish and I liked it.", "business_id": "hNVcBhJSD5HyLKMf_Z7TaA", "stars": 3, "date": "2009-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "uRn5nJcR0zOxx565u3spxg", "review_id": "KwVFimMNEDiXeWIYe5IErg", "text": "My wife and I went there on Saturday night.  We had good food at reasonable prices.  The atmosphere was a good mixed crowd on average from 25-45, clean cut to lots of tattoos.  Not too much of a biker bar, like  some say.  I would definitely go back. Lots of couples, and groups of women having fun.", "business_id": "-xLwGUmmyKgsTtFOOXzjeg", "stars": 5, "date": "2013-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6S7FlY1wgS3bF-_L_ot80Q", "review_id": "xV68nlBJcJPZbRPFXhFThw", "text": "The burger is really good but I look a lot for service too. Been here three times, first time was a little slow but awesome. Second time I asked for no lettuce or tomato on my burger and the male bartender said \"it comes on the side anyways\". Got my burger with the stuff on it. Third time I went in there the same male bartender walked past me three times without saying a word. I had to get up and walk out. Pretty pathetic to be honest.", "business_id": "VpQZo6KV8CqkIG_MRQ3jiA", "stars": 2, "date": "2015-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DiYvtnPq5vGjKhaPWw7NYg", "review_id": "jxGfKDWdpHXlsz-KnixMBA", "text": "Best little hidden gem of a bar with the most welcoming beautiful spirited smiling bartender, Maggie, that makes you feel like you've been friends forever......even though it's the first time you met. Cheers Maggie!", "business_id": "0d5xLrgemC6jjCe-rofCiw", "stars": 5, "date": "2015-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RGCHoFd5ND46cLtdyJHKjg", "review_id": "iQdEAFPFH_-LBxY-RFPBew", "text": "Great place for sports and wings.  Love the mild wings and season tots. Service was good. Open pretty late which is nice.  Tuesday's special 35¢ wings.  Deal is like a sore dick, you can't beat it!", "business_id": "SgGINtDKQgoXoAnQgrDKDg", "stars": 4, "date": "2014-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_EWi-JBsKcoYNciKYpqq7A", "review_id": "vPU6I9MmWQVRcPgAc1DeOQ", "text": "This is an awesome wine bar with great food, music and atmosphere!  The staff is very friendly and provide great service.  \nAlso a great place for a Saturday date night.  I especially enjoy the wine pairings as part of the wine club with live music outside on the patio.", "business_id": "Our6bzte5W1wlIeOu9luug", "stars": 5, "date": "2014-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BTEBv4eyKPkAdcK9IcdOIw", "review_id": "WR709H5Z7rTiZQi8eJJuhg", "text": "This place was horrible for a last minute drink. Place was empty with a horrible band and couldn't wave a white flag to get service. They close before 2am because the bar tender said so.  Go somewhere else", "business_id": "Lk-FP6yxYRTcU52SaTx2EA", "stars": 1, "date": "2015-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EX0yYHonvP3sNGqUH2Gcww", "review_id": "Yo28DMmlTNPw5HXnH8cEeA", "text": "First time here and it is inspiring to know the chef has been here for over 27 years since 1988.  Bravo! The staff was very welcoming and friendly!", "business_id": "S3FhtwXuiGMlGdBNtmiiSQ", "stars": 5, "date": "2015-03-07", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "nSO_v25XLVwuo1J44Nbkng", "review_id": "azB60yxGJNAfmqAyXlpOjA", "text": "The server was nice but just left us with empty pop for a while.  My wife's chicken bowel...I mean bowl...was no good.  Nothing was seasoned, the chicken wasn't seasoned, the broccoli florets had brown rotten spots on 2 of them and the bowl was room temp.  My fish tacos had room temp. chipotle cream sauce with a dearth of seasoning and the corn tacos were punctured and fell apart.  The bean soup was not charra beans it was soup.  The quesadilla appetizer before it all had about 8 hunks of tomato in the pico de gallo and the cheese was 2 inches away from the edges at parts.  The place was packed because it's in the mall.  I will give 2 stars because the waitress was heartfelt friendly, but the food was anemic.  The hostess did not crack a smile the whole time, I watches as were next to the hostess station.", "business_id": "e0vubCKi8KD8zC2C6FdbuQ", "stars": 2, "date": "2013-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "96WY_yNwV3vTj961yE1n8w", "review_id": "1WC0Lh0M40ncR_nunSPVeA", "text": "Excellant Food , Excellant service from our waitress Amy and GREAT prices!! Wish there was one in the East Valley.  Anytime we are at Desert Ridge we go to the Islands.  But its the worth the trip even from Chandler for a 'treat\".", "business_id": "e0vubCKi8KD8zC2C6FdbuQ", "stars": 5, "date": "2015-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HGCWB7t-fCCYYVVjQXEk3A", "review_id": "jbsYlhOWZlyh8Tj3D0TE5w", "text": "The food is pretty good. \nI have had good service at lunch, but, when I have sat in the bar at 'happy hour', the service has NOT seemed to be very \"happy\".\nWe have gone a few times, and will go only if we have a gift card, or White Chocolate Grill is too packed. It's too bad, because I still think its a good value.", "business_id": "QzXFdjIbFRGhzL83goPPLA", "stars": 3, "date": "2013-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "1mal-cvLhyX8iGEt56_5Dw", "review_id": "quJZfN0McrZVScU5qHdilw", "text": "The hubbie and son are wingholics and this is their favorite place for wings.  \n\nI will say the New Yorker wings are definitely better than San Tan Brewing Co in Chandler, but I prefer Zipps sweet/hot over New Yorker.  The rest of the New Yorker food offerings are okay, nothing to get excited about.\n\nThe Ahwatukee location lost the hubbie and son's business several years ago when their wings were priced differently (higher) than what was on the menu.  The mgr was not willing to honor the menu price, stating wing prices had recently risen and not all the menus were marked or changed, so my hubbie exercised his right to find another New Yorker location.  Since then, Mesa is it since the Chandler/Sun Lakes location has slloooowww service.", "business_id": "G7-NoraGlmzwO0sgs4fbmQ", "stars": 3, "date": "2008-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mICp2bqrAhs-WwX55KieNQ", "review_id": "zxYDJIBLJ7bkvM9CHwmJVw", "text": "Have a great time dancing to the 80's music on Thursday nights.  Great crowd, friendly.  Oh and good food too.  Awesome!", "business_id": "Cp5_NSJFNgylD5SUdmT8nQ", "stars": 5, "date": "2011-05-28", "type": "review"}
{"votes": {"funny": 4, "useful": 0, "cool": 0}, "user_id": "Gr8nyVM_zGY1Zo8PnTj6YA", "review_id": "f8Jm9ZAtvlhIb0dz52Uu6A", "text": "Good place to come and get stabbed,lol. Cheap drinks and full of Native Americans. If you are up to par on your Krav Maga, jiu jitsu and ninja kun foo then you might be safe....might.", "business_id": "hi5xfV28jsGBRWJWoBhDaw", "stars": 2, "date": "2015-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8_kv8ubVgK2LVE_jYRl2UQ", "review_id": "gB45-Q-HiJOQ3WNJl31uXg", "text": "My husband and I usually stop at this chilis when we do go. We usually don't have a bad experience, but today I went with my family and the overall experience was not good. The chips and salsa were great.. But they always are! There were not that many people on this Sunday afternoon but our server was not very attentive.. He was friendly of course but walked by us several times at a decent pace while we had empty drinks. Our food was brought out by someone different who didn't ask us if we needed anything else along with our meal. He walked away relatively quickly but he too was very friendly. Our server never came to our table after the food was served to ask how it was or if we needed anything. We had to get his attention because of course we did have a small request. My chicken was a bit too salty.. And I rarely say that because I love salt! They also had arizonas fox center playing on the tv and speaker.. Then about 25 minutes in we noticed that it was just on repeat? Not sure why but we had to listen to the entire broadcast twice. Then toward the end, a group of employees sat in the booth behind us and started talking relatively loud and cussing.. Now granted I understand I was sitting in one of the booths on the bar side my younger sister, but considering there was no one there.. I felt that it was not necessary to yell. We don't eat at chilis very often but when we do return I will consider a different location.", "business_id": "zARGEdB0JyPCPR0f3FKGxQ", "stars": 2, "date": "2014-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "-f7czNhsEj1Esmmdx3kvVA", "review_id": "J_4XhzDr5tJzMFIpYpNdLQ", "text": "Amazing food super  fast my server was best never got empty drinks and was super busy but did not stop our server I don't remember her name but she was great will be back", "business_id": "zBGfa6Vx4K59v8OR81gzJg", "stars": 5, "date": "2015-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3w-JiPus8k-BR5PQ7egDvQ", "review_id": "yEpVAuz0lXniOzhHA8irog", "text": "6 months ago my grandma had us goto coco's. yuk. So when we came to visit again i told my wife anything but coco's dennys etc... It was funny because we where suggesting chilis and black angus and she would bring up coco' each time. but i told my wife i am done with those type of places. So we got to goto chili's :-) i ordered the memphis dry rub ribs. Ive had them before and i love the flavor. The ribs where kind of dry and i had to rip the meat off the bone. It wasnt as dry as famous daves though. The ribs i got near home at chilis are a 5 but i can only give this one a 4.", "business_id": "cF0k2s8qq7c2qT1yBofuyg", "stars": 4, "date": "2009-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TfDmDCu51hYZkm7pK60Z3w", "review_id": "bycuKQRSUTXC0o9VlHTkDQ", "text": "I haven't been to place in awhile cause I moved out fo the area, I went today and they brought back the fresh wings on their menu, at one time the wings went downhill, but now they are Back !\nGreat Deals on Food $$, and Bartenders are very Cool !", "business_id": "g8ewG8o0ubTUTAUDj7UZLQ", "stars": 5, "date": "2015-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tBvrnSCLSpUdCDm5w5GPkg", "review_id": "OF4cqiyDIFR0HQ9W6JFHDA", "text": "yes I agree! Fellow NY-er here says this restaurant has some of the best NY pizza in town! They also catered my brother's rehearsal dinner and all the food was great. ( sausage and peppers- yummy!)\n\nUpdate-6/25/11 - Walked in last night to catch Steve Benson spinning the CD's and drawing caricatures-hello? Not missing that gig. Me- \"Wow you remodeled the place\"  LIz- the wonderful, superstar waitress- \"Yeah, nine years ago\" -hahahaahahah! PWEEWWT!!!! I guess I have been eating mostly take out or catering from them over the last few years. LOL! The place looks beautiful and the food is outstanding. The owner is from Smithtown, NY and I love her and this place. Manga!\n\nPS- Hello did I mention Steve Benson was there?- Again did I mention Steve Benson does first Friday's there? You can get a caricature done by none other than Steve Benson. Oops, I'm sorry did I mention Steve Benson is there once a month on Fridays Dj'-ing and drawing -(D and D-lol)  Being politically motivated/involved and an executive member of AEA I was in heaven! I love my teacher caricature! Check it out. Fun times!", "business_id": "a9Wk44qJLWoJQT-_H8MB-w", "stars": 4, "date": "2008-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WfHAaldevUCboB51OUxDlA", "review_id": "DL2CvJL5l98v_wqQD01myQ", "text": "Amazing homemade Italian food. I went for happy hour with a group of girls so we got to try a bunch of different items. The salads are so delicious and the lasagna is out of this world!! The waitress said it takes them 8 or 12 hours because everything is made from scratch and wow, you can really tell.", "business_id": "a9Wk44qJLWoJQT-_H8MB-w", "stars": 5, "date": "2015-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8T0evnkvRaTomru7ghPGeg", "review_id": "NJ0XplpmvTnTqqM-cj6veg", "text": "Maybe a 3.5\n\nI have relatively low expectations for chain steakhouses.  For whatever reasons, BAS seems to crank out some pretty good food consistently.\n\nBack in the day (late 70s) the BAS at Alma School and Southern was THE place to eat in Mesa.  Decor has changed from the olden days but I say the food quality has actually improved.  In most cases the veggies (green beans and asparagus in my case) are always good to great.  Only critique here...they haven't yet properly figured how to trim asparagus.\n\nAs for appetizers we always get the fried zucchini.   Very good, not greasy and comes with a great cucumber dipping sauce.\n\nSteaks are good.  To be honest, some night the quality is better than others, but overall its good.\n\nI always order the wedge salad...big enough for two to share.  Since you get two choices of veggies (includes salads) with each meal, I highly recommend a party of two spit a wedge salad and the get three other vegetables.  They usually have good choices and they do do veggies good here.", "business_id": "OjNTZTZ6HYQghJN-3jmwnA", "stars": 3, "date": "2012-05-12", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "OD7nfm02bJDvbz7nsikFsA", "review_id": "3Pa5znCQQrRYDyvMra4jTQ", "text": "A very rare lunch with my husband since he works overnites& sleeps during the day! We got seated right away, orders taken, salad/ breadsticks came right away and special attention to my pop mixed with flavoring!", "business_id": "AOTOKHGbEorQSWr-KVmHZw", "stars": 5, "date": "2012-05-30", "type": "review"}
