{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "go2dZIDfrEBqfsGKnA4m7g", "review_id": "CJAPgHy4aQsjxuGYtUNpmw", "text": "Uggh.  I wanted pho really bad, but theirs tastes like warm ramen broth with 4 little pieces of meat in it.  Got the fried spring rolls, too, and they charged $5-6 for four little rolls that were obviously prepackaged frozen spring rolls.\n\nI gotta stop trying out restaurants without checking Yelp first, because everyone else is dead on.  Avoid this place unless you're in the Strip and absolutely have to have some Vietnamese (and don't care too much about quality).", "business_id": "GQloL8yRHymE0SGZq-B0zQ", "stars": 2, "date": "2009-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "UiKltSF1a2qiSKaAkjJRfg", "review_id": "b629-w24ikLN0JsDk_gy9g", "text": "I'm pretty much a pho expert.  Maybe not certifiable, but pretty close.  I wasn't sure what Tram's would have to offer in terms of authentic pho- but it's the real deal. The rundown:\n\nI ordered two of the pork & shrimp spring rolls- delish!  I've had better peanut sauce, but the rolls were great.   Then I ordered the beef pho.  The broth was incredible- ridiculously hot (temp) with onions, just the way it should be.  The beef was probably too well done for my taste and was cooked all the way through when the soup was brought to me.  But it tasted just fine.  Only complaint was that the basil that came on the side wasn't very fresh. \n\nOverall, it was great. Def going back.... and Tram is a nice guy.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2009-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FhfbS6Ke1_dXUVNN4lWsjA", "review_id": "8Fl1mb-1chup0q8tYGGOBA", "text": "Best spring rolls ever! I could just eat them and be happy...but I enjoy the Pho as well! This place is byob so that makes it even more awesome for me and my friends! If you can't find something to like on this menu then you shouldn't be eating Vietnamese food. Vey laidback restaurant. ..which is perfect for my friends and I!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2013-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "prRoFkx8fgt1X42jTAVhjg", "review_id": "A0fwzesz9_IYUx3RyUKYrg", "text": "Great Pho. Always pleasant staff and consistent quality. Prices are a little steep considering the cuisine, but the location is obviously the reason why. Small dining room, that can be hard to get a group of more than 2 into at peak times. Highly recommended, but if your on a budget split a bowl. Trust me, theres plenty.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2010-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s7ClTbwNu4CXRuU_2HtC3Q", "review_id": "e5SNNaSnT4x8iryPcJg9EA", "text": "Great food. Great service as well. The menu is simple and straightforward, not huge and confusing. I have had a few different items from the menu and all have been delicious. My usual order is the combo beef plus egg roll. My only gripe would be that I wish they were open later for when I get late night cravings.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2013-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NsIoM2PlaL28E-jbrs4Zlw", "review_id": "TinU5Dg9G68VYLrczTFdaA", "text": "Quality bowl of pho!  The soup is a tad bite sweet but still darn good.  The noodles were cooked well and when the bowl of goodness reaches you the beef is still slightly pink.  It isn't overcooked and shriveled up.  The crispy rolls contained a cream cheese shrimp mixture which was really strange.  The spring rolls were ok.  We were the only people there but that may have been because it was dinner and st patty's day.  Pho can be more of lunch meal.  Anyways, service was great.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 4, "date": "2010-03-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "gm-eNehZVMLSydD31cPq4Q", "review_id": "j_gmljofeCZ_WRzQ-c4NpA", "text": "This place rocks, I have been there 10 times and have never been let down.  I always get  #17 with egg noodles (spicy beef noodles), and a #67 (Longyan and sugar cane) to drink.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2008-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wVSGZN8d3ao4ad97kEDzYg", "review_id": "PGmXTjxnLJsCVAzaZJ5iVA", "text": "Hidden gem. No frills, hole in the wall type of place (but pretty clean). The food is simply excellent. Authentic and delicious. Friendly service. I'm really amazed that the prices are so low! I got an order of spring rolls, 2 bowls of pho, 1 entree and a Thai tea for $20!!! Incredible value for the food quality. \n\nI will definitely be back.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2012-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b0B1RMnbjgRPUMIcUcE-0g", "review_id": "8IVccUqAxEiXJ3leh2bvDw", "text": "My favorite place to treat being sick, hungover or just really hungry. The menu is good size without being overwhelming like other places. My personal favorites are the spring rolls, the fresh sliced beef rice noodle pho and the basil fried rice.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-04-30", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "wfvmwhhadHfpM9UoTV0OMA", "review_id": "bo_eoPn_Nixu0wF8HS41-Q", "text": "I couldn't agree with David more.  The owner is definitley an interesting  person.  The more money she thinks you make, the more she will talk to and love you!  So tell her you are RICH!! (Sorry Didi C.) As for the food -  Ho hum VN food at high for what you get prices.  The Pho is very avg and double the usual price. They don't charge a corkage fee for  BYOB which is nice.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 2, "date": "2008-05-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "ngSj5nF9NIVfvzw2pYQe-Q", "review_id": "2pwdCPeNXbNMYQdGUV8sGg", "text": "For those of you who don't Pho-know any better; this is pretentious Pho.  You're paying for the modern orange walls and acrylic chairs.  Stick to Pho Chandler.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 2, "date": "2014-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NewI5TakF8rpbf3qGDDXgg", "review_id": "giR_quz0L9fEp9mfaD__xw", "text": "Good Pho Vegas man! Finally we find a good broth out in Chinatown Las Vegas! This place is pretty good and what drew me to it was the name! Pho Kim Long in Milpitas, CA. is bomb stuff.... so we decided to try and re-energize and recover at Pho Kim Long Las Vegas and it was pretty tasty given the hung over nature of the expedition! Try it out all you looking for a Pho spot in the desert!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2009-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JnLlnfEfbw9c3fHVrkou-Q", "review_id": "I9WMLOV74tBkBgKhPK0nyA", "text": "LMAO! Ok, ok. Got that outta the way. But yes, the name of this place is hilarious, but the food didn't disappoint.\n\nA friend recommended this place for lunch and I was thinking, \"You serious? there are more places to go to in Vegas then a Pho place\" When we arrived and I saw the sign... Pho was the perfect choice. How can you not crave Pho after the name puts a smile on your face? :) \n\nSo now on to the food. I got the spring rolls, which tasted fresh and better than average. Then got my combination pho with rice noodles. The broth tasted really good. Just added a little bit of the hoisin and sriracha sauce to give more kick. Service was also fast. \n\nAnother plus. Open 24hrs!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-03-14", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "8DdcyZR-THOgH60bIyEnfg", "review_id": "yliPmOcgDtcEdHzEz36BRA", "text": "Went there last night with Fellow yelper @Phillipe Gomez.  And the food was stellar once again.  We ordered old reliable #12 Pho, consisting of rare steak and brisket.  And orders of Salt and pepper pork, and a beef cube dish.  And as always the food came out quick and was delicious.\n\nI have been going here since 06 and can say that this place is always up to snuff, after all night of binge drinking this place is great to satisfy your hungers. \n\nhighly recommended go there next time your in Vegas...or ill punch you in the face", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2010-04-28", "type": "review"}
