{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Enzdhh-rV5JgC4lgg0IdFw", "review_id": "H1MyeQeyUw4mm8KU_0Yelw", "text": "Well... as Steak 'n Shake locations go, this isn't the best one around--but it is burgers and fries that are open 24-7.\n\nThe milkshakes are good!\n\nPROS: \nAlways made fresh, when you order;\n\nCONS:\nGreasy (but its burgers);\nTakes longer than typical in drive thru (but that's bc they're made fresh!);\nService (on a scale of 1-10, 10 being awesome) is a 4.", "business_id": "6ilJq_05xRgek_8qUp36-g", "stars": 2, "date": "2011-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "7MwWrJuqft6cMsFAa7KD3Q", "review_id": "MzZh0Rzkb8ta-DKJbdlXYQ", "text": "Best eat n park there is!!!", "business_id": "ORTRrw3ClZ0Ld0LgY1H_5g", "stars": 5, "date": "2012-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WK-7chW-So-IQ3SVdKmF_w", "review_id": "LozVaIhki-0xuzfYuaoAnQ", "text": "This place has gone down hill fast!  The staff makes it feels like you are bothering them when you order.  And 90% of the time your order is wrong.  Such a dissappointment!", "business_id": "1QhIsblyEViEWc53FmxH_Q", "stars": 1, "date": "2013-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "50QOYMmf02QSxZfm2INzsg", "review_id": "zR5c4i9ztbatJMA3-VWL_g", "text": "The guy that helped me was very nice. However for $7 I expect more out of my sandwich. I had the tuna salad, which wasn't bad, but it wasn't great. Honestly I could get a better, less expensive sub at sub station two or Harris teeter.", "business_id": "c9D0yUos-jGOZaUv7SgCFw", "stars": 3, "date": "2012-05-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "tFLi8-M6MOOrY5CsvWHRMA", "review_id": "4qkZa1rb_YmcxWIJAMgsmg", "text": "Decent McDonalds. Definitely better than the one in Houston that I used to go to and wrote a complaint on them for being consistently negligent. I like this one and its a keeper! \n\nPlace - two stories and for the most part, clean.\n\nPrice - it's Mickey D's. \n\nService - somewhat quick in the drive-thru, friendly people. They only forgot once, but it's forgivable.", "business_id": "4kM-mP7z1nP015R2Tlz1Tw", "stars": 4, "date": "2013-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ODvCbkiPRKPdCJiUOYJBVw", "review_id": "x8qWvnbUKqPrWR5ygt8Czg", "text": "OMG - this place just can't get things right! My takeout order was screwed up twice! The first time I got to the car and checked - it was wrong. Went back in, what I could see of the second order of chicken looked right. I got home and emptied the bucket only to discover the wrong, seriously over cooked chicken!!! I called to discuss the issue with the manager. I was very polite to her - and she was as rude and argumentative as she could possibly be to me. I kindly asked for her name so when I go back to get my correct order, I'd know who to ask for. There was dead silence, I asked again and she hung up on me! All she had to do was say sorry about that, just come in and we'll get you taken care of!!! \n\nI had my reservations about stopping at this location tonight. It's been over a year since we've dined here. We quit stopping here because they never got our order right and the service was just awful!!! (Nothing different, except new low level help) Well, I was overly optimistic & gave them another shot. I will not be back!!!", "business_id": "gG7j-FWm_2VFf_lnH8dWOg", "stars": 1, "date": "2015-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LvII_X-ULFlHDfwSkyOdAQ", "review_id": "WXdl0iknn-jKtRju80NYEA", "text": "My first day back enjoying this restaurant     now they have decided to remove themselves from the intimate relationships of Americans.\n\nThe store was clean, employees were efficient and pleasant. What a great experience.", "business_id": "6SWPWj74qF_pEVgDM3-IpA", "stars": 4, "date": "2014-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bOnPXf01T9fGprv_k4KXUw", "review_id": "NiCJMfSz2ZoVI0MrDrFELw", "text": "If you are looking for a place to grab a quick bite in the Gold Hill ~ 160 area, this is one to avoid.  Unless of course, you would like poor customer service and ownership that does not support family values.", "business_id": "7TRoAw7qD95cClWzRrDTuA", "stars": 1, "date": "2009-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YAEjcQr3R5Wp8nrzRxJwFQ", "review_id": "k7YY0QJvsqznH4gmRStw0Q", "text": "Well, my first time was typical mediocre KFC. An inoffensive, pressure-fried chicken meal.  Then I made the bold, yet stupid decision to dine here again. The results of my second experience can only be described as gastric distress probably due to the unsanitary conditions another reviewer mentioned. So, yeah, never again. Not this location. Because if I give them three strikes, it might end up in a stomach pumping.", "business_id": "unMqU0OrlniCOKZIoQHb0A", "stars": 1, "date": "2015-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p4ySEi8PEli0auZGBsy6gA", "review_id": "2CoJC8ANoXuurPBBufiIGw", "text": "It's your standard fat food fare. Nothing great about it besides something quick to satisfy the hunger. Free chicken today courtesy of Oprah.", "business_id": "vdWTm_hVFdt5s8Ca1Xyddw", "stars": 3, "date": "2009-05-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "oihlMiEtvAnUru5_BC1KwQ", "review_id": "KQUwSYfo4mspDSFq7RgCGQ", "text": "I love this place , very close to the library and art museum I frequent. Clean interior and friendly staff.", "business_id": "neGAQFkBNI8-rpPBLBzNkw", "stars": 4, "date": "2013-03-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "zxcrlC3cmH5S2TGIxuLwBw", "review_id": "17fGlVqXUtVapw5kBOqLWQ", "text": "I've never had a hard time at a sonic before, except for this location. They barely speak English, they don't know their own menu, and they messed up my order 2 times. Come on, your job can not be that confusing...", "business_id": "0De3TQ_uSOXwgduKL0va3w", "stars": 1, "date": "2012-03-04", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 0}, "user_id": "A_O8wZOsMTPwyeYA4-Rsow", "review_id": "2v1Ju1j4UFSR-2eWLFM6MQ", "text": "Wendy's new BREAKFAST blows!\n\nI've never been a huge fan of Wendy's food, however seeing their big window sign of their new breakfast sandwiches drew me in.  My God they looked good!  And my God was I disappointed.  \n\nI had a sausage biscuit with a kick ass looking buttermilk bun that was infused with syrup.  The meat was spicy (ala McDonnalds) but the rest was just yucky.  I highly recommend you skip Wendy's for breakfast.  Bummer.", "business_id": "g4Eit1EeeEGhTVik6AWYsA", "stars": 1, "date": "2008-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vDCT5MOkueS32UHzY2d8gA", "review_id": "ONhPeliPk3nLq7nArvrDPg", "text": "Teriyaki chicken (white meat only) and the spicy Dragon chicken are excellent, I would recommend trying one of these two for first timers. Orange chicken is usually above average, all other deep fried entrees are okay. Egg rolls & spring rolls are both very good. Spicy chili side sauce is awesome here.", "business_id": "L19_1cG2ALVjdBQ456h26A", "stars": 5, "date": "2015-03-25", "type": "review"}
{"votes": {"funny": 8, "useful": 5, "cool": 4}, "user_id": "6kmu0mYbdpMIOZ6Y0eVsxg", "review_id": "19XQqiECNXQlwsxFWyqPbQ", "text": "Peanut.\nBuster.\nParfait.\nThe.\nEnd.", "business_id": "AyPmMe8GW6J26NvT_oI88Q", "stars": 3, "date": "2010-05-24", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "rR5W8Bj-IGu6sw1_1v4m7g", "review_id": "vqAEPQFV4i9roFr8IADCFg", "text": "I never thought I'd be reviewing many chain restaurants, but this warrants a review.  \n\nI've always been pretty happy with Chipotle; you know what you're getting. Granted, the ones in CO give you a free drink with a student ID, and they don't seem to do that in NY, PA or AZ, but the food is always pretty much the same, the cashiers run smoothly, and the lines move quickly.\n\nHere? Not so much. We waiting almost 25 minutes standing in line this Sunday, and got maybe half of the food I'm used to getting (I'm a vegetarian; a teaspoon of beans isn't going to give me much protein).  my partners food was the same way, and up and down the line we heard people asking \"um, could you give a little more please\" or \"I'd like a bit more than that, thanks.\"  Same price, less food = sad Shanna. I'm hoping this was a one time thing....I love their salad and their soft tacos, but it's not worth a line that long.", "business_id": "K2_Hmmo5crTYWiT_1sWnfQ", "stars": 3, "date": "2010-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "tVYtLAjfDjUs6yWBZzkCgg", "review_id": "AHXXliYOLl8OFCtVzjHTnQ", "text": "The last two times I ate at this location, they did not have any chicken available. Staff is slow and not interested in providing good customer service. I would definitely hit a different location.", "business_id": "K2_Hmmo5crTYWiT_1sWnfQ", "stars": 2, "date": "2015-05-25", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "SU74tBtwUJR_19r2c7532Q", "review_id": "41awiEJhtK0c8vdCqDEJmQ", "text": "This Pei Wei is consistently good, and this particular location has always been good to me. For a quick meal this is about as good as it gets. Pei Wei is a step above any takeout type Chinese food place, but not quite 5-star restaurant quality. To me, it's about a 4 out of a possible 4 for the type of restaurant they are. The quality is always good, the service is quick, they listen/care, and they'll let you adjust any meal to how you want it...exactly what I expect from any restaurant, but I'm always shocked how many don't do those basic things. The management team here has been excellent as well. If they screw something up, they've offered to give it to me for free, remake it, or just ask me what I want. They do all the basics right, and deliver a quality tasty product.", "business_id": "9Vu9KhK2-kBSM-FXvxXGNg", "stars": 4, "date": "2013-05-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "fsLve5cgM0XZmoNUGj_oXg", "review_id": "E3FtamVzUTnjhKKQ9DghFQ", "text": "I found myself at Pei Wei TWICE in the last 10 days! I normally don't like going to eat much but I couldn't resist after hair their ginger broccoli chicken dish last week. This review isn't really about the food but I love that you can now order sauces on the side and add extra veggies. \n\nI wanted to give a shoutout to JayJay ( I'm not sure if that's his real name as I asked another employee and she said she didnt know his name but everyone calls him JayJay - super short hair and glasses). He was our cashier and super knowledgeable about the everything on the menu. My husband and I asked a lot of questions about sauces, the chicken wrap and so many others. He was super patient! \n\nAnd then we came in again tonight (Tuesday) and I didn't catch her name but she's brunette with a long pony tail and has a tattoo covering her right forearm. I asked her questions about my honey chicken and vegetables and how it was such a small amount compared to last time and she offered to bring more vegetables. What a way to make someone's dining experience even better. Thank you for being so friendly !", "business_id": "PxqufEwqzIHAbQGRdZ3bUw", "stars": 5, "date": "2014-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Qtro4APUHh1wEwnVhciPPQ", "review_id": "uLljbY16UBP2dhLVI-NVDw", "text": "I hate to be a dick. And by that, I mean giving a Taco Bell a poor rating on Yelp. But there are just some things that need to be brought to attention. \n\nThis Taco Bell is extremely close to my house, which makes it an easy stop for a quick lunch or dinner or even snack. Two separate times I've been here come to mind. \n\nOne was late on a Tuesday night, and my boyfriend and I decided to order at the counter and eat in the dining area. In our order, we asked for two sides of their nacho cheese. The young kid at the counter (who was polite) told us that there wasn't any nacho cheese, no big deal. He told us to hold on a minute, went into the back and asked his manager (we could hear him) where she told him just to tell us that we were out. Kind of suspicious..? Just tell them we're out? Huh. Okay. So we sat down, and about two minutes later the kid comes out and says that now they do have nacho cheese. Wow. Miracles do happen. Or, the management staff just made and employee lie to customers. It's called business ethics, people. She could have told him to say \"It'll be ready soon\" or \"Sure we're just making it right now\" but no, he was told to lie. Which is not his fault at all, but is the fault of the management staff. Food that day was nothing to get excited about. It's all Taco Bell and honestly you can't expect much. \n\nThe second time we came here, we went to the drive through and in our order ordered 2 orders of cinnamon twists. We got home, luckily not far away, to find out that the cinnamon twists were shorted from our order. We drove back, and the same kid was at the drive through. He was nice enough to toss in a free cinnamon twist bag. However, when we got home my boyfriend nearly broke a tooth on one of the \"cinnamon twists\" that was actually an uncooked rotini-style pasta noodle covered in the cinnamon sugar. This was the part of the meal that really upset me. Taco Bell does not carry anything remotely close to pasta, meaning that the noodle had to have been placed in there on purpose or by some extremely odd and rare accident... It could have resulted in something extremely dangerous (breaking a tooth), but we were lucky enough that his pain was just temporary. Pictures of the noodle will be posted shortly.", "business_id": "l8v1GHaB4CsryK6MioZ21A", "stars": 2, "date": "2014-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Qp9cHEiGmgTrtkqiX6bHYA", "review_id": "Ii4dzds25uPr0XUV7gyggw", "text": "It is what I have come to expect from Whataburger.  I realize that I may take FOREVER in the drive-thru line, but that is what they normally do. If you are in a hurry you shouldn't go to Whataburger. They start making your food when you order it, therefore it takes a little longer than other fast food burger joints. The taquitos that I had were really hot and tasted great.", "business_id": "vWcUrFcweGXAWsil_pfpjw", "stars": 4, "date": "2011-05-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "oi9xU90Wrc5bJYNcbzx46w", "review_id": "8T1T4yWkrqb3Hq1wyWjF_g", "text": "Tasty! Staff was friendly and helpful... Love to stop by when in the area. We ordered a #1 & #5 combo", "business_id": "GTVneiUeIyRL8Wa_WmEQ0g", "stars": 4, "date": "2014-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HFNUXeI9qvPBEwV2EqUf8w", "review_id": "zkXdDVh3krV8Ltz3MD5gaQ", "text": "Normally okay. Food is sometimes cold/lukewarm with online ordering, even if you show up at the assigned time. Today was a pretty poor experience - cold food, wrong items, no sauces.", "business_id": "ZLiNw_Q36b-u1VFSeEEfsA", "stars": 3, "date": "2015-04-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HXShP6Q-OgEg2sc5lIC_kA", "review_id": "l1Z6wJTZGNTIlGXw08w_Nw", "text": "The food is great when they do it right but otherwise my orders are mostly wrong. I get cold buns and burnt patties and when I ask for ketchup they forget most of the time. I would recommend another in n out.", "business_id": "byFWmwlVSmUj-AmM6NZYvw", "stars": 2, "date": "2013-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "f7Hv9J9GTTXd3XsfRgt3Pw", "review_id": "snsV_AwlNvd-hmmmm4QD3Q", "text": "Sunday almost 3 pm and it took just over three (3) minutes to get two corndogs, large tater tots, and two large fresh fruit slushes.\nService was efficient and young lady was polite too.\nNothing like I had anticipated after reading other reviews.  So hurray for that.", "business_id": "GoEHXcq_nY4jZOx3Ay5gxw", "stars": 4, "date": "2013-05-23", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "JffajLV-Dnn-eGYgdXDxFg", "review_id": "V0skMTMTRkYv7UUuIp4Afw", "text": "I can't believe I'm reviewing a Carls, but here it goes.\n\nI know this is fast food/chain restaurant.  I don't care, cause Carl's is good stuff.  This location is a Green Burrito location, whatever that means, but I think that all it means is that they serve a few Mexican dishes here.\n\nI usually stop here at the drive through, and rarely go into the lobby itself.  I usually order the Carl Star, or as of lately, the Breakfast burger, which is tasty.\n\nIts fast food folks, but in my eyes, anything but McDonalds is okay by me.  I will return for their Breakfast burgers and Carls Star burger any day!", "business_id": "9BOeSWUvmh4rRhpQNgrdqA", "stars": 4, "date": "2009-03-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "9Cni52jqd-PsHuXgBE6uQA", "review_id": "Pb_L4XTo3d1yPnaVCgbcCA", "text": "I love Chick-Fil-A!!! I always get the chicken strip meal. There chicken strips are amazing and the Polynesian sauce is the best dipping sauce. \n\nThis is the closest location to me which is a little sad because that means I have to go into the mall to get it. I can't just go to the mall just for food I have to be there to do some shopping. \n\nThe staff has always been super nice every time I go.", "business_id": "jpgO5Mys3v6LtGk-diudtw", "stars": 5, "date": "2014-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "1DEemiXGFyK-bMK2h_ej4g", "review_id": "QSULwk8oRpZM2tfA9pTP0A", "text": "Horrible Management.  Negative attitude but the staff seem to try.  The Management hates honoring coupons and even told me that on one of my visits and they have giving me issues with my coupon's off their e-club everytime.  It is a waste of time.  I am going to switch my e-club membership to another Schlotzky's.  My little girl is disappointed everytime they have an offer and she is excited and then upset at them when we leave because they give us such a hard time about using them there.", "business_id": "-jBymA8tI-WURtSBcuUdXQ", "stars": 1, "date": "2013-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kW_VVy78nlgOvfdADlhznA", "review_id": "Gc0K7OkVC_B8tJCJmL43Ig", "text": "I went to sonics at 1100pm  on 4/4/15 i ordered a  chili coney it was cold and the cashier couldnt take mutiple forms of payment some cash the rest on debit card.  It probably was to confusing for the cashier.", "business_id": "NBJGZTGMpqK7mfTRcobfVQ", "stars": 1, "date": "2015-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lvbPK_YnKdYKkSnpqQQKUg", "review_id": "VGdG7Jeb8l7_--iakv6ycw", "text": "Asked the guy in the drive through to repeat our order because it was wrong on the screen and we wanted to double check our order, he then seemed to get mad and said I can't take your order the system will be down for 2-4 hours. We asked him to talk to the manager and he then gave us the \"I am the manager\" line. We then went to the cvs next door and watched him give food to the people behind us!! Never been denied business for nicely asking a question! Didn't get the guys name but he was of middle eastern dissent. Went to jack in the box and received great service. No wonder McDonald's is struggling, piss poor service.", "business_id": "z6V7Mb0fjHo_JT3l7dCKsA", "stars": 1, "date": "2015-04-15", "type": "review"}
