{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Zff7xm0J-C7hV1z3j-JipQ", "review_id": "P78h4Ms-VvJjHUXGxvyP0w", "text": "Believe it or not, this whole foods is actually one of the most successful ones. the location is strange, but it's pretty central for most of the yuppier areas of pittsburgh, and it's the only one in the pittsburgh area. Just for that, they get 5 stars.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 5, "date": "2007-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YjgIAjb2mhRVPGb9N4VnKw", "review_id": "xrGS0nQhl7YoOMJGP8RSKw", "text": "I found a bone in a package of in-store made turkey burgers (the tequila lime ones if it matters). Not cool.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 1, "date": "2015-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4Kq16iOJFaUoZEKH17FF7A", "review_id": "FmaVR5QQJcLzzTccKEIN0g", "text": "This is a great co-op. The store is very clean and organized well, with a wide variety of organic, vegan, and vegetarian options on the shelves. There are plenty of bins and dispensers where you can purchase nearly anything imaginable in bulk: rolled oats, trail mix, beans, spices, honey... the list goes on! The produce and prepared foods are very fresh and enticing as well. Though the prices are rather high, the quality of the food here can't be beat. If you want organic, exotic foods in Pittsburgh, this is the place for you.", "business_id": "-iVcmhjfq79QoTWzrb6pKg", "stars": 4, "date": "2013-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_Kj85Jvx1pDkEkfWAiVU-A", "review_id": "WAi8kX2rZ-jmtmbq2yKUHQ", "text": "I'm not sure where the complaints about the staff are coming from? My mom, sister and I went in there this past weekend and found the staff to be quite informative and friendly.  \n\nThis is a killer chocolate emporium.  Looking for that British chocolate from your semester abroad? Here is the place to go.  Needing a faux deviled egg for a chocolate themed picnic, have them in stock.  Looking for some of the more unique flavors in smaller sizes, check.\n\nPrices are high: some bars probably can be found at lower prices elsewhere but the range isn't available.\n\nI'm knocking one star off because the paths in the store are narrow making it hard for people with mobility issues to manuver.  Completely worth the stop if you are in the area.", "business_id": "gFT2yXDXJ1qfuGOSfSU5Bw", "stars": 4, "date": "2012-03-20", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "go2dZIDfrEBqfsGKnA4m7g", "review_id": "B6wh0k0jCLqMQ8v2KzszEQ", "text": "Outstanding place - a real asset for Pittsburgh.  They carry incredible food, but they don't carry the snobby attitudes (or high prices) that usually go along with good food.  Great cheese selection, and the guys at the counter know their stuff.  They're a little gruff, but they're actually really friendly guys.  (Please: don't hold a five minute conversation with them and try 10 cheeses on Saturday when there are 30 people waiting, though.)  The salamis across from the cheese counter are excellent, and this is probably the only place I've been that has 3-4 different brands of anchovy paste.  Their fresh pasta is excellent, too. \n\nOn the note of waiting: there's always a crowd here on Saturday, so grab your cheese number as soon as you get in the door, do the rest of your shopping, then head back to the cheese counter.  Better yet, go after around 3 on Saturday (or pretty much any other day of the week) to avoid the crowds.\n\n\n**P.S.  Don't go sampling 20 cheeses to make up your mind, but ask for a sample of any cheese before you buy it.  I just bought my second pound of \"past due\" blue in a year.  (Two pounds out of probably 6-7 that I've bought in the past year.  And yes, I know most people would think that all blues are \"past due\", but this stuff had the ammonia taste that's the telltale sign that the cheese has gone.)  Still love PennMac, but have a little caution.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2010-05-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "BkBgyvz3vy4NyRRVovcFPA", "review_id": "J0_CaoU8z8Qt4EjH98y6sw", "text": "Yikes, in all of my reviews for my Labor Day trip to the P'burgh, somehow I completely missed this one.  My bad!\n\nSo, this place reminds me of my favorite Italian deli in Baltimore - Trinacria Macaroni Works.  This place is MUCH larger, though, and has a way better selection of everything from pasta to sauces to fish and seafood.  I was VERY impressed by the offerings here - if I lived here on a regular basis, I'd sure be taking advantage of everything that this store has to offer.  \n\nIt was HELLA crowded in here, though.  I had to dodge people constantly in the aisles - it got to be an obstacle course after a while and I left with a huge headache.  But the whole experience was completely worth it.\n\nMy husband and I partook of the baked goods that were for sale outside - a diabetic's nightmare, no doubt, but ohmyGAWD those cannolis.  I loved, loved, loved them.  \n\nNext time we're here, we'll definitely have to stop at the cheese counter.  There was a mob there when we went, and it's no wonder - I see why!\n\nDefinitely coming back on our next visit.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 4, "date": "2015-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "do-fO-EruYVP_FQPMNWmZg", "review_id": "ORtWoaa6zbVOmok969aDXg", "text": "What a treat this location is. I know I have reviewed the downtown location, with only 3 stars, Phillips Place definitely outdoes it. With the food, bakery, and wine selection this store is a true gem. I wandered the aisles to check things out and decided to hit the food bar and ordered the chicken wrap, which was so delicious! And pretty big, I was definitely full! I also love the new wine bar and outside seating area, and I look forward to going back on a nice afternoon early evening.", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 4, "date": "2013-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "A-ccUjBax3iyiBOykZFvTw", "review_id": "9CB62mCajxZmgqtL9jOx-Q", "text": "We've always enjoyed the Mousehouse.  We don't visit as much since we don't drive that way anymore, but that's okay as their prices are a little higher than any of the cheese coops you can visit off the interstate.", "business_id": "jpxlSFhdrtbNyxS6vB036A", "stars": 4, "date": "2013-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 3}, "user_id": "FKRl-IDVExxedNJvy9CCxQ", "review_id": "la-LzlU481_Nzc7dZQ2LlA", "text": "Have you ever walked, biked, or driven (preferably walked or biked!)past Springfield and Wright, seen a sign for something called the Common Ground Food Co-op, and been confused?  If you're like many people I have talked to, you might have been- but you don't have to be!\n\nCommon Ground is a member-owned grocery store carrying many local, specialty, organic, vegan/vegetarian, gluten free, bulk, etc items at reasonable prices.  The selection is comparable to Strawberry Fields, though the store itself is much, much smaller.  When you walk in the door, don't be fooled by the small space.  Common Ground is packed with anything you might need- from toilet paper, to pet food, an impressive bulk selection (bulk nut butter can be good if you are an addict!....just buy a few servings at a time), fresh produce, baked items, and grocery, to name a small chunk.  What's more, many of the items are from local or family-owned businesses.  Sometimes it's nice to know your flour was ground and your asparagus grown close to home instead of shipped in from some unknown place.\n\nJust because this is a Co-op and you have to be a member to shop there, don't think it's some stuffy place to hang out.  The staff are all very friendly and you are welcome to take a look around before deciding to join.  Membership is easy- just fill out a form and pay $30 (individual) or $50 (family) and you're good to go.  If you decide to leave, the fee is completely refundable, too.  Check out the website link for more information.", "business_id": "Q9eZS4qDdJo1ker0w3wnMg", "stars": 5, "date": "2007-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "OazxM5v9i8PQ6NXWQDxCGQ", "review_id": "38SsDF7jEr6aZ-mu-INGAg", "text": "Yeah... this place isn't a restaurant... and until they change the info, people should know that this place is a grocery store.  \n\nThis is one of the best places for Chinese groceries in the area, if not the best.  Though quite small, they house quite a bit of fresh produce, canned and dried goods, and frozen food.  Get your hot pot supplies here!!!  In my mind, this place was far superior to bigger stores like Am Ko, but then again, you can't find any Korean supplies here.\n\nI believe that they typically get their shipments in on Fridays.  Sometimes they even have random seafood products like Littleneck Clams or Blue Crab.  I made it a point not to have Friday classes so that I could stalk out this place in the morning to get fresh stuff to make for the weekend.  This place rocked.", "business_id": "BnHVssX00VthoSNsMVO51g", "stars": 4, "date": "2007-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hjJPKQ1Ah91h3fVbc8GsOg", "review_id": "uyWW1HAIILKaRk7-LDwUTw", "text": "This place makes really, really authentic Mexican food.  It's part restaurant, bakery, and grocery.  I go here for the Burritos.  Big, soft, house made tortilla and filling! I always order green chile, chicken, deep fried.  It's sooo huge, but good!  You can do Enchilada style or plain, option to add your typical toppings like Guac, sour cream, cheese, etc.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 4, "date": "2010-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SU2IZbMDlAhsZwqFe5WWIQ", "review_id": "TeEPYzjDxYZPzvb66iYi9A", "text": "This place is outstanding.  Not in a real good neighborhood but who cares.  The menu is great.  We even get the meat alacarte to go with homemade toritillas and bring home for another dinner.  The price is inexpensive.  Everything taste great. I am from San Diego,CA and this place almost is like I'm at home(Arizona mexican food is not the greatest if you are raised in CA.)  I found my home", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2014-03-17", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "YBbB3I2sjnTWuvPBqDeakA", "review_id": "JNc0m0_uOtj_6y2S5R44og", "text": "Really happy with how the meal I got from this place turned out. I got a banana chip muffin (low fat) and a large coffee (raw sugar had to be requested) and not much could be said about anything wrong with the experience. This was a five star slammer. I loved everything about it and the next time I'm in Phoenix (I live in Los Angeles and work in the entertainment industry) I will definitely be coming back. Thanks A.J.", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 5, "date": "2014-03-22", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "fZk4Mtsb_dGqifrWN1ET7g", "review_id": "3PwDoiz1MxNIMfKlZlj4RA", "text": "Yum!  I am so glad I stopped by today to try this place out.   I was craving a really good, yet simple sandwich today.  As I was driving up Camelback, I remembered how I have passed this place over a thousand times growing up, and it's still there(that has to be a good sign).   When I pulled up I was a little intimidated to go inside because I wanted to eat my food there,  and it looked like there wouldn't be anywhere to sit inside.  But a quick check on Yelp and I discovered they do have seating inside, and someone's review led me to order the Doughboy.  Simple yet AMAZING!  The bread and meat are to die for, so the mayo, bacon, and cheese all warmed up together just hit the spot.  Its one of those meals that you think you can make at home, but for some reason it is just so darn good made by someone else.  Well Cheese and Stuff, you can make my sandwich anytime!   I will be back again and again and again.\n\n*Quick service too.  Got in, ordered, and ate within 12 min.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 5, "date": "2013-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sVYkb6l9Qttbb6mbejBBPQ", "review_id": "CTIqjR9dE7nywJhJBplA-A", "text": "Cactus candy is awesome. I always get some when in Phoenix since it is a very unique treat and always is welcome back home. They use the juice of the prickly pear cactus fruit to make a jellied candy which has a great sweet-tart taste. This location is the factory store which makes all the candies sold all over Arizona. It is very bare bones, but you get wholesale pricing and fresh selection. Staff is friendly and helpful, but do not expect a fancy experience. They are surprisingly convenient to the airport which makes it easy to pick up some before the flight home too!", "business_id": "wxPOlYC155x-RLfk1kVdfw", "stars": 4, "date": "2015-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sALB8-F04S9VcZMF_GkGUA", "review_id": "PQjh83zmKKDgxda_m7YmQA", "text": "Still where I generally go about once a week for a good wine.. a great steak.. and the hard to find gourmet.. I just feel good at Aj's... maybe because it reminds me of all the gourmet shops of home.. LOVE Aj's", "business_id": "jTcLbRCOCnGB4wCgsIYswg", "stars": 4, "date": "2010-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ky9pQ8AKufvZ63IxR41jGg", "review_id": "GfG1XH-XVQW7UBkNr7ypug", "text": "I am always torn when I go to any whole foods.....because I know I am going to always spend more money than I want to. I mean don't get me wrong I don't have any misconceptions that Whole Foods is an Expensive market....however I still get caught up in buying something there. Example being last night when I wanted a bite to eat before heading to the symphony orchestra. This location is offering Turkey meatballs with your choice of a side....sauce....and toppings. So I had the Turkey Meatball plate with mashed potatoes and pesto sauce with mozzarella on top.....mmmmmm....sounds good right? However it cost me 7.99 plus tax....and since my wife had a salad along with 2 drinks we spent about 15 bucks. I absolutely don't like spending 15 bucks at a Grocery Store for a meal....but again that is not new for whole foods...LOL. However the reason I gave this location 3 stars is because the service here is always suspect....I mean you have to ask people for everything in the store.....no seems to want to help you which is very unusual for Whole Foods Markets. Also when I was ordering my food the young lady didn't seem to have any idea what I was talking about or how to make it....thankfully there was someone there to assist her or I think I would've had to make it myself....LOL!!!! Now I don't know if all this madness took place because it was a Saturday or it was during the evening hours etc.....but if they shore this issue up with customer service I may consider bringing my review up a notch. Eat, Drink, and be Merry my Friends!!!!!", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 3, "date": "2013-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "MGs7Aj2e4fGpuEKnMCEg1A", "review_id": "WhVih_m6EuTO4Q1ViEy8LQ", "text": "Dear guy who helped me at the tacos & burritos stand in the food court, \n\nPlease smile more and be more willing to answer your customer's questions. You weren't very pleasant to speak to. That can easily put a turn on someone's day. I'm not even mad you didn't give me the salad, beans and rice that was supposed to come with my 5 taco platter, I didn't want them anyway. But thank you for the free side of guacamole. You're forgiven. \n\nRegardless, I'll always come here when I'm in the mood for authentic Mexican food. It's too good.", "business_id": "iyjEqYqSk-mAya95A9hW8w", "stars": 4, "date": "2015-05-06", "type": "review"}
