{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bvu13GyOUwhEjPum2xjiqQ", "review_id": "5BD-IGsFejqliq8IB2ZlGA", "text": "This tiny pink building might house the best donuts in this city. Be there early because by nine or a little after they shut the doors. I'm not all about those airy donuts that collapse after the first bite.... no, give me a cake donut like those Dunkin' Sticks that Dolly Madison makes! And this place has the BEST cake donuts you'll ever have. Crispy edges and sweet icing that snaps when you take a bite. Dunk that in a cup of french roast coffee and enjoy that flavor! \n\nThey aren't the healthiest breakfast, wait, they aren't healthy at all but sometimes you need to indulge in a little bad food, and what better bad food than a home made donut? Just run an extra mile or so on the morning jog.", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2011-03-21", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "uOOnLYOZV_V6osDsdKckfg", "review_id": "H5neClXCkzoxE22Z95q2Fw", "text": "Solid donut spot, best I've had in Phoenix so far. The fritter was tasty with great apple goodness but it was missing the rich cinnamon taste I'd expect and was super greasy. I would say the grease didn't take away from the taste. The other donuts were good too.\n\nStill on the hunt for a five star donut shop in Phoenix.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 3, "date": "2013-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "PBAqIiakxI1SV2R0lXew4Q", "review_id": "lGgLG-KAtFqQxcp5mnbMzA", "text": "I didn't get in early enough to get a better selection, but they made up the delicious maple bacon ones for me that had been recommended to me. Yum! And they open at 4. By the way. That is 4 AM", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 4, "date": "2015-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j5ZwPTXFIc51TwKE4t5-tQ", "review_id": "NaI_EbyWbiDWt4pTvXaKeQ", "text": "Okay I have just started this yelp thing and found rainbow donuts because of other yelpsters.  This place is awesome.  Delicious light donuts melts in your mouth.  They gave me a warm foot long twist to welcome me.  Worth the journey!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2014-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "FaRO25EYYS_mxLuPeNtkxQ", "review_id": "mEITD7N7YEvy7aiS1z2ZBg", "text": "I really needed some hot chocolate not long ago, it was cold outside and freezing in my office to boot. I ventured to the Dunkin Donuts in hopes to satisfy my craving, I got back to my office and took my first sip only to find that it was so watered down that it was undrinkable. I was seriously disappointed.", "business_id": "YDeM8-M4GwxyymCoV7Y-Tg", "stars": 1, "date": "2014-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zo2PHkxPCVvyo9AoCwCb3g", "review_id": "UE8duTDOy17JkjxyYSF2vQ", "text": "This place is near my school so it's always a good option to swing in to get some breakfast. I usually go for the stuffed one- chocolate stuffed with bavarian cream. YUM! after eating one of those, I can die happy! :) (on a side note- they sell day old dozens for like $5, what a deal!)", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2011-04-20", "type": "review"}
