{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4H-IfBDP5GkfNsQeHi4sHA", "review_id": "OEopG9TyhSyyrTk2Uy5SZA", "text": "My fiancé upgraded his phone at the Apple store, but got a strange text on his new phone about his plan. We went over to the Verizon store to see what was up, and that was about as pleasant as having forks jammed in my eyes. Awful customer service. No one came up to ask us if we needed help. We had to tear a disgruntled man away from looking at his instagram feed to help us. He didn't say there would be a wait or to sit or anything, just said \"okay then\" and left us. So we stood there waiting for help or even just directions for far too long, were ignored and told him we were leaving. Awful awful awful customer service.", "business_id": "HZdLhv6COCleJMo7nPl-RA", "stars": 1, "date": "2015-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "G4A52cjKgW6DfQM1Em_Rnw", "review_id": "sLxye9rdd23sEI3W1se_fw", "text": "This place is bohunk central. Tuxedo jacket fit great. White slim fit shirt looked ridiculous. It was so big that I literally could jump off a skyscraper and land safely. \n\nMy friend got sized and this new guy (super nice) measured his 33 inch waist at 38. He looked really terrible at the wedding and was super depressed about it. His jacket didn't fit and his white shirt was worse than mine. I\n\nThe staff was really nice though. It's not their problem that men's warehouse picks vendors that support a 350 pound male frame. \n\nI hope I never rent a tuxedo from Men's Warehouse again.", "business_id": "DMy5IG-dNrH4ARk96KngEA", "stars": 2, "date": "2015-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_vTM89NXcVydsg3vq7bLrQ", "review_id": "B-E9Bh_ZxZQEZlusMnQYSw", "text": "Pittsburgh store is the worst thrift store I've ever shopped.OVERPRICED!!!!  Very high prices. Backwards policy of accepting cash only. Nasty! Don't waste your time or money!!! THere are much better places to shop for thrift in Pittsburgh!", "business_id": "kKmvSJ6Z8UVPdrnL74bqrg", "stars": 1, "date": "2013-04-17", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "iTmWHtltCtk0Gm55AOxrUA", "review_id": "9I2y9lguQKaAwjtMEdiFrw", "text": "It's amazing!  I'm a thrifter and a film buff but in all the years I've had a Screenie pass to the Regent Square Theater, I've never been here.  I've always been promising myself I'd stop in here sometime.  So f-i-n-a-l-l-y I was able to get my butt in here & do some serious thrifting.\n\nAmbiance Boutique is not like any other thrift store.  They don't sell crap here.  You won't find any Kmart knock off brands.  And if you take a close look at their website, you'll notice they are v-e-r-y picky about what they accept http://www.ambianceboutique.org/html/documents/consignment.pdf http://www.ambianceboutique.org/html/faq.html\nBut this totally benefits the consumer.  You'll find a lot of great high end, gently used brands here.  You'll also find that this store is clean 'n' bright, well organized, and the sales staff here really knows their stuff.\n\nWhat's truly wonderful about Ambiance is it's part of Bethlehem Haven.  Bethlehem Haven is an organization that provides services to homeless women, giving them housing and teaching them life skills in order to be self sufficient.  I'm all about vintage wear, thrifting, and reusing still-viable goods.  And if by doing so I'm supporting a valuable charity, so much the better.\n\nWell the upshot was I didn't quite find what I was looking for.  I wanted some spring and summerwear, particularly sundresses and halter tops.  But I came away with a nice gently used Michael Kors brown leather bag and a sweet men's Polo button down shirt.  No, it's not for Rick.  It's for me!  Hmmmm--might be for me to wear for Rick!", "business_id": "V4rrrgVfAVwCI2737bhLIQ", "stars": 5, "date": "2011-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qWFPbCI-voOsPNjprMakXA", "review_id": "3NBDCjQqy6MOks_LGtqqlA", "text": "Such a shame because this place has so much potential for being a cool little local business. But the owners/managers are the rudest, most disdainful people who seemed almost gleeful for me to leave without purchasing something. I went in to purchase either some classy paper or a unique card to write a note to a homeowner to whom I was considering placing a purchase offer for their house. It's a stationary store, so I didn't think my request was unusual. The products there were outdated, in many cases even dusty, overpriced (which honestly, I would have paid a local business if the product had been unique and quality), and disorganized. I was asked if I needed help, to which I replied yes and explained my situation, and a very curt man stood in a back corner and pointed to various corners of the store and said, \"Look there and there and there and there,\" AND THEN HE WALKED OUT OF THE STORE.\n\nI'll seriously never step foot in Weldin's again, and felt it necessary to post publicly about the experience. Such a shame.\n\nBTW, I found a delightful card next door at CVS. It was made of wood. Very unique. Go figure. ;)", "business_id": "cWe1Xoczmj2vD5h6BOrZYg", "stars": 1, "date": "2014-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "d9AIi3MfIddqYLHXNpEOVQ", "review_id": "sX8V6F3BPUzp6N4-_9wJGw", "text": "I am very impressed with this rug company! Chris helped us choose some runners for our home. We were very impressed with his knowledge and recommendations for our house runners. The pricing was more than fair. I highly recommend Pittsburgh Carpet and encourage anyone in need of carpets for their home to visit them.", "business_id": "utEUlyjd2DjV3T23I8I1wg", "stars": 5, "date": "2015-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Xr7HZfSf_sqg444tv3EOAQ", "review_id": "uEj9e05JGXZMVokKiAHt2A", "text": "They are extremely overpriced.they think there some designer store.who r the profits benefit ing.sale of the day is blue tags 50% off but nothing decent is that tag, the place is a rip off and needs closed down", "business_id": "cKtBFMESwsUWxTv6QjkTGQ", "stars": 2, "date": "2015-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Dt7qvJIOaPY0TRwE2wE-qA", "review_id": "gQ9yHLSTTfZTmweluv5t6w", "text": "Visited Pittsburgh over the Memorial Day weekend.  It was my first time at the Galleria and I found it to be very nice.  It was definitely a higher end mall, very clean and not too large. I enjoyed Anne Taylor, Anthropology, and Restoration Hardware.  Although, I just browsed through those stores.\n\nI did make purchases at Charming Charlies... a favorite store of mine.  I was actually quite surprised to find the inexpensive accessories/clothing store in this mall.  \n\nI also ate lunch at Mitchell's Fish Market and it was delicious.  Highly recommend eating there for lunch, it's not too busy and affordable.\n\nI would come back here to shop.", "business_id": "NaRkccIbBE3gt-3fne_bDA", "stars": 4, "date": "2014-05-28", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "2O9OEcxztb-g2c8HY-nCBw", "review_id": "zD-6JoHx7BnxCCmJ-Dxi3g", "text": "My favorite ! So many designers! Rag &Bone,Carven,Michael Kors,Vince,Narciso Rodriguez,Philip Lim,Alexander Wang,Hanii Y,Jil Sander,etc. AND incredible service from savvy salespeople.", "business_id": "nP7W45S__SYhJWhjgiDgkw", "stars": 5, "date": "2012-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "6yCogImwV4JOTH05gV34pg", "review_id": "qwjzEo5OyTG_ZeRTmM4ohA", "text": "After driving by this place for more years than I will ever admit to, I finally stopped in.\nI'm not sure why I never expected much of this place, but was extremely surprised by the quality of the plants, the variety of selection, and how much they packed into their location.\nI loved seeing a better selection of cacti than what I'd find in Boston, as well as a lot of Alpines and other rock garden type plants that have me wanting to by a little house in Pittsburgh just so I can stop here and do a little garden!!  I'd recommend it.", "business_id": "ucgQhC2-OzxSa1yX1I095g", "stars": 5, "date": "2015-04-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GxhISTU6HjpraWSF81yBEw", "review_id": "4xbEdZuAhjv37cNG-XubtQ", "text": "Belk never seems to have just what I'm looking for, but I was completely under dressed not realizing we could still have 40 degree weather at the end of April...  so I went in to find something to put on over my sleeveless dress.   I really didn't want to spend more that $25, and found a little jean shirt in the juniors department for about that price.  I bought that and a little white top for about $50 altogether.  It was Kohl's quality at Belk prices, but that's just how it is anymore.  \n\nThe reason I'm giving the Belk 4 stars is their employees were all super nice.  The little old lady ringing me up was sweet.  Most of the people at the Clinique counter. however, didn't know what planet they were on   But, the lady who I found there was quick and helpful and got me the makeup I needed. Okay- come to think of it, this is a generous four stars, but I would go back... if I had no other choice.", "business_id": "iUTjkl0PGu5PVCPqKaLc_g", "stars": 4, "date": "2013-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Alv_FoXBScGSZD_eye87yA", "review_id": "gHOuyprMemGyz2bxFw7mOw", "text": "They had one box left for my shoe size, and it only had one shoe. None of the staff knew where the other shoe was, and when I ordered the shoes in-store it took over 6 days for the shoes to even get shipped (for them to get the order to UPS... 6 days).", "business_id": "44sadHB1FUoyCVY_SEFO0w", "stars": 1, "date": "2015-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "n6W18Bfa5m383ZTpRHw17A", "review_id": "bxBws5Xc8ZiQvaHQp-B85Q", "text": "The staff in this store are extremely helpful they take you directly to the item  you\nwant and then ask if you need anything else.  Store is very clean.  Staff are very happy always a smile on their faces.  Store well tocked. prices are comparable to other stores in the area.", "business_id": "VsoLWxAIwAsz08Mc2bkyWA", "stars": 4, "date": "2014-04-16", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 0}, "user_id": "lpZtfD-vCqUER1yGKEvUPw", "review_id": "_LMoNh6Lgdd6srx_-SNIEg", "text": "So here's how it goes...hubs and I have put off framing a sizable Thomas Kinkade print for a long time. Like three years long. We finally took this gorgeous print out of hiding and took it to Fastframe, purchased Yelp deal in hand. Well, errr, in phone.\n\nThe woman who works here is super informed on the framing goods - matte colors, double mattes, types of framing, etc. She's busy yet friendly and definitely guides your choices. And this little shop is filled with options. So many options! Because of this, it took us a little while to come to our decision on colors and frame type. But we got it done!\n\nAnd then it came time to redeem the Yelp deal and pay. The redemption went fine, even though it seemed like they're running a plethora of deals and it was hard to keep track. The final price was much more than I expected, but I'm no framing connoisseur. I personally like to use those dollars by way of clothing! \n\nAt the end of the day, the print looks great. It was well done and nicely put together. Would I have liked to pay less? Sure. Would I have another print or painting framed here? Sure!", "business_id": "m-XMNHUfuniMD3DR4AC_ig", "stars": 3, "date": "2012-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "loeuFUliHkh0kEdLBlPodw", "review_id": "oh9LCLzQ4GlgtXlNCb-Svw", "text": "Biggs is the go-to place in Charlotte for photographers of all skill levels. Staff is knowledgeable, helpful, and eager to understand your needs and fit them with the right solution. Highly Recommend", "business_id": "EQDq4hZ45hDEHaWn6yuZyg", "stars": 5, "date": "2012-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iUeaTKv1LvflA3rP8n4yTw", "review_id": "VvJq8me6RrmYEMY4bvJ8og", "text": "I find myself wondering the racks here at least two times a week. I shop the opposite season of the current one to find the best deals. I don't never leave empty handed ! I will add this: there are no dressing rooms so be prepared! I wear a flip flops, a loose skirt with footless tights and a tank top to slip things on in the sly! :-) my co- workers are in the awe of the deals I find! This is not in the best of neighborhoods but a friendly smile goes a long way.", "business_id": "uAOkzDB-utLw2u-6SNGdlA", "stars": 4, "date": "2012-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lePr71n07wFDi4kuSn3Lyg", "review_id": "cNRlh-cUQoL-zguM5cKogA", "text": "It's close by and not noisy. The minute clinic was very clean.  Those are the only positive notes.  The wait time to check out is absurd.  Usually only one cashier is working and they are slow.  Painfully slow.  My grandma could lap her neighborhood faster than one transaction and my grandmother had a bad heart,  bum hip, and 3 different cancers.  How hard is it to scan all the items in the basket?  This is your job.  If it's in the basket,  SCAN THE THING,  don't stare at it and try to figure out what it is and why the person is buying it. In addition to being slow,  the cashiers I have encountered are rude.  Story time! \nI sent in a photo order online (same day prints). It took this CVS at least 5 days to process the order.  When I arrived to pick them up the line was 4 people long,  so I grabbed a water bottle in the hopes that by the time I wandered back to the front some of those people would be gone.  Oh no,  same lady still at the register.  I waited and waited,  felt a new wrinkle form on my face and finally it was my turn.  After setting down the water, I said,  \"I also have a photo order\".  In the middle of me saying this, the cashier starts walking away and mutters something.   I waited a minute,  assuming he got the last name from my cvs card after he scanned it.  When I looked back over at him he threw up one hand and in a very snappy tone said,  \"NAME?\" Well good grief,  sir! Maybe if you hadn't walked away in the middle of my sentence you would have heard me tell you the name.  Maybe if you hadn't muttered under your breath I could have actually picked up what you were trying to ask me.  \n\nI understand that everyone has bad days. I understand that if you work at CVS you probably hate your job and want to be anywhere but there. That doesn't excuse poor service and a \"screw you\" attitude. I work in the service industry and I'm not foolish enough to take my bad days out on clients, perhaps the CVS staff needs etiquette lessons.", "business_id": "jfJiziKWDjk747jUwNy_aw", "stars": 2, "date": "2015-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GRzDJOxwdIgHW1ohqyQyTA", "review_id": "B4AZdP-v0gpoLAkOr-EGFg", "text": "For a Mall that's closing down and doesn't have any anchor stores left it's ok for what it is- although the mall is dead there are still some specialty shops that one could go to if they really needed something", "business_id": "Qrux6-NnrcbLmAiIOT9APg", "stars": 2, "date": "2009-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "17LPTsu4RgqTZ3SxsGzzxw", "review_id": "Ll7lQXg6XmFcS7ombwvpQw", "text": "I hardly ever read, but there's a book I wanted and there were a million used copies on Amazon. I wanted it right away, and I was flying into Charlotte to drive to Charleston, so I found this great store. They had my book in stock for $5+tax, and they held it for me as I drove over from the airport. Huge store, made me wish I read more. Very nice staff.", "business_id": "1zzOURgQaOiv1Qq-k9lDVw", "stars": 5, "date": "2015-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J0h_oB2VEhMTlcqKmspjWQ", "review_id": "2zB4uxKU-mSHYHSfb4xEvg", "text": "The Duchess of Kohl's has not written a review!?!  Well, I am up for the challenge.  I frequent Kohls because it is a family store.  They have clothing for everyone.  My dilemma is shopping here with my children because they milk me every time.  A good while ago, the store was ransacked every time I visited but in the past year, they have cleaned up their act, literally.  I appreciate that when I go into a dressing room, there are no clothes strewn all over the floor.  They now have hanging racks inside the dressing rooms or right outside of the door.  My compliments to the associates who are tasked with this cumbersome task, since we know that some people are slobs.  Other improvements include having an appropriate number of registers open, and opening more when necessary.  The Customer Service area may have a line after a big sale, but service is fast and efficient, even without a receipt.", "business_id": "o7PnVUZ-QqRLclVtN6qBYg", "stars": 5, "date": "2012-03-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "E1NwenYcQCPAr7yomxl4ug", "review_id": "i2hXbmQ3er_Gd-JzsBG6YQ", "text": "When you hear Banana Republic you think quality clothing store?  At least that's what I think.  However, BR in the mall is a shotty example for quality.  They are anything but quality.  The clothing in the entire Gap Inc. company has declined in quality over the years.  The service, unforutnatly, has also diminished.  The workers at BR, I find, are unfriendly, unpersonable, and not ever around.  Getting a fitting room in that place is a disaster.  I always have to wait for someone to be done using one, so I get to one that is opened.  Nobody is ever back to there to unlock the doors.  I had a problem once with an associate, or who I thought was an associate, and asked to see the manager.  Well, she was the manager.  Totally unacceptable for a store with such clout.  I don't know if all Banana Republics operate this way, but if they do, they will most certainly be losing my business.", "business_id": "xm1RtU63jxjYsm-7dzGaZA", "stars": 2, "date": "2009-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 7, "cool": 0}, "user_id": "X56oMJLUJAmXsHPaYzIxMg", "review_id": "cnXBwBuVL-RbVamh0WElJg", "text": "April 2012 I entered Boston Store in East Town Mall in Madison Wisconsin. I was in the store for about an hour and a half. I decided to try on some dresses & skirts. I went into a dressing room to change. I went to the room furthest from the dressing entry way. While changing my clothes I heard a mans voice.\n\nI frantically search for a way to lock the door, but there is not lock! The door flies open! There is a man standing there looking me up & down, smiling at me! I was trying on dresses so I was completely undressed. I went into shock, screaming you can be in here!! I slammed the door ( which flew back open, no lock or latch) I put a chair in front of it and frantically I got dressed. I came out of the dressing room yelling \"there is a man in the dressing room\"!\n\nThe clerks told him he shouldn't be in there, but weren't that concerned about what just happened to me! The only person who seem to care was a customer, she appeared to be shocked about the situation I left the store in tears.\n\nThe next day I called the manager. She didn't think it was a big deal! I said \"why don't you have locks on the dressing room doors? You could have prevented this horrible situation!\" She had no response to my question. She said she would send me a $50.00 gift card, but I received no apology, how insulting!\n\nCome to find out not a single dressing room in Boston Store East Town, not even lingerie dept has a lock on the door. I believe this is every woman's worst nightmare!\n\nAren't we supposed to feel safe in a store while in a state of undress? I wish it had not happened to me, but it did. I would like to bring awareness to other women. I will always make sure the dressing room has a lock before I enter and undress.\n\nI spoke with store manager several times. I let her know I spend thousand of dollars every year at Boston Store. She didn't seem to care. I asked to speak with upper management, she will not give phone number I gave her mine. To date no one has called.\n\nI feel I was stalked at Boston Store that day. He may have known there were no locks and followed me into dressing room. I feel lucky I was no raped!\n\nI want other women to hear my story and be sure to check dressing rooms for locks. I also want people to hear about the complete lack of compassion/ empathy I received from the store manager who represents this this company.", "business_id": "MHPJoUzvIT4aTKOG2elw3Q", "stars": 1, "date": "2012-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8SdH4-pTC0_-Egmvz_tAhg", "review_id": "ECt093GImozT0vdcNU-q_A", "text": "Took a clock in to get fixed and knew nothing about it.  Very helpful and informative; 3 week turnaround.", "business_id": "pnr2sktG7QWWBut8dRZ27Q", "stars": 5, "date": "2012-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "kg7XG7NmzuY2ULAzTUqlZA", "review_id": "aqXPC21laRJ6NXQiw8ueEQ", "text": "I really don't understand why anyone would go here. The prices are absolutely astronomical!!! Whole Foods gets a bad rap but honestly, the same products are available there for way less money. Take Barbara's cereals-- $6.09 at Metcalfe's. That's right, SIX dollars. For cereal. At WF, the same cereal is $4.99. And then there is the ice cream aisle. One would imagine that this place would carry premium ice cream, being that it kind of touts itself as gourmet. Wrong! It's all garbage. The only semi good brand is Sassy Cow and again, guess what? More than six dollars per container!! The bakery section is gross, too. I'm sure the booze and meats and cheeses are probably great but after seeing what they charge for fairly basic products I am not sure why anyone would go here when WF is 100 percent natural and costs less.", "business_id": "OxR3b_qcMJlzwzGPU5fmdA", "stars": 2, "date": "2012-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e4yeMR57aMBvEIdCuIPFzA", "review_id": "DbeXL2BAdpMRpWTQKJ1q6Q", "text": "Brittany was awesome to work with! She took a bridal bouquet photo that I was in love with, and brought it to life! She also put together beautiful table settings filled with hydrangeas. I recommend this florist for weddings as they were timely with delivery, customer service was stellar, and the flowers were perfect!", "business_id": "iUT5YfK0CzfPHuFbJuO_3A", "stars": 5, "date": "2015-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6pC5j-hfP4xLZB2W0Wi1vg", "review_id": "UvWtCPd1Km_ovwKPdCYWrA", "text": "where else can you find all the parts and pieces for a 9 year old girl to become Albert Einstein?  they carry real theatre makeup here too which is very handy if you ever find yourself needing to go onstage.  just a fun place to wander around and find crazy things for costumes and parties.", "business_id": "8zaahO6vCRqr26E5z-VJ-Q", "stars": 5, "date": "2007-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cGLGAp0IOw-jp8KxxLNzjg", "review_id": "RZsOF6XjxUqboHq7tGOfQA", "text": "We love Furniture Lounge! Scott and Amanda have great stuff at reasonable prices, and it is always fun just to stop in and see what's new. So far we have bought from them: two chairs and end table for the living room, two lounge chairs for my two boys' bedrooms, night stand, fabulous'Carp' standing lamp, a secretary desk, and a wonderful cabinet that we use as a bar.  Plus some perfect sets of wine glasses and drinking glasses.", "business_id": "GpMijrYiLAU0FdOQo9Af_w", "stars": 5, "date": "2014-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5BNI8ukGTlwUI2CCeyjZOw", "review_id": "5RzgSsM6kaWo5CBjajF6sA", "text": "Unlike Chicago and its suburbs, Central Illinois isn't full of nice malls at every corner. With that said, this mall and the surrounding shopping centers are a great addition to Champaign. It's not that common that you can find everything you want from higher end to bargain within the area of a couple square miles. This mall fulfills more of the mid to higher end shopping and is clean and relatively nice inside. While it doesn't really have any of the very high end stores, it will fulfill most people's clothing and beauty product needs.", "business_id": "WwWJLkVOb_ZGdEeY5gtaqA", "stars": 5, "date": "2011-05-17", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "fYG-KkAay8x4YniEz_Uxpg", "review_id": "QJOwo6HLcXcAY8v5Cta28A", "text": "The smoke shack is your typical seedy head shop. It has the typical seedy punk hipsters with the seedy tattoos and oddly-placed piercings set to the background of incense and low-volume punk rock. Once I discovered Evergreen Tobacco across the road, I never went back to the Shack.", "business_id": "ymqyjyFQ-iVPmqfNs82NTg", "stars": 3, "date": "2013-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gS6UnNA3K4XGk9-nQs6FKA", "review_id": "nVTjnw_Wl8LRFmyxYBJkEg", "text": "I love this place! Definitely recommending getting a block. The staff are kind and helpful", "business_id": "I9iYkqmioN8MuWEB9wWxkg", "stars": 5, "date": "2014-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "TBi-83lYEqTIM0pK9EAV-A", "review_id": "57k2rKQuReE-CV7grMb9OQ", "text": "This is a gem of a jewelry store located in downtown Phoenix! The owners and staff are all incredibly friendly, knowledgeable and very attentive. This store has a wonderful atmosphere, a very local and family-owned type of feeling. \n\nThe selection is not as big as a mall jewelry store, however, it is obvious that they know what sells, and carry only that. They have a wide selection of precious gemstones (including sapphires and tanzanite), set in earrings, pendants and rings.\n\nThey also offer a good selection of wedding band sets, and in designs that are both unique and timeless. \n\nIn addition to their fine jewelry they also offer costume and sterling silver jewelry as well as assorted trinkets and home decor. \n\nI came in to have a pin put back into a watch and the service I received was phenomenal! They were able to repair the watch within minutes and at very minimal cost... literally next to nothing! \n\nIt is nice to see a local jewelry store going above and beyond to help their customers! This is what makes a local store so much better than a chain store, and you know that your jewelry is in good hands here. \n\nFinally, they are very low pressure. This is an ideal location to stop in for a cleaning or repair... then you can check out all of their pretty merch! Cannot recommend this jewelry store enough!", "business_id": "YLyEGXEgh1qh8y4kWEsddw", "stars": 5, "date": "2013-05-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "uJmhtw96vwvggofqzJyi4A", "review_id": "CFSFB0i8jF-niOBD2EbCmg", "text": "Is a really clean place. I like the fact is close to a food court and hotels. just walking distance it eliminates the hassle of driving and parking. not to mention is really close to the chase stadium  thats a big plus. The building itself is very clean and fresh. The people that work there are very nice and communicating. I was there for a 3 day training. but it seems like everything is very organized and in good shape. I go for 4 starts just because some minor things but nothing too bad.", "business_id": "k9ef3obSMHzZHC2kReDzHw", "stars": 4, "date": "2015-03-01", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Ovpa3S8xD96dLE5eDxcxJg", "review_id": "q1JSUWjPvO8QO87R71Y3tw", "text": "I've dropped into Modified Arts a few times and always am impressed. \n\nThe first run through was on a First Friday so it was super busy as I had guessed it would be but noticeably different from the other places around it. \n\nIt is a coffee bar fully equipped to take on live music acts. I'm not sure what the status is or if they are even pursuing a liquor license, but if they did get one, that would be one more check mark in the \"sweet\" column.", "business_id": "YRJKTPc7Tkz1cbjGHmOHuw", "stars": 4, "date": "2007-03-14", "type": "review"}
{"votes": {"funny": 1, "useful": 11, "cool": 1}, "user_id": "-hLgaUThLNda5JL2sMHFFw", "review_id": "ZSQ5W9JO6RzLfN2CAbRqZA", "text": "Costco canceled all of my wedding flower orders less than 6 days before my wedding.  After a rather large breakdown a friend and myself started making calls to try and find a florist with the same great prices.  What I found was 100 times better!  Conroy was able to get my order to me, with a lower price than Costco, and the flowers were GORGEOUS.  No wilting, nothing crushed, just perfect flowers in perfect condition.  The customer service was the best I have ever received.  Very helpful and care about their customers.   I will be a customer forever, even just to run by to buy fresh flowers.  I have lived here forever and I am so excited to find such a great store!  Recommend recommend recommend!", "business_id": "Z4VS9F1LFEYFiHLy_az95A", "stars": 5, "date": "2012-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "4awtPy_a90mciUxOVQaENA", "review_id": "3sl65SwiibfhFMNhTXmKIw", "text": "A Blast from the past! We had an office just down the street and found this place to be great for eating in and taking out. A friendly staff is attentive and the food is pretty good. The stuff that litters the walls gives the restaurant character and a unique charm.\n\nOh yeah! And the soda fountain drinks are out of is world!", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 5, "date": "2011-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1tkIFqwM9w-7Ba6pQdPLfA", "review_id": "JwcQ3J7sFNcP_EWcC56igg", "text": "I love this place. Me and my buddy went and got floats one day. Today im leaving the Phoenix art museum. As im passing it I decide to grab a float. I got  orange soda vanilla float. So freaking good. I recommend sitting at the bar. Old school bar stools bolted into the ground. great atmosphere, and you can enjoy a great list part of American culture.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 5, "date": "2014-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "GB19lO2IIA4xkkHnBn26vA", "review_id": "tEUmWbd6_GQP4CQZdRqrPQ", "text": "This is probably the largest silver supply store in the valley. I have been there several times and each time has been the same no matter which employee you get. At the end of your shopping trip you just want to leave ASAP because you feel like you are making them do something they don't want to do, and that comes with a big dose of bad attitude. I have been over charged once and found it before I left, I've  been given the wrong silver item and didn't catch it before I got home and recently I've been given the absolute wrong information (by the owners wife) on a potential product purchase.  Needless to say I'm going to be resupplying my silver stock thru  the internet. This review is based on several trips to the store not just one or two.", "business_id": "0PO74pfETLFUs0AcdvdCdQ", "stars": 2, "date": "2014-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MITc1i9HRyL2sGcy3ss6Cw", "review_id": "nq2PsWphiCsX2pN_w8Jn5w", "text": "This guys are the best , yesterday i drop my iphone to the pool , It got completely wet \nI ran to there store and they told me they will try to fix but they cant guarantee \nI left my phone there for few hours and when i came to pick it it went back to life , my phone works perfect, the amazing part was they didn't charge me for it, Im impressed\nThanks  guys i will highly recommend you", "business_id": "4anyLAWqWVZh5BFpol9czQ", "stars": 5, "date": "2015-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7hCjj2IYk1OSm-Q1Q-uK_A", "review_id": "_GxnmSB0R2d-A2U3dEfdwg", "text": "Ordered a bright, feminine bouquet with roses, Peruvian lilies, and daisies.  Received a sloppy, lopsided bouquet with no roses and no Peruvian lilies.  It looks like they took a mish-mash of leftover flowers, put it together and delivered it.  It was awful.", "business_id": "72INqF4dYTHdCoUoePIuSw", "stars": 1, "date": "2014-03-09", "type": "review"}
{"votes": {"funny": 10, "useful": 7, "cool": 1}, "user_id": "c7xefzxCtr0ebCL6VR2t7Q", "review_id": "xrk1AgG98aHd6xDGJ3_EIw", "text": "I don't know what it is about bike shops that turn people into snobby, elitist douchenozzles. Is it because you're a grown man and your greatest skill is building a 29-inch wheel set?\n\nI own 6 bikes, and I'll be the first to admit that I am mechanically retarded. I can't even clean the chain without knocking the whole damn gearing system out of alignment. So I've been to every bike shop in town. There's one (rhymes with Smandis) that I won't set foot in because the guys who work there will laugh right in your face for requesting minor repairs.\n\nAt Slippery Pig, you never know what to expect because you get a different bearded guy each time. Seriously, is facial hair required to work here?\n\nMy first experience with the Pig was trying to buy a high-end mountain bike. The owner (King of the Beards?) spent nearly an hour with me describing the models they carried. He convinced me I wanted to buy an Ellsworth Evolution despite that their silly graffiti-style branding makes them look like bikes for skateboarders. Well, I'm not paying $5,000 for a bike without test-riding it first. So I put my name down to take their demo for a spin. In the following weeks, I went back into that shop 3 times and the Ellsworth was never there; at one point, a Beard told me it belonged to the owner and I had to get his permission to ride it. Yeh, dude, I did that. We spent an hour talking.\n\nI ended up buying a Pivot Mach 429 at another store, and I ain't never been happier. Their loss.\n\nBut back to the Pig. I also own an old hand-me-down Bianchi road bike that I use for getting around town (two wheels are better than four, people). When the chain seized on me today, I stopped by the Pig on the way home for some help. One of the Beards actually snarled at me, rolled his eyes, and mumbled something about it's not supposed to be set up this way. \n\nReally, because your man with the beard right behind you set it up like this a few weeks ago.", "business_id": "42Ai9wcFPE2HZ_aADGXI9Q", "stars": 2, "date": "2012-04-11", "type": "review"}
{"votes": {"funny": 3, "useful": 0, "cool": 0}, "user_id": "K46kUag6aS0Vd4JjiaqNsQ", "review_id": "WdG3GZ_ZGe7fYVyf9eyKAw", "text": "Friendly and helpful. But beware a homeless lady lives in the womens bathroom, they say they know shes there. She has a shopping cart there with all her stuff. Shes friendly, but she was hanging out in the only stall eating popcorn when I had to pee.", "business_id": "HfWkdqxegjiGEXzI8j7Wwg", "stars": 3, "date": "2011-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wUXSmppXrGdztyKwz5b_Ng", "review_id": "2NwD6U0bnBoTYKFYTJn4Jw", "text": "They delivered in just a few hours, with no problems, and I have to say for the quite reasonable cost sent one of the most beautiful displays I've seen from any florist.", "business_id": "imSAkSzL5X1rUc3Z1ZMYeA", "stars": 5, "date": "2015-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "7BN7AlivcLdUAHU3r7nOaQ", "review_id": "BtXMy0UBY10r8-647F0-Jg", "text": "Great, well stocked shop with helpful, friendly staff. They have so much backstock, it's inconceivable to leave empty handed. I love this store and visit as often as possible.", "business_id": "y9cQ0DBC0qFNgkpTXHzokA", "stars": 5, "date": "2014-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q2v31LSKFo79sdtXsYM8aQ", "review_id": "afBCf8pNxXbkGF_03jt6Dg", "text": "Without a doubt, the friendliest and most helpful people working in sales anywhere! \nALL of my experiences here, make me pity those that have abandoned \"brick & mortar\", local businesses, to save two or six dollars. Go ahead and spin that roulette wheel of Internet sales, maybe you will come out unscathed, or chances are, quite screwed over. Good luck with your internet customer service ( 1-800-...?). Keep your money local, you can have your purchase TODAY - with no regrets. Bad Kharma comes to those soulless folk who would waste a salespersons time, only to buy on the Internet. You get what you pay for( literally).", "business_id": "VilxIfmahfOhMcIaGK8Www", "stars": 5, "date": "2015-05-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lXMX5mZ6LzNkXiE4ozBIqg", "review_id": "yPKROnqYGftuOWpM3wM3Ww", "text": "Wow, after going through a horrible situation at another optimologist (3 tries and could still not get glasses right!!!) I came to Central Phoenix Eye Care through Yelp. My appointment was within a couple of days which was great because I was desperate. The tech and Dr Mastores were informative and thorough which I grealty appreciate. My glasses eneded up being costly but they are wonderful. The eyeglass guy was full of information helping me to make the right choices. Great place~I am here to stay!", "business_id": "gztTQsgq6FJwIoV4P4RNIw", "stars": 5, "date": "2013-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DrPOgnV9F077zbW-bD7jdw", "review_id": "oFGUmxtWLN65mICzRNtHeQ", "text": "It's a nice place.  Easy to find. There's a sign out front that says parking is in the back, but I wasn't so sure about where 'the back' was.  So I circled around and got spot in the lot just up the street.  The shop is bigger than it looks on the outside.  Big selection- neat and organized.  I came for a specific item which was easy to locate.  The guy who worked the register was great.  He saw that I was wearing a superman t-shirt and suggested that I pick up the new DC series.  I've lived in Phoenix for a little less than 6 months, and I usually get my comics from Ash in Tempe since it's closer to my work.  But I'll definitely be coming back here.", "business_id": "HgoYXFi_R2LbzYUDsa79Sw", "stars": 5, "date": "2014-05-19", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 0}, "user_id": "IdcwNulMu2xQN8JDvm67SA", "review_id": "PzRVfALuoVi-ztYPqW_8Vg", "text": "Wow- I honestly cannot believe what happened to me at this place. I purchased 2 bikes and 2 locks about 3 weeks earlier, and the gentleman who helped me then was great. About 2 weeks later, one of the tumblers in the lock fell apart. I took the lock back in, with the receipt, and the owner (?) basically said that the lock must have been tampered with, and he wouldn't let me exchange a $20 lock after spending over $800.....really? He was basically calling me a liar, and when I tried to explain that it would be good customer service to exchange the crappy lock, he stepped up really close in my face, and said \"don't tell me about customer service!\" Wow! Obviously someone needs to tell him because he hasn't got a clue. He could not have handled the situation worse than he did. There are so many great bike shops in Phoenix that thankfully I will never have to support those thugs ever again. I would suggest that, unless you like buying defective merchandise with no exchanges allowed, to avoid this place and support local establishments who actually care about their customers.", "business_id": "jYyfLGMURG2pQ6k80R4eZA", "stars": 1, "date": "2012-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "c6ChRQMx5T2xmTXJLnru-Q", "review_id": "426MEc0yPW4ihZXaWgMKRA", "text": "I spend hours in SAS every month. The selection is crazy, you have to really look through things, because this is not a traditional; fabric/craft store. It's an overrun and slightly damaged store. So if you go in knowing this, take your time and look through what you are getting, you can get some amazing deals. I made 6 maxi skirts for my daughter for about $12. This is also a quilters dream paradise. tables full of quilting fabrics in small sections so you can pick up some great pieces.", "business_id": "nbO0X6SNrZWOoDQS3WQCPw", "stars": 5, "date": "2015-04-10", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "2A1_Thu5gkicZkfltQCXWQ", "review_id": "goqtAdQtEhky4fJy1OnErQ", "text": "This is the coolest place in the valley.They have the best variety if you are a hiphop head, hippy, or headbanger they have the gear for you. It's like First Friday everdyday in this store. If you decide to sell anything make sure you are patient and just enjoy the view.", "business_id": "JmEp4DxBEIrFD-rgbL8bvQ", "stars": 5, "date": "2014-05-06", "type": "review"}
{"votes": {"funny": 4, "useful": 6, "cool": 4}, "user_id": "PoQOIZc2q5nud7uVz_jdjw", "review_id": "QYYmK3ZHFEMvcZYSi04kUA", "text": "I went into this Michael's with two items to return. I noticed that there was only one cashier and a line 5 people deep, but luckily there was an employee behind the service desk. As I stood waiting to talk with her I realized the people she was talking to were not customers but two other employees, and the three of them were bitching about a customer who had wanted to make a return and how annoying she had been. Then one of them (Nancy) noticed me standing there, turns around and says to me \"you're making a return? you can get in the regular line.\" seriously? did you really just suggest that your conversation is so much more critical than helping a customer that I should go wait in another line? that's very interesting Nancy, thanks. Meanwhile the other two don't even look at me, including the one manning the service desk. what the hell?!\n\nI walk over to the one open register and wait for about 15 minutes while this one cashier works through all the people ahead of me. And I kid you not, when I was one person away from freedom, Nancy noticed that there were 3 people behind me, opened up a register and told the woman BEHIND ME to come over. \n\nFrankly I think all three of those employees should be fired for wasting Michael's and my time while getting paid. I'm sure they make crap pay but that is no excuse for flagrant laziness. It has cost Michael's my business.", "business_id": "GrGHVKec258eN1_gtJwS1w", "stars": 1, "date": "2009-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0TuOVaf4sM11UUbqGRL-4A", "review_id": "QfUzaYv_fat9BbrxCEyg4Q", "text": "I love, love, love this place! If I had lots of money to spend I would have my whole house done in world market products! All their products are so unique! The layout is very nice and the people are super friendly and helpful! I just have to say it once more I love this place and could spend hours here.", "business_id": "u8bQvtkVa5lW-SNwRLH6Vg", "stars": 5, "date": "2012-04-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "c-hv-FImXaBssSnfbxdOrQ", "review_id": "BtLUSNgimC-yCqjB5VeHYQ", "text": "A great place to find deals on good clothes. This location is not as organized - or clean - as some others, but it is decent and has awesome deals. I have no issues shopping here.", "business_id": "5A_vuyESZFU9eCArpVfJCw", "stars": 3, "date": "2013-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LybdJYd8EdLlXlCRxdB_hA", "review_id": "x1sQ-SXIG0urGklZQETOxA", "text": "They have an uncompetitive, unfriendly return policy.\nI bought the GOgroove Bluegate bluetooth wireless receiver. This (theoretically) allows me to connect my smartphone to my car stereo through the aux... The only reason that I chose this specific model is that it was the only product of its type that is carried at this store. Turns out that it connects very poorly and had consistent static. I ended up buying a different brand/model on Amazon which works correctly. \nI don't live close to the store so it took me a couple weeks to get back there to return it. Turns out, they have a 15 day return policy and wouldn't give a refund even though the product wasn't used nor defective, just crappy.\nAmazon, Target, Walmart, and most other retailers would have given me a refund, no questions asked.\nI won't take a risk buying from Best Buy again.", "business_id": "kEqcAtMaC6hcY8Wbi1nxtA", "stars": 1, "date": "2015-03-11", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "2677wL-5kUX0cRMO7VzpjA", "review_id": "Ph4YRda5_xr1wcfJs3ntlw", "text": "Open 24 hours - only thing that rates a star; pharmacists lack customer service, time management, and efficiency skills", "business_id": "h-Ospc-uiMH8TLquTeAr3A", "stars": 1, "date": "2013-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zMhkzu9VXFULKQ8YCCsDVQ", "review_id": "PdXr-jjXyAmN2KhXgSW0Bg", "text": "Great service.  No pressure. Honest and reasonable pricing. Why would anyone ever go to a chain location?  This place is great,", "business_id": "xaWje-dMVpAEQQMKv9556Q", "stars": 5, "date": "2013-05-12", "type": "review"}
{"votes": {"funny": 4, "useful": 4, "cool": 3}, "user_id": "zqnAdayPsak5dbLF2gEvNw", "review_id": "nhDKABOmycmfaPRhgCw8ug", "text": "My experience here was.....ok.  The guy at the counter was friendly enough (although not overly talkative).  I had called previously to inquire about upgrading my old blackberry to the new iphone 4.  They had them in stock, and the guy told me he'd set one aside and i could come in and pick it up after work.  I had originally planned to just order one online (I was due for an upgrade), but didn't want to wait for it to arrive by mail....instant gratification was key.  \n\nSo i went to the store, but had already researched what type of service and features I wanted to include.  I told the guy that I wanted to add Rhapsody, but asked him if he could explain how it worked first (for those that don't know, it's supposed to be a $10/month music download program - unlimited tunes).  He was quick to state \"oh, that's not available on the iphone\"....confused, I asked why it was offered in the package online then.  He was adamant that it was not a feature available to the iphone, until I asked him to research it.....Whaddaya know. It WAS available.  He said nothing and we moved on.  Next, he asked if I wanted insurance.  I said no, but i wanted the extended warranty for $1.99/month.  He stated again \"that's not available with this phone\".  AGAIN, i asked why it was offered online.  He said it probably wouldn't have let me check out with it.....and then clicked a little button, and low and behold...it let him add the extended warranty.  I then informed him that I wanted to reduce my minutes from 900 to 450, since i have not gone over the 450 in over 6 months....He looked at my account and said that i should absolutely stay with the 900 minutes because I would definitely go over.  Mind you, I had just checked my account earlier in the day, so I knew where I stood.  He told me that I was already at 380 minutes, and I would have to pay extra for any minutes I went over.  I looked at him for a minute....then told him that since my cycle restarted tomorrow,...I was clearly still going to be ok.  He said nothing and kept going.  He then asked me if I wanted to look at cases and I said no because I had already found a specialty one online that I planned to order.  He stated that I should definitely look at their selection first, because they had a ton to choose from and could probably get me discount.  So I said ok and he walked me over to their turnstile....with a total of 8 choices (and three of them were variations of black).  When I asked what the discount was, he said he could get me a discount....if i bought a package that included about 5 other things that i didnt even need or want.....\n\nOverall, he was nice and I got the phone and plan i wanted....but only because I had researched it myself.  Don't expect them to know what they're talking about, and go prepared!", "business_id": "fN-ISSf1Ic68B2kDNek_uQ", "stars": 3, "date": "2011-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_X1zedRYJt_pf7fosmForA", "review_id": "Vruh35viP4g4OhZdIzs6Cw", "text": "Fastframe did a great job on two of my Samuri pictures that I've had for years. They are friendly and had the work done ahead of time. I will use them again, thank you.", "business_id": "BtIDzuUOqI0h6VYy4HhUOQ", "stars": 5, "date": "2015-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XVPsO38A264mcOApUJ08eQ", "review_id": "D1cegAYLV6lAtXJ3helLfw", "text": "Even though I live in Mesa, I've stopped here several times because it's on my way home from my mom's house. I have to say ditto to most of the other reviews.  The customer service is top notch, so refreshing for this day and age. Not to particularly bash WalMart, but it is nearly impossible to get any kind of service there. I would rather pay a bit more for the pleasure of shopping at Howard's. When I ask about an item, they don't just point, but escort me there and answer in detail any question I have. Also, they so graciously accepted a return of an item I purchase at an Ace store in Tempe, no questions asked.  And, their hours are more extended that any other Ace I've been to, even on Sunday they were open until at least 8:00pm which is when I stopped by.", "business_id": "ZDlA4SPGz-fs_mjE6wVWnQ", "stars": 5, "date": "2015-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_fRCfwCzY5uLZNf-qJHGhQ", "review_id": "Qdy142JcB65mc6vplb7LcA", "text": "Mixed experiences here. Staff is mostly disinterested, but some are helpful. I would question some of their knowledge about skis and equipment. A guy named Justin seems the most knowledgeable of all. The last tune they did on my skis was so bad I had to take them to another shop near the ski resort to have de-tuned to make them ski-able again! On the positive side, great selection of stuff and prices seem quite reasonable.", "business_id": "zzucnDH33KlmbkI4rLyQTA", "stars": 2, "date": "2010-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "sN-jIj63-vtYm80Ng9vaLQ", "review_id": "ectfec77HcSaFLeMtgnsUw", "text": "If I could give more than 5 stars, I would!!!  I called for a jewelry appraisal for insurance purposes and spoke to Shane who was more than helpful and very professional.  He quoted me a fair price for three rings and had them cleaned as well.  I had also brought in a ring that I purchased aboard a cruise ship and he had to deliver the bad news that the stones were not the quality I had been told (another story).....We had a very nice, albeit not so fun conversation, about how to handle that situation.\n\nI came back the next day to pick up my rings and appraisals.  He was very personable and explained each appraisal to me.  He also told me to come back in three to six months to have my rings cleaned free of charge and said that no jeweler should charge me for that service.\n\nI will definitely be back and would highly recommend them to all my friends.  I had mentioned that I had a jeweler that I loved and trusted in CA before we moved here to AZ seven years ago, but hadn't found one here.  I have now!", "business_id": "PaBjO5u25govLw1m8pI9Hg", "stars": 5, "date": "2014-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "6fboUxwhAsUMx1F9yCzlMQ", "review_id": "ut5S4Pnaeyda1tJNhGiDIA", "text": "Framin' Works rocks!\n\nI was given a beautiful photo print as a gift and I quickly realized it needed a professional framing job.  I did a bit of hunting for a quality frame shop and found Framin' Works.  I stopped in with my print and was greeted by Alan.  He was extremely friendly and helpful.  We had a frame and mat picked out in no time and I left the print in his capable hands.  Upon my return to pick up the finished product I was extremely pleased with the quality of their work.  So pleased that I brought in a couple other small prints that had been packed away for years to be properly matted and framed as well.  Once again, Alan and Neil helped me make excellent framing and mat choices that really show off each piece.  I just picked them up a few days ago and they look fabulous. \n\nProfessional framing done right is totally worth it.  The folks at Framin' Works really know what they are doing technically and they have a great eye for what will make your piece of art really pop.  Not to mention that I am always happy to support awesome local businesses.", "business_id": "rlApP8IHKEW8eERHhZpdOg", "stars": 5, "date": "2013-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DBCgOkxxF3AhSKDAqQcR7g", "review_id": "E-M1LZdacXLBCU0f0H9eEQ", "text": "What can I say? I picked a receiver, they installed it, it's great. This was one of my first times shopping for electronics at a real, local store (I am a fan of bargain hunting on the internets, where i don't have to interact with real live salespeople). Yes, I could have bought the same receiver online for less, but I'm glad I went to these guys instead. They didn't try to sell me something more expensive or a bunch of other crap I didn't want. Plus, purchasing from them meant that installation was only $30 including parts and labor.", "business_id": "xI_iG7X6BcdLtj57bkUOqQ", "stars": 5, "date": "2009-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZP20a41dAYlbHGrFjXndXg", "review_id": "Ba_JjJweGBjNR2Vj84GAWg", "text": "This place is going out of business. I have taken advantage of the 50% to 60% off on books.", "business_id": "N_TlJCR5AkZhmrCDqbm2tQ", "stars": 4, "date": "2011-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "stqLEv-IbdvLWgMS2OZa2g", "review_id": "PrvRVIU5pW1Kopx6j2Sb5w", "text": "Apple/Mac RULES!!.....PCs are BOAT ANCHORS!!\nThese stores are great. I love the layout and ease of use. I've owned ipods, iphone, Macbook pros, Imacs, etc. Any problems I ever encounter with their products are always taken care of with genius bar appointments!! Also, I always buy Applecare. It is worth the extra money when you need it. Although lately... I must say I am currently having a sleep problem (not disabled) with my macbook pro that they aren't able to pinpoint just yet. Hopefully, they will soon get it fixed. It's under Applecare for another year so I am not that concerned. Apple has never let me down. I am not an Apple schill. I just give credit where credit is due.", "business_id": "l5vzFaqSjvxZiRn0MJeKkg", "stars": 5, "date": "2009-04-30", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 4}, "user_id": "0GV2SSx25-DpyMyE_Yk1rg", "review_id": "Aw_zKi2UJrWRADtRhmo7Vw", "text": "5 Star service at Apple at the Biltmore store! Had a minor glitch with my lap top and a question about 6S iphone and was amazed at the gal who helped me. Her customer service was simply outstanding and helpful. This is why APPLE is one of the best customer service company's out there AND IT SHOWS!\n\n\nYou get the FRANK BOOTH thumbs up award!", "business_id": "l5vzFaqSjvxZiRn0MJeKkg", "stars": 5, "date": "2015-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iZtveTtgf6ZMd6Ym2HK8Ig", "review_id": "vfxGV1q_rcaSgHFUS90vNg", "text": "WHOA!  I felt so taken care of at this Home Depot!! :)\n\nThe Boy asked me to stop and pick up 2 gallons of paint on my way home because he'd run out.  As soon as I got to the paint aisle and had a gallon in each hand, he called and asked that I actually buy 5 gallons of paint - better to have too much than run out again. :) Not even thinking about it, I put my 2 gallons back, grabbed the handle of a 5 gallon bucket of paint, and started walking down the aisle to get it tinted.  I didn't get very far before I realized how heavy the stupid thing was and wondered how I would make it all the way to the car, let alone get it more than 3 inches off the ground and IN to the car.  Just then, Friendly Guy #1 from the paint section came down the aisle and asked if I needed help.  YES PLEASE!  He carried the bucket to the tinting area and I went off in search of a cart.  Once my paint was ready, Friendly Guy #1 loaded it onto my cart, told me to have a nice day, and off I went to check out.\n\nAs I pushed my cart to the check out, I slowed by the self-checkout lanes - wondering if I could scan the bucket without having to lift it.  Friendly Guy #2 running the self-checkout area spotted me and said, \"Let me help you!\" He motioned to one of the registers and then scanned it with his scanner.  Voila!  Then Friendly Guy #2 told me to have a nice day, and I was off!  I was pretty stoked at this point because now all I had to do was get it in the car! :)\n\nEnter Friendly Guy #3.  The second I walked out the door, before I even got my sunglasses on, Friendly Guy #3 spots me and offers to help load the paint into my car.  He helped pull the cart to my car and loaded it up for me.  Then HE told me to have a nice day and off he went (returning my empty cart for me).  \n\nThanks to The Boy, I frequent a lot of different Home Depots and Lowe's locations.  I'm usually not impressed with their customer service because, let's face it - they're guys helping guys...conversations are stereotypically short and to the point with very few niceties.  The 3 (count them - 3) guys that helped me today were nothing but genuinely friendly.  I would gladly go back without The Boy in tow and feel comfortable knowing at least some of their guys are the good ones there and actually want to help me. :)  (Wish I'd caught their names....I think I was just too busy counting my lucky stars that I didn't have to lift that stupid bucket....)", "business_id": "DC77ROlgfnpxQNFKQbbpnw", "stars": 5, "date": "2013-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ZKuevUayT2eqkGNrJm2nAg", "review_id": "wpBwrx7YjcU8J8wHIjwtQw", "text": "I've heard good things about Tuesday Mornings so I decided to give it a try. \n\nIt felt like a smaller cramped version of Last Chance with more housewares than clothing. And I am not a fan of Last Chance.\n\nI was really hoping to like this store....but nothing thrilled me at all. A lot of stuff seemed damaged and the prices weren't all that great. Don't know if I'm just cheap or don't shop at high-end stores that much but when I look at a price tag and actually utter the phrase, \"THAT'S a clearance price?!!!!!!!!!!!!!!!!!!!!!!!!\", it isn't good.\n\nProbably won't be heading back. \n\n(Is the problem that I went on a Friday afternoon instead of a Tuesday morning?) (Just asking.....)", "business_id": "FcO0jgGVt2e3iJbGJT7blg", "stars": 2, "date": "2009-05-29", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "3lPOjxZ08f8VyXGIDqCyHg", "review_id": "hVuPjzS7z1x1t0m5spFMyw", "text": "Went to pick up a bouquet for my sister in law. As I was getting my son out of the car, he runs for a corvette parked a few spots over (a seriously rad looking one too). The owner comes out screaming \"you can't park here\" and tells us to leave. I suppose he thought we were headed to the bar next door. I was about to tell him we were there to buy flowers, but he was so rude we just left instead.", "business_id": "q0aEHYyFzuiazt8qk_2S5A", "stars": 1, "date": "2012-04-18", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "s9rONiyCuf9t5zL5PHs4wA", "review_id": "j5FAzA_C6jG5eAUN1h7IGA", "text": "This is a wonderful nursery with a good selection of desert plants, roses, shrubs, and delicate plants which need to be grown indoors in AZ. They have some nice specimen plants, priced accordingly to match their rarity. \n\nBill will quote for you the common name, nick name, Latin name, and care instructions for any plant from memory. Friendly without being obsequious, helpful without being pushy.", "business_id": "rlrSUtmUnM84AVb616Qy6Q", "stars": 4, "date": "2011-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ePC1ht9DSh8nu_cpsD9BCA", "review_id": "hnSGPYbyUTpNfwsF1d_9Ow", "text": "I drove about an hour plus through Phoenix traffic, in the summer to get there.  I was not dissapointed.  I had a dress altered, and yes it was pricy, but Yes, it was worth it.  You will be hard pressed to find better craftsmanship.  The lady that fitted me was very kind and helpful.  And yes I did meet Danese, if you don't want her opinon, don't go into her shop.  She has little patience for Divas. Her work is second to none and if you want it done right the first time go to her.", "business_id": "vkRkOMYbVzadNJlOlTJxKg", "stars": 5, "date": "2014-04-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZvRWZgNQ9nkdqj-WuJTLJg", "review_id": "K8oMwHbRADIVX4xyE4RvIA", "text": "Went there today and thought the place was okay not great.  Was looking for something new that Lowes or Home Depot didn't have.  Didn't see anything that sparked my interest and so much of what they sell is under shaded trees or shades which I've been told means don't plant in full sun.  Well practically everywhere in my yard is full sun so they couldn't help.  Prices seemed decent on some plants, not all, and the trip there was way too long to make it worth my while (I live in North Phoenix).", "business_id": "7p0OI2Ld46-EzJkRHGQEJQ", "stars": 3, "date": "2012-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ry48Bta6spNowOkiMNC_xg", "review_id": "fEfmsgbwK7olC5Yd_OKXsw", "text": "When a store has what I quest for, the employees know their business, plus help contribute to a good cause, four stars are in order.  Here they are.", "business_id": "MIKf5qvfY7hBLGQ_8Ml8tg", "stars": 4, "date": "2015-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "djQkx_E4le82fBFLE_HyAQ", "review_id": "NiBCllAz7H7T6wIdmeXJ-Q", "text": "Just recently bought a Hybrid bike here from Mary the manager.  She well deserves 5 out of 5 stars! She has excellent customer service and is very accommodating.  She took my measurements and offered lots of suggestions based on previous customers. She also brought in her own experiences based on living in the area for a while.  Very helpful. I also liked that she ultimately she left the choice up to me.  \n\nI was between a Trek FX size Medium and Size large. Honestly the medium felt so awkward, the size was just not quite right. I felt crunched, too small. When I tried the large it feel much more comfortable but almost seemed too big.  I have Trek road bike and wanted to love the Trek Hybrid but the fit was not right.  Disappointed in Trek on that one.\n\nWe came back a week later when they had ordered more bikes in more sizes (4 stars for forgetting to calling us when the orders came in, as they had told us they would). I tried the Trek one more time. Still not the right fit. Finally I tried a new brand, Specialized, and low and behold, it was perfect! All my fit problems solved. The medium was a dream.  It was a little more pricey but having the right fit it always worth it. They even threw in a women's seat for free! \n\nAfter riding my new Specialized Sirrus Hybrid to work, I am so pleased!  For all of our bike needs we will definitely be coming back here :)\n\nAlso 4 stars for one of the other reps who took my drivers license because I was test riding a bike.  I was about the leave the store and he never gave it back to me. Had to run back in and tell them that he forgot to give it back. Not sure of his name, young guy though.  He needs to learn from Mary!", "business_id": "pU2yeKn-NNJnbMLuFfAXBQ", "stars": 4, "date": "2015-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uRrqQNmZ30b0e9-38N2lBA", "review_id": "R1clzCKOGvlivCcI5LSaLg", "text": "This is a terrific business and he is genuinely interested in the best interests of the customer.  Kitty should go back to LA to rejoin her fellow whores!!!!!!!", "business_id": "k6C5YiGHU_aT8oXSkGb0Pg", "stars": 5, "date": "2015-05-18", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "VnOtsJ2514YIAd0fM2O8oQ", "review_id": "KQZcEDeUcSUXgNF626vtuA", "text": "I wanted to transfer two of my dog's RXs from another store to CVS for the $25 promotion they offered with these transfers. The pharmacy assistant refused to honor it at the pharmacy because I didn't bring the coupon. I asked the manager if they would honor the gift card without the coupon and he said, sure, \"Tell the pharmacist I said it was fine.\" I did, then the pharmacist stalked over and chewed out the manager and came back and said, \"He shouldn't have told you that!\" \n\nCustomer service rule #1 violated: Don't argue in front of customers.\n\n#2: Don't be rude to customers.  \n\nMy other prescriptions will remain at Walgreens.", "business_id": "KEwv4l2RgiHjkjyYV0TuAg", "stars": 1, "date": "2010-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Wm_vkQAe-gh8a4A1VPoXvQ", "review_id": "eP3PfHYVjNHaq7lGLGDMMw", "text": "Yeah!  I just love this place.  They are very friendly and helpful and they make you feel welcome as you look for a simple hiking book or way more complicated specialist gear.  I thought their selection was very good and perfect for real backcountry work.  They had some very cool solar lamps and other overnight camping things, as well as a good selection of rock hounding books and tools.  Some excellent picks, for example.\n\nI am not a fan of REI or of any big corporation and so on that alone, I am grateful that this sweet little company is still with us from the 1970's.  The wonderful, idealistic 70's.\n\nThank you guys, glad you are still here !", "business_id": "b-IWZuVd3f0GcbtetwG5WA", "stars": 5, "date": "2014-04-13", "type": "review"}
