{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e59s01jARL-4_MPMfuz4Kg", "review_id": "sfXauKcWidULrPTAt0kaSA", "text": "I have some errands that I run in Dormont every Monday. When I finish the errands I stop at Knossos every week to pick up a couple of Gyros to go for my girlfriend and I. It seems to be a good, old fashioned, family run business. The food is always good as is the service. It's somethng we look forward to. As a matter of fact, when I headed out the door last Monday my sweetie remarked, \"It's Knossos day, cool!\"", "business_id": "PSlOtPIo28BvWOzdLmRRRQ", "stars": 5, "date": "2011-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lPMqq1p80J4HFs5vH2TAbA", "review_id": "QZx4F-5qYholE3-10pj_vw", "text": "I have been to Christos twice. Both times have been very enjoyable. The food is authentic. Lamb combo platter is delicious. The wait staff was very helpful with choices. Homemade wine. All these things made me wish I was back in Greece. The atmosphere reminded me of the Tavernas in Greece.  Again the Lamb had a delicious flavor! Don't expect  intimate or romantic.  There is nice Greek music playing and Good food - what more do you need?", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 4, "date": "2014-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SjDv_hX-3MuMnZyfcxetMQ", "review_id": "xuGT3d-Lz9t_mU5TCdfFBQ", "text": "Cindy mans the register and makes u feel welcome and at home...the fish sandwich is fantabulous and a must have. I call order my breakfast and for 3 bucks I have my breakfast to go. Gotta luv it!!", "business_id": "ASwN3Ih0Eh1oH0npLbzVjA", "stars": 5, "date": "2013-03-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "JaQ0XY90jUI-bFcFtcQRAg", "review_id": "ZrQt2_ZNJZ952-zALlIgxg", "text": "The best way I can think to characterize Showmars is that it's kind of like that girl/guy (maybe an ex) who has evolved into a fairly reliable 11PM hookup when you can't find anything better. The familiarity harbors comfort. The basic need gets satisfied and sometimes it is simply mind-blowing. \n\nBut when you're done, you are disappointed, primarily in yourself for poor decision making, and slightly nauseated.\n\nBut it gets the job done.", "business_id": "bffCUYaQ4FejTfu_xFwjyQ", "stars": 3, "date": "2011-03-15", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Z7_WpgPFm_WSHoJhbEY6zw", "review_id": "m2u-7FynZBZxelIqwgi91A", "text": "Yep, it lived up to the hype. Great gyro sandwiches with a cool local feel. The pita is soft and the gyro meat is some of the most tender I've found. Brilliantly seasoned too, the meat is definitely what sets these gyros apart. I also liked that there are multiple size options for the sandwiches. \n\nThe place has a nice, local college hotspot feel. Not wild and crazy, but more the kind of place students stop by on their way to and from class.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2014-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pEVf8GRshP9HUkSpizc9LA", "review_id": "qspkCQjEpK2RR-FdWWjknA", "text": "Consistently good Mexican food in downtown Phoenix!  The service is friendly and quick and the food is pretty good.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 3, "date": "2011-05-07", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "HkVOtZMz1yQNaY_iyt0Edg", "review_id": "4JgsAklTax0lOcAPeInaiQ", "text": "Great :\nSalad + Dressing (in sqeeze bottle on table)\n\nGood:\nLime Ade\nBread + Rice\nService\n\nBad:\nChicken Kabobs (really dry)", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2007-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fI_87gH3jSuxdI_Wq-Rmwg", "review_id": "29izBPkZBG5CMB2vdBGNYQ", "text": "Good food, quick service. Kinda pricey for the brown bag crowd. Great tea!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2013-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "100Df1wcVrl9rJgB7EG6xw", "review_id": "xdFbeIRF-xup6bqz4QfrFw", "text": "I actually stumbled upon this place when I was on my diet and I have been a fan since.  I love that it is a local place and it is family owned.  Not to mention they are Chicago Cubs fans!!!  \n\nThe food is great and the portions are just enough.  I love the chicken picado salad and love that it comes with warm pita bread as well.  It is always busy around lunch time but clears out around 1 or so on the weekdays.  I have been here on weekends and the place is pretty quiet.  \n\nThe only complaint is that it can be pretty slow sometimes but the food makes up for it!", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2011-05-10", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "GAEHo1uslNOouKy5k_v3tg", "review_id": "irpla_871-JKtJWWxsXMqA", "text": "Don't let the sketch-filled parking lot fool you! I know, there's Los Burritos a few doors down and  Kim's Chinese Food and a Cristiana Libreria.... Random oozes out of that strip mall. But Bacchanal is great. I had a Google Offer for the place and luckily live pretty close so made the trip last night. The decor is definitely dated (i.e. glass block walls, shitty chairs)- but you can tell they tried. They tried to create a gem in an otherwise downtrodden area. The food was surprisingly good. \n\nWe started with the appetizer platter- a sampling of deliciousness. I would have never thought to get cheese at a Greek place, but this cheese was so fresh. It was perfect with the fresh pita triangles served with it. \n\nI had high hopes as I am a fiend for tzatziki sauce and the gyro platter I got was to die for. So good. I can't emphasize enough. So good. I want to eat gyros every day now. It's a weird hankering to have, but alas, it is what it is. My date had a lamb stew with veggies, potatoes and rice- Also very good. The portions are perfect for the price (gyro platter $10, lamb entree plate $16). \n\nThey also have Greek wines and Greek beers available- And there's a sign right outside the door that had words concerning my favorite hours of the day (you know, those happy ones)- half off appetizers and discounted beers. Both great things in my book. \n\nI plan on returning. Feel free to join me. We can learn how to bellydance our bellies full of lamb together.", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 4, "date": "2012-03-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "HvaVgP0S0dFaCbBDIQIkag", "review_id": "5hF-Fn-Z_gPpfX6v1ywQHA", "text": "Couldn't muster the energy to make myself dinner, so I gyroed it up. The gyro is still very good (the pita bread is perfect), and I also got hummus and dolmas. The hummus is fine, but the dolmas were the sleeper hit of the evening. I've always been kind of iffy on dolmas and have only recently started trying them at different restaurants, and these ones are high on my list. They have a perfect leaf:rice ratio (I hate having too much gummy rice to knock back) and there was a very lively tang to the dressing. \n\nAnd kudos to Steve, the owner, for keeping up with the Yelp reviews. Good to know a business owner cares what his customers think.", "business_id": "bxpzP73A7gauvxFEyd_8xA", "stars": 4, "date": "2009-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bmDivXQy-KB4_dPIS9ZA8w", "review_id": "DWqqiL6svL2xO6jNC7Y1-w", "text": "We tried Cyprus Grill for the first time tonight and were really impressed! The service was very friendly and fast. We started out with the hummus appetizer and it was really tasty. You could tell the pita and hummus were both fresh. Their hummus is a little different in that its more chunky than other hummus I have had but still very creamy and delicious! \n\nI ordered the gyro pita with a side Greek salad and my husband had the spartan club with a side of the Greek fries. Both dishes were very tasty but the Greek fries were amazing!! The Greek fries have feta and Parmesan cheeses drizzled with lemon olive oil and then topped with paprika and oregano...so good...we will be back!!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2012-03-30", "type": "review"}
