{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "9HWSQ8NYfRPn3leqosFgwg", "review_id": "J-SUeaWVIW0dd761lmX-xA", "text": "I've driven by this place many times but assumed it went out of business long ago... Boy was I wrong!  They just sell out of donuts and lock their doors before I'm even awake!\n\nToday, success!!  An early meeting had me driving by and the OPEN sign was on. I quickly pulled over and went in to discover trays and trays of donuts!  I ordered a chocolate frosted French cruller, chocolate frosted cake donut, and a cinnamon sugar cake donut. They were all delicious but the cinnamon sugar was hands down AMAZING and YUMMY. \n\nIf you love fresh cake donuts that are cooked to perfection, get up early and stop at Better-Maid Donut Company.", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2012-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zy6o3z5gEfRqs_Wb-KsyZQ", "review_id": "qArLHvvqTLfkKs5zSlDU8Q", "text": "Believe the great reviews! This is a gem of a place. Traditional recipes, traditional Pittsburgh hospitality. The hours, location, and owner add to its charm. But if its just donuts you're after, you won't find better anywhere. Thank you to the owner for keeping traditions alive!!", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2013-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "t5AWRnd4Eb4cdjtBgBCasg", "review_id": "uo9BgCYqyxPIKFOTVcHivA", "text": "The old fashioned sour cream... bavarian filled... glazed and cake... OMG so good. Seriously, all of them! This little shop is right in the middle of a neighborhood. I can only imagine the temptations of living so close to the intoxicating smells that waft out of there each morning. \n\nWe got there about 5 minutes before 7, thinking they would open at 7. There were already 3 people in line. The doors finally opened up about 10 minutes after 7, I guess you can't rush something so wonderful. A dozen tasty gems were carefully chosen... better give us a dozen doughnut holes too! Every last bite was terrific. \n\nPittsburg, I hope you realize how lucky you are!", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2013-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6yCogImwV4JOTH05gV34pg", "review_id": "1FKsJkUwQuylci1VAE-zdA", "text": "I think this place is a gem in Pittsburgh that I never knew about until the last few years.  Don't expect a super fancy shop.  Don't expect all kinds of crazy flavored donuts.  They have a few basic types that they make and they do them exceptionally well. \nYou must get here early for the best selection as they drag in the sign and close the doors after the last donut is sold each morning - and that could be between 8-9a.m. on some days.\nTheir little building was probably once surrounded by many other structures. The neighborhood, as is the case all over Pittsburgh, has probably seen better days too.  But you step through the door and it kind of takes you back in time before the mega grocery stores and when there were little shops for each type of trade.\nI'd say give it a try, take them home, sit down and have a  Better-Maid Donut with a nice cup of tea!", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2015-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f27bSPzbqR8yVIAMkhlwmQ", "review_id": "ei5EUMEWDqskROOQpvye7A", "text": "This place is so Pittsburgh.  Great donuts, cheap price.  They definitely put the money into the fryer.  Get there early, there will be a line.  Cash only.  Don't worry about the newspaper on the floor, just enjoy the fried goodness. \nNot even a car plowing through the building can stop these donuts.", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2015-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "sbDeq14pOdaNd4ZkQsLE5g", "text": "Quick review: Family-run breakfast/lunch joint with your typical diner staples.  Quaint and cozy, lots of comfort foods.  Nothing spectacular, though the homemade breads are quite good.  A bit on the pricey side and can fill-up with people quickly, especially on the weekends.\n\nDetailed review:\nI've lived near C's for about a year now, and have never stopped-in to check it out.  Folks at work gave mixed reviews - some raved about the place, others gave it a \"Meh.\"  I run past it nearly every morning and they always seem to have a good-sized crowd, especially on Saturdays and Sundays, so I figured it had to be somewhat decent... with that, I treated myself to a breakfast this morning.\n\nI wandered in at around 9:30am on Memorial Day and was pleased to find plenty of seating.  The hostess offered me a table outside, which was a nice bonus - the weather was gorgeous, so I happily took the offer.  I also grabbed one of their complimentary/shared newspapers to read.\n\nA waitress stopped by to ask for my drink order - I went with coffee - and to drop off a menu.  She came back a few minutes later with an acrylic coffee cup and a stainless coffee carafe.  She left to tend to another table; I needed some cream for the coffee... oh well, it was nice and I was happy to continue browsing the menu, sans cream for my coffee.\n\nBreakfast offerings were ordinary: eggs, hashbrowns, pancakes, omelets, skillets, and a couple of extras, like eggs benedict, belgian waffles, and some homemade pastries (turnovers, donuts, muffins, cookies, etc).\n\nThe waitress stopped by to ask if I was ready to order - told her I decided on the \"Hen's Nest\" which consisted of 2 eggs, hashbrowns, and toast.  I also ordered a pancake, and requested some cream for the coffee.  She apologized and immediately brought some half-n-half containers.  We were in business.  \n\nBefore leaving to take my order to the kitchen, she asked if I'd like anything in the hashbrowns.  I was pleased!  C's has some specialty hashbrown items on the menu, but I didn't want to order a huge plate of them... so, when the offer surfaced to add onions, peppers, tomatoes, etc to my potatoes, I jumped at the chance.\n\nFood came about 20 minutes later and looked tasty.  The pancake was a lot thinner than I had pictured, but it was quite tasty.  I found myself wishing I had ordered 2.  \n\nThe Hen's Nest was just \"OK\" - the hashbrowns weren't greasy and featured a nice, crispy char,  but the onions and peppers didn't do much for flavor, oddly enough... I found the entire dish to be largely flavorless.  :-(  \n\nThe multigrain toast was very good - and was probably the star of the entire meal.  The waitress only stopped by once more - to drop off the check, which was a bit of a shocker as well... $12 for my modest breakfast - $5.99 for the Hen's Nest, $0.89 for adding extras to the hashbrowns, $2.99 for one (1) pancake (!!!), $1.89 for coffee.\n\nService = 2 stars (nothing great)\nFood = 3 stars (average breakfast fare)\nValue = 1.5 stars (quite pricey for what it was)\nMISC = 3 stars (bakery items looked stellar, nice outdoor patio, very relaxing)\n\nI'd really like to give C's 2.5 stars, but I'm feeling a bit generous so, it's a 3-star \"gift\" rating.  Had I been in a crankier mood, it would've gone 2-stars... :-)\n\nFor what it's worth, I think the Hubbard Avenue Diner has a better overall breakfast, and it's about 1/2 the price.  It'll probably be a while before I visit C's again.", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 3, "date": "2010-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zKTQ9yo-yxOeR6Q3Av5_yQ", "review_id": "wjHa8gszZlofVrzDSc-Y7w", "text": "If asked a few months ago, I would have given them 4 stars. Their breakfasts are awesome and homemade which is great, but they have a no substitution policy that knocks them down a notch. My husband doesn't eat eggs, and they refuse to give him extra hash browns, or at least take off the price of eggs. But it does have a great environment and they're otherwise friendly.", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 3, "date": "2013-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dMVS8YQPa7MpOponFsdCWw", "review_id": "gMcEg_vNMTzqV9-bEABZkg", "text": "Solid spot for diner breakfast fare in Middleton-- popular with the grandma and grandpa set.  Like all good diners, service is friendly, they keep the coffee cup full, and know how to crank through tables.  They've always been busy when we've been there (weekend mornings) but even when the wait looks long it's less than 10 minutes-- and once you're seated, service is quick.  Breakfasts are definitely of the \"this is not healthy for you\" variety, but it's good for a treat (I don't know how my kid made it through his cinnamon-swirl pancakes which were topped with the kind of glaze you put on cinnamon rolls, especially after he added syrup to it...)", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 3, "date": "2014-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xOe-ZopdYiu8ijimmtdrnA", "review_id": "tKUtmVUzWNPxqiGSd8e7xQ", "text": "My favorite breakfast place in Madison, without question. Small town diner fare, but they bake their own bread and pastries. Great service and very affordable. I come here as often as I can.", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 5, "date": "2014-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ln9SgBsnvl0sWbGpqw616w", "review_id": "xlasK5X1ySSs-pnhMWiujg", "text": "Love this place!! Whenever I am in \nMiddleton, I eat breakfast or lunch here. Home cooking!! Friendly staff! Fresh baked goods.", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 5, "date": "2015-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CdKX95dMySpzWX4XQ2k01A", "review_id": "3QF5glN1nmVXIsMDfSmzCw", "text": "You can find this company's products at several retail stores throughout Madison and also at their booth at the summer Farmer's Market. The donuts are always moist and very tasty. The cookies are hit an dmiss--some days they are the perfect combination of being chewy in the middle and crunchy on the outsides. The scones are far too dry for my taste, and the other products look and taste mass-produced. Where is the love?!", "business_id": "IvOeqnZZrGKjUxj6fW2P7Q", "stars": 2, "date": "2009-05-03", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "fVq5cSG1ULnAbo_GBezOKg", "review_id": "PSgSbkcNheGTvP_cv68QfA", "text": "I love the Dunkin on Green and Neil. I stop by for coffee on twice a week before an evening class. There is one lady that I always see and she is super friendly! She's gotten to recognize me from my frequent trips and she takes great care of me! \n\nCan't say that I have had any of the food, but coffee from their drive thru is always delicious and quick.", "business_id": "xky2rWT8kpsdyJ4YgZB3Jw", "stars": 5, "date": "2014-05-12", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 4}, "user_id": "g84VjttN28PWiv_WtdhnSQ", "review_id": "ARWCPusnzpk8OX7Mfpz3RA", "text": "A dive donut shop? Sweet! Too bad this place is so meh. \n\nI was so excited about Raibow Donut but the donuts are kind of sucky. I was also excited about the BOBA tea (yes they have it here) but it was also kind of not good. And the bubble tea was made kind of like a frappachino with whip cream and shit. What's up with that? \n\nSo I guess it's still kind of cool due to diveyness and whatnot, but not really awesome or anything.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 3, "date": "2008-05-04", "type": "review"}
{"votes": {"funny": 6, "useful": 2, "cool": 1}, "user_id": "-F32Vl8Rk4dwsmk0f2wRIw", "review_id": "BRgTvRWhyWt6OcckPR2Zeg", "text": "Yeah, I got on the Rainbow Donut train a few months and I've gotta say that I did not get off on the first stop.  \n\nFirst, this place feels like a conversion of some sort -- you know, like when an old Circle K becomes a dentist office or something, and you know things just ain't right when you're getting drilled in a beer fridge.  On the way out you have a hankering for a Thirstbuster and a Payday.  This is the vibe of Rainbow Donuts.  I get the feeling this place had a reincarnation and they're disguising the catacombs with those unnecessarily GIANT glass displays.  I've never seen them completely filled ... uh, ever ... and it makes their selection of glazed pastry seem paltry.  \n\nI was so disoriented by this whole encounter that i actually ordered an ORANGE CAKE donut.  I'm puking on myself right now remembering it.  What a shite state of affairs when you think that ordering such a conception is a wise decision.  To be honest, their selection WAS pretty sparse, and I was just kinda wanting to bounce because some customer was arguing about a mistake the owner had made by inserting the wrong donut into his half-dozen LAST WEEK and wanted compensation for it THIS WEEK in the form of a free donut.  \n\nMeanwhile, my eyes are molesting my stomach by flickering between donut choices maple or orange.  My brain intervenes with a WTF?  So, i chose the lesser of the evils -- even going against my cake-donut discriminatory practices and made a panicked decision.  \n\nEnd result:  there are MUCH better choices for hangover donuts in the central area and for slightly cheaper.  Also, that 24 hour sign practically had me thrown in the clink one night as i foolishly left the bar drunk and early in search of hot, glazed donuts.  Because Rainbow was in fact closed, a kick in the gut to be sure, I ended up driving around central on this quest for donuts at 3-? am, until i eventually forgot I was even driving or why I was out in the first place.  What I remember is being enshrouded in Whataburger's Honey Butter Chicken Biscuit wrappers the next morning and a vicious hangover.  \n\nMoral of the story:  go vegan", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 3, "date": "2008-05-05", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "0qIsBt4EzBDCKrIviV55Ew", "review_id": "JO-n3zS8o0n_8w7yC244dQ", "text": "Fresh Donuts always says good morning would you like to be my friend. I work close to the shop and I love to surprise my co-workers and customers with a warm donut.  The couple that took ownership are very nice and seem to be producing a small following.  The owners are puting in the hard work to build a business and seem to be on the right track.  As the business grows I look forward to giving Rainbow Donuts more stars.  \nLook for a bright purple building, its kind of hard to see if your driving East on McDowell.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 2, "date": "2008-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sfKMl7ERKuwxIh3HLXUg-Q", "review_id": "LXF1rQL3Lvvy5T50g1FI1w", "text": "My husband and I shared 6 doughnuts on our first visit here. Perhaps not the most elegant detail to open with. \n\nIt has since become a favorite, as they have \"an amazing bearclaw.\" I am not generally a fan of dough-based foods, so I like the fact that, though the oddly large and realistic pictures of the food are faded, other stuff IS offered. I usually stick with doughnuts for value and camaraderie, but plan to try one of their croissantwiches soon.\n\nBlended drinks are from a powdered mix, but ok in taste. Nice selection of morning beverages.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2009-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "HY9qpAamqLXFoa7xMwNntg", "review_id": "3UK0apqckf1osal44zeoMw", "text": "everyone has a comfort food so naughty santa wouldn't visit you for 5 years knowing you indulged...looks like i'll never be getting another christmas gift for as long as i live because i've tried nearly every one of rainbow donuts' tasty little morsels.\n\neven if  i saw cockroaches crawling on the floor (which i didn't), i'd still eat their donuts. my favorite, by far, is the whipped cream glazed donut. i could eat 5 of them and not feel bad. their coffee is great too, and you could walk out of there with a couple donuts and a cup o joe for around 4 bucks. these are the best donuts you can get in town. so soft and chewy you wouldn't even know you ate 5 of them until you're keeled over with the sweetness stomach cramps.customer service was great, it's a family owned local joint, so it's def a place to respectably spend your moolah.\n\ntotally. worth it.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2010-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "waD2euOMPTnTzQ0thq3H6Q", "review_id": "ujkVFzU0-oJdcnwdHs6T2g", "text": "Cali-style doughnut spot in Phoenix. sure, I'm game. Typical S.E. Asian doughnut spot... they sell doughnuts, boba, calling cards, smokes, snacks, ramen, etc...\n\nThe taste was about on par with the Cali joints. If you're craving real doughnuts and are sick of being pushed bullshit products that claim to be doughnuts (like YumYum, KrispyKreme, Dunkin, Winchels, etc...), then give Rainbow a try.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 3, "date": "2010-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pVRiM1yhIaXDrIkwiKaGCg", "review_id": "Y4HwNfLYI30KL34p3w00kg", "text": "Doughnuts are bomb. \nCoffee is weak, so deal with it and get a large.  \nNext to the doughnuts are instant rame cups and assorted treats that somehow someone must buy.\nWhile having coffee a street character rolled up on a bike and had some serious street survival gear, backpack loaded and 3 shopping bags with extra clothes in them attached around his waist to his belt. And HE bought 2 old fashions. \nThe workers sound like \"Tammy\" from the nail salon comedy bit. \nThey sell Oreo cookies by the roll they just took out of the box, no packaged for re-sale here. \nOk now Tammy is speaking good broken Spanish. \nMan I Iike it here, you won't get that \"mas puto!\" vibe you get at Starbucks or Fair Trade when your lady drags you into places like that.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2011-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Nuhe9A4bVtOcme6UYg-OOw", "review_id": "sgOJTVcMghpAlkYLM96vRA", "text": "Strawberry glaze donut... oh how I hate you so much cause you are so irresistible. The donut is light as air and is just the perfect amount of sweet. It's a sin to be so tasty. Rainbow Donut's you are worth the extra mile on the treadmill!", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2014-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "oVY1zfoXW7M0Q0dczzxJJQ", "review_id": "YACBPDjN36hpLr_7jH_Saw", "text": "There's a few trendy doughnut shops opening up around the city. Those are great, but I prefer Rainbow! The doughnuts really remind me of a doughnut shop from my childhood. We'd wake up early on Sundays for church and as a reward, we'd get to eat sugary doughnuts after. But that's besides the matter. \n\nTHIS PLACE IS AMAZING! They've got tons of yummy options. Doughnuts if you want something sweet and croissant-wiches if you are partial to more savory options. So far, I've only had the doughnuts. Dough is perfect, icing is just sweet enough. My go to is a chocolate glaze, but I've ventured out to try other flavors. Recently, I tried the milk and cereal doughnut (which I loved) and the orange glaze (surprising, refreshing, but not really my preference). \n\nThe prices are really great too. Cheap but not like they're just giving away food, like a local doughnut shop should be. I don't leave with three or four doughnuts and coffee wondering what I just spend my $20 on like I've done at some of the trendy doughnut shops in town ( I'm definitely not ragging on them. They're good and their designs are awesome, I just like Rainbow better). \n\nMy best advice is to go here early, or on a weekday, but still morning. They tend to run out of the more popular doughnuts towards midday.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2015-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "j37Q_etrG1mRTlLzV6FkZw", "review_id": "8LgTk45RIUXsKUldpKZBFw", "text": "They have a wide variety of donuts to choose from. I always end up ordering 3 for myself. Great to go to if you're in a hurry in the morning and don't have time to make yourself breakfast.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2015-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "foBgKqvbfwanA6EK0xAYxg", "review_id": "dBq4NxzDQDSnD6rT0gRSbg", "text": "Wish they didnt close at 6. Maybe thats a good thing for my health though. Great donuts.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2015-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8Irn_BHAB7rBZih2U7Qeig", "review_id": "dXT0v_GKpRbOJLK3XypnXA", "text": "I had really high expectations going into rainbows first of all it is a really sketchy area. Then the employees were really rude did not really help us out when we asked for help. I've had better donuts.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 2, "date": "2015-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "mlL6MuK5zU6tGTbV3X0nhA", "review_id": "w8BOWiatRCl3LipPiEP5tg", "text": "Passed by this new store as I was coming back from the Home Depot on Thomas. WOW! Did they ever pull out all the stops with this store! You have to see this one as the manager told me its called a \"Flagship\" store. This thing is HUGE! Another drive-thru with ample parking and tons of seating inside and out. D&D has really improved their image big time in Phoenix and this store says it all.  A+ on customer service once again and the coffee was stellar. I tried the new Berries N' Cream donuts which was very good I must say. All in all another great location and amazing store....If you like Dunkin you need to see this store!", "business_id": "T-AAN0CizEBOTtHinTuvrQ", "stars": 5, "date": "2009-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "NNdfPF-UhvLB8FxbsuSC5A", "review_id": "s5tEVjQdDDBRNZGTBum_bg", "text": "The drive-thru open until 9pm, but the in-store service closed at 8pm.  Haven't had a chance of trying it out, will do it hopefully soon.", "business_id": "T-AAN0CizEBOTtHinTuvrQ", "stars": 3, "date": "2012-04-24", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "0MoQX876QxWj0TMsMT7kbw", "review_id": "ICRW6ICzuUZP_N0KPesI3A", "text": "After hearing all the hype, the commercials on tv, etc.... I finally got to experience Dunkin Donuts first hand.  I tried their donuts, coffee and breakfast sandwich. HMMM... Let's just say, I am not too disappointed that i don't have access to one locally. Their donuts were dry, my local donuts shop have way better donuts.", "business_id": "T-AAN0CizEBOTtHinTuvrQ", "stars": 2, "date": "2014-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bE35LHaO5P-J6nBKXeVg5w", "review_id": "T5WMDAkrFaGEMQnrZj4BMQ", "text": "I like dunkin'  but the service sucks ..  The cashier was rude but I would be too if I had that job. \n\n\n\n\nShe messed up on our order didn't go back to change it because it would've been a waste of time she probably would've messed up on that as well. \n\nJust left dunkin' 20min ago!", "business_id": "T-AAN0CizEBOTtHinTuvrQ", "stars": 1, "date": "2014-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DbskgqCz6M24dNFi0ed0WQ", "review_id": "Z3TfEYP7hFlAjz00xONG-A", "text": "Best Coffee and Donuts.  It's Dunkin' not much else to say.", "business_id": "T-AAN0CizEBOTtHinTuvrQ", "stars": 4, "date": "2015-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "l53FUDHRHLg7BQ89KgAtxQ", "review_id": "srFJS7SoIy2wUkSfEgnRzA", "text": "I was the office hero when I used to bring these in.  Their chocolate dipped cake donuts are \"The freaking bomb-digadus\", as one friend explained.  And their little donut holes... oh.... heaven.  I often would get there when they were still warm and it was like getting warm fries - you just had to eat some on the car.  \n\nThey also will also have donuts you may not see other places, which is a nice.  Allows you to go to the same place for monthly donut runs without picking up the same box of donuts each time.  \n\nAnd did I mention how cheap they are?  SO cheap.  Well, cheap to your wallet, but definately not your waistline.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 4, "date": "2007-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Cs__EUkIbJaMnGgHRY0z3A", "review_id": "Mx575X26ZYpoHqQwYBKWgw", "text": "I liked Rainbow Donuts.  They had a fair selection of donuts that appeared to be made on the premises.  The coffee was fine.  Not a lot of seating, but the morning I was there most people got take out; so, we didn't have a hard time snagging one of the three booths (there are two are three small tables as well).  They have free Wi Fi which I really appreciated now that I often read the morning news\"paper\" on a screen.  The service was OK, though I don't think the polite young woman behind the counter had had her coffee yet.  They were out of whipped cream donuts when I got there which was very disappointing, but I enjoyed the ones I had (chocolate chocolate cake, raspberry jelly, half a glazed donut).  I'd definitely go back next time I'm in Phoenix, and I'd get there early to try one of the whipped cream donuts.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 3, "date": "2012-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "nYfpquFWxQC342RenTI3rA", "review_id": "IOLnjUGZSjv7xIx4PxWL9A", "text": "This place is pretty good. Definitely beats dunkin and it has almost a cult like following with one of my dental professors. \"Students, today we are graced with a special treat. Do not be ashamed to eat these donuts. They stand above the rest.\" Good? Yes. Enough to make an impact. Not dying to go back right now but then again I just finished eating the following (I probably should not think about eating for a while)\n\n-Glazed french cruller:  best of that variety I have ever had. It completely melted in my mouth. \n-Glazed donut hole: unremarkable\n-Sprinkled vanilla cake:  not a fan but I am a yeast girl at heart\n-Cherry frosted cake: quite good but never would have guessed was cherry flavored had I not checked the website\n-Buttermilk: rich, decadent, dreamy. I had never tried buttermilk before, but if you are looking for a donut that makes an impact, this is it.  \n\nThe buttermilk and french cruller would be my go to donuts next round but I want to try more....the apple fritter, raspberry jelly filled...so many donuts, too little time", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 4, "date": "2012-04-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "H68zvn25JEAeOI2pCKckXg", "review_id": "pSHwHXRv1hgSJ3kHMZfNWQ", "text": "On a whim while missing home, I did a Yelp search for Texas Kolaches and Rainbow Donuts is what I got.  It's not close to my house, being in Phoenix, but luckily, it is close to my new job.  I don't make it up here nearly often enough, but when I do, it's always worth it!  \nNot only are they the only place in Phoenix with Texas Kolaches (that sign isn't lying...I can't find them anywhere else), they also have a huge selection of donuts!  \nMy personal favorites are the spicy sausage kolache and chocolate frosted buttermilk donuts.  I've tried the bacon maple donut, and it was good, but it really needed more bacon (is there such a thing as ever enough bacon?).  Other winners are of course, the sprinkle donut, the cake donuts, and some kind of chocolate cake donut with a honey glaze.  Really, I don't think I've ever had a bad donut here.  \nThe woman behind the counter is always friendly and patient with me as I take forever deciding what I want (I always go in for 1 or 2 and come out with 6 or 7).  \nThere are a few Rainbow Donuts sprinkled around town, but they're all independently owned.  I've never tried the others, so just to be safe, you better just come to this one.  :)", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2013-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Zw2HgpyTgJf-l2yOSWff5A", "review_id": "7HVru7WUmAa1_fw3V-vZ1w", "text": "Had to introduce our OH-IO group out for our wedding to the Maple Bacon Donuts...AMAZING!!!", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2013-03-24", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "VYWc0dZ1p973tN-PFYxr-Q", "review_id": "1Pzf15tID-_8oRx6IIcyMg", "text": "My fiance is from Texas and when he moved here to be with me I was so sad that we wouldn't get to have any Kolache's anymore. \n\nHOWEVER, he is so amazing and found this location. We went less than 24 hours after we heard about it and it was soooooo AMAZING! We will go back and I'm glad I found my Texas favorite in Arizona. :)", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2013-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iPhoJlwisUKGGrA0QNmYMw", "review_id": "oym4xTOV2HgVYYI_jJRT1Q", "text": "Bacon doughnuts, need i say more! At $2 it is well worth it! It's like breakfast in a handy snack. Also regular fresh made doughnuts are only $1! I did my paper here no wifi but there were tables and an outlet. Lots of parking and a bathroom. Closes at 3 or 4pm", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2013-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0UCWOfFSbSk-tXPd17_Wmg", "review_id": "IA1Hst3B1aKRRAO85zv3_w", "text": "Cheap! Delicious donuts! It reminds me of the donut shops they have all over Southern California. My girlfriend got one filled with whipped cream (not custard like a Boston creme, but actual whipped creme). Open from 4am til 7pm! Not fancy and definitely a \"sometimes\" food choice, but perfect for what it is.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2013-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Hb49IsEZltm85wLz3uMrmw", "review_id": "mbIxeBOyvvqKANoYzYRkvA", "text": "Doughnuts from this joint are awesome. I have tried at least 6 different types. The hot coffee was nasty. It tastes gross!! I will never purchase another coffee but clean doughnut shop. Owner is very friendly Asian man who does not understand English too well. He makes mean doughnuts though that melt in your melt and are made fresh daily early in the morning.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 3, "date": "2015-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rnAjFiW2lG7-LCxb419iDQ", "review_id": "wchxVsGT7W5yuaIj1BcXLA", "text": "Pros - Good donuts, gave me extra donuts\n\nCons - Closed before the time indicated in the store hours posting, employee/owner made me order from the drive through window, only had glazed donuts left\n\nIt was really odd to have to walk up to the drive up window in order to buy donuts.  The only reason why I'd go back is because it's closer than the nearest Dunkin' Donuts.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 3, "date": "2010-03-01", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "xqQMyOzggrDR3vQ82b79tw", "review_id": "QgM-F5lSkanYYYxXzznU6A", "text": "First of all, I consider myself to be a donut aficianado, and would consider Dunkin Donuts chocolate glazed to be the penultimate donut around.\n\nWith that being said, I still give Rainbow donuts 5 stars because the donuts, including the chocolate glazed, are fantastic and fresh.  They have an extensive selection and are sure to make everyone in your sugar-crazed party happy.\n\nPerfect for the after church crowd, and us sinners alike, Rainbow Donuts makes the best donuts in the valley!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2010-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "io5b3aooPSgC0gFpSSrqNg", "review_id": "ZmmnmtU1ROOogsqYcM_veg", "text": "I love donuts. It's so hard to find a good donut these days. Luckily, I decided to \"Yelp\" donuts and what do you know - Yelp comes through once again. We split a gigantic cherry fritter type donut and we still didn't finish it, mainly due to the fact we just had to try a buttermilk donut. But I did manage to scarf down the remaining piece of cherry donut later on and I enjoyed every bite. Crispy brown on the outside and moist and delicious on the inside. It's definitely something one would get a craving for every now and then. Decadent!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 4, "date": "2010-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "ky9pQ8AKufvZ63IxR41jGg", "review_id": "10g7NnoBmeZaOii3L_zlRw", "text": "Not really much for me say hear...fresh doughnuts....great prices....you can get 6 doughnuts of your choice for under 5 bucks....WOW. Pretty good service....indoor and outdoor seating to enjoy your dougnuts...but they are only open from 4am to 3pm so if you want the best doughnuts get there early or before 2pm or they will be generally out of what you want....because I don't believe they make any more fresh doughnuts after 2pm. No doubt these are the best Doughnuts in the valley...maybe in the entire state of Arizona.  Eat, Drink, and be Merry my Friends!!! This is review number 200 for me...I am so happy....wohoo!!!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2011-04-17", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "DJIwm4UCnM-SOxXbARjPsQ", "review_id": "tbVF5DRhl80kXcGo7Jjhyg", "text": "Oh good, I'm a regular at a donut shop. I'm a pair of sweat pants, a NASCAR Snuggie and 11 cats away from spinsterhood.\n\nAnyway, these are some pretty awesome donuts. If you're looking for doughnuts, you can take your extra consonants and vowel somewhere else, my friend. If you bring these to work, you may get a raise.\n\nApple fritters, cake donuts, glazed, jelly-filled... good stuff. But get there early because they're only open until 3pm during the week and on Saturday and 2pm on Sundays. Some weekdays, they are closed a bit earlier than 3pm (as I have had the misfortune of learning first hand).", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 4, "date": "2011-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "QBQlErZajdIyXX84dvFUnQ", "review_id": "EAH5g104gnCZo12rVGXWEQ", "text": "Love these Donuts Always fresh and always good. This place has consistently great Donuts and good prices. This place is in my top 2 best places to get donuts in phoenix!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 4, "date": "2011-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "QHWGKJlwpchGsEURbbSDKw", "review_id": "ZGmVLT0E2oVXfBTbR4MUkg", "text": "This place has the best donuts in the valley. I grew in Southern Cali and there are an abundance of locally owned shops there. It is a struggle to find a good quality donut shop around here. They are few and far between. I don't like DD and KK is played out. I was heading in that direction and decided to give it a try. These are the best donuts I have found in the valley. The prices are great as is the selection. I like that they have a drive thru, which make it very convenient and fast. The Apple Fritter was crispy and delicious. The maple bar is soft and the maple icing is soooo good. You can tell these are fresh donuts as they are soft and fresh. These are so good that I would get up early on the weekend just to go there and get the best selection before the rush came and obliterated them. Love it!!!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2011-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dUDzN6zl3j12zhByOrnF9Q", "review_id": "tMz9Ns9wK-pKYUGiR-ilfg", "text": "This is a good donut place... with the awesome cake donuts that they lack at all the friggin Dunkin Donuts that they have in Phoenix.  I'm glad that I found this place and that it's relatively close to home- the generic chain donut places just don't do it for me like the little ma & pop run places.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 4, "date": "2012-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ohyH0y6PY9WsV4cPj4Fh9g", "review_id": "0uYOS7aHAfKBUI6cIMnn8w", "text": "I haven't met a donut I didn't like here at Rainbow Donuts.  The old-fashioned donuts, chocolate bars, and french crullers are my favorites.  They even make croissant breakfast sandwiches, which also hit the spot on the mornings that we come here.  Don't bother with Dunkin Donuts if you want authentic donuts at great prices.  The service has always been great and the young lady who works here is always smiling.  :)", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2012-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DZ-VI0MwnzsupgY4K8gB9w", "review_id": "BB8ZNPxoc8biRkX7AcPbFg", "text": "The donuts are at a whole new level (in the vacinity off heaven) than your regular donut shops. I had no idea donuts could be this good. Go early to get the best.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2012-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "t6cniYnYdM9uUoW4CXaSzA", "review_id": "Y6rZJmvW9LQ66Xoy0pMlIw", "text": "This is the best donut shop that I have ever been to!  It is a family run business and  the owner, Gina,  is always there.  Every person that works there is extremely pleasant!!  Unfortunately, this place is on my way to work, and my families house... so I am tempted EVERYDAY!  :) \nThe last time I drove by my sister talked me into stopping but I didn't want to go in because the line was so long.   I gave in and we stood in line...but they were so dang quick that we didn't wait more than 5 minutes.   I must say, the young man behind the counter is very VERY patient.  A customer ahead of us was being rude and annoying.  The young man just smiled and took it in stride.  Yay for him!  \n\n\nI almost forgot.....their donuts are fantastic!! Bakers dozen is 14 instead of 13.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2013-03-07", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "IjafRfMSAQpInLlw-Vi0Cg", "review_id": "2_rPS9rF7yokLkw4RmXDig", "text": "Good donuts, definitely not the best donuts around. They hit the spot in the morning for sure!\n\nstay away from the coffee, it's wack", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 3, "date": "2013-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DIxLmNSXNfJyxCveLOpUUQ", "review_id": "9CRRKv-EGl1egwtRb53i0Q", "text": "Maple bacon only made on weekends! Worth waiting all week for!\nOh this place is the end of my waistline! Yikes. \nFresh donuts, need I say more? Oh yes, you can ALWAYS say BACON!!!!\nFriendly service, reasonable prices and fresh warm donuts. YUM. \nThis place is my go-to spot for donuts when I'm in the Phx/Scottsdale area. \nHIGHLY recommended. And trust me, I've eaten a TON of donuts.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2013-04-03", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "bXco3thg3tUuG_S5Nas8JQ", "review_id": "hyWQFAzetniDq0kAw0c3PQ", "text": "These are the best donuts in North Phoenix by far! I have yet to find another shop that even comes close. Anyone that eats at DD has no clue what they are missing out on. \n\nA couple times per month I will wake up early on a Saturday and treat the family to these delicious gems of heaven. Everything that I have tried is amazing but I particularly enjoy the whip cream filled long johns or the apple fritters. I feel that I can only eat a maximum of two donuts before I enter a sugar coma. \n\nFrom what I have read, this place is family owned which I would much rather support than a chain of donut shops.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2013-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "o8sVB5-EX5EI-ZcYBb3-5A", "review_id": "filB_CO8ahW1qj3Mr1RVNQ", "text": "We went this morning!! The service was fast and efficient! Out donuts were very fresh!! We took our kids with us, and they were very friendly and welcoming to them. We will be going back!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2014-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "U1v-E0bmJBS285ebSPhzDg", "review_id": "_Xd_CCqR_LdyLdEv8VFlow", "text": "Excellent doughnuts. They are baked fresh every morning and the staff is very helpful and friendly. They have reasonable prices. I have been in the drive thru and walked inside. Fast , friendly service and clean establishment. I highly recommend this business.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2014-03-22", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "_aMz2TsaWs7yCPY2P5Ti8w", "review_id": "thiJ5FrE9av2XCKTP9eDgw", "text": "With the addition of the cronuts and new flavors, I have to rave about the new variety but same old taste. What can I say? Being the duke adds responsibility of ensuring this place gets the credit for best donut shop in Phoenix!\n\nNow, what makes a good donut? It has to be light and fluffy. Not light as in fat free, but light and fluffy, as you take a bite, your teeth sink right through the icing and dough. It leaves a moist chew in your mouth while allowing you to savor the flavor. Rainbow delivers this with every single donut! You got that right, I just dropped some donut knowledge up in here.\n\nI have heard many great things about cronuts. I mean I love croissants, but mixed with a donut? Oh yea, I am feeling the jive now. We tried the glazed and cinnamon. It wasn't light and fluffy, but definitely a soft crunch that packs the same old Rainbow flavor that this location only offers. Does this beat out my maple bar infatuation? Please don't make me choose! However, I will have to be so bold to say that this place keeps getting better. The family is great, the service is top notch, and it makes this Yelper proud to be Duke! Lastly, they mix the cronuts with fresh fruit if you so choose. That is definitely next on my list! Do I even need to say I will see you again Rainbow? Oh yea, probably next Sunday!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2014-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sLY8Qp8VJAM3oifDpk3hYw", "review_id": "bmwswD5q6N7dskwZygs_-Q", "text": "Good donuts. Great selection. Workers are always cheery. My kids love this place. Me too!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2014-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ILz91IZBkWafBHT2uqx53Q", "review_id": "_IwvM0bzoHk5dIRtW9jNJQ", "text": "BEST. DONUTS. EVER.\n\nSeriously, these are the best donuts I've ever eaten. I love donuts and I am ecstatic that I have found this place. We moved to Phoenix less than a month ago and this is a sign that we've moved to the right place.\n\nI've had a number of different types of donuts here and all have been great. While they seem simple, the glazed raised donuts are delicious. Cinnamon crumb = yum. The buttermilk bars are killer. The donuts holes are also really great. I haven't had any of what they consider \"fancy donuts\", but they look amazing. I also can't wait to try the croissants after reading the reviews here.\n\nYou can't even compare Rainbow Donuts to Dunkin' Donuts. They are in a completely different class altogether. The donuts here are so light, it's dangerous. I could eat way too many. The baker's dozen is 14 donuts, but I haven't gotten that many yet. These don't keep long, which is a great sign that they aren't full of preservatives or unnecessary ingredients. The two college-aged kids that work here are super friendly, even after they've been asked a million times what each donut is. \n\nUnfortunately (or maybe fortunately for my waistline), they run out early in the day. If this place was open for a late night donut run, I would be in trouble!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2014-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yXDSFOlhrTRGhK3EsPpqTA", "review_id": "a6YMZIF-bQFKBgslQSXBPQ", "text": "Perfect, homemade, local donut shop. They have so many different types and flavors. The croissants are the best I have ever had, someone in the back is an expert baker. Really nothing but perfection. They have a drive through if your interested in getting donuts in your pjs.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2014-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "II8FE2-OAI2whtnn8eF7QQ", "review_id": "udCBBsY2ENqW8vPDyd-Uwg", "text": "there bacon,ham,egg cheese sandwich !!!!!! there donuts are soft,warm,and fresh., simply delicious", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2015-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "v26k4Bzy9GiLLlSmDk8LfA", "review_id": "jiTbkv4g6dddXMgwdB7xwg", "text": "Holy smokes these donuts are amazing the cronut was amazing. They have so many choices here that you can find one you will love.  Thai iced tea was really good also. They also have a drive thru if you really want to be a fat ass and not be seen.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2015-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PA7iyQYEtzvzqeqIOjxPKw", "review_id": "9ZaNn3zlWP7If4Nbw6Jdxw", "text": "Everytime I drive to school I just have to stop here! The donuts are very fresh everyday and theyre delicious! The staff are always friendly especially the two young ladies. Mrs. Kim is my favorate because she has a nice smile and makes me laugh all the time! Sometimes she gives me an extra donut just because! If you want to be popular at school or work bring a couple dozens of these donuts. :)", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2015-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sBYsbO-7OBEEWWtbO6N1iw", "review_id": "_cB9-wxGMdJXMr-rAKdmlA", "text": "Blue berry cake donut, I'll devour your blue family. This mouth watering delicious berry jam packed flavor will have you begging for more, like a crying 4 year old girl who just got her ice cream stepped on at the zoo. Their jelly donuts, full of sweet nectar oozing out as you bite deep...the dough melts against your mouth. Ooooo lala", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2015-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KA-GVrDP0huPS7zs5tmS1Q", "review_id": "H6HqcBMeOaIAs84zdCgWiA", "text": "I love Rainbow Donuts!  Been coming in here for donuts for the last couple years and always have a wonderful experience and the iced coffee is really yummy too! :)", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2015-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sBYsbO-7OBEEWWtbO6N1iw", "review_id": "u7k-DjOWAjOg4T3t1UKlqQ", "text": "This place is like crack, be careful. One bite of that mouth watering delicious blueberry cake doughnut and you will have glorified taste buds leaping for joy and excitement. The jelly glazed melts in your mouth like crispy creme and the middle is filled more than Santa's sack on Christmas Eve. Yea they might be unsocial, they're up slaving their tail feather over hot stoves at 4am while your nuzzled up in your snuggy. This place is stellar. Huge long choc/vanilla twists oh my lanta", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2015-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NBXnXd0xEWnUR0Bje0VJeQ", "review_id": "NUjPN0CTinz6V7MEnQvjVA", "text": "Ok normally I can say I love dd. I really do but, this location bites balls. I went there and they did not have sausage for my breakfast sandwich. The was one. Strike two was when I went there this morning and they didn't have any ketchup! The worst was I overheard the workers saying they didn't want to make any more donuts for the day. I'm more of a bagel guy myself  but that wasn't the point. It was 11 am!!! What if some poor shlub  goes there at 2 or 3 pm looking for their favorite donut?? I don't know I'm warning you don't make the same mistake I made ... twice. It got two stars just cuz it's dd.", "business_id": "AhXcP_o5YAmCePKl0jxBXw", "stars": 2, "date": "2013-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xDZMGi1on-aagOHZtCqBTg", "review_id": "LN14NO26cEh_QYwu-_uQcg", "text": "Donuts were great.. Staff was surprised that I didn't want coffee. The brownie batter was soo good.", "business_id": "AhXcP_o5YAmCePKl0jxBXw", "stars": 4, "date": "2014-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S1FDwXm26UgoQcbaaUAtHg", "review_id": "T4Gbk_7Q1JJp3QTQnOtOoA", "text": "Stale donuts after 4 pm. This is the third time we have gone to this location after 4 pm. Happy a new location south of this one has opened on Tatum and G'way. The least the owner can do is offer donuts at half price after a particular time. Last time for this customer.", "business_id": "AhXcP_o5YAmCePKl0jxBXw", "stars": 1, "date": "2014-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9DYasJE3TtxptCcsZAyg1A", "review_id": "oea_ugN6LcInEqXoXEYr3Q", "text": "Dunkin Donuts s at the top of my list for an every day cup of coffee to start the day. As a kid I can remember my grandfather taking me to Dunkin Donuts to get a couple of dozen donuts for the family. Times have changed, and Dunkin Donuts now offers a variety of different breakfast sandwiches and wraps. One of my favorites is the good morning rap. It's pita style bread with egg and your choice of meat. Dunkin Donuts is also a great value unlike some of the other coffee houses in the neighborhood.", "business_id": "AhXcP_o5YAmCePKl0jxBXw", "stars": 5, "date": "2014-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ElpDvo770IaMeTDkFviTHQ", "review_id": "vWxpi30nNJtRDUfM98X9EQ", "text": "Out of business. They are closed. I tried calling two different numbers for it and both say that it is out of business", "business_id": "AhXcP_o5YAmCePKl0jxBXw", "stars": 1, "date": "2015-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qFZkU_iO6KjU-_5BptIu9A", "review_id": "vuk1UDG3DlD7B0u2xV57Wg", "text": "I got friendly, efficient service in the drive-thru on a weekday morning.  This is the closest location to my work, but not exactly on my way, so while I won't likely become a regular, I could see stopping through here every once in a while.", "business_id": "YDeM8-M4GwxyymCoV7Y-Tg", "stars": 4, "date": "2011-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-o3uGadqen-bc1HjMx_8Bw", "review_id": "N7bGzID0pkOADu7LNkw3ww", "text": "I love that this Dunkin' Donuts has a drive-thru. I wish other Dunkin' Donuts would follow their lead. This location is very convenient for me as it's near a gas station and just off the freeway. Somebody said they had slow service here. I've never had that problem. Took my husband here for a little breakfast date. Yes, we actually set the alarm and went here around 9AM. Love the donuts and the donut prices. Love that they have coolattas and pumpkin-spiced coffee near Halloween. Love the selection of donuts. I just wish the coffee prices were a little less and that's all that's keeping me from giving it 5 stars. Love the breakfast but I think you should get two breakfast wraps for a buck, not just one. This place is staffed by responsible teenages. It's a clean location with clean bathrooms.", "business_id": "YDeM8-M4GwxyymCoV7Y-Tg", "stars": 4, "date": "2012-03-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "UM95OVPBnI_tz77hFpcieg", "review_id": "Se7M5pnD5SAd4GhZTSg8mw", "text": "I've used their drive-thru many times. They're quick and competent. And of course, they're coffee is OUT OF THIS WORLD! :)\n\nThe service inside is a different story. Like one other reviewer wrote, they do tend to be slow and no one else seems willing to help to knock down the line. It can be frustrating. If time is a factor, I'd go with the drive-thru.", "business_id": "YDeM8-M4GwxyymCoV7Y-Tg", "stars": 4, "date": "2012-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6CcmjilbUSV2ro7Dtk9vTQ", "review_id": "_VZrl9XyOK0rslxCohvYCg", "text": "It's Dunkin Donuts...need I say anything more?  We went here every day for 7 days straight on vacation.  Everyone was super friendly and helpful.  The bagel sandwiches are the best!", "business_id": "YDeM8-M4GwxyymCoV7Y-Tg", "stars": 4, "date": "2012-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h6xgEc7WnbbBKkis4a7Yrw", "review_id": "mjpCZ2P2rh1Cz8fmLdn1GQ", "text": "I go to quite a few Dunkins in the area and this one is by far the best. All the employees here are friendly and remember me. Although the drive thru is slow sometimes. I feel as though the long played our speech at the intercom might have something to do with it. Some times I feel like they're joking with how slowly they say \"Weeeelllcome tooo Dunnnnkin Donutsssss, whattt are youuu drinkingggg?!\" But other than that they're pretty quick and don't cut you off while you order. \nI've sent my coffee back a few times for tasting watered down and have never had a problem. They're always so nice and quick to remake it for me. \nI would give 5 stars if it wasn't for the annoyingly long speech at the intercom.", "business_id": "YDeM8-M4GwxyymCoV7Y-Tg", "stars": 4, "date": "2013-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "374kh5ThlwYBJMEFNRgPLg", "review_id": "S36-ryVu_P2EHI8v6a6pIQ", "text": "The drive thru can be a little slow but not knowing what the person ahead of you is ordering, shat can you do. Overall everytime assocoates are really nice and get my order right, no issues.", "business_id": "YDeM8-M4GwxyymCoV7Y-Tg", "stars": 4, "date": "2013-05-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9HelM4DUF_k_nT44zUQkmw", "review_id": "u-dmq3B-0VTMJ4UGlDbKCQ", "text": "I go to this dunkin or the one on warner around 3-5 times a week. Normally my experiences are really good for most part and my company really loves dunkin for our company meetings as the owner used to own a bunch of locations in new mexico some years ago. I purchased several of the pre-paid coffee books around the holidays where you pay $12 and get 10 hot coffees, just using the booklet of vouchers. At both locations they always allow me to get a iced coffee even though the voucher says hot coffee and almost all the reps at the drive thrus have been more than accommodating and some have even gotten to recognize me as a regular. WELL this morning that came to a halt as I went thru this drive thru on my way to work the MANAGER (WHO HIMSELF WAS WORKING THE DRIVE THRU WINDOW) COLDLY informed me that he would no longer honor that, and I replied that they had always done so at multiple locations, He reminded me that he was the manager and he would make sure it would never be honored again. I could not believe the rudeness of this manager, and I am in customer service management. From here on out I will take my business to the location on warner, not that this manager will probably care.", "business_id": "YDeM8-M4GwxyymCoV7Y-Tg", "stars": 2, "date": "2013-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RnQ1ITkPcYfKKvYeROC-eg", "review_id": "fA60cpwyvMG9kaueXRNqYQ", "text": "Best deal in town. Bring in your own cup (mine is 16oz) and get a coffee for $1.07. First refill free. Consistent coffee, usually a table free because of plenty of seats. I regularly office here when I'm looking to get away from my desk.", "business_id": "YDeM8-M4GwxyymCoV7Y-Tg", "stars": 5, "date": "2014-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jrbVZHhMH3e2xW3c08sMxQ", "review_id": "X37-9OB1oUUGCq25-bAoOQ", "text": "I was grabbing breakfast for me. & a friend & went through the drive through. I ordered two #5's (bacon, egg & cheese on bagel + coffee + hash browns) and 2 orange juices.\n\nI didn't get the coffee, but assumed they just subbed the orange juice. Not a huge deal. However, after driving away and eventually opening the bag I realized they didn't put egg on the sand witches & forgot the hash browns as well. I drove back & went in. I told the counter girl that The sandwiches were wrong & I didn't get hash browns. They gave me a new bag & I hurried off after being so delayed.\n\nTurns out they just put egg on the already cold sandwiches I handed them back & still forgot the hash browns. \n\nNever again.\n\nThe", "business_id": "YDeM8-M4GwxyymCoV7Y-Tg", "stars": 1, "date": "2014-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FH3bIJ0alVkXHTY0-k7xpg", "review_id": "0Jo048ldDjswUn8rFW7GaQ", "text": "This location has the most awesome staff very friendly and courteous so why the 2 stars you ask ? Well perhaps their speed dictates their inability to get my order correct. I take my son's dog for a ride every Saturday or Sunday to get breakfast (his human is deployed ) at this location the last 3 times my order has been wrong, I order a sausage egg and cheese croissant they gave me a bagel sandwich the next time I'm missing a bagel and today I asked for coffee with cream I get a coffee with cream and sugar. The sad part is every time I order they read it back to me and it's correct then I receive it and it's wrong .......", "business_id": "YDeM8-M4GwxyymCoV7Y-Tg", "stars": 2, "date": "2015-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Syc4pbEkL3bbzjO4X4HhQw", "review_id": "8H5VSSMoEZ3d3AE6CUZlFQ", "text": "gotta love dairy queen.  This one has good service and seems clean.", "business_id": "zvFhC2Lywo6e8UaRTVj7sw", "stars": 4, "date": "2012-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2LK4oBAIjqMKPQx3j9rYIw", "review_id": "72tGB0waR-B1c-wP-HIK6A", "text": "Best donuts we have ever had.  Get a box of glazed and sugar, heat them up a little, and you will understand what it means to be truly happy!", "business_id": "3wkH1sL4tojmaveP1jNiIA", "stars": 5, "date": "2014-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sCYPGABWHws1H8rDt_Vbcw", "review_id": "vZ_If5npc-9hc8de3HU8jg", "text": "Super delicious! Best donuts in the area, much better than Krispy Kreme and Dunkin donuts", "business_id": "3wkH1sL4tojmaveP1jNiIA", "stars": 5, "date": "2014-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a9Oc-867R8ngDeZ2KprJ9Q", "review_id": "_6FlW1Ypk09zGbWOIVbHUQ", "text": "These donuts are SUPER delicious. The atmosphere is warm and friendly and the sister's, who own the shop, are very nice. Best raspberry filled donuts in town!", "business_id": "3wkH1sL4tojmaveP1jNiIA", "stars": 5, "date": "2014-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "oC-oBkCwM2aa0TLX2TI3Vg", "review_id": "0ng495QLD5K0ojYC1rxIgQ", "text": "One word....YUM! I had the buttermilk. It was amazing. I'm still thinking about it 12 hours later. Can't wait to stop in next time I'm in Glendale. Oh, and $5 for 6 delicious donuts - can't beat that!", "business_id": "3wkH1sL4tojmaveP1jNiIA", "stars": 5, "date": "2014-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rApoADF-kHM8wQHmQA6p3Q", "review_id": "qMwaJ9zRNgRSVPfN6hb2EQ", "text": "I first stepped in the door a bit disappointed only seeing the Mexican bakery treats but a few more steps in they have huge mouthwatering doughnuts and at a good price. Good thing I ignored my initial reaction. They have amazing Oreo doughnuts I still have dreams about and I'm not a big doughnut person. I am going to dock them a point because I wasn't too impressed with the selection but what they did have was great!", "business_id": "bZPEg3lCFSbJn_PczJyRBQ", "stars": 4, "date": "2012-03-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "2xT5vWxvgnyov-y_edwW5w", "review_id": "aUN9k1genI6qIbZXD5n7ig", "text": "I was totally craving donuts... Stopped by here... Really scary place to walk into,, something you would see on the show the WIRE or the Corner,, well anyways...  There were 2 hispanic ladies working there,, they had a good selection of donuts as well as rolls...  I got the texas sized cinnanon bun and the glazed.... I really enjoyed them.... They are like 3x the size of a normal donut...  Good Prices and a Good donut,,, I totally recommend this joint,, if you dont mind the decor...", "business_id": "bZPEg3lCFSbJn_PczJyRBQ", "stars": 4, "date": "2012-05-09", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "jgq53NrxuIHUka8fGe39lA", "review_id": "7-Hr4-4AYAY6nAtLWINb8g", "text": "This place is delicious and always fresh. I swear that when they see someone pull up, they drop a fresh batch of donuts. Granted the decor and set up is a bit sketch, it's the product that matters. So if you're brave enough to not judge a place by it's outward appearance, you're in for the most delicious donuts in North Town.", "business_id": "bZPEg3lCFSbJn_PczJyRBQ", "stars": 5, "date": "2014-04-23", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 3}, "user_id": "5lq4LkrviYgQ4LJNsBYHcA", "review_id": "hwYWRBbMNI4C1csiLkkkPw", "text": "Items Selected:\nLarge Apple Fritter\nOld Fashioned\nButtermilk Bar\nBear Claw\nCrumb Cake\n\nLocated in North Las Vegas with the sort of dingy confines that makes one wonder exactly how the place has remained in business for so long it was late-morning when I stopped in to Real Donuts on East Lake Mead, and fortunate to find a new batch of fried treats immerging fresh from the kitchen as I arrived a $6 order was placed, the lone English speaking clerk providing excellent service and explaining a number of the Hispanic baked goods to me, as well, until a few more patrons arrived.\n\nEschewing boxes in favor of bags, and as such sort of haphazardly packing my quintet of donuts with a wad of napkins, it was at a small table in the narrow space that I sat to enjoy and with several families filtering in and out the doors throughout the fifteen-minutes that followed an answer to the earlier proposed question arose, almost every person that entered greeted as a regular with several on a first name basis grabbing a dozen or more colorful pan dulce to go.\n\nHappy to find three of my five selections still-warm to the touch it was with the buttermilk bar that the tasting began and eating only halves to preserve room for a long day of eating I immediately knew restraint would be a challenge, the simple glaze not over applied and thus allowing the tangy interior to shine, a similar sort of experience offered by the sour cream old fashioned that followed - each bite melting on the tongue until the whole cog-wheel was gone.\n\nFinding a great deal of disappointment in the Bear Claw, a doughy yeasted 12oz belly-bomb that was questionably fresh with sickeningly sweet apple pie filling inside, it was after only a small bite that the rest was discarded and somewhat returning to form with a soft cinnamon round topped in sugary crumbles it was with the the 'jumbo' apple fritter that the experience finished, the exterior not quite as crisp as the superlative versions at Ace or Friendly but the pillow-soft interior rife with cinnamon and large pockets of sugar-soaked fruit and not a hint of grease.\n\nNot exactly in the nicest part of town, nor to be mistaken for the doughnuttery of a similar name on West Charleston, Real Donuts of North Las Vegas is another mom 'n pop spot worth checking out for those in the area, the donuts themselves nothing that cannot be found better elsewhere but the popular Mexican pastries perhaps worth a second look.", "business_id": "bZPEg3lCFSbJn_PczJyRBQ", "stars": 3, "date": "2015-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "QMTQNQmp4hQ2o6hkRX_Uxg", "review_id": "TEvh9qLJB80I_vVNnnpljw", "text": "KKD has always been a nice place to take the entire family for fun and most of all doughnuts. I like this location because you can see them making doughnuts but when I was in store no one had on gloves at all. Now everyone was friendly and all but I would like to see them use gloves or at least wash their hands. Everything was just ok even the doughnuts themselves. So I give it 3 stars and next time I wont buy anything unless gloves are on. Truth is I didn't buy this time the husband did.", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 3, "date": "2013-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QQ6xqoM2aoiaps7ZQAaFAQ", "review_id": "Rf6fEVRmzN_tKKLKHHRKvQ", "text": "The cashier I think she was wearing a green shirt was super happy and full of smiles this morning at around 7:30 this morning. The other lady didn't look so happy but was nice  and helpful when I asked for my dozen.", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 5, "date": "2014-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "c2f8tjv353FLSX6L7mLh8g", "review_id": "Sn09G5D8xvCP2pVL0jOKPg", "text": "I was a new customer who never tried Krispy Kream donuts before. I walked in, browsed the menu and looked at some donuts in the case. The girl working asked if I needed help and I said \"yes I have never had your donuts before and I was wondering if I can sample a plain glazed donut\" she says.... \"Wait! Are you gonna buy something, because I only give samples to the people that buy something.\" I was absolutely floored by her lack of professionalism. I have never been profiled in such a manner nor have I ever encountered such terrible customer service. She definitely scared off a new customer and I will not ever return to this location or recommend it!", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 1, "date": "2015-03-19", "type": "review"}
{"votes": {"funny": 30, "useful": 46, "cool": 39}, "user_id": "2HmHgW3hRYvXYFmQyQtLuw", "review_id": "gzSQ4IoSELKZYPRXB1DPyw", "text": "I came by specifically to try a \"Honey Bee Doughnut\" that a few people told me about. I knew I wouldn't be able to handle a whole dozen from KK because I find the doughnuts to be too sweet and they just don't have that mom & pop quality that I can find around town and personally enjoy more, so I just picked out 4 doughnuts during this trip. Since it was Sunday morning they were busy, but the employees did a good job and helping customers and I was in and out in about 10 minutes. One thing I have experienced at this location over the years is that if sign is flashing HOT NOW it doesn't always mean that the glazed are \"hot now\" which is a bummer. A lot of people (myself included) come here only for the fresh, hot, glazed doughnut of goodness and it sucks when they aren't hot! \n\nOriginal Glazed ($1) - When these tasty gems are fresh and hot is when they are best. This last visit the light was on and the glazed actually were nice and hot! Soft and just the right sweetness. The hot glazed are the only reason (OK well maybe the chocolate iced custard filled too) worth making a trip to KK in my opinion. \n\nHoney Bee Doughnut ($1.59) - This was a glazed doughnut with some yellow icing on top of that with chocolate drizzled on top and a candy bee. I love the original glazed, but this one with extra icing was way too sweet for me. I ate half and then couldn't handle all the sugar.  The honey bee decoration was very cute, but rock hard. The whole doughnut was very cute looking yet just too sweet for me to get again.\n\nOreo Dirt Cake Doughnut ($1.59) - Has filling and cookie pieces inside with chocolate icing and cookie crumbles and a gummy worm on top. Another cute doughnut. The gummy worm was half hard, but the rest of the doughnut wasn't bad and it wasn't great to me however my hubby really liked it.\n\nGlazed Raspberry Filled ($1.10) - Glazed on the outside and raspberry filling inside. The glazed part was very good, but the raspberry filling wasn't good.\n\nThere is a drive-thru and tables inside.", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 3, "date": "2015-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HtQA4tihAkXtoiKqLVJFUw", "review_id": "IfcUYwRURSEQbE1b5mRBQQ", "text": "The doughnuts here are amazing, but the customer service is horrible! The girl who helped us (Karina) was super unfriendly and rolled her eyes every time we tried to order something. The one man was super pleasant making the doughnuts and waved at my nephew but the 2 girls working on Monday were very rude! I would expect a place like this to be kid friendly but she wouldn't even listen to my nephew when he asked her a question, she ignored him! Definitely not coming back here because of the customer service! Hire new people and I'd love to come back, until then the girls should check their attitudes!", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 1, "date": "2015-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3MXhNhAb4esNDJ9AorR5rg", "review_id": "jLVdtA9G9FlLdpNdHYuHwQ", "text": "My favorite dounuts in Vegas hands down I've tried all the others and chains but they blow them away never had a bad dounut here they were jus in the weekly as a good cheap eats but they said the service was spotty I always go at 5am when I get off work you can smell delcious goodness blocks away defintly a nice treat", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2010-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "ov_2PW8xiMC1EevMV48zIw", "review_id": "7EBPpYqbqTfdyNXuS9dZMw", "text": "Real Donuts are the real deal. One of the best in the valley. The basic glaze donut is spectacular. Everything else I have tried has been quite good as well. They have mastered the art of not having dry donuts in the desert. With the apple fritters and the cake donuts the exterior has a nice light crunch with a slightly moist, yet fluffy interior. Staff behind the counter is always cool too. Why settle for grocery store nuts of the dough when you can indulge in these tasty fried delights?", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 4, "date": "2011-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BuxcnkKvZhr0U4lxmcnRkg", "review_id": "I_1MxXu3wvZpLVIhcDp2FA", "text": "Best donuts ever.  Delicious, fresh, good selection.  Very friendly welcoming staff.  A dozen donuts and 2 milks was just $10.50.  I will be back for sure.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2013-03-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3Zekz0Gpc3QlrUdI9dSUJA", "review_id": "n3oF3xSnWpjyK5eVsxPh2w", "text": "The do-nut ended it's life in the trash. The Apple Fritter was very greasy (still tasting the grease on the roof of my mouth). I did not expect to eat a tub of Crisco, after just one small piece of it. Don't waste time here.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 1, "date": "2013-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_m8mIXkTTqbH5eWGfPNBEg", "review_id": "aeGMCJQD0p7cOCZ1EGQ_dA", "text": "The donuts were fresh and delicious. The apple fritter was perfectly cooked. The cake donuts were a magical blend of crispy and moist. My kids approved of the chocolate frosting.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2014-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xaPZT4puSftLfrnseM-LOA", "review_id": "7gtgRK2rqFoRWu3Sxyetrg", "text": "Thank god this is close to my home. They do have the best donuts in town.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2014-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "38JK-SfO9NkAGs1RwlH2Gw", "review_id": "Ysf6KHL5cvv2Rc31muKW_g", "text": "This location is part of a small local chain of donut shops that has received some love by the local press.   I picked up a much anticipated blueberry fritter and less anticipated (spur of the moment) inverted cinnamon roll on our recent vacation.  Each was on the  smallish side both in size and price (only $1 each).  Both were grease free and tasty.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 3, "date": "2014-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gei_Q2AczkTleALkFgkmPg", "review_id": "0xeslpXv5OcnCuaR3dHKXQ", "text": "My first time there and the young I would say pacific island young lady was  semi friendly it was early right at opening I got there. However She began to warm up as we were choosing the doughnuts we wanted. 2nd time I went was last week , week and few days, and a lady I would say in her mid 30 to early 40 maybe assisted me. I walked in yet again right close to opening, as I walked in I noticed PRE-PAK BOX of doughnuts to my curiosity I asked, oh what are those , I will take one of those since they are ready to go. she then said OH those are on reserve , I said oh, well why don't you have a sign on them, she said they are DAY OLD they sell from the previous night for 5.00 a box of 21 doughnuts and ALL boxes are Reserved. Well here I am at 415-425 am first customer probably in the door, and here comes another customer, a Male who grabs a box of those SAME doughnuts and proceeds to the counter to PAY. As I am finishing my selection of buying my 9.00 dozen, it ERKED me to know she has not said a word to him about these RESERVED Doughnuts. So I did \n\nThen she went in hyper voice aka Busted voice, and told him They are on reserve , and I told HER, Then you shouldn't have out for ,customer perception of thinking they can grab and go, or you need to label them as reserved or you need to keep them in the back as reserved items Should be located . Needless to say she Heard NONE of my suggestions just kept RUNNING her MOUTH of Guiltless that Customer Was like Oh these are the day old Doughnuts for $5 a box, I said Oh I know I just learned that just NOW. However she told me they are on RESERVE, she then turned to him and said Yes they are, That customer, got angry and walked out without further word \n\nI paid my $9.00 only because they were already selected and in a box, but I surely FELT very cheated and very robed. As it should NOT be a RESERVED STATUS ON DAY OLD DOUGHNUTS. But rather a First Come First Serve Basis Period. \n\nNeedless to say. 2nd time was not an invite to Return BACK . \n\nDoughnuts were a bit sweet, however the cake one with cream in the middle was beginning to be one of my likes, as it was one that was in the middle of the road.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 3, "date": "2014-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cvUY4e-Nb-lQkF5_xWSWyw", "review_id": "0_JFqn0GbIy3xuteA7DY5g", "text": "I finally gave into my craving for an old fashioned warm, sweet donut.  Walked in a few minutes after closing time and was still able to purchase some yummy, fresh donuts.  Owner's son was super sweet and full of personality.  Will definitely be back.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2014-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "i2WtuJSlal7Jq2-dAYltxw", "review_id": "qmiJsgW24X4ovlqFlN3gDw", "text": "The donuts were crispy on the outside and moist and delicious on the inside.  What made this place great was the service. Extremely friendly! Overall an outstanding experience.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 4, "date": "2014-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ay5HHnwnPHNDRKQusO89CQ", "review_id": "-NXlrWgBDdsruf98vPfjkg", "text": "We moved here form Los Angeles and have several great old school donut famous donut spots to choose from, it was hard to find a \"REAl\" donut  n Vegas. Until now... Real Donuts is the REAL DEAL.. Best spot in town for great donuts.. No fu fu  stuff.. Just good ole down to earth donuts that you simply can't stop eating...  We drive 25 min one way to get them...", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2014-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4xBnAphiDdC-FLVHC_rovA", "review_id": "jpHErZTxsw27iD0rIOA4jA", "text": "I think of myself as kind of a donut expert. And with all of my experience I can honestly say that this is the BEST donut place in Las Vegas! Though I live 30 minutes away from this little piece of heaven, I can't help but make the trip weekly. Fresh, delicious, REAL!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2014-05-05", "type": "review"}
