{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Dzc2m6O4vaXCF4ztKPjTcQ", "review_id": "cuGwE87hHuQEptNx6SuqaQ", "text": "I usually go here because they have some Halal dishes but it's definitely not my \"go -to\" place for Halal.  I find that I have to be in the mood for it in order to really enjoy it.  However, my husband swears by their chicken and I do really enjoy their kefta with rice.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 2, "date": "2011-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Dzc2m6O4vaXCF4ztKPjTcQ", "review_id": "iBtJEYn2hEKPhH4Y1SPmmw", "text": "Updated review,\nI have to give them more stars. For one they have pretty tasty food once I tried more dishes.  The cucumber sauce on the side also really good.  It has also become my stop for mousaka! Mmmm", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2011-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vUjijMGo6KnfNyQfV0Eadg", "review_id": "nFkvsN0w-5YZfnkYtCz1cg", "text": "We will drive from Dudgeon Monroe to the East side for good falafel and gyros. The quality and service at People's Bakery are a great reminder why the (much closer) Biryani doesn't deserve our business. Skip the babaganoush, but make sure to grab a sweet treat for dessert instead!", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2012-03-31", "type": "review"}
{"votes": {"funny": 3, "useful": 11, "cool": 6}, "user_id": "uILpE4ihC09BBdNf7LgDHw", "review_id": "3LzCNveFge_A3Yfos8r64w", "text": "This place is so accidental hipster, and defies categorization. Is it a diner? A bakery? An auntie's living room? Let's just say if a donut shop and a small restaurant played Tetris, this would be the result. \n\nThe eating area is quiet - no music, just the drink cooler humming - and the experience eclectic - mismatched formica tables, plastic cups for water, and tea cups with feet for the Turkish coffee. The Turkish coffee was weaker than expected, but wonderfully aromatized with cardamom. \n\nThere was so much food my eyes pin-balled for a minute. The red lentil soup made with sprouted lentils came in a bowl - a real bowl, not a cup-sized bowl. We also had the gyro plate which was satisfying, and mousaka entree which was like an eggplant, potato, and tomato casserole over yellow rice. By itself, the mousaka would last me two additional meals. We couldn't resist the Boston creme donut, which turned out to be the best I've had in Madison, and a gigantic cinnamon roll fritter. Plus the two coffees, the total came out to be $25 (!!) and some change. \n\nThe service is a relaxed pace, but the owners were charming and seemed to enjoy us enjoying their food. My five-star ratings often depend on how likely and how often I would return, and this place definitely makes the twice-a-month cut.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2013-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "llH1JSmbgk0YULWSbNQPTA", "text": "Solid donut shop.\n\n+ Nice parking lot\n+ Great selection of donuts available, even at 11:30am on a Sunday (most other places are sold out)\n+ Totally reasonable prices\n+ Donuts are good; I'd say on par with most places, but not quite as good as Greenbush\n- Presentation/cabinet could use some work - very narrow space and it's nearly impossible to see what's available", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 3, "date": "2014-03-10", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 4}, "user_id": "0zN7L4c5Z5rdpg2KYpwO-g", "review_id": "jIa77173zuL09OxV3KNJwg", "text": "Some secrets are best kept secret.  However I don't want my new donuts find going out of business anytime soon.  I stumbled across this little gem while trying to find some real donuts for my wife to take to her at work.  I found the People's Bakery.  The donuts selection was wonderful.  The wall mentioned some other baked goods as you walk in like scones, but those are no longer available.  The donuts were fantastic.  So good that I had to go back today and they are still fantastic and the shelves were socked full at 9:30am with plenty of choices and the prices are great.  \nTo be honest i had tunnel vision on the donuts but I believe they have some other things to offer for lunch and dinner.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2014-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "H_56u4SCDlguZxRnM6CwLg", "review_id": "XgKqNYDzBporO45GDl_CQQ", "text": "I love these guys - the best - BEST - donuts any where in the world, the universe.  Great gyros, falafel and Nabeel and Mary are simply wonderful", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2014-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9bjtN0O_YEFnxGmrsZG5FQ", "review_id": "eqkKbcLyvbpEYaMVTSXLTg", "text": "Best falafel in the midwest, and I've tried dozens.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2015-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CRyOc3Njbf0jtRptTs5s2w", "review_id": "G8MjyfzejY_WYJXQEaQaFg", "text": "They aren't anywhere near as good as Greenbush Bakery but there prices are good and if you're close there an alright choice.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 3, "date": "2015-03-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6mEp6ps4oQZsGLFAfN9HLQ", "review_id": "LJmZAB20o1DZ338xXADq-Q", "text": "At work, while trying to decide where to order dinner, a co-worker suggested People's Bakery.  I had the Lamb Kabobs, and they were so yummy!  The meat could have been trimmed a little better, but they were so well seasoned.  It came with lots of yellow rice, and some green pepper and onions.  It was very fast and not too expensive (around $13).  I will definitely order from here again!", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2015-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gctXeL-aGD3u-tAxhXuKJw", "review_id": "s5rTJnlqjilamapXDDewFQ", "text": "Great Mediterranean food and friendly owners. They also make delicious kosher doughnuts!", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2015-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PARV-ZGhCvTsAGGFPtnl6g", "review_id": "XWF8HWmdONS04twabIcmjw", "text": "You don't want to come here if you are looking for a fantastic dining atmosphere, but you can't beat it for great take-out.  The falafel is amazing!  Their hummus doesn't come close to competing with Banzo, but the prices are quite a bit cheaper.  You can walk out with two falafel pita sandwiches for under ten dollars.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2015-04-23", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "BZWZRyV2Odi6WbjHdEfuIQ", "review_id": "9hNpyLDUSUdygrrRUEVO0w", "text": "I like this place. When I go I almost always order the mixed grill (chicken and lamb kebab) with rice! and a side of plain yogurt. I haven't really tried any other dishes so I can't comment on those.\n\nThe service is consistently good. The prices are definitely reasonable.\n\nIt's probably up to par with Aladdin's (also in sq. hill) and Ali's (s.craig st.) \nbut for some reason, i prefer mediterranean grill.", "business_id": "atG_rkb3fONGcw4fupbY9g", "stars": 4, "date": "2008-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5I0cmrbtw_xYopXcrGchqw", "review_id": "LKhLK3wpyJp7poeMmuC1Jw", "text": "I loved this place, if you like dolma (grape leaves) and like lemons then this place has the best dolma ever! I have tried grape leaves at just about every mediterranean place I have ever been to, and these are by far my favorite. As to the rest of the food I am not sure I remember, because it was all secondary to the real reason I was there! The best grape leaves!\n\nThe flavors here are very good, and distinct. Some of my friends preferred Aladdins down the way but I was never impressed there... (The food seemed bland).\n\nIf you are going for ambiance, definitely pass on this place, it is a random office looking space in the basement of a non descript building, as someone else said it really looks like you are going to a dentists office...\n\np.s. try the grape leaves!", "business_id": "atG_rkb3fONGcw4fupbY9g", "stars": 4, "date": "2008-04-29", "type": "review"}
