{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "F5WW6egmmUrIWRI_ZNpbEA", "review_id": "Godnrk_9bLe9aEJfvcWB8g", "text": "Namaste is not the best Indian food in the area, but it's the closest to our house, and we go for their lunch buffet, which I will rate as good, but not great. They almost always have that Indian buffet staple, channa masala, and maybe 2 or 3 other veggie dishes, a couple of meat selections, such as lamb curry or chicken tikka masala, and a cold salad bar with lettuce and raw veggies, pickles, chaat masala and raita. If you arrive early and not all of the items are out on the buffet, they bring it to your table, which is nice. Dessert is almost always gulab jamun and chai tea, which you help yourself to. On a couple of our visits, they had tandoor chicken wings, and they were to die for, but these aren't always available.  I would have rated this place 4 stars, but it can be inconsistent from visit to visit.", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 3, "date": "2011-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "VwguAVYM-YEZCoWwjTbJDw", "review_id": "Yq4fIgdKns8WO_bfcZBa5g", "text": "This was probably one of the worst places I've eaten at in a while . I'm not sure what was worse food or service . Never again , the coupon we bought and weren't allowed to use left on the table", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 1, "date": "2013-03-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "EvNdZDSReZNRkPYjKjvtzw", "review_id": "oVCAXMTcciJpEzmnWnRTsg", "text": "Hard to complain too much about a $7 buffet.   Food wasn't bad,  I've certainly had worse Indian in Pittsburgh.   Limited selection that they don't refill often enough.   Odd atmosphere,  they need some background music or something.  The soap opera on tv just didn't cut it.  They do give you fresh naan bread which is nice, old buffet naan always sucks.  Good if you're in the area and need a cheap lunch but not worth going out of your way for.", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 3, "date": "2013-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vJxXGprSf3ZQkvOfmldPFw", "review_id": "GRVZ2xue-fHGTQFY8kDrGQ", "text": "I wish I could give this place \"-5\" stars for its terrible food quality. Oily, greasy and bad taste. All 4 members of our party fell sick, throwing up and/or with a running stomach.", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 1, "date": "2014-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qcF0ltzTbwfPanErrov8Og", "review_id": "QaI4FAYIZ4btOTV11kAAJA", "text": "First off i have no idea what these people are talking about when they speak of and mean old lady. The lady was extremely nice to me. We even had a few laughs while trying to communicate with abit of a langue barrier. The only down side to it was the low spicy flavor. I have a high tolerance spicy heat. She tried to hook me up a big bowl of wet crushed peppers and more powder. And the white rice was a tad dried out but never the less all other items where great.", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 4, "date": "2015-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wUVStlKq-5bX8jWmNc_vFw", "review_id": "YBy00XQ2ygX6hW4u0DQpmQ", "text": "It's kinda strange when you enter because you literally hit the hotel's registration counter, and then you wonder where the restaurant is because it looks like the hotel couldn't fit a restaurant.  It's to the left of the counter.  \n\nAnyhow, I have mixed feelings.  One, it's a huge buffet.  Two, it's cheap (8.99 for dinner, maybe 7.99? for lunch) and includes all you can drink soda, chai, etc.  Three, mango lassi is part of the buffet.  Four, the food on the buffet can be very strange.  \n\nSo, pricewise, when you include free drinks/mango lassi, it's damn worth it, as long as you can find two or three other items you like.  On the other hand, you may not like anything at all on the buffet.  \n\nTheir nan is average in texture but has garlic and herbs, so it's now foccacia nan and tastes delicious.  Papadum is done well.  Lamb kabobs are good, but I wish they had lamb curry.  Their selection of meat is small relative to the size of the buffet.\n\nOn the other hand, they have plenty of vegetarian items, but I prefer to avoid cream, butter and cheese that I didn't eat much of them.  I did try the spinach and they have the most wonderful version of spinach: it's cheesy spinach (but doesn't look like there's melted cheese in it).  Awesome.  \n\nBut then again, their chickpeas were in a sauce that tasted like a combination of spaghetti sauce and ketchup-- yuck!\n\nI suppose this place is geared to fat vegetarians who can have dairy.  Oh, and the atmosphere is pretty lonesome.  It was probably once the grand dining hall of the hotel and now kinda ghostly.  I think it's worth an initial visit and worth it for budget eaters.", "business_id": "8tBfgYCI6Fz9xrSYCYCYXA", "stars": 3, "date": "2007-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PUFPaY9KxDAcGqfsorJp3Q", "review_id": "83pq36O1PDYPkh6WWOnMUQ", "text": "The atmosphere in this place does leave something to be desired, but\nI have always left relatively satisfied. The food isn't quite as good as India Garden, but the buffet selection is bigger, and it's less expensive. With Indian food, I only eat bread and meat dishes, they usually have 4 meat selections:  chicken curry, chicken in a cream sauce, a grilled chicken with spice, and the 4th varies. Overall, worth a stop if you are in the neighborhood.", "business_id": "8tBfgYCI6Fz9xrSYCYCYXA", "stars": 4, "date": "2009-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F5WW6egmmUrIWRI_ZNpbEA", "review_id": "6EQfsGX8AwVoB_39sHkDAw", "text": "Maharaja is located in the Days Inn on Banksville Rd, and we tried it one day for lunch. Not really understanding the positive reviews here, but to each his/her own. I found the food watery, overcooked (even by Indian food standards) and tasteless. There seemed to be no care in preparation of the dishes, so that the vegetables weren't cut into the same sizes, each dish tasted much like the other, and the food didn't even look attractive. I don't mind divey surroundings, but I abhor a smelly old carpet, and they have wall to wall carpeting that was around before most of us were. They offer mango lassi which they keep in the original gallon plastic jug that they bought it in...at least pretend that you made it. There are 2 better Indian restaurants a stones throw from this place...Namaste and Mintt, both across the street.", "business_id": "8tBfgYCI6Fz9xrSYCYCYXA", "stars": 1, "date": "2011-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wVY1PBPjdc8Hju58R2uc-Q", "review_id": "xh-9c5h4D9XZE3BkFg7dRQ", "text": "This is pretty close to where we live so we eat there quite a bit. Freshness of food really is hit or miss. I like all of the veggie options there. I think it's a great place to take someone who has never had Indian food. Buffet style lets someone new to this kind of food try a bit of everything. The mango lassi is always delicious! I like that it's NEVER busy, crowded or loud. Anytime we want to to relax for weekend lunch, we head there for the chilled out environment. They are currently undergoing a remodel, so I am looking forward to seeing what it looks like when they are finished.", "business_id": "8tBfgYCI6Fz9xrSYCYCYXA", "stars": 3, "date": "2011-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w0e1FBoD6IZhWoKtFZ8g0w", "review_id": "zETm9D6EZdPDw38TIydEGQ", "text": "This is probably the best north indian restaurant in Pittsburgh (Lawrenceville/Bloomfield). A bit of a dive with a traditional menu but the food is made fresh and the prices can't be beat.  The lunch buffet is a prety good deal (much less than $10!).", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 3, "date": "2007-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fPHkuVye-RlFgxzmgrCKtQ", "review_id": "MzHjFi6w_rZylNpGLBnK4Q", "text": "Way better than India Garden. The interior isnt that great, but the food more than makes up for it. The buffet is a great price and you get a good selection.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 4, "date": "2010-05-30", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "u1KESST6ATusVrn7F6HUvw", "review_id": "NCa2KbgLFLnXmXUPIeJrHA", "text": "Cheap, yummy, and down the street from my house.  Down side?  Anyone?\n\nI won't go in to the particulars--I agree with some of the comments below--I will remind people that it's BYOB (I really think Indian food tastes so much better with a beer) so come prepared.  \n\nI would not call it life-alteringly-good Indian, but I've found much of the food to be flavorful and the service has always been friendly, if a bit slow at times.  \n\nDecor is typical--seems like a kid-friendly place and good for large groups as well.  \n\nOh, and they're closed on Sundays, for which I'm happy for them, but I have to admit I would probably go more often if I could grab take-out on a cold sunday afternoon. . . (that's a hint if the owners are reading)", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 4, "date": "2011-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OJiGPNojqq4C8v-KRnDk4w", "review_id": "kmrkIZbEsRuSUZReisZYZA", "text": "The lunch buffet? Totally worth it.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 3, "date": "2012-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "tAKjY3bQXH51msJbOHYPmQ", "review_id": "lhNbtco5V5G6n7ZYOGjmfA", "text": "I have only gone to People's two times, and only for the lunch buffet, but I have to say that both times were pleasant.\n\nPeople's is a small 'family' Indian restaurant, with a LOT of tables, and the last time I went, a LOT of people filling those seats.\n\nAs with most Indian lunch buffets, the offerings are basic and of a very low spice level - but tasty in their 'homogenized' way. It's VERY inexpensive, and worth the all-you-can-eat.  They offer several meat and non-meat choices, plenty of sides, rice, nan, salads, chutneys - and even a pretty yummy hot chai tea that is very creamy and sweet.\n\nThe service is pleasant, and the atmosphere is comfortable.  Although when they're really busy, you may be forced to make a new friend at the next table, which really is pretty much the same as them sitting at YOUR table.\n\nThe crowd was interesting as well, students en masse, single diners, and pairs - all seeming a little more on the intellectual end of the scale than one might normally see in da burgh.\n\nMy only disappointment was the palak paneer which had potato instead of the cheese...although I may have just read the sign wrong, and it wasn't really palak paneer.  The chicken dish was absolutely delicious, and the samosa were yummy.\n\nCan't do Indian food without a big ol' samosa with the green mint chutney sauce.\n\nGenerally, nothing uber-fancy, but definitely worth a try.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 3, "date": "2012-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ijjKdgC3YNTa0JVU3jIDtw", "review_id": "UYBeXKiZO6_8XCdMJz_SmA", "text": "The lunch buffet on Saturday is great hangover food.  it is cheap, hot, refreshed often, and has the standard selection.  I love going here.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 4, "date": "2013-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pbTCJlpf7JDjkVIrzJ6Z-w", "review_id": "IRDS6hNChPQAjLgNWMPmHw", "text": "Peoples is my  favorite delivery place! Love the garlic nan but I will say it's better in house than delivered. The mango chicken is delicious. We always order a biryani rice dish. From the vegetarian list love the vegetable Shia korma- but will mention it is very rich, the aloo sagg, and the shai kofta- also quite rich. The lunch buffet is good and love that you can have chai with it because their chia is tasty. It's funny we never eat in for dinner so I have no idea what that's like. But yeah take out for dinner and buffet for lunch. Love!", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 4, "date": "2014-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "lq1nrAfDoCXriVTCcFG6xQ", "review_id": "1Q3d0kM-51_woH-jGecS6g", "text": "I ordered chicken vindaloo at spice level 10 and garlic nan as take out.\n\nThe chicken vindaloo was quality.  I enjoyed it.  It wasn't super spicy, but I'm used to that.  I've never found Indian food with the same level of heat as I've had in England.\n\nThe garlic nan was amazing.  Nice garlic smell, visible chunks of garlic, nicely toasted bread, everything about it was very good.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 4, "date": "2014-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1f-m_nZYyNZCvVQDuW6rnA", "review_id": "z-kjYpI4Mzb-eKDg2A8PHA", "text": "Terrible. \n\nAt this very moment I am currently cursing my People's Indian Restaurant's lunch. I ordered it with a a friend at work and while the ordering process was fairly simple (grub-hub) and it arrived in a reasonable amount of time the quality of the meal was seriously below standard. \n\nI love Indian food and one thing I love about it is the complexity of the flavors. This was flat, one note. A earlier review mentioned his tikka masala reminiscent of Campbells tomato soup - well add the butter chicken to that experience. \n\nThe chicken had that metallic like taste you get from microwaved meat which did compliment the bland taste of the food - hey, if nothing, they are consistent in how awful the meal was prepared. \n\nRight now, I am sitting at my desk and my body is actively fighting indigestion. Yep, this place is terrible. 4 star average? Wow, that is shocking... of the countless Indian meals I have had this is by far the worst.\n\nUpdate: 8 hours later and still feel sick from this meal. Ugh. Never again.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 1, "date": "2015-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4C4Cq13qfyrScq7jM3V6Fg", "review_id": "Vr_DZaUyvbNDHdF-NrIQUQ", "text": "Mediocre at best. The flavor in the tiki masala was so bland. I really wish they'd put more love into their spices.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 2, "date": "2015-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4cW3iQW6JD1C8VxYP0eyXg", "review_id": "RLh693rkigjhnZJeo_82xA", "text": "I had high hopes for Taste of India, after reading the reviews, but I was not impressed. The food did not taste fresh (I had pakoras and an eggplant dish) and the rice was definitely old and crisp from sitting in the bottom of the cooker. I asked for spicy and my dish was quite mild. We were there toward the end of the night and the staff seemed resentful of our presence. As much as I love Indian food, I'll probably give Taste of India one more chance sometime, earlier in the evening. I hope to report back with at least one additional star.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 2, "date": "2009-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LkGyJv-3jG0wLb83wSSpgw", "review_id": "_ttRSfb295_slwmXeewJsQ", "text": "I really like this place. Generous portions, well spiced, good service, BYOB. I really like their veggie ball in yogurt sauce thing. Free papadam, and the gratis chutneys have been different each time I've been.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2010-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4cW3iQW6JD1C8VxYP0eyXg", "review_id": "536Du8C5rFTgVR1Mq9fr-w", "text": "5:30pm, worst Baingan Bartha I've ever had. Un-fresh and damn near flavorless all but for some powdery heat. Please invest in fresh chillies; they keep well and will make that \"8\" really pop with flavor.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 1, "date": "2010-03-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "bfX7FMuf5CC3a246zqGisA", "review_id": "GvrE_eRymKByxYISydlqQQ", "text": "I don't know why people had issues with Taste of India at CMU (they have an area in CMU open during lunch and dinner hours) ... because I really liked their food.  In fact, this restaurant was what caused me to start liking Indian food in the first place :)\n\nFrom this place, I am absolutely in love with their Palak Paneer and Saag dishes (basically, all the green creamy spinach dishes) because there's so much flavor in them and there's not chunks of raw spinach in them like you see in other Indian places.  Their Matar Paneer is also fantastic, and their vegetable dishes (those that have potatoes, cauliflower, etc.) are also very good.  The Naan is not bad either when you get it fresh because it's fluffy and has some oil on it for flavor, but if it's not fresh, I'd definitely pass on it because it gets all dry.  The oily noodles they have are also very good, especially when it's a fresh batch.  However, I'm not a fan of the Chicken curry dishes because to me, it's just orange + chicken... \n\nI'm going to miss this place after I leave CMU! No joke.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2010-05-21", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "u1KESST6ATusVrn7F6HUvw", "review_id": "852CXCmfv2hcsr_lEV8ECQ", "text": "This is good, stick-to-your-ribs-fill-you-up-at-the-buffet Indian food.  I work for Children's Hospital and it is by far the most convenient dining option in the neighborhood--walk in, grab a plate, fill it up at the buffet, eat fast, and out the door--all for about $8-$9, if I remember.  \n\nI would have to say that for real Indian food in and around Lawrenceville/Friendship, People's Indian is the better buffet & entrees--some of the buffet items at Taste are just not that flavorful, but overall it's serviceable and some items, like the naan, are actually quite good.  I wouldn't go out of my way for it, but for people in the 'hood, I would strongly encourage a visit.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 3, "date": "2011-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zpAvcGUJMyorUF1pGe75OA", "review_id": "pZWhId_oOFI22m3pMoU3sA", "text": "I'm a big fan of Taste of India.  With take out, you get much more food than when you dine in with entrees, but the service is quite good when you eat in.  The buffet is okay, I don't like it because it is for a more mild pallet.  The quality is good for what it is, just a bit bland and unexciting. \n \nI usually get things spiced eight or nine on their ten point scale.  My favorites are the aloo matar and the vegetable curry.  The sagg paneer is good.  Pakora and samosas are both tasty, too.  Puri and nann have always came out hot and fresh.  Their mango lassi and chai tea are both tasty.\n\nFor less than thirty bucks, I can get dinner for two people with a satisfying lunch the next day.  Good.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2011-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "QGMwoLH060Wb2h0X1UtKWg", "review_id": "qI_c_IMdmiSwuQgrqU1b-w", "text": "That woman that you see in the corner, a table full of food? Yeah - that's me. Don't judge....  I lose all ability to think rationally when I cross through the door. 4 entrees, biryani and a samosa? Yes. Why not? How can I possibly be expected to choose between such flavorful and reasonably priced food? It's the culinary equivalent of Sophie's Choice.\n\nThe staff is wonderful, the food is terrific - get the Samosas, saag paneer and dal makhni. Oh, and the tikka masala. And the muglai korma.\nOr you could do the lunch buffet and save your dignity. But then you wouldn't have leftovers for lunch. And - trust me - you'll want leftovers for lunch.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2011-03-28", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "VhYipyt-PeMVtuFIcoP4TQ", "review_id": "CEJEPzeOZifi0L613VQ9ow", "text": "Pretty darn good, not the best but close.  Across from Children's hopsital so you have to handle the meter parking but usually spots open.  Staff is very nice and sincere, when you walk in you are not sure what to expect but it is a quaint, clean, comfortable interior with a bit of dress up.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2011-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "88TJdGnOJ9Ob32HOjOmM2A", "review_id": "3xo63GCcZiozIao0u6TVAA", "text": "My experience with taste of India has been positive. Their food is solid. I love the complexities of their Malia Kofta dish; the sliced almonds and raisins add excellent texture and bursts of sweetness to a savory dish. Mango Lassi's are a must have here. I may be a little obsessed with mango and yogurt in general, but that doesn't mean the average patron will not love this sweet drink. \n\nThe family who owns Taste of India is very accommodating and their updated facade creates a more welcoming environment for Children's hospital goers and employees as well as for locals like myself. Anything that continues to revitalize my neighborhood is a plus. This restaurant has been around for years and I appreciate their efforts to stay in the game. Quality Ethnic food + walking distance to my home= love.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2012-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8syjbjJRkzxK9RUaKewUrg", "review_id": "gJLdzcNkvW34WYN9Vo8rCA", "text": "The food is good, and excellently spiced.  Though others on this site have reported not being able to get dishes spicy enough, I've never had that problem (when I've ordered 10 out of 10, I got 10).  In fact, that's one of my favorite things about this restaurant: they cook the food exactly the way I want it, pretty consistently.  Sauces are creamy; meat is tender; and prices are reasonable.  I'd say this is easily one of the better Indian restaurants in the city, which is saying something given the plethora of good options.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2012-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_bqNPtKwnF6MRhEWodtiDg", "review_id": "cp7Tm-CCnLkZRoofqHZRoA", "text": "I love this place! Its the best Indian food I've had in Pittsburgh! I absolutely love the chicken tikka masala, it is sooo good!! My boyfriend and I ordered take out once and I like spicy rating of 1 and he likes a 7 and when we got home and tried it they were both sevens. So if you're really sensitive like me, make sure to double check your order. I would definitely recommend Taste of India! I also really like all the vegetarian options!", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2012-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "q7MrNVt1FE23rwtWmPYWHg", "review_id": "oROCgVg80v3HT_WEAEGjmg", "text": "Darren brought me here, and as a Indian food n00b, I was impressed with everything included in the economical Dinner for Two which gets a diner nan, a meat dish, a veggie dish, dal, a dessert, and tea. The tea and kheer was a nice way to cap off the meal. The mango beef and alu palak were superb. I could live on the bread alone. They look to have renovated the place, and Darren said the bathrooms were much nicer this time around.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2012-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "CFAfc1snuUrINLnTeLhlxw", "review_id": "L3fB9hkfcXX0YZi5KqBvVQ", "text": "I have been really struggling to find a good indian place in Pittsburgh, since I moved back into town.  I ordered takeout from Taste of India, and it was ready very quickly (~15 minutes).  I ordered the Saag paneer, chicken tikka masala and an order of plain and garlic naan.  The naan was amazing!  My girlfriend who doesn't even really like Indian food loved the Chicken tikka masala, which was also really good.  The chicken was of really good quality and the sauce was delicious.  I also enjoyed the saag paneer, but probably not the best i've ever had.  Either way, the food was delicious and I will definitely go back!", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2013-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "vJ1ZZu1sOEcPTW_QTp9uSA", "review_id": "3odGyn19SoE3BaFABVUUVg", "text": "Best and most consistent, high quality Indian food in the 'burgh. Everything I've ever had here is delicious, especially the Malia Kofta. Sort of Americanized, rich and creamy style Indian food. If you like spicy food, I'd suggest ordering an \"8\" or a \"9\" on the scale. Great service and clean, classy environment! My mouth is watering just typing about it.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2013-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "VDXYhuUHfw6UgvdMMM7QCg", "review_id": "gpzEHtrkm-g9oO7LxjlCtw", "text": "Loved the buffet. Naan was soft, which I love. Food wasn't  to spicy. Lots of variety. We'll be back for sure.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2013-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9FGP45E5zLXG1assWL1oVg", "review_id": "qilLTBp6vXiQmTkdzvFa4w", "text": "It was more expensive than other Indian places I've been to, but it was good!  We did takeout and they gave us a ton of rice and I order way too much naan.  It was $65 for four of us.  \n I got the Chicken Tikka Masala and I loved it, my wife got the Chicken Curry, also very good.  The other couple got a shrimp dish and a tilapia dish, which I tried but didn't care for.  I would never have ordered those dishes anyway so I won't count that against them.\nI would like to try lunch here - I saw a buffet table, so that might be a more cost efficient choice for this place.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2013-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DwXVdLxCHp9Uag-HjWgcnQ", "review_id": "GB_C8h8hloG5zSl_eu2L6Q", "text": "Buffet, while small is totally worth it. Has all the essentials!", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2013-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "XN3EcNZDfCT-1lDB4Bwm1Q", "review_id": "Fni5kPt2y5mzr99ZRDIwoQ", "text": "So happy that these guys have finally reopened! I went there for dinner a few nights ago and really enjoyed it. I got the Tandoori chicken, which was moist and flavorful. My boyfriend got a mushroom and potato dish which was also excellent. Servings are huge, and prices are low!", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2014-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "u1KESST6ATusVrn7F6HUvw", "review_id": "8qhB3jHx_asJGCynQN0gUg", "text": "I propose that Taste of India get a new, fresh yelp! review site.  Taste of India is dead, long live Taste of India!  \n\nThe new, post-fire establishment is completely new and different.  The space inside has booths, nice tables, a new and improved kitchen, even better bathrooms.  I cannot overstate how much better it is than in the past.\n\nMost importantly, the lunch buffet has catapulted from kind of bland if serviceable, to downright excellent.  I hate to say it, but it's my new favorite buffet for lunch.  \n\nI'm serious, Rachel, you should close their old reviews and have them start fresh (with my review).  And for all the people who went there in the past and maybe didn't have a great experience (or did) you need to go again!!", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2014-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Yk467HXy5jS3aMGZ9OOjdg", "review_id": "W2yHNS111eNZK_QLVV7tyQ", "text": "This is by far my favorite Indian Restaurant. The food is always fantastically prepared. Service is also wonderful. I've never gone to the buffet, but do take-out and eat-in often. Hint: you get more food when you order take-out. ;)", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2014-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "53zB4qPi1eTctwLXwFfE1Q", "review_id": "DEylTXXCKxAI4GrIxGpyYg", "text": "Went for the lunch buffet which was about $8. It was SO good! I ate wayy too much but still wanted to eat more! Everything tasted so fresh and delicious! The decor was very tasteful, fresh and Indian inspired. The staff was wonderful too, very nice!", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2014-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E3hN8GtOJXHzMfT9zRUN9w", "review_id": "9iTTdiq2tkgqUzf0D4b0kQ", "text": "The staff/owners? seem nice but the food is not that good. I had shrimp tandoori  which tasted and looked like the shrimp was soaked in red dye and the vegetables were not grilled at all. No flavor. We also had a masala and that too was not great. I just returned from Princeton, NJ and had a GREAT India food experience. This was not nearly as good. Lastly the naan is doughy. Very disappointing.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 2, "date": "2015-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gnY57tL8rso6IQoSWOuKOg", "review_id": "BBAhg_9StjQh23xjwaRlcg", "text": "Probably 'the cleanest' Indian restaurant in Pittsburgh.  Their presentation is immaculate, and their decor is friendly and inviting.  The pakora offerings here are some of the best for hundreds of miles-- it's a yellowish breading, that's light, not that dark brown usual fried offering.  Many of their dishes are great, and they have a good chutney.  They've been in business more than 20 years and the people who own it are so nice!  So glad they recovered from a kitchen fire a few years back.  It just keeps getting better and better.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2015-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-VEO2LKZaz7SP1N7EJZSYQ", "review_id": "nH4aD3e3QK9qBqHFkU9m3Q", "text": "I asked the waitress what she recommended. She said they were all good and it's hard to make a decision. I was going to be the judge of that, and she was indeed telling the truth. So good!", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2015-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-Tjv2E_WAFsdVxjS5hzuyA", "review_id": "XJA8-bz_gT4uZzT-fouHFg", "text": "I was so very pleased with Taste of India, the service was friendly and very helpful. They assisted us in picking out our meals since we didn't know what to order but wanted to try out Indian food. \nThe price is very reasonable and the food was full of flavor and just mouth watering.\n\nI am looking forward to going back.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2015-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lbVOg7PwdsPkYymYQlsvRA", "review_id": "zR7Z8hcvT-Fg8ZXHoZtzuA", "text": "Food, customer service, ambience - all were super good. Food was served very quickly. Will definitely come back here when I come to Pittsburg again and will also recommend this place to my friends.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2015-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5STBf6ZVfqh37CXk4bw6yQ", "review_id": "MUdAD5Ikon9pfjC6VlxIJw", "text": "It's been a long time since I've had Indian Cuisine this amazing! Kudos! So friendly!!", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2015-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "Qe1l1ln6bf_pcWUUuLswFA", "review_id": "h4pFM8qAoQlYWIHVpxKCvg", "text": "Great Indian restaurant!  It's like stepping across a few continents and tasting authentic Indian cuisine.  The \"naan\" flat bread is piping hot when it comes to your table.  The garlic naan is my favorite.  And the curries are always wonderful.  \n\nIf you haven't tried Indian food, take your time getting used to the menu.   Generally the main dishes are chicken, lamb or vegetables, in a different kind of curry sauce.  If you go on a date you can order two or three plates and share.  The items toward the top of each list are simpler and less spicy.  The further down the menu you go, the more interesting and spicy the dishes get.  I recommend starting with \"medium\" and seeing if that's too hot or if you'd actually like spicier.   If you ask for \"between mild and medium\" they can do that too.  I like to pick one meat dish and one vegetable dish, usually something with potatoes.  Dinner comes with basmati rice (long grain rice with a little saffron).\n\nSuper friendly service although not American style waitering.  There is generally a head waiter who is also the host.  They will seat you and take your order.  After that, other waiters will serve you in turn, one getting drinks and another serving food.  It can be a bit slow at times, so don't go if you're in a rush.  Give yourself at least an hour or two.  Even if you decide curry's not for you, it's an amazing experience of completely different flavors. When in doubt, order a chicken dish.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 5, "date": "2008-03-22", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "gucg91zWI2HGuXha6CCTTA", "review_id": "vrusbLh5RyMLtvnnfwcOyA", "text": "i went here for lunch because of the great reviews i saw on yelp. i had the buffet since it was one of my first times having authentic indian food. the food was very flavorful, but my tastebuds didn't like it. i would still recommend it to others who like indian food. the service was good.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 3, "date": "2008-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "3jGPOioqomA8K2J84t4WFQ", "review_id": "xBWOaYC8qOkiYOJRYnFY-w", "text": "Although hubby and I eat Indian food everyday at home...we were craving North Indian fare which I rarely get around to making at home. We went on a Saturday night...it wasn't packed so we got seated right away. Most of their patronage are non Indians which often means that the food is good but not spicy. Hubby and I are huge fans of spicy food as I've mentioned in previous reviews. Hubby got the Chicken tandoori and I got the chicken vindaloo (which is supposed to be spicy) and is a Goan speciality...something I am very familiar with :o) When the waiter came by hubby and I asked him if he could make these dishes spicy. He looked at us and asked \"Indian spicy\" and we both grinned away and said absolutely. And they delivered! The flavors were great and it satisfied our spiceometer. The only thing is would say is the vindaloo could have been a bit more sour. The tandoori chicken was moist and yum. But the highlight had to be the garlic naan. They didn't go cheap on the garlic and the naan was soft and delish!! Service was polite and fast. and then thew in some extra butter chicken sauce even though we didn't order any. Sooooo goooood. \nWe will be going back when we get cravings for Indian AND spicy food!", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 3, "date": "2009-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7W_Ve1DnGa4uFMbeyC2J6w", "review_id": "dCFGATAWZOxOLoEMVjVcyA", "text": "I like Indian food, Maharani just a-ok (yea solid three stars). I went there for a double date on Monday Night. The appetizer was samosa (meh..), Malai Kabab (ooh yuuuum...) and lentil soup (they ground the lentil, quite a different tasting) . I got chicken and vegetable, to be honest my least favorite of the table (oh sure the grass is greener  on the other side) but my side of Garlic Naan is a winner. The chicken Marsala was my favorite dish on the table. \n\nAside from the food, the waiters can't wait to fill your water (seriously, take a sip and it will get fill in the next 120 seconds). On the other hand, it could be just another Monday Night. \n\nAlso, if you want to build your appetite before dinner/lunch, cross the street and turn left for a great stroll to the Freedom Park by the time you get back, you ready for some serious food.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 3, "date": "2011-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tL-aIPbXdZNGp9a1d4VMhA", "review_id": "q3aqu8BJQnU170UNDv6zJw", "text": "The lunch buffet is really great, everything is fresh and full of interesting flavor - nothing is spicy hot, though. Friendly staff.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 5, "date": "2011-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iXw0rFSizCrA5n4bpELiPQ", "review_id": "JV4TtqA627Cp37uUuBcqzw", "text": "I really want to love this restaurant but I really don't. I have tried it at the lunch buffet and I recently ordered rice, samosas, and naan, to accompany Indian food I was cooking at home. Sadly, both experiences were less than stellar. Bland doesn't begin to describe the food. Absolutely no taste. When I want to eat Indian food, I want to eat Indian food - not tasteless, spiceless, food. Did my Irish name cause my order to be overly Americanized?? :-) \n\nEven my little children were totally unimpressed. I am pretty sure we will not be giving this restaurant a third try.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 2, "date": "2011-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "yW4nA8JJInLvUi15uExlyQ", "review_id": "crNl0PJcMsXf9XMhKLivyA", "text": "Terrible service! We were overcharged thanks to the waiters inability to split a bill - each couple on a separate tab - a normal thing to do in a restaurant - NOT HERE! They tally up the whole table and divide by the number of credit cards given and charge each one the same amount regardless of what each couple ordered. Do not make the mistake of going with friends and expecting the restaurant to be able to give separate tickets seems you have to sit across the room from each other and pretend not to know each other in order for that to be possible. Food was not what it used to be. Will remove this restaurant from our list of places to go.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 1, "date": "2012-04-17", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "zHfA7hsEDI2TbPJ-nDD-QQ", "review_id": "ZR7W1ejNELpc83BCLZWPgQ", "text": "Heard from a source I trusted that this was the best Indian food in Charlotte so we checked it out. I'd still recommend Woodlands as my top choice. I went with the standard chana masala with medium spice. Sadly, it didn't have the flavor I was hoping for. I know it's a pretty simple order, but it tasted really plain. The wife ordered the vegetable jalfrezi and it was a better choice, plus it had veggies whereas the chana masala is just chickpeas. The carnivores seemed to enjoy their meals, so all in all it was a good meal. Just not my favorite.\n\nFun little game....I challenge you to try to get your water glass more than half empty before they refill it. It's not going to happen.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 3, "date": "2014-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8vkD133S-jladt6pVtUWdQ", "review_id": "2IE0PyEhvyHSNTgKvSC15w", "text": "Excellent food. Very clean restaurant. Very friendly staff. What more could you ask for! The mint chutney is genuine, no some green liquid. I had the butter chicken extra hot. The spice level was perfect! Definitely recommended.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 4, "date": "2014-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "44RR-h4gBIMs0584B_XVOQ", "review_id": "kXYZoMFHE1fOULtLeOWcnw", "text": "I did take out from here a few nights ago. Ok, so I called in the order, veggie samosa, chicken tikka masala and plain naan.  I went with the medium high heat for the chicken because I couldn't get an answer from the guy on the phone as to what \"Indian heat\" was. Anyways, I found the flavors right on from what I remembered about my last Indian food experience. It's been a while. Nice heat with the chicken and a nice amount of food too. A little pricey but overall a good experience. Next time I'm going for the \"Indian heat\" option!", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 3, "date": "2014-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Jm4FZEoRxqTAjVyBg6owdg", "review_id": "fdRR7jUhwrB1sIXKRhTo7Q", "text": "Food is simple and good here, Me and my Wife went for the first time today for lunch from office and liked the food.\n\nNo extra spices added, Food is all good as per the spice levels of an American Indian Standard. Great service and see people enjoying their visits, We do feel like going here again. \n\nAltogether this was better than the other Indian food places tasted earlier near Charlotte downtown area. \nNext time for Dinner soon.!", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 4, "date": "2014-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SRi5SD4Ue8q10N0-7kzzdQ", "review_id": "V9LnAdD-nhxZjmxlKHE2gQ", "text": "When me and my boyfriend came in, we noticed that the interior design was nicely decorated. As we were being sat, we noticed the table was literally five inches away from the table next to us. Not enough room for me and my boyfriend to leave if we have to go to the bathroom. We could not hear ourselves talk because of the conversation going on 5 inches from us. next, The buffet food selection was only eight to nine different things. The food was okay but lacked the spices and taste. The reason its not a one star is because of the excellent service we had gotten. The food was warm and nothing was heating it. We would not go back!", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 2, "date": "2014-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QZlAsmOIasIWbgqE8CvfdA", "review_id": "R8rdqAn3B-zR1ioSFyX_yA", "text": "I've been to Maharani many times and each time I've wondered, as have my dining companions, why do I come here?  The staff are cold and unwelcoming and they make you feel very uncomfortable, as though your presence was an inconvenience.  As time has gone by, their lunchtime buffet has become more about the cheaper vegetable dishes and the same uninspired tired chicken dishes.  After our last visit yesterday we decided that that would be our last. We prefer to eat where we are made to feel welcome.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 2, "date": "2015-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s3ikDm2ReXdXmPE5li2AYg", "review_id": "d4kgrXnrbzM0CHVKKCFlow", "text": "Sooooo ... my husband and I ordered take out from there and I ordered the Mutter Paneer. However, when it got to the house it was Palak Paneer. I asked my husband why I got the wrong thing and he told me that he asked about it when he picked it up and said \"we ordered the mutter paneer\" and the person who was working said \"oh it;s the same thing\" ........... what? If the people who work there don't understand what the difference is between their food that is terrible. As was the Palak Paneer. I didn't bother calling them because if it wasn't a priority then it wouldn't be after we picked it up.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 1, "date": "2015-04-08", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Fr-sZiP1tSGvZuGdO2yJ8w", "review_id": "lGhSfjLK4w4meD0jglUxPQ", "text": "So bad! I lived in the UK for 10 years and trust me the standard of Indian food there is second to none - but Charlotte eeek! the standard is appalling.\nI ordered a Vindaloo which would normally be too hot for me as my heat level is a Madras but the one from here had no spice I mean none at all - it was closer to an Irish stew than Vindaloo!!!", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 1, "date": "2015-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kDIU3CNU42ak7nRLWfu0wA", "review_id": "AQSZNAzwNV84CONtwtDruA", "text": "I loved the food! It got super busy when I went in, but they handled everyone perfectly.  I will be back. It was clean and the AC was on. Food kept coming out because it was being devoured!", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 5, "date": "2015-04-24", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "s2l-yWfm5-3bS08ZI30JbQ", "review_id": "bhKKtdA1i7I7i69-aA2Lpw", "text": "Very poor quality of food and when I asked for a refund, I was refused.\n\nThe food was not as described. It was poorly made and poor ingredients were used. Let alone very poor value for portion size.\n\nAs someone who grew up eating Indian food, I would strongly suggest people avoid this establishment.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 1, "date": "2015-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ygn-5sWJSrRMlmDibfJXXg", "review_id": "vcRDGUVR-pAvhW-LyTSezQ", "text": "The food and service here are both great.  Any dish you get will be unique and flavorful.  My favorite is the chicken vindaloo.  Be careful the vindaloo is extremely spicy.  They also have a fairly extensive lunch buffet worth checking out.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 5, "date": "2009-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lf9nMhpagki7vY9QE9MBCg", "review_id": "6z1Xl8IkfWd3gby3Ygh9Mw", "text": "We have been dining at BG for several years now and it is still the best all around Indian experience we have found in Charlotte.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 5, "date": "2012-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "5KZmI27uVZxliUthxg5GoA", "review_id": "w7CWVg2n1i7YBQ8mY_EhEw", "text": "What a hidden treasure!  Wonderfully authentic and fairly priced.  My friends and I came here for their Sunday lunch buffet and we were not disappointed in the least bit. \n\nI was skeptical at first over the location and feel of the restaurant.  The joint is fairly dark (and, I hate to say it, but- dumpy).  There also seemed to be a thin filmy layer of grime on the benches.  After much convincing, my friends finally got me to stop complaining and try the buffet.\n\nWe, of course, tried everything (as that is the right thing to do at a buffet). Everything was a literal burst of tasty fireworks in our mouths and we spent the rest of lunch raving about how wonderful the food is!  We also ordered a side of Samosas (not included in the buffet) and I would highly recommend them to everyone who eats here.  I will definitely be back for a repeat!", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2012-03-28", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 3}, "user_id": "CvMVd31cnTfzMUsHDXm4zQ", "review_id": "ez3kifiBFkEEQAMA9O5BVw", "text": "Good Indian food is hard to come by, in most cases. Charlotte has quite a few options and I'm happy to say that Bombay Grille has stolen the spotlight for me. \n\nI had heard great things and read all of the shining reviews they had to date. I was pleased to find a very humble dining room, complete with appropriate music. I love me some Indian tunes!\n\nWe started out with the standard pappadaam cracker bread. Very brittle and filled with flavorful spices. All three dips/sauces were choice. Fresh, pungent and never lacking in flavor or interest. \n\nNext, pakoras. These little fried bundles of joy make something as boring as cauliflower AWESOME. An assortment of lightly fried and seasoned veggies, dusted with cumin. Tender, flavorful and intriguing. Worth every penny. \n\nThen, garlic cheese naan. If you don't get this, you're missing out. Awesome flavors. A perfect marriage of textures as well. If you have some of the sauces left over from you pappadaam, USE THEM. All work with the naan and rather well, I might add. \n\nEntrees. My wife had the Palak Paneer. Green and savory sauce. Filled with fresh herbs and chalk full of hefty chunks of fresh, house-made paneer (Indian Cheese). Tofu-ish texture and perfect for topping on your rice or MORE naan. I'd get this dish and I'm not even a vegetarian. \n\nI had the Lamb Korma. Dude, I love me some lamb. They do this up RIGHT. Tons of flavors swirling around a hilarious amount of steamed rice. I can't think of one thing I didn't like about this dish. Other than when it was all gone. *tear*\n\nService was top notch. Get ready for some contestant visits from your server(s). They'll upsell you a lot, too. Always will ask if you want more of....EVERYTHING. \n\nPrice is very reasonable as well. Me made it out under $50 for the two of us. \n\nIf you're in Pineville and looking for some ethnic, culinary greatness, Bombay is the dankness.\n\nThese guys do quite a bit of couponing as well. Seen quite a few around these parts. Also, they do FoodieCall. Get that stuff delivered! BOOM!\n\nCheers!", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2012-05-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "fzu9zwLQJBW8RqoqADOXiw", "review_id": "OK-QQLm7LffGXYefNQ2H_A", "text": "I'm teetering between a 3 and 4...but I choose a 4 and I'll tell you why in a second.\n\nI came with friends a few Sundays ago and I fell in love with this type of buffet-I generally equate buffets with Golden Corral and run the other way.  For a newbie to Indian food, its great to be able to try a little bit of everything.  If you love food that uses a variety of spices in unusual combinations (not necessarily spicy as in hot), Bombay Grille provides a nice introduction to Indian food.\n\nThe buffet is small-ish and usually has several chicken dishes-butter chicken, curried chicken, and chicken vindaloo among others.  The sauces are out-of-this-world delicious and even the paneer (Indian tofu) has a bouncy texture.  The buffet includes fresh naan brought to your table, which you can dip in the delicious sauces from the entrees.  They have a strange looking dish that is chopped spinach, mint, and chickpeas-looks like baby poo but tastes delicious!  \n\nThe reason that this place deserves 4 stars is the mango custard desert.  It is creamy. delicious, and helps cool off my over-spiced American palate after a spicy meal.  I would bathe in this stuff if I could!!!  Be sure to save room for dessert.  \n\nTip: The Sunday buffet is more expensive ($12), so try it during the week if you're budget-conscious.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2012-05-27", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 2}, "user_id": "3GteArKIVRlJZjjRqqwgaQ", "review_id": "wbqwaKbBOl3rDlIPIuzxOg", "text": "I teeter between 3 and 4 stars on this review but I decided to be nice :)\n\nWe almost missed it because the \"bomb\" on their sign is not lit up so it says \"AY GRILLE\"  currently.  That almost turned me away.  I have this weird stigma with restaurants or shops that have half a sign lit up without fixing it.  It just seems so bootleg.  But, I pressed on...\n\nAtmosphere--\nNot much to write home about, a little dingy, a little 70's/80's with the mirrors and lighting, rather small so we were literally on top of another party, etc.\n\nService--They seemed super busy or way understaffed.  A 10 year old little boy sat us but then we didn't see another soul for at least 15 minutes.  No drink order, no greeting, no wine list, nothing.  So, that was really weird.  When the waiter finally approached us we asked for a wine list but that was the wrong thing to do because he ended up pulling his disappearing act again.  We noticed there was a party of 8 that must have been sat RIGHT before us so we just got their sloppy leftovers.  Was it bad that I was glaring at the party and that I was thinking to myself they have SOME nerve coming up in there taking over the joint?  haha...  When the server was ready to take our order he literally looked like he was breaking a sweat.  I totally get it, I have served tables before so I sorta felt bad for him.  However, that didn't prevent me from noticing that we had been there for an hour with nothing to show for.  \n\n**they were REALLY good about refilling waters though.  \n\nThe Food---the food was their saving grace.  I am pretty much giving them 4 stars based on the food alone.  I thought it was really good.  The garlic naan was so fresh, the chicken korma was cooked to perfection, and had just the perfect amount of flavor, the rice was done well, etc.  The only thing is that there wasn't very much chicken in the tikki masala--just a few big chunks so hubby left hungry.  I also found the masala sauce to be too pastey...it was like a spaghetti sauce in a way.  But, it was good.\n\nI'm not holding the bad service against them.  I clearly came on an \"off\" night.  If the big oversized party wasn't dominating the whole restaurant then it would have been a much more pleasant experience.  So, I will give them the benefit of the doubt and I will return if they get the sign fixed ;)", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2013-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HQj6ppV4oPOpAdbdgyutuA", "review_id": "XQOvFNP1J-pCj1TlaE8isw", "text": "Had a positive experience at Bombay. The food tasted as expected. I had the chicken tikka masala, lamb biriyani, and garlic nan. Everything was tasty, but the garlic nan was phenomenal. I would return.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2013-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Hwo-snVEES_A9-zG6q2xRA", "review_id": "VY66ZZHjx6un-0r1Iw9Aiw", "text": "Very good service, food was very well cooked, taste was okay. Served even after closing time.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2014-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EDTKACQbjFg3WzDfTVaFCw", "review_id": "fFvpNymSLByzKfQF7aoUcQ", "text": "All around mediocre experience. The app was slow to come out. The lamb roganjosh was under-spiced and the lamb was tough. Disappointing first Indian experience in Charlotte.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 3, "date": "2014-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0MXnlq1M975i0L-K5MeoYA", "review_id": "inohZaB1hF0aVrEbW98SLg", "text": "I must say, I went in for the buffet but I couldn't help myself but to actually order from the menu.  I really wanted a sense of what the food and service was like fresh.  I came in my waiter asked what u would like to drink, he filled my glass then I notified him I would be ordering from a menu.  He was very very pleasent, promptly brought me a menu and u ordered my favorite from back home, chicken Tikka masala and garlic naan.  Yes basic, but absolutely delish.    Lots of sauce for dipping, chicken was abundant, tender and juicy.  My glass was never empty or in danger of being empty.  Nice surroundings.   I cannot wait to go back.  This resaurant deff hit the spot", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2015-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "awShuRUvMuaZyCM4GJy2KA", "review_id": "FqdCWfI8hiUPtpxSSe2zTQ", "text": "I was in Pineville last week and didn't want to drive around so decided to eat at this restaurant but they don't have consistence. I ordered Lamb Rogan and it was just with tomato gravy with few pieces of lamb. Your chef if you have one should learn how to cook this kind of dish and then charge $17. No one came to asked how was the dish or if I need anything else. I had been here few times due to convenient to my work but that's it.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 1, "date": "2015-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lePr71n07wFDi4kuSn3Lyg", "review_id": "lApRGUqFElRteX5gstfKDg", "text": "We ordered take away for dinner. Our order was ready within 20 minutes.  I had the lamb korma and my boyfriend had the seek kabobs. It was delicious and there was plenty of food. The only complaint is the price,  it is a little expensive... however,  we don't get take away often so it was worth it.  We'll definitely order from here again!", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 5, "date": "2015-03-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "BLTRBkDSUN5IJdtFM4n0og", "review_id": "4J9RGKvuFsD4NY5F9qUIpQ", "text": "I enjoyed everything. Good was awesome, service was cool, and prompt. Overall I would surely come back, thanks to living social. They had an awesome deal. $18 for $30 of God and drinks. This place is also an awesome place to eat vegetarian food", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2015-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Bb2f-GeDRCN_aVZfAuIyxw", "review_id": "5ICSh6li6Wv5hf6h-DnkTA", "text": "I prefer to go at lunch since it is a buffet and I can have a little of everything (plus fresh fruit for dessert). I went once for dinner but it was more expensive and took a long time. Good Indian food and a great value for lunch.", "business_id": "ULvDCr7r9sMU1iSwgTHXsA", "stars": 4, "date": "2010-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6kp815UUjK--ukUjmDlSCQ", "review_id": "-OMTCzqQSWbZffxxEaW96A", "text": "The lunch buffet from 11:30 to 3pm is crazy delicious!  Weekend buffet is 10 dollars a person.  Try a little bit of this and that, take what you want, leave what you don't.  Great food, good service.  I recently went to their Odana Rd location on the West side for dinner and the food was still very, very good, but the price was nuts!  So stick with the lunch buffet and you will have happy belly and happy wallet.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 5, "date": "2008-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eZGHG02ecvRzl4MX6j9Oxw", "review_id": "HOocpTffT1aSxsdikB_PUg", "text": "One of a select few good places to eat on the far East side of town.  I mean come on, between a bunch of chain restaurants flanking the mall and Maharaja, there's no comparison.  Love lunch buffet, and you can in fact grab a solid dinner as well.  Perfect dinner for two: samosas, ginger naan, bainghan bartha (mashed grilled eggplant mmm), and mango chicken curry.  The service is very courteous for dinner, they drop your napkin in your lap and you get a hot steaming towel after your meal!  Extra points for the extremely bass-heavy hip hop gospel music coming through the wall from Now Faith Ministries next door.  They have one helluva sound system.  If that's not your sort of thing, then avoid typical church hours. ;)", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 4, "date": "2009-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RxD8XEw5do9-2ue0NBi9vw", "review_id": "ZfS7jvUHXG1geNtW4FIB6Q", "text": "The buffet is ok, but I came back for dinner and the specific items are very good. I had a vegetable korma and a chickpea curry. Samosas were super. Chutney could have been a bit spicyer, but hotness on the food at medium was quite good. Go here for dinner. Yum. \n\nThey had as special, 2 entrees, nan, rice and popadom for $20.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 4, "date": "2010-03-03", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "QCg5CRze-wwMO5HerI9dYg", "review_id": "8kg-g4y9y_DAwyCp0Kr9QQ", "text": "I have drove past this place a thousand times, and never realized it was even here.  I didn't discover my deep and passionate love of Nepalese food until moving up to the Twin Cities, but over break my dearest mother suggested we go to the Maharaja on the east side.\n\n\"On the east side?\" I scoffed, foolishly.  \"There is nothing but chain food and malls on the east side!\"  I know this statement fairly well, as we grew up 20 minutes east of the east side of Madison, making a trip downtown quite a hike.\n\nBut she assured me that it was in fact  on the east side.  And not on the east side like....Ella's Deli is on the east side.  This thing is on the East Side as in East Towne Mall is on the East Side.\n\nSo, reluctantly, I went in.  AND WAS GREETED WITH AWESOME.  This buffet was amazing.  They had a coconut soup which was great, all of the chicken dishes were great, they had a wide variety of veg dishes...I was so stunned and amazed.  Even though I didn't partake, they served strawberry lassi...mmm!  Finished off with some mango ice cream, I couldn't have been more impressed.\n\nWhenever I visit home, I always drag my family along to Maharaja.  Delicious, and a good price.  All the staff are very friendly too!!", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 5, "date": "2010-04-01", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "WY8HpnccFSkrKJE10wKQ-g", "review_id": "ajPXdyltoNHlHnrz6h4cTw", "text": "This is it - the cream of the crop.  \n\nI've lived in the Madison area for the past two years, have visited many of the local Indian buffets, and have found none that equal the Maharaja standard.   Buffet dishes change on a daily basis, but you can always count on their show-stopping chicken tikka masala to be in the mix.  In addition to the standard meat curries and tandoori chicken, they always offer multiple vegetarian dishes and an array of appetizers.  \n\nRecommendations:  coconut soup, vegetable korma, malai kofta, baingan bhartha, chicken tikka masala, mango ice cream\n\nThe staff is wonderful and always keeps plates of naan a plenty :)\n\nMaharaja is by far one of Madison's best restaurants.  And, you can't beat their lunch buffet deal (under $10).   But diners beware, it is incredibly easy to overeat at this place...forcing one into an almost immediate food coma upon settling the check.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 5, "date": "2010-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "h4fjgz-44HFE_kGy6p8P-w", "review_id": "hQ6ZsG4gb2buB8Nn_tdm6w", "text": "The food here is good. My husband and I are new to Indian food, so I can't speak to its authenticity or how good it is in comparison to other Indian food, but overall we really liked the food here. The chicken tikka masala was particularly delicious, though there were lots of very good options at the buffet. The naan was also good (and needed to cool the mouth every so often).\n\nThe service was okay! Nothing good or bad to say there. The inside was really not all that awesome. That was the major part that brought down the experience for us; it looked like it could do with a face-lift.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 3, "date": "2012-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L_3OYAy2B3BJayra53oKuA", "review_id": "lrJRPRZwx6l3HnuXAAc3bg", "text": "Great for takeout.  They threw in extras for us, which was a nice touch.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 5, "date": "2012-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "C541OP_FLjHBw_VKzcTNQg", "review_id": "rrWTICY8dkJbsJOazhn2fw", "text": "What a great find! As several others have pointed out, the decor is nothing to write home about - nor even to dwell on it in a Yelp review, but It has always been my contention that if you offer great food at a fair price and are not offering a dining experience, then restaurant cleanliness and an attentive wait staff is a better investment than wood carvings and mood lighting.\n\nWe came for lunch and it turned out they had a fantastic buffet! Everything from tandoori chicken to palak aloo. Every dish was so flavorful and authentic. Having spent two years overseas where I associated with several Indians, I know they would have been suitably impressed. The waiter brought naan to the table and was there when our water glasses emptied. He didn't hover but he was attentive.\n\nMy lunch partner and I got a kick out of the sign that politely let buffet eaters know we were welcome to the food but would be charged for waste. It should go without saying, but I have been to several all-you-can-eat buffets and have witnessed first hand the amount of leftover food that has to be thrown away because people take too much. Personally I think part of the blame should be placed on the cooks/managers for not putting out a better product, but certainly the customer is largely to blame. Hence, a sign that clearly articulates the Maharaja's expectation of its customers is a good thing. Let's face it, if the food was bad, the customer would be screaming...\n\nBottom line, Eat here if you love Indian food.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 4, "date": "2013-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "8gGoJ5v3SU7opqsCnLB-Cw", "review_id": "TbPteBptHr3dmIxUnmXApw", "text": "I really do not like the smell of curry powder so this is why it was my first Indian restaurant experience. Went in for lunch buffet and was pleasantly surprised. Food was really good. I liked almost everything I've tried. Tandoori chicken was really really good. Juicy and tender. Naan was really good as well. For desert I enjoyed mango ice cream but other deserts were to sweet for my taste. I will for sure try some more Indian food in the future.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 4, "date": "2015-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uk9xz0fLHZyRg4W-sGcXYA", "review_id": "bkr9e0RkrXbH3tXDoa-0zA", "text": "I really enjoy the food here... some of the time. The quality of the food here swings from good to bad each time I go there. I have gone both for the lunch buffet and for dinner, and in both experiences this quality lasted. I will admit I enjoy the food here but the inconsistency of the food throws me off.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 3, "date": "2015-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WsNxirtTBL6qJmNsC0mSkQ", "review_id": "ESURLHanTr4KW0FEqOACKQ", "text": "Never disappointed. As usual the servers were attentive and the food was delicious. Chicken tikka masala was rich and tender. Get the garlic naan!!  Ordered it for the first time and was won over. Tandor mixed grill medium spice was also a winner. Two huge shrimp and several large pieces of chicken along with vegetables all in a flavorful sauce. Portions were enough to bring home leftovers for another full meal. Mango ice cream was tasty. Topped everything off With a hot hand towel at the end. Another satisfied customer!!", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 5, "date": "2015-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cC2SUcqxVoOtrIyVdga9Iw", "review_id": "G_niGw4YeA7_jw-vwIIxMQ", "text": "Ok, I am a food snob from Los Angeles. Just moved here and to be totally honest  I think the food here is so plain. Yes, you have a lot of great steak places and American food but things such as Sushi ( there is NO good places I have tried each and every one) and Indian are hard to come by. We first went to Basmati and honestly I thought we were doomed. There was no flavor and most dishes seemed to be watered down. NOW, we were driving near campus and we drove by Bombay and I am more then happy we stopped. As for the other poster whos friends said its over spiced, have you tried real Indian food? This is tame in comparison. The food is just right and always served fresh and hot. The semosas are great and served with the best sauces. We love the Gobi Aloo and chicken masala, we will be back to try other dishes. Bottom line other then the lackluster decor and sometimes dirty looking floors this place was a sweet treat for those of us who are used to some variety!", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 4, "date": "2007-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mXAIhh7PvdIxnbwaPRkrGw", "review_id": "o-wGAWy0Sd29dH4utXtbZQ", "text": "This is one of my favorite places in CU.  Their Naan is the best Naan of all Naans I've had - and I've had a lot of Naan.  Chicken Tikka and Lamb Curry are my favorites.  With a mango lassi expect to pay around 15 bucks after tax and tip.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 5, "date": "2008-04-19", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "0k8nCBGFyPGQm24N9vIEow", "review_id": "TrwQ4nqb142rZE8dWa0pxA", "text": "If you are a female and like to be gawked at, I recommend this place for you. The staff stare like they have never seen a woman before. Also, if you like black hair as a garnish in your chicken makhani, you'll really enjoy it here. \n\nDisgusting. Threw out a $10 plate of food after finding hair. Not to mention when brought to the attention of the staff, there was no apology or anything to fix it.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 1, "date": "2009-04-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "EMxz314z1gFKqCZau7ye0g", "review_id": "QH32XZYiiWIRt3BhcipLdA", "text": "I would eat here for lunch every day if I could.  If only my idiot co-workers would get over their aversion to \"ethnic\" foods.  Rubes.\n\nDon't make the same mistake.  Even if the closest you normally come to adventurous food is Panda Express, you would like this food.\n\nIf you eat here, make sure to order the naan.  It is perfect and HUGE!", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 5, "date": "2011-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V5mUJaJ-XC64e318UIZ3Zw", "review_id": "zHqnrHzOq5Cbjzs8UaAn-w", "text": "I've eaten Indian all over the state, and this place remains my favorite. The portions are generous, the prices are low, and the food is vibrantly flavorful the way Indian should be. \n\nI actually worked here for a summer, and I can honestly say I've never eaten better in my life. All day and all night my stomach was a bubbling cauldron of curry. Try the vegetable vindaloo- I put it on the menu!", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 5, "date": "2011-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Ujrg8-TO4r55Yh8QkC0DEQ", "review_id": "HCPmAS8PeNYLbjQ6EaAmRA", "text": "This restaurant is a great deal for dinner! For two entrees and an appetizer, the check was about $26, which is pretty good for two people -- and we were stuffed. The food is delicious, the portions are decent, our glasses were always filled with water, and service was prompt.\n\nOnly two negatives, no liquor license and the atmosphere is a bit lacking. It was a little too loud and a little too crowded, but it's a good place for casual dining.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 4, "date": "2013-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_H5MEMsNrbs-VU5DLPpcAg", "review_id": "5AgKCKJQhbr762JO_qcRLQ", "text": "Rock solid Indian food. Lunch menu is cheaper. Mango Lassi has about three different flavors based on what night you go and a lot of the chicken seems to be prepared beforehand. That being said its great. I love the food, not the lamb for some reason, but its hard to think of anything better for the price.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 4, "date": "2014-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G37pByEqhgw7MGbUX3eXlA", "review_id": "lchsTKHTpGuYGZBZ_BJ1JA", "text": "We were on the campus for an event on Saturday and decided to try out this place. The food was awesome, prepared hot. I tried Chicken garlic masala and my wife tried Chicken curry and both were great tasting.\n\nWill certainly visit this place next time on the campus.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 5, "date": "2014-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-GIzvin6t5z02_glV3pdgw", "review_id": "W7UNHNATtjpJ3U5uUbgmjA", "text": "I LOVE THIS PLACE! Prior to trying out Bombay Indian Grill, I had only tried Indian food once and I absolutely despised it. But when I came down to Champaign I knew I had to give it a second shot and Bombay Indian Grill was the place that stole my heart. Their samosas are crispy and cooked to perfection, their buttery naan is amazing, and their Chicken Makhani was so so good. I wish it was a more spicier dish but it was still delicious with tons of flavor. The waiters are always attentive and friendly - if not too friendly. This place gets busy quickly so go earlier or later than a usual meal time but beware of the 3-5 closing time because I had gone between those times not knowing they closed and I was really disappointed. Learn from my mistake!", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 5, "date": "2014-05-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XzIKZTb4I-7wW4BjKwV2Mw", "review_id": "-hsFOjW9_gzcaNwxLXfB3Q", "text": "Indian food has been my kryptonite as of late.\n\nThere were 4 people inside the place at 6 on a Friday, which seemed odd.\n\nI ordered chicken tikka masala and naan to go, waited about 10 minutes for it, and was on my way. \n\nFriendly folks at the counter.\n\nThe food was good! Great flavor on the masala, just the right amount of spicy, tender chunks of chicken. The naan was gigantic, warm, and quite tasty.\n\nLike the other reviews, it seems that overall Bombay is a little overpriced. My order was nearly $15, granted that made 2 large meals for me, but for ~$9 I could have gotten as much (or as little) of a variety of Indian food at Ambar's buffet, which is comparable in taste and quality, I'd say.\n\nEither way, it was tasty, I was full, and my Indian food craving was very much satisfied.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 4, "date": "2015-04-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "N-D-d1Z4UybdlkK1HxlNPA", "review_id": "mHUX6_rlAZvuV1a9yTj1-A", "text": "My husband is the fan of Indian food, and I had a gift certificate from some students, so we gave Indian Delhi Palace a try.  The service was spotty, depending on who was in our section at the time.  The naan and puri were excellent, and both of our entrees were tasty (my husband had the chicken tikka masala and I had a mild lamb dish in cream sauce. The jasmine rice was beautiful and well cooked, but also had cardamom seeds in it (not my favorite). My husband loved his palak paneer. We agreed that overall, we have had a little better food and service from Taste of India.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2007-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "gGNAr-cmCQUgA9B0QjVqAg", "review_id": "rUfsOZccLJ5VhrvQo_RYTw", "text": "Delhi Palace has won my heart for Indian food.  There is a great lunch buffet that is well worth a drop in from time to time.  I'm not sure if this location is associated with the Delhi Palace on University, but I have been to both and liked both.  Sometimes Indian food buffets can feel not so fresh, but both of these restaurants keep things fresh and heated.  \n\nThis restaurant has my stamp of approval as my favorite Indian food in the Phoenix area.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2008-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Wy7f9DOuBEOenhnA7KIKoQ", "review_id": "H4IwH4ootrTtCbHScd-xZQ", "text": "I really want to give this place more than 3 stars.  I like the food and the restaurant and the banana milk shakes!\n\nBUT!  in the little Indian store to the right of the restaurant there were rat traps all over the place....  with rotten cheese in them...  THAT is not something I, a paying customer wants to see....  AT LEAST hide the traps.\n\nTHEN it made me think, that my food could have been contaminated with rat droppings and then my stomach started hurting.  Which is unfortunate because I probably won't be back, and we had been there quite a few times.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2008-04-02", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "sEWeeq41k4ohBz4jS_iGRw", "review_id": "qQ6f7Hfct7onycfYMiOmzQ", "text": "This was my introduction into Indian food.    The first few times I came here I was like \"ah not bad\".  Then I started to try other places, even out of state and in other towns.   When I came back to IDP I really liked it.\n\nIf you go to a buffet, which I prefer, so you can try a bit of everything keep in mind that the dishes change daily.   If the food is not so good on Monday well go back on Tuesday and they'll have a few different items.\n\nThey had these parsnips once that were soooo good I've been having \"nocturnal emissions\" about them for the past year. \n\nCool little shop that is attached to the restaurant, they have fresh bakery items, Indian food stuffs, and a ton of Bollywood movies.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2008-04-29", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "d2RAl63RTdfZF7kcuKcj-g", "review_id": "DVl7fg0XVx5poPvwiZReqw", "text": "In my mind, there are two types of Indian restaurants in the Valley that I can afford to eat at.  There's the ones in strip malls that typically feature a grouchy old man behind the counter and a huge TV displaying Indian MTV or soap operas, and largely do-it-yourself service. (See: Kohinoor)\n\nIf I'm feeling like spoiling myself, I'll take the next jump up to the places with painted walls, friendly waitstaff, and a-la-carte style menus instead of \"specials.\"\n\nAfter a long day at work and in hippy progressive meetings, me and my beyonce decided to try Indian Delhi Palace, which is an excellent example of the latter.\n\nThe waiters were attentive without  being overbearing, and the complimentary appetizer - I always forget the name - the crispy, slightly sweet cracker thingamajig with the green sauce? - was yummy.  And the samosas we started off with were also great.  Not overly greasy or soggy or stale like a lot of Indian places.\n\nThe palak paneer is wonderful!  Ask for it spicy if you are a fan of spicy foods.  The creamy spinach flavor doesn't become overbearingly hot, but has a pleasant spicy aftertaste that mixes perfectly with their garlic naan, served fresh, of the soft and chewy variety that I prefer.\n\nRE: The people who miss paneer... The paneer was definitely on the skimpy side, but I didn't mind.  The taste was definitely still there - perhaps they blend it in more than other restaurants?  Anyway, if you are a huge fan of blocks of paneer in your food, you might want to mention as such to your server.\n\nThe lady ordered vegetable bhriyani, which is sort of our Indian comfort food, and it didn't disappoint.  Flavorful rice with tons of veggies.\n\nIndian Delhi Palace has good food, good service, and an atmosphere that will embrace you like a vampire who feeds off of stress instead of blood.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2009-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z6OGpPPnGNDTOsLhf4KVzA", "review_id": "-LAKPbEolS9uGS845bvTtw", "text": "My boss is Indian and we decided to try and find a good Indian restaurant while in Az. We loved this place. We went back twice! Delicious food and wonderful service.\n\nThey have a facebook page with coupons.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2009-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "9mjItdXixKECanLV6RBIrw", "review_id": "z3WWTrLugTAsqnR5IO8LNA", "text": "Really good Indian cuisine. Beautiful interior and great food. They'll give you the option of how spicy you want your food on a 1-10 scale. They appear to have a buffet option, though I haven't had the chance to try that yet, as it's for the lunch crowd only.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2009-05-24", "type": "review"}
{"votes": {"funny": 5, "useful": 7, "cool": 5}, "user_id": "YzNZNgpOy9tthDnczS_ajg", "review_id": "IsbLssfL4n4UNVSoEsloXQ", "text": "Yes, I am totally deducting a star because they charge for soda refills. Not just charge refill price (which is ridiculous anyway), but charge you for a WHOLE ADDITIONAL SODA when you get a refill. Who the eff does that? I can quite honestly say I'm never going here again, because I only crave Indian when I'm hungover and full flavored (not diet) ice cold coke is a hangover necessity. I'm not going to pay for each one I down, that could bankrupt me. Plus, everyone knows fountain soda costs like 4 cents a piece, who are they trying to fool?", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2010-04-19", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "ohRev2g3tvXpV3gBnhC-og", "review_id": "ceIiNMdwwG1GcfTZUGxGfg", "text": "Rand H. and myself went here for lunch today.The place is big and very nicely decorated it is probably one of the more fancier Indian restaurants.They had your typical Indian buffet items that were all good,but the tandoori chicken tasted like benzene. Other than that the food was all pretty good so I will give these guys a solid 3 star review", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2010-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "VD1-RBoaXfktMkydSxyMAA", "review_id": "V_7kfHOwFcq4k8ZeAa3ppQ", "text": "Finding good Indian food in Phoenix has made the move here easier...especially a place that's a mile from my house.\n\nParking is easy\nService is always fantastic\nTake-out is always ready very quickly and very hot\nGood variety of spices at the attached little store\n\nTried and recommend: Shahi paneer, chicken tikka masala, veg korma. chana masala\nMight revisit but not thrilled with initially: saag paneer, aloo gobi\n\nIf you like spicy (or not), tell them--they go kinda easy on the hotness unless you specifically ask (use the 1-10 scale)\n\nI wish it was a little less formal feeling inside, but I typically do take-out so not a big deal--it just makes for a date-ish environment rather than a group o' friends environment.  Again, not a bad thing, i'm just sayin'. I've also never checked out the lunch buffet so maybe the white tablecloths and preset water glasses are a PM thing. \n\n[p.s. i'm now officially amused that i just said i wished a place was less nice. don't really hear that too often...]", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2010-05-25", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 1}, "user_id": "1guJDgUfTiDdbgKqBhsZFQ", "review_id": "PVHzScmHVCGOM8eL_YsRFg", "text": "This place was disappointing on different levels. First, the food was okay but not great. I thought the naan was below average and tasted more like flatbread than what naan is supposed to taste like. My dish was the chicken tikka masala and it just lacked flavor and any hint of spiciness. I did get the mango shake and it was truly excellent!\n\nThe waiter seemed quite inpatient throughout the night. On a couple instances he assumed what we meant instead of getting clarification; thus, bringing out the wrong thing. Then the restaurant turned off the music 10 minutes before closing and basically tried to rush us out. Seriously??? Not a way to keep business coming back! I mean, chill out... most of us were pretty much finishing up at that point so at least give the diners the courtesy of a full experience.\n\nToo many better options to want to come back here...", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2011-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ST8Yzlk2MqKlcaLqL2djBg", "review_id": "wU5HDQ_gWwBBRfjwEQn7Tw", "text": "after a hard day of racing go karts at octane, we stopped in here for a lunch break. \n\nit is sunday and they have a buffet for 10 bucks. i was quite impressed with the buffet offerings. there is chikpea salad (ok, not great), about 6 curry meat options, and 4 curry vegetable offerings along with the basmati rice, and 2 desert options. \n\ni enjoyed all the veggie options. the curries were thick and full of lentils/spinach/potatoe, etc. the rice was fluffy, despite being in a buffet. even the pudding desert dish, with cashews and raisins was tasty. a bit sweet, but good. \n\nthere are about 6 chutneys and sauces to compliment your dish if you choose. i always like the yogurt ones. the achar was way too salty for me. our indian guest was well pleased and we took that as a good sign. \n\nthey passed the water glass test with flying colors. very formal interiors and the staff was quiet, yet polite and professional. a great dining spot for curry lovers. i have eaten off the menu before and thoroughly enjoyed it as well.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2012-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "y5_vrqIylhXMrejM_-x_vA", "review_id": "CLVTsZlxI6dnMzrBzGMOxA", "text": "We went here for lunch and got the buffet for around $10. The chickpea salad was ok, not the best I've had. I got a scoop of basmati rice and enjoyed all four veggie dishes (creamed spinach, spiced lentils, spiced cabbage and curried vegetables). The vegetable fritters would have been good if they were freshly put out, but they were cold and a little too hard/crunchy. \nThe multiple sauces were delicious and sort of fun to get a bunch of samples and try with your meal or dip with the naan bread. Oh, and the naan by the way was fantastic. They brought an order to the table and it must have just come out of the oven as it was super hot and toasty. Mmmmmmm\nThere were two desserts on the buffet, a sweet \"pudding\" with almonds and cashews and a fried dough with honey.  Both were tasty, but again, I think the fried dough sat out a while so it was more chewy vs. crispy and the pile was all sticking together. \nThe service was prompt with removing our plates and refilling water glasses. All in all, very tasty food! I would've given 5 stars if it wasn't for a few of those buffet items being a bit stale.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2012-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nnMOnqA_7fx2zzw4-83R2Q", "review_id": "yP63qyTpLsYJ2Xbj_jEQAg", "text": "Went to Phoenix today visiting our son.  One of our favorite things to do is to find new Ethnic Restaurants.  We had some chores to do in and around Scottsdale and were craving some good Indian lunch Buffet.  We had heard about this place being a tasty and reasonable place to eat.  Funny, we got there fairly early even before noon on a Friday and the parking lot was full.  A good sign.  We walked into a beautifully appointed clean place with white table cloths, red napkins and that was another pleasant surprise The price for the buffet is $8.95 per person and well worth that. They were constantly filling up the trays.    The salad was crispy lettuce, tomatoes with an assortment of Indian dressings, a chutney, and some other wonderful dressing.  The chick pea salad was so good that I devoured 2 plates of that.  They also had a large bowl of what looked to be taco chips.  However, they were homemade and so crunchy with Indian flavoring.  I could have just eaten that alone.  I was pretty stuffed at this point.  The main dishes were Tandoori chicken, Curry chicken with a great sauce.  Another curry dish with potatoes and onions.   Of course rice and paneer which was also yummy.  A couple of simosa fritters which were a little tough but was still tasty.  Three different deserts.  Rice pudding was great to take the bite out of some of the moderately spicy  dishes.  Also a carrot pudding which if your'e Jewish reminded me of Tsimis. Not sure how to spell it.    There was also like a sponge cake ball fried crispy.  I just threw that into the rice pudding to end the meal.  The place was packed by the time we left about 1.30PM or so.  Lots of business people enjoying some heavenly treats.  Good price, good service.  What more can one ask for. No dinner for me tonight.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2012-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DRPepXToNBRMub1tFofOHg", "review_id": "9eHdXyUx9bHtoGCI88iGmQ", "text": "Awesome. Indian. Buffet.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2012-04-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "zBkv5EqgkrgT_f3oL1B4yg", "review_id": "l10F8iKOMOtLzNYM6_uBog", "text": "Food was absolutely amazing! I got a carafe of cab and the non vegetarian dinner, which comes with a bit of everything. The chicken curry was by far the best curry I've eaten. But in all honesty everything from the naan to the rice to the pistachio ice cream and tea was amazing. I will definitely be back and often since the prices are pretty reasonable. I took one star off because the servers seemed bothered that we were there and weren't entirety helpful when we had questions, one server kept whispering everything then just basically walked away before seeing if we understood. Thankfully my friend was there who is a veteran Indian food eater and explained all the meal items to me.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2012-04-19", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 0}, "user_id": "xTkxc8KSi-uDiG08NQZZAA", "review_id": "PRZyCKiMJQD-jGz2LRO4Ew", "text": "Seriously guys, adding a bunch of spices to cooked rice with lamb is NOT how you make biryani.  Oh, and who places green bell peppers to biryani?  I'm not sure what I was eating but with each\nbite, I asked myself loads of questions:\n\n\"Is this what I paid $13 for?\"\n\"Why did I pay $13 for this?\"\n\"Why am I sitting in my car, on my way to the Phoenix Sky Harbor airport, eating this spice flavored rice with\nnot lamb?\"\n\"What is this big black thing that looks like a beetle.  Oh, its just a cardamom?\"\n\"When I asked the guy who gave this to me for some raita (Indian yogurt condiment), why was he \nsaying that was going to be extra when it is always customary (and FREE) to hand that out with the biryani?\"\n\"Should I finish this or no?  I need to finish this, I paid 13 freakin dollars for this - that's why!\"\n\nThen, the cycle of questions would start all over again and if that is not torture, I'm not sure what is.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 2, "date": "2012-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "0TRh7OOVLQ-IOkchcMVWsw", "review_id": "5Bm69FxnXkSu0IUf7PdH3g", "text": "I went here for lunch on a Sunday. The parking lot had quite a few cars, but I got right in. :-) \n\nI got the buffet and had the chick peas salad (very good), chicken tikka masala (flavor was great, but the chicken was slightly dry), goat masala (this was amazing), and their tandoori chicken (which was some of the best I have had). Overall a great lunch. \n\nWould have done 5 stars if it wasn't for the dry chicken tikka.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2012-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "NiWubdnBvQo1R8S92LPrrQ", "review_id": "FSGZ7hh5SFH0oM1jyETu5A", "text": "I think a lot of people might get this place confused with \"Delhi Palace Cuisine of India\" (which is on University, near ASU). That place - avoid avoid avoid.\n\nThis place - must go. This is a place that serves really good North Indian food, kind of Pakistani style, if you ask me, and it's really spicy and really good. They'll even give you chili peppers if you ask them to notch up the awesomeness even further.\n\nThis place has great service. Came here with my dad near closing time and they still seated us and let us order, even with only 15 minutes or so until closing. Food was hot and fresh even at the late hour. We were keeping the staff from closing up yet everyone was still extremely friendly and helpful, and of course we left a sweet tip.\n\nThe food here is amazing, anything you can point to on the menu is awesome and delivered fresh to your table. Now, I have never foot the bill myself, so of course I'm biased, but the prices seem reasonable to me, especially for a dinner for two or more.  I read in another review that the rice was crappy. No idea what that means and no, it's not free, grow up. Rice was somewhat dry but hey, it's rice, you eat it with something else.\n\nEvery time I've been here they have quickly seated my group. The waiters are prompt but not perpetually hanging around - fantastic service, although you *might* need to remind them for water once or twice. Food is extremely (OK, it can be extremely) spicy.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2012-05-26", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "joIzw_aUiNvBTuGoytrH7g", "review_id": "KtbGnr7qyZmbRsmpoCu2IQ", "text": "Our entrees didn't seem freshly prepared, especially my Chana Masala that looked like some dry, clustered up entree leftover from a lunch buffet.  I've never seen Chana Masala lump up like that unless it was my leftovers at home.  Garlic naan was average.  Prices were reasonable, but EXCLUDED rice.  Restrooms were deplorable.  Not sure I'll be back again anytime soon.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 2, "date": "2012-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "a_V8LRfMxGvpGtTwR2olrg", "review_id": "Tkir5ybdpJhyqbk7WHmKkw", "text": "The best Indian food in the valley hands down. Every time I go it nothing but the best, food service and price! The never skimp on spices like the other places do and everything is always just how you order it (mild, medium , spicy). I have been to England and India and this place is closest I have found. If India is a 10 this place is a 9.5!! Just go and make sure you have some mango ice cream for desert (it's unlike any you have ever had).", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2013-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "jifQQcGNRZYvHfeO2o4mTQ", "review_id": "bMxl5K22YRT1Fea_P52B9w", "text": "I've only had Indian curry chicken once in Singapore which was a very negative experience.  One bite and I was unable to talk for a few minutes.  \n\nAfter 20 years, thought it was time to try again.  Found Indian Delhi Palace  on Yelp.  The reviews seem generally positive.  Dropped by on a Saturday evening to try it out.\n\nThe restaurant was about 2/3 full.  Two wait staff were also covering the reception station resulting in a low level frantic pace.  That is primarily the reason for not giving five stars.  Our waiter was quick and to the point.  I told him this was the first time to try Indian food.  He suggested the dinners that included a combination of dishes.  He asked how spicy on a scale of 10 we wanted.  I said about a 5.  He suggested maybe a 3 to start.  Probably was a good suggestion.  Not much time for questions before he was gone with our order.  \n\nThe dinner included Indian milk tea (Chai) which I really enjoy at Starbucks anyway.  It had more spice flavor than the Starbucks concentrate version.  A nice improvement.  While a little picky, my cup of tea was spilled into the saucer.  Not sure why it was served that way.  I dribbled on the white table cloth every time I picked up the cup.  The tea was good though.\n\nQuestions about the food served were sort of answered.  The waiters were too busy to spend much time with amateur questions.  Guess I need to find an Indian to dine with next time.  Not really sure what I ate or the main ingredients in each item.  Everything tasted good.  Next time I will order individual items from the menu so I will know what I'm eating.  \n\nSo, good food, will try again, but waiters were too busy to be of much help to Indian cuisine newbe's.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2013-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "swgRfa4vN6mAMigyp2eCCQ", "review_id": "m-M_6Tf3mBO5RfnQPVKMVQ", "text": "Still as good as it has been for the two decades that I have been going to Indian Delhi Palace.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2013-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pLgx3X8hiovqXHb4kFGjXA", "review_id": "CEeiqoiWeFU7v5Xt60vffQ", "text": "The food is delicious, but the prices are WAY TOO HIGH for the small portion sizes. I feel robbed when I spend $50 on dinner for two people and probably $7 of that was their actual food cost, if that. Look at it this way... for $10 you get their lunch buffet that has naan, rice and an assortment of foods (all you can eat). But when you order food to go, they charge for every single item... $10 for each entry, $2.5 for naan, $3 for rice, etc. It adds up quick and all of that is at cheap cost for them, so their margins are huge! It's a ripoff, but the food is -like I said- delicious.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2014-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DhpZyyIsy8cEtOHX8MERHQ", "review_id": "t4MCcnRy50caLdd1nwtRDg", "text": "B day party here Sunday buffet and they really tended to our table. We never had to wait for refills or naan they kept our table clear. The food is the best in town and I'll be back soon.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2014-04-28", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "yo5h5ynO336nWk9wVQBN_w", "review_id": "m4B1oFLntTYjp7BwGn25TA", "text": "Don't be put off by the fact that they're super rude on the phone, it's probably cultural, and the food is totally worth it! Have eaten almost every vegetarian dish on the menu and d*mn do they do it right! Amazing flavor, spice level is pretty precise. If ur going to get a 7/10 you'll need a water standing by, other than that its amazing spices as you requested. \nBf is in love with the Mixed Grill- as a non meat eater I have to say: it looks and smells AMAZING! And per his review its the best things he's ever eaten. A little pricey at 18$ but he says its worth it. Watching him eat it- I completely agree. :) \nBeen eating here for the past 3 years and even though the customer service has yet to take a giant step forward I still keep stepping through their doors, inhaling those delicious spices, picking up my 'to go' order and grinning like a thief as I enjoy it for days and days to come. :)", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2014-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "T40FttJPXvGlOOJsQH4lKA", "review_id": "8_wB8doOReKDHTYuuS5q8w", "text": "Great food. Great service. Give it a shot!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2014-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ZRvUHy5NBV2JsoeQCGeTKw", "review_id": "iMskbrVgL4VibfWHXY2K3A", "text": "First time visiting. \nGood reviews looked good and they were accurate. \nI have to admit, this was a great culinary experience, not just for my guests but also for me. I hadn't been to an indian restaurant since arriving in the USA. \nIt was worth the wait!\nSpice, heat, flavour, goodness. All in several dishes.\nSide note: the little store attached to the restaurant had a variety of sauces that I could only get in Australia. I will definitely be back to pick up local specialist items!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2015-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "foBgKqvbfwanA6EK0xAYxg", "review_id": "dRtOq8fVVyp_0Xgqqt5ZmA", "text": "This review is for the Lunch Buffet. \n\nThey have all the necessities for  good buffet. Thier spicy dishes are their strong suits. They have tons of flavor and decent heat. Service is fair for a buffet. I'd like to go for dinner and try out their other dishes. If the buffet is this good their made to order menu should be great.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2015-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "IVjP4oggBGllT04YypSWuQ", "review_id": "Li6_Zbjp91mA8DJGKBwFZg", "text": "I have to eat here every time I'm in Phoenix. The food is great and served in copper dishes; the water is always flowing,both in the fountain and I your water glass,  and the waiters are all Sikh, and very professional. I always get the lamb korma, so I can't vouch for the other food, except for the great basmati rice and garlic naan. The Tandoori chicken a friend ordered was a little dry, but the waiter did warn her.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2015-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FUL5bctP24A2rl2wPQ5IdA", "review_id": "FmFn0yIu1T0lLUHDsw78vw", "text": "I live in a restaurant desert and had been craving Indian for about four months. This totally hit the spot. We started with one of each of the selection of for Indian beers. \nThen, we got tandoori chicken, which was cooked and seasoned to perfection. The Tikka Masala was also full of flavor. My husband had the shrimp vindaloo and said it was solid...not mind blowing, but good.  Aloo Gobi turned out to be a bit small for a main course and a bit dry. But that was the only disappointment. I was also surprised by the gratuity being included for four adults and three small children....but I guess the small people in our party are people too. A party of six is a party of six ....even if they are toddlers. \nSide note, said toddlers broke a vase in the bathroom and I told the server to charge us for that, but he didn't. We added quite a bit more to his tip so he can choose to replace the vase or live with karma. :) I'm just happy to have Indian in my belly.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2015-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1wIOMbdAJ3YuQZavzp3H6w", "review_id": "ccBTQYEf1_R27niGH_auFg", "text": "Went in at 6 pm on a Sunday. Restaurant had perhaps 3 tables sat. We were sat in a part of the restaurant near all the other tables. Received water and menus. Waited over 15 minutes for someone to take our order. \n\nWhen we flagged someone down we were told they were short staffed but still no one came over to apologize or take our order. Waited another 5 minutes and left. While we were waiting one couple waited the entire time at the register to pay their check and another man dining alone was in the same situation and walked out.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 1, "date": "2015-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "5mho74lyS6ujMt_fWdulMQ", "review_id": "qJz4bMzRug6EGCQiadO7oQ", "text": "I've been here a few times for their lunch buffet. The food is good... pretty standard for Indian. Today I went with 4 coworkers and they charged us an additional 18% gratuity for a large party. First, a party of 5 is too small to incur the automatic 18% gratuity; it's 6 or 8 at most restaurants. Second, the 18% was added on for the lunch buffet. I wouldn't have minded as much if it was waited service since I usually tip that much anyway. However, a mandatory 18% for a lunch buffet for 5 people is ludicrous. There are plenty of Indian places around here that are just as good, if not better, and I will be patronizing them instead.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 2, "date": "2015-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5cTk4QVwHyVbJ6odw1DoSg", "review_id": "oaNE6BJ4K0Q51fl7PweyDQ", "text": "The experience was good, restaurant was tastefully decorated and the service good. The food was mediocre. I had the vegetarian platter. I would like to try some other entrees and the buffet before giving up on them but I won't order that entree again. Prices were pretty hefty for the portion received, especially considering that naan and rice are not included. That is a big pet peeve for me because there should be rice or bread the same as you receive a roll with an American dinner or chips and salsa with Mexican. Especially, when it is much more expensive. Why do so many Indian restaurants around here skimp on the bread and rice? Any restaurant that includes it will become my go to. The cost is minimal and cheaper than advertising. Word of mouth is what brings me to ethnic restaurants. Yelp is my reference quite frequently.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2015-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "sEWeeq41k4ohBz4jS_iGRw", "review_id": "EU4H80ZOEYWdgMyiFomi_Q", "text": "This place had a hard time keeping up with the modest lunch crowd when I was there.   There were 3 buffet items that were totally out.  Not good since there were only a limited number of items to begin with.\n\nI thought the taste was off, not my type of Indian food. No spice and no heat. Blah.\n\nCome on, it''s a buffet and it's lunch.  Nobody has time to wait around for a piece of tandoori chicken.  Buh bye.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 2, "date": "2008-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "jWvzAN1czxypi-GM1KY62g", "review_id": "hsb4C6PIbHBQ8zZf9rF9qA", "text": "Yay! I'm a fan. Not an original comment, but it describes my sentiments. I think the place is pretty authentic -- without leaving with a smell of curry. \n\nI love the Tikka Kabab Kandhari (boneless chicken comes out a-la-fajitas-style - sizzling with onions) and I order Nan and a side of the yogurt cucumber sauce. Then I make myself Nan tacos. (I hope I'm not making anyone cringe - but it's great and there's no food better than one you can eat with your hands!) \n\nThe location is odd, but I guess, after 3 years of being out here, I'm getting use to restaurants being in strip malls. The price of the food is reasonable - especially for dinner. \n\nI took one of our Australian friends, who had recently moved to the States from London. He loved the food, and was thoroughly engage in a conversation with our waiter about cricket. (I kinda zoned out and watched the Bollywood music videos until they finished.) \n\nGreat place. Try it!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2009-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "0VfJi9Au0rVFVnPKcJpt3Q", "review_id": "PJS98eNurw4xd9KlFGdNtg", "text": "What can I say? I've been coming here for years for a reason... The food is fabulous. Lunch time buffet for $10 all you can eat. The best tandoori and mango losi you will ever have. The atmosphere is perfect. Indian TV is soooo cool. ;)  I'll be coming back again and again.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2009-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bZGUSVaIpCt4Z2rrXx-FgQ", "review_id": "f72L0vJTOu6hDW3buxljeg", "text": "I haven't been to the buffet.  I like the dinner menu a lot, and the Bollywood videos.  Quick tip most Indian restaurants will serve the mild version for us Westerners unless you specifically ask otherwise.  I can't blame them given the bland tastes of most Sonorans.  My mom actually had a conversation with an Indian woman recently about this place.  The woman said that she kept trying other restaurants but kept coming back to this one because of the authenticity.  I consider that a pretty good recommendation.  Although I imagine what is considered \"authentic Indian food\" varies from one region of India to another.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2010-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "--65q1FpAL_UQtVZ2PTGew", "review_id": "ORD8PDHceFzcPKchXmLA0g", "text": "I truly love Indian food and I wanted to like this place more, but I ultimately couldn't. I wound up at the lunch buffet and didn't think too much of it. The dishes at the buffet really lacked the oomph that I am so used to at Indian restaurants, and unless the pot was personally stirred, some of the dishes were room temperature. As far as pricing, it wasn't too bad; it was just around $10. \n\nAfter reading other reviews (Mainly Lisa O's) I would consider trying this place after the buffet is put away. But until then, I'll probably just be staying away.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 2, "date": "2010-04-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "usQTOj7LQ9v0Fl98gRa3Iw", "review_id": "45gwmirzxaPgvQvHq0LIyQ", "text": "I have been CRAVING Indian food lately and after hearing about FOI from a coworker and reading the reviews here, I decided to try it out for lunch. Ok it is a buffet, I knew that, but I have been to some very good Indian buffets. When I walk into any ethnic restaurant and I see people of the same ethnicity of the restaurant eating there I get excited. It must be good right?   This table must have been family and eat for free because I have had better. The naan was just ok, the Tandoori chicken, meh (well I have never been a big fan of this anyway because almost anywhere it is usually just dry bland chicken to me). The butter chicken type dish with tomatoes, was ok but looked like they added red food coloring. I enjoyed the flavor of the meatball dish, the palak dish was bland. Honestly the only other dish I found interesting other than the meatballs was the Carrot \"pudding\" which was sauteed sweet minced carrots, went back twice just for that. The sweet rice was ok, it had raisins and coconut.  I generally prefer it without either.\n I may go try it one more time and order off the menu for dinner. Give it a fair chance before completely ruling it out.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 2, "date": "2010-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "onnvR2mrzlhlPaT0fBqsrA", "review_id": "2N2ivu43kOomHcCutMokOA", "text": "So on the spur of the moment, I decided to stop into Flavors of India for lunch today as I was driving by... I love Indian food. And with just a couple of exceptions, haven't found much of it in the Phoenix area that I would categorize as great tasting. Unfortunately, this place fell more into the norm of Phoenix Indian food than not.\n\nI wasn't that it tasted bad... It just wasn't particularly awesome or memorable. Excluding the couple of saving graces of the aloo tiki (fried potato & Indian cheese fritters) & kheer (rice pudding), the food was just meh. And with a $10 price tag for the lunch buffet, I think that there are definitely better places for me to spend my lunchtime.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 2, "date": "2010-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kbJNDcsBE-U_GiOY43hwwQ", "review_id": "0U9y6sbaBdbSR8jLyDXQvw", "text": "This is a pleasant Indian restaurant. During the week they have a lunch buffet for ten bucks. It has limited offerings and is not especially spicy, but nevertheless the food is tasty & I managed to get my fill!\n\nThe staff is pleasant, which is a plus for an Indian restaurant.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2010-05-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "WI4DyaHOz9SMhngG83QbNA", "review_id": "3Jo-dobDTcEUIZJ_81JZJQ", "text": "Ate in tonight and the food was fine it was the service that was not good.  Our waiter was very Rico suave and had far better things to do with his night than bring us our food or even show up to our table at all, when he did make it around,  he reeked of Cologne and I just wanted him to scram.  There was a large group of odd looking hygienically challenged old Indian men running around,  I think they were the bus boys but they came by to clean a table next to us and liberally spayed Windex all over the place so that added a nice flavor to our food and he then decided the carpet on the front part of our table needed vacuuming right then and there so he broke out the vacuum and went to town for about five Min's, nice. we had to seek out the check and when we did get it we were over charged for alcohol we didn't even order, thanks Rico for the nice $71 evening for our little party of three, as good as the tikka masala is we wont be back.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 2, "date": "2011-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RIFHoJhOqVlhIfUoykg89Q", "review_id": "sa_z3-60muO9MhIv0r36Cw", "text": "I used to eat here all the time. It's been a hot minute. Today having lunch at their once great lunch buffet was horrid. The rice was dry and crunchy. The food was of poor quality. The tomato chicken tasted like beef jerky . On top of all that the services was horrid. I had to actually get up from the table and walk over to the bar were there was 5 waiters standing around and talking to ask for a refill of soda. They acted like it was such a bother and barely said two words to us. Never going back again", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 1, "date": "2011-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Uhw_wKIajsPxVath7Kodlg", "review_id": "eRkO78IBXZdR9l_P9w_vqg", "text": "Very good food. Very good prices. And the staff are very friendly.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2011-03-30", "type": "review"}
{"votes": {"funny": 2, "useful": 6, "cool": 1}, "user_id": "LdJFjb2w0yJOxH1_0JAqrw", "review_id": "Sq5pThMY6Ra5MxdbQqR3cg", "text": "This was the worst experience ever in a restaurant!\n\nFirst, the service was lackadaisical at best.  It was very slow to have our order taken, and it took almost 40 minutes from the time we ordered to get our food. The food itself was tasty enough, once it finally arrived.\n\nHowever, the worst part about this meal was the COCKROACH that we discovered on the wall over our table.  Immediately, my friend and I began to point at it and talk loudly. We tried to get the attention of waitstaff for several minutes.  Finally, the cockroach fell onto our table. That was it. We leapt out of the booth and exclaimed \"COCKROACH!\" Is this the worst part of the visit?  NO.  Waitstaff then came over, pulled back the table, squashed the cockroach, and then gestured for us to resume our meal and said \"Cockroach gone.\" \n\nAt least the manager comped the meal.  But,  if there is one cockroach allowed to crawl around the dining room TABLES, I can only imagine what the kitchen might look like. I definitely can't imagine going back!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 1, "date": "2011-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "i0A-c2yoHySmFhRV2sDR1g", "review_id": "-71TWfvoP3Aa6s8CMw4rzw", "text": "Was in the area and hit this place for lunch today. Every thing was very good, especially the nan which was brought to my table fresh and hot.  I have eaten here many times before but not lately. Some days they have stuff I like better than other days but it is always pretty good.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2011-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vXxGUfOI1y3HtAyc0VvcTQ", "review_id": "utJtzGiTJkrobgk117b_1Q", "text": "Flavors is easily my favorite Indian restaurant in the Valley. With friendly wait staff, good prices and fantastic food you can't go wrong. Don't be fooled by it's humble exterior; it's the food you're there to enjoy. I prefer to skip the buffet as I like my food XXXX-Indian-hot, but I have never been disappointed at dinner. In fact, the staff recognize me and my daughter and often ask if we'll have our regular, even if it's been months since our last visit. \nMy absolute favorite is the lamb vindaloo while my husband has chicken korma and my daughter goes for the chicken tikka masala and a mango lassi. Don't forget the rice pudding (kheer) for dessert. You won't be disappointed!!!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2011-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wcOqMTV92kxOornA42KyoA", "review_id": "BgD8YnKFYBwZDIcW5CDeBQ", "text": "Sorry, should have gotten to this review; because I am a fan of this restaurant.  Love the Rice Pilao; every time must get this dish.  All the curry dishes are great; especially for someone who dines with people who either don't like spicy or crave spicy dishes; they will adjust to your taste.  Been here about 5-6 different times every time left very satisfied and ready to go back.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2011-05-18", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Hi7VohxSS5OBt98w4j8t4A", "review_id": "ZZQA68CrvIR8p1RTB7DPpg", "text": "I miss this place!\n\nWe used to live around the corner from Flavors of India and went here at least a couple times a month.\n\nFavorite dishes were Malai Kofta (sp?) and Palak Paneer. My husband loved their lamb dishes.\n\nTheir lunch buffet was just okay. Could have a better selection.\n\nService was always good. They are sooo nice. One time we ordered takeout and my husband who was sick at the time picked it up. The girl at the counter offered him a little baggie of spices to help with his ailment. How sweet and thoughtful! \n\nWhen we eat in for dinner, we enjoy the Indian beer, and my husband REALLY enjoys the Bollywood music videos. Hmmm... could it be the completely gorgeous Indian women dancing around in saris?", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2011-05-30", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "Dwol47nGkOF81Hm0Cjs4oQ", "review_id": "vuFBXJS3GbFxzK9-33RvhQ", "text": "I mostly do take out. I love the food and the service. I have tried a lot of Indian restaurants but their Samosa, Garlic Naan and Chicken Tikka Masala are great.  Enjoy!!!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2012-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hGu-yHlbpo-H8Y2VMy5dcg", "review_id": "jFHgkj97kxB47mw5N_Qqxw", "text": "What a great find.. I've been searching for years for a place like this.. sketchy from the outside but worth the wait and that you will do. Ordered chicken tikka marsala. (6 on spice scale, could have gone to an 8) and the lamb vindaloo (also a 6, more fairly spiced) with the garlic naan... oh la la, that hit the spot.. the restaurant is dim and loud from nearby tables but cute and comfy..we will be back and I'm not sure I would even waiver from my original selection it was that delicious... feel safe with this selection on flavor and atmosphere but step out of the box for more flavor with the spices.....", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2012-05-16", "type": "review"}
{"votes": {"funny": 2, "useful": 7, "cool": 5}, "user_id": "m7vtKWpZ9wdEQ95wJxrMrg", "review_id": "zVmaB5h5Sni5IGMcvsUijQ", "text": "I'm finding more and more great places to eat in the central Phoenix area and I can add this to the list,  thanks to fellow yelpers Rand H and Mike C who invited me to join them for lunch buffet here. Seating is ample, with booths available. Lighting is toned down to a comfortable level and the TV screen playing Bollywood dance videos had the sound turned down.  I enjoyed pretty much every item in the lunch buffet. The main dishes were really savory; I especially liked the onion and cauliflower pakora. The  heat level of the dishes that were spicy was just right for me. The two desserts offered - mango pudding and rice pudding - were superb and an excellent way to cap a great meal. Service was very efficient, and the cost of the buffet was 10 bucks, tax included - truly a great deal.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2013-03-11", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "ohRev2g3tvXpV3gBnhC-og", "review_id": "outiYuoNyIAG7Kd1guBaOg", "text": "I had lunch here with Norm R. and Rand H. and after trying almost every indian buffet in the valley ,this one is got to be in the top 5.The buffet itself is layed out nicely and the food is always real good.This visit the onion cauliflower pakora was the big hit ,I could have ate just a big plate of those and been happy. The naan bread that was brought to are table was not the garlic type but was very good as well. The desserts here were great to they had mango pudding with fruit cocktail mixed in and rice pudding. (no monkey balls today)?Anyway it was a great lunch and 5 stars for them today.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2013-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Q4LORUH8zU8hoVQ0yQcLuw", "review_id": "jf6nAGmPSvzyGOC1G4sOaA", "text": "I went there today for the first time for the lunch buffet. It was good and the service was great, very attentive. Will be back for the regular menu.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2013-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kzd5psBIDUf4vPmflWaAAA", "review_id": "h6HmCnwPoGB3P2sSRAn-3w", "text": "Honestly, I have very minimal experience with Indian food so I have little to compare it to.... BUT a friend and I decided to venture out and snag something new. Honestly, the food we had was amazing. I was upset I got full because I wanted to keep eating. And the people there were not overly intrusive by constantly coming up to us and asking how it was. Attentive without being overwhelming. \n\nI came away with two thoughts:\n1. Why am I not Indian so I can make this confidently at home?\n2. How has it taken me 24 years to consume something so delightful?\n\nOverall we both had a great time and can't wait to go again.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2013-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "D30Zx1lFfgOPsFJDA5WgTA", "review_id": "uvgSfBSwu2XzeEXIJRqx1w", "text": "The all-you-can-eat buffet is the best value in town! I just love the onion bhagis and potato pakoras. I believe there are always at least 2 chicken dishes and a tandoori chicken, the standout was the chicken keema aloo. I'm not a big fan of okra, but what they did with it and onions was very nice and subtle. They also had a squash dish that had nice, firm pieces of yellow squash in a wonderful sauce. This was also the first time I tried their dessert; it was gulab something: perfectly round balls of fried deliciousness in a hot, syrupy goodness. I could just have these for breakfast like pancakes! I didn't even get a chance to try their condiment bar. Trust me, you will leave very full.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2013-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ylyVSS7H5NJPpu90swck3A", "review_id": "2ooubXZvCuC8ChTdEXQw7g", "text": "I think this place is 3 and a half stars. It is a fair-to-good, family-run restaurant, and because it is the only Indian place I know of in central Phoenix, I've been there quite a few times, only for dinner.\n\nThe atmosphere is comfortable and relaxed, with kind service, booth seating and Bollywood videos to entertain you. It's not the kind of place to take a date you want to impress, but it's the kind of place to go with your friends for a pretty good meal.\n\nLast time I tried their frozen dessert (forget the name of it) and it was lovely, a delicate blend of spices that was the perfect finish to the meal.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2013-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uO7gEFOf572NFwU9GShJhg", "review_id": "EkDdOLCI18CiCsr4yq6AGA", "text": "Worst Indian in the entire phoenix valley, the lunch buffet had only one chicken dish, one meat, one daal, one vegetable, are you kidding me and nothing was exceptional, it was just average. Not at all good and value for money, Compare the menu with Chutneys on baseline and Ray.\n\nI will never come back again.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 1, "date": "2013-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "N1LxItfmm-AfeA8YrJiPTA", "review_id": "z87iGu1CowUfuH0mAIeKCA", "text": "Great service and very good food.  We ordered the Lamb Curry, Aloo Mutter, Chicken Tikka Masala and Garlic Naan.  Everything was/spiced/seasoned to order just as we requested.  The aroma of fresh garlic from the naan was outstanding.  Great portions and reasonable prices.  Need extra rice and they did not hesitate and did not charge.  Will definitely be back for the lunch buffet.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2013-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oF9p2nCwgtm0sqUfoIy0CA", "review_id": "4QgHuvZdtAjsYnourPPCHg", "text": "Love this place, the food, and the owner!!!!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2014-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QghGTkP4tpO97PP75B2r8g", "review_id": "_5mdAp1_BDZhRapBSAal6g", "text": "Everything was burned and the samosas were a Joke I'm Indian and this was not good $13.00 for lunch buffet", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 2, "date": "2014-04-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "2kwlCDVcav0CDxF7MQQC3w", "review_id": "RdhiL_cSbuX3M9RK1QdZsw", "text": "Food was ok. Service was poor. Saw a roach near our table. Not my choice for a lunch companion!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 1, "date": "2014-04-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V7a5g_Cpsl3tNaiSP2z1Tg", "review_id": "Wmzrufz9UQdQRNlrRjMjJg", "text": "I finally had the opportunity to try this place. I went for dinner instead of the lunch buffet. My friend and I shared the appetizer platter, butter chicken, and lamb vindaloo. Everything was piping hot and fresh. Service was timed well even with a large group in the restaurant. Good portions. The appetizer platter and the lamb vindaloo were delicious. The butter chicken was too buttery for my liking. Maybe it is a different style/region of cooking. I am still on the hunt for a place that serves butter chicken that will taste almost like my friend's mother's butter chicken.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2014-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RjvHC0XABQBpiG-ZeNha8A", "review_id": "ytt2n4e7KcJHWtMln4Y-Fg", "text": "Perfect authentic food. Generous portions. Relaxing atmosphere. Just beautiful! Great  service. I want to try everything on the menu. Just go!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2014-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OTzKm7EdzApXr1PrMRGe8g", "review_id": "nkDHM1aMs_Q5FL8VhUkaYA", "text": "Just delicious!  Got the chicken Korma and the sag chicken, medium spice, with a mixed bread basket.  So flavorful and well prepared, with some leftovers (I was there with a friend and we shared the two).  Highly recommend!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2014-05-22", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 1}, "user_id": "Ktzg5z613W9QX36IsrPVjw", "review_id": "O_RZP_t6SNYQA5B-209EMQ", "text": "Y'know, I had to give myself a while to get over the figurative gastronomical blue balls I suffered at the hands of Flavors of India.  So here's the scoop.  I'm a business guy. This place isn't much to look at from the outside and there weren't but a couple of cars outside. They've a banner touting their differentiating advantage... \"Ice cold Coca Cola served here.\"  Ok, you have Coke..grand.  1965 is jealous.  But I loooove Indian food & even though I couldn't tell if they served alcoholic beverages, specifically Indian beers, from the online menu (they do) we throw caution to the wind & go on anyway.  We could always leave, right?  \n\nSo upon entering we're immediately seized by the most pleasant aroma... Imagine the aroma scent finger seducing you to scarf down the big steaks like in Tom and Jerry.   Seriously, I saw that. It smelled delicious. \n\nThe gentleman who greeted us was pleasant and I assume the owner.  I've driven by here dozens of times and like I said, I seldom see more than a couple cars here.  Today was no different.  There were a total of 5 tables being occupied.  The people at 2 were eating and 2 were wrapping up in idle chatter.  At first I figured the lone server, who I figured to be the owner's wife as they were close in age, was simply being conscientious in not wanting to rush us to order.  After she passed our table a half dozen times and managed to avoid the eye contact we tried to connect with, we were able to ask what the really good looking food the couple at the booth next to us was.  Maybe it was my imagination, but the answers was curt and she seemed slightly annoyed. Again, as a business person I'd be excited.  Clue: those are buying signals.  We'd been there 10 minutes or so now and hadn't ordered.  Again, there are just 5 booths/tables occupied and all are nestled together in a tight cluster and I'm situated between two of them.  After another 4 or 5 passes from 1 to 3 and skipping me at table two, I wave, say \"excuse me\" and the lady puts up the \"hold on finger\" before I finally get her to let me order a beer and appetizers.  Clue: I'm buying alcohol and appetizers, we're polite and well coifed.  We may be a good table.  The sales guy in me is screaming inside at her inattention by now.  After 25+ minutes and having not been able to order an entree in a relatively empty place, it's a wrap. I ask for the check.  They tell me they were changing over their oil to explain delay. What's that got to do with paying attention to a customer? Nada.  I take the samosas to go and head to one of my fav restaurants instead.  It's a shame really, because I ate one of those samosas in the car and it was damned good. I mean, it was frickin' delicious and I suspect the solid reviews they've had on food would hold up. If only these guys could get selected to go on Bar Rescue to learn to attract and keep new customers.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 2, "date": "2015-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pllKohSPWvhCv6VmKCIL3w", "review_id": "c7sDttjiujY2yOCtKga0zw", "text": "I have always been curious about this place, but I feel most wouldn't because of the outside appearance. The service here is OUTSTANDING. Very friendly and very efficient!!! That alone will send me back :)\nIt is very cozy and quiet inside. They have a dish that sizzles and steams a lot when brought out so it has a fun presentation. Food is definitely good. Not exactly outstanding, but enough to keep me coming back. Five stars!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2015-03-11", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Xc3Lu-VNHpP8UymBrA-pbA", "review_id": "8rOmYzYLCDpS5hibFHcSLw", "text": "My husband and I always drive by this place on our way to work so we thought we would finally stop in as we love indian food. There was a group of five in the center of the restaurant that was enjoying themselves it seemed but other than that it was empty. We were offered some thin flat and crispy cracker type thing and a dipping sauce which was nice and some water, it didn't take long for our server to ask what our order was. We got the masala and butter chicken. We had to order the rice and naan separate, other places gave those along with the meal. The food was ok, not amazing but not bad either, the naan was only one piece and the prices were kind of high for what you get. Service was friendly but not enough to make us go back.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 2, "date": "2015-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6x0FU0k-31HYps6nAwFDsQ", "review_id": "4HxKcuwEsD-um6YX8Qo0Ig", "text": "First time expierience here and I enjoyed it! I had the buffet and tried a little bit of everything. The food was pretty good although some of it seemed somewhat bland. Really loved some of the dishes and the dessert. Service was alright, but you don't really need help with a buffet, right? Anyway it was pretty good, but seemed kind of expensive to me? Maybe if I ate more it would seem like a better deal. I'll be back I'm sure.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2015-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "c8kXlV73xZ15VS1Moku9PA", "review_id": "RsC7n0CZFyvFcy0QSXjfpg", "text": "Came here a week ago and this was a return visit, and as always they do great. \n\nFor a small mom and pop place, this is a great restaurant that has an amazing selection of Indian food. \n\nI come here and have no expectations of a fine dining or amazing service, but I always get it. The food was awesome and the Naan bread is to die for. they check on us enough to make sure we are doing okay but they do not over do it, so it is appreciated. \n\nOur waiter was good, not talkative or welcoming, but got the work done, and I was fine with that. The hostess who I believe is the owner or wife of the owner is very friendly and asked about how we were doing and how we enjoyed the food.\n\nI definitely recommend it, and make sure when they ask you how spicy you want, go with medium, it is still spicy enough to enjoy the flavors and the spiciness.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2015-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vwEHW0d307Ij8LITCXcnyg", "review_id": "juUYHNswvBTgs3aH4harTw", "text": "Good but not great. The price is good and the people were nice and polite.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2015-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0VqIYXKq04lr4br9o8iJ4Q", "review_id": "Xhhj5AbzlEpTaPqhptmu1g", "text": "Absolutely love the lunch buffet! Everything was so flavorful. Huge menu to choose from also. My favs are Mango Lassi & the rice pudding. Definitely will be back to try dinner here.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2015-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "voZ037n5dYitK9_R5oB0bw", "review_id": "V-qlZK3Z0NyuNrJj1e4CEg", "text": "This place made me cheat on my other favorite Indian place in Phoenix. Actually, I left my other favorite Indian place in Phoenix. Their Paneer Tikka Masala is that seductive.\n\nThis place is great to go for the buffet, but don't let that distract you from their amazing entrees on the menu. They might seem a bit heavy on price, but they're easily large enough to split with another person, or split into two meals. They have so many for all meats and tons of vegetarian options. This place also has great garlic naan, but don't let that distract you from their amazing regular naan. \n\nI also want to point out that the service here is really good. The staff are so friendly, especially if they start seeing you regularly, and you can just really tell that they love their business. If you or a friend loves Indian food, I would make yourself a friend of Flavors of India.\n\nAlso, they're a coke place!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2015-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V_hpQSfPxujs9v8QByMyZw", "review_id": "02zESuhR8EOpd7Vq9brG6A", "text": "really awesome Indian food. do the chicken rogan Josh. the spice level is often a bit of a mystery ranging from unbearable to pretty mild on the same dish on different days but its an adventure! the staff is always very friendly and welcoming. do it!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2015-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9QkUkAoL5l2TsqtpEUx1MA", "review_id": "Mezd7RcEvxsEgygMKHWV5g", "text": "Very clean and warming atmosphere. The service was prompt, kind, and helpful - they all worked as a team to ensure customers were well taken care of and had everything needed to enjoy their experience. \n\nThe food was unbelievably delightful. We ordered the #55 Navratan Korma (veggies cooked in a creamy curry-like sauce). The #55 Korma with the rice was money - I would recommend it every single time. We also ordered the #53 Baigan Bharta (mashed roasted eggplant with onions, green peas, and tomatoes) and paired it perfectly to dip with the garlic Naan bread. Word of advice to diners - always get at least one garlic naan order per person - and yes, definitely go with the garlic.\n\nOverall it was a fantastic experience and it's so conveniently located near the Camelback shopping areas. So next time you're in the area, certainly stop here for excellent service and phenomenal flavors. Looking forward to visiting this place again soon.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2015-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "sEWeeq41k4ohBz4jS_iGRw", "review_id": "pWvSOIeyxwReQ8-O5ePnZw", "text": "I agree with the other reviewers here on yelp.   Food is good quality but not very spicy so it's OK for a lunch buffet.   Very clean dining room and bathrooms.  Service is fine as far as a lunch buffet goes.  The iced tea was better here than other ethnic restaurants, it had a hint cardamom or cinnamon that was interesting.", "business_id": "vA9aCw2kTgN8p2SLdm2mDA", "stars": 3, "date": "2008-03-05", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "joIzw_aUiNvBTuGoytrH7g", "review_id": "8mENM1btTaUdSwY-erKcAQ", "text": "Edit: New ownership noticed 2008. \n\nTasty Indian cuisine with a British influence. Pub side has mostly British ales and are served in traditional, Imperial pint glasses.\n\nFood is average and in line with most Indian Cuisine in the Phoenix area. Chana Masala with garlic naan is an exceptional combination at this location. Appetizers are high quality as well. \n\nPrices/portions are on par for most restaurants.\n\nService is about average as well - sometimes great, sometimes good, and sometimes poor.", "business_id": "vA9aCw2kTgN8p2SLdm2mDA", "stars": 1, "date": "2009-03-29", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 1}, "user_id": "xg4AdOGHFxJyWByFbG8stA", "review_id": "pGk-Vaj_zALorE8EXPzuPg", "text": "Pros: Ummm, let me get back to ya \n\nCons: \n1. Currently undergoing some kind of exterior construction \n2. Food had spices in it, but nothing that made any dish \"pop\" \n3. Bathroom is filthy \n4. Service was unfriendly \n5. Felt ill afterward \n\nDon't waste your time here, there are lots of awesome places to eat in Phoenix.", "business_id": "vA9aCw2kTgN8p2SLdm2mDA", "stars": 1, "date": "2011-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nEzOUbeAixT47rIkJXBaig", "review_id": "mUOzsVg7hjCvasdTRwy8Ig", "text": "The food tasted really good, the time to make it, however, took a while.", "business_id": "vA9aCw2kTgN8p2SLdm2mDA", "stars": 3, "date": "2012-04-22", "type": "review"}
{"votes": {"funny": 5, "useful": 17, "cool": 7}, "user_id": "n_lAaNGeWgspbbCJc0DqRg", "review_id": "DoZoNGE9CXJQ0jQRfc4dNQ", "text": "Rubbery, nearly raw, white outside, pink inside chicken in two different buffet dishes. \nI hope they looked at my plate to try to figure out why i simply got up and left, but in my opinion, if you are incompetent enough to put an entire serving tray of undercooked poultry out on a lukewarm steamtable, then anything I can try to explain about what was wrong, will likely fall on deaf ears anyway.", "business_id": "vA9aCw2kTgN8p2SLdm2mDA", "stars": 1, "date": "2012-05-15", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "vWCksqJJfYjGGdD-yb9qGA", "review_id": "vJq9qtPX4K3UNDkIg3fuFw", "text": "Good joint. Brought my friend who have not had good Indian food there. He was willing to try again and i took him there. Guess what - He liked it. Whatever he ordered looked like baby's poop - slimy and greenish, but it tasted really good. My own chicken was quite tasty as well. Everyone gets complimentary bread and some chicken (?!?). Buffet WAS unimpressive. \nHowever, all in all this is a real nice place for some tasty food.\n\n\"I like\"\n\nEugene", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2008-03-11", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "LMlBCXFVAHdPnSA94jc6PQ", "review_id": "QGe-BFFgDnVJ2l3jHXq0eA", "text": "If Star of India (SoI) is named after the historic ship that set sail from Great Britain to India then it is best to declare at the beginning that there is nothing worth remembering about this place and there is little that keeps you afloat in the morass of ordinary fare. \n\nLike many other Indian restaurants in the valley, the smell of Indian cooking hangs in the air and permeates every piece of furnishing. The place does not disappoint when it comes to service, it is warm, quick and attentive. The complimentary papadums (Indian flatbread) with homemade chutneys (condiments) is usually the high point of a meal at SoI. \n\nExperiences with the order could be as follows: \nGobi Parantha (Indian bread stuffed with cauliflower)- The real thing is meant to be fluffy and served with butter but the SoI parantha resembles a topping-less thin crust pizza. \nLamb korma- The gravy is thick, nutty with a lot of authentic flavours but the meat tastes pre-cooked. \nChicken biriyani- it is difficult to describe the God-food that is biryani but SoI manages to serve a new variation which is nothing more than chicken pieces thrown into a mishmash of rice and vegetables. \nDisheartenment with the over-priced, sub-standard food could lead to a decision of not ordering dessert. \n\nFinally, as observed in other reviews and the menu, if you visit this place then stick with the tandoori stuff and Chef's specialities. However in that case the excitement of an extensive menu will be lost.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 3, "date": "2009-03-09", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "8CNEh7fSbLwDuAKhLjDPKQ", "review_id": "KlAuOy7oPnzyxAikPYiBfA", "text": "Not by any means an Indian food expert, nor have I been to more than 3 Indian places.  I was craving some Naan (that awesome flatbread) and talked to my good friend (who's Sikh) and he recommended this place as it was local to me and he had had a good experience there - and if he says it's good I listen.  She even asked me on a 1-5 scale how hot I wanted the food... 3 totally but could have done 4 probably :)\n\nIt's in a dark corner of the plaza and the price was higher than I was expecting but the food totally made up for it.\n\nThe safest thing I could get is Chicken Tikka Masala, which tears me up anyways but I love indian food (don't think indian food is meant for skinny white guys.. just sayin).  \n\nBottom line... girl on phone was very helpful and very nice, the guy at the front desk was very welcoming and nice and they even offered me drinks for waiting like 3 minutes for my food to be done (was doing take-out).  Felt very welcome there and everybody was friendly.\n\nGot home, everything wrapped and sealed up nicely as for no spillage in the car and the naan was wrapped in reynolds wrap. \n\nFood was great... bread warm and fluffly, chicken cuts were very tender and moist and the rice was perfect fluffliness.\n\nI'm totally going back... but I need to give my body a break... I'm payin for eating Indian food...  but it was so worth it!", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2009-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qABKRj1ggJmtvrL9FMFtuA", "review_id": "WoTWk08JVZiysLrA6mc3dQ", "text": "We lived in Ahwatukee for probably a good 4 1/2 years before we ever tried Star of India and I have no idea what was stopping us. (To think of all that wasted time we could have had together...) We met some friends for dinner here because she worked with a bunch of Indian guys and they said it was the place place they found in Phoenix. I've probably only been to maybe five different Indian restaurants in Phoenix, but so far, I'd have to agree. \n\nSome particular delicacies you'll find are in the Chef's Selection area of the menu. My husband can't get enough of the Lamb Frazee (I think that's what it is). I can't go for a visit without the Aloo Gobi (in the vegetarian section). \n\nThe lamb frazee on the chef's specials my husband LOVES! It think it's the first one on the list. I can't go without ordering aloo gobi (potatoes and cauliflower) and a side of raita. My favorite time is actually lunch when the have a nice buffet with at least three different main courses and probably three different vegetable courses (almost always aloo gobi is there too). At lunch they bring around naan to everyone but if you request garlic naan, they will oblige. You also will get a plate of tandoori chicken - so good! The toddler loves coming here with us. He eats off both our plates and waits (most often impatiently) for desert. Our favorite (and they're always on the buffet) are those little cold, wet donut balls. God, I love those things. (Though my personal description does them no justice.) \n\nI ate here throughout my entire pregnancy so maybe that's why the toddler has a taste for spicy ethnic food. (That could also explain his love for ahi...) Either way he's always happy to come, as am I. \n\nIt's priced well and everyone is so friendly and sweet. They're always bringing out extra treats for Beckham (the toddler) like rice pudding and if you haven't been in for a while, they still remember you and greet you like an old friend. Maybe I can talk the husband into going here for dinner tonight? Nothing says Easter Sunday like a little curry, am I right? Jesus didn't sound like a picky guy. And with party tricks like water into wine, surely he would have been up for some curry...", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2010-04-04", "type": "review"}
{"votes": {"funny": 5, "useful": 2, "cool": 2}, "user_id": "oC0kwGvgaAeT3ZIxdxTcJA", "review_id": "U7Dj2xtii0Ehj7zku4mjdQ", "text": "Ridiculously tasty. \n\nNot good for you.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2010-04-22", "type": "review"}
{"votes": {"funny": 13, "useful": 10, "cool": 11}, "user_id": "emNXAAschSlcvqmDZFj5TA", "review_id": "CtlKO1dJVLTnPrKruZLfsA", "text": "I feel really bad about not bestowing five whole stars upon this place in my previous review. In hindsight, the only explanation I have is that I was \"holding back\" because it was my first visit to ANY Indian restaurant in the valley since moving here and I didn't want to just go carelessly throwing five stars around before experiencing other Indian restaurants. \n\nTo help you understand what I mean ... It's as if you were an ice skating judge at the Winter Olympics. And the first skater out, say, from the Congo, absolutely blows you away. Like, you can't believe it! But the whole time she's skating  you're thinking 'The Congo? Do they even have skates? Have they ever even seen ice?' And she finishes her routine and it's flawless. But you haven't seen any of the other skaters yet. So you can't go ahead and give her a perfect score, especially without seeing the Russian chick first. But you're not allowed to wait and see the Russian chick before having to submit your score for the gal from the Congo.  They need your score right now! So you ding her for some arbitrary reason, like her skate laces weren't the same length as each other. Or something.\n\nAnd then you get a chance to watch the other skaters, Russian chick included, and they were all just \"meh.\" And you wish you could go back and change your score for Ms. Congo, but you can't; the IOC won't allow that. And you have recurring nightmares about the medal ceremony, where she stands on the podium with her bronze medal, just below the South Korean girl (who trains in the US) and yes ... the Russian chick. But she displays great sportsmanship. She smiles as the Russian flag waves and \"Gosudarstvenny Gimn Rossiyskoy Federatsii\" (that obnoxious national anthem) plays over the loudspeaker. She is probably happy with her bronze medal. She might even be a hero in her home country. But you know it's just not right. She was done an injustice, and YOU were responsible for it!!\n\nLuckily this is Yelp, and not the Winter Olympics. Now that I have eaten at several other Indian restaurants in the valley, I have become a regular at Star of India and would like my previous three star review stricken from the record and replaced with five strong stars. In fact, I'm gathering signatures on a petition that Star of India be renamed Five Stars of India. \n\nThey deserve their gold medal.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2011-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AkJFqLqHHAKY3H5R8p7cPQ", "review_id": "_kfHO_cDydhBCTNqD1gycg", "text": "Star of India has an upscale Indian restaurant theme.  The prices are definitely upscale, but is unfortunate that I can find better food at simple Indian establishments.  The food is well spiced and flavored, but the main problem I had was that some dishes tasted exactly the same.  The Korma and Mattar Paneer should be two distinct tasting dishes, even though the color of the sauce is the same.  The Korma has a little bit of a sweeter taste normally.  The naan was not too special and slightly burned.  I would say the service was similar to an upscale restaurant.  I would take a date here, but only if she has never tried better Indian food before.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 3, "date": "2011-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "Xm8HXE1JHqscXe5BKf0GFQ", "review_id": "UrAF3qnqT3ANgB-08HJBUQ", "text": "Wow. Just... wow. Wow! \n\nI came here for a wedding rehearsal dinner and the experience was incredible. I was in a large party and we ordered damn near one of everything on the menu and every single thing I tasted I wanted more of. \nTandoori chicken - served on a sizzling platter with seared vegetables and fall-off-the-bone tender. Had a delicious, yet mild, flavor, perfect for those venturing into Indian food for the first time. Vegetable korma is my absolute favorite. It's like a thick sauce you can eat over rice or by itself with chunks of potato in it. Very flavorful. Chicken Vindaloo is a little spicier but doesn't kill your tastebuds with heat. The spice definetly enhances the flavors in the dish. Sop it all up with rice, or garlic naan and special naan. Sooo good!", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2011-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "q4jp1k8pheCrt9288XTDCA", "review_id": "gu8nyVBtO--bQtGp0yn_pQ", "text": "I almost feel guilty writing a review for Star of India, since I frequent this restaurant at least once a week.  Obviously, I'm a fan.  The owners, who seem to spend their entire lives at the restaurant, are some of the most welcoming and thankful hosts I've ever run across.  This is one of those small family owned restaurants that I feel proud to support.   \n\nDon't get the impression that I would rave about a place if they didn't have the food to back up their hospitality.  I'm fairly certain I tried just about everything on the menu.  My favorites are the Chicken Tikka Masala and the Saag Paneer.  My wife and girls really enjoy the Paneer Tikka , Samosas, Malai Kofta, and the Shahi Paneer.  My oldest daughter has developed something of a reputation at Star of India as the \"Gulab Jamun\" girl.  Each time she comes home from college, we pay them a visit. The owner can't resist bringing her ridiculous numbers of these desserts just to see the look on her face.\n\nIf you've never tried Indian food before, this is a great place to start.  Ask for Preet and he'll be happy to help you pick something that meets your tastes.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2011-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Zs676AlG94gQ6vL1gvgd6w", "review_id": "o6Kyh3E17ZksTeofMJBBpA", "text": "Consistently good Indian food. Anything with the garlic naan is better. T host is always attentive, though when he is not around, the staff are definitely not up to the same caliber. Their food always tastes fresh, hot off the stove.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2011-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "8KCUDaMhHkv5ixutvpBlZw", "review_id": "7lpmo8jKmtFhmD6olGgt-A", "text": "This place is the spot for lunch! I mean come on. Its Indian food buffet style! What's not to like about that. They serve you garlic naan or plain naan also buffet (all you can eat). The have all the standard fare as well as basmati rice. I always eat about a metric ton of food and when I get the bill... That's right $10. Starbucks costs more than that!! Definitely try this place out.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2013-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "zG1tYaWP2bE9mAaLzbx9GA", "review_id": "7vTjthcfBPAStce8X435Cg", "text": "Lunch Buffet\n\nThere was three of us for a fast lunch.. The food was excellent and the service was very attentive and helpful with ingredient explanations ( one of us is gluten-free). \nThey had about 12 items to choose from (meat and vegetarian) along with a basic salad, and 3 desserts. \n\nWe plan on going back again the next time we're in the area.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2013-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "AHzdtfdMvq7hWvie41DVQA", "review_id": "UzvP55s7kU901T6htqRxHw", "text": "Been here many times. Good food and service. Never disappointed. I like the ambience in the room. Light music, dim lights and quiet. Just wish the place is bigger. Not much room to move at the table.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2014-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JfiswC7gqPAYllVjn-G7Ew", "review_id": "d5uLNYFWKg_Og27jufXuoQ", "text": "Been here three times now over the last few months and the food and service never failed. The tandoori chicken is amazing! Have had it three times now and it didn't disappoint! Another favorite is their malai kofta! So delish! Definitely recommended!!", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2014-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z1RLrh0m3sAx_qHt8d2QVA", "review_id": "ydH95h-Dw4r2QKtvDyYmxQ", "text": "the lunch buffet is a great deal. The fresh garlic naan is delicious as is everything else.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2014-04-27", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "3gIfcQq5KxAegwCPXc83cQ", "review_id": "DcAAnQtDlxc7j1PEquQYRQ", "text": "I visited Star of India with a friend for dinner and we both agreed that it was alright. The service was attentive, which we liked. We had the chicken masala and the lamb vindaloo with garlic naan and rice. The chicken masala (ordered mild) was good, with very tender chicken, but with a little lacking in flavor in the sauce. The lamb was alright... a little tough, as if it was not cooked long enough, and the sauce (ordered medium) was not spicy and, though more flavorful than the masala, it wasn't the most amazing I have had. Overall, it wasn't bad, but it wasn't great. I was also a little disappointed that we were charged for the rice.... really? The dishes (which are not inexpensive) don't come with a tray of rice? Indian food is all about the sauce, the meat isn't meant to be the main part of the meal... so what are you supposed to eat the sauce with? A spoon? It wasn't a huge charge, but I disagree with the concept of it. Anyway, I don't think I will be rushing back, although maybe it is better at lunch time.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 3, "date": "2014-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0ApG78wVTLJpr6D9y1tBVA", "review_id": "cmzUYryMVF0eOVQyWArMTQ", "text": "This was a wonderful experience! We have never had Indian food prior to this...\nWe walked in and the wait staff was very welcoming. We were unsure of the items on the menu and the waiter took extra time to explain the items and make suggestions! \nFood was AMAZING!!!! \nAfterwards; our waiter brought us a desert on the house! Very good food...great service and a quiet and quaint atmosphere! \nMust go!!", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2015-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "i3xyCKYLeqxA-2e5pZxPWQ", "review_id": "7x-xSbUookcyj9vcoqULYg", "text": "I was surprised upon first entering this spot (as recommended by my cousin who raved about this spot when she first moved to AZ) the place wasn't fully packed, a few tables were empty & there were two other couples who came after us which we all waited in the seating area for a good 15-20 minutes. At this point i'm not discouraged because i will wait if i'm anticipating GOOD food so finally, we got seated along with those 2 other parties at the same time. \n\nAnother 5 minute wait to look through menu & get drink orders taken. They forgot my coke which was later served the THIRD time our waiter miraculously came around :(. We finally ordered while snacking on the chips which tasted like residual hemp products lol not really my fav-definitely an acquired taste. We simply ordered sheikh kabob, chicken curry, naan & pista kulfi ice cream for desert....so i run to the restroom which was dirty & was disappointed considering even the worst hole in the wall gems i have found have clean public restrooms! Should have been the last red flag for me & ended the experience right there....\n\n....Another 10 minutes pass by & I'm noticing the tables next to us have already gotten their food....come another ? minutes at this point i'm wondering if my frustrations are psychologically ruining my taste buds or was it from my dehydration from the lack of water refills because in between the two tables who were also seated at the same time if my cousin & i were intentionally being neglected considering most of the tables left & aside from the table who was next to us were the only patrons left in the joint! We are not the type of people who make a peep in public places, as both of us work for the public & for this reason i will always rate my experiences honestly.\n\nFinally as the last table left  we were still getting served our last dish. Mediocre at best. I found a plastic part in my pista kulfi which topped off the list of undesirable dining experiences i've ever had.\n\nTerrible.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 1, "date": "2015-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MZuoTL93mWZOrL6IvUDKHw", "review_id": "yIV8qITJRvJMgNwFc-fiqA", "text": "I have been coming here for over 10 yeas and love this place. Prete is the owner and does a great job running this place. We have never had a bad meal here, and when it comes to Indian restaurants there are plenty of terrible places in Phoenix to visit. This however is not one of them. I have eaten Indian food all over the world; Germany, London, New York.... and this ranks at as one of my favorite.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2015-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pZVI7pFOk0-D2d4IaFb7aA", "review_id": "BJJMnJgmRIo-giXOufYbWg", "text": "This place it's so amazing not just because of the flavorful food but also because of the wonderful people the manage it. I am always craving this food. Buffet from 11am to 2:30 really worth the price. Today the owner thought me how to nNe garlic bread and it was an unforgettable experience", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2015-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GkWuTgewni9bzPM4HUCO-g", "review_id": "9Aex5DAD5Lmd-LiKJU3M8A", "text": "Let' s get one thing straight, this is not Indian food. It's Pakastani food. They threw out the word \"Indian\" to attract more customers however the food is very traditional Pakastani. I didn't think the food was good at all. There are better Pakastani restaurants like Tandoori Times and Tandoori Village.  \n\nThe only reason this place is still in business is because it is one of the first \"Indian\"-Pakastani restaurants in the valley and so clueless Phoenicians had no idea what Indian food back then. If this place opened now, it would go out of business with all of the new and better restaurants in the valley.\n\nThe restaurant is clearly not for vegetarians and that is no suprise since it is a Pakastani restaurants and Pakastanis are not vegetarians unlike many Indians.  They specialize in the chicken and lamb dishes and much of their food is cooked on the bone in a traditional set up. There isn't much flare or professional chef-like appeal tot he food.  It has a very homestyle Pakastanie cuisine. As a result the food is not that spicy and doesn't pack a lot of heat but it does have flavor. Again, I'm biased because I'm not Pakastani and I prefer Indian food which is spicier and richer (greasier). However, if you are Pakastani, I think you wil enjoy this restaurant as it does have a very authentic Pak style cuisine.", "business_id": "H-99nG_KfynWPXh84TKj8A", "stars": 2, "date": "2009-03-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "LMlBCXFVAHdPnSA94jc6PQ", "review_id": "Vj7UmI7qXQ3pLRPkmxfr2g", "text": "Situated right beside the awesome Cornish Pasty Co., at first glance this place comes across as a curio shop. There are show windows decorated with Islamic art pieces and carpets. This restaurant scores points on the ambiance. Unlike other dingy South Asian places that I've been to, this one has a sealed-out kitchen to keep their customers from a smelly experience. \n\nSince the menu is predominantly Pakistani and Mughlai it is best for vegetarians to skip this place unless of course they are happy with a couple of paneer dishes, Indian breads and appetizers. It is also useful to be aware of the slow cooking that goes into Mughlai food that makes it flavourful in a different way. People who visit this place expecting a mish-mash of spicy curries might be disappointed. \n\nWhen we went there we found that a young fellow was managing the show. We went ahead with the lassi, palak paneer, naan, sindhi chicken biryani and the lamb curry. Satisfied with the first three courses we wanted to round up our dinner with phirni. The young fellow (presumably the owner's son) wanted to pass off kheer as phirni but since we knew the difference we cancelled the order. \n\nOverall it was a good experience and we'll be going back for more.", "business_id": "H-99nG_KfynWPXh84TKj8A", "stars": 4, "date": "2009-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "Rg4gzsz3w00vRlIOXcGUIA", "review_id": "NQFOQwTqelfItogQ3-3ylA", "text": "I love this place. It's great Pakistani food near my house. The chicken boti is really good and the naan is acceptable. Last night a few of my party said things were too spicy so if that's not your bag, have them knock down the spice a little for you. \n\nThe service was great. We had a group of 6 and the man was accommodating and friendly. We had drinks all evening and he brought us food when it was ready. It was quick and tasty. \n\nIf memory serves, they do not have alcohol but you may bring your own wine to share at your table (we've done that several times here).", "business_id": "H-99nG_KfynWPXh84TKj8A", "stars": 4, "date": "2009-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LqgGgWi3FLHBViX9tmZ9sw", "review_id": "OfLCBe7NcHf1gVOyn-Rcfg", "text": "Just been there once, but their Chicken with mint, cilantro, garlic and ginger is AWESOME!!! \n\nI would like to try something else next time!", "business_id": "H-99nG_KfynWPXh84TKj8A", "stars": 3, "date": "2009-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "7oaogEbu1xBlGZaDeMl6Gw", "review_id": "coqhUMY_63o6-EkDyt8J8w", "text": "The other night my girlfriends and I were starving after a book and author event that we attended at Dobson High School.  Craving Indian food, we stopped into Copper Kettle which is located in the closest shopping center to the school.  It's not often that I feel invisible, but the poor service we received here made me feel that way.  There were only two other occupied tables when we walked in, and the wait staff made me feel like I was intruding on something important.  They were all standing around a table and I had to actually make eye contact to get the head nod directing us to our seats.  After asking for water three times, we finally got it WITH our entrees (not to mention that you can't order a Kingfisher to wash your meal down because they don't sell alcoholic beverages).  Yes, they ignored all of our requests for something to drink until they could bring it with our food.  The food was actually fine.  We ordered three vegetarian dishes - the lentils, vegetable curry and a cauliflower dish.  The spice level was right but the portions were pretty small.  And, they charge for rice.   That's one of my biggest pet peeves.  Has the price of basmati rice gone up so much that you have to make me feel silly for asking if it's included?  I love Indian/Pakistani food, but the poor service here was more memorable than my stomach's happiness so I don't think I'll be returning if I find myself in the area again.", "business_id": "H-99nG_KfynWPXh84TKj8A", "stars": 2, "date": "2010-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Esi0LF6paDqj7W0LcDX4AA", "review_id": "LHwmjxTP8bll-PBxfKlKjw", "text": "\"Exotic warm spicey radiantly delicious, everything I tasted got better and better\" says my wife. We had the chicken tikka masala, the matar paneer, pea pulao (basmati rice) and a garlic & cilantro nan. The portions were generous. We haven't had much Indian (or Pakistani) food before, but just the past week we had some while visiting Sedona, and it's very interesting to see the different styles of preparation.  The masala at Copper Kettle was thicker and I don't think the sauce was spiced as much (as the place in Sedona), the chicken in the masala on the other hand was spiced beautifully (fairly hot).  There was a buffet available (at dinner), but we opted for fresh preparation, and although we waited a little bit for our food, it was worth it.. The staff was very friendly and assisted us with our selection.  We look forward to our next visit!", "business_id": "H-99nG_KfynWPXh84TKj8A", "stars": 4, "date": "2011-03-25", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "8JC-Yb3UDUv2FUl5ym1nVg", "review_id": "TABNhLzlvqGh8IOt8Bup1g", "text": "Is it possible to have two horrible experiences in one weekend? Damn. \n\nFuck my life. It is.\n\nI have family in town, so naturally, everyone wants to go to the most ethnic place possible. We go to the Copper Kettle in Mesa. I'd been here before and my experience wasn't bad. I liked it. This time around though, I felt like I wanted to kill myself.\n\nWe walked in, it was busy. Great. Good sign, that must mean that people like the place. I noticed there was a buffet in the back. All the food looked fucking miserable. Of course it did. It's a buffet. What self-respecting person would eat ethnic food at a buffet?\n\nIn any case, we are seated. 15 minutes later, we get 3 menus. 5 people at the table. 9 minutes after that, we all get plastic coke classes of ice water (I shouldve been conservative on this 98 degree day, because this was the only water I got-- no refill). \n\nWe ordered our food, and it was fucking useless. The chicken was undercooked. My mom ordered the beef chapli kabob, which came out to the table sizzling....seemingly great, only to make EVERYONE in the restaurant cough, and give us dirty looks.\n\nMy poor aunt had specially requested no chilis in her dish, and of course, her dish had EXTRA chili. My aunt requested all of this in Hindi and Urdu....native languages to these people. What the shit is wrong here?\n\nAfter we got our food, no one came back to check up on us. On this hot spring day, we never got refills on our waters. I guess now I know what it's like to be welcomed to the desert. Thanks a lot Copper Kettle. \n\nAlso, with the undercooked chicken, my family and I are probably going to get sick from salmonella. Kidding. But seriously.\n\nI am Indian and my Dad was born in Pakistan. I can judge this food and service. I can't come back here. This place is a joke. \n\nGetting a server was like what I imagine it's like to hail a cab in New York City. They see you. They know you ask for their help. They know you are a paying customer, but don't really care about you and go on with their day.\n\nBottom line....\n\nNo respectable Indian or Pakistani should/would eat here. Or Human for that matter.\n\nNever coming back.\n\nThere has got to be a better place in town...", "business_id": "H-99nG_KfynWPXh84TKj8A", "stars": 1, "date": "2011-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HfEjLlPBsJIfUy4EBlbxZQ", "review_id": "jETiQ0Tq7KfCQe-OMU2Wbw", "text": "In Scottsdale for vacation used Yelp and Zabihah.com to find some halal eats. Came across this place and said \"why not\"? \n\nWhen we got there the place was empty. It was a sunday night around 8 so figured there might be one or two people but it was bone dry. Ordered food as we were so hungry. Nice wait staff, very helpful. I ordered the tandoori mixed grill and the wife and little princess wanted to have paya. I thought the tandoori mixed grill was ok. Some of it was dry but there were two delectable morsels of chicken covered in some sort of yogurt sauce that were amazing. Both ladies loved the paya. On the way home I developed some gatrointestinal issues. Man, it hurt. Could it  have been from the food I just ate? Not sure but it was tough driving back to Scottsdale as there were some tense issues. I have a sensitive stomach so no doubt some of it was my own issues. Ladies didn't have any discomfort. \n\nWe returned the next day for the lunch buffet. Nothing fancy and nothing amazing, just your average fare. I wish they could have had more meat in the buffet. \n\nOverall, not a bad place but nothing amazing. When we came in for the buffet it was also empty but then two more families showed up as well. We may go back if we are in the area again.", "business_id": "H-99nG_KfynWPXh84TKj8A", "stars": 3, "date": "2011-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jKeaOrPyJ-dI9SNeVqrbww", "review_id": "o6eIvVw9WapSwX8cP-rk5g", "text": "Pretty good Indian cuisine!  The service was excellent; our waiter was very attentive with water and checking up on us.  The food was a tad-bit over-priced for what it is.  It was excellent, however.  There are many vegetarian dishes.  My personal favorite is the Malai Kofta.  I also ordered a fried cheese appetizer, and it was very good, though it came out after my entre.  The place is a little bit slow too, though not due to staff.  I think the problem may be a slower kitchen.  Everything tasted fresh and delicious!  I used my Entertainment book discount for a buy one, get one entre, and I would come back!", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 3, "date": "2008-03-17", "type": "review"}
