{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RJgfj-6Uq-lyiPJJcyCVlQ", "review_id": "M28dSKnyInjQu0I9NJlfig", "text": "Far away from real Chinese food. Doesn't even taste good as American style Chinese food.", "business_id": "SQ0j7bgSTazkVQlF5AnqyQ", "stars": 2, "date": "2013-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z2ZLBPq_Vkb0Yel8Um-tvw", "review_id": "8NvhPJE8TDHhhXxricgI5A", "text": "I went with my family late at night ,the food was not good at all , it looked like the left over , I hate it.\nThe service was not that professional!!!!!!", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 1, "date": "2015-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "_-ZutwtgzmP0IhCCTMeOyA", "review_id": "77bkPTf4VHZpFTQJ6opE2g", "text": "I live downtown & I LOVE Chinese food. Living down here it's been wonderful having the ability to have things delivered other than pizza. \nSO... my fiancé & I order from here often enough that I believe they know us by name practically.\nEverything we've ordered has been really good. Not epic good... but good.. EXCEPT their peppered chicken IS amazing good. BIG AWESOME GOOD... a must if you order from here.... it's basically the best thing they have on their entire menu.. I'm pretty sure that's totally accurate. \nI order online mostly but when I do call in an order - the person who answers is always nice - easy to understand. The delivery person is always smiley & super nice too.\nOne time they forgot our steamed dumplings - I called & told them the problem... the person came back & delivered them within a few minutes of the mishap & was super apologic & really sweet.\nI know this place has gotten some rotten reviews over some time but it's very easy to do that as people don't always give the happy reviews when they're pleased typically.\nSO, I say - give it a try people - order the peppered chicken - it's excellent - you're welcome in advance & if you're happy - write a happy review. :)", "business_id": "1E53rS8afK2jiLod8Jwy7A", "stars": 5, "date": "2014-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pMf6ebP3jCkELI8RdUebPw", "review_id": "tbo8_DB3cfoi9aqgtNZChg", "text": "For a quick, decent Chinese place in Shadyside, check out China Palace.  You get what you expect, it's fast and not too expensive.  I've only had delivery, but when I want Chinese food I've never had any surprises.\n\nAt the end of the day, you get what you pay for.  As for delivery in they area, it's decent enough.", "business_id": "Q9BXMPu2HnRDMq9X_2rHrQ", "stars": 3, "date": "2009-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "xtv-RHo_mMjNq0oX7nRn7w", "review_id": "R78WNt3or0Dc275D3pZn9Q", "text": "I have only had takeout from Tai Pei, but the chicken lo mein was delicious and the general tso's was the best I have ever had! It was sweet, but still had a kick to it. Nothing was over priced and we weren't waiting forever for delivery. Will definitely visit the restaurant in the future!", "business_id": "dwz55gqPZwSBD74yFFb27g", "stars": 5, "date": "2014-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LEUuU4-DSu2KilvIp0vblg", "review_id": "YbMK3JdzNhVwF4tblk5uag", "text": "Been goin here for years. I'm a pineville native and this place set my standard on Chinese takeout. Aways great my parents love it as well. I always get house lo mein or general tsos. Always dank", "business_id": "Zm9uQ4SYpZzUb3epDMeb7A", "stars": 5, "date": "2015-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zoT1UvmSx4hjyu3GbH_Swg", "review_id": "67dVxKsCbe8xbpHHrRjthg", "text": "This place needs consistency.\n\nOrdered delivery on 2 nights and while the first night's order was a big success (spicy ramen and mapo tofu), the second night was unbelievably terrible. My colleague ordered curry noodles and it had NO taste/salt in it whatsoever, and their $5.95 dessert cakes are small pieces of store-bought cakes that were horribly overcharged.", "business_id": "rT-iPtIXMKj3dTcl87lbOw", "stars": 3, "date": "2015-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6PO3R6ZUw8r6WfRnzlexnA", "review_id": "O4mVg0DwNowcPmbZAHOb3A", "text": "Nothing special but OHHH SOOO CHEAPP!!! Also, a tad better than a hole in the wall Chinese places. The food? Pretty good, not stellar but for the price you can't beat it! I always get lo-mein, singapore noodle, or pan fried flat noodle. YUM YUM YUM. If you are uptown and want cheap Chinese food that doesn't taste cheap, this is your go to place. Find another place in Charlotte that you can get cheaper Chinese food and I'd be amazed!", "business_id": "cibtubYc6gd8T6Y-nPPByw", "stars": 4, "date": "2013-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "5evSUr4xbyfU2e_rOuv7AA", "review_id": "8HfHela0fNCQp_6WZQ9Ijg", "text": "A fellow passenger on us air recommended this restaruant, and after 2 visits,  its a good recommendation.  This is probably the best chinese food I have had in town, however I am only giving 3 stars because of the way they serve the food.\n\nI think most people would experience chinese food as served family style.  In otherwords you may order a dish, but its pretty much a free for all when it gets to the table.  Thats how it works in my family anyway (disclaimer, I am not chinese)\n\nIf you haven't been here, its kind of hidden at the farthest north part of the parking lot.", "business_id": "IKUVWL75eSoC71G2fBphmA", "stars": 3, "date": "2011-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ts7EG6Zv2zdMDg29nyqGfA", "review_id": "qqsUPjZFy1kGykIt5t9NHA", "text": "Having been here for both lunch and dinner I can absoutely report that P.F. Changs is A-OK.  The appeal has lost its luster to me personally because I have been there pretty often when I use to work on that side of town but it's still a great place for food and great quality food at that.   \n\nThe service is always solid and I can honestly say I've never had a bad meal.  Lettuce wraps, seared ahi tuna and low mein meals really do the trick for me.\n\nParking is somewhat of a challenge here but you can always valet if you feel like it.  I suggest it really.", "business_id": "4CPrhBc4Ado90fj7PG6jrA", "stars": 3, "date": "2013-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "C6KSyiPNi7hNv9UdXeMSJA", "review_id": "xzqK3hrFcmUG04tjtCuP1w", "text": "Took the family last night because many neighbors had suggested it for a meal. \n\nOK food, not too exceptional. Nice ambiance and service level was acceptable. \n\nNothing about this restaurant made think \"I am glad I came here tonight\" Expensive food with medium taste profile. Not to return, I am afraid. \n\nWe tried a sampling of spring role, velvet corn and chicken soup, fried crab won-tons, Asian beef & chicken, ginger shrimp, and pineapple chicken fried rice. \n\n8 shrimp for $15+. Really enjoyed the Asian beef & chicken - good flavor. Crab won-tons tasted like only cream cheese and no crab. Velvet corn and chicken soup was tasty but needed lots of pepper.", "business_id": "s-cFWOk9LXXZCrm4lKpjEg", "stars": 2, "date": "2010-03-07", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "KFF_u2ytqs2Z_EHolxHsNw", "review_id": "eLfNyQcXUpAY8EGzFVZeKA", "text": "Okay so take the Chinese food place that's down the street - they charge 5 bucks for a ton of food right? Well this place is similar to that except they charge a ton of money and give you less food (albeit better prepared). I can't fault them for that right? It's \"Murica\" after all. So if you have too much money and want some well prepared Chinese food - this is your place!", "business_id": "s-cFWOk9LXXZCrm4lKpjEg", "stars": 4, "date": "2015-03-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "_d7JPhUHOhEYXwBVvifpHQ", "review_id": "Tc4Ic09gM09uvYBiPTUACg", "text": "As stated in my previous review, this is definitely the best Chinese Food that I have found in the Charlotte area.  It is authentic, tasty, and from cradle to grave they provide the best experience.  \n\nI love the fact they they take reservations and stick with them so if you're a planner like me and hate waiting long, south Charlotte Saturday lines this is your place.  I stepped out from my normal order last night and had the Beef Chow Fun which was scrumptious.  Nicely cooked, tender and perfectly seasoned strips of beef with udon noodles.  We started with the usual chicken lettuce wraps.  We also had the Steamed Shrimp and Basil Rolls which were disappointing, not enough steamed shrimp and WAY too much iceburg lettuce.....in retrospect they should have been sent back.\n\nThe service was a bit spotty and since we had a larger party we waited a bit longer than I would have liked for the check but all is forgiven because the bulk of the meal was so darn good!", "business_id": "i-tKO0n-1Tq6sTFUrhg9-Q", "stars": 4, "date": "2013-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UcejxUacEFZbWaIlyc2chg", "review_id": "mCt0cImSXfTYAP9N7aM3QA", "text": "I have been going here for many, many years but on my last visit, the food was terrible.  The crispy shrimp was soggy and the egg rolls had a horrible taste and smell.  I was told by the lady at the front desk they were homemade but that was incorrect.  I have had fresh, homemade egg rolls and when you bite into them, you see the fresh cabbage inside.  What Great Wall of China South serves is cheap, frozen egg rolls.  I won't be back.", "business_id": "qam5QKFE2a8MQBkxznrr3w", "stars": 2, "date": "2014-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6YhcHDOccTTVNWCg_TTvzA", "review_id": "qjNKj-spHfp_rQo_BzG9nA", "text": "I am new in town on temporary work assignment from ATL and I got delivery from here the other weeknight. I ordered the shrimp fried rice and the shrimp mei fun with a couple of vegetable spring rolls.  The shrimp fried rice was a little gooey, but nice taste and quality, just a texture thing.  The mei fun was not as light as I've had elsewhere and they used spaghetti noodles instead of angel hair rice noodles like I'm used to.  This made the texture with the sauce a little heavy and overbearing.  The taste and quality were pretty good though.  The veg. spring rolls were the same as you've had anywhere, i.e. crunchy deep fried with veggie nougat interior.  The guy on the phone told me 45-50 minutes for delivery and they were here in about 25 min. so that was a big plus.  I will order from here again.  It did not blow me away, even for carton take-out, but it was suitable for my fix.", "business_id": "QoCjVVy4--QNyVRkzQTCEg", "stars": 3, "date": "2012-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "011Ny5tOdSs_ZI_EzILaRA", "review_id": "ugxo0iHxlK1nPo-rM15u0g", "text": "Awful, awful, awful...  The worst of the worst of the cookie-cutter Chinese restaurants.  Food without flavor, a menu without imagination and a staff of such profound indifference it's hard to tell they're even there.", "business_id": "UgjVZTSOaYoEvws_lAP_Dw", "stars": 1, "date": "2013-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "oc83z2R6banyLc88VlELlA", "review_id": "fyU-fqtrFYJRWCm9yj57eA", "text": "I'm confused why anyone would choose to go here.  \nTo be clear, my expectations were that it would be an all Asian version of Noodles & Co.  Cheap, decent, fresh food.  \nCheap - yep\nDecent - no\nFresh - maybe at one point\nI ordered the Thai curry noodles.  Not impressed.  I've never tasted something that claimed to be curry with so little flavor.  My vegetables were obviously charred and they still sent me the dish.  Yuck.  My boyfriend ordered the teriyaki udon, and the noodles were too skinny to be udon with the same flavor issues.  Not even the chili garlic sauce did much to it.  \nChin's - good concept, but a waste of money even at $6.", "business_id": "KW6HejC-67KSL9J8Cz1dSw", "stars": 1, "date": "2010-04-07", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "LBVtihNDJwU0AnFBmZMq3Q", "review_id": "ws5Wjg0-2n1RNQhU5Pia2w", "text": "Best Chinese take-out in town. They have the best pork egg rolls I've ever had. The woman who answers the phone and works the counter doesn't speak English very well and yells a lot but I'm willing to put up with that considering their food is so good.", "business_id": "oX6KamASYXnMIe5kpVhezw", "stars": 4, "date": "2013-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nDtgjp585RnJkeAeAG63Sw", "review_id": "I4SJf-oRpckh_oX5_3T3sQ", "text": "Pretty darn good for local Chinese fair, compared to some of the others around. The Gov Tso's Chicken was okay, I have had better (not locally, so far this was the best I have had in Madison for the price), and I definitely have had worse.  It was crispy chicken. Fried rice was nice, not overly salty and had a good portion of veggies and pork.  The Pepper Steak was decent, too.  Crab rangoons were excellent as well as the pork egg roll and the veggie egg roll. I think its safe to say that I will be ordering from here more often when I have a craving for Chinese delivery.  Oh, and it was delivered in a mere 30 minutes, and still hot.", "business_id": "unXHmjewHGeWQwJr74Sy9g", "stars": 4, "date": "2013-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "oolWxkuiaGjgh5wv6_Xh-w", "review_id": "yCvYbn2O5XzdPxFhGzbtdg", "text": "I've only been here during lunch hours, when it's almost completely empty, for their dim sum. The dim sum isn't bad for somewhere not in Chicago, but it's obvious that most of everything is frozen and re-steamed. Prices aren't bad either, about the usual prices for dim sum. They might be the only place on campus that makes real fruit slushies with boba (Evo uses syrup, yuck!). Other than that, the regular food is nothing special and rumor has it this place is closing soon since no one ever goes there anymore. But that's just a testament to the ownership and the so-so food. If you want dim sum you can always go to Saigon.", "business_id": "rE8048_DAh3Z8Tep466wrA", "stars": 3, "date": "2009-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7JQ8n15WeW4D5AnNulQOCQ", "review_id": "7ytiUWBU2q_9XgGFMYkQmA", "text": "I have a high standard for Chinese food, so most places don't get the coveted 5 star rating.  Peking Garden was a weird case for me though.\n\nThis place is EXTREMELY hit or miss, more so then I ever seen a restaurant be... The first time I went here with coworkers, the food was hot, came quick, and tasted terrific. At the time, I would have ALMOST gave it a 5 star rating. I was glad I didn't though. I went back a second time and the food came out cold, there was a long wait, and it didn't taste nearly as good. I went back a third time, and this time the food was just average tasting.  My entree was great but the soup and egg roll tasted weird.. The service was also bad this trip. \n\nThe 4th time I went back though was what ultimately makes the place deserve the 2 star rating, as not only was the service terrible, but our food took almost 45 minutes to come out and there were only three tables filled in the restaurant.\n \nThe worst part was that me and my girlfriend got food sickness from it... It was not fun especially since we both had to work later that day.  We are pretty sure it was from the egg drop soup.  It had large chunks of either oil or raw egg in it, and we were sick for nearly two weeks with stomach cramps.  \n\nSomewhat trivial but the day was only made worse as the waitress made pricing errors on my bill, of which I had to argue with her that egg rolls came with the lunch special and were not supposed to be an extra charge... \n\nAt this point, other then the first time I went there, the food has been pretty sub-par, and food comes out cold way too often... Service can also go from great to absolutely terrible depending on who is working that day. I wanted to really like this place since it is close to my work, and the food is priced right ($6-7 for a big plate), but unfortunately, bad service, long wait times, and food that frequently goes from tasting good to absolutely terribly has me moving on. Eater's beware, maybe you'll get a good meal, but you may get a terrible one too....", "business_id": "M5E7DW8rqI4v37HhD2pzGQ", "stars": 2, "date": "2011-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "qASPib1Z8ft8e96dtbh66w", "review_id": "WLc3ChTQ6pDSftbUPlWlxg", "text": "Oh Fate.  Why do you have to be so unaccommodating?\n\nFirst of all, finding Fate takes some work.  When we turned off the main road we wondered if we were completely lost since it didn't look like the kind of neighborhood you would find a restaurant, it was very residential.  As we drove by it my husband actually thought it was an abandoned building.  There is a small parking lot off to the left that fits about 5 cars or so. The inside of the restaurant is pretty cool, with exposed brick and local funky artwork.\n\nWe went with a rather large group of 12.  One of the girls made a reservation ahead of time and they nicely set up a long table for the 12 of us.  (Note: long table not conducive to talking when in a large group)  About 8 of us arrived all at the same time but were told that we needed the whole party to be seated.  It's a small place and the 8 of us just standing in the door next to the table was a little awkward to say the least; especially considering there was only one other party dining at the time.  We stood and waited around until finally they told us we could sit down.\n\nThe food price is very reasonable and the selection is Pan-Asian, leaning heavily towards Thai.  We each placed our orders and one of the members of our party asked to have half of her entree boxed up before it even got to the table.  They couldn't do that.  They gave her a take out box and she had to do it herself.  How hard is it for them to just put half of it aside?  The food was pretty good, however, and I enjoyed my Thai coconut curry.\n\nAll in all the whole experience was unremarkable, bordering on frustrating.  The food wasn't nearly good enough to justify the poor service- although our waitress suddenly became very accommodating and friendly when we handed her cash + 4 credit cards and told her we were giving her a $50 tip on a $200 check.  Maybe we should have told her that when we had gotten there!", "business_id": "VsO_rhXi5lgbaGxNwoEZsQ", "stars": 3, "date": "2007-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e7ClbRAmC-rt9OOGvzne5w", "review_id": "SjXroudGeq7SMgWk2Y_xCg", "text": "Parent's been coming here since the mid-80's. Place is a hole in the wall but they have great food! We always eat there and have never had any problems.", "business_id": "QsvRjgQacMMFf8dit7qqDw", "stars": 5, "date": "2015-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xoeDPWM2khcwMPfDoFzmKg", "review_id": "TJeEoFNYse0CqYNo3YOU6w", "text": "Great, quick, tasty Chinese food", "business_id": "ykfTh6HI219NoMsWBxulxw", "stars": 4, "date": "2013-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "qQns9dP75RNOWOVWI_ZKZw", "review_id": "6GqgDoGYitoZnlWtVoV_7Q", "text": "I had the Kung Pao chicken, which was surprisingly tasty. The spice and flavor were just right. There was also a good mix of peanuts, celery, carrots, and red peppers in the dish. Fortunately, the sauce was nice and thin, unlike the thick, heavy sauces that drown much of American Chinese food. The soup dumplings, while hard to find at many other places, were not remarkable and did not contain much soup. The hot tea was also not great. The decor is nice, but the service was not very good. The waiters were not able to answer questions and did not know the menu well. The dumplings, our \"appetizer,\" were served 10 minutes after our main dishes.\n\nWhile I did enjoy the meal, I probably will not go back. There isn't much that distinguishes this place from other Chinese restaurants. There isn't anything that would compel me to visit this place versus trying something new.", "business_id": "2unQHR9uaRxk3dsW6f3MGA", "stars": 3, "date": "2012-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Neal_1EVupQKZKv3NsC2DA", "review_id": "ztv7iKisFOUfM16NLBu6wQ", "text": "This is a restaurant I have been to umpteen times and thought of reviewing just now. Hands down my favorite Chinese restaurant. Though admittedly, i havent experimented too much here, i have found what I love and stick to it. And that special list includes water boiled chicken, green beans with bacon, spinach with garlic, fish in black bean sauce. Order from the chinese menu, dont go with the cliche of kung pao chicken when all of these yummy dishes exist.", "business_id": "yQONzVpX-DEpGSuKMIov6A", "stars": 4, "date": "2012-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rqG0g5PagiFbrAGSVzdAvw", "review_id": "2Kob1KHogZFmyMbBX6DbgQ", "text": "Oops, upon looking back at my reviews, I guess I accidentally rated this place 4 stars the first time rather than 3. Have eaten lunch and dinner here several times. It's good and relatively authentic, but not fine dining level.", "business_id": "yQONzVpX-DEpGSuKMIov6A", "stars": 3, "date": "2015-05-15", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 3}, "user_id": "S3bvMOL50vgS_8-TtlGi4w", "review_id": "XTRfZ9KUlkQSGcZ3k4Az0Q", "text": "Been there a couple of times, but usually just for takeout as there is nothing better than laying in bed, eating Chinese, and watching a movie.  I was never totally impressed but it's the closest Chinese restaurant to my house and so I went back.  \n\nThen one magical day I decided to dine in.  It was a momentous day indeed.  It was the day I discovered the trick to China Chili.  You see you need to go in.  Sit down.  Order way more than you are going to eat.  Munch a bit at the table.  Then get the rest wrapped up.  For some reason if you call in a to go order the food is not nearly as good.  \n\nFavorites you ask?  Well, thanks for asking.  All time favorite is the pillow chicken.  It tastes just like foil chicken but is much larger with out the hassle of all the foil.  Next favorite?  Anything with scallops.  Seriously the cooks in the back must have a PhD in scallopology.  They are consistently cooked to perfection.    Last but not least is the egg foo young.  It's not on the menu but ask and ye shall receive.  \n\nThe only reason this place doesn't get a fifth star from me is the take-out.  Food is delicious and service is ridiculously good.  I wish I didn't have to play the games I do but will continue to do so to ensure great take-out.", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 4, "date": "2010-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "b0a6nLH0c8p5WJy1w7aO6Q", "review_id": "99bK_JJxlrRNJ90OrLADHg", "text": "China Chili is not only a 4, it is a very solid 4. I was on my way back to the West Valley, from the East Valley, and did a search on my beloved Yelp for a highly rated Chinese Food joint that was on the way. China Chili kept appearing. We called in the take out order, and it was finished before I arrived. \n\nWe ordered the House Chicken, Spicy Garlic Eggplant, Kung Pao Chicken, Mongolian Beef, and Fried Shrimp. And... BAM! It was bomb!\n\nThe House Chicken was delicious. Garlic-y, with little bit of spicyness to it, and a very subtle nuttyness to it from the oil in the wok. Great texture, great smell... It was fantastic.\n\nI'm not an Eggplant fan, but my gf is, and she ordered it. She said the Eggplant was a 3.5. Good, but not the best she'd ever had.   \n\nThe Kung Pao... Again, a very good dish. If there was a complaint, it was that it was a tad heavy on the zucchini in the dish, which was just a tad overcooked. It changed the texture in the dish in an obvious way.\n\nMongolian Beef. NOM NOM! Perfect. Great flavor, great texture. Very happy with the dish. \n\nThe Breaded Shrimp was perfect. I can only handle so much fried shrimp. Tried one, and it was spot on. \n\nThis was a perfect way to end a 15 hour day.", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 4, "date": "2013-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "n3Jk5bX72a9_dWGekwqmPA", "review_id": "k23AAP1maVHczKBAE_r70A", "text": "Very good soup for starters, place is packed so I can expect everything else to be good to.", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 4, "date": "2014-05-13", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "QkKG4P1FVeNDi2n41_THBw", "review_id": "Qh862oxDGzTqGzS0t9a9mg", "text": "This place gets packed easily, but I manage to be seated quickly. Drinks & Food are served at a fast pace! The food is amazing & really great quality! At the end, I'm very satisfied. I recommend this place to be one of the best Chinese Food around Phoenix.", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 4, "date": "2015-05-07", "type": "review"}
{"votes": {"funny": 4, "useful": 3, "cool": 3}, "user_id": "ODhV53XhesCBLJVfGsJGNA", "review_id": "FTgAbptYvfQ2cx4Utnm_wQ", "text": "Growing up in Phoenix, I have always eyed Long Wong's while in the family car.  \n\n\"Is it Chinese food?\"\n\nNo.\n\nMy friend Ann R. had taken me there yesterday for lunch.  She had claimed these are the best wings ever and I was a bit skeptical.  I had ordered the Honey-Hot and my friend got Medium.  Upon first bite, it was pure bliss!  The wings were deep-fried perfectly and the sauce had me burning up with a sweet after-taste.  I also like how there's not too much vinegar in the sauce.  Food is brought to your table by a super friendly staff and then once you're done, you get to throw your trash into a giant hippo statue.  What?!\n\nIt's a bit small, definitely more hole-in-the-wall but not dumpy.  It's cluttered with lots of cool stuff to look at both inside and out.  Take your time and wander the premise!  Do try to avoid the bathrooms though.\n\nThis is by far the best place for wings!  If only they'd kick out annoying high school brats and the old creepers that gets too friendly...  XD!", "business_id": "BT2Vls7h6sWrCKa5gGXbKg", "stars": 5, "date": "2010-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "XGbKwEyIojBUB6wCBKQdoQ", "review_id": "71FapP9qsbJ12xVu3RtJ1Q", "text": "New Hong Kong (as we call it) has been a family favorite for years.  Now we go often with our friends for our weekly Sunday night dinners.  It's a great family-run casual place that has authentic Chinese food at great prices.\n\nWhen we go we have an order set that we like: the West Lake soup, Peking pork chops, beef chow fun (dry), claypot with tofu and BBQ pork, and the beef and broccoli which you can do with either American or Chinese broccoli.  They also have great chicken wings.  Other dishes that we like include the walnut shrimp and the salt and pepper pork.", "business_id": "UxMnY3Dxafucv5cXHyfBSA", "stars": 5, "date": "2014-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EMT4p6tSVyqXHZ6AHOZveQ", "review_id": "AQ-t1OL6vsauLodKjMOoLw", "text": "Before I mention the food, service or decor I'd recommend coming for lunch instead of dinner. Lunch specials are around $6.95 & dinner is about $12.50. Granted the dinner portions are likely to be larger. From the outside of the restaurant it doesn't look like much. Inside awaits a friendly and professional staff, with a dimly lit atmosphere. I ordered the general chicken, lightly fried, very tasty. The egg drop soup is average. Ice water and hot herbal tea are a nice touch. The food doesn't seem \"healthy,\" everything seems either fried or sauced, but is a nice treat every now and then. I would return during lunch.", "business_id": "3DMvGD8ZmlMQmhwV66hdSA", "stars": 4, "date": "2015-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "58YQSpx5Ct8W3HxFhNs-Lw", "review_id": "PXmst7uNXQQ7p75TJG3aiw", "text": "Ate here for the first time this past weekend.  Order some take out for my friend and I.  We both had the spicy chicken with veggies.  The food was ready to go when I arrived and tasted delicious!!", "business_id": "m9Wqqma30o-hH2fAX7dnug", "stars": 4, "date": "2012-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "cavJUMP2BExeGXfOHnGpWw", "review_id": "F-hso-_zXVMYRqxvtiDVXQ", "text": "Plenty of parking space\nLUNCH Specials 11-4pm \nBig portions, fast, clean, and friendly service", "business_id": "m9Wqqma30o-hH2fAX7dnug", "stars": 5, "date": "2015-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bkpo2iZBMV5w_UCRAjWE1Q", "review_id": "ZPwVccjq0iWncEVaCcibdg", "text": "The staff at this location was very friendly but I was not impressed by the food. It was too salty and lacking in other flavors. It may have been the dish I had because I have heard good things from others. However, I'm not tempted to try it again.", "business_id": "9Vu9KhK2-kBSM-FXvxXGNg", "stars": 2, "date": "2012-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dkaZeOX3e3E3TT8nfNF2Lg", "review_id": "Ggl4n9wCSuuG0KPltz8U2w", "text": "A fake plant in the corner was so thick with dust it made me question the cleanliness of the kitchen. Every door was dirty even the entrance doors which were glass and easy to clean. Food was not awesome.", "business_id": "BicQSnGZnY_yuGEDkhVfnA", "stars": 2, "date": "2014-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LT3L8-tthzD0IakgXm81pw", "review_id": "jLxo_UgnGfKHSPK7gGa5LA", "text": "This has always been our favorite local Chinese take out - and especially on Chinese New Year, the special menu.  OMG its good.  We always call for takeout, one or two items and we are so close that by the time I get in the car and drive there, its done...less than five minutes.  \n\nThis place gets very busy, and if you get a chance, try out their Peking Duck, Hong Kong style.  Soooo delicious!\n\nAnother favorite is the snow pea leaves (not on the menu!!!  cost extra), and the Seafood Bean Curd Soup.  I love the soup here, so many delicious morsels, you can't go wrong with it ever.", "business_id": "F3SEkW6v2LJ5y6Ldo5pPaw", "stars": 4, "date": "2009-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wJy9bOZgaOA-C8VXDj7HqQ", "review_id": "UM28-DRoyjoONwQfey8vSQ", "text": "The food was quite good at this buffet.  Veggies were cooked to my liking.  And lots of varities of goodies to feast on.", "business_id": "0nyaKW_6QHSJ74OVnDmyhA", "stars": 4, "date": "2011-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "rGlcxZaxkrESv8kfmiqe0w", "review_id": "ichybssJ_YvRC5X2teOhUA", "text": "The Flamingo Palace is my favorite Asian food restaurant.  A great family atmosphere but also a great place for date night.  Great food at a great price, Check it out if your in the area!!", "business_id": "aozcOaCMwOHG8s-lbZ6_gA", "stars": 5, "date": "2013-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a4LJJU26cSE7k12-0sEw0Q", "review_id": "dEmtXMROdJh1CzB3CQl63Q", "text": "Good neighborhood spot for dine-in or take out Chinese. They have a nice variety in the menu and know how to run some good lunch specials. The food is good, definitely above average. The house specialties on the menu is a good place to start.\n\nService is really good for an Asian place. They're mostly friendly and aren't assholes if you take a table 15 minutes before they close. The owner and his wife are particularly nice and seem to value the regulars.", "business_id": "zTfBa__ldlTdbVgSl5h31Q", "stars": 4, "date": "2010-04-01", "type": "review"}
