{"votes": {"funny": 2, "useful": 6, "cool": 0}, "user_id": "4FVd6DBPJuLdptbV8azw2Q", "review_id": "638BO9bmM9kv-kRT-G8YnQ", "text": "I would have to recommend that if you are looking for an attentive, thorough, professional health care provider to keep looking.  This office has been really going down-hilll for the past several years and has hit rock-bottom.  There is always a wait, usually 20-40 minutes past your scheduled appointment time.  They are impossible to reach by phone, and do not return messages or emails.  They charge patients their co-pay even on preventative visits such as biometric screenings and physical exams what are already covered at 100% by most insurance plans.  They also bill the insurance company for a full physical exam, when they aren't actually performing one. Mine lasted less than 5 minutes and the physician didn't even touch me!  The billing staff are as rude as they come, and could care less about anything or anyone.  I know that Blue Cross is currently investigating.  There are SO many physicians in Charlotte, there would be no reason to go here and receive sub-standard rude service.", "business_id": "2yBBmcVEbhrGrk-hAUAfJg", "stars": 1, "date": "2013-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "agemVY5Yup_xs8IUTErSxg", "review_id": "zNrCmggdpJApZ-Jqip4_Ug", "text": "VERY DISAPPOINTED!!!  I took my two boxers here for a free trial in preparation to board them.  I was told to bring them in anytime between 8am - 2pm.  I dropped them off at 8:45am.  They were so busy they barely spoke to me, and quickly whisked my girls off to a \"suite\" where they said they would keep them until they had enough staff there to introduce them to the play area.  \n\nTwo hours later I called and they still had not taken my dogs into the play area.  They kept them locked in a \"suite\" for FOUR HOURS!!  Then they were surprised that my girls were overly excited when they finally introduced them to a dog or two.  What did they expect after keeping two very energetic dogs locked up for four hours?!\n\nIt does not seem like they are familiar with behavior of different breeds.  And if you watch their live video feeds, it does not appear that the people who stay in the play area even like dogs.  All they do is constantly clean up after the dogs.  It seems there are way more dogs in that space than the staff can handle!  I would not leave my dogs there.", "business_id": "EBuOgJoDgaYCXbqugPTj6w", "stars": 1, "date": "2015-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "EdX8N4LBVw-mXVJpHpP8Xg", "review_id": "_Xn748Iba4R3H8eUL3U2TA", "text": "Worst service in a Marriot.  My key did not work, went to the office and she did not even check my name!!!!.... Waited for the shuttle around 40 min at the airport.  Not even friendly people working there...", "business_id": "1xZ7zuLKrcrG65kzlEO66A", "stars": 1, "date": "2014-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "FqG94LO89w_nVMt7izTLhw", "review_id": "TWWzQ_Yr31ax7Jqpo_K0Gg", "text": "This is an excellent, boutique hotel for anyone who has business or pleasure travel in Uptown Charlotte. It's right in the heart of the uptown commercial district, so if your business is there, you can park the car and walk to your destination. \n\nThe accommodations are beautiful and comfortable. The staff is friendly and fairly formal, but not over-the-top. I've heard the hotel restaurant is great, and features ingredients from local farms, but I haven't tried it yet. \n\nThe Dunhill is not cheap but my company has a group rate which I am happy to take full advantage of. And I also prefer an independent, boutique hotel over a nondescript chain.", "business_id": "zwwmnQXk8jhFs4wwU8I4Ow", "stars": 5, "date": "2011-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "bnl3QzOPiCxb7RyvlCGoKg", "review_id": "rE7evzqE0uLuwYbCdjdPvQ", "text": "Okay it's a cool looking building with a nice little history. Other than that why are people peeing their pants for this place?\n\nI admit we only ordered fried pickles (which were good) so perhaps the food is superb. The beer selection was subpar (something I consider vital to have a good bar; either that or really really cheap specials). \n\nI'm glad I went once. Likely not again.", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 3, "date": "2009-05-04", "type": "review"}
{"votes": {"funny": 1, "useful": 6, "cool": 3}, "user_id": "epELYRU4ZftAKpL88m3atw", "review_id": "F_modwfRj-MJbLnfor8Hbw", "text": "I'm going to be the odd person and not give this place a glowing review.\n\nFirst off, the atmosphere is actually cool.  This is a true pub.  Beautiful dark wood is everywhere.  The staff is also very nice, no complaint there.\n\nThe thing is, I don't really have a complaint, I'm just not impressed with the food.  I find it acceptable, but nothing special.  In fact, the menu is, to me, kinda boring.  I think the point of this place is more to go \"have a few\" after work and such.  When looking for great food in uptown, this place wouldn't make my list.  I do love that it's locally owned and operated, however, and harbor no ill feelings.", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 2, "date": "2013-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "1q5_PlvPsTml_4UWOmo3-g", "review_id": "MGFn7Srn4G9My94rB6G2Ng", "text": "Order the grilled chicken pita or the What It Is!!  These are my go-to dishes at Al Mikes.  The grilled chicken pita is just grilled chicken, lettuce, cheese and tomatoes but it tastes amazing.  Get the Cajun fries with it and you will have a tasty meal!  The What It Is is blackened chicken on top of Cajun Alfredo sauce pasta. It's insanely good!  I've tried making it at home with a little success but it doesn't compare to how Al Mike's is! The owner and employees are all super friendly.  I really love that the restaurant is in an old Victorian style home nestled in Fourth Ward.  It's so cozy feeling.  Definitely a favorite stop! :)", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 5, "date": "2015-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "C68Mv3EZe-yx9JDTEdokvw", "review_id": "9yLC48BkY2Ho_BzmFjifvQ", "text": "Always great atmosphere and food, had 3 lbs., lobster and porterhouse.", "business_id": "Lt9o2RmacVY2L-IWLA8uTg", "stars": 4, "date": "2014-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VFOwxpOWH9RZ3iMelkRd7A", "review_id": "QIBjTzAVtJ8jTNI_LWMDcA", "text": "It was OK.  Not the best experience.  I was a little scared after I ate there, while walking out I saw the 82 score for their restaurant, I rarely see under 90.  I worked in the industry for a while and it must be  a gross kitchen if this is true.  I'm hoping that it was just a day inspection randomly showed up during a mass rush.", "business_id": "-6JY1T0w4XETux5kGOj84g", "stars": 3, "date": "2013-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ytxqyAM8f46YVrGLr2BMKg", "review_id": "TfJ6IZEjX81upzOF3c9BOA", "text": "The sandwich bar is underrated in my opinion.  It's basically a make-your-own place where you pick the bread, spread, and tread (I don't know what else rhymes and goes on a sandwich).\n\nThe key is to get there before noon so you can find a table in the shade outside.  Fantastic scenery to watch while you crush the fresh sandwich.  \n\nAnother tip is to ask for the frequent flyer card.  Buy 8 combos (chips + drink) get a sandwich free!", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 4, "date": "2012-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tmMgM3kr3dcr5GXIzqMoxg", "review_id": "hr-aoJlEjgxkBJKKmyy3Ug", "text": "This place is great. Good servers.  Takiyyah is the best. Ask for her.  Great food and a great place to bring a large group.", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 5, "date": "2014-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lTPInaXz8xAPyDBalAJtJQ", "review_id": "VmB10zVO6uG62g7UfJE_8w", "text": "\"Say, Schwan, How's the Chinese Food Around Here?\"\n\nSoho Bistro is exactly what we were looking for - quick and easy predictable Chinese delivery.\n\n\"Quick\" understates the speed of this place.  We called them minutes after placing the order to ask for utensils, and the driver had already left the restaurant (with utensils).\n\nAs for \"easy\", you can't beat online ordering that works as well in practice as in theory.\n\nAnd all the flavors were exactly as they should be - potstickers/dumplings, fried rice, etc.\n\nThe food was a little greasier than I would have preferred, but if you order Chinese delivery, that's to be expected.\n\nConfucius say, \"Four tune cookies for Soho Bistro.\"  A little less oil, and Tao/Tso would be a five star general.", "business_id": "rT-iPtIXMKj3dTcl87lbOw", "stars": 4, "date": "2008-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mwNIFiklTI6DQ69MJT2k3g", "review_id": "CQN1vw-RWUGmuKqgxY8-5A", "text": "Finally a place I can find good Chinese food. I've been looking for a consistently decent Chinese joint in Charlotte and I believe I have found it. I ordered the shrimp and broccoli w/white rice to-go and it was great. Better than other places around the area", "business_id": "rT-iPtIXMKj3dTcl87lbOw", "stars": 4, "date": "2015-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "u6VZAszfuylriytDU66gxw", "review_id": "QlQfiDfeiVato9bbA18Jzw", "text": "Great location and nice clean rooms.  The housekeeping staff was not the best at keeping the noise down in the hallways though.  Other than that my stay was great.  I would stay here again in a heartbeat.  The place is right downtown and you can walk to just about anything you want.", "business_id": "fJ72j9pRjLcRzBA_EhB4-g", "stars": 4, "date": "2013-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DppAa95KXvumyhJKsL9ZWw", "review_id": "WMkAxhQU64b7pWXp2oC5bQ", "text": "Popular lunch spot with a good assortment of dishes. Reliable and not fancy -- and that's good.", "business_id": "U_RvpPJNn24oWJo07x2j7w", "stars": 3, "date": "2009-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nXDpCfLfuMNU8EhcLfiUcw", "review_id": "0F81aAgD3BucqHEuegnj4Q", "text": "Get to the Chase:\n\nPros:\n1) Fantastic ribs! Succulent, juicy, and came right off the bone\n2) Exceptional service (I think I saw our waitress spend half the time on her hands and knees wiping off crumbs and food that other customers left under their table)...I have never seen a restaurant where that happened...not only that she was always genuinely smiling and making sure we had fresh water\n3) Fantastic beer selections (would highly recommend the beer sampler)\n4) First time I actually LOVED coleslaw...perfect balance of slaw, mayo, and tangy sweetness (accented by the freshly cut slivers of apple)\n5) Desserts do equal justice to their delicious entrees\n\nCons:\n1) None", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 5, "date": "2013-05-28", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "8DQFdoW1fFcLvSrdE_mbIA", "review_id": "4rWdYjRrarrO21RMO3cvzQ", "text": "Went for a late night dinner. They catered to my  low sodium needs. My salad was amazing! My captions were all happy with their food!", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 5, "date": "2015-05-31", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "OXzYyZSHo9Dl6Qd0s_o2Ig", "review_id": "ba1NUtZrA3UkgiXbXVUAEQ", "text": "Enterprise has picked up their game recently at this location.  I have rented here for the past few years only because it is so convenient.  They do price matches also!  And it used to take 30 min for you to get the heck in and out.  Now they are doing better, this recent trip I took, I think I was in and out in 15 min.  Very good.  \n\nPrices are usually good - fyi never buy the prepaid gas unless you are planning on returning it at empty - otherwise they bankroll that extra gas you prepaid.\n\nThere is no Sunday hours and no overnight dropoff so make sure you plan your trip around that.  Safe travels!!", "business_id": "VYsGg7O1kT_IRWwBn_Hg6w", "stars": 3, "date": "2012-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a9n8Jmaotz7NRZqsCH-2eA", "review_id": "2H1mEf5A3pWGCJn5MK4Luw", "text": "Okay, from a distance this looks like a nice hotel. But Its definitely not worth the money. The pool is made from the same material as a shower in a mobile home. Its long(ish) and not wide, with its deepest point at 4 ft. The other half of the pool is 3 feet, so you can't swim laps unless you want to hit the bottom. The fitness center lacks a fan, so working out gets too hot. The room itself has a nice view but seriously all it is is a bed and a shower. There's nothing all that nice about this $300/night room. There is nothing included: no breakfast, no drinks, a water bottle in the room costs $4, internet for ONE device is $12/day. With that price, Id expect much much more. I feel like I should only be spending maybe $100. The only reason why they get away with this price is because its conveniently located next to the convention center. Otherwise, I will never stay at this place. They nickel and dime you everywhere you turn!", "business_id": "4nFqPL-glgDm9v7bZptskQ", "stars": 1, "date": "2013-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pQA9_icWNK-hxoa3n4Yo3Q", "review_id": "Z7E9uHlQRiPJv8YYixvStA", "text": "It is 1:41 AM on a Wednesday night as I lay awake listening to extremely loud DJ music from the bar across the street. It literally sounds like there is a major concert going on. I am traveling on business and will not be able to function well tomorrow because of this. I called to complain twice. The staff called the cops who are apparently there but not doing anything. I was told music would end at 1; I counted the minutes but nope..,,still going. The amenities are fine and staff is friendly but unless you come to Charlotte to party DO NOT STAY HERE!", "business_id": "Fi5sQxROyTLp5qDuYKz6bQ", "stars": 1, "date": "2015-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x-QlsxcV87-ZWpUXKIfbww", "review_id": "w9C9DMfx2ppPWmzJHaxfMw", "text": "This is my first TWC experience as I relocated from out of state.  It is by far the WORST service provider experience I've ever experienced in my life.  I had to call 3 separate times @ 30 mins each to start an account.  The first 2 times they were cancelled automatically after I called because the \"current tenant\" in the apartment hadn't put in a turn off request yet.  No one called or emailed me, I called back to confirm and they said, \"oh you should have been called...... TWICE\"  they had to run my credit TWICE since the two calls were over 30 days apart.  The folks on the phone are incredibly rude.\n\nThe # on the self install kit (listed in 30+ places in the manual) was disconnected when you call it.\n\nI called for billing (My first bill was $36 incorrect), I got tech support, they transferred me to billing (which I selected on the auto menu), I got through to Billing, They informed me they were \"in massachussets\" they'd have to transfer me to Charlotte, which was the # I called on my bill to begin with!\n\nABSOLUTE 100% AVOID AT ALL COSTS.  This is my only YELP review ever.  It has been so infuriating I had to take the time to warn anyone.\n\n(DIRECTV before & after TWC is a god send).", "business_id": "vKtMsWeAaThimXGo9Ic_Og", "stars": 1, "date": "2013-04-06", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "6j4iopXcGj0atZNCNcHD9A", "review_id": "BzfNTmzGDhVGOBcJorKQag", "text": "I was in town for a wedding this past weekend. I forgot to pack my heavy duty equipment to style my hair, and when I say heavy duty equipment I really mean it. My hair is long, thick, and curly. So I found Modern Salon just a few blocks away from my hotel. When I first got there the lady that took care of me was very polite even after she realized that blow-drying my hair would take a lifetime. She scurried of to speak to her supervisor or maybe a more experienced stylist for suggestions on what products or brushes to use. Nikki came along and was extremely knowledgeable with my textured type of hair; she had an amazing attitude not only to satisfy the customer but also towards the not so experienced stylist, they are lucky to have her as a mentor. I don't usually write reviews but after the experience I had at that salon I think it's worth writing a review to mention the professionalism and the positive attitude of the salon. I did mention to Nikki this is probably the first time I've ever had anyone \"understand\" my hair. She didn't take forever to blow dry my hair because she knew what she was doing. I wish I could have taken her back home to DC, but she suggested a really good stylist in this area. :)", "business_id": "I9S-4czHzMVfKejCiAuXag", "stars": 5, "date": "2011-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "4P1AfdABykulRK6C-ww4sw", "review_id": "BD08uhlF4rv5h8ARA0i45Q", "text": "I've been to a few plays here, but most recently I have attended my friends' improv shows.  The theatre is very nice for a small venue.  The lobby is open and inviting with comfortable seats that make it easy to relax and converse before a show.  They have a small concession stand that sells soda, coffee, beer, wine, and snacks at reasonable prices.  The men's room is modern and usually clean which is nice.  Although it's just on the outskirts of uptown, parking is always free.  It's also a short walk from the Stonewall Lynx station.  My only complaint about the venue is that the seats are cramped pretty close together.", "business_id": "FK6qrsEbxZ0uTdho9rIWFQ", "stars": 4, "date": "2014-03-30", "type": "review"}
{"votes": {"funny": 4, "useful": 3, "cool": 3}, "user_id": "OnuQUIkNWOD-KiCnCZ8PyQ", "review_id": "00R1zQf2uLV74TYfXEa-vA", "text": "Last year I remembered that this place had a line out the door. We waited last year and we waited this year too. Why? Because Mert's is worth it! \n\nWe were lined up outside for about 20 minutes this time, but found entertainment in a street hustle, where some character asks to see if you have a 100 dollar bill and if so he invites you to bet it by guessing which of 3 bottle caps has a red pill underneath. I was so glad to get in when we did, really not trying to get caught up in a street brawl just in case both that red pill and main man's 100 dollar bill disappeared all at once. \n\nSo we're seated. I ordered a sweet tea, collard greens, mac n cheese, fried catfish, and BBQ beef riblets. Sounds like alot, but the portions are equivalent to a plate of food at a cook out. Nonetheless I was stuffed! The collard greens are excellent, you can taste a little vinegar and they top them with tomato and onion if you don't protest. I enjoyed everything, mac n cheese thick n cheesy, ribs-tender sauce -sweet, the catfish was good n crisp, however I like a slightly spicier batter. But other than that, two thumbs up!! \n\nThe surroundings are pleasant, you see lots of young people laughing and having fun, and proud accomplished HBCU alumni telling their stories around the table! An American dream, the culture here is so rich. This place is worthy of a visit from one of those Food Network Road Scholars for sure! Totally SATISFYING; where else can 5 grown ups eat for $80? If yall don't know you better ask somebody :0) Mert's is all that!", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 4, "date": "2011-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mwxSn5EV9QRS8As_8oOe9Q", "review_id": "SxZ0ID5kY47yKUhkZsL92A", "text": "I love chicken and don't love ribs but I can say they have the best chicken and there ribs made me love ribs and the best thing were there collard greens they had a explosion of flavor I from Maryland and if i come back to Charlotte I'll  eat here everyday.", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 5, "date": "2012-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ovzXqT-2ZBaKX282t8WrIg", "review_id": "NdShvMCUv3oteN3Wop7Eig", "text": "I'm definitely a fan. The service was awesome, prices were right and the food was filling. We went for brunch and walked into a mostly empty restaurant. The sweet potato pancake had a unique texture, a bit on the sweet side (no syrup necessary), but delish. The biscuits were buttery and flaky. Awesome. The Shrimp Creole omelette was tasty and really filling. It was filled with shrimp and topped with a spicy tomato based sauce. Skip the OJ - it's the gross concentrate kind. A great down-home Southern restaurant tucked away in Uptown.", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 4, "date": "2013-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PRUvyYvLPg3vdgAmd6nBVw", "review_id": "2sa0cS43RWO0YTIMY62sxw", "text": "Food is good.  I recommend they stop using curry in the chop beef.", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 3, "date": "2014-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XBGgFC-nfuvMEApMtb-1MA", "review_id": "ge6ipdUVNOBmCq1SFZPbsg", "text": "This place is so satisfying! If you haven't already heard, but their cornbread is seriously the best I've ever had! It's so moist and light and the honey butter that comes with it... Oh my goodness. My mouth waters every time I think about their famous cornbread! Their salmon cakes is so yummy too, I always start with them as an appetizer when I come in! Service is great and helpful, very friendly. Refills are a must for me, and they always keep my drinks full! Can't wait to come back to Mert's soon!", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 5, "date": "2015-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3v11kykzR2hKuketOLaLSQ", "review_id": "y-SlWIOui0Bu53rvpHAKzg", "text": "The anticipation for this visit was high. I had heard nothing but great things about Mert's. I must say the Food was fantastic. The cornbread was like something your grandmother made and a very large portion with a side of sweet butter. I got the fried chicken with greens and beans. The chicken was crispy and to die for. The greens were just succulent. Now, the food was great but the dining experience was ruined due to terrible service. The minute we walked in and were greeted by a server with an attitude I knew this might be dreadful. Our drink orders were about 10 minutes getting to the table and we were never offered a refill. Our server just stood at the end of the table waiting to take out order but didn't speak. After we gave her our order she couldn't remember it and Asked for it again. She never made eye contact with us and was rushed even though they were not busy.   The customer service can make or break a dining experience and I can tell you we would have just left it the food wasn't so great. However, we will not be back. I hope you are able to recognize the need for a attitude change for your servers.", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 1, "date": "2015-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I5lhUIgIkJDmzhNkaew3iA", "review_id": "9TVNP20j2xUjdSyoGPdV1g", "text": "Excellent service!! Brooke and Hannah are awesome servers!! Food was excellent, chocolate Sauce was scrumptious !! The creme brûlée is amazing!!", "business_id": "NTfUFk8GyOLL1uPbEO-pVg", "stars": 5, "date": "2011-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bIOg3bUfk_2NfjhdPV6YZg", "review_id": "GgDa_3NHTVwD9az00tYWsw", "text": "Man, I rarely give out 5 stars...check my history you'll see...well, I'm giving Mimosa 5 stars.  I don't wanna say it's begrudgingly, but it kinda is.  I'm one of those where 'nothing is perfect and there's always room for improvement'  thank goodness I'm not a teacher.  Anywho, I'm going to go for 5 stars instead of 4 simply b/c this was the best meal hands down that I've had in Uptown since I moved here.  \n\nBetter than Chima, 5 Church, Aria, that awful BBQ place I can't remember the name of..the list goes on.\n\nLobster mac and cheese.  Good HUGE hunks of lobster, I only ate a bite or two at the restaurant b/c it was very very creamy, and I have issues with dairy.  I know, why'd I order it...did I mention the huge hunks of lobster?  Seriously there was a whole claw that was still in tact.  I went to town on it when I got home and could verify it wasn't going to upset my stomach.\n\nThe asparagus - yum, it had a very smokey flavor.  It wasn't your standard grilled asparagus.\n\nFinally I had the hush puppies.  This...now let's take a minute here.....it's actually a hollowed out hush puppy with a shrimp filling that is all kinds of yummy.  Oh, it was just the bee's knee's.  I'm totally doing this place a disservice with the description above b/c the hush puppies were on point.  And very unique.  \n\nOh and for dessert, a mini pecan pie with chocolate chips.  Yummm.\n\n\nOur server was also excellent.  It was just myself and a friend and we are quite chatty and so was our server.  So I liked that too.\n\nTo recap - I'm giving them 5 stars...so Mimosa Grill please don't let me down next time I visit you.", "business_id": "NTfUFk8GyOLL1uPbEO-pVg", "stars": 5, "date": "2014-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8YaAlftnwEfsvay_cQlcNg", "review_id": "4QZM29GrPg1C8nwl9UA8Wg", "text": "Wouldn't recommend this place for Sunday brunch. Buffet only with a limited tapas menu. We waited at our table for 20 mins to be approached by our actual server. \nWe had 1 person greet us to tell us she wouldn't be our server but got our drinks. \n1 person simply sat our mimosas on the table and didn't speak. \nThe 3rd person who was not our server finally explained the menu options. \nOur server finally showed up at that point we had already looked at the buffet and would have preferred an a la carte option. He then recommended a place down the street that stopped serving brunch at 12noon...  It was 12 at that point. And for the finale a different person actually brought us the bill for the mimosas we ordered.... \nOverall poor service. Not coming back.", "business_id": "NTfUFk8GyOLL1uPbEO-pVg", "stars": 1, "date": "2015-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "do-fO-EruYVP_FQPMNWmZg", "review_id": "ei0ToXBIGqG4Fk3NTF_IdQ", "text": "After craving a Greek Salad all morning, I was trying to find somewhere I could grab a quick lunch,in uptown, and get back to the office.  However, my mind drew a blank, and feel like Greek Salads are hard to come by in uptown.  With that said, I thought I'd give Shomars a try, being that it was close, and I have the chicken pita before and liked. So, I ordered the Greek Salad with chicken and a side pf pita bread.  The chicken was cooked to perfection and the salad was good, very large too.  However, I found the dressing to be a little oily than what I prefer, but will definitely go back for the chicken pita again, love the tzatiki sauce!", "business_id": "SjsguOTm7kQ_B3QcfHH-3A", "stars": 3, "date": "2013-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "P7Hr0n3c1H8P8YR5tG8HEg", "review_id": "1LKheHQcnV3QhyiIUPU1_g", "text": "Homemade pasta, homemade pasta, HOMEMADE PASTA! So rare to find at a restaurant yet so essential to having authentic Italian food. We split a bottle of montepulciano and I had the tagliolini and the flash fried calamari. It was divine perfection. Shrimp, artichoke, garlic, olive oil, white wine sauce... rich but not overwhelming. I will definitely be back.", "business_id": "z24h6ZYnZiWjlDTuLXG9jw", "stars": 5, "date": "2014-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XoAyhKIQsCDwwDFzC900Fg", "review_id": "BRIIWrA3xcxtHW-yVPi-jQ", "text": "Warm cookie at check-in!  They even gave me an extra one when I returned one night from dinner and needed dessert (though I was told this is not the norm, since it's supposed to be one cookie per check-in).\n\nI like the attempt to make the hotel room a bit more modern- dark wood finishes, accent walls, lime green and turquoise colors on the curtains, carpet and chaise chair.  Overall the room was modern, clean and convenient, with a large granite vanity and large shower.  I had a nice view of the central courtyard.  Free wifi as a Hilton Homors member, in the rooms and common areas.  The doors tend to slam loudly so you do hear others entering and exiting their rooms.\n\nCovered parking is not free, but it's just down the street from restaurants and bars.  I like the convenience of the Starbucks located just across the street.\n\nStay here if you like: \nModern hotels, chocolate chip cookies, free wifi (for Hilton Honors members), convenience to Starbucks (across the street).\n\nDo not stay here if you like:\nHistorical buildings/districts, free parking, free breakfast.", "business_id": "IYNZXcNVXiCVavCrplXPlQ", "stars": 4, "date": "2013-05-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aY-FUjBTKeb-uMlSjBGiKQ", "review_id": "wuqHuEk_5VEztKu9PozM0Q", "text": "Saturday night dinner at 8:30 pm. The place was busy but no wait for seating. After being seated it took about 10 minutes for a waitress to stop by our table just to tell us she would be with us soon. When we finally placed our orders the pizza came out of the kitchen very quickly. (Not brought by the waitress - but a kitchen staff member) The pizza was very tasty, my husband tried the Thai Chicken and I had the pear and Gorgonzola. We both enjoyed our pizza however it took a long time for drink refills etc. So overall if you like unique pizzas, are patient and not in a hurry you might enjoy Brixx.", "business_id": "kAid56AY_laxGYslMdsYJw", "stars": 3, "date": "2014-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BMxL39YJd-sr632IZieWGQ", "review_id": "AsLJFWN8RnoR2OUH9g9svw", "text": "Do Not miss out on the rib eye sandwich!! Incredible taste and tenderness! Beautiful restaurant and service outstanding.. I had a salad with shrimp, sounds like I should have had the wedge. Anyway, nice place, tough parking. But just a tourist so not too concerned about that. I did hear from our server however they may be opening one in Costa Mesa CA?? Hope so. Enjoy  Stars for the Sandwich and service. Not crazy about the salad a little pricey for so so salad.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 4, "date": "2010-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0s145HKM045-olN30h3P2w", "review_id": "FvSWEk-nT4RgWk0CEqVWmA", "text": "Came here before an opera of which the waiter was aware. We were courteously rushed but this was okay because we needed to leave at a certain time. Service was quick except when I received the check. It took a little bit for the waiter to pick up the payment and process it. The coffee was served with some spilled on the cup plate.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 4, "date": "2014-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hEFiiqzLHkqNSePBD2jnqA", "review_id": "zDqV0PtresHy27PgOtY1GQ", "text": "Had an opportunity to be wined and dined (or beer and dined) by the Bobcats last night. I've been to a number of NBA arena's and while the team isn't doing so great, the arena really is top shelf.\n\nGreat sight lines (especially when you are courtside!), excellent customer service all around, and incredibly handy from a location perspective. You can readily get tix right now and the Bobcats office staff offers a plethora of promotions and discounts to get the community involved. \n\nOverall I give this an overwhelming thumbs-up! If you haven't been to a Bobcats game, you owe it to yourself to check it out soon!", "business_id": "nRdpk6Azj6CYkqPrH0Nr7A", "stars": 4, "date": "2011-03-08", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "iBmy7fYcirpA8d94EhX5RA", "review_id": "-ORarwx3sYAqyyIB4QIAxQ", "text": "So I think this place might be better as a bar than a restaurant, and in that case I guess it was just a bit too bad that we went to the place for dinner.\nNot that the food was bad, mind you.  It was just meh.  Hence the meh review.  Anyway the problem was the same across the board - dryness.\nWe started with chicken nachos.  Chicken was a bit dry.  Not enough gooey cheesy saucy mess.  I guess likeable for those who really just want chips.  We asked for extra salsa (and were charged I believe 50 cents extra for each tiny tub, woof!) to make it more pleasing.  Most of us got sandwiches, which sounded really good on the menu.  And in fact my philly style chicken sandwich was tasty enough... as long as I bit into a part that had cheese on it.  It was grilled chicken, peppers, carmelized onions and provolone on a bun.  But again, it was just a bit on the dry side, and there wasn't enough cheese on it to mask that.  One of my tablemates asked if she could get a dipped sandwich - the waitress seemed confused, so I guess they don't do that so much down here, but for anyone else who is confused that's dipping the whole sandwich into whatever juicy drippings came off of the meat on the sandwich.  Now that would have been an improvement.  Dipping is a bit much for some folks, but it would help the drought issue with this place.\nBar prices were reasonable I thnk, so maybe come here to wet your whistle but think twice before ordering any food that should be served juicy.", "business_id": "t5l-H2KdY4MQgLDMENz9WQ", "stars": 2, "date": "2011-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4Z85ExH813Swr5iJSZAvuw", "review_id": "9_9e6iOXnTIdEclbz0P7Ag", "text": "Nice place to relax and enjoy a smoke, drink, and nice company. Plenty of comfy leather seating.  Great ventilation. They had a nice pool table to shoot a few racks. Great service from Mallorie. Very personable/attentive.  Nice ambiance. Friendly people. Great place. Cigars a little more expensive than the norm, but worth it due the ambiance. You could always bring your own and pay 5.00. Either way, definitely recommend.", "business_id": "7BVCmaxhvXgEpx7J-SQ4QA", "stars": 5, "date": "2015-03-25", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "ts7EG6Zv2zdMDg29nyqGfA", "review_id": "RzVdf1SQJ8Dd88RS5RPsXQ", "text": "My favorite Irish bar in Charlotte and probably the friendliest bartenders I've ever met.  I'm no beer connoisseur but apparently they have the best Guinness in Charlotte because of the short length of the line from the keg to the tap.  I've tried it and I can at least concur it is good!\n\nThe only take away for me was the lack of lighting in the place, last time I was in there it was very dark and only lit by candlelight.  No biggie, but when I'm having a beer after work with a buddy, I don't really need the romantic feel of candles....hahaha.\n\nIn short, if you want to grab a beer and be greeted by some of the friendliest bartenders in Charlotte stop in here sometime.  \n\nBTW, it does get pretty packed during the weekends and can get crowded.", "business_id": "jmzPbvE_02SzTAjwZCTgYA", "stars": 4, "date": "2011-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lpyyEAwuU9zo7v3num81uA", "review_id": "Zq21zmJOuZrL4qafDLK02g", "text": "I really enjoyed the food at this place however the service could use a little work. The oysters and mussels were excellent and the filet melts in your mouth. Having to wait a really long time for our server to bring a bottle of wine and take our order knocked this place down to 4 out of 5 stars.", "business_id": "TLrX4FECQDFz-E45TI_9ow", "stars": 4, "date": "2011-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "afTF61m7-hcOWAZ-FXc86Q", "review_id": "3GUaUP_ti0jeDpe0fm0qEw", "text": "Cosmos is a comfortable trendy stop spot.  Most of the crowd is bar crew that is stopping in quickly and heading somewhere else but that if fine.. That is what this place caters to.  \n\nFood:  \nCrostini:  4/5  It is like a little beef bruschetta delight.. Excellent choice.\nCrab/Spinach Dip:  4/5  Delicious chunky crab dip that is delicious.  \n\nDrinks:\nChocolate Raspberry Truffle:  5/5  The most \"healthy\" drink on the menu.  This drink is more beautiful than delicious (if that is possible).\nDirty Martini:  3/5  Just like it sounds.. Heavy olive juice plus olive juice. \n--Wed are 1/2 off all martinis and buy one get one app.  \n\nAtmosphere:  Jumpin with after work and pregame people.  Always a lively crowd that is fun to be with..  Enjoy!\n\n-Ian M.", "business_id": "e5J3s-xxs1S6PPHJhldBEA", "stars": 4, "date": "2011-03-24", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "YJqdyThjc7zzBztodFYp3Q", "review_id": "LhAA_ZWywxeerPR7b1NMzg", "text": "I was skeptical about going to Discovery Place because a lot of the reviews made it seem it was better for younger kids. As long as you're a kid at heart this was great for any age!  We had a 15 year old with us and we all had a blast. \n\nThe admission was reasonable since adult tickets were only $12 for the museum. There's also an option to buy tickets for IMAX movies. \n\nA great way to spend a day downtown.", "business_id": "ZBQWSsUXwixFmm3lpegMiA", "stars": 4, "date": "2013-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "HRFD2ca4_TPSGSqekJaomg", "review_id": "YLxu5FVM7MnLbNpyrA5_lA", "text": "I had a ball here over the weekend! It was CIAA weekend so it was packed! They had a live gogo band playing (i believe it was backyard) and they played all my favorite songs! all of DC was in the building, I felt right at home. My only complaint is I felt like an old head cuz of all the babies in there and the drink prices were stupid but they weren't stingy with the liquor. the club has a nice layout though, upstairs being more chill than downstairs because that's where the dance floor is. Speaking of the dance floor there was no space, lol. Overall I had a good time and I'll probably go back.", "business_id": "Zw-sWBbL3Z9zyZ0ri9UT_g", "stars": 4, "date": "2011-03-07", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "E0JH94q1KNYn0JKMZTGjaQ", "review_id": "WkS5j5Xvt6SSqQuV_G8H9A", "text": "Wow...if you are familiar with the Omni in San Diego, or Dallas DO NOT come here expecting the same!! I would like to say this is a Holiday inn dressed up in a high rise but that would be doing a disservice to the Holiday Inn! The hotel feels old, rooms are tiny, and mustier than your grandma's basement. Beds feel like springy cement and AC rattles like a cage all through the night. I expected more from a name like Omni and pay per day Wifi! Are you serious it's??!! It's 2012!! Next time I will run not walk to the aloft down the street I only wish I knew there was one here sooner Omni Charlotte you get 1 star and 5 \"BOOOOOOOOOs\"", "business_id": "QThlnQ7AvzZwXHKD5DjdCw", "stars": 1, "date": "2012-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "miCTbKHNHK6cbiEeurd3JA", "review_id": "3LRupVizbbhnk28aBy1LDg", "text": "Some of the worst customer service I've ever experienced.  I returned a demo racquet, and \"Don\" basically started yelling at me because it was 2 days late apparently. It was never communicated to me how long I could demo the racquet, and they had all of my contact information if it was that important.  I even tried to apologize, but Don just interrupted me over and over.  It was actually pretty hilarious, but I would never step foot in this store again.", "business_id": "3hSmumIW-aqMjfmFMW4bew", "stars": 1, "date": "2015-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wugbd1ohqCu_C1Fs44DEOw", "review_id": "mFXMItU2V4tfke-dui22fw", "text": "I have nothing bad to say about this place.  I was only there for one event, but the staff was great and the appetizers that were catered were excellent.", "business_id": "G5dIek0rXPTHlqlJpCNmpw", "stars": 3, "date": "2013-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "8wpkNeflWpVHOE7-Jo34nA", "review_id": "22ZSf-8XnKD8vJRVMwpgog", "text": "I love this little bookstore.  One of the few remaining independents in Charlotte.  Although the selection is limited (compared with Borders, etc.), the friendly and helpful staff will order and hold any book, and can usually get books in one or two days.  Moreover, it's a well-picked selection that seems to always have what I am looking for.  I have found that emailing this bookstore and having them hold books works more quickly and is generally easier than using Amazon.  Nice browsing selection if you don't know what you want, and the staff can be very helpful with recommendations if you tell them what else you like.  The location, in Park Road Shopping Center, near the corner of Park and Woodlawn, is convenient to virtually everywhere in the city.", "business_id": "Ku9PGxJPWFPotM1wOTVCNA", "stars": 5, "date": "2010-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pluf_aTM0XNqB0a3tm9k5Q", "review_id": "auulVOzFji5eNCSsBgcq6A", "text": "Holy Moly Freeholy (if I spelled that correctly) The food here is great!! My Fiance suggested we grab dinner here....To-Go order. I placed our order around 8:50PM, to my surprise everything was ready within 5mins. Our food was piping HOT! I am very impressed with their website, prices are listed...easy to navigate. We both had the Pulled Pork Plated dinner, which rocked my socks! the Mac and Cheese is Meh....not the best. However their Cole slaw and corn muffins are perfection.", "business_id": "wpFOZbONc7qUYz6YmBfKuQ", "stars": 4, "date": "2015-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "5KZmI27uVZxliUthxg5GoA", "review_id": "buyt-i51CQ-rLxYWAjF9Tg", "text": "Season passes are the way to go if you are a local- two visits and you've make the season ticket price worth it!\n\nHere's are some of my roller coaster experiences:\n\n1) Windseeker- This one's new and frankly, is a little bit boring.  You get lifted in the air and it spins you around in circles till you're green.  Perfect for individuals who do not like thrill rides but wants a good view.\n2) Intimidator- This is my favorite ride.  The line moves fairly fast on a semi-busy day and the ride is pure engineering genius!\n3) Nighthawk- I would probably like this ride more if the lines moved a little faster.  Since you'll be on your back for the entire ride, the loading process seems to take awhile.  We waited in line for an hour.  Definitely fun, but not quite worth the wait time.\n4) Vortex- ouch!  Make sure your seat is at a comfortable level before you execute.  Having the seat a tad too high would leave you with some permanent damage!\n\nBe sure to pack your own water and sunscreen.  They charge you an arm and leg for food (and just about everything else including parking).  Have fun!", "business_id": "n9iK0s1dKxv5JLi3u1eTkQ", "stars": 3, "date": "2012-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lGaEAGeWtdtGt4PouWYZtA", "review_id": "e9eDAT8QetJRoOmq0aNSfA", "text": "Haven't been here since 1999. Some things have changed for the better, some not so much.  The front of the park looks great.  Hopefully, the rest of the park can get the special updates; it's showing its age toward the back.\n\n Fury 325 was an great experience once we got past the 3+ hour wait. I imagine it's just going to be worse the rest of the season.   For a smallish amusement park, there are enough thrills and chills to satisfy.  Be prepared to spend plenty for food - as typical, no deals there.  Decent variety and even a couple places with alcohol.  I think the next time I go, it will be on a weekday, nonpeak.  See you after Labor Day!", "business_id": "n9iK0s1dKxv5JLi3u1eTkQ", "stars": 4, "date": "2015-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nWIB-R6PRJO4npwGH0_EhA", "review_id": "grcmaEZ2uFXpwCmiAzSv6g", "text": "It was just a great idea my wife had to go with the kids to the fair they had going on there; a great idea it was. Anything that puts a smile on my girls face is good for me. No one was there directing traffic for parking so it was pretty much grab what you can; parking closer to the ticket booth would be smart because it's a long walk from the back. 4 and under was free and adults were $8 and children $5. Didn't realize you had to pay extra to get on the rides nice trick, rides were decent enough. Trust me when I say you will save a whole lot more money buying the wristband or hand stamp for the rides. A petting zoo for some city kids is always good; food was not my choice and surely ain't want to take a chance with my life. They should really invest in some soda fountains, none of the vendors had soda fountains they served bottled soda in cups for $4-$6? You can just get the souvenir cup for $6 and refill for $3? I took a cool helicopter ride and monster truck ride. Kids liked the escape artist show by lady Houdini.....you get the idea. Pretty cool carnival games and rides! Also a cool drown the clown who harassed and antagonized people to pay $10 to dunk him in a tank of water. Also a mechanical bull ride for $10!! The challenge was males ride for more then 8 seconds wins $100; females 7 seconds! My wife did 5.2 seconds!! DAMN!", "business_id": "bLh6WbEakHBiLHUsUAkJnw", "stars": 3, "date": "2014-05-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "DcCVcuOeNlC3b6p-5uKdWg", "review_id": "pm4ZZHRrJFnDEQ4pWuBGwQ", "text": "This place doesn't get 5 stars because the parking situation is terrible.  I never come here between 5-730 because it is so packed.  Sometimes I have to go into other businesses parking lots or park on a side street. \n\nThe facility itself is great.  There are 4 floors. The bottom tends to be for the men.  The first floor has a women's center and a yoga studio.  The upper floors are filled with all sorts of gym equipment.  \n\nThe classes they offer here are fun and a good workout.  I like going to cycling, kickboxing and Pilates myself.  Yoga studio can get packed so hope you can fit.  \n\nOverall I am glad I am a member here.", "business_id": "b3u-GK6_xj2fJkinzLk_jQ", "stars": 4, "date": "2015-04-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "ESu6WCQYwQSq0kgB7WHSzQ", "review_id": "G9Yoo0GrDJOn-QfCv2S0pw", "text": "I'm not terribly impressed with Blue. Here's why:\n\nService is generally good, so you can count on getting what you need when you want it. It might not always be delivered with a smile, but it will get done promptly.\n\nAmbiance is pretty good. Manages to achieve a flashy, modern-ish look while still remaining understated.\n\nIt's in the food and drink where this place falls short. Neither of these is really anything special; Blue strikes me as \"just another pricey eclectic American restaurant.\" And that's a problem, especially here in Charlotte. Having places like Blue slinging par-for-the-course means that the restaurant scene here in town can't be innovative. I don't mean to be so hard on Blue... but it is a cornerstone of Uptown restaurants, so I think it should shoulder a larger share of the responsibility.\n\nLooking through the menu, it's the same-old, same-old: calamari with olives and sundried tomatoes, scallops wrapped in prosciutto, steaks and seafood, blah blah blah. For dessert, molten chocolate cake. Well, no shit, Charlie. Hey, Blue, the 90's called; they want their fucking dessert back. Also, last I checked you could get the same dessert at any number of sub-par chain restaurants. Sure, Blue does it better, but it's simply not inspiring.\n\nI do applaud Blue for having a seasonal menu, on which there is a Venison Loin and American Red Snapper. They also list gluten free options, which shows that someone is paying attention to both current trends and dietary needs. Nevertheless, the menu as a whole is tired and generally boring. \n\nDrinks were okay, with the wine list being the highlight. The by-the-glass selection was both high quality and comprehensive. Mixed drinks looked promising, but unfortunately did not live up to the quality that the descriptions seemed to indicate. I ordered a Fig Sidecar, which was very poorly mixed, while a friend was not impressed with the New Fashioned.\n\nSometimes, it's cool to have a place that serves classic drinks and entrees, but I don't think Blue fits that bill. I strongly believe that it can greatly improve the Uptown restaurant scene if it pushes the envelope in its food and drink selection.", "business_id": "eaqJQP6bp7rQJQt5KqfvxQ", "stars": 3, "date": "2014-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "I9-qaI_sfTJzeG52WZMdkQ", "review_id": "Hn_OyOEmNZQDdyXl-mvsmA", "text": "Overall, I find Fujo to be fairly average, but it's convenient and if you know what to order you can get a good meal.  \n\nYou can ask for all white meat in your chicken dish, so if you have a problem with weird, inedible black pieces of meat in your GENERAL's or SESAME CHICKEN, specify all white meat and that problem goes away. \n\n I've ordered GENERAL's and SESAME TOFU many times in varying ways, but finally realized that this dish is not going to work for me here.  They cut the tofu into very large triangles and fry (without any breading).  So you get a tough, extremely hard edged piece of tofu to try to chew.  Inevitably you will not be able to chew it properly, sobeware of throat lacerations if you try to swallow it.  I've tried to order it in smaller pieces (didn't work), and less fried (also a fail).  \n\nI recently discovered their EGGPLANT with GARLIC SAUCE.  It's actually very good, as long as the eggplant pieces are cut small enough.  The sauce is very flavorful, and they'll even make it with less oil upon request.  \n\nI know several people who love the noodle dishes, and it does seem to be a lot of food for a decent price.  The service here is quick and efficient.  You can get in and out at lunch time in 30 minutes or less.  If you get your order to go, check the bag to see if you have enough soy or other sauces.  I find that 2 packets of soy aren't enough for me, so I always have to ask for extra.", "business_id": "hBscDTusN57Ai0SnkQK8Sg", "stars": 3, "date": "2014-04-17", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "DK2gGNdN3ihOu_uwt2AgLg", "review_id": "lLAIGDw4fzpqb4XWiQ_TsA", "text": "This place is GREAT!  I had a suit and a dress that I needed dry cleaned, as well as fixing the buttons.  I was in the market for a place to dry clean, as I had not yet used this service in Charlotte.  This place is close to home and had good reviews, so I decided to try them.\n\nI spoke for quite a while to the gentleman working.  He told me that they do all their cleaning in-house (with the exception of some extraordinary stains), let me know when I could pick them up, and gave me approximate prices.  They have a bar code system in place to keep track of all the items you bring in.  If you drop your clothes off on a Wednesday, you get 25% off.  I thought their prices were reasonable; I had a three piece suit, dress, and the repairs for around $29.  They also have a lady in on Tuesdays and Thursdays who does alterations, and those prices seemed quite reasonable as well.\n\nYes, I may have been able to find somewhere a little cheaper to get my clothes dry cleaned.  Still, I greatly appreciated the service and explanations that I got from the employees working there.  When I drop my clothes off, I want to know that the people I leave them with are going to take care of what I brought.  I will be bringing my stuff here from now on.", "business_id": "2QzMdxNZdwKo109BMtzvdw", "stars": 5, "date": "2013-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F6Uz9D0Wvcqe0uX_6Ar1SQ", "review_id": "DHAK_xOfTOsuI7Hw7xeGPQ", "text": "$12 to get my scrub pants hemmed, no student discount and took a week finish the job?! I only decided to come here because of the positive reviews and located a block away from home but no, thanks. \nI recommend Anna's Alterations, they're friendly, fast and gave me a student discount.", "business_id": "TuUqEn9Q7LyuaT03LJ4ArQ", "stars": 2, "date": "2015-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eppXd18fTZSY5d7etGre4g", "review_id": "68ILFlbMnyLkyQdn3XmwzA", "text": "We went for date night special the other night... it was ok.  It did not do the meal total justice.  Our service was great.  It was missing a couple of key things like graham crackers do not substitute for a slice of cheesecake? I was disappointed and then the dessert was slyly slipped in as extra but a special price for the four of you, not much cheaper just made to sound that way but they took something away to make it more affordable. Then the meal was a special price too, and shaved down quantities and even the salad was too.  The food was cooked perfectly by us at the table! lol", "business_id": "uDoTFFud2mXE3VT1Jt9L5A", "stars": 3, "date": "2014-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lePr71n07wFDi4kuSn3Lyg", "review_id": "FoZWOCVQQm0zInNZAF0Q-g", "text": "I was guided to this practice when my usual doctor retired from medicine.  In need of a prescription and not having much time to find a doctor,  I made an appointment with Dr. Stephens.  The woman I spoke to on the phone was Terry.  Terry's attitude through the entire phone call was snappy. She cut me off every time I started to speak.  I assumed she was just really busy and didn't let that sway my opinion.  \n\nAppointment day arrives.  I walked into the office and felt like I had entered into my early  90s doctor's office.  Awful old chairs,  the decor was terrible,  and the fluorescent lighting was so bright it hurt my eyes.  I signed in and was given the usual paperwork.  As I'm trying to listen to Terry to see what exactly I'm supposed to fill out,  there are a few people in the waiting area laughing and carrying on a conversation.  It made it extremely hard to hear what Terry was saying.  When I asked her if she could repeat herself she rolled her eyes and sighed.  Oh yeah,  god forbid you have to explain something twice.  \n\nI didn't have to wait too long for the nurse,  about 5 minutes.  I believe her name was Gail,  she was very nice... however, when I was trying to speak to her she also cut me off and spoke over me. The exam room I was in had posters taped to the wall,  it didn't appear dirty,  just kind of slapped together like a dorm room. \n\nEnter Dr. Stephens... she kind of spoke with me about my history,  and then launched into a lecture about me not having insurance. Excuse me,  no matter how well intentioned your speech may be,  it's inappropriate.  You do not know the specific circumstances surrounding my situation. It made me really uncomfortable.... now,  I've had some health problems before,  so having a vaginal exam is not only extremely uncomfortable,  but I'm always anxious during it.  Her lecturing me made me feel even more anxious.  As she started the exam it was VERY,  VERY uncomfortable, and I was trying to convey that to her and she said the standard, \"If you would just RELAX,  this wouldn't be so bad\" and then pushed my leg out of her way.  Thank you for totally disregarding the fact that I'm so anxious I'm drenched in sweat... and thanks for ignoring that I'm trying to voice my state of discomfort by just talking over me.  \n\nI was so glad it was over.  When I went to pay I had to go to Terry. Funny,  when she was taking my payment she was remarkably pleasant.  \n\nIf I have to have any further testing or treatments I'll be going somewhere else.  This place just made me feel so uncomfortable.\n\n***Went to pick up my prescription today,  Dr. Stephens prescribed the wrong pill.  Which is hilarious because in the exam room when I was trying to tell her,  \"It's XYZ, and I think it's this dosage,  but I'm not 100% sure,  it's in my records....\" she cut me off acting like she knew exactly what pill I was taking.  Unbelievably angry. Do not go here,  it's an utter disgrace.", "business_id": "jmHing2kjywBhQlZKsgD_w", "stars": 1, "date": "2015-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iGRMB7M2ZR67VKgTdUxruA", "review_id": "wtc34LGtJ-ilHO57Wjy_Iw", "text": "Food was really good and they have a great wine selection.  I will say we got there at 6:45 and the place was already packed full and the bar too.  Had to stand around for a bit.  Just my husband and I so we have some wine, waited for our table and had a really good time just of the two of us.  Great for date night, little crazy with a group of people.", "business_id": "MQnNtW1lHS-eid3QNUoUIw", "stars": 4, "date": "2012-03-01", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "cr7KWf32wFdD4kYu2ovSwg", "review_id": "fxXvrgMKTAi_dcu_ZJDTOQ", "text": "This is not what qualifies as \"Good Italian.\" \n\nPerhaps there is an Italian village where this is identical to what they serve, but I have never been there. I've never been to Italy at all. \n\nSo I'll say this instead: This is not what qualifies as \"Good Italian American.\"\n\nI've enjoyed Mama Ricotta's catering before, and even dinner several times over the last decade. But tonight, despite not having to pay, having two glasses of Chianti, and having the gal at the bar give me her phone number, I was disappointed. \n\nJamal served us with precision and a smile. One busboy was nice enough to crumble bread on my jacket, then look down at my jacket as if its presence offended him.\n\nThe rolls...these are dinner rolls, coated in oil. They stiffened within minutes, which generally says they spent time in a microwave. \n\nThe oily rolls also came with a dish full of oil. A dish of oil is a decent gesture in most Italian restaurants, but this oil was spicy. And more spicy than I prefer. But if you are from that Italian village where they dip oily rolls in spicy oil, this is your place. \n\nThe highly recommended Warm Goat Cheese and Mascarpone Dip was pleasant tasting. Rich marinara surrounding creamy mascarpone, with bread of proper consistency. In fact, I wish they served a version of this bread as their dinner bread. The presentation could be better. Looked like a dying sunflower made of bread.\n\nFor the main course, I chose Pasta Primavera. While flavorful, and a big heaping plate, this was also heavy laden in oil. A deep pool of oil.\n\nMy benefactor ordered angel hair pasta with tomato basil sauce plus shrimp. She appeared pleased, although this may have had more to do with the man across from her, or her drink, or both. \n\nOr neither.", "business_id": "MQnNtW1lHS-eid3QNUoUIw", "stars": 3, "date": "2014-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "H2NruJZkN2raOPcdU_9MTA", "review_id": "mUAuCPGhT7JStHgQUHrYCw", "text": "Any footage I've needed to find and just called them ...  they have it ... also, I like the suicide-girls who work there. Great place and they know there movies. Thanks V.", "business_id": "STcLx0y_X89TsC0m2gVgHw", "stars": 4, "date": "2010-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NzWLMPvbEval0OVg_YDn4g", "review_id": "nZ1ZbRMOXzM3lhNhkc3nmw", "text": "I'll keep it short: \n\nAwesome atmosphere, inexpensive drinks, cheap tickets to see great live music. All around a cool venue and a great time. I can't wait to go back!", "business_id": "eNIDbboNe7W_rAnNHoveEA", "stars": 5, "date": "2011-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8vkD133S-jladt6pVtUWdQ", "review_id": "2IE0PyEhvyHSNTgKvSC15w", "text": "Excellent food. Very clean restaurant. Very friendly staff. What more could you ask for! The mint chutney is genuine, no some green liquid. I had the butter chicken extra hot. The spice level was perfect! Definitely recommended.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 4, "date": "2014-03-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "2BnDDp6K_XCNOPIWPKfS0Q", "review_id": "e1LeEaOdwu8Mh41JRQiaWg", "text": "I tried this place out Tuesday night with a fellow yelper friend after a trip to the Mint Museum on Randolph and wasn't as impressed as some of the other reviewers I see for Cuisine Malaya.   The menu is extensive though a strange combination of Chinese, Japanese, Thai, Indian and maybe more...but I guess it's a little of something for everyone.\n\nWe started with Vegetable Tempura that had onions, mushrooms, and zucchini (minus broccoli since he doesn't prefer it).  It was okay, not the best I've ever had, but not the worst either.\n\nI ordered the Curry Chicken and it was good.  Not too spicy, maybe could've had a tad more spice.  Chicken was tender and well flavored and veggies were cooked through but not soggy.  The flavor was good, but I have had better curry dishes elsewhere. \n\nHe ordered the Basil Beef.  They delivered Chicken (not sure if it was Basil Chicken but it was spicy!).  So we tasted the chicken first before they took it back to exchange it for the correct dish which was on it's way.  Both were good - the beef was tender and flavorful and the veggies in both dishes looked good.\n\nOur glasses stayed full and the waitress was friendly enough and very helpful even though she'd only been with the restaurant for three months, so that was a plus.\n\nI might try Cuisine Malaya again and give them another chance if I was in the area, but I wouldn't make a special trip.", "business_id": "MMNBgMQCdwyVoNaHg0h_QA", "stars": 3, "date": "2011-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "yrFbTsLn7jNGgSL1IYl8IA", "review_id": "UU23Ti8gHrAAcvFqYFdRUQ", "text": "This restaurant is my new favorite in Charlotte. I got the chicken satay, fried gyoza, California rolls, fried ice cream, and beef and broccoli. This all came to $30. The veggies in the sushi were crisp. The beef was tender and well seasoned. The peanut sauce was great and at the right consistency. The food came out in a timely manner. I will definitely be returning!", "business_id": "MMNBgMQCdwyVoNaHg0h_QA", "stars": 5, "date": "2015-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "50QOYMmf02QSxZfm2INzsg", "review_id": "zR5c4i9ztbatJMA3-VWL_g", "text": "The guy that helped me was very nice. However for $7 I expect more out of my sandwich. I had the tuna salad, which wasn't bad, but it wasn't great. Honestly I could get a better, less expensive sub at sub station two or Harris teeter.", "business_id": "c9D0yUos-jGOZaUv7SgCFw", "stars": 3, "date": "2012-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "g85JqZPJ1xJl5GCsgkusdg", "review_id": "Y8zGy0O7sGUANH6UtGuQ9A", "text": "This is not a review about Papa Johns in general.  I love their pizza.  This is a review of their store.\n\nTerrible!  Terrible and incredibly rude staff, terrible service, terrible manager, and the worst part, terrible pizza.  The last time I ordered from them, the pizza wasn't even edible and the cardboard broke when the driver handed it to me because the grease had leaked completely through during delivery.  \n\nTwice they've gotten my order wrong and they don't do anything to make up for it, I've had an employee hang up on me before even telling me the total for my order or asking if it was delivery/pick-up, and they don't honor the coupons online at papajohns.com.  Go to Domino's if this is your Papa Johns for your area.  I don't even like Domino's and order there now because this place disgusted me so much.", "business_id": "l3mzaesyc90rxXt2d4HpTg", "stars": 1, "date": "2011-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eFxX1tSNLmVkAP9kNv2--Q", "review_id": "6UPvp27vrWUEBLEvh-5Ugw", "text": "Same thing, different day.  I always get it to go.  Lunch special this week was spicy garlic chicken for 4.20.  Not that spicy and only somewhat garlicy.  I would complain about too much onions and not enough chicken, but at that price I should be scared of a lot of chicken.", "business_id": "cibtubYc6gd8T6Y-nPPByw", "stars": 3, "date": "2015-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WdoSVK5ooLK2cAMEjD8G8Q", "review_id": "IUQLqlpyQ9rxmnNW2nsBEg", "text": "You get what you pay for!\nSo stay here if you like cats, and at your breakfast table ! \nHost... What host? How do you run a BNB and not have a host? Oh and last thing that shouldn't be over looked, the shower. Fix the shower head in the Solarium!! For future cheapo's like myself.\nSo you ask why 2 stars, simple it was location location. Great neighborhood, and very near downtown Charlotte. I shot for the moon and only found 2 stars at this place.\nPlenty of room for improvement", "business_id": "tGpSzj-PX3yD5DIbOFhkPg", "stars": 2, "date": "2015-04-14", "type": "review"}
