{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7cOc19T2-TrOJX68V_O5kQ", "review_id": "Kvgszh3gi-dURwD62IWIow", "text": "I wish I could give zero stars...this is the worst bank I have ever dealt with and how I did it for eight months is just unimaginable. We all know banks are out to steal the money from all the little people, it is why they nickle and dime you with overdraft fees and fees for ever possible service you could ever want. I had Bank of America for 15 years and never had a problem, I am aware I was also grandfathered into a lot perks since I have had my account with them since my teenage years. I moved to Madison in September and was dismayed to learn there aren't  BofA branches in this city. I mean they are in Milwaukee and Chicago, why not Madison. Whatever...that is beside the point. So I opened an account with Associated. Big mistake. I knew from day one it would be a bad relationship for us. Cassidy helped me open my account at the State St. location, she has the unfortunate diagnosis of dyslexia and mixed up two numbers on my account so after it was opened my card wouldn't work even though I had funds available in my account. I felt this was a sign and decided I would just close my account and go to UW Credit Union. However, Cassidy tracked me down. She literally walked down the street to my place of employment and had me sign papers for the correct bank account number. Not only is this unprofessional, but it is borderline stalking because she had previously called me five times and I never returned her call. Did she not get a hint? Clearly. I was dismayed to learn I would have a five BUSINESS day waiting period for every deposit I made for the first 30 days my account was open. I pissed about htis but figured I could deal with this for one month. It sucked, but I managed. \n\nFast forward to December, I had a big trip planned to Chicago and needed my funds immediately available. I was past the 30 day mark so I went to the ATM and deposited my work check. Went to make a withdrawal and was denied. Went inside the bank and was told that because I had used the ATM to make my deposit, I would not have access to my funds for five days...I guess I should have walked 10 steps inside to do my banking. After two hours of dealing with management with came to a compromise. I still didn't have full access to my account, but I was given $500 in cash so I could eat on my vacation and pay for a hotel. So word of advice, never use their ATMs for deposits. \n\nNow we come to March, I realized that 50% of the transactions I made never posted within 7 days on my account. So I always had to be hypervigilant about not over-drafting my account. Fortunately I signed up for overdraft protection and signed a document authorizing transactions to be denied in order to prevent overdrafts from occurring. However, in March a restaurant transaction didn't go through for 10 days, I had forgotten about it and when my automated student loan payment went through, I was charged with an overdraft fee because it posted before my usual work check deposit. I called to complain, talked to corporate, referenced the paper I had signed all to no avail. I knew I was going to have to close this account. However, I just wanted to finish paying for my wedding prep and then I would do it.\n\nA few weeks ago I received a phone call saying they were changing the terms of my account and I had to have a minimum amount in my account or a direct deposit to avoid a monthly fee for using their shitty services. Originally I had to only use my debit card 10 times a month to avoid a fee. I knew it was nearing the end of my tumultuous relationship with Associated. \n\nNow we get to today. I needed two things today, very simple. I needed to deposit a check and to have a cashier's check made. Sounds simple, right? I couldn't deposit my check because it was made out to me and my partner, but she isn't on the account. I had to get her signature, even though she isn't on the account. So I went to a different branch (after getting her signature) and made the deposit and said I needed a cashiers check. Of course that is an $8 fee. F&^K that. I'm done. I was livid and red in the face. I am normally mild mannered, but I had had it. Went to empty my account and close it, however can't close it because I have one transaction pending. Go figure...it will probably take 10 days to clear. I am sure I will be charged a fee of some kind in those 10 days. \n\nMoral of the story....avoid avoid avoid. Use credit unions. Or just use cash everywhere and screw the banks that steal from the little people to line the pockets of their executives.", "business_id": "tOXZrihuRjPnyJK_O6iH1A", "stars": 1, "date": "2015-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jFbqK9jzIrJ0nC8C7syxVg", "review_id": "YoNaLlnFuo_rsihNx_DWRg", "text": "It's not the best or most authentic, but I love it.  The service is great and combo #1 is a home run.", "business_id": "S4TWo9X6b3gU6uucj4JN3g", "stars": 3, "date": "2012-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Lao_dTR_7Y5w_40cU1xxKg", "review_id": "Ev_b4zSS-lK_70KUiDLOgw", "text": "I came here because I wanted to check it out because I was in the mood for Italian. \n\nI am usually seated right away. The bread they serve with the olive oil is always yummy. \n\nI've ordered the spaghetti with meatball once - there was nothing special about the spaghetti. I also ordered the chicken fettuccine Alfredo once. The fettuccine needed more sauce.\n\nThere is nothing special about this restaurant but it's good if you are in a bind.", "business_id": "ybkWtM1ZnT2ewuquj3A9KQ", "stars": 3, "date": "2015-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "JryL6DmP4FPadFQD6Yj0CA", "review_id": "0-5ynJgw4Mm_OuMv8q1a5A", "text": "At my first visit this month, Dr. Radke and her assistants were wonderful. I never had to wait long and most importantly, Radke really addressed my eye allergies (a new phenomenon for me as a recent Wisco resident) and pointed me toward some new contacts that are AMAZINGLY COMFORTABLE!\n\nI really like that they offer Optomap as an alternative to dilating your eyes. It isn't covered under insurance but the cost is well worth avoiding dilation eye drops in my book.", "business_id": "SNaDmoUyl-X3bE8GM5hJ4w", "stars": 4, "date": "2014-05-30", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "m1ZlHZiIyXPq7AjLiRrcGA", "review_id": "jb3hRWKjkDUi6htLfzXXVw", "text": "I like this place... When you go there you know what you are going to get; warm cheesy comfort food, that is definitely not mexican. But if you go there knowing what to expect, you won't be disappointed.\nCheck their name of the day, you get a free meal! \nAnd its fun to go for half price margs on Tuesdays and Thursday, which usually coincides with karaoke or the fueling pianos.  I like what one reviewer said though, def don't dress up of you are going to drink here... You will get hit on by creepers and townies.", "business_id": "wPidHd5FxspPRgVqdEQ-Xw", "stars": 4, "date": "2011-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8vwnU1FlmR88S2NHgR7Neg", "review_id": "IDCecm_WyrcwdLJGLgvLaw", "text": "Quick, clean no muss no fuss, keeper!", "business_id": "5TQQy_x_ArR3_5L5L0fFVQ", "stars": 5, "date": "2012-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e9ALO47DWQYlG4bICLy_yQ", "review_id": "2aXPEKQrrp0N1Vvcgpp_JQ", "text": "We have been shopping at this location since we moved into the neighborhood this past year. Copp's (the past year or two) has really gone down hill. We normally do our big shopping at Woodman's because it's cheaper. We'd go to this Copp's more but 1, the prices are higher MUCH higher than almost any place in Madison.\n\n Also they have a horrible time having things in stock. A lot of shelves are barely stocked (during the week even) and the signs in the frozen area are dumb, having lame pictures isn't helping me find products.  \n\nIf they updated a few things, had more things in stock and even regular items in stock I'd give a better rating. Also the parking lot is pretty dim/dark. Makes me feel unsafe.", "business_id": "ZjwZIQM4TfFO7T7ck7FtYQ", "stars": 2, "date": "2014-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xxlce9hZUN_hM32IW3BhWg", "review_id": "LGQC8HtzvFzv0uCH_m1yzw", "text": "I'm greeted by an angry person 4 out of every 5 times I go there.  This morning a woman didn't even look at me and started walking away before I even got my hands on the bag.  I've never been more dissatisfied with such customer service.", "business_id": "311yXufoXR2dFngMHS9MFg", "stars": 2, "date": "2015-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-ZSPer3Fb79GxWLUIq7Dfw", "review_id": "UFG4pr4bfiKxzpVBmMX1cA", "text": "I've had a hard time finding a good cleaner in Madison. Block has been around forever. The storefront is unassuming. Staff is always helpful. Prices, average. However, they do an, ok job. I'm a little disappointed because I specifically asked them to get some salt out of my husband's pants and they didn't do a very good job, however other items I've taken to them have been fine.", "business_id": "01gRLh9-kr_ZYABrGwNxpg", "stars": 3, "date": "2013-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TdY8BlMSxFbNHnlZz4tsuw", "review_id": "BXWPrbbO4NH4yZTBdLt4YA", "text": "Friendly staff, quick oil change. As with any place they're suggest a new air filter, etc. (You can buy an air filter for $5 or $10, and installing it yourself is as difficult as making microwave popcorn.) No complaints.", "business_id": "izF6o43M1eWpivukmRQpRg", "stars": 4, "date": "2013-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "q6FLl_TcSF4PaXbJ37SwNg", "review_id": "0L0bbcY6yQTXJk_K5G30fg", "text": "This is a great place to eat if you are very hungry. Portions are huge and the price is small. First time here was taco Tuesday.  Trust me you only need one. Tacos are huge and taste pretty good. Second time I went I had the bacon cheese burger. Huge burger with tons of bacon. Same person was working both nights. Very friendly and great service. Will be back again.", "business_id": "QdSGdvZATzejDkSs435Rdw", "stars": 5, "date": "2015-05-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "S0WAH8ijhKjrs6cYE8mbcg", "review_id": "AbZRjTx_idyaD17hbRy7RQ", "text": "What struck me about this place is that is it HUGE. 30+ Lanes, and also an expansive bar (21+ to enter) area with two bars, tons of dart boards and at least 8 pool tables. \n\nIt was bumping on a Saturday night. We got our name down for a lane, and waited in the bar, where they have at least 10 beers on tap, a couple of them local brews. The pitchers are cheap ($7-11). Regular drink specials are advertised. We were bowling within 20 minutes of arriving. \n\nIt was a Saturday night, so shoe rental was $2.50 and games were $3.75 each. If you were to go in the middle of a weekday, you'll pay $1 for shoes and $2.50 for a game. I'll admit, my star rating is a little arbitrary in this case, as I am no bowling aficionado. The lanes seemed dandy to me. We had no problems, and the computer interface was easy to use.\n\nWe did not have anything to eat at Bowl-A-Vard. It looks like they offer more than the standard bowling alley pizza and fried food. Someone else will have to tell us how the snacks are.", "business_id": "bAew9nt-tw8YGjjD64gVWQ", "stars": 4, "date": "2008-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "1oiOUKhtO12geVVBIHsVNA", "review_id": "IctsgIwctAyHXj3BsL86cA", "text": "Last time I was there we had a table for four people. We ordered: one Reuben, one Sheldon (Reuben's vegetarian cousin) as is, two vegan Sheldons. What can I say, my friends and I like kraut. \n\nBut yeah. The Sheldon can be made vegan, and even without cheese (gasp) it's really delicious. Someone else mentioned that it was dry, but I order this almost every time and am never disappointed. \n\nThe fries are awesome. Good (but expensive) Bloody Marys. They have vegan pie slices and can make VEGAN MILKSHAKES. \n\n:)", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 4, "date": "2009-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "yxHnHENAwM1wlwd5SdS-aA", "review_id": "I2KM7j956feigtUoBsQnCQ", "text": "If I could give this place 10 stars I would. I've been coming here since opened and it is consistently the best. Breakfast all day, more than just burgers and fries, deserts, beer selection....I can't rave enough.\n\nThe meatloaf of the Gods is to die for and their Just Coffee roast (their own blend) is so amazingly good I have my mom buy it and send it up to me in Minneapolis. It's that good.\n\nSome of the people that work there have been there since I was a kid. Its a neighborhood place where you're bound to run into people you know and I make a point to go there at least twice while I'm home to visit.\n\nYay Monty's!", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 5, "date": "2011-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l8ELdurKgjA_z1KHmjOfGw", "review_id": "g9timyfX_JYThEbzZp4aaQ", "text": "This place is overall fantastic. There is a hip diner atmosphere, the servers are always very attentive, and there are so many options for food!\n\nThere are several vegetarian and vegan options, for both breakfast and lunch/dinner. If you are (or aren't!) a vegetarian, try the Vegetarian Hash or the Meatless Loaf of the Gods. Both are insanely tasty and huge!", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 5, "date": "2013-04-13", "type": "review"}
{"votes": {"funny": 4, "useful": 1, "cool": 1}, "user_id": "RvweNJFVkR3ttkWsIBy7nQ", "review_id": "-n-fBJ2ucPEtCMYLtOJm8g", "text": "Shut your mouth!  Meatloaf of the Gods!  There are three types of meat rolled into this meatloaf.  It comes with a red wine gravy, mashed potatoes and veggies.  All of this for $10.  Yup, a complete, well-rounded, mouth watering meal for just $10.  \n\nThe broccoli was blanched rather than steam.  So it was not mushy.  \n\nThe service is incredible.  The people are friendly and the food comes up fast.  I have nothing but good things to say.  On a date?  With family?  Have a small child?  Check this place out.  \n\nThey get desserts from a local bakery.  The carrot cake is ridiculous.  Are you full from your meal?  Take cake or pie to go.  Seriously, you will not regret a snack for later.", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 5, "date": "2014-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4AGRXB5C588iitXZY-y3wQ", "review_id": "u41q2zEWlEcbI5qQIBGsRA", "text": "Some kid answers the phone yesterday 45 minutes before their posted closing time \"Umm...yah we're like closed\" he didn't even say hello? I would have felt better if he simply didn't answer the phone.", "business_id": "WxfedycTcbQO_GuXHo9Ypw", "stars": 3, "date": "2014-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SAtGdC2OGVrttwiHlPeWkg", "review_id": "HRIIZRFeiJVkJTt-jJq_gg", "text": "Well, the tax return is in the bank, and it's time to buy lots of house upgrades. So I grabbed my list and headed for Menards. I walked into the store at 2 o'clock on a Monday, figuring things would not be too busy. First up is lighting for outside the garage. I walked past the \"Help Desk\" with a guy in his apron. Stood in the aisle by all the lights.  15 minutes later I walked by the guy with his apron and moved on to the window coverings. Oh, did I mention that he never got out from behind the \"Help-less Desk\"  to see if I had any questions?  NOT!\n\nWell, it's on to the Window Coverings area, where I had a couple of things on my list.  I know what I want to buy, but, again, blew 15 minutes rooting through the displays without finding what I need.  Oh this time there were 2 sales types with aprons standing there chatting.  Do I detect a pattern here?\n\nNext up, is a handful of things in the garden department.  Along the way I passed 4 or 5 Apron types without anyone offering a smile or asking if I need help.  The Garden Department is rather large as is my list.  I wandered through the aisles past 3 Apron types looking for things, but by this time my patience is running thin. I decided to leave.\n\nOn my way to the exit, I passed a couple of Apron types and not a one acknowledged me.  Hey, I get it.  I am invisible!  Next stop is Victoria's Secret to offer a hand in the changing rooms.  Being invisible does have advantages!", "business_id": "IoPdC59QwkWYm31xPkwcPw", "stars": 1, "date": "2015-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "13XTZwRHFLGjAdpN3YCm5Q", "review_id": "JK9IeKgrM5-jrwkHqZoqJA", "text": "I love the music. I love the dancing. I love the funky metalwork throughout the club, even down to the drain covers in the bathrooms which coordinate with the mirrors on the wall. I love the \"shows\" put on in the back of the club on Leather and Lace nights. I love the people watching. \n\n I hate the smoke. I mean I really, really hate that I reek like an ashtray after going dancing here. I would come here much more frequently if it weren't for the smoke. I hate that in the winter I have to freeze my ass off walking into the place because I don't want to have to get my coat dry-cleaned to get the smoke smell out of it if I brought it in with me.", "business_id": "XTGb5b3LBuhWHhJS1xPnQQ", "stars": 4, "date": "2009-04-10", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "eYP5TbubgSGE_KUWo3f-KA", "review_id": "KtoO0mJZMiA7HMokLTMHSw", "text": "I don't know the first thing about flowers, but this place was lovely. The warm humid atmosphere is a welcome respite from the frigid winter. I hear the outdoor gardens are great as well, but didn't get to explore those (again, frigid winter). Not a bad place for a family outing (our 3 yr old loved leading us around following his \"map\"). \n\nOh, And it's cheap.", "business_id": "Q3GGB4ZMajP-Qmtdr1cVZw", "stars": 4, "date": "2013-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6K-0vROqA1G1dTrLn6HtFA", "review_id": "y9hP0DdaEQOUuDzo99CGTg", "text": "Not a fan.  We had a breakfast buffet for a meeting there and the food was... not much of a buffet.  Potatoes were cold and greasy and the rest of the food was just not very good.  Have not had lunch or dinner here.", "business_id": "68JsiWNLKs8NDCrBCxIWMA", "stars": 1, "date": "2014-03-29", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "LkmcnJNBfnvaZk6MoE_k5w", "review_id": "-rurBOaejYd8ZYoVaT7veA", "text": "Mr. Roberts is not a place I'd ever go to for the sole purpose of going out. Both times I've gone have been for bands, and both times were fairly different experiences.\n\nMy first time was a one-star experience: it was ridiculously hot and humid inside, the staff lacked any sort of motivation for good customer service, and they crammed the 7- or 8-piece band in the front of the bar near the window, making for awkward viewing and playing. The sound was terrible and I spent more time outside than in. \n\nMy second time was a better experience, but still not one that would cause me to suggest other people go there. This time around it was a reasonable temperature in the bar, but that may only be due to the fact that it was in the 50s outside. The bands played in the back of the bar in an alcove/side room deal and it made a lot more sense. The sound was still deafening and subject to random strangers twiddling the knobs on the mixer, but overall not too bad. \n\nFree music is the best thing (only thing?) Mr. Roberts has going for it. Its biggest downsides:\n- it's touted as a blue-collar bar, but it's more an excuse to be shabby and dirty than anything; $15 for a 5-bottle bucket of beer is not a good deal, and $5 for a PBR & a rail shot is a special for a couple hours one night a week when it should be the standard price for such a combination\n- the ladies room is ridiculously tiny and awkward, had a seat that was half hanging off the bowl, and no TP\n- every surface was dirty or sticky, yuck\n\nYou probably won't die if you go to see a friend's band play, but supporting a friend should be the only motivation for setting foot inside.", "business_id": "-4PHmmCt_RmAfaE3sDKW_g", "stars": 1, "date": "2011-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "rrwKynfpsGGxPLWY31PLkw", "review_id": "A4iEdfzCtGXHhUdV-Wtm7g", "text": "Good bar food. Cash only . Seat yourself first come first sere. The walnut burger was decent and had the warm chips and blue cheese dips was not bad . Very cozy place with banquet style seating.", "business_id": "KHOHjA8HOcTlFBCtMQFv8A", "stars": 3, "date": "2014-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4bsu8DLfDkBV84RKn6UmcA", "review_id": "nRJrTAw5L13UR4MEaJKRNQ", "text": "Thank God! When I was an undergrad in Madison back in 96, we scoured the city in search of decent bbq to no avail. I'm moving back in August and now know at least 3 places where I will be dining in that first week. This is one of them and I look forward to it. It just unfortunate that it's on a street named after the Packers... boo. Go Bears ;)", "business_id": "HLWtNcf3l-wKb6v9duteMQ", "stars": 5, "date": "2009-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 7, "cool": 3}, "user_id": "lC0KGXmIhyjzghBUlVnkhQ", "review_id": "6ovemjwlG5MhRgLcUr3ZJA", "text": "When I only ordered sandwiches I was doing it all wrong. The way to go is to get a half chicken and the 1/3 slab combo with brisket. Insane amount of food? Yes. Worth getting to try all the best parts of the menu? Yes!", "business_id": "HLWtNcf3l-wKb6v9duteMQ", "stars": 5, "date": "2014-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XnryGO0P6HFNXagIPPLLgQ", "review_id": "vjl61KQ5xvP9rcUOzfTx2Q", "text": "I've had my stalling car fixed and my tires rotated at Chet's. I've had nothing but good experiences there in the short time I've been going. The front desk is as friendly as all get out, and they make sure you know how much things are going to cost before they touch your car. It's clear they are there to help you and not rip you off. What great people!", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 5, "date": "2012-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "xOe-ZopdYiu8ijimmtdrnA", "review_id": "WdpLjmTxJN_ubo_YWCDGfQ", "text": "Great diner with the added benefit of being able to see planes land and take off!\n\nWent for breakfast on a Saturday morning. It's a bit of drive from the West Side, but worth it. Prices are reasonable and portions are generous. Service was great. Typical diner food, but all the prices are plane model numbers, which ads to the experience a bit I think.\n\nBest part are the giant windows that let you see the private terminal tarmac of the Dane County Regional Airport. We saw three or four planes land, taxi and take off during our hour meal.", "business_id": "j515klfbCAEF3KPiKvHz9g", "stars": 4, "date": "2014-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KwvMvXQEMbPWhpg6z8dK8Q", "review_id": "Rv9vzftrs63f0kFYaX880w", "text": "Initial in store experience was ok. Associate was helpful. The rest of the experience, not so much. The chair I bought, when it arrived, looked good but mechanically was unsound. I called a national number as instructed and eventually someone came to look at it. Parts were ordered and someone else came and put in part of the repairs, saying the other part wasn't needed. The chair still has problems. There was never any follow up from the Madison store. VERY dissatisfied.", "business_id": "XRSKxJ_qmo_fmbnTrjOKAg", "stars": 1, "date": "2015-04-07", "type": "review"}
