{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Sjb5e5-gKoLXueFDMc2R8Q", "review_id": "2_Ru_ASf75kU303rdQjFfQ", "text": "What a cool bar/restaurant.. I will no doubt be visiting again.  The service and prices were great.. and the restrooms were clean.   I had the buffalo chicken sandwich and it was delicious.  The menu consists of typical bar food food, however; theres a few different items on there which stand out on the menu..\n\nA cool bar off the beaten path that is a worth a trip.  \n\nCheers ! !", "business_id": "KayYbHCt-RkbGcPdGOThNg", "stars": 4, "date": "2013-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "Q3F_FZ8pbdRNoSv0X1Y7sA", "review_id": "qM6afyD5OmP-Y7IbefcUQQ", "text": "Dave & Busters is a great experience  if you set your expectations realistically and carefully choose when you attend.\n\nThe main squeeze and I always 1) use a survey receipt for buy $10 get $10 in free gameplay or 2) Attend on a Wednesday during the day (flexible work schedules). We'd never dream of eating there because we like healthy yuppie food. And we only drink cheap drafts OR drink cocktails during happy hour.\n\nYour visit is largely determined by time of day, expectations and whether or not you eat their food. If you come on a Friday night, the lines will be long. You'll pay $150 for the two of you to eat, drink and play for 3 hours and you'll be left with a very sour taste in your mouth.\n\nThe staff is really excellent; any issue with a game not paying out tickets results in immediate help and extra tickets or a swipe for a different game from an employee. \n\nNote the \"drinks are weak\" reviews. Also notice it was people buying shots and ordering multiple drinks per person. That's typical white trash behavior. Bartenders here are savvy; they mirror the behavior of the guests. All of our drinks have been consistently strong and well put together because we're courteous and tip well. I have witnessed bartenders bypass tattooed, loud guests and address me and take my order first. This is rational, logical behavior. \n\nAlso note the \"prize center games suck\" comments. You're supposed to stack tickets over multiple visits and use them on a big prize. Like life, delaying gratification nets you bigger returns. Every other visit I've seen someone walk out with a video game system (Wii, Xbox360 and even a few Xbox One's). \n\nThe thing about Dave & Busters is the crowd changes depending on day of week and time of day. Sunday afternoon it's all families and Friday and Saturday night it's all drunk 20 somethings. The atmosphere changes and that's why the reviews are all over the place.\n\nThis review is based on 8ish months of 1-3/monthly visits. Most visits are 5 stars, some are 4 stars.\n\nUsing survey receipts for Buy Ten Get Ten, avoiding Wednesday, Friday or Saturday evenings (and Sunday afternoon, families) and avoiding the food entirely and drinking cheaply, you'll have a great experience for $25-40/person.\n\nI really enjoy the staff too, they split the difference between fun and professional. Special shout out to Riley, gave us info on possibly hosting a party there.", "business_id": "sbW8qHJgzEIH42B0S-3New", "stars": 5, "date": "2014-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ytgLwKzD6B4af5vW56RpJg", "review_id": "dcfraWBbOMz8CVQQg4tm1w", "text": "Went to Rock Bottom for lunch the other day and was very pleased. My coworker had printed out a coupon for a free mini appetizer. The waitress told us that they were not making mini appetizers and gave us a full sized chicken quesadilla. If you have ever had the southwestern egg rolls from Chili's - the filling tasted like that and I am a big fan! \n\nMondays are half off burger days and I tried the just hot enough burger - topped with crispy jalapenos, pepper jack cheese, pico de gallo and housemade habanero ketchup. It was delish! The ketchup was so good and the fries were extremely crispy. \n\nThe prices are a little steep for lunch but if you go on Monday, it's totally worth it. I think that the quality of food more than makes up for it but don't expect for pay under $10 for a sit down. \n\nI felt that the staff was very nice and the waitress was very attentive. The service was quick and I think you can get in and out in under an hour.", "business_id": "McikHxxEqZ2X0joaRNKlaw", "stars": 4, "date": "2013-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "iXU9nJvHRtI2o4p8sqt3XQ", "review_id": "ICH7b-2eX3ViyuAv8B0P3A", "text": "This place is kind of a hybrid of Applebee's and CPK, which isn't to say it's bad, but nothing to rave about either. I got their slider meal, which was tiny (for me) and my friend got their steak (which was way tiny). The food was fine and the service was okay, but really felt like an Applebee's knockoff (and Applebee's isn't even worth knocking-offing anyway). \n\n3 stars", "business_id": "6p9TlP2I8S4agxYMNFSDjg", "stars": 3, "date": "2009-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qV6EGb_rWdyZXzmzmZwXXg", "review_id": "Bh2l1lVIHKl1ZcDaaLXdkw", "text": "Haven't been here in a long time.  Never thought Applebee's would be so good. \nThe new Sriracha Shrimp are fantastic.  BBQ-ish, spicy,  fried perfectly. \nThe Pub Philly with extra grilled jalapeño was another hit.\nIf you get fries, get the BBQ dust on them or on the side. \nBest part was their in house made spicy cucumbers.  Pickles gone WILD!\nIf you sit at the bar, see Nucc. He's great.", "business_id": "OZfpG8tDCcIEq8pzgZdyKw", "stars": 5, "date": "2015-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "TbUzjXVKCWTEW1W56Ayiyg", "review_id": "pJLeqoSeO6utQS4pUpxmDg", "text": "Average food, slightly above average prices for the quality/taste, average price for the location, lack-luster service.\n\nThis place (the location, the actual building itself, etc.) could be so much more.  I wish they would either step it up, or sell the business to someone that would let it achieve its true potential.\n\nUntil then, there are other dining options in Regent Square and they should be explored.", "business_id": "XQ7elqSFIRogvqpiTZz-Wg", "stars": 2, "date": "2012-04-17", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "6QhWTugzBJ3cdv2N4WZcSA", "review_id": "F5SntN4a97tKwbx6L9JaUQ", "text": "I'm a pretty hard core karaoke fan, so I was excited to visit Nico's on a Saturday night after hearing about their awesome karaoke. Sadly, I was disappointed. The place is rather small and was packed by the time we came (about 10pm). It took ages to get a drink and it's hard to get around the bar with so many people standing around. That said, my drink was nice and strong and the prices are reasonable. \n\nNow the karaoke crowd was pretty fun...mostly hipsters with a few good singers but mostly people trying to be funny with their song choice. The karaoke host was just lame. He was an older guy, and seemed rather cranky and jaded, which really kills the mood when you're a karaoke buff looking for a good time. And he had a CD setup -- seriously, CDs, in 2010. His song list was waaaaaay out of date. He had a tiny TV screen that was setup in such a way that if you needed to look at the words, you would be facing away from the crowd. It was just really lackluster in my opinion.", "business_id": "tQpYnf3P3Q_OQLYYJvlV-A", "stars": 2, "date": "2010-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GcBAIs4pzeK6OzHpawgZlg", "review_id": "uyObeSTsARNYDGp-LyRzkA", "text": "Late nite meal. Gyro was a bit dry. Coleslaw and fries were great.\n Rice pudding was great.", "business_id": "--UE_y6auTgq3FXlvUMkbw", "stars": 3, "date": "2013-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "BwmLOQf6ba50InPaWFcxdQ", "review_id": "MEBl9Nd4-umQFx8GPSqePw", "text": "I don't understand what all the hype is about. When I went with a friend, I got a burger and a beer on the strength of the reviews here. My burger was passable but nothing to write home about; I've had better burgers at Sharp Edge and Harris, it's been a while but I thought I had a better burger at Fat Head's. Hell, I might have had a better burger at Five Guys.\n\nAlso, maybe I was looking for something more upscale but the decor left something to be desired. We were seated at a cramped table all the way in the back with a view through an extremely greasy window to the kitchen.\n\nI'd go back if a friend wanted to go, but I wouldn't suggest it.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 3, "date": "2009-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l0tsGKUp4fk6aCrbZnRAdQ", "review_id": "_h6RvwoQJgREqMJ6YOq-FQ", "text": "I should preface this by saying this wasn't my pick, and not really my kind of place.  That being said, it's a decent conventional style restaurant and not bad for what it is. \n\nI had the kelly burger and it was just extremely massive and greasy.  The boiled red skinned potatoes were pretty much what you'd expect boiled red skinned potatoes to be, and they come with melted butter on the side in case you'd really like to pack an artery.  This is definitely not a meal for anyone worried about TMAO.\n\nI don't want to be too hard on the place because, you know, it is what it is, and for what it is, it's not that bad, not that good, just ok; something like that.  \n\nNow, I just wonder how long that burger is going to remain in my gut.  I think I can feel the bacteria burping away in there right about now... Ugh.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 2, "date": "2013-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KZEGLZ5zM9Jh4Yy94_4LBA", "review_id": "lBuMhlMbYm8p5ymsboWmCA", "text": "Free wing Fridays... oh yeah.  I don't even like wings usually, but Silky's knows how to cook 'em so they don't taste fatty.  Get a side of Atomic sauce, which is flavorful as well as hot.  I'd buy it by the bottle if I could.  The menu is huge, and everything I've had has been good.  I always get the home fries on the side, which are cooked with onions and fried jalapenos (!).  Great waitresses, too.  Would be five stars if it had decent air conditioning--in the summer, sitting inside is painful.", "business_id": "3zgswf_NfBJpeAoWeTkgMA", "stars": 4, "date": "2009-05-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "DwXVdLxCHp9Uag-HjWgcnQ", "review_id": "H6QR2e1DvsCMlh7ItJAdTQ", "text": "I always enjoy my time at Lot 17. You can just hang out and grab a beer or enjoy some food in the back. The food is amazing. I especially enjoy the Mediterranean Seafood Salad. It is a MUST ORDER. The sweet potato fries are a great compliment to any of the burgers, wraps, or sandwiches. Go to Lot 17, you will not regret it.", "business_id": "7XXmky6YYjsvKFwho_eavg", "stars": 5, "date": "2013-04-15", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 0}, "user_id": "azshq1Cw_Lggfv_i2f4XPQ", "review_id": "rfbWsLhxLuSUHuEvvl30ng", "text": "We are weekly regulars, as a family of four and as a couple for over the past year... so we know The Saloon from good to bad from both perspectives.\n\nThis last week, we met the \"Manager\", unrequested.  He harassed my dinner partner and myself with a condescending tone regarding a sandwich that we order nearly every visit, which happened to be just last Sunday, in which we had great service (she must have worked at a steak house somewhere and SHOULD be the manager, her name is Erika, thank you Erika... and she was rewarded with a 30% tip.  Prior to the plate landing on the table, the waitress commented on its appearance. \n\nWe both agreed with her, tasted it as per our request to be nice, and sent it back to the kitchen as she recommended it prior to us tasting it.  It came back to the kitchen in the same condition, supposedly \"remade\"... which by that time, my sandwich was cold from waiting, in which I kindly requested it to be reheated if that was possible..  We have also ordered the same sandwich from about a dozen other Pittsburgh restaurants.. we know what it's supposed to look like and taste.\n\nNot to mention, our order was delivered wrong.  My offered sandwich toppings were not on the sandwich.  And my dinner's partner side was completely wrong.\n\nSo I complimented the waitress, I told her that she was great.  She told us that she did not know what was going on in the kitchen and that she was sorry for the third or fourth time... something that the \"Manager\" could learn to use in his vocabulary.\n\nSo after the second sandwich landed on our table, and we decided not to eat it.  My partner and I agreed to simply leave and eat elsewhere.  We were planning to pay for our drinks, and tip the waitress, and simply leave as we did not receive the food that we ordered... \n\nThen the \"Manager\" came out.. a loose cannon that has no business even working in an establishment.  He harassed us, we showed him the sandwich, a smooshed example of their culinary art that \"his guys worked so hard on\".  He did not understand the concept behind keeping customers, \"you can get it right 6/7 times a week, but tonight you got it wrong, and we are not paying for an ill-made sandwich\".  Those were my words.\n\nWe even politely called over the waitress to mediate his attitude that had no firsthand experience in our situation.. as she was readily available for us.  She flipped her story, so the sandwich and kitchen that was off in her opinion was suddenly on their A game tonight.  I guess the three to four prior apologies from her was also none of the \"Manager\"'s concern.   \n\nHe threatened to call the police and told us that he never wanted to see us again.  This was after he personally insulted myself for having a couple of light beers...as I was \"welcomed back to enjoy drinks since I enjoyed them so much.\" I told him that a personal insult was unnecessary and with that, I also advised him to attend a management school and that we will not pay for our meal.  He then harassed us more, asking us what was wrong with my sandwich.. at that point I was done.  I simply told him that we were not paying because of the way he treated us.\n\nThe staff illustrates the faces behind the business.  The Saloon would be great in the right hands, but it's in the wrong hands, run by people that may have over 30 years of ownership, but zero concern for their customers nor any competence in organizing and managing their business.  And that lends itself to a less than mediocre ambiance, low food quality, and inconsistent service... hence the 3 - 3.5 star rating seen around the Internet.  And the 5 stars... they had Erika and no \"Manager\" presence nor drinks from the bar.  Not to mention, the bartender has little competence in mixing drinks, hence the long beer list.  Save some money, fire the manager and the bartender.\n\nAfter walking half a block home, we changed our clothes from our traumatizing, filth of an experience from our lovely, family friendly neighborhood restaurant, and headed to the Walnut Grill, where we sent back the sandwich only once (thanks to a kitchen error on the order), there were only smiles and no threats.  There's a reason why Walnut Grill has several locations, the ambiance is killer, the service is stellar, the drinks are mixed the correct way, and the food is just as edible the next day, because it's that great to take home.  \n\nIF the owners were savvy and recognized that they live in 2015, they would know that this review alone can hurt their business by up to 20% or more.  I hope it does.\n\nA $8.99 Sandwich and incompetent service.. lost a tab + tip which was going to be paid.. weekly patrons.. and has initiated an interview with our dedicated lawyer.", "business_id": "jJfTh2O3M2Q716akd9Dr9w", "stars": 1, "date": "2015-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "LP-if-G7VkaJwT27VI-ynA", "review_id": "VpgYfnDOWbSLlcKLF_j1Ag", "text": "The fact that this place has a bacon night has impressed me for years.  I would receive fat-smudged pages of letters written at this bar, the samples of Dogfish head dripped onto dog-eared corners for me to scratch, sniff, and lick at my discretion.\n\nThe men's room alone is a reflection I would leave unchanged in my description of this place.  The orange/yellow urinal and the sink are shaped in the Rolling Stone's mouth logo.\n\nNext time I visit Pittsburgh I will do brunch there with friends,", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 5, "date": "2011-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8S31aq8jJHy0RblNlNVt6w", "review_id": "qKBhr_-a898Mi7RjhNt5pg", "text": "Sitting outside eating the Mac Cheese + Chili + Pulled pork and drinking one of their many delish bourbon drinks I could not be any happier. good job Harris.", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 5, "date": "2014-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MR-X742GO4wt99mhnOwujA", "review_id": "4UxPEf9-_69w8cEjjN6AhA", "text": "I remember when the food at the Harris Grill was just meh and the interior hadn't been updated in God knows how long.  Suddenly, they have a bacon night, the interior is hipster chic and the food has been significantly upgraded.\n\nI just recently went there again this past Saturday with my daughter Muff and my sister Luch and we had a pig-out moment. There is no good reason why three people should order entrees and several appetizers for lunch, but we did that.  My sister and I ordered the Salmon BLTs. (She tried to be healthy by ordering a side salad with her sandwich, but I went all the way in by ordering the fries to go with!)  Muff ordered the \"I Can Has Bacon Cheezburger?\" and tatter tots. (Muff could only finish half of burger since we got the appetizers too.) We also ordered the Hush Piggies, which are home-made tatter tots with bacon and cheddar cheese (What's wrong with that?) and Chimichurri Flurry wings.  (Those wings were delightful and delicious!  I usually ask that my wings be fried on the hard side, but they instinctively knew that's the best way to serve them.)\n  \nWe also ordered the Cookies-N-Cream dessert which is a hot chocolate cookie served in a small cast iron pan with a scoop of French vanilla ice cream and hot fudge sauce.  I'm not really a dessert person, but I have to say that that warm chocolate chip cookie with the ice cream was tasty.  Go on Harris Grill, you have stepped up your game! \n\nIt's nice when an older restaurant in a quote, unquote \"chic\" neighborhood decides to do a remix of their space and menu.  That has been the death knell of many established restaurants. (I miss Eddie's Restaurant in the Hill District for a good old-fashioned soul food breakfast.  However, I don't think that they renovated the place since Van Gogh had both ears.)  Harris Grill did a nice update and should be rewarded by having more customers come through their doors.", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 4, "date": "2015-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_LohNuqlvGPIHjiulgeNhQ", "review_id": "2AwVmufwOWfF8YQ_T4eV_g", "text": "BEST mac and cheese bites ever! These mac and cheese bites are not the traditional ball shape; they are little triangles of heaven served with ranch; they are crispy on the outside and cheesey on the inside. $6.95 is enough for two hungry people or a small snack among 4. Wings (10 for $9.50) are also delicious, would recommend the Honey BBQ. The Kitchen Sink sauce is a little weird, but can imagine some people really liking it. The tots ($3.95) are also great munchies. There are lots of nights with discounts such as half off wings, so def check those out.\n\nGets crowded with some college students and some older folks as well - might be difficult to get a table. However, service was great and our server checked up on us several times despite the crowds.", "business_id": "vSZDiKiF8vf9zt_BcDL7GQ", "stars": 4, "date": "2015-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3iz1qNOI77Hcml7T8t4PjA", "review_id": "UUxtxOVkLjt5ZdjRBMx50Q", "text": "Living near the  Brightstar, convenience brings us in more than anything.  My favorite is the salad bar, which is small, but always fresh, and seems to have all my favorite ingredients.  A+ on the salad.  Lunch includes pizza buffet with the salad bar, but they rarely have more than one or two choices of cold, bland pizza.  We recently had a philly which was on special for lunch, and the flavor was great, but the sandwich was    very small.  My wife, who is not a big eater, was still hungry when we left.  This place has a lot of untapped potential when it comes to the food.   The staff is friendly, but there is very little table service.  This place is OK for convenience, since Mount Holly has little to offer food-wise, but don't go out of your way to get here.", "business_id": "jyF0rwmQEIdDWVtP5vlf3w", "stars": 3, "date": "2012-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a10qEGPjpBKuWgCKLHn0xA", "review_id": "XwOUzJqbjxbCLjHSGdbTzQ", "text": "Ate lunch here. Was good!  Service was friendly", "business_id": "QMZe84KFyZy0IlCBb1v91A", "stars": 3, "date": "2011-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "OXzYyZSHo9Dl6Qd0s_o2Ig", "review_id": "0TIgYN_CZLYEzPR_RiC6tw", "text": "Fantastic date place!!!  This little restaurant has fantastic apps and dinners.  My favorites are the Shrimp Marsala or the What It Is.  The crab soup is excellent also.  When I am there for dinner I always get a half and half with my meal.  But if you are just going for lunch get the chicken quesadillas - excellent.  Ladies!  Watch out for the pole!  Then take a walk around the beautiful Fourth Ward!", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 5, "date": "2010-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SkhGKyHgwf-IMqpre5SfGA", "review_id": "kyYFY_ZCms6ySEYGrJGuVQ", "text": "Bad food. Bug problem. In a neighborhood full of homeless roaming the streets like zombies.", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 1, "date": "2014-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "eL-pnXODdyMwABMmLOrwKA", "review_id": "3LitPqMnsMGN9GT1K4YtVg", "text": "Great for private dining events and the steaks are out of this world.  The service, as usual is way above average and the prices are too - but for a fancy treat occasionally, great place.  They do run daily happy hour specials for less expensive items and drinks, so stop in after work.  Valet is \"free\" like all places around town and it is convenient.", "business_id": "Lt9o2RmacVY2L-IWLA8uTg", "stars": 4, "date": "2012-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "DGBFThaJuZodW5mDnmR9eg", "review_id": "N3pOPspfy32BSRsKxO87Qg", "text": "I tried all their beers; the seasonal was OK, stout was great.  Rest of them were not good IMO.  Food is so so - not really worthy of 3 stars and wait time was long but it was a Saturday prom evening so it's OK.  They got the third star from me for the service; waitress was great and once seated, service was extremely prompt and courteous.  I guess they made it a point to train their staff in explaining their different brews so that was nice.", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 3, "date": "2010-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zjVhllWoBInU9P_yyvygqg", "review_id": "2Tdn3P3_KLBkstaVXrB_ZQ", "text": "Bad service and mediocre food served cold.  If you have a large group and want to get together for lunch you would be better off bringing a bag lunch and meeting in a park. \n\n We made reservations but it took 30 minutes for our order to be taken and the food didn't show until an hour later at which point we all had to get back to work. And, the food was cold.\n\nThe kicker is that this  wasn't the first time this has happened.  A few weeks ago we all got exactly the same horrible level of service with cold mediocre food.\n\nIf I could give negative star rating I would.", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 1, "date": "2014-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5XsRngBSNyaj3rN2lOdOIg", "review_id": "mbsmxMtjR9hQypnX6c9OKQ", "text": "Went here for the first time to watch my Tarheels get the crap kicked out of them by Duke.  Though the game was horrible, the bar was great!  Had a buffalo chicken wrap and quite a few Fat Tire drafts and I had a really great time.  The staff was attentive and helpful, the people were friendly and personable, and I was very pleased.  Will definitely be going back for the next big game!", "business_id": "t5l-H2KdY4MQgLDMENz9WQ", "stars": 4, "date": "2010-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DUOrH5F4M75elFDyPnhBeg", "review_id": "hdpTJOwgJ_WKo1Ox82Hhcg", "text": "Average food with a few exceptions. Above average prices.  \n\nWaiter was excellent (Darius), but terrible hostesses.  hostess gave us a 20 min wait, we waited 30, they buzzed us.  We go up and they tell us, oh, it's like 45 min more probably.  THey really need to sort that out, we had a large party and we just barely didn't walk out.\n\nHighlights: Waiter Darius.  The crab artichoke dip was great.  Braised beef short ribs were superb.  Decent wine selection.\n\nPersonally I'm going to try a few other places around, for the money I expected more", "business_id": "hIQRiE3UsYH7UsrsDwJwLA", "stars": 3, "date": "2011-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yFqbvs-Q1vV48rtl3JG2mQ", "review_id": "MjGV_4lecPOSgkpJkaK8kg", "text": "We really like Harper's and right after Village Tavern is our go to dining. We like just about every other place in Charlotte have had an Issue here and I warn you, the wife ordered a steak prepared a certain way and the waiter brought it out cooked Hawaiian or something along those lines and the kitchen told him to bring it to the table and offer it to her.\n\nReally she ordered it prepared one way and you want to bring what she did not order to the table? Mind Blowing.\n\nI told the waiter do not let the kitchen jeopardize your tip by offering what the customer did not order. \n\nThe biggest part about this was that the ease the restaurant offered us the wrong order knowing it was not what we ordered. So it brings 2 questions to mind:\n\nDo they make a lot of these mistakes?\n\nDo they offer the wrong order and people take it?\n\nManagement may need to get a hold of their kitchen staff and make it clear how they need to pay attention to detail and serve ONLY what was ordered.\n\nOkay, I understand if they did this why the 4 rating? Well we have been here 5 times, you get 3 strikes in my book before you are out. and 1 out of 5 visits is not a killer.\n\nJust focus Harper's you have potential but as my standard for Customer Service \"Devil is in the Details\"\n\nPS\n\nWe did go one other time and the wife's steak was cold and had to be sent back for warming.", "business_id": "hIQRiE3UsYH7UsrsDwJwLA", "stars": 4, "date": "2015-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8hQ_vBLIecSLSBAe38jctA", "review_id": "GcR6Jip6M8cDPIzSqYhS-g", "text": "I love this place!  Huge variety of pancakes and more on the menu.  All very tempting, but from the first time we visited we tried the Eggs Benedict and have been hooked ever since!!\n\nThe Hollandaise sauce is the best I've had ever - anywhere!  And the potato pancakes that come with them are to die for!!  I don't know how they do it, they are thin, crisp, potatoey and very onioney.  I love them!!  It only makes me sad that I live in Durham and only get to this place about once a year.\n\nI did switch once and try the Dutch Baby, which was big and lovely and tasty with all the powdered sugar, butter and lemony, but I really missed my eggs bennie and potato pancakes and have never looked back.  Oh, you must try it and btw, get the sour cream and applesauce for the tater pancakes.", "business_id": "UzMMpUFwJhwUkHOyeXeWsQ", "stars": 5, "date": "2011-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ibFhSabIkMBzQW9wtPLaeg", "review_id": "DGbu_dC3OHR8zSV3gY908w", "text": "Wonderfully surprised the food here is the best my husband and I ever tasted he had blueberry pancakes and I had the big bird salad the chicken salad and the fresh fruit was to die for the service was absolutely wonderful. I would definitely recommend this restaurant to my family and friends we will be back,the restaurant was clean and had a warm atmosphere.", "business_id": "UzMMpUFwJhwUkHOyeXeWsQ", "stars": 5, "date": "2015-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Zl_fNX7giA2IGV24uDlj8A", "review_id": "Ta0TJyUPtH-4L96rhFwZxA", "text": "First night in Charlotte and just wanted some bar food, nothing fancy. Thought it would be dead on a Monday night, didn't know they offer $3 draft beers on Monday night!  Service was great, Emily stopped by the table consistently to see if anything was needed.  When you ordered a beer despite how busy it was, it was on the table in a minute or two.  Had the Sheboygan Side-by-Side with fries instead of potato salad.  The fries were a little cold, but Emily quickly addressed the situation by bringing out hot fries making this a five star review.  If you like a a variety of beers, good brat's, and great service come to the Flying Saucer.", "business_id": "F-e-sWfVd3eCYll3BP1QFA", "stars": 5, "date": "2013-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-3LE-Vd2EEPTL6it8-ONAQ", "review_id": "hOJYh3f5DYmUicaVV6-5Kw", "text": "I really like the Flying Saucer... It's something about the eclectic/college hang out spot feel that would keep me coming back... That and their enormous beer selection! I only been here twice and the food is spot on.... Their burgers are definitely some of the best that I had in Charlotte... The bacon wrapped jalapeños are great, but not so great if you have a weak stomach for spicy things..... Their service is hard to judge being I only been there twice. I can say the first time I was there the service was good,  the second time it was eh.....", "business_id": "F-e-sWfVd3eCYll3BP1QFA", "stars": 4, "date": "2015-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BHorcbQdyh34NLLbvYi_Rw", "review_id": "Wtp9uFsnu6ep7PxP0nxL8w", "text": "Good food and good service, and right by the house....", "business_id": "687wG68J1XicP5YzMqKqFQ", "stars": 4, "date": "2010-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p7NG3lJVe38tK9lAJla3gg", "review_id": "JdkM5eGkUKv_TR4f__V16Q", "text": "Very upsetting!  Park 51 cafe is under new management.  Some of the new staff not near as friendly.  Norman, who has been there over 20 years is gone.  He was always quick to fill tea and bring out food if the waitresses were busy.  My husband and I started coming here when we were dating.  Now we need to find another breakfast place.", "business_id": "-9Zy-3vhvOtsY5u2taOfQQ", "stars": 1, "date": "2014-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 0}, "user_id": "DKHlzIfL2DOVbIURBzaLWw", "review_id": "3RyY8g9NiaqP8Sak-0wb5Q", "text": "When Smokey Bones first arrived here in the University area, we went several times and enjoyed ourselves greatly.  The brisket was smashing, the pulled pork was very good, ribs were spot on (this was before I became a Yelper).  So we decide to go last evening and MAN were we disappointed.  Now, I hate that my second review rivals my first inasmuchas I am not writing a good review, but I feel that this must be done before any Yelper out there goes and blows good money on dinner here.  \n\nThe most disappointing aspect of our visit was the smoked beef brisket.  I cook and understand that to keep brisket moist, there needs to be a fat content to the meat.  What I recieved last night was underprepped and under cooked brisket (It was done to temperature, but for brisket to be done correctly, it must be cooked until the fat renders more making the meat tender).  There was so much fat, and it was fairly tough.  \n\nMy wife ordered the Chicken Portobello ($13.95) and got a grilled chicken breast (Dry) next to a stuffed protobello mushroom (burned).  I still haven't figured out what we paid that preposterous price for.   \n\nThe kids enjoyed their meals: a dry chicken breast for my son and a slightly overcooked burger for my daughter, but she mainly ate the fries (which were good!)\n\nThe shining star of the meal was the St. Louis ribs on my combo plate.  Smokey and just tender enough to eat easily without literally dropping off the bone.  Unfortunatly they no longer keep BBQ sauce at the table (you have to ask for it?!?!) and I used to enjoy mixing up the varieties to make new flavors.  \n\nThe food was disappointing, but what further bothers me is that had I been the waiter, I would never have served the food to my wife.  It was visibly dry and not terribly appealing.  I worry for the service industry when servers are expected to serve unappealing food rather than taking it back to the kitchen and getting a fresh plate (Bottom line restauranting).  \n\nAnyhow, I am not a problem customer, I just expect a little more for my money than I got.  We will not return, so I will have a new restaurant to review as we search for a good meal!\n\nEAT WELL!\n\nVic", "business_id": "KxJ5DRcSo83N-GW4f_gMQQ", "stars": 2, "date": "2008-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S4hxgsxvNmjv8dxIaI7Vyg", "review_id": "eePGdbbqruayA3UZKcm9jw", "text": "Don't have time and/or cute outfits for Madison but want an alternative to Cracker Barrel? This is your stop. I started with the chicken dumpling soup. Simply divine, so much as to seriously tempt my veg accomplice. Cheese curds were another hit, far superior to those from the state fair.  Wraps, sammys, even the fried mushrooms were consistent, wholesome, and fresh. Service was on point, our waitress Brianna was business pro.  People watching was a little poor(s), to be expected in rural Midwest? I think our impassioned debate over drug use might have startled the crowd.\n\nNonetheless, not a Cracker Barrel. Takes Amex.", "business_id": "uGykseHzyS5xAMWoN6YUqA", "stars": 4, "date": "2013-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IogfzsroIcVlUiTfepW9Cw", "review_id": "lP5CEkweGOUXX2b_DdHiEw", "text": "I have been a fan of the Boar for several years. They have a great staff and atmosphere.  Customer base is a good mix of young and old. A great place to chill with friends have a drink and play some bar games. They have darts, pool, touch screen games and volleyball.", "business_id": "c5awCF5eu0ZkxUf_i94uPA", "stars": 4, "date": "2010-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7B-kF_CjsufoyJvuqqiM9Q", "review_id": "25CjQQBXpzt_IdXPIJjEHw", "text": "I was in town for a wedding and my brother searched yelp for a 4+ star eatery. This was the only one. For a good reason. \nWhile it is agreed that the place is not very good to look at, the food and service was exceptional. The atmosphere was very typical to a college pub on a weekend, though it was not very busy for a Friday night. \nI ordered the Big Daddy burger and it was among the best I've ever eaten. It is 2 patties, I believe quarter pounders, standard toppings lettuce, tomato, pickles and (super fresh) onions, 3 types of wisconsin cheese, mayo, ham, summer sausage and bacon. All with a knife through the crown bun. All for only $11. The fried cheese curds were also the best I've ever had. The clam chowder wasn't the best I've ever had, but it's worth noting that they don't skimp on the clams. The kids ordered chicken strips, and devoured them. I sampled some gumbo, the prime rib sandwich and sweet potato fries off of my sister-in-law's plate and they were delicious as well. \nThe waitstaff was very attentive and friendly. There were televisions in the dining area as well as the bar area to watch the local baseball game. Heck, they even let me charge my phone b/c it died trying to find the place from my hotel. \nI suppose the only negative is that the women's bathroom was very crammed. My 13-year old daughter told me it was very small, even for her. \nThere were video games there too, but the kids wanted to get back tot he hotel to swim so I' can't comment on their quality other than they are there.\nOverall, the amount of food for the money is unlike anything I've ever experienced.", "business_id": "G1qUGBNYNS220jKlPAlFsA", "stars": 5, "date": "2015-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "xBFspiZeOn9D0-d16jCo_A", "review_id": "-5kUxMKbkM3AEN0km5r5LQ", "text": "The food is so-so (shaved prime rib), the service is fine, and it is very noisy. The price was fair for what you get.", "business_id": "O_Pu4mKGOqQVlmH07Zbnhg", "stars": 4, "date": "2015-04-12", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "P_WtIOu5w6KcsxyIyK4JGQ", "review_id": "-AXMwmmM5NLnFLZD8j2RYw", "text": "Well, The pie is good. The coffee is good. The restroom was gross. But they did have lots of parking. My breakfast was 75% correct. As the Yelp 2 Star rating says: Meh. I've experienced better.", "business_id": "yYIEKwgQUHJpySOcVdCAkg", "stars": 2, "date": "2014-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HkuMy1PgHxGK8AX_5FJ9Qw", "review_id": "tbkJDLYnqoS5tetgCH0Oog", "text": "Honestly, I can't see what the fuss is all about with Monty's.  It's certainly a staple of the Madison community, and the food is decent, but I find it overpriced, and the waits too long for the quality of the food.  Classic diner feel gives it a slight bump, but really, I think it's an average place, with average food.", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 3, "date": "2006-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S2sR5g_eU__Cr02fycB1PQ", "review_id": "U55krYrnYKhgKqBN2_CYdQ", "text": "Excellent food.  The biscuits are amazing, the fruit fresh and ripe, and I had the best piece of French silk pie I've ever had at this place.  I've only ordered breakfast, but they do have an expansive menu that includes a nice selection of foods (including vegan).  \n\nThe atmosphere is probably what stops me from going there more---it's just not my cup of tea.  The lighting is harsh and the seats can be kinda uncomfortable.  Last time I went, I was freezing!\n\nBut don't let that stop you.  There's an amazing bakery display case in the front that is worth a stop alone.", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 4, "date": "2011-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EAGBwp8SRfMvaNFudw0EoQ", "review_id": "WbsIz6UrMmrUQqCC4593NA", "text": "What an eclectic menu for a diner!  The ambiance is just what you would expect from a classic 60's diner.  I had a ruben and some fries and it was really good!  Most places use processed corned beef.  Theirs was real sliced beef...very tender and very flavorful.  Probably the best ruben I have ever had.  I had to try the pie too since they tease you with a great display right when you walk in.  The French silk was really rich and chocolaty.  Definately worth the stop if you are in the area or passing through.", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 4, "date": "2013-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "otlKqCHsCPYVOnM_BymyJA", "review_id": "Gxc03zga0afO2Jei57Unvg", "text": "This place has awesome decor. Great parking. Awesome staff. Mediocre food.", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 3, "date": "2014-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HnJfZj885y3lBDOMwIsP9g", "review_id": "IcOlBelxJfIqXVDiKngMMw", "text": "Update on July 7th, 2015: Monty's you never disappoint. Still in love with this place! :)\n\nVegetarian's/ Vegan's Eden ~ Many options to select from!\nI don't know why I haven't written a review for Monty's even after being here so many times but finally here it is...\nWhat we have eaten here so far:\nVegetarian Hash, Vegetarian Chili, Chicken in a Pie, German's Chocolate and all of their pies! (my favorite the Key Lime)\nTofu Scrambler - The BEST DISH in house. The best tofu scramble I have ever eaten. This is definitely on our every order.\nAnd their potatoes are one of the best I have ever had! What do you put in your seasoning?!\nI don't even have to rate each and every item because they are all so good!\nService: 5\nServers are always friendly, helpful, and fast!\nPrice: Absolutely reasonable.", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 5, "date": "2015-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V4U_aDvZOtdXnEkLCzO4yA", "review_id": "yt4f1kYlYWh76XrweGUOPQ", "text": "Extremely slow drink service. Each drink took about 10 minutes to get to the table. Food was just okay and after all the waiting and poor service we were given a bill of 64 dollars for one app and 4 drinks. My double skky mixer was 12 dollars. Aka a full price single simply doubled, which, as a bartender I can tell you makes no sense. After expressing our concerns, the manager came over and was nothing but confrontational saying that was just the policy and too bad. I said okay that's fine just run my card and he continued to explain things away when I clearly had no further desire to talk to him. Pretty brutal experience.", "business_id": "ykxf0XiJt-d76dBwfO_yew", "stars": 2, "date": "2015-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SX8OlSXjRNK2beTuFentZQ", "review_id": "N19YGjkPyuPrMhklXN3Ztg", "text": "Just left there without eating because our server was too busy talking to a table of people she knew and never even acknowledged us.  We sat there for almost 20 minutes just waiting for water or some acknowledgement, but got nothing.  Several tables right near us that arrived after us already had their drinks and put in their order with a different waitress.  On the way I stopped to tell the hostess who said \"I'm really sorry.  Have a good night\".  Very disappointed in the service, the number of tables that had dirty dishes on them, etc.", "business_id": "4pZeC9W0EIiBTOJMnwG2vw", "stars": 1, "date": "2015-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "obxSXAFS6CL2Ohz3xIM9cA", "review_id": "UkjwKrSYQbXIi3eDc3RGcg", "text": "I'm a sports nut so I loved this place. Indoor courts, memorabilia galore, and games for most ages. Food was tasty service was well above average. Can't wait to go back again.", "business_id": "yrBo3c3OTKVO4H1ttBxadw", "stars": 4, "date": "2015-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Vn0oU-A390Jw-Eh5BXRA6w", "review_id": "b0ieygawXENfEvwC-y4Gmw", "text": "The pulled pork! Lord Have mercky!!!! I can just eat it WITHOUT sauce! Tender, perfectly seasoned and just heavenly.  Im not all that crazy about there sauce.  I could almost run down to Lil Porgy's and get a side of there mild sauce. But again, I could just eat it naked! (the sandwich) LOL \n\nMac and cheese is good too!", "business_id": "0kRBRm5xOWclzemsLl9iQA", "stars": 5, "date": "2014-04-22", "type": "review"}
{"votes": {"funny": 5, "useful": 1, "cool": 2}, "user_id": "6uSW2qLSL5w0iz0g-Iwa-g", "review_id": "DIS56Tp5gSbVGC1lMdDc-w", "text": "Pretty much what you'd expect.  Way overpriced, extremely low quality food served by not-that-bright, fake-baked girls wearing shiny nylons, big puffy socks, and the most unflattering shorts imaginable.\n\nGreat if you're a perv from '86, decidedly not great for everyone else.", "business_id": "JhEA8qHfNmIh8c6OHXnaYA", "stars": 1, "date": "2008-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "wPJtYECbe7QpXnMx5MNjLA", "review_id": "n-QwhPAT52w9lEjlfz8Fdg", "text": "Location is good, drinks are usually on the strong side...HOWEVER, the rude service you can expect to receive here, far outweigh the positives.  Every single visit to the esquire, I received unfriendly, uninviting service.  The crowd in this place is 40+ and unless you fall into this category, the staff will make you feel very unwelcome.  Every trip downtown, I want to give esquire another chance, and every time I'm disappointed.", "business_id": "pPWre8lbVAssER6CN0uWMw", "stars": 1, "date": "2012-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Gp0olr_CLDOFC4NYn0h9gA", "review_id": "uWP0Nza09IGXzc0hg8dLgA", "text": "ever been to dick's last resort? you know, the restaurant we're the servers are intentionally angry and mean because its funny (kinda) and its the theme? well, this should be majerles theme cuz the service is horrid, horrid, horrid. ive never had even mediocre service there. in fact, most of their \"servers\" seem to lack a pulse...something that should be manditory for the position. how these people survive on tips is beyond me...americans are just generous people i guess.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 1, "date": "2010-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YJv4BQmAEmnkzCj0LLIqhQ", "review_id": "OufFaXuSUx3HaFWkHsYHJQ", "text": "Came here because Cooperstown was closed. Got a seat quick, sat for 20 minutes and not 1 damn waitress, with 2 or 3 walking around, came to our table. We just got up and left. For a place supposedly owned by a former Phoenix Sun, it lacks to impress... would rate it no stars if I could.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 1, "date": "2013-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eX77Ia71jAxA6BFb142eLw", "review_id": "ltJAr1KGpcaXG7DpdPXAlQ", "text": "Not bad, not great.  Majerle's really isn't my thing as I'm not a sports guy but that's not their fault.  Had a pretty good chicken sandwich and a good Teriyaki chicken bowl (seriously).  Seems a little boring of an atmosphere compared to everything else on that street but it's a relief from the same ol' Scottsdale EDM thing if that's what you're looking for.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 4, "date": "2015-05-22", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "fg5ibDkGYQPVYEx8ncy4Aw", "review_id": "wV4SJOCPt9W6QQ4C92cacA", "text": "I'm 67 years old and they wouldn't serve my wife or i because we didn't have our id's with us. They have crappy wings anyway.", "business_id": "qsWxbgQwuomXvMseg23DGg", "stars": 1, "date": "2015-03-14", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 1}, "user_id": "6r2lhM6J5-4H2fV6CyLIxA", "review_id": "iOCfDYh7s9bQ9MuJMejYvw", "text": "I decided to eat here for the first time since the line was out the door at the nearby Chipotle.   I tried their hamburger and chipotle Mac n cheese.   The burger is one of the best I've had in a long time.  The Mac n cheese was very cheesy, just the way I like it.  \n\nAdded bonus if you sit on the patio, you get to watch the Arpaio protesters across the street.", "business_id": "2I666dqzs1XB6xigIKa9bA", "stars": 4, "date": "2013-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bIS1zw9AAik4XPisRNxzUw", "review_id": "v1ntMSvcNb_QKx4600_sfA", "text": "Super cool location.  Food was good, not great.  Service was very good", "business_id": "1-1VcGTL3GyCqUpXZLFTZA", "stars": 4, "date": "2013-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "3gIfcQq5KxAegwCPXc83cQ", "review_id": "8bhv4SQvxDekA9CgrabZ6A", "text": "I came here with a group and I must say that the service was friendly and efficient considering the size of the group. The location, inside chase field, is very nice and you can see the park from the tables. The lunch specials were decently priced, including a salad or bruschetta.... but the food was nothing special. I had the bruschetta, French onion soup, and fries... everything was bit salty, but not terrible. Would I come here again? Probably not, but you could do worse.", "business_id": "1-1VcGTL3GyCqUpXZLFTZA", "stars": 3, "date": "2015-05-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "GhCA6N7sRYZHBr5QKAcCWg", "review_id": "GDb5yib70Dl1Yeqt7k022w", "text": "Thank you Marshall Shore for letting us know about this place!  We were a party of nine for Easter dinner last night - we filled the diner itself and ordered 1 of everything on the menu [2 of certain items].  There were 10 dinner items and 4 dessert items.  We passed the dishes down the counter to each other.\n\nThe menu is strictly vegetarian, but Payton keeps a few meat items available for hard core meaties - like my daughter and I who shared a heavenly fettuccine bolognese.\n\nEach dish was superb.  I have a really hard time deciding on a favorite, but I think I'll go with the Fava and Steuben beans served in agave nectar with a walnut pesto.  My wife and daughter are going with the Beluga lentils, parsley and celery leaf.\n\nWe had a tasting menu [no pairing] I would have been happy to pay $75 for and we got away with $20.\n\nUnbelievable.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2011-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-2gxrMHX8_F1Ep_ppWYTkw", "review_id": "Gc7Dhxb9q5z8QQXHrQawTg", "text": "Geez, I love love love this place. Love the hurricanes, the pulled pork, the fried chicken, the biscuits, the burgers, the gravy, the 'dining in a trailer park' atmosphere.\n\nThe only thing I don't like is that rave reviews are going to make it impossible for us to stroll in on a Saturday night and get a seat at the counter. But they deserve them.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2013-05-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Xq6QN6AnLnsAmuWECBujLg", "review_id": "oZfybnbT8Fu1PiUz1wOKSg", "text": "This place is amazing!  I had the whitefish po-boy and ice tea.  My friends had biscuit sandwiches And a couple cocktails, rave reviews all around!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2014-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rc2-rvh4GhcfaiNlZY0KkQ", "review_id": "zINbAyujKG4auvXab6Xcug", "text": "My boyfriend and I are so utterly in love with this place.  Their menu is genius and you cannot go wrong with anything on the menu.  The poutine and the mac n' cheese are my go to's whenever we go here.  \n\nThe seating is open and we love sitting in the 6-seater counter top in the old trailer they work out of.  Being practically an arm's reach away from the kitchen stove is awesome because you get to hear and smell the food cooking which is phenomenal. This is exactly what comfort food should be; greasy and flavorful and rich!  Another draw of coming here is where it is located.  Sitting on the street corner in the midst of older craftsman style historic homes and strung lights about their patio is so charming.  I love coming to this part of Phoenix, always great people-watching and fun atmosphere.\n \nThe staff here are so awesome and friendly and make the experience here that much greater!  I highly highly recommend this place if you are looking for amazing, local, FRESH food. \n\nJust come here, period. You won't regret it.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "10lzs7o5qhGix9AHBdtjBQ", "review_id": "kg0ZMpkLPxPPIyeFFIugkw", "text": "Chose this diner because of all the rave reviews and wasn't disappointed! Five stars for atmosphere, five stars for the awesomeness of food, and five stars for the friendliness of staff. Try it out for yourself, you will not regret it.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4I4D_g5nwdljik-2vhvDZQ", "review_id": "rS0hx9UzfRx9yddNuf-Qjw", "text": "Fabulous jack fruit po boy, and fried green tomato sandwich. This is also one of my favorite spots for cocktails!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TLjVeQYCu5scCBgaHdex8w", "review_id": "EiVFE-JMZj7I5vpwBJCPxA", "text": "We had the happy  opportunity to eat at this Coco's restaurant yesterday. It was in-between time (about 4 p.m.) and we had the restaurant to ourselves. The waiter was terrific, the manager was great, the food was hot and marvelous. We both ordered their spaghetti and meat sauce and we shared a piece of coconut pie (they have the best pie in town). We highly recommend this restaurant for family-style food, great for you to take your kids, neighborhood friendly. They need the support of the neighborhood to stay in business, and it would be great if you would try them out and have a piece of their terrific pie!", "business_id": "SZvYxcvYYVRue9MXcEDjsA", "stars": 5, "date": "2015-05-21", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "7cR92zkDv4W3kqzii6axvg", "review_id": "Fh-UdP-HZNzEM9zDMj7q3g", "text": "Had the hot lunch special, a BBQ pork sandwich, and potato salad.\n\nThe sandwich was tasty, but average.\n\nThe potato salad was a bit bland.\n\nI love MacAlpine's atmosphere, however, so I will definitely return.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 3, "date": "2011-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a_CLJ4ky525y7PkjMTvxWQ", "review_id": "3Q-7QNIwN3VQ254C3KPoLg", "text": "Been living in Arizona for almost 4 years now finally went too this place they have the best Reuben sandwich and also there potatoes salad and can't forget there awesome dessert . Great place", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 5, "date": "2014-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9BH6DpK3JbNHsYAqPdjjXw", "review_id": "q83WpM0Bj12UQq044TDzGw", "text": "The service at the drive in was extremely slow, and the person taking the order did not listen to the order.  Not only was my order totally wrong, but my drink was also filled to the top with ice leaving very little room for actual soda.  I will not be returning to this location as this is the second time I have had service issues.", "business_id": "po5FyERB4lUZNnBIwnhFlg", "stars": 1, "date": "2015-04-30", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Ovpa3S8xD96dLE5eDxcxJg", "review_id": "94H-MN7ASiftasmUyPN39A", "text": "No, thanks.\n\nI can't help but think of Office Space's \"Chotchke's and their pieces of flair every time I get sucked into going to Applebee's. The poor wait staff. \n\nAnd the food is just not good. It could be just an unfortunate coibncidence that of the seven or eight things I have tried they have all failed to impress me but somehow I doubt it. \n\nI don't like TGI Friday's very much, but of the two comparable restaurants, I much prefer it to Applebee's.", "business_id": "cjUmPLRT43wN9Z87A9BOpg", "stars": 2, "date": "2007-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HRSBM0DWNuQXuuSnytLHiA", "review_id": "1-KtNOC3WDp5LncSSmiVbA", "text": "I never thought I would rate a chain so highly but their burgers are absolutely delicious!  I got the Standard, stuffed with bacon, pickle and onions cooked 'pink' (not rare or well-done; just right). Super juicy on a perfectly toasted bun. I would have ate 2 if my stomach had room. Fries were good and french onion soup is above average. I would give 5 stars but they were short staffed and drink refills were hard to come by and they forgot our soup so it came with the meal instead of before which we made sure to request to avoid that. Despite that small inconvenience, the burgers made up for it. Staff was very nice despite being stretched too thin. Get the burger!", "business_id": "cjUmPLRT43wN9Z87A9BOpg", "stars": 4, "date": "2015-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GIcnw0ZhMuax96er2ZW8pg", "review_id": "vKoDeviQkhCTRmT1ioq-VQ", "text": "They messed up our order and waitress cane and apologized, she owned up to it.  Food was vreat.  Will continue to support this establishment even at 1 am.", "business_id": "FKHv7FkblONv9qqBndJUrg", "stars": 4, "date": "2015-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "87QxudT5h_9KyxT14ZMBow", "review_id": "MlOayN6svXWjxl2Gdv6G0Q", "text": "I stick with what works for me.\nThis location and the same meal is why I love Long Wongs.\nThe customer service is always amazing. The same employees have been here since I was a kid ( long time ago ;)\n\nTry the burger,4 wing combo, very filling. My little picky eater loves the pizza.", "business_id": "BT2Vls7h6sWrCKa5gGXbKg", "stars": 5, "date": "2015-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "9VPNlcKsL99FvKtz1r9qJg", "review_id": "CUHtJh2a0wMV3c_J2ikn2w", "text": "Okay, so I've not been here for any other meal than brunch, because I am absolutely in love with the corn griddle pancakes with chicken.  My boyfriend always gets this too, so I've never tried anything else.  But it's awesome, matched with a mimosa, guaranteed the rest of your Sunday will be wonderful.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 4, "date": "2008-05-12", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "M19Jq3y0XqCb3DOGOke7Sw", "review_id": "xjStvhQGgTgCS2WBhtRK0Q", "text": "We were visiting Phoenix and needed somewhere to share an Easter dinner. Found the Phoenix City Grille on Yelp. It's high marks are spot on. The staff was very helpful and friendly. They maintain a family run atmosphere (working in a family biz  I appreciate that) and the food was perfect. Even some of our more picky eaters were excited about their meals. We had six very satisfied diners. It is always a good sign to leave a restaraunt feeling elevated by the experience. P.S. the corn cakes really are incredible!", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 5, "date": "2012-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "IkC2BKzADqgPlvaac5gRHg", "review_id": "EaAAwhBQ1dAgjtFkDX0XlQ", "text": "Great place for a work lunch! There weren't a ton of vegetarian options but the ones I tried (appetizer and entree) were both excellent and I'd happily eat again. Like many other Yelpers recommend, the crispy eggplant appetizer is really really good. Perfect balance of textures and a really great combination of flavors. I also had the season vegetable plate which contained a variety of roasted vegetables like cauliflower, carrot, and potatoe served with a lemony aioli which was perfect and spring-like. On another visit I got the crispy eggplant sandwich, which is like the appetizer but super sized and served between two delicious brioche buns. Both entrees are fantastic! Service was great and the space is nicely lit with a lot of natural light. It's just a little bit on the pricey side.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 4, "date": "2015-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1wm3TVVuPh5ICMC8uT-38w", "review_id": "69a-Hr_GCC9bqJXFROT1DA", "text": "My husband and I do like good wings and as we're in Phoenix for a couple of months we looked for somewhere that offered some tasty wings. The Armadillo Grill certainly provided them! The Armadillo Gold and the Honey Hot were absolutely delicious, the asian slaw that came with them was a tasty take on a traditional favorite.\n\nThe staff were very pleasant and all in all we had a great happy hour!", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 5, "date": "2011-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z4xZrZi_AMtOR6I24dPrHQ", "review_id": "f9mBOfluMvla9c4iEdeinQ", "text": "I went here for lunch with a colleague. They put us in a back booth which was perfect - quiet enough for us to get some work done. He had the fish tacos and seemed to enjoy them. I have the palette of a five year-old so I ordered a chicken quesadilla with refried beans added. It was delicious - way too much for one meal. The server was attentive but not overbearing. I was a little concerned about parking because that's an issue for a lot of restaurants on that strip of Camelback but since we met there at 1pm on a Friday, we had no problem with that.", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 4, "date": "2014-03-08", "type": "review"}
{"votes": {"funny": 2, "useful": 7, "cool": 5}, "user_id": "4_YfcfHkCem1onJFkItxjA", "review_id": "ecI-EQeSVV2KT0zPQ9DSbA", "text": "This is easily one of the best if not THE BEST happy hour value in the Valley.  I hold Caffe Boa very highly in that regard too.\n\nI was a regular for McCormick and Schmick's happy hour in Downtown LA.  Since moving to Phoenix, I seem to forget it's even here, in it's hidden Esplanade office tower location.\n\nFive appetizers are $1.99 and another handful are $4.99.  Their claim to their happy hour fame is the 1/2 pound angus burger.  The Angus burger, which comes with steak fries, is decently sized and pretty good for $2 bucks.  Not the best burger I have ever had, but good considering the chump change you pay, it's a steal. Bobo and I splurged and ordered enough food for everyone in the bar, where you could just about hear a pin drop.  The calamari strips and grilled salmon cakes were pretty good too.  Bass and Hef on tap are $5 each.\n\nGranted we were also there at 9 pm for their reverse happy hour, (which is another added bonus) and watched as the last of the douchey corporate expense account 24th and Camelback crowd dwindled.\n\nService by the outgoing server Teresa was solid, and if you're even remotely in the area, I highly suggest it for some good cheap fun post-work.\n\nIf it wasn't for the happy hour it would probably be a three star place for the corporate seafood chainey feel.", "business_id": "MU3i2uEyUBntebU6pEyMbw", "stars": 4, "date": "2008-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mO8Rliju_qv_CnXiht8hjg", "review_id": "XOGZBye-WQ1vjSAfphBksQ", "text": "because of work and school I did not get chance to go since last year.today I went to macy's exchange something and close by Californian pizza kitching.as usual the avocado club egg is the best.I did take out serivce was great the girl who doing register is very nice.over all good food and good customer  service,I love it！", "business_id": "ut-kla-EA23nJOij_dcL0Q", "stars": 4, "date": "2013-04-03", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "Ofxlhi_HKp7myFDpwg9aIA", "review_id": "h7I7VvA-eIUFZrX1wsG0vw", "text": "Top Notch. I went here with a friend, after a nice early evening of window shopping around the biltmore, looking at things that I would either never buy because they are hideous or just way over priced, but I must say the biltmore is so choice because it brings out the finest people... and oh how I love to people watch. So after a rough day of browsing. Enter stage right the Cheesecake factory.  I don't exactly remember what I got, but I do remember sitting at the bar. The beer was really really cold which is a huge plus for me, the food, whatever it was was delicious, and the service was excellent. I will say I had a great time, because some how the next day I ended up with a cheesecake factory pint glass in my freezer...and I know I didn't get this at the novelty station. :) In any event I am giving this place 5 stars! I would suggest going there if you can for good spirits good times and good food.", "business_id": "2r8jGeuYvMkyP2ik_X-Bxw", "stars": 5, "date": "2009-04-22", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "CYHX8nnPoqclfWSsl1JWnA", "review_id": "Lnkn9jUiOqHTGDBitYsxQQ", "text": "Loveeeee loveeeee.. you can't go wrong here, everything on the menu is awesomee!!!!\nThe Louisiana chicken pasta is a must, but minus the chicken cause I'm a vegetarian, hehe. The skinnylious   veggie burger was phonomal, with their house salad on the side. Great vinegar sauce, ugh I can write a whole list here. Haha.\n\nThere mai tais, yummy.  Sex on the beach. ;)\n\nRED VELVET CAKE IS AMAZING!!!!!!!!!!", "business_id": "2r8jGeuYvMkyP2ik_X-Bxw", "stars": 5, "date": "2014-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mU0dwPiL0wT0j3mBNqGbFg", "review_id": "DaGHlpo1f3om2ReIYPaoNw", "text": "Love this location. The biltmore is a nice place to stop on my way home from work and I always stop in for at least a piece of cheesecake but the food is great here too. They have so many different options. Mexican, Italian, American delicious.", "business_id": "2r8jGeuYvMkyP2ik_X-Bxw", "stars": 5, "date": "2015-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tbGpaY8AFjxsZJU4Eubbnw", "review_id": "lG3MhthreiWql2xBoenqZA", "text": "Most definitely the dirtiest Chili's I've ever experienced, inside and outside. The patio had cigarette butts, a dirty ash tray filled with water from the misters, bits of trash strewn about. Inside tables were left dirty, the bathroom was filthy too. \n\nMy food was cold and dried out like it had been made for someone earlier and then left under the warming lights.\n\nBecause I was in polite company and we were in a bit of a hurry I didn't sent it back.\n\nI am quite shocked that I didn't get sick after eating there. \n\nBoth the health dept and corporate need to make a surprise visit.", "business_id": "YSQnaRE4Le6CaonZICFyVQ", "stars": 1, "date": "2013-05-06", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "DrWLhrK8WMZf7Jb-Oqc7ww", "review_id": "_DW4bXrCFnCCjU-jTr4fsg", "text": "Ok, now I went back and tried the dinner specials and the food is pretty impressive. On Wednesdays in May, they have 4 choices for $11. I opted for the 1/2 rack of baby back ribs, which were very good with all the meat falling off the bones. The Southern BBQ sauce was excellent also, more on the sweet side. Side dishes were an interesting version of cheddar potatoes. It was a hash brown cake that was crusted over nicely with cheddar running through the middle. A good, solid rough chop cole slaw was also included.\n    Bartender was nice, but she talks more with the regulars (which appeared to be everybody, but me that night). Still, her looks overcome her personality, so no worries on that front.", "business_id": "rVUEZpHQfWI_3kt0lBwaxQ", "stars": 4, "date": "2013-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ywv9mckCATd03_v-ZcH2-Q", "review_id": "bcYe7DEeeXV7URe9oIhiqQ", "text": "Jt's is a fantastic neighborhood bar. Full disclosure: I'm a regular there. This is not a fine dining establishment, but the wings are the best in town, and the rest of the nightly specials are definitely worth trying. Go in and check it out, but leave your attitude outside..we are all friends at Jt's and you will be welcomed by all. Oh, and the drinks are strong and the bartenders are awesome. Tip: don't order a frozen drink. It's not the place for it, and I don't think there is even a blender anyway. Try Applebee's instead.", "business_id": "qz4ZOcv-840UjfCEYI4qZg", "stars": 5, "date": "2013-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lCq45LZbHpZXD72GJ7YOXQ", "review_id": "C7S9HdV5TtwovuJUaGhuaw", "text": "LOVE THIS PLACE. It is not pretentious but rather a great place to grab a bite with people who are glad to see you. Friendly staff, sometimes Wally will actually greet you and get your drinks. Great menu with salads and typical pub style fare but also awesome salads. Always recommend you ask about the special of the day. There are some great ones. \n\nI have not been for happy hour, but I will admit, the beer on tap and whiskey selection appear to be enough to satisfy any happy hour need. \n\nBy the way, Tuesday is Ta-tor Tot Tuesday & the sweat potato fries can make it a toss up. So check it out...you will be back.", "business_id": "To5CjntVFawXM_hpAhvVdQ", "stars": 4, "date": "2010-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "o9CxwfR5BIvyy7uR8ujadw", "review_id": "iBLWW4eWq2faeQ7Sn78TNw", "text": "Awesome food and service. Don't pass this place up if your in the area. You will regret it.", "business_id": "To5CjntVFawXM_hpAhvVdQ", "stars": 5, "date": "2015-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jm8S2APwICr1Z4fhD-A-UA", "review_id": "6F8Oe3h6UCGekubFnSYRrw", "text": "Came here with a huge group party for the evening event portion of a conference I was at.  It was definitely not what I expected, and really a pretty neat place!  As others say, the view was phenomenal and the atmosphere was great.  I would have loved to have been there for dinner on a normal night, since what ruined it for me was the size of our group and the way that the dinner was served (buffet-line style, only by the time you got to the end of the buffet line you'd eaten the food you got at the last station - rinse and repeat, so you never really got to sit down).\n\nThere were plenty of nice, intimate places for people to gather though, and I liked the tiered outdoor seating areas.  The bartenders had a great sense of humor and everyone had a nice time.  The other staff were friendly as well.", "business_id": "3Zsjlum5kl5N5KV712aTMQ", "stars": 3, "date": "2011-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "yzG7qvuLG73CvzxDMDizvQ", "review_id": "fcv_0R7QsGDtdmrZ8b7v9Q", "text": "I have put this one off because in my three visits to this restaurant I have had widely diverse experiences.  (See Pointe Hilton Tapatio Cliffs Resort for my hotel review.) The primary differences between my experiences at the restaurant seem to center around the volume of people and the time of year you go.  The service AND food were much better during off-peak season.  Phoenix is a very seasonal city and the restaurants and hotels are sometimes overwhelmed when peak season hits in February.\n\nFirst of all, yes, come for the view.  And if you want fancy, this is where you go for fancy.  So don't get all worked up because they don't have a ribeye or burgers.\n\nYou are mostly paying for the view and the ambiance, and both are wonderful.  If weather permits, ask for an outside table when you call for a reservation.  \n\nSecond, prepare for the expense.  Dinner is about $29-$45 just for your entree, and the wine, while excellent, is commensurate with the food prices.  \n\nI have had the lobster bisque, which is out of this world, and the pan-seared diver scallops, which were average, as appetizers.   The lobster bisque is, of course, really super rich and fattening, and even though I wanted to slurp the whole thing down (which would be frowned upon in a place this upscale) I controlled myself, but I still felt like I was going to pop by the time dinner came.  Maybe share one with a friend.  (It was worth the popping feeling.)\n\nAt my first two visits here, the bread came out early and was delicious.  At the last visit, I had to ask for it three times and just gave up when it still wasn't there when my entree arrived.  The three sauces they bring with it are all yummy (again, fattening).\n\nIn my continuing quest to reacquaint myself with my hip bones, have tried three of the four salads, including the hierloom tomato carpaccio (tasty and light but nothing out of this world), the crisp apple and micro herbs (much more interesting and really delicious), and the blood orange and rocket arugula (very tasty and interesting).  Salads will run you from $11-$13.\n\nAt $43, the filet mignon was probably the tastiest entree I have had there, and it was well prepared and had cooked to my picky little specifications.  One time I had the Chef's feature, which was sea bass and was delicious.  I tasted friend's plates and the pork tenderloin was really quite good.  Another friend has the osso bucco and said it was good, but I really wouldn't know as I don't eat baby lambs.  \n\n I have had the scallops as an entree and found them to be mediocre at best.  I actually felt pretty ill after eating them for dinner, but again, that was a very busy night and they fell down on all counts that night.  I would have given them one or two stars that night, while both other experiences were at least a three or four.  \n\nI am not a big dessert eater (again with my missing hip bones) but we did the wine and chocolate sampler one night and it was fun enough and interesting enough to be worth the $16.  I shared that one with three friends.\n\nIt is worth a visit, especially if you are staying at the resort and have budgeted for an expensive night out.  I would, however, suggest you go very early if you go at peak season, and try to avoid a very chaotic rush.", "business_id": "3Zsjlum5kl5N5KV712aTMQ", "stars": 3, "date": "2013-04-01", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "_BXqCo1y8XzQKnOQBq17MQ", "review_id": "6qNpvldde2GO7j9aWOOxxA", "text": "I would give zero stars if possible. Four mix-ups before we could even make it to the table. Staff was rude, unhelpful and uninformed. We flew in from Detroit and made reservations over a week in advance to ensure a memorable evening. It was memorable, but definitely not a positive one. We will not be back. I recommend going to Top of the Rock instead.", "business_id": "3Zsjlum5kl5N5KV712aTMQ", "stars": 1, "date": "2014-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "tV1LKO9WglgeCEIB42dvvQ", "review_id": "tZzTb4E9e5K5XS5oYCnAaQ", "text": "Amazing View, great food, first class service. Thank you for making my wedding anniversary so special!", "business_id": "3Zsjlum5kl5N5KV712aTMQ", "stars": 5, "date": "2015-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bCI2AMNWOEyXckLhlHUlAA", "review_id": "8NUGWMCwa6eJzW2ATFrnIA", "text": "Usually hotel restaurants are overpriced, overrated and not very good. The Lantana Grille could you be your exception. \n\nAlthough we only ate the buffet brunch every morning at the Lantana Grille it was amazing! Usually at buffet brunches the selection of foods is limited; this wasn't the case whatsoever at the Lantana,. \n\nThey have a chef who can prepare you homemade omelette's, french toast, pancakes, waffles or Belgium waffles. They have a nice array of fresh fruit, pastries, yogurts, morning meats, eggs, potatoes to go along with the BEST granola I have ever had. The granola had mango's, banana's and pineapple in it and I made sure to eat a hearty amount of it every morning. \n\nI would highly recommend starting your day here if you are a fan of breakfast.", "business_id": "faitVIiNezSN0ogZQSZPWQ", "stars": 4, "date": "2009-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "CJOjw2P9zkPxOnnmrY6KjA", "review_id": "maJ7aQzxeig1H4o3Nvgtxg", "text": "Like some of the other reviews, I initially went to the Wagon Yard because of a coupon (you guys should print more, looks like it brings you business!).  We've been a few times and the food is probably a 3 overall, it really depends on what you order.  The service staff have always done a good job, but I think we always get the head waitress (or is she the owner?).  But the place is just cool, so we keep going back.  If you go later on a Saturday evening, they have karoke and the people are actually pretty good.  They have a crowd of regulars, who want to make sure you feel welcome.  It's mostly an older crowd (I'm in my 20s), but on an evening when you are just looking for some chill entertainment, and if you love country music, check this place out.  It's like going to the Buffalo Chip in Cave Creek before everyone found out about it.   And not having to drive so far.", "business_id": "JImJictLIE48_O1z-l2TGw", "stars": 4, "date": "2009-03-18", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "67QGJdqABqaSEsQR4esrsA", "review_id": "BloBTdtDKiZ_G9N-ArWS0g", "text": "First off, like what Daren below me wrote, there are 2 Casey Jones's. One offers up free UFC, and this one offers up an incredible local beer selection , and some decent food to go along with it. \n\nIt's a sports bar, and it does it well. And they carry everything, including stuffed pizza sticks, nachos, and my personal favorite, fried cheese curds.\n\nYes, fried cheese curds. Balls of wonder. \n\nGo for the beer, the tv's, and trivia on Thursdays. \n\nParking is horrific.", "business_id": "vFJmFFfPVhHkC3bWOeZnNA", "stars": 4, "date": "2011-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "ky9pQ8AKufvZ63IxR41jGg", "review_id": "TkNaZVstjBMaJCqZFIHjow", "text": "I went to Islands this past weekend looking for a Turkey Burger...and man they did not disappoint. They substitute all of there beef burgers with Turkey burgers if you like...and man i was so happy to hear that because i don't eat red meat. They have 12 burger selections along with various other items...but the burgers are what you should go for when coming to Islands. I had the \"Big Wave\" burger with Cheese...it also comes with Lettuce, Tomato, Onions, Pickles, and Mustard. It is a huge burger..and it comes with fries for about 9 bucks. When i want a great Turkey burger now...i head straight to Islands Burgers...please go pay them a visit.", "business_id": "hNVcBhJSD5HyLKMf_Z7TaA", "stars": 4, "date": "2010-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "UNIPxnKpzAbL4iSIXSQ31g", "review_id": "aIITwSzhq2Qsr3OLs-2nMg", "text": "This Boston Market is the best location I have ever been to, and I have been to all of them in Phoenix and several in Chicago.  The people are SUPER nice, clean cut, and always smiling.  The food has always been top notch; hot and fresh!  It's like a home cooked meal from a family member.", "business_id": "F5vKD7ajS69CwuFyBVxA_g", "stars": 5, "date": "2015-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "zur5s4G5CTalLJ_48kEF_A", "review_id": "OKnCfv-8rnYdwAJoP412rg", "text": "Eggs Benedict were good not great. But the staff was very friendly and attentive. Good american breakfast place. Close quarters for seating, reminds me of being on a ship. That's a good thing, because the quality of service also is cruise like. I will be back.", "business_id": "2RxIERKZi5gjLW76MkFotQ", "stars": 4, "date": "2012-03-30", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 1}, "user_id": "GpVuiLQA_yLzG7hInLpa9Q", "review_id": "2Z_j0DyjSQrmNO4QmDLsuQ", "text": "I'm just going to grade this for what it is... A hotel bar in the middle of nowhere if you don't feel like taking a cab somewhere cooler.  I, for one, cannot stand being confined to my hotel room for hours.  I happened to be staying next door at the Courtyard and decided to go for a walk here to see if the scene was any more entertaining than the atmosphere there that can only be described as the result if Starbucks and a hospital decided they were going to combine thief boring forces to make a bar (if you're staying there, you know what I'm talking about).  Thus, I was excited as I wandered the hallways of the ugliest Hilton hotel I have ever seen to hear the chatter of men and women having a good time.  As i turned the corner, I was even more excited to find myself in a dimly lit sizable full bar with 6 flat screens in sight from my perch on a high bar stool as I write these run on sentences.  ;)  I'm not a hockey fan, but with no other sports in season, I'll take it.,  I'm not eating yet, but the menu looks like cheesy southwestern food - good enough if I pound a few more salty dogs from the friendly bartender.  Well worth the 100 yard walk from the Courtyard.", "business_id": "avvNnkpGpGIS-2CClsduXA", "stars": 4, "date": "2011-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "IldNKx5L8unlcv3LBSs-_g", "review_id": "W-vMDdS4qehLAE1rHrRdXg", "text": "The South Bank Grill is a great little lunch spot. Don't blink as you drive down 40th Street, or you'll miss it between the junk yard and the industrial complex.\n\nThe interior is an eclectic mixture of sports memorabilia (go Bears!), circa 1986 wall art, and kitchen decorating on a dime. Tables and chairs mostly match and are of the church basement variety. You'll also find a pool table here, but no play until after 2pm so that customers can lunch in peace.\n\nThe menu contains a standard bar and grill offerings, and everything I've had has been quite good. The salads are huge with fresh toppings, though I admit I wasn't a fan of the sherry vinaigrette and had to turn it in for ranch. I've also tried their pierogi special, which was as authentic as I'd find in the Red Apple in Chicago (but less greasy).\n\nThe staff are the best part of this diner. My waitress was happy, funny, and very attentive. I'm annoyed by waitstaff who show up when I don't need them and hide when I do, but our server was perfect. I'd recommend this place because of her, even if the food was bad.\n\nPlenty of parking available off street. They also have a full bar for afternoon meetings. They can handle groups of up to 6 easily, but if you bring more, show up early so you can find seating.", "business_id": "bbiV-lPmRaK_gjzE77x_jA", "stars": 4, "date": "2009-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bj5zkTUi39ihXOv6FchSsg", "review_id": "pUVYWEUjbniq4wAAYxZuqA", "text": "Don't waste your time. I ate breakfast at Morning Glory Cafe today and it was not tasty and was overpriced. The dry, brittle scone was $3, a cup of serve yourself coffee was $2.50, and the \"herbed buttermilk biscuit\" was dense and hockey puck-like - not the soft, buttery kind of biscuit you would expect and could call buttermilk. My friend and I each spent $21 for breakfast, a non-alcoholic drink and a scone - pretty pricey. Sure, the atmosphere is nice but who cares when the food is boring and overpriced?", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 2, "date": "2008-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iyh_RJnD2RqOw_yyviRxUg", "review_id": "FdBMiYbpGS1rcXDpoRb3QA", "text": "Great outdoor option for Phoenix people", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 4, "date": "2013-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mkUACmt3PkvqVKY2PZ40Vg", "review_id": "pqy534WdP0vqE5nJUc4w7Q", "text": "The Morning Glory Cafe is absolutely gorgeous.  The food portions filled me up halfway through.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 5, "date": "2014-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "PsCdDRibpo6y2d4F7Jz9ZQ", "review_id": "d95aop89sr3smhAlUY3p-w", "text": "I've read the reviews and I liked what I read. I never have the weekends off. My daughter and I both had Sunday off so the first thing that came to my mind was to try the food here. The wait was about 40 minutes which is a good thing. People will only wait if the food is good. I am not a breakfast person but I did enjoy my breakfast at the Glory Cafe. I had the chef seasonal special which was eggs with some really good sauce over it with potatoes. My daughter had the breakfast sandwich. We shared the food so we got to try both. I would go back", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 4, "date": "2015-04-13", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "yXTenhoJVQqK3-cKq6OKMw", "review_id": "5LPpTdTSLtVD163l-4oxnA", "text": "Average food, but expected. Service slow and inconsistent. Air temp in restaurant about 60 degrees do bring a light jacket.", "business_id": "lq2iZK7epi23byzcejjqTg", "stars": 3, "date": "2014-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GSZebDbIf0h_2MFv8xBGrw", "review_id": "Uw1g5lcwThqXshvK-AVifw", "text": "I've been to Keegan's a few times, and I would like to give this 2 1/2 stars bc  it is exactly a middle of the road kind of place. The food was fine, atmosphere normal, drinks were drinks. Nothing stood out to me, but there was also nothiing wrong. I wouldn't suggest it if friends were getting together, but if someone else wanted to go, I wouldn't mind. (but I wouldn't get the nachos)", "business_id": "SgTjnyElc26gPUghVuCuSQ", "stars": 2, "date": "2011-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZUUeGcB1GCmZZYimuXrwCQ", "review_id": "5ioIw6MmDqU2WTtiZBQHQQ", "text": "Server still not liking my gluten-free questions. I try to research prior to not ask and I swear I keep it simple! I added a star because service was better even though not the best. Yelp stated closed at 11pm. They closed down at 10pm so just an fyi. Cheesy potatoes rocked!!", "business_id": "SgTjnyElc26gPUghVuCuSQ", "stars": 3, "date": "2015-05-02", "type": "review"}
