{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "ukrBUZXE5K1J57FI7ve_RQ", "review_id": "IZV_2jOecy8LY_CJPkjzuw", "text": "If you look at my Yelp reviews I NEVER give 1 star, but this was the worst costumer service experiences I've had in my entire life. The entire staff was rude. They made us feel like it was such an inconvenience. From lady at the reservation desk who frowned, snarled, and barked commands like we were in a prison, to the embittered woman who was supposed to help run our insurance information, this experience made me feel belittled and terrible. \n\nBefore arriving we checked with our insurance companies that America's Best would honor our insurance, but when we got there the lady said that they do not take our insurance. After BEGGING and PLEADING that they call our insurance company she finally did and while frowning told us that she was wrong and they America's Best actually did take our insurance. \n\nWe were so disgusted with our experience here. We called the corporate office (something I never do) afterward and told them that when are contacts arrive we will not go back to this location. The people at the corporate office were actually really nice and had them shipped to the North Hills location instead. When we went to pick out our contacts at North Hills the staff was very pleasant, but it was too little too late. The downtown office has ruined America's Best for me forever. Honestly, I have been telling everyone I know never to go to this sub par establishment.", "business_id": "gX96CYY9T3K-jiippnnXDA", "stars": 1, "date": "2014-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tWanwwO995Na9Rt27hKUIw", "review_id": "m1ivxyGO44vR8Y1RXU0DsQ", "text": "I have been going to Carmel OB for a while, but today had a wonderful experience. I called with a bit of a panic and dr.roginsky med assistant called me back after hours and quickly gave me the feedback and the info I needed!!! Thank you!!!", "business_id": "1I8gEdZk3itKxzIejjG-aQ", "stars": 5, "date": "2013-05-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "V-xWBJJzY-k-Id8Zbzu14w", "review_id": "kaGjut-tAcONpWn2raA93g", "text": "After my dad was admitted to the hospital, I had the pleasure of meeting and talking to Kara, the head nurse.\n\nOut of 50 nurses, I can count on one hand the nurses who can identify Hypothyroidism and what to do about it.\n\nShe took the time to talk with my dad and explain the test results that showed his Thyroid Stimulating Hormone (TSH) reading was about HALF of what it should be.\n\nThe doctor put my dad on Synthroid, which is a CHEMICAL and NOT natural Thyroid drug, but at least they identified the MAJOR reason he was admitted to the hospital in the first place. He will be switching to NATURE Thyroid once he gets out and can see his NATUROPATHIC doctor.\n\nP.S. Anyone admitted to this ward should check their body temperature, If it's below 98.6 then you have Hypothyroidism. \n\nAsk the staff to do a FULL BLOOD TEST  for Hypothyroidism. \n\nTSH\nT3\nT4\nReverse T3", "business_id": "r1sLMV2DfDfJZ8HJMzKhow", "stars": 5, "date": "2012-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "oT6XHjvPHmQ0EdQpuOHrPQ", "review_id": "-teXV6H730i-N7C2ohPl8g", "text": "It's a pain to have their prescription refilled. One out of 10 calls to Elisa (Tana Frumento's refiller) goes through, but the rest of the 9 calls go to voicemail and she never gets back to you!", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 2, "date": "2013-04-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ovpa3S8xD96dLE5eDxcxJg", "review_id": "UAtEhT1FA0bF2SluvP8VbQ", "text": "Sports injuries (or injuries of any kind, for that matter) are no fun. \n\nI had a surgery on my ankle when I was a senior in high school and my sister was in and out of the OR with knee problems for eight or nine years.\n\nDr. Zeman handled both of us and it was as pleasant an experience as it could possibly have been. Mine was a one time and out, once my physical therapy was over my ankle was healthy and it has been ever since. \n\nMy sister's repeat injuries were a result of her continued participation in tennis, and then a reflare from a ski crash. Dr. Zeman was always helpful and courteous, and he even was flexible with his schedule to accommodate us, which isn't common among sports medicine docs. \n\nMost definitely one of the best in the valley, if not country, and easiest to deal with.", "business_id": "ZPkomfeRH2pflacWf7U3-A", "stars": 5, "date": "2007-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "eHowibQMqmWR9xAN1ZgRTg", "review_id": "7XK_F0zNLzF7uD6sl2dFoA", "text": "I had custom lasik at the Lasik Vision Institute 4 days ago.  The staff and doctors are wonderfully polite and fastidious.  Both doctors answered my questions and so did the staff..the staff even gave suggestions to things that I would have never thought of until later.  I went in for a free consultation and ended up getting same day surgery which was amazing because it was a busy day.\n\nThe procedure itself was not painful at all - it felt a bit odd - but it was quick.  Post \"op\" I had some fogginess and about 4 hours of discomfort which is supposedly normal.  I had lasik at 430pm and by midnight I could see clearly.  small objects were still a bit misty but I anticipated this because I have such a high prescription.\n\nIt has been 4 days and my eyes improve daily.  I ran errands yesterday and could see better than my brother who has never had glasses.  I have worn contacts and eyeglasses for 25 years and this is the most liberating thing to happen to me.  I am looking forward to my 2 week appointment and I would suggest this place to anyone.  If you go in thinking you will have same day surgery know that you cannot drive yourself around and you will need good sunglasses.\n\nBased on reviews I read on here of people who had lasik I expected quicker results but everyone is different and I still have great results they are just coming about slower.  But I'll take this over dry contacts and slippery glasses any day!\n\nAlso, the pharmacist took 2 hours to get my prescription filled for the 2 types of eyedrops post op - so call that in pre surgery.\n\nThank you Lasik Vision Institute!", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 5, "date": "2012-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jannRZLaCPUTrXnqSb3nhA", "review_id": "EfIqoLhXgJY1I2-kJYSpsA", "text": "This place just has terrible customer service. I was in a horse back riding accident and called to see if I could get in today as my pain has been getting much worse. I work part time and I am a student so it is difficult for me to get in on the weekdays. I called on Saturday to see if I could see a doctor and was told that \"they don't do x-rays on the weekends so ill have to come back on Monday.\" Monday is a holiday and I am in pain. No help offered whatsoever by the person taking appointments. So thanks. For nothing. I also saw Kate Montgomery awhile ago and wanted some tests done on my blood. She acted like it was a burden that I was even in her office, and like I was stupid for thinking I had something wrong with MY OWN BODY.\nShe just wasn't pleasant at all and I would never see her again. They also charge an annual fee for having you in their system that isnt covered by insurance. There are so many better practices out there I don't think Ill be going back to this one.", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 1, "date": "2015-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0mlo3g1FgMxK9VYHxDNSow", "review_id": "RsNRFbf2vDG3nyjntOoWTw", "text": "Dr. Keightley is a hidden jewel in the valley. Very smart and knowledgable.  Small office with staff. You are actually seen on time!!!!! My 4 year old and Myself are going through allergy shots and the nurse does a great job with both of us.", "business_id": "ofQCymLeEmWpTQvx3YYwPg", "stars": 5, "date": "2015-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "jeLW8ernpsi9QjKtSeUhng", "review_id": "BCFk3dCCuNVqAumYndyJlg", "text": "Love Dr DeSanto and his MA Esther. Lab Corp lady in here is great too! All the NPs I've come across have been wonderful too. Been coming for 4+ years.", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 5, "date": "2014-05-08", "type": "review"}
