{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "trYPAmnPz6ChpIgx0jGbyg", "review_id": "DuTV6MVj5qjTJTlpwlUsBw", "text": "I got 'new' tires from them and within two weeks got a flat. I took my car to a local mechanic to see if i could get the hole patched, but they said the reason I had a flat was because the previous patch had blown - WAIT, WHAT? I just got the tire and never needed to have it patched? This was supposed to be a new tire. \nI took the tire over to Flynn's and they told me that someone punctured my tire, then tried to patch it. So there are resentful tire slashers? I find that very unlikely. After arguing with the guy and telling him that his logic was far fetched he said he'd give me a new tire \"this time\". \nI will never go back to Flynn's b/c of the way this guy treated me and the simple fact that they gave me a used tire!", "business_id": "b12U9TFESStdy7CsTtcOeg", "stars": 1, "date": "2013-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ihC1T8TkW3QTVAUmkz5odw", "review_id": "gMxUpsoitNg5VdszO6TL3w", "text": "I will never go anywhere else. Never had a shop tell me what I didn't need.  Treated my mother the same way.  Women if you looking for a place where you don't get ripped off, this is your place.  He is always busy, so he does not have time to add stuff on and just working with he is more worried about doing a good job.  I highly recommend this shop.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2014-04-04", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "4BWGVJEqqOnihPxnZbuEzQ", "review_id": "ksQGy51Dp7_7_tuEwLceCQ", "text": "So one of the tires on my car had been getting low air pressure. I eventually took it to Mr Tire after the favorable reviews. Given that I found out that my car had a total flat on a Sunday and there are very few places open that service your car I went here. I will say that I got really good service, although I had to basically leave my car here for the rest of the day so that it could be looked at.  After a few hours I got a call and was told that my tire was salvageable and that it would only cost me $25 which is not bad at all. I was able to pick up my car before 5pm (their closing time). They also provided good advice to my husband who helped me drop off the car, which really scored good points with me. I had good service and my tire is still up and running.", "business_id": "H27egCbna1FH8X8HFpLD_A", "stars": 4, "date": "2015-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L3P4kURj4-AZYPZw7fkXYw", "review_id": "B2A_RhFfYBCc2W8GdjzopQ", "text": "Purchased an Outback through Elizabeth Z at the Independence location. Overall, it was a positive experience. We had to schedule a tow hitch to be installed several days after the purchase and it was done in a very timely manner. They offered me a loaner without me even having to ask.", "business_id": "gdaFZvWpmWIDri1Fv9PEHA", "stars": 5, "date": "2013-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IYVsx-J8hWclLMVav0eitw", "review_id": "UagYWqdS85suNZDinmENbA", "text": "Gary is awesome at each turn.  We had to have the car rekeyed due to theft of the keys and he worked really hard to get our replacement tumblers (from Germany) so that we can feel safe again.  Thanks so much for the super job, Gary!", "business_id": "uyp8kpTXKfKXvAB8HdJSAA", "stars": 5, "date": "2015-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UO4RiHHGgt0aPkYEnOgdaw", "review_id": "7dg5O7IohTdLgSjbBrMe3A", "text": "I am very happy with the quality of brake work done on my car last month.  They were down to metal-on-metal, This place is conveniently close to my work, and I was able to drop my car off in the morning and pick it up again by early afternoon.  The price was steep, but I believe you get what you pay for.  I'm about to have them replace my water pump, so I'm hoping the quality work continues!", "business_id": "BRqIGc5nGobwIVxX9vxyig", "stars": 4, "date": "2015-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8vJ-szb5YtijHMhxLoYFYg", "review_id": "4J17FOYRrtwrzpRwVtdVBw", "text": "Awful just awful, I gave them my car Thursday night at 4, I was informed a part needed ordered they would call me when finished, I called them the following Wednesday confused on why it was taking so long, I was informed it was done Friday and he thought he called me to tell me, I will not be going back, just crap service!!", "business_id": "vXxsDHzRvQEhK6YbNs3Nww", "stars": 1, "date": "2014-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RWtDRHpLnPBDjDVdKWh6uQ", "review_id": "e8wtvAH5meu4RrbO5cqs3Q", "text": "The team here at Virginia Auto Service is the best. We bought a used car from another local service center and boy were we sold a lemon! We even own a business next door to the place that we have trusted to work on our vehicles. When the other shop refused to stand behind their work, and the car they sold us, we sought out the crew at Virginia Auto on the advice of a friend.\n\nRobert took us through the engine of our vehicle and showed us all of the poorly done work by the other mechanic we trusted and then, he advised us on what we should do to keep our car running smoothly. The price was fair and the service was done quickly. We will be trusting only Virginia Auto Service from now on. We will be referring all our friends and customers here in the future.\n\nAll you Phoenix ladies who don't know a bunch about cars and need reliable auto repair with out getting lied to, Robert is your man.", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 5, "date": "2014-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mNBLrc4mmpcYMd6ANlW3Fg", "review_id": "ZQbNqnGFapqq7BDI8HMyZQ", "text": "Wonderful people, Bud checked out my car without charging me, gave me a quote. No pressure at all, he just let me decide if I wanted to let him work on it.  I saved at least $400-$500 because another shop told me its the struts, but it was just the torsion bar links.", "business_id": "0Xnduj9w6aYHOtN_RlHUng", "stars": 5, "date": "2013-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kIddeMFsvL-iiBnjZXObKA", "review_id": "ox-b9-2ieK3WMzSfq71H1Q", "text": "Excellent care of the customer and the car.  Thank you!", "business_id": "n4N4NyNS78JUvamWttTxJw", "stars": 5, "date": "2014-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1p3h5VO7zXe0nCUCm-BiWg", "review_id": "paVt0rkHfx4e85nCAJMG0w", "text": "I cannot say enough good things about Mark and Angel at Mad Hatter Mufflers on Dunlap. I took my beast van in there because I had been told by 3 different mechanics that my catalytic converters were completed clogged and they were causing my lack of power issues. Mark gave me a full estimate that I felt was reasonable in comparison to others. I went back to have the cats replaced and Angel drove my car into the bay and said flat out - I can put new cats on your car but it is NOT going to fix the problem and I would prefer you take the money and see a mechanic about the real problem.  This is a business man who told me the truth. He said he would love me to come back to do the exhaust work after I fix the real  problem - but couldn't justify me spending over 500 dollars and leave with the same issue. It is so rare these days to find an honest man that puts the customer before profit. I will return after I have the sensors that are actually causing the problems replaced, and I will sing this man's praises everywhere I can. Thank you  Angel and thank you Mark for giving me a good estimate too!", "business_id": "5jqqVt-A8bwwJDj7Ii7tvw", "stars": 5, "date": "2015-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0TVEmy3UyJf2smAB4xYRmA", "review_id": "-HFBMH5yWEk5eglx-Xdexw", "text": "My family has used Tony's before for their cheap and quick oil change.\n\nHowever, I recently took my car there for an oil change and tire rotation. Upon taking the vehicle to another mechanic for other repairs (Tony's is rather pricey), it was discovered that the tires were never rotated, despite charging me to do exactly that.\n\nTony's lost a good customer.", "business_id": "2fXVpii6fawN7qCL_M2Urw", "stars": 1, "date": "2012-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "CzCjFMeJdS5sugQJgcQrfg", "review_id": "sxISwyrIl0QXedqPDsq7hA", "text": "This is a great repair shop. It is very difficult to find an honest mechanic, so I was very happy to find 25th Street Automotive. I originally went there for a second opinion when the dealership had recommended some very expensive repairs. It turns out those repairs were unnecessary, and the car has run just fine since then. I now take my car to 25 Street Automotive for all routine maintenance.", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2010-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1c6DfGb9V-SqkXajh9QS9w", "review_id": "qhzo5jfFcAVwMKK9n8v22A", "text": "Outstanding knowledge and always the best in quality and workmanship. We have been using Jack's for at least 20 years and can recommend no other for excellent, friendly service at more than fair prices", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 5, "date": "2011-05-09", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "nN9Qdyxec8JzwSWgwDjLrA", "review_id": "eQy4n7wWZWEjHC0LzRz0Uw", "text": "I am an informed, educated customer who used to work on autos; and I was a crew chief on F-15 Aircraft in the USAF -- so I know what I am talking about in this review.  I intend this review to be accurate and reasonable, to help others make an informed decision to NOT take their vehicle to Tony's.  On 04/15/15 I picked up my 2009 Range Rover Sport after it had been there 2 days for various repairs.  I had never used Tony's in the past.  Even though I made a written list of all work I wanted done and gave it to Tony's, they failed to clean the corroded battery terminals (and I had to point this out to them when I picked up the vehicle and had to wait for them to do the work).  The mechanics at Tony's cross-threaded the cap onto the power steering fluid reservoir when they put the cap back on.  The Range Rover had a pristine white interior when I dropped it off at Tony's.  But I got it back with grease, grime and black smudges all over the front driver's seat, door handle, console, dash and even the hood and fenders, etc.  I have photos to prove it (even after they supposedly cleaned the cabin after I complained).  Next, I thought I would save money going here, versus the Range Rover dealer --  WRONG!  Without telling me verbally or in writing when I dropped off the vehicle for service, Tony's added a $60.00 \"supplies\" fee and a $70.31 \"Enviro and Technical Fee.\"  They dropped these charges when I complained.  In any event, it is my opinion that Tony's uses these $60.00 and $70.31 charges to price-gouge customers.  And as proven by the grease that was left on my seat, console, etc. these guys are true grease-monkeys who do not take special care of customers' vehicles.  Stay away from Tony's and take your car to the dealership or somewhere else.  Also, when Tony's finally cleaned my battery terminals, they caused all settings in the vehicle to be lost.  If took me about 45 minutes to reset everything (memory seat, radio, security and lighting settings, clock, etc).  Before they disconnected the battery, Scott at Tony's told me that none of my settings would be lost, because they were supposed to use some sort of memory-saver.  But it obviously did not work.", "business_id": "S1q51o5JqD5rzzDq_WD5_w", "stars": 1, "date": "2015-04-16", "type": "review"}
