{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I_47G-R2_egp7ME5u_ltew", "review_id": "0Lua2-PbqEQMjD9r89-asw", "text": "We checked this place out this past Monday for their wing night. We have heard that their wings are great and decided it was finally time to check it out. Their wings are whole wings and crispy, which is a nice change of pace. I got their wet Cajun sauce and garlic butter wings. The Cajun did not have a bold enough flavor for me and their sauce is too thin. The sauce was also thin for the garlic butter, but that is more expected. They were better than average, but I don't like seeing all the sauce resting at the bottom of the boat. I would definitely come try this place out again to sample some of the other items on the menu, but this will probably not become a regular stop for wings anytime soon.", "business_id": "UsFtqoBl7naz8AVUBZMjQQ", "stars": 3, "date": "2014-03-29", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "nEYPahVwXGD2Pjvgkm7QqQ", "review_id": "3Ngk2ziLJzEGs144XhRxIA", "text": "So.Much.Fun! \n\nI WISH I could play a song at the drop of a hat. Too bad I never took piano lessons and I'd probably end up mumbling half the lyrics other than the chorus. Unless it's Salt n' Pepa's Shoop. \n\nThis is a really great place to go when you have out of town guests or are looking for a fun place to take someone for a birthday celebration or a fun night out. It's just something different to do other than boozing it up at the bars on a Saturday night. \n\nKeep in mind you'll be paying around a $5-10 cover plus whatever drinks and food you get. The good thing is the food is coming from the attached Rock Bottom Brewery. So a lot of it is restaurant quality good. Plus the brewery beer is actually pretty good! OF course you will be paying restaurant price drinks...so of course they're up charged a bit. But you do pay for the whole experience....so you gotta get into the spirit with some spirits! \n\nThe guys who play are incredibly talented. There's 2 guys that will take requests and play songs on the piano. They pretty much play ANYTHING you ask. Contemporary songs, throw back songs, fight songs, rap songs, pop songs. You name it, they play it. \n\nMy favorite part is when they switch out to another two guys. They'll all four get on stage and play two piano's, a guitar and drums. They usually rock out with some fun familiar songs (um, Journey, of course!). \n\nThe birthday song is seriously the best. They sing to you....and call you some names....with expletives. But in a totally nice way of course. You just have to go!", "business_id": "MKyk4F4HSzHF8v-4cYe3Ww", "stars": 4, "date": "2011-03-21", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "SLFFql08ndgemixpHfKhcw", "review_id": "JahR-x474cul851aNDOAeQ", "text": "Not being from the area, I traveled an hour to come here from Uniontown, PA. I was excited! I haven't been to this Dave and Buster's since I was younger and was ready to go back and play me some games! I went with my cousins, mind you, we hadn't ate all day and were very hungry. So, we decided to do the Eat & Play Combo, naturally. Here's where it gets bad. First of all, we get a very snobby hostess that shows us to our table. Then, we wait...and wait...and finally after about 25 mins we get a waitress. Her name was Ashley. We had plenty of time to decide what we wanted, so we quickly put our order in. Next, we were sitting and talking, waiting, we had empty glasses and our waitress had never even come around to see if we needed refills except for one time. She said she'd come back right away with our refills...yea, right. 20 mins later we get our refills. Mind you, our food still hasn't came yet. I see other people getting their food that had come in after us. I was frustrated. After waiting 45 mins for our food, I asked to speak with a manager. One of the servers who I asked replied rudely with \"Well, he's really busy right now. I doubt he'll be able to come out and talk to you\". Finally, 15 mins later...that's one hour, folks. We get our food. What do you think the next problem was? Yep, the food was cold. I was completely fed up at this point, and told my waitress how disappointed I was, especially after driving one hour just to have this terrible service. The manager never came to speak with me, and we didn't even receive our meals for free. The only compensation we got were $10 game cards. Woopty-doo. The only thing good about this place is the games, but the prizes you get for your tickets are all junk and worthless. So, in conclusion...I DO NOT RECOMMEND THE WATERFRONT DAVE AND BUSTERS OF HOMESTEAD, PA. It was horrible, and I will not be returning for a very long time!", "business_id": "sbW8qHJgzEIH42B0S-3New", "stars": 2, "date": "2013-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "cM9e72mfMtKKRmCnS1VGCA", "review_id": "OLtZqsHe-k2tYXl0c59o1Q", "text": "I went here for the first time the other night and had a great time!  The comedian was hilarious and it was a great intimate setting for a fun night out with friends!  My only complaint was that it was a little pricey for the overall experience because not only do you need to buy a ticket, but every person needs to buy 2 items of food/drink and the drinks aren't cheap (around $10-12).  However, I would definitely go back sometime!", "business_id": "tv8cS4aaA1VDaInYgggb6g", "stars": 4, "date": "2014-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zaF1gg4mD4Ws7ZsFGRNmlw", "review_id": "YuiJcp2Nnn-dhBDSXuR_-g", "text": "Food was 7 out of 10 for this type of bar / restaurant. Service was extremely poor and bar service was also extremely poor. Untrained and understaffed bartenders will keep me from coming back. No reason to not be able to get a drink when sitting at the bar.", "business_id": "EoAY1JSVeJriBzId8lUQwQ", "stars": 2, "date": "2015-03-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "UFem4aIQoL9MtejCZQ6YDg", "review_id": "hnnT9vXu-m2PZeOKpqX-6Q", "text": "When Hotlick's died, Buffalo blues was born. It really is a Pittsburgh staple but come on....\n\nFood is really, really average. I love the ribs and wings, but it's about the same as any other rib place in the city, only they charge an arm and a leg for it. This place is for the people that feel that they are at a real rib place, but don't want to cross Centre or Penn Ave. to get real ribs. It, technically is in Shadyside so your Mercedes will be safe! \n\nThe ambiance: The restaurant is always crowded. Not just crowded, but packed with teens underage drinking, families with too many kids that overflow to your \"space\" and collage kids who also spill over from the bar. IT'S LOUD AS HELL!!! Forget about a nice quiet dinner. There seems to be no consideration for customers at all. Last time I was there, there was a St. Patrick's Day party (it was NOT St. Patrick's Day) that took over the whole place. Though the staff tried (nah, they didn't really try) to keep them in the so called \"party room\" I was bumped into several times, spilled my beer, and couldn't hear my wife speak. But as long as they got their money; they could give a crap. Oh and there are like 100 TVs to interrupt any conversation at your table.\n\nWant to sit in the bar area? Good luck. You will see a mix of drunk people, women who look like high-end prostitutes and college kids who are only missing a beer bong. Also IT'S LOUD AS HELL!!!!!!!!\n\nThe \"wonderful\" Staff: It seems like it's everyone's first day. To put it lightly; the staff suck! To be sure, you will be waiting for your your drinks, food and bill for a very, very long time. Expect to be there for about 2-3 hours. The wait staff are forgetful, inattentive and very sloppy at their job. It pains me to leave any tip for them. Most of the staff are hot, stacked, absolutely stupid and should be working at Hooters not a place where your bill will be upwards of $50 for two people. Be prepared to be met with this saying, \"Oh, like ohmygod, I am so sorry i forgot that, he he!\" (oh she's twisting her finger in her hair while she's talking). You will get bad service...period (in fact, I can't remember the last time a wait person actually wrote down my order, and they're idiots so no worries).\n\nThe food: Kinda good. Menu is huge, you'll find something you like. But I go there about 2-3 times a year for the food. It is way too expensive. Do not take a date there. Your average bill for a meal with actual proteins will run you in the high 40s without booze. There are so many bar-food places that don't claim to be high class that are just as good as this place. I grew up with the rib sauce and love it, but for your average consumer, skip it!\n\nThis place is a wannabe sports bar that tries too hard to be high end. Just watch out for the vomiting college kids with trust funds...they're everywhere!!!!!", "business_id": "Ts4xsKPU7FNPPZRj-nRjIg", "stars": 2, "date": "2012-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MinNxg1k6s9xpZKRw41NnA", "review_id": "hXz9Fjz4giNPSP4_QuazUw", "text": "I went on a date with my girlfriend here, and it was a great experience.  Charming outside dining area with excellent service and a knowledgeable staff.  I will say that the food was a bit overpriced, but that's to be expected in Shadyside.  Great selection of fresh seafood - I had the salmon and it was delicious.  Reasonably priced wine list, as well. I would recommend Casbah for a special event or if you're rolling in the $$.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 4, "date": "2010-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w05oRQtkxYQ2tRMOYuYwNQ", "review_id": "jb9ArgSA1f1xbxOhEVr5Iw", "text": "Sunday brunched here. Food and service were excellent.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 5, "date": "2013-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5FUZ7c3MmVBTo9r3lDbadg", "review_id": "DxUsJ4O71gdlRv-rfwyb2Q", "text": "I came and left after seeing all the changes, I was here to check out the place after the hospital mentioned it was a cool bar.  I think all the hype from my colleagues was not justified.........Not a great menu, just a boring bar!!  It's a shame, what happened???? I was looking forward to a great place to hang out, eat and chug beers.", "business_id": "YRDKsBFYP7G0E8BLJKIkvA", "stars": 1, "date": "2009-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I2-LK2hhCqJZig-bXMAl4g", "review_id": "pO9byg0Eewx32jbJEF_JJA", "text": "Nice lil bar/restaurant with awesome staff.\nMy favorite thing about this place: The staff.\nFriendly, kind and super nice.", "business_id": "IxQ1ATP_Wg_QujO9nywzcQ", "stars": 4, "date": "2012-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XcY9wiaFExPqG5WT1D7WPg", "review_id": "yrqt7M9xZdFxSUClMMdHaA", "text": "The bartender was fantastic and the food was even better! I got the sausage sampler and it was delicious. The sauer kraut and mustard were great as well.", "business_id": "IxQ1ATP_Wg_QujO9nywzcQ", "stars": 5, "date": "2015-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0vCEI3ZJF_gXgWHpcR7WtA", "review_id": "wPc-v-C4kHMQL1rLI7aUeA", "text": "Four stars for the pizza!\nGreat crust.  I usually don't eat the crust, but I couldn't let this go to waste.  We ordered the Leopold.  In the description, it noted a \"hint\" of anchovy.  It ended up being more than a hint, which was welcomed by my boyfriend and myself.  \nWe'll be back when we're in the area.  I see this being a regular spot after our rounds of golf at Mt. Lebanon GC.", "business_id": "qemCNgjeYGcFsRwxW9x4xw", "stars": 4, "date": "2013-04-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "JEvkfVPf_DuhX-ntE5L6bQ", "review_id": "AuAcyYS6O7-nRr3gSE04Xg", "text": "A day after the St. Patty's day libations the only thing I'm craving is some greasy junk food. Regent square hits the spot with some chili cheese fries straight from D's. Normally I enjoy fishing around the plentiful selection of booze. A hair of the dog was not gonna happen that hangover Sunday. I stuck to shoveling high calorie food into my gullet instead.\n\nThe last time I was here I selected from the hot dog menu, and they weren't that great. How can you mess up a frank you may be wondering?  I can only guess that it's the dogs themselves or the way they are prepared. They're kinda chewy. Dormont dogs rallies but the best Dog I've had was at Dirty Franks in Cbus OH. The chili cheese fries are good though. So today I made sure to get my fries fix in and try a burger. This weekend I had burgers on the brain! My BF and I got the Balboa, the BBQ Texas, and two dogs, mac n' cheese and Mason Dixon with with cheese.\n\nThe burgers had really delish toppings but the meat was so dry. It was overcooked and did not have one bit of juicyness dripping down my hand. Missing that major component they were truly lackluster. The macaroni dog wasn't that great either. Mac n' cheese should be creamy, salty, buttery. So sorry but this weenie came up flat too. I did like the Mason Dixon! The crunchy-ness of the coleslaw made a huge difference but the meat was still chewy and too salty. Could it be that I am too picky when it comes to my meat? If I am shopping for picnic eats I do go for Smith hot dogs WITH the casing or the large sized Hebrew Nationals. Now those are the mouthwatering crowd pleasers I'm talkin' about!", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 3, "date": "2011-03-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ynfZJlWuHIjOEDs4cZKUhQ", "review_id": "ITyJROTxVcwL3wS81uzGYg", "text": "This is paradise for beer connoisseurs. A range of beer that confuses, bedazzles and quenches you thirst for quality brews. The selection on lager and ales on tap as well as in the 'beer cave' make this place one of a kind. The special hummus, fries, hot dogz, and pizza make it the perfect hangout place any given day in Pittsburgh", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 5, "date": "2012-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AEQowxQ8076LsWNirwHTww", "review_id": "MXvAD3SnJGNdOMDO8vHDnA", "text": "I thought D's was beer mecca of Western PA until i recently discovered House Of A Thousand Beers. The latter is a bit of a drive, but you won't see anything like it in the area. That being said, I stopped in Ds today and i must say the cave is slowly but surely going down hill. They use to have countless hard to find beers, Ottos, etc. Hardly saw any of that today. And what specialty beers they do have costs an arm and a leg, and can be found for cheaper elsewhere. For example, $14 for a 12 oz bottle of Wulver and $25 for a bottle of Angel Share! Whoever is actually subjecting themselves to those outrageous prices are literally getting robbed. You can find a $25 four pack of Wulver and a $10 single of Angel Share at Giant Eagle.. In fact, you can find most of the beers in the cave at Giant Eagle at a much lower price... Shop smart and mix and match a sixer at Giant Eagle for half the price.", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 2, "date": "2015-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-ke0O45_B6STtEqd5s_ANw", "review_id": "T41XlHmCFfIDhzoaJoG6vA", "text": "The only place you need to go for football games. They have the best hoagies! Make sure you call ahead if it's game day because they will get slammed. We always get the go-go and the super smasharooney or whatever, roast beef and turkey. Fresh bread, fresh everything.", "business_id": "DzOPHyrG2XuVqKEvHCnN7w", "stars": 5, "date": "2015-03-08", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "DD3fOuL8bo6jrEsSeQHx9A", "review_id": "6colFkdW9c_CL3R0XZLEzQ", "text": "Olive and Twist is a convenient and rather nice bar to visit if you're staying in the downtown area.  The huge beer list and so so martinis do their job well in attracting the suits and theater crowds in mass numbers.  Finding a seat can be a chore if you come at the wrong hour because no one ever leaves!  The food menu is your typical bar menu and is very well priced.  My party only got the nachos which were good.  Our bartender, Rosie, was a sweetie and really made us feel welcomed in this steely town.", "business_id": "OxIeMVcop5oxBUWANi-1Rw", "stars": 3, "date": "2011-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "lLmnsl9jR4Sx5vVGlw0IdA", "review_id": "-JxHc_sAtvfXqnh292FgMA", "text": "Coming in on a Saturday night, we were able to start off with seats at the bar and then, moved to a plush seated section up on the second floor.  Staff was super friendly and I loved our bartender.  We definitely had a lot of fun trying out all of the yummy drinks between our group of girls.\n\nWe all had a sip each of Le Fiz, Pink Lemonade, Cucumber Basil, Root Beer Float, Mixed Berry Tea, Guava Mojito, Dewar's Arnold Palmer, Huckleberry Mojito, Pomegranate Acai Mojito (mojitos were a hit with the girls), Dark Knight (with Elderflower liqueur and creme de violette), Jameson's Ginger, The Perfect Pear, and Lemon Ginger.\n\nOverall, a great place to stop in for drinks.  We had a group of five ladies and had no problem finding a place for us to sit down around 9pm.  We were also able to redeem a restaurant.com gift certificate here, too!  If we ever return to Pittsburgh, I wouldn't mind popping back in again.", "business_id": "OxIeMVcop5oxBUWANi-1Rw", "stars": 4, "date": "2014-04-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "JEvkfVPf_DuhX-ntE5L6bQ", "review_id": "8rQYAOVnJ1vPlcvBLe2prQ", "text": "St Paddy's day bar crawl first stop! So walking around the cultural district after the parade I had to come here. I had passed by when wandering around the city and it called to me with the Authentic Irish name. \n\nIt was really really busy that late morning. The bar was hopping and everyone was excited to start the long days libations. It took a long time for us to get served. Most people were already in the party mode and it was our first stop. The bartender was busy I know but not incredibly happy to be there it seemed. \n\nWe finally ordered a draft of Guinness and chatted away. I can't say the atmosphere had me wanting to stay so we downed a shot of Jameson to pregame for Market Square. The Shots were cheap, the beers were not!\nWhen I asked for green beer they had already run out. The bartender complained that they \"usually sit on it\"...who knows, it was only noon. It did look like there would be a band playing later in the day. We didn't sample any food so I can't comment on that. So my opinion good for one drink on a bar crawl.", "business_id": "-nfzEVOVvmDSFbxvBsllGQ", "stars": 3, "date": "2011-03-21", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "6QhWTugzBJ3cdv2N4WZcSA", "review_id": "F5SntN4a97tKwbx6L9JaUQ", "text": "I'm a pretty hard core karaoke fan, so I was excited to visit Nico's on a Saturday night after hearing about their awesome karaoke. Sadly, I was disappointed. The place is rather small and was packed by the time we came (about 10pm). It took ages to get a drink and it's hard to get around the bar with so many people standing around. That said, my drink was nice and strong and the prices are reasonable. \n\nNow the karaoke crowd was pretty fun...mostly hipsters with a few good singers but mostly people trying to be funny with their song choice. The karaoke host was just lame. He was an older guy, and seemed rather cranky and jaded, which really kills the mood when you're a karaoke buff looking for a good time. And he had a CD setup -- seriously, CDs, in 2010. His song list was waaaaaay out of date. He had a tiny TV screen that was setup in such a way that if you needed to look at the words, you would be facing away from the crowd. It was just really lackluster in my opinion.", "business_id": "tQpYnf3P3Q_OQLYYJvlV-A", "stars": 2, "date": "2010-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tVdd9PpelLrWbqykEFb8jA", "review_id": "7OJRPRPh_xJatBXHViVjVQ", "text": "good place for a quick Guinness, or grab a patio seat\n\nfood is good, their Rachael is worth ordering (to-go especially)\n\nA good neighborhood joint!", "business_id": "3zgswf_NfBJpeAoWeTkgMA", "stars": 3, "date": "2014-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6u8sFKKRt59NM7CCpKoEfA", "review_id": "mSImVw1gzg3cGM35mr4__w", "text": "Bad food even for a bar and some of the beer prices were a bit much.  This place has a nice layout, but the food is not worth the money.", "business_id": "jJfTh2O3M2Q716akd9Dr9w", "stars": 2, "date": "2012-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "pMf6ebP3jCkELI8RdUebPw", "review_id": "Drz_ihTJDSMUdtJodjZ8ng", "text": "Harris has a nice patio and a decent bar, but good luck getting served.  If it is crowded or the bar is just full I've always had to wait to get served.\n\nThe beer selection is decent, but not all that big.  For a much larger beer selection check out Buffalo Blues a few blocks down the road.\n\nThe best part is the patio, if you want decent food and good outdoor seating, Harris is a good choice - if you don't mind waiting.", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 2, "date": "2009-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0P58MD0FRVI6pTVKUpd7YA", "review_id": "O2i80mW7pncBG0u_RXQuyA", "text": "I have been here several times in a drunken stupor, and let me tell you the warm cookie with ice cream is exactly what the doctor ordered to ensure sufficient energy for the stumble home. But, this week was my first sober experience of the place, so I felt more adept to review the place. \n\nWe went during happy hour. $5 apps and 1/2 off beer. NICE! We got the spinach dip (meh, but Sarah S. liked it), the pierogies (YUMMMMMMM), and the calamari (also YUMMMMM). I got the spiced stout, which was also delish. AND the bill was like $20!\n\nMy only complaint is that they don't show how much the food would have cost without the discounts on the receipt, so I didn't know how much to tip :(", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 5, "date": "2013-03-06", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "-0itF0VWVBe3k2AdfUReGA", "review_id": "SAAo_waM-gvhkCLfdcFNBg", "text": "Harris Grill is 100% OK. The service is nice, the drink list is nice, the menu (albeit confusing) is nice, and my overall experience has been...err...nice.\n\nEverything is a little expensive, and I don't really understand the menu (are they joking in some places? Is it supposed to be serious? Why is everything priced awkwardly?), but they have a solid brew list and the outdoor seating is crucial.\n\nTake a date here, take a group here, or come on a Sunday morning for their brunch (which is also nice).", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 3, "date": "2014-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VVQon90cJCf9ovJhPB8zjA", "review_id": "CmbDCxbik3zH47zaPBppJg", "text": "Excellent bar service and a few great dishes make this place one of my local favs!  Jerk Mac and cheese knows few rivals", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 4, "date": "2015-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9HawgrcHA-xaCOmTZ4YXgA", "review_id": "QuupjOmEXFPu4V79QneWsA", "text": "I came\nHere for breakfast so When you first walk in I asked myself am I in the right place, I was .... Starters food is nothing outta the ordinary,,one funny thing that stood out was when we asked our server if they served any other meats aside from pork based meats she responded BACON! And no not turkey bacon... So clearly lil off there...  Other then that we order common breakfast .. Which was ok... I had the western omelette with turkey sausage ... The peppers and the onions were not sliced small enough and were overpoweringly huge ... Lil less On that lil more on the egg,,.. Which I wonder if the eggs were made from liquid base out of a carton ... Yeah so place was ok if u wanna eat in desperation ...", "business_id": "DkX3YoxhH4uADsgVgQThew", "stars": 2, "date": "2013-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZeESCtlYsfJ34PSYhOyX2w", "review_id": "tyb6T-8hdXaUBLVXWdTUdw", "text": "Stopped in around 7 on a Friday night, wasn't crowded at all. Bartender was super attentive from the moment we walked in. My girlfriend ordered a Manhattan and I got an Old Fashioned. Both were poured with a heavy hand, and they were 6 a piece. They were delicious. Its a pretty small place, so I could imagine it getting pretty crowded, but all the regulars had space. Also they do allow smoking inside, but it wasn't particularly smoky when we were there. I can imagine it might get a little suffocating if it gets packed however.", "business_id": "TIPebazlAGJsp8zAwhNkcw", "stars": 4, "date": "2015-03-23", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "hYySrhzCNJSxTbQXSoigKA", "review_id": "2FrMTxLW06fZw6uX5Go8vQ", "text": "I love this place because the pasta is always very very very hot.", "business_id": "4WsTFTH8GgnyFHwrH9nHzA", "stars": 5, "date": "2013-05-22", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "Syn0IvWg-M7I4G2t_XyHoA", "review_id": "s38jpEJFFm-yZrCB7_-kqw", "text": "Al Mike's, as it is locally known, is housed in a 1890's Victorian era building that housed the E.W. Berryhill Store for 70 years. During the 60's & 70's, the building housed multiple businesses, from a paint store, a thrift store, grocery store and delicatessen. In 1983, Michael Alexanders neighborhood tavern opened for business. \n\nA popular neighborhood institution, Al Mike's retains some interesting building characteristics, such as the supporting pole almost directly in front of the women's restroom door, which lends itself to many a bumped head as well as built in coolers that are original turn of the century ice box coolers. \n\nWe dined on the Spicy Crab Soup, which one of my dining partners characterized as melted Velveeta with crab and while that description might sound rather unappealing, it was quite yummy. In addition to the three cheese on Texas Toast sandwich, which was ok, but a bit on the dry side, my other dining companions had other basics, such as sandwiches and burgers. This is tavern food, so don't go expecting high end meals. The appeal of this restaurant, as a visitor to Charlotte, is that it is located in the Fourth Ward, a small district of brick and Victorian buildings and the unique history of the building that houses Al Mike's.", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 3, "date": "2009-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vom6vj0U9O585MsbuQVLNQ", "review_id": "xQuwxpkq5ceHnKKzEoPezA", "text": "By far my favorite place in Charlotte. The atmosphere and service are outstanding. Al Mike's is my first recommendation anytime someone asks where to eat. My only request.. Bring back Octoberfeast! Fried pickles are the best in town!", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 5, "date": "2014-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "T4GT_bOkGQKinuGGfCuWPQ", "review_id": "sPgBgcV3MQW011dQy6ImvA", "text": "The atmosphere is like any other chain sports bar, service was bad, and I don't think I will be returning. Nothing stood out about this place with so many other great options just a block away.", "business_id": "-6JY1T0w4XETux5kGOj84g", "stars": 2, "date": "2013-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "EIcIQ0Z7ZioiJry3v1fxEA", "review_id": "voy3lTnH22GvLhJyVvpCdg", "text": "I understand everyplace has its rules. My friends had a pre-wedding party here. And at 10pm it becomes a \" standing bar\" only. But did your staff have to be rude to the parents who were still sitting down a little respect goes a long way. We will not be going back.", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 1, "date": "2013-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tjJtSkE23o1FapaGN8cdgw", "review_id": "p9yq1jPZHFD3C3MLQl1Fhw", "text": "Came here in between sessions during the college basketball tournament. Standard Irish bar, but the good thing was there was lots of room to sit or stand. We ordered a bunch of apps and shared with the table. Fried pickles, French fries, and we got a few Reuben sandwiches. All was good. They have a few of dipping sauces for the fries and pickles. Went well with a good Guinness. Our server Alex was super nice and although it was busy we got our good and drinks in a timely manner. Cool little spot to pop in when in Charlotte.", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 4, "date": "2015-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "3Gazlt5RwZQIu1ZWMwi0cg", "review_id": "c0dPXzLJlRcbvZLedMLtcA", "text": "Decent food with a laid-back atmosphere. The burgers are very good, and the Brewer's Club is excellent (if you like focaccia). Stay away from the non-standard stuff like their Mexican or novelty sandwiches. I've been disappointed every time I tried to venture into that territory. The main dishes are generally pretty good, with my personal favorites being the Hazelnut Crusted Chicken and the Meatloaf. \n\nIt's a great place to have lunch uptown. When the weather is nice you can sit on the patio and people watch. It's a safe place to bring non-adventurous lunch guests, as the food and atmosphere will have them feeling right at home.", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 3, "date": "2006-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PM2jXrlVzik1jDwwahLJJQ", "review_id": "1Jd2wKR_dhp_8MfzKvJM0g", "text": "I met a couple of girlfriends here for dinner and drinks on Friday evening. Parking was easy because the restaurant is attracted to a parking garage and...yes! They do validate parking. \n\nWe started in the bar area, which was pretty crowded. We were hoping to grab a table but quickly found out they take reservations at those tables so we were moved to the main dining area once everyone arrived. \n\nThe bartenders were awesome! With so many beers on tap, I had no clue which to try first! So she let me sample some of her favorites and I found that the Kolsch was a winner!! It was light and refreshing and a perfect compliment to our appetizers. \n\nWe ordered the Brewery chicken nachos and Southwest egg rolls, both were delicious! The nachos come with an entire dish of freshly made salsa and the they load you up on the toppings: cheese, sour cream,black beans, chicken, onions, jalapeños and guacamole. The egg rolls are deep fried and stuffed with chicken, beans, red peppers, zucchini, tomatoes, corn and pepper jack cheese! Yum. \n\nFor dinner I went with the Southwest Turkey burger. The turkey burger is mixed with peppers and onions which adds a really nice flavor to the meat! They then top it with lettuce tomato, avocado mayo, fried peppers, sliced avocado and pepper jack cheese. I really enjoyed it! The fries weren't my favorite...they were shoe string cut and a bit too crunchy but at least they came out hot! \n\nAll in all, I'd definitely return and recommend a visit to anyone!", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 4, "date": "2014-03-29", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "Qe1l1ln6bf_pcWUUuLswFA", "review_id": "2zAswleDK5cr9S2WaLEB8w", "text": "Worse than Cans.  And that's saying something!", "business_id": "jbUu0Mtu9QUjyyeOn6RIHw", "stars": 1, "date": "2008-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "T_kMEgHqIqwbHR_7yhqWFw", "review_id": "eFe6LsC-nSOKPfPjDhMqjQ", "text": "Sorry- just doesn't do it for me.  The steak is average and it's over run by BoA middle management.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 2, "date": "2009-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PDVT8Lshz0z6Cy4A4Ee3zA", "review_id": "Z5SaxAjObQBcjBxFh-VuCA", "text": "Wen't to Capital Grille for my birthday dinner. I hadn't been here since I was in High School. From what I remembered it was really good. Of course everything is a la carte. I ended up only having Lobster Mac and Cheese. (I'd already had a recovery meal after party #1) It was okay. Could have used a boost in flavor somewhere. Maybe some salt. My biggest concern was my drink. Is that bad? I'm concerned with my drink. Anyway, I ordered a Sidecar. It came in a goblet style glass full of ice. Someone please correct me if I'm wrong. Are Sidecars not to be served up? With actual Cognac? I figured Capital would know better than that. Other than that my large group was served well. They even threw some berries on a platter with my cake that my friends brought. Nice touch. Oh, and we saw celebrities, like face to face. Thank goodness CIAA will be back for six more years!!", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 3, "date": "2014-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5XsRngBSNyaj3rN2lOdOIg", "review_id": "mbsmxMtjR9hQypnX6c9OKQ", "text": "Went here for the first time to watch my Tarheels get the crap kicked out of them by Duke.  Though the game was horrible, the bar was great!  Had a buffalo chicken wrap and quite a few Fat Tire drafts and I had a really great time.  The staff was attentive and helpful, the people were friendly and personable, and I was very pleased.  Will definitely be going back for the next big game!", "business_id": "t5l-H2KdY4MQgLDMENz9WQ", "stars": 4, "date": "2010-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ycrb0k2JmKcL61mCOJ1jtQ", "review_id": "XNmNpEg9f4GYeCv9t7M2qw", "text": "Well finally a place that can pull a pint. Good atmosphere and a friendly crowd. They also had a good selection of Irish whiskey.", "business_id": "jmzPbvE_02SzTAjwZCTgYA", "stars": 4, "date": "2014-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UKVy2-B5bSse7bLkzd-E2A", "review_id": "qSQzNydspVk9ZQQF9QJRxQ", "text": "Great place to salsa dance on a Saturday night!!  A brief lesson is given by some great professionals-check it out!!", "business_id": "e5J3s-xxs1S6PPHJhldBEA", "stars": 4, "date": "2014-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "-_1ctLaz3jhPYc12hKXsEQ", "review_id": "iAwaspFUwLZk-_CR5Ogdpw", "text": "After hearing good things about Blue Restaurant and Bar, Denise and I were happy to try it out last night.  To be fair, we knew it was pricey.  So we were happy to give it a go, considering that someone else was picking up the tab!\n\nIn any case, wanting to try something unusual that I can't get anywhere else, I chose the Wild Boar.  Four slices of tenderloin and a small chunk of shoulder, served atop a bed of spinach, which in turn was on top of some sort of risotto (rice-like) mixture, and the whole shebang was highlighted with berries (huckleberries, I think).\n\nThe tenderloin was average.  Good, but a smallish portion, and nothing really special about it.  The shoulder was excellent, and rivaled a tender pot roast.  The risotto was good, as was the berry that highlighted the plate.  The spinach just looked nasty (and I _like_ spinach), so I didn't try it.\n\nBeverage service was excellent.  Rarely did I drink more than a bit from my water glass before it was refilled to the top.  Same with my ginger ale.  Bar service appeared to be pretty speedy as well.  But food service was horrid.  Slow, slow, slow.\n\nSeveral of the people in our party ordered a chocolate cake dessert at the time they ordered dinner - apparently it takes a while to prepare.  Well, our server didn't really seem to notice that other people at the table might want some dessert, and was almost shocked when two of us asked for dessert menus when the cakes started arriving.\n\nAn order of ice cream and another of berries went completely unserved, though we waited twenty minutes or so for them.  I understand if one of the little cakes was ordered, it might take a while to cook.  But how long does it take to scoop some ice cream and throw some berries on a plate?\n\nI doubt we'll be back, but it isn't completely about the service.  The food just wasn't that great, and it was a bit pricey.  Nothing wrong with paying up for great food, but Blue wasn't it.", "business_id": "eaqJQP6bp7rQJQt5KqfvxQ", "stars": 2, "date": "2007-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vxcEH1lZVVzyE0NgJEEpQg", "review_id": "EGqxZ82kR91KEdEZMpTGGw", "text": "Elegant downtown, or is it uptown, restaurant that let us in without reservations on a Thursday night. The expensive food was good with an even distribution between fish and meat to choose from. We started with a combination of diver scallops and calamari that they quickly put together for us. Two of us had the grouper served on crepes stuffed with crab meat. A little fussy for my tastes but the fish was done just right. The filets that the other two folks at the table had looked good as well. The setting was lovely and the jazz combo that was playing in the bar set just the right tone. I'll have to say that our waiter was one of the best I have ever encountered. No bullshit just a cordial, professional greeting, good advice on the menu and our meal served unobtrusively. Expensive but for a special occasion or on an expense account it's a good choice in Charlotte.", "business_id": "eaqJQP6bp7rQJQt5KqfvxQ", "stars": 4, "date": "2014-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nykberdxcTFvdBf8lMOPJg", "review_id": "NOl7EOighLW_oHweDcpvVA", "text": "Such an under appreciated venue in Charlotte. I would rather see a show here than that crap pavilion in University any day- what's its name now??? I have seen several shoes here over the years and it's a great place to get a drink, table and vibe to some good local and traveling acts. The sound system is nice and the clientele aren't usually annoying even if they've been drinking. The bathroom is sub par but it is a nighttime venue..", "business_id": "eNIDbboNe7W_rAnNHoveEA", "stars": 4, "date": "2014-04-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "zJtcWAUYGbOMoQRNwGGP4g", "review_id": "Y_ApHfhI41kvwioWeB-nwA", "text": "What to say about the Cajun Queen..Hmm??? OK I got it..Its not a bad place at all, but I wasn't to impressed with the gumbo, to me it seemed like something was missing. I decide to have the Diane Chicken and it was simply amazing, it seemed to just melt it my mouth and what can i say about the fired green tomatoes( hold one second while i wipe the droll of of my mouth) lol .....The staff is great and the jazz band was awesome and played a over all large selection of music...so over all i would put them on my top ten", "business_id": "jTGQUWGIVvL-aY03C5BEmw", "stars": 3, "date": "2010-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wtJjo3a8ecMvVFjrGsiuEQ", "review_id": "H0OW3dbNiswK_g6KFXSglA", "text": "Food was bangin. I got the sirloin special with mashed potatoes and etoufee with just the right amount of kick. \n\nWe requested to sit upstairs thinking we would have a nice date with some soft jazz in the background. Oh man was I wrong. The music, in combination with a table of like 20 people, made it almost impossible to commuicate. We literally texted a couple times, it was bad. Overall it was nice and I would go back, perhaps on a weeknight, and will most definitely be sitting downstairs. Enjoy!", "business_id": "jTGQUWGIVvL-aY03C5BEmw", "stars": 4, "date": "2013-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "WK5svPpJ0O5-Tl7aV4Lfng", "review_id": "ye_Q6fnwNO7oqvaEERN8kw", "text": "In Charlotte for a quick business trip, I found this gem on Yelp. My waitress Hanna seemed genuinely excited that this was my first time there and recommended several dishes, all of which didn't disappoint. Started with the BBQ shrimp, spicy yet tasty; sop the sauce with the bread. Next up, blackened pork tenderloin with fried plantains. 3 good sized medallions with an interesting bean chorizo sauce. The plaintains were battered with cornmeal and were very good. I also asked for a single filet of the salt and pepper catfish, which was very good also. Ended the meal with key lime pie. Overall the dining experience went well. I would come back next time in town to try other menu items.", "business_id": "jTGQUWGIVvL-aY03C5BEmw", "stars": 4, "date": "2014-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RqSpEygfb52ZenYs9hcmfA", "review_id": "UoDkxYN7vfEdp58qhq6ecw", "text": "After an absence of 10 months we went to the Queen with an out town guest and another couple. Gumbo was good with a couple of shrimp and a staple of the place - good, not great but consistent. 3 of us had the fish special with crawfish topping and all liked but I gotta say my salmon was perfectly cooked - great job top chief. Our problem tonight was our server. He was just not that in to it. Sighs when asked to explain a dish, just crabby. He seemed to know what he was doing, just didn't want to be there.  Food rates a 5 star rating but service gets in the way. Too bad for all of us!", "business_id": "jTGQUWGIVvL-aY03C5BEmw", "stars": 4, "date": "2015-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "1AUC98b6wL76_TXet1pdIw", "review_id": "OHkMw21r5A3uIEXowlqEQg", "text": "I've been to a few strip clubs and this one is ugh... okay I guess. The girls are really friendly though but are average looking and average dancers. One of the girls played pool with me for an hour or two and talked lol. It is cheap though which is always a plus. I believe $25 for a private dance and $10 for a table dance. My friend and I went there to watch the Heighsman and my friends dude won (Jameis Winston) and he celebrated by getting us a private dance lol. I'd say if you wanna have a fun night bring $55 a person. Also its free before 9 p.m. to get in I think!", "business_id": "vdYXCHXi1KlnGjeEu9yy2Q", "stars": 3, "date": "2014-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tFLi8-M6MOOrY5CsvWHRMA", "review_id": "gzjS00PS1bw9XKRGXTXErw", "text": "Not bad.\n\nHad a birthday celebration here with my large group of friends. Overall, not bad.\n\nPlace - far north of Charlotte. It was a bit of a drone, coming from the South Park area. The venue inside was just as I have remembered in Houston, with all the saucer decor. It was packed on a Saturday night. Thankfully, my friends and I managed to grab a table!\n\nService - out waitress was attentive and brought us out what we had asked. So she gets an A+\n\nSelections - they have a whole bunch of beers in bottles and taps. I chose this place for their Linderman's Framboise -- which they ran out that day! Man, talk about my luck :( The waitress was kind enough to suggest other beers.. She missed the first one (didn't like the beer much), but got it on the second one (better suggestion).  Sorry, forgot what those beer names were.\n\nPrice - decently priced. At least they were not over $10 for a beer like other places. So this is definitely an establishment I would revisit someday.\n\nMusic - one live man guy playing the guitar was cool. Played various music of 90s, 00s, and etc.", "business_id": "F-e-sWfVd3eCYll3BP1QFA", "stars": 4, "date": "2013-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PZV9KyEw3-MrkiLTVN30qA", "review_id": "bkcMVAI8i2EcTsISgaVLsA", "text": "i've had this several. the staff seems to be a bit distracted most of the time which makes it hard to get an order in but the beer is endless and good and the girls are smokin hot. Pet friendly outside. The food isnt so bad. Also cool promos and glasses.", "business_id": "F-e-sWfVd3eCYll3BP1QFA", "stars": 5, "date": "2015-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "P4aYuCRuI8mgJyoCXQtv7Q", "review_id": "F7_LjTmdpSAvBacMYpHKzw", "text": "Nice service and relaxing atmosphere. Food and drinks are very good, and they have daily happy hours deals.", "business_id": "i-cEO98lTS10WH30FyKvGA", "stars": 4, "date": "2015-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xkM3nFbgMWfiG8dBmkpfTw", "review_id": "aMRPRgJXFhdXQjpqeyKJpw", "text": "Great selection of beers and wines.  Fridays and Saturdays with live music.  Wonderful atmosphere!", "business_id": "1wIKHSHPOkywuOkyrXt6dw", "stars": 5, "date": "2015-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "sWGS8jdTQ9D1p7BbuJzGAg", "review_id": "xKXhbLB_HInbyzpKp-2qaQ", "text": "The waitresses are extremely rude and the food is cold and something you might find at a fast food joint. Don't waste your time unless you're out on the lake and have no other option.", "business_id": "Zc2IwSzGY63zkyhfNrr7HA", "stars": 1, "date": "2014-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Yw8wBKgA7rgTLSdDQHGcig", "review_id": "4Om7jEvfd2ZTAJJ5B8jPnQ", "text": "Excellent dinner. Had a New York Strip steak and Scallops for $22.00", "business_id": "_wZTYYL7cutanzAnJUTGMA", "stars": 4, "date": "2012-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "L-cexm4-3KDqtL6kGfjzBA", "review_id": "nOrASMLRJ6Ve_ZDGvCcW1Q", "text": "Hard to pass up the Road Kill Burrito.  Ask for the bucket of sauces.\nIt was as good as when I tried it ten years ago as it was last week.\nI don't think much has changed around here in 30 years, but that is definitely part of the charm.  I have heard the fish fry is good, but I have never been there on a Friday night.  \nLunch crowd has a lot of regular guys, quick and friendly service, prompt and hot food.  \nDon't go looking for the lobster.  Go for the specials, burgers, beer or the burrito!", "business_id": "G1qUGBNYNS220jKlPAlFsA", "stars": 4, "date": "2013-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "qN6SH4CKMG46LNkl8zL8sg", "review_id": "EBR-9N1jGQwE0VUtKQqe6A", "text": "Our waiter was very friendly, he had a southern accent. I could not tell if he was a high school kid or college kid but he was very friendly and provided great service. \nI had the lunch special - half soup and half salad.\nFor soup I had the chili- it was way too soupy. Come on, pack the protein, more beans and more meat please!\nThe cobb salad was not bad. The avocado dressing that came with it was delicious. And $7 for that? Oh yeah.", "business_id": "oudTF4EN_C8thENGiTQf-w", "stars": 3, "date": "2011-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "SEJWhA6MRIavK4b3pGxwTg", "review_id": "1x0bY7CSfGP1r1zAoX3NyA", "text": "I started out on a quest to find Madison's best fish fry and stumbled upon this place. One thing to know beforehand is they do not take reservations and they pack the place on Friday nights. Expect to wait a while. This is a nice little neighborhood bar on the east side of Madison that has a huge following. They offer several different types of fish for the Friday fish fry. Fried or Baked Cod, Perch, or Walleye. I went with the fried cod which was absolutely delicious. I couldn't turn down the garlic chili fries or their home made chili. Needless to say I could have used a wheel chair for the way out! It was by far one of the better fish fry joints to go to in town and I will for sure be back. My only complaint with the place was that they don't take reservations and they won't do carry out during lent (due to an overwhelming amount of business) but it's good to see a business that does so much business they have to turn some away.", "business_id": "HTplzElel_F_U_qhWuDKdg", "stars": 4, "date": "2013-04-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "hiJQnR90oBQCgzwE83SsyQ", "review_id": "pPxPD6bdsEEN3ozBYROxiA", "text": "Absolutely one of my favorite bars. It's definitely got a neighborhood vibe, but it's chock full of some of the friendliest staff you'll ever meet. And can we talk about the burgers for a minute? They are wonderful. One of the best in Madison, in my opinion. There's a light, airy bun and a perfectly greasy burger with your choice of cheese and grilled or raw onions. I work nearby and it takes every chubby bone in my body to stop me from going there every day. Food is ready fast, and you'll always get a smile. Cash only, but there's an ATM. (The ATM is also super-speedy, which is odd and exciting. It's the little things).", "business_id": "YlznKuAxnd7j3QfXFzoIog", "stars": 5, "date": "2014-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "b78znTlrN-YWw5_8MPxZSw", "review_id": "3S-Fi6S-xHEmXZHtrPdDkg", "text": "An outstanding, quaint, neighborhood bar.  Always a solid tap list, and the food is very good.  The cocktail menu is pretty creative too.  We've been there for breakfast on the weekends and dinner and I would recommend both.  Can get a little loud in there when it's rockin', but who cares.  Nice outdoor part too when the weather gets nice.", "business_id": "JJFoeKZXgi2_LeECDMkkoQ", "stars": 5, "date": "2015-04-16", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 3}, "user_id": "YJXQrON5IlW-MSibGtNrXw", "review_id": "h2zQPryt_ARvaBCBWkrzxw", "text": "You can do worse than Woody Anne's. Looking like nothing so much as a northwoods WI tavern dropped into near east side Madison, this cozy throwback is a fine place to waste an evening. The drinks are big and strong, the jukebox is better than you'd think, and the clientele is worth the random conversation. Plus the famous shuffleboard table. So, why only three stars? A couple of reasons; first, cramped is a generous way to describe the atmosphere. Second, the beer selection is really not good...unless you're striving for legitimacy with your bottle of Pabst/Schlitz...then, by all means, let your affectations fly. And third, the prices are surprisingly high, which is a problem of perception as much as anything. The \"townie\" atmosphere makes you assume your $20 will last all night with change left over. Not nearly true. The times I've been there, pints were around $4, which isn't bad, but not what you think you'll spend. But, hey, I quibble. Go in on a night Don is working and have him make you the biggest brandy old fashioned you've had in a while. Then have another. Then take a nap on the shuffleboard table.", "business_id": "pSYCSXgabSKKJrIEJG-FLQ", "stars": 3, "date": "2009-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "urDog6OhPoNKPJFUDob7AA", "review_id": "Keu4TQ9OjRLc9YKjzrto3Q", "text": "Basically just a sports bar with enough room for people to dance as well.  Cover is free for 21+ and typically $3 - $5 for under 21. There're two stories to this joint, but it still gets extremely packed on weekends which makes it very hard to get anywhere without several random people grinding up on you or getting spilled on/spilling some of your drink because someone's shoving past you.  As they've sacrificed sitting space for their pseudo-dance floor, there isn't really anywhere to sit, especially if you don't get there early to claim a table/booth (on the first floor at least; they have more seating on the second level).\n\nNote of caution: it takes forever just to get in since the line gets really long unless you go a little earlier in the night.  Other than that though, it's pretty fun.  A lot less seedy than some other campus bars such as Kam's or C.O.'s, and they have pretty good specials here.", "business_id": "RcHfSp2qCW8DFwpmpuNv4A", "stars": 4, "date": "2008-04-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "Ujrg8-TO4r55Yh8QkC0DEQ", "review_id": "M8b2ofiB-blbgCxJ0_9VAQ", "text": "I made the mistake of reading the reviews of this place and deciding to order food online. I had eaten at Geovanti's once before and was underwhelmed to say the least.  But who can turn down amazing chicken strips? WELL, it took over an hour and a half to get the order and once it arrived, it was soggy and lukewarm.  Yuck.  I can tell you that I will never order from Geovanti's again.\nIf you are at the restaurant, its 2 am, and you're drunk, then the food here is ok and the wait for it won't seem too long. Under those conditions, I say go for it.  Otherwise, stay away.", "business_id": "iCOvcfVRfi-f05aeqBLpKg", "stars": 1, "date": "2011-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HAej022BsQHMXSrvSLuTWw", "review_id": "9MCxaqG_rMOS-HY4DGyryg", "text": "I miss me a big ole' Murphy Burger with Bacon and Cheddar, hand cut fries and a Guinness.  I love those burgers, and I'll stop here every single time I'm in Champaign, which isn't often enough.  Hands down, one of my favorite places.", "business_id": "MVH3JOKpQvMTP4jxwBUhkA", "stars": 5, "date": "2011-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "liBVhSBnSlJ1xgFpeXum0A", "review_id": "IwRyNbNmKcOD5RVd8js7tw", "text": "if you want to sit in the bar you can go right ahead. A waiter or waitress usually comes in a minute or less with addicting chips and salsa. The food there is not anything great and not authentic but if your wanting to go to a bar and grill such as chilis or outback i would go to chevys instead.", "business_id": "WgmAx4SWy-71daxakDNd1g", "stars": 3, "date": "2007-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5ZIbB1o742vx77ZgO67ZQw", "review_id": "LmXn07p4B8UNnbW3Aunigw", "text": "The combination of both beer and wings from hooters makes me sick in the morning I continue to eat there for years. As always the servers fake like they care but that don't bother me as long as a get good service and I do. Plus they are easy on the eyes.", "business_id": "JhEA8qHfNmIh8c6OHXnaYA", "stars": 3, "date": "2012-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RKm4qpeQmb4nIcDg_f-7Uw", "review_id": "oZx3GkIlLem9ZkH5mzF4kA", "text": "I love going to Farren's for lunch.  I had somehow managed to forget about the place for a while, and when I went back it was better than I remembered.  I usually get the Steak Salad, which is excellent.\n\nI'm writing this review specifically to point something else out, though: Farren's is an absolutely wonderful place to bring my 17-month-old daughter.  The waitress with the curly red hair (whose name I don't know, unfortunately) offered us fruit and oyster crackers for her as soon as we sat down.  Later, since there isn't a traditional \"kid's menu,\" she offered to make a cheese quesadilla, which I took her up on.  It might seem funny to take a kid to a bar, but it works out great for us.  We can have high-quality adult food and she is accommodated as well as (or, in my opinion better than) in any \"kid-friendly\" chain restaurant.", "business_id": "IUhO58Il7gUEjl1RMEncHA", "stars": 5, "date": "2011-03-29", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "PxW60O6CIFysVSjNjlRE6g", "review_id": "cEOpcEjYGFUIltNwgIn73w", "text": "First time here..great atmosphere.  Only gives 4tops to 4 people unless dressed nice...so there is some unfairness there.  I even asked to be seated with my wife and they said no and then they seated a nicer dressed couple behind us there.  Also must be the only bar in IL that allows under 10yr olds at the bar...WAY ILLEGAL...food good though", "business_id": "IUhO58Il7gUEjl1RMEncHA", "stars": 1, "date": "2015-03-20", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "jel9UnpIGKyR78804jSyvQ", "review_id": "d-PEd2QPqmlkOrkZAikDlA", "text": "The only reason I've ever been to this hell hole is because I knew someone who worked there. You can see overweight sorority girls clumsily swinging around the \"poles\" in the back bar while attempting to get the attention of one of the bartenders and dodge the puke on the floor.\n\nOne good thing is that the drinks are RIDICULOUSLY cheap. shots are $2, pitchers can be as low as $4. I would imagine that if you went there in the afternoon you could have an enjoyable happy hour on the patio, but don't go anywhere near this place after 10.", "business_id": "1T2rnvl67Gk9Uc0gzsCKQA", "stars": 2, "date": "2009-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "wPJtYECbe7QpXnMx5MNjLA", "review_id": "n-QwhPAT52w9lEjlfz8Fdg", "text": "Location is good, drinks are usually on the strong side...HOWEVER, the rude service you can expect to receive here, far outweigh the positives.  Every single visit to the esquire, I received unfriendly, uninviting service.  The crowd in this place is 40+ and unless you fall into this category, the staff will make you feel very unwelcome.  Every trip downtown, I want to give esquire another chance, and every time I'm disappointed.", "business_id": "pPWre8lbVAssER6CN0uWMw", "stars": 1, "date": "2012-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jvcqOUPPVBXErhjfdejPng", "review_id": "v3dgmNJtDMLBsEbruqjQvg", "text": "Pizza is served California Pizza Kitchen-style. Some people play pool during lunch. Don't play pool unless you're at Brother's.", "business_id": "6U94ybDpNd0fTL7TIzb5Kg", "stars": 3, "date": "2012-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DTHQqtYGUK6dYEb2qbWI3w", "review_id": "dlHlGTcgPlrWTrNXC6ge2A", "text": "I liked the experience at Bacaro.  The menu featured interesting foods and preparations, the service was excellent, and the wine list was good.  Coming from Chicago, I'm spoiled with the level of cuisine we can experience on a regular basis.  Although this restaurant wasn't quite on the level of Chicago, it was very, very good!", "business_id": "h9xdY1NO4GnNijNChTy-8A", "stars": 4, "date": "2013-05-08", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "hA_8cYKY1p8O0TXWkGnrIg", "review_id": "E08PmlC5NMlw_iSwzUZp4Q", "text": "Absolutely horrible place! Snakes was treated like pieces of shit, and we WILL NOT stand for it! The manager is a complete asshole and doesnt give a shit if you have a good time or not, as long as he gets his money. Completely unprofessional and neither myself, or any of my friends will ever set foot in this hell hole of a place ever again.", "business_id": "SiwN7f0N4bs4ZtPc4yPgiA", "stars": 1, "date": "2012-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "K5oJ9aQth_Ltg3Awgjy-wA", "review_id": "A5XKjqMQ7TQQ6uCZmkkqoQ", "text": "I enjoy going to any Marjele's. They have good drinks as well as good food which is something you can't say about every bar.\n\nThey also have various locations so if this Marjele's doesn't suit your taste, another might will. This Marjele's is smaller so if you don't want to be bombarded by an obnoxious crowded bar where you can barely move around then this must be your lucky day!\n\nIf you come for happy hour be prepared to pay for parking unless you're coming by another means or you know a secret free spot before the meters are free.\n\nI always enjoy the music at Marjele's and of course whatever game is on.  Marjele's has a nice vibe so if you haven't been or  you're looking for your next bar, you should definitely give Marjele's a shot ;)", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 4, "date": "2011-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zNFIzjoEX3skz2zd7wE5Sg", "review_id": "TBxh7LAL7K1ncSBjEkqDeg", "text": "My coworker raved about this Jalapeno Chili Burger she got here, so we decided this is where will go for lunch. We got there about 1135am, were seated quickly and it was already starting to fill up.\n\nI love that they don't mind seperate checks because there was 4 of us. I got the Jalapeno Chili Burger with sweet potato fries. The sweet potato fries were delicious! Not hot but warm. The burger had no sauce whatsoever on it, we had to ask for mustard and mayo. I had one skinny chili inside my burger, boo! I barely even tasted the chili. There was WAY to much bun for this burger...and I wasn't the only one who thought so. I just ate my burger with one side of a bun, my coworker was just peeling off chunks of bread from her's.\n\nAnother coworker got this tuna crossiant sandwhich...next time I'll try that. She didn't like the swiss cheese that was on it but said it was very delicious. As we left the place was packed! Well inside, they had a few patio tables, but who wants to sit outside - its hot AND windy that day.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 3, "date": "2014-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XPnlMN5HCsmSfD-JzRcEKw", "review_id": "n0HX6WMe2T7o0hVXCjDH-w", "text": "Coach and Willies was the starting and ending point for Saturday's CitySolve event.  We decided to have lunch before running all over downtown Phoenix.  The service was a little slow considering they should have been expecting a crowd for the event.  I had the rosemary flatbread app which was quite tasty.  My friends had the lobster bisque with got rave reviews.\nI am looking forward to trying them out when they open the new Chandler location.", "business_id": "j8nyAaN_w5t6wYv-ni23sg", "stars": 4, "date": "2011-03-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "y2ClTl6I-utHQ4Les8zGTQ", "review_id": "1F5853udo_1UR9xXMr0R-w", "text": "Brittany, you are a TERRIBLE waitress. You should find a job that doesn't involve customer service.\n\nMy friend and I were super excited today for Wing Wednesday ($9.99 all you can eat wings). We walk in and are greeted instinctively but the female bartender who also tells us to sit wherever. I choose a table next to the double doors that leads to the outside seating area. For 10 minutes we sat there without even so much as eye contact or a smile from any of the waitresses. I see that there are two moderate groups outside (6-8 people each), but don't give it a second thought. Still no acknowledgment from anybody. After 15 minutes, my buddy walks up two managers who were fiddling with a tv monitor and 3 other waitresses surrounding them. My buddy goes, \"Umm, can we get some service??\" The female manager immediately appoints someone to go to our table. \n\nThis blondie informs us that **Brittany** is our waitress, but she would take our first order. A few minutes after she takes our order, the lovely Brittany shows up. We had already watched this girl walk right past our table about 10 times back and forth prior to talking to the managers. She apologizes, like a child whose been forced to do so, for \"not seeing\" us. A) Simple acknowledgment would have sufficed. B) My buddy is a BIG tall guy with a mohawk wearing a bright red shirt. How the heck could she not have seen us? She then makes a pathetic attempt to explain that she got slammed, and says that she will now take our order. I tell her that our orders have already been taken. We get our first round of wings in a fair amount of time after the order was put in by Blondie. I asked for ranch and never got it. My buddy's cajun wings were too salty so he only ended up eating 6 wings. Brittany came back and only asked to refill my friend's drink. He told her Mr. Pibb, and she brought back coke. She took his plate away and didn't bother to ask if he wanted more wings since it was all you can eat. He's a big guy!!! Oh that's right. She didn't take our order so of course she didn't know. Shortly after I finished my own round of wings. Typically, the girls will see that you have finished your wings halfway and immediately ask you if you want the next round put it. No one asked us this. So I finished my wings and asked my friend if he wanted to go or keep hoping that the service will improve. BTW, those big tables were long gone by then. It was actually pretty empty by then. The whole time we just watched Brittany try to calculate her tabs and collect her tips. \n\nMy friend wanted out, and he said he'll refuse to pay if they asked us. We head straight to the door and NO ONE bothered trying to stop us. Instead we heard Brittany,\"Sorry guys.\" as we left. They knew what was going on. This is the very worst service that I have ever had. I would have still tipped had we stayed til the end, but it was so terrible. My wings weren't even that great. \n\nIf you come here, and you get a girl that is tan, has shoulder length curly hair, and is named Brittany, ask for another waitress.", "business_id": "qsWxbgQwuomXvMseg23DGg", "stars": 1, "date": "2013-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "87xBol0dUS8cWao8F-8P9w", "review_id": "ZYR3CG4EZ2rY58UTcHcsUQ", "text": "O My Gosh! Me and my husband alwasy come here, and we love it! Everytime we go, it's always so packed we can barely move in and out of the crowds of people... but thats what makes it fun... They have three different dance rooms with different styles of music in each one. Me and my guy love the salsa/bachata room. They also have a nice poutdoor patio type thingy... when the weathers nice its ah - mazing! I never pay for our drinks so I couldnt tell you how that goes, but as far as the having fun part its def up to par!  We always run into friends and another plus is theyre open till 4am!!!! Obviously last call is at 2am.... but we dance off all our alchohal and still leave with a nice buzz.... I guess you would have to be into latin style music, but Im telling u... u wont be disappointed if your adventurous.", "business_id": "tK91rSBc8SWa3XEQwe8D4A", "stars": 5, "date": "2010-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jMZIqbehLtkCtfKhFizvyA", "review_id": "dGo9zB0vHosvHdOmJk26fg", "text": "My bucket list is to attempt to visit all HRC locations!!  So, I'm now crossing off Phoenix location!\n\nDined in and enjoyed all the memorabilia displayed. New location in downtown PHX next to the D-Backs stadium.  Seems to get a good amount of traffic during events but during the weekend it wasn't busy at all.  Sat at the bar ordered a sampler platter and food was pretty good.  Big fan of the restaurant and collected a new pin to add to my collection.", "business_id": "gkv2XvXpFgiq4Bb2XK7YmQ", "stars": 5, "date": "2014-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "VW7Fc5rqe7XjJdHOzMPo5A", "review_id": "xWK3gR7h5FOKmtAHIXDFxg", "text": "I tried a wine tasting a loved everything about the place; atmosphere, service, and wine and food were excellent. \n\nHighly recommend it!", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 5, "date": "2009-04-09", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "ST8Yzlk2MqKlcaLqL2djBg", "review_id": "eV59jfEubeucUHE9ykOOZQ", "text": "went here for easter brunch. paid way too much for a meal that left me feeling hungry. small portions. very small for the price. and there were flies....everywhere. it was like eating outside, except we were indoors. \n\nas far as taste, good. i was expecting more i guess. cool decorating and design. i hear the mac-n-cheese (something like 5 different kinds) is really good, but we probably won't be back. i hate swatting at flies unless i'm at an outdoor picnic and at least i leave feeling full.", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 2, "date": "2011-04-24", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "Pv5K9MFccM3cOrqUgiNjBg", "review_id": "6h8OiNtBokQ5SDacTrPnew", "text": "I really liked Cooper'sTown!  Yes, everyone who works there has to wear goofy eyeliner which is somewhat cheesy, but they were all also quite efficient and pretty entertaining.  \n\nWe went when it was very busy right before the baseball game, and were seated in about 20 min (after they told us 45min).  The food is ridiculously unhealthy, but SO GOOD.  Best bar food I've had in a long time.  We had the white trash nachos (frito pie), I had the pulled pork sandwich and he had the chili burger.  YUM!  We were craving more deliciousness after the game, so we came back and ate more.  Little disappointed that more game-goers didn't party at the bars after - kind of weird.  Since they are a block from the park.  Ah well, I guess there's no place like Chicago.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 4, "date": "2008-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "C2L5RW-Kb3RrnGrJDX_utg", "review_id": "6g1lsG9KE9Vm1mUmV1vn2Q", "text": "+++Band on a Monday night\n+++++Delicious wings\n+++++$2.00 Beers\n+++Magic Johnson's Shroomer Burger\n+++++Cobb Salad\n\nAll the food here is amazing. Fun environment, great set-up. Really as good as it gets. It looks like they have great lunch specials too. I met my Dad and his flight crew here after they flew in from Chicago. They loved it! They met some friendly Aussies before I got there so it turned into a party.\nI didn't try the big unit, but it was fun to hear the bell ring every time the waiter brought one out. Maybe next time. Great service- very fast.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 5, "date": "2011-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FOcPPtqqxxW_EX1ZSGhYBw", "review_id": "pKgXBpfj3HwuPxFpWHPOog", "text": "Welcome to Alice's overpriced tourist trap nightmare! Food is expensive and totally tasteless. Seemed like they used generic frozen ingredients for all the dishes we ordered. The fish fry and fish tacos were the worst. Seriously, $13 for 3 skimpy, dry pieces of fried fish? C'mon! The \"Mike Myers\" sandwich was just OK, but not really worth it. If you're a fan, grab a beer and check the memorabilia on the walls, but better get your grub somewhere else.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 2, "date": "2012-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gaEew7FuA5NkB1UkymCVzw", "review_id": "XklLj-WAVCODaP9dyElC9w", "text": "This was my first visit here and I have to say, I wasn't very impressed at all with the food or the service.  My husband and I and a few other people decided to stop in for food and drinks before the Tool concert but I think everyone else had the same idea and they were pretty busy, the wait was too long so we just decided to order straight from the bar and get our food and drinks to go.  To start with, there were only 2 bartenders behind the bar and like I said, it was super busy.  My husband had to pretty much push his way  up to the bar.  He had to wait about 5 minutes to place our order (he got a vanilla vodka screwdriver, a water for me, my daughter and I got the John O' Hurley Buffalo Chicken Wrap, and my husband ordered the Johnny Beef Depp) which wasn't too bad, but then the bartender just took off before my husband could even ask how we were suppose to know when our food was ready.  She ignored us and talked over my husband to other people.  Finally, when she did come back over, she was rude and said \"just stand over there, I will yell at you when your stuffs ready.\" and pointed randomly over to the side.  My husband then asked her if she wanted his name and she responded rudely again, \"we don't have that information.\" But his name was on the receipt... ??  Ok then.\n\nSo, we just waited off to the side and in the meantime got yelled at by a waitress and a bus boy that we were in the way.  The bus boy actually took the time to rudely show us a line in the concrete floor that we needed to stand behind, when we were standing where we were told to by the bartender.  Finally after about 20 mins our food was ready and the waitress yelled very loudly while pointing at us, \"Hey you!! come get your food!!\"  So my husband went over to get it and she had two different orders sitting there and she basically shoved one of the bags at him and said, \"is this yours...yeah I think this is yours.\"  Then our friend that was with us, who ordered before us had to ask her if the other order was his and she shoved it him and said, \"I think this one is yours.\" and walks away. He had to actually open up his bag and check to make sure that order was his.  She didn't even check the orders before shoving them at us!  Granted the bar was getting crushed with people and they were understaffed so I understand that, but being rude doesn't equate to return customers.\n\nWe ended up sitting outside at one of the picnic tables to eat.  My buffalo chicken wrap was minus the buffalo!! It was just a plain old crispy chicken wrap with ranch, way too much lettuce, a few diced tomatoes, and some cheese (I think in maybe 2 bites I had).  My wrap wasn't even hot.  It came with 2 sides....I chose fries and apple slices.  The fries were o.k. really had no seasoning on them and the apple slices were just the basic bagged apples, one of them was actually kinda soggy.  My daughters order was exactly the same as mine.  It was o.k. nothing impressive.  My husband said his sandwich was  made with good quality beef but without the au jus it would have been dry.  He said it was actually pretty good.  My husband thought the fries were good.  His screwdriver was VERY strong, which I would believe it to be a result of over pouring, but the bartender said when she handed it to him that she made it very strong on purpose because he was patient.  \n\nI know Alice Cooper is a huge sports nut so the ambiance is geared more towards that with T.V.'s all over the place, very little music related decor, kinda just comes across as a typical sports bar.  I really don't think I will go back in the future due to our food and service being bad.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 2, "date": "2014-03-28", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "0vkk-XoLOEB4vJrfWvxpnA", "review_id": "LsBWyyogoPT6h200PzlADw", "text": "Looking around I feel sad for he people who eat this BBQ. The meat was chewy like my dogs toy, cold like my ex, smoked? You say? Well yeah like a 15 year smoker on the patch. In Alice cooper I do not trust.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 1, "date": "2015-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a3qD7KcSmCwFMNRhf4F72Q", "review_id": "0QHXhZPm-cYwBzlLW8jFnQ", "text": "Great venue.  Great shows.  \nI've had seats in both the lower and upper levels, and both were equally good.", "business_id": "dNEAXZDrZ3TtK4d7Pl2Ydg", "stars": 4, "date": "2014-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uSAwLqs-TKoBfdGD-jvPOw", "review_id": "ht3hNVhvYZtWEyaQ5ZvG7w", "text": "Literally the only people that will give this place more than one star are lesbians. And I can understand why, having an accepting place to go to is important in the lesbian community. But that's about as far as it goes with this place, cause it is neither accepting or inviting. To start with this place smells like a port o potty, which should be your first clue to get the fuck out.  Secondly, I have never been into a more judgemental place with truly rude patrons and staff in my life. I understand I don't look like a lesbian anymore, but that's no reason to treat me with disrespect at this establishment. Also, I do not care how old you are and if you're friends with the owner or not, I will not stand quietly in the corner while you talk shit about Trans people. On top of it I got kicked out after just showing up because I was \"too drunk\" when really the bitch who picked an argument with me cause she wanted to say shit about another lgbt community decided to go tattle on me. You're right tho, I was too drunk, too drunk to deal with your dumb lesbian bullshit. Basically, if you're not a lesbian don't go anywhere near this place as you will get treated like shit and then get kicked out for voicing your opinion. If you are a lesbian, then enjoy hanging out in a port o potty all night with fellow closed minded members of your community. Worst lesbian bar in the nation. And yes, I have been to many all over this country, this literally is the worst lgbt establishment I have ever experienced.", "business_id": "c6sTwXAwIAgf2YQtA4ZWHg", "stars": 1, "date": "2015-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "D-wcjVIG36H0v-MF59JaEQ", "review_id": "jrLgfJK-fb15wXWI-LP_Kg", "text": "Greasy spoons unite!  Great menu, cool vibe, good service and good beers.  I was amazed at how efficient these guys are - they must lead the restaurant world in ratio of patrons served / grill square footage.  \n\nA great spot.  Don't come here on a diet though - my meal soaked through the paper plate and left a visible grease puddle on the counter top.  Psst ... the grit cakes are tasty and absorb the flavors of the meal but they are extremely greasy.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 4, "date": "2013-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_wX2eOhR6-WSZGlhrn6xpQ", "review_id": "KwfSMWDVE9obEJO5YZkupQ", "text": "Great food, great people. Highly recommended for  community oriented, easy going individuals who also enjoy good a Americana meal.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 4, "date": "2014-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "y_rxAKRyukI45H05BRgepw", "review_id": "Si9ZWT2SQTN5DtgMjw6HWg", "text": "Here in Phoenix for business and since eating by yourself is not fun....I wanted a local spot to enjoy dinner.  And oh boy did I find a GREAT spot.  Welcome Diner provides a unique atmosphere and the weather was awesome.  \n\nI highly recommend the KoKo - Chicken Biscuit Sandwich with a creamy spicy sauce, fried chicken, arugula, tomato and some other stuff with a side of watermelon.  Absolutely delicious!!!\n\nI also treated myself to the Beignets which were so good and I wish I could have finished them all but I was stuffed.\n\nAnd get a Hurricane; fresh and perfect too!\n\nStaff was great, friendly and if I am back in Phoenix again, I will definitely come back to the Welcome Diner!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2014-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mnDlD4GZbnUhaBdaa8VfTg", "review_id": "NrUH6R0HqTkCTo5OzVbN7g", "text": "Outdoor fun!!!! This little place knows comfort food BIGTIME!!!! Its a laid back atmosphere so if your looking for something fancy this maybe not for you but if you\ncan humble yourself into appreciating good comfort food and a backyard setting then this is the place for you! Also, a great spot to stroll into in the morning after a huge night out on the town their Bloody Marys will make you feel just right again!!!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2Iv47opzcznKPEfTjpYCPw", "review_id": "nMVegipcoFMmYbsRG71aqw", "text": "This place is amazing! Went for some late night chow after a show. Service was great food was soooooooo good! I had the delicious best ever vegetarian jackfruit sandwich and my friend had the Mac n cheese. Recommend!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-04-06", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 2}, "user_id": "GrSixRnGIxNUJ1Cn5DNX9A", "review_id": "lxvjXxVL5QgRH7RCNaQjcQ", "text": "In the din of a South Central Phoenix neighborhood lies a throwback gem serving up some of the most creatively constructed southern comfort dishes this side of Paula Deen's mint julep soaked dreams. Run by a bunch lads that seem to be the progeny of a hipster-hippy relationship gone incredibly right the place has a great atmosphere and spot on service to match their menu.  A definite must stop when you make your many forays in the increasingly attractive downtown corridor.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 4, "date": "2015-05-30", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 6}, "user_id": "jqVeTSin5GeRm0ceSg-PBA", "review_id": "7tFUmc1mn0z0qgoprkoY2A", "text": "Another place that is really serene and makes you forget you are in a large city! I really liked the Desert Botanical Gardens and I am totally not into flowers or botany!  We had been to DBG once before for Luminarias, but it was so dark that we couldn't see much. I'm glad we returned in the daylight.\n\nWe took my inlaws yesterday after brunch and they absolutely loved DBG. My father-in-law is totally into photography, so DBG was awesome for him. We saw tons of people with cameras, so it is a photographer's haven.  I really had no clue there were so many types of cactus. There are hands on activities scattered throughout (probably for kids on field trips) and boards with information, which comes in handy on the Sonoran Desert Trail when you want to figure out which mountain in the distance is Camelback, Piestewa, Four Peaks, etc.  We saw little lizards, hummingbirds, quail, and ground squirrels while wondering around as well.\n\nThere is much to see and you can get through the gardens as quickly or as leisurely as you would like. We spent about two and a half hours there, which I think is a perfect amount of time. You see everything and are ready to leave by the end.  A very nice place to take visitors on a nice day.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2008-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "JDE_PFMoii44T2ySwLnBhQ", "review_id": "mXpsf4O44rNKdS6OmU1U2Q", "text": "This is amazing place to visit in the Phoenix area. Of course, the flora and fauna of this desert is unique and there's no better place to get a comprehensive overview than the botanical gardens. Of course, they are also beautiful and interesting. \n\nI went with my 82-year old father, who has osteoperosis and emphysema. I was concerned he wouldn't be able to get around. However, the gardens had motorized carts available. Also, there are different trails with different difficluty levels. There are lots of shady places to stop as well as little cafes and etc. \n\nThe docents are very knowledgable and really love what they do. Their enthusiasm really adds to the exerience.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2010-03-02", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "2nXFEyQ06RfcdAXIPbxuwA", "review_id": "36FYiO4bJ2JT9t_233fWsg", "text": "When I want to go out but not spend $100 on entertainment and also get some exercise in at the same time and see some beautiful Arizona landscape, the Desert Botanical Gardens is the best place I can go. I enjoy walking around the Garden looking at all of the flowers in bloom and all of the different kinds of cactus. I also enjoy when they have different exhibits that you can see as you are wandering the garden. I really enjoyed the Chihuly Glass artwork that was displayed a few years back. \n\nProbably my favorite time of the year to come here is when they have the butterflies. They are so pretty and this year there were so many of them! We went this last weekend on my day off and the weather was perfect and we just had a great time. I also get to brush up on my photography skills here the best because I can take some amazing pictures of flowers and butterflies. \n\nIf you want to see what the Arizona desert is all about, you need to come here to experience it first hand. Its not only about dirt and cacti. There are flowers galore as well.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2011-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Zw2HgpyTgJf-l2yOSWff5A", "review_id": "t_LaWnek2l2-b7e7YeA8yA", "text": "Amazing place! Originally looked at this for a wedding spot, but found ourselves taking more pictures and looking around at all of the beautiful gardens opposed to what we were originally there for lol! If you're in from out of town, its a must visit!", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2012-04-10", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Znu5KKqytHfmjbXfQo3f4Q", "review_id": "bBm-XpyipNYsztA04WXugA", "text": "Hadn't been in a long time so went back to see Chihuly in the Garden, and remembered why I wasn't impressed the first time around. On the plus side it is very well maintained. But for me it was too much so. I think I saw as many little placards describing every plant as I saw plants. It feels far more like an exhibit to me than an honest garden of any kind.\n\nI liked the diversity of Arizona regions they have on display, and there is some nice historical information, but overall for far less money you can get out and experience some of the great trails all around our state. Take the time and see it for real instead of in a plant-zoo.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 2, "date": "2014-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w8RlJ9SXG54Jte4_02XG2A", "review_id": "-LJ9bCbD3AM3yeSes3SPzQ", "text": "The Chihuly exhibit makes it worth another trip! As an Arizona native, I had not considered returning for some time. Loved the glass, seamless integration with the cacti. The blooming prickly pear and bird watching was also nice. Hurry before the exhibit leaves May 18!", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2014-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "cGnaft9JhI10HUQdtHGvRQ", "review_id": "g9bBsb4R2Sy_UgTqcEnDVw", "text": "What a wonderful place to visit. Especially at night during the holidays. This past holiday season the Chihuly exhibit was magical. Treat yourself and go.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2014-05-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "45V7-1r79DEG0HbuaKYIlg", "review_id": "S0raJAhFEA8zGlZCFrw8eA", "text": "One of my favorite places in town!\nDBG can be many things to many people - Fun, Entertainment, Relaxation, Education, and Inspiration!\nWhile the plants are the point - and they have a HUGE collection of desert plants, cacti and succulents, it's easy to find so much in the garden that the plants are merely a breathtaking backdrop.\nThere are classes available (from gardening to cooking, photography to yoga - a HUGE range of learning courses - camps for children, too!), concert series, cultural celebrations, dinners, festivals and more.\nEach spring, the butterfly pavilion comes alive with many species of butterflies - on my last visit, our timing was lucky and we got to watch one emerge from her cocoon. The colors of the desert in bloom during the spring are intense and amazing. The desert takes on a completely different feel when the cacti and wildflowers are in bloom...Desert Botanical Garden provides a place to see several regions of plants in one easily accessible place. \nWhile conveniently located on the Scottsdale/Tempe/Phoenix border, once inside the property, it's easy to forget you're in the city. It truly is an urban oasis.\nWell worth the cost of membership if you go more than twice a year, too!", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2015-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "8bD02jWdTqS7ComJyGaT1w", "review_id": "G0oijTst2naIWQG8cWUuRw", "text": "My coworkers and I were in town from Buffalo for a work conference and were at work events all week. We were celebrating my 21st birthday and in search of a fun Karaoke bar and we found The Breakroom!  The staff, the cheap drinks, and the atmosphere the were all amazing! We had a great time and are very happy to have found such a down to earth place to celebrate. Thank you to the owner, karaoke dj's and the bartender for a great time. :)", "business_id": "W41CEzdKJe8wdDB-Rd6KJQ", "stars": 5, "date": "2014-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4E_nPWw89FLFHdNsEgMH-g", "review_id": "8vye4SXpIjBxvy2WaNfdhQ", "text": "Wow... This place is something else. There really isn't a bad seat in the house so no matter where you sit, you will be able to see any comedian or band that is on the stage. Be advised that some bathrooms are larger than others so the one closes to the entrance for woman is the one to go to during intermission as the wait will not be as long. (the other side of the venue, be prepared for that line to be VERY long). The seats are not the most comfortable so if you are tall, you may want an aisle seat. If you are of larger statue, you may want a table sit down front because again, these seats are not the most comfortable. I will say that leaving the venue via your vehicle was the fastest I have ever been ushered out at any venue. They have that down to a science. All in all, I think if this place got a much needed face lift it would be a solid 4 stars.", "business_id": "BcBxTyj09Wu-w0KA1QvKTA", "stars": 3, "date": "2015-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "6CoPOb3FMbnLUXC-qMg4rg", "review_id": "cu376NjribOkfRJsWssFcQ", "text": "My two friends and I went for lunch today and the service was really bad. There were several tables loaded with dirty dishes around us, which, when we left an hour it so later, were still the same way. It took so long to get our food that I did not order a second portion for fear that we would have \nto wait too long.\n\nThe food, when we finally got it, was tepid soup and a spinach salad without much dressing but trying to send it back was not an option. It looked as if they were short on staff and very short on supervision. \n\nI will not be going back for some time. This experience was very frustrating.", "business_id": "hzUOqxpcnYYBgLlrgvjQYQ", "stars": 1, "date": "2014-04-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "79XESLXqHug_X8MMUETnWg", "review_id": "iJIQzPP_xjbYJXiBmoUrlQ", "text": "Love this place!  Since discovering the George and Dragon, my friends and I make it a weekly stop.\nThey have a huge selection of beer!  Also, a late night menu of home-cooked food... which is actually delicious!!\nThe outdoor patio is a nice addition, especially for socializing and smoking!  Really, the only decent place to hang out in the NorthCentral Phoenix area.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 5, "date": "2010-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "htpCOKrgn_-F7gXgBNKQiA", "review_id": "7rhiHgzNT7nYU9dsE6Jw_g", "text": "I've been popping into the George and Dragon nearly every Thursday since last April for trivia nights.  I like the place.  The trivia host is entertaining and the place feels worn in, but not worn down.  I feel comfortable and welcome every time I visit.  Most weeks I end up ordering a couple beers from the rather large selection.  The drink prices, while high for some people's tastes, are comparable to what I've seen in other places.  Imports are going to cost more, it's the price you pay to have a selection of Boddington's, Murphy's and Guinness all in one place, among other things.\n\nNormally on trivia nights I don't end up getting food, as although I find their portions proportional to the prices, I don't feel I need to eat half my weight in fish and chips in one sitting.  I have no qualms with the quality on the few occasions I've grabbed some eats, for example the curry chicken is very flavorful and highly recommended.  The dragon wings are another of my favorite, spicy but not overwhelming.  The fish and chips, as previously mentioned, are served on a giant platter and have generally been excellent.\n\nI recommend at least one visit to this bar.  Don't be scared off by the divey look of the pub-front.  The F.C. scarves adorning the ceiling, British booze advertisements on the walls, and the cozy but not claustrophobic seating arrangements make it a unique place in the middle of the desert.  If you do visit, pop in on a trivia night so you can listen to the host demean the guests with some clever snide remarks and give yourself an entertaining diversion for a night.  Who knows, you may become a regular before you know it.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 4, "date": "2012-04-06", "type": "review"}
{"votes": {"funny": 9, "useful": 10, "cool": 9}, "user_id": "cRyNICH0mhjxagvSyVr60Q", "review_id": "CEIc0zDOWkUjowV3_dVLmA", "text": "This is probably my favorite neighborhood bar, and mostly because it's just a hop skip and a jump from my front door - or a scoot on my bad*ss kick scooter. (like a razor scooter, but more awesome)\n\nLock that puppy up (again, bad*ss scooter reference here) on their bike rack, hop in with your pals for a late night clandestine meeting of the minds - at least that's what it'll seem like after a few of those $3.75 well drinks on a Friday at 9 or 10 pm, when in reality, it was just two or more buffoons boozing around making fools of themselves.\n\nI'd say that I'm more a fan of neighborhood type bars than dance clubs, mostly because they tend to be lighter on the wallet than the latter. Call it a dive if you must, but I wouldn't classify George like that. Sure there's the obligatory pool tables and darts that make up a good dive. On any given evening, you might run into someone toting along their children for the 'grille' part of this bar and grille, but really, it's certainly more bar than grille by hefty proportions. I can't recall how many nights have ended at George, but you can rest assured that there will definitely be more.\n\nHappy Yelping Phoenix, come meet George, he's kind of awesome.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 4, "date": "2015-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PgINUOMQqSpro4CF5xsziA", "review_id": "B-0Xwxrsv21dDVl34uZ7uw", "text": "Always a good place to come. I love happy hour as all appetizers are half off! Makes for a decent break on the wallet. Usually pretty pack especially on weekends. Come early!", "business_id": "cjUmPLRT43wN9Z87A9BOpg", "stars": 4, "date": "2013-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "tcWQQaDc0BH1dwhyl6ynaA", "review_id": "0ZuBNbeL8Yiuuf5dPm8Oqg", "text": "Everything you expect it to be! A great hangout kinda joint. Great jukebox plus pool tables and darts. Hanratty's has a really laid-back atmosphere & is a great place to start your evening. The happy hour specials feature a nice variety (usually a coupla liquors and shots), not just the usual well drinks. They also host tastings fairly regularly. If you want a chill place to start your night...or just hang out w/your pals...go to Hanratty's!", "business_id": "VC0VbRhQqvXpolK3pFuZPw", "stars": 4, "date": "2011-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AgLj_zfjlJJWf3J6aNwalQ", "review_id": "oBPlT2c-BGkGC9ZkugqYAw", "text": "The beer and the setting are the highlights at Sonora Brewhouse. Best thing to do here is to sit back in the old brick buildings and cool off with a pint of Light Rail Cream Ale, which is light and smooth but not at all creamy.\n\nThese folks are serious about their brews, and the friendly staff will bring you a sample to help you discern the difference between a regular draught and its cask-conditioned counterpart.\n\nWhile the food isn't a disappointment, it's nothing to write home about either. I can barely remember the Kobe beef burger I had on my first visit. The shepherd's pie I had the second time around was good enough, but the so-called horseradish mashed potatoes on top just weren't horesradishy enough to satisfy a kid who grew up in the horseradish fields of southern Illinois.\n\nI give Sonora Brewhouse a solid recommendation as a spot to drink, but bring plenty of friends -- the place can be empty on a Saturday afternoon. It's also a worthy addition to your light-rail pub crawl, just a short walk from the Central/Camelback station.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2010-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BKP-vxzZEk6NIyb3a36PCg", "review_id": "mUrwvcw9H3cBDQSisFRKAQ", "text": "I went there today for lunch if not thinking about being saint patrick's day.  The place was fairly busy but Mollie made room for us for us to bar.  The patrons were friendly it was a nice atmosphere.  My friend had pulled pork sandwich which he always likes and I had the fish and chips.  At $14.00 the fish is a little expensive but was served with a nice size piece of fish and the good serving of fries.  The breading on the fish is a little thick but has a nice taste and I would happily have it again.  It was a good lunch, a fun time and worth the drive from Chandler-and the beer was great too.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2012-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 7, "cool": 2}, "user_id": "l-_P_HbkVlsllo-ix1V6LA", "review_id": "96hQMQ6V7ggy62KeBLCztQ", "text": "I am a fan and supporter of local breweries here in the valley. Last night I visited two of them in the city, SunUp was my second stop for the evening. So first impression when I walked in was that this place has got some interesting history to it. There were pictures of past figures and well known people within the community. \n\nThe bar area has some limited seating so if you wanna head there with some friends, somebody needs to get there early. The rest of the place has plenty of seating for more private conversations. The brews are not too bad and I know I have seen the sunup crew at alot of beer festivals and events, so I do like that they go out there and represent who they are, gotta keep local brews alive! \n\nLlast night for me was two pints which were descently priced HOWEVER with my Yelp check-in, I only paid one dollar per pint and even got discounted appetizers! I was shocked but after talking to my bartender, I come to find out the owner is crazy for yelpers! So if you don't minda smaller size bar and a not too bad central location, go down a get a pint or two for a buck!", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2014-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LqGVlCgY6z4fVbOuHjE0fg", "review_id": "lalj52gCgP4wJHxmxskoHg", "text": "Finding good food and beer on tap in Phoenix is not difficult.  Finding great grinds and great brew is why I'm writing this review. I'm an IPA drinker by nature and this place did not disappoint. Check out the Sweet & Spicy BBQ Pork Sandwich with melted cheddar cheese on a honey roll.  Mmmmm good.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2015-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "IRoWn-q3RTOoFVRWsUxGig", "review_id": "Kul2JnKgK0cZ9_YeP87MCQ", "text": "Been here a couple of times. The first time was to take a date there for his birthday dinner. He is Italian and I wanted to take him out for a good Italian dinner. \n\nI have little experience with Italian so after asking around I found out about this place. He gave it really good compliments (yay for me picking a good place!) and I thought it was good as well. \n\nFirst time I went we had AMAZING service! Second was decent service, not quite as attentive as the first time, but also it was a winter formal night for a high school nearby so I'll let it slide.", "business_id": "3CSaqRNvYg7ZdN2zwxwzVw", "stars": 4, "date": "2010-03-04", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "Ovpa3S8xD96dLE5eDxcxJg", "review_id": "u6qZA_KSxz5zCpBeg6dzTw", "text": "A good jukebox, a nice section of pool tables and plenty of seating make this one of my favorite old school Phoenix bars. \n\nYears ago, they had a reputation for being \"soft\" on ID's, so I was a regular when I was home from school my freshman year in college. Since then, apparently there has been some sort of crackdown but the main things that make it a good spot to kick back with a few pitchers and friends remain unchanged. \n\nYou'll find that around thanksgiving and Christmas the crowds are overwhelming, as it has become the unofficial reunion bar for Phoenix natives that have since migrated to other parts of the country and world. The rest of the year it is easy to find seats at the bar or one of the tables, and the laid back divey atmosphere makes it easy to have a good time.", "business_id": "_GS1R0LTwr6h8rMWY_8U9Q", "stars": 4, "date": "2007-03-02", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "q9XgOylNsSbqZqF_SO3-OQ", "review_id": "HNcM0uD6ZMehY3777xxuFg", "text": "I had almost forgot about the Rhythm Room, and then in the space of two weeks I have been twice. I saw Tim Reynolds (best known for his work with Dave Matthew's Live at Luther College) and the witty and wiry electronica band from the UK Fujiya & Miyagi. Neither of these bands would be considered Blues, but this gives you an appreciation for the diverse talent the Rhythm Room brings in. \n\nTheir sound system is great, the drinks are strong and the staff is friendly. The only improvement this place needs is a Marquee sign to remind us of all the great shows happening on a nightly basis.", "business_id": "JZJqJadk9pSoCGT7VTwBvg", "stars": 4, "date": "2009-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hbYYsn15_75YGgCnmklQjA", "review_id": "2o2lkSt0a4d-i39UZZJeRg", "text": "I've been going to plasma for a few years now met some amazing friends. This place is really awesome! It really is the gay Cheers!", "business_id": "lF1xl8uiYRSLCibhb31sew", "stars": 5, "date": "2014-04-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "ADtC8529e0V4CGgNLaHQXg", "review_id": "he4VkPyRfZU1RMJBTFydXQ", "text": "Had a good time today. Bartender chose to wait on a twinky boy who just walked up using a credit card who was behind me.\n\n Guess cash doesn't matter here. No more gay cash from me today at the chili cook off. See you in a year Roscoes.\n\nKyle needs to go to customer service school.", "business_id": "7srDFwPPnzBaQoPW55Dc8Q", "stars": 2, "date": "2015-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-9mljS0O9mwdOnGv-Oea3Q", "review_id": "mWWGi91i3wwn8F1WYmiGeQ", "text": "This is what I call a real dive bar. And truth be told I like to find a hole in the wall or dive bar to sometimes escape to. Yet I'm certain this one has probably seen better days. \n\nThe bartenders are nice folks, the regulars I met were pleasant people and even friendly. The well liquor is rather bad, so I guess that makes the happy hour prices fair $2.50 for well drinks & $2 for beer. \n\nThey serve food but I didn't try anything. Overheard they were having some cooler problems so I decided to pass. Most of what is on the menu will set you back about $8 bucks. But I saw that their burgers are hand formed not the frozen pressed blocks of beef so they might be as good as some people report.\n\nThey have really nice TVs and a few of them if you wish to watch something. \n\nBut even though I want to like the place for being a dive bar steps from Camelback Road and holding on, truth is I have been to better dive bars with better menus and well drinks. Hang in there Harvey's.", "business_id": "ntJAKLAq0cXzzdFgPoo0Iw", "stars": 2, "date": "2010-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ovpa3S8xD96dLE5eDxcxJg", "review_id": "LNGTGA7W0X-H-oTfHb8rrQ", "text": "Next to Richardson's, PCG is my favorite American style resto/bar in this sector on the grid. \n\nI refer to this as part of North Central Phoenix, though those sorts of definitions begin to get muddled if you look closely enough. The Phoenix City Grill is a wonderful date restaurant, with excellent service, a classy, upscale decor, great service, superb wine, and fair prices. That combination is hard to come by, in my experience, so I have always been a fan. \n\nThe cuisine is new style American, with some Italian and western european influence. I have had a salmon pasta dish there a number of times that I always am happy with, but more than anything I am drawn back by the great wines and desserts. \n\nThere are a couple of Chilean wines that I highly recommend, as well as any dessert that they offer. \n\nIf you haven't been and you are looking for a nice new spot to take someone, PCG is a great call.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 4, "date": "2007-03-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "ZrUZtLgLOn15v2NIZl-oKQ", "review_id": "AmAT1KccsyVz3UJBrcHUsQ", "text": "I just have to add that the owners here really know the definition of good customer service. A month ago, I took out-of-town guests for Sunday brunch. Part of the reason I chose City Grille was because they had a promotion where you could get a free appetizer for checking in on a Smart phone. All you had to do was show your server. Well, my server, no matter how nicely I approached the matter, kept insisting that deal was only for people who brought a print-out of an email--even after I showed her on my phone what their own restaurant's Facebook page stated! She just shrugged and said \"Well nobody explained it to me.\" I don't fault her if nobody told her. But I do fault her for not even bothering to say anything like, \"I don't know anything about that but let me go check with a manager\" after I showed proof. It wasn't even the appetizer but the principle of the matter.\n\nI left a comment on the restaurant's Facebook page--very diplomatic, not with any self-entitled overtones. Their social media person asked me to email him directly outlining what happened. Less than two days later, he wrote me, with the owner copied in, apologizing and offering to send me a gift certificate for dinner for two! \n\nThis update is not to say \"Woohoo! I got a free meal.\" It's just an appreciation for when a restaurant is willing to own up to a mistake and try to make up for it. It also sounds like because of me, they will remember to make sure all servers are aware of promotions like that. And when I did go back for my free meal, that same server was there, lol. Luckily I had another server who was a lot warmer and approachable.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 5, "date": "2012-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wG-TNeCUUcWxjwYRZWPbuA", "review_id": "-lJ23LeNY-PR5iOshQvkGQ", "text": "I ordered a half chicken and potatoes. I was surprised to have received a half of a gaming hen chicken. I was very good, but i was wanting more. Small portions.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 3, "date": "2014-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "cQfnnQhGCFzd0P1MsJu21g", "review_id": "C7AyDClWlVdHf15cASGSAw", "text": "Nice place to catch up with your girlfriends over glasses (and more glasses) of wine. Patio Platter on the Patio...must I say more?", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 4, "date": "2010-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9VBrPQxkQTsQBAcjYM8FIA", "review_id": "YmEtZPfDsMOpq1GgKuiV9g", "text": "Really Fresh ingredients. I went with the Duckling which had a very unique but pleasantly great taste. I will absolutely go back.", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 4, "date": "2013-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "52MX_-irDVA-r5Of87CDpg", "review_id": "3DflfrR7Fp6FK9NmY543CA", "text": "Came here on a whim from out of town, and had a great time! Cheap drinks, nice locals, glad I stopped by. Service was great as well. I was also happy to find they had sunshine wheat on tap, it was a great taste of home :)", "business_id": "mgllPJA6NQXlJurFWAkqQg", "stars": 4, "date": "2010-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "i8kR-Qnn3xd9EnpCWs9POQ", "review_id": "OcGEgsqPRdSjNO6SUQuxtg", "text": "As we all know, Condor has been to many Pubs in the Queen's Empire, London, Sydney, Dublin, you name it. Yesterday, elbow to elbow at the bar of The Armadillo Grill, among kindred Sportsmen in the Valley betting on the Sport of Kings (Horse racing), at the suggestion of the gorgeous Armadillion Carrie, I tried \"Richard's Pub Burger\" from the Specials Menu. Needless to say, the juicy beef, cheddar cheese and delicately fried egg sandwiched between a crisp, toasted Thomas' English Muffin, rivaled the best Pub Fare in the world. Try it with a cold beer or, as my friend Jimmy said, \"with a Bloody Mary! Breakfast of Champions!\" Now if I could only pick a winner at Turf Paradise!", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 5, "date": "2010-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "N-djl5SBsrDVkLvWvfIO5Q", "review_id": "zKdK0m5rFxEN17SjM9HC-Q", "text": "Great man cave!!! The bar area has plenty of TVs and OTB if you into the ponies. I had a very good salad and fish and chips that was done just right..  Just right? Yea the fish was not fried to shoe leather and the breading was fried to a perfect golden brown!! There is also a dining area as well away from the bar if you do not wish to man cave it.... \nFriendly service and daily drink and food specials puts this on my \"go back to\" list when in the PHX area.", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 4, "date": "2013-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "APLIPfq1Rf8QyhHHk2uAyA", "review_id": "G43KP_sbpvt-Z9mKoYw4Sg", "text": "Trendy, yes. Small, yes. Dark, yes. But I like this place. The doorman was friendly, as was the bartender. My friends and I found a place at the bar and watched the room fill up. It was a Friday night, too. The music was fantastic - electronica with just enough funk to keep your foot tapping. The wine was incredible. I tried the house Cab. I was highly impressed. I would definitely go back. I like the location. If friends were visiting out of town, I would recommend this place - it's great for those who like lounges, a variety of drinks and music that won't put you to sleep.", "business_id": "peA3F-PnIfijYr8HuG-A-Q", "stars": 4, "date": "2007-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Vi77s0AS-cIzPoBq5AbEaQ", "review_id": "_-W8pHTJO9DZO8KIKEw5-g", "text": "This place was actually pretty hard to find as there are not signs outside the building. I would recommend using the valet  as the parking behind the building ends up being a lot more expensive.  \nWhen we got there the place was pretty full, therefore, the service was not the best. Our waitress took about 30 minutes to come around and get out order so our experience was not the best. \nThere was also a DJ spinning all night long, mostly R&B and hip hop, but there were all today's hits. The place has a small dancing floor, but to be honest most of the people were not even dancing. Not a bad atmosphere but not the best bar/lounge either.", "business_id": "peA3F-PnIfijYr8HuG-A-Q", "stars": 3, "date": "2013-03-18", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 0}, "user_id": "Ofxlhi_HKp7myFDpwg9aIA", "review_id": "Zch3_tilPVyJXWbwUyV1JQ", "text": "In all seriousness, I have heard good things about this place from several people, I kind of walked in and was trying to think what the hell was the theme here, seriously if PETA ever went in here they would close this place down, with stuffed animals on the walls they would have a field day. I would say from start to finish I was thoroughly not impressed. I will honestly say that I will probably never go back to this location. It wasn't even that the food was just blah, but the fact that the staff seemed to ignore me, maybe I was under dressed for this establishment. I guess my money truly is no good here, because I honestly did not feel the staff gave two fucks about me the whole time I was there. Garbage. I grabbed a card on the way out from I believe was the hostess. Torri McFarland...you and your staff from the top down got work to do this place sucks!!!", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 1, "date": "2009-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "3gIfcQq5KxAegwCPXc83cQ", "review_id": "mxKaX6QHpJQFaNnuNEN_UA", "text": "Ok, I am totally breaking some of my general Yelp rules here...but I have to, because this place was so good. I generally don't give 5 stars on a first visit and I also don't generally give 5 stars to a chain restaurant, but this place really blew me away. The BF and I went here last night for Restaurant Week. We had actually just gotten our reservation because we had a res somewhere else but then had to be out til after the other place closed....lucky I guess. So anyway, we get there and there is complimentary valet (which I generally find annoying, but was nice last night because we were running late). We came into the restaurant and immediately felt welcome, everyone was very friendly. We were seated right away and our waitress, Sarah, came by to explain the menu. She was super friendly and helpful and really on top of things, so that was nice. \n\n\nOk, the food: After being seated, they bring out an assortment of warm breads with softened butter. And I mean a real assortment: cracker type bread, a roll that looks like an everything bagel, delicious onion bread, and a wheat bread with raisins or some kind of fruit in it....each bread was delicious (take that Atkins!). The BF ordered a Manhattan ($11.50) and said it was 'damn good' and he is a regular Manhattan drinker, so I gotta believe it. So start, I had the french onion soup (on Sarah's recommendation) and the BF had the field greens. The soup was SO good. I generally am not a huge fan of french onion soup because it has a weird texture, but this one was full of flavor and had a ton of cheese on it. I literally was peeling cheese off the side of the bowl and eating it (I know, not so cool in a fancy restaurant...but it was so tasty!). The field green salad was light, with a flavorful, but subtle vinaigrette. It had several types of tomatoes on it, which the BF loved. For mains I had the filet mignon and the BF had the kona sirloin. They came with a little share plate of mashed potatoes and green beans. The sirloin was delicious...it had this amazing sauce on it (don't know what it was, but it has some great caramelized onions in it) and was cooked perfectly. The filet was equally good, it was simple, but cooked to perfection, it was melt in your mouth and had the perfect steak texture (no fat, gristle, anything weird feeling). I will say, the filet was even better with a little of the sauce from the sirloin, but I understand why the serve it the way they do (steak purists and all....). The mashed potatoes were divine. They were some of the most creamy, buttery mashed potatoes I have had. I wanted to lick the plate. The green beans were also delicious, very well seasoned and served with onions....yum! Now on to dessert- We shared the creme brulee and the chocolate espresso cake. Both were amazing.... When I had my first bite of the chocolate cake it was like the most intense chocolate explosion in my mouth. The espresso just adds to the intensity. I will say this, this is a dessert to be shared...it truly is too chocolatey (and large) for one person....and I love chocolate. The creme brulee was equally amazing, it was creamy with just a hint of crunch, but the most impressive part (to me anyway) was it had blackberries on it that had no seeds. What?!?! Where do I get these blackberries? They were phenomenal! \n\nAt the end of the meal, Sarah went outside and had the valet bring our car around before we even left so we didn't have to wait....ummm, seriously awesome service. \n\nSo, overall, the meal was excellent. I probably ate about 3000 calories....sorry thighs....but if I got to choose a place to destroy my diet, this would be it. The restaurant week deal was amazing too because my steak alone was 41$, but the whole meal was 30$ on special. Insanity. I would definitely come back again.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 5, "date": "2012-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6GvAMZL4XyPWYjyJDc3J0A", "review_id": "-BeIAvVuG8pKZGll69lbVw", "text": "Fantastic  dinner. Highly recommended  if you are in the area the service was fantastic. Waiter was highly  imformative about the menu", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 5, "date": "2015-03-26", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "1__2RnJTT0cqkriEVGaQZw", "review_id": "lF1ALJzFPtf-Oi49sXYBqQ", "text": "One-Visiting from Austin,TX.  This might imply that I like my food on the spicy side so my review should be taken with a grain of salt.\n\nTwo-the online menu sounds fantastic. Reasonably priced,  and somewhat regionally sourced food.\n\nThree-Which came first?  The chicken or the egg?  Or in relation to Keegan's, the geriatric clients who pay the bills and fill the restaurant OR the menu items which start out sounding so promising and end up being bland, bland, bland which caters to the existing clientele.  \n\nI tried the fish and chips, with a beer sampler.  It's usually pretty hard to screw up.  The slaw consisted of fresh cut cabbage and other vegetables smothered in 99% mayo.  No sweetness of pickles or relish to counteract the creaminess of the mayo. The panko breaded fish was well prepared, but boring. Crunchy on the outside, moist on the inside, and tasteless.  Frozen fish sticks have more flavor.   My wife had the natural sourced burger, overcooked to medium well, served without mustard or mayo, not even on the side.  Both dishes came with fries, nicely cooked, but then over salted at the end.\n\nKeegan's is a comfy, well staffed, restaurant serving safe standards cooked safely.  Your parents will love it.", "business_id": "rVUEZpHQfWI_3kt0lBwaxQ", "stars": 3, "date": "2011-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "YoBu4TVcP5YHKOC35NPXQQ", "review_id": "StFtioeUbO6Sk30LmDX3cg", "text": "you know that scene in Goodfellas where all the mobbed up dudes are at the Copa with their girlfriends? this place is kinda like that, only classier. mirrors and black&white tile everywhere, fake palm trees, and a $14 shrimp cocktail appetizer with shrimp the size of lobster tails. the food is ok, not sure if we'd go back again.", "business_id": "vvA3fbps4F9nGlAEYKk_sA", "stars": 3, "date": "2006-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZNC8d3Kwlm7jT2_2HLY_7w", "review_id": "o2fjTX71fLLpU8d56f2LYA", "text": "This place was Great. The food service and atmosphere was unbelievable. The pasta dishes we had were the best we have had since Italy. True Italian", "business_id": "vvA3fbps4F9nGlAEYKk_sA", "stars": 5, "date": "2014-04-12", "type": "review"}
{"votes": {"funny": 1, "useful": 8, "cool": 0}, "user_id": "ccL0exzbHqzO4lpp9AP8MA", "review_id": "ueow3JEnX8OxnASa7APlNw", "text": "Food poisoning for two, please...\n\nI am really confused by all the 4-star and 5-star reviews for this place. The 4-star average Yelp rating was the reason my wife and I chose to dine here during our stay in Phoenix. Yelp, you really let us down this time.\n\nSo I was on company business travel in Phoenix the week of March 12th and my wife was traveling with me. We had a French impulse that Tuesday night and tried to crash Petite Maison in Scottsdale, only to find out that reservations were required and there were no tables available. The following night, still craving French cuisine, we decided to stop in at Sophie's French Bistro in Phoenix.\n\nThe first warning sign was that the place was entirely empty during peak dinner hours. However, encouraged by the strong reviews on Yelp, we decided to go ahead and order. We took advantage of a couple of happy hour specials and ordered the following...\n\n3 Cheese Plate\nChef's Pate\nCalamari\nCrispy Duck Breast\nCreme Brulee\n\nThe food was average at best. My wife and I both tend to critique food as we eat it, and we both found ourselves commenting that the portions were small and the food was overpriced for what it was. Most of what we ate was bland and the pate had a very odd flavor and consistency.\n\nThe fun started about 4 hours later when we were back in our hotel room. We both started experiencing various internal moaning and groaning, followed by the onset of stomach pain. No big deal, I thought... \n\nBy shortly after midnight, we were each fighting for time in the bathroom, taking turns to vomit up everything we had eaten that night. I'll try to spare you the details, but this was the kind of violent and uncontrollable vomiting that I have only experienced perhaps once before in my entire life. Needless to say, diarrhea was also involved.\n\nAfter going through this for a good two hours, my wife and I were both thoroughly exhausted and dehydrated. My wife even told me she felt like she was dying, and said that she had never felt this bad before - not even during child birth. o.O\n\nSo by around 2:30am, my wife was begging for me to call an ambulance. For a while, neither of us could get up off the floor to reach the telephone. I eventually found a break in the vomiting and managed to sip down enough water to recover slightly. I carried my wife out to the car and asked the hotel receptionist for directions to the nearest hospital.\n\nWe drove to John C. Lincoln Hospital on Dunlap, which I recommend if you ever get poisoned by Sophie's French Bistro. I managed to get there without hitting anything, which was remarkable since I could barely see straight and could barely function at all. \n\nOnce inside, my wife completely collapsed and was unconscious briefly. The nurses and doctors rushed her into the ER and brought her back around. They gave her a shot of morphine and then hooked her up to an IV drip of fluids. As I waited, I continued to experience vomiting and tried to keep myself hydrated. Despite being in a hospital, I was determined not to check myself in for treatment, not wanting to add further medical bills.\n\nSometime around 5:00am, my wife was ready to be discharged. The official diagnosis was acute food poisoning. We were never able to identify the specific meal at Sophie's which poisoned us, as we both shared the same courses and ate equal amounts each.\n\nHowever - and this is the kicker - when the doctors asked us where we had eaten dinner and we told them it was Sophie's, they remarked \"oh, that place!\". We learned that the ER at John C. Lincoln has seen 3 other cases of food poisoning caused by Sophie's. The hospital took our information for the purpose of compiling a complaint against Sophie's with the AZ Department of Health Services. They told us that once they have at least 10 confirmed cases, then they are required by law to report the incident as a disease outbreak.\n\nThis all would have been nice to know before we chose to dine at this place. I can only assume that the other poisoning victims either don't use the internet, or are still laying in a pool of vomit somewhere, too weak to write a review.\n\nPlease, please, PLEASE don't put yourself through the same hell that we went through that night. After this experience, we lost all desire to dine in Phoenix ever again. Thanks, Sophie's, for ruining our trip.\n\nFor the record, we did have an excellent meal at CIBO Pizza the night before we were poisoned. I highly recommend CIBO. Great food, without food poisoning.", "business_id": "PuHucejs4LG3hSXnrwi9-g", "stars": 1, "date": "2012-03-17", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "APLIPfq1Rf8QyhHHk2uAyA", "review_id": "1z17M4p8Oai031p3wpSZuQ", "text": "I don't really want to tell you 'bout this place. Should I? Maybe I shouldn't. After all, it's a gem. Maybe I should be selfish and keep it to myself. \n\nYeah, I really don't want to tell you how great this place is. I don't want to tell you that the bartender is one of the most friendly, funny and attentive guys I've seen behind the bar (why I can't remember his name right now, I don't know). I don't want to tell you that the drinks are served strong and fast. I don't want to tell you that there's live music to please your ears - and get your foot tappin'. Nor do I want to tell you that you can play darts or pool in a very, very casual and laid back atmosphere. \n\nYou see, I love going to Pat Murphy's. No pretensions. No fuss. Just real people - some more rough around the edges than others - enjoying \"going out\" as it should be enjoyed. Don't expect state-of-the-art dart machines or unscratched pool balls. This isn't your trendy bar. It's no dive, either. It's exactly what you want when you just want to chill out, have a few really well-made drinks and hang out with friends.\n\nNo, I don't want to tell you that this Irish Pub is quickly one of my favorites in the Valley. But, since you asked, I guess I have to.", "business_id": "4f1b_-ceB9S3olRqGujh6w", "stars": 5, "date": "2007-05-18", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "63HOmdiJzMOw9figAu14QQ", "review_id": "EAKmueESsEa2cbP9nDUXng", "text": "Eat, drink, be merry.\n\nLove the atmosphere. Love the upholstered loveseats, love the bruschetta and salad. Love the open air.\n\nDon't love the horrid parking options. \nDon't love when I'm seated on the wooden chairs. How can we be expected to relax and drink up when our bums are bruising?\n\nServers? Easy on the eyes. Nice bonus for girls' night out.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2009-04-16", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 2}, "user_id": "TroANF3f2PuYeVfSItxxaw", "review_id": "dyb2mGipLOFTVYUDZKaJtw", "text": "Postino has one of the best happy hours I've ever been to! \n\nI wish I lived in the area so I could go back. The vibe is just mellow and coooool (with my hand flat, slowly motioning from right to left). We had a long wait for a flight and thought we would stop by for their 11-7 happy hour. They had a nice selection of $5 wines and pitchers of premium beers. For $5 you really can't go wrong, but despite the low price the quality of everything I had was fantastic. \n\nYou must also try their bruschetta. We tried a selection of them and they were all amazing. My favorite was the goat cheese with roasted peppers. The service was great throughout, especially since we took up a prime table for about 4 hours. Our goal was to taste everything and we almost did it before our flight! \n\nJust another reason why Phoenix is a pretty cool city. Just as San Diego should stay classy, Phoenix should stay coooool!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2010-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V4VW69mBsRzfa3mLmyBqLQ", "review_id": "u4qvFZQFjLoMrDrTZ1M_og", "text": "If you are ever in PHX, go here.  An old friend of mine owns this place.  Food is awesome and the staff rules!  (Tom T. ;))  The wine selection will melt your soul and the atmosphere is killer.  Have fun.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2010-05-20", "type": "review"}
{"votes": {"funny": 1, "useful": 7, "cool": 2}, "user_id": "vsXP832M0kOxKpfduD7dWw", "review_id": "jIAVvlOaU2s8xl3f5PI0WA", "text": "It's way too loud in here. I prefer the Central Ave. location.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 2, "date": "2011-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "y7VFJ3Vlw6_HtmmKX1GNpw", "review_id": "IqsIK7fk1P_2tKHo4mYcMQ", "text": "I absolutely love this place!\nThe bruschetta is delicious, we've tried just about every one! My favorite is the brie and apple, something amazing about that mix.\nThe wine is always great too, with a lot of options and the staff is very informative! The cheese plate is a good mix of cheese, bread, nuts and fruit. \nThe set up is so cute and it's a great place for a date (friendly or romantic). My only complaint is that the flies drive me nuts! \nYou have to try this place, you won't regret it!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2011-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IpCH-jaFA-1YgCdi6YmnFg", "review_id": "zvm9YGvVV0Zd9BVyv4nxEg", "text": "Awsome!!!  Tried the prociutto with figs, brie & apples, and the roasted peppers.  All excellent (although my wife couldn't take the wild game taste of the goat cheese).  We also tried some sandwiches and salads......all excellent.  Didn't try their alcohol  but the bartender seemed really cool and knowledgable as we sat at the bar waiting for our table.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2012-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BrnCBCC-LK-bioa14MlYkg", "review_id": "ClLJgc29V8D2iLlIjbd1Zg", "text": "Perfect date spot!  But also perfect for a friendly gathering for wine and bruschetta.  My friends and I ordered a couple of bottles of prosecco  and 7 or 8 different kinds of bruschetta.  Perfect for 5 people and we had a great time talking and laughing underneath the heat lamps outside.  I loved this place and I will definitely come back every time I visit Arizona. \n\nDear Postino, open a location in San Francisco.  Thanks!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2013-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "48tnPJksbDanNaLELA00Pg", "review_id": "9TA7tcEzpycfgK0ohnJC4Q", "text": "Good wine and excellent bruschetta. Great waitstaff.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2013-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dMRZ8JO-io8Jon3SWkpFQQ", "review_id": "cZOtu5vEv2FVTGIsPA1huQ", "text": "Always a solid place to have a relaxing glass of wine and very casual laid back food! If you happen to visit the Phx area you should for sure add this place to your short list of stops!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2014-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W3InfnXtK8IRcMH1DYDRYA", "review_id": "rzl8R3UcGPHD6MSlSldiNw", "text": "I love Postino! It is such a cute place for a date, girls dinner or anything! We had wine, bruschetta and a sandwich and it was all delicious! Will definitely be back!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2014-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Dok410LJ-Ma4caKvhx_tRw", "review_id": "FxXgEN5RhBd9nQszp2lX0A", "text": "My neighborhood spot! Great happy hour, service and vibe any day of the week. :)", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2014-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M7owSsSOIqWi41yRlVUKcA", "review_id": "HzNwd0NDHXivjyQjdltB2Q", "text": "Postino's is one of my all time favorite restaurants!! They have the yummiest bruschetta, salads, sandwiches, etc.  If you are not a bruschetta person you need to try theirs! My favorites:  ricotta and pistachios, white bean and tomato, Brie apples and fig, bacon buratta...well they are all so good!! \n\nGo on a Monday or Tuesday after 8pm for Happy Hour and you can choose any bottle of house wine and 4 bruschetta for $20!! The best place for happy hour!! If you are going to go though make sure you are there by 7:30 or 8 at the latest or you won't get a table until after 9 because everyone knows about Postino's Happy Hour and it is legendary!! \n\nOn a side note the raspberry chicken salad is probably the yummiest salad I have ever eaten!!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2015-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cylVHH8NcyrGSZi4rAd4RA", "review_id": "2ZBZ6ED_TFA_FQga948vBQ", "text": "It's a smaller hole in the wall kind of place. But for this stretch of Indian School it's a great easy going kinda spot.", "business_id": "qz4ZOcv-840UjfCEYI4qZg", "stars": 4, "date": "2015-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "90a6z--_CUrl84aCzZyPsg", "review_id": "wX2Q7tKga3666ZzPuBGbTA", "text": "Popped in here awhile back, watched a decent local band do classic rock for about :30 min. It was pretty empty for a Friday night (the place is deceptively bigger than it looks from outside). Mostly older, rougher crowd, they mostly felt like neighborhood regulars. \n\nDrinks were cheap (why they get three stars).\n\nKinda dingy atmosphere in here, felt old and tired. With a face lift and some hope, perhaps the OBR can rise again... you let me know....", "business_id": "RIeWXLMHZQlYprYt1x2f1w", "stars": 3, "date": "2008-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pi_f7sm9mclhBMtRHvGL1w", "review_id": "kSLxRXEE3aof_D0Xo4A1Ew", "text": "Super-divey,  locals kind of place. Everyone was friendly except one drunk young guy who was acting kind of territorial. My buddies said it was the best Bloody Mary they've had.", "business_id": "s5HAJmxNrWjQv_MNLHAMFQ", "stars": 4, "date": "2013-03-25", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "4jlZyGsJQRhqA0nIOTgFog", "review_id": "R4ZIsC07e2-Eib0eHJLxWg", "text": "Went here tonight, will never be back.\n\nThe food is typical bar food, nothing too extraordinary, I already knew what to expect from previous visits. But the service was beyond bad.\n\nJust an obvious example of poor training and poor management. Our poor server was obviously sent out to the wolves and had never served before.. (mind you she had 2 tables.) \n\nThe most annoying part, was that the manager literally went to the table in the middle of the restaurant, SAT down with them, and explained that this server was new and had messed up stuff earlier.. I could hear the entire conversation. How unprofessional can you be? I understand we were at a \"sports bar\" but to throw your own employess under the bus is just messed up. \n\nNot only that but why couldnt they maybe come around to every single table (3) and see if they needed anything? Or maybe HELPED out your servers rather than needing them to go and find you while you are outside smoking? Ridiculous.\n\nId like to be able to say \"Oh it was a busy night I understand.\" But this was obsurd, at one point I even went to the bartender to ask for my sons water (The server brought out all the alcoholic beverages BEFORE bringing my sons water) And the bartender gave me a look like I was asking for her to do backflips, told me she didn't have \"To go cups\" and rolled her eyes.\n\nThis place obviously doesn't work as a team, and it shows..\nNever mind the crappy food, dont go here just plain and simple because the service absolutely sucks and the management and other employess obviously do not care how their restaurant is portrayed.", "business_id": "F-ykHfGY9lWr12OJ_Ofy7A", "stars": 1, "date": "2013-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4b9NCG416rLGZ6BTgEOldw", "review_id": "OtGyjf_KDxus-vfJLQNs6Q", "text": "Showed up rather late on a Sunday night, and we all had a blast.  Sat in the bar area.  Savannah was our server and she was just great, what a good sense of humor. The drinks were excellent, the food was wonderful, and we'll go back again, no doubt.", "business_id": "_BU867oRCLZnDIRmg7S6Wg", "stars": 4, "date": "2015-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TCA3AMVlRrl71Bi5-S8mHw", "review_id": "mzZ4Zkw2B32xTZm4Ewyj7w", "text": "basic food, nothing special, but all tasted good.  Limited menu, funny wine selection, no multipuciano, or other usual italian wines.  Just the popular basics.  Right next to Goodwill, but better than you'd expect", "business_id": "jq_YnMQjcArdBWuwRospFg", "stars": 3, "date": "2014-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "gnJQg0JC5pR9nw_GmECsHw", "review_id": "5jkXr3TBiU5Uc_lzmy8EmQ", "text": "Been here 3x hoping that it may have just been the time of day or server but ALL 3x we went the service was horrible, bathrooms unusable and food just gross.  On our final visit both my wife and I were sick the rest of the night.  Approach with caution... you have been warned!!", "business_id": "PkBkqQpAoeX3Ogo5HBthQg", "stars": 1, "date": "2012-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "CJOjw2P9zkPxOnnmrY6KjA", "review_id": "maJ7aQzxeig1H4o3Nvgtxg", "text": "Like some of the other reviews, I initially went to the Wagon Yard because of a coupon (you guys should print more, looks like it brings you business!).  We've been a few times and the food is probably a 3 overall, it really depends on what you order.  The service staff have always done a good job, but I think we always get the head waitress (or is she the owner?).  But the place is just cool, so we keep going back.  If you go later on a Saturday evening, they have karoke and the people are actually pretty good.  They have a crowd of regulars, who want to make sure you feel welcome.  It's mostly an older crowd (I'm in my 20s), but on an evening when you are just looking for some chill entertainment, and if you love country music, check this place out.  It's like going to the Buffalo Chip in Cave Creek before everyone found out about it.   And not having to drive so far.", "business_id": "JImJictLIE48_O1z-l2TGw", "stars": 4, "date": "2009-03-18", "type": "review"}
{"votes": {"funny": 4, "useful": 3, "cool": 1}, "user_id": "nDBly08j5URmrHQ2JCbyiw", "review_id": "GvnpxxubPfruKnUfpJ7EeQ", "text": "A really good place to hear a local band. The stage is well-positioned and there's an actual dance floor. There's a tall riser for the drummer so you can actually see him (or her) play. Drinks aren't expensive, and there was no cover the night I was there.\n\nSadly, the woman who dragged me out on the dance floor ended up crashing into a speaker post and spraining an ankle. There were RN's in attendance who improvised an urgent care center on one of the barstools. \n\nIt's that kind of place. Enjoy.", "business_id": "8lMQrVQU-5iG9UA4KvcnsQ", "stars": 4, "date": "2013-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "caazWL14OFkzuHkbKRwmAA", "review_id": "q3Qkikf6xGDPcEisg0DecA", "text": "Awesome Cheese Steak Sandwiches.... YUM!", "business_id": "vFJmFFfPVhHkC3bWOeZnNA", "stars": 5, "date": "2015-05-26", "type": "review"}
{"votes": {"funny": 4, "useful": 6, "cool": 5}, "user_id": "n_lAaNGeWgspbbCJc0DqRg", "review_id": "ZJ42i8I2l5QPArIuhP2VHQ", "text": "A place that bills itself as a \"5 star dive bar\" and pretty much fits the description. \n(I mean, you wouldn't expect them to label THEMSELVES as 4 stars)\n\nThey serve a variety of non-bar foods, like soft-corn tortilla sreet-style tacos. \nThere are a few good beers mixed in with the usual regulars.\n\nThey spice up the week with nightly trivia and weekly free comedy shows.\nReally nice people on staff, too.", "business_id": "-xLwGUmmyKgsTtFOOXzjeg", "stars": 4, "date": "2012-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Sgut0TKPkIYhr_JyvPlw9w", "review_id": "ZJ_mZSpaAz8g_RbkXqk7TA", "text": "I love this bar. They have amazing nachos and the staff is amazing - Jaki, Kaleigh and Wayne. I don't ever have to wait long for a drink. Oh yeah and sex trivia on Saturday night is so much fun.", "business_id": "VpQZo6KV8CqkIG_MRQ3jiA", "stars": 5, "date": "2014-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "xCY9C6KN9xTDzKrow9iivQ", "review_id": "MrVDFD9kk7mFEVz3K7rHeQ", "text": "I like this place and Maggie is the bomb. Good happy hour prices and it's on the way home. This is really a place for locals as I see the same people there all the time, which is fine by me....", "business_id": "0d5xLrgemC6jjCe-rofCiw", "stars": 4, "date": "2011-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "eZc54Dc61_hcPyr2-jFSUg", "review_id": "zkpLGQsR2XKhNj_qwGaamw", "text": "Good service. Good food. Good beer. Clean. \n\nOther than that not much to brag about. \n\nAte at the bar- was given a good recommendation by the bartender Mikey G to try the Seared Salmon Spinach Salad. . . I was so intrigued that I went for it. The salmon was overcooked to be called \"seared\" but it was not overcooked in general and it was delicious. \n\nBlue Moon on draught. Tap water was good- didn't taste like chlorine or margarita mix, which was a great change from the standard hotel bar. \n\n\nI would go there again.", "business_id": "avvNnkpGpGIS-2CClsduXA", "stars": 3, "date": "2014-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "fbYi6aC4j3Z4EA3UdqS_fg", "review_id": "orxGs42nGg2dWFf4-d9FBg", "text": "The wings here are awesome! So many flavors to choose from, and each one is finger-lickin delicious! The prices are very reasonable, and the service is very good. In case if you're not into wings, they have other selections to choose from the menu.", "business_id": "SgGINtDKQgoXoAnQgrDKDg", "stars": 4, "date": "2012-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QvXb6h91DVNzrpE7Ve6ENw", "review_id": "9G8tLe3KtReyGi-XrIqW3A", "text": "First time there and it was great. Wonderful service and chef Sarah Baer was rock'n Our server Brittney  suggested a good spanish wine and sparkling sprite on the rocks. But the best part of the dinner was the amazing, teeth rotting s'mores with homemade marshmallow. I don't care if I have to gum my food for the rest of my life I would eat that homemade marshmallow all day long. Thanks for a wonderful evening.", "business_id": "Our6bzte5W1wlIeOu9luug", "stars": 5, "date": "2013-04-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "DFO5qYQTyuAOopl-dEsOwA", "review_id": "Rur1RN6s8-SFcL6W1pLH8w", "text": "It's okay, the food is not what it was a year ago.", "business_id": "Lk-FP6yxYRTcU52SaTx2EA", "stars": 3, "date": "2013-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zqAZN2VZp8hIapgclJhXIQ", "review_id": "Mw9GBX9f-wI1nfGUlEcSsg", "text": "Very tasty Italian food.  I enjoyed the calamari and stuffed canneloni.  Place is dimly lit and a little dated but nice and intimate. Servers were cordial but not overly attentive.  Pricey, which reflects the cloth tablecloths and napkins.", "business_id": "S3FhtwXuiGMlGdBNtmiiSQ", "stars": 4, "date": "2014-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wi7csW1FXrL7MEPovIMDzw", "review_id": "WuLekvrMiDsrDL0XqRovIw", "text": "One of my favorite reasons to go the the Desert Ridge Mall is so I can go to Island's. I am a vegetarian and I will start by saying that Island's is a very vegetarian friendly restaurant. All of their burgers can be made using a vegetarian veggie patty instead of the usual meat. The staff is also really knowledgeable and will answer any questions you have about ingredients or toppings. Since I am addicted to their burgers I have yet to try anything else on the menu, but a friend of mine always gets Island's tacos and says they are to die for. Island's also has the most amazing french fries! Best of all the french fries are bottomless! The awesome servers never object to bringing you an extra plate of french fries to go with your meal.\nThis Island's is one of my favorite places to go for casual, fun food!", "business_id": "e0vubCKi8KD8zC2C6FdbuQ", "stars": 5, "date": "2012-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Xd4bWdBZQRcaEThtiGFl_w", "review_id": "CfcgWT6FVes5bEthnJ6GHQ", "text": "Coldest beers around - the taps are chilled and mugs frozen. Great place to grab a beer and a bite before or after the movies. Comes with a great people watching patio too.", "business_id": "e0vubCKi8KD8zC2C6FdbuQ", "stars": 4, "date": "2015-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "4sIK_74UwkKU9YQXIfgCdg", "review_id": "FVyK9x3qdTiwpcN3EyRyQg", "text": "I remember the first time going into the Elephant Bar and thinking the has to extensive a menu.  For me that is usually a sign that overall the food is not going to be consisten, just to much  of a variety.  My compliments to the chef, I have never had anything that hasn't been quite good.  That is saying something as I over all over the menu.  My dining companion has looked at what at my entree more than once and said \"you are going to eat that?\"  The ambience of the Elephant Bar is rather nice as well.  Not that you don't see the cutoffs and flip flop crowd but it is some place that one can enjoy dressing a bit for a nicer casual dinner.  \n\nThe only drawback of the Elephant Bar is the service.  As a whole it is usually very good but occasionally you do get a zinger.  To the management's credit, those people usually don't last.", "business_id": "QzXFdjIbFRGhzL83goPPLA", "stars": 4, "date": "2012-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MvEVDkRcE6Y2NWW6O54b8g", "review_id": "JPfzGlB0uc0XKAHCFSsEbQ", "text": "The new staff and ownership is great! Much brighter inside, better food, cleaner, but most importantly it's packed! All the little things are addressed by the staff before you can even ask! Without a doubt would highly recommend it to anyone. Will be back as soon as I can :)", "business_id": "d-rZazFFYvnjRZUhLTEUZg", "stars": 5, "date": "2015-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Rg4gzsz3w00vRlIOXcGUIA", "review_id": "0lF4gUlgdFot80CAQdzd7w", "text": "Went there to photograph a concert. Great crowd and fun quirky locals. Loved the dive bar ambience without being trashy/dirty. The lighting for the show wasn't great but the sound was good. Great beers, too. Get the 99Shillings.", "business_id": "Cp5_NSJFNgylD5SUdmT8nQ", "stars": 4, "date": "2011-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WVBoYXhftjIT-jaN950XXw", "review_id": "-posBKtWHe51G0WUMz4TWw", "text": "Service wasnt all that great this time.  Im glad I've got a yelp account now because i can let future customers know that wait time for a table was to be 15-20mins but ended up being more like 30Mins. Other then that took a while for drinks and for waitress to collect our bill. Not to satisfied...", "business_id": "scVOmQsf5HSY3n9CG06tFA", "stars": 2, "date": "2015-04-25", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "xU0Z7gKPCG4cSi4n9mYjPQ", "review_id": "v6Jl9PUC_IqYL4Br_d2dOg", "text": "I dont make it up to this chili's very often, nor have I been to one in a while. They have a new set of margarits that were great!! I wish they would bring back the buffalo sliders, but the regular sandwich is just as tasty!", "business_id": "zARGEdB0JyPCPR0f3FKGxQ", "stars": 5, "date": "2013-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fr608d1Y71kpx1GUw-r4jg", "review_id": "Hg6tQ-RFesDkQDce-qYGbg", "text": "I used to go there yearly with the retired in laws. I think they love it. The pizza tastes like it came from a box. Very crowded. Amazing organ player if that's your gig. Everyone should go there once in life, or should they?", "business_id": "VRxelK__tuQD0KBxx2LzeQ", "stars": 2, "date": "2014-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q_P9ITaqoIpE9w_557dOLg", "review_id": "-qcAj6XkPr6mEpA682FDOQ", "text": "Haven't been to this location, but was happily impressed. Newly redone inside from what my friend told me. Pizza is great as always - love the buttery crust. Wings are consistently among the top 3 on my list of good wings like in Arizona. Service was good, we got there early in happy hour so it wasn't too busy yet. Beer was good enough I had two tall ones - good selection on tap too :-)", "business_id": "zBGfa6Vx4K59v8OR81gzJg", "stars": 5, "date": "2014-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pYg1esX8XPdAGn28OqBnGw", "review_id": "xqXWSIF704qrKl9hxtHlZA", "text": "Olive garden is basically the cheap and fast food for Italian.  If you're expecting fine dining Italian, not the place, you're better off at Brio.  But if you want no non-sense, dirt cheap food at fast service, Olive Garden fills that roll.  \n\nThey always have specials going on, so its best to go for that.  I went for 2 for $25.  That's unlimited soup and also salad, 2 entrees and your choice of desert or appetizer.  Salad is alright, just a house salad nothing special and also you can choose from 4 different soups and you change your soups.  I tried 3 of them.  They're not the best soups but they're not bad.  It is what is.  The entrees are alright too, good portions, the Seafood Lasagna had actual seafood and even the scallops are real and plentiful. which was surprising to me.  Overall the quality and taste are sup-par nothing special.   But you already knew that.  everything is on the cheesy side if anything.   \n\nAs long as you come go to Olive Garden with the right expectations, fast italian for cheap, you'll have a good dinner and a good experience.  If you're expecting fancy high class authentic Italian... you  will be disapointed\n\nPro\nCheap italian food\ngood selection\nunlimited soup and salad\n\nCon\ngeneric tasting soups and pasta", "business_id": "bbmuF6LtbP51bk0Ia0p1rw", "stars": 4, "date": "2013-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8RZ8YUdEk4dSZ5lnlAByZg", "review_id": "4A5kpKrJd43P0j79-qKvjg", "text": "3rd chance, you will NOT get from me. You call THAT a salad?!? It had blue cheese \"liquid\", not blue cheese dressing. 25% of my 16oz steak was fat. Excuse me, but I have enough of that already. As for the remaining 12oz, if it were not for the salt, this steak had NO flavor. I had salt at home I could have eaten. My wife's baby back ribs were as dry as the Sahara! Fry's has better ribs for HALF the price. Service was OK.....I mean, as our waiter was bringing us the check, he asked if we wanted dessert. So he must have known our answer would be \"no\" or he was going to comp us dessert to make up for the over-priced and low quality food. Black Angus.....you've been Black-listed. Btw.....Yelp says I have to leave a star rating, so against my desires, I rated you 1 star more than I would have liked. Gosh, I'm so mean; but then again you did take me for my money, so we're even,", "business_id": "OreqUicD2AP5QW2HblqRoQ", "stars": 1, "date": "2015-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-DLY7sMe8KQ6QS1UU0pKJQ", "review_id": "rKCRBbXoc1TQUgI0ikslBw", "text": "Went here March 13, 2015. The club is kinda small. 1 stage. I saw that there were about 10 dancers.2 of the girls were pretty hot.Most not so much, some were quite big and older. They were friendly for the most part.The problem is the black haired waitress in the miniskirt.$13 for 2 drinks. .I gave her a $20 and she nodded like she would be right back with my change. I didn't see her again.I had to hunt her down after watching her go back and forth thru the room. She gave me my change  after I saw her at the bar without even a sorry. I would watch your money very carefully at this place.", "business_id": "gno60mP3HsKC2q0FnqrljA", "stars": 2, "date": "2015-03-13", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "jGXQJkVV-fuq8GfhjUw2eQ", "review_id": "ClOlpqmhM1ksJNbK0gPoug", "text": "I was in town for a quick trip and needed a place to grab a late dinner.  From the Yelp description I only knew it was a pizza place with good reviews - I didn't realize the atmosphere was so chill and modern.  \nPesto's is not just a little hole in the wall with white walls and pizza sauce stains by the floorboards.  Instead, it's a very nice spot to take a date, or to just belly up to the bar solo (as I did).\nService was friendly and fast, and a good selection of alcohol (especially liquor) is on hand.\nGreat atmosphere, friendly service, and delicious calzone. Drenched in sauce and absolutely delicious.", "business_id": "a9Wk44qJLWoJQT-_H8MB-w", "stars": 5, "date": "2011-03-08", "type": "review"}
