{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iJQ4JFXJDf68-4mantzf4w", "review_id": "EbYE1ykGczU9WIm5yqv2-g", "text": "Great food, service and prices. It's in a not so great part of town, but lock your doors and it's definitely worth it. Best baked goods in the area! Try the almond torte!!", "business_id": "hnHt6EinzC-IX6y3GSF7jw", "stars": 5, "date": "2012-05-28", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "9HWSQ8NYfRPn3leqosFgwg", "review_id": "J-SUeaWVIW0dd761lmX-xA", "text": "I've driven by this place many times but assumed it went out of business long ago... Boy was I wrong!  They just sell out of donuts and lock their doors before I'm even awake!\n\nToday, success!!  An early meeting had me driving by and the OPEN sign was on. I quickly pulled over and went in to discover trays and trays of donuts!  I ordered a chocolate frosted French cruller, chocolate frosted cake donut, and a cinnamon sugar cake donut. They were all delicious but the cinnamon sugar was hands down AMAZING and YUMMY. \n\nIf you love fresh cake donuts that are cooked to perfection, get up early and stop at Better-Maid Donut Company.", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2012-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BMwEMgGuYeijesvpasC1RQ", "review_id": "DdMZ5uBFN0Rve4iQ14HJvA", "text": "My husband brought home what was left over from the Burnt Almond Torte Cake from Potomac Bakery that  they served at his retirement party. So glad he did . OMG it was sooo good. Had lots of lots of incredible cream filling and toasted almonds.  I'll definitely be ordering one for my next dinner party.", "business_id": "7FRn0CFWQmZFu8bcEqrXMw", "stars": 4, "date": "2011-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DSWiwtUyWK1YwY8NBKDhGg", "review_id": "iPtudaYnew3HWX0JlyG76g", "text": "I really like the signature toasted almond cake, but have been mostly disappointed with the other things I've tried here. I've also not been pleased with the employees - they're not very friendly.", "business_id": "yWVY1Bq19lDxu3BP7_96EQ", "stars": 3, "date": "2009-03-14", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "kpIBCCozTB0J0d3SZJfjhw", "review_id": "WQEEC40-ySjWn4wzVaQrxA", "text": "SHAME ON YOU.  PRANTL'S\nPastries I purchased today chocolate heart with shamrock on top is a recycled pink heart from Valentine's Day and tasted like it.  UGHHHHH", "business_id": "yWVY1Bq19lDxu3BP7_96EQ", "stars": 1, "date": "2015-03-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "CdKX95dMySpzWX4XQ2k01A", "review_id": "1uz83OilC0giQQ_Zh6zVww", "text": "I've been back here several times since my first review, and have been continually impressed with Prairie. The food is always spot on and the atmosphere is so comfortable. The cafe sandwiches take one step towards gourmet--the tuna and egg salads are made in-house with a little twist from the same old. All are served with a choice of side; I favor the black bean and corn salad. Breakfast is no exception to Prairie's perfection--my scrambled eggs with spinach and pesto were fresh and filling. And it's hard to go wrong with any of the real fruit smoothies or coffee drinks. Prairie is exactly the way a cafe should be.", "business_id": "ShEYKerTwb2LSORE5o_s7A", "stars": 5, "date": "2009-05-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Dzc2m6O4vaXCF4ztKPjTcQ", "review_id": "iBtJEYn2hEKPhH4Y1SPmmw", "text": "Updated review,\nI have to give them more stars. For one they have pretty tasty food once I tried more dishes.  The cucumber sauce on the side also really good.  It has also become my stop for mousaka! Mmmm", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2011-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ovzXqT-2ZBaKX282t8WrIg", "review_id": "n1t_3LbdBAS1wkHhmHvRnw", "text": "The price is right and so is the location. Cookies were ok but not mind blowing good. I tried the double chocolate chip, chocolate chip walnut and chocolate chunk. The chocolate chunk was by far the best of the three. There was a lot of choco chunks and they were still a little gooey. Yum! I wasn't that big of a fan of the chocolate chip walnut. There were lots of walnuts on top but the cookie was almost cakey with not enough choco chips. The double choco cookie was fine. A bit flat, in flavor and literally. For around 65 to 70 cents per cookie, go check it out for yourself.", "business_id": "UvOGydGLtXt9km_ULQYyUg", "stars": 3, "date": "2013-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TLjVeQYCu5scCBgaHdex8w", "review_id": "EiVFE-JMZj7I5vpwBJCPxA", "text": "We had the happy  opportunity to eat at this Coco's restaurant yesterday. It was in-between time (about 4 p.m.) and we had the restaurant to ourselves. The waiter was terrific, the manager was great, the food was hot and marvelous. We both ordered their spaghetti and meat sauce and we shared a piece of coconut pie (they have the best pie in town). We highly recommend this restaurant for family-style food, great for you to take your kids, neighborhood friendly. They need the support of the neighborhood to stay in business, and it would be great if you would try them out and have a piece of their terrific pie!", "business_id": "SZvYxcvYYVRue9MXcEDjsA", "stars": 5, "date": "2015-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YPnUzc9TeDDvcFEnjyh_BA", "review_id": "Ejr2r3N7vrNHZYoGgktauw", "text": "Sorry to hear they are closing. I have not been there in 10 years as I live too far away but, the bread was always great. There is a bakery ran by a jewish family (galileo Bakery) in Scottsdale----great bread and pastries---but not KOSHER like Karsh was. The girl there said they would look into kosher if they get lots of requests. Go in and try them and PLEASE ask for Kosher.", "business_id": "vaqmESluryt5i4Wbkb6KRA", "stars": 5, "date": "2014-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "dHlNnMw5wAeH_lWWtxJGuQ", "review_id": "QEI-qaPifN-Mp1-B3I7IBQ", "text": "This store has set hideous customer service standards! I was lied to about their return policy by an employee and screwed over! They gave me the run around when I asked to speak to a manager...she was conveniently never present and was the \"only one who could help me.\" When giving me the final verdict on my issue, she cowardly had her employees do it for her on the phone (of course not face to face) and could not even call me herself. I highly recommend taking your business to a different pet boutique where quality service matters!", "business_id": "-ev01HlCKf7CYsh8ZXG_7w", "stars": 1, "date": "2008-05-27", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "L0OrG-U45IWF6EZtm2dv8A", "review_id": "whb7YbzZiPRbglTaivil-Q", "text": "People who are complaining about the slow service, you are way to American. This place is authentically French.  It is a sit and chat and enjoy the food and the company you are with.\n\nI have been going with my parents when they are in town, we found this place on Yelp.  My dad speaks French, as we are of very close French heritage.  The owner Pierre remembers us every time we are in.\n\nI order the Normandy crepe, almost every time I go! The coffee and croissants are so good! Croissants are warm and soft and so buttery, just like in France!\n\nIf you are in hurry please do not go here and then complain online. This place is so good and one of my favs in Scottsdale.", "business_id": "wftoNIA0Q8nX-Da47psBCA", "stars": 5, "date": "2013-05-23", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 4}, "user_id": "wuCszpVPMIMyOCualnZtaw", "review_id": "dnCoGIkwNlvINV19W3dDLw", "text": "Barbs Bakery\n                                                         Frosted Sugar Cookie\n\n\nThese cookies are not the white sugar and flour cut out cookies you get from the bakery at the local supermarket. These sugar cookies are absolutely delicious! Colorful, bright, and flawlessly decorated.  Each cookie looks like a work of art that you will want to take home, that is if they make it home and you don't devour them first. Barb's sugar cookies are everything a sugar cookie should be. Crunchy, buttery, light, and perfectly frosted, you'll want to eat more than just one. So if you're searching for the perfect sugar cookie stop by Barb's Bakery.", "business_id": "vv1uvJRBUqi707TA5GuhCg", "stars": 4, "date": "2014-03-29", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 2}, "user_id": "7GC9fVWKa4a1ZmBGLH6Uww", "review_id": "fGgNiKPhYVZ6qEuyeWAopA", "text": "after two years of going to postino's and thinking every time, 'i have to try this place soon,' i finally lost my or-ange (pronounced \"oar-ahnj\"; i didn't know either until i caught one of their chefs on a morning news show, and i figured she would know) virginity on easter of all days.\n\non a side note, is it sacriligious to say \"virginity\" and \"easter\" in the same sentence?\n\ni met a friend there at about 10:30 on easter morning, and, always timid about where i can and can't park in this DeMarco mecca, i circled around the back and got a spot close to the post office. despite being at the back of the long stretch that makes up the grocery, dining and gelato shops, i abided by a giant blue and white sign there in the back that tempted me to \"Come In Here!\" complete with an arrow. i pulled open the door and was greeted by busy, sweaty cooks in the kitchen, whom stared back at me. huh. i closed the door and read the sign again, making sure i didn't misread *deliveries* come in here. nope. confused and mildly annoyed and walked around to the main entrance.\n\nthe mini cafe/coffee bar patio was full and there were tons of cruisers parked along the sidewalk (no racks or locks, if you're planning on dining inside). seemed to be Wildflower style, as in order at the counter and try to fight for a table. my dining companion was an old pro and pretty much walked me through the whole thing (getting my attention to order when the girl came out to us in line way before we got to the counter [i was busy checking out a sweet vintage cruiser], picking up our food since they don't bring it to you or call out a number when it's ready, i couldn't even find the trash when it was time to bus our table). all in all i was very disoriented, and i blame it all on that sign! mentirosa!\n\nnow, on the important stuff, food was pretty good. all egg white omelette with avocado and fresh pico-style salsa was nice and light (not sure what happened to the side of fruit that was suppposed to come with it).\n\ni got a bit of a funny/offended look from my dining companion for comparing the oar-anj to wildflower as far as clientle (which is the only reason i knock a star off). the best explaination i could offer his defensiveness at the time was that it was all the same kind of attitude, save for the upscale-ness of the oar-anj elicited a more \"cool baby\" snob crowd, while WF is more \"suburbia\" snob. basically, you just trade in the SUV soccer-brat taxis for a hummer or lexus or mercedes s class...all of which were lined up in a neat little row out front .\n\nnow that i've said all that, none of the above will stop me from returning. i think i would like the place better as a dinner/drinks spot than breakfast. the uber-tans and blonde streaks (sported by both men and women at this joint) were all too much to bear by the light of day. or i'm maybe i'm just still harboring resentment over that damn sign.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 4, "date": "2007-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nlae8971SGEdWqbP5gEYIg", "review_id": "Dph5ejTevqEBgwYVZsWA7w", "text": "Tasty treats and sandwiches.\nFriendly service.\nWiFi.\nGood wines at a fair price.\nWhat more do you want?!\n\nThe place is BUSY though, so here's to hoping they can hold it all together, or open another location for you lucky folks in Phoenix.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 4, "date": "2010-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PV5Lv_xl3DDAcAchFJCbXQ", "review_id": "0psJVeF_yQZq8EJ8QOkbYA", "text": "Where to start.\nI will first say that these guys know what they are doing, and know their customer. The place works in Arcadia, would work in Brentwood, CA, would work on the upper east side of NYC. Would not work in Venice,CA, would not work anywhere else in NYC. Just way too Martha Stewart, boring, cute and safe. The music says it all to me. Always some Putayamo Cd playing some world music that all the soccer moms can tap their feet to. Everyone in the most expensive workout clothing, coming and going from a local yoga class, or a workout at The Village. Yuck. Yes, they know their customer, I am just not one of them. \nYea, I know that I am the minority, but this place just has no soul, nothing that makes you think, nothing outside the box. Its the kind of warm, cute, fuzzy place that makes me want to puke. For instance all the merchandising. A bunch of overly cute stuff that no one needs, and of course they put a big sign over it saying \"useful stuff\". Really? Can't you just leave something to the imagination guys? Is your customer really that brain dead creatively that you have to guide them through every step of your cuteness? \nThe crowd that hangs out here are just that, white, pretentious cattle. No artistic, creative types, no thinkers, no one that thinks outside the box.  No risk here. Very safe, and yawn, very boring. I was so uncomfortable hanging out there in that  bland, pretentious energy that I actually grabbed my food and ate it out in the car. Yep, thats the last time for me. Just not my kind of place. I do not buy artwork to match the color of my couch, and I do not need to eat a a place that tries way too hard to be cute and safe and makes me want to hurl.\nIt is too bad though, because the food is very good.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 3, "date": "2010-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WV9oNBkcw3HvzEP45OHQVQ", "review_id": "kvtLEt2_C7WPUvtuWKxYPQ", "text": "Nice little cozy neighborhood market.  I was in the area and decided to drop by to check out what was fresh and get a drink.  From reading the other reviews I would've love to try their pizza.  The place reminds me of Dean & Deluca in a smaller package.  I usually don't eat sushi from markets but even their sushi looked appetizing.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 4, "date": "2011-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YJ1dtpjo1EkEaBiW2oRt7g", "review_id": "MckwQKDQPRB5KSuW3qDevg", "text": "Truly as good as it gets.  Cute mash up of market, bakery, and pizzeria.  Best bakery in town.  As an out-of-towner, every year I make sure to stop in for a \"Commuter\" on croissant with a  vanilla latte.  The market includes local artist and unique gift shop items.\n \natmosphere, check\nwifi, check,\nfriendly staff, check\ntimeliness, check\ndelicious, check\n\nYOU WILL NOT BE DISAPPOINTED. (Unless they run out of croissants before you get one ;)", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2012-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pQ6ij6cOBRB3yJGHbVZHUQ", "review_id": "Une2lgSWJXX89v_Z4cUmvA", "text": "Super neat place. My first visit was quite impressive. A little quirky, this place has a little bit of everything. Met some friends for lunch at 11:30 and it was already busy. They have FREE valet parking and inside & outside seating. Breakfast all day, coffee bar, fresh pastries and MORE! Also some neat and unusual gifts are available. NICE!", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 4, "date": "2013-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "gx3ZRjh43OOuavKl_rXvrA", "review_id": "xbav-xO3MPesbUpJ5PtC0Q", "text": "This place is awesome! It reminds me of what a local cafe x Whole Foods x gift shop back home would be like if they melded and this was the end product.\n\nMy mother and I were looking for a place to grab a quick breakfast and LGO was actually recommended by a fellow Arizonian. Plus, this place has rave reviews about pizza and I am all about that! Unfortunately, they don't do pizza until later in the day so we decided on some French pancakes, fresh juice and I got the cucumber salad.\n\n-Cucumber salad was refreshing, light and so yummy! Really simple but fresh ingredients made for a great, light meal. Comes with cucumbers, cherry tomatoes, olives, avocado, chives, goat cheese and a lemon/black pepper dressing.\n\n-The juices were pulp filled and fresh!\n\n-The french pancakes were lovely, you get about 4 crepes filled with creme fraiche, honey and topped with strawberries that are lightly sweetened.\n\nThis place has souvenirs, wine selection, pre-made salads, juices, pastries/desserts, pizzas, gelato, coffee ... literally if I keep going I'm going to make this my priority destination once I'm back in Phoenix. \n\nSuch a cute spot to read the paper, eat good food, share a communal table with friends and enjoy the free AC. The workers were nice and cleared plates quickly. It's customers ranged from families, businessmen and women and the like. Definitely going to come back to try the pizza!", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 4, "date": "2014-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "RlAAn9opjQww-rLW_HSXOw", "review_id": "BASXxQmTTu4ByXqFHkSxWw", "text": "La Grande Orange is a cool cafe/ grocery store/ coffee house/ pizzeria/ gelato bar. It's a bit overwhelming on your first visit, trying to figure out where to go for what, and it gets a bit crowded and hectic. I sort of just picked a line and lucked upon the right one. \n\nI got the Spicy Chickpea Lettuce Wraps, which you can order from the menu or pick up from their grab-and-go cold case, which is what I did. (Cuts down on wait time.)  Comes with 2 large iceberg lettuce cuffs, topped with their spicy chickpeas and avocado slices. These lettuce wraps are SO yummy and perfectly spicy.  Mine came with a fresh pineapple wedge; perfect for cleansing the palate. A nice, light, healthy, and filling option.  \n\nThere was a large dessert case, but there was only 1 vegan option: an apple pie cookie.  I started to pass (I had my heart set on a cupcake), but an employee convinced me to try one.  Great suggestion! It was one of the most delicious cookies that I have ever tasted. It was perfectly soft and chewy. An amazing treat!\n\nThe items in the grab-n-go section are labeled with the ingredients.\n\nThe parking situation is pretty insane.  They do offer complimentary valet parking (which I did not want to do), and there is another spill-over lot about a block north of the building.  I chose the later and walked back to the cafe.\n\ni didn't check out their groceries, pizzeria, or gelato bar, so I cannot comment on that. However, per their menu, most pizzas can be made vegan. \n\nI would certainly return to see what other vegan desserts they have, and to get more of those yummilicious vegan apple pie cookies.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 4, "date": "2015-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "tHz9cWxwSfcP4qRaPIHvww", "review_id": "cBRieGAgv6-1toxV7xKHAw", "text": "I found this gem on Yelp a while back and bookmarked it. When I finally found the time to visit for lunch, it was only for takeout. I called in my order based on the items from their website. After viewing their website a few times, I thought they were part of a chain similar to Paradise Bakery. When I arrived to pick up my order, I was in complete shock as they are not a chain. According to the woman I spoke to, they have been around over 10 years. (And I just now noticed?!) My order consisted of a French dip for my husband and a roast beef melt for me. Their dessert case looked delicious, so I added a chocolate brownie for good measure. The woman behind the counter, who took my phone order, was both helpful and nice. I thought perhaps she was the owner or had been working for the company a long time as she seemed to know a lot.\n\nOnce back in the office, I dug into my sandwich. I really liked mine. The roast beef was delicious and I really liked the bread but the overall flavors of caramelized onions, mushrooms and mustard really blended well together. My husband liked my sandwich more than his French dip. I admit the French dip was a little disappointing. It was just bread, meat, and a small container for dipping sauce. It was a lot of bread and meat and no cheese. We've definitely had better French dips. However, the brownie... oh, it was amazing. It was super soft and fudgy with a dark chocolate frosting on top. Super decadent and would love to eat another or ten. \n\nIf in the area, I would definitely go back and try more of their sandwiches and desserts.", "business_id": "j5HLcBru7FEirYJPbKFVWA", "stars": 4, "date": "2014-03-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "dUZ8aLUiX3_zq83nnlytjQ", "review_id": "iX8VivvKSiP66f4tPbahCQ", "text": "YUCK!\n\nI have not been cooking lately - busy with work and home...\n\nI went there for homestyle food and it was not good.  \n\nAlso, like the previous reviewer, the server did not know anything about homestyle food.", "business_id": "0QRvOpNbrHfik3wBupGFmg", "stars": 2, "date": "2008-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "IPVQ9aObQap81orMov_MwA", "review_id": "18QDDgLutC0a8UnTH78e8Q", "text": "This place off 7th Ave north of Van Buren is my favorite Mexican food place for lunch since its the closest one to Downtown Phx that offers some delicious Mexican treats. \n\nI have tried several things on their menu and hijole, todo esta bien rico, everything tastes yummy. My co-workers and I always recommend different plates from here to each others and each one of them has been a delight.\n\nLet me start off with the fact that their flour tortillas are the best ones I have had in ALL OF PHX. They taste homemade and you can taste the authenticity of its flour mix, its just simply the best. Lets continue our tour of the food menu with the CARNE ASADA BURRITO, wow! The meat is seasoned to perfection and their lettuce is always fresh and so is their guacamole. I am NOT  a fan of burritos but this is one of the few places in which I WILL order a burrito because of its deliciousness.\n\nThe flautas plate is also yummy, the flautas are long and deep fried with shredded beef and they are delish. \n\nA co-worker recommended that I try the Green Chile w Pork Quesadilla and add lime to it, and WOW, man, no words can describe the explosion of flavor that invades your tongue, its SO GOOD. \n\nFurthermore, this place always feels warm and welcoming. The two girls that basically run the place always seem to know who their repeat customers are and they spoil us with our requests for more salsa and guacamole and one of them even has our drinks ready for us as soo as she sees us walk through the door.", "business_id": "d2AeNB4xw67E1Bzpo1Pm7Q", "stars": 5, "date": "2010-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JJrKAUIZe_Xl4H-Lim7ubA", "review_id": "VTnNKswxGDm0urrTrmB33Q", "text": "The cochito was ok but the pumpkin empanada was maybe the worst I've ever had. Lady was nice so I'm not trying to can them.", "business_id": "9ZCQ2LGtadLeCYXDmcOs7Q", "stars": 3, "date": "2015-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BUMQjxq_etcl7V3GvQcdow", "review_id": "9Ei6H8c-qMXYCSPhebo4tg", "text": "This place has the best cakes in the business.... Try the red velvet... OMG... To die for. The prices are kinda high, but it worth it.", "business_id": "vPJ4iCOSuxCxHPtb18gwWw", "stars": 5, "date": "2015-04-08", "type": "review"}
