{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "fhV21-QB6n402-J9vR-7cQ", "review_id": "uEDgmmWTohYBzqx_mc51vA", "text": "So, when you get married, you have to buy rings.  This sucks.  Especially if you have grandma's engagment ring, and what you had in mind for a wedding band to go with it doesn't exist.  \n\nSo, I found something on the internets that I like and can live with, a simple channel set band with a dip in it to accomodate the setting on the other ring... something that almost every jeweler carries, a fact that we decided to capitalize on.  \n\nEnter Fiesta Mall Jewelers... all 50 of them.  We shopped around a little bit, found that almost every jeweler is less than helpful, and sometimes completely unfriendly.... Except for Heidi at Samuel's Jewelers.\n\nHeidi was FANTASTIC.  She was fun, excited for us, and went out of her way to make sure that we were happy with our decision.   She gave me a hug when we left.  She reminded both the Hubs and I of my aunt Carrie, a very good thing.\n\nNow, I am a reasonable, rational person, and I totally understand that Heidi was simply a great salesperson who knows just what to do and say to make the sale, and we probably spent a few dollars more than we could have elsewhere, but a good experience is important too.  We left feeling pretty good about it.\n\nAnd you know what, when we went back in to pick up the ring, Heidi remembered us - by name.  I think that is pretty awesome, and salesmen everywhere should take note.\n\nWhy 4 stars?  It's in Fiesta Mall... you understand.\n\nSo.  Get married.  Go to Samuel's in Fiesta.  Talk to Heidi.  Leave happy.", "business_id": "B03tExI-vRaXG3lZ-NyIcg", "stars": 4, "date": "2008-05-12", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 0}, "user_id": "zdPRXhhJNCiCOgWQwoPlpg", "review_id": "cxtE1e1FR49hh_HIuJyJ5w", "text": "1 star for the exceptional service & extra slow food preperation. \n2 stars for the extra greasy pizza\n\nI purchased a groupon for this place and finally got around to using it. I wasn't in a hurry to use it even tho it had an expiration date because I called, spoke to somebody & they ensured me it wouldn't expire. \n\nWalked into this place and had a hard time choosing the least dirty booth/table but finally made my choice and wiped off the left overs crumbs left on the table and seats. I guess with only 1 waitress it's hard to take care of a couple tables so we had to wait a good 15-20 for a greeting. No big deal..... It just meant we had plenty of time to second guess our ordering decisions. Which was a good thing because they were out of this & out of that on an early Saturday night. Really?? We ordered a simple pepperoni pizza and it took over an hour for them to prepare and deliver it to our table. There was enough grease on this pizza to save the govt millions in vehicle maintenance but since I'm not in the habit of bailing out the fat cats I quickly used an entire trees worth of napkins to solve the issue. A little grated cheese, stale crushed peppers, garlic salt and voialla & edible pizza. The pizza actually has good flavor and I enjoyed the crust which normally I don't. I didn't want to chance my luck with letting down my taste buds so we opted out on the potentially fake Italian desert. \n\nSo here's where Bouno's helped establish their excellent one star review with me. The waitress brought the bill & I gave here my groupon. She quickly made an excuse on not taking the groupon because it was expired & I showed her on the groupon where it says it NEVER EXPIRES so she took it to her boss. A $12 dollar groupon discount turned into a $6 discount. Nothing makes me more sadder than a business not living up to their offer. Don't put it out there if you have no honor. Well, to wrap this up I'm gonna say good by to Bouno's & wish them luck cuz they're gonna need it if they plan on staying in business with such awesomeness.", "business_id": "m3O2EFVs3eo8s40MGGzmsA", "stars": 2, "date": "2014-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "1mal-cvLhyX8iGEt56_5Dw", "review_id": "quJZfN0McrZVScU5qHdilw", "text": "The hubbie and son are wingholics and this is their favorite place for wings.  \n\nI will say the New Yorker wings are definitely better than San Tan Brewing Co in Chandler, but I prefer Zipps sweet/hot over New Yorker.  The rest of the New Yorker food offerings are okay, nothing to get excited about.\n\nThe Ahwatukee location lost the hubbie and son's business several years ago when their wings were priced differently (higher) than what was on the menu.  The mgr was not willing to honor the menu price, stating wing prices had recently risen and not all the menus were marked or changed, so my hubbie exercised his right to find another New Yorker location.  Since then, Mesa is it since the Chandler/Sun Lakes location has slloooowww service.", "business_id": "G7-NoraGlmzwO0sgs4fbmQ", "stars": 3, "date": "2008-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mX3qMBnEhOJ6R80vfjQMYg", "review_id": "_9zZqR2ATM-yrbNg1c-jzQ", "text": "As my time at MCC draws to a close I can't help but be thankful that I'm getting out of here alive. There are so many problems with this college it's tough to know where to begin. The past two semesters I have been dropped from all classes due to non payment even though I have pending financial aid and after repeat assurance that I would not be dropped. It's not just happening to me but to hundreds of other students as well. It's a glitch that they just can't seem to fix. Annoying and frustrating. There is a serious lack of academic advisors and if you go to see one you're looking at a two hour long wait. Trying to talk to financial aid is a whole other beast. Nothing they say is consistent and I believe they just say the things they think I want to hear just so that I'll go away. It's a sad way to treat people who are seeking an education. There is a serious lack of women's studies courses and the few that are here are only online. I'd like the option to take some of those in class since they are more conducive for discussions and networking. Just take this all in, do your research and always get a second opinion. Never take what anyone says here at face value. Stick to your studies and be on top of everything and you'll survive too. Best of luck!", "business_id": "XKrEnL9yCtlhhIa6efbtGQ", "stars": 3, "date": "2015-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "6ogWRu-RthM7s5IqDbTK9g", "review_id": "sM2icNxWGXUBHmLc8zxJ6Q", "text": "Another a+ mom and pop place, the owners are so cute! They are super nice and offered water to me when I was waiting for my food.\n\nThe teriyaki chicken was really good, so good I thought I needed to write a review while I ate. I love that there's tons of chicken and tons of great teriyaki sauce. The price is good too.", "business_id": "wc0a0XLhcMkoEQx1TbuhpQ", "stars": 5, "date": "2011-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "7bdCfESkLLta4vwxO5tyHw", "review_id": "-81tgN6d9ELZOHdHoTh5OA", "text": "Came to the ER after a bad experience the night before at banner gateway. So much better here. Taken right back and treated wonderfully by all the nurses and doctors.", "business_id": "Rm8jCL-8fbBAPtPpBJGu7Q", "stars": 5, "date": "2015-04-03", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "GMkF0yJWwFRVO9kiGOcojQ", "review_id": "M3WMuTIHiVIN8ddoV4ys7A", "text": "Came here for Mother's Day brunch at Dobson's Restaurant. Our waitress was the worst. She did things like not bring cream for coffee when kindly asked.. I had to get up, and go grab coffee creamer for my mom at their beverage station. My wife ordered french toast and specifically asked for whipped cream to be excluded from the order. Ya.. whipped cream all over. She was nowhere to be found most of the time, but when she was around, the bitch was fucking something up.\n\nFood was weak. Totally not worth the 30 bones per person for buffet. Milk and OJ are extra.. Prime Rib, Eggs Benny, and Salmon Wellington were the main foods. None were good. Nothing I ate made me say, \"This is why they charge 30 bucks.\" Everything I ate made me say, \"I wish we had gone somewhere else.\" I shelled out 100 dollars for 3 people to eat shitty food, and experience shitty service.\n\nMy wife pointed out a dead cockroach as we were about to leave. Yuck.\n\nFuck this place. Do not eat here. I want my 100 dollars, and 2 hours back.", "business_id": "bRk44ShCT0osos-1xaTRyA", "stars": 1, "date": "2014-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "i3JNq17dt9gPY8g_0CZibQ", "review_id": "4L-GqWc07n62_5XC-dIrKA", "text": "Best subs in the valley, period.  Friendly staff, consistent quality, and I love 'em toasted! (the sandwich, not the employee)  I order ahead and pick-up most of the time and the orders have always been right.", "business_id": "KS2w8ychyieJbUqRa6kCHw", "stars": 5, "date": "2011-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9gIAQiQlGpdYPrWLuZDN3A", "review_id": "H9BrBHkxRnrNAUiGCl8ukw", "text": "Cheba hut is so good. It's a lot of food for a good price. When I go I get the white widow sandwich (chicken, bacon, ranch) and it's really good. I used to get the skunk (egg salad) sandwich but they got rid of it because apparently in the only one who liked it. \n\nOne of the interesting things about cheba hut is that in addition to soda, they have kool aid to drink as well. Good kool aid too, not watery stuff. \n\nBe aware that this restaurant is all based on weed references. All the sandwiches are named after different types of weed, a 12 inch sandwich is called a blunt, deserts are called munchies, etc.\n\nI have been several times and it's always good and the staff are always really nice and helpful.", "business_id": "KS2w8ychyieJbUqRa6kCHw", "stars": 5, "date": "2014-05-06", "type": "review"}
{"votes": {"funny": 3, "useful": 6, "cool": 3}, "user_id": "xW5ajZ7ke4IeRmJylPKagg", "review_id": "gWkGCPRj__CjLImX22ubZw", "text": "the restaurant formerly known as the best hong kong.\n\nwhat happened to this place?  this used to be our go-to chinese restaurant in the east valley!\n\nthe food has gone down hill and the service which used to be 3/5 has gone to 1/5.\n\nthere was this young college age kid/busboy/waiter (who knows, he could have been older, just add 10 years to what you think they are) who actually chased us out the door and demanded that we leave 15% tip when we only left 10%....what a dufus\n\nhello, we're trying to send you a message idiot.  i guess the best message is to not eat there and tell 100 other people to do the same\n\nyou shall be called \"Worst Hong Kong\"", "business_id": "8TGUK7LD3M-vLWml-jLb0w", "stars": 1, "date": "2009-03-21", "type": "review"}
{"votes": {"funny": 2, "useful": 8, "cool": 7}, "user_id": "jQ4U24uOw_Ya4aVw_VWy8g", "review_id": "ee6n49EjKwxMsoSnCirHbQ", "text": "Absolutely the most authentic, delicious Japanese food in the valley. Having lived in Japan and grown to love their cuisine, this is the only restaurant I have tried in the valley to duplicate the flavors and presentation I experienced while over there. The place itself isn't much to look at, as it used to be a Dunkin Donuts back in the day, but don't let that turn you off as you would be missing out. \n\nUnlike many \"Japanese\" food establishments it is actually owned and operated by a Japanese couple who make and prepare all of the food themselves right when you order it. From the mouthwatering Sukiyaki and Tanin, to my girl's favorite, the Oyako Domburi, you can't go wrong with Nagasaki Grill. I can't recommend this place enough.\n\nIf you want the real thing, there is no other place even close.", "business_id": "BBPkwpj9kSeDuy0uOwWHJA", "stars": 5, "date": "2008-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z9ZfiME6syWawnAvTc97mg", "review_id": "e39hi5z8uLXKc5OM-LHW8Q", "text": "Pros: qualitty, authenticity, and TASTE!\n\nCons; service, price, atmosphere\n\nCan't stress the taste points enough it's awesome flavor, but definitely get this to go or eat by yourself the place is clean but the decor is from at least two decades ago you're not going to impress anyone bringing them here. \n\nQuality is definitely there, this is a mom and pop shop in every way, but it's more like mother and father-in-law service when it comes to serving and attention. They are in the kitchen a lot if you need anything you have to go to the desk and call in. \n\nPortions are satisfying but not filling and for the same money you can get more food elsewhere. Still, it's not expensive and is both authentic and tasty.", "business_id": "BBPkwpj9kSeDuy0uOwWHJA", "stars": 4, "date": "2013-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "NrrXu3AGQYAnv3JdQB1iDQ", "review_id": "budl_yNnunC6daJAJkPQXA", "text": "The Kimchi Jjigae (stew/soup) is great! One of the best I've had in town next to my mom's though. She makes the best. The next favorite item is the pork bulgogi bbq. These are the only two things I get every time I go so I can't really comment about the other stuff. The side dishes they bring out are okay but again I keep comparing everything to my mother's cooking so everyone else is not really getting a fair chance.\n \nPrice:  A bit pricey but the portion is large. $11-15 range for the dishes I mentioned. Two people can split a dish.\n\nAtmosphere: Mostly Korean's as customers, relaxed nothing special, and crowded after church on Sundays.\n\nService: hit or miss, be patient, no one is trying to give bad service on purpose, relax, get up and ask for something if you can't bare it any longer. (it really depends on how many servers are working and how busy it is)\n\nTop two Korean food place in town. (they have awesome stews/soups)", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2009-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MuwAEtuXNcbwoA3FlG-QIg", "review_id": "6qWui7ut6HWWphnwrHqkEg", "text": "Went there and have lunch with colleague.  I have no expectation before going there as no one tell me whether it is good or not.  I ordered a lunch special with BBQ meats, it is reasonably priced. Oh my god, by the time you start tasting the food, you will know that this is real Korean food you are tasting!  It is so delicious that you can't resist.  I am not very hungry but I still can finish my whole plate of food.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2013-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SHcX9hp5RG3-OqsbvissIQ", "review_id": "yCSx1e8MPr7NTw-WLSww1A", "text": "One of the better Korean restaurants I've ever been too.  Service is friendlier than most, and the food quality is excellent.  Prices are good, too.\n\nThe Bulgogi is my favorite, and they do a really good job with it.\n\nI'm sad that I now live across town from here, and can't make it very often.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2014-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nbofxFWHORebBHh10OgYLA", "review_id": "fc2u0PDXFbTaMocoNVOyqQ", "text": "My favorite stop for fast food fried chicken! The spicy chicken is the greatest, and so are the biscuits.. The mac and cheese also wins, but the portion sizes of the sides served with the family meals could be WAY BIGGER. C'mon  Popeye! Don't skimp on the cajun rice and beans, yo!", "business_id": "D0IB17N66FiyYDCzTlAI4A", "stars": 4, "date": "2013-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "5mvaOdV7nyKCP2Xct7yDTw", "review_id": "TBHnKPvbEMNefCnC30E2Iw", "text": "Still a decent stop anywhere for the whole coffe shop thing, but have been enjoying some of the other coffee shops in the area a bit more.", "business_id": "uFR7CpDJlW-gNdmk-zhIGw", "stars": 3, "date": "2013-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "e5YZvlSRknGmROE209SF3Q", "review_id": "Zw0wkk1QWdO7k7iY8iApAw", "text": "Sound is decent to good. The earps rock.", "business_id": "Cp5_NSJFNgylD5SUdmT8nQ", "stars": 3, "date": "2011-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EmttwFPunQuZXewHWjigew", "review_id": "TCqp2vEFiIXo-HzFn_dxkA", "text": "We had a Restaurant.com coupon to use at this restaurant so we thought we'd give it a try.  Since we were with another couple, we asked as we typically do, for separate couple checks.  The waiter told us 'the computer won't let me do that, but I'll split it for you.\"  We proceeded to order and were pleased with the service, as well as the delicious breads and compound butter (which arrived soft enough to spread rather than rock hard).  Two of us ordered the sea bass special - delicious!  The veal marsala was good (not the best we've had) as was the veal francese.  The waiter offered us a complimentary sambuca which we accepted.  When the bill came, he had automatically added a 20% gratuity (for a table of 4??) and subtracted the Restaurant.com coupon from the total bill.  Let me add, this WAS NOT a computer generated bill - it was handwritten.  Will someone please explain why it is so difficult to do what customers ask and provide separate checks? We decided to check the bill over and found that we had been overcharged for a glass of wine.  The waiter fixed it and apologized.    It was a pleasant enough dining experience, however, for the most part, we felt it was overpriced and we don't appreciate the aforementioned refusal to honor a customer's request.  We most probably won't go back as there are many other restaurants to choose from!", "business_id": "P2i4eojfX61pZn8i7RZZxA", "stars": 3, "date": "2012-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Qg3K_1xuyZ1crZQQfgL-Nw", "review_id": "Q5dNPH1JveepMkujIXmhyQ", "text": "The staff is very friendly and accommodating. They special ordered me a pair of tuks shoes. They told me 2-6 weeks as an estimated delivery time and they came in two weeks! The store has a very wide selection of posters and tapestries. I would most definitely recommend this store for anyone with an alternative style!", "business_id": "1ojDBw2DJEDu14cZxnR_JQ", "stars": 5, "date": "2015-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "fDF1zwyNVAUjjz0P2Hq4UA", "review_id": "RZJQ6f7xSuEtVrEhEhvrSg", "text": "Needed a place to stay while my condo had some major work done so looked online and found this place to be the best deal. The rates are more expensive if book thru the hotel website but really reasonable if you book they hotels.com. \nI was pleasantly surprised when i arrived. The place is great. The rooms were clean and spacious. The property was beautiful and  kept up nicely. The bed was so comfortable but didn't have a comforter or bedspread. They have a nice pool and jacuzzi, both have electric chair lifts which I've never seen at a hotel. The staff was friendly. The breakfast was good and they even had karaoke in the evening. \nAs a explored the place i thought it would be the perfect place to have a wedding. The flowers and trees were alive and healthy and the numerous water fountains were the perfect touch. \nThe only bad thing I found was the soda machine didn't take coins, there wasn't a list of channels in the room, and all of the rooms were non smoking. \nI will definitely stay here again and if I ever get married this place is where it'll be.", "business_id": "CscJ0RubTHofHvRJhERvXQ", "stars": 4, "date": "2014-05-22", "type": "review"}
{"votes": {"funny": 6, "useful": 7, "cool": 6}, "user_id": "kffxYQVQsEpF1DVlQlcGCg", "review_id": "dpTavF9jliKghsJuq7a9xg", "text": "We have come here more than a few times over the years. Today we came around lunch time, just missing the rush!\n We got a nice booth for starters. Our server was Annette ,she was friendly and very quick with everything.\nI got the Lumberjack scramble. It was a lot of food and I ordered an English Muffin instead of the bisquits that come with it. Lots of gravey,(Country style) I liked it but, I had to scrape some off because, it is so much. Something else that they had,that I thought was pretty good was the Marion Berry jam.\nT got The Krabby one,it is an Egg crepe (made with Crab) I had some and it was really good ,nice and light.\nI have to say there potatoes are awesome and the coffee is nice. Not bitter at all.\nWe have always been happy with our meal at all the locations.\nSomething else to love is the stamp card system they have. so many stamps and you get one meal free. Gotta love that!", "business_id": "8aPTQeDYOMNEu907WfflCQ", "stars": 5, "date": "2013-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XHVtEm-lIRBnTbzjLxd6ow", "review_id": "hHFtOwPfSHdExFNOxpqiAw", "text": "It was decent. I got a pretty traditional plate with eggs, bacon, and potatoes. The eggs and potatoes were perfect, but the bacon was sub-par quality and taste. My daughter had the yogurt parfait which was awesome and delicious. I gave The Good Egg 3 stars because nothing really stood out to me: the people, place, or the food...", "business_id": "8aPTQeDYOMNEu907WfflCQ", "stars": 3, "date": "2015-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9vFNWX_0Xxc-RzUNPHPdYw", "review_id": "TFRNvXSoUoKX0eo32mY5Cw", "text": "Just decided to try this place tonight on a whim. I ordered the drunken noodles and the golden tofu from the Thai menu. Spent $20 after delivery fee and tax for one of the worst Thai food experiences of my life. The noodles are really just mashed left over noodle pieces interspersed with veggies. They're so greasy they drip from the fork and so spicy I can't even eat it. (I ordered mild!) The fried tofu isn't awful, but it's also too greasy for words. I will not be ordering from here again.", "business_id": "s2-waYR5o7AZTNHeQVWRcA", "stars": 1, "date": "2014-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "xcD0HkTQdoW5bPeS7kDNUg", "review_id": "dwToU4dLQ-7-Jdrw0AfWLg", "text": "Good deals considering they are going out of business. Everything in the store is on sale. The layout is kind of odd, but they have anything from clothing, to electronics, to mattresses. Worth checking out before they actually close.", "business_id": "JU2tsuqG-YspQBQObhxoQA", "stars": 4, "date": "2014-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "qrdkZvmXPd4Ts20SmUBRQQ", "review_id": "qXL35R9tVN4M0OXMKFUfpw", "text": "The best make it myself coffee and all the selections!", "business_id": "8C698zLqpoKWzAbK2JY4Iw", "stars": 5, "date": "2011-04-11", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "GqNTczyj6-vpjSq3Cfmygw", "review_id": "dkhKrD1lq6hOF1Ixugflmg", "text": "Okay I like this place but prices have gotten higher... And the man that works here always looks at everyone like they are going to steal or something! It not like I wanna pocket a 2 dollar nail art! Customer service sucks", "business_id": "Q_lBAysdntSb4ySUtMpoDw", "stars": 2, "date": "2014-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Yugu0GcSbWoFwyuh-_zSDg", "review_id": "rAHFxXpVTJ_UbcijHv-beQ", "text": "I have never been to an eyeglass store like this!  It's truly a jewel.  I was so thrilled to have found Maureen who has such expertise in this field.  Her assistant, Stephen, was terrific as well and guided me to find the best and most attractive fit for my face.  If you're looking for the best quality and design selection this is the place.  I never thought of glasses as an accessory before but now I'd just buy them to look great.  I just can't say enough about them.", "business_id": "8x0czXM4us5Z-YA9DgeQzg", "stars": 5, "date": "2013-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "UzlgVmt94vKta8tmlI2sCQ", "review_id": "Dim7aYgdwmSItzDRzSi2Gg", "text": "We have been going to Anderson animal clinic for about a year now. The staff is always super friendly and the place is always clean! Dr. Anderson is very knowledgable and knows what he is doing. Their pricing is extremely reasonable and they don't charge for unnecessary things like most vets.  We recently did the dog boarding and that went great as well. I really don't have any bad things to say about this clinic! 5 stars!", "business_id": "pJ1Fy-IXJYECunEAj586HQ", "stars": 5, "date": "2014-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2ct4dXGk4HF1owKagq4xOw", "review_id": "iTe4FWvowk2Kc-uLYh-sgA", "text": "So glad I changed locations !!!! carmen was great with my facial, just wish she told me it would be 10.00 extra for the vitamin c treatment, don't mind paying it, just would like to know ahead of time. I have already booked another massage and facial at this location", "business_id": "xL6bzAhtSzjVTesWeRw1qA", "stars": 4, "date": "2015-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4uw7hCPC3owbFuhAkyxrAw", "review_id": "wtvOye1wSS8Z8RgZtoEASg", "text": "Generally a good experience. Today the place was PACKED and there was a significant wait for lunch. The food was good and the waitress was very nice.  Prices seem a bit steep compared to comparable restaurants, but I would return none the less.", "business_id": "scVOmQsf5HSY3n9CG06tFA", "stars": 3, "date": "2012-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0Jd0QUgVTD6GEyZNX9S5SA", "review_id": "ZAGbmK09EodMJD5ajidJ8g", "text": "Everything I've eaten here has been amazing. It's the best mediterranean food I've had in the valley. Simple ingredients freshly prepared result in rich flavors. The chicken kabob is really good, especially with their garlic/potato sauce. I also ordered the vegetarian combo which is an assortment of the side dishes, nothing was disappointing. The service and prices are also hard to beat.  Dinner for two was under $25 and I left without room in my stomach for anything else.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2014-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ukqP87ttafY6zJbMI7GIYw", "review_id": "bGH5ljVpBrSFfxBkd0ZREg", "text": "My girlfriend and I went here for the second time. Though neither of us often review restaurants, we both felt this place deserved a raving review. She ordered the lamb shank and I ordered the three kabob plate. Both were extraordinarily delicious. This hidden gem is certainly a favorite of ours and we will return regularly. If you have yet to visit, what are you waiting for? Get in here and give yourself the gift of delicious Mediterranean cuisine.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-04-09", "type": "review"}
{"votes": {"funny": 4, "useful": 2, "cool": 2}, "user_id": "AeucYo8J-rZjcq09Wuqsjw", "review_id": "fy6kzg2mjzgwOfZ0JW-E4Q", "text": "What a find!!!  I drive by this place all the time and always mentally say \"humm Jess, you should try that place\" next time i am going to listen to my gut, because i was missing out! \n\nInside is a very cute, cozy set up. everyone is super nice here. You get complimentary won ton chips and delicious Chinese tea when you get seated( this is pretty rare). The menu is large which lead us into gluttony...and people i am NOT ashamed because everything was derrrlicious :)\n\nedamame, ribs, angel puffs(crab puff), garlic steak, lemon chicken, honey walmut shrimp (catching my breath)..sake..more hot tea..and then cookies and chocolate for dessert....yummmm\n\nhonestly i eat Chinese/Asian/Thai A LOT, and this was one of the best places i have came across in my quest for  great Asian food. \n\nwhy not five stars then you say?? well i am a fan of windows(none here), and i just can't hand out five stars like candy. But def a high four!", "business_id": "PNrOTfMmE0CJFV9YwSLzYw", "stars": 4, "date": "2011-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6SoaATMLiTd2P47CfqSWbA", "review_id": "7AoKn6UqWl6Vdj_ASfTM9w", "text": "I thought I was trying out a divey Chinese restaurant today.  It's in a broken down strip mall that looks like it was built too closely to the freeway.\n\nFunny thing is that it wasn't a dive inside.  It was dark and a little plain, but the food and decor reminded me of East Coast Chinese places.  Fish tank.  Hot tea and spicy mustard on the table.  Awesome egg drop soup, and the egg rolls were fresh and crunchy.  The chicken & shrimp lunch entree was nothing special, but it came with a small pot of fried rice, which is another nice touch.\n\nFast service.  Reasonably priced.  The place was crowded, and now I know why.  I'll be back.", "business_id": "PNrOTfMmE0CJFV9YwSLzYw", "stars": 4, "date": "2015-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Lk16j8KqgpweVqN0wKiuKQ", "review_id": "shB_iFSamylgnEWjW022Iw", "text": "And as the Assistant Manager's response indicates, the bad experience I had at Big Two apparently had nothing to do with the salesperson's abject disregard for courtesy or customer service.  I guess I should not have expected to be treated with respect or professionalism.  Again, I wasn't even offered the courtesy of a chair.\n\nThank goodness I walked out and found the Mark dealerships instead!  They were easy to work with and provided an excellent, almost painless (it IS still buying a car, you know!) experience.  When the time comes for another vehicle, I know exactly where I will (AND WON'T) go.", "business_id": "MQQGfrno3ily0SgCd67JFw", "stars": 1, "date": "2014-03-12", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "-RG7_rY8UhusarIATxU_8w", "review_id": "7qD9eRGBwl__06Os_eLfww", "text": "This Property Is Amazingly Clean And Well Managed.\nOverall Rating: 5.00 \nWould you recommend us to a friend: Yes\nIt basically has great amenities that can relate to your lifestyle. The clean swimming pool with a killer fireplace for the winter is very nice. A sectioned off dog park area is convenient for all your animal lovers. My favorite is the propane feed grills that I love to use. Most importantly is the property staff that give us great customer/maintenance service.", "business_id": "vfgTIwE42X5mcg1s_ITk8g", "stars": 5, "date": "2015-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "GPI930zIvXhi5I0gvkAa7Q", "review_id": "fbPUMxcY37vum4HM1PN_Zg", "text": "This review is for the Garden Center only.\n\nThe flower selection seemed to be fairly limited but the prices were descent. They have a good selection of planters and I found a couple that I really liked. Herbs were incredibly limited and those that they did have looked horrible. Tomato and pepper plants seemed alright. The Home Depot at Mesa Riverview has a better garden center all around but I would still give this location another chance.\n\nOne of the cashiers outside was standing at her register playing on her cell phone while the other cashier helped everyone. I went to the cashier that was doing her job and she was really nice.\n\nNext time I will go to one of the many nurseries around the area. Home Depot is good for other home improvement needs. Gardening, not so much.", "business_id": "YWp5PghItJcUKutgUZSMmA", "stars": 3, "date": "2013-04-24", "type": "review"}
