{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BX-Mq-oAt1XyCiOBt1ovTg", "review_id": "-MqtFh4zLjdl0Wyuef-_dw", "text": "I'm underwhelmed. Being a Mike & Tonys kind of girl, I was not really expecting a whole lot. But this meal left me feeling totally \"meh\". I've personally made better tzatziki sauce before. Their gyro meat has some flavor but it's way too salty for me. I give it a 3 purely for the fact that their staff is helpful and super nice. That always makes a difference to me. Still it is not going to be enough to make me want to go back. I'm sticking with my original choice!", "business_id": "PSlOtPIo28BvWOzdLmRRRQ", "stars": 3, "date": "2012-03-20", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "iTmWHtltCtk0Gm55AOxrUA", "review_id": "1mVmaxXDX4-awtwBY3JZuA", "text": "Salonika is a popular place judging by the crowds they get in here.  The ambiance here isn't the greatest so it's definitely a place to get takeout chow.  \nThe basic menu here won't surprise you any.  It's your basic gyros, sandwiches, salads, hoagies, paninis, etc.  I went for the chicken gyro and it was pretty tasty. They've got a few specialties here including \nyouvetsi and mousaka.  They've got your basic sides too, but if I ever get back here I'm gonna try the lemon potatoes.  \n\nSo it pretty much looks like an old reliable type of place and I'll bet most of the people I saw were regulars.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 3, "date": "2011-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "EY2M507w8246POHv37TLyA", "review_id": "HGB0cEYjqkx-i838yu36og", "text": "We stopped in here for a very late night dinner after our flight into Pittsburgh from Charlotte. We were staying just up the street at the Pittsburgh Renaissance Hotel. It was after 10:00 pm and you could not get a bite to eat in the hotel.\n\nSo we walked down the street - most places were already closed, and a couple of places that were open that had bars - were no longer serving food.\n\nFortunately we found Salonika Gyros! We both ordered a traditional Gyro, and they were prepared fresh and hot on the spot.\n\nWe knew we must have a good place - as 3 of Pittsburgh's finest from their police department were taking a dinner break and eating in here as well.\n\nThe Gyro was damn tasty! The meat was succulent and perfectly cooked with a slight char to it, and the yogurt sauce was just the right compliment to the Gyro!\n\nSalonika is not much to look at - it's your local working man's food joint in a traditional northern blue collar city! Which means it's great ambiance! Appreciate it for what it is!\n\nI'd definitely come back here for more Gyros and to try other stuff!", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 4, "date": "2012-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PRTVZdLWYmhozxkplGA9qQ", "review_id": "rFjXiJIQreAAJGUJum2f0g", "text": "my falafel was ok, but my brother kabob was really good. great location. reasonable price", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 3, "date": "2012-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J_q8jN623uew8ZzMChXBCA", "review_id": "9ap3FHozniWszDtUCkpQtQ", "text": "The food can be somewhat disappointing but will sometimes do in a pinch.  The service is quick and the prices are reasonable for Downtown.  They are open late hours, so sometimes that can be handy.  There are better places for Greek food, but Salonika's is often close by.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 2, "date": "2013-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5wTVzr3SyZzpiu-U_Yim6A", "review_id": "i9N_Pi1c1p2yD9x7iVPsdA", "text": "I like Salonika's.  I've been here a few times over the last couple months, and the food is consistently good.\n\nSome of the winning dishes are the baked chicken, chicken gyros, and definitely the lemon potatoes.  The salmon in pastry shell is also very good.\n\nThe staff is rushed but efficient.  Given how busy they can be, they get you in and out.\n\nEven when other lunch places are empty, you'll still find a restaurant full at Salonika's.  Part of it is the prices, which are reasonable. Part of it is that the food is mostly ready to serve, so it's fast.\n\nBut overall, the quality of the food is what keeps bringing me back, anyways.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 4, "date": "2013-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6Ex8aGRvvODBe4bEwRG2pg", "review_id": "JfWdOOfk1In1dAqoSyuvVQ", "text": "pretty good gyro cooked on rotisserie as it should be they told me it is 75/25 % lamb/beef. they have a combo special with fried they let me substitute lemon potatoes, which were quite good.. reasonable prices.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 4, "date": "2013-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qywVBBmOW9fbqWDi3XO8rQ", "review_id": "q_4pBZBV4FEJBKy6mlsixg", "text": "I like their gyro salad. It tastes very good with the pita bread. Good portion. I don't get hungry later afternoon.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 4, "date": "2013-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-eejlFQ7dZ5DjhWUpD8uqw", "review_id": "YfuxMRZUS3vq2pb9DzSDTg", "text": "Pros: Super fast, very affordable (I'm from out of town, so maybe it's not as affordable by Pittsburgh standards). Good-sized portions. Grape leaves were excellent. I had the meatless version. Rice pudding was quite good too.\n\nCons: It's pretty low-frills. Some of the food is a bit greasy.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 3, "date": "2014-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fpxWLiN0Sp6shp1wWqC-EQ", "review_id": "CQOeoFc4Uhcjhjp0ObOBJg", "text": "I love this place. Gyros, spinach pie, fries and hummus. Way better than any other gyro place in Pittsburgh.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 5, "date": "2014-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WzaaorVCmUTQvu4mScunNg", "review_id": "3hrS39SHz0XIyqdLq_jTyw", "text": "I was running out of time today at lunch and needed somewhere to grab lunch. On a positive note, i seen the Google street view car downtown :)\n\nAnyways, my gyro just wasnt that good. It seemed smaller than any other gyro in town, the fries were just frozen potatoes with no flavor and it just wasn't a very awesome experience.\n\nAlso, almost $9 for a small gyro, frozen fries & a small drink is not a \"deal\". M&Ts is $7.50- same fries of course  but a large, delicious gyro.  I dunno, I've heard great things about this place but i'll stick with my regular oll Zorba's for downtown or M&Ts afterhours.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 2, "date": "2014-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "2Az24juAhTJtmlqr5UWXSQ", "review_id": "51u0-HIwwBkR4L89Bx1K0g", "text": "I've got mixed feelings about this place. I've gotten gyros for take out here on a number of occasions and have always enjoyed them.  I've also enjoyed beers and shots at the bar and have been impressed by the reasonable price. But today I thought I'd try something different for lunch and went with the Greek Meatballs over rice.\n\nLet's first address the dinning room.  This place is screaming for an upgrade. The ceiling tiles are stained and don't match, the chairs don't match and the booths a probably the original ones installed when this place opened (I know they've been here for at least 20 years). \n\nThe service is fast, the wait staff is friendly but the Greek meatballs I had today were unimpressive. They were dry with a charred coating. The tomato sauce that covered them however was delicious and the rice that came with the dish was puffed and fluffy. I would have been happy with just the sauce over the rice. \n\nI don't dislike Salonikas and I'm not trying to dissuade you from coming here.  I'm sure I'll be back again for gyros and beers. But what I am saying is that there's room for improvement thus earning the three star review.", "business_id": "WXpi9z1bqF9raZSW8z70Ow", "stars": 3, "date": "2015-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "L9q9mSLtPbdXl9vY_ZfwjQ", "review_id": "Tb2JPdl6G56nSDKsE0z_ow", "text": "This place was really busy when we arrived so it seemed promising. Some of the food was good and others were sub-par.\n\nTwo of us ate the gyro platter which comes with: \nhummus (watery) \npita (store bought) \ngyro meat (I've never had gyro meat like this before, it was ultra thin and had a rubbery texture - also the portion was so small) \nGreek salad (iceberg with sparse toppings and too much dressing) \ngrape leaves (vegetarian but quite good) \nand rice (actually this was the tastiest thing on the platter - it had a nice lemon and chicken broth flavor). \n\nOverall the food was hit or miss. The most disappointing were the pita and the gyro meat. My companion had the salmon and said it was unremarkable. I think diners come for the cake which was eaten by almost every person in the joint. \n\nI also have to agree with some of the other reviewers, this place is disgustingly dirty. All patrons walk through the kitchen to use the bathroom which was really gross. The kitchen was not clean and our waiter had food on his hands when he served us. \n\nEven homemade wine and honey soaked cake won't bring me back again.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 2, "date": "2010-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4Iny8mhAcmBzHu1eux9sCw", "review_id": "A6gf7hk0V2OvRybKR2aN-g", "text": "Okay so this place was a pretty big disappointment.  The hummus was extremely watery and barely had any hummus flavor.  The pita served with it was definitely store bought.  I ordered the lamb kabobs which were greasy on the outside and had spices just slapped on them like they were going to flavor the lamb magically, but it ended up tasting like chewy, undercooked lamb with a bunch of spice on the outside.  They salad served before the meal too was awful.  It had wilted iceberg lettuce with one kalamata olive, a handful of tomatoes, barely any cucumbers and loads of a flavorless dressing.  \n\nBasically just don't go here.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2010-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IDe2dpDpHKmaMNoJRgwD1A", "review_id": "x-IsALsMU9W4R5RCXH19_A", "text": "I really might go up to 4 stars.  I've been coming here for probably more than 15 years, even when it was called Susies.  Christo was the chef even then. don't come here if you mainly frequent chain or upscale restaurants, but do come if you like tradtional Greek food. Some complain about slow service but I think it's just cultural--we tend to be too much in a hurry.  But if you're heading to an event, give yourself two hours.  The food is good, best avogolemono (lemon chicken) soup ever!", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2012-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ZB22j38ot9JtulcJ_tTfLQ", "review_id": "EppKFEL4adYi5QZEL8dvbQ", "text": "I found this jewel of a restaurant while I was staying in Pittsburgh for a month. I was stressed out trying to find healthy vegetarian food in a full on Meat n Potatoes city when finally I came across Christos! WOW! I fell in love with the service & food so much I was coming everyday until I left back to Hollywood, CA. In fact I haven't found such a great traditional Greek restaurant here in LA that can compare to Christos. Everything I had was superb especially the lentil soup, so amazing! For dessert you must try the \"Jackie O\"... so good. \n\nI am shocked to find such an amazing restaurant in a town like Pittsbrugh and even more shocked to read a few of the *less than 5 star reviews* of Christos here on Yelp. I believe a restaurant like this is far above & beyond Pitts peeps.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 5, "date": "2012-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zk0SnIEa8ju2iK0mW8ccRQ", "review_id": "50UjWgtvkpMV41Ytiackyw", "text": "This is the first time in a long while (10 yrs?) and now I remember why. The food is fair at best for the main meal. The salad is good but small. The hummus is a little bland. The best parts were the \"homemade\" wine, both white and red, kinda like adult kool-aid  and the Jackie O cake was great. My issue was the price, $59. for dinner for 2. For this price, I would have expected more.I can't believe the 4 and 5 star reviews that I have read on this site. It's hard to believe that this place rates so many opposing reviews. I will never go back here again.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 2, "date": "2013-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QfnZwcIxLacSJwkiSPd_Yw", "review_id": "TpdrYzpk_S89xZXCeEEC9w", "text": "Excellent everything! Classic family-run Greek restaurant. Home made everything, including great family-made Greek wine. Inexpensive and authentic. Christos, the owner is hospitable and welcoming. I come from NYC, and I say this is right on par with the Greek food back home.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 5, "date": "2013-04-26", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 2}, "user_id": "nYKao-8w_IOj4Mv8QWb2vg", "review_id": "wMTuSgCTFNV-4qcEX4j06g", "text": "Ok, Yelpers, I've been relying on you for a couple of years, but...  \n\nHad a lovely meal at Christo's last night.  Someone I work with frequents and recommended.  Then I turned to the Yelp community for confirmation and was torn because of the number of seemingly dissatisfied reviews.  I decided to risk one meal (after all, how much of a risk is THAT, really??) and follow the co-worker's referral.\n\nWe started with the house-made wine.  Red for Friend and sweet white for me.  Served in a juice glass and yummy enough for both of us to order another.\nHummus.  Not bland at all.  Freshly made and pleasingly lemony.  Pita was soft and fresh, as well.\n\nGreek salad.  Iceberg / Romaine mix with olives, green onions, and bit of marinated sweet red pepper.  Anchovies if you want 'em - and I always do!  Nice sized and great tasting. I cannot comment on the dressing as I abstained (anchovies do the trick for me).\n\nThe meatball dish was had by Friend and the lamb kabob for me.  Both dishes came with rice and stewed veggies.  We cleaned our plates and thoroughly enjoyed our meals.\n\nThe seating area is old.  The décor is old.  The pictures on the wall are authentic and include images of the owner as a child and through his life.  This is not a typical city restaurant and is certainly not competing with Alihan's, next door, or any of the other white linen establishments.  There is no input from 'corporate' and I counted four men working, total.\n\nThis is a come-as-you-are-and-I'll-sell-you-good-food kinda spot.  And that's what we did.  And that's what they did.  Sometimes it's just that simple.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 4, "date": "2014-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3kDlkdv22jeRS3vPRuQZ5Q", "review_id": "kQ6FHxig9ZQTPEipSt_Hfg", "text": "So....I read the reviews on Yelp & Urban Spoon.\nMostly negative, but hey I was hungry and gave it a shot.\nIt's true the place is dingy & like entering a Greek grandfather's home. \nI was first asked  if I wanted huumus. I declined that after reading is was mediocre at best. So I tried the $5.25 saganaki. It came out in an old brown dish with what looked like rubber floating in lemon juice and oil. * The owner failed to mention the pita bread was extra.\nIt tasted WORSE than it looked (if that was possible). Tough cheese mostly tasteless and chewy. * I have had many saganaki in various countries. This ranked as one of the VERY worst! I made the best decision to leave before food poisoning set in. Bottom line:  HORRIFIC !!!", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2014-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gtJJBaQwTwE45NnNF0coVA", "review_id": "IM7Zd30AzZRg8s69rAp8eQ", "text": "This is a lovely Greek restaurant  that my husband and I just happened upon while walking downtown looking for a suitable venue to dine and drink, being tourists still and not yet quite moved to the area.  \n\nWe had already been in one restaurant in which the wine prices were through the roof and had looked over several other menus tacked on the outside of some other restaurants.  Then, lo, and behold, Monica, I'm assuming one of the restaurant owners, walked up to us on the sidewalk menu in hand convincing us to come try her restaurant just a few strides away. And convincing she was.  \"Why not?\" we both thought.  She did such a good job giving us a sales pitch, we thought her restaurant deserved a chance tonight.  \n\nWe were ushered inside the small venue to a table very near another couple just finishing dessert and asked about their experience.  The fact that they were happy being there and the fact that there were other patrons was a positive start.  I was so afraid we were going to be ushered into an empty place begging for business but, not so.  There was a steady stream of clientele, most due to Monica's steady persuasion, I'm sure.  \n\nWe started with hummus and pita and a glass each of Greek white and red wine.  Then we ordered lamb and chicken kabob combo and some other greek dishes which came with a decent salad and a side.  Finally, we had to order dessert, knowing full well it would be home made.  The guests nearest us had ordered the Jackie O (as in Onasis) cake and another pastry, which is what Monica recommended to us so that's what we ordered.  It was all pretty good, not stellar, but pretty darned good.  I've definitely had more flavorful kabobs but I did appreciate the family home cooking aspect.   The wine was ok but would rather have ordered off a wine list.  The salad was a nice size and was good.  The Jackie O cake was light and moist -- a hit.  \n\nOne point to know that has been mentioned in other reviews:  the main meal looks to be inexpensive but it will add up quickly.  Everytime Monica looks at you with smiling eyes and asks if you'd like some wine, then ask if you want another glass, or do you want some hummus, and finally if you'd like dessert, you really want to say \"yes\" as if you're at your favorite aunt's house.  But, of course, each of these items comes with a price which you're glad to pay at the end of the meal because of your gracious host's manners and offerings.\n\nI swear that Monica has the best work ethic I've seen in a long time.  From the moment she saw us on the sidewalk, she was in motion from ushering us in, to seating us, to taking our order, to presenting our order, to refilling our water, to cleaning tables next to us, to flagging down more clientele, to making sure we and other clients were satisfied with their meals, to taking our payment.  \n\nOne small humorous note as other reviewers have pointed out:  Ask for directions to the restroom and you'll be ushered through the kitchen, saying hello to the dishwasher and the cook, down the stairs.  I've never experienced that before (probably for good reasons).  But, it was humorous.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2014-04-03", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "KC7FguU9mIlC9xpIMAbs2Q", "review_id": "SvA7cGNwtUsuKMFI_-HN8g", "text": "Magic happens at this restaurant. Beautiful family, beautiful service, wonderful food (and wine).\n\nWe love you Monica!!!!\nLove always, your friends in CA", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 5, "date": "2014-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "7rkjF6r76ZtK2FBUqXXKlQ", "review_id": "_cUCK5Qra7c2lugi_wqpug", "text": "So our intentions were to eat at the Indian place across the street however a lady ran across the street and started rattling off the menu as we were walking. At first I liked her moxy, but soon realized that if this is how they need to bring in customers we may be in trouble. Another mistake was sitting outside when they are trying to bring people in. Our dinner conversation was constantly interrupted by the servers yelling across the street and on the side walk at potential customers. \n\nNow on to the food:\n\nI ordered the chicken kabob. Very bland and it actually tasted baked not grilled. I didn't finish it.  The rice was good and the side veggies weren't bad. The spinach pie was ok. \n\nThey will ask \"would you like hummus to snack on before your meal\". This is not free or included. I figured this so I wasn't caught off guard. Some people I could see will be surprised at the end when they get the bill. \n\nMy wife got the lamb kabob. Bland again and very chewy. It didn't taste fresh, almost frozen at one point and microwaved. The cheese pie was pretty bad.\n\nHummus was ok. \n\n2 stars for the food\n3 stars for service\n1 star for the experience with yelling and fishing for customers. Seems like they may be in trouble financially and could be cutting corners to stay afloat. \n\nI will not go again. Alihan's next door is amazing, I recommend them over Christo's every day.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 2, "date": "2014-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GdRWLM_aey6qSwu5kyqijQ", "review_id": "eH_w0rseBY3KRow_zz-pdg", "text": "Every time I going to Pittsburgh, whether it's for show or sporting event, stop a Christos for dinner. It's a small family-owned restaurant all the food is homemade and everything I've tried has been delicious. They also have a dessert called the Jackie O cake which is simply fantastic. I would highly recommend this restaurant box if you like Mediterranean food. The staff is friendly warm inviting as well.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 5, "date": "2014-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hk5-Shrb63DFCSbpxzUFJw", "review_id": "k4T-TXrRDMHlDr_YAZp4Aw", "text": "The food from Christos was solid.  I would order from them again, although the hummus was a rather small portion for $4.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2015-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Eo9Rouncjh7jCWfrdeubKQ", "review_id": "KLNis1jIsgMll0m9CueOTQ", "text": "I'm definitely a fan, if not for the food for the authentic atmosphere! In my opinion it's hard to mess up Mediterranean food, and Christos doesn't. But I really like this place for the authenticity, intimate dining area, and perfectly awkward and warm interactions with the waiters and owner. If you're looking for classic, no frills Mediterranean food, this is the place!", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 4, "date": "2015-03-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "MbEuHx-tEC9YEFY9z9yPKw", "review_id": "qJCjJxfJlKV55mxgOYC0Rw", "text": "Christo is the chef, host, waiter...the food is traditional Greek, and good every time.  The soups are good, homemade, stick to your ribs.  Hummus is garlicky and of the thinner variety - served with warm toasty pita.  We all got soup and Greek salads last couple of times we went, then cake for dessert.  Really good.  Also, try the homemade red wine - it's fabulous!", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 4, "date": "2015-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gtJJBaQwTwE45NnNF0coVA", "review_id": "H2Dt91I2MeguKagG7jPHTA", "text": "After a show at the Heinz Hall, decided to stop here, a short walk and beside the garage we parked in.  Chose this place on purpose as it is basically the first restaurant my husband and I dined in when being put up in a hotel downtown by my company on an apartment hunting weekend.  Now that we know our way around a bit more, decided to revisit.\n\nThis time, no one greeted us upon entering.  There was one other table of diners.  There was a gentleman in the back at the cash register along with a girl and a boy who barely looked old enough to work here.  They might have been family members but I don't know.  No one seemed interested in greeting us at the front of the restaurant so my husband walks back to ask if they are open.  They are.  Finally, the young male leads us to our table with menus.  \n\nWe decide on the baklava sundaes.  They were reasonably priced -- 3.00 each -- and decently flavored.\n\nI just want to say the experience was quite a bit different than the first visit.  The first visit had us excited to try the restaurant, as the woman who worked there (I'm assuming one of the owners) was eager to pull us in from the sidewalk and entice us with her menu offerings.  This time no one was excited to have us as diners and they seemed to wish we weren't there.  Quite a difference in personalities and style.  They need the enthusiasm of the woman we had met before because there certainly were other Greek restaurants nearby with more patrons partaking of their fare.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2015-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XIvUGeLIo_6qRDafLnMalg", "review_id": "TaEi4ym-FqP9oRzMB_fuBg", "text": "This is my first time in Pittsburg. I asked the concierge for a recommendation for something casual that I could walk alone to at dusk safely and that wasn't a sandwich.  He recommended Christos.  I asked if they had falafel as this is one of my favorites since visiting Israel last year. He assured me they had great falafel. So I set off on a walk. When I arrived I noticed there was no falafel on the menu. But another of my favorites was - pastitsio. I took it to go along with the Jackie Onassis cake. The pastitsio isn't the best one I have had but it was good. It came with salad, rice, and Greek style green beans.  The Jackie Onassis cake was very light and not sweet at all. The cinnamon sprinkled on top was great.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2015-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "83hWgDuAy0yASTdAFLKYyg", "review_id": "j-pJAhfL7KFfVqwjhykQQw", "text": "Christos is a traditional Greek family-run restaurant.  As a Greek-American visiting Pittsburgh, I decided to stop in with my girlfriend before the Pirates game.   We shared some tzatziki with pitas and then ordered lamb kebabs (me) and leg of lamb (girlfriend).  Did I mention we love lamb?  Anyways, given that we basically ordered what I cook at home, the stakes were high, but Christos delivered! Our food was delicious, service attentive, and the whole thing was pretty speedy- we made it to our seats at PNC before the first pitch! This is a casual restaurant, good value, with a charming family feel.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 5, "date": "2015-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "5z6ZXMg3-XO3UmSxpZWBUA", "review_id": "hQkc88vGEMlnipDdpkKKpw", "text": "As I was passing by this place the owner (I think it was the owner) got my attention and persuaded me to look at the menu. Seeing that he was anxious for business I obliged and took a seat outside. I had the Taramasalata, which I believe was the mashed caviar, which was pretty good but didn't seem much different from Hummus. For my entree I ordered the Roasted Leg of Lamb, which came with a salad, rice pilaf and veggies. The lamb was okay nothing great and the rice I felt was a tad mushy and seemed like either too much water was added or it didn't all evaporate or absorb. The  salad, which I had with anchovies was very good as were the mixed veggies, which seemed to have an authentic flare to it. I also ordered dessert, which was a slice of cake with whipped cream and drizzlings of cinnamon, which was good but nothing special. The service was good as the owner was attentive to my needs. While I ate outside, I did go inside to pay and noted the Greek decor which was appealing.\n\nAll in all, I can tell the owner cares and made a reasonable effort to accommodate me. That said I think this is a nice establishment in an excellent location, but the food needs a step up. It wasn't bad, but there is room for improvement. Here is what I recommend: rice needs to be better prepared and perhaps have some nuts, raisins or garnish added to it, the lamb could be thicker, have the fat and/or tough parts removed and also have a stronger marinade or come with a gravy or sauce for more flavor, and maybe the mashed caviar could be mixed in with some unmashed caviar, which would give it much more flare and appeal.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2015-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Wnyn7QpHPu__BZvoqQGFow", "review_id": "dWYyLs-brZApswz98LrctA", "text": "I absolutely love this place! They have some of the greatest gyros I have ever had. However, that is not the only thing they have that is good. All of their salads and sandwiches are outstanding! I would recommend this place to anyone. Also, the employees are extremely nice and work hard to make sure everyone is served as quickly as possible.", "business_id": "AH1PrZQDIdjpKgy1z8XxUg", "stars": 5, "date": "2013-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1sOtq7vr2Iw55KL2v_8mQw", "review_id": "OsWNMr-_3hTpoTQ54gzWyA", "text": "The food is decent most of the time, but freshness is unpredictable.  A little pricey if you don't go with the daily special.  Salads are usually good but cost around $9.  The regular gyros are okay, but certainly not my favorite among the restaurants that serve them dowtown.  I found the chicken gyro to be mediocre, but gave it a second chance thinking it may have just been a bad batch, only to be displeased the second time as well.  Also, be warned it is cash only.", "business_id": "AH1PrZQDIdjpKgy1z8XxUg", "stars": 3, "date": "2014-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "And74LzjUDX4ssXHAqRVpA", "review_id": "6cqRqvsgQnnplJB8l9cRrA", "text": "I've been to Zorba's numerous times and I've never once been disappointed by their food. I can never decide what I want to get. The tuna melt pita and buffalo chicken salad are amazing!! Their ranch is delicious also. FYI, it's cash only. The prices are reasonable for lunch!", "business_id": "AH1PrZQDIdjpKgy1z8XxUg", "stars": 5, "date": "2015-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "aAlTMcBf-0Q9DewxhoCdEQ", "review_id": "wmHT0rywSOpTpzrgLupYSA", "text": "I am a big fan of It's Greek to Me in Brookline.  This tiny little place at the edge of Brookline doesn't look like much, but it has a real family character, cheap eats and tasty food.\n\nI have dined in twice and got carry out twice as well.  The first time I got a platter/dinner, but I found the deal is really to be had with the gyros.  Getting two gyros and a huge amount of fries for only $10 is a steal.  The gyro bread is toasted, but still soft and it is loaded with meat like your grandma would try to feed you.  The veggies have always tasted fresh and it is served hot.  If I could change on thing, I would prefer fresh herbs on the gyro instead of dried.  This gyro is definitely more spiced up than your chain restaurant gyro.  The fries are fresh cut and nothing is cooked until you order it.\n\nIf you choose to dine in, you will be greeted by the proprietor and casually asked to take a seat any where you like.  This isn't the type of place for formalities.  She will offer you some delicious Greek Tea (you have to try it) and take your order, cook it and then serve it to you.  Sometimes you can hear bickering in the kitchen between her and her old man- but that only adds to the family atmosphere.  The store does take credit card, so that's a great modern convenience.  At the end of the meal, we've always gotten a stick of gum :)\n\nIf you choose to carry out, it's a simple call and your food is ready by the time you drive down there.  There is usually a place to park near by and you can be on your way quickly.", "business_id": "cH8I7JgPXcrcutT1a3YrjQ", "stars": 4, "date": "2013-03-17", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "KpOVBdN4qnEa5ghu_t7TYQ", "review_id": "7z5C9CL6EZ3KaF1n6k0NeA", "text": "It's not Greek to me, because this place makes perfect sense!\n\nThe people that own it are so sweet and make the best food.\n\nEvery time I go there, I stuff myself until I want to die. And then I spend several sleepless nights sweaty and anxious until I can eat their food again. I went from not liking humus to a humus-based diet after eating here. \n\nBut do not ask for their recipes! Trust me, they know their food is made with magic and they are not sharing -- a bottle of wine and I tried to get it out of them once unsuccessfully.", "business_id": "cH8I7JgPXcrcutT1a3YrjQ", "stars": 5, "date": "2013-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "L_ZCrE7g1l_yzzNTmS8u8g", "review_id": "doGPqYJAh3VnzF8xFkTnFg", "text": "Hmm! Hmm! Well, I do agree this place is nice. I think 5 stars is a bit over the top.\n\nThat being said, the staff (the woman who owns it..) is extremely extremely nice. The prices are fair. The food was good.\n\nI don't generally eat meat often, but the falafel here was quite excellent. Some of the other reviews claim meat, so I can't chime in there.\n\nTry the tea!", "business_id": "cH8I7JgPXcrcutT1a3YrjQ", "stars": 4, "date": "2013-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V2sl38z9uGmiAggiQLcFlg", "review_id": "byeyAvPTpXy-RGb4Aps6cw", "text": "Nice people, busy busy busy place, but always great service, fast kitchen.\n\nThe kitchen is super fast for carryout.", "business_id": "ASwN3Ih0Eh1oH0npLbzVjA", "stars": 4, "date": "2012-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "27aGnUabXY23OH5oilHe7g", "review_id": "k_P3SXVG2cWqDXnZ2J9R4w", "text": "This is a decent Showmars. Service is usually pretty good. Food is exactly what you would come to expect. Restaurant is always kept very clean.\nThe parking lot can be a bit hairy depending on the time of day.", "business_id": "8PsQqhrAH5uqJ7HODOmXYg", "stars": 3, "date": "2011-04-06", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "wvdt2Vx2RiUUllw_o5kpjg", "review_id": "MTXvgGqdjy0sPdupQMVheg", "text": "Decent service...horrible food. I can't for the life of me understand how this company is so successful. It could only be worse if it was yet another failed Greek attempt at Italian.", "business_id": "8PsQqhrAH5uqJ7HODOmXYg", "stars": 1, "date": "2011-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JPSPs4lH7wNQSITKLGFzGw", "review_id": "PwiNoopsZOcxbFeWsp_7pA", "text": "Every employee greets you and goes above and beyond to make sure you are having a great dining experience!!  The food is delicious and fresh.  VERY clean and in a cool location with other eateries & unique shops!!", "business_id": "8PsQqhrAH5uqJ7HODOmXYg", "stars": 4, "date": "2013-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "3eY9tFgtCwCu6iRy6NZLHQ", "review_id": "hqEgLkUzka_O5jRg-M7t0g", "text": "This is a local favorite for the guys at work.  The Chicken Parmesan Sandwich is truly a delightful meal, and I have yet to have any sandwich that was not anything but delicious.  \n\nOpen for breakfast and lunch, it has plenty of seating for the local college students and business park employees.  It seems to have the entire Charlotte Police Dept eating there daily which is very interesting seeing that they do not sell doughnuts at all.\n\nThis is not a fast food joint, but you do place the order at the counter, and they will yell your number when ready.  The line is usually to the door, but it does move fast and they do have a separate takeout/pickup line for those who choose to call ahead.\n\nIt's off the beaten path, but if you have time during the week for lunch and you are near the airport, do yourself a favor and give this place a try.\n\nPlenty of parking is available, and the service is good.  \n\nIf I had another hand, I would give it 3 thumbs up.\n\nNCFoodGuy", "business_id": "crKd3Kf3YYP8znwoMvcA-g", "stars": 4, "date": "2011-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "F415rWbMAapQFdl7F51-IA", "review_id": "6a4DyJuC6tCftoXROP53AA", "text": "Excellent food and plenty of seating.  The gyro was great - they definitely nailed the tazitki sauce!", "business_id": "crKd3Kf3YYP8znwoMvcA-g", "stars": 4, "date": "2011-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oqoITYmFYsP8Zvg_EvDsww", "review_id": "Q32CegFvCZrh5ToE61vztg", "text": "If you didn't know where it was you'd miss it.  Dining area is sparse, basic tables and booths. Open deli-style.  \n\nGot the chicken parm sub as recommended by Yelpers.  Mine was a little dry but a decent sandwich.  Still not sure i would order it again.  Fries are standard crinkle-cut.  \n\nSummary: good place as alternative to nearby fast food joints but I wouldn't go out of my way to come again.", "business_id": "crKd3Kf3YYP8znwoMvcA-g", "stars": 2, "date": "2013-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eQQy-bxHAU77xLPlGlutyg", "review_id": "7IIMJNlX4LKxoXWvsmsjbA", "text": "Good food. Good prices. Horrible coffee. The best thing on the menu is the Tuna melt on Rye.", "business_id": "crKd3Kf3YYP8znwoMvcA-g", "stars": 3, "date": "2013-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "psLNPQW-lxItj3e_-op74A", "review_id": "ayyGeXJy1B9SRQR-xZZQyA", "text": "Decent lunch.. Greek American. We were over at the airport center for training and there are not a lot of choices for lunch so we decided to check out this place that was within walking distance. Menu includes hot sandwiches, wraps, gyros, and salads. Pretty basic. But if you are short on time you get your food pretty quick.", "business_id": "crKd3Kf3YYP8znwoMvcA-g", "stars": 2, "date": "2014-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 3}, "user_id": "3eY9tFgtCwCu6iRy6NZLHQ", "review_id": "N31kypxApSOCoNd_nx1gZA", "text": "I almost hate to write a good review......because I will let my little secret gem be found by the masses.\n\nSo, let's just start this by saying that this place was started in 1987.  It's tucked away off the road, right across from the NC National Guard Armory on Morris Field Drive, near the NC Aviation Museum.\n\nFrom the outside, the place shows its age, and as I see it, these folks are just too darn busy cooking up some good food, to tend to the classic vintage facade.\n\nThe inside is your classic 80's area seating....nice comfortable vinyl seats. I do mostly take out here only because my coworkers love this place, and we just do not get enough time to enjoy it here.  You need to get there early, because after 11:30 the place gets packed.\n\nThe food is consistently good and always ready when I get there.  I have always been pleased with the service, quality, and speed at which these folks operate.\n\nOk, so, take my advice, eat here, but please do me a favor and wait till after 11:30am,  so I do not feel so bad about letting you know my favorite little eating place during the week.\n\nI have enclosed a few pictures for your savory enjoyment.\n\nNCFoodGuy", "business_id": "M89wkxqAcXuVMtWh91BIjg", "stars": 4, "date": "2011-05-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "STYNw0vKfJCvBkM8tUoMxQ", "review_id": "r9BmRHWvtntsky6qRzXCbA", "text": "We just ate here for the 1st time today and it was really good. The food is great and I couldn't believe the cheap prices.  Its definitely a hole in the wall but the staff is very friendly.", "business_id": "M89wkxqAcXuVMtWh91BIjg", "stars": 4, "date": "2011-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1bOrK1JhfXYoMJqPLWFg8Q", "review_id": "KkHFS9rAHtq49YYMWEuFOg", "text": "Use to go here all the time for lunch. Always crowded at lunch time. Everyone that worked there was very friendly.  Had good fish sandwiches, great fried okra and fried chicken wings (big ones). And yes, it is a hole in the wall.", "business_id": "M89wkxqAcXuVMtWh91BIjg", "stars": 4, "date": "2011-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "r8q4Y3iP8thYoDJYuHaCXQ", "review_id": "-EdY37gpbHUHzPx8L7zoOQ", "text": "They have one of the best fried chicken sandwiches I have ever had.  I was blocked in traffic due to the president taking off at the airport, so when I ordered my food to pick up, they literally brought it out to my car for me.  They are the nicest people.", "business_id": "M89wkxqAcXuVMtWh91BIjg", "stars": 4, "date": "2012-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AKvEiRlf-6vJnM0uZ1nq3A", "review_id": "ZmSpWhsGGQvAv3GFvkl0TA", "text": "So, it seems that I order breakfast a lot from this place because I literally call in my order and before I can offer my name, the voice on the other end says: \"Thanks, Michelle! We'll see you in a few minutes!\"  Geez!  Am I that predictable? lol  Honestly, I think they take time to remember the regulars and that says something to me... The food is priced fairly, tastes great and doesn't leave me ready to slump over my desk after I finish it... I've been for lunch a few times and it was great as well, but I truly enjoy their breakfast special (one egg, one meat, grits or hashbrowns and toast for around $3)... Their lemonade is also worth a shot... It's not too sour or too sweet, just the way I like it...", "business_id": "M89wkxqAcXuVMtWh91BIjg", "stars": 4, "date": "2013-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KD0APk3cChSYrC4nqhcuxg", "review_id": "KDN76Xn7OQThjiyR2wncfg", "text": "The best bang for your buck... Literally! Cheapest meal for one of the best taste in the area... Serving great all American dishes like burgers and such...", "business_id": "M89wkxqAcXuVMtWh91BIjg", "stars": 4, "date": "2013-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CrKrIoBfcsKqBgPJmOvA5w", "review_id": "tq7tvZOLlSHinHnEvHp_1Q", "text": "Terrible! I'm just now getting over this horrible stomach bug caused by his place. I ended up paying $10.92 for a salad, water, and a small tiramisu. Needless to say, that price is ridiculous! You should never have to pay that much at lunch time for that little amount of food. \n\nSpeaking of the food, in the salad, there was an egg and so I out it on a napkin because I don't like eggs. The waitress came by and asked how it was and I told her that I didn't like the egg. Instead of taking it or saying \"hey sorry about that\" or something to the effect, she just walked off. \n\nThe tiramisu was awful, it tasted like someone tried to make banana pudding and failed. If you like tiramisu like I do, go to Olive Garden or SAMs club around Christmas. You will not be disappointed like you will here. \n\nNeedless to say, I'm never going back.", "business_id": "M89wkxqAcXuVMtWh91BIjg", "stars": 1, "date": "2014-03-22", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "ts7EG6Zv2zdMDg29nyqGfA", "review_id": "9PMuiay92hhyvoIefLXZdg", "text": "Never a bad choice to stop in at a Showmars.  This location was great and very busy!  Not to worry, they are quick to serve and keep the line moving very well.  Love the salads they have and tried the ham and turkey salad.  It was fantastic and the warm pita bread that comes with it is a great compliment.  \n\nFor those that haven't ever tried Showmars, you are missing out on some great food, friendly service and even though there are several locations it is a local business.", "business_id": "Lw-01HQDswygHvAZfwkpxA", "stars": 4, "date": "2012-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6PO3R6ZUw8r6WfRnzlexnA", "review_id": "Oi_icXtrbJDosQlwkHKwdQ", "text": "Showmars is still showmars, I tried three different locations in town (South Park Mall, Uptown, and this location on Park Rd). I haven't had showmars in a couple years and decided to rejuvenate my taste buds since I was craving mediterranean food. My review will be based on my experience at this location:\n\nCons:\n1. Don't expect to find a parking spot at this location, especially during busy lunch hours. \n2. Drive through line is so long it wraps around the entire store, so you may as well just park your car across the street at the CVS and walk over to dine inside.\n3. There will not be enough indoor seating, so expect to have to sit on the outside patio. This may be less tempting in the hot Charlotte summers. \n4. I ordered the gyro platter, it was a mistake! I've never been to a mediterranean place that served my gyro in separate pieces, meaning the pita was separate from my meat. Did I mention there was no veggie for my pita, the picture on there menu looks nothing like the food I got. All I got was a piece of pita by itself and a cup of beef strips. \n\nNeutral:\n1. Wait time, I waited about 10-15 minute for my order...which could be a tad faster seeing it's a fast food chain\n\nPros:\n1. Great dining booths and interior decoration for a fast food joint. seriously, the inside looked like a sit down restaurant, great that they also have patio seating option. \n2. Sanitation score is not bad, 96.5\n3. Their daily specials\n4. Milkshakes are only $2.75 (Did not taste test to see if any good so I cannot comment on quality)\n\nTip:\n-Check the board for their daily specials!! I cannot emphasize this enough. I wish I had just gotten the chicken gyro with fries which was a special going on for the day for just $5.69...The chicken gyro itself is worth $.5.29 already on the regular menu so this is a great deal. They have more than just gyros on special, they also have soup, salad etc.\n-If you want yummy authentic greek food, try greco fresh grille on Rea Rd, 10x better! Oh, need I mention that the price is just as competitive as showmars?", "business_id": "Lw-01HQDswygHvAZfwkpxA", "stars": 3, "date": "2013-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ybG5P8QlP5rA58yd7NRqDg", "review_id": "18lDhmsiv8TM4XWKcKK11w", "text": "Good food great price ! Everybody loves Showmars !!! If you haven't been here you're missing out !", "business_id": "Lw-01HQDswygHvAZfwkpxA", "stars": 4, "date": "2015-03-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "T_kMEgHqIqwbHR_7yhqWFw", "review_id": "liGVYcQ2oAHngHJMSbyFfw", "text": "What a train wreck! I stopped in there for lunch at 11:15, the place was close to empty and the waiter took my order within a couple of minutes- this was the peak of the good service, or more accurately the anomaly of the terrible service. \n\nThe restaurant began to fill up and at 11:47 my chicken pita was no where to be found, after going to the counter and requesting my order to go, I only had to wait an additional 10 minutes- too bad because the food was actually really good. \n\nI just don't have that much to time to invest in a quick lunch.", "business_id": "6-jlUgqp0Mv3PUzMGjrb0A", "stars": 2, "date": "2011-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0HDqAfvyV7QnQmdKHv6xBQ", "review_id": "LDdSlRBODv9mw0xAB_rbhA", "text": "Breakfast was fast, cheap, and very good!!!  We are staying around the corner and looking for a place to get good cheap breakfast and we found it at Showmars!!!  Staff was friendly!", "business_id": "bffCUYaQ4FejTfu_xFwjyQ", "stars": 4, "date": "2013-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Al_lV54KFnRgAqDO-qVIuw", "review_id": "TE4p2DH8GtNBQuYXvAv33A", "text": "This is a good diner-style place to grab a quick breakfast or lunch. They usually have good daily lunch specials ... I was a little sad to hear that the Thursday lunch special went from $4.95 up to $6.99  ---- that's a little bit of a steep hike in my book. That doesn't really make it a special anymore, that almost makes it normal price.\n\nAnyways: I'd recommend the chicken salad... the Triple C burger, ANY of the salads, the buffalo chicken pita, the gyro, or their famous pita burgers. \n\nDefinitely a greasy-spoon type chain, but it does the trick!", "business_id": "bffCUYaQ4FejTfu_xFwjyQ", "stars": 3, "date": "2015-05-08", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "QJLI1ifWAs-JV8ArBg_Y6w", "review_id": "6Jlf6pZN4VQYx41dluTmBw", "text": "Even though all their good is deep fried and artery clogging, I truly love Showmars. My personal favorite is their fish sandwich with lots of tarter sauce and onion rings on the side. The fish is fresh and the onion rings are thick and delicious. I also like the gyros, fish platters, burgers, and hot dogs. It is a fun place to go for a casual lunch and I would definitely recommend it. My only word of caution is to stay away from the chicken tenders because they are frozen and not worth the money.", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 4, "date": "2009-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wc0IlzGW9Zl70T8jDI9f_Q", "review_id": "-r83psVZG0gUNw1iYXDYSQ", "text": "Cant go wrong with this place specialy if you need a family eat out spot.", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 4, "date": "2012-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4G68oLRY3aHE5XUt_MUUcA", "review_id": "B1oBkPN3bVvMAnTcZDIkcA", "text": "Usually have to make sacrifices when you are looking for something good, fast, and inexpensive, but Showmars fits the bill.  Granted it's probably not the healthiest of food options, but they provide quick service at affordable prices.  Win win.\n\nMy one complaint about this location is the parking lot.  It gets super busy during lunch and between some of the landscaping and the layout, the parking situation can get pretty messy.\n\nOverall the staff is friendly and really cater to your needs while you are eating.  There's always a person walking around making sure you have refills and you got everything you need to enjoy your eating experience.", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 4, "date": "2013-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XcAv47KxTyWR55kIE2eAQQ", "review_id": "e3WZ8lHnBiqIg73njUjoMQ", "text": "We decided because of approximately to eat at this restaurant.  Our family walked in to a large, overhead menu board filled with American and Greek fares.  The kids order the small shrimp plate, my wife the burger, and I decided to enjoy my favorite Greek dish, the gyro.  The place was clean and bright. Everyone enjoyed their meal very much. My wife enjoyed the burger and the gyro was one of the best. It was overflowing with tasty meat, red onion, and fresh, red tomatoes.  Couldn't expect better.", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 5, "date": "2015-05-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "r7SKNI3EAkxMihlU97imYQ", "review_id": "LBV8IEECjk8EpOCSr4qy6w", "text": "For my money this is the best place in Madison to get a gyro.  The place is a little shady and hasn't been updated since it was built, but you'll get a lot of good food for not a lot of cash and you will get it with a smile and that makes all the difference.  The gyros are essentially the same as Parthenon and, for that matter, 99% of all gyro places.  I go with the gyro dinner, however, which is double the meat and is absolutely glorious in all of its artery clogging goodness.  I've never tried any of their other items, but they have your usual deep fried fare if you are so inclined.  Also, the owner always seems to be there and in a friendly mood as opposed to the dour S.O.B.s downtown.", "business_id": "Pa_brCvUaiUPPvm3tJQwgw", "stars": 4, "date": "2008-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "AFK20uwV5Kr-f8at2_BV8Q", "review_id": "-IxIvtWDiOvCchorYWY9tA", "text": "Great gyros and fries. Often crowded, so plan on a wait for food and a table.  Go on Tuesdays for discount prices.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2006-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "6pC5j-hfP4xLZB2W0Wi1vg", "review_id": "HPu2q8oPVEKI30TZOb55-g", "text": "i used to eat the gyros here as a student and loved them...now that i'm all grown up i still love to eat here but i just eat the veggies on a pita with that yummy cucumber sauce and still love their fries.  i think what i love about this place more than the food is the fact that every single time i come here, i run into a friend, who is likely another uiuc alum, who happens to also have ended up living here, we strike up a conversation and realize the place feels even better when you're not procrastinating studying for an exam.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2007-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "DbJHA6uuUeCcCrIiLxDawg", "review_id": "EtXyZpL9emwL9fFnVgQZsw", "text": "This past weekend, my bf and I did a quick trip to Champaign, because we just needed to get out of Chicago for a couple of days.  When we parked our car and walked down Green St., there were a whole bunch of NEW restaurants compared to when I went to college years ago.  One familiar restaurant was Zorba's.  Got two med. gyros, fries, and drinks to go.  When we sat outside on the quad, we upwrapped a tightly rolled gyro.  So eating it outside on a windy day was not a problem at all!  Really good and the pita seemed fresh and light, not super greasy like the joints here in Chicago.  Don't think I'll go back to Champaign for a long time, but it's a great lunch/dinner option.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2008-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8hFMyX-CYPv6XEYojQ6Zbg", "review_id": "Agnw1OOcOLjHB5510VKLtQ", "text": "My friend introduced me to Zorba's, I love their special, it keeps me awake at night, drooling for it...\n\nFries are good as well, overall great experience.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2010-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_9uvL80xzBxDjWzFM7Da5g", "review_id": "nLwNA-H0Upj_JJWS_bNgEQ", "text": "I was trying to think of places I would miss when I finish my Master's program here in Champaign-Urbana and the top three are Murphy's, Canopy Club and Zorba's. \n\nI've always been a fan of gyros and I have to say that these are right up there with the ones I get in Chicago. In fact, Zorba's is better than some of the gyros I've gotten in Chicago before. \n\nThis is my favorite place to eat on Green Street. Besides Antonio's, it's probably the only one that not a chain and I unequivocally love the Large Gyro combo plain with a Cherry Pepsi.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2010-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-mqE7uZSnGEAb_quhfcyJQ", "review_id": "E0B_M-7yrP3-0HjXsIObAQ", "text": "Zorba's burned to the ground March 23, 2011.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 2, "date": "2011-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4b_Yo9nopZRqRoTQRXp9EQ", "review_id": "ohB6H5P9Id0OvqXAimOdTw", "text": "This was my favorite place to get Gyros in town. Despite the heated debate over who had the best gyros (Zorba's vs. Niro's Gyros), I always sided with Zorba's, the 'fixins' added to the gyro (tomato, onions and whatever else you wanted) were always fresh and great quality, something that NIro's seemed to lack on more than one occasion.\n\nZorba's had daily specials (like Groovy Tuesdays: one dollar off classic gyro meals) which kept me coming back every Tuesday I attended classes at the University of Illinois. \n\nHowever, on Wednesday March 23, 2011 Zorba's was affected by the fire that started in the apartments above the business. As of now, I don't know when, if ever they'll re-open their shop on Green St. But here's to hoping!", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2011-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4-26G78HUj9ttqQZxEtaNA", "review_id": "LBOtIs3HiDcoVsaBi2etaQ", "text": "so greasy it burned the fuck down ! i am sure each gyro and basket of fries i ate there each knocked 6 months off of my lifespan. All I can say is I;m still alive so I obviously didn't eat there enough", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2011-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kjAzzz0pYNwRrJsS75pOwQ", "review_id": "NWLPTiqnk2sm4rNGqS1ftg", "text": "One word.  Disappointed.\n\nGood looking interior, and even had some of the old tables from the original Zorbas.\n\nI ordered my food and waited to pay.  The cashier left to take orders, and the line started backing up.  The fifteen minute wait time would be forgivable if the fries weren't old, overcooked, and the portions of meat, small.  There was literally 30-40 people crammed into this place ordering food and still got bad french fries...\n\nGreen St. never really had good quality food, but there is a disturbing trend of places like Beef Stand and Sliders charging EXPENSIVE prices for college students and making subpar food.   Nero's on university charges about the same price for what I got, and their fries are fresh and hot, give you huge portions on gyro meat and have it cooked well.  The only thing I paid for was the convenience of eating on Green St.  \n\nAs a college student, and someone who works summers and breaks to pay for food during the year, I'm looking for a DEAL or at the very least, willing to pay the price for good food.  All I got was something overpriced and meh.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 2, "date": "2012-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "qdL_6QKs8_U74ugjs0MpPg", "review_id": "xFDRY6y2B1uMM0ovLHfVFw", "text": "I only went to Zorba's a couple times before it closed, and I remember being disappointed with it because I could get much better gyros back home.  I had given up on gyros on campus (until I went to niro's but that's another review) but I was willing to give Zorba's another chance when it reopened.  Many of my friends thought I was crazy for preferring niro's, so maybe I just remembered wrong?\n\nWell, it was pretty much the same as I remembered.  The meat is mediocre, and I feel like you definitely get more for your money at niro's.  I do like that they have different sizes so you don't have to get a giant gyro if you're not particularly hungry.\n\nHad I rated Zorba's before coming back, I would have given them four stars.  The food isn't bad; I've just had better.  But my favorite part of a gyro is the cucumber sauce, and it just wasn't right here.  Correct me if I'm mistaken, but isn't it supposed to be thick, white, and yogurty?  And nice and cold so you get that contrast between the cold sauce and the warm gyro meat?  Well, the sauce here was runny, warm, and almost clear.  I don't know, maybe something was just weird when I went, but with Niro's in my backyard (where I know they have the right sauce) and graduation in a month, I doubt I'll be back.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 3, "date": "2012-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XOnwygK-EerILmQSxP2K6Q", "review_id": "omAOEcvCkxVgUy2jCvYUXg", "text": "Welcome back Zorbas! Green Street didn't feel the same without you since you burned down.\n\nZorba's new space is much more roomy with the cashier on the right and near the back, directly opposite from where it was located before. Although the ambiance is much improved, my gyro lacked taste. Sure it had all of the fixings without me asking: yogurt sauce, cucumber, tomato, onion...but the meat was bland.\n\nMy expectations for food quality are high even though this restaurant is located in the midst of collegiate-drunken-food-ville where food in this area is generally bland.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 2, "date": "2012-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xGkgSpo-PHONO9wIpTcQ4w", "review_id": "cec84kvYwZbBmXK7FoJN8Q", "text": "A great place for gryos, their cucumber sauce is the best! I also like that they have different sizes of gyros so you can choose based on how hungry you are.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2013-05-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "AZ9x-RhMQO_FwlW1reuE6w", "review_id": "bD0AHRhMOaP7ktUbC2jjSw", "text": "This is simply one of my favorite spots in town. They say that consistency is the hallmark of excellence. Well I've been stuffing my face with their delicious gyros and assorted fried side dishes since high school, and I've yet to eat one that wasn't just totally fulfilling and delicious.  Actually, the hallmark of excellence is probably just making really fantastic gyros, which is a thing that Zorba's is all about. The staff is always friendly, and even at their busiest you're going to get your order quickly.\n\nMy go to order has generally been the large chicken, however you can't go wrong with the classic. You can take either and pick a size to fit your small-large appetite, and then customize it from there, which is a little different, and better, than most other gyro joints I've visited. I also prefer subbing in onion rings or fried mushrooms for fries.\nThe location is a little small, so it can get packed during the lunch hour, but even so there is usually a table open, or you can easily get your meal to go.\n\nIf you find yourself on campus and don't check this place out, you're doing yourself an enormous disservice.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2014-04-30", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "lH1rXk40kv2suZan17llhg", "review_id": "6-GywJdYWFVGo3IZ6yHnzQ", "text": "Best Gyros in Illinois. Fast and delicious. A campus treasure. A Champaign treasure.\n\nThe gyros are authentic and the santiki (?) sauce is second to none.  Greek salads are another highlight.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2014-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "eFIlrOz3TnuZQeh2Y1e17Q", "review_id": "RIYyutG4GDz26HtdHe-MNQ", "text": "They sell their gyros in 4 sizes: 2 oz, 4 oz, 6 oz, and 8 oz. This is pretty neat as a large or medium gyro should be enough to suffice a hungry person. However, I have to say that their gyro meat isn't as succulent as I thought it'd be. The Greek salad wasn't anything special either. I gotta say that I prefer Niro's Gyros more.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 2, "date": "2014-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kgYNx4haiRhzCy2VKrXwtA", "review_id": "5OAr278a4CdhrL9Mxd4HcA", "text": "Zorba's has the best gyros, hands-down. I grew up in Champaign and this was a favorite stomping ground! Having lived all over the US now, I have never found a better gyro anywhere, and have even been known to drive from whatever corner of the US (currently CO :) I'm in just to get Zorba's for the weekend. So glad that they rebuilt!! Coming back in July, Zorba's!!", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2015-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G2gXoLGSsUISDNGE98Ud3w", "review_id": "eXnUSo9hd4pRyMKidtz0lw", "text": "Overpriced, not a very expansive menu, gyros were average, ugly interior, I took my friend there from out of town because I thought it would be ok and was incredibly disappointed. Location is great. Won't go back", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 1, "date": "2015-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QricGnURbG_caoL6ZHfGCA", "review_id": "kBUz5kYOcjvwjYMaANhNRA", "text": "The Meat: Piece of bone or something in the meat..... grinded my teeth on it, then annoyingly couldn't find it amidst the food so I can spit out the bone and had to spit the food out. Any gyro I've ever had in Chicago the meat would be cooked nice and crisp, here it's soggy and not fresh tasting. The bread is like wonder bread in terms of gyros breads, and I don't mean toasted with PB & J I mean wonder bread and baloney sandwich. Doesn't have that lightly greasy, crunchy, and fresh taste I'm used to in gyros.\n\nOther thoughts and comments: Hooked app got me 2 gyros for 5.50 including tax... normally 1 of these bad boys is 5.50 (WTF that means two is $11?!?!? And it's not even enough to get full). The guy assembling them had to move the meat to a scale on the other side of the kitchen, and he was really bad and annoying at it. This is literally what he did: Move a few small pieces of gyro meat with his tongs at a time (liquid dripping on floor and everything, nothing under the tongs). He went back and forth between the pot it was stored in and the scale, then picked up the pieces of meat from the scale piece by piece onto the sandwich. Oh yeah when he was going back and forth he would make sure it was the perfect amount to the GRAM. He would sit at the pot for like 5 seconds debating whether to take an extra 1cm square piece of gyro meat in his tongs or not. Something about that just makes it ADDITIONALLY less appetizing and annoying... \n\nI don't expect much from a Green St. restaurant to be honest (to name some bad ones would be: Wingin out, this place, papa d's), but this one just topped the lows EASILY. The only worse place Usually when I see 4 stars on Yelp that's actually a good place to eat... but... dang son", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 1, "date": "2015-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vc9CpTxi5j09ON5EGA0oWQ", "review_id": "4g46JnLB59kg_7Hqe41Vjw", "text": "Best gyros (authentic, taste great, and affordable) on campus.\nThis place is a U of I must-eat!", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2015-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "EiboDjzB7qfd3Vgu_U_Rgw", "review_id": "2t5J0YStAG-wazkz0eNPIQ", "text": "Tender gyros meat at decent prices. Just stick with a gyros sandwich (the fries are mediocre). This place has been around since my parents were on UIUC's campus in the early-mid 70s and it's a great place to take them. I can't speak to the seating during peak hours because I usually would drop by here if there was a deal on Hooked midafternoon if I hadn't eaten lunch.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2015-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HlJzRpGyphvD0UI6Q2VCfw", "review_id": "Aelu9fcPpAbKQYnVW7f9YQ", "text": "You like gyros? You like fresh fries? You like Green Street? Well, then you'll love Zorbas.  \n\nZorbas was a staple during undergrad and it hasn't lost its taste in the years since I've left.  Regardless of where I move or visit, every gyro I have is compared to Zorbas - they're the gold standard in my mind.  The meat is always juicey and the fries always salty.  Perfect for a social lunch or a recovery meal.  \n\nWord to the wise - load that sucker up with extra meat and tzatziki sauce (or \"cucumber sauce\") for maximum flavor.", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 4, "date": "2015-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "lC4X2crUuxT9Ac9BlOX4Uw", "review_id": "q5uLK2HF_KwAm8eWg6izNw", "text": "The Matador must be a Phoenix landmark for a reason. My guess is location, location, location. They've been serving better-than-average Mexican classics to hungry bankers, construction workers and sports fans for over 25 years. We've been here after games twice and I can say there is definitely better Mexican food out there. But the food was tasty -- especially the chips and hot salsa. On the down side, service is poor and the highlight of the dark, 70's decor is the kitschy matador mural on the wall.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 3, "date": "2007-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "7pqOCK__eRP6Er2gw3yvKA", "review_id": "BM_o94F_WVaxpVczXY93rg", "text": "Let me preface this by saying that I LOVE Mexican food......and its really hard (in my opinion) to f*$k it up!\n\nMy girlfriend and I decided to try this local establishment this past weekend....couldn't have been much more disappointed!\n\nIt was busy....some local convention going down in the area...anyhow, we were sat quickly....\n\nOur drink order was taken...had to custom order our Margs....I mean who still drinks them with sweet and sour??  So we got them (after what seemed like an eternity!)\n\nOK.....this was the one good thing about the experience.....the margs were top notch!  (but you have to remember....tequila, cointreau and lime juice...that's it NOTHING more....)\n\nNow...on to the food....if I had to choose one word to sum it up.....wait for it....wait for it....ATROCIOUS!!\n\nThe chips were good but the salsa sucked....tasted like pizza sauce, I mean really how hard is good salsa...\n\nI ordered.....carne asada....\n....a staple in the catalog of good Mexican fair....but  NO...it was horrible (believe it or not, I'm being kind here!)  It was a cut of meat that I'd never seen served in this capacity.......not sure what the h&ll it was...only thing I know for sure, it was bad....over cooked, and chewy...how does that happen?\n\nLuckily, my patient and lovely girlfriend decided on the Chicken fajitas......thank god!\nthey were at least a 7 on the scale....so we filled up on those...every once and a while taking a bite of my less than stellar second place dish!\n\nThe beans were 'ok'...the rice...well lets just say that the \"San Fransisco\ntreat' could have been a better showing!\n\nSide note.....some one should let these people in on something...the \"leather' aprons that the bussers wear.....yeah, you guessed it...they look straight out of Hostel....you know, the ones that the killers wore.....not really \"setting the atmosphere\" if you ask me!\n\nAll in all....the only reason I can give them two stars instead of one....the Margs.....great drinks can do a LOT to improve a bad experience!\n\nDo yourself a favor.....skip this one all together.....\n\nSecond side note....all the 'best of Phoenix' awards don't mean squat.....if they are from the early 80's....", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 2, "date": "2008-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PMCp0FxxxC3PLi4BBgKf2g", "review_id": "aDI3McrXVNMryqmtWVbLDQ", "text": "I wont be back here again,  Ever.    Can one give less that 1 star? \n\nIt is a bummer as I used to frequent this place as it is conveniently located for me.  Pamela the bartender is a sweetheart and works hard to recognize people by name.   Personalized service like hers helped me to overlook issues like the significant cleanliness challenges that are easy to spot if you look around.   If you think I am joking go into the bar and look up a the light fixtures.   That fuzzy stuff is probably 10+ years of dust.  Carpets are dingy and smells like old beer.  This place rocks as a nightclub on weekends I dont think that cleanliness is the priority......anyhow....I spent a lot of money there over the years, mainly for lunch or after work cocktails with friends.  Never more..... not because of the issues outlined above, but it is beacuse how I was treated when visiting the establishment not long ago.   Pamela was not working that day (sadly) and the male bartender decided that he was more interested in lecturing me on his beliefs than he was in serving my drinks and taking my money.  He had an issue, and apparently I was the target and cause of his rantings.   He was sad about the lack of customers and decided it was my fault as I mentioned I worked downtown.   His rants about downtown businesses was unorthodox and uncalled for.   I drank my beer and hurried out reminding myself never to set foot in the place again.  No wonder they are lacking for customers.    There are more and more restaurants downtown.  Time to step it up or get out of the way Matador!", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 1, "date": "2009-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "AirVzN1BVQBmq5zY0YMNYQ", "review_id": "-x5Y9XAla0-JmUYkIHdpSw", "text": "I've been here several times for various work lunches.  While this is never my first pick, I don't mind eating here.  Typically, the service seems a little slow during lunch (even when they are not very busy), so don't go if you are short on time.  While most people go for the Mexican food, which I think is OK, I heard once the owners are actually Greek and that is why there are some Greek items on the menu.  Not sure if that is true, but I decided to try something a little lighter than my usual Mexican dish.  Surprisingly they have a really good Greek Salad and pita bread!", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 3, "date": "2010-03-10", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "j8ocPEVty-EEYQk_Zeldyg", "review_id": "Pbpcqczp2KiOn0xqZaGAvA", "text": "Six of us stopped in here for lunch earlier this week.  Our service was actually quite good, maybe because we got there at about 11:30.  An hour later the place was jam packed.  They do have a take out counter if you're in a time crunch.\n\nThey had quite the variety on their menu, Greek, burgers...even grilled cheese!  My friends told me they'd disown me if I ordered grilled cheese at a Mexican restaurant, so I got the chicken fajita salad.  This salad was so big they had to carry it out on it's own platter.  The chicken was cooked perfectly and all the veggies were fresh.  The other folks at my table ordered some of the $6 specials of the day (tacos and burritos) and those looked really tasty as well.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 3, "date": "2010-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "nw4l-kfBDwQSjf-gEZII2w", "review_id": "ZVYMkasvKAxk9ZeQbFvjZA", "text": "As a tourist we stopped here before leaving the Phoenix area. It had great parking garage above the Restaurant and was told by someone that it would be validated. Turned out the Restaurant only validates half of if. Ugggh. \nWent in side, cool looking place. Fairly packed on a Sunday. Ordered our food with a nice waitress. We had chips, very watery salsa. Not very good. Our food came out fairly fast, and then the Mariachi started I really liked that. My lil niece enjoyed it as well. \nThe food was good and satisfying. But the did notice the menu is all over the place. Burgers, sandwiches, Mexican food. If I am in that area again, I would go back to try again.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 3, "date": "2010-03-17", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "YKKoHmx87j-vTzLhDtOfPw", "review_id": "6AP0VqZF_SlkZftyqn1mJg", "text": "My wife and I decided to give this place a try while in downtown for a show.  We sat at the bar, which was covered in dirty glasses and plates.  The bartender (Michael) seemed a bit occupied, but managed to clear some space.  \n\nWe asked for menus, but were never asked if we would like to order.  They had some chips and salsa in the bar, but neither was good.  After one drink each and some chips and lousy service we decided to try out luck elsewhere.  \n\nI am all for supporting locally owned places and like the location, but would never go back here again.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 1, "date": "2010-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "ltr-xWeLJYTOdc-xZNnQiw", "review_id": "KQINdalw2PBJ_hs_T6nD-A", "text": "This is an emotional review. We have gone on vacation to Sedona twice and both times we have come here for Mexican and a pitcher of margaritas before we drive from phoenix to Sedona. It is the start of a wonderful week. \n\nThe food has been a solid 3 stars both times but the pitchers of margaritas are cheap and pretty damn good. They have a decent patio. \n\nThis place makes me happy lol.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 4, "date": "2011-03-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "EP3cGJvYiuOwumerwADplg", "review_id": "ZL6U_iKvPa9nIlsZoMe-pQ", "text": "I would give this place 5 stars because I love the chorizo breakfast so much but the service here is not always 5 stars.  If I had one complaint that is what it would be since it is very hit or miss.  I have come to expect bad service and I somehow always come out very pleased (sorry if that sounds bad), but I love the chorizo at this place.  It may be the best I have ever had and it is consistently perfect.  I also love the atmosphere and location.  A perfect morning for me would start at sitting along the windows in front in a booth while eating chips, salsa, chorizo, & coffee? ha ha, yes I drink coffee with my chips and salsa at this place.  I cant help it, I am a fan of Matador and I am sticking to it.  The bar seems cool and I have never been here for dinner but I am sure it is gets busy since it is a very large place.  Also the hot sauce is very good here, it has a nice garlic flavor and spicy just like I love it.  I usually mix it with the regular salsa so my family can share.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 4, "date": "2011-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fIvDzLhs-cXbTKWp8P3eIA", "review_id": "JNjqs2Cf9B5uhUKLASZ3Bg", "text": "I am from Chicago where authentic Mexican restaurants are abundant. I would not consider what I ate yesterday at Matador Mexican food. \n\nThe waiter brought chips & salsa to the table. The salsa was a spicy red sauce that I would pour over pasta....I'm dead serious! The fish taco entree arrived quickly. There was a ton of fish which was nice, but it came with a side of shredded \"cheddar\" cheese, shredded cabbage and chopped tomato. The rice & beans that came with were no better. I think the rice was Rice-O-Roni and the beans had a think layer of burnt \"cheddar'\" cheese on top. WTF am I suppose to do with that?\n\nThis was my first meal in AZ. It has to get better than that.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 1, "date": "2011-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ajlsUu-QukZC8P4qD8iI2A", "review_id": "_pVH8nxjN1it-4zWn6z8aw", "text": "I was told this was the best place for Mexican food in the downtown PHX area, so I tried it without checking Yelp first. I would have to say it was just ok, the decor, the service and the food was not \"mexican\" as I know it. Maybe living in SoCal for a while has jaded me, but the tacos were bland, the rice terrible and the beans not flavorful. I should have taken notice when the chips and salsa were tasteless, but figured it was full of people, so THEY must know something. The prices were reasonable and overall I've had worse, but EXPECTED more from \"the best mexican food\" in downtown PHX.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 3, "date": "2011-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eUyFtxZPT-YeUAcI9kfXPw", "review_id": "nVnD40NQWmfFf3Dt6Cwymw", "text": "Reviews here had me worried. But I wanted to take friends to this Phoenix icon before the Symphony. Fantastic green corn tamale. Salsa good. Margarita pitcher a little strong, but tasty! I hadn't eaten here in 20 years since I used to work downtown. So close to all the action when you have a downtown event. Go if you haven't been.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 4, "date": "2011-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "WditeVOxm9LcK4COOWZ-qg", "review_id": "Lc_oIDmA0rjjVhHefoVS-A", "text": "I almost didn't go there for dinner because of these bad views and that would have been a big mistake!\nThe food was extraordinary (we had enchiladas, shrimp fajitas and my friend had the tamales).\nwe ordered a pitcher of margarita and it was VERY strong on the tequila.\nI'll definitely go back!", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 5, "date": "2011-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gg_OKjOAl_vVmdh5ZETuiw", "review_id": "pnrH_ZEiuhp8a1RpnvDRrw", "text": "Matador Restaurant was not great but the food was good.  I ordered the beef enchilada dinner.  Before my entree arrived I was given the standard chips & salsa.  Before I could get the bottom of the chip bowl my dinner was already on it's way over.  Service was prompt and fast.\n\nThe enchilada dinner left much to be desired for the price I paid (nearly $12).  It was no better than your local hole in the wall joint where the same meal will be much cheaper.\n\nThe restaurant itself was pleasantly odd.  It looks kind of like a Mexican themed diner with a bar attached at the other end.\n\nMatador is not a place I would go out of my way to visit and would not top my list of places to take friends and family but if you're already downtown and want to hang with friends and family go ahead and give Matador a shot.  Just expect to pay a bit more than your local place.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 3, "date": "2011-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-xXpVlDqJwFKJG1Au2_6zA", "review_id": "AR3kYfzkif7RZrpRp8QODA", "text": "Here for a conference (does anyone actually come to the city of phoenix for anything else?). I should have known not to set foot inside just how empty it was compared to the place next door. This place is honestly one of the most disorganized places I've eaten at. The waiters literally are running around, and just getting a seat in the empty restaurant was a process.  We received no less than 7 apologies throughout our dinner. I'm not sure why they kept apologizing as they weren't always doing anything wrong... they must just be used to people complaining or something. I got a salad and while it is pretty hard to mess up a salad, this was not very good. The meat (pulled pork) on the salad was gross, and the sour cream was hard and gross... the lettuce was standard iceberg cut up. My dining partner had the gyro and the meat was gross and he just ended up eating the fries. Also, although it looks like they did at one time, they no longer serve alcohol. That should be a sign to stay away. I feel bad for the waiters as this place obviously is in need of new management and a menu overhaul.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 2, "date": "2012-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 3}, "user_id": "MwJVSTsUB-htphNZaIC43g", "review_id": "bBc4-zI7tQsNIsspB-YJ6Q", "text": "My heart goes out to Grand Avenue. Come alive. Please, please come alive. There are such great little spots sprinkled throughout and I think Paisley Violin is my favorite. I've been there a couple times. Once at night while there was a band there, which was cool. I felt kinda bummed that time cause I had no idea they didn't serve alcohol, but I did find out that they were byob. The band was cool. Food is good. Tea is good.\n\nI went during the day recently and had a really good lunch and was able to have a really chill lunch meeting. Our waitor for lunch was super friendly, helpful, and had a good pulse on when to check in and when not to. \n\nThe best part was afterwards we walked out back and the woman I was meeting with asked if I knew about the small houses/cottages out back. Apparently, they are cottages from the Japanese Internment Camps in California. And they were some of the larger ones for families. The man who had invested in the project (I guess the owner of Paisley came up with the idea and pitched it to this guy) led us around and told us about the space and how they were going to be renting them to artists. Kind of cool, I thought...cause in some ways incredibly dark and reminiscent of something horrible...but at the same time...a way to kind of capture and convert that energy and remind people of the atrocities that have been committed when motivated solely by fear rather than logic and reason.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 5, "date": "2008-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 5}, "user_id": "-F32Vl8Rk4dwsmk0f2wRIw", "review_id": "LkVuEUFgjRtmrZAxmaGp0g", "text": "Shame on me for not acquiescing to the frequent requests by my gf to hit up one of the most alluring valley cafes.  The Paisley Violin is gills full of progressive and retro designs and a charmingly simplistic menu of favorites, including eggwiches, croissants, sandwiches, salads, and plates containing VERY fresh ingredients like organic vegetables, cheeses, cured meats, hummus, and a variety of sauces to name just a very minimal amount.  The prices are lower than what would be considered 'reasonable' and the service is quick and attentive but not overbearing.\n\nHowever, the REAL reason to visit The Paisley Violin is for the incredible ambiance, whether you sit inside in its darkened labyrinth of art, books, and counter snacks, or outside on its expansive, heavily shaded patio, complete with an artistic fountain and 6 tiny and freshly brightened bungalow houses in a pseudo shopping district right there in their back yard.  According to our server one house will contain a flower shop; one, a bookstore; and the another, a tobacco shop.  The other three are TBD.  It is a brilliant concept, which makes their back patio seem infused with organic commerce and street life, but without being invasive or 'busy'.  I absolutely cannot wait for these places to open, sipping a chai latte with a shot of espresso (my gf's signature drink called a 'dirty chai latte') and gazing at these magnificent store fronts, each painted in a wide palate.  \n\nOne other note: The Paisley Violin is no longer BYOB, as they are awaiting the lead-legs of the city to approve, get this, their LIQUOR LICENSE!  Fans of The Paisley Violin will appreciate that spirits will now be available -- although bringing your own vino to the back patio seemed like one hell of a bargain to rent their space for the evening.  \n\nI am eagerly awaiting when alcohol will be allowed back on the premises because this place will be the gem of downtown.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 5, "date": "2008-05-04", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "7izaZThzAWk2UjrDTL849w", "review_id": "_lHbPWYMAejzudp3hxoCyg", "text": "I've always had mixed feelings about the Paisley Violin--I really want to like it more.  There is a lot to like here:  decent beer selection, local art hosted all around, outside eating areas. \n\nI went last week for a friend's birthday shindig.  I had the chicken schwarma, which was ok.  And perhaps that is what is missing for me at Paisley, the food was just \"meh\" and the service was not outstanding either.  \n\nIt's on my list for trying out more often and perhaps I will be more impressed.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 3, "date": "2009-03-18", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "d2RAl63RTdfZF7kcuKcj-g", "review_id": "zyBsC19FOPWQ8M_RpT-KKw", "text": "Yummy, creative sandwiches!  Good prices.  Highly recommended.\n\nService is generally a bit of an issue, so if you are one of the prissy eaters who doesn't understand that serving can be tough, you'll probably get your panties in a wad.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2009-03-22", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "vggE8kitLHHhWeM7ZPdzpg", "review_id": "dZxpzoIWzPmkv2P_jmZmrw", "text": "If you ever overhear someone saying Grand Ave is dirty (as I have, probably from developers waiting in line with a bulldozer and starbucks contract) , this place is one of many to prove them wrong.\n\nThe food is good, great selection....lots of vegetarian options.  Good drinks, possibly best chai I have ever had.  the side potato salad is very tasty.  Not a huge fan of the egg-whiches.  the croissant is a little too hard.\n\nAtmosphere:   Nice patio;  little garden and a bunch of colorful artist bungalows.  sweeps in the zen like relaxation for a lazy sunday or friday lunch.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2009-03-23", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "N1Q6HiZvnZHjNU712Gymqw", "review_id": "X1GzWhS5vYSfJB1VjzCQwA", "text": "Admittedly, I did not eat here.  I did come for two nights during the Phx Fringe and loved every minute of it.  This is like a hybrid dive bar and artsy hangout, being from Detroit, I felt right at home.\n\nThe eclecticness of the crowd matches the atmosphere, I mean, it's called the Paisley Violin, it's going to have some pretension.  The best part about this place is the rear patio, which is like a step into another world, old brick patio with art all around you.  We were made comfortable by a very appreciative staff and drank for pretty cheap, Schlitz was only $2. \n\nThe P.V. seems to be an attempt to give all the artists on Grand a place to go, we took the light rail here and rode our bikes.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2009-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lITyv4Vxz21R9HU3dAz0Xw", "review_id": "Wvcu64NH8dbek8Lm_arKwQ", "text": "The Paisley Violin is very close to the State Capitol where I work and I only just discovered it. Considering you have to drive into downtown Phoenix to get any sort of decent food if you work in the Capitol complex, I'd call this quite a find. It's a little hard to find if you don't know what you're looking for, and though there is a small parking lot, you're better off trying to snag a spot on the street if you see one. \n\nWe went on a Friday for lunch, and though many of the tables filled up, the restaurant was still quiet, providing a great atmosphere for conversation. The service was a little slow and inattentive, but the bartender was also our waiter. The description of the sandwich I ordered said it came on a croissant, but it came out on bread instead. My friend had to send her entree back because they left off the tofu she'd requested be added to her salad. However, all the food tasted delicious. \n\nI'll definitely go here again, especially when I need something closer than downtown, but can't stand another enchilada from La Canasta Capitolio.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 3, "date": "2010-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B2-AC4_ewUVHI3BPdDkieg", "review_id": "5iMa3lrOswFVhDWubTLvcA", "text": "Really good. The staff is always friendly. I love the greek salad and any of their iced teas. They also have a beer & wine license, so it's a good place to go for 1st Friday.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2010-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7o7MF9B9lxcWupE8jiLOaQ", "review_id": "-Xf11cS9AmDzdph2qTl1bA", "text": "This place is pretty cool. It's a real chill atmosphere and there aren't an overwhelming amount of people there (which I like!).\n\nI showed up to meet some friends on a Friday night. The inside is great, there is a big horse, a small stage, and a bar maned by a fun staff. The decor isn't fancy, but it has character. A band was setting up getting ready to play. I would have loved to hear them, but my friends were outside so I headed there.\n\nOutside there is a big patio. It was a little chilly, so there was a fire goin' in the firepit. There was also a musician outside, so I wasn't missing out on entertainment. She was playing calm, folk acoustic, making the mood of the night even better.\n\nThe group of 7 that I was with were able to sit comfortably, there was plenty of room. We enjoyed good conversation over the music and weren't bothered by wanna-be types trying to be cool. All of the customers and staff there seemed very down to earth.\n\nGreat atmosphere, decent prices, and cool people.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2010-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "KXoRjWfTxPT6LFkOdK6ovQ", "review_id": "1EVKiZ4po0h5dvGHVgjxsA", "text": "I'm not sure what everybody raves about. The place, in itself, is very cool. You park around back and they have little artist's huts and the inside it cozy and would be a great place to maybe hangout and have a few drinks. I ordered the chicken shawarma wrap and maybe I ordered something on their best that wasn't their \"best\" dish, but unfortunately I won't be going back to find out. \n\nI took it to go, which may have been my first problem. I paid just under $9 for the wrap (asked for without onions) and opted this time for chips. When I got back to the office and opened it up the wrap was in paper and you could see mainly pits and not much stuff inside, but I figure maybe all the good stuff is piled right out of site. After ripping off almost a 1/3 of the pita, I finally get to the good stuff....and my first bite. Ick! onions!!! I had asked for no onions and now my first bite I was chomping on them. Put the pita down, scraped out the onions that weren't hidden, and tried again. The tahini sauce poured of of the back on the wrapped paper and as it hit my plate I then noticed how oily it was....the sauce actually separated in front of my eyes. Ick #2!! \n\nWhen all is said and done, yes, I'm full. The chicken was ok, a little dry, but edible. Was it good? Yea ok, it was good....was it $9 good? Definitely not. And sadly to say I won't be returning for lunch to try anything else on their menu that may have peaked my interest before.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 2, "date": "2010-05-13", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "WJkmgkrSPMHTfDTD3VgqqA", "review_id": "sY4biKlAfHpinmRha79QSQ", "text": "The giant horse scared me! I thought it was a real stuffed horse at first glance.\n\nOn a nice summer night, we weren't able to get a seat outside because there was a graduation party going on. Instead we sat inside and listened to the Michael Buble-ish croonster and his homeless sidekick. I'm not sure if he was homeless but he was rocking on the bass guitar and would add in his \"oh yeahs\" and \"uh huhs\" during an intense jam session. It was creepy and cute.\n\nMy friend bought the table a round of marachino cherries that are laced with vodka and cinnamon rum. It was interesting but way too strong for my tastes.\n\nI started with an Oak Creek Hefe which was warm so the server brought me frosty mug but that didn't help either. I ordered the Spicy Cajun Sausage appetizer and it was nothing more than a bowl of sliced sausage links floating in a cold hot sauce. It was disgusting. I had to ask the server if the appetizer was meant to be cold. I'm just not a fan of cold sausage. The best part of my meal was the sourdough bread- and it was damn good because I was starving!\n\nOh yeah- the bathroom was pretty scary. I liked the mops and brooms in there too, really made me feel like I was peeing inside a janitor's closet. Oh wait-- maybe it was!", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 2, "date": "2010-05-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4oJs6wh-74yl6Q8-Gx7yIw", "review_id": "u-W03HSpxdzEfz-dmHzPrQ", "text": "Love the Paisley - it's awesome for breakfast, lunch, dinner, or for graduation parties.  Although I think that may have impacted Tuyen's experience at Paisley.  :) The grad party was awesome -thanks Paisley!", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 5, "date": "2010-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "qa05pUVNapADHZXpHMPMeA", "review_id": "JW2e-XYY0vZRnxJbEo5rUQ", "text": "We freaking love Paisley Violin. Now, my five stars does not mean it is perfect, it has flaws that I will mention, but I do not believe your Phoenix experience is complete without a Friday or Saturday night visit to this lovely establishment. \nThe first time we walked in it felt like Cheers, everyone said hello, the musicians, the bartenders, the bar patrons, as if we were old friends returning from a long trip. Now look, it isn't pretty inside, it's divey, a weird fish tank and ventriloquist doll are kind of strangely displayed, but look past that and see this place for what it is, a local joint with real honest to goodness people serving you. Good drink, great food, great music, great atmosphere, great service.\nThe toasted pesto brie was delicious, the brie was not overpowering, and it complimented the pesto just right. Their vegetable stew was very good with huge chunks of vegetables and a hearty sauce, the peppered raspberry turkey is magic in your mouth, the royal is a wonderful sandwich with roast beef, mozzarella and garlic pepper and the venice violin, with soppressata, pepperoncini, balsamic vinegar and dijon mustard on a baguette is practically inspired. The desserts are good too, but not all house made, we destroyed the baklava, it's highly recommended.\nNow the bad, aside from the place being divey, which isn't bad to me but I know it is to some, is that the parking is kind of a nightmare. Last I went I had to park in front of a very ghetto looking house with a guy cleaning his shotgun on the porch. Paisley Violin is not in a \"nice\" part of town, and with only a couple actual parking spots, you will be parking in a strange neighborhood in front of a stranger's house... sorry. But it's worth it, check with the Paisley Violin website and go on a night they have entertainment. \nCheck this place out with a good friend and an open mind, we love it.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 5, "date": "2011-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l53FUDHRHLg7BQ89KgAtxQ", "review_id": "AyEZPm41Y2r0h_sUhMXrpA", "text": "My friend said this was to \"fast food\" like for a date.  It's the first time I thought of it as fast food.  Yes, the food came fast, and you order at the counter, but I've just always thought of it as more \"healthy food fast\" but that's not quite a general category is it?\n\nI love to grab Zoe's.  Coincidentally, I like Feta, because as Lali mentioned, you have to like Feta to like Zoe's.  By brother was initially hesitant, but found himself craving Zoe's, and Feta after our last visit so I say to give it a try and don't be afraid.\n\nThe menu is SO simple it can be a bit shocking.  Salad, pita, kabobs, grilled chicken plate.  Pretty much any combo of chicken w/ veggies - even in their soup.  I really appreciate that they have a kids menu that isn't filled with things like french fries and chicken fingers.  They may give in to PB&J, but the rest of it will be just as healthy as what the adults are eating.  \n\nLast but not least - I love the modern/simple decor.  The \"kids\" paintings scattered around the place are pretty cool too!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2007-03-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "sEWeeq41k4ohBz4jS_iGRw", "review_id": "VjOACE8c0dhs7fBuniWjnA", "text": "Zoe's is fine, clean and simple with just enough trendiness to make you feel better about yourself for coming here than a fast food restaurant.   Our food was plain and simple, chicken kabobs and a quesadilla.   I guess we should have tried the lime ade and the cake, maybe next time, and then I'll give then another star.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2008-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "XBHJCDzNh--mBhJkzyM_iA", "review_id": "RFwIn3AVV0Ya9lx1U1_bwA", "text": "A couple people told me that I would not like this place, but I did!  I liked it a lot actually.  I was smitten by the decor- super modern and clean and done right.  You know when people make their spaces look so modern it ends up just looking cheap... this place is not it.  The front door was a bit scary, if you don't watch your kids or immature friend or family members closely, it is possible that they could sever their body in half vertically.\n\nAnyhow, I had the chicken roll ups, they were good.  The food is like food you can fix at home if you put some effort in it ( this means more than using the microwave or picking up take out and putting it on a plate).  The pita chips were very tasty too.  We got some of those.  The salads look big and green and healthy- the way a salad should look.\n\nI plan to go back and I plan to get something different to try.  Neat concept, this Zoes.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2008-03-25", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "GubdNFoDAsiwE6bWIr97cQ", "review_id": "LOvh2C4NAuRPZLb3Vq_X6g", "text": "I have had food form this restaurant a few times over an extended period of time. I have never eaten at Zoe's it was always take out and I did not do the picking up of the food. So no comment on the structure or service.\nIt is not horrible, but also not quite good either. Very uninspired in all foods I have tasted. Sorta like eating dry white bread. We ordered as a group each time I ate, so I just figured it won't kill me so why not. Really a lousy reason to spend too much money for bland, but there you go.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 2, "date": "2008-04-08", "type": "review"}
{"votes": {"funny": 7, "useful": 3, "cool": 3}, "user_id": "BrJcbK_lH0irQcNSNBEQHQ", "review_id": "dXmgGJTDhC0AbCPNXfi7EQ", "text": "The food is simple, pure and uncomplicated; you taste (and hopefully enjoy) each ingredient. However, as with most minimally processed cooked foods, it does not travel well.  So, eat in. Luckily the decor is modern and compliments the menu well which makes eating in a pleasure.   \n\nMy only down note is on the service. If you are not careful when you enter the restaurant, you may enter through the door of invisibility and will become invisible to the employees. As a result, you may stand at the counter while they work around you but do not recognize your presence until the invisibility dust (or whatever makes you invisible) wears off.  Based upon my late lunch experience today, the dust takes 4 iPhone e-mail responses or texts to be removed (10ish minutes). Regrettably, I only had three unanswered e-mails in my inbox and had to leave before I could be seen by the employees. On a positive note, when you leave (regardless of the time you waited), the invisibility dust seems to be removed. I know this as no one honked or screamed at my car as it drove away without a driver.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 1, "date": "2008-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "taIivSuNH63GXk6Nw9rZdA", "review_id": "saKoyRAg1kPj7nWpazqBow", "text": "We have a tradition of getting carryout on Saturday night, usually sandwiches or something fairly light  So we have a rotation that includes Pei Wei, China Chili, Whataburger, My Florist, Quizno's, sometimes delivery from Z Pizza.  Within that context Zoe's is a win.  The chicken salad and tuna salad sandwiches are tasty and of generous size.  My wife likes the marinated slaw, I prefer the potato salad.  Parking is never a problem, orders that are phoned in are ready when promised.   Note that although the menu has sandwich plus side plus chips for a price, you can ask for just the sandwich and they will sell it to you for a cheaper unpublished price.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2008-04-11", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "1AxALwNKdLZm5QeFxeC_kg", "review_id": "IiOJCxexw9IubE3fypxa8g", "text": "A waste of time and a waste of money..I will likely never go back even if it is free.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 1, "date": "2008-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vggE8kitLHHhWeM7ZPdzpg", "review_id": "T2dWh2M2yL5YIPie12g7lQ", "text": "As a new yelper, I feel the need to span the star spectrum, but I really had a hard time trying to think of a 1.  Then I remembered a little voyage I took last fall, coupon in hand, to Zoe's, which is right between my apartment and work.  The coupon gave me pretty much any menu item with a drink purchase.  Thank God I had that coupon, becuase I would have been pissed if I had actually payed $7.50 for a \"spinach quesadilla\" which was cream cheese and cooked spinach between two tortillas.  I could have made it better for $.45 at home.  \nThen I actually went back again to give it a second chance (I had a lot of coupons) and ate a very boring sandwich with cafeteria stlye mashed potatoes.   Maybe this place would be better for non vegetarians....my coworker liked his Greek Chicken plate, (liked, not loved)....it may go up to 2 or 3 stars for carnivores.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 1, "date": "2009-03-25", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "d2RAl63RTdfZF7kcuKcj-g", "review_id": "XrslFFkfnkGEvlJPww9otQ", "text": "This place is great if you hate things that get all assertive with your taste buds!\n\nI really have no idea how they managed to make their food so bland.  Maybe if they spent some money on a recipe book instead of a graphic design campaign, they'd do a little better.\n\nThe fact that it won something from the New Times proves how corrupt that process is.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 1, "date": "2009-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PVIJ0S6sVxGYstpyWAUciw", "review_id": "8P8foDocyv_SrcrE4Ggijw", "text": "I always order the Mediterranean Tuna here. It's good, but nothing else on the menu appeals to me. I go back for a really, really, quick before theater dinner.\n\nI agree with the other reviewers' description of the place.\n\nNo one has mentioned the iced tea - I really do like the fresh iced teas.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2009-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HFIuj45MwNx-cJkTamazSQ", "review_id": "m1ACBu8dcs1hqxHrtMqmjw", "text": "I like zoes. It could be that my lunch options are limited during the work day. But regardless I like going here when I am craving healthy food. \nI usually get the greek salad -hold the chicken ! and it is good. \nI have also tried the grilled cheese adding tomatoe and onion to it and it tastes good as well. Also the grilled feta sandwhich is also a favorite. The feta can be a little much so I do take some of it out, but other than that I love it. The rice pilaf is lovely as well. I don't like that to substitue the greek salad as a side they charge you $3.00 extra dollars !! Outrageous. Also, on many times I have ordered the salad to go, have gotten back to work and realized they forgot to include dressing. Super annoying. But the manager gave me a free meal for the inconvenience. Overall. I like the place for a lunch option.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2009-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TDOQfr0rTk4AgautHlfKpw", "review_id": "BeVuvFyIpQgkFmVqQ-gkmQ", "text": "I eat at Zoe's often because it's a convenient place to grab lunch quickly in between teaching and afternoon meetings. I would go there just for the limeade--best thing ever! I usually get the grilled cheese sandwich with a tomato on rye and coleslaw, but the quesadillas are good, too. Overall, a great place to grab lunch on the go.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2010-03-16", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "KI4sBf9jWLs4aGm_mIsFQA", "review_id": "Rn2J0bF9P30OMgiR-k5dIQ", "text": "Whoops, I thought this location just opened up...but I guess I just never went down McDowell for anything. \n\nAnyway, I fall into the category of people who think the food induces yawning. I had the Greek Pita and there was nothing Greek about it. My chicken, though, was NOT dry at all...quite tasty by itself in fact. See, its not that the food here doesn't taste good, its just that its nothing special...a sandwich packed in your lunchbox is just as good as what I had here. This wrap tasted like the thousands of others I've had. (that's right, thousands) \n\nI didn't read reviews before I went, and I did it on purpose. Its right down the street, they serve sandwiches, so I had decided that this is a place that I will find something to like about. Another place to add to my wall-of-menus. But...I will visit 2 more times for a total of 3. 3 strikes and you're out is fair, right? \n\nOn the plus side, even though the food was boring, it was still fresh. And if you scratch the dressing, it'll be healthy. But likewise if you scratch the dressing....you might fall asleep while eating.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 2, "date": "2010-04-09", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "RxfFQxUtSIGYwTKU_rvAeg", "review_id": "kYgTFrdi8606v7VKYP8l_Q", "text": "I haven't been to Zoe's for probably a year but I always love it when I come! As I typically do, I recently had the grilled chicken plate which is grilled chicken with sauteed onions, and your choice of a side (I chose their rice-yummy) and their greek salad. The salad is always huge so I usually save it for its own meal later. Their salad comes with their signature vinaigrette which is soooooo good. We also got a pre-packaged side of their red potato salad which is good, itself, but I like to put the dressing on it, too. My husband got the tuna pita and thought it was awesome. My brother went for the mediterranean pita and raved about it, too. The food is fresh and you feel you are eating healthy. The prices are average for most places, nowadays and I think the grilled chicken plate at approx $7 is a pretty good deal when you can make two meals out of it. Oh yeah, their fountain lemonade was out when I went but my husband recommended I try their freshly squeezed limeade behind the counter. I am a huge fan of limes and this was absolutely delicious. Not too tart or too sweet, just perfect. Love, love, love Zoes.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 5, "date": "2010-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kq5Pdsy8Znyh9KEkxWT_QA", "review_id": "oeMcjw-YhjN7ziia1SsnnQ", "text": "When Zoe's kitchen was featured on Groupon, I decided to buy one and check the place out. I had the tuna sandwich (with red onions) and the potato salad. My boyfriend had the chicken marinara plate, but I can't remember the side that he had. The price was really good- $20 for two meals, and I really loved the \"at-home\" feel they create. The bread my sandwich was served on could have been the same that I have sitting in my pantry at home, and it looked like all of the ingredients were fresh from home. Fortunately for me, the food didn't taste as though I had prepared it - it was FAR better!! I'm excited to go back to Zoe's to experience more of the menu.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2010-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m-KukDHoMGdkmE74hUsc4g", "review_id": "HcoZ4holAl0nJQEz-Mj3xw", "text": "I'm going to keep this review very short and sweet because until yesterday, I never really felt compelled to yell from the rooftops about Zoe's meals. Especially for my fellow vegetarians.\n\nBut the tides have changed, my friends. Yesterday, because they are close to work and I was starving, I decided to hit up Zoes for the only thing I ever really eat there - the Grilled Pimento cheese on rye which I highly recommend! Sometimes the cheese doesnt melt right and its lumpy but the flavor is divine. No boring grill cheese there. The rye adds a lovely added dimension of grilled-cheesiness.\n\nNow for the new, sexier menu, there are a few more veg options. \n\nI had the hummus and salad plate and I was so surprised at the awesome flavor. The hummus was as good as my homemade hummus and the salad is very well done with real lettuce (no nutritionless iceburg here) and fresh veggies and of course, the requisite Zoe's feta cheese. The cucumber Raita was just the right touch. \n\nSoooooo tasty!\n\nNow I'm not a fan of any of their sides, till now. The Braised white beans are a dream. I dont know what spices they used (ginger maybe?) but I couldnt believe my tastebuds. So proud of Zoe's.\n\nTwo notable changes:\n\n1)There is now a separate charge to grill the Pimento cheese sandwich (10 cents - really????) in addition to the 22 cent price hike.\n\n2) Chips no longer come with the sandwiches but are an extra 65 cents. (cheaper than the vending machine at work still)\n\nEither way, I'm compelled now to patronize this little spot more often. Next time I'm trying the new spinach wraps...mmmm", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2011-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kMiQnYFmAYbjHyyIPGSwoA", "review_id": "pxajGDrIePM7AljfiKZIng", "text": "Zoe's Kitchen is good, but that's all I can say about it. I would happily go back for another meal, but it is never my first choice. The food is tasty, but nothing extraordinary. I don't want my review to sound negative - because I've never had a bad experience at Zoe's; it just isn't worth more than 3 stars.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2011-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IIDHcYJX9JlfE2Q5DrFKXg", "review_id": "SxvRY_jXWUKyKtGpzMlCzQ", "text": "Stumbled across Zoes on our way out of town, we're touring musicians so fresh, fast, inexpensive food is super important to us on the road. We got excited as soon as we walked in the door. You could smell the freshness!\n\nWe had a hard time deciding, but I had the spinach wrap with chicken and Greg had the turkey reuben. Both were fabulous, and the fresh slaw with feta side was fantastic as well. We so wish we had a place like this at home!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 5, "date": "2011-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kMiQnYFmAYbjHyyIPGSwoA", "review_id": "qv0MQ7UIdjBOLRBVzKgjjA", "text": "You know what? I was way too harsh on Zoe's in my previous review. I've caught myself eating at Zoe's much more often these days, and I can always count on a delicious meal. That deserves more than three stars. \n\nI especially like the \"Grüben\" with potato salad. Yum!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2011-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "E5qFR0RBQBoXx8FbrOkdbw", "review_id": "HBbEloHlRZxJcXXrwiPZNw", "text": "Everyone I work with loves this place, but I find it a little pricy for what you get.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2013-03-01", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "Ry48Bta6spNowOkiMNC_xg", "review_id": "UybrX_o8-KdR5yXALetRHA", "text": "I had no clue I've the sophistication of an earthworm when it comes to food until I read other Zoes Kitchen reviews.  For our information, looking at the Zoe's Kitchen web page, I found out they are a national chain.  Call-in/Take-out and catering are  big parts of the business model.   The fine points of excellence are up to the franchisee.  \n\nIt looks like people having the worst experiences come in for lunch.  We tried Zoes for an evening meal.  Nicely styled with an attractive glass wall on the north facing McDowell Street.  Outdoor dining.  \n\nWe got a chicken kabob and a hummus and salad plate.  Both came with a haystack of mixed green salad with onion, Greek olives and feta.  That's fine with me.  The health survey my insurance company bribed me to fill out determined I don't eat enough greens and fruits.  Score one for Zoe's there. Each table had a bottle of Greek dressing so salads are seasoned to taste.  Mine also came with a tiny tub of Tzatziki.\n\nThe chicken kabob was good.  Chicken, green pepper, onion, cherry tomato.  I found out I like cherry tomatoes much more when they're grilled.  Apparently my family has a gene for fresh tomato aversion.  The grilled cherry T's were very good, the chicken not overcooked, and the rest of the veggies very good.  \n\nThe amount of hummus, about 3/4 cup, was decent, the pita was served as small wedges.  The taste was hummus and pita.  Not Great, not Terrible.  \n\nOur beverages were endless ice tea.  \n\nThe bit of the meal that was unprofessional in the food service industry was a salad core in Sweet D's greens pile.  The price of our meal was $21.00.   I'm thinking the goal of this Mediterranean fast food franchise is a meal for $10.  We'll go back.  After we try more of the eateries at 7th Ave and McDowell.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2013-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Rzy3ALarkc6Q_QmykVIvcg", "review_id": "YdXx6dBw3GF_e1gYKA0rEg", "text": "My 11 year old daughter and I tried Zoes Kitchen for dinner tonight and while expecting an ok cafe and hoping for a quick, decent meal, were pleasantly surprised by the quality and taste of the food. I had the steak roll-ups entree and the rolls were delish! There was tons of flavor in the meat and veggies, the dip was great, and I loved the pasta salad side. My daughter had the chicken roll-ups kids meal and loved it. She tried one of my rolls as well and loved the steak roll-up dip...and ended up taking the rest of the cup of dip home because she loved it so much. \n\nI will say the portions were satisfying for us, being smaller girls, but I can imagine that any male I know or someone with a big appetite might be disappointed in just getting one entree so the price point might be high if someone has to compensate for the small portions with extra sides or dishes. \n\nWe will definitely be back and I want to try the hummus next time along with some other dishes that looked tasty.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2013-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1lSFhUewKa22FwhXuVgFdw", "review_id": "hTcY5jIBEu5Eivk3C_JnHQ", "text": "I used to not go here anymore because the service was so slow. Decided to give it a shot again a few months ago...and the service still makes for 3 and not a 4 star review. I usually stick to the Greek chicken pita which I've had 3-4 times and it's kind of a hit in miss in terms of how good the chicken is cooked. Sometimes absolutely delicious and other times a little dry. A friend suggested I ask for hummus inside the pita (strange I know) but that really does the trick in terms of having a \"good\" pita there and if only they could improve their service speed so you don't have to wait 20 minutes each time they would get a 4. I almost gave them 4 this time around because a manager approached us as we were having dinner and of course noticed that we had to get up twice to ask if our order was almost ready. She was nice enough to comp our meal and gave us a gift card, but I don't want that kind act to compromise my review of Zoe's. So 3 stars it is.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2014-03-13", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "K9v863MHTXV1DutQOUjWpg", "review_id": "_rSo3Q-tF6TuKOQfG3qsKw", "text": "I needed a place to cater an event for my work and upon my search for \"boxed lunches  that deliver,\" I found Zoes. I didn't want to give folks a typical sandwich boxed lunch and needed something that would appease carnivores, gluten free folks and vegans alike and I feel like Zoes Kitchen was perfect. Working with their sales manager Marissa made the whole process super easy. Their boxed lunches were great! I went with chicken kabobs, veggie kabobs and chicken green salads and was so impressed with the presentation. Delivery and set up was great! The delivery girls did have a spill and 2 veggie kabobs didnt make it but I appreciated that they were honest about it and I was refunded. Zoes had no problem in individually packaging all 110 of my orders. They even brought along some nifty coolers with ice for drinks and all of the necessary paperware/plasticware. They accommodated to my party's needs (chicken and pita bread on sides for vegetarians/gluten free folks). I had the chicken kabob lunch and it was so good! The chicken was flavorful, the salad was refreshing. I was also very happy that I decided to order some of their cookies because they were such a big hit! Everyone at the event raved about the food, so I definitely know who to call the next time I have an event in Phoenix.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 5, "date": "2014-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7E-2TvuQnFj2DLYc4rGg3w", "review_id": "hVf7BZW08pDwMt_TRd3deA", "text": "I love Zoe's.  The food is always good and the service is always pleasant.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2014-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GVH_iuoPc0aP3ZNYlWuKag", "review_id": "lYkdBsA9auxIdGvMHVGIAA", "text": "I live very close by to this Zoe's and go here a lot.  A LOT.  Like, embarrasingly a lot.  And it's always for lunch, and I always order to-go, and I always order the same exact thing, the same exact way:  Greek salad, no olives, no potato salad, extra red onions.  I used to have a problem where I'd get home and find chicken added to it (a no-no for a vegetarian like me), but I haven't had that issue in about a year.  Nonetheless, I check it while I'm still there every time to make sure.  The salad is big and tasty (especially without those nasty olives or unnecessary potato salad glob at the bottom), and I feel like it's pretty healthy and low calorie.  The service is nice and pretty efficient, even during weekday lunch rush when it's a real challenge to find parking and maneuver around the lot without getting hit.  They don't even embarrass me about coming so often and ordering the same exact thing, haha.  The one thing I can say as a critique- they could be a bit more consistent on their salads.  Sometimes there is a ton of something, like lettuce or feta, and other times it's challenging to find it at all.  This place is solid.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2014-05-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4D4UzEOu-QG4-jkyfynhPQ", "review_id": "UjHclHs6DUJnSBR-cR88HQ", "text": "I felt bad tonight because we were in a total hurry but we stopped in to grab a bite\nWe hadn't been to Zoe's Kitchen so we weren't really sure what to expect\nAfter looking at the menu\nI decided on the Zoe's Club Pita with potato salad as my side\nI like how they have the Coke Free machines :)\nIt wasn't extremely busy but our food took almost 30 minutes and we were in such a hurry that we almost got a refund\nJust because we had something due within the next hour\nThe lady in charge of distributing the orders was very nice and let us know that our food was ready\nShe even offered a chocolate cake\nThank you!\nI felt so bad because I am one of the most patient people and I understand the restaurant business and time\nNext time we know about the online ordering and even the mobile app ordering\n\nI got home and was very excited to eat my dinner and it was very tasty\nThe pita had a great amount of grilled chicken & ham\nThe potato salad was yummy as well\n\nAll in all, Zoe's kitchen is good in my book and the only head's up I would give to anyone is that this is a lovely sit down restaurant, very healthy and modern. The decor is very hip and modern and I really like the doors. It fits in well on the 7th Ave/Mcdowell strip \n\nWe will be back and hopefully next time we won't have to rush :)", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2014-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "CBeykieWzLwJs0VLliRmqA", "review_id": "lqCYnoX_IEsvRt7wiQTvXA", "text": "This is easily the most disorganized, dirty Zoe's I've ever been in. All of the employees seems sweaty and unkempt. The restaurant is always dirty, tables not wiped down and it isn't uncommon to see flies all over the place.\n\nIn terms of the food, the salmon kabobs are ok but the white beans are usually runny. Every time I've gotten white beans, I had to ask it it were beans or soup.\n\nI like the Zoes franchise and have been to locations all across the country and have never seen a location like this. Take into account the parking is absolutely horrendous and the trip to this Zoes simply isn't worth it.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 2, "date": "2015-04-07", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "mvNxfRNBSY-lJzOpsr8-tQ", "review_id": "46soTwZcspy0_gz8ogmZaw", "text": "I am being kind with the 2 star rating. This places only saving grace is the marinade they smother everything in.\n\nThe steak kebab's had the chewiest meat I have ever encountered at a Mediterranean eatery.\n\nThe vegetables did not taste or look fresh and were slathered with way too much marinade. \n\nThe so called seasonal fruit was a joke. Almost $3.00 for a few cut up pieces of sub par fruit.\n\nToo much money for what was a terrible terrible terrible meal.\n\nSkip this place and hitup one of the other 30 eateries in a 1 block radius.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 2, "date": "2015-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wbV5mCjQ5w-O95TcV2JwdA", "review_id": "bn90XxYkSlySSICvQyAaSA", "text": "What do I eat a Greek salad for? Feta and olives, and my salad only had three little olives and surprisingly not much feta. However there was a lot of onions. I feel like a salad is a medley and this one had a strong one noted of onion. \nMy husband ordered the chicken salad sandwich. He said it was just all right. Nothing special, nothing bad. Bread was the best part.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2015-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iYoS9-XGyL9hSDskealglw", "review_id": "Xt5RICFGgVLKhe-M9qSWVQ", "text": "Cheap and fast -express !! - delicious hummus and taromasalata , the burgers weren't bad ,  a convenient location for where I was working - myself and colleagues had around fifteen meals here in the space of a week , - nothing wrong with any of them.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 5, "date": "2007-03-01", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 3}, "user_id": "0bNXP9quoJEgyVZu9ipGgQ", "review_id": "305Jk9urHcBahzJh92SDWw", "text": "While waiting for my car to be repaired at The Auto Shop (we had an hour to spare), I thought I'd treat Mom and myself to a proper breakfast at Matt's Big Breakfast (I've only had lunch there once), but after seeing the long line of people waiting to get in, I decided we'd try lunch at AE, instead- it came with glowing recommendations from TAS's manager (this resto is just across the road from the shop, which is very convenient for the employees here).  \n\nBare accommodations- cafeteria-style tables and chairs, TVs, window counter seating.  Help-yourself complimentary coffee and tea counter, with shakers of Splenda available to those inclined to use them- nice touches!  Their breakfast menu sounded very tempting, but the man behind the counter told me that the delivery guy with the eggs wouldn't be in for another 10 minutes or so (Feta omelette, anyone?).  I decided we'd try the Friday fish special of grilled tilapia over salad and a gyro pita with a side salad, extra feta.  I did not enjoy eating the tilapia as it would magically crumble into tiny pieces the moment I cut it with a fork or a knife.  Very annoying!  Besides this, the whole dish tasted very bland since I opted to forgo the housemade vinaigrette (contained allergens); Thankfully, the extra feta (LOVE feta!) salvaged the dish and I was able to down the fish even without the use of a spoon, of which I was constantly wishing would be on hand.  The gyro pita was a much tastier experience, although Mom did not like the meat.  Truth be told, this could not compare with the meat in the gyro dinner I just had a few nights before at MBFGR, but for the price (around $6), it made for a quick and satisfying lunch (and the extra feta in the pita didn't hurt, either)!  While the gyro is not made in-house, AE does have it shipped in three times a week from Chicago, so I was told by the man behind the counter.\n\nBaklava looked awesome, but I couldn't try it since it contained an allergen, but no worries since any item offered here would be fulfiiling enough!", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 3, "date": "2009-04-07", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "P1qwZrslRv9KS9vPJNXe4g", "review_id": "_TBkPAAtW_F8RhnnMHMBhA", "text": "I'll give you 3 Athenian, especially since I found you while heading up Central today hungry and totally confused.\n\nI'm impressed with the cheap prices, the \"Chicago retired cop\" ownership and the attention to cleanliness with the establishment.\n\nThe lamb was cooked absolutely perfectly and the produce was impressively fresh however the Tzakiki  (spell check anyone?) sauce was rather absent and the amount of feta cheese dumped on top was rather absurd, making a very rich gyro experience altogether. \n\nI'd go back, but being that it's so far from home I wouldn't make an un needed trip to dine here.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 3, "date": "2009-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JgDkCER12uiv4lbpmkZ9VA", "review_id": "JuVcdrhmV9_tJdqV-7blgQ", "text": "100% completely underwhelming. I didn't want to rate it 2 (Meh. I've experienced better) but I even more so didn't want to rate it 3 (A-OK.) I don't consider this place to be A-OK, more like completely average.\n\nThe atmosphere is much larger than I thought it would be and is all counter order. They get packed for lunch and have lots of Chicago shit on the walls. It's a good enough place.\n\nMy Gyro Feta came with stale pita bread, too many giant slices of red onions that overwhelmed everything, and pretty much just seemed like something I'd find in my cafeteria at work. The quality was crap and it was $6.45. I could go to Cyprus Pita Grill and get a really good gyros for the same money.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 2, "date": "2010-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nIzKqL9MzOZwoZZUdaJn3w", "review_id": "X6XH-9QdskeDZRu3dVsVaA", "text": "So I ventured here while I was downtown for jury duty. To celebrate a mistrial, I decided to treat myself to a gyro.  Athenian Express is not in the middle of the \"hustle and bustle\" of downtown (although \"hustle and bustle\" doesn't really apply to anywhere in metro Phoenix), so it was kind of a schlep getting to. But oh was it worth it.\n\nThe menu is all over the place, with handwritten modifications actually printed on the big board above the register, but it's your standard Greek lunch fare-- i.e. gyros, sandwiches, salads. I got the feta gyro. It came with traditional shaved gyro meat, tomato, red onion and feta on a warm pita bread. And holy feta was it good! Be prepared for the feta because there was an s-ton of it, along with perhaps too many red onions but they're easy to pick off. Along with the homemade tzatziki sauce that I got to put on myself (a plus), it was a great lunch. \n\nI didn't want to give it too many stars because 1. my side of potato salad was room temperature and scary and 2. to be fair, I have to try more than one menu item. Next time, i'll go for the falafel. And, mark my words, there will be a next time!", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2010-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "tL_QF_iIGoaPd-otIGa22A", "review_id": "VB5tLn1tegimo9JnFZXdAQ", "text": "I LOVE Athenian Express!  My mom works downtown, and whenever I have a chance I go to meet her for lunch, it is definately my #1 pick!  She gets the steak or chicken picado and I always get the veggi pita.  I crave this place.  I wish there were more locations!", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 5, "date": "2011-03-03", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "sGZpZoEKwQVNPRhG3OjudQ", "review_id": "4TFtHu9ufrPXMy4cPlHZoQ", "text": "Been working downtown for 5 years and went to this place for the first time today.  My wife had the gyro feta salad and I the gyroa feta pita sub.  Both were good, really nice gyro meat.  The only thing I didn't like about my gyro was that the tomatoes and onions weren't cut up enough, and kept falling out of the pita, but otherwise the taste was right on for a gyro.\n\nIts a good lunch joint, but kind of hard to get to because its right next to the light rail.  The price is good too.  Will definitely go back as it looks like they have a good selection of greek and Chicago style items.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2011-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IUWjTmXc3wLVaMHz33inaA", "review_id": "pinART3gZIUSjmDkZjPTqg", "text": "My husband and I ate here after I purchased a Groupon. We both really enjoy Greek food, so we were excited to try this place out for lunch.  While the food was not bad, I definitely will not return.\n\nI ordered the falafel pita.  I thought the falafel was very dry, and there really wasn't enough tahini to help out the situation.  The portions were huge, so if you like that sort of thing, then this place is for you.  However, I am not a big eater, and leftovers tend to go bad in my fridge, so I was not particularly impressed with the portions.  \n\nMy husband ordered the chicken parmesan sandwich.  Basically they took a chicken breast and threw marinara sauce and a little cheese on it and served it up.  The chicken did not have too much flavor, did not seem like it had been marinated or cooked in any interesting way.  Really, it was just a ton of mediocre food for not too much money.\n\nThis place wasn't bad, but it also wasn't good.  Come here if you like enormous portions of alright food for not too much money.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 2, "date": "2011-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Km0MQav49WBjFQlifoylcQ", "review_id": "alE8Yhw08so0cC9LF-nltw", "text": "The food here is not very consistent...and I love greek food and lived in Greece for one summer , so Iove greek food! I ordered the Feta Gyro with fries--really good the first time, so-so the next lunch trip.  The tzaki was a highlight.   My friend got the vegetarian pita and fresh fruit--she loved it and the fruit was fresh and the serving really good for a side.  We got there a bit before noon and had no problem ordering, but it got pretty busy around the lunch hour!  FYI parking can be a bit confusing, but it's in back!", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 3, "date": "2011-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "AvzoWeiZ1yMZKlYU8jB2PA", "review_id": "zAd06RwHuug8oyBcB7oLeg", "text": "I love this place. I'm so glad I finally stopped in. Huge seating area. Great prices. Huge portions. I got a gyro with feta and it was darn good. Was it the best gyro in town? No. But it was very respectable. The pita bread had a nice chewy crustiness to it. The meat was seasoned and moist, and the toppings of tomato, onions, yogurt sauce (tetziki sp) and feta were very generous.  I love a good messy sandwich and this fit the bill.  It came was large side of fries. A nice meal for 7 bucks.  The rest of the food all looked tasty and well-portioned. I'm going back for burger, then a salad, then a chicken sandwich and then a sub.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2011-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AeucYo8J-rZjcq09Wuqsjw", "review_id": "ajXtuK4yydai5OhwqXEo-g", "text": "Solid three stars.. i was not able to try the hummus on this trip since that would have been the determining factor if this place would get a fourth star or not.\n\nThree stars for the food we did have, price, and portions were good as well. My friend had the feta gyro and thoroughly enjoyed it. i had a turkey/cheese pita it was good could only eat half..it was a lot of food. You get a choice of fries, salad, fresh fruit and a potato salad i believe. we both had the fresh fruit and it was very good. Nice assortment as well. Just not one measly grape and a crapload of cantaloupe..had strawberries, mango..the whole shebang.\n\nThe spanakopita was just alright :/\n\nglad there is Greek food spot close to my job since it is not that common in this area, def not bad and i  will be back to try it again.. there's some potential.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 3, "date": "2011-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Rx2RD3sfwsbWJcydrm2bAg", "review_id": "LNThd21eWqrJrJsf4SoXVw", "text": "Great Service.  Gyro Picado was a fine pita sandwich,  Very few jalapeños in the mix, heavier on the green bell peppers.  Will try another sandwich if I come back.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 3, "date": "2012-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "M6oU3OBf_E6gqlfkLGlStQ", "review_id": "sEnkrs0a85Iwo7if2byhyA", "text": "The greek's just don't make a good falafel, I should know this by now, alas I had to try it.\n\nAthenian express is a cute down town fast Greek eatery, you order at the counter and they bring it out. They have a array of food items salads pitas pastas sandwiches etc.\nI went for the falafel as usual. It was cheap enough ~$5 it came with a choice of side }(Salad, fries or potato salad). It comes as a round Peta cut in half with a few flat dry falafel patties and a plastic cup of tiziki. The side salad is nice but small if you are hungry go for the fries. Over all I was not impressed but I will try some other item here.\n\nBig plus for me was the huge hot sauce selection.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 3, "date": "2012-04-02", "type": "review"}
{"votes": {"funny": 2, "useful": 7, "cool": 5}, "user_id": "fczQCSmaWF78toLEmb0Zsw", "review_id": "wtytRKBC1lQLmvTRx6qfSA", "text": "I'm a huge fan of Greek food.  I've been to Athens, and I loved it there.  And believe it or not, I like \"express\" aka fast casual restaurants where you order at the counter and they bring your food to the table.\n\nSo, when I found myself downtown and hungry for lunch, heading over to Athenian Express was a no-brainer.  I can't say that I'll be rushing back, but it was fine... it delivered on what I was in the mood for on that day.\n\nLunch pricing is super affordable and portions are large.  The Greek Salad was nothing special - I've definitely had better (but I've had worse too). \n\n**One key thing to note: I do not recommend adding chicken to your salad.  It's not the greatest quality chicken.  If you do go here, stick with the vegetarian options.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 3, "date": "2012-04-17", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "45V7-1r79DEG0HbuaKYIlg", "review_id": "aRzPluM65bkx1cMrl-wdZg", "text": "Completely and totally A-OK.\nSeveral people in my office regularly get food delivered from here.\n\nI've had the gyro pita a few times, the Greek salad with gyro meat, fruit salad, tossed salad, fries and baklava.\n\nThe food is always fresh, delivery is quick.\nIt's not the best gyro by a long shot - but there's nothing in the world wrong with it.\n\nFor lunch delivery, it's one of the best options at my office. I have never been super impressed - but I've never been disappointed, either.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 3, "date": "2013-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "CSyRCBpSyeNGPy7fAGWwtg", "review_id": "CoMtJ6a_hO7UMGU3PaoXRA", "text": "One of my favorite paces to grab a quick lunch when I'm at work. The place is not the best looking one, but the food is definitely yum and fresh. The Greek salad and hummus are my favorite. Oh and the cashiers are very very nice!!", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2013-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0frBN-DPC2zlHLUWeG6-0A", "review_id": "zkguGKpc-McIO1uOKNI_xA", "text": "This place is quick and centrally located, but the food is pretty average. I wouldn't go out of my way to come here, but it's useful for when I'm in the area.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 2, "date": "2013-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XGiAs4fHzMr0rJhJeOyQyg", "review_id": "UhDFBewAoLWgLUaETlJuZA", "text": "Service is the best. Everyone is super friendly. Love love love the Authentic Greek Salad..... The veggies are just so fresh and the feta is so creamy!!! One of the best lunch places downtown. I love the quirkiness of the restaurant. The only reason it is not five stars is the bread is usually hard around the edges.  But don't let that keep you away.....", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2014-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EiImjebAsfVpjMs6J0iROA", "review_id": "DNag3Svia44Vduo4F6ynoA", "text": "Athenian Cafe (nee Express) is now closed until further notice. This is really a shame as it was my go-to place, only steps from work. Hopefully things get sorted out. If they do, I'll let you know,", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 3, "date": "2015-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7lLAOStEA4T3A8QdVo3QJA", "review_id": "gk6aMFxyG-yHEHc8uTcofQ", "text": "Was a wonderful 5 star worthy Greek restaurant. I use to drive 45 minutes just for a wonderful salad. \nSad it was sold to new owners who can't keep thier shit together. Mice, bugs, and food out of temp? Really? You didn't even run it that long. \nAnd now your landlord has changed your locks. Lol fail.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 1, "date": "2015-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EiImjebAsfVpjMs6J0iROA", "review_id": "3JMeuY9CcnxEpN3iNFvLJQ", "text": "The space formerly occupied by Athenian Express is for lease. Barring divine intervention, it appears as though it will never rise again.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2015-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "a1DUUGOKHbjuoL_Z90AnuQ", "review_id": "vJfGt8z_kTjOMnQWEQLuiQ", "text": "Second night in Phoenix... Chinese did not go well the first night... Let's try something totally different... Was around the 16th Street / Bethany Home area... Didn't want to try Richardson's as it was so busy... Let's try the dark and secluded Mediterranean House!\n\nSurprise! This Greek restaurant is owned by a Korean lady named Suki! What a combo! I asked her why she didn't open a Korean restaurant because you can charge up to $16 for BulGogi or Galbi. I guess she just wanted to try something different.\n\nFor starters we tried the Combination Platter which consisted of Hummus, Babaghanoush, and Falafel Balls with Pita Bread. \n\nI warned my friend, and any person reading this review, that Greek cooking combines herbs unlike no other country in Europe. You have to like the flavor of oregano, mint, garlic, onion, dill and bay leaves, basil, thyme, and grape leaves. Feta (Goat) Cheese is used often in their salads. And their desserts are characterized by the use of nuts and honey.\n\nSuki could tell by my friend's facial expressions that Greek spices were not to his liking; she recommended the Cairo Special as an entree - Egyptian Chicken and Mediterranean Beef combination. The Egyptian Chicken was slightly overcooked, but had a sweet aftertaste which was interesting. The Mediterranean Beef was excellent.\n\nI ordered the Lamb Shish Kabob - which consisted of two big skewers filled with gigantic pieces of Lamb, Onions, Green Peppers and Tomatoes! The Lamb was the tenderest I had in years - EXCELLENT! Of course, you have to like Lamb...\n\nFor dessert my friend had the Cheesecake - unfortunately store bought. I had the Baklava, which was delicate and light, with two small cups of Turkish Coffee! The coffee was not as strong as coffee I had in Europe, but is probably the best in Phoenix. (When you drink Turkish Coffee... Stir the coffee OFTEN! Grounds from the coffee will settle to the bottom if you don't... then you'll be drinking Turkish Mud! And stir in about 2-3 teaspoons of sugar, which makes it taste GOOD! I know you're going to say \"that much sugar!\" when you see such a small cup... trust me! When I was in Europe, my friends would often take me to breakfast establishments that would serve Turkish Coffee. (Many customers would take a couple of shots of Turkish Coffee before their workday began!).\n\nAn excellent Greek restaurant... with the proviso that one has to favor Greek spices and herbs.", "business_id": "FltN1Hnw4n7BORXJH1kaeg", "stars": 4, "date": "2007-03-28", "type": "review"}
{"votes": {"funny": 2, "useful": 6, "cool": 1}, "user_id": "BkmIUgwHg_5TCkJbdMEiJQ", "review_id": "YiHRKk0ifa2IsDKOMEkJ9w", "text": "CLOSING FOR GOOD IN OCTOBER!\n\nI eat here, maybe twice a month, and have never had a bad meal.  I was shocked when Suki (sp?) told me they were closing in October, for good.  Apparently they are having problems with a difficult (to put it nicely) landlord. \n\nMake plans now to go and enjoy it while it lasts.  \n\nHeidi, have you tried the Egyptian Plate?  We usually go in and start with Hummus, Lentil Soup and then move on to the stuffed grape leaves or Egyptian Plate.  I also like the Falafal pita.", "business_id": "FltN1Hnw4n7BORXJH1kaeg", "stars": 5, "date": "2008-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "LjePQ5B3G3jEOVNvH7_BMQ", "review_id": "RWpPWiIq2UzXepsn9JZO4A", "text": "Eating here is not just eating, it is an event.  The food is good, but one of my best friends is greek and so I have tasted better, but the entertainment is worth the trip.  They have a great band that plays for a long time and a good belly dancer that brings people out to dance with her.  The owner is very enthusiastic and he dances as well.  You get to break plates (you have to pay for them, only $2).  All in all a great dining experience.", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 4, "date": "2007-05-30", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "gGNAr-cmCQUgA9B0QjVqAg", "review_id": "TWiMv1XqsZQtAPuX-SPsmg", "text": "I've only been once, but I swore to go back again.  This place is fun, spirited and the food was very good.  I definitely suggest this place.", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 4, "date": "2008-03-25", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "1ylYrKcGNA8MDkhNBTjHMA", "review_id": "uZW4CCuk1YjOEv7o53vyUA", "text": "I would give 3.5 stars, but can't so I am giving the Bacchanal 4 stars. I recently tried this place out while at a birthday dinner for a hockey buddy. There were 12 of us sitting at a U-shaped table, which was nice since everyone could talk to everyone. Well, we could if we weren't right next to the band, but oh well. \n\nI think the appeal for this place is definitely the atmosphere. It is almost like a show where they serve food and alcohol, as opposed to a restaurant. There is one older Greek dude with two lazy eyes who kind of MC's the \"event\". You can really only understand every fourth word he says, but at least it is somewhat authentic. The band was good, with a rag-tag group of Greek gentleman. Although the drummer reminded me of Big Pussy from the Sopranos. A belly dancer came out and fell in love with my buddy Peter. He was in love too, I think. You also get to throw ceramic plates onto the dance floor and yell OPA! \n\nThe food was decent, nothing spectacular. I had a baked Halibut fillet with a lemon bechemel sauce. It came with potatoes and vegetables. The veggies were a little disappointing. They obviously weren't fresh, most likely canned. We did try the calamari, which was good. They have Stella! This made me happy. \n\nOverall the party had a great time, but I don't think anyone was blown away by the food. The same strange lazy-eyed Greek gentleman shook everyones hand on the way out. That was nice, but I ended up smelling like whatever cologne he had just taken a bath in.", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 4, "date": "2009-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "dUrVJl5qi2CJWff7s8HJNw", "review_id": "-AImuVfapvNhkNce7_OoHg", "text": "We made a point to go to Bacchanal after years of driving past it on Thomas.  The parking lot was full.  We lucked out and found a spot.  We walked up to the door and were kind of surprised by the sounds coming from the inside.  There was a band and lots of chatter.  Hadn't even opened the door yet.  When we entered we were greeted by the owner with a hand shake and were seated near the dance floor.  We noticed there were large parties of ten or more at the tables.  It was kind of like a banquet hall from the 70's-80's.  Our waiter was a young guy who sold us on a Greek beer.  It was called Marathon and it was decent.  I ordered the meat balls to start, a Greek salad, and the moussaka.  While waiting for our food we were entertained by the band and a belly dancer.  She was a lot of fun and got the crowd to shake shake shake.  There was a birthday party happening and everyone in the party was given a plate to break.  The plates were smashed in the middle of the dance floor and a circle dance  was started around the mess.  The food was okay.  The party atmosphere at Bacchanal can not be beat though.  Truly an orgy of food and fun.", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 3, "date": "2010-03-15", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 0}, "user_id": "hDlSSyDreM9xY4yQWPm54w", "review_id": "xQujsG0lxnKEg25CBnTz9Q", "text": "IT'S THE 1982 WEDDING RECEPTION THE BRIDE'S DAD DECIDED TO HOST IN HIS HALFWAY REMODELED SUNROOM/PORCH YOU WERE HOPING TO FORGET.\n\n--why is this 6 block area of Thomas stuck in 1982?\n--flashing colored lights were in bad taste, even THEN\n--live music is only redeeming quality, and it's BAD\n--belly dancer goes after EVERYONE in the room. yes, it's THAT wedding reception\n--stackable vinyl elk's lodge chairs lost their cush in 1984. HOW can they still be in use?\n--plate breaking at $2 a pop turns quickly into an exercise in dodging ceramic shrapnel. thank god we were not close.\n\nSERVICE HORRIBLE\n--forgot salads, then dropped them when we were about to leave anyway\n--drinks never refilled, beers never checked\n--it's like we were just invisible and unwelcome\n--host/owner saw us about to leave, but then turned away\n\nFOOD JUST WAY PAST ITS TIME\n--cuisine has come such a long way since 1982. get with it!\n--NO ONE actually wants to eat a pile of raw onions buried under globs of mucousy \"greek\" dressing.  WHY!!?\n--everything's in 1982 except the prices. You want me to pay $20 for that?!?\n\nNow I know why no one has ever mentioned this place to me _in my entire life_. Some places are better left undiscovered.", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 1, "date": "2010-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "THYIqfnLV54VZ_v2hCfq2Q", "review_id": "3WfBI9pJ1uJh7hs7lz3jTQ", "text": "This is a romantic diamond in the rough spot.  I came here with my dinner date and found it intriguing when we arrived, the doors were open and we could hear the greek guitar from outside.  We were ready!  The decor and seating is a throwback from the past, but we were here for the food and entertainment.  It's definitely here on  a Saturday.  Were were promptly seated ordered some Greek white wine and the saganaki.  Both were very good.  We then decided to order our entrees and our waitress was fun and playful.  While we waited, the belly dancing and greek guitar was going.  To make sure we were able to take part in the entertainment, the waitress offered us some plates.  We took one for each of us.  This was a fun hit, we threw the plates and broke them and it was a hoot.  When we received our food, it was great.  I had the chicken with artichokes and my date had lamb.  His was cooked just so perfectly it fell off the bone.  He got a thrill giving one of the belly dancers a tip, and then it was time for desert and the greek guitar.  It felt like we were on a greek island.  The chocalate cake was wonderful.  We were going to call it quits, but someone at the table next to us suggested that we finish off with one of the black licorice shots.  Yawsix!  This was a great time.  Now if I could just learn how to play that greek guitar....", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 5, "date": "2012-03-25", "type": "review"}
{"votes": {"funny": 6, "useful": 6, "cool": 2}, "user_id": "cRyNICH0mhjxagvSyVr60Q", "review_id": "2hU9YvZEFQ1-hdATPHdwUw", "text": "Visited Bacchanal because of a restaurant - com coupon I picked up. They could stand to update this place a bit. The seats all seemed to have their padding worn out and I tried 3 different seats from neighboring tables. If you plan on pacing your meal out longer than 30 min or so, you might end up with a soar rump at the end of your visit.\n\nThey are not located in a great part of town and you could easily miss them if you weren't looking for them. On the south side of thomas just east of 30th street by a few feet. \n\nThe food was neither good nor bad. The greek salads were good and the pita bread they bring was great. I ordered a gyro platter and the gyro meat was not shaved off the spit like one might expect, but it seemed to be more like thin pieces of meat fried in a pan on their stove top. My guess is because they don't do a high enough volume that an entire cone of gyro would be too wasteful - although I could be wrong. Either way, ive had much better gyro from other establishments.\n\nIf you're looking for better mediterranean food I would recommend cypres grill over on camelback, just next to the trader joes. I can't attest to the atmosphere much, because when we were there on a friday (maybe it was saturday) around 6pm, we were litterally the-only-people-there. As we were leaving another group came in to eat. Seems like everyone already got the message that there are better options for greek / mediterranean.", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 2, "date": "2012-03-29", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 2}, "user_id": "xgrNgHOs8F5JvEX38IeCJg", "review_id": "0A6zbn0dbiQ5jZcAgm7jcw", "text": "I've been delaying this review, partially because I did not want to relive the experience and partially because the owner is so nice that I didn't want to say anything bad about her restaurant.\nBut...\nMy experience was horrible.\nI had gone to Greekfest with my parents when I was younger and I loved it. My parents had nothing nice to say, but for me it was the greatest. I was 12 years old and not paying for it, which might be the difference. It has apparently not changed in that many years.\nI went on a Tuesday evening with a fiend of mine for what was to be a three hour long ordeal, not because we were having a laid back, relaxing dinner, but because the restaurant could not handle being \"slammed\" on a weeknight. The truth is that there was a group (who had made a reservation) and one other table when we walked in. Even when the group had gone and we were left there all on our own, the service was horrendous.\nThe hummus was alright, but we were charged for the accompanying pita. I thought, given the price of the entrees, the pita could have been included.\nI ordered the swordfish and a friend ordered lamb, I think. They were out of both. I ended up with the salmon and she had the steak. While she enjoyed her steak, I feel like I could have had better salmon in my own kitchen. It was overly spiced, and drowned in sauce. There was no taste of salmon to be found.\nThe desert was not as great as I remembered, but they sure are pretty. We had the galatabouriko, my favorite. We also chose a fig desert, which was a little grainy.\nThe whole ordeal came to about $90 plus tip. Usually a good tipper, I left an appallingly low tip to make a point.\nOccupying the only table in the restaurant, we should have had better service. Toward the end it seemed like a joke. We stared at the owner and waiter waiting for the check, and then had to wait another twenty minutes for them to pick it up before we finally went up to the front to pay ourselves.\nI won't be back. I won't tell other people to go.\nThe atmosphere was nice, but they seriously need to improve the quality of the food and the service before they can charge the amount they do.\nThe two stars I left were for my friend's meal, the physical ambiance, and nostalgia, along with my hopes that the owner will read this review and improve the restaurant.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 2, "date": "2008-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "gVgbIRT9mJkeWSAzBA9i6g", "review_id": "63qWmoVnav__kTRuDGeT4A", "text": "We had a fabulous dinner at Greekfest! I'm truly baffled by the negative reviews. We started with the Greek Antipasto (a large plate by itself) and the Cheese Saganaki (flamed with brandy at the table), and shared a nice (mild) Retsina white wine. For an entree I had the lamb shank special, while my girlfriend had the Exohiko, which is lamb chunks, Kasseri cheese and briami vegetables baked in phyllo pastry. For desert we had the Baklava and the Galaktoboureko (a custard pie baked in phyllo pastry and soaked with mastiha honey syrup).\n\nEverything was delicious, and the service was excellent. Add to that the attractive interior, which boasts a beautiful wood ceiling and authentic Greek artwork and accessories throughout the restaurant. It's also worth noting that many of the herbs used are grown fresh on the premises. They clearly put a lot of effort into serving high quality food, and it shows. \n\nThis will be a regular stop for us whenever we're in Phoenix.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2011-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "G99vNOR9GTWeSeoHwnax_A", "review_id": "3G1w5wrHt2G6-G6UGNmGeQ", "text": "I love walking into a restaurant and being enticed by the aroma of good food.  We had a light dinner. Hummus and pitas. Gyros. Hypocrites salad. Followed by a desert that I can't even begin to pronounce. Everything was very good, and I loved the normal portion sizes.  \n\nOur waiter was superior.  Attentive, yet not too.  I'd love service like this everywhere.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 4, "date": "2011-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 1}, "user_id": "gVgbIRT9mJkeWSAzBA9i6g", "review_id": "nSHoLxaIhQTwt2x3o1HPYA", "text": "Back for our annual vacation dinner at Greekfest. As before, we started with some Retsina white wine and the antipasto appetizer (which comes with warm pita wedges). The antipasto (described as: \"Taramosalata, Melintzanosalata, Tzatziki, Homous, Dolmathes, Feta Cheese, Fasolia, Kalamata olives and sweet onions\") is a terrific sampler for two, and highly recommended. The Greek salad was also excellent, while the Steak Makedonias (filet mignon with reduced cabernet-pomegranate sauce) was tasty, but a little dry at the edges -- they recommended medium-rare, but I ordered it medium, and the result was more like medium-well. And filet mignon is probably not a Greek specialty. However, my girlfriend's calamari was delicious.\n\nI'm already looking forward to next year....", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 4, "date": "2012-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "qK1rzRnD-QD4sRxDU4NhlQ", "review_id": "zmWoG77ROLsYDJhHX2MLrQ", "text": "Loved this place! I had the calamari and came with rice and eggplant slice. Very delicious and the waiter did a great job!", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2012-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EI6x6iQ5vnHIrTxgVDLVvg", "review_id": "1edP3CCTlhiurxlTTcdR2w", "text": "There is a difference between authentic and antiquated and unfortunately this is the latter. The food was ok but spending HOURS on a weeknight waiting for food in an empty restaurant in the most uncomfortable chair I've ever sat in was not a pleasant experience.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 2, "date": "2012-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "I4MxmBPTll9C2s0hpC6Uag", "review_id": "mIU3PJQyqecY18T2mnYpjQ", "text": "Great for date nights, and special celebrations.  Gorgeous atmosphere, friendly staff, upscale (but healthy) and DELICIOUS food. A++ LOVE that the portions are normal sized instead of fattening super sized like most restaurants. You come in, eat a normal sized, healthy, delicious meal and go home feeling satisfied and content. If you like fine wines they have an huge selection of choices for you that are hard to find elsewhere. And if you do want to splurge on calories I highly recommend the saganaki (it's a yummy splurge and my kids LOVE that they set it on fire with a flourish and an \"Ompah!\").  \n\n(Also have lots of gluten free choices - do you know how hard it is to find an upscale restaurant that's mostly gluten free?)  Love it!", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2012-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "oGBDF5HoCoyIjWFpCgnybQ", "review_id": "J2bCxv6J7EGnUC576KyNZw", "text": "I love this place. Easily the best and most authentic Greek food in Phoenix. Their best dish is the arni(lamb shank) but you have to call ahead and request it. Every time I come I feel like I am back in the village in Greece!", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2014-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tIkaVItCmEtEj9sAqtXCUQ", "review_id": "TKk1r-wIKk09bPuVIme0ZA", "text": "Awesome experience. Our waiter, Zeff, was the perfect host. Food was great, ambiance authentic. Thanks again to Zeff; superior service!", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2015-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "D0LTxl3h3yfHk2XOZToSWg", "review_id": "0G-Q9-t2mXKbKfk4uXk8oQ", "text": "Well, I really wanted to love this place, but that was not the case. I had seen this restaurant featured on 'Check Please Arizona' and because it is within close proximity to my house, I thought I would give it a try. First, the appetizer platter was not great.  The hummus was below average, the tzatziki was ok, the babaganoush was not good at all, and the pureed pink caviar was too awful to stomach.  The platter was over priced and the amount of food was small.  Next, I ordered the shrimp saganaki, which was pretty good, but again, small and over priced ($14 for an appetizer of 5 shrimp). The pita bread was actually very good, however. My companion got a salad with smoked salmon and she didn't enjoy it at all and told the server she didn't like it and he said well that was the description on the menu... and did not offer her anything else or take the uneaten salad off the bill. Our drinks ran dry and the service was terrible.  I will not be back. Across the street is a place called cyprus grill, it is a lot better than this place.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 1, "date": "2015-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "u7AFND83xMf3go8FEkSzAQ", "review_id": "9NWa9KjA2v16wN_weBHbeA", "text": "This place is great... Love the food and service!! I have been here quite a few times and every time is delicious!", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2015-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "THYIqfnLV54VZ_v2hCfq2Q", "review_id": "3IK5r0cus2qZVDLQadx0sg", "text": "Wonderful old school Greek.  Very friendly staff, you're treated like family.  The decor is wonderful I wanted to take a shopping bag of various items to decorate my place!  Food is great, saganaki is perfect, and the small plate gyros taverna was just right.  Hummus was excellent.  The Greek coffee looks wonderful but I passed.  I'll be back!", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 4, "date": "2015-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ij37Epg7mS2Pzc53F7DxTA", "review_id": "-gLd84jtCZ9_7J-RnjR9ew", "text": "If you want authentic Greek food, this is the place to come. Some of the dishes are a bit pricey but well worth it. The flavors were incredible and everything was fresh. Our waiterZeff was the best.  We will be back.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 5, "date": "2015-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ERn56ZlG86CsBjR5v1Z-IA", "review_id": "e-wDw32d9bs8QfLlniW9xw", "text": "Good food & nice people. Pretty good selection & variety as far as menu. I've also been told that it is quite authentic. Although, it is a bit on the expensive side.", "business_id": "KLaxBc83JnxyGf7GP7enYA", "stars": 3, "date": "2015-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "KI4sBf9jWLs4aGm_mIsFQA", "review_id": "eNxu8fSgNrQGPxIXvUzaWw", "text": "The goods.  The absolute, gyro goods.\n\nI needed a gyro.  I found this joint.  I got a gyro.  I am happy.\n\nSeriously, I don't know about anything else they serve, but the gyros are top tier.  Chicago worthy.  Chocked full of meat and sauce and onions and tomato.  The pita was even good.  Heck, the paper they wrapped it in even tasted good...I mean, uhm...\n\nAnyway, the service was good.  The inside is a joint.  The outside is a joint with joint-like parking.  Next to it is the 'licka' sto' so you can buy some Flamin' Hot chips to go with your gyro.  The only way to eat.\n\nThe price is right, too.  My gyro was only $4.60, which is a whole dollar less than my usual gyro spot.  I saw a slider on the dollar menu (you don't usually see dollar menus in places like this) that I will have to partake of.  \n\nI would put my name on their gyros anytime, and I fully recommend this place for it.  If you've never been here before, keep an eye peeled for it or you'll pass it up.  Its on the corner of Osborn and 24th...next to the brake/tune up place.", "business_id": "bxpzP73A7gauvxFEyd_8xA", "stars": 5, "date": "2009-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "aZLw7np_luaR9TjQwqNijA", "review_id": "gTmNCb3NNQAVsTPMph3xHA", "text": "Friendly people, great food, LARGE portions make for fine lunchtime eats.  Call ahead and see what the special of the day is.  Also, the gyro special (gyro, fries, drink) is usually $5.99--and it will fill you up.", "business_id": "bxpzP73A7gauvxFEyd_8xA", "stars": 5, "date": "2009-04-02", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "HvaVgP0S0dFaCbBDIQIkag", "review_id": "sdwyYD7gXpTNlMAFao7XZA", "text": "I've been watching this place out of the corner of my eye since we moved to the neighborhood, and I finally stopped in yesterday to give it a try in my quest to sample all of the local fare around my house (for better or for worse...still haven't gotten up the courage to try Los Betos...). I made myself go to the gym beforehand to earn my treat, and all I could think about was curly slices of gyro meat with each lap in the pool. \n\nI expected it to be grimy and icky inside, but actually it was clean and the staff was very friendly and welcoming. \n\nI ordered the gyro with everything, and DH got the Philly cheese steak just the way he likes it, with meat/cheese/bread only. He said it was great; my gyro was solid. \n\nI couldn't help wondering while I was waiting what the heck they do with that glistening, homogeneously-speckled column of \"meat\" when they close down for the night...do they wrap it in tin foil and put it in the fridge? Is it so processed that it doesn't even need refrigeration? What IS it?\n\nWhatever, I like gyro meat. It's the Greeks' answer to the hot dog. It's the pita's Velveeta. You don't know what's in it, but you don't care because it's mmmmmmm tasty.", "business_id": "bxpzP73A7gauvxFEyd_8xA", "stars": 3, "date": "2009-04-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "8MS1xsTqwBtK08g7qreDYQ", "review_id": "duXOqxAqm5S47UAycixuBw", "text": "I love hole in the wall places where food is good, owner who works the kitchen and they know what is good food. Olympic Gyros is one of those spots that i make sure to stop by once or twice every week for lunch. Few places where you can have a full meal for under $10. \n\nTonight I was working late so went their during closing time and Steve the owner was cooking. He is a Chicago native who knows about food and we ended up talking a lot about food in phoenix, small business, what is good food etc etc.\n\nJay\n\nPS: They have also introduced chicken wings so try them.", "business_id": "bxpzP73A7gauvxFEyd_8xA", "stars": 5, "date": "2009-04-15", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "ZXXNfqQfydJFLAqBtzwM-Q", "review_id": "bsePuYsceCIlq4Nzwg9Q_Q", "text": "Ok I'm Greek so I'm very picky about so called Greek food. Please tell me the owners are not really Greek. We ordered two Gyros, One souvlaki and one chicken souvlaki. The Gyro's were ok. Nothing special at all. The pork and chicken were pretty disgusting. I'd like to know when supposed Greek food started being spiced with curry. Both pork and chicken were dry. The tsaziki, which is so easy to make, didn't even taste like it was made with yogurt. We ordered the 4 meals but came home to find only 3 fries in our bags. Anyway, sorry but knowing what real gyro and souvlaki should taste like, I can't hardly bear to even give this place the two stars that I did.", "business_id": "bxpzP73A7gauvxFEyd_8xA", "stars": 2, "date": "2009-04-17", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 4}, "user_id": "ZXXNfqQfydJFLAqBtzwM-Q", "review_id": "8IiTUfn38AzbpClEr4gQhg", "text": "The owner responded to this very quickly which is nice and shows he cares. He let me know he is not Greek but it just doesn't change my opinion of the food. Just wanted to let everyone know he did respond asking what he could do to make my experience better.", "business_id": "bxpzP73A7gauvxFEyd_8xA", "stars": 2, "date": "2009-04-18", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "KI4sBf9jWLs4aGm_mIsFQA", "review_id": "QabcCAXgAN3_9eYJGg-0sQ", "text": "Olympic Gyros retains their 5 star rating, and I'd give them another star if I could.  Like many of you who have reviewed this place, I was contacted by the owner with a thank you and a little background.  That is key for me.  I love when owners care.  \n\nI was here not too long ago and got the Italian Beef.  Good.  I told the cook to make it sloppy.  He did so and made it juicy and drippy and soggy...the way I like it.\n\nAlas, this sandwich failed to take me back to Chicago.  BUT...it is still an awesome sandwich.  It just doesn't have the taste I remember from my childhood, which was from a long forgotten hole in the wall that probably isn't there anymore.  Whenever I hear of Italian Beef, I can almost taste that place from back in Chicago's offering.  I was little when I had it, and my uncle's girlfriend gave it to me.  To a little kid, getting something so tasty from such a pretty lady...that sticks in your memory banks.  \n\nI have only had one sandwich take me back there.  Olympic Gyros' is still great, though.  I'm just over nostalgic.  \n\nI see a review that states this isn't Greek food done well.  I cannot say, because I am ignorant to true Greek cuisine... something I hope to remedy before my days are over.  But this IS Chicago food done well.  This IS greasy spoon done well.  I believe that is what the owner is shooting for.\n\nWHOAWHOAWHOA!!!  Hold up!  How could I forget to talk about the WINGS?!?!\n\nYes, they have wings now.  I love that they promoted this event.  Awesome specials on the wings going on now.  I think they even gave some away at the very beginning.  \nAnyway, I got a dozen and a half for under $6.  Yes that's right.  I got naked wings and then a dozen hot.  The hot wings are what you want when you go to get wings.  Not gourmet.  Not high class.  But friggin' good and cheap.  These are the kind of wings that you run and get at like 11 at night when you're playing Spades and need something GOOD.  These are not frilly, froo froo wings.  Just wings.\n\nThey will sell many of these.  Because I believe this owner will not rest until he does.  They seemed very excited about the wings' debut, which excited me.  I wish them the best.  They'll definitely continue to get my business.", "business_id": "bxpzP73A7gauvxFEyd_8xA", "stars": 5, "date": "2009-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zsTLjlG6MLlQtWJrKal1xQ", "review_id": "okc2CLDSGTfbfnDJJOM85w", "text": "This place has wonderful falafel sandwiches and they are always so nice. Definitely worth checking out.", "business_id": "bxpzP73A7gauvxFEyd_8xA", "stars": 4, "date": "2012-04-07", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "k4-6lakq7t3kCgbvPxcuvg", "review_id": "3KSc_I7CwgGY3REdIQ0big", "text": "Their cheese pizza is so good we order it every Friday night for dinner, and trust me, my husband is some kind of cheese pizza connoisseur.  I think he would live off of it if he could.  Anyway, rain or shine he's calling them to get 2 cheese pizzas every single weekend.  They are cheap (like $6), hot, cheesy, the good kind of melty, salty, heavenly mozzarella deliciousness that comes off in big gooey strings.  The sauce is flavorful and the crust is DELICIOUS.  I am not a huge fan or pizza and I even like their cheese pizza.   Yummy!", "business_id": "bxpzP73A7gauvxFEyd_8xA", "stars": 5, "date": "2012-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "wYzOrThSYP8WwioLfsu4vQ", "review_id": "_LVRMIuneOvTSorcIEBpCw", "text": "Cypress Pita Grill is great little restaurant to grab a quick snack, an afternoon beer, or a light dinner. The restaurant is located in the Town & Country plaza, next to Trader Joe's. It's a pleasant enough atmosphere, with a small dining room and plenty of outdoor seating. The waitstaff can be hit and miss, but I've never had anything less than acceptable service. \n\nYou have to try the greek fries!!! They are amazing-- with this zesty lemon sauce and feta cheese. Pure heaven! I can dream of nothing else now. The rest of the food is always good. I wouldn't say \"amazing,\" but definately healthy, light and filling. The veggies in the greek salad are always fresh, and the meat tastes slow grilled-- nice and tender. This is a great place to go when you are looking for a laid back meal any time of the day.\n\nUPDATE: I've upped to to 5 stars. Today I tried their white peach sangria. Yes, folks-- they have sangria. Two kinds, I might add. It's heavenly. Go there! Now! Get some for yourself!!!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2007-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "THN1gW3GtetokJZaQ_J0Tg", "review_id": "lVjbWw1XcoAUtWiMBJ_5kA", "text": "It was back in the '80s when Town and Country Shopping Center was a hoppin' place on weekend nights because of its great selection of trendy restaurants. Maybe those heydays are gone, but as someone from the neighborhood, I am glad to see a few small \"boutique\" restaurants going in, and Cyprus Pita Grill might well start drawing more crowds. The food is carefully prepared and presented, the atmosphere is cute faux Greek, and the service is pleasant. The lamb on my gyro plate was tender and scrumptious and I regret I didn't order any appetizers. A neighboring table was ordering all appetizers instead of entrees and they looked wonderful. Three of us sated ourselves for a mere $45 and resolved to stop by more often.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2008-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 3}, "user_id": "cOaan-hRNqiZHPJ24gUhSg", "review_id": "f6vQ6orfxqATJCxOgwC1gw", "text": "Located in the Town and Country Plaza in Phoenix on 20th St. and Camelback, Cyprus Pita Grill appropriately brings excellent food and ambiance.\n\nI have eaten at this restaurant dozens of times and can say that they are consistently wonderful. The management is so charming! The owner is from the island country of Cyprus.\n\nThere is some nice artwork on the walls and interesting decor. The restaurant is wide open but intimacy doesn't suffer. Lighting is subdued and slightly romantic although there is no reason to feel awkward if eating alone. There is also a nice patio on two sides of the restaurant perfect for people watching or getting a breath of fresh air.\n\nThe food is superb! My favorites are hummus, chicken souvlaki (grilled chicken on skewers), and the Greek fries. Do yourself a favor and order the Greek fries! They are French fries smothered in feta cheese and seasonings. If you like feta cheese and fries separately you are going to fall in love with the combination!! They also just started serving flaming cheese which is sauted in brandy and ouzo, lit a flame, and served table side. Very flavorful and dramatic.\n\nA quaint restaurant with excellent food in a nice part of Phoenix makes Cyprus Pita Grill well worth the visit.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2009-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0VfJi9Au0rVFVnPKcJpt3Q", "review_id": "Lmvwjt9x3zsvbyd4GbYSAw", "text": "Cyprus grill is a wonderful addition to the Town n Country shopping area. Easy, tasty Greek food served well in a nice environment. Staff is friendly and skilled... they know their custom menu. I got the Gyro pita with Greek Fries... my fav. I have yet to order a bad thing from their menu.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2009-05-11", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "j8ocPEVty-EEYQk_Zeldyg", "review_id": "nNquegoxb1gQuLOm9qdaZQ", "text": "This place is fairly close to my hotel so I swung in for dinner on Thursday night.  At around 6 there were only 4 or 5 other people dining in, and most of them were solo diners.  I grabbed a seat - although they do have a counter you can order take out from.  I ordered a portobello pita with hummus and a side of fries.  With a drink it came to under $10!  The pita was delicious and the fries were nice and crispy.  I think this just might be my favorite place I've eaten in Phoenix so far!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2010-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7hLw3qNZPc8uQdLuTxg_hA", "review_id": "L_rQEUO7npd0Nx9Wc4LAOg", "text": "Great place for lunch.  Reasonable price and food is always good.  I love the Chicken savoualki...I think that how you say it.  All of us from our office order food from this place.  we just love the food!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2010-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zCxN_nU2o8LHNVzjRrWQbw", "review_id": "r9wtUGflN-5Lwwhzu4RmiA", "text": "great place for lunch.  Good food and fresh.  Love the chicken souvalki....:)", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2010-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "esomNneHvsEv91MmraM5ug", "review_id": "1AjBRJ3IVyM6es7QL9MgvQ", "text": "I really loved eating here and plan on coming back soon!\nI came here with two friends. Service was a little slow at first but was acknowledged and apologized for immediately. (To apologize our server brought us a piece of this cake at the end of our meal. It's not on the menu, I'm not sure what it was. It was topped with Phyllo dough and honey and the cake part was kinda like a cheesecake but not, it was a different texture, lemony with lemon rind in it and not very sweet but it was VERY good. I quite enjoyed it. Perfect way to end the meal.\nNow to rewind and go back to the start, we had a couple appetizers. We started with the Bruschetta - $3.95 and the Veggie Combo - $10.95 The bruschetta was incredible! I could have made that my meal.\nThe veggie combo was also just as good, BUT I have to say this: For those who don't know, Spanakopita is Phyllo dough filled with spinach, onion and feta cheese. \"Spanaki\" in greek means spinach. There was NO spinach or onion on this. Just Phyllo and cheese. It was still so, SO good, I mean you can't go wrong with cheese and dough right? But I wanted spinach and onion! The falafel looked like a hush puppy from Long John Silvers, but was a hundred times better.\nFor my entree I had the Lamb Souvlaki Dinner - $12.95. So tasty, perfectly cooked and seasoned.  mmmmmmmmmmmmmm.\nOh note to the staff. When it's night and people are sitting on the patio, light a candle and turn on your decorative outdoor lights. Some of us like to see what we eat!. Still 5 stars!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2010-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hjJPKQ1Ah91h3fVbc8GsOg", "review_id": "ZBP2eahpndbvqTBrCTaV6A", "text": "I frequent here for lunch.  I adore their Pita's.  They make it really tasty and consistent every time.  Their menu is typical Greek, humus dip, lamb/pork skewer with rice, gyro's with side of crispy fries.\n\nA thing to know is you line up and order your food at the register and you obtain a number and just find an open seat.\n\nYou can't go wrong at all! Guaranteed to hit the spot!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 3, "date": "2010-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-Zlsy_1wAKbNrp4-c5V9uQ", "review_id": "B7mNUyn3bEFoqySstT7OAg", "text": "Amazing greek food! Definitely try the greek fries!  I always try to come here every time I am in Phoenix.  Staff is also always very friendly!\n\nAlso try the greek calamari.  Unusually delicious!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2011-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hcctCQy3bdZMezrUKkZLtA", "review_id": "kYhKWql0mcqKkfEyTDFmIw", "text": "I love Greek food. I have no idea when I became so enamored with Greek cuisine but I am glad I did. I end up craving it at least once or twice a week so when I met the fiance for lunch today near his office I mentioned aforementioned craving and he led us here to Cyprus Grill.\n\nThe place was pleasantly busy but not overcrowded. We ordered at the counter and out food came out pretty quickly. We tried the gyro pita as well as the gyro plate. We cleared our plates in no time so I guess that means the food was good, right? \n\nThe gyro meat was tasty, moist and flavorful. The rice was delicious and the tzatziki sauce was refreshing. We decided that we'd be going back for future lunch dates whenever possible. Besides, you can't have too many go to Greek spots in my opinion so this one's definitely going in our books. Done and Done.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2011-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "obc78GRakDExMOm0N_fQIw", "review_id": "03KT8Tdxn-8qKrvTz83Wng", "text": "This place is great. Hummus is really yummy and comes with plenty of pita. The boy gets a chicken caesar pita wrap that I always like to steal bites of. We like Maggie!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2011-05-06", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "sMgt2JAQ85nz59Woe0IAtw", "review_id": "WE5ioAiFOgpqJyvzF5TFNg", "text": "I'm no expert on Greek food, but as far as I'm concerned Cyprus Grill does it as well as anyone. The Spartan Club (a massive pita sandwich stacked with gyro toppings, grilled chicken, lamb and hot sauce) is one of those dishes I crave, even when i can't finish it all. The service is always terrific, and it's located right by Trader Joe's, so you can grab some good, cheap bottles of wine while you're there.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2011-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "NccXEicyqLBkyPd2JPWh6A", "review_id": "N_ZFfIY6wkhBhgfsNsXnhw", "text": "The food was pretty decent, but the waitresses were inattentive. No ambiance. Good green tea. They tried to commit our order to memory, which was a colossal failure. Both orders were slightly wrong.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 1, "date": "2012-03-31", "type": "review"}
{"votes": {"funny": 6, "useful": 11, "cool": 8}, "user_id": "0oRtnPHtvZIE1UNxCDDTPw", "review_id": "4a7KsMqBVYISZY4l2ODvlA", "text": "I'm a fan of this place. Fantastic lunch option if you're on a bit of a health kick, and one of the best value takeaways you're going to find.\nMy friend Sage introduced me to this place a while ago, and I seriously need to return soon. \nThe Wait staff were really on the ball, friendly and personable. We were never left waiting but at the same time no intrusion into conversation.\n\nGo and enjoy! :-)", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2012-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gg_OKjOAl_vVmdh5ZETuiw", "review_id": "rQ63ynlQmBzf6baVVPIMsQ", "text": "I had the lamb souvlaki pita and it was fantastic.  Plenty of toppings and the tzatziki sauce was superb.  Best of all was the lamb cubes: generous portion of meaty chunks.  Some places skimp of the toppings and meat and leave much to be desired but Cyprus Grill gives you the bang for your buck.\n\nOn the night I was here there must have been a call off or two as one woman was left to operate the cash register and serve the tables.  There was a wait but this lady handled it like a champ and kept her composure.  My friend said this place is typically staffed well so the longer wait was not the norm.  Props to this gal for taking it all in stride.\n\nI was also impressed with the tropical tea they served.  It had passion fruit or some other tropical fruit that I'd never expect to find in tea but it was very good and refreshing after spending the day out in the sun.\n\nCozy restaurant in the Town & Country Mall at 20th St & Camelback.\n\nI will be back.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2012-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ptZHJS6B2bQBGadUbPpZVA", "review_id": "hr3nhx-b56GnLphunUlIZA", "text": "One of my favorite places to eat in this area of town. food is great people are nice.  I seem to like the Spartan club most and like going with someone so I have room for a few Greek fries. :)", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2012-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rYu-JaF51BUeyPvQSMG4gw", "review_id": "FGItwwk8yQITeKhb0x4gtQ", "text": "This is hands-down my favorite Greek place in Phoenix. Came here about a year ago because they offered a deal online and have kept coming back ever since. Definitely try the hummus.. I'm usually so full from the hummus I end up taking my entree home! I've tried the gyro pita, the greek fries, the spartan club, the chicken caesar wrap and the gyro salad, all great! There's a lot of parking. The only thing I'd improve is probably the actual space, it's a pretty small restaurant. Never have to wait to sit down, but if it's busy your food may take a little longer than the normal quick service. Also, they should put PITTED kalamata olives in their dishes instead of ones with pits in it! Overall, great place.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2013-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "aTi0NVrcPJWbN6jAsJVcAw", "review_id": "0wCuv5Lb7UofcT0U4iqSOw", "text": "This has quickly become one of my fave places to stop in for a bite when I don't feel like cooking...or when I get off a plane and have no groceries at home. The calamari wasn't too bad, and I like their spanakopita. The spinach artichoke dip isn't my favorite appetizer here...I'd say choose one of the others. My fave dish is the basa fish with rice and a side Greek salad. Yum! I like it so much that I've started buying basa fish at the store and cooking it at home. \n\nThere's outdoor seating with sun shades for the afternoon sun. \n\nService can be a little slow at times, though the folks are nice. Parking is a royal pain right now due to the construction of the new Whole Foods at the other end of the parking lot.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2013-04-09", "type": "review"}
{"votes": {"funny": 2, "useful": 7, "cool": 5}, "user_id": "m7vtKWpZ9wdEQ95wJxrMrg", "review_id": "XF80BY-BuaDRacko2SyzrA", "text": "I've eaten here a couple of times and the service has always been friendly and the food quite good. My only suggestion for them would be to make the falafel less dense; other than that, I have no complaints. This is a good place to go for a nice and fast Mediterranean-style meal.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2013-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3KBekV70D1JN1uKE8fy53w", "review_id": "Zc1kkLHyO9aZUaZdHmF0UQ", "text": "I had falafel pita and Greek fries. As good as anything I've had in the Mediterranean. Prompt service, yummy food, knowledgeable server. The added plus for those of us visiting from the Northeast in March is the ability to dine al fresco!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2014-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sMfYB29Sr0mn-py-2RqsnQ", "review_id": "sunfg5oooT8XAQUf_sDY9g", "text": "Worst service I've ever experienced. Called my order in 20min ahead and had to wait another 30min after I got there till my fries and pita were ready and there was no one else in the restaurant not a single person. It happened once and I thought it was a fluke but this is now the second time. Staff is incompetent and rude. The cooks just seemed to be hanging out and flirting with the server. I ordered pesto fries and they were out of pesto which they should have told me when I placed my order by phone instead of making me drive there to find out. Terrible I will never go there again which is sad because they're pesto fries are great but their service is so terrible I can't imagine going back and dealing with them. Service is everything and cypress grill is a prime example of losing business over service alone. I'm telling everyone I know and they have already stopped going because they are experiencing the same lack of professionalism and service.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 1, "date": "2014-03-13", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "MtCndAMxTTkiTGM2HQ-juQ", "review_id": "ZlPzYrJ-qAS6dY8D2NPVzw", "text": "The misses is a Trader Joe's nut so we're all up in Town & Country bizznaz weekly. So there we were Sunday night in great need of sustenance. We had a choice between the new Grassroots place & this one. I saw the sign out front for their special that night, a feta burger. The lady said fine with me, I've had their chicken souvlaki & it was good. Alas we have found refuge on this long day of errands & chores.\n\nTo take the edge off I ordered a sangria. It was fine. The prices were very affordable so I didn't expect anything heavenly. Just honest food for an honest price.\n\nThe food came & looked fine. I took a bite of the burger & it was very dry. I had a few fries which were good. After seeing the Misses dissect her chicken souvlaki & placing a piece of undercooked chicken on the spare plate between us I noticed something was just not right here. I opened the bun on my burger. What I saw was fresh lettuce, tomato & a mediocre bun...but it was the burger took me back in time to when I was in 3rd grade in the cafeteria sitting next to my buddy Jimmy. It was about half a centimeter thin & could potentially have many uses as a coaster, a mini Frisbee, an eye patch, heat shield tiles on the next shuttle to Mars, skeet shooting - altho I recommend a 12 gauge to take this thing down. \n\nThe misses noticed the dazed look on my face and says, \"Honey?\"\n\n\"Yeah Jimmy, what's up?\" I reply..\n\nShe gave me that look & I snapped back into reality but was still in disbelief at this burger patty. I ate 2 bites & left it dismantled. I finished my fries & her charred chicken. The raw portion of her chicken ruined it for her. She ate her rice & salad, which were good.\n\nThe server was very nice & I told her what I thought of the food. I think this was the first place I've ever complained about the food at a restaurant, I just never go back. This meal was.....just very insulting. I am not an 8 year old kid anymore!\n\nIn hindsight I thought, maybe I was partially to blame ordering a burger at a Mediterranean joint but c'mon, it was the special that night!\n\nThe server seemed surprised when I showed her the brown disc. She informed me they ran out of fresh ground beef so I got a frozen one. Shame. I truly hope the next time this happens they just 86 their special & not serve garbage. I've had a better burger at a hospital at 3am. \n\nWe will not be back.\n\nPs. Jimmy, I miss you bro :(", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 1, "date": "2014-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1g8Crb6WGQUsA2l2X3yVGA", "review_id": "0o7ih5a4SNhdeGQFWxriug", "text": "Fabulous! Fresh! Fast! Clean! Best French Fries in the valley!!!! Lemon Feta Fries mind you!!!!!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2014-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yUb8AZLF0aaDENrGVRuOBg", "review_id": "HUV2DP-JnQoWobIx36xCpA", "text": "A \"Cypriot\" grill that excludes halloumi from the menu cannot be run by Cypriots..!! I was very sadly disappointed. This establishment would be short-lived in Cyprus.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 1, "date": "2014-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gdoPetEmoNslU0Hf3TmuEA", "review_id": "SlkuJRh7Hvb_he0NtGF3_Q", "text": "This place is always great. I think it's weird they charge $1 per dolma since that's actually really expensive but the food here is always delish. Usually get the gyro plate or gyro sandwich. Gyro plate is definitely enough for 2 people. Greek fries are bomb dot com.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 4, "date": "2014-05-21", "type": "review"}
