{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "q7MrNVt1FE23rwtWmPYWHg", "review_id": "bgLHVU09FpJ-uEOFFor6uA", "text": "I heart King's. I've always been a fan and this one was as good as my old one in Monaca.", "business_id": "wJr6kSA5dchdgOdwH6dZ2w", "stars": 4, "date": "2012-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WzaaorVCmUTQvu4mScunNg", "review_id": "Fz5UExseCSDQc2-aQqeAGA", "text": "We stopped through the drive -thru last night after helping my sister move. It was midnight and thankfully something was open. I ordered nuggets fries and a frosty. My sister ordered the same and Bobby ordered two Jr. Bacon cheeseburgers. Well only one burger was in the bag (we found out halfway Down the road) Bobby said the other burger was dry and they forgot the mayo, & my sisters fries had no salt on them lso she says.. Mine were fine but I kept that to myself to avoid her eating some of mine. Typical older sibling.)\n\nAnyways I don't normally review fast food that I've had bad experience at bc it happens often, but totally forgetting a burger is not cool..", "business_id": "JX2gDf2uy2UGuKPpcKT-IA", "stars": 2, "date": "2015-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hlZTnXyYnSceLb7mBLTwTg", "review_id": "PLGg2EB49kq44eaQOYHTJA", "text": "Huh. Not being from Pittsburgh (just living there for six years), maybe I'm missing what makes it \"a classic.\" I ate here for a bunch of business lunches / dinners (oooh! Let's go to Tessaro's! It's a Pittsburgh Classic!) and was consistently confused. Food = fine. Atmosphere = fine. It's a solid three stars, yo.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 3, "date": "2008-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bSkco4ZdB7REFtDsJUVrDA", "review_id": "ph74ceCIn-46_8SwkYEa-A", "text": "Tessaro's definitely provides a solid burger to their patrons, and their side options are also delicious.  I got the gourmet burger, medium rare, with broccoli and cauliflower.  The veggies were excellent.  The burger was tasty as well, but it was extremely under cooked.  I know I ordered it medium rare, but I doubt it spent more than 30 seconds on the grill.  Next time I will go with Medium.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 4, "date": "2012-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-3NO_wh5syzxLGhw6Op7Ig", "review_id": "1RFBr5zmRY1EXvIk1IudCg", "text": "Good hamburger, though nothing that was so spectacular as to not be missed. They serve the burger with home fries which were very good but not my first choice for potatoes with a burger.   \n\nI did not love the bun.\n\nThe menu was very deep with more substantial food and I could not help but wonder if that would be a better place to get the best from Tessero's. \n\nThe service was great.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 3, "date": "2015-04-09", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "fKWod_kAjI3BjZm9e5A6Ag", "review_id": "CyIdiPl0mJU4jswSdZomNQ", "text": "Went for the Wings, they were interesting.  The \"regular\"  sauce had a ton of black pepper and also parmigian cheese.  They were cooked good, but the sauce was so over powered with pepper they were hard to eat.  One highlight was the hand cut french fries, they were delicious.", "business_id": "jJfTh2O3M2Q716akd9Dr9w", "stars": 3, "date": "2015-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pluf_aTM0XNqB0a3tm9k5Q", "review_id": "JOV8CNw6Rr1sqQ52eENmqw", "text": "Another Yelp Bookmarked vist!!!! I FINALLY had a chance to Visit Matt's Chicago Dogs. My fiance and I Visited during Lunch hour.....no long wait, fast service.   I ordered the Matt's Chicago Dog Combo (w/ house fries), My fiance ordered the Bratwurst......which tasted horrible. My order was Perfection!!!! Also the weather was beautiful today. Unfortunately this location is closed on Saturday's.......boooo! I hear the Deepdish pizza is DeeeeeLish! Anywho, I look forward to another visit....maybe ill try the Italian Beef!!!", "business_id": "gpCtDCSXIoQx70cq9itfNA", "stars": 4, "date": "2015-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q1tXDCoaKgyybKJxmjLgdw", "review_id": "wL9ljF4UJ0zn9ybsIYvMTA", "text": "Its 7am in the morning and i had to wake myself to write a review for this place. First they had no pan cakes though its in the menu. I ordered a platter with no sausage as i dont eat meat. They made me wait a long time and gave me a platter with sausage. The order was $9 for hash browns. Coffee. Biscuit and egg. Expensive and bad service", "business_id": "X-uPUUV7xPiKivsQzJD-wg", "stars": 1, "date": "2015-03-03", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "gJvmxoiSmWQeVIgXYHW8dQ", "review_id": "w-uGTqVZ8ox1DLMVErEqow", "text": "We went on a Friday night to start our night.\n\nWe were carded twice and they wanted to hold a credit card through our dinner!  The waitress said that was restaurant policy.  I am in my mid-30s and am way past the \"dine and dash age\".\n\nThe menu has changed dramatically since the last time we were hear.  The food selection is basically wings, burgers and pizza.  \n\nVery disappointed to be treated like a punk kid and will not be back to this establishment.  \n\nI'd suggest heading across the parking lot to Flying Saucer.", "business_id": "UUs667cl2g2SjmWcOYgCVw", "stars": 1, "date": "2010-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4G68oLRY3aHE5XUt_MUUcA", "review_id": "YkTWyRtMzmw1ftm2Imtnhg", "text": "Stopped here to get a quick sandwich before hitting the road.  I'm always skeptical of gas-station/fast food restaurant pairings since there is always a lot going on, but I got in and out okay and the food hit the spot at that particular time.  I can imagine this place gets super busy during the summer once Carowinds opens up and there is a lot more traffic coming though.", "business_id": "28YKigLZj0ooXDFVKw_qHA", "stars": 3, "date": "2011-04-04", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "nRQ6Z7k-1FBAXsit4kggBQ", "review_id": "foQw0auXV_0YpLoQyaelrw", "text": "Don't go in the Drive Thru if there are more than 3 cars. You will sit there for 20 minutes.", "business_id": "HGzdDbukK8RJEc623kLz5Q", "stars": 2, "date": "2011-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6hYwb0nsqbUIq9d-MGzY6Q", "review_id": "0RTZNYghtA8GHD4jJoK3EQ", "text": "I broke down and was craving McDonald's and wanted to check out the newly built one. Ordered the new bacon clubhouse burger. It was tasty but on the cooler side of hot. Once again though fries as bad as you can get. Cold, dried out and down right uneatable. I do like that they have coke zero even as it wasn't mixed properly. \nService, what service. No warm welcome or even a smile and it was a manager who was besides himself for having to leave his set position to help me the only customer at noon in line. \nDining room looks great new. Dirty as all hell. Looked to sit at 3 high tables and all the seats had greasy soda spots all over them. \nHow hard is it to manage a place like this. I've done it quiet successfully for many years. \nAnd yes someone can contact me if they'd like.", "business_id": "311yXufoXR2dFngMHS9MFg", "stars": 2, "date": "2014-04-18", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "GIe3fZlWKtnPXTaGqmwl-A", "review_id": "KWcM30yBOXYp-dKQ6FJNqA", "text": "This place is pretty gross.  It's dirty.  The gas station it's attached to need a massive overhaul.  The employees are sketchy-looking at best.  Have some standards, Arby's.", "business_id": "8AGIIxZ-BBHbEGsgmhOOwA", "stars": 1, "date": "2013-04-26", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "jel9UnpIGKyR78804jSyvQ", "review_id": "d-PEd2QPqmlkOrkZAikDlA", "text": "The only reason I've ever been to this hell hole is because I knew someone who worked there. You can see overweight sorority girls clumsily swinging around the \"poles\" in the back bar while attempting to get the attention of one of the bartenders and dodge the puke on the floor.\n\nOne good thing is that the drinks are RIDICULOUSLY cheap. shots are $2, pitchers can be as low as $4. I would imagine that if you went there in the afternoon you could have an enjoyable happy hour on the patio, but don't go anywhere near this place after 10.", "business_id": "1T2rnvl67Gk9Uc0gzsCKQA", "stars": 2, "date": "2009-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Iq4beW4vsrvYk2lqKpimtQ", "review_id": "R90xuhh21CsUoFsAAaqyhQ", "text": "Right across from US Airways Center in Downtown Phoenix. Nice place to go to if your in the area. Lot of signed stuff adorns the wall here, as is the case with all Hard Rock Cafe's. Nice bar, food and drinks get pricey however.", "business_id": "gkv2XvXpFgiq4Bb2XK7YmQ", "stars": 3, "date": "2012-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S88CatMm_82uQQOfAokf5A", "review_id": "85vbULnaBcgTZOyqmnnd1Q", "text": "I get double meat, double cheese, plain and dry medium meal. Everyone there is pretty friendly. Food is my favorite for fast food!! My burger is SOOOOOOO good. The fries are hit and miss. Sometimes they are hot and fresh and amazing. Sometimes they are cold and soggy.", "business_id": "ixTr1qXUFGTzyaZUuCDDvg", "stars": 4, "date": "2014-05-16", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "1D2jJIfi8S0DeZfEZpxi_g", "review_id": "cQcAsuE-goC73qdPhXLnFQ", "text": "After working in the service industry for 4 years, I understand how a restaurant is ran. Our server Brooke was horrible. Took a while to get our food order, had a horrible attitude, and very passive aggressive. After we waited over 30 mins for our food she handed out food to us purposely allowing the smoke to go in our faces. When we asked for boxes because we were upset she just said okay and walked away with out asking if anything was wrong. After waiting another 5 mins, she finally picked up the check. As she did it she snapped the book and walked away. It was also horrible seeing the way she talked to other staff members, mainly the bartender. Also hygiene was an issue. Worst service I've had ever!", "business_id": "hzUOqxpcnYYBgLlrgvjQYQ", "stars": 1, "date": "2015-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FOPR4H_FQ2qmmwVvaZBSfw", "review_id": "jM-7FLK8oS7e0RsV_Ukvlw", "text": "What's not to love about a classic dive? Do you like:\nCheap beer?\nFantastic people watching?\nDuck Pin Bowling?\nAwesome griddled burgers?\n\nSure, it's not much to look at, interior or exterior, but it's good fun all around.", "business_id": "ntJAKLAq0cXzzdFgPoo0Iw", "stars": 4, "date": "2013-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NHAoriJCtOUJf2ygp1Bh4A", "review_id": "-GIV1m4dnCCn4U6u795nAA", "text": "Just stopped in for a quick bathroom break and to buy a cold.drink. This is the cleanest McDonald's location I have seen I think.ever!  I was at the 75TH Ave and Bell Rd location yesterday and it was filthy! Bathrooms, dining room beverage station all sticky dirty hadn't been cleaned thoroughly in months. Not his location!  All stainless was shining, bathroom had just been cleaned thoroughly and smelled great? And beverage station was spotless!   Props to the manager!!", "business_id": "N-gqIeVDebI3qgwxf1jMcw", "stars": 5, "date": "2015-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ItZ5k3seIvf6K3BP2c6v4Q", "review_id": "LU8m0WS0KTr4QbHE3CL1JQ", "text": "Probably the best wings I've ever had. They're crispy and slightly barbeque charred on the outside (not messy or greasy at all) but still moist and juicy on the inside and packed with tons of flavor. Great hole in the wall spot with lots of character. Type of place common in older east coast cities, very uncommon in Phoenix.", "business_id": "qz4ZOcv-840UjfCEYI4qZg", "stars": 5, "date": "2015-05-09", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "7o7vuRkJtnnipRWw3kft8Q", "review_id": "_SPt7xZG-Wis6g_C5SJPxw", "text": "I have to begin this by saying that I am not from Chicago.  The midwest, yes, but I have only visited, but given the crowds this place packs in, I had high expectations of the dogs and the burgers.  \n\nMy boyfriend said, \"eh\" on the hamburger and I had the same opinion on the hot dog.  Nothing special and I have definitely had better - even at a roadside stand.  The service and atmosphere were great along with the prices, but I didn't feel like any of the food made me want to go back.", "business_id": "iNvY0zAlaD_ye7Z6rHu-Ug", "stars": 2, "date": "2010-04-13", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "hL_rfPuj3lqxKgFBh7yqQQ", "review_id": "RRxugZZ-hdp0pFi6V-caTg", "text": "This place reminds me of every neighborhood wiener joint and Chicagie Dinerette I have ever been to in Chicago.  The Chicago street signs, team schwag, and general Chicago schwag, the old school arcade games, simple booths - this could be anyone's Uncle Stanley's joint in Chicago! \n\nThe food is as expected - real Vienna Hotdogs, on the right buns, with seasoning, and the loud green relish.  Deep fried, tasty veggies like mushrooms and zucchini, and damn good, old school sliders that would slap the towers off of white castle.  It is quite the place for anyone missing the divey wiener huts of Chicago or trying to recapture some childhood memories for those aged 25-45. \n\nThe ambiance just makes the food so much better.", "business_id": "iNvY0zAlaD_ye7Z6rHu-Ug", "stars": 5, "date": "2013-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aUtyiipxP4wX2KjHfrZroA", "review_id": "7rdtBInw7ZHRk2kNx66dhA", "text": "Went here on my birthday for lunch the other day. There is nothing fancy I can say here at all except just REAL GOOD FOOD! I will be back when i feel like eating bad for you food.", "business_id": "iNvY0zAlaD_ye7Z6rHu-Ug", "stars": 4, "date": "2015-04-26", "type": "review"}
{"votes": {"funny": 3, "useful": 0, "cool": 1}, "user_id": "wYzOrThSYP8WwioLfsu4vQ", "review_id": "sjrU-HjmFJVaC0tzisMddA", "text": "Alright so I'm not a huge fan of Arby's. I mean, I'll eat it if it's put in front of me, but generally I find everything to be a little gooey. Weird. \n\nBUT, I gave this particular Arby's four stars for the radicalist (as in the most radical, not like a radicalist who overthrows governments and stuff) sign ever to grace the Arcadia hood. It's right up there with the great Courtesy Chevrolet sign on Camelback.\n\nAlso: they have a bell you can ring for good service! I think every Arby's has it, but I love it because people will only ring it literally AS they are running out the door.", "business_id": "i8X14GDzaYD_TOGeWjmv-A", "stars": 4, "date": "2007-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rZfRd5PXu_V7IfK32IaNxw", "review_id": "K5kYEs7RvvKvJBgjnBy79A", "text": "Not sure what all the positive reviews are for, I went here the other day and was not the least bit impressed. I heard good things about their cheesesteaks, and since I have never had a cheesesteak before I thought I'd try them out. There wasn't much meat in the sandwich, and it lacked cheese. I told them no onions and yet onions were still sprinkled throughout the sandwich.\n\nEven their salad was terrible, the ranch was runny and it didn't even have any croutons on it. The prices were kind of high and the place was extremely dirty. Will never go back again.", "business_id": "lf42gtgq_2_jPvjfp_K1nQ", "stars": 2, "date": "2011-05-27", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "rLtl8ZkDX5vH5nAx9C3q5Q", "review_id": "Sn3eFxh4S9iVDIKv090fqQ", "text": "My wife and I went here for dinner last Friday night.  Wanting a super casual dinner this place fit the bill.  We both haven't been to the Islands since our college days when it was on Mill.  Turns out not much has changed.  This place still churns out some decent burgers at reasonable prices.  We each got a burger, shared a salad and a basket of fries.  Everything was quite good but the fries are awesome.  You really can't beat a bottomless basket of awesome fries for like $3 even-though we didn't come close to finishing it.\n\nAside from the fries being delicious, I like it that each of their beef burger selections can also be ordered as a turkey burger.  I didn't order my burger this way but my wife did and she said it was very good.\n\nAnother thing to note is the service.  I thought it was excellent.  Our waitress was very friendly, helpful and fast.  My diet coke refills arrived faster than I could drink them and that is a definite plus.\n\nIn my opinion this place is on top of their game in terms of service and food and is a solid burger place in my book.", "business_id": "hNVcBhJSD5HyLKMf_Z7TaA", "stars": 4, "date": "2011-04-04", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 3}, "user_id": "y7sq26EXGz7XG7DSo8TOuQ", "review_id": "AqExhpZPnMDnZxFKALx7rg", "text": "So one lonely night... OK wait... it wasn't lonely...\n\nI was at a friends house...\n\nAnd we were playing Mario Kart on the Wii (very fun BTW).\n\nWe got a craving for chili dogs (and no we weren't smoking!)\n\nSo, we headed out to Sonic, since that was the only place we knew that would have chili dogs at 10pm. We pulled up, looked at the menu and went... MEEEHHH...\n\nSo I wipped out my phone and opened Yelp and did a search for \"chili dogs\" and up popped up Mim's.\n\nWe pulled up and I'll be honest... the place was looking downright shady. If someone discharged a gun while we sat there, I don't think I would have been too surprised (this was late at night and the only thing that illuminated the weird colored building was one flickering street lamp). My friend looked over to me and was like \"are you SURE this is the place??????\" with a bewildered look on his face. I was like, yep, sure is! Just then, someone walked out looking normal and unmugged (I guess). I said, well, let me tell you this... 11 people reviewed this place and it still maintains a 4.5 star rating. It can't be that bad!\n\nSo we went in.\n\nBoy was this place awesome! The menus is just outrageous. It has things on the menu that I've never seen before. It is a bit messy with things crossed out and white-out'd. But as another poster mentioned, it smelled good in there. Like, back home cooking where people made stuff from scratch, not ripped it out of a prepackaged box and  tossed it on a grill for 30 seconds.\n\nBONUS! The place has old pinball machines and arcade games! HOLY HELL this is freaking badass! I'm actually glad the food took a while to make because it gave us a chance to be little schoolboys from 1986 and cram quarters and get our fix in! \n\nSeriously cool and I will be back for more chili dogs and bologna and BBQ bologna sandwiches!", "business_id": "-b_VjHZmA7-8LVWp6z36VA", "stars": 5, "date": "2011-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "k5bDN0HquYYiScd5Tz41Pg", "review_id": "99e5mTk9sAp_VKYDvrPLUw", "text": "Great location; friendly staff. Nothing above and beyond to report.", "business_id": "M0a0UNYie0vmrDxY5r2yjA", "stars": 3, "date": "2012-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e8DXpXcwOPdP25hG2IGwog", "review_id": "2nwX4_2Oet27aaSE43BKhw", "text": "Only knocked off one star because the service can be sometimes slow. Besides that i'm surprised this place has been open for such a long time. In a good way I'm saying. The restaurant has classic american meals and everything i've had here over the years has been great. I definitely recommend coming here if your eating out on a budget, it's great for large groups too.", "business_id": "e0vubCKi8KD8zC2C6FdbuQ", "stars": 4, "date": "2014-04-03", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "2FiNCj5rM3nF0qgaWf86Gg", "review_id": "vqzUgHzM6m5dZ-FxhKmvzw", "text": "I really don't understand what the big deal is about this place. The burgers are decent for a fast food restaurant, but nothing to write home about. \n\nPerhaps In-N-Out Burger is better in other states or something. \n\nTo me it was a step up from McDonald's and a step down from 5 & Diner.", "business_id": "byFWmwlVSmUj-AmM6NZYvw", "stars": 2, "date": "2009-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QxwmNjek_o2hTYwZww3LAQ", "review_id": "TTEvXTW3S0ROSAdBMxt4eg", "text": "Oh, how I miss this place!  This was our favorite place to eat in Phoenix.  They give you huge portions for really cheap. They aren't jerks about substitutions or special orders.  Just lots of normal greasy food.  They serve breakfast all day.  If you just order a salad, the salads are bigger than your head and they give you a whole bowl full of dressing.  I had the chef salad all the time.\n\nSome of the waitresses are a little kooky, but you soon figure out which servers to ask for.  Jeremy was a great waiter if he's still there.  He'd see us coming in and grab a high chair and find us a table before the hostess even saw us.  Jeremy seems to make it a point to go the extra mile for his regulars. He remembers what they always drink, what they usually like to order, their special requests, their kids names.  That guy earns his tips.  He is on the ball.  The little old lady with the thick accent is slow but she's a nice little old lady.  One of the waitresses with dyed hair is a bit too chatty and we avoided sitting in her section whenever possible.  She's definitely weird but totally harmless I promise!  \n\nIf you're all high class don't bother with this place, you won't like it.  If you want normal food for cheap and you want to be full when you leave, this is the place to go.  We would generally try to go when they weren't crazy busy though because the wait can be long sometimes.  Like when the after church crowd gets there.\n\nThe decor is loud and smart alecky.  The food is normal diner food.  It is the kind of place that has a lot of \"regulars\" that go there all the time including a lot of older folks.  And if you become regulars like we did, they get to know you and you get to know them and the place really grows on you.", "business_id": "iAYzRvyBrSkJDu_XZ-E1zQ", "stars": 4, "date": "2011-03-23", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 4}, "user_id": "90a6z--_CUrl84aCzZyPsg", "review_id": "DWjhaTipuKKj3xXoKu9Gdg", "text": "One of the best fast-food burgers out there - You gotta try the jalapeño bacon double whataburger with cheese. Holy crap!", "business_id": "2qf-0qkDNh7r8iU0498htQ", "stars": 4, "date": "2011-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9X3tFqOcNgA56QSqTQBDYw", "review_id": "Kp0pDpb8nWwQBW0qMTRjmg", "text": "SOOO GOOD! Their grilled cheese is the best! - on sourdough bread. The workers are super nice too. and their milkshakes are delish !", "business_id": "AoO0FJyUm01lmIJJTcPWEQ", "stars": 5, "date": "2010-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "gvEg0mm54TFbeTfkHput9Q", "review_id": "QEmZKd7PDqPP5gHFOVucFQ", "text": "Really good burgers, I mean best burgers around. The staff are really nice and friendly. I haven't tried anything here I don't love. Food is fresh and authentic stuff. Delicious pies too.\nBut the place can get over packed during breakfast rush or even during lunch time. The place is small and a bit divey but we always gravitate towards it when thinking burgers. Lol", "business_id": "AoO0FJyUm01lmIJJTcPWEQ", "stars": 4, "date": "2015-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GPI930zIvXhi5I0gvkAa7Q", "review_id": "5ZLZYHX30LRz25-E4GqFIQ", "text": "Red Robin is one of those places that takes me back to my childhood. Growing up in the Seattle area, it was one of those fun places that we always went for birthdays or just special nights out. It was a real treat to go to the original location and when I turned 21, my girlfriends and I found ourselves sitting out on the Seattle waterfront far too often.\n\nFast forward to 2013...when did this place get so freaking expensive?! I'm not sure why I am surprised, but I am. Just like every other mediocre chain restaurant, prices go up, service and quality go down. I'm left with serious eating remorse and I'm kicking myself for dropping $45 on a meal last night that could have been spent in one of our far superior local establishments.\n\nI have been getting the Bleu Ribbon Burger since it was introduced to the menu years ago, but last night I didn't feel like spending $10.79 on one burger so I went with the Patty Melt. It was good enough, and I was pleased. I do love the Red Robin fries and I'm a sucker for their honey mustard. I finished my basket of food and I was actually pretty full. Maybe I didn't need that big burger after all.\n\nMy husband had the Veggie Burger. Kids had the Pizza and the Mac and Cheese. No complaints.\n\nOur waitress was nice and fairly attentive. It wasn't busy and we were seated right away. Drinks took longer than usual to come out but that's because our waitress dropped my husband's beer. No big deal, accidents happen. I had a good view of the kitchen and watched one worker stand around and play on his phone for a good chunk of time we were there. (Employees on their cell phones while working really irks me). We were seated under the air conditioning so it was really cold. (Someone once told me that keeping a restaurant really cold was a way to move people out quicker. Not sure if that's what they were going for, but it's always on my radar now.)\n\nI'd like to say that I have learned my lesson, but I'm sure I will be back because my memories of the past always seem to win.", "business_id": "-GYx5GAx_-4XEsn7mFwdkA", "stars": 3, "date": "2013-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mbdzfuF7OzQ6Cnqqs4o5RQ", "review_id": "MgWLmMFrvJd08Kv4m2Ho1Q", "text": "The biggest and best burgers I have tasted, wish they had a juicy lucy (cheese stuffed burger) on their menu!", "business_id": "-h1WpfgqAmJcJDqyXXJ2og", "stars": 5, "date": "2015-03-04", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "48DXrpTDt2OOpLt-9rsFoA", "review_id": "fb_wz0H8QRmYWfmA5WU54Q", "text": "I do everything I can to avoid this place - but the little one likes the chicken nuggets so [we] go when there's a need.  Service continues to deteriorate.  If there is a school night there - forget it.  They can't keep up with whose order is whose, the staff is not prepared for that load.  They never get orders right so I constantly have to appeal to a child who doesn't like mustard on their hamburger.  They are so ghetto - they give old toys in their happy meals - really?!  Like my kid is stupid and doesn't know what it is supposed to be thanks to ads, signage, and what not.  Please do yourself a favor and do not go to this McD.", "business_id": "z6V7Mb0fjHo_JT3l7dCKsA", "stars": 1, "date": "2014-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V0F6ChBpYGdGbqUOE9LdNQ", "review_id": "hP4IHyO_fW1jlcWcHLs0Vg", "text": "I love their garden burgers.  Did u know u can substitute with a garden burger for any of their gourmet designer burgers?  And can't say enough about all u can eat fries !  Normally I don't go for flavored teas, but I'm addicted to the pomegranate tea.  Very flavorable and just a little bit tart, really refreshing. And the staff are all very friendly and super professional.", "business_id": "zoHCkEiIKfXiLTKUqKEojQ", "stars": 5, "date": "2014-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "DRO4k85yzi5cvsqWGuTXVg", "review_id": "hoq79kbSUqOEugnPkRLO9g", "text": "I love Teakwoods!! The wings are awesome and I will not eat any others.  It is a great place to pop in and have a quick beer after work or on the weekend, or really anytime.", "business_id": "7-4FxYXhNUS2lhpUb_q5-w", "stars": 5, "date": "2010-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IFxoYaEfGAHtsRWjI5BSSA", "review_id": "6LGQCzb31AFsY2GLX7xWDQ", "text": "I too, have been a customer of Teakwoods for 15 years or more.  I used to frequent the restaurant more often before the gang shooting at the establishment in 2007.  First off, you cannot beat shelled peanuts that you are allowed to throw on the floor...I've always thought that was very cool.  The food has changed over the years, but they still do some pretty great bar and grill grub.  Their shoestring fries with hot cheese is to die for.  So are their wings, onion rings, fried zucchini, soft baked pretzels, and Chicken Jack (Not Jill) sandwiches. The atmosphere has changed over the years, as well as the service and attitude.  It's kind of hit or miss now.  You might get both great food and service, but it's a 50-50 shot that the service or food might be sub par.  I still love the place for nostalgic purposes, but it's changed quite a bit through the years.", "business_id": "7-4FxYXhNUS2lhpUb_q5-w", "stars": 3, "date": "2014-03-10", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "A9nmuN17y_9bNiCvXhU4Ow", "review_id": "ILnIgRZUCR_BZ48EESbJYw", "text": "AVOID THIS PLACE and save your money! Went there 3/1/2014 with my 2 kids and had a horrible experience. Far from family friendly. We also took a certificate from restaurant.com since they say they accept them and they refused to take it from us. The food is 100% greasy food and way over priced. Find another place and save your money so that you are not disappointed and waste your hard earned money!", "business_id": "kNINeBoMawMbQd5cEEjmHQ", "stars": 1, "date": "2014-03-04", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 3}, "user_id": "y3d4v0x-vD10hw-O0YKa1Q", "review_id": "ziR-wx_CGfXCnVkOw6LjWg", "text": "One of the things that I don't understand about people is why they wait in line at all of those chain restaurants for crappy food, when they can go to a locally owned restaurant such as Flancer's and get awesome food, excellent prices, and hardly a wait at all!\n\nFlancer's makes pizza, pasta, and sandwiches very well!  Unfortunately we live about 20 miles away so we can't get there often, but when we do, we always order the same thing!  Oh, don't you hate people like that?  It's just that the dish is so good, I just crave it!  \n\nMy husband always orders a hamburger.  This is not your ordinary hamburger, this is the best that money can buy.  Fresh quality beef, cooked medium well, on a homemade, soft and chewy roll.  \n\nThe roll is more like a sub roll than a hamburger roll and they make their hamburgers oblong.  To add to that you've got to get the fresh french fries.  Nothing frozen here.  The hamburger is so flavorful it melts in your mouth.\n\nBut I think my meal is best.  I order the half sandwich and salad.  I am in love with Flancer's \"We Must Meat, I Ain't Lion\" sandwich.  It's grilled Filet Mignon, medium rare, topped with Gorgonzola cheese, chipotle mayonnaise & caramelized onions.  Mmmm.  Add to that a small Greek salad with Balsamic vinaigrette and it's a perfect meal.  Wait,. it's even more perfect if you add Flancer's famous creme brulee for desert!\n\nFlancer's is a fantastic place.  The servers treat us like family, the atmosphere is cozy and comfortable, and the food rocks.  Don't wait in line for the yucky stuff.  Go to a local chef-owned restaurant like Flancer's.  You'll be hooked!", "business_id": "JMOK_Sy6aSOZwd4qgkX7hg", "stars": 5, "date": "2009-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1P8Cojr9yGhVfzvF2j9fCA", "review_id": "xmHgzmpX4Lk23ASdyhMwPw", "text": "One of my favorite places! Amazing subs, love the Hatch green chile on the burger, filet mignon sandwich, the bread is amazing. Cool place and staff - have to check it out!", "business_id": "JMOK_Sy6aSOZwd4qgkX7hg", "stars": 5, "date": "2011-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RGbAaqnIfqDu9lU8WB5ILw", "review_id": "6M1NHyadvzpCPTqd5PzARw", "text": "Went to enjoy an afternoon in downtown Gilbert and decided to take the kids for pizza. What a disappointment! They were having a pizza eating competition and gave me a two seat table for three. I had to stand to eat. Then I watched the competition. Wow, what a fraud! The guy who really won has his integrity called into play because a plate was too clean. Wow what a management decision, or lack thereof. This guys plates were spotless while others were filled with scraps and stuff on the floor. The other guys were still eating after the time was over, and they counted it. I could keep going, Jimmy the uneducated creep. I suggest going to someplace else where the management spends less time creepily hitting on Miss Arizona and more time making the customers number one!", "business_id": "JMOK_Sy6aSOZwd4qgkX7hg", "stars": 1, "date": "2013-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3KY7fBgmu8snvQYi3MFohg", "review_id": "POVJKaxl9Wxc-Sq_ucCQtQ", "text": "I could not believe how great all of the food was!  Try the fondue fo sho!  The green chili actually had some awesome heat.  This place is a must try.  Can't wait to go back!", "business_id": "JMOK_Sy6aSOZwd4qgkX7hg", "stars": 5, "date": "2015-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GwAz5wauDEIJUvyaCpghJw", "review_id": "-FYBPW_plledv-9sc2rrYw", "text": "This is one of my preferred sports bar hangouts during football season.  Always great service, and good food.  I enjoy the fact the feature a new beer on tap each month.", "business_id": "_TWT58PWunYIyPgpz1fuog", "stars": 4, "date": "2015-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QzA6ZW1NFid32_g_fsapIg", "review_id": "HiWJWdQBGTccEqlDILRcCQ", "text": "Their glassware and utensils always smell. I can't put my finger on it but they smell bad. We have tried to eat at this location a few times but always end up making the trek to the Red Robin on Mayo.", "business_id": "AgJbkqR-wre409if4fTbWQ", "stars": 1, "date": "2010-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Fn1TcGL9VGsPhAXT_nmRcg", "review_id": "Bnz2s4KhVoeyqlTjqKm_qg", "text": "Haven't been here in sometime, but the meal works for a chain restaurant. .. But  But you can't beat the  bottomless fries ... \nPaige is a great server!", "business_id": "AgJbkqR-wre409if4fTbWQ", "stars": 3, "date": "2015-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uZbTb-u-GVjTa2gtQfry5g", "review_id": "pdvSo8eP8OgAhezRbJtuyw", "text": "This is a newer McDonald's, which is designed with a more contemporary feel. There's a large indoor playground for your kids too. Service was quite sluggish though.\n\nDespite the wait, this will be forever in my memory be the first McDonald's where I tried a shamrock shake (Minty creamy sweet delicious!).", "business_id": "4XVECNP7u2WBr2us6yTS1w", "stars": 3, "date": "2014-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wZ2AaoY2EJNKH4aMdnauhg", "review_id": "jSgNHTvFF88zL9t_zdsjrw", "text": "Try to find a better hotdog in AZ!   If you are feeling it, try their white hot dogs.   Hard to find and absolutely worth seeking out.    Just like upstate NY.", "business_id": "jJhNOhuGpIsJX5SEUFFWYQ", "stars": 5, "date": "2009-03-14", "type": "review"}
{"votes": {"funny": 1, "useful": 6, "cool": 4}, "user_id": "XY_bQqhZfyyEi_W5n4kQNg", "review_id": "A2fpiFbT8HtwwsENElhXDg", "text": "AAAAMAZING.\nThey have the best hot dogs and corn dogs i have ever had.  It is definitely a place to try if you love hot dogs.\nThey have good fries, excellent onion rings.... and very very reasonable prices!  I have never met a single person who has said anything but incredible things about Ted's..... definitely a must try!", "business_id": "jJhNOhuGpIsJX5SEUFFWYQ", "stars": 5, "date": "2010-04-24", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "DfJ8B8T1fgNA6_ZT-aeUlQ", "review_id": "HOOzUhflCefvBUJEDOHtpQ", "text": "With a line already at the door, one knows Ted's serves up some mighty yummy dogs. In addition, their \"white hots\" are fab, as well as their burgers. \nI'm not keen on their fries or onion rings, but that is just my personal taste...they are both fresh and the rings are home made.\nThe flavor of Ted's hotdogs are unmatched. \nGo!", "business_id": "jJhNOhuGpIsJX5SEUFFWYQ", "stars": 5, "date": "2012-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IE9wmWPGWx97VehtlRmKKQ", "review_id": "2iWdKK3oVhyzrxgkDU7yGQ", "text": "Ted's is where you go for hot dogs in the valley.\n\nThat would be a perfectly acceptable review of Ted's Fine Perfectly Charred Spectacularly Plump And Juicy Hot Dogs and (unfortunately) indicative of their shortcomings as well.\n\nTed's certainly has the best dogs in the area. The All Beef and Polish are out of this world, with the Foot Long and White Hots being entirely acceptable as well. The dogs are charred with precision and crackle in your mouth the way few can. If I spent hours trying to reveal a shortcoming in the dogs at Ted's, I would come up empty; they are defiantly tasty.\n\nSo it's an absolute shame that nothing else on the menu is remarkable. The onion rings, fries, and chili are all passable items with nothing terrible to note. All are slightly between the descriptors 'bland' and 'your married friend's backyard party that wasn't awful but wasn't good either.' Even the lauded Loganberry shake tastes of awkwardly assembled syrup and soft-serve with no real heart to it. All of the sides pale even further when you return your attention to the marvelous hot dog in your hand.\n\nSo just get two hot dogs and Ted's might just be perfect.", "business_id": "jJhNOhuGpIsJX5SEUFFWYQ", "stars": 4, "date": "2013-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "25K0vsGv8N6JKpvWbWepUQ", "review_id": "k4PJ81L8z56Z913LqQBkpw", "text": "Sooo yummy, a little high in price but it's worth it. The food is always fresh & fast. The decor makes me feel like I'm not in AZ anymore :)", "business_id": "jJhNOhuGpIsJX5SEUFFWYQ", "stars": 4, "date": "2015-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "axGqGci1k7Vzfc1rgPoiwg", "review_id": "CUJui7YoNzH-rH3MP8kqyg", "text": "Very good charcoal grilled dogs. I'm not normally a hot dog kind of person, but Ted's is different! \n\nI got the chillie and cheese dog and I was very satisfied.\n\nI also like how they make the dogs in front of you. They ask what you want again as soon as the dog is cooked so no messing up your order.\n\nTed's is definitely my first choice for a good hot dog.\nI have yet to try their mac n cheese dog!", "business_id": "jJhNOhuGpIsJX5SEUFFWYQ", "stars": 5, "date": "2015-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "76tMc4bACDz08oDH3rCc4Q", "review_id": "Pd9SpYVKobHUDTtfNH8JLA", "text": "All the Applebee's are closing without notice.  This is the 3rd Applebee's we have been to today that wasn't out of business! The biggest complaint is BRING A SWEATSHIRT!! Every Applebee's is always cold.  To the point of uncomfort! Food and drinks are always good and prices are reasonable.  Don't know why they are all closing!", "business_id": "9pGs5hcA-13x5o97XcMt_g", "stars": 2, "date": "2015-03-15", "type": "review"}
