{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-ABN25vFRZVWPhZS2uO2gQ", "review_id": "2jMjo4BW8uu2wqmSUhmlxQ", "text": "If it wasn't for the Chicken Hoagies (Banh-Mi Ga) they sell outside on Saturday and Sunday Mornings(This is the only time I think you can get it)...I wouldn't even bother wanting to revisit the experience we had at this place.\n\nSo on the day we were craving the Banh-Mi Ga, the stand was not outside selling the Banh-Mi. We decided to go in and see if they sold the Banh-Mi inside. The waiter told us that the lady who sells the Banh-Mi only sell the Banh-Mi outside. The Restaurant Kitchen does not make them.\n\nSo we ordered the Pho and Vermicelli...BIG MISTAKE! How is it possible that you can make something that is supposed to taste SOOO Good...Taste SOOO BAD? My Ngoc knows the answer.\n\nGIVING THREE STARS for the BANH-MI....BUT....DON'T GO INSIDE! BE WARNED!", "business_id": "GQloL8yRHymE0SGZq-B0zQ", "stars": 3, "date": "2009-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "0xIQG-NrqMx5id6yJpQp8Q", "review_id": "OvV8jH8hJrT2BWAZPmCi4Q", "text": "My Ngoc had an apparent makeover and is currently under new management.  The claim to their reputation though was Lucy Sheets who used to sell banh mi outside their store.  Banh mi is a Vietnamese sandwich that is a French baguette with a sort of meat filling, pickled carrots and daikon, cilantro, jalapenos, and mayo.  Traditionally they also have pate, but the ones at My Ngoc don't have it.\n\nUnfortunately, the new owner informed me that Lucy has moved and set up shop in NYC.  However, they still do sell tasty roast pork or chicken banh mi.\n\nA warm French baguette is filled with the meat of choice and topped with the tasty ingredients.  The heat of the jalapenos are cooled by the pickled vegetables and the mayo helps bring all the ingredients together.  By Pittsburgh standards, it's worthy of 4 stars easy.  \n\nOn the other hand, their pho has much room for improvement.  The broth wasn't as savory and flavorful as I've had elsewhere and the noodles were a bit on the tougher side.\n\nA banh mi will run you $5-$6, which is definitely on the pricier side given it's size, but as a niche food in a small market, I'm definitely not complaining if I need my banh mi fix.  For pho though, I'd head elsewhere for now.", "business_id": "GQloL8yRHymE0SGZq-B0zQ", "stars": 3, "date": "2010-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ks8BGrByOuyI_XSd2pULYQ", "review_id": "w0NsYu72tKquZq9k_7wxMw", "text": "Forget Subway - here's where I'll get my 5-dollar footlong. The Banh Mi outside is all I ever do here, so I can't say much for the inside. \n\nThe new owner made my sandwich. He emphasized that he uses clean gloves!\n\nHe uses either roast pork or chicken, and the usual fixings - good pickled carrot and daikon, sprigs of parsley, a few sauces, and jalapenos if desired, all on a decent French-style roll.", "business_id": "GQloL8yRHymE0SGZq-B0zQ", "stars": 4, "date": "2010-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-ABN25vFRZVWPhZS2uO2gQ", "review_id": "ZVjUa65eS9yQfIV5bJTa0A", "text": "If you want PHO in Pittsburgh (Considering the Vietnamese Restaurant selections) I would choose this Place over Tram's Kitchen. The Pho here is more fragrant.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 3, "date": "2009-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "N4hVY8sSozJ1EIUnxL0_Sg", "review_id": "PXZJDu6E8RGYSNJ5XUEQpQ", "text": "Best pho noodle place in pittsburgh !!", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 5, "date": "2010-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "F5WW6egmmUrIWRI_ZNpbEA", "review_id": "EVbiOP1k_VQG0d0hJEJEWA", "text": "This is my favorite type of restaurant, regardless of cuisine; namely, a family run institution with great food, friendly service and an almost complete disinterest in spiffing up the surroundings. Yes, Pho Minh is a bit divey, and I relish this quality. The pho is great, as are all of the dishes I've tried here. I also have a deep appreciation for restaurants that do one cuisine and do it well...none of this Thai/Vietnamese/Japanese combo that only serves to confuse the diner as well as, often, the kitchen. Between this place and Tram's down the street, Pho Minh is my favorite. Pittsburgh has a woeful dearth of good restaurants...I'll try not to go on too much about that in my reviews, as I don't want your eyes to glaze over...so this is a destination restaurant for us. There are very few things more satisfying than a deep bowl of pho on a cold winter day.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 4, "date": "2011-03-29", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "UiSbtYgqi1AVf0yrakaHvg", "review_id": "UQ8lGqhnQkxtCPZTG0CMHQ", "text": "Tram's has better *ahem* \"atmosphere\".  Pho Minh has better Pho.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 4, "date": "2011-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "L6y73vaWaSvqYUKq6Rsr2w", "review_id": "zXm2psQYMpcsp1I2jGaexQ", "text": "I'm a big fan of Pho and this is the best in Pittsburgh. The papaya salad is also outstanding. The meat and rice dishes are tasty and the spring rolls are delicious. I can't wait to go back.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 5, "date": "2011-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zfTE5dpFjlXUVdjPkrQOnA", "review_id": "PDBG6DWxYOK2u3BMiiOJsg", "text": "The last review I read said Tram's has better atmosphere. Funny that I ended up at Pho Minh for the second time because Trams had kitchen violations and was shut down. Both times , the food was perfect. We started with the spring rolls, served cold with a nutty fish sauce - deelish. We then ordered the rice pancakes, which were loaded with shrimp and tofu. Lettuce cilantro and basil on the side, all fresh and graciously served. I tried spicy beef over lemongrass. The spice and citrus were a perfect combination. The portions are plentiful and all the entrees were priced under 9$. Highly recommended. One tip-they only take cash. Love this place and hope to add it to the regular rotation of Pgh dining!", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 4, "date": "2012-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "Iimwemgu-fH8b5UaDrOhuw", "review_id": "2mCsx9ONNjyt7hEdiqbyvA", "text": "Just to reiterate:  Cash only, you've been warned.\n\nNow on to the important stuff:  Good, no-nonsense, warming pho (and bun also on the menu.)  Many different meat combos to choose from, though I am partial to flank steak and brisket.  Pho is in the name of the restaurant, and it's the main star of the show here. \n\nLemongrass tofu is wonderful as an appetizer and upon sitting down you are presented with a nice warm pot of tea.  The ambiance is no-nonsense and the Vietnamese ballads playing on the background transported me to far off lands.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 4, "date": "2013-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZqKg4O7EXci7SR_UUS2J_g", "review_id": "rBGAcj82p09KFr6FngxcRA", "text": "I'll start with the \"bad\" stuff - the place is a small hole-in-the-wall, in an area that, at some times of day, may make you double-check that you locked your car. The restaurant is not the cleanest, nor is the menu the most extensive. HOWEVER...having traveled to Vietnam, and having been to a wide variety of Vietnamese restaurants around the US, this is certainly one of the most authentic. In fact, it reminds me of being in Vietnam. Are the spices on point? Yes! Delicious bowls of soup that should leave you with enough to bring home? Check! A couple cobwebs in the corner? Most definitely! An experience, to be sure. The place was about deserted on a Monday at lunch time, which was great for us - we got a window seat!\n\nWe started our meal with tea - this was your basic tea, nothing to write home about. We added on the spring roll with shrimp - and it was obviously freshly handmade to our order. Great appetizer to begin with - it's my barometer of a Vietnamese restaurant. This was a good one, not the best I've ever had, but quite tasty. I followed this up with a green papaya salad - heavy on the fish sauce (yum!) and covered in shrimp and peanuts. Very refreshing and light. My friend ordered the chicken curry with yam, which was creamy, freshly made (the veggies were not overcooked, as you find most places that premake lots of food) and not too spicy. I ordered the spicy vegetable soup with mushrooms. I'm not your average diner, and I like my spicy foods VERY spicy. This was maybe a 1-2/10. Pretty disappointing to me, but luckily the table was equipped with homemade Sriracha-like sauce and the ubiquitous chili-in-oil sauce found in cafes all over Vietnam. This solved the problem. The soup was fresh and filling. I will certainly be back again. There were tons of menu items I am dying to try!", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 4, "date": "2013-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lB5XfOncWEzPPLx1x8XjhQ", "review_id": "69toKJZdlPNIhHr2Nm37ew", "text": "I am convinced this place has the best Pho in Pittsburgh the spring rolls are really good too. The space sure isn't fancy but the owners are friendly and attentive. It is the best pittsburgh has to offer for Vietnamese food", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 5, "date": "2015-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LhDkoPSvZE5D-eBr2_zIew", "review_id": "OTDiSAuRnRwDjOTNW2shPw", "text": "I probably should've tried the pho but unfortunately I got the lemongrass beef with rice and I was not impressed. In fact I was quite disappointed. It also seemed expensive ($8) for quantity and quality of the dish. Based on all the other reviews, probably safe to stick to pho.", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 2, "date": "2015-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PwgNaQDdr_FKRO14CRwotg", "review_id": "5rzexdfw3zUAn8o6xZtZqQ", "text": "This place is totally off the beaten path, but well worth it. Prices are awesome, and the food is tasty. Get the spring rolls. \n\nI ordered the #25 chicken soup with glass noodles and was pleased with it . The service is not great, nor are the restroom facilities, and I had to ask the restaurant constantly for any type of service at our table, but the food was good and done right. The chicken was slightly dry, but I'd definitley give this place another chance. \n\nBYOB!", "business_id": "uBW3PIKqc-_eyG1_vdJn1w", "stars": 3, "date": "2015-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w0e1FBoD6IZhWoKtFZ8g0w", "review_id": "unDxj7ruyn-ZOPvIfFWTSw", "text": "Small menu, decor is barely passible, but the food is excellent. Has been getting more expensive over the years but probably one of the best vietnamese places in Pgh.  I always get the fried tofu and the chicken salad (goi ga). Shrimp curry is good too.  The place is run by a single family.  Waiter (one armed man) is a little short at times (my wife claims that he is always nicer to me than to him. She calls him the \"food nazi\") but he is much better when the place is not so packed.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2007-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aOzBn4odxhH4r7MoR8EEtA", "review_id": "1bap_kIm3T1JLrPVU56nVw", "text": "When I moved from San Diego to Pittsburgh, I thought I had given up pho for good.  I tried it once at Lulu's but was almost offended that they tried to pass their soup off as pho.\n\nThen I tried Tram's, a little hole in the wall place on Penn.  Their generously portioned pho was unbelievably tasty, and though I had stopped eating huge portions of food, there was no way I was going let even an ounce of it go to waste.\n\nNow I daydream about the place.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2007-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "d7W8pfj3LCy7mf9C23kITw", "review_id": "WtmfbdB9NHcBKWJCYXFSgw", "text": "Oh Tram's.\n\nThis place is incredible.  Some of the worst atmosphere you'll find, but just about the best food in Pittsburgh.  If you like pho, you will love Tram's.  If you have never had pho, go to Tram's.  You'll fall in love.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2009-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "d7W8pfj3LCy7mf9C23kITw", "review_id": "GNoIYxnRx6fLSvtLDEO2bA", "text": "Tram's has slipped a bit!  I went a few days ago, and their broth, which is normally super savory, was less so.  Still, I tried the spring rolls this time and they were freakin' good.\n\nStill yummy, but no longer the best pho I've ever had.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 3, "date": "2009-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "BOcojc9Sjk5p8MIcU681eQ", "review_id": "F0xabrw9rDkdmsl5aNOUKA", "text": "great place.  great food.  perfect spice level and it doesn't interfere with the flavor.  had an everything bowl with vermicelli and some egg rolls.  very good.  quick for lunch too.   excellent pricing.  cant wait to eat here again.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2009-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7ffOjgAG5au2IyZGLajsmg", "review_id": "893Kb3XazHp4x-GUU37v5g", "text": "Pittsburgh doesn't have many Vietnamese options. Tram's Kitchen is the only place I've ever heard people mentioning. Today I've finally visited it. \n\nFirst impression: solid pho.  The soup had a good flavor, though the portion is a little small. I was disappointed that they did not have tripe or tendon, but the beef was cut thinly. The menu selection is not terribly wide, but they seem at least competent with what they do have to offer. \n\nEfficient family service. Simple ambiance. Dinner under $15.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 3, "date": "2009-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-ABN25vFRZVWPhZS2uO2gQ", "review_id": "Zz1yRgti5KFultrzvqD8Tw", "text": "If you have been to any other PHO restaurant, in any other city, Tram's Kitchen would be OUT OF BUSINESS! \n\nFor starters, the portion of the PHO is extremely SKIMPY! I don't think we have had such a small portion of PHO since we were Babies! Seriously, would it kill you to add more rice noodles? \n\nSince we had the PHO as our Appetizers, we then ordered the Seafood Pan Fried Noodles...Oh wait...we paid for Seafood...but all we got were vegetables and some imitation they call seafood. What a Joke! \n\nSuggestion if you plan on going here. Come FULL and just order the Spring Roll.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 1, "date": "2009-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_UOzP4r4Jwf35VNQ-hTGxg", "review_id": "UyRsD63haG7Vo-2khSe_0w", "text": "The Pho was so good. The perfect balance of ingredients. Who knew PGH had good Vietnamese food.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2009-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "57tPrvg7i2R3QjsxTiY-Xg", "review_id": "zxA27VU_wE1H2n-wQEyrng", "text": "Good place to find Pho in Pittsburgh, Pho-real!  It's messy/dirty.  That doesn't bother me.  I've had better Pho.  I've had better service.  But it's not horrible.  And I would definately eat there again!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 3, "date": "2010-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0xIQG-NrqMx5id6yJpQp8Q", "review_id": "G5xHSib2MKA1sXrhNe9d3A", "text": "For many people in Pittsburgh, Tram's is the only place to be to get pho.  For me though, whenever I go, I always leave disappointed wanting more.  Their saving grace?  Their spring rolls are easily some of the best of the Vietnamese variety in the area.\n\nI find their pho to have small portions and to be of inconsistent quality.  If the I find the broth is good, they might ruin it by dumping a good 6 shakes of black pepper all over everything before they serve it (wtf?).  Other times, they might serve beef cooked well done as opposed to the rare which I prefer.  Or maybe they will give me my beef rare, except the broth will be so lukewarm that zero residual heat passes on to the beef.\n\nTheir spring rolls though are good.  Fresh and wrapped tightly, they help make the long wait time it takes for pho to be brought out more manageable.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 3, "date": "2010-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J-RKh7MlcdvR2WA9OrAFsQ", "review_id": "C6Vnm5JOxRMGCOQj1ToK9g", "text": "I didn't care too much for the atmosphere because most hole in the wall sort of restaurant are authentic & non-Americanized (which is what I'm looking for).  Location of the restaurant was in a run down (kind of Old Pittsburgh style) and parallel parking was a must, be aware that you may have to park far and walk to the restaurant if you're not able to get front door service.  Inside I didn't expect much, tablecloths were vinyl and chairs with uneven stands.  All I care about was the authenticity of the food & cost for what it's worth.\n\nI started my meal with an appetizer of Goi Cuon with shrimp.  I was highly disappointing when disecting what was in it.  There was 1 shrimp cut in half lengthwise, mainly bun (rice noodle) for fillers along with a few strands of beansprouts & lettuce to make it look presentable.  I quickly devoured the tiny appetizer in 2 bites.  My main entree was Pho Ha Noi.  It took forever for the food to arrive, it was a big bowl.  Until I stirred it around to find out it was mainly broth and green onions.  The broth was flavorless, actually it didn't have any flavor; so I had to add hoisin sause to give it a little of whatever to go along with the sliced pork.  I was confused about the noodle itself, Pho is usually served with flat vermicelli noodle; but this Pho Ha Noi was served with round vermicelli noodles usually for Bun Bo entree.  I asked the old man with the amputated arm, why it was served with bun (round rice noodle) instead of pho (flat rice noodle) noodles, he laughed and insisted it was pho (flat rice noodle).  Ok I may be young but I wasnt born yesterday, I think I know my pho noodle and sorry it wasn't.  \n\nNext visit to the 'burgh, I think I'll try Pho Minh & see how their PHO compares to Tram's Kitchen.  So HIGHLY disappointed with my Pho experience.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 1, "date": "2010-05-22", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "QcGi0cDzzGLb3LmiI33Psg", "review_id": "QJtoopR5oaqtdh8IkC_AIQ", "text": "pro: really, really good food.\n\ncons: shared tables.  crowded.  hipsters.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2011-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rrSCfzgYR8vLcRakmlIzdw", "review_id": "YW0OlREmaxcUi8cX5GDfJQ", "text": "Although everyone comes here for the pho, i also like the fried rice and the egg noodles with tofu yummy! yummy!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2011-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Jou7l2wJvM7ZgqspikTw9Q", "review_id": "ZJUaJDFCX9rOZ28JgcDxLg", "text": "I don't know how other reviewers compare Trams to Pho Minh.  Pho Minh is disgusting and uses a very tasteless powder broth/soup base for their pho.  Pho Minh is a lot closer to the real deal, but their pho selection is really small.\n\nThis has been the best bowl of pho I've had in Pittsburgh, and the four stars is totally relative for the 'burgh.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2011-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ho4MdaBcyjWWDeC8y-t9VQ", "review_id": "uvZOCSbhlOxRxMQQ-Keqmg", "text": "Pho is good but its not best pho or egg rolls (they don't even serve it with the lettuce and herbs) you can get in Pittsburgh. On the flip side though, their owner is super friendly", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 3, "date": "2011-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fYejBe7DMNd0JZyUx6XBuQ", "review_id": "Fbqwzek7n-1zbYwBNLxg2w", "text": "On my first visit to Pittsburgh after moving back to PA, an old friend and I stopped in at Tram's because he said it was the \"known\" Vietnamese place in Pittsburgh. I was underwhelmed. I enjoyed it enough. I should say I am not a Pho girl (I do like it), but rather a Bun Thit Nuong girl. It didn't have the rich, savory body I'm used to. No doubt, Phoenix and California have robust enough populations of Vietnamese folks to create stiff competition, and the places I frequented there put me over-the-moon. I spied another Vietnamese restaurant just a few blocks down the street. I'd like to give it a go-round next time I'm in the city.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 3, "date": "2011-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B4JpItCvUgbiX68q0Peysw", "review_id": "eIaL8tyDyEkKp9-7kjtL7Q", "text": "we like Tram's food and were disappointed today to find a hand written sign on the door that the restaurant was closed for 3 days, with a reference to a problem with the Health Department.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2012-03-07", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "rYJcrLryvbWjY_ghl87d9g", "review_id": "HyXsxhyfSmpviz9PNsMb7g", "text": "Don't believe the hype.\n\nWas in the Pittsburgh area for one day and decided to try the pho here.  It was a toss up between Pho Minh and here.  I think I chose wrong.\n\nA rule of thumb is a good ethnic restaurant will be swarming with that particular ethnic people.  When I went, all I saw were non-Asians.  \n\nOrdered the pho and it was mediocre and forgettable. It did not taste flavorful and authentic but maybe that's what is available in Pittsburgh.\n\nAnother sour note, they dropped off some spring rolls at our table.  It was our first time there and I thought they were complimentary so we ate them.\n\nLater on, we saw them on our bill.  WE DIDN'T EVEN ORDER THEM.\n\nThey were overpriced, and not worth it.\n\nBe careful if they drop off food or drinks at your table, they will bill you for it afterwards even if you didn't order it.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 1, "date": "2012-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7eFzSZUK-msdz3SzqptH9w", "review_id": "vNCtRU-aH_esbnvB59CrXw", "text": "This is one of the best secrets of Pittsburgh. By far the best Pho in the area and over many places I have visited. If you want good service & environment, you'd better stop here. It's a hole in the wall by a seemingly angry asian (he's actually quite nice). Expect to wait on water or wait on refills. If you make your order too complicated, it'll probably get messed up.\n\nWith that, the Pho. It's amazing and I've had a lot of Pho. However, it has it hit and miss days too. The meatball is more tender and flavorful than the beef which can be dry or tough to some that haven't had Pho before. I wouldn't recommend any other versions. A small is available as most Americans I bring here are unable to finish a bowl.\n\nSpring rolls are great (cold/fresh) with a peanut dipping sauce. The egg rolls are just amazingly full of flavor (fried) with a fish style dipping sauce. Place is very inexpensive too. Oh, this place is BYOB in terms of alcohol. Forgot to mention it's cash only. There's an ATM at the entrance or any of the nearby gas stations.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2012-04-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "3d0Vw3hPiUEWMwrlnC-IOQ", "review_id": "DQ5J0GZ-MK8VQjNHFPoUWw", "text": "Oh Tram's, due to its close proximity to my place, I must resist the urge to come here too often. It's really that good. I've had the vermicelli curry, the pho hanoi soup, the saigon soup - I've never had a bad meal here.\n\nAs noted by others - cash only. The restaurant itself is simple and no frills. Service is fast and no frills. Come in, order, eat, say thank you and leave. I'm a huge fan!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2012-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_gA5BmEB4PRR2QsZFSOdpw", "review_id": "zunDHnr-YUt_Lo2-IcNQHA", "text": "The food here was awesome.  Get some", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2012-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IR67DouGbJpEkHjsRMCvpQ", "review_id": "5UqXRBbxFDjAw4U126w9eg", "text": "For the price and the taste, i give it 5 stars. It's not the best, but good enough. What's better than a bowl of hot pho soup in the chill snowy winter days? Nothing!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2013-04-05", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 5}, "user_id": "0vCEI3ZJF_gXgWHpcR7WtA", "review_id": "33ukG655DnLXzPrVJ8soMg", "text": "GREAT FOOD!  Like the other reviews - you will not be disappointed by the fresh spring rolls.  Best I've had in the city.  The only part of our experience I wish I cloud have changed was the ordering process.  We weren't really sure what any of the dish's were, and the server offered no clarification.  My boyfriend was so flustered he just ordered by number and ended up with two entrees!  It was pretty funny.  Everything was flavorful and cooked perfectly.  We will definitely be going back (with a bit more knowledge of the menu)!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2013-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xWrZoK4WCF5F9So2UOjmMA", "review_id": "0gHOz-XvATDdAF3o6lSYcw", "text": "I have never had anything I didn't really really love, this is by far my favorite Vietnamese restaurant. It isn't a magic trick, it is good honest food.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2013-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J6bF6kHsx0_kQNURas8-Cw", "review_id": "ksz3YbZdhWjBOtiSPHlA0w", "text": "Just moved to the area and searched for a good place for pho. Stopped by and were pleasantly surprised.  The eggrolls hands down are the best we've ever had. Served them up with plenty of lettuce and herbs just the way we like it. The pho was good but nothing amazing. I had the curry chicken and was pleasantly surprised at how good the flavors were. Curry with just the perfect hint of sweet, so yummy! We will definitely be back! Don't judge a book by it's cover, this place is great!!!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2014-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WL8_Xlo-WIrFmTnolm006Q", "review_id": "87ruo5LDfGJrNkkH72n-pA", "text": "I tried this place, there food is good. They make the best egg rolls.  I never had to wait  long for a table also. It is BYOB", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 3, "date": "2014-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "59A-ZxUMOgIl2MAnySh-Aw", "review_id": "izgw5_cJ5kX2hyCYIfNTbw", "text": "For starters I had a fresh spring roll and a fried egg roll. The fresh spring roll is big and stuffed with shrimp, shredded pork, lettuce, basil, and rice. It was probably a sixth of the size of a chipotle burrito. The fried egg roll is a little smaller, yet it is still packed. I enjoyed the fried egg roll way more, but I wouldn't discourage someone from trying Tram's fresh spring roll.\n\nFor dinner, I had the Vermicelli noodles with coconut milk and beef. It was sweet and savory, but it missed a kick of spiciness to counter the coconut milk. I asked the staff for crushed red chili pepper flakes, but there was a significant language barrier which impeded me from conveying my request. Eventually, I said pepper enough, and I was brought jalapeño peppers. Not quite what I was looking for but they were an acceptable alternative.\n\nThe only subpar point of the night was the difficulty with service. The cash only policy could have been trouble; luckily, I read some reviews beforehand which prepared me. Also note that Tram's lets you BYOB.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2014-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "H4KEEgQRFMZ41rXpPBzQ4A", "review_id": "kWe5MNdh9AX9LEy5wLrmZA", "text": "Their best menu items: Split fried rice (any fried rice), Spring Rolls, Egg rolls, and their Thai Iced Tea . The pho is alright, but I think Vietnam's Pho in the Strip has a more flavorful broth. \n\nI would also recommend that you clarify what size dish you order because they automatically serve you the larger portion so they can charge you more.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2014-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bIZBzz1y_7j9ZflTgcjjQA", "review_id": "umo-27ZD0uUb0ekeuuX45w", "text": "Delicious.  Side benefit:  cheap.  We got the pork chop split rice and the pork sate pho.  Both were good.  Service is prompt and efficient. Cash only.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2014-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "kWkgwRxqWD-h260dMTkHUA", "review_id": "wRKiUfL147VvjDG5iN3wnA", "text": "I stopped by here this past Wednesday evening for dinner with my fiance.   We have both been to Tram's before but it has been awhile since our last visit.  Whenever we walked into the restaurant we saw that not much has changed except for maybe the addition of a flat screen TV.  The restaurant itself is small and maybe has seating at tables for about 30 people and the decorations are a little sparse.  The easiest thing to see is that they have won a ton of awards which are hanging up on the back wall.  Beyond that it is still a hole in the wall divey type of place that is cash-only with excellent food.  \n \nAlmost immediately after we sat down the owner asked us if we were ready to order.  At that point we were not ready.  The menu here isn't that big but it doesn't need to be since what they do make is very good.  About two minutes later the owner was back and ready to take our order.  This time we were ready.  My fiance and I decided to split some eggrolls and then for my entree I went with the beef vermicelli with conconut milk.\nThe eggrolls came out at the same time as the meals and were so hot temperature wise that both my fiance and myself left them until after we had eaten our entrees.  My vermicelli ended up being really good with the sauce providing the perfect flavor to the dish.  I don't know how they do it but they do a great job of infusing a ton of flavors into it.  The noodles in it were also good and the beef was better than expected.  After I had finished my vermicelli I ended up grabbing my eggrolll which was still somehow hot.  While the flavor on it wasn't that great, what I really loved about it was the textures that it provided.  It was cooked perfectly and so the shell had a great crispy exterior while the interior with the vegetables had a softer texture.  Overall it was another solid meal at Tram's for me.\n \nThe bottom line for me is that I will definitely be back here again in the future.   Whats not to like about a place where the food is not only cheap but also delicious?  Just be careful in that it is cash only and I know at one point they were BYOB although I am not sure if that is still the case.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2014-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "a92UhSg9_xhZYOEKxfbtMQ", "review_id": "murdUVFRNJkjBaBI4sOLeg", "text": "This little Vietnamese restaurant is one of my favorite restaurants in Pittsburgh. We always start our meal with the fresh spring rolls - we both order two each because we don't want to share. Their hoison dipping sauce recipe includes special peanut ingredients that make it unlike any other that other Vietnamese restaurants serve. For dinner, I always order number 17 with no noodles because I substitute extra vegetables. It's always perfect. It's always delicious. I can't find this particular dish at any other Vietnamese restaurant so I continually find myself ordering the same thing. The pho is also delicious but I often times will share half an order with somebody else so I can get my number 17 :-)\n \nThe owner is a little abrupt but very friendly and you can bring your own bottle of just about anything and they will open it and serve it for you at no cost. You might be sitting next to a group of physicians, hipsters, corporate executives or students - they all flock here because the food is excellent and the price is always inexpensive.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2014-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jiZRd36mpIEU5eIC0EjpCg", "review_id": "Ym3fLvCf4tgTn9BtugOsrw", "text": "Previous reviewers were not lying when they said the service wasn't the warmest and the atmosphere isn't the prettiest or cleanest...but regardless, their food makes up for it.  My boyfriend and I are on mission to complete a list of trying different culture restaurants around the city and Tram's was our first stop.  We tried the spring rolls, egg rolls and Pho.  Everything seemed very fresh and well-seasoned.  I was a fan of the eggrolls over spring rolls, but I can't complain about anything we had.  I loved the Pho - I think it had a great tasting broth and was served with a ton of sprouts, lime and fixings.  I have a feeling this place is going to be somewhere I crave.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2015-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SAdLGdy8WknG8FHX6hCTGg", "review_id": "aPvYNO0swOtjclfjf_Vg1w", "text": "This is comfort food.  Love this place.  The service is so-so but the food makes this place an all-star.  The spring rolls are amazing and the vegetarian pho is my favorite.  The broth is so flavorful and the dish/bowl is filling.  I have never had a bad meal here.  One of my favorite go-to places in Pittsburgh.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2015-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aU_zecjEUd8ixDXqWrK2kQ", "review_id": "Wl3YubRC5We5gmazrKGh0A", "text": "Come with my boyfriend when every time he visit pittsburgh! Very tasty, local, and affordable. Only problem is we have to park alone street. Other than that, foods is awesome here! Oh! Remind it's cash only!!", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2015-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ThQ6gAvbDLZeQxa_Sb1A3g", "review_id": "vCN2pHwYsxx5_4KAtH3J4Q", "text": "Stopped into Tram's last night for a solo dinner. I was greeted by a joyful man who brought me to a spot at the front of the restaurant where he promptly too my order and delivered me a delicious bowl of veggie pho. I was in heaven and consumed every last bite- so good! I will definitely be back the next time I'm on Pittsburgh.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2015-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "wY6hderR_gN-AcK1WHiaGQ", "review_id": "wdCLye0ei2omIYsJrOViig", "text": "I haven't had Pho since I moved to Pittsburgh, partly due to the lack of ethnically diverse cuisines here. But I must say that this place does a good job in bringing one of my favorite comfort foods.\n\nAlthough the broth isn't super rich and deep, it still has lots of flavor. In fact, I like how light the broth is and how it isn't heavy. I had the Shrimp Pho, which was delicious; the shrimps were also tender and not overcooked. The serving size was pretty big too, so \nyou get your bucks' worth. \n\nBean sprouts, Thai basil, onions, and lime wedges are served alongside as add-ins when you order soup based dishes (Cilantro is already added to the soup). However, I noticed that these garnishes were a bit limp and dry, not fresh.\n\nThe spring rolls were a nice start, but I would say that it's a bit dry. If you're sensitive to cilantro, do not order it, because it comes with a good amount inside. \nAlso, this place is CASH ONLY, so come prepared.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2015-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Cts6kemK_2EThfLrME9lQA", "review_id": "hfUwcXqavMI_jvws7CZAdg", "text": "The pho is really great, but not made on the traditional sense. The split rice entrée is also delicious. The owner, Tram, is very personable. You can tell he cares about this business. That it's a part of his family.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2015-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aofmGHxGXVUyJDMLkRfbIw", "review_id": "o_k8hHi2yiEs_xL-i_tDow", "text": "I've been there several times over the past year and it's my go-to Vietnamese place in Pittsburgh. I like that it's BYOB, it's intimate, and it's delicious.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2015-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EQYhCVLmAQLGwYUYPPSaaw", "review_id": "ZN6BQhy3-rw0-DVkTtwbDQ", "text": "I'd characterize myself as a Pho Ho (I know that doesn't rhyme) so this rating is going to be lower than what other people may thing simply because my standards for Pho are snobbishly high.\n\nA very cute place, the decor and ambiance seems built very much upon the words \"serenity\" and \"harmony\", which is great, but as you might tell with the tone of this post, comes off a little corny.\n\nThat said, the food here is not too bad.  For lunch, it's a decently priced meal for a lot of grub.\n\nI got the Shrimp & Pork Spring Rolls and the Pho (which they call Beef Noodles I believe).  \n\nMy first impression unfortunately when the app came out was that the Spring Rolls used iceberg lettuce instead of basil or mint or a more dark green leafy green.  The iceberg lettuce gave the Spring Rolls a cheaper feel that I didn't really enjoy.\n\nThe Pho was better though they seemed quite stingy on the accoutrement, as I got two jalapeno slices and a sorry looking stem of basil.  In addition, the thin slices of beef were definitely overcooked and tasted not unlike a sponge.  But the noodles themselves were solid and the broth with a little Sriracha got my blood and tastebuds pumping.\n\nI don't know if I'll come back but I would say for lunch, this place is not a bad place to introduce somebody to Vietnamese food.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 2, "date": "2009-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XyaIK2hN3SNMohT5AbKxbg", "review_id": "3SJhxHS2TE8iwI_uNIpVuA", "text": "Finally veered away from my usual sandwich or cold rice noodles and ordered the beef pho....darn it was good!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2010-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "snBHXvENp0MNfw4wuEbtIg", "review_id": "Z6dn7EC1VCvrMIJA4hO3-Q", "text": "If the star rating was just for the Beef Pho recenlty, it would be 5 stars!  If it was for their Boba, it would be a 1 - thus the compromise of a 3 star rating.\nThe Boba I had was, well, disgusting.  Admittedly, I make my own at home so have high expectations.  Theirs was so overcooked that it was completely mushy and had a very odd aftertaste.  NOT something I would ever order from them again.  Hopefully they've improved it since I tried it almost 9 months ago...I've refused to try it since.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 3, "date": "2010-03-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "fIgmd3pyCatW8LsnLsrosQ", "review_id": "6ERHvHOtaSm1hbj3GOUTug", "text": "Perhaps I shouldn't be writing this review since I've only had one dish there, but I love it.  Their Pho Ga is very good.  Really fresh and tasty.  They also have some good teas.  They have a decaf raspberry rooibos tea I really like.  I've ate there 3 times, and it's been great every time.\n\nI was really missing good Vietnamese food after living in the San Francisco/Oakland areas for over 8 years.  Finally I found this restaurant to satiate my cravings.  Unfortunately, it is a little bit out of the way for me.  I hope they open another location!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2010-03-27", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "r-t7IiTSD0QZdt8lOUCqeQ", "review_id": "lHDQg62sJKViWGI0b-wSUQ", "text": "2.5 to 3.0 stars but i'm feeling generous so i'm going to rate up.  I've been here 4x-5x to satisfy a pho or banh mi craving and each time I leave feeling a little unsatisfied even though I know not to expect much.  \n\nPros\n- 1 of 3 Vietnamese restaurants in the N. Phoenix/N. Scottsdale area\n- Small, locally-owned business\n- Safe intro to vietnamese cuisine \n\nCons\n- Lack of choices/competition in the vicinity keeps the food standards \n   set to mediocre\n- Atypical pho menu:  beef version omits tendon, tripe, and different \n   slices of beef\n- Where's the meat? Skimpy with the meat in pho \n- 3 ham banh mi (sub) should have 3 types of pork not 2.  Otherwise call it a 2-meat sub.  \n- Subs don't have the standard offerings like daikon radish or peppers \n- Pricey. $7.25 for pho and $5 for banh mi.  Yes, for those that aren't \n  familiar $5 is high as it is double what other places charge.\n\nthis is what a vietnamese sub should look like: http://www.chow.com/assets/2009/07/pork_pate_banh_mi_sandwich_600.jpg", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 3, "date": "2010-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "19BunjXk7zhd811rF42U7w", "review_id": "euObA2EGQ1_J2ecbU3HE-g", "text": "Tried this place for dinner tonight.  While it was decent, I didn't love it.  We got 2 entrees and 1 appetizer for the family.  I ordered the chicken bun which came with 2 spring rolls.  The kids split an order of pork spring rolls and the hubby got the BBQ beef and rice dish.  The beef BBQ was excellent as well as the noodles in the bun dish and the veggies.  The veggies were very fresh.  The egg rolls were a bit disappointing - sort of mushy on the inside and while the chicken was tender, it had a very generic soy sauce flavoring and not the usual vietnamese lemon grass type of flavoring that I am used to.  Will try this place again, mostly due to the proximity to our home and also to try the pho.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 3, "date": "2010-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LqgGgWi3FLHBViX9tmZ9sw", "review_id": "tEDVlGXHqBhMYzYwkB3jsw", "text": "Well, it is complicated once you live so close to Mekong plaza...but this place has a good variety of food and the thing that I most liked was actually the tea and the way it was served!! I realized too late they did have boba tea!!\n\nFood was ok, and the service really friendly. Make sure not to confuse it with the nail shop!!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 3, "date": "2010-04-21", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 3}, "user_id": "2qgjgzarF6jvIkpprvF9pg", "review_id": "8EK-_CLkkD9YkgbHIMbZiw", "text": "My go to place when I want something delicious and quick. I always get the pho which is just so damn good! Noodles are soft and the broth is da bomb. Perfect remedy for a cold, sore throat, or an empty stomach. The other reason why I love this soup is that it has no stinky pho smell that most pho soups have. Does anyone know what I'm talking about?!\nComes in a big bowl that can be shared or have it all to yourself! A little pricey but nothing to cry about. Mmmm...craving one now...I should go before they close in 30 minutes...", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2011-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G345HOKIcm0_xIJJWM9GtA", "review_id": "7sPqq-BnTNtBFpKIazagQQ", "text": "Great food.  Wonderful, friendly service.   I highly recommend.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2011-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bDPFpoB-Uaf_nPBS5tF6Jg", "review_id": "BKXzZEIdIJelfS35GaN7qg", "text": "Let's not get too crazy with the five stars and Vietnamese food. It's hearty, affordable and fast. It may not be savory but, however, remains delicious for both humble and economic reasons. And that's okay, because I want to experience different cultures and their cuisine without all the American influences.\n\nTasty offerings include the (#3) beef with egg roll and their \"pho bo.\"  The beef is seasoned \"awesomely\" and comes with fried spring rolls over a California-king-sized bed of rice noodles and greens. As for the \"pho\", it is a very delicious soup that you must try at least once in life.  Lastly, compliment your meal with a Tai tea or Vietnamese coffee and you'll leave much more caffeinated (and perhaps happier) than you arrived.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2011-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8p4at4zdzCpueAmSBaorZA", "review_id": "fLVb3dyoylYn1fOZPZ8zBQ", "text": "I used pass this place every time I went to the movies or to get my nails done next door.  My husband loves vietnamese food, so he had been there a couple of times.  Finally I agreed to go with him before a movie.  I am hooked on the shredded chicken sandwich.  A great combination of veggies (carrots, cucumber, sprouts) and very well seasoned chicken on a crunchy baguette.  My husband had the pho.  I am not big on soups, so I tasted his, I could actually eat that next time, although I have been to this place and I feel like a broken record, I always have the chicken sandwich.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2011-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jk_P-yYspg7uz-8xSCRdGA", "review_id": "GlacCcYLBSP0TN6qURfNGA", "text": "the food is very good here but the service isnt very nice. they dont greet or thank customers properly. i dont know why the owner is so mean when i come here all the time. so i have to give it three stars for the bad service they need to learn better customer service or at least some manners", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 3, "date": "2011-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Hac8HebtWiR0H2WmPg9AOg", "review_id": "eERt-ANdxksZseObRKsOog", "text": "I am huge fan of this place!  I have been going there for about 3 years now as they are very close to my office.  I can call in an order, drive over there in 5 minutes and it is ready for me.  It is always the same gentleman helping me as the cashier.  The quality of the food is AWESOME!!  I am pretty snobby about my Asian food :-).  The only thing that I get confused on is do I tip?", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2011-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "TvtARzzT8bvPKLiLEeMIHw", "review_id": "bgYbnY0zVRyMBrErb1mM9w", "text": "Yay!!!! I've finally found a decent Vietnamese restaurant in North Scottsdale.  I had the PHO (customized the way I like it) and a sandwich.  Both were really good!  Very reasonably price and the service couldn't be faster.  I just wish they had a bigger menu but they have the basics so I will be back for sure!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2011-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cXJGa60A0T4eiiMY3OFfwg", "review_id": "hY0h1ALeJVIMbgCDgCyS6A", "text": "Great food with friendly and fast service. They have a few gluten free options and everything is dairy free. I would highly recommend Tea Lite!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2012-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "g2mozOU_F1nzpjLDY4CfzQ", "review_id": "eptlpPQeUVsQBADEdg8Rpw", "text": "Ate here for lunch the other day, food was pretty meh. I'd give 2.5 stars if I could, the spring rolls were very nice and stuffed with shrimp. However, the order of chicken I had was completely dried out -- it was seriously like eating chalk. The flavor was ok, I guess, but the meat was so overcooked it was impossible to really tell.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 2, "date": "2012-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1ykGYq1ERicaZWCl5-Vi0Q", "review_id": "FaFz95jx6xKtFCp48X_iUg", "text": "Great little cafe.  Go for the chicken sandwich, it's great!  The Pho is also good.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2012-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "IbNzF_SIdZioYbLnL6F5Vw", "review_id": "mQQ6I9GbPOBTWHD_Cc0mfQ", "text": "A visit to this place is how I treat myself! \nI love, love, love the pho, sandwiches, bun, and spring rolls.  If you are undecided on what to order, go with the special-- it's a little sampling of everything.  \n\nI know this place \"Americanized\", I've had more authentic Vietnamese before, but it's still quite tasty ;) It's also very consistent-- something I value in my lunch take-out places. Service is quick and very friendly.  I'm very appreciative of the speed-- when dining in the restaurant, we are able to get in and out during lunch in less than an hour.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2012-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZVSLkEjNpMALZPpCSDjHSg", "review_id": "CbVrcWvxLc_A61NfccEqdA", "text": "This is our weekly destination for Vietnamese. North Scottsdale is limited on the Vietnamese options, but I believe this is the best in terms of good food, atmosphere, and service. Nice to sit on the patio when it's not boiling outside. The Spring Rolls are always fresh, the ice coffee is delicious, and the pho is great as well. The only con in my book is that the menu is small and missing the more adventurous parts of pho.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2012-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dUDzN6zl3j12zhByOrnF9Q", "review_id": "SvhU4kBcRDCRPCbNV1QP9Q", "text": "My new favorite place.  This place is sooooooooooo (is that enough \"o's\" for you?) good!  I come here every chance that I get.  There isn't anything that I've ordered here that I wouldn't order time and time again.  Whenever we have friends come out to visit- this place is a must :)", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2013-03-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ngnrTCBbOqnvaaneg2KXKw", "review_id": "cRn-Si44mFiO88gqFT65iQ", "text": "Many Gluten free options.\nFood is fresh and healthy \nLove the chicken pho and beef or pork bun. \nSpring tools are delicious too!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2013-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ylICYxt7MT5fpsJZeo_Fcw", "review_id": "M7nApTfqstv5VoONe8NwbQ", "text": "Best pho In North Scottsdale.  Period!  The Tealight special is the best deal in the house, and their herbal chai tea is simply awesome!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2013-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k0uSrEKpZkaDeC_bjhJ7Bg", "review_id": "VtUI6YaqqYCpIJCxBArRaA", "text": "Tea lite cafe is a hidden gem! We've lived  across the street for a couple of years and we have finally tried it! Atmosphere is small, simple, and vibrant. Even though the place was super packed, service was quick. If you're pushed on time I recommend pick up. The chicken pho was tasty and had great flavor. It has jalepenos so it is a  little spicy. The marinated beef on rice noodles was so good! The meat was tender and had a sweeter/BBQ marinade. The only thing I would say is the meat to soup/noodles ratio is low. Next time I would pay the extra for more meat! I will be going back to try the sandwiches!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2013-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L2P_swAid-b5XCaeHua5eg", "review_id": "5_PttMoV6oqdVidBwgVL0g", "text": "My favorite here is the chicken pho - the flavors are so clean and vibrant, I find myself just craving it some days.  Friendly atmosphere, quick service, and just near enough to my work to make it a reasonable stop for my lunch break.  :0)  Perfect!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2013-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0dpNmJxKp4Ha-fzJ2R8cCw", "review_id": "a7dhJn5OGvIl3Kyu0f7h0g", "text": "I've been a handful of times and always get the tea lite special - it's some rolls with a bowl of pho. Very delicious and the best pho in my hood. The place can get a little crowded because of the smallness but it's definitely worth it. They also offer take out if that's your thing.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2013-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "pA_eifXHOUftssGehzI0sA", "review_id": "YdExKW1KhVx9uw21qrF12Q", "text": "Tea Lite has a simple menu of just a few items, clean food, and is an easy in and out dinner or lunch. I am a regular here, and go several times a month. I always get one of three things. First, the chicken salad, which is served with a super light dressing and is very clean, leaving you full but not feeling heavy. I also love the chicken pho and veggie spring rolls. And I ALWAYS have to compliment my meal with honeydew or mango boba or a green matcha tea (delicious). What I love about this place is that it is privately owned, and the owners are always there. It's small, and although it's busy around lunch hour, it is still fairly quiet and a nice place to sit and read a book while eating.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2013-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BkbzJg2BFEdPwUfBdHfqTw", "review_id": "nnIFnCn5tlondroT3w1TaQ", "text": "This was my first experience with pho! It is absolutely amazing!!!! I would go here at least once a week. It's a great place to go on a nice day and sit outside. The portions are huge for a great price! I highly recommend trying this place!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2014-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Qtro4APUHh1wEwnVhciPPQ", "review_id": "79UaRN-sTu3k7eMEbg-CvA", "text": "I've always enjoyed Tea Light, and I've been coming here every so often since around 2006/7. In the early stages of my family and I frequenting this place, the food was amazing. Sometimes, we'd even be there two or three times a week (yikes on the sodium intake). \n\nNow, however, I find that the quality and taste of the food has dropped off a bit. I'm not sure if they have changed their Pho recipes, or if there has been a change in the person cooking the food, but now it is just so-so. Their prices are alright. Definitely nothing compared to the place I'm always going to now near Central Ave and 19th. The service is decent. But like I said the food is just good- nothing exceptional (At least now).\n\nTips to the owners would be to make the Tea Light Special available for take-out and bring back the Spicy Beef Soup with Udon noodles (this was the dish that had me craving this place multiple times a week)!!!!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 3, "date": "2014-04-09", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "n0YCN5SVq3AXf8BPe046Nw", "review_id": "OhxbyoAk6Kwiowp_IslEpQ", "text": "The chicken pho is my go-to when even the possibility of sniffles is on the horizon and I can't pass up their crunchy and savory egg rolls even when I should be on a broth based diet. \n\nPortion size is beyond generous -- typically at least two meals. I primarily order for pick-up and the wait time is always under 15 minutes. Don't judge the restaurant by it's strip mall appearance. Cozy dining in options including outside patio seating.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2014-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tYiASttMX0zmfuCF90x4Kw", "review_id": "PGExwCb_9iznikkbFEaVVw", "text": "Pho is phantastic! 1 & 3 dishes are very flavorful and light.\n\nHighly recommend a visit.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2014-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SPqRcZG2GksfE-7EZS-OxA", "review_id": "vCgA3aDXMxTZCRHVxEcPPA", "text": "I work in the same complex as Tea Light and have come here a few times. \nThe food is amazing; I was honestly surprised as to how good it was. The service is friendly, and quick. Even when I'm not working, I will drive out here to have some Tea Light. They are wonderful.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2014-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "PLPptfP2WWVE2zxNHfaAyg", "review_id": "8K0v3AJY5oLTDt_6XVcBWQ", "text": "The Nuoc Mam here is horrible. It is missing so many components that make this dressing crucial to most Vietnamese dishes.\n\nIt's too bad because the food is decent. But then you're stuck with bad sauce..and it's not just the Nuoc Mam...the peanut sauce is more like peanut water.\n\nGood:\nEgg rolls\n#3 Bowl\n\nBad:\nChicken pho (ok tasting but there is some ingredient in it that doesn't taste quite right....can't quite put my finger on)\nSpring rolls (mostly noodle filler)\n\nReally Bad:\nThe Sauces (as mentioned above)\nPickled carrots mostly taste of salt with no sweetness\n\nSo if you are not picky about your sauces, I'd say give it a try. Or if you are a complete newbie. Just know there is something better out there. \n\nI dream of San Diego chicken pho and will continue to pursue it here in Phoenix.\n\nP.S. This place is better than Saigon Nites though!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 3, "date": "2015-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3SQqzs3lG-FY9ouz3PXUeQ", "review_id": "NqOfiOongPdiGRT608x8TQ", "text": "Best pho I've had. A lot of solid flavors. It is also always busy when I visit, but the service is really quick.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2015-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tZBkURtI92L-rLqO15TWjg", "review_id": "mA3sU04dhoPBGITH_rb4xQ", "text": "AMAZING pho. We usually split (extra charge) the chicken pho and thats more than enough food for 2 people. One of the best pho's in the valley, give it a shot!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2015-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1_omNdLgAR7yCCvJEvMz0A", "review_id": "GmSZo16lglWLLVncvhoViw", "text": "We've been eating here for over 10 years.  Always get the #1 w/ beef and never disappointed.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2015-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sA3YCSFx30L4qbdxknnPVQ", "review_id": "J96dpuy54rg1heVhQxYIhg", "text": "Fast service great food.. The broth in the pho is as good as it gets.. It's tucked away by the movie theater but it's a gem.. Very fresh very good.. Try the mango boba..", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2015-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EGDY-NX2R4Aha0UO6q_fRA", "review_id": "1qTjJ14Hh5wPNPXE63Z1wg", "text": "Matcha green tea costs $6 a glass.  What?!  Rip off.  For lunch I ordered the number #3 Bun w/ beef.  Literally was a few pieces of beef and the rest was all noodles.  I probably will be back to try their Pho soup.  But that's it.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 2, "date": "2015-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iqDRJGQQzM32f1w-4bxYWQ", "review_id": "mZs1xBciJscnWbLYk6TEUw", "text": "awesome, im a regular and love the Pho (chicken and beef) and spring rolls:)) Yum/ great smiley service cant be any better and when i get a to go they wrap so well its appreciated", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2015-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "WkbfRMT1gGqKALrIxGZbWQ", "review_id": "vYAHRY7N--cGmobn477atw", "text": "Best soup if your sick! Always consistent, and flavorful! And the spring rolls are always fresh!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2015-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NK625cv29EtlhEcMLOWRdQ", "review_id": "nm6qLjWC3rJmBxcWfbV2Rg", "text": "Great place an inexpensive and tasty lunch ....\nI've been there many times and it's always excellent!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2015-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2qkHJ1oqE01DovTqpqCC0Q", "review_id": "e6m88KL1FjwQj_qvbONtBQ", "text": "I gave Dragonfly a try last night and was very pleased with my experience. Good thing I didn't read these reviews and change my mind. First off, Wednesday night now features a very amusing piano player who plays lots of popular tunes that will have you singing along before you realize what you're doing. There weren't many people there, but our waitress was very attentive and cheerful. The best part by far was the food. I had no idea what to order, but settled on a 5 spice chicken. It was awesome. Great flavors I had not experienced before. We also had a beef dish. Can't remember the name, but it was really good too. I have to say I was surprised. I'll be sure to stop in again the next time I'm out in Mesa.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 4, "date": "2009-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fUs5XxOR82Hfrnyl4wi2QQ", "review_id": "6T_Qkmxj82FRzGlOF1ETpg", "text": "Yeah, the service is slow due to the cutbacks in staff.  But all-in-all, this place has good food and good prices.  One of the best Vietnamese restaurants, in our opinion.  Contrary to popular opinion, they are not related to the one in Tempe.  Give them a try.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 4, "date": "2010-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3hPmlMAP3PfHMiwNW_RUZg", "review_id": "Fd7NeC9KygP1WLfZTRsldQ", "text": "The service was awful so I would that a 1! I give it 4 because the soup was delicious as were the spring rolls! There was a lit of thick meat in the soup and the basil was superb!! Th rolls were very fresh ingredients and the Thai tea was top notch as well!! I recommend it for the food but service no thanks. The ambience itself was nothing cool either.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 3, "date": "2010-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fUs5XxOR82Hfrnyl4wi2QQ", "review_id": "DE1H-YLkOJxA4WZSJhUBAw", "text": "OK; we were there again yesterday for lunch.  My wife and I decided to have a big lunch and skip dinner and watch all the games on TV last night.  We ordered about three entrees and three appetizers.  Service is a little slow due to staff cutbacks due to the economy, but the food is still excellent and the prices extremely reasonable.  We know the owner since we frequent there a lot and he said that business was still very slow.  You readers should try them -- you will not be disappointed and the food and prices are good.  Give them a try -- I would hate to see this place go under due to the economy.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 4, "date": "2010-04-15", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "ZZ5hV2jcxchiZo6C9AXq_Q", "review_id": "mEexETRwy0YMqrtAYqt9Vw", "text": "this place was a really nice surprise on a sunday. we had decided to take our bikes out and enjoy the nice weather. of course i was hungry, so we ended up in the saketini/oregano's plaza looking for some food. dragonfly looked cute and inviting so we thought, why not?\n\nwhen we walked in, only three tables were full and we were immediately sat by the host/waiter/jack of all trades. things that you must get here:\n\n1. citrus white iced tea\n2. cream cheese shrimp rolls\n3. anything with their charbroiled beef\n4. anything with their charbroiled shrimp\n\nthe food was absolutely delicious. i had the shrimp spring bowl which came with an overabundance of charbroiled shrimp, veggies, noodles, mint, and a tasty egg roll. i couldn't get enough of it. i loved the pickled cucumbers and carrots and the shrimp was cooked perfectly. the cream cheese shrimp roll was freaking awesome. i had never seen an egg roll stuff with cream cheese/shrimp before but i want to go back and eat 50 of them and then hate myself. it would be so worth it.\n\nbetween the two guys that were manning the floor (it got as busy as 6 tables when we were there) they did a great job being attentive and being ninja drink refillers. really a great first experience and i can't see myself not going back there. yay dragonfly!\n\nPS... they don't serve banh mi here but the waiter was kind enough to let me know the sammich hook up on Elliot and Warner.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 5, "date": "2010-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fUs5XxOR82Hfrnyl4wi2QQ", "review_id": "fvpKRcAnb5YzJVdYfz4Hjw", "text": "The name has now changed.  I think the new name is Pho something, although the signage on the building still says DragonFly.  The original owner and his wife are no longer working or cooking there.  They moved to California, but the owners parents now keep the restaurant running.  The service and friendliness is still very good, but the food yesterday was mediocre at best.  I don't know if we just had a one time bad experience, but the food was not very good.  We ordered some Pho and the broth was not up to standard and the ingredients were mediocre at best....and the veggies were very sparse.  Just some basil and a handful of beansprouts.  The egg rolls seemed as though they were old and warmed over leftovers.  You could definitely tell that they were not fresh.  And my wife's crepe was super greasy and inedible!  So we probably might not go back again, even though we have been frequenting this established ever since they opened years ago.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 2, "date": "2011-03-15", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "Vyl9tU5OeDcZND37iObmOw", "review_id": "cR8URzOT4tU2WfC8ReG-gg", "text": "My friend and I split a Steak & Tendon small pho and a banh xeo. We were both very satisfied and full after this meal. This is the best banh xeo that I've had in Arizona so far. If you've never had a banh xeo before, it's like a Vietnamese style crepe/omelette. The outer part is egg, and inside contains: bean sprouts, meat (pork, I believe), and shrimp. You cut a piece of it, and then wrap it around the large lettuce leaves. Then you dip the lettuce wrapped crepe into the fish sauce, and enjoy.\n\nI LOVE LOVE LOVE BANH XEO! If you've never heard of it, or tried it before, I highly recommend it. Share with a friend if you're scared to try new things. If you're adventurous, try it on its own, I think it's very filling and can serve as a meal. \n\nThe pho is ordinary, but other members of my party were jipped on some meats that were supposed to be included in their soup. Small size is definitely enough, even if the waiter thinks it's a \"children size.\" Service was okay, but I'd definitely come again, just for the banh xeo. :)", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 4, "date": "2011-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-AhtIe5xQUUW7y9UMxo6cw", "review_id": "-jg9-Wk3JQcKzzKnMe7yYQ", "text": "the food is always so vibrant and delicious, I swear I can hear her singing in the kitchen sometimes. We are always greeted with a smile and great service :)", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 5, "date": "2013-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UHDCxscAmak1ne8SM7ILog", "review_id": "JqJJCyoJqiNg1CDlzYQ9QQ", "text": "Sadly, this place is closed now. Owner moved back to Cali.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 4, "date": "2014-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IldNKx5L8unlcv3LBSs-_g", "review_id": "H9uRp3uIz50hY07Psn9xYg", "text": "Best Vietnamese restaurant in the area. It's a slightly run-down restaurant in an unassuming strip mall, but the food is fantastic.\n\nThe menu ranges from traditional pho to rice or noodle dishes to crustry bread sandwiches. Some hot pot, family-style dishes are also available. I've never had the pho, but my father raves that it's the best soup he's ever had.\n\nMy favorite dish is Bun Thit Nuong (#34). It's a bed of fresh lettuce, bean sprouts and rice vermicelli with about 10 oz. of barbequed pork, topped with minced green onions and crushed peanuts. It's served with with Nuoc Cham, a traditional sweet/sour/salty dressing with grated carrots. Cost: $4.75.\n\nI also recommend the roll appetizers. Two dollars will get you two shrimp and pork spring rolls in rice paper, or two fried pork and vegetable egg rolls with all the typical trimmings (wrap the eggroll in lettuce and mint leaves before dipping in the Nuoc Cham).", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 5, "date": "2009-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iKDDbFu1lyA8-CVlGLFHcw", "review_id": "ljqWjeQK4Oxo04K7sWbBRQ", "text": "This place is your standard hole in the wall pho. They've got good tasting pho and spring rolls for cheap. :D The cleanliness is definitely lacking but more flavor fo' yo' noodlee!", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 3, "date": "2011-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vFyoKM5nvm3kRpmoE6By8Q", "review_id": "eRkIH2f0IvvahVkmAHka7Q", "text": "Love this place even though it looks ghetto on the outside and inside ha. Authentic Vietnamese food. Problem is they will never give u the tab, u literally have to chase them down to pay. But all their menu items are sooo good and super cheap ranging from five to seven dollars for a large portion of food. Favorite Vietnamese restaurant in Arizona!", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 5, "date": "2011-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MYVgzfsFXMAdByQWUirZlw", "review_id": "3L6RYl79wN_WrIDLhZEGpg", "text": "This place has the best prices on Vietnamese food in town.  The barbecue rice is where its at.  Flavorful, juicy meat grilled to perfection, laid over a bed of rice that soaks up all that meaty goodness.  \n\nAlso, ask for fried egg on top to crown the meal in golden glory.  It's a meal for champions.", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 4, "date": "2012-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Zw88uQnHmHKcTUMo-PBL1Q", "review_id": "j-9X5QV2pnWRK1RqBtha_A", "text": "Pho done right in this joint people. Don't really like much else on the menu at this locale.", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 5, "date": "2012-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BgY9LwHmY8BO_lPI3pNRFQ", "review_id": "rm9X3f5S5cdWiAywCvUG3g", "text": "Love this place. It's yummy, cheap and the portion sizes are huge. I usually get the same thing even though I tell myself to try something new, but I can't help myself lol. I forget the number, but it's the one with noodles, pork, egg roll with veggies :P I tend to get the same meal every time I try a new Vietnamese place to try and gauge how I like it before I stray to something new. I failed to do so a few times and I ended up unsatisfied lol. Yes, the place looks sketchy, but it's yummy!", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 4, "date": "2012-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KSTOdz0lSFCkqBSRNwjERA", "review_id": "YASBzXKPKLYgKFfECywhGA", "text": "I haven't had the Pho here, yet. I actually had the bun (vermicelli) with lemongrass beef. I love lemongrass so I specifically came here to get this. I also ordered a side of eggrolls (2 in an order accompanied with lettuce, mint and fish sauce for dipping). My total was $8 something which I liked. Very affordable.\n\nLemon Grass Beef Bun was okay. I expected a stronger lemongrass flavor but it was very mild. There was a nice grill flavor though which I did enjoy. The fish sauce that it came with was mild, also. But I've noticed that with all the viet places I've been to in AZ, why is that? \n\nThe eggrolls were eh. Mostly shredded carrots than anything else. Wouldn't order it again. \n\nI will go back and try their Pho and maybe some other items, and if it's amazing as all these reviews state I will update my rating, but for now based on the eggrolls and bun dish... 3 stars. Just A-OK. To me a 4 or 5 star vietnamese restaurant has to have good bun & com tam (broken rice dishes) as well as Pho. My favorite viet place is still Pho Thanh in PHX (which has a similar name but I don't think has the same owners).", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 3, "date": "2012-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JdOLK2mRvnjtNdtwk-ffXg", "review_id": "I7fyqemLuMQxPDUpgacvVg", "text": "Such a tragedy. I am SO SO sorry to see this place close! I have been going there for years and will without a doubt miss them :-(", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 4, "date": "2013-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "HBtqXoW1VqTRXcuRQEva2w", "review_id": "PsCDeWd9_GHx186GztKv7g", "text": "NOW CLOSED. This was due to a deadly shooting. We will miss you.", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 5, "date": "2013-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "3uU_6L8GnFOHTsO4I3oedg", "review_id": "0qOTlYybwh_FjrE4WHoEeg", "text": "My second favorite Pho place (Saigon Pho being the first).\nAlways good food here. Only problem is getting the bill when you are done eating. Not the most attentive servers.", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 4, "date": "2013-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EqRfnmdOQmv8rXIVUaYGVg", "review_id": "KrBu0gmrDH94blUAeCJp6A", "text": "You are missed Phu Thahn :'(  A loyal customer", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 5, "date": "2013-05-07", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "5S9qsoHWUcMeahMtBwuX3g", "review_id": "4e9lr4pPZ6hCJpc4BsfrjQ", "text": "Looks like I spoke too soon. It's back to going to 19th Ave and Camelback to get my pho/bbq pork fix.\n\nFor those who ask, the owner closed and moved because of what went down. If you want the same menu and food, go to Da Vang because it's within the same family. Phu Thanh moved to the West Valley and just opened inside of Lee Lee's on Cactus Rd.\n\nSo for those in Glendale, yay for you! For those who are stuck on the East side, you are welcome to come cry with me in a corner.", "business_id": "IXB3PGgSmw4bjTe9ll-tQw", "stars": 4, "date": "2013-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "IE_nJq65Qpso5fN4tG9zjQ", "review_id": "JW3-Du5rxB82sVtSH1HAYw", "text": "This place was OK. I'd give it 2.5 stars. I had a bowl of pho and the worst freaking lemonade ever. It tasted like it was made of sugar and water and threw in a lemon just to pretend that it was a lemonade. I had high hopes because they place looked pretty busy for a lunch crowd, but looks are deceiving.  \n\nI'm told I can't compare California food to Arizona food, but that is a load of crap. If you don't hold food to higher standards, how are they going to improve? I know I sound like your 7th grade teacher that tells you that you have a lot of potential, and you aren't living up to it, but thats how I feel about Saigon Pho. \n\nThe price point is right, and they're not trying to charge me something crazy like $7 for a bowl of pho like *ahem* other places... \n\nI might give this place one more chance, cause my friend that went with me told me they were having an off day... but we shall see.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 2, "date": "2008-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1mal-cvLhyX8iGEt56_5Dw", "review_id": "G6q8glMo70ERZJ_BlLACug", "text": "I like Saigon.  I usually get the chicken w/ lemon grass, can't remember the number.\n\nDownfalls are the facility, dated and dingy, and the quality of the meat.  At the prices they are charging, you aren't going to get all white meat chicken or the better cuts of beef and pork.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2008-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "T7J9ae0wTskrI_Bgwp-4cA", "review_id": "kUHveraIA5ZsPMoLZ26UIQ", "text": "This place is super cheap and super yummy.  I have liked everything I have ordered here- really love the tofu dishes- EXCEPT the dessert.  Yuck!  Don't even attempt it.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2008-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JBlcfu6tqQ5l7NmkyFVv9w", "review_id": "d_DmDjg1g_XDkd2RRYRt5g", "text": "I was introduced to this place by friends for their pho.  Its good and cheap.  The soup broth is tasty and not loaded with MSG.  I've had their rice noodle dishes and those are filling and tasty if not particularly gourmet.  I love their ice coffe served in the traditional style of it slowly dripping through and into a glass with condensed milk.  \nThe food is good and tasty and cheap.  I've had better tasting and cheaper in San Diego but we're in Arizona and I'd rather not schlepp 6 hours just for a meal.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2008-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "wfvmwhhadHfpM9UoTV0OMA", "review_id": "1dsGMrno4WUdLNaJbe2qpw", "text": "Cheap, fast, no ambiance, hole in the wall VN place.  We go there all the time.  Pho is good and cheap.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2008-05-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "W7JdQs7zx0XoHj17aNUkrQ", "review_id": "MTnS81qbEh4O7GjdF6tOow", "text": "I have been coming to this place for at least 3 years and still can't get enough. It's an odd location, considering they're right next door to another Chinese Restaurant, but the food here is fantastic.\n\nThe service is always quick and the food is delicious, my fave: Beef Chow Fun. This is one place I don't mind picking up the tab :)", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2009-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XfUbS8krsXec3nKYA63jrQ", "review_id": "TDb0oMgSeih0Urbpmdb0Lw", "text": "This place is great - the best Viet restaurant that I know about in this state.  Low prices, great food, friendly service!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2009-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-u3nv-yLrnxhGz-N15DU2w", "review_id": "J4TMgDObF4ZfgfsFCVXcBQ", "text": "YUM\nYUM\nYUM\nYUM\n\nLove this place!!! Pho is FANTASTIC! EGG ROLLS ARE THE BEST! Can't say enough good things about Saigon Pho.. Just go there! NOW.......", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2010-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8leVoQakIF9OfyikF7Yu5g", "review_id": "bPGGIJURns1twaeT-o5oBA", "text": "I had the Vegetable Pho and a glass of water. \n\n--Price: Very reasonable, and about what I expected/hoped to pay. $5.50\n\n--Food: It is not the best Pho I have ever had, but it was above average.  Decent amount of veggies BUT no tofu!!!  I still have to rely on Maxim for the greatest Veggie Pho (comes with tofu).\n\n--Service: Very awesome. Soup was out before I could even let out my pre meal fart.  They consistently were getting up during their lunch meal/break to see how I was and to refill my water.\n\nI will go back again when I do not feel like making the drive to Maxim in Phoenix.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2010-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "D6PxfJsBrrbAUSY3Rxf_CA", "review_id": "hB5NaE3SDrtatPmlFFmG_w", "text": "Unusual for a Vietnamese restaurant, I hold this place to the same standard of cleanliness I expect from a Chinese restaurant: if it tastes good and doesn't make me sick, it's a-okay! I have grown up in Asian restaurants and really, despite all the negative reviews, this place isn't that scary! If you're looking for ambiance, well, maybe you should save this one for another day. I can't say I've ever been to a Vietnamese restaurant where the decorations blew me away. However, if you are craving some mighty decent Vietnamese cuisine, you have arrived at your destination.\n\nI grew up on Oahu where Pho places are like McDonalds- they are practically on every corner. It being one of my favorite foods, I've been to a great many restaurants for pho, and have tried to find a place that can fill that big beef noodle soup void in my heart..( or stomach.. same thing) since moving to Arizona. I've come to the conclusion that there is nothing in Tucson. Chandler, however, is fortunate enough to have this little gem.\n\nThe bowls are large and very affordable.  The easiest difference to distinguish between pho places is the broth. Saigon has a pretty good broth, and offers almost all the right condiments. The only thing this place is missing is sate, which is like chili oil with garlic or shallots, and culantro. If only I could figure out what it's called in Vietnamese... Large in size with sharp edges, it is similar to cilantro but more subtle and slightly sweet. These, while a major drawback for me, are minor for the overall quality found here at Saigon. The beauty of pho is that it arrives light and fairly simple. Its up to you to customize your own bowl to your individual taste. \n\nThe spring rolls are good, served properly dressed with lettuce leaves and mint for wrapping with traditional sweet sour fish sauce for dipping. If you like coffee, you haven't lived until you have had a Vietnamese iced coffee. No. Seriously.\n\nAnd a small but hugely fantastic thing? They have fresh coconuts that you can order to drink the juice out of! And eat the coconut flesh after of course.. Mmmm\n\nSo while this isn't the best pho I've ever had in my life, it IS the best I've had in Arizona so far.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2010-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xdWsnbaTEfBMVHttqZDHxg", "review_id": "O22QKDp-8Ueohfd0dDgBTA", "text": "The place is looking good with a recent face lift -- new paint / wall pictures / pendant lighting... I'd also bet money the folks here are CBS (Chinese Born in Saigon) as I hear the staff speaking in Chinese and based on some of the offerings...\n\nI bounce around on the meu alot, b/c I haven't found THE dish that makes me want to order it over and over again.  My bf is a fan, so we come here regularly due to its proximity and good value for the money.  I am impressed with the friendly service, it's a notch above what I'm used to receiving in pho shops.\n\nRegularly consuming:\n\n#2 Viet Shrimp & Veg Rolls -- these aren't the deep fried rolls, aka spring rolls elsewhere.\n\n#21  Duck w/ Egg Noodle Soup -- love / hate relationship... I love duck, and its tender falling off the bone... but the broth can be sweet which is off putting.\n\n#24 Charbroiled Pork & Egg Roll w/ Noodle -- vermicelli noodles served with fish sauce, as I find their beef pho broth just eh.\n\nAny one of the \"dessert\" items which I treat like a drink, the drinks are soooo refreshing during our hot summers.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 3, "date": "2010-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "3-BI7xch1S5zFvu1EVXIOA", "review_id": "KCqLjDG3ob2XPFhz_yHqPQ", "text": "Best Vietnamese restaurant in AZ I have ever been. Very friendly staff, excellent taste, reasonable prices and quick service are what I see. \n\nCrispy chicken is awesome as well as lots of pho choices. \n\nThe only thing I'd like to say for improvement is that the inside of the restaurant woud be redecorated and be more light.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2010-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hLXeeKq7sdSznNs7W2LKEg", "review_id": "bs8IIJ0vNrTiTkA2uWrg4g", "text": "I love this place!  The cua rang muoi (salt and pepper crab) is to die for and a must try.  The crab is fresh from the tanks in the back.\n\nThe Pho is not what I'm use to back in Colorado but this will do.\n\nI love that I'm in and out relatively quickly when I want a quick bite for lunch.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2011-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 3}, "user_id": "EfvXF2GNrGSEIZ4ODD29Vw", "review_id": "1Eu0e2HhGpLceaLL9wcG3A", "text": "Really Good Vietnamese food! Good Service. I always order the same. Pho Soup, egg noddle, seafood style.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2011-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "UYRK47NZDKkywuZ-UHcnqQ", "review_id": "mz_bm4vg1_YSlwnl-sF1Qw", "text": "My family has been coming here for years.   Everything we've tried is delicious. Food is consistent, quick and inexpensive.  The Salt and Pepper Squid, Black Pepper Lobster, and of course the pho is always good.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2011-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vFyoKM5nvm3kRpmoE6By8Q", "review_id": "pMFKpCekKCigTgMy5f0vhQ", "text": "Don't come here for Pho! It's not authentic and it's Chinese style trust me!!! But they do have good crispy fried chicken. This place is not a good authentic Vietnamese restaurant but it's an authentic Chinese restaurant. Try phu Thanh instead in mesa!! If u want good Vietnamese food", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 1, "date": "2011-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8RU-e0hOLVKpKmHqFpn4PQ", "review_id": "cqbx6NbPmzK3qIEyGHHgpg", "text": "My favorite phone place. It is spookier good. People are nice and my wife loves the number 50 beef salad. You can't go wrong.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2012-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1EAnCUMgnXN4IDgetOV7tg", "review_id": "liqb-b8B92SX730MO3u1jQ", "text": "Being from the Bay Area (in CA), and being used to quite an assortment of ethnic foods, my expectations were not super high. I was very pleasantly surprised when I walked in and it *smelled* of Asian spices and Vietnamese food! My friend and I ordered lunch for ourselves (beef pho and the beef noodle soup), which was really good. We also ordered dinner for our families, since we were in town for the Lost Dutchman swim meet and wanted to expedite dinner after the meet. \n\nI got two orders of the pork/egg roll with vermicelli, I also got lemongrass chicken and the beef chow fun. All of which was great! Service was quick and attentive, food was delicious and reasonably priced! \n\nIf you are in/around Chandler, and looking for some yummy Vietnamese food, I would definitely recommend this place!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2012-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1Hmk8poAzXERGSFfP-7OOg", "review_id": "xExNq0JVgog85P2bmIzJSA", "text": "The best Pho I have had. I'm also very picky because I only like white meat chicken Pho and this place's Pho Ga is the bomb. The food is fresh. The prices are unbelievably cheap. And the staff is very very nice.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2012-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "MqkHubyT3lYDNpHywTBN7w", "review_id": "Muqu842fQXLcorDIc6H6Uw", "text": "We ordered this to go and had I delivered across town to our ER for dinner...and it was still awesome!!! The pho was amazing!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2012-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DOJbGtr2vWTKSSl91xpsag", "review_id": "bnU79Xgb-NtBqxAIpEIznw", "text": "I give them a lot of credit for serving a wide variety of vietnamese dishes in a city that's easy for restauranteurs to take the easy route and do what's typical and still get enough business. The ca kho (caramelized clay pot catfish) and canh chua (sour soup with okra and taro stems) are hard to find in general,  popular in Vietnamese homes and done very well here. Never had their pho - suggest ordering their more atypical items!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2012-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iJUVamUkqL6VfEMfyQoujw", "review_id": "vClE5HWdQE-IP_oS709NKQ", "text": "Best Vietnamese in Arizona so far.....had the vermicelli pork and shrimp...mmmm delicious.....the thai ice tea was surprisingly not too strong, which in turn made it better than any i had before. Well done and the food was done super quick....the ladies were very nice.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2012-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LfS9-oXdYU3trE5pa1FcqQ", "review_id": "KWcmgu2AqduK222cp5w1xg", "text": "I've had lunch here a few times, and always had the Pho. Good food, good service. Plan to try out the other entrees some time. My go-to place for Vietnamese food in Chandler.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2012-04-23", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 4}, "user_id": "zZxr7X10CDThXZbnkLmNVA", "review_id": "hg7iBTZylFOxE4vPUW7Z4g", "text": "We haven't been here in a while, too far, but, tonight decided to make the drive.\n\nThis is an extremely comfortable place to eat, the booths and the lighting have been redone since my last visit.\n\nThe quality of the food and the service are both really great here.  The house crispy chicken and the Chinese broccoli in oyster sauce are my favorites.  The others had beef chow fun and pho 19.  The spring rolls here are somehow better than all the other spots with what seems to be the SAME ingredients.  \n\nLaurie still remembered us and what we  like after almost a year.  We will be back soon.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2012-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LqVbNZPV_MWvBnQKElcnLQ", "review_id": "AFGTRbZPJCa8gCUgMdC-5A", "text": "Amazing Pho, spring rolls, and Thai iced tea!! The place doesnt look so great from the outside, but its great food and service for a good price.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2013-04-02", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "wVSGZN8d3ao4ad97kEDzYg", "review_id": "oP25TPoNthiI-XmGfEf0EA", "text": "It's been a few months and although I've been able to try some other pho spots close by, for value, quality, and customer service, Saigon Pho wins in my book. Seems like maybe the month I downgraded them perhaps was a fluke (hopefully), because our food was excellent tonight. Fresh. And the customer service is always great here. Love this place and I'm here to stay!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2013-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7kpqx2qdD-PW3dD76GEbkA", "review_id": "mK4F5-tCjEH1jPhSCqO9ew", "text": "Always packed - Always great food! Sometimes the service can be iffy but that is because they are so busy. Once you get your order in, the food comes out fast and it is amazing!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2013-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "n-Z6LLhNUip8xeeeOfNjBw", "review_id": "wB4uErs_DPIrA78Z6LXing", "text": "Went in on a Thursday evening for some pho tai. Was quickly greeted and seated and had my order taken. Got #2 spring rolls and #12 pho tai. Food was out scary quick and was good. Highly recommended and I will definitely be back.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2013-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6mQnJ_Ouh3E0QRk2PrRF9g", "review_id": "blqMxgP3mw-Gs3BIBJXNZA", "text": "Bad pho is easy to find. Pho this good is not. The menu includes almost every variety of Pho possible, including a great curry option and different noodle options. It's not fine dining, but that's not why you come here. It is clean if dated, very quick service (efficient, not polite). Well worth the trip and I'll be back. Not quite as good as Pho Bang, but much more accessible to the East Valley.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2013-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iKDDbFu1lyA8-CVlGLFHcw", "review_id": "fHM0lUWdyrvBP3MREg5Cfw", "text": "Why have I not been here before? In 3.5 years of living in Arizona, I have been searching for a legit Vietnamese restaurant and this is finally it! \n\nWe ordered the duck egg noodle soup and the pork chop, shrimp, beef broken rice. Oh man. The flavors were on point! The broth of the soup was flavorful and yummy. The egg noodles were thin and just the right consistency. The duck was tender and juicy. Warms your belly! All the meats in the rice dish were well seasoned and awesome!\n\nService was super fast and efficient. I appreciate attentive staff that make sure you get everything you need.\n\nDefinitely will be back to try more dishes!! :)", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HnnKmgBDYIz-HDF8z5nbHA", "review_id": "Duhmjq34GTZZ07gRO8K1vw", "text": "I have lived 2 blocks from this place for a year and have not tried it until a friend brought my boyfriend and I here for lunch about 2 weeks ago. We have been back 4 times since! The food is amazing, the service is fast and friendly and the prices are very low. So far we have ordered the #12 pho which is great, perfect flavor, comparable to LA pho. The spring rolls are very fresh, large and delicious. The beef and basil chow fun and spicy sate beef are also amazing dishes. Great flavor and good portions for the price. Also try the thai tea! Very refreshing and delicious! Every visit has been a positive experience.  I cannot wait to try more of the menu.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bkPcxqiRYrIfzxHESSjCcw", "review_id": "k7St1Xzv6bubrUdY5ANeIw", "text": "After being there three time I guess I could give it 4 stars.  Their food were good. Prices were cheaper than other places that I have been . Service was fast as fast food.  Plenty of waitresses to wait on you on weekday. But on the weekend they may forget that  you are there.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2014-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FjDJcEFfPa9eHxmU32vcLw", "review_id": "COCp3hF2l4KN32bLpZHa5Q", "text": "The food is consistently good here over the years.  Service isn't always so great and though this sounds bad, I just don't expect good service at any Asian places that really cater to real Asians.\n\nOur large extended family sometimes comes here and gets 2 large tables and just chows down.  Everything is really good.  I really love the Beef Pho, their spring rolls, their eggrolls.  I can't think of all the things we've eaten here, but it's all good if you can stand subpar service.  If the service were more like at a Caucasian restaurant, I would give it 5 stars.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2014-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DhBET_jSLj7jdtvnRzmgmg", "review_id": "psWwgmhb9xpVrY9iw3IukA", "text": "The food is always great. Full of flavor and the meat is tender. Everything we have tried is great. Some of the things we like is the salt and pepper calamari. Recommend #40 order it with crispy noodles and what ever meat you like. Pho  is always good too. Or the vermicelli noodles with pork chops and grilled shrimp.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2014-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TyzoHZ3Fo80gP2ezEzp2zg", "review_id": "Xbzce50t2SUp0C0SsgIRpw", "text": "I have periodically visited Saigon Pho on Alma School for the last four years.  Today, our visit was disappointing.   When I asked our server to please use a clean wok when preparing my meal due to my nuts allergies, she seemed to be offended by my request. ( I've asked on prior visits with no problems.)I was made to feel, by this server, that they have high sanitation standards.  As much as I was hoping this was true,  my friend's spoon for the iced coffee had arrived with dried cilantro baked to it.   My other companion's Pho bowl had come with dried dark sauce on the exterior.  Mmmmm, not my idea of clean.  The server was sarcastic but we were there to have a nice dinner.  My entree tasted okay but the meat was chewy and cold.  The rest of my foodie group enjoyed their dishes but now I will just stick to Cyclo and Chandler Pho for my Vietnamese cravings and pleasant service.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 2, "date": "2014-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "c3y3mVpDVrNIdNzuQmABag", "review_id": "wRdRJw0lh0EVokz2sHxGig", "text": "Saigon Pho on Alma School in Chandler should never be compared to anyone else using that name. We went there last night for the thousandt time and still loved the food, menus and taste. This place is a clean no frills friendley and fast service restaurant. Not only is the food terrific it taste good and almost everything on the menu is under $7.00. Yeah I said $7.00 it  not a typo. We had an opening of fried Salt and Pepper Squid or (Calamari) for you Italainas and of course iot was tender and crispy with a geneous portion. I also had to order the Saigon Noodle soup that has Oxtail, Tendons and meatballs which sounds weird but taste out of this world. That bowl in itself is hard for a big guy to finish. That was $6.50. Ridiculously affordable as I could see with whole familie od 12 eating in the next didning area.\nDepending on the day they also can have live lobster, Tilapia, Crab and so on.\nNot all the food is made with Oxtails or Tendons so if you not adventurous there's plenty to choose from thta well worth ordering. Try The Cuury Chicken soup with Chicken, Curried Brith, Basil, Bean Srouts and Jalepenos. Way over the top, Huge and oh so delicious. This is one little restaurant  thats worth the drive from wherever you are.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xCoHbiPDyCKTJSXCBgE7HA", "review_id": "AlaYIPs0Amhj7FLiqyqeHg", "text": "The price was perfect! Especially for the amount of food you get. Will def be returning soon!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2014-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "omoEjYFKVV7e-DtnezeUOw", "review_id": "jpjnMiPG2driTkMLphDTCw", "text": "OK so call me a sucker but I went back because it was Monday and several of my other \"go-to\" lunch spots were closed. Much to my surprise, Saigon Pho is BACK!\n\nAfter a horrible dip in quality, something happened and the food is back up to par as it had always been.  I've now been back four times just to confirm my finding and each time it's been great.  I couldn't be happier because I've yet to find a place with broth like theirs.\n \n\nWelcome back Saigon Pho.  You have sorely been missed.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2014-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ppnZMcCpfkq58hGWBlbu6A", "review_id": "LzVsCDkctn1GlLJUpMe54Q", "text": "The food and value at Saigon, bar none is a 10 for me.  I love the sliced beef pho #12 which I must order with an order of spring rolls.  The soup is always hot and fast with fresh sprouts, lime, and basil.  As for the spring rolls, well I have an addiction to these fried egg rolls wrapped in romaine lettuce and mint.  On occasion I will splurge and order a fresh drip ice coffee--a nice finish to a good meal.  \n\nThe service is swift and mildly courteous which is fine by me only because the food is exceptional!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JTksgaVC3YkwVbBHvXabRQ", "review_id": "ZYX_OxxsKntwOI6GM3L4TA", "text": "Best Vietnamese food i have had in the phoenix area. \n\nIts all about the #17 (spicy beef noodle soup) and #2 (spring rolls), have to get these almost every time now. Other food is good as well, with some i have seen that just seem ok but they have so many options i wouldn't order those anyway.\n\nPlace is a little old inside but can be overlooked for the taste and value. And they are quick, so good option for lunch.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2014-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0VlbKZ56cm2bJPGr3uCIeQ", "review_id": "ty7ckF75VGIS0oW2n5d_5Q", "text": "They have excellent food at a great price! I usually get a 43 (Beef and Basil Chow Fun) and another dish to go with it. It will last me 2 meals and usually for around $15.   I usually get to-go and it is very fast and a quick in and out. However, when eating in the service is not great. They are ALWAYS busy no matter the day or time, so it's hard to get good service, but once your order is taken it's not a super long wait, the wait is to get your order taken. Other than that, refilling water/drinks is sub-par, usually have to ask for it. However, the great food and prices make up for what the service lacks.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2014-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "n43bKvQ7mcscXKJkul5ANA", "review_id": "hoSfftSe__VC3eMOsy74iQ", "text": "Pho is my favorite and this place does it well! The spring rolls are amazing! I love that you get the Carrot infused fish sauce to dip the hot crunchy rolls in! Amazing! And getting a vat of soup is nothing to complain about either! I always get the #1 and the #12. The #12 is the Fresh Slices Beef Pho, through some jalapenos and lime juice in there and eat up! Mm Mm Mmmm!!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0im42GxrY9Oh2EGSswisOw", "review_id": "l4Sr2JBut1akRerEGTyjGg", "text": "I have lunch at Saigon Pho a couple of times a month.  I usually have some type of Pho in the winter and Bun cold rice noodles in the summer.  Both very good.  The Egg Rolls and Spring Rolls are also a nice starter.  I would also recommend their version of Sweet and Sour Chicken, done in a light sauce and you get plenty for the price.  Another tasty dish that is kind of hidden on the menu is the Green Been with Sausage.  Really good food at a really good prices!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2014-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eJv4EdjFYvpwE9qtPycf0g", "review_id": "2l1qYF_nY8A7iqU-Yh2OAA", "text": "The food is really good and quite affordable. It is a very simple place that is very close to home and a very easy feed the family without breaking the bank. I have not ever traveled to Vietnam, but I imagine it would be as authentic tasting food as one could find here in AZ.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2015-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6yTkDWCDGGH_5-Pr165WUg", "review_id": "D_jeqasAUTqDwRQWY755Fg", "text": "Cheap eats spot! You can find Chinese or Vietnamese food here the food is consistent and the price is between $6 - 8 dollar for a plate. I always come here if I want to grab a quick bite and don't want to drive too far or wait too long. Always happy here.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2015-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ciYv5_7pPTRfzqV2YGjHRQ", "review_id": "PjuNXh2RO3-hT3hn5p1ryA", "text": "This place is quite seriously the best Vietnamese restaurant ever.  My family has been here on countless occasions, and I'm happy to say that the quality and consistency are there.  \n\nThe eggrolls are to die for -- they're stuffed with steaming filling, covered in a crispily fried skin, and you wrap them in lettuce and dip them in this sweet-sour carrot concoction that is so delicious that it makes you swoon and omg my mouth is watering right now.  \n\nThe pho is perfect.  Best pho I've ever had -- flavorful broth and tender beef that melts on your tongue with the pho noodles that absorb the complexity of the soup.  Their egg noodles are also delicious, rich, and it reminds me of the noodle bowls that I get whenever I visit my family in Taiwan.\n\nThe lemon grass chicken is superb.  I always ask for them to add in more heat, and they always deliver because I'm sweating and crying as I eat it, but I just can't stop.  Beef and basil is also amazing -- slightly floral with juice slices of beef that compliments their fluffily steamed rice so well.\n\nI could go on and on about this place.  The prices are also wonderful; my wallet is a fan just as much as I am.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2015-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "K2Bc66aRnvqIHvzykWDxjg", "review_id": "TMzxlIRgchdKsO4OrzF42w", "text": "This seemed to be a very authentic place. Spring rolls and egg rolls were very good. Pho was good. Teriyaki chicken was plain. If you don't go for the pho, don't go. If you like pho, you will love this place.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2015-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vOhSOhj8nuij56cLB-XAGg", "review_id": "ZvUF5vxlQi7SEPbdk3lo3w", "text": "This our our go to place for Vietnamese food.  We've never had a bad meal and the staff are very friendly and helpful.  Don't worry if you've never tried Vietnamese food they will gladly make suggestions.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2015-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RFo1ZzWJ2yUxAdL1dUl9uQ", "review_id": "Klpps7FggOV2NyKbcS0gdA", "text": "Very much your classic mixture of Asian cuisine, mainly Vietnamese in one place. Servers have gotten better over the years, more attentive to orders. All of the food come out super quick! Definite plus. \n\nMy family and I ordered the salt & pepper squid (calamari), house chicken, beef pho, Chinese broccoli, and house fried rice. All very delicious & our regular orders to say the least. We always get Thai iced teas as well. \n\nSaigon pho is my fave restaurant for pho in the east valley!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2015-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "bZwPeUxsgCKId0fSbBUF0A", "review_id": "9Xj4HGuZ5vFjuwkFMqpQ7g", "text": "We have been coming here for years and the service and quality of food has been declining and getting worse EVERY SINGLE TIME. Other members of my family have already stopped eating here a long time ago, however we still did because it's conveniently located right next to our house. The service has always been bad, rude servers. Ordering for pickup is always such a grueling task.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 1, "date": "2015-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "V_pSVhzHr6ZeTxiaxgkUmA", "review_id": "2s5SrY4nBqO_5BYgqX1Iow", "text": "Had another bad service . We were seated always at the corner. I waited for check fir 20 minutes, no refills.. Never ever coming back... They cut down on the meat too.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 1, "date": "2015-04-26", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "m7JXYutItIkHQ-2EFfPW5A", "review_id": "hwWmQ9A3-Lz7LCO4XLWBRg", "text": "Consistency.\n\nSaigon Pho is consistently good.\n\nWe've been patronizing Saigon Pho ever since about 2005 when Noe, a classmate of mine, said that Saigon Pho has \"the best pho in the valley.\" We really enjoy this place. The service is good, the food comes out quickly, and the prices are not bad.\n\nWe usually get the pho called \"Saigon Pho\" (#10), spring rolls, and egg rolls. Sometimes my kids get young coconuts and/or Thai iced tea. The beef chow fun and house crispy chicken are also very good.\n\nI should have reviewed Saigon Pho many years ago, but kept forgetting to do so. This isn't a very long review because there's only so many ways to say that this place is excellent!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2015-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ONsctmp-cReNADFYFlpdpA", "review_id": "98BYfXrv_zi5sE1QZhb5vg", "text": "Saigon is by far my favorite pho stop. I come here every time I'm back home in Phoenix or when I am craving some hot soupy noodles. \n\nI almost always order the same thing when I come here: the spring rolls, a pho tai (#12), and a combination 3 bean drink. The spring rolls are perfectly crispy and go very well wrapped in the big lettuce leaves they come with and dipped in the fish sauce on the side. The meat in the pho comes in very thin slices that finish cooking in your soup at the table - yum! (I love adding sriracha and hoisin sauce to my bowl as well for added spice and flavor) The bean drink is cold and refreshing, and a sweet addition to the meal. \n\nI would recommend Saigon to any pho lover or anyone looking for warm soup on a sick day. The pho is authentic and delicious, as well as the other dishes that I've tried here!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2015-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "48DXrpTDt2OOpLt-9rsFoA", "review_id": "9v26LXyALENi1BqGrKSMrw", "text": "I went here because of a lot of reviews said it was good.  Well, it's okay.  Nice for a fun date night or if that's all that was available to you.  I had the spring rolls... those were okay.  I had their pho.  It was okay.  The thai tea was nice.\n\nThe wait staff was friendly... not the fastest, but having been around many many many Asian restaurants and their workers, I'm not going to care about the service as much as I do the food.\n\nI felt the prices were a little high for what you get, too.\n\nDo yourself a favor... have the pho or the barbecue at Yen Mi... and if you want really really really good pho and spring rolls... help yourself to a little hole in the wall on 19th Ave. called Da Vang.  HANDS DOWN the best pho on the planet.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 3, "date": "2007-04-15", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 4}, "user_id": "GZFiCRwm-bVauSRtTKhb4g", "review_id": "no4wB3052X2VxwbIFC9IFg", "text": "I live in the NE valley and a drive to Chandler is not an easy one...But knowing that on the other of that drive is a worthwhile is priceless.  Cyclo is just that place...It's a small hole-in-the-wall next to a Subway in a strip mall.  you'd probably pass it and not know it's there.  It's a hidden gem that a lot of people know about, but hasn't lost its integrity.  I have been there a number of times and each time loved it more...\nIt's BYOB...Great!  Bring exactly what you want to drink...How many times have you seen a menu without a drink you want? \nYou show up and wait...but, it's well worth it.  The owner is worth it alone.  She is fun, young and has a sharp tongue...Come ready!\nI asked her last time what she recommends or eats daily:  rare sirloin soup ( sorry, veggies! ).  I then asked how she eats it:  a bunch of Sriracha and garlic...WOW!  She was even cool enough to stay after closing and just talk to us about life, running and the restaurant she is so proud of...Well done indeed!\nI have two reasons to go to Chandler:  Cyclo and IKEA :)\nWorth every cent in gas....", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2008-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "3ZK0J13qiy-OwMo7v_eqtg", "review_id": "8LZyWOFOgfuoi95RJZkknA", "text": "I saw the reviews and wanted to try this place. I found it to be rather average for beef Pho. The only negative was the side of bean sprouts that came with it were a little old and wilted on the ends. I did like the place but I don't think it is above average. I don't drink wine with my Pho so maybe that is a plus if you do. The people are friendly and the service was good. The Thai Iced tea was good too.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 3, "date": "2008-03-20", "type": "review"}
{"votes": {"funny": 5, "useful": 5, "cool": 3}, "user_id": "mEMZxvHpemSxn1gl7Lj1Zw", "review_id": "OHLAAQSG37tk0zauU3t36w", "text": "Cyclo is over-hyped in my opinion. Two major set-backs for me is the rude and curt owner-hostess, Justina Duong. She is just plain obnoxious and fails in her attempt to be humorous and charming. She actually believes that she is a culinary standard bearer in the Valley.\n\nThe other is based on several breeches of hygienic standards. I have seen stuff that made me cringe. I love pho and Vietnamese food beaucoup, but I won't return on foot, taxi, car or pedal car.\n\nCall me a Dinky Dau Long Nose, but I just don't get the appeal.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 2, "date": "2008-03-23", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 1}, "user_id": "WIPlQlKy12ShNlAwg7tKaA", "review_id": "gLKPncPk0_LNWVONdaBJ6g", "text": "I had the pho and my friend had the vermicelli with grilled meat and egg rolls.  Both dishes were tasty.  The decor was cute but very dark for dinner.  The owner is very flamboyant.  One coworker loves this place.  He also says he was kicked in the head by the owner with her 5 inch heels and she threw trash at him.  Another coworker believes she is so rude that he will never go back.  I think the consensus between most of them is that the food is good and the owner gives a good performance. My friend and I did not receive a special performance but she does dress to impress in small tropical outfits.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2008-05-07", "type": "review"}
{"votes": {"funny": 4, "useful": 7, "cool": 4}, "user_id": "QrOSr8bzAjpIgyNftDLUBg", "review_id": "_FGGzP-5Q9PAmOycvsbHAw", "text": "The food at Cyclo is entirely over-shadowed by its outrageous owner, Justina Duong.  If Justina was a gay man, she would make a great drag queen.  I think she's a hoot, but her outlandish behavior and brash comments do not work for everyone.  \n\nI have a very dear friend who lives in Chandler and she and I would go into Cyclo quite often.  My friend is married with three kids, but just she and I would go in.  She would always tell Justina about her family and show her pictures of the kids.  Justina really gets into teasing the customers and after a couple of years, she told my friend, \"You crazy fag-hag.  You never bring your family in here.  You just come in with your gay friend.  You don't even have a family.  Crazy Lady, you just carry around those pictures to make your lonely self feel better.\"  Justina also plays up the Vietnamese accent.  She can be off-putting at first if you don't know what's up, but the floor show never disappoints if you're willing to play along.\n\nThe food is good enough now, but it was better when the restaurant first opened.  The star dishes include Tom Rang Hat Tieu, an appetizer of shrimp on toasted baguette slices with a savory black pepper sauce that is plate lickin' good.  Another delicious starter is Banh Xeo.  It's a crispy rice crepe with shrimp, pork, sprouts, and lettuce leaves for wrapping the crepe slices before you eat them.  For entrees, Ca Ri Ga is a tasty chicken and pineapple curry and Com Tam is a mixed grill of a marinated pork chop, beef, shrimp, and egg over broken rice.  As a side dish, the Dau Xanh Xao Toi is a sublime preparation of spicy garlic green beans with chili and sweet soy.  \n\nHowever, the quality now varies.  The last time I went the pineapple curry was totally bland.  Even though I have eaten at this place many times, I didn't say anything because I didn't want to be bothered with Justina's reaction.  Instead, I haven't been back.  \n\nI have been into Cyclo when Justina was not there and the quality of the food was nowhere near the same in her absence.  My concern is that Justina has announced plans (yet again) to open a second Cyclo in the Valley.  This time it's supposed to be on Central Avenue south of Camelback and across from Brophy with a fall 2008 opening.  Once that place opens, I assume Justina will move her floor show to central Phoenix and I am left to wonder if the quality of the food will continue to slip in Chandler.\n\nCyclo has a BYOB policy and some people are really into it.  For me, it's not a huge selling point.  I prefer not to schlep my own booze to a restaurant, but it's cool if you're into it.\n\nIf you go to Cyclo, hope that Justina is there.  You're really going to Cyclo for Justina's antics rather than the food.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 3, "date": "2008-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XfUbS8krsXec3nKYA63jrQ", "review_id": "2wuyHAyNunsk4uLKUls8qw", "text": "Didn't care for it.  Expensive, small portions, and mediocre cooking.  Go a few blocks west to Saigon Pho if you want the real thing.  But this place is prettier, whatever that's worth to you.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 2, "date": "2009-03-30", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "e4TQFVfepzHf--hnBsjntg", "review_id": "Ow5o3OkJEzgbsXK3fr8JVw", "text": "Very good. Cheap.  Too bad it is located in the seventh dimension of hell (aka Chandler).  I would eat here every week if it wasn't.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2009-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "L71NWK9Rt6GIpsUn9rPCtQ", "review_id": "l1kJb0ISDj6QNwghwnuQFQ", "text": "Its BYOB. The owner is hilarious. The food is really good. The service is interesting but not bad. It is what it is. Its not fine dining and your not paying fine dining prices so relax. It kinda ads to the charm for me. Good times...", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2009-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J_zxvVNx2V4fa8kPHvupSw", "review_id": "ttDv7fEPkx5anIiXKsiIqg", "text": "Not bad but I don't see what all the fuss is about. Thai Basil on University is equally as good.\nKahi Hoan on Apache in Tempe is still the best but not as decorative.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 3, "date": "2010-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xr0WOufnic1HGML_jo3KSg", "review_id": "X3e4dVgtSwHe3bKpX3S37g", "text": "Food and atmosphere is great! The owner is fun if you get to meet her. I love the fact that you can BYOB thus saving a ton of money on drinks.  I have had less expensive Pho though but the Pho here is great!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2010-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "PgDqj6eI1reoGj7IxhPNew", "review_id": "gV8yCgjH_KpEE_Wbu5hOrQ", "text": "I agreed with reviewer, ' Ima yelp'.  What a rip off.  $12.00 for a small bowl of noodles. I find nothing special about their food that can justify double price.  Taste, texture, ingredient, serving size - everything is the same as other Vietnamese restaurants that normally charge between $5 -$ 7.00.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 1, "date": "2012-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "b2DKC4kC8-QeSeGZ_MF3XQ", "review_id": "Z-UOdzAgy7LXSfGJt6c5rQ", "text": "Great prices, just sized right portions with incredible flavors and the owner Justine makes it a lively festive experience. BYOB with no corking charge.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2013-03-17", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "t2YBANsJYySOXvHyOjcZkQ", "review_id": "NuvTSq6HaPdy1onkQS9k-A", "text": "Love the Pho and Justine. I want her to be my stylist but apparently she's a bit busy. Fine I'll just have the Pho.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2013-03-19", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 1}, "user_id": "wVSGZN8d3ao4ad97kEDzYg", "review_id": "LSoDiDaYY76KPBhd-_16UQ", "text": "First, they don't answer their phone. Next, they are closed between lunch and dinner. Finally, it is ridiculously OVER PRICED for the area and quality. $43?! I literally pay $24 for the exact same order at another pho spot very close. I'm not opposed to paying out the nose for great food, but it better be just that. And it isn't.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 1, "date": "2013-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "wM32gNcp_GtJypM7iZKIcg", "review_id": "_PWOY18WI_ZAgUtydJYs3A", "text": "The first thing you will notice here is Justina. She is warm, friendly, and, if you show up alone, she will sit at your table and get to know you. I had never had Vietnamese food before, so couldn't tell what to order. Her recommendations were the Vietnamese egg roll, Spring roll, and the Black Pepper Shrimp with garlic toast. The first two were good. Although, my pallet did need to get used to the Spring roll, because I did not expect it to be a cool dish, I thought it was delicious. \nMy favorite? The black pepper shrimp. It had the perfect spicing between the garlic on the bread and a little bit of cilantro, I definitely wanted more. \nHighly Recommended!!!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2013-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5WCmTakHXfDQXW4D6hUKBg", "review_id": "2HPvmaQcVr8nDZUSpP-hlw", "text": "Great ambiance, simple yet elegant menu, and consistent service and food. I visit Cyclo every other week and it's always a pleasant experience. Plus, to converse with the owner, Justina, is a delight. Witty, fashion and fabuchic!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2013-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_qAwk97mA2vyB2v7uEorng", "review_id": "NJAoNim0xKJI_j92WEnyhQ", "text": "Addicted to the spicy green beans :) and pan fried egg noodles are my go to main dish.\nI have tried several things that are good here but love the fried noodle with beef, shrimp and scallops. Husband loves the Pho, fried rice is great, lemon grass chicken, black pepper shrimp all good. If you chose wisely, it's not difficult to eat healthy here too which is a +.  \n\nWe love to bring people here for the adventure...if they haven't had vietnamese before and then there's the Justina experience. She's a little spit fire and adds a ton of fun to the already great atmosphere. BYOB makes even more affordable.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2013-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "bLU-JK1dAmSnztxWgFjWCw", "review_id": "iH2hPBK2z6RDp7GQAW2qWQ", "text": "Hmmmmmmmmmm\n\nFirst, lets get the food out of the way - it was ok. I ordered the pad thai and have had better. There were -only five baby shrimp in the whole bowl! It wasn't bad, but for the price, it should have been fantastic.\n\nAmbiance: hopefully, what we experienced was not the norm for this place. With all the f-bombs and unimaginative cussing from the painfully drunk table next to us AND the owner (she had to be the owner. I cant imagine an employee getting away with that.) it felt as if we had walked into a Quentin Tarrentino movie. I expected to see Christoph Waltz sitting across the room.  \nMy sister had a headache when we arrived and it was only intensified by the forty year old frat boys. After awhile she wanted to ram her fist down their beer holes.\nOf course, that should have very little to do with the rating but, the fact that they were being encouraged by the establishment, does.\nBad first impression.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 2, "date": "2013-05-29", "type": "review"}
{"votes": {"funny": 1, "useful": 7, "cool": 0}, "user_id": "gYcLmcMSTaEvJBFBO3U_Kw", "review_id": "TLHIa7hZM377R6Ug7TLQew", "text": "My family went here for dinner and I am 100% sure the staff, especially Justine, was prejudiced against us because we were Vietnamese.  The Pho was mediocre and all the food we ordered were overpriced.  While Justine made her rounds to chat, flirt, and engage all her Caucasian guests, we were ignored and forgotten.  And by \"forgotten,\" I mean, they didn't bring out our food until we reminded them we existed.  Yes, the greens and food were fresh. However, calling this place a Vietnamese restaurant would be comparable to calling Taco Bell a Mexican restaurant.\n\nWe didn't care so much about the price as long as the food was good. However, since both the food was sub-par and the service was terrible, this is one place we will not be returning to.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 1, "date": "2013-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "afKFH5X33v-5wekJWXjsOg", "review_id": "QTr1dFmwa4XB1ztOc0wiRA", "text": "Food was good! Lemonade was excellent! And the owner is spunky and interactive! Can't go wrong with whatever you order!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2014-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zMNdjPWMKQCY9140FdXxyg", "review_id": "BbIQ_Axy0eUsGElLTTcQug", "text": "we had vegetable rolls, pho, green papaya salad, chicken curry, and fried rice.  I have had vietnamese food all over the country and this is some of the best. The only is extremely helpful.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 4, "date": "2014-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lzIyGPLGbSP3wPzDim2IOQ", "review_id": "z6RsFnGraVZsJjMNG_MNlg", "text": "Always a great time! Food is good and everyone is fun. If you don't want to have fun, you can try Panda Express and be boring.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2014-03-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "3VrmfYq9WPq5eJs2zqN_jw", "review_id": "nx8gF4AKltCyKoeSfdZjsg", "text": "After reading some of the reviews about Cylco I had to come back to write my own. Cyclo was highly recommended by several colleagues and I had to try it for myself to see what the buzz is about. \n\nFirst off, for all you who come from somewhere else...Like \"The Bay\" or \"New York\" or wherever you come from...? Just as a reminder you currently live in Arizona! I'm from Louisiana where there are also a lot of great Vietnamese restaurants, but who cares...I live here. \n\nMy most cherished dish here is the X.L. Beef Noodle Pho Soup. It includes braised brisket, rare sirloin, rice noodles and all the fixings so be prepared with a huge bowl if you get this to-go. If you think 12 bucks is too much for this bowl, go to some fast food franchise. The location is relatively small and intimate with ambient lighting in the evening. Additionally this is a BYOB establishment so feel free to bring your own wine or spirits...Try that at other Vietnamese restaurants!\n\nJustine is mind-blowing and awesome in her own way! She's the owner and also works at the establishment. She's straight forward and not afraid to speak her mind so she's not for the weak hearted. When dining in, she makes her way to every table to ensure your dish suits your desire. \n\nI hope this was informative and most importantly...Enjoy your meal.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2014-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eoRVezPaHnx2Iwl4kF1zUg", "review_id": "7zPYHekeD2y3RYayfmpcAg", "text": "By far my favorite Vietnamese food restaurant! Atmosphere is awesome, Justine (the owner) is fabulous, and the food is yuuuuummmy!!! I especially recommend the beef pho!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2014-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8nltjuse1izC-phpxoNTmA", "review_id": "ccc2lHDzAbsJZxAetcWccA", "text": "the food great, the conversation between justina,michael always real and pleasant. the veggies and tofu fantastic,colorful flowers always enjoyable. never bad meal,pho excellent homey, for those who say expensive have you bought fresh vegetables,as for the acrylic chairs very popular in vietnam, as for justinas foul mouth her heart is good you have the option to say we just want to eat not talk or go the f somewhere else", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2015-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UOhiHbdnhoeQaMr5r2bTZg", "review_id": "CXnkvFLBkiePjz-OnIuYLw", "text": "Awesome vibe and decor, even better food. When you sit down, you're served water with lemon, watermelon, mint and raspberries in it. Yum! The food is super fresh tasting! I got the beef pho & you can tell it doesn't have any MSG- it's not salty at all so a bit surprising at first but it's way better!! The owner is super friendly and walks around table to table chatting with customers. She was hugging the regulars and taking time to get to know people. Best part- it's BYOB! I highly recommend this restaurant!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2015-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-8Fb7aqchHBFn8hgf5Ol2g", "review_id": "tD3hF8H_yUxUzmqriqHW5w", "text": "Food is amazing!  True definition of a local joint! Justina is a riot and why I go back every time!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2015-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WYJvLlICJ2bOn2j1Q2P1tg", "review_id": "UgdEaoBBgqzFvKgAs_CxiA", "text": "So far so good, nice service, fancy water, good tea.  Ordered the beef soup totally awesome !", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2015-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vanHTBGyAxR83MpRkV3aUA", "review_id": "SHNXgfq0g1N-u5ne1yjznQ", "text": "I am always satisfied with Cyclo. I usually get their Saigon Vermicelli and their spring roll appetizer. Staff is friendly. It's BYOB. Friends have gotten pad Thai, curry and soup. All would recommend. I would probably suggest they review menu pricing but their portion sizes are really generous. I can usually wrap the rest of my dishes to go but not the soup. Dishes run about $13. I think they could offer a \"regular portion\" for $9.95. I would have got an extra appetizer.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2015-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "82DZct7DIp_s-kRpLWtE-A", "review_id": "_V1JijSk5v1TXtYJ37FcnA", "text": "Service, food, decor and again....food, all top notch.  My only complaint is I didnt know of it sooner.  I'll be back weekly.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2015-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jryp_9BFmqwQSpWmMvkzzQ", "review_id": "xMeEW9gj_cwcP3xX1SbffQ", "text": "If you don't mind sharing your food with the giant roaches crawling along the back of your booth then you might be okay.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 1, "date": "2015-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Gf-7bqM-dTaImuvfZGhJ2g", "review_id": "6oo8b5klKWl6c1wxLLaN7w", "text": "I am not Vietnamese, but this food rocks, this place rocks, and the staff rocks.\n\nFirst off the food is awesome. I don't know what authentic Vietnamese food tastes like, but as far as I'm concerned, if this isn't authentic, then I don't want authentic. Fresh ingredients, good spices, and fun options.\n\nSecondly, the atmosphere in here is modern and really fun.  Apparently a Cyclo is a type of Vietnamese bike-cart type thing piloted by skeletons, and they're all over the place, along with cool modern art.\n\nLastly and most importantly, the staff is really fun. When we came in, the lady who seated us and took our order (I think she's the owner) harassed us for taking too long to order, and then started hitting on one of my associates because he was from Utah and thus probably a polygamist to her. It was super fun.\n\nI've been back only once since, but I can't wait to go again!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2015-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8ACSIY5EkRtHVlyWzjQ7NQ", "review_id": "c1tKSHX-DszZE0yAaPAANQ", "text": "Wow! What a surprise find... The service is fantastic. The food is fantastic and the place is clean and modern. I loved it.\nI will definitely be back. They made me feel very welcomed being a lone diner.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2015-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cw-G7BuGF7nnqfJc7AV6QA", "review_id": "aSvuhbBYEa4rMeIrfTvMQA", "text": "My favorite Vietnamese restaurant.  I crave the crispy noodle cakes and fresh spring rolls regularly.  I love the owner who remembers me and my food preference each time I return.  I wish I could find more local restaurants like this.", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2015-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qpAAMHi6e_CirzXHxwvalg", "review_id": "cHlhFl3ecU6qj9KtbNUQww", "text": "Can't recommend this place enough. Justina is a total crack-up, and treats you like family. Going here tonight with some awesome friends. Can't wait!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2015-05-20", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "Z8DyUMojRhFbLyHBymM_rA", "review_id": "CdzMSWj7ccSdPcS19XwRQA", "text": "i don't know what's up with Pho being so medicinal. especially when you're hung-over or still drunk from the Vegas festivities. all of my friends were whining about how much we wanted Pho for dinner- so we went to this place that our local friend took us to. of course we cracked up about the name... Pho-Kim-Long... how can you miss that? oy. \n\nthe service is so-so. our food came out relatively quick.... but we waited forever for our drinks. those were the first things we ordered! however, my soda with sugar & lemon was so delicious... i didn't complain much. my shrimp Pho was decent. everyone else didn't finish their Pho, though. i think we're used to delicious Pho in Seattle. plus, my local friend told us this place was a little Americanized and not the very best. it was our last choice because of what time it was.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2007-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Gswhjfxr-3rvx5yquzLaWw", "review_id": "BiGxm8LeU4jpvutQElZOdA", "text": "I walked in with a friend and the first thing I smell is windex. No, not from the glass door. More like they replace the air-refreshener refills with blue windex liquid. I haven't tried their Chinese cuisine. Their pho is okay. Not enough noodles. \nOh yeah, the tables can be quite sticky.\nService is really lacking here.\nI haven't gone back since and I don't think I will.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 2, "date": "2008-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "0y9qZZLauQ3sPp-G-NcE7Q", "review_id": "NJRp3o2u9nWQVFTgIvEtSg", "text": "This place was not as great as everyone said. The pho broth had no flavor at all! It was less greasy than Pho So 1's,  but when it comes down to taste...there was none! Also, the service could use more work...\n\n(Maybe I'm just spoiled by good 'ol California Vietnamese food...)", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2008-03-30", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "AHsfTiLmnTBRoPDaolhv-g", "review_id": "odoD9KQSZg0E6PzIylWjuw", "text": "Pho kim? I hardly know him. \n\nI loved this place even before I knew the name of it. I go there usually after working long hours at SEMA every year. And I swear I never looked at the name, because I was just so grateful I could eat decent Asian phood in Vegas. Then I finally got it. Geez, I am slow. \n\nI like their lemon-limey fizzy drink and I just get their regular pho tai. So good at 3 am.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2008-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TwObC4m9W3-TxxHMMaUNug", "review_id": "sFvFFJE5yU_uWhO_XWGQ9w", "text": "Good food, sub-$10 pricing and large portions. Conveniently located, ample parking, clean atmosphere, and large spacing between the chairs so you don't have to scoot your chair when large people walk behind you, and there's always good-looking girls to stare at as you pretend to eat your food. What more could you ask for? Just eat here, ok?", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2008-05-27", "type": "review"}
{"votes": {"funny": 4, "useful": 4, "cool": 4}, "user_id": "D_NLQyF1w8CaDX4fh7Hl8A", "review_id": "ergACOcYtZCeu6jUDuSNYQ", "text": "Having just had the pho at Pho Saigon 8 yesterday I can definitely say that I like the broth better here at Pho Kim Long.  It is sweeter, not as salty, and more aromatic.  \n\nI ordered dac biet Pho that only has rare beef in it but you pay an extra $1 and they add tripe and tendon.  I then asked for double tendon.  It was good.  The broth like I said was solid.  The vermicelli, meat, and condiments were all good. \n\nIt is a little more pricey here but the service is great and the place is large, nicely decorated, and very clean.  \n\nI will be going back for more pho and to try the bun.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2009-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "y2TOU8CqRLZEa_pxXYaVFg", "review_id": "8lMTw0xBWX2JPLjotQwdow", "text": "OK, OK...yes, it's true, we've been driving past this place for years on our way to dim sum. Yeah, it's also true there is no shortage of giggles and laughs every time we pass this place (think Beavis and Butthead...\"HEH HEH HEH...you said \"PHO\"). But hot damn, I am through making fun of the name, this place is damn good! (okay, maybe I'm really _NOT_ finished making fun of the name)\n\n#10 rocks, so do the egg rolls. Try it. You can thank me later.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2009-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S6xA_236XDinauqdBakSzA", "review_id": "kXcbX4lPKhaBWDxErDwYUg", "text": "theeeeee best pho ive had!!! WOW", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2009-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "c5MDwut8ojfoeAkD__UpSA", "review_id": "Lihu8idPMHmXEbcVhxnr2w", "text": "Great late night dinners good Vietnamese food, love their pho soups :)", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2009-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "A43V-IweZIQkbMnvKf0vrw", "review_id": "fF-Zni6ZWaBjnyMnlakpbA", "text": "Was visiting LV August 2008, now found out I'll be moving there permanently soon.  Went here for lunch one day, and the meal (pho) itself wasn't bad.  The broth was tasty, the proteins were good (I forgot what I ordered) and the serving size was also good.\n\nI guess my issue when I went there was that whenever the wait staff would give me my beverage or check, it was placed at the end of the table away from me, which I found to be unusual.  For example, since I ate lunch by myself, I had a single table that seats only two people.  The bev/check was actually placed at arm's length.  Is that a Viet thing?  I'm pretty sure it was the wait staff's perceived issue with me.\n\nBut, as I mentioned before, I'm moving to LV soon and willing to give these folks another go.  Love Asian food, being Asian myself, and would really hate to not come here because I perceive some kind of issue or displeasure with me.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2009-03-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "4h4XKgZ1lP3iv1fVST2vZw", "review_id": "Zq3X3nY_arHaYnHfEkpGog", "text": "I love the Pho here, and now that I'm pregnant, I love it even more! it's hot, clean, and makes me happy.  ^_^  What I like about this pho is the noodle.  It is so soft and tender, unlike any other Pho Ive ever tasted.  Service is good and fast (I'm the kind of person that dislikes chatty waiters).", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-03-31", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 1}, "user_id": "7h7IlYzn2j2b7AH-801EtQ", "review_id": "0BzxB0t4hH_3Z252lhiHMg", "text": "LOL, LMFAO, ROFL!\n\n\"Fuh, kim, long....\" - \"fuhkimlong\".....\n\nOk, so it was funny for me for the first few times I said it..... \n\nThe Pho here is pretty darn close to what I had in Vietnam, I mean it is just broth, noodles, and beef... but here you can tell their broth sits in kettles like they do at Pho 999s in HCMC. They don't give you as much beef as they do in viet nam, but it's still really really good. Can't say much for service, but food A+. \n\nHere at Pho Kim Long (^,^ he he he) it's almost a mixture of Vietnamese, Chinese and Thai with their dishes which makes it better than just a Pho house. \n\nAnother plus is they're open 24 hours, which is probably why they're broth is so good.\n\nSo if you got a hankerin for some soup that's not heavy, but will fill your belly, come here to Pho Kim Long II and enjoy a bowl of Pho, hot and sour or wonton soup.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Kj0CdQuSneqnroybaC1sOg", "review_id": "zBU1N2N3K9F2GJBNy7NDgA", "text": "As a homegrown Las Vegas local, its sad to see where this place is now. \n\nBefore the 2 expansions, It was a excellent, hole-in-the-wall vietnamese restaurant. It was all the rave in town, constantly packed and everything about it was great. Great tasting hot broth and fresh vegetables and noodles. \n\nThen, the expansion. It seems that all the owner is thinking about now is maximizing profit. Such is apparent by the reduction in overall quality and waitstaff. Pho broth is bland, food is overpriced in accordance to the price and the service is negligible. I do have to say however their Chinese food isn't half bad. Although I'd rather go to K.J. Kitchen for that. \n\nMaybe I'm just being an elitist, or am still bummed that this place used to be so good. Nonetheless, this place is nothing more than average by far. \n\nAhh, then I discovered Saigon 8.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 2, "date": "2009-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PNX0CHe3sofOzzpZQyk2wQ", "review_id": "NgzEhtdalbpYV7SkTSut0Q", "text": "One of the best joints in vegas. I used to go here at least once a week when i lived in vegas. Their eggrolls and dry vermicelli dishes are also good.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SP54-tn51A_yEc-Vw2U71A", "review_id": "HgcDw-NPdp0njNpdhbaGSA", "text": "YUM!  Clean.  Good.  What more can you ask for when it comes to pho?", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jnxZY3GA0L_ktw7z9qT-Ww", "review_id": "bS8GFghqfhZ7TJsJ5bAH2w", "text": "Pho Kim Long is the best Pho in vegas!!!!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-04-22", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "abmn5N7uCl3WPn_rNAApRg", "review_id": "9xds3o257tIyvOJkXwuvqQ", "text": "Pho Kim Long i guess it is pronounced \"Fu.cking long\" i think the owner was talking about his penis....haha \n\nThis place was just \"ok\" if you looking for a quick cheap bite...we came here to grab some food because the Pho Hua in Vegas closed down, WTF!!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2009-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z8Sknq_DZ8srtHUQg3zdEA", "review_id": "zmzNn60Tpq9lLyDcz3blIQ", "text": "i liked it, but we have Viet restaurants here in S. FL too and it tastes like the good ones so yeah! \"Yay! I'm a fan.\" lol", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f5vgLcoKpFcTvD4lOUxcTQ", "review_id": "gAFZaCAfgA-grlAC088iqA", "text": "A bit pricey for pho. The atmosphere is good and the staff is very attentive and always professional. The food is alright. I frequently eat at this place because it is so convenient. They are open early and close late. They may be even open 24 hours, I am not sure though. Decent pho, if you ask me.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2009-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L1dNoLTCYWtwfxOZP7q4Bw", "review_id": "PQ2kPlo8jkYWyHR8NX375w", "text": "they get the job done. they don't even have a 24 hour joint like this in the bay. what's up with that?", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-03-02", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "TT5WOWluwF0elhzJPrNnvQ", "review_id": "wUY_MgzKwYDycpGKUYpoYA", "text": "Haven't always been a big fan of pho but this place gets the job done after a weekend of heavy intoxication. Soup, in general, cures a lot for me! The regular bowl was a good size. It had just enough noodles and soup. Though it would've been better if they added more brisket and steak. Gotta love that extra meat! Waiters seemed funny here probably because I couldn't fully understand their jokes but I guess it made up for the o-k service. The extra star really belonged to the desserts I tried on my recent visit. There were these ice cream balls called exotic bomba and bomba. (Filipinos, don't get any dirty ideas!) Both were actually pretty good. The exotic bomba had a fruitier taste coated with white chocolate and the bomba had a coffee taste coated with milk chocolate. Once again, I was suckered into the sweets!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mod3pkcXcLOussXy4gW8pQ", "review_id": "aZhCq1WTyLZ5sL4Ah-6OCg", "text": "I love how pho kim long is open 24/7! Pot stickers are the great munchies when you're drunk after a good night of partying! I'm here all the time! :)", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Aluc0ilh_rgUIXD5YUf1Mw", "review_id": "FmFeq7I5_4-Gavs-16FWJQ", "text": "The Pho here is delicious. And you have to order the fried egg rolls. Something about Pho deeply satisfies you. Pho is good to eat when you are hungover or sick. It hits the spot. One thing I like about this place is that they are open 24 hours a day!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-03-05", "type": "review"}
{"votes": {"funny": 5, "useful": 0, "cool": 1}, "user_id": "7x3-B0yaO_hqXm42VKStzw", "review_id": "n0FDrcNdvOLyLjeDUhdgqQ", "text": "First off..you gotta eat here for the name alone. Come on? Seriously! lol\n\nSecond, it's open 24 hours a day. I mean, you can \"pho kim long\" 24 hours a day! Yes, I said it.\n\nThird. The food is good. I mean, everything is deeeee-lish when you're drunk at 3am after the club or stripclub. Yes, I said strip club...! \n\nChinese food and pho...what better late night snack :xxx", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "haQaMRoN74xRLDoc0gq0Jg", "review_id": "0B2DKcwl1BC6pjokgjBBng", "text": "I love Pho, but not to Pho Kim Long...I've had better! \n\nI give it 2 stars for the convenience of its operating hours.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 2, "date": "2010-03-11", "type": "review"}
{"votes": {"funny": 10, "useful": 11, "cool": 9}, "user_id": "2rlBbFPHyZjXSFSE8r551w", "review_id": "vVgpBpNW1FppyY0er_4TMg", "text": "This being Vegas, and if you've had too much to drink, you might think this place is equivalent to one of those post cards they hand out on the strip with a sexy girl on it wearing a skimpy outfit, with her phone number (696-9696) ready for you to call her for a \"date\". \n\nAfter all, with a name like Pho Kim Long, you might think this is the Las Vegas Chinatown equivalent to the Chicken Ranch. \n\nYou might also forget that you have already slurped on the savory dishes here. \n\nPho Kim Long is a popular Vietnamese restaurant in the heart of Chinatown. It is very large, and at lunch there are at least 10 people working here, doing a brisk business. The food is solid but not spectacular. The menu is very extensive, the ambiance clean, upscale and modern, and the service is very good. Prices are a little more than you are used to in California's Viet hot spots. \n\nThey do have a lounge adjacent to it now, which I haven't tried yet. Maybe it is a Viet Cafe or classic Viet men's lounge? It might be closer to the sound of the name sake, Pho Kim Long, at least in some parton's minds.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-03-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "801mMnd8E2PGoRB9Nc0UhA", "review_id": "Xf1u6YQfZp7ilrKcj4UeHA", "text": "The best pho in town. #10 Large, Egg Noodle. Yum.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2010-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "nAXNqIktP6tX2tAeRA2D5g", "review_id": "_Ko1QqaVP6KSu6dVgYHS8g", "text": "I was introduced to this place by my little sister that lives in vegas. Thank you little sis! This place is great! great pho and it's open 24/7!! how awesome is that? Service is somewhat pretty fast. We were in vegas last weekend and we went to this place twice! good hang over food! trust me! Prices is decent, good food =)", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2010-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oYwviLQG8CUmhRbjD8X-gA", "review_id": "pvJtcYeHQlwLNqUqewcrXQ", "text": "The service is disappointing. This is my second time here. Eventhough I've had better Pho, I'm a creature of habit when I'm needing comfort food. Pho Kim Long is open 24/7, and both times I've dined after 1am. They were very busy both times. The Salt and Pepper Calamari was a suggestion from my waiter. It was the bomb! I decided to try the Pan Fried Cake with pork and shrimp. It comes with a heaping bowl of lettuce and fish sauce. I didn't know what to do with the lettuce. The bus boy was helpful and very friendly. We were never asked what we wanted to drink. At least we were given water. I had to call the waiter over to order a drink half way through the calamari. I ordered coconut juice which came in the coconut. I didn't have time to enjoy the generous portions of calamari and pan cake. The waiter rushed the two bowls of Pho (noodle soup) and condiments to our table. I wanted to order a dessert but the waiter dropped the check and ran off. We were seated for barely 20 minutes and were being rushed. When he came back to the table I was going to ask for dessert but he didn't give me a chance. He said abruptly, \"Sorry, please pay.\" RUDE He stood there as I dug my credit card from my purse. I felt uncomfortable. My friend asked for boxes for the food uneaten. on our way out the door I heard our waiter rushing another table of 6 people. He mentioned something about a shift change. Then it clicked. Was he more concerned with the tip? WTH? Unlike my soft spoken self, someone at that table didn't take kindly to being rushed. With other Pho restaurants open late to choose from, I think I'll try the other late night Pho restaurants from now on. This place is just not special enough to deal with an unpleasant experience.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 2, "date": "2010-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uw9heyQxZx8oPmjr6V0_NQ", "review_id": "K2zGCH4WWyquapEUrMTejw", "text": "Love this place. Just took down the shrimp rolls and some pho, always good no matter what time.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "4jnphrxfqglc14eclQpErQ", "review_id": "bon_79Z7DjtC_DmR2UkOIg", "text": "Excellent choice!!!  I had the seafood pho....very tasty broth...the seafood was really fresh...fishcake nice and firm and tasty...not fishy...egg noodles, nice and firm....spring rolls were ok....the bbq pork was very good too....I'd definitely go there again!!!  yummmm", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2010-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "R_mb-GX_XHdMr1FXYCOdSw", "review_id": "etZ6YC5aMY7gq2Fz8bsp4w", "text": "My friends are in town and wanted some broth because they were drinking til 8 in the morning. I like the soup more at Pho Saigon 8, but I don't like the beef there. This is one of the better 24 hour pho spots in town. The place was packed as usual and we got the last open table so we didn't have to wait!!\n\nI ordered Pho Tai Sach with the beef on the side. We ordered large bowls because we knew the regular bowls are tiny. I think it is $1 extra to up size.  The broth tasted ok but was not enough as it is needed for people who order beef on the side. The give a good amount of beef and it is sliced ok.\n\nI ordered a Thai Iced Tea w/boba to drink. The boba was a little under cooked. Good attempt by a vietnamese restaurant though.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8RaueDLzY5SSw9AVUrdXiQ", "review_id": "GhjBUi6K0J_8l4EbSafhKw", "text": "My favorite Vietnamese restaurant here in Vegas. Great prices and service is really quick. Food is tasty as well. And most of all, 24 hours!!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2010-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "R_mb-GX_XHdMr1FXYCOdSw", "review_id": "H7a9vJ_gY5btfumh0PQzlQ", "text": "We came here at 3am and I ordered the same thing I did the other day... Pho Tai Sach with the beef on the side. The broth tasted much better this time. I wonder if the time of day makes a difference of how the broth will be. Maybe it depends on what day you come. I dunno... It was however steaming hot this time.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V0yDwzhfGUd922EhEKZZKw", "review_id": "1n6G0yZRFgI31b5Ha7Vx5A", "text": "Food:\nI was honestly, pleasantly surprised. I didn't think I'd find good pho out in the desert, but this place wasn't bad at all! It was not greasy, good broth, and had good portions. It was a little pricier than average, but what isn't more expensive in Vegas? Good cure for partying too hard the night before for sure! \n\nVenue:\nCLEAN! I really care about cleanliness especially of restaurants that are usually pretty dirty. It was pretty decorated for a pho restaurant haha.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tlp2QCAviBvscsGD3wSFkQ", "review_id": "8KpkKeIU8GWjY5FKuRS5bw", "text": "Pho-Kim-Long.  Read it again.\nPho-Kim-Long.  Read it faster.\nPho-Kim-Long.  (Ok that was fun).\n\nJoking aside, this place has pretty good Pho.  I'd def come back again.  It's also open 24/7.  A good place to stop by at 2am in the morning.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-04-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "hjJPKQ1Ah91h3fVbc8GsOg", "review_id": "PEIfhQ6PGVDOByaI3sISFA", "text": "Best Pho spot to get late, late munch after a long night at the Casinos.  Expect a wait, but it will be worth it.  Clean and fast service.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mPvLiqTEP3960FyJPhgrEw", "review_id": "L7JChWyJeBnRC2mAGzr5FA", "text": "I would have never knew about this place if my friend hadn't introduced me. My friend Annalisa took my friends and I here since we wanted something cheap and something different than what was on the strip. It is in a little plaza in Chinatown. From the outside, it looked like a typical Vietnamese restaurant, but once I stepped inside it was totally different. It was very spacious and clean. I am very picky when it comes to Vietnamese food and I quite surprised when I came here. It was a little pricey, but the quality of food and the atmosphere made up for it.\n\nMy friends and I were greeted and seated immediately  upon arrival. As we were looking through the menu, I was very indecisive about which item to choose. Everything looked so good! I finally came to a decision and ordered the Hu Tieu. I was content with my decision. The bowl it came in looked very small and deceiving, but as I was working my way through the bowl I could not finish it. The broth was very clear and tasty. It was so appetizing that I kept wanting to eat more but my stomach couldn't hang.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-04-08", "type": "review"}
{"votes": {"funny": 6, "useful": 3, "cool": 1}, "user_id": "Qvi7M-l6sePTSQNSqcu-dA", "review_id": "F3WFENMRKEcTRjRvlPjVQQ", "text": "First, Saigon 8 is much better. The bathroom smells like a petting zoo at Kim Long, and there were roaches on the floor. The parking is crowded and it smells like an armpit. Trust me, I've been to many pho places in garden grove and Westminster and this place is schwag. \n\nAlso, you'll like what happened there: \n\nThere is a nice looking girl at the front (employee) that drives an expensive benz, and my buddy quietly said \"oh, that's a nice looking girl\". Nobody at my table cared and our conversation moved on to gambling talk. Then, the bus boy strolled up to our table and instead of asking if everything was alright, rudely said \"how do you know my fiance, and why are you talking about her\". I almost started laughing because a thought it was a joke, but the guy was mad. \n\nI walked up to the manager and expressed my concern, then I asked the girl why her fiance was bugging us. She said she is not engaged, and definitely not to the bus boy, lol. Then mysteriously the bus boy became silent and disappeared. The kitchen cleared out like there was going to be a fight, in fact the waiter called them up front like an old kung fu movie. It was disrespectful to all the customers, my table, the girl, and embarrassing to mgmt and the bus boy. \n\nWhat a weird place, I also think he might have thought we were talking about the girl because my fiend's name is genny and maybe that was her name, but what a bunch of foolishness. \n\nEither way, if you are not trying out for a kung fu movie where you have to fight the whole staff, I suggest going elsewhere. This is not the best pho, and they are not the best listeners. They are quick to judge. It smells and has bugs. \n\nI will be sure to only stop here if I have to take a dump.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 1, "date": "2010-04-12", "type": "review"}
{"votes": {"funny": 6, "useful": 5, "cool": 3}, "user_id": "PmfRs4JixGlI89djlVWCmw", "review_id": "FCR-WrX_ZN6QPFtIzuFdig", "text": "Yo yo, this is 'Genny' (short for General, not Jennifer!) from Ed's review.  \n\nOk, the pho is good I thought.  They hook up the meat and I gotta get my protein, so I liked the place.  Its been a tradition to hit up phokimlong every time we go to vegas, mostly cuz the name is funny.  'Yo lets go phokimlong!'\n\nBut this tradition is gettin the BAN.  We've seen the pretty girl that works there before, but this time when we went, we didnt see her.  We ordered, ate, then I went to go pee.  I get back, and my homie says 'hey genny theres your girl'.  Cool, I was gonna say what up when we left.  Note that nothing disrespectful was said!\n\nBut then little asian gumby the BUSBOY had to come and butt in our convo.  Now if you're gonna step up, step up correct.  He comes in with his head down, whispering 'why you talkin about my fiance?'  Then he just leaves.  I barely heard what he said, so I was like is dude serious?  I was gonna let it slide and talk to pretty girl when we left, but big homie Bolo Eddie had to go see what was up with gumby, and thats when the managers got scared and started callin the mexis workin in the back to come in.  I went with him, so it killed my chance with talkin to homegirl :(\n\nSo my ratings are:\nFood: 4 - lots of meat, meatballs are pretty bomb\nService: NEGATIVE 5 - busboy, stick to refilling water and cleanin up dishes\nCleanness: 1 - not the cleannest place, we're not in viet anymore\n\nWell I'm bout to get off work now, so I'll end this.  To the pretty girl, if you see this, I was the dude with the Coolio hair, how are you doin?  Hit me up sometime :)", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 1, "date": "2010-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-Zigdk4lAQP56QowNI732Q", "review_id": "mbQz2UfkgWdNI2q15bOYLw", "text": "I brought a friend here to have him experience a real Vietnamese meal. We're both out-of-towners, and I was trying to remember the location of the Pho 8 place another friend had taken me to, but settled for Pho Kim Long.\nBIG MISTAKE. We asked for a fairly standard dish we couldn't find on the menu, Ga xao sa, lemongrass chicken. There was no lemongrass in it, and they charged about double what all other places charge for the dish. We asked for Cafe Sua Da, and they prepared it in the back and brought it to us in styrofoam cups! No on- the-table filters!\nStick to Pho 8. Its the real deal. This place has a nice build-out, but the food leaves much to be desired.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 1, "date": "2010-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bdvi1fzjqOEkYT4OxDlyMw", "review_id": "bXnepffsNIJ7RCQUiUuIyw", "text": "Good food with great service!!! And it's open 24hrs!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XWtoW-j52ld7Kl7hBwhxIA", "review_id": "D4ptbANTPLyUVeiwXD6htg", "text": "best PHO IN VEGAS", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2010-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Y3a2WARkrCL3NQA8J8A8gA", "review_id": "0a0wpF1d_DI79sDzGs29QA", "text": "Not the best pho place, I went here with a pho connoisseur and we both walked away dissapointed. The thing I remember most was the darker brown broth with strong clove flavors that I didn't enjoy. Still looking for great pho in vegas.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 1, "date": "2010-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VTftWbVIUuC-lIeTjZmHRA", "review_id": "FqMaP5obMH2jx3ZNQoA7KQ", "text": "This 24 hour place is great. While visiting Vegas with my friends and feeling we didn't want to spend too much, we headed over to this place. The pho noodles are pretty good, though I have had better. Regardless of this little fact this place hits the spot when you have a very late night in Sin City. There's just something about a hot bowl of pho when you are very drunk in Vegas.\n\nThe egg rolls are very good. Crunchy and tasty, the sauce on the other hand it's not the best for me, but I'm sure someone out there will love it.\n\nThis place always seems to have a line during it's late night operations. Which is understandable, considering that the waiting staff is down to either 1 or 2 people and they are running around like mad to cater to 9-12 different tables with each having a party of 3-7.\n\nThe atmosphere and decor is rather simple, nothing chic or upscale. Just your basic run of the mill Vietnamese restaurant. I think I would still go back to this place mostly for tradition, since my friends and I have gone here in all of our Vegas trips.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-04-27", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "ox_qE6IllktEbiMLbQikoQ", "review_id": "MxEBH_jqa-n8u4EtoKyPpA", "text": "I found the after party guys! It's at Pho Kim Long! \n\nOk, I will probably have to re-visit this review because when I was here, I was intoxicated and I seriously thought that my food was heavent sent. So, for now, we'll go off my only experience...\n\nLove this place for the fact that it's open late, service is fast, and the food was perfect (for being in my condition, atleast). My girlfriend ordered a beef and broccoli dish which I was eating off her plate - GOOD, I had combination pho of some sort - GOOD. For these reasons, I am def'ly going back. Yes, my food was additionally delicious b/c I had a few drinks in, but friends and family have gone here several times and raved about the food, so, I am sure it would be just as good sober.\n\nFINAL ANSWER: I found my pho place in Las Vegas! Def'ly must come here especially after a night out drinking.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9wvv-RChiOOqt_s7vYhIWw", "review_id": "7dX6LP4TYp2jtBAIUkxUVQ", "text": "For a place that is open 24-hours, this place actually serves up some pretty delicious chinese/vietnamese grub (even when you are sober and eating it for lunch). Pretty good pho tai, can't complain. My lunch buddies enjoyed their grilled chicken over rice and chicken porridge dishes as well. Decent food, good prices, open all night. And come on.. the name of this place is just... fun to say. Pho-kim-long time, baby!!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dQT8hTHKHtolyDiklt5yKw", "review_id": "JoUPg4i8tfoPjzmbbvtbvQ", "text": "Yay VEGAS!!!!!  Late night pho = the best munchies you can get while drunk from drinking in your hotel room, lol.\n\nBut seriously, I really love exploring the local side of Vegas.  This was definitely one of them, although I felt most of the people inside were all tipsy from the night earlier.  I was very excited to see that this was 24 hours because pho is my late night choice for food.\n\nEverytime I try a pho place I usually get their combo pho.  In this case, for about $7.99 I got a medium sized bowl of pho with some meat in it.  I wish the bowl was larger, and that the broth would have more flavor to that.  In my opinion, it was a bit plain.  However, the servers here were very nice, and got us our food right away after ordering.\n\nI would come back to try some of the non pho items on the menu, which looked plentiful.  Four stars for being opened 24 hours and catering to the needs of drunk tourists and friendly locals.\n\nParking is located outside in the plaza, but is limited.  However, street parking is everywhere.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-05-03", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "i3LOg4p-kGGkjlfEiKTtsw", "review_id": "L2UgpuBWUmX9XWLfIox1CA", "text": "I guess you people never had real Vietnamese food before. \nThe food tastes like it came straight out of an instant noodle pack and the service is atrocious!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 2, "date": "2010-05-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FW14weLaB0ko7PlWhmCmVg", "review_id": "Q8tPKckcFiZOo-n0bvfTUg", "text": "Awesome food. Service is ok but ultra fast. My rice noodle soup arrived in 2 minutes. Overall it's worth the short drive from the strip.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hEOkJpPzvcGBzyoCr68thw", "review_id": "yXP7eHxerjCeESmJLYXPGw", "text": "just OK. the pho dac biet lacked tripe, etc. decent broth. other diners said other dishes were a tad spicy. still, it totally hit the spot, and i would probably go again, after trying many of the other pho spots within blocks. solid pho, but nothing gastonomical.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2010-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IKvbLAA1L1nMO8C06uLD6w", "review_id": "Cb2dpYW1NpNemEKfpZSQUg", "text": "everything in this place is good i could tell this was so from the locals that were hanging  out there and the flow of of people that were coming in after 1 am. not bad for being a couple of blocks off the Las Vegas strip.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "muYw6tODqXHBcrCNxB9CYQ", "review_id": "JqgsDRtjjYkzy0o33O7hDQ", "text": "This place is my go to for pho. They're fast, consistent, cheap, and delicious.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2011-03-01", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "CWw5C2I7Vz_YYI43WId4wg", "review_id": "NP4f79-OBXM9ZXOLXsHbww", "text": "**** Good if  late night and you're high/drunk/under the influence **** \n\nThe Pho is overpriced and salty.  I guess they can afford to do so since it's close to the strip.  Just drive down the street to Pho So 1.\n\nThe only reason why I like this place is to give my tourist friends a laugh when they see the sign.\n\nMy 12 year old side wants to call them on speed dial so I can hear them answer.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 2, "date": "2011-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "HkOZSO6pN7u5NG7yjEyvww", "review_id": "b_yb5wrlQ05PyGoajsnkzg", "text": "Pho Kim Long is busy during the day, but if you go in the evenings (especially after 10PM), you'll have no problem getting a seat and your food on time. One of the high points about this place is that it's open 24 hours. I have not yet discovered any other Vietnamese restaurant that is open for 24 hours, so this is a great place for those who are looking to have a filling, healthy dinner after your long night shift. \n\nI can understand why the quality of the pho might not be comparable to some other places (the broth is a little different here than others), but the reason why I gave this place 4 stars is because I would [highly] recommend anyone to be adventurous with the menu. It's typical to order spring rolls, eggrolls, and your pho, but really... there's so much more to the menu than you think, don't be afraid, trust me!\n\nWe ordered rice, the deep fried flounder, walnut shrimp, and coconut milk to go with the meal, and it was quite possibly one of the most flavorful seafood meals I've ever had in a Vietnamese restaurant. I'm usually hesitant with seafood when it comes to restaurants that are reasonably priced and are local establishments, but I have to say the seafood here was fresh, flavorful, and filling. \n\nThe dining area is spacious, not tightly packed together, and the ambience of the restaurant is nice and cultural. Might I add they also have a little selection of liquors from their drink menu too?", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2011-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "SGu310PIR_tFc-myMEzvqQ", "review_id": "WXwnKVQaaszaMuHp-zLk2Q", "text": "I like Pho. I've only been here in Vegas for about 3 weeks now and this is the only place I've eaten at since. Might I add that I've already eaten here three times! Haha.\n\nThe food and service is good. I like how quick it's been to have my food served! It seems as if my order comes out within minutes. Hardly any wait, if any, in the past three times that I've been there. Oh, and did I mention that it's open all day and night? \n\nYES, I will most definitely be visiting this restaurant again..", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2011-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KfQM9C3KBvT4vsR-hp8RzA", "review_id": "7AG9DT4GhI00ljlKgE2DZw", "text": "If it wasn't so far from where we live, we'd probably be here alot! We love this place. Service is always fast!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 5, "date": "2011-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yld8A-js7QQgPbV3M7sMew", "review_id": "TUuBK7WKJ8mfn2XqgnB4jw", "text": "I have to say, my friend and I had a good laugh when we pulled up to this place.  This is probably the second Pho restaurant that I've been to that seems to like to push it's limit in estranged humor.\n\nThe food was delicious, and though I must say that it is hard to mess up Pho like it's hard to mess up a burger, you definitely can taste the difference.  However; PKL does not meet that standard.  There are a lot of Pho chains out there, and PKL is decent in that regards.  They are open late at night and good for some midnight cravings after a night of gambling if you're a tourist.  Or whatever you happen to be in Vegas for.\n\nThere is a bathroom, service is decent, and I have and probably will visit this place quite often.\n\nknocked a star mostly on my preference, when I go to these places, there has to be some cheap gimmick that pulls me either with something free or some kick butt pho.  the name in it of itself just doesn't cut it for me ;)", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2011-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KKyrhHw5_t_jCeRD8-7cDA", "review_id": "LuN1Fi9k6LhyaV9RjF6TIw", "text": "Favorite pho spot in town. Open 24 hours. Check out the  photos I uploaded. Fast service and moderatley priced. In the heart of chinatown.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2011-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "INKmVz_i3viD2RB9e01nGg", "review_id": "IEOdtPWcxYir00mBqRWPUg", "text": "Great service and friendly staff. If you'd like to get off The Strip  to find some good food and save money --- this is the place to be. Their restaurant is very clean and spacious. Their pho was good and their rice plate with grilled porkchops wasn't bad either. Tried the chops with their seasoned rice (garlic fried rice) and it was just scrumptious.  They give you plenty. We also had their fried spring roll which you roll up in lettuce and dipped into the fish sauce. Yummy!!!\n\nWhen we come back to Vegas we'll come and definitely eat here again.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 3, "date": "2011-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gpxJuGfv1WhusBWH5OixOA", "review_id": "NmoIjXMseK94jg3EsXdPoA", "text": "the sun was coming up.\n\nwe had the drunchies.\n\nwho doesn't love pho when they're drunk?\n\nmeat---good, noodles---good, broth---gooooooooood.\n\ngo pho kim long!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2011-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "neExTT-OrrTlk9-JRm2Ryg", "review_id": "t-g0ZepuKMgbnN2F5kmCsQ", "text": "over price !  Ca Kho To never taste the same ,  sometimes salty , sometimes no flavor at all ! never go there again.", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 1, "date": "2011-03-14", "type": "review"}
