{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "x4Lr_NkzNvEeMjf_qlUD1A", "review_id": "aLHdCGrJoNXPhdoVyextng", "text": "Great value, close drive to city, not much to do around hotel, its a business park. Carnegie city has a few bars and restaurants.", "business_id": "zgy27FSnvwdINfk5cXBIyQ", "stars": 4, "date": "2012-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "85nleVF5j91oSvI4YbPC9g", "review_id": "xEq7QUoPVWsF_r7ZAzDyQQ", "text": "The Parkway Center Inn did not live up to my expectations based on other Best Westerns I've stayed at - my room was tiny & dated.\n\nFor some reason, I had thought that there was a restaurant on site. There isn't, and there isn't really anything close either. A mini fridge in the room would have been . . . useful. \n\nTo be fair, they do offer a continental breakfast & an evening cocktail hour - neither of which I was around to check out.  \n\nThe room was clean, free parking and internet, reasonably friendly staff etc, but I'll definitely chose to spend a bit more to be in a more serviced neighborhood next time.", "business_id": "AJiwOb0s5zpYu0NW7Jvrpg", "stars": 3, "date": "2011-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6husdcce14pWIP2oJ_s3QA", "review_id": "bVus9IoF1m2SBM3t25hi7Q", "text": "Not the friendliest customer service.  Prices okay.  Look for deals on their website.", "business_id": "2bBxE8pEbLBETejCi_aBeg", "stars": 4, "date": "2011-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "r5LG7pTrht-a3Q2tNUUpow", "review_id": "M7cvrf-0uqjtRCl2E6CVhQ", "text": "Parking in the garage across the street is 5 bucks, don't bother with valet.\n\nVery nice lobby and restaurant area, swanky, feels upscale even though we only paid like 150 all in. \n\nvery nice check in people, very attentive, and helpful.\n\nRoom was a king, but it wwas kind of weird like the window wasn't centered so it made it feel like the room had been a suite cut into two, which was a little weird. \n\nthe design was amazing, loved the counter in the bathroom, and a the wallpaper.\n\nBut there was hair on the wall, and we could hear other peoples showers in the early AM. \n\nBed was super comfy!!!\n\nSunday brunch was very very delish!!! I think next time we're in Pittsburgh we would stay there.", "business_id": "A38wziZJdYoijhC5S6uWCQ", "stars": 4, "date": "2014-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x8AyGscWSsOSpTZUHCDtAw", "review_id": "QmHHecFJSokId1P2c7GMuQ", "text": "This hotel was very nice. It was very clean and the location was great, being in the heart of the city. With that said the only things I didn't like were the thin walls in the room. Whoever was in the room next to me had their phone on vibrate and I kept thinking it was mine, like I shouldn't of been able to hear that. Another thing I didn't like was the fact we had no fridge or microwave. We went to restaurants and we couldn't bring any leftovers back because there wasn't one single microwave in the hotel. For the most part I enjoyed staying at the westin, shower and bed are both very relaxing.", "business_id": "bWWrrsPWuoHuAGUCgH8Tyg", "stars": 3, "date": "2013-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "JeFoNHDRhowMQWs9tA_AUw", "review_id": "YzENienKhvQtOMDjMYvABA", "text": "I met a friend for high tea on a weekday so we were the only ones there which we didn't mind at all given that we both brought our two year old children. We were served by Chef Jackie who I found to be friendly and informative. I was very impressed with the large selection of tea that included both loose and bagged options. We were told we could try as many as we wanted. \n\nI must admit I was a little disappointed with the quantity of sandwiches given. We were served an egg salad sandwich, a ham with avocado, and a take on a BLT which was bacon, tomato, and julienned spinach on top served on a piece of French bread. I wanted more. The second plate had fresh fruit and two scones- citrus and vanilla cream. Both were delicious but small in size. The final plate had a brownie, sponge cake, and small cupcake. Everything was delicious but I would have rather have had another sandwich or two over the last plate and larger scones. All of this cost $21pp.", "business_id": "rUQfZOengMpXFkLvJrNJ3g", "stars": 4, "date": "2012-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1UNyBhDW6XUf9g5rfsxk9w", "review_id": "ySzTN3nj0rZPFugB1B3tmw", "text": "I took a nap in prep for some bar hopping tonight. The bed is on point. it is soft and it wraps around you like a burrito.\n\nThe tub is too slim! The average man in 5 southern states couldn't fit into this skinny bowl :0(\n\nThere was no vent fan or heat lamp in the bathroom and a blown light bulb.\n\nThe shower head is awesome(LoL @ shower head is awesome)! Strong stream and good temp. 25 minutes and no utility bill ;o)\n\nI expect my slumber tonight will be like my nap. \n\nBottom line is that this isn't the best choice, but far from the worst. Ill use it again", "business_id": "ZOQAQe2n3lAihLLsTmS1aQ", "stars": 3, "date": "2015-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Vq1Zh54wED4azriSzhrHVA", "review_id": "SGaeleb_VX-XdZ9oRpts5A", "text": "Stayed there for the first time while attending a trade show at the convention center.  Although it's not the closest, it is still within easy walking distance.\n\nThe staff was very friendly and attentive.  The only problem I had was the lack of a valet at the valet parking when I arrived late (near midnight).  Self parking was easy enough to figure out.\n\nIt is a historic hotel, so some of the rooms have a funky layout.  The decor is traditional, but clean and comfortable. Also quiet.  I was in a room next to the elevator and never heard it.\n\nI really appreciated the fact that I never felt nickled and dimed.  Complimentary soft drinks in the room and coffee in the lobby (no bottles of water with a $3 \"convenience fee\" like some other hotels).  If you get a rate with breakfast it covers a real breakfast, not just coffee and a muffin.\n\nThere is an onsite restaurant, The Harvest Moon Grille.  The selection is sometimes limited, but all the food is outstanding.  Fresh local ingredients are highlighted.\n\n Overall, a nice change of pace from the large luxo chains, and a great place to experience Charlotte hospitality.", "business_id": "zwwmnQXk8jhFs4wwU8I4Ow", "stars": 4, "date": "2012-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tmAS6JWvPdwuzGpR9BI_kA", "review_id": "SAZr4PYfVdhDPMP2TtimuQ", "text": "Wow! Right in the heart of downtown!\nNice people, great service, helpful front desk people.\nLove the little breakfast cafe, good food there.\nPlenty of parking, very clean!", "business_id": "fJ72j9pRjLcRzBA_EhB4-g", "stars": 5, "date": "2015-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rYCIxUPXoY62RiDnZ6Iizg", "review_id": "C6ZR29RzqZY4D2R0aSws1A", "text": "My husband and I were here for a wedding and it happened to be the same weekend as the Coke a Cola 600. So, there were a ton of people and we were always greeted with a smile and even given an early checkin and late check out. Our room had an amazing view of downtown, but I did notice that the comforter was not clean. I'm hoping it was a coffee stain. Minus that everything was up to par and would live to stay here again.", "business_id": "4nFqPL-glgDm9v7bZptskQ", "stars": 4, "date": "2013-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wFxDhUdSOcqpbiSyoD3uNw", "review_id": "OEpU9B_Aa6uN5r436JJpow", "text": "Overall for a holiday inn, I give them a 3. When all hotels in walking distance of this area are sold out, this is then my default hotel. Rooms are clean and check in is fast. My room faces the back of another building and was quiet. The beds are on the hard side. All expected things were in my room which was great (bottled water, coffee maker, hair dryer and plenty of towels). Room service was acceptable, the New York strip was really good but my glass of wine tasted like cough syrup (yucky).", "business_id": "Fi5sQxROyTLp5qDuYKz6bQ", "stars": 3, "date": "2015-05-13", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "sRL55SyvuQAO9S3TwgeeMQ", "review_id": "O1T0p-57IPhuggWK41pxnQ", "text": "After spending 3 cold and rainy days camping in a field with hundreds of people and terrible restroom facilities, this hotel was paradise.  We stayed in a king room with a whirlpool tub.  The tub was in the bedroom, but there was also a shower and regular bathtub in the bathroom.  I hadn't properly bathed in days, so the whirlpool bath was one of the best baths I've ever had in my life.\n\nService was outstanding.  Self parking is $10 a night and valet is only $15.  The room was clean and large.  The food we ordered from room service was some of the best hotel food I have had.  The portion size of the vegetable tortellini I ordered was enough to feed a family of six.  We had leftovers for breakfast the next day and over half of it was still left.\n\nThe hotel is in a great location with easy access.  The rooms are a little dated, but I was totally satisfied with my stay.", "business_id": "cBoFcjuNaWDQ2MP7GgeSBA", "stars": 5, "date": "2013-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "4BEP7fN-0q5V2ehJr4icKw", "review_id": "yrg1q4pd_OKy8s18HdnqPg", "text": "The Omni Charlotte is a corporate business traveler hotel.  This is important to point out from the start.  \n\n1.  Beautiful views of Uptown from all the room windows.  Skyscrapers and reflections to your hearts content.\n\n2.  There are no refrigerators in the rooms, but you can get one upon request.\n\n3.  Internet is $9.95 a day\n\n4.  Parking is $20.00 a day\n\n5.  The lobby is bland but serves its point if you are a business traveler.  Nothing fancy.\n\n6.  Walking distance to City Center and most of Uptown.\n\n7.  Almost any toiletries upon request.\n\n8.  You need a key to get on the elevators...Even guests of guests.\n\n9.  The beds are comfy and there are waffle woven robes (very comfy).\n\n10.  Room service is fast and good.\n\n11.  The valet can be a little disorganized, but they eventually get to you.\n\n12.  The open areas could use some upgrades and modern fixtures including the elevators.\n\nOverall, it is a good in and out hotel for business travelers.  It may lack some of the added features if you are a personal or family traveler.", "business_id": "QThlnQ7AvzZwXHKD5DjdCw", "stars": 3, "date": "2015-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 3}, "user_id": "b77VEcsYeO_0lPWbgbcQIw", "review_id": "_1QEkPX_9xC5OanwqaXf5A", "text": "this place is nice lots of shops, clean and good choices on places to eat. the free high speed internet is very fast. like the other reviewer said you have to try Phillips seafood in terminal C..excellent service and food there is off the hook. only here for a quick layover so I will write a review about Phillips later.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 4, "date": "2008-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "1K9ghybztNHR0yxqV0OfDA", "review_id": "6lNZostEs5HvaB3k-2tnkA", "text": "It's freakin' huge. If you have connections, you better leave at least :30 minutes between them. At least they have people movers to speed things up, and free wifi if you get to your gate with any time to spare.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 4, "date": "2011-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4UJXdW5nQ-i1-j-qak-U3A", "review_id": "PHm_aY12dezfxsIqS_A1Nw", "text": "The airport it self is great.  This is my home airport and for the past three years I have been flying in/out of here.  The draw back with CLT is having to wait and wait for luggage if you checked it and they alwasy seem to be behind schedule with take-offs.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 3, "date": "2011-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wjb38S00seazA_JmghN1tw", "review_id": "fGZ_i4Oz7z41EY8_-lv2JQ", "text": "I'm not a seasoned airport pro by any means, but Charlotte is certainly a pretty good one (at least it's better than Atlanta).  Busy, but not overly so, I have never waited longer than 20 minutes in the security checkpoint line.  As others have said, there are 3 checkpoints, so if the one closest to you seems busy, try other ones, they may be faster.  The TSA agents are usually pretty cheery here, which is always nice when you're toting a fussy (or talkative) toddler through the checkpoint.\n\nI only wish there were a few more food and drink options outside of security.  Currently there's a Starbucks on the top level by the departure desks, and that's about it.  Now, I understand the airport was built before the security restrictions were tightened (which is a shame, because I love going to the airport, and I'd probably go there to hang out if you didn't need a ticket to get in), but it would be nice if there were more things.\n\nAlso, seriously?  Quit it with the Cinnabon.  You can smell it from a terminal away!  I don't always want a $4 cinnamon bun, but that smell is just so damn enticing that I just can't resist sometimes!  I guess it's better than the stale breath smell of an airplane, though :P", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 3, "date": "2012-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1ieuYcKS7zeAv_U15AB13A", "review_id": "N9BwKSOh34VhBHYTl3bhqw", "text": "HUGE airport with lots of cool stores inside! \n\nThe taxi cab system outside is very disorganized. Please get it together before I travel again.  For some reason, I always seem to have a layover in Charlotte.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 3, "date": "2012-05-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "TaN_3-Qg6GMwdJjFIQMrhQ", "review_id": "YVOAj9Q63ySoWRkT_-Hr3g", "text": "Clean, modern, well laid out, free Wifi, and lots of seating. It is a big airport, but it doesn't really feel that way. \n\nI thought the food courts were nice and spacious.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 4, "date": "2013-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uFXrezdNbph5QbmvYVmhEA", "review_id": "yMGRDuRIGKJ5hqJzgrVmdg", "text": "Might just be the must confusing airport I have ever been in", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 3, "date": "2013-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "73lnsYbkd3tOYQTGLackEQ", "review_id": "M-Uuw0U9QWYgzBqhCGyXdw", "text": "So it wouldn't have occurred to me to review the airport, because it's just the airport. It's where you go when you have to go somewhere. But on my Yelp homepage at the top, it's asking me if I've ever been and if I'd like to review it. I had some time on my hands so I figure what the heck. Let's talk about the CLT airport.\n\nIt's actually my second favorite airport in the US, Denver being the first. We can't compete with the Denver airport with its super cool art shops and the fact that during one four hour layover I had a full steak meal complete with bison ribeye and a bottle of red wine. CLT-Douglas doesn't have bison ribeyes. They do, however, have a Bad Daddy's... But without the bison. My hubs and I eat at Bad Daddy's in Dilworth for all of our burger needs and always ALWAYS upgrade to the bison. It's delicious and so much better for you than beef. So we were pretty excited to learn they were opening an airport location. Why the airport location cut the bison (and robust beer list) from their menu, I'm not sure. So in that case, I switch to the turkey burger, which is actually pretty juicy and delicious itself. \n\nBut I digress - the airport... I really like our airport. It's clean, modern and easy to navigate. Security is rarely super bad, and if it is, you can hoof it down to either A or E concourses and usually get right in. I'm not going to say that every person I've encountered at a ticket counter was a ray of sunshine but I don't remember any particular incidents to count toward the negative. I love the rocking chairs, which are dispersed throughout the airport, usually in front of large windows so you can rock and watch the planes if you so choose. \n\nAnother recent addition is Beaudevin, which I LOVE. It's an upscale sort of wine lounge, where you can chill on a chic sofa and sip on some wine, or get a snack if you're feeling peckish for something other than fast food. Even though it's right in the middle of the main thoroughfare, it still feels like a quiet escape. The décor is so very not-airport, with artsy chandeliers and those chic sofas I mentioned. (They do have table seating if you want to tuck into some food in a more serious manner.) \n\nThey've added more charging ports in waiting areas now so that's a convenience. I don't think they have as many as some bigger airports do, but it's definitely better than it used to be when every one at the gate was competing to sit on the floor by the one wall outlet. Progress! \n\nIf you're after Starbucks, the lines can get a little long and each location in the airport doesn't serve the same snacks. I waited in line at one and wasn't able to get the breakfast sandwich I so desired. (I would've honestly rather had an airport bloody mary to be honest but I was traveling with my boss for work on this occasion. Because that's part of the fun of airports - morning bloody marys because you can.)\n\nThere aren't any special shops I find the need to hit when I go to the airport like there are in Denver, but I kind of feel like this is a plus for my home airport. I'm there so often that it would cost me a lot of money to have a go-to shopping destination every time I travel. I get by just fine with the choice of Bad Daddy's (if I'm hungry) or Beaudevin if I just want to have a relaxing beverage while I wait for my flight. Sadly, I don't often have time to enjoy the rocking chairs, but I still like knowing they're there. \n\nOh, and my dad introduced me to the valet parking and I haven't been able to go back to regular. Especially while they're working on the new garage construction. I'm too spoiled. Sure I could spend that money on a billion other things, and I should, but there's something just so fancy about being able to walk off the plane, pay a fee and have my car brought right to me. Because let's face it - nobody likes airport parking.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 4, "date": "2014-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_Qbf4CrZGmIGIijM3jvszw", "review_id": "3bXf0DV-ErlkKx3MX10DSw", "text": "1. Crowded with narrow walkways.\n2. Wi-Fi - Low capacity bandwidth, free as they know it's value.\n3. Friendly gate personnel.\n4. Good selection of places to eat.\n5. Starbucks everywhere - good.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 2, "date": "2014-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "W1zUkEDSGqf9pWubbrh5hw", "review_id": "Bj3NVAn46yulhaNn0tSXyw", "text": "The best thing about Charlotte Douglas International Airport? They have a great track record for on time departures. Woo!\n\nThe worst thing about Charlotte Douglas International Airport? If you have a connecting flight, it will be flying out of the complete opposite end of the airport from where your other flight lands. At least that is what has happened to me every single time, and no, I'm not switching carriers. \n\nThere really isn't anything too horrible or too great about this airport. I've always found the bathrooms surprisingly clean, I like the random rocking chairs stationed throughout the airport, and it is very easy to navigate, even if you have to run from one end to the other to make your connecting flight. Food options, however, are very limited, especially first thing in the morning, when everything that isn't Starbucks is closed. Also, the gates are small and cramped and lacking in seating, and electrical outlets are few and hard to find.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 3, "date": "2014-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FdGBw9uqBrBvgHq4Crm4WQ", "review_id": "IPjzLIVrTLCGoJAndBYILQ", "text": "Coming from New York, this airport is lovely. They are quick and efficient. You're in and you're out, you're up and you're down. (you're wrong when it's right.. Katy Perry, no?) anyway, this airport is a relief compared to JFK and LGA. It felt great to be out of the airport so smoothly. The way home was just as easy.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 4, "date": "2015-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "U_vI5UcfoyoTChKbgH1Okg", "review_id": "iz5hJxDAZ95O6Fj3cL4Qiw", "text": "Rude lady at the gate. I thought I forgot something at my seat and she made it seem like I was being such an asshole for asking for some help. Sorry for being such an unreasonable customer... B3 US Airways Friday afternoon.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 1, "date": "2015-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xGGaESl0b9ogeL3lP41VQA", "review_id": "zxcCV0YzSOMiZKK1ltxdjQ", "text": "Yikes! We won't be staying here again the next time we are in the Charlotte area. \n\nThe man at the front desk was nice enough, but the entire experience didn't match up. The first night we were there, all the lights were off outside the hotel. People bumped around in their cars blasting music for a good part of the night. It is always a bad feling when you are afraid to fall asleep at a hotel because you hear crazy people outside.  :/ \n\nThe next morning, we opened the cutains to find a group of sketchy-looking people hanging around a couple hundred feet away at a 'i-95 coach waiting area' (no idea what this was about). But, they definitely made us feel uncomfortable as they stared us down as we walked to our car. We debated on trying to get out of staying the second night, but decided it wasn't worth the trouble (the office had a sign posted saying there were no refunds after 10 mins of check in). We decided to rough it the second night. Upon leaving the hotel for the day, we finally saw in daylight that this definitely was not the posh side of Charlotte and there were some pretty scary folks running the streets. \n\nAnyway, so we returned to the hotel later that night and found our A/C cranked to 60 degrees. When getting into the shower to warm up, we found that the shampoo packets had been replaced by bar soap. (We'd forgotten shampoo, and had planned on using hotel shampoo!). OOPS! \n\nBwah! So overall, not good. I'll give them an extra star for the front office guy, since he was TRYING, and just seemed like a nice man trying to make a living. For the whole experience though... bad, bad, bad!", "business_id": "_JGqL8Cyqmph3dZeiLl4tA", "stars": 2, "date": "2012-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VG0hRzwt4pyFeVtSJ2cpZg", "review_id": "-kCe0UfAz3jBnae0Yo-07A", "text": "Small airport bit still gold board.    Just give yourself time when returning to take shuttle back to airport.", "business_id": "eThu9hCL8NOjOxswQ-cFSg", "stars": 4, "date": "2014-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7rHtr7VQnorzRL1_4scAMA", "review_id": "WwR2jfL4caIzhfPjNyzFoA", "text": "Amazing customer service. Quick, friendly, great car selections and they give you the option to  choose which car you would like from their lot. Fast shuttle to take you to the airport. Can't believe how smooth and fast everything went.", "business_id": "xr0tU-S2z-X6rCOLMX18sw", "stars": 5, "date": "2013-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ToiWAzz23CpU3UzR76JS4A", "review_id": "xfHCNGdFqxgcY23oxDZhdg", "text": "really wished we would have read the reviews before staying here. We came to Charlotte for a three day convention and this hotel was conveniently located to the convention center. \n\nThe only good thing I will say about our stay was that the first person we dealt with was very pleasant. We booked a room with two queen bed because we had friends staying with us for one night. The room we got had a king size bed and a gross looking pull out couch. There other rooms we supposedly booked so we had to deal with it. \n\nThe room itself was very hot and we had to call maintenance to come look at the HVAC. When he came he had to go in the ceiling and switch the unit from heat to ac because the units were the same units they installed in the 80's and you have to manually switch from heat to cool. He let us now that the room would more than likely get cold in the evening because the temp that night was supposed to get down in the 40's but he would gladly come back. It did indeed get cold. \n\nThe beds where not as bad as in the other reviews but if two people sat on the edge of the bed then the whole bed actually flipped up and put you on the floor. The floors by the way really need to be steam cleaned. I walked around in my socks and they were brown after just a few minutes. Very nasty. \n\nThey give you three bath towels and have signs up that ask you to reuse your towels. That is fine but with four people we requested more towels and additional bedding for the pull out bed. After an hour a gentleman finally brought up just sheets. They were hot which made it seemed like they were washed when we called. A large hotel does not have sheets clean and ready to go? I called again to get towels but no one came. It was late so we just gave up. In the morning I just went and got them myself. \n\nWe barely slept at all the whole time because the walls are paper thin and all we heard all night was sirens which sound like they are right outside your window. \n\nThe whole time I stayed there I thought I was getting sick because I was stuffed up and sneezing. Did not start until the evening we checked in. On the day of check out I happened to glance up at the vent close to the ceiling and was absolutely horrified to see black mold growing on the bathroom wall. I took a paper towel to see if it was just dust but it was not. I informed the front desk but they just insisted it could not possibly be mold. Not one person even offered to go look. I will be reporting this hotel. \n\nIn summation.... AVOID THIS PLACE AT ALL COSTS!!!!", "business_id": "74dAKJ9Lx0cYmb3GOxdFEA", "stars": 1, "date": "2014-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-5i7lXTKJoyv3tjX0CY9Mg", "review_id": "pnV38q_cjeQIyeDldk0RqQ", "text": "Friendly staff. New and clean. Comfortable beds. With supper included, it is well worth the cost.", "business_id": "Lvk4P_Npmueqs-n1hAxxWw", "stars": 5, "date": "2013-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0qCp0652o8TXeURobue6SA", "review_id": "80PGNj2DfOESNww-zZcVtA", "text": "Better than we expected. Had never stayed at a Staybridge before but decided to since we are IHG rewards members. Free upgrade to a two room suite with my membership. Staff very nice. Room was spacious and very clean. Nice, small kitchen area. Breakfast bar was clean with a lot of options even for people with food allergies. I would definitely recommend.", "business_id": "rKNtd_M2kWDW8sQKYzetKA", "stars": 5, "date": "2015-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hCd0OEKoa9819QJ9qyDN7w", "review_id": "-r__FbZOeAGe0IF0XKbN-w", "text": "I dont why folks complained about this place but for a Marriott, it is great!!  So e say its far from the center of Madison but its not that far", "business_id": "ckLRf3lYn9DxmNxd-mu2yA", "stars": 4, "date": "2015-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "r5xg_5gbCnu82vxdfoq63g", "review_id": "2UVbuoCjZCB3VDa2CaXWBA", "text": "Hotel definitely needs a face lift. But for the price... It's a quiet and comfortable place to stay. I was a little disappointed how freezing cold the pool was. My 3 yr old had blue lips and was shivering after 10 min in the pool. We had a good nights rest and the breakfast was yum (eggs, sausage, waffles,etc).... Lots to choose from. I also liked that they had a little store stocked with snacks and inexpensive beer and wine to choose from (very innovative to offer)! I also liked the fact where the hotel was located. Very convenient to shops and a few miles from the capital. If we return to Madison I would stay here again.", "business_id": "i9JeI7bd1qXGi15FoD45GA", "stars": 4, "date": "2012-05-14", "type": "review"}
{"votes": {"funny": 9, "useful": 0, "cool": 2}, "user_id": "pfxuZwa-armTo7OgORulAQ", "review_id": "BPE-ScqznYg2hzRPWkjLmg", "text": "I once thought I knew what luxury was. Luxury is yachts. Luxury is stretch limousines. Luxury is diamond tiaras and Rolex watches. Luxury is Bentleys and Beverly Hills; bone-in filets and \"bon appetite\". Luxury is throwing some glitter and making it rain.\n\nI once thought luxury in its truest form was to only be attainable by the rich and the powerful - but boy was I wrong. People -- luxury IS attainable. I know this, because I recently experienced it at the Country Inn and Suites outside of Madison, WI. \n\n Whether you opt for an \"inn\" or spring for a \"suite\" - you're going to love this fucking hotel. Upon entering the palatial lobby, a charming bellman presented me with my own personal luggage dolly, even though it was clear that my strapping, young body was more than adequate to carry my small, nylon duffle bag. The Sconnie at the front desk even put me up on the top floor of the resort (floor 3), which offered views of one of the most gorgeous bodies of water I had ever seen. \n\nThe ice bucket was a nice touch. It was large, though not too large as to take up much of the expansive counter space the room provided. There was even a plastic liner for the bucket--which I scoffed at. To think, who would even consider using it in such a pristine, meticulously manicured suite? I quickly tossed it, and when I did I couldn't help but notice the luxurious mini-fridge down below. Let me tell you, there was nothing \"mini\" about this fridge. I fit an entire case of Coors Light in there, along with some Gatorade, and cheese curds to boot. It looked so cool and cozy that, at the end of the evening, I wanted to curl up and sleep in there.\n\nThough it wasn't easy -- I refrained from sleeping in the mini-fridge. I mean, how could I sleep in there with one of the most luxurious beds I had ever seen staring me in the face? You could fit John, Kate, and the 8 on this bed. I never would, though. I'd kick them all out and keep all of the fresh pillows and down comforters to myself-- because THAT'S luxury, and Kate is mean. If it wasn't for a call of nature which I battled until my bladder nearly exploded on all of the luxurious bedding, I might STILL be laying in that fluffy wonderland of extravagance. \n\nNow, I've peed in some nice bathrooms... very nice bathrooms actually. Once, I came across a bathroom SO nice, I couldn't pee in there. I held it, and peed in my less fortunate bathroom at home-- but this bathroom? This bathroom was so luxurious; I HAD to pee in it. I couldn't unzip my fly fast enough (literally, I peed a little in my pants). Thankfully there was a cornucopia of fine soaps and lotions at my disposal. I would bet that royalty uses these same soaps - they just had that royal smell about them. When I was done drying my hands, I squirted a little more of that soap on them and didn't even wash it off.\n\nSummary: In hindsight, this is really only a place you want to stay at if you're celebrating something really special-- a honeymoon, for instance, or a significant wedding anniversary. I would've stayed someplace else had I known the Country Inn and Suites was so luxurious. Now, back at my home, I fear I may never taste that royal tang again. Enjoy your stay here; cherish it. I know I sure did.", "business_id": "hmYAW7mhIz_o8ArencdkDw", "stars": 5, "date": "2011-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Ez5s5sU6jqdxwDnpE5KiCg", "review_id": "3fLl3F_ZKtBwCM9petl0Qw", "text": "We spent one night at the La Quinta Inn in Champaign while attending Ebertfest. There are few hotels in Champaign that are actually convenient to anything other than the highway and the mall, so that was neither a draw nor a drawback. Our room was clean and comfortable, and the staff at the front desk were very apologetic about putting us in a handicapped-accessible room rather than the regular king room we'd requested. Handicapped-accessible primarily meant a larger bathroom/bathtub, which is always a good thing. The Continental breakfast was uninspired but not skimpy either: breakfast breads, yogurt, fruit, cereal, prepackaged muffins, and a waffle bar. In short, the La Quinta was a good value, and I'd be happy to stay there again.", "business_id": "ftjhXiYI0CFOk_px-lafWw", "stars": 3, "date": "2013-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-bmfGCByi7qv1fDzR49eGw", "review_id": "lsks9dOUezONxkeKaI_HLA", "text": "We needed a place to stay the night before moving our kids into a nearby apartment complex.  There were 5 of us and we wanted to spend as little money as possible.  We asked for a large room with at least 2 beds and a sofa bed.  They told us we would have a small suite with 2 beds in one room and a sofa bed in another and a kitchenette.  For the price 109 plus taxes we thought this to be quite reasonable.  Upon arrival we were surprised with a larger suite, 2 bedrooms, a full kitchen, bath, and a living room with sofa bed.  We found this even more reasonable.\nThe cons about this... while this was a large suite there were only 2 chairs in addition to the sofa.  Hard for 5 people to eat a meal with only 2 chairs at the table. The breakfast area is very small, hard to get around without bumping into guests already seated.  Not a great selection of items for breakfast.\nIf needed I would stay again.", "business_id": "KyXO7gXGVdpPJ1enxIf3Ig", "stars": 3, "date": "2014-05-27", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "VqoZ6_dh4nPGJP9H_XsweQ", "review_id": "x1C9MY-Pe_cmFHL-2T7QiQ", "text": "We stayed at the Hotel San Carlos this past Memorial Day weekend during the Phoenix Comicon and not only is the hotel beautiful and rich with history but the staff is AMAZING! \n\nThere were 5 of us checking in and we had a small room that was going to be tight but we were going to make it work when the girl behind the counter let us know that the suite was available and it had more room. She offered us a good deal compared to their normal pricing but we were all a little tight on funds so we were nervous about upgrading. She asked the manager to come over and after chatting with all of us for a few minutes (she was so super sweet and informative about the history of the hotel and an absolute pleasure to speak with) she worked some kind of wonderful magic and brought the room down to a killer deal that was completely mind blowing. All of us were so excited because not only did each of us now have a bed to sleep in, but it was going to save us money so that we had a bit more to spend at the Con. \n\nThe room had a separate living room with a couch bed, desk, chair, and foot stool. The bedroom had 2 full-size beds and a nice desk. The view was of downtown PHX and it had 2 nice-sized closets and 2 bathrooms! This was perfect for 3 girls and 2 guys since we all had to get ready at the same time. \n\nThe hotel is beautiful. The lobby is quaint and well appointed. Obviously being a historical landmark it is older and smaller than the gigantic contemporary resorts that many of us are now used to, but it's so much better in many ways. It was warm and friendly and felt like a loved one's home. Honestly I would stay there again anytime. \n\nThere is talk about it being haunted but I didn't get a scary vibe from the hotel at all. I will say that without knowing anything about the haunting history I did step onto the elevator by myself to go up to my room and all of the sudden I smelled some sort of fruity  perfume smell that was not present when I first got into it and the elevator which was set to go up took me down to the basement even though the B button was not pushed and my room was on the 5th floor. The doors opened revealing the basement and I said \"Hello?\" There was no one around. It kind of creeped me out a little bit later when I found out more about the history of the hotel and it's haunting stories. \n\nI highly recommend the Hotel San Carlos for those of you who appreciate history and don't mind a hotel with character. \n\nOh and the parking isn't awful. It's just a little jot up the street which for those of you who don't mind walking a short ways, is just fine. If you do mind walking, they have valet.", "business_id": "_yfprBETaYgySkKyl8ZWMQ", "stars": 5, "date": "2012-05-29", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "xofFo7WFfHOkzbtoG6SgPg", "review_id": "BsgWNf9mYT-cXgEnCmHFGA", "text": "Beyond great hotel! \n\nI was very happy with my five day stay at Hoilday Inn Hotel and Suites. Guest services were very helpful, friendly, and nice everyday with every person. They helped me out when having payment issues due to a third party setting up my stay for me. My room was nice, with a microwave and fridge, which I do not see often. This was prefect for a yelper on the hunt for great food; meaning I could bring things back with me. My bed was comfortable and room service cleaned everyday, placing things just where I left them if they need to making the bed or cleaning the sink. I was able to control the heat in the room! Big screen tv with hbo. Coffee maker in the room, iron in the room and FREE WIFI were a plus!\n\nI also loved the workout room. While small, they had a few machines that could keep this girl happy. This room was next door to me and I barely heard the machines being used on the other side of the wall! Thanks for thinking of me! The wokout room was also clean. Breakfast was great and full of hot/cold selections. Not only pastries, but egged, bacon, cinnamon rolls, cereal, oatmeal, biscuits, ect. Things changed from day to day, but this was what a continental breakfast SHOULD be! \n\nLocation wise, this hotel was only 7 min walk to the convention center. It is not far from the airport. I would save money by riding on the metro rail and walking down if you have carry-on, as the $24 dollar shuttle was not worth the distance to/ from the airport, but that's just me being cheap. \n\nI really loved my stay here and would recommend this place to anyone!", "business_id": "jYsa5qLFZxhVtwDHZMW-SA", "stars": 5, "date": "2012-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "ToIcMshsBV7T63EAq59Sog", "review_id": "ua7ZjntHlKCwXByOTkIuvg", "text": "Katherine sets the bar for Hotel excellence at the Registration Desk - efficient, pleasant and always acknowledges me by name.\n\nDon't take the  5 minute cab ride, they have a minimum fare which is pricey. Take the hotel shuttle and give the friendly driver a nice tip, you still save $10.\n\nDuring the sunset, lightning storm or after the rain the upper floor walkways give a terrific view of the sky show. \n\nThe suites are spacious, clean and  have wide screen tv's.\n\nThis has to be one of the best bets, as a moderate business hotel,  close to the Phoenix airport, good central location, with quick access to the freeways.", "business_id": "qIhBNeE64skjowRs6TTwJA", "stars": 4, "date": "2009-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "K1XY02k2WYq9Bk924XuNhA", "review_id": "sne_mg_c1---edUE5xjqgg", "text": "A little disappointed in this Hilton property.  For the cost the only thing that was worth the stay is the complimentary breakfast. I have nothing against seniors, I'm a young senior myself, but I thought I was at a golden girls convention looking for golden men. Lots of seniors here.  Room was not what I expected.  Not the best Hilton property I stayed at.  Find another Hilton in Phoenix if you can.", "business_id": "qIhBNeE64skjowRs6TTwJA", "stars": 2, "date": "2015-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "F5Cm8am8Y0hlE1JVdQgPTA", "review_id": "a3SBf1EXsGaC_wrDhGH4-Q", "text": "In need of updating.  Very 1983.", "business_id": "_yGo2ubkwQPXcKrdcURSNw", "stars": 1, "date": "2013-04-22", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "waD2euOMPTnTzQ0thq3H6Q", "review_id": "hWc_F_5rmjb-tZ-xsT61Gg", "text": "So we arrived at 3:30am to a self-parking experience that was less than favorable. There was little to no direction or guidance as to where to park so we were flying blind. We parked in P2, the underground portion since the 30-ish spots they have right in front were taken. We took the elevators up to ground level to find the doors we needed to go through to get to the hotel LOCKED. It took us 20minutes of wandering around to find another way out and to find the hotel entrance. OH, and did I mention that not 1 of the 3 phone numbers I had were staffed by a live person so we couldn't even call to get advice.\n\n30 minutes after arriving, we made it to the front desk. It took us another 45 FUCKING MINUTES before we got a room key. Some dude, resembling a retarded crypt keeper, was trying to help us check in. 15minutes of the crypt keeper staring at the monitor I suggested perhaps he seek assistance. His coworker wasn't much help either and was a complete d0ckle. Neither one of the guys would communicate with us, they just stared and chicken-pecked their keyboards with perplexed looks on their faces. Finally, 45minuites later WITH 0 EXPLANATION OR APOLOGY, we finally received our keys.\n\nOnce we finally got to our room, everything was awesome. Room was huge... bigger than some of my friends' L.A. apartments. Seriously. Nice LCD TVs in both the living room and the bedroom. Huge, comfortable, clean, fluffy, comfy bed. Large, nice bathroom.\n\nOur 2 day stay was nice and we really liked our room. For $79/night thanks to groupon, we felt like we got a good deal.", "business_id": "urBWfXQjyyWIO5B7FvnOpg", "stars": 4, "date": "2010-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PDz0NxH-hBgC-QjyPJwOQw", "review_id": "1slzQm90BtUx4FW0aa2ofg", "text": "Hotel has an odd set up with multiple wings.  Lobby and rooms are dated and need a refresh.  Parking is not adjacent to the hotel, but its free.  Central location close to downtown.  Not a bad experience, but would be better if facility was updated.", "business_id": "KQzpjBmnAMXPqipeWTKG0w", "stars": 3, "date": "2013-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "76oiMGuWutEz8tXYyUOTgQ", "review_id": "oI-Hpdjg5CphH3xeDaBwZA", "text": "I had the distinct pleasure of having a group meeting at the Ritz Carlton Hotel in Phoenix, AZ. I must say that from the moment I began the sales cycle through to check out, the service was impeccable. Consistency in the Ritz Carlton Brand was noticed throughout my stay. The meeting hosts were attentive. I had billing requirements outside the normal for this group and the hotel found a way to pull it off. The entire team made my meeting a success. \nThere is room for updating the hotel. The beds outside of the club level could use upgrading and the rooms are a bit outdated. I would love to see them keep the charm with a hint of modernization and better beds. The club level beds were amazing.\nThe club level service was impeccable. I was there last December for an overnight stay. The staff not only remembered me, but remembered my name. \nGreat job, Ritz Carlton!", "business_id": "HLQUH1VAw4KbSV-IhxOPEw", "stars": 4, "date": "2013-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lGBtatQQgkeEALEplrEzLw", "review_id": "H6PdJaZVpQmLIAoOK5X8iw", "text": "I was here last month for a business conference. The rooms are very nice. I love that there was 3 separate sink areas (with mirrors and counter space). I was staying with one other person, but if someone was willing to stay on the pull out sofa, we could have easily done 3 ladies. \n\nThere are two separate rooms in each suite, with a door. In the first one as you walk in, is a small sofa and chair with ottoman. There is a good-sized table and chairs and a small sink area with a fridge. There is also a bathroom off to the side which was well equipped and decent sized. I never felt like we were in each other's way and I never worried about visiting with other people in their room, there was always plenty of space.\n\nThe other room is quite large with 2 beds (or perhaps a king, not sure, we stayed in a double, obviously), a wardrobe, and an area with another sink/mirror/counter. Very nice for two women trying to get ready in the morning.\n\nI cannot talk to the shopping or how far it was away from anything. We pretty much stayed in the hotel or went to specific places. The taxi from the airport was $25. Because we were there in groups, when we went out to dinner, the hotel provided us with a free shuttle (the driver was very nice). The hotel staff were simply amazing, always very nice and accommodating, no matter how weird our questions were (and we can ask some weird questions!)\n\nThe downside is that the air conditioner in the room was VERY loud and although we had it cranked down to 60, I doubt it got cooler than 75. That seemed to be the same according to others as well. I like a very cold room to sleep in, so that was a little annoying.\n\nThe meeting rooms were nice enough - again I didn't think the air conditioner was cold enough though. Maybe this is the difference in me living in Austin and visiting Phoenix, but I like air conditioning!\n\nIf you visit this area, make sure to visit Tarbells Restaurant too. Absolutely exquisite!", "business_id": "FQudBiBiz9bGQLF_kK8UCg", "stars": 4, "date": "2010-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YXfDF1txYwmeu2ih1sRcbg", "review_id": "XTAa58VR10-LXIz-4CuNVQ", "text": "Great breakfast and lunch.....HORRIBLE ancient slow slow slow slow slow internet....at $300 a  night!", "business_id": "-nWigG5EhFLjdSgGZthS3Q", "stars": 2, "date": "2014-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RZZX5_JiCzxX1ntD5oa7xA", "review_id": "82Tksuq1buE51yG-VjtgAw", "text": "My man and I stayed here for a Cinco de Mayo staycation. It is a beautiful resort. I spent most of my time relaxing. We ate brunch at the restaurant. It has a beautiful patio and great service.", "business_id": "rLAeltELaGdQKh_LYIllEA", "stars": 5, "date": "2012-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sxNhxrQsDf3OWu21dvesJg", "review_id": "0xcyW4FQsqW255iwyoX5tA", "text": "This resort is all about service...they really tske care of you! The property itself has such deep history, read the coffee table book about the history of the resort. The breakfast was amazing and so was our dinner at T.Cooks! Do you want to wind down? Just off busy bustling Camelback, you can't help but wind down and relax. Try the Spa as they do it better than most! I recommend this resort!", "business_id": "rLAeltELaGdQKh_LYIllEA", "stars": 5, "date": "2015-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dmacZGq8EPICw8_ATGJVDw", "review_id": "XYd_HZOYm44sKcwpb_JEwg", "text": "We were surprised at the services offered.  Plus everyone was very pleasant.  We picked up a trip tix and they gave us the maps and books. We waited a little while but not unreasonable.", "business_id": "vBRJWnMaAqUyZ1CbwnJXLQ", "stars": 5, "date": "2015-03-10", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "oum6xTcsVSIXAEO9qb8CRg", "review_id": "8SYtqrO0jEsrj-5rgVSB4A", "text": "This review is for the staff that I dealt with at the Hilton Phoenix Airport. I contacted the hotel last week to obtain a copy of a receipt. I spoke to a gentleman by the name of Cisco who answered the main phone line. He was over and above a very helpful, professional and kind person who ensured that I got in touch with the correct people to get the information I needed very quickly. It's rare to see wonderful customer service like that these days, so I truly appreciate it.", "business_id": "KnRRMCqQQqlyMphif6cTaA", "stars": 5, "date": "2012-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "02X73Ba14FLNWAzjri_dLg", "review_id": "NN1QEVy_qU8x-q-xOyPqLg", "text": "Courteous staff, clean rooms.\nKenny helped us after long delays and even though the network was down he was able to accommodate me within a reasonable time. \nToo bad the network was down, most places have an IT group to call in times of need. This just slowed the process down by about 15 additional minutes.\nThe room was large enough and had everything you'd expect from a hotel. Good air conditioning, nice plump pillows, clean floors and clean sheets. \nThe shuttle makes trips to the airport every half hour, they accommodate the air flight staff before guests. So beware; they might tell you one thing but they'll take it back as soon as air flight attendant customers request their needs. \nShuttle was suppose to leave at 5am, people waiting for the shuttle. It's 5am and here come all the crew, \"oh, the other shuttle will be here in five!\"\nSo yeah, it was there 7 minutes later and it didn't set me back at all. Just kinda upsetting, know what I mean!\nOverall 4 stars", "business_id": "NLKjSOHL4F6yQQooc6JbyA", "stars": 4, "date": "2014-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1QpPlc8cHb4Yt4ePPh1dxA", "review_id": "uBJKHbgkkYa87nxykJT-1A", "text": "Only if there were negative stars, I could give those. I have been experiencing real bad service from Discount Cab lately. They promise a wait time of 5-20 minutes but they are never on time. Their cabs show a little sticker on the cab window for getting a $5 discount code, but the cab drivers are not educated enough to use those. They call and call and call upon passenger reaching the destination which further delays. They boast of texting the pick-up address to 777222 but to my surprise they dont automatically assign a cab driver to the booking. You get a confirmation SMS, but please don't expect a cab anytime soon. When you get agitated enough, you call them and there you go. First you need to wait for an operator to get online and then he/she would start with, 'What is your pick up address','What is your first and last name','what is your phone number' and blah blah blah. It is then when they assign a cab driver...I WAS SHOCKED.\nThey expect a call from you, after you use the easiest way to book cab, \"texting\".\nIf I had to do all these, why would I go this way.\nThis was still not done. These people lie all the time. I called them 4 times this morning and everytime I got to hear 'Ma'm your cab is 8 min away from you','10 min away','4 min away'. By now, I had already missed my morning meetings.\nI was left with no choice but to WAIT WAIT WAIT and MORE WAIT TIME. What turned me off was why are these customer support associates RUDE and why do they LIE?\n\nI had a horrible start of the day. I would strongly suggest everyone here not to use Discount Cab.", "business_id": "6InaHoU8KNlDeGP48RqzBg", "stars": 1, "date": "2014-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7jgv5LuNPmLk_NiwMlpYxw", "review_id": "NIxhsgC8dP3aE9e3VuhPVQ", "text": "Horrible service & rude as well..\nmy mom broke her arm and could not take my sister to work, so we tried Discount Cab. We arranged a taxi to pick her up at 4:30, however the taxi didn't show up at all..we called an hour1/2 before.  After waiting an hour, we called discount cab back & they said the taxi didn't pick her up because there was no cab driver in the area..my little sister was late to work", "business_id": "6InaHoU8KNlDeGP48RqzBg", "stars": 1, "date": "2015-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PCny1cwjCCu19VudKeCanA", "review_id": "tEcgOMDGVA57yQCbYkmUzw", "text": "Is no stars an option?! WORST CAB RIDE EVER. Guy was a huge jerk to my grandma and me when we got picked up from the airport. HUGE jerk. I would recommend calling your hotel or a friend to come pick you up over using these jerkfaces.", "business_id": "3hUw4RmFFdOn7Ix81n5Sag", "stars": 1, "date": "2013-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "325QatjmjSgREU53oS917Q", "review_id": "fFTzAZw_W-ehks6ccRNt3Q", "text": "I booked a rental through Costco Travel.....\n\nthe line was extremely long( like waiting for a ride at Six Flags).\n\nIf you prefer to use a debit card, they will slap $200 dollars more on hold in your account and run a credit check. I think that it's the most ridiculous thing ever. \n\nI hate the fact that I didn't get to choose my car at their garage. A slip was given to me on where my rental is parked, and I had to get to it on my own; without any personal interaction if i had any questions about the vehicle. I didn't like the Ford Fiesta they rented out to me. The breaks were making some sounds....AND!!! it was cherry red. I didn't like a cherry red car.\n\nOther companies gave you options and are more personal. Some even pull the car up for you, and help you put your luggage in the trunk.\n\nI like to be treated like a princess.\n\nTheir insurance is also pretty expensive. I was shell shocked and for the very first time, i drove a rental without any form of insurance. Thank goodness, the car was alright. My damage: $152 for a 6day rental. Not bad.", "business_id": "FYCVF_1qYm3x5DYCbmmK1g", "stars": 1, "date": "2012-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CF2fsvYZp-FZpiFCCj2QFg", "review_id": "5ULO55vGU96mMr7fwWR-PQ", "text": "Booked a minivan through my credit card rewards program, so I cashed in some points plus about $350 for a nine day rental, a paid in full reservation they'd had since October 2014. When we show up at the counter, we get right in with no delay and are greeted by Darius (also a terrible musician's name - should've been my first clue). Before ever offering the vehicle class I reserved, he says \"No self respecting man drives a minivan, but I can put you in an Expedition or Tahoe for $40 extra per day)...um no thanks dude. He tells me the only minivan they have available is a Kia Sedona. I wouldn't mind having that for three days, but nine? Do you have ANY Caravans or Town and Country's? No, he flatly replies, but for $10 per day extra you can have a Toyota Sienna. WTF? (Note that the Sienna was parked directly across from a Budget owned Town and Country). A minivan's a minivan, but apparently the Sienna comes with wings or a jet pack - not sure which, so it's $10 per day extra. I don't want a damn Kia for nine days and I just got off a 6.5 hour flight from Anchorage, so fine - I'll take the damn Sienna and call customer service later to flesh this out. Which I do, and the CSR agrees saying that the Sienna squarely falls within the guise of \"or similar\". He says while he cannot modify an open reservation, he'll notate my reservation that the up-charge is not warranted and is to be removed upon return of my rental. Fast forward to the return to PHX: the return agent scans the car in, I explain the situation and she points me over to the FastBreak counter. I am \"greeted\" by three short bus all stars who explain that because the Sienna has this flimsy piece of shit jump seat for the middle row (which is only available on the absolute base model Sienna, ironically), that its 'eight passenger capacity' versus a standard minivan's seven seats warrants the extra charge. I point out the notation from Budget corporate, to which they don't blink and instead remind me that I 'agreed' to the charges, thus I owe for them. (They'd make model date rapists). I ask for a manager who promptly comes over with the standard issue fake friendly, I'm not really listening demeanor they all have - who reiterates all of the above. I asked her if the Sienna is indeed a 'premium' minivan, where is the option at the website to reserve as such and pay the difference? Of course, she can't answer that because that option doesn't exist, hence the bullshit up-charge; but that doesn't stop the prepubescent punk at the desk from rolling his eyes and shaking his head at the question. The manager even went as far as to assure me that this was 'no conspiracy'; to which I calmly replied no one on her staff was competent enough to execute one. This was your rental agent's feeble attempt at shaking me down for an extra $90 + tax I did not owe for on a paid in full reservation. She quickly dropped the friendship act and said 'it seemed' I was accusing her staff of being unethical; I replied that's exactly what they are - and the conversation was promptly concluded. Since we were about 3.5 hours early to the airport, I had nothing but time to kill - so I called the 800 number again and had a brief chat with a friendly CSR that agreed with my assessment and the previous CSR's; she even went as far as to run the car's number through her system and it decoded as a minivan - the class on my reservation. She apologized profusely and reversed the charge. Morale of the story: PHX Sky Harbor Budget is staffed and managed by a bunch of horse's asses, while the national 800 number is quite helpful. Can't wait until they have the best price on my rental again...", "business_id": "FYCVF_1qYm3x5DYCbmmK1g", "stars": 1, "date": "2015-03-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "eTRiDnLNg4znhSZ-9_Gmpg", "review_id": "tW193GoacY3IO5qes7JIuA", "text": "It's a nice roomy place with a smelly carpet but the chairs are uncomfortable for sleeping if you get stuck there.  I stayed there for 2 weeks once in the winter when I couldn't get a flight out.   No hot water in toilets, which usually stink of sweaty perverts and farts.  Food is awful fast junk $$$, etc, & you are in the middle of nowhere unless you drove or have a uni-cycle in your pack.  \n\nYou have people sleeping in nooks & corners who got stuck there.  The con artist crooks on the prowl looking for dumb people who overpacked & are wearing an i-pod radio.  The snooty plastic people who came from Vegas, with the \"look at me, I'm so rich\" attitude pulling their doofy luggage w/ a mini poodle tucked into a plastic bag.  The \"yelling\" people who eventually broke down & couldn't take it anymore.  Yeah, this place is hell alright.\n\nYou fly into one terminal then have to hike 2 miles away to another terminal and your plane leaves in 15 mins.\n\nCustomer service is absent from everyone you encounter from ticket sales, to security, to janitors.  They walk around with a \"fuck you\" look on their faces.\n\nYou drive around for hours because you can't turn around or stop because rent a security hollers at you to keep moving.  Of course, then there's the moronic homeland security, aka \"morons without a clue\" who x-ray you, fondle you, and butt search you for 2 hours just to get thru the bloody gate.  It takes another 20 minutes just to put on each garment you had to remove, including your underpants.  Don't bother the dumb cops, they'll choke you to death for no reason.  They ride a bicycle inside, on the carpet, what jerks.  \n\nPlus, if you look like a foreigner you have to deal with the idiot Border Patrol.\n\nIf coming in from abroad, you'll stand about 4 hrs in line, then get the bored, rude idiot, who does nothing but stamp your passport and asks if you brought \"weed\" in & tries to ask \"trick questions\" like what high school you went to & who was president at the time.  Only Americans would know that.\n\nAfter all that's done, you can get on the small, smelly plane with a bunch of rude, inconsiderate jerks & get the last seat in the back by the clogged toilet.  But hey, at least you made it alive.  Look forward to the annoying \"free drink time\" by the rejected models who are so stuck up & the turbulence out by Kansas.\n\nBeats the Los Angeles Airport or taking Greyhound just barely, tho.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 2, "date": "2008-04-02", "type": "review"}
{"votes": {"funny": 4, "useful": 4, "cool": 4}, "user_id": "mTmHkMOdv-VQdE8VCJ8GlQ", "review_id": "KQa4NW9wLdilXVWIicyYwA", "text": "I've had a love/hate relationship with PHX that just turned to like.\n\nWhen I first started coming thru Sky Harbor about 10 years ago, the place really was going thru growing pains.  Security lines were the longest I've ever been through, especially with all of the seniors and vacationers who are not accustomed to flying taking their precious time, packing illegal things; you get the picture.\n\nThe rental cars were in the adjacent parking structure, a 10 minute walk under a covered walkway.  It doesn't matter if it were covered, when it's 100 degree outside, you're gonna get hot.\n\nFast forward to the present.\n\nThe security lines are moving, thanks to more stations.  Shopping area before the security control resembled an upscale shopping mall.  The rental car area is a ten minute bus ride away, and is worth seeing, even I was impressed.  It looked like it's own terminal, with nice check in counters and an escalator ride down to your cars.  Me, I skip the counter and look for my name up in lights...that's how I roll.\n\nNow if they can get rid of those escalators and elevators that doesn't stop at every floor.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2009-03-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "usQTOj7LQ9v0Fl98gRa3Iw", "review_id": "7IL4ZbcpCgtiDBO1PwFCzQ", "text": "Sky Harbor...while you are not the most confusing airport I have utilized regularly, you can be a bit intimidating.  I have yet dared to park on site at the airport for I fear never being able to find my car ever again.  I pray when using you as a transfer site that I don't have to switch Terminals, the one time I did woah, almost missed my connection.  The security lines...you just never know.  I was 3 hrs early once and it took me 2 hrs just to get thru security and other times I made it thru in less than 10 minutes.  \nNow I sound ungreatful.  I should be lucky to have you in my back yard.  Having lived in many rural locations, I remember having to travel hours just to begin my journey here.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2010-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XUuIkTfKf-lYf4JGhNRuHw", "review_id": "L9-o8Nt-0qf4lMJh9SKIEA", "text": "Several terminals at this very large airport.  You could have to walk a while to get to a connecting gate.\n\nSecurity line at the main terminal is usually very long, but not at the smaller terminals.  TSA is monumentally slow at terminal 2.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2011-03-20", "type": "review"}
{"votes": {"funny": 6, "useful": 9, "cool": 7}, "user_id": "kGgAARL2UmvCcTRfiscjug", "review_id": "5cwVQHkOhAhnfzszzz1SLw", "text": "Upon further review, I have to update my review of Phoenix Sky Harbor Airport....I must have been lucky the first few times I went through here....either that or this place went downhill fast.  Here's some of my frustrations with this place:\n\n- The FREE WiFi sucks.....the past 4 times I've been through this airport, I have been unsuccessful in connecting to their WiFi.  I can get the connection on my laptop, but it won't load up any pages.....don't know what the problem is, when I land in Vegas or San Diego, it works just fine there.\n\n\n- Car Rental return lanes through the airport is confusing.  I am willing to bet that 9 out of 10 people who try to find the car rental return lane have to attempt it at least 2 or 3 times to figure it out.....the directions and route is crazy confusing.  The rental center itself is convenient, and the process of returning your car is efficient, but driving there is a disaster.\n\n- Food options are limited once you go past security.  Not much going on there.\n\n- Gates have insufficient seating.  I don't get it....there's not enough seats at most of the gates.....it's very crowded and people are cramped all over the place.\n\nHopefully, they can upgrade it soon....it needs it.\n\nReturn Factor - 100%, but not by choice.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 2, "date": "2011-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4G68oLRY3aHE5XUt_MUUcA", "review_id": "LoR0GIxd9e6v3QvwR_zybA", "text": "First time to fly into Phoenix was this past weekend.  Renting a car always seems to be the difficult part, but Sky Harbor has a pretty good system.  There is only one shuttle to the main rental car complex (it's a small airport in-itself) so it's pretty easy to get to the terminals and back.\n\nI didn't get to spend much time in the terminal... I arrived in the morning and had to rush to get into a car and drive to get to my destination... and when I was departing, it was early morning for a 7am flight - (not the hour I am the most observant).\n\nI guess I was lucky... no delays and problems for my trip.  I guess it's bad that I remember my layover airport more than my destination airport.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2011-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "68vtzjl2k58XqrT89KU8xQ", "review_id": "e8eowhApJbw8IW5YhUA98A", "text": "I came through this airport for a surprise birthday trip so maybe I'm giving this review through rose colored lenses but I was satisfied. The inside is a bit outdated but there appeared to be plenty of food options and it only took my best friend and I about twenty minutes to get through security. When we arrived, we easily found a bus to the rental car facility and on our way back the same was true. Everything appeared to be running efficiently and I didn't mind our three hour wait to get on our standby flight. They also have a free Wi-Fi here which is a huge plus since a lot of bigger and more popular airports don't. Some of the food options were outside of security so plan ahead if something really catches your eye because you won't be able to bring your drink through.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2012-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "k5bDN0HquYYiScd5Tz41Pg", "review_id": "50rYXsTFKHwozsD0SeBYSQ", "text": "Terminal 3 is great; friendly staff and quick check in process.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2012-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "AbO18pf8bXG1qF9bb9L6wQ", "review_id": "V-1AhQHdOSdNg1G1z8s0bg", "text": "Put your walking shoes on!  Especially, if you do not check the monitor and they change your gate on you!  I feel they could use more monitors.  They do have the moving walkways to assist....I swear we went on 15 of them to get to our gate.  A little crazy, a lot tiring.  We were just here for two layovers.  We were in terminal four.  There are a lot of dining options from CPK to Focaccia Fiorentina.  I wanted to grab a sandwich since I was not arriving at DTW until 130am.  Glad I did.  The Classico was super good!!!!", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2012-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0s-GUTUlO1KbmtA8AUxCbQ", "review_id": "bQlOv6GuoncoodGpC1o8AQ", "text": "Great airport! Very clean, security lines were not long. And free wifi is always a plus.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2013-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kxZIebwbpe_ddry6EKMdCg", "review_id": "LtmsvyUdMxLbIdftiit5fg", "text": "Unimpressed.  This airport is carpeted which simply grosses me out.  In addition, there are not that many food options passed security.  I know we won't starve but there is nothing healthy and at 8 AM, very limited options for something more savory than breakfast.\n\nThe airport is also confusing.  There is no efficient way to navigate between major terminals.  To rent a car, you have to board a shuttle and ride for 20 minutes. It's obnoxious.  \n\nThe USAir check in was also a cluster with three different sections offering three different services which made it MORE confusing than it needed to be to simply check in with luggage.  Annoying.\n\nMy patience is never on point at an airport but in this case, they need to take some notes from IND.\n\nOn the upside, Wi-Fi is free (which is rare).", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 2, "date": "2013-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NNdfPF-UhvLB8FxbsuSC5A", "review_id": "w2ie42KHvcxnCUOTvcv_gg", "text": "How can you say anything bad about this airport?  This is the America's Friendliest Airport and it offers Wi-Fi for FREE, let me say again ... FREE WI-FI.  Have a safe travels everyone!", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 5, "date": "2013-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "He132gL-DaoiI75ababAWw", "review_id": "zbVTD9B_qVUBSABGRBj1_A", "text": "I was pleasantly surprised by how efficient and friendly this airport was!  Granted, we showed up at the United terminal a bit early, but we didn't have to wait on any sort of line to check our bags, and the attendant was very helpful.  Security was quick and painless - again, no line, and none of the typical TSA douchery.  The airport is clean and has a good selection of places to eat...nothing fancy as far as I saw, but I'm more concerned about getting on my flight than having a 5-star dining experience.  Overall, a stress-free experience that eases the pain of the multiple hours of travel I have ahead.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2014-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "R6vVcKZwtLv80LDdcVumNQ", "review_id": "TzsUOsexeSwVvaI-M75KFA", "text": "I've lived in Phoenix for the last 10 years, thus I have flown in & out of Sky Harbor multiple times or picked up friends and family. Sky Harbor is a major hub and is always busy! I think this is a much older airport than most carpeting and fixtures are outdated. However, I'm sure with the completing of the new tram shuttle line the airport will be given a make over at least this is my hope. \n\nThe high points are You can reach most departure gates going through baggage claim of the arrivals side. there are 2 cell phone lots on either wing of the airport for waiting. Lastly if you're in a hurry you can maneuver through traffic by routing through the airport reaching the 51,202, 10, & 143 depending on which direction your headed to or coming from.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2014-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KgEVg0aKm0y8w_-wHFIbSA", "review_id": "LhzwEkOD4t6wbBwnBB8nig", "text": "No matter how any times they tell me that this is the friendliest airport over the PA system, it still doesn't make it true..\n\nThe good thing is that the security lines are short the majority of the time.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 2, "date": "2014-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gx3ZRjh43OOuavKl_rXvrA", "review_id": "kaGMwje9W4jHM7O9VUl0IQ", "text": "Flew out from here in Phoenix to San Jose Mineta, though Sky Harbor tends to feel a bit small and undone to other airports like SFO or Oakland it's not that bad.\n\nIt's clean and cool, which is pretty much all I can ask for with the heat in AZ. The bathrooms are clean, there plenty of places to grab some food and \"Arizona\" souvenirs. The TSA here is pretty friendly and got me through security with ease, while making me feel safe.\n\nThe only cons was that the car rental building is pretty far from the airport, there isn't much access to outlets or charging stations and Wifi was difficult to connect to here. Other than that, the airport is great but could be greater with some small changes.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2014-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4I20VXHPK2V3pY8yTYm6sA", "review_id": "icnEbhchBeT55INiTetacQ", "text": "Two observations for this airport: First, coming in on United it seemed to take an unusually long time for the bags to make it to the carousel and when they finally did start to come out the flight still was not listed on the incoming boards.\n\nSecond, US Airways is a zoo for departures. Having business class access makes it a lot easier but if you do not, then be sure to allow some extra time to get through the Disneyland like crowds.\n\nOtherwise -- for an airport, in general, I have seen better, I have seen worse. The rental car shuttle, at least for United, was right across from baggage claim so it makes the task of getting to the center for picking up your car at least a little more painless.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2015-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "L5e5_gNEA3N-B4swnYVLLA", "review_id": "CVjkmB4ofZt512FMSJe8sQ", "text": "*very late night flight so my review maybe skewed*\nVery nice airport amongst a background of palm trees, mountains and desert. \nFriendly TSA staff...abundant at that. No line whatsoever. \nOther than that, a thumbs down for amenities. \nOur flight was 11pm red eye, hence the smooth sailing through security. \nWe got there by 9. Nothing was open except a small watering hole that was about to close. No access to food. Drinks were limited to one unfunctional vending machine. None of the stores were open to purchase supplies. \nI get the fact there aren't many flights taking off that late but at least have someplace open...sheesh.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2015-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CVznnoXRbQM1tVtzW48TXw", "review_id": "H6joGw1bug4fWK-LphhOvA", "text": "An airport is an airport but flying out of Bakersfield , Phoenix airport is main connection for us . Every time I fly I have to go to the farthest gate. Well not under my control . Over all the airport is full of restaurants so you can wait for your next connection drinking .:)", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2015-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FjzfhXqtLplBAhehhmpMiQ", "review_id": "HJuFDU1b-lCizV4JbyYsgQ", "text": "Great customer service! Totally accommodating, priced reasonably, clean shuttle, and fast service.", "business_id": "ZU69ki-KEBgaK7TrbXAVtA", "stars": 5, "date": "2015-05-12", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "d5PxJcCSyaS8E2Kf6kxRSQ", "review_id": "7xtFWnd3TNOeeuuYPR-gpw", "text": "Greyhound is a company and a mindset that is in SERIOUS need of professionalism and manners. The counter staff is mostly rude and the drivers certainly need manners as well. It appears to be a THUG management style that knows that it's clients are poor and really have no other options and can treat them however they like. \n\nI use it as a last resort. If the Train were close to Phoenix I would take it anytime over the bus \nIf you lose your printout to bad so sad you have to buy a whole new ticket. Yea I would think you can trace and not get taken advantage of. \n\nIt is next to impossible to get through to corporate nor are you given an address to write or e mail your concerns. \n\nThis is a company that loud and clear do not care about the people they serve. \n\nIf I could give zero stars I would. \n\nIf there are any words stronger to describe my utmost contempt for this organization consider it said.", "business_id": "MXFcSmW3m-9IXQEA_7l62g", "stars": 1, "date": "2015-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4N-K0z6oeV6K5VUc_SeEZw", "review_id": "EzC9HMSP-RfC4thKfOcDdA", "text": "Wife and I came to PHX to go hiking and watch a Coyotes game.  Chose this place because of the low price ($75-$100 cheaper per night than the neighboring properties I looked at on Expedia).  We were pleased with our decision.\n\nThe room was very spacious...far bigger than I expected.  Comes with a kitchen as well (fridge, microwave, sink).  For the price I paid, the room exceeded expectations.  They also have free Wi-Fi, a huge plus.\n\nBreakfast (a big deal for me at any hotel) is a \"Grab-and-Go,\" which means just muffins, granola bars, and hot beverages (coffee, tea, hot chocolate).  But with the money you save, you can grab something at the Waffle House across the street and still save a lot of money over hotels with full breakfast spreads.\n\nDrawbacks:  (1) parking lot is difficult to navigate, the driving lane is narrow so large vehicles will do bad parking jobs because it's hard to negotiate the turn into the parking spot.  You may come out to your car one morning and find a large truck parked next to you at some crazy angle that makes it impossible to open your car door; (2) because of the lower price they had to cut a few corners (no regular housekeeping for short-term stays, pillows were lousy, the closet has a curtain instead of a door, don't get as many TV channels as other places).  \n\nBut honestly, none of these were a big enough issue to detract from the savings.  If I have to quote-unquote \"deal\" with having a curtain as a closet door in order to save $100 a night, I'd take it every time.  Stated differently, the good (significant cost savings) outweighs the bad (some cut corners) by a mile.\n\nAll-in-all, we were pleasantly surprised.  We would not hesitate to recommend to friends or to stay here again.", "business_id": "rI7d_L0BCKemotT9XD5wAg", "stars": 4, "date": "2015-04-05", "type": "review"}
