{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4Iny8mhAcmBzHu1eux9sCw", "review_id": "A6gf7hk0V2OvRybKR2aN-g", "text": "Okay so this place was a pretty big disappointment.  The hummus was extremely watery and barely had any hummus flavor.  The pita served with it was definitely store bought.  I ordered the lamb kabobs which were greasy on the outside and had spices just slapped on them like they were going to flavor the lamb magically, but it ended up tasting like chewy, undercooked lamb with a bunch of spice on the outside.  They salad served before the meal too was awful.  It had wilted iceberg lettuce with one kalamata olive, a handful of tomatoes, barely any cucumbers and loads of a flavorless dressing.  \n\nBasically just don't go here.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2010-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IDe2dpDpHKmaMNoJRgwD1A", "review_id": "x-IsALsMU9W4R5RCXH19_A", "text": "I really might go up to 4 stars.  I've been coming here for probably more than 15 years, even when it was called Susies.  Christo was the chef even then. don't come here if you mainly frequent chain or upscale restaurants, but do come if you like tradtional Greek food. Some complain about slow service but I think it's just cultural--we tend to be too much in a hurry.  But if you're heading to an event, give yourself two hours.  The food is good, best avogolemono (lemon chicken) soup ever!", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2012-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ZB22j38ot9JtulcJ_tTfLQ", "review_id": "EppKFEL4adYi5QZEL8dvbQ", "text": "I found this jewel of a restaurant while I was staying in Pittsburgh for a month. I was stressed out trying to find healthy vegetarian food in a full on Meat n Potatoes city when finally I came across Christos! WOW! I fell in love with the service & food so much I was coming everyday until I left back to Hollywood, CA. In fact I haven't found such a great traditional Greek restaurant here in LA that can compare to Christos. Everything I had was superb especially the lentil soup, so amazing! For dessert you must try the \"Jackie O\"... so good. \n\nI am shocked to find such an amazing restaurant in a town like Pittsbrugh and even more shocked to read a few of the *less than 5 star reviews* of Christos here on Yelp. I believe a restaurant like this is far above & beyond Pitts peeps.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 5, "date": "2012-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zk0SnIEa8ju2iK0mW8ccRQ", "review_id": "50UjWgtvkpMV41Ytiackyw", "text": "This is the first time in a long while (10 yrs?) and now I remember why. The food is fair at best for the main meal. The salad is good but small. The hummus is a little bland. The best parts were the \"homemade\" wine, both white and red, kinda like adult kool-aid  and the Jackie O cake was great. My issue was the price, $59. for dinner for 2. For this price, I would have expected more.I can't believe the 4 and 5 star reviews that I have read on this site. It's hard to believe that this place rates so many opposing reviews. I will never go back here again.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 2, "date": "2013-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QfnZwcIxLacSJwkiSPd_Yw", "review_id": "TpdrYzpk_S89xZXCeEEC9w", "text": "Excellent everything! Classic family-run Greek restaurant. Home made everything, including great family-made Greek wine. Inexpensive and authentic. Christos, the owner is hospitable and welcoming. I come from NYC, and I say this is right on par with the Greek food back home.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 5, "date": "2013-04-26", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 2}, "user_id": "nYKao-8w_IOj4Mv8QWb2vg", "review_id": "wMTuSgCTFNV-4qcEX4j06g", "text": "Ok, Yelpers, I've been relying on you for a couple of years, but...  \n\nHad a lovely meal at Christo's last night.  Someone I work with frequents and recommended.  Then I turned to the Yelp community for confirmation and was torn because of the number of seemingly dissatisfied reviews.  I decided to risk one meal (after all, how much of a risk is THAT, really??) and follow the co-worker's referral.\n\nWe started with the house-made wine.  Red for Friend and sweet white for me.  Served in a juice glass and yummy enough for both of us to order another.\nHummus.  Not bland at all.  Freshly made and pleasingly lemony.  Pita was soft and fresh, as well.\n\nGreek salad.  Iceberg / Romaine mix with olives, green onions, and bit of marinated sweet red pepper.  Anchovies if you want 'em - and I always do!  Nice sized and great tasting. I cannot comment on the dressing as I abstained (anchovies do the trick for me).\n\nThe meatball dish was had by Friend and the lamb kabob for me.  Both dishes came with rice and stewed veggies.  We cleaned our plates and thoroughly enjoyed our meals.\n\nThe seating area is old.  The décor is old.  The pictures on the wall are authentic and include images of the owner as a child and through his life.  This is not a typical city restaurant and is certainly not competing with Alihan's, next door, or any of the other white linen establishments.  There is no input from 'corporate' and I counted four men working, total.\n\nThis is a come-as-you-are-and-I'll-sell-you-good-food kinda spot.  And that's what we did.  And that's what they did.  Sometimes it's just that simple.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 4, "date": "2014-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lPMqq1p80J4HFs5vH2TAbA", "review_id": "QZx4F-5qYholE3-10pj_vw", "text": "I have been to Christos twice. Both times have been very enjoyable. The food is authentic. Lamb combo platter is delicious. The wait staff was very helpful with choices. Homemade wine. All these things made me wish I was back in Greece. The atmosphere reminded me of the Tavernas in Greece.  Again the Lamb had a delicious flavor! Don't expect  intimate or romantic.  There is nice Greek music playing and Good food - what more do you need?", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 4, "date": "2014-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3kDlkdv22jeRS3vPRuQZ5Q", "review_id": "kQ6FHxig9ZQTPEipSt_Hfg", "text": "So....I read the reviews on Yelp & Urban Spoon.\nMostly negative, but hey I was hungry and gave it a shot.\nIt's true the place is dingy & like entering a Greek grandfather's home. \nI was first asked  if I wanted huumus. I declined that after reading is was mediocre at best. So I tried the $5.25 saganaki. It came out in an old brown dish with what looked like rubber floating in lemon juice and oil. * The owner failed to mention the pita bread was extra.\nIt tasted WORSE than it looked (if that was possible). Tough cheese mostly tasteless and chewy. * I have had many saganaki in various countries. This ranked as one of the VERY worst! I made the best decision to leave before food poisoning set in. Bottom line:  HORRIFIC !!!", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2014-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gtJJBaQwTwE45NnNF0coVA", "review_id": "IM7Zd30AzZRg8s69rAp8eQ", "text": "This is a lovely Greek restaurant  that my husband and I just happened upon while walking downtown looking for a suitable venue to dine and drink, being tourists still and not yet quite moved to the area.  \n\nWe had already been in one restaurant in which the wine prices were through the roof and had looked over several other menus tacked on the outside of some other restaurants.  Then, lo, and behold, Monica, I'm assuming one of the restaurant owners, walked up to us on the sidewalk menu in hand convincing us to come try her restaurant just a few strides away. And convincing she was.  \"Why not?\" we both thought.  She did such a good job giving us a sales pitch, we thought her restaurant deserved a chance tonight.  \n\nWe were ushered inside the small venue to a table very near another couple just finishing dessert and asked about their experience.  The fact that they were happy being there and the fact that there were other patrons was a positive start.  I was so afraid we were going to be ushered into an empty place begging for business but, not so.  There was a steady stream of clientele, most due to Monica's steady persuasion, I'm sure.  \n\nWe started with hummus and pita and a glass each of Greek white and red wine.  Then we ordered lamb and chicken kabob combo and some other greek dishes which came with a decent salad and a side.  Finally, we had to order dessert, knowing full well it would be home made.  The guests nearest us had ordered the Jackie O (as in Onasis) cake and another pastry, which is what Monica recommended to us so that's what we ordered.  It was all pretty good, not stellar, but pretty darned good.  I've definitely had more flavorful kabobs but I did appreciate the family home cooking aspect.   The wine was ok but would rather have ordered off a wine list.  The salad was a nice size and was good.  The Jackie O cake was light and moist -- a hit.  \n\nOne point to know that has been mentioned in other reviews:  the main meal looks to be inexpensive but it will add up quickly.  Everytime Monica looks at you with smiling eyes and asks if you'd like some wine, then ask if you want another glass, or do you want some hummus, and finally if you'd like dessert, you really want to say \"yes\" as if you're at your favorite aunt's house.  But, of course, each of these items comes with a price which you're glad to pay at the end of the meal because of your gracious host's manners and offerings.\n\nI swear that Monica has the best work ethic I've seen in a long time.  From the moment she saw us on the sidewalk, she was in motion from ushering us in, to seating us, to taking our order, to presenting our order, to refilling our water, to cleaning tables next to us, to flagging down more clientele, to making sure we and other clients were satisfied with their meals, to taking our payment.  \n\nOne small humorous note as other reviewers have pointed out:  Ask for directions to the restroom and you'll be ushered through the kitchen, saying hello to the dishwasher and the cook, down the stairs.  I've never experienced that before (probably for good reasons).  But, it was humorous.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2014-04-03", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "KC7FguU9mIlC9xpIMAbs2Q", "review_id": "SvA7cGNwtUsuKMFI_-HN8g", "text": "Magic happens at this restaurant. Beautiful family, beautiful service, wonderful food (and wine).\n\nWe love you Monica!!!!\nLove always, your friends in CA", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 5, "date": "2014-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "7rkjF6r76ZtK2FBUqXXKlQ", "review_id": "_cUCK5Qra7c2lugi_wqpug", "text": "So our intentions were to eat at the Indian place across the street however a lady ran across the street and started rattling off the menu as we were walking. At first I liked her moxy, but soon realized that if this is how they need to bring in customers we may be in trouble. Another mistake was sitting outside when they are trying to bring people in. Our dinner conversation was constantly interrupted by the servers yelling across the street and on the side walk at potential customers. \n\nNow on to the food:\n\nI ordered the chicken kabob. Very bland and it actually tasted baked not grilled. I didn't finish it.  The rice was good and the side veggies weren't bad. The spinach pie was ok. \n\nThey will ask \"would you like hummus to snack on before your meal\". This is not free or included. I figured this so I wasn't caught off guard. Some people I could see will be surprised at the end when they get the bill. \n\nMy wife got the lamb kabob. Bland again and very chewy. It didn't taste fresh, almost frozen at one point and microwaved. The cheese pie was pretty bad.\n\nHummus was ok. \n\n2 stars for the food\n3 stars for service\n1 star for the experience with yelling and fishing for customers. Seems like they may be in trouble financially and could be cutting corners to stay afloat. \n\nI will not go again. Alihan's next door is amazing, I recommend them over Christo's every day.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 2, "date": "2014-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GdRWLM_aey6qSwu5kyqijQ", "review_id": "eH_w0rseBY3KRow_zz-pdg", "text": "Every time I going to Pittsburgh, whether it's for show or sporting event, stop a Christos for dinner. It's a small family-owned restaurant all the food is homemade and everything I've tried has been delicious. They also have a dessert called the Jackie O cake which is simply fantastic. I would highly recommend this restaurant box if you like Mediterranean food. The staff is friendly warm inviting as well.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 5, "date": "2014-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hk5-Shrb63DFCSbpxzUFJw", "review_id": "k4T-TXrRDMHlDr_YAZp4Aw", "text": "The food from Christos was solid.  I would order from them again, although the hummus was a rather small portion for $4.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2015-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Eo9Rouncjh7jCWfrdeubKQ", "review_id": "KLNis1jIsgMll0m9CueOTQ", "text": "I'm definitely a fan, if not for the food for the authentic atmosphere! In my opinion it's hard to mess up Mediterranean food, and Christos doesn't. But I really like this place for the authenticity, intimate dining area, and perfectly awkward and warm interactions with the waiters and owner. If you're looking for classic, no frills Mediterranean food, this is the place!", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 4, "date": "2015-03-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "MbEuHx-tEC9YEFY9z9yPKw", "review_id": "qJCjJxfJlKV55mxgOYC0Rw", "text": "Christo is the chef, host, waiter...the food is traditional Greek, and good every time.  The soups are good, homemade, stick to your ribs.  Hummus is garlicky and of the thinner variety - served with warm toasty pita.  We all got soup and Greek salads last couple of times we went, then cake for dessert.  Really good.  Also, try the homemade red wine - it's fabulous!", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 4, "date": "2015-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gtJJBaQwTwE45NnNF0coVA", "review_id": "H2Dt91I2MeguKagG7jPHTA", "text": "After a show at the Heinz Hall, decided to stop here, a short walk and beside the garage we parked in.  Chose this place on purpose as it is basically the first restaurant my husband and I dined in when being put up in a hotel downtown by my company on an apartment hunting weekend.  Now that we know our way around a bit more, decided to revisit.\n\nThis time, no one greeted us upon entering.  There was one other table of diners.  There was a gentleman in the back at the cash register along with a girl and a boy who barely looked old enough to work here.  They might have been family members but I don't know.  No one seemed interested in greeting us at the front of the restaurant so my husband walks back to ask if they are open.  They are.  Finally, the young male leads us to our table with menus.  \n\nWe decide on the baklava sundaes.  They were reasonably priced -- 3.00 each -- and decently flavored.\n\nI just want to say the experience was quite a bit different than the first visit.  The first visit had us excited to try the restaurant, as the woman who worked there (I'm assuming one of the owners) was eager to pull us in from the sidewalk and entice us with her menu offerings.  This time no one was excited to have us as diners and they seemed to wish we weren't there.  Quite a difference in personalities and style.  They need the enthusiasm of the woman we had met before because there certainly were other Greek restaurants nearby with more patrons partaking of their fare.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2015-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XIvUGeLIo_6qRDafLnMalg", "review_id": "TaEi4ym-FqP9oRzMB_fuBg", "text": "This is my first time in Pittsburg. I asked the concierge for a recommendation for something casual that I could walk alone to at dusk safely and that wasn't a sandwich.  He recommended Christos.  I asked if they had falafel as this is one of my favorites since visiting Israel last year. He assured me they had great falafel. So I set off on a walk. When I arrived I noticed there was no falafel on the menu. But another of my favorites was - pastitsio. I took it to go along with the Jackie Onassis cake. The pastitsio isn't the best one I have had but it was good. It came with salad, rice, and Greek style green beans.  The Jackie Onassis cake was very light and not sweet at all. The cinnamon sprinkled on top was great.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2015-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "83hWgDuAy0yASTdAFLKYyg", "review_id": "j-pJAhfL7KFfVqwjhykQQw", "text": "Christos is a traditional Greek family-run restaurant.  As a Greek-American visiting Pittsburgh, I decided to stop in with my girlfriend before the Pirates game.   We shared some tzatziki with pitas and then ordered lamb kebabs (me) and leg of lamb (girlfriend).  Did I mention we love lamb?  Anyways, given that we basically ordered what I cook at home, the stakes were high, but Christos delivered! Our food was delicious, service attentive, and the whole thing was pretty speedy- we made it to our seats at PNC before the first pitch! This is a casual restaurant, good value, with a charming family feel.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 5, "date": "2015-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "5z6ZXMg3-XO3UmSxpZWBUA", "review_id": "hQkc88vGEMlnipDdpkKKpw", "text": "As I was passing by this place the owner (I think it was the owner) got my attention and persuaded me to look at the menu. Seeing that he was anxious for business I obliged and took a seat outside. I had the Taramasalata, which I believe was the mashed caviar, which was pretty good but didn't seem much different from Hummus. For my entree I ordered the Roasted Leg of Lamb, which came with a salad, rice pilaf and veggies. The lamb was okay nothing great and the rice I felt was a tad mushy and seemed like either too much water was added or it didn't all evaporate or absorb. The  salad, which I had with anchovies was very good as were the mixed veggies, which seemed to have an authentic flare to it. I also ordered dessert, which was a slice of cake with whipped cream and drizzlings of cinnamon, which was good but nothing special. The service was good as the owner was attentive to my needs. While I ate outside, I did go inside to pay and noted the Greek decor which was appealing.\n\nAll in all, I can tell the owner cares and made a reasonable effort to accommodate me. That said I think this is a nice establishment in an excellent location, but the food needs a step up. It wasn't bad, but there is room for improvement. Here is what I recommend: rice needs to be better prepared and perhaps have some nuts, raisins or garnish added to it, the lamb could be thicker, have the fat and/or tough parts removed and also have a stronger marinade or come with a gravy or sauce for more flavor, and maybe the mashed caviar could be mixed in with some unmashed caviar, which would give it much more flare and appeal.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2015-05-25", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "jBgZ9v4pJ2LjTY0xVxGQtA", "review_id": "qraQJtJ4Y82kNfLiaqkJgQ", "text": "Lunch was outstanding! Double down with hummus and tabulee.\nWill be back for dinner soon!!", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 4, "date": "2013-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5wTVzr3SyZzpiu-U_Yim6A", "review_id": "llhN3tUk0ig468d0y64qhw", "text": "While I can't yelp but think that the music, decoration, and overall ambiance of Amel's is pure tacky cheese, their food continues to deliver anyways. The one way parking lot both in the front and rear of the building starts the meal with more frustration than delight.  The outside condition of the restaurant and other buildings surrounding it also don't bode well.\n\nThe first \"seat yourself\" table we sat at was bussed, and reset for dinner, it was also dirty.  They didn't replace the white paper, and there was some type of food smeared on the corner. We moved.\n\nThe service was generally good but the upsell was present in every breathe. It gets old because you are already plunking down a wad of hard earned cash.  The suggestions were good ones.\n\nThe hummus sampler was very good with the grilled lamb/pomegranate being very tasty!\n \nThe Amel's salad of greens with lemon/mint dressing was good.  The upsell of feta was a good idea.  Why they don't just include it and increase the price for the salad, I'm not sure.  It would have lacked something without the feta.  There's a freshness of herbs in the salad -- it was a great start.\n\nI had the mixed grille kabob --- (2) pieces lamb, (1) filet, (1) chicken (1) shrimp, (2) tomatoes, (1) piece of onion.  While admittedly I am a big guy, I could have eaten two of these.  The amount of food was too little given the price tag.  I can get a full 1/2 pound filet kabob at Giant Eagle for about $5. Or mixed Filet/Chicken for $5. Compare this to the $21.00 charged for essentially the same thing.  It was flavorful, but just questionable value.\n\nI think that if they threw on another shrimp to keep the other one company, and perhaps another piece of chicken, and charged $25 I would have been happier.\n\nMy wife's pasta athena with chicken was very good as well.\n\nWhile the service is a bit cheeky for me, and the ambiance definitely shaky, the food overcomes the majority of my concerns.  The value is semi-questionable.  They definitely deliver on flavor, and I'm rounding up to 4 for Amel's.", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 4, "date": "2013-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Qn0Zr2mwYpVu0wXcJmvZmg", "review_id": "RQJ5TiiAwwQZcWL8fxIm4A", "text": "I love this place!!!! Never had a bad meal. I always get some sort of kabob and its delicious. I also love the decor and vibe of the place. I make everyone take me there on my birthday and I take my mom every Mother's Day. Never a disappointment.", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 5, "date": "2013-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NkVT_LGJJ7zc4soQ2FrayQ", "review_id": "CQQ-PXa-shIERDV42NfjYw", "text": "I'll second the other reviewer that said for the price charged, the amount of food you receive doesn't measure up. Furthermore, Pittsburgh still has yet to have any quality schawarma. \n\nI ordered both the beef and chicken schawarma to sample. \n\nThe beef:\n\n- clearly frozen boxed 'steak-ums' as opposed to freshly shaved off a doner.\n- a measly 2 slices at that, I basically had a wrap of lettuce and tomato w/ a hint of beef\n\nThe chicken:\n\n- clearly a once frozen and somewhat freezer burnt sliced chicken breast again as opposed to being freshly sliced off a doner and a mix of white and dark meat. this leaves the meat dry and tasteless. \n- maybe a half of a chicken breast if I was lucky\n\nNo toum or similar sauce served at all with either dish?!?! That's hitting a whole new low for fake schawarma. \n\nHostess was great, service was adequate. I have no motivation to return. \n\nHopefully one day Pittsburgh will have good choices when it comes to Greek and Med. food. Today is not that day.", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 2, "date": "2013-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "CE9tKnPHc5S2W5CGDmuK3w", "review_id": "xjjq1-Uey4O9R6Sq8cV9Qg", "text": "GREAT FOOD & Atmosphere, a total 5 star joint.   All the owners, especially Mike are great.  Its a popular place, so try to go there when its not busy hours and you'll love it too!", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 5, "date": "2014-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1VAruBWjRq3fB-QXoMmdtg", "review_id": "YuLUK6h1NkaxuwYsZxnpDA", "text": "Local local local - working class excellence. People who value a good meal at a good price amongst friendly folk should make this a must-do. The interior is homey old-school but clean. The waitstaff knows - by name - many patrons. The owner is super nice and friendly and very hands-on. An addition into an adjacent space is in the works.One problem that cost a full star off the rating - only two beer selections on tap - think river water product. Other selections available in bottles, but let's face it - a great fish sandwich becomes a good fish sandwich if the brew with which to wash it down is not gratifying. Perhaps a request for EastEnd Brewing is warranted?", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 3, "date": "2014-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nLzHlbyDu5Tavn8IcRYTIw", "review_id": "6uryt593q6uguA52NZYdzQ", "text": "After driving by Amel's several times and laughing at the pink genie street sign, the boyfriend and I decided to give it a shot around 7 PM on a Friday night.  Best. Decision. Ever! \n\nI drove and was happy to see a  parking lot in the back.  Restaurant was dark and decor was unique with painted murals on the wall. \n\nWe were told the wait would be about 20 minutes, so we stopped by the bar.  Moments after receiving my wine, we were seated.  A 20 minute wait wasn't bad, but a 5 minute wait was even better!  \n\nFood was incredible.  Fresh, homemade, local, very filling!\n\nAppetizer: Stuffed peppers.  3 decent-sized peppers & complimentary freshly baked pita bread.  \n\nEntree: Chicken something-or-other (I can't find name on the online menu).  Bone-in chicken thigh from a local farm; rice pilaf; veggies.  \n\nService: Decent - the only reason I decided on 4 stars, instead of 5. Waitress was friendly, but not terribly attentive (perhaps because they were busy?).  She stopped by to take order, deliver appetizer & food, and to deliver check, and I found myself beverageless a couple times.  \n\nOverall, delicious food and a nice experience.", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 4, "date": "2014-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "R4crU2OjJ7-qAymiHO2Ucw", "review_id": "3ZWT282QKbqeKaippMCxGQ", "text": "I couldn't have been happier with how my evening turned out. My husband and I came here for our 2nd anniversary. We hadn't been to Amel's since our first date so it was a properly romantic choice. \n\nIt was a Monday night and not very busy, so it was seat yourself anywhere. I chose the booth in the corner because my favorite Klimt painting was hanging right there. Some people have called Amel's decor cheesy, but I wholeheartedly disagree. It's a bit eclectic, but not cheesy. I actually think it's beautiful, but I'm one of those people that like having a lot to look at. \n\nYou get hot and fresh pita, dipping oil, and butter to start. It's delicious. I ate pita with absolutely everything I ordered, and it was great. They'll keep it coming if you start to run out. \n\nThe thing I remembered the most from our first date is that I got a fabulous cup of she crab soup, and my date ate most of it (but if you ask him, he'll deny it). So this time I opted for the larger bowl instead. It's a rich and creamy soup, with very large chunks of crab throughout. It was awesome. I would occasionally taste a little tiny bit of soft shell, but that just kinda reassured me that it was the real deal crabmeat. \n\nWe had grape leaves cuz my husband loves them. They are a very interesting Mediterranean delicacy. The lamb inside is tender and flavorful. But proceed with caution. If you're not careful you'll get juice all over you. I would recommend fork and knife instead of bare hands. I wish they weren't so watery, but I think it might be a necessary evil since I believe they're made by steaming or maybe boiling the lamb in the grape leaves. It's a wet, but delicious appetizer.\n\nFor dinner I decided on the Lamb Jasmine. It was so so good. Again, the lamb was cooked to perfection. It practically melted in my mouth. The rice and veggies were also great, I believe there was spinach, artichokes and tomatoes. Oh and feta cheese! But the star of the dish was the tomato rosemary lamb glace. The vegetables had been cooked in it as well as the lamb, and it was just amazing. That was the perfect sauce to tie everything together. \n\nDinner came with a choice of salad. I picked tabbulee, which I really like, but I find hard to eat sometimes because it's so herby, and I think the parsley is kinda spiky. Not a great mouth feel. Lol. But again, that's where pita came in handy. I just basically put my salad in a pita and ate it like a wrap. Unconventional maybe, but it was awesome. \n\nI had some really great wine here also, their selection was pretty good. Get a good red wine if you get lamb. I got merlot, and it was really excellent. I think I'm getting better at pairing. \n\nService was fantastic, our server was so sweet and she really stayed on top of things. She even took our picture for us at the end of the night. \n\nAmel's can be a little on the expensive side, but it's definitely got value. Not only was my food delicious, but there was a lot of it. I have leftovers! We definitely won't be waiting so long to come back to Amel's.", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 5, "date": "2015-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_d162qQNfvngpAZEHaBNZQ", "review_id": "FobiGwolSlm-lUnhqDr0mQ", "text": "Awesome, slightly fancy spot for Mediterranean food. Walked in without a reservation on a busy night and got lucky to grab a booth. Pretty good wine and beer selection. Split the Mediterranean platter and some salads. Everything was delicious.\n\nA little pricey, but well worth it!", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 4, "date": "2015-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KSS6v5fcZNoelu4eEZCFcw", "review_id": "kUt1ZH0UNXeNAmck-eP9dA", "text": "Yum!!!!!!  I have to Amel's for drinks but I have never ordered food. Tonight I went in for takeout. Best decision today!  I ordered Chicken Shawarma with Tabouli on the side. I sat at the bar while I waited. The bartender was very nice. The gentleman at the bar showed me his favorites on the menu. It was welcoming that I thought I had walked into someone's home. The chicken in the shawarma was freshly grilled, the hummus was very tasty, and it was the best shawarma I've ever had. And why order fries or onion sings as your side when you can have freshly made tabouli ??  It came with a wedge of lemon to squeeze over it.  \nNow I need to back and dine in and get the true experience.", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 5, "date": "2015-04-19", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 1}, "user_id": "L7Kx-avK5iy5h1JcykL69w", "review_id": "rMfaXWSkBFOg9b0Q7eXGUQ", "text": "Great food, fantastic atmosphere and decor.  I stuck to the non meat dishes, and while there isn't a large selection vegetarian options, they'll occasionally  offer a veggie-kabob on request.  The appetizers include standard fare of cucumber salads, stuffed grape leaves, and roasted eggplant spreads (all exceptional in taste).  The badenjanin in particular is perfectly tart and spicy, but may not be for everyone.  Other than the food, their tea selections are great-- try the spiced chai.\nMy experience on weekend nights has been a full house with a mix of family groups at the tables, and college-age groups enjoying hookah in the pillow clad booths of the tea area.  Some nights feature a belly dancer and middle eastern music.  It fits in well with the decorated interior that's covered in arches an paintings (some on animal skins).  Service has been great 2/3 visits, with attentive and friendly staff open to offering suggestions, and an owner who spends time talking with the various groups.  On one very busy night, service was super slow, but the staff was still friendly and the delicious hookahs kept things calm.  Overall, this kind of place is rare in Charlotte and is worth the visit!", "business_id": "UFvogJEUiLSJwyx2LSz2uQ", "stars": 5, "date": "2010-03-28", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 1}, "user_id": "PpkKVodWC0sdn74TbHQLzA", "review_id": "Y2V8vCFi63ena06w0_vENw", "text": "Beef Kabob gets an easy FIVE Stars!!!  Persian Hot Tea, five stars!!! The Eggplant Dish was very good! The Belly Dancing gets Five stars!!!  Service also gets five stars!\n\nFrom there everything else was Good though none of it was better than three stars and not as flavorful as I hoped, still good!\n\nI'm the Only Dude here!  Eleven Female patrons including my Bride... add two Belly Dancers and our Waitress, I'm out numbered 14 to  1 !!!!!!  Great show!  If you have never seen live Belly Dancing it is Usually Entertaining and though maybe initially awkward it is fun!\n\nPersian Ice Cream nice flavor combination of Pistachio, Rose Water and Saffron less dense than Kulfi - If I had never eaten (Indian Kulfi) I would have probably rated this Ice Cream Higher!\n\nBaklava a bit disappointing, papery filo, though drier than the overly syrupy version", "business_id": "UFvogJEUiLSJwyx2LSz2uQ", "stars": 4, "date": "2013-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "g930q9ne_pPhEo4VUHfLEA", "review_id": "8BwGGjDeLrB9k5eauiPHfQ", "text": "We were the only people in the entire place. Service was okay, I'm pretty sure he was the owner. The food was decent, but the hookah was overpriced. The decor was unusual and everything could have used a good cleaning and a coat of paint. I won't be back to Kabob House.", "business_id": "UFvogJEUiLSJwyx2LSz2uQ", "stars": 2, "date": "2014-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-zM2mjLubvV5R5fu-GjGbg", "review_id": "jOao6wuZIZ8aKP7zlVpnzQ", "text": "We had an okay experience. The music was just my taste for the most part. I had a piña colada that wasn't great but it was strong. My biggest complaint is the weird seating. It felt like cement blocks they draped in carpets. It had us wondering how exactly do they keep those carpet seats clean. Not the best experience but it was cheap and open late.", "business_id": "UFvogJEUiLSJwyx2LSz2uQ", "stars": 3, "date": "2015-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_o1Oc1l5ncHlPpKu1dF3Vw", "review_id": "9x7O5u0BXDpeoYzVBfx66w", "text": "This place was garbage for hookah.  They didn't even change the water and there was ash inside the hose.  Definitely avoid like the plague if you want to keep your lungs free of fungus.", "business_id": "UFvogJEUiLSJwyx2LSz2uQ", "stars": 2, "date": "2015-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "b23kCtKv0BPJ47zu8VUQ4g", "review_id": "9fwGIyQABhRlNFv35VsUOg", "text": "I did not set out to write a bad review.  I have great respect for a small business trying to make their way in the world.  PLEASE READ THIS ENTIRE POSTING\n\nPositive:\n\nFood:  The food was on par with a decent meal at a regular restaurant.\n\nService:  Initially good\n\nNegative:\n\nPrice: Double the price of a meal of this style and type.  I did use the yelp coupon and only paid what the meal was actually worth.  It was not worth the original 18 dollars charged.\n\nCoupon:  The establishment tried to tell me that the coupon was not good but they would accept it anyways.  This is after I asked when I first got to the restaurant.  Even if the coupon was not being used any more, yelp guarantees it for 1 year.\n\nAtmosphere:  As usual this restaurant is empty, however on a Friday night we were there when they were setting up for an event on Saturday.  Evidently someone rented out the building for the next day.  They were playing really explicit rap videos on the projector while I had a 7 year old and 1 year old at the restaurant with me.  Not the Establishment per say, but the people setting up for the next day. \n\nBathrooms:  Looked like they were under construction of some sort\n\nWaitress:  Our food was served with rice and meat.  We asked if they had any sauces for the rice, the answer was no.  We asked for mayonnaise, the answer this time was that all the people that eat at this restaurant don't ask for things because there is spices (saffron) already in the rice. (as my wife always uses saffron, the amount of saffron was not worth mentioning) I would completely understand this if there were people in the restaurant  eating but it would seem that the one or two customers they get are for the Hookahs.  This means, maybe they should be open to change instead of telling me what the other people who aren't there eat.\n\nExtra charges:  The food came with bread butter and feta cheese.  They asked if we want some more bread and we said yes.  They charged us on the bill an additional 4 dollars without telling us.\n\nKids menu:  None:  They said there is so much food, that kids eat from their parents.  However, if i let my 7 year old do this, I would not have any food for myself.\n\nAir conditioning;  The air was shut off allowing the entire place to be filled with the smoke from the Hookahs.  However, when we were there no one showed up and no one was smoking a hookah until we left.\n\nNote to other people posting reviews:  Please do not post racist comments about restaurants or cultures you do not know or understand.  After seeing the other comments which seemed racist, I did give the restaurant a try.  There are many restaurants in town that serve this kind of food with better reviews, and they are no different than anyone else.\n\nNote to the owner:  If your restaurant improves these items listed, I would be happy to retract my review, but I would recommend lowering prices. People in Charlotte expect more if you are charging them that amount.  Please don't have your waitress tell me what other people eat there when you have no customers.", "business_id": "UFvogJEUiLSJwyx2LSz2uQ", "stars": 2, "date": "2015-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "obUAmg4QSBXBMwvXBcesWw", "review_id": "KmJfQhapTsOG20yO3GsYJQ", "text": "Yum. Very good chocolate glazed donut. Decent coffee, though nothing fancy and I like it much stronger. Will try their falafel soon.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2010-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Dzc2m6O4vaXCF4ztKPjTcQ", "review_id": "cuGwE87hHuQEptNx6SuqaQ", "text": "I usually go here because they have some Halal dishes but it's definitely not my \"go -to\" place for Halal.  I find that I have to be in the mood for it in order to really enjoy it.  However, my husband swears by their chicken and I do really enjoy their kefta with rice.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 2, "date": "2011-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Dzc2m6O4vaXCF4ztKPjTcQ", "review_id": "iBtJEYn2hEKPhH4Y1SPmmw", "text": "Updated review,\nI have to give them more stars. For one they have pretty tasty food once I tried more dishes.  The cucumber sauce on the side also really good.  It has also become my stop for mousaka! Mmmm", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2011-05-30", "type": "review"}
{"votes": {"funny": 3, "useful": 11, "cool": 6}, "user_id": "uILpE4ihC09BBdNf7LgDHw", "review_id": "3LzCNveFge_A3Yfos8r64w", "text": "This place is so accidental hipster, and defies categorization. Is it a diner? A bakery? An auntie's living room? Let's just say if a donut shop and a small restaurant played Tetris, this would be the result. \n\nThe eating area is quiet - no music, just the drink cooler humming - and the experience eclectic - mismatched formica tables, plastic cups for water, and tea cups with feet for the Turkish coffee. The Turkish coffee was weaker than expected, but wonderfully aromatized with cardamom. \n\nThere was so much food my eyes pin-balled for a minute. The red lentil soup made with sprouted lentils came in a bowl - a real bowl, not a cup-sized bowl. We also had the gyro plate which was satisfying, and mousaka entree which was like an eggplant, potato, and tomato casserole over yellow rice. By itself, the mousaka would last me two additional meals. We couldn't resist the Boston creme donut, which turned out to be the best I've had in Madison, and a gigantic cinnamon roll fritter. Plus the two coffees, the total came out to be $25 (!!) and some change. \n\nThe service is a relaxed pace, but the owners were charming and seemed to enjoy us enjoying their food. My five-star ratings often depend on how likely and how often I would return, and this place definitely makes the twice-a-month cut.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2013-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "llH1JSmbgk0YULWSbNQPTA", "text": "Solid donut shop.\n\n+ Nice parking lot\n+ Great selection of donuts available, even at 11:30am on a Sunday (most other places are sold out)\n+ Totally reasonable prices\n+ Donuts are good; I'd say on par with most places, but not quite as good as Greenbush\n- Presentation/cabinet could use some work - very narrow space and it's nearly impossible to see what's available", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 3, "date": "2014-03-10", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 4}, "user_id": "0zN7L4c5Z5rdpg2KYpwO-g", "review_id": "jIa77173zuL09OxV3KNJwg", "text": "Some secrets are best kept secret.  However I don't want my new donuts find going out of business anytime soon.  I stumbled across this little gem while trying to find some real donuts for my wife to take to her at work.  I found the People's Bakery.  The donuts selection was wonderful.  The wall mentioned some other baked goods as you walk in like scones, but those are no longer available.  The donuts were fantastic.  So good that I had to go back today and they are still fantastic and the shelves were socked full at 9:30am with plenty of choices and the prices are great.  \nTo be honest i had tunnel vision on the donuts but I believe they have some other things to offer for lunch and dinner.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2014-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "H_56u4SCDlguZxRnM6CwLg", "review_id": "XgKqNYDzBporO45GDl_CQQ", "text": "I love these guys - the best - BEST - donuts any where in the world, the universe.  Great gyros, falafel and Nabeel and Mary are simply wonderful", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2014-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9bjtN0O_YEFnxGmrsZG5FQ", "review_id": "eqkKbcLyvbpEYaMVTSXLTg", "text": "Best falafel in the midwest, and I've tried dozens.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2015-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CRyOc3Njbf0jtRptTs5s2w", "review_id": "G8MjyfzejY_WYJXQEaQaFg", "text": "They aren't anywhere near as good as Greenbush Bakery but there prices are good and if you're close there an alright choice.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 3, "date": "2015-03-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6mEp6ps4oQZsGLFAfN9HLQ", "review_id": "LJmZAB20o1DZ338xXADq-Q", "text": "At work, while trying to decide where to order dinner, a co-worker suggested People's Bakery.  I had the Lamb Kabobs, and they were so yummy!  The meat could have been trimmed a little better, but they were so well seasoned.  It came with lots of yellow rice, and some green pepper and onions.  It was very fast and not too expensive (around $13).  I will definitely order from here again!", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2015-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gctXeL-aGD3u-tAxhXuKJw", "review_id": "s5rTJnlqjilamapXDDewFQ", "text": "Great Mediterranean food and friendly owners. They also make delicious kosher doughnuts!", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2015-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PARV-ZGhCvTsAGGFPtnl6g", "review_id": "XWF8HWmdONS04twabIcmjw", "text": "You don't want to come here if you are looking for a fantastic dining atmosphere, but you can't beat it for great take-out.  The falafel is amazing!  Their hummus doesn't come close to competing with Banzo, but the prices are quite a bit cheaper.  You can walk out with two falafel pita sandwiches for under ten dollars.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2015-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GiCxjPrrrZ3q-M5_Y6UmVQ", "review_id": "g1w6N-8OQcKsAUYJJhX9yQ", "text": "My classmate and I went here recently because we hadn't heard anything about it and were feeling adventurous.  The food was actually pretty good and I, at least, left satisfied.  But this may have been for of the same reason I thought the 5th fast and the furious movie was pretty good   -   I wasn't expecting much.\n\nhighlights:\n-fairly cheap\n-probably not as bad as you think", "business_id": "-1oj6-fkP-iO6OyW8QBqPg", "stars": 4, "date": "2011-05-07", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "f8whKgtvAF6NOExa-D0nuQ", "review_id": "pKeTWQL-Re_NY9X7nWsqyw", "text": "The quality of the food is inconsistent. I used to love their falafel, but the last time I had it, it was so bitter it wasn't edible. The guy who works there seems very stressed and angry. He doesn't ever smile. The prices are good and when the food is good, it is decent.", "business_id": "-1oj6-fkP-iO6OyW8QBqPg", "stars": 2, "date": "2011-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MJCBX00fARCnICrNCy8I5w", "review_id": "YmSvHBPloqF8V8zoFN2Bcg", "text": "Pros:  Shawarma sandwich was decent.  Kefta Kabob meat was not bad (ordered Kefta Kabob plate).\n  \nCons: Ambiance.  Plate of the day was not that great (the day I went in at least).  Rest of food being mediocre.  \n\nPassed by this place every day, went in to check it out at the suggestion of a friend.  Though I had friends who went there often, I didn't go back, and don't really plan to.", "business_id": "-1oj6-fkP-iO6OyW8QBqPg", "stars": 2, "date": "2012-03-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kf40c9eW4LpBEzvmViefIA", "review_id": "UCj4g-M2qkfzK9r1MK57QQ", "text": "I tried the Chicken Shawrma Sandwich. it was good! But wait time is too long! :(", "business_id": "-1oj6-fkP-iO6OyW8QBqPg", "stars": 3, "date": "2014-03-10", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "f1a9KwsObpE54Yp9A1fVoA", "review_id": "38Yk0eWH8VQ-9NhLvyHMKQ", "text": "Restaurant review\nDo you remember that episode in Seinfeld at the soup restaurant. I won't refer to the name given to the owner of that restaurant but this experience is very similar. You go up to the counter to order from a surly man who is cooking and running the register. He will ignore you for a few minutes and finally come over to take your order. You sit down and after a few more minutes or more he will yell your food is ready with only the bare minimum of words. Not the best customer service, but I digress. The upside is the food is inexpensive compared to chicago. There are daily specials. I ended up with the lamb dish with rice, split pea soup, and some beans. The flavors were very authentic, not too salty or spicy. I just wish the lamb was not cooked way through. For the price you pay it is good, but the food would not be acceptable restaurant quality in a big city. All said and done, I will be back if I crave Mediterranean food.\n\nPro: inexpensive, authentic middle eastern food\n\nCons: average food quality, overcooked, poor customer service, NO free refills...\n\nHidden gem: Daily specials are a bargain, check out my picture for the menu", "business_id": "-1oj6-fkP-iO6OyW8QBqPg", "stars": 3, "date": "2014-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "N7cIbEOvl55MQ9Syz6QQvw", "review_id": "UoUzpY0VTaRzyasa75DpFQ", "text": "I'm surprised by some of the positive reviews this place has received. The food is horrible, and having lived near Jerusalem, let me tell you - the food here has nothing to do with Jerusalem. Just not worth going!", "business_id": "-1oj6-fkP-iO6OyW8QBqPg", "stars": 2, "date": "2014-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LiDYytrhel5OeAaM0pORAg", "review_id": "2xqPMpLjH3ZvFd2LtRuQmg", "text": "Very good food! The one guy that works there and takes the orders does a good job at cooking it all too. I always get the steak shawarma!\nHe closes pretty early for dinner, so be sure to not get there within the last 15 or 20 minutes because he will only let you order it to-go.", "business_id": "-1oj6-fkP-iO6OyW8QBqPg", "stars": 4, "date": "2014-05-25", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "Qxbj-OBe7Mhe0eo4FOdoeg", "review_id": "YEZ9vx7defqXwOvtLxKKiA", "text": "This is my favorite place in C-U for a quick, cheap lunch. I always get the falafel sandwich combo ($6), which isn't anything mind-blowing but also never disappoints. Atmosphere is very relaxed and the restaurant is never too crowded -- I am always comfortable here. The guy at the counter is pretty stony-faced, but he's always polite. When you order he'll give you a number that (as far as I can tell) is totally random. I wonder if there's some kind of secret pattern to them...", "business_id": "-1oj6-fkP-iO6OyW8QBqPg", "stars": 4, "date": "2014-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "a1DUUGOKHbjuoL_Z90AnuQ", "review_id": "vJfGt8z_kTjOMnQWEQLuiQ", "text": "Second night in Phoenix... Chinese did not go well the first night... Let's try something totally different... Was around the 16th Street / Bethany Home area... Didn't want to try Richardson's as it was so busy... Let's try the dark and secluded Mediterranean House!\n\nSurprise! This Greek restaurant is owned by a Korean lady named Suki! What a combo! I asked her why she didn't open a Korean restaurant because you can charge up to $16 for BulGogi or Galbi. I guess she just wanted to try something different.\n\nFor starters we tried the Combination Platter which consisted of Hummus, Babaghanoush, and Falafel Balls with Pita Bread. \n\nI warned my friend, and any person reading this review, that Greek cooking combines herbs unlike no other country in Europe. You have to like the flavor of oregano, mint, garlic, onion, dill and bay leaves, basil, thyme, and grape leaves. Feta (Goat) Cheese is used often in their salads. And their desserts are characterized by the use of nuts and honey.\n\nSuki could tell by my friend's facial expressions that Greek spices were not to his liking; she recommended the Cairo Special as an entree - Egyptian Chicken and Mediterranean Beef combination. The Egyptian Chicken was slightly overcooked, but had a sweet aftertaste which was interesting. The Mediterranean Beef was excellent.\n\nI ordered the Lamb Shish Kabob - which consisted of two big skewers filled with gigantic pieces of Lamb, Onions, Green Peppers and Tomatoes! The Lamb was the tenderest I had in years - EXCELLENT! Of course, you have to like Lamb...\n\nFor dessert my friend had the Cheesecake - unfortunately store bought. I had the Baklava, which was delicate and light, with two small cups of Turkish Coffee! The coffee was not as strong as coffee I had in Europe, but is probably the best in Phoenix. (When you drink Turkish Coffee... Stir the coffee OFTEN! Grounds from the coffee will settle to the bottom if you don't... then you'll be drinking Turkish Mud! And stir in about 2-3 teaspoons of sugar, which makes it taste GOOD! I know you're going to say \"that much sugar!\" when you see such a small cup... trust me! When I was in Europe, my friends would often take me to breakfast establishments that would serve Turkish Coffee. (Many customers would take a couple of shots of Turkish Coffee before their workday began!).\n\nAn excellent Greek restaurant... with the proviso that one has to favor Greek spices and herbs.", "business_id": "FltN1Hnw4n7BORXJH1kaeg", "stars": 4, "date": "2007-03-28", "type": "review"}
{"votes": {"funny": 2, "useful": 6, "cool": 1}, "user_id": "BkmIUgwHg_5TCkJbdMEiJQ", "review_id": "YiHRKk0ifa2IsDKOMEkJ9w", "text": "CLOSING FOR GOOD IN OCTOBER!\n\nI eat here, maybe twice a month, and have never had a bad meal.  I was shocked when Suki (sp?) told me they were closing in October, for good.  Apparently they are having problems with a difficult (to put it nicely) landlord. \n\nMake plans now to go and enjoy it while it lasts.  \n\nHeidi, have you tried the Egyptian Plate?  We usually go in and start with Hummus, Lentil Soup and then move on to the stuffed grape leaves or Egyptian Plate.  I also like the Falafal pita.", "business_id": "FltN1Hnw4n7BORXJH1kaeg", "stars": 5, "date": "2008-03-25", "type": "review"}
{"votes": {"funny": 8, "useful": 9, "cool": 12}, "user_id": "n_lAaNGeWgspbbCJc0DqRg", "review_id": "O2kTurbJqaFcV7TNO9QqGA", "text": "falafel phoenix best falafel best phoenix best falafel phoenix best phoenix falafel phoenix falafel best phoenix best falafel\n\n6 Star Falafel !    IT'S GREEN!\n\nSeriously the best in the valley, perhaps anywhere.  AND IT'S GREEN!\n\nIt really does look like some hippies may have cooked up a batch of \"Magic Falafel\" in the back of their VW camper bus in the Shakedown Street parking lot of a Dead concert.  I'm sure it's more benign spices making these garbanzo flour patties the color of money, grass, and a soccer player's ass, but they are a mos def a HOMEMADE recipe.  I'm not saying all light brown falafel is from a box, but that's what most gyro places are doing.  \n     8^ P`.',.`    ---pPbblltptllptbt\nI can do box all by myself.\n\nVarious kebobs, dolmas, greek and tabouli salads, pita sandwiches -- \nthe menu is classic greek fast food deli style, which just like the strip mall pad they occupy, the menu is a bit smaller than it used to be. \nThey've changed ownership and also pared down the size of their store significantly since their heyday.  \nYusef's was Best of Phoenix by New Times, or AZ Republic, or Get Out, etc, quite a bit circa 90, 92, 93, 95, 96, 2001 if I remember the signage.  Since then, things have gotten tough in the American economy for a niche market of Middle Eastern folks.  I sure hope they didn't suffer from former customers purposefully avoiding them after 2001 for any sort of discriminatory reasons -- what a shame that would be!\n\nPerusing the aisles of the grocery while waiting for your food to be prepared is like being flashed to an indoor version of an exotic marketplace bazaar (like in the first Indiana Jones movie, or hey, like Shakedown Street) full of strange and enticing shapes and smells and textures, foreign languages, and lots of \"What the heck is THIS!?\".  \n\nSpice grinders!  Pomegranate juice! Curry powder! Turkish coffee pots!  Anchovie fillets! Fresh Olives! Tamarind extract!\nI'm ready for the PARTY!  Where's the Houkka?  THERE IT IS! Up on the wall, several to choose from actually.\n\nMy green falafel sandwich was freshly made, hot, and delicious.\nStill the best falafel in the Phoenix area (but sadly, it was found to be \"Magic\" only in it's tasty savory goodness).   Only $5.99 with a soda, or check with the owner on bartering your knit sweater-making skills.\n\nCan anyone recommend a good Goo Ball vendor for dessert?", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 4, "date": "2010-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "chv-1CsfL8w2TESqcUeZYA", "review_id": "OtWFGaWTfG_1MxG8U71wkA", "text": "i got the chicken sheesh kabob plate......rice, chicken, and grilled veggies (2 slices of tomato, 2 slices of green pepper, half an onion), lentil soup and bread. 13.00!!! Haji-Babas gives you more for half the price. Plus Haji-Babas gives you some sauce. Come on Yusef! not worth the money", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 2, "date": "2013-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "_T4n3k4_pLDzpAepp7iomg", "review_id": "xpBpeLNopqJp12gaVr558A", "text": "Delightful.  My falafel sandwich ($4.35!) was made with care. It arrived at my table nex to the window in the clean and orderly grocery store very hot, with a generous portion of tomato, just the right amount of onion and tahini sauce that had a bit too much \"tahini-tang\" for my taste.  The falafel itself was, again, nice and hot, but lacked an crispness to its outer layer.  The flavor of the falafel lacked salt but tasted very fresh and wholesome.  \n\nOn my way out I purchased a couple cans of baba-ganouj and dolmas at reasonable prices.", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 4, "date": "2013-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z8Wi-nrG85InDbybFnjHtQ", "review_id": "KhH7wvTMPSDtRbXhyzZm8g", "text": "Just had another delicious lunch at Yusef's.  I am lucky enough to have Yusef's as a neighbor to my catering business so when I am tired of what I am cooking, I go their for lunch.  The felafel was GREAT and they always have all of the obscure items I seem to need!  Come have lunch and buy some fun stuff for your next meal at home.", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 5, "date": "2013-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "49zOPRrFCHvQOKZ0bRohew", "review_id": "_btlAdH7go0V0b5Qs_abig", "text": "I ordered take-out a day in advance for a lunch meeting at work. The man who took my order was very helpful and easy to work with, and our order was perfect and so delicious. We got beef, chicken and lamb kebabs, and Greek salad. My co-workers loved it!", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 5, "date": "2013-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vtedgK7wCKBqRyPOh6alPg", "review_id": "BAA-moDssFyaacYFiNNkaQ", "text": "The food is excellent. The prices are very reasonable. The people are pleasant. In addition to the four tables for dining in, there is a fascinating array of groceries for sale. We always end up with a few items to take home. The ambience is fine except for the constant sound of refrigerators, which sound in need of help. This is overall a gem.", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 4, "date": "2014-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "GtWCyNf0C9UfSGA7LuCzYw", "review_id": "k8WLAk2gVd3OqYVOTfIg8A", "text": "When ever I'm in Phoenix I eat at this place 3-4 times over a two week visit to the area. \nThis place is located in a quiet strip mall with plenty of parking. The market its self has a nice verity of foods and goodies with several tables in the back to sit and enjoy a good meal. \n\nToday I took my two cousins with me, we got two kibbi sandwiches, falafel sandwich and a plate of humus with pita to share. I'm 6'4 and can really eat a lot and I am always amazed at how filling their sandwiches are not to mention tasty! For 25 bucks all three of us managed to leave stuffed. They have the quality, taste and price that makes this place a frequent visit on my todo list. \n\nPs. Get a plate of cucumber and yogurt with pita, it's very refreshing; also there are these amazing chocolate and pistachio wafers called nutymax try one!", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 5, "date": "2014-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "13xj6FSvYO0rZVRv5XZp4w", "review_id": "W60p93UxyvuRDkR9A5L6OQ", "text": "Great Lentil soup! Awesome food!", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 5, "date": "2015-03-27", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "pCxaM5a3eEkfRZme28H4Xg", "review_id": "bruvqasv3xEq9Q0jsR46nQ", "text": "Falafel.  Often mispronounced, misunderstood and mocked.  Why is it so hard to find good falafel in these parts?  Who knows?  We are after all, living in a desert.  Princess Market knows how to do falafel just right.  Not too dark.  Inside still moist.  Perfect balance of seasoning.  Dollop of hummus, lettuce, tomato. And don't get me started on those special little pickles.  I didn't even know until a couple of years ago that they were supposed to even be there!  Lovely.  So run, do not walk, to Princess Market for all the middle eastern treats you crave.  Whether it's stocked on their shelves or served up in the cafe, you will not be disappointed.  And by all means, don't forget your smoked herring from good old Brooklyn, NY.  Bonus!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2010-03-21", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "-o3uGadqen-bc1HjMx_8Bw", "review_id": "5dAtHGgQsauCPqTKaheJYw", "text": "I feel that the reviews on here are overrated. \"Best falafel in town\" my *ss! \n\nFirst, let's talk food. I'm not new to Mediterranean food. However, this was my first attempt at eating falafel. Here it's horrible. Tasteless even with the sauce. Burnt on the edges. I have since had falafel elsewhere convinced it was good because I understand the Greeks and Hebrews eat it like popcorn and I have found places with great falafel, just not here as the other rave reviews would suggest. BUT they have great Adas soup. It was really spicy in a good way and nice and creamy. So I can't explain the falafel failure. Overpriced for what you get. I had to eat off my husband's plate to get full. They do bring OK pita bread out to you. \n\nAs far as atmosphere goes, it's lacking a bit. This place is (as somebody wrote) 2/3 market, 1/3 restaurant. They have a sign in the window that says \"Allah\" and \"Mohammed\", which I don't think is a good idea. There is definitely NOT outdoor seating as the stats indicate. The tables are the cheap fold-up kind and so are the chairs. The tables are chipped. The waiters serve in a timely manner but don't smile like they would at a chain. They do have a big screen TV that was playing a soccer game but at least the volume was low. \n\nI can't recommend this place for a date or for families. It's just mediocre.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 2, "date": "2012-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "T7J9ae0wTskrI_Bgwp-4cA", "review_id": "_Kgf1iQoQZZ7gV_nCGb90Q", "text": "How did I not know this place was here?  It reminded me quite a bit of Haji Baba's and I still prefer Haji Baba's.  However, the service was wonderful and the food was good.  My kids ordered a second plate of stuffed grape leaves they liked them so much!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2012-03-09", "type": "review"}
{"votes": {"funny": 8, "useful": 13, "cool": 9}, "user_id": "m7vtKWpZ9wdEQ95wJxrMrg", "review_id": "TGckiPMJmo541-lFWDhUwA", "text": "I tried the Friday buffet here with fellow yelpers Rand, Mike, and Robyn. There are just a little over a dozen items but all were really good, and the grilled chicken deserves special mention - it was fantastic, like no other grilled chicken I've tried anywhere else. The other items were mostly standard dishes found in other Mediterranean restaurants, but prepared very well here. Also, each person who partakes of the buffet is served a tender, very nicely seasoned lamb shank - that alone would already justify the price of the whole buffet!  In all it was a really delicious meal, and a really great deal at 10 bucks.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2013-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "X3W8KY0oYe3ZV78horPYTw", "review_id": "Ea5-JXpKXfgLzNOpHS8vqQ", "text": "I came here first as a business venture to repair a computer, and was invited back to try the food by the owner's brother. I am SO glad I came back. The Gyro sandwich was the best one I've ever had; it was delicious, and not greasy, nor was it dry. It was just perfect. And the hummus, which is home made, was fantastic. Beats the pants off what I got for twice the cost at Pita Jungle. The baklava? The walnut was good, but the pistachio was divine! \n\nThe prices here are amazing, and the service is excellent. Sadi, the gentleman that invited me back, is a great representation of what excellent customer service is about. He's made me feel like more than just a customer; he made me feel like family here. The store is undergoing some changes (it's been here for over 10 years!) but Sadi is marketing the business out and the food will speak for itself.\n\nThey have a Gyro Combo: Gyro, fries, and a fountain drink for $4.95. Come give it a try, get some shisha for your hookah (they're also a middle eastern grocery store), and bring a friend! It's worth it!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2013-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W_l3N7oONtPRaa0DNDJyDg", "review_id": "Or4UxbiYIPr8ZcSYzLHCOA", "text": "I'm a bit of  a Princess when it comes to food...you know...I don't do the greasy man-cave type stuff; fatty meats, etc. So, the first thing that stood out to me here was the Gyro Meat. It's lean, flavorful, and has a nice texture- unlike other places I've dined, even in Scottsdale. They're generous with the Kalamata Olives :) The grilled chicken is amazing...as well as the Shawarma, both beef and chicken. You will have to just let your taste buds experience them. Finally, the Baklava....!!!!\n\nDrumroll please!\n\nNot only do they offer this wonderful treat - but they actually have 3, yes 3 kinds of it! One is even a Lady Finger Style, they are all delish. To top it all, the service is very warm and friendly. Come check them out and bring a friend or two, amazing specials each week.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2013-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jtwyxlc2ls4jRijc0obEMg", "review_id": "fyf_RDUzlsOyQR4I8YRt0Q", "text": "We came here around 7:15p tonih we walked in and read the sign that said to seat yourself and we did. The man behind the to go order counter area clearly saw us walk in... we waited,  and waited. For about ten minutes we waited for something... anything,  we got nothing... completely ignored. We left, I wonder if the people who went in as we were leaving got the same treatment?", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 1, "date": "2013-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0Jd0QUgVTD6GEyZNX9S5SA", "review_id": "ZAGbmK09EodMJD5ajidJ8g", "text": "Everything I've eaten here has been amazing. It's the best mediterranean food I've had in the valley. Simple ingredients freshly prepared result in rich flavors. The chicken kabob is really good, especially with their garlic/potato sauce. I also ordered the vegetarian combo which is an assortment of the side dishes, nothing was disappointing. The service and prices are also hard to beat.  Dinner for two was under $25 and I left without room in my stomach for anything else.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2014-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kK4lmZBCbqrENFKCg_YpVg", "review_id": "LuTUR87b7AOm7cBQfiZs4w", "text": "Authentic family ran medi food.  This place is good and has great healthy options.  The hummus is fresh!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2014-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Fp5vbVlyNB-k-7ctBya3tg", "review_id": "3GlTKY4ZBUPDWuLlFmsPzA", "text": "Place was awesome, amazing shawarma and they had this garlic sauce that was amazing. This place is also a grocery stores, those are usually the best.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2014-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6QopeLXdfvEZ9ZzQZ1LlAg", "review_id": "Pm5ydAGqefMqtnDH0efQWw", "text": "If you like great food and great prices, you'll love this place.  It would be hard to recommend one dish because I've eaten here enough to sample just about everything on the menu and it's all good. Not sure what it is about the combination of foods, but I feel satisfied for hours after a combo plate with hummus, rice and tabouli.  Go - you won't be disappointed.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2014-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5glM3z4nT59kk5DlB3kGOw", "review_id": "XK9Wjy1J5GkVBlxT3-qlzA", "text": "Amazing! Best meats I've ever had! Definitely recommend this place, come at least 2-3 times per week.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2014-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nF32W3qu8i57a8FBUpJLdQ", "review_id": "zmd-Fw1uVxudy3KYGeTv-g", "text": "Like many people who work or live in the western part of Mesa near the 101 I have driven by this place 2-4 times a day for the past 13 years.  I don't want to add up how many times that is but 2000 might be reasonable. I have to admit that the location is a bit weird, its a strange little mall tucked away from the street.  The sign has letters I don't understand.  \n\nI went there because one of my techs was called to work on one of their refrigerated cases and told me how nice it was.   I went in there and did not tell them anything about my guys working there.  They were so incredibly nice and helpful I could not believe it.  When I told them that is was my first time there they patiently explained everything on the menu to me and even brought me samples of some items I had not had before.  \n\nThe shwarma is my favorite for the meats (both chicken and beef) but everything I have tried is fresh and flavorful.  Their kabobs use good quality meat that isn't too chewy.  I am a total hummus snob and make my own frequently.  Theirs is made fresh every day and tastes as good as my home made if not better.  In fact my wife bought some at Costco today and it was so bad in comparison that it made me remember I had to give these people a good review.   You can buy the same ingredients in the attached store and if you ask they will tell you which ones are best.   The have great pita bread in the freezer you can warm up and is better than any other pita bread around here.  Their prices in both the restaurant and deli are very reasonable for the quality of the food.\n\nAnother reviewer mentioned wiping the tables with the same rag as they wiped the tables.  I have seen multiple restaurants do this and as long as the rag has proper disinfectant I do not see anything wrong with it. In fact -- think about it -- you almost always put your hands down on a booth when  you slide in, then you eat with them!  I am GLAD they wipe down the booths with disinfectant.    I like this place because it is clean, you can see back into the kitchen and see how they keep it.  I don't think giving such a low rating for what seems to be a standard practice is very fair. \n\nYes, the different tiles in the dining room a a bit weird, but it is only like 1/4\" difference.  The location is a little different as is the layout.  In the first of this review I mentioned I had driven buy it literally thousands of times over the last 13 years. It seemed a little odd and I missed out all that time by not exploring it.  If you don't like exploring a little different cultures go to McDonald's.  These are hard working people who make the best food they know how, make it fresh and are incredibly nice.  They have some very beautiful women working there who are also very nice and helpful.  The whole place is maybe a little different than we are used to in Mesa but if you want interesting and flavorful experience stop there and give them a try.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2014-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JuhpbIxQlIZakd9-QjhmGA", "review_id": "ryDROhOjsUSF4RajvPVLpQ", "text": "Went in for the Princess Platter with my wife and very much enjoyed the meal.  Service was good, we would certainly return", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2014-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oObr-9B5khX6cW0CfC2SGQ", "review_id": "DvN1BeuMneskpNN9O7RGzw", "text": "This is one of the best Mediterranean restaurants I have eaten in.  The waiter staff was very friendly and helpful in explaining menu items and ingredients. The restaurant part is attached to a small market - everything was clean and neat.  The food was extremely fresh and made from scratch.  The seasoning on the Kabob Combo platter was delicious and the veggie combo had wonderfully fresh tasting hummus and stuffed grape leaves .  I had never eaten Baba Ghannouge before and loved the rich smoky taste of the eggplant.  The Arabic Salad and the Taboueh salad were flavorful with the wonderful lemon and olive oil dressings.  If you are a fan of the now popular kale salad, you will REALLY appreciate the Taboueh salad with its abundance of parsley.  We also enjoyed the falafel and a garlic/mashpotato dip designed for garlic lovers everywhere!  Better than Pita Jungle, by far!!!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2014-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "YLKaJCQ88tg9GcpNwBdihA", "review_id": "n2KrQY1ttuf1bZgi-QPC9Q", "text": "You're new to this populated desert, left 24 hour fitness and have a huge urge to eat Mediterranean food....Yelp to the rescue! \n\nI didn't really know what to expect from the place. It was 20 minutes before closing and the place is pretty much closing. \n\nFood: \nOrdered the Kabob combo to try a mixture of items. \nChicken kabob: Dry chicken because they use chicken breast but packed with flavor. I would suggest chicken thigh meat. \nKofta - Not the best I've had, but no complaints either. Right soft bouncy texture with enough flavor. \nSteak - The best one! Came medium rare. Soft and flavorful (same spices as the chicken kabob). \nHummus - Smooth texture. \n\nService: \nThey took my order and money with a smile. Not much service necessary at a place like this. \n\nEnvironment: \nOrder in a grocery store type counter and pay for it in an actual grocery store counter. You can eat it in the grocery store if you want....awkward Asian guy sitting in the store....no thanks. \n\nPrice: \n$11.50 for quite a bit of food. I thought it was fairly priced. \n\nFood: 4\nService: 3\nEnvironment: 3 \nPrice: 4", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2014-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "_8eGLKjVpGK_mxwM8mlOgA", "review_id": "9hxYo7qz2cJNNsmABV615Q", "text": "I went here for the first time the other day and tried the gyro plate my son ordered the beef shawarma. Everything was good and the staff was very friendly and even gave us a sample of baklava. They give you a lot of food for cheap prices. I will be back.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2014-05-28", "type": "review"}
{"votes": {"funny": 3, "useful": 6, "cool": 5}, "user_id": "6kmu0mYbdpMIOZ6Y0eVsxg", "review_id": "LcRWAMr3LAtrlYfVMd5Iiw", "text": "I ended up here after checking my Yelp app during a doctor's appointment in the area. I am SO GLAD I found it!\nI love ethnic grocery stores. I can get sucked in and explore for hours. They had a lot of Middle Eastern foods, with American items in the mix, too. \nThe staff is great! I was greeted as soon as I walked in. \nI got the beef gyro plate, which came with your choice of 3 sides. I got the hummus, baba ghanoush, and tabbouleh. They also offer fries, but why the heck would I get fries at a Mediterranean deli? Crazy talk!\nThe meat was sliced thinly, super tender, and had the right amount of grease. Hey, if you're gonna eat meat, you gotta have some grease, right? RIGHT? The sides were great, too. They were drizzled with olive oil, which always tells me I'm at a place that knows how to make the food they are advertising.\nI have the leftovers in the fridge, and can't wait to eat it! I will definitely be back. Again. And again. And again.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2014-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MOsPpkQZ9Cv5RtokaSedHg", "review_id": "sSj0Dj-l3N7HNiDsUbejNg", "text": "Great beef kabob, kibbi, beef shwarma, and chicken shwarma.  Rice had nice flavor, and Arabic salad was excellent. Will be back!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WM4XgY74iOrh39xaseLKOg", "review_id": "w7jBLfkavZ1ZVO_kaYdlLQ", "text": "Found out about Princess Deli at the Gilbert Farmers Market, so glad we did!\nI love Mediterranean food and this place was a find!! Best Falafel in the valley. \nWe ordered the Princess combo so we could get a taste of a little of everything.\nIt was so good, each piece of meat was full of flavor and very tender. The serving sizes are very generous. The waitress was having a bad day so I won't judge the service this time.  It's located in a strange place but well worth the drive. They also have a grocery attached and I was able to purchase a fresh made container of Falafel to make a home. One of my new favorites!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8kXa5D65FcUushIAeqMcgg", "review_id": "ZT7HIXcVkbzo8YSfqWdG2g", "text": "Great food and friendly service! I usually order either the chicken schwarma or the falafel. Both are excellent: very flavorful and never dry. I haven't eaten at the restaurant, I always order take out and they are incredibly quick.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LWAZxNJqQGLFEiO0ccMLgA", "review_id": "neb7uXQ2_8hrSFra4VaTzA", "text": "So after going to Flaming Kabob multiple times and having to wait 2 hours for lunch service..and trying Raina's and there food being alright...we figured a new place was in order. \n\nVery happy with what we got there.  It was a little different as it is set up as a market, however they directed us to sit at tables and eat.  Arlano was our server and he was very nice.  I got the chicken schwarma plate with hummus, rice and salad.  All was delicious.  My friend got the chicken schwarma salad and loved the way the meat was seasoned.  \n\nAltogether food and service were great and Arlano even took the time to introduce himself to us and get our names on the way out!  Very personable service. \n\nWill return and probably not hit up the other places anymore.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jSnheYWvupMVVtZG_ZcFAA", "review_id": "A_ezkupMopiVvBAhIH_l8A", "text": "Help wanted! Although they don't seem to realize it :( Here's what really matters: the food - always hot, flavorful, consistent. But the service seems to get worse and worse with every visit. We waited almost 30 minutes for our meals with no apologies or explanations; in fact, we appeared to remain invisible at our table after ordering, and again once the food finally arrived. Well ok, that's not entirely true - we were offered soda refills but never received them. This place is definitely worth the trip for good, affordable food in a casual environment, but not if you're in a hurry or are expecting anyone to seem to care about your experience until after you've already eaten. If you're looking for a job as a waiter, however, stop by an apply. Maybe then they'll get the hint!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-03-21", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "sQCrEqtcEJBUDx_1hS0YXQ", "review_id": "2Vpd2gvPzdgRdZTw8pp1xA", "text": "I literally eat here every day because I work across the street. My company is moving office buildings, and I'm mostly sad to be moving away from Princess. I call everyday and order the same damn thing, it's almost embarrassing.\n\nEveryone there is really cool, friendly, and pleasant every day.\n\nThe falafel sandwich is THE best falafel I've ever had.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "onHakaxo9xOWtzLZtif9nA", "review_id": "9ahLNgSKpWrHshq3CelNvA", "text": "Had the chicken combo plate which is chicken swarma and a chicken kabob. I usually shy away from kabobs due to the risk of dryness.  This kabob was right on the money.\nGood flavor.  Babba G was good too. \nNice people.  \nI think the buffet is popular for $11.99 and starts at noon. I will be back to try the buffet.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-04-03", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "KCQUgDM3vNuB5xn4ZXVo-A", "review_id": "DXPKJljhNieFzHDldCU8kg", "text": "There is good hummus and bad hummus. Princess has the good stuff and you're probably never going to want to eat hummus anywhere else again. Put down your containers of Sabra and make your way over to this unassuming little joint.\n\nI've ordered two things from here during lunch: the gyro plate and the chicken shawarma plate. The gyro was a little salty for my taste, but my main concern was the generous serving of hummus that came with my order. Creamy and smooth with a drizzle of olive oil and a pickle that I had some questions about until I ate it and realized it was one of the better pickles that I've had in the Phoenix metro area. The chicken shawarma was great, but again, my main concern was the hummus which was just as good as the first, second and third time that I had it. The arabic salad that comes with most plates is really great with crisp romaine, tomatoes and a flavorful dressing that doesn't drown the other components. The pita bread tastes fresh and homemade which is a plus because again, THE HUMMUS. I mean, have I told you about the hummus?\n\nI dined in once and service was fast and friendly, but since my schedule is a little bonkers right now I've been calling in my orders which are always ready in the time that they say it will be ready. The staff is super friendly and seems to know the regulars pretty well. \n\nThis is a great spot for delicious hummus and then some.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ukqP87ttafY6zJbMI7GIYw", "review_id": "bGH5ljVpBrSFfxBkd0ZREg", "text": "My girlfriend and I went here for the second time. Though neither of us often review restaurants, we both felt this place deserved a raving review. She ordered the lamb shank and I ordered the three kabob plate. Both were extraordinarily delicious. This hidden gem is certainly a favorite of ours and we will return regularly. If you have yet to visit, what are you waiting for? Get in here and give yourself the gift of delicious Mediterranean cuisine.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G-qEdwZaPewrcaLG2ygzKA", "review_id": "b6ZK0zyc590bQCP9H1TZIw", "text": "I got the chicken shawarma  plate and yup it tastes so good !!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eHx6PHP64uUoiOVUCfqA3g", "review_id": "f-uHqPGy85CgtrVucpGFhw", "text": "The best mediterranean restaurant I've ever been to! \n\nIt's been only 2 weeks since I moved from LA to Mesa and I'm very happy I found this place close to me. I've been eating there almost every day. \n\nThe food is always delicious! It tastes fresh and homemade. Aside from serving great tasting food, the people who work there are always very nice and friendly, making this place my number one choice of restaurant to go to.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8z7ZofxQ9pq_MyGj2sQxJQ", "review_id": "tq4cDLtivLJgIFpoe6vdIw", "text": "I went to the Princess Mediterranean Market & Deli tonight with my girlfriend on a whim and it turned out to be my new favorite restaurant in this area.  The food is so amazing it made me sad I'm not Palestinian so I could eat that food on the regular :) - The owner and our waitress were super friendly.  I've had kabobs and kafta before, but this was hands down the best I've ever had!  I will be eating here again and I suggest you do the same!  I'm not a big fan of hummus and I even enjoyed that!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ts_dbVK_wM8nUyv5NEiezg", "review_id": "6C5NloXDYIGdoI3eopUCkA", "text": "Another great experience at the Princess Deli. The hummus is always fresh and delicious, the beef tender and flavorful, the saffron rice is delicate and aromatic and flat bread a gem.  We even took advantage of my free baklava dessert that they sent us after our last visit. The prices are always reasonable, the waiters pleasant and the atmosphere casual.  This is one of our favorite goto's for Mediterranean cuisine.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y01CT4xfRX_8v1vJIWPT8A", "review_id": "3IYewBmKPzgeljuvOL9PCw", "text": "I have been coming to princess for about 5 years.. The food is good and fast and affordable and fills you up! I can't see myself eating here though. The setting is odd and I get a weird, \"if you aren't Arabic, go away\" vibe. I am sure this is less then intentional and there is little that can be done about that sort of thing, but i never get that feeling at Haji Baba or any other Arabic restaurant around here... I will continue to pick up from here though - make your menu more concise so you know what  I am talking about when I call in plz.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 3, "date": "2015-04-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "JGCAc1ELELm_P_-FlgX3hA", "review_id": "8YoIMFP4o4Tmx7Abr7bDqw", "text": "Don't come here with me if you're embarrassed by people stuffing their faces. Fair warning!\n\nI don't know how fast I scarfed down my grilled chicken, hummus, baba ganouj and tabbouleh, but I may have set some type of record. The chicken was so tender and juicy! And I'm kind of like the Goldilocks of hummus, (This hummus is too gritty! This hummus is too lemony!) but theirs was perfectly balanced.\n\nI loooove baklava, but theirs is lacking, so I knocked off a point for that, and because their beverage game is weak, but as long as I can get my food fix, I'll keep coming back.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ts_dbVK_wM8nUyv5NEiezg", "review_id": "aB8smErGvx_5lKqI5nDcMg", "text": "We had another amazing meal at the princess deli and tried the falafel and tahini. Can I say nom nom nom! We even picked up fresh hummus and bread for the deli to go.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-05-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wwgxhec-BRfspUGHPqxrpA", "review_id": "Gkie8YiTMCdcOer1AdUOiQ", "text": "Service poor.. Waited forgot about my drink and when asked her again she acted like I never talked to her. Rice was not good very gritty had better for sure... Meat was good... But over not good experience", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 2, "date": "2015-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "7knTjXA1lNJw7AMIIJi4YQ", "review_id": "J3DZNkKEPMIY0-pf5L2CrA", "text": "I used to be regular at this restaurant.  Over the course of time I have unfortunately seen the quality of this place slip.  I used to really enjoy this place.  The Princess Combo was good.  \n\nI went to Princess last night with my wife.  We ordered the Princess Combo.  The following are some of the observations noted:\n\n1) The cleanliness of the place has slipped.  Please clean your booths and tables (the tables and the floors).  It was nearly impossible to find a clean table.  Cleanliness is something that my wife and I do not compromise on.  We have been to the developing world, and even with that, we still find restaurants in the developing world much cleaner.  \n\n2) Some of the dishes need to be cleaned better.  I had a water glass that was stained, and asked for a new glass.  Please pay attention to this.  \n\n3) My wife found the beef or lamb kabab, in the Princess Combo (do not know which one it was) as being very chewy (inedible).  We enjoy kababs but it was just too chewy.  We could not determine if it was beef or lamb.  It was just too chewy.  Either it was overcooked, or undercooked (I am guessing overcooked...it was not red or raw).\n\nMy wife and I have experienced Middle Eastern and Mediterranean food and we love it.  We have been to that part of the world, and have many friends who are from that part of the world.  \n\nAlso, a lot of my colleagues where I work know that I tend to find restaurants that are \"diamonds in the rough\".  I used to think that Princess was one of them.  I am questioning this now.  \n\nMany of my colleagues are former military, and politics aside, they have been deployed in the Middle East, and they remember that corner cafe or related in Saudi, Kuwait, Bahrain, Qatar, Turkey, etc.  They acquired that taste while serving there.  They often ask me about places I recommend for Middle Eastern food.  I used to recommend this place.  I am questioning whether to recommend this place now.  \n\nPlease take a long and hard look at your place:\n\n1) Clean it up\n2) Figure out what has changed (for the worse), and fix it as far as food\n\nI trust that you have a good people who mean well.  Perhaps a little training may be all that is needed.  \n\nYou have a good \"product\" or \"service\", you just need to burnish your image a little bit in order to \"return\" to what I would call a 5 star rating.  \n\nI recommend you do it soon so that the reputation of the place is not tarnished.  I want this place to do well, but you need to re-double your efforts and go back to the basics.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 3, "date": "2015-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_mD8nevm8FhuX8_9FxAdwA", "review_id": "CLZA-rCyvO-DEdYq1R_3xA", "text": "Great prices and tasty food! Definitely a go-to for lunch at work. Love the grocery side too.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "U64nOYON88JeDciy006MgA", "review_id": "gTmmcstpJZiT6J21AaWawg", "text": "Best place ever. Best falafel and hummus you will ever find they are super awesome friendly and nice. Love this place my new to go spot.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YEVokKX9G9PgHJ_gK4gO_g", "review_id": "PS3f3K31bofK7uAvwyDDdw", "text": "For a special occasion, there is no better place to go than this great Lebanese restaurant. The owners are such wonderful people. They always recognize your and your family when you come in to visit - even if it's only a few times a year. There is always the lamb special - leg of lamb stuffed with a blend of rice, pine nuts, and almond slivers roasted for 5-7 hours until it's falling off the bone. The lamb is served on a bed of the rice and has SO much flavor. My father always enjoys the lamb shank - in a beautiful tomato-based sauce. The meat is always tender and scrumptious.\n\nI almost forgot to mention the soup! If you are lucky enough to get there on a night when they have the tomato soup, DO IT! The lentil is also quite tasty, however. Don't forget dessert...they make a delightful pudding with rosewater and sprinkled with crushed pistachios and drizzled with honey. Oh man...", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2010-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "Sve2h1r-jOyaoGY2GYL0WA", "review_id": "DvZfPLuygRV3wL9Y9LD78g", "text": "With several Middle Eastern friends, I get a little picky because I get homemade food. Byblos was recommended to my boyfriend and me by a gentleman in Changing Hands who overheard me saying I missed our friend's hummus (they moved back to Israel), so we decided to check it out, and we were so happy we did!\n\nThe older gentleman who served us had a lovely accent and demeanor, and he was very helpful with choosing appetizers and entrees. The decore is a little sparse I suppose, but the food makes up for it. We had the hummus and shish-kabobs that were delicious. The hummus was as close as we've found to our Israeli friend's, so needless to say that would have been enough to captivate our senses.\n\nWe will definitely be going back!", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 4, "date": "2011-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OMbENmI4l76tAqwFfu2LIg", "review_id": "SNAfzTe4qmUeU7VyLZFd0A", "text": "The tomato soup is amazing. We found this restaurant on our way to the airport and I can't wait to come back for the lamb. So good!", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2011-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "q2voHQRY7Mcuv_fIPD8cug", "review_id": "L0Xoh6PPvZA2z4WcnERBVA", "text": "Byblos is a run-of-the-mill Mediterranean restaurant in desperate need of a facelift!  With a hit-and-miss menu and tall asking prices, it's obvious that Byblos still has much to learn after nearly 28 years in business!  \n\nThe restaurant itself is well dated and the atmosphere inside generally feels like a retirement home lobby with booths for seating...booths that are very worn and borderline uncomfortable.  While the decor could use a serious smack with the pretty stick, the smaller size of the restaurant does make it fairly cozy for family dinners and small gatherings.  \n\nThe older lady and gentleman that run the place are pleasant and good natured, but can be difficult to understand.  Obviously, this has caused several of the negative reviews, but their heavy accents do add something to the experience beyond just the obvious confusion.  One thing worth noting is that they are their own waitstaff and they clearly don't move as quickly as they used to, so service can be a bit slow if there are more than 3 or 4 tables to tend to.  \n\nOn the plus side, it's easy to get prime seating on both Friday and Saturday night, because it's rarely a full house!  It's also one of the few places left in the area where you can enjoy free, live Belly Dancing during dinner on the weekends, so I give them props for supporting local talent!\n\nRegarding the food, I will say that the lamb dishes are tasty, the complimentary mint tea is exceptionally relaxing and the soups have a genuine down-home taste to them.  However, most of the main entree items are no more than food truck quality pitas and state fair combo plates sold at a premium price.  The quality of the main ingredients just isn't there and a quick trip to the frozen food aisle at Costco would net you most of the supplies needed to start your very own \"Byblos\" franchise at home!\n\nThe desserts are tasty, but few are traditional and none of them, except maybe the baklava, appear to be made by the restaurant.  Also, the bar is limited and the wine selection is nothing short of dreary, though that doesn't stop them from asking fine dining prices on grocery store brands of alcohol.\n\nWhile there's no real \"value\" in the Byblos experience, it's certainly a solid choice when you're just too tired on a Friday evening to drive somewhere else or the inlaws you hate happen to be in town and you absolutely \"must\" take them out!", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 2, "date": "2012-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7tA6O_H0uWtszsIbolpgsw", "review_id": "tFsCQnsvBfGODNQfOuG0fQ", "text": "the hummus was a little on the oily side, but everything was great! i only wish that i could have tasted the tomato cram soup everyone raves about...my boyfriend ate it!", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 3, "date": "2012-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nLtxnNKEWf20OaI7Oil3dQ", "review_id": "2gdDWhduzUZd1SPVkBbAUg", "text": "Summary for A.D.H.D readers:\n\n* Tomato soup is the best I have ever had\n* The restaurant was lonely and located in a shady area\n* The server was very kind, but a little pushy on insisting drinks and dessert\n* The gyro meat was a little too greasy for my taste, but everything else tasted fresh\n* Fast service, clean tables, and authentic Greek music playing\n* Prices range from $12+ for entrees, but they are large portions and come with soup\n\n\nFull Review:\n\nYes, the tomato soup is the best I've ever had.\n\nThe restaurant is located in a shady area, but I was not too intimidated since it was right on the side of the street and well-lit.\n\nUpon entering, I was shocked that there weren't more people eating there. In fact, we were the only ones in there. We waited around awkwardly until someone sat us and then we were greeted by a 75+ year old server, who I assume is one of the owners.\n\nWe ordered tomato soup, a gyro plate, diet pepsi, and baklavas for dessert. It didn't seem like business was going too well. The server was a little pushy on the up-sells (the drink and the dessert). \n\nThe soda was in a smaller cup than I am used to. While we waited for food, we also took sips of the water, which was pretty good. \n\nThe soup arrived in less than 3-5 minutes. I originally ordered the lentil soup, but was very happy they brought me tomato instead. I am not exaggerating when I say that this was the best tomato soup I have ever tasted in my life. Lots of flavor and smelled amazing. Anyway, about 10 minutes later, our food plates arrived and it looked delicious. \n\nThe pita bread was plenty and they were all warm. I like my pita bread warm and soft. This pita bread was on point. To be honest, the gyro meat strips were a little too greasy for my liking, but they tasted GREAT dipped into the tomato soup.\n\nThe rice was well cooked and a great compliment to the tzatziki sauce, which was tangy and refreshing. After we devoured our meal, we felt more than stuffed. But, the waiter insisted we have dessert and even coffee. We agreed on getting baklavas for dessert. We passed on the coffee.\n\nThe baklavas were $2.50 each, were smaller than usual, but were overall pretty good. I'm not too sure they were made on location though. I recommend it for those looking for an authentic Greek food experience that have the time and budget for more than a fast food Greek experience.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 4, "date": "2013-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-P9SkvexGLSavupPHMxZsA", "review_id": "lRHU7JL8fWAnJY9T8bZ5uw", "text": "This was my first visit here today and I ordered the spinach pie and small hummus. It was really good. My friend L got the gyros salad and it looked so good she said it was. My other friend T ordered the veggie lasagna and it looked so good! She ate every bite. I didn't feel the portions  were to small I thought they were perfect!", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 4, "date": "2013-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mxrrGgyT61wdsJ-TMeE_ow", "review_id": "8xyIpu7t2RdWfm1RhsH3Jg", "text": "I rated this low because of the bad service, the food is good, I would recommend take-out instead of dinning in.  The service is bad because they keep saying they will be with you in a minute and it can keep getting repeated for 10 minutes or longer.  The service is the worst I have seen even with other smaller restaurants like this one, and I'm not one of these people that just complain about everything.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 2, "date": "2013-05-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "itq_G2AWFTR2bsi2f0RToQ", "review_id": "MWE6q0Pd48mD6bIBN_UlBQ", "text": "I consider my self an expired in the mediterranean food and I can say for sure that this restaurant one of the best. I highly recommend the oven roasted lamb. The restaurant has very nice atmosphere and great service. Price kind of expensive though.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2014-05-01", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "LKe0OdXQv54wynXcXaoj0A", "review_id": "9Vy6ynv0jdWlY9QEvjHZJA", "text": "Came here for a birthday dinner because of the belly dancing entertainment they had.\n\nThe restaurant was empty upon arrival, but we were seated very quickly by the owner.\n\nThe owner and his wife are very friendly. He was very informative in explaining all the menu items and specials, and even recommended a Lebanese beer to try.\n\nThe appetizers came out quickly. We ordered the hummus to start which was made very well and had an addicting flavor. Their pita bread tasted a bit more authentic than most places and complimented the hummus.\n\nThe lentil soup that came with the meal was excellent, I wish it was larger because I could have eaten a huge bowl of it.\n\nSoon after the appetizers the belly dancer started, she was very friendly and was very good at the same time. Even brought up the birthday girl to the front and danced with her.\n\nOur food came out in adequate time. I ordered the combination kabob plate. All the meat was very tender and extremely juicy. The rice pilaf had amazing flavor and everyone at the table loved it.\n\nAt the end of the meal I ordered a cup of coffee which was pretty much the icing on the cake for me, and instantly made me a fan of this place.\n\nFor a place that has been here 30 years I am surprised I have never steeped foot in here before. I can guarantee I will step foot in this place again very soon.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2014-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SvmRaOgV2qlBC3sDPVOEdQ", "review_id": "Lscpn8EumsLvHUAwg8dVJQ", "text": "This was the first Mediterranean place I had in AZ. I didn't feel like making dinner that night and was craving falafel, so I looked on Yelp and found the 4 star review, one of the highest and closest to me. The pictures looked authentic and delicious. I should've stayed home and saved my money. It's a hole in the wall, which I ordinarily like and can be a good indication of authenticity. The 1 star is for an attempt at a restaurant. The atmosphere and service wasn't bad. The falafel though -- worst I've ever had. It's dried out and flavorless. I judge a Mediterranean place on how good their falafel is, and this was terrible. I hardly wanted to finish it but did because I was hungry. The server -- I think he was the owner -- recommended a red wine, and I sprang for it. It was almost skunked, so he clearly pushed it on me to get rid of it. Gross.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 1, "date": "2014-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "W7zvpUW1nGW2iQ0CszeTlQ", "review_id": "8-PEcb8pBtS8ECFmSpZfaw", "text": "I'm very sad to admit being a Tempe native and never having tried Byblos until tonight! I really can't say why because it's been there forever, our large family usually going for fast food or Mexican on the rare occasion when we ate out.\n\nWe had an AMAZING meal this evening in a very comfortable atmosphere served by lovely people that are sure you have everything you'd like without being rude or invasive to our dinner conversation.\n\nAppetizer, soup, lamb, chicken, wine, beer, dessert, & Turkish coffee to finish...we had it all and every bite, taste, drink was delicious! \n\nThis is a new favorite and I can't wait to eat here again! We eat out several times a week nowdays,  and an establishment like Byblos is ideal not only for the delicious food but for the atmosphere that allows a family to actually dine, taking our time to enjoy our meal as well as each other's company - a novel idea, I know!\n\nAnd did I say how much we enjoyed the lovely belly dancer? That was the icing on the cake for us...so fun!", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2014-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bYUnolB16G7HBFLfxAK9RA", "review_id": "ImxRIs9vYBOZ-WUpG5BbPQ", "text": "Family-owned Mediterranean restaurant.   If you're in a hurry go somewhere else.  If you want God's cuisine and want a great place to socialize, you found the place.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2015-03-15", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "o6hjcO1p6Zp439Bt1hoJiw", "review_id": "VHaPpnGjWzpeQODBXWkIpA", "text": "This place has old school decor and vibe but it's what I enjoy about it! A friend recommended it so we stopped by for lunch on a Saturday. He only eats hummus from this restaurant and I can see why, it's so creamy and delicious! I couldn't stop eating it. I ordered the Greek salad with Chicken and garlic sauce. Started off with the lentil soup that was delicious, the lentils were pureed which I liked. I don't like large pieces/chunky veggies in my soup so this worked out perfectly.\n\nThe salad was okay, they were really nice when I asked for it without tomato. My only issue was the amount of vinagrette/oil that was added. It made my lettuce soggy and was just unappetizing towards the end of my meal. I liked the chicken and charred red peppers, the garlic sauce is awesome! my husband and his buddy ordered chicken dishes and they were cooked very well with great flavors.\n\nThe owners were so nice and personable, I like that level of customer service and it really makes a difference when it comes to choosing a restaurant. Overall a great experience and I'd definitely return.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 4, "date": "2015-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L6iT6GlsU0zhvWW-kJGjIw", "review_id": "vnl3Ni9mCr9jYJkdX-7oRQ", "text": "Went with my wife.  Service was a wee bit slow, but the owner said that two of his staff had experienced a traffic accident on the way to work, so he was having to hold down the fort almost by himself with the assistance of one waitress.  Food was outstanding.  I have paid a great deal more for much worse food.  The pricing was excellent.  I would definitely recommend this restaurant to anyone wanting REAL Greek food.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2015-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8z7ZofxQ9pq_MyGj2sQxJQ", "review_id": "LUIzVAYU_g0SRYtdX_Lk3w", "text": "The food here was fantastic I had the beef stroganoff and my girlfriend had the chicken shawarma. they folks that were serving us are very attentive and friendly. What's the point of being over attentive but I take that as there friendly demeanor from where they come from.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2015-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "xsq2uST0rhcCz30k94bCaw", "review_id": "-eUPlEzhlGIBemvlkvJ02w", "text": "Came here for late dinner with my husband. Been here before. Always good. \n\nThe owner is from Lebanon and is a very friendly and nice person. \n\nI recommend to end whatever you end up eating with the honey pudding with pistachios. Literally one of the best desserts I've ever had. It's so simple, light in flavor, and delicious. You won't be disappointed.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2015-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XG0Wr8KxC5JBds70AbcYWg", "review_id": "FUn8KmSgI3vFmvK-R5aBJw", "text": "Great food", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2015-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "srMlpNPmINV47qxiYjtWEg", "review_id": "x3XCnG7f9llrZsg_GqQHOw", "text": "Omg the food is to die for. I am so happy I stumbled upon this place. This place is AMAZING", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2015-05-26", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "Ddciqj1ZklijJWnow8OPKA", "review_id": "-R2FOi5wJgHC7_HKj_RTHQ", "text": "I am so surprised by the negative reviews of this place.  My experience here was fabulous - great service, very clean place, and excellent food. When I was in Vegas in December, my dad and I saw an ad in the yellow pages in our hotel for Habib's.  Being Persian and constantly craving Persian food, I asked my dad (who is from Iran) to go with me.\n\nWe came here for lunch, and ordered entirely too much food.  We started off with must o'khiar to dip the bread in, and it was fantastic.  I ate too much bread though, which is probably why I left here feeling so painfully full.  We also each got doogh (a yogurt drink) which is carbonated - again, probably contributed to the fullness.  He got kabobs of some sort (I can't remember what kind), while I ordered koresht fesenjan (chicken in a pomegranate and walnut sauce).  It was absolutely delicious, and I was sad that I was too full to finish it.  So I got the rest of it to go and gave it to my dad, since he was flying out that day and could eat some while at the airport.  The total bill was $48, which was quite expensive for lunch for two, but like I said, we ordered way too much food, considering it was lunchtime.  But the quality of the food was fantastic, and Habib came over and talked to us quite a bit and made sure everything was to our liking.  There were quite a few people that came in who you could tell were regulars - they were greeted like they were old friends.\n\nAlso check out the market section - they have a large variety of food (some of which we have trouble finding in Florida), so we spent some money in there as well :)", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 5, "date": "2009-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RgWQGPEIktpY7B7POVpbfw", "review_id": "rpP_py4R30ur13Knz6RS0g", "text": "I have been to Habib's a couple of times and like the place.\n\nThe kebabs are up to snuff.  One basic place everyone will want to start out at when tasting Persian cuisine is the Koobideh.  If you're Persian you will know right away whether the rest of the menu items will be good and if a follow on visit is needed.  If you are American (and are meat eater like me) it's a safe dish to go with.  I can tell you the Koobideh at Habib's is very good.  The Basmati rice served at this place is also perfect.  \n\nDon't forget the Maast-o Khiar either.  It's another standard to tell you not only how they prepare the food, but also how they hold the items prepared for the day.  A good Maast-o Khiar like the one served at Habib's is always a pleasure.\n\nThe Ghormeh Sabzi served was also good.  I would have preferred some lamb in the stew as well.  But a vegetarian Ghormeh Sabzi is always delicious stew.  For you dyed in the wool American out give this dish a chance.  It may look super dark green like overcooked spinach, but the flavor is definitely tasty and nothing like spinach.   \n\nFor those reading this review I am not Persian.  But I did fall in love with the food and now cook a wide range of Persian meals often at home.  Habib is not a strictly Persian place as evidenced by having hummus on the menu.  Some of the dishes are a little Americanized to bridge the gap.  But I would say this a decent place to start your love affair with Persian cooking.\n\nThough it's not on the menu you should ask for a serving of Tadig to go along with the stews.  This portion of the basmati rice preparation is a great compliment to the stew. \n\nAs it's been mentioned Habib's interior does have a few failing points.  And the location itself can be easy to miss when tying to find it.  But remember that you came for the food and enjoy yourself.", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 4, "date": "2009-04-13", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "3cs0gqQLiA0m6TGw2kqh3A", "review_id": "CAKehZ9hGmGLrOsn79dlFQ", "text": "The food is decent enough but the service is quite bad. The owner is obviously an unhappy person that doesn't treat his employees well no matter who is around. We had a flyer that offered a free bottle of wine with two entrees. When we enquired about it the owner said we had to spend $50 each person in order to get it, amazing.", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 2, "date": "2010-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bMpF5OPrf916Y0Gu13VIMg", "review_id": "bQAtM1LIG1ApEvunf6bacg", "text": "Been eating here for 3+ yrs.  The chelow kabob is great whether you prefer Beef Koobideh, Beef Barg, or any of the chicken kabob.  The salad shirazi is also very good and the rice is something to really enjoy, specifically \"tadig\"!", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 4, "date": "2010-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3wd1J_fTWiPDQozDpqeDng", "review_id": "2m9MAMiVji9ARb8cZXHVZA", "text": "This place is spotless, the decor is just amazing. Persian Rugs, Beautiful art and marble. The food is very good. The rice and filet are amazing! The Bread is fresh baked too.", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 4, "date": "2012-03-02", "type": "review"}
{"votes": {"funny": 2, "useful": 6, "cool": 1}, "user_id": "AXKhb2HGGmSXikQsxY9x_Q", "review_id": "R9zFQdN1LinklLdBjzX0BA", "text": "I had heard some things about the owner (Habib) saying that he was a rude person etc etc. During the time I lived in Las Vegas I dined there 2 or 3 times and didn't experience anything too bad BUT during my last visit during a trip to Las Vegas I had an experience with the owner that makes me doubt that I will ever be going back again. I had always heard that the owner was rude and finally saw it with my own eyes.\n\nHabib was taking our order. My mother asked if the fish was fresh and Habib said yes. My father asked again in the most polite words and soft spoken, friendly, respectful tone of voice if the fish was fresh or fresh frozen (my dad eats a lot of fish!)? Habib SNAPPED back in a rude, confrontational and aggressive tone of voice and said \"I already answered you once! I do not need your business!\" I was frankly shocked. This was after my father had earlier paid him a compliment on his restaurant when we first got there. Frankly it ruined our mood, our meal and whole evening. My mother at this point preferred to leave but we were already there, settled in, tired from travel and we stayed and ate our food.\n\nThe persian food here is reasonably good. Nothing spectacular but not disappointing. The prices are high for what is offered though. There are other places in town with better persian food (see reviews for Royal Persis and form your own opinion) but the physical location etc is not quite as nice, although my limited interactions with the owner there have been pretty pleasant. The inside of Habib's is more upscale, say, if you wanted to bring a guest from out of town, but frankly with an owner that can pop off at any moment does it really matter? He can ruin any physical attributes the restaurant has with a few words.\n\nThe other wait staff were pretty friendly. I think they may know that the owner acts the way he does and may try to make up for it (or are just trying to avoid pissing him off themselves).", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 1, "date": "2012-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "RvjGLnPRKPi0FoPg2olj-A", "review_id": "SHY6kcVhTurZez9C_DEKmw", "text": "We had low expectations due to the reviews We read on yelp. We were really craving Persian food so we decided to give it a try. We pulled into the parking lot and entered through the market.once we made it to the restaurant I was really surprised at how nice the decor was. This was comparable to some of Las Vegas's finest dining and we are big foodie 's and been to them all. The owner kindly sat us in a booth. That even had fresh roses.  The owner gave us two menus and explained in detail what he offered. We started off with a traditional dish  tadik that was amazing. I ordered the chicken soltani which is a combo plate of bone in chicken and ground  beef style kabob called  kubideh. The food was aboslutely amazing. The owner insisted we try each dish as he waited for our approval. We also ordered the yogurt w cuccumber's to mix in with the rice and all I can say is yum! We will def be back for more Persian. As we gathered the bill the owner even brought me a fresh long stem rose to take home and offered us a tray of mints as a dessert. Not sure how these other reviews received bad service. The owner was very kind and I saw the same service offered to the other 3 tables that dined. If you are craving Persian head to Habib's! You won't be disappointed", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 5, "date": "2012-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p5jJncrhBGKKb0W0AQH7kg", "review_id": "-y_6GwFgsP5p02VXQVCAHw", "text": "Very good food but not a place to go if you are in a hurry. Habib is a very gracious host and explains the entire menu to you if you are a first timer.  It is a very nice restaurant with classy decor. Definately a good place for a fancier dinner date or somewhere to go if you plan on having a conversation with your dinner companions. All of the reccomendations by Habib were wonderful dishes.  I had the lamb and it was so moist and tender and the rice was a fantastic combination of spices and herbs like I've never had before.  The hummus was ok and the pita bread warm and fresh. If I'm in Vegas again I would definately go back.", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 4, "date": "2012-04-11", "type": "review"}
