{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "smeyvZJSSEfAOHzUiPwmWQ", "review_id": "uBhbpsnPjxT7eyyekAjWdg", "text": "I ended up shooting a work event and needed to pick up a flash. I didn't really feel like spending the money now on one and luckily Photomart rents them out! I rented a Nikon flash from them for the day and everything went well. I called before hand to make sure they had it, walked in, signed the paperwork, paid the deposit and left. \n\nFlash worked great. Nothing to complain about, make sure you have your own batteries! Performance was solid and in pretty good condition!\n\nThe staff here is very friendly and knowledgeable and they have a really good selection of camera bags. I was eying two of them before I left, definitely going to have to pick one up soon.\n\nCall ahead to make sure they have what you are looking for, highly recommended!", "business_id": "GiElN3AF8N4ZpfH6PNRjdg", "stars": 4, "date": "2013-04-12", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "L0OrG-U45IWF6EZtm2dv8A", "review_id": "whb7YbzZiPRbglTaivil-Q", "text": "People who are complaining about the slow service, you are way to American. This place is authentically French.  It is a sit and chat and enjoy the food and the company you are with.\n\nI have been going with my parents when they are in town, we found this place on Yelp.  My dad speaks French, as we are of very close French heritage.  The owner Pierre remembers us every time we are in.\n\nI order the Normandy crepe, almost every time I go! The coffee and croissants are so good! Croissants are warm and soft and so buttery, just like in France!\n\nIf you are in hurry please do not go here and then complain online. This place is so good and one of my favs in Scottsdale.", "business_id": "wftoNIA0Q8nX-Da47psBCA", "stars": 5, "date": "2013-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "28MSq7NWzcLCGYXkX2p9KQ", "review_id": "qdRvMWsrGE8lxjXYvPW_dQ", "text": "I LOVE this place! The staff is incredible and so knowledgeable -- not to mention they are actually from Italy. It's definitely a special-occasion place though -- not for the everyday unless you're made of cashola. Great atmosphere, great food. Also you can sign up for their e-mails which tell you about upcoming wine tastings, special menus, etc. Four thumbs up (two from me, two from hubby).", "business_id": "MLVKDbuI2xaOJQ4-NZj2MQ", "stars": 5, "date": "2008-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "D1Q1me4EqtcK8g1pPG_OsQ", "review_id": "XROfT--cPOOtC2eUqMY-vg", "text": "I first went to Marcellino Ristorante, on a recommendation from strangers, by playing hookie when I was a sophomore in college, not long after they'd opened. \n\nIt was an expensive lunch, since I had three courses and ordered one of their specials, but it was very good, and Sima, who runs the front of the place, was delightful. \n\nI came back a couple times and was just blown away by how good everything was. My early enthusiasm was borne out with its various New Times awards, and it has been my pleasure since then to turn many satisfied people on to what is without a doubt the best Italian restaurant in Arizona, and in my opinion one of the best overall. \n\nThe place's new location does it justice, although those of us prone to nostalgia miss the old one. I spent most of the last three years overseas, and when I was back visiting home, Marcellinos was always my top priority, and never disappointed me. \n\nEverything that they make is excellent, though I'm particularly attached and addicted to their thick, short, toothsome Pacatelli pasta with ragu di salsiccia , which is generously available at a discount for lunch. \n\n I don't know whether or not anyone can say that it is \"perfect\" pasta, but I would wager a lot that there is no pasta that is better. It is flawless. As close to the platonic ideal as we can get. \n\nThe same could probably be said of their tiramisu. \n\nUnfortunately it's not possible anymore to spend an afternoon drinking wine and espresso and smoking cigars on their patio, but that was only ever just icing on the cake.", "business_id": "MLVKDbuI2xaOJQ4-NZj2MQ", "stars": 5, "date": "2011-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DYs-7UH4lhgjvGe4d8huvA", "review_id": "cCjmsrNtFPyVOscQCFRy_A", "text": "My husband took me to Marcellino Ristorante for our wedding anniversary.  I was impressed how nice the restaurant looked, it was very pretty.  We were greeted by a pleasant hostess and seated at a nice table.  Our waitress, Vita, was perfect example of what all wait staff should model themselves after.  She was very knowledgeable about every item on the menu and was very energetic and enthusiastic.  If the owners of Marcellino read this, all I can say is, \"NEVER LET HER GO!\"  OK with that being said, we ordered the mussels appetizer and the pesto scallop appetizer.  They were good.  The mussels were on the large size and a little tough, but all and all they were good.  The scallops were luke warm in the middle, but still not too cold to eat.  I expected more out of the pesto, it was a little flat on flavor.  They also served us some nice bread with a little red dipping sauce.  It was a nice departure for balsamic and olive oil.  It went well with our wine.\nMoving on to the entrée, we ordered one of the specials to share, the Fettuccine Santa Lucia.  Fresh made pasta Infused with the ink from the cuttle fish.  It came in a spicy red sauce sautéed with mussels, clams, and calamari.  They state that it is served with  1/2 of a 1  1/2 lb. fresh Maine lobster in shell, but the waitress said they would remove it from the shell for us.  So I was on board with that!  The entrée was very good, again the mussels were on the tough side but the clams were perfect.  The lobster was sadly overcooked.  The pasta was nice.  We did enjoy that part, but I wish we would have ordered the Tortelloni that was stuffed with Filet mignon and sautéed vegetables.  I think maybe it is not a good time for mussels right now and possibly a vendor/supplier issue?  I had a bad experience with them at a different establishment last week, but that is a different review.  We were so full, we couldn't even think about dessert!  I am sure they were awesome.  We finished out our meal by sipping on limoncello.  Very nice.  This was an enjoyable experience and we will go back.  I have to try that Tortelloni!", "business_id": "MLVKDbuI2xaOJQ4-NZj2MQ", "stars": 4, "date": "2013-05-07", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "1gY1N3pkxTzh7kK4BxANyw", "review_id": "cqLNr1sHjLvhAlA97brquA", "text": "Shortly before my mom died, she told me to entrust my skin care to Monica.\n\nIt's true.  Not that it was her dying wish or anything weird like that.  Mom gave be all sorts of pearls of wisdom, and that particular one just happened to be about skin care.  That was a decade ago and I have followed mom's advice to the letter.  And you know what?  I continue to get compliments about my \"peaches and cream\" almost every week.  That's pretty awesome, especially since I'm now a middle age woman.\n\nMonica and the gals at Healthy Glow offer the most up to date skin care services such as microderm abrasion, chemical peels, light therapy, and incredibly soothing and moisturizing facials.\n\nThis place isn't one of those fancy schmancy salons.  Healthy Glow is run in a professional healthcare environment.  In fact Monica's sister Dr. Teresa Vesco shares the same office and is a successful naturopathic medicine physician.", "business_id": "g8_0z3OaKhcv4AAXDv-SqA", "stars": 5, "date": "2011-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "394ECIL6M0w8S-nJypi7Kg", "review_id": "ufqSqKPC0JYgVhP5LSntNA", "text": "The bosses purchased some Groupons for Octane Raceway and took all of the staff. What a blast! This is the most fun I've had in a long while. I highly recommended this place. Press the pedal to the metal and off you go. I can't wait to take my nephew. Don't forget to check in on foursquare for their newbie special.", "business_id": "YO_ngkGvdFKjiQmIP89YZQ", "stars": 5, "date": "2012-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I48goMz1WovnteneFSuEGw", "review_id": "udrCvy6Fh2RwIP1y8czWWQ", "text": "I've just finished 7 years of being a Mark's Cleaners customer.  I drop off usually once a week, sometimes twice.  The same two wonderful morning smiles and great service have been there the entire time, Iora and Teresa.  They are a big part of having developed my loyalty.  Orders are ready on time, one day service when necessary and I've almost never had anything that needed to be redone in all the years.  I have the sense that there is a pride in the work and it shows.  They have my vote and my appreciation.  \n\nMr. Mace as they call me,   Scottsdale", "business_id": "T9nn0mCUnsYGMqCa_KR6bQ", "stars": 5, "date": "2014-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "H-Bt-AOp1tVAVitLoAQQlA", "review_id": "1dB91UQuVB5_ojF-38gXYg", "text": "Nice place to kill some time with the kiddos.  Lots to do and see, food available throughout.", "business_id": "X3icXUyW9vS4UXY6V_MR4w", "stars": 5, "date": "2012-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2AGGIi5EiVLM1XhBXaaAVw", "review_id": "LOnWxp1SFdNuWWrSZ6p6Gg", "text": "A must see attraction if you are visiting Scottsdale with young kids in tow. Also a great place for locals to host a birthday party, picnic or let the kids run off some steam. \n\nThe main attraction is the train, free for kids three and under and two tickets (12 for $10) for everyone else. Just be prepared to scream at the top of your lungs when you go through the tunnel. Secondary attractions are the carousel, a smaller train that operates limited hours, a great playground, and assorted jails... to climb on. There is also a small museum and snack options available. \n\nOperated by the City of Scottsdale, the RR Park is really just an elaborate city park. An amazing city park! It's not a full fledged amusement park. You'll be disappointed if that's what you're expecting. Your kids will need to run around and create some fun on their own, which I suspect they happily will do if left to their own devices.", "business_id": "X3icXUyW9vS4UXY6V_MR4w", "stars": 5, "date": "2015-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "90a6z--_CUrl84aCzZyPsg", "review_id": "hYy5nZtxTqPpuMe083d6PA", "text": "I have used a credit union for years, but decided I wanted advanced online bill pay options. I chose B of A because it is close to home and I like the idea of their new keep the change program.\n\nWith \"Keep The Change\" they round every transaction to an even dollar and deposit the change in my savings, after a year they match it up to $250. The teller suggested when I pump gas I stop on .01 so I deposit almost $2 in savings every time I fill up ($1 of mine, $1 on B of A).\n\nPlus, their online bill pay allows me to send payment to anyone online (not just bill pay friendly companies) via a check that B of A mails for me (free).\n\nThis location is an old one, but very clean, and the staff are very friendly.", "business_id": "KH5R8TlcW1llOb1kko_FHw", "stars": 4, "date": "2008-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZFsI0f02g3UxScxQRmitMg", "review_id": "aJyYQuLo_AARGsVSPghupg", "text": "My minimum bar for breakfast places is the ability to turn out a competent Denver omelet, and I have been surprised in the past at the number that cannot. Almost every bagelry that serves egg dishes can't, and a surprising number of other eateries as well. Goldmans Deli is one such, but they have a reason for it -- they're kosher, at least, so I assume. But their Spanish omelet is so good, I'm willing to overlook the omission. (Just don't look for any pork products on the menu.)\n\nFriendly, attentive service and tasty (if a little oilier than I'd normally like, potatoes especially), this is a keeper.", "business_id": "TpQMR-JFE5V0UPzTjjuwFQ", "stars": 3, "date": "2014-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "VmaBnW6X6ydBkxhwmypiwA", "review_id": "N6aUcIUEiqiFH16BnkZ6sA", "text": "Got my car detailed today, not only did they do a great job, but I opened my cup holder to find a graduation gift (Tiffany's necklace) that I thought was long gone. Their good work & honesty have definitely earned my future business.", "business_id": "gnBgJD6LYsYhSneYVFDmhw", "stars": 5, "date": "2012-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iU0VOO2uwQMw5GRVdh3Rfw", "review_id": "J9b_ey76ft44PaAveqWD3A", "text": "I used to go to Leslie's pool, but their prices went up and service went down. I have been using the Pool warehouse for several years now, at first just to buy my chemicals and later for equipment and Services as well. I have a saltwater pool system and they gave me a great price on a new Cell as well as a new pool Vacuum. They guys in there are very knowledgeable and try to fix your equipment first before selling you something new. You can't really go wrong by shopping here.", "business_id": "yzglXr2AiSTAUVEiLgO0xw", "stars": 5, "date": "2015-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DwMdamgL66T3iWHnCaOpnw", "review_id": "bM7J18qli5tlVCV4HYDXdA", "text": "Great place for a romantic dinner.....  I would definitely cross state lines again just to dine at Fleming's!!!!\n\nThe service was remarkable, the steak was incredible, and the molten chocolate cake was heavenly!!!!!", "business_id": "9AbyBqGWHYZC73GlyAuTrQ", "stars": 5, "date": "2007-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1gHORk6F1yUDrAx4EozX7Q", "review_id": "M554loiJ2AC5MttEsBSJJQ", "text": "Food was good, service was great. Being able to make a reservation on Yelp = amazing.", "business_id": "9AbyBqGWHYZC73GlyAuTrQ", "stars": 5, "date": "2012-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 4}, "user_id": "-kIvLyWpY17aRa0vPp-RmA", "review_id": "fONN7DSBoTRYByO28oPrUQ", "text": "Ive been to a few Flemings in my life and added the recently remodeled Scottsdale to the list.  My wife and I came here the other day and had a wonderful dinner experience. \n\nWhen you go to Fleming's it's all about the steak. I usually stick with the fillet mignon cooked medium but decided to try the Wagyu New York strip. I learned that Wagyu is the American way of Kobe beef, so I had to try it! I was very impressed, the steak was tender and very flavorful. It's a more deeper flavor than the fillet. I think I would actually order it medium rare next time though as the closer to the center of the strip the more flavorful it became. Overall a great piece of meat.\n\nMy wife ordered the Sunday prime rib special. Talk about a deal...she got a wedge salad, thick cut of prime rib, mash potatoes to share, and a dessert! All for $40..really for the amount of food and quality you can't beat that. We ended up sharing the lava cake which was amazing...even was served with ice cream. \n\nWe also shared the chipotle Mac n cheese, so good I was in heaven! \n\nService was great usual and ambiance was very nice.", "business_id": "9AbyBqGWHYZC73GlyAuTrQ", "stars": 5, "date": "2015-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RiOXLgH3uRGoOD6MNC2k3A", "review_id": "foU7yIBsPjhncKdFbo4UlQ", "text": "I usually order from Chizona's at least once a week. Their XL pizza cut into squares is perfect when I am having people over. I love their thin crust pizza. Their staff is always friendly and are usually quick, prompt and offer an accurate time line for delivery or pickup. \n\nI'm a big fan of their pepperoni and sausage pizza.", "business_id": "n_HvrTuGUgxXJM0yq39-0g", "stars": 5, "date": "2014-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "PATykPjfDM-MbMr2OIqRrg", "review_id": "pyK8i8oybyn799gxTJoOdQ", "text": "What a great store, not only are you completely ignored from staff, but they are pretty understaffed or lazy.  Unfortunately I have been waiting in the appliance area for about half an hour to buy a washer and not one person is there to help me buy it.  They are busy helping other customers who \"want\" to buy whereas I already am ready to buy.  This is the unfortunate result of customer service from monopolistic companies.", "business_id": "xrNL6b5x1W1begCWFDduIw", "stars": 1, "date": "2014-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JPesnSIxBrhknSJDr0em6A", "review_id": "MK8lz5y2sxeyEZ1z7Uvlqw", "text": "My favorite Taco shop. I love this place! Convenient, inexpensive and deliscious. Highly recommend the Machaca Breakfast Burrito, carne asada tacos and hubby loves the ground beef tacos. If you like hot, spicy food, try the shrimp diablo! Don't forget to ask for their salsas...esp the \"brown\" (medium heat)", "business_id": "F3tqTcfKnljJcSyyqN0bbw", "stars": 4, "date": "2015-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zbof87XZcsf0y-MO96-jzQ", "review_id": "kx7Twnf7y4GgcRZxRm_BTw", "text": "I don't know how this place got a 4-star average.  We showed up later in the evening, but they were still open and seating.  Out of 4 rolls, one was good.  The other three were pretty disgusting.  They were made sloppily, everything had TONS of mayo and not enough spice.  They smash up the salmon for their spicy salmon, which leads me to believe it's not very fresh, and it makes for a very mushy texture.\n\nThe miso soup was good, at least...\n\nAnyway, they turned on the bright lights and started stacking chairs before we had finished paying.  Sorta rude.  As a server who has worked in restaurants for a long time, I think that if you take tables until 9:30, you should expect to properly wait on them until they are finished.  Otherwise close earlier and don't take the table.\n\nI'm NEVER going back here,  Ew.", "business_id": "Bjt3rB73dvSDe1XEPEWc6w", "stars": 1, "date": "2011-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-JFMcLPQxi9D-ltajgwrKA", "review_id": "g28QfCEcDVYtsHp1xRLOgQ", "text": "This has to be my favorite sushi restaurant! All sushi is very fresh and huge portions.\n\nThe one thing is does lack is great servers- they seem to always forget something . But, management does pick up the slack ! Which you can not say for a lot of places. The manager always seem to be very helpful, hopefully she can teach her staff :)\n\nGet there early, restaurant is not very big and fills up quick! \n\nHighly suggest this place to everyone I know- the quality is top notch !", "business_id": "Bjt3rB73dvSDe1XEPEWc6w", "stars": 5, "date": "2014-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TbR09xCOMS_mbBunS2dq7w", "review_id": "fbLkYpeYNHtWVGWHJapoVQ", "text": "Sakana serves great tasting, high quality sushi. They are very consistent in terms of quality & service and for that reason is in my Top 3 in the valley. We moved here from Chicago and this comes the closest to the quality and great flavor a that is grown accustomed to.", "business_id": "Bjt3rB73dvSDe1XEPEWc6w", "stars": 4, "date": "2015-05-31", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "Xm8HXE1JHqscXe5BKf0GFQ", "review_id": "9t1cEoeyLYwjTAQ-pehyzg", "text": "Potato pancakes, pastrami reuben, and chicken and waffles: Extreme carbohydrate overload. \n\nThe mini potato pancake appetizer (5) is seasoned appropriately and cooked up nice and crispy around the edges, soft and warm on the inside. Applesauce and sour cream, of course. \n\nPastrami reuben is piled high, warm and delish, sauerkraut/dressing/swiss. Came with coleslaw (a little bland) and we upgraded to sweet potato fries (again, a little bland, and looked slightly battered...?) \n\nChicken and waffles - a belgian waffle made with jalapenos and corn in the batter, then they put chicken strips on top of it, and dump a load of cheddar cheese on top of the whole pile. If you like crunchy, and I do like crunchy, the chicken strips have it - almost to the point of TOO much crunch. Wear-down-your-enamel crunch. The combination of the chicken in its seasoned batter plus cheese plus corn plus spicy jalapenos plus waffle plus syrup on top of it all makes a flavor explosion (and later, a slight headache). It was HUGE too - between two people, half of it was still left on the plate. \n\nThere is also a large, beautiful display case full of every kind of pastry you can think of. We didn't make it there. I think next time I'll start with dessert so I can cram it all in...", "business_id": "IM-9thHqQbBK5tX5MfTzBQ", "stars": 4, "date": "2010-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "N69-RgMXqRaZbIBbx2eH2w", "review_id": "owjwDdnRgZlzzVGK9v6ZWw", "text": "IMO, Chompie's gets a solid 4 for food.  I have never not had a good meal here.  Sandwiches are intense - brisket and turkey is my favorite.  Great knishes...  Overall, really decent deli and great rye bread.  :)\n\nMy complaint, and why I dropped the star, is that I have also never not been wrongly overcharged, or had them get a take-out order wrong.  This happened today, in fact, as I was in buying a lot of Mothers Day pastry.  And I was charged for items I didn't receive.  Same thing always happens with deli takeout too, though more often, they get the order wrong.  Of course, you don't realize this until you get things home, and you'd think I'd learn to double check before I leave, but the place is always a bit of a madhouse.  \n\nGood food, but if you do take out, check things before you pay.  They seem to have an issue with not getting the items and the bill to coincide.", "business_id": "IM-9thHqQbBK5tX5MfTzBQ", "stars": 3, "date": "2012-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wVKUFKhb0Nbyb8-_Ly8L_g", "review_id": "gn9HAdwAoE9udCw4wab3Ww", "text": "They put so much cream cheese on the bagel that you can barely taste the bagel. And I'm okay with that.", "business_id": "IM-9thHqQbBK5tX5MfTzBQ", "stars": 3, "date": "2014-04-30", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "rQGXCMOk2oT4gdwQ0VW2wA", "review_id": "X7cqpMw06sf2ZCxeXSjcFA", "text": "Awful. Got here around 9 on Saturday morning, two other parties were seated right after we were. We ordered a sandwich and one coffee. Until I reminded her, we didn't get cream for the coffee. All of the other parties got their food well ahead of ours. I finally asked the waitress  what was going on, she said she wondered the same thing, and another 5 minutes later she came out with the sandwich that we ordered, at least 30 minutes after we ordered it. The French fries that were supposed to come with it and the sauerkraut that we added as a side for the sandwich were missing, she said she was waiting for a fresh order of french fries and didn't want sandwich to sit in the window and get cold any longer. We said we wanted to sauerkraut FOR the sandwich, and if it was not ready we didn't want the entire meal whatsoever. We left. For $15.79, for a sandwich alone, we expected a much larger sandwich and better service than what we got. An apology would have been nice, however we didn't receive that either. No wonder this place is putting out deals to attract more people.", "business_id": "IM-9thHqQbBK5tX5MfTzBQ", "stars": 1, "date": "2015-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "2LE_1IcSFlOUUM_lDKwE4A", "review_id": "NUXAWyHlLLyO1O3blZBr_Q", "text": "3.5 stars\nService is great here! The food was okay. I was recommended to order the Seared Ahi Tuna salad and although they had removed it from the menu, they were nice enough to put it together for me and another in our party. The tuna part was ok but the lettuce had much too much dressing to eat. The mango pieces were a nice touch. We also ordered the Spinich Dip Yelpers recommended but it was nothing special.", "business_id": "jBb5KHHAj4s8hcXVS6QXDg", "stars": 3, "date": "2009-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2WnTReGJT50e_p6bTFN4Kw", "review_id": "FCEpmX2GyjT-99-YVoNP7Q", "text": "I always try to visit houstons when ever I can find one\nThey have the best chicken fingers I have ever had\nThey are not on the menu but they do have them\nThey are a must try\nYeas chicken fingers you wont be disappointed", "business_id": "jBb5KHHAj4s8hcXVS6QXDg", "stars": 5, "date": "2011-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GpAp2f53RBVDbwRvIU8NBg", "review_id": "2l-BDEnmEV1_bDy7L9uS2A", "text": "Good steak, Great Service and reasonable price!", "business_id": "jBb5KHHAj4s8hcXVS6QXDg", "stars": 4, "date": "2014-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "R7oaB9RxJDtAAUGUXhMyHg", "review_id": "W8DrBGjEzkWynvfJuudcgQ", "text": "Amazing ribs, as always. Friendly and attentive staff. Beautiful photographs by Mark Klett while entering. Great date night spot!", "business_id": "jBb5KHHAj4s8hcXVS6QXDg", "stars": 5, "date": "2015-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "zrxVB0HBJNB6fwKB62sfJQ", "review_id": "ogc3nMvMQHbtc7rZui1FdA", "text": "Ate here at randys last night & sat on the patio, it was just the right amount of food & it included a scoop of yummy ice cream, can't beat that!!! Back today to try the lunch menu, food just came out in record time, gotta go eat now!", "business_id": "68_EJEA9Ibo55EDp3d-nOg", "stars": 5, "date": "2011-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8rges6UFA7RDg0EmuQeFJg", "review_id": "097I7ZsKElAHga2oQMJXOA", "text": "Fast and friendly service. They are very affordable and the servings are large. It's family owned and operated, you can feel the difference from chain restaurants and I enjoy it. The only reason that I'm giving it 4 stars and not 5 is because of all of the times that I've ordered scrambled eggs they have only been good once. Great place for breakfast, just don't order scrambled eggs.", "business_id": "68_EJEA9Ibo55EDp3d-nOg", "stars": 4, "date": "2015-04-15", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "X814oMIgQpLvBebIJ3Woew", "review_id": "t8qe0AWkogccJU-2BeVxoA", "text": "Cut and color done by Rachael...AMAZING!  Eyebrow, lip and chin wax done by Ellen...FABULOUS!  \n\nI've been to see Ellen several times and am NEVER disappointed.  Friendly, calming and gets the job done.\n\nThe staff is friendly and the atrium is a relaxing environment to wait in.  \n\nThank you, Spa Lamar.", "business_id": "EaziHWcmjm5nGmPF-CJgQA", "stars": 5, "date": "2011-05-14", "type": "review"}
{"votes": {"funny": 23, "useful": 28, "cool": 28}, "user_id": "ODhV53XhesCBLJVfGsJGNA", "review_id": "l7O8P_iyeDfs4LdZqbcB0Q", "text": "On a weekend treat with one of my gal friends, she made us a reservation for a massage. This was apparently the spa that once herald as the Phoenix Suns Dancers spa. What an advert! Since it was a day spa, we knew we want massages, some time in the steam room, and finish with a dip in the pool. \n\nI forgot the guy's name that worked on me but he massaged my butt. Whoa. Weird. Other than that, it was a nice long hour of massaging kinks out and it was great. I was offered some much needed water, I must have been drooling, once I was properly tenderized. From there, the rest of the experience was decent.\n\nThe steam room was a sweaty time where we just sat in silence and tried not to pass out from the humidity. Us desert rats don't do well with humidity. After a short 10mins in there, we chugged more crisp fresh water, hopped out of our robes, and jumped into the pool. I must admit that it was smaller than what we imagined.  It fulfilled its purpose of cooling us off though so it was perfect. \n\nIt was a pleasurable experience overall and retail therapy at Scottsdale Fashion Square afterward made for a wonderful day! I wouldn't mind popping in again if it was closer or if I were in the area. Support your local small businesses!\n\nThank you, Yelp Instagram for motivating me to take this out of my bookmarks to finally write a review for it!", "business_id": "EaziHWcmjm5nGmPF-CJgQA", "stars": 4, "date": "2015-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "mFyhFiLNVqmeXMMNM35bHg", "review_id": "FPq_JnTpwruY9KPCRQ_6_w", "text": "From the outside this place doesn't look like much. It looks like an old Mayan temple building in need of updates.\n\nThe grounds inside are very nice and offer a lot of amenities. Our room was upstairs and faced a patch of lawn used for outdoor banquets. I thought the room was nicely appointed and peaceful. I ate breakfast out on the balcony most days. The workout room had everything I need to do my usual workouts with a few modifications.\n\nThe north pool area was nice and I enjoyed sometime lying there as well. The hotel has a ton of conference facilities but I was there for pleasure while others attended a conference at the FireSky down the road.\n\nI would stay again.", "business_id": "CD-2yHTSObgvAhW-pYHfMw", "stars": 3, "date": "2012-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FLmzo3gnCgcYL91bwJMkCA", "review_id": "CHxoQ8VsNKCgvFCvpb3lbQ", "text": "I stay here often when working in the Phoenix area. It is well place to get to most areas of the valley. It is only a few minutes from Old Town Scottsdale. The design of the structures with the landscaping makes it relaxing. The staff has always been friendly and they have some good food at the bar if you don't feel like going anywhere at night.", "business_id": "CD-2yHTSObgvAhW-pYHfMw", "stars": 4, "date": "2015-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "pnBtXFTv_dMJJtmMkLVDWA", "review_id": "Q854XW9p2QqKefhUS2YZ6A", "text": "Stayed here for business last week and my reaction is: meh.    Nothing special about this Scottsdale Road property.  It was really pretty expensive $279/night in April and you don't get a lot for your money.    Nothing \"wrong\" with the place, but you can do better for the money.   I don't know how they can call it a \"resort\" unless have a pool qualifies you - no golf/tennis, no spa, etc.  Just a hotel.", "business_id": "ZRrIwqIUMII1b2keMI8QRw", "stars": 2, "date": "2011-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kjz6rH4RPnzdK3mDmHATtw", "review_id": "xnT0I41x3T75rXhKXXHBww", "text": "The past reviews shock me. I have used this cleaner for about 15 years with no problems. Reasonably priced and friendly people.", "business_id": "B7ikBKkmmf2aTI-oFgQbMw", "stars": 5, "date": "2014-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wGWFzdgnSEe7C6UjoW8Q3g", "review_id": "5Ni7bgTs_L_h0OU3PN8ZTA", "text": "I stayed here for a couple nights attending some work meetings.  Found the property to be a bit dated but, it has nice amenities like free cocktails in the evening and free breakfast in the mornings and a very friendly and helpful staff.  The grill/sports bar on the 4th floor has surprisingly good food.  While dated, the room I stayed in was clean and comfortable and it's nice having all the rooms be big suites.  Definitely would not mind staying again although I would not pick Chaparral as a destination for a family outing or anything.", "business_id": "Xe-zwcsX5EikIK6Ul5bGlw", "stars": 4, "date": "2013-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "DFQ95g3s1oi-VcDZEO2TOA", "review_id": "Fn3aVo91jkuScu663pzwrQ", "text": "I loved this place it was so cute. We went here for brunch today and we sat out on the patio through another reviewer's suggestion. The waitress we had was wonderful and very attentive. Even though I do not have a dog I loved how it was a dog friendly patio, and they even bring water and treats for your treasured pups! The coffee was good, and I had a strawberry waffle and my husband had scrambled eggs with cheese, toast, and fried potatoes. The music was also cool as we are both fans of the 50's. I will come back here again as it was very reasonably priced.", "business_id": "kOh8ZHf8CkFQCwyfDvVJTA", "stars": 4, "date": "2010-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NN0BHECXxA3ppqEv4_HDXQ", "review_id": "Hmv_sY3deu3l3qvcKS_KoQ", "text": "My family and I have lived here for almost 3 years now, and we are staying put for a while. \n\nThe community is small, but we love that about Miramonte. Most neighbors are very friendly, and the grounds are always kept tidy. The pool area is beautiful and very relaxing, offering a fire pit and cabanas. We love swimming as often as we can! The fitness room may be small, but it gives you enough to sweat and burn. \n\nThe neighbors, most anyway, are always friendly. Parking is never a problem, in the 3 years we've been there, only twice has our parking spot been taken. When it is, we ask nicely for it to be moved and it gets moved. \n\nMaintenance is incredible, super quick and very friendly. The front office staff is also very friendly and helpful. \n\nWe have a small dog and 4 year old, and we love it here. It's the perfect little place for us, and we recommend it to anyone. We do face Hayden road, but noise isn't too bad. In the mornings, you can sometimes here the band at Saguaro high school play, and i'm sure the neighbors facing Pueblo elementary hear the giggles, screams, and running of small kiddos, but other than that we have no complaints!", "business_id": "w4O2f6LEXwWJWn4thL-87Q", "stars": 4, "date": "2014-03-17", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "rjlb-7-JcmM6fR64ZpyTug", "review_id": "4eLmzTXc85FtRZuk_2LO7w", "text": "I miss this place.  I used to frequent it for lunch when I worked in the area.\nIt gets incredibly busy, but it's worth it.  Sandwiches- yum, pasta-yum, salads-yum, cookies-yum, ice tea-yum... ok you get it.", "business_id": "v9htJ8R0Ctvykmqjz7eRlQ", "stars": 5, "date": "2008-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tdloQs4hmZUmyw5CbXhMqg", "review_id": "N5O0IJjVDm34XMd5RqiyUw", "text": "This is an awesome hidden gem! I've worked right down the street for 10 years but never knew about this place until my uncle recently told me about it. I had the philly cheese steak with peppers and sauce and it was amazing ... and huge! I could only eat half. Great prices for so much delicious food! This is a great little family owned place that has been there for 34 years!!! (They had a big sign stating they just celebrated 34 years on 4/1/11)  It is a cash only restaurant, so make sure you stop at the ATM first. The chef's daughter offered me a sample of the chicken salad her dad makes there daily. It is amazing! They sell over 100 pounds of this a week! Just a really neat place, friendly people, and amazing food! I will definitely be back!", "business_id": "kEyCMHBnohaWc81omLDfYg", "stars": 5, "date": "2011-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OWdB_HAaBKSSeYdZZO5kOA", "review_id": "qbraFT2b2ZSx80IxLn_Raw", "text": "soild sandos. just go.", "business_id": "kEyCMHBnohaWc81omLDfYg", "stars": 5, "date": "2014-03-26", "type": "review"}
{"votes": {"funny": 3, "useful": 7, "cool": 3}, "user_id": "90a6z--_CUrl84aCzZyPsg", "review_id": "bBYo0PxGnz0SvwnEiqzbhg", "text": "Debra, this is an \"Athletic Club\" not a \"world class\" convention resort. Anyway, I recently toured the facilities with the intention of joining soon - I need a place to play Tennis and work out all in one location. The gym, pools, and Tennis courts may be the best in Scottsdale (that are available to the Public). \n\nThe fee is around $100 a month, but well worth it if you know what court rentals cost - Where else can you play Tennis, swim, lift some weights, shower in private, and grab a Martini for the road??? They also have meeting rooms...", "business_id": "FGCa6lW6f03rzJz0U3QESg", "stars": 4, "date": "2009-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zhLL5bwETmLWOy6kDOL4vQ", "review_id": "pSe7eigWL_ZHm6Dr_YEQZQ", "text": "Florentine bennidict was amazing!", "business_id": "GhhpkAkGl4JE_M_Szwegeg", "stars": 4, "date": "2012-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fE5ojHhyXuRxKUJIewD6YA", "review_id": "qoHIL8tVOZYnT7K6SM_vIA", "text": "this place is great! but it is in dire need of a grocery store! the albertsons up the way sucks terribly! the staff there is the worst! I love the pavilions because its literally right on the other side of the wall from my house, it has a target! :-) Its got a great selection of stores, but definitely needs more. Lot of vacant spaces in there and OMG it SO needs a grocery store!", "business_id": "B0zWhoktQ05XWjTMICqfSw", "stars": 4, "date": "2013-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "do8TLgrNbnpZY06kPOPMxA", "review_id": "27DqlsrkQI0hSOG6QAT3zQ", "text": "We come here once a year for a family reunion tradition. The only reason young, hip people would be here is to be with family and eat a lot of food. The unlimited soft serve ice cream is the best, with the sweet potatoes, gf horchata muffins and salad bar being the best things there. My husband said he liked the mac-n-cheese there, but \"it wasn't the best thing he's ever tasted.\" The pastas were actually fresh-tasting, vegetarian and flavorful for a buffet. They've updated it since I was a kid with gf, vegetarian and more flavorful items.", "business_id": "RbWAL8KYgUp9pNSeLSjXtQ", "stars": 3, "date": "2015-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Neal_1EVupQKZKv3NsC2DA", "review_id": "5rpXhVaHz67dA6NxatyZwg", "text": "Thanks to Groupon, I have recently discovered this place and watched two plays here- Dial M for Murder and Driving Ms Daisy. Both were hugely enjoyeable. (I think Dial M was a tad better , simply due to the genre which made for a more exciting time). I love this venue for bringing to us the theatre experience in an intimate setting. Booking tickets on the phone is seamless and now I am constantly checking the website for updates. Will surely be back!", "business_id": "VlHp9AFc9repIF6braYCCg", "stars": 4, "date": "2014-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9ws-eBp4UFRpk3qMtfSnLg", "review_id": "-1UhuUgz22kH6xybP4fRyA", "text": "I had a horrible experience at Petsmart grooming. They left my Maltese like he was in a fight with a lawn mover. I later took my pup to Clip in Clean they left him beautiful. It's incredibly clean and the owner was so sweet with my boy. I highly recommend their services. They are wonderful and so pleased with their services. I will only take my dog there from now on.", "business_id": "N1nXI-07ldED54HaZeKh5A", "stars": 5, "date": "2015-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "IyeIChhdWEobL5ByJ8is-w", "review_id": "QWjmJhOCR8Ali-N9GKDAmw", "text": "I had so much fun here.  Now this might have been because my friends and I indulged in some herbal pre-partying or maybe because it was 2 for 1 night (Thursdays).  Either way the party didn't stop till one of my group puked in the bathroom, then in the flower pot, then in the cab...\n7 shots of patron for $36.  That is a steal if you ask me.  Plus there are lots of fun places to dance on.  Which is a plus when you are 3 drinks and a shot deep and looking for some fun!", "business_id": "M0Pch3_-Gvj45RN1U4I35Q", "stars": 4, "date": "2007-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 8, "cool": 2}, "user_id": "-gUZjauL9THaok-eENmUaw", "review_id": "M6zyL_Q-m8qfmFiOwXzLwA", "text": "This is an update to my first review and the poor response by Z cleaners.\nI was upfront in stating I created the water rings. I brought the robe in for this reason. I understood that the rings may or may not be removed, what I was not told is that color loss could occur nor was I contacted if color loss was spotted after I brought it in. The owner states the color loss was entered in the system upon my arrival..this is false. Both the sales associates (will leave out names)  and I looked over the robe to mark where the water spots were and saw nothing of the sort. The ticket I was given showed no indication of \"color loss\" in the notes nor was it discussed. \n\nI never saw color loss on the robe and it did not have a snag on it before it was brought in. An associate there stated that she saw color loss when she received the robe however; I was never contacted in regards to this. If there was indeed color loss as this company is stating, I should have been contacted and notified that the robe should not be worked on. I was not contacted before an attempt to clean the garment was made, this alone seems suspicious. \nIf I would have been contacted before the cleaning took place for the color loss issue (they are stating was beforehand) then I could have witnessed the color loss they are stating I did. Instead I received the robe back and saw 3 white spots and a snag on it that both the (sales associate) and I did not see when I brought it in. If the color loss was there before it was cleaned then it shouldn't have been treated and I should have been contacted. \n\nA sales associate at the company apologized for not contacting me before the robe was treated. She stated they \"assumed\" that I knew there was color loss and that I couldn't see it from all angles. Again, there was not color loss when I brought the robe in. Also, the snag created when they cleaned it was never addressed by any employees or the manager at Z cleaners. When I confronted the two associates about it they said \"oh I don't know.\" \n\nI am not in agreement with this company, I still believe they ruined my garment. I have not responded because I am sick of the condescending emails I kept receiving from the owner G.P. I asked her 2x to stop emailing me and still she continued. I also received 4 phone calls from her employee _ all on the same day. Regardless, I contacted the company the same day I received the calls and spoke with two employees there and let both of them know that since they are stating it was something I did, that I did not want the owner to contact me any further. I told the owner I was not going to continue to go back in forth on this situation if that was her stance.  \n\nTo address the $10 discounted charge: when my husband went to pick up the items for me he asked if they offered a military discount. The associate he was dealing with was not sure so she went to ask the manager and the manager came back. He also asked the associate if they got the water rings out and she stated \"I don't know, I just know there is a white spot on it now.\" The associate then left and got the owner. She (owner) then asked my husband if there was a problem and he was surprised as he was just asking if they offered a discount. He then proceeded to tell them that I told him the item was supposed to be $10-$15 and that it jumped up to $26 so this is why he asked about the discount. The owner then stated that the price I told him was incorrect and he said that that is what I had told him they quoted me. This is why the owner decided to discount the garment by $10. I was originally quoted a price of $10-$15 by the sales associate on the robe, both on the phone and when I dropped it off. The associate stated that the only type of robe that would cost $20-$30 was a LaPerla robe. My robe is not LaPerla so I am not sure why what they were attempting to charge me the cost for that brand.\n\nAt this point I do not expect anything from this company for ruining my garment as they keep pointing the finger at me. I do not appreciate being contacted numerous times especially after I told G.P. (owner) to cease communication since they are not taking responsibility for the damage. I am responding to the message from the business because I feel it is inaccurate. I spoke with several dry cleaners here in the valley and they stated that when colored silk is treated by a dry cleaner for water rings/stains it can create color loss. This is what happened to my garment while it was at Z cleaners. A snag in the silk was also created by Z cleaners.\nI do not accept the response made by the business as it is inaccurate. Also, I no longer want to receive emails or calls from them as they just continue to say I caused the damage.\n  \nThis message serves as a response to the owners message showing it's inaccuracy.", "business_id": "K0ZTFp0Lbn-hRiQa5IzmQw", "stars": 1, "date": "2015-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "03uuI6W8rFmHNTFVlBQM3w", "review_id": "-H_SLrUKqkteCYLvdVqXZg", "text": "My fiancée and I looked at several jewelry stores before going to the Shane Co.  The selection and pricing of settings and loose diamonds at the Shane Co was unbeatable.  Chris helped educate us about settings and loose stones.  I found three unique settings that I loved unlike any of the other stores we visited where I might have only found one...many of the other stores didn't have any that I liked.  Chris then handed us over to Maryanne who was extremely knowledgeable about the loose stones.  We looked at several good quality stones that were all in house unlike the other stores that have to order them in.  Maryanne did not pressure us to buy above our price range like the other stores tried to do.  We found a beautiful stone at the correct grading and size within our price range.  And even though it was closing time, got it sized and mounted so we could bring it home that day!  I can't stop looking at my ring.  It is so beautiful! It was a setting and stone that I liked better than any of the other stores we looked at (and that was comparing to another top end designer setting.) We are so glad we went there.  We feel like we got the best for our money and there was no pressure to overspend.  Maryanne and Chris were great!  We loved the experience and walked out with something we are very proud of.  Thanks Shane Co.", "business_id": "BUsmaloKEZeOvXLrSjKWSQ", "stars": 5, "date": "2013-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1ohGCiLftsYuYkQAHQ-GIQ", "review_id": "bM4x1Zru6WTwSfjPOzKchw", "text": "I went there looking for Lennie because a friend recommended her to me. She does shellac nails that lasts very long and always comes out perfect for my friend. Yet, when I came to the shop one of the ladies there told me that Lennie doesn't work there anymore. Not only that but she rudely told me in a non friendly way. I don't recommend coming here unless you want to be yelled at. Absolutely rude. I'm not setting foot in that spot again.", "business_id": "vQQBk3jsTkbPfa-qGeF3rg", "stars": 1, "date": "2014-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YIjGrzJRQVpoZNl1rGXQ9A", "review_id": "IAnb4dqdbIC9ethb3Up0pQ", "text": "So lets see, The NHL and the NBA are in the middle of playoffs, you also have the Diamondbacks on and all you can have is two barkeeps behind the counter? And to boot, you have a networking group of business people what HELLO..have clients, meet clients and want to pass on a good word. This was not a great experience at all, the appetizers were COLD, UNDERCOOKED and the service had a mouth when asked about it The broccoli was returned brought back, with a mound of cheese now and almost thrown at my friend for having nerve to return it in the first place. Suggestion: a) Hire friendlier staff, there was one guy who was nice to see what we needed b) hire a chef, they will toss the microwave, c) learn customer service. I really expected soooo much more from this place.", "business_id": "kYQxOeJRFYats6cxVFnILw", "stars": 2, "date": "2010-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zRnoNCqk0DG3iOQxtpVXug", "review_id": "uIXv4tPkTbDCX29dIc04FQ", "text": "Been coming here off and on for a few years. Definitely not our number 1 fave place but the food is very decent-just not super authentic. My husband and I grab food here occasionally for a quick Chinese dinner. Owners are super nice and have been kind enough to do special orders for us several times.", "business_id": "aI_RzGMU35cFL1St2HgPkw", "stars": 3, "date": "2011-05-11", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "bH40h15ScLYilmXssXtf3A", "review_id": "n-HXzXhDqwfMP8oeOd5b1Q", "text": "The course here is alright but I couldn't help but feel a little disappointed.  Where I come from, a $90 round should feel nicer than this.  Orange tree golf course is a decent looking course, but the general maintenance leaves something to be desired.  The cut lines aren't particularly clean, there's debris from falling leaves fairly all over the places, and any water hazard around is accompanied by a pretty heavy dosage of goose poop.  In addition, the greens are challenging and definitely fast, but really not pleasing to the eye with myriad brown spots all over.  \n\nThe most distinguishing feature of the course was definitely the sand traps around the greens.  Every hole was absurdly well protected, averaging probably 50% or better radial coverage with sand.\n\nAnyway, despite the impressive hotel and clubhouse construction, you can probably skip this course.", "business_id": "40B5TbtZbiGV4blFR9S6Dw", "stars": 3, "date": "2012-03-01", "type": "review"}
{"votes": {"funny": 6, "useful": 8, "cool": 7}, "user_id": "fczQCSmaWF78toLEmb0Zsw", "review_id": "YDrs9BkRN44XsB7-Ves7sg", "text": "Pretty consistent, average sushi and hibachi experience... or in other words, 'eh.'\n\nI've been more to the sushi side of the restaurant and sat both at the tables and the sushi bar... I've also done hibachi on several occasions.  The service is just ok.  I kind of consider Benihana to be like the fast food chain version of sushi...\n\nI was there over the weekend and had a fly in my water... other than that, the food was fine, but it still ends up being $25 - $35 per person depending on how hungry you are...\n\nI'm sure I'll be back when I am craving sushi and don't feel like dealing with a wait or care much about atmosphere.  However, I'm not rushing either...", "business_id": "ishjLG3Sc94ZOelXZZhaIw", "stars": 3, "date": "2008-04-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "_5J83qI809zu_pfBi3Vu_Q", "review_id": "YV621fdNq3KAQb_TGOhemA", "text": "We arrived at 6:00 p.m. on a Thursday evening and were told since we didn't have reservations we couldn't be served until 8 unless we wanted to eat in the sushi lounge, where supposedly the menu was the same. We chose to do that, though it did not seem to be much of a menu.  My husband ordered a steak entree and I ordered volcano shrimp, basically shrimp on greens.  His order was delivered a good fifteen minutes before mine.  What's up with that? The food was okay, but the timing sucked!", "business_id": "ishjLG3Sc94ZOelXZZhaIw", "stars": 2, "date": "2014-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FosD5nMJNYHzxGYZ63N-eQ", "review_id": "AV8q2JWPRpc4oGY8Gy3bmw", "text": "If you want amazing food and service from a extremely friendly and caring family owned restaurant go no further!\n\nI was initially introduced to Gyro express by a friend who has been eating there since he was very young. I now have been to Gyro Express dozens of times and have not once waited more than 10 minutes after ordering!  All their food is consistently tasty.  My go to is the lamb and beef shawarma dinner w/ salad and a pita on the side.", "business_id": "FjQWjXvFCdrgdU3Rgi3b3w", "stars": 5, "date": "2014-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Rbo3iLTQWHP4xEcYnEU9pg", "review_id": "BQR5GT1kc5bCkZjonDg20A", "text": "This place is the best! I love the breakfast here and the service is always good too. Best place to go after a good trail run on a Saturday! Get the protein pancakes and eggs!", "business_id": "nP9zQBRNSxlnU8BsbqYI5A", "stars": 5, "date": "2013-05-02", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 1}, "user_id": "zaMpyqjK3jFaYl9Sv-Q6yg", "review_id": "RZdQ8q0plQ9-oNPpUNPFqQ", "text": "The drinks are strong, and the Chinese Food is yummy.  Is it the best Chinese food in town?  No.  Are they the best drinks in town?  No.  Is it cold in the winter going to this restaurant?  Yes.  Are there smokers because the place is indoor/outdoor?  Yes.  That being said, I still give this place 4 stars.  Management is awesome, and when I am drinking and having a good time, I want fried rice, pork slices, and garlic shrimp.  They even have \"heart healthy\" options, and there are always drink specials going.  \n\nThis place is truly unique.  I haven't been anywhere else like this, and that is a good thing.\n\nFinally, the hours are great!  I like to eat late, and I am in the WRONG city for that.  But if I want my Chinese food after 9 pm, this is probably the only place you can find open on a non-Friday/Saturday night.  They also open early.  Day-drinking is always fun.", "business_id": "iZR96moKSAWYROyL5-qeuQ", "stars": 4, "date": "2011-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8DOZeS8RNosDzGSPyXyLTQ", "review_id": "dKsZoqmvv8NuhYTieuoAKw", "text": "Always good, honest work. I have been using them for years and have never had a problem, & great customer service..", "business_id": "NP06AQ0mbWmgTLNuNqHdCQ", "stars": 4, "date": "2014-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FNFJ97BmcQklkYNQNRA7Ug", "review_id": "eFrncqTvckufqYD0WS7P7Q", "text": "Stopped by at 12:30pm on a Thursday and they were closed. No sign, no explanation. Was very disappointed because I've heard so many good things about this place.", "business_id": "tY30KG3CxVe3wU1b5gQDtQ", "stars": 1, "date": "2013-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "4fBoWddaekBhdSFhwIb1RA", "review_id": "KBa9VEtw0mbA9frNLKKHzg", "text": "Stopped here for the first time and got more than I expected. A great big hug, a gift book for a client and an introduction to things I hadn't known about Arizona. Judith the owner is kind, very helpful and attentive. Told her what I was looking for and she helped me find it - didn't just point to a section. She went over and looked herself! \nInteresting store with some great things to give as gifts - or keep for yourself. I'll definitely go again.", "business_id": "O6gsVf-AztpVfPjxKMFs_w", "stars": 5, "date": "2011-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Txq_1amn8v6-QJfWxDgsRA", "review_id": "OJeECT6W4AZO2XRc4QKpPw", "text": "I was watching food network and they featured Zinc for their French Onion Soup.  I happened to be shopping at Kierland Commons with my mom and grandma and putting two and two together I stumbled upon Zinc.\n     Zinc is an adorable little French bistro great for lunch or an intimate dinner. We ate in their courtyard and they had flowers, candles and all sorts of unique decorative pieces to observe.\n    The food is as good as the bistro is cute! I had a amazing salad and we shared the souffle for dessert!  Next time I am going to try the soup!", "business_id": "GIGI8bJfN6HyPzmEW-QqjA", "stars": 5, "date": "2010-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JGqds-rPJBRhgD5nP-BFDQ", "review_id": "l4oAWOPpvRpme-TJu2EAiQ", "text": "The pork belly was phenomenal, in addition to the filet with foie gras.  The pork belly was actually the best I have ever had.  I will be returning to order both of these items again.", "business_id": "GIGI8bJfN6HyPzmEW-QqjA", "stars": 5, "date": "2011-05-14", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "OoyMyBD0a-QmEJrFzw78Fw", "review_id": "iH4crFU551vYKza6M_Y_Fw", "text": "Arrogant, a-hole bartender with a condescending attitude.  Not one compelling menu item.  Intelligencia sort of atmosphere, that was not appealing to me.  Very comfortable patio chairs...great view for watching people...but if you are craving dinner, walk 100 steps to another Kierland establishment.\nI will never darken their door again.\nVery French in their attitude....if you know what I mean.", "business_id": "GIGI8bJfN6HyPzmEW-QqjA", "stars": 1, "date": "2013-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IooHTLs8ZjCyxn2X7hTugg", "review_id": "e5DCWtgMhOOt5uax1hjUbw", "text": "I used to love this place, but it has really gone downhill. We went here tonight to celebrate our anniversary and birthday, which we made reservations for earlier. I ordered the salmon, which was overcooked (I had to use a knife to cut it) and smelled extremely fishy. My husband ordered the scallops, which were okay. He ordered an iced tea and never received one refill, even after asking 3 different staff members. We made reservations and you would think they would even mention happy birthday or happy anniversary, but not one comment. When we left no one said have a good night or anything. Not a friendly environment and the food was less than mediocre. Not that it mattered to them, they didn't even come by our table to ask how it was. Our server took our order and that's it, he was gone the entire time. Just a total lack of common courtesy and is sad that this establishment lost its charm.", "business_id": "GIGI8bJfN6HyPzmEW-QqjA", "stars": 1, "date": "2015-03-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Hy8FHZmJIRP-WNMjQZqeMw", "review_id": "04Zzgfmwf1Muws03ulgZcQ", "text": "Always one of my favorites, can't go wrong with the chicken Madeira ( my favorite dish there). The chili was great too. One of the only places that no matter how full I am it is a must to get dessert.", "business_id": "ewZlgc22xN5NNQ1H7U6Y7g", "stars": 3, "date": "2010-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eNUtaWdbv87nxrFCHlCsjQ", "review_id": "ogpi6oFTC_KA1DHGx7BRoQ", "text": "Very good service for a group lunch.  Food is good and lots of menu choices, regardless of your diet type.  \n\nand of course.... great cheesecake!", "business_id": "ewZlgc22xN5NNQ1H7U6Y7g", "stars": 4, "date": "2014-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jBoumUoTh9yvpKHDrijayg", "review_id": "mq-MjX4i9hxJi1l9RxqyUQ", "text": "I found Judy's about 6 months ago....I was searching for a good Alteration business to bring my clothes too..I have been to others but never really satisfied with the quality of work....Judy's work is outstanding and I have used them several times in the last 6 months...The normal wait appears to be a week but very well worth the wait.....Great service !!!!! You can try on your clothes and she can take the measurements ,  make the markings & pin up the clothing  in no time....Very Happy with the Work and Service...Thanks Michael", "business_id": "xDPaJlaEVrqjQ0HjgmEk9g", "stars": 5, "date": "2014-05-13", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "B0D83477LClh-9fpPpY1gA", "review_id": "UMbQCABraCVlRTz0wsLT0g", "text": "Hands down the best breakfast burritos in town!!!! We drive from south Scottsdale to get them. Get either the bacon max or sausage max burrito, they are amazing... \n\nThe portion size for the burrito is smaller than your Filibertos or \"filisquirtos\" but you won't feel disgusting and want to vomit when your done eating.\n\nThe reason for the 4 stars - the customer service is good if they like you, they can be a little cold if they don't or if they don't know you, but that's any New York deli especially if your back east. I love this place and whenever I want a want a burrito, I make the drive!", "business_id": "8pqdYVXF17grawfgP2fZTA", "stars": 4, "date": "2015-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "A6vydtxRka2VVdGU8l2_Lw", "review_id": "TJKZ6EctGwbz2UkM8keq-A", "text": "This place has great coffee. Also the atmosphere is interesting, artistic, and inviting. My dad and I ride our bikes there and talk/drink/read. It is heaven. It still surprises me to find this independent coffee shop in that part of Scottsdale. Go there!", "business_id": "I2_yeLfTzXHGwi8an0tL4w", "stars": 5, "date": "2009-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s_QyexyrDAu8HjI9HoInBQ", "review_id": "C4daK77HAgdCXxDwn46-gw", "text": "So far they are accommodating and very nice. \n\nI was in yesterday to get make up but they were out of stock. The girl behind the register said that a shipment comes in every Thursday (for my make up) and to call so they can hold the items I wanted. I did just that and they made it easy, breezy to get in and out with everything I needed.", "business_id": "LMjCZH50S4xjKBuFVl2xEQ", "stars": 5, "date": "2014-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5caTZPPbG49_t_1PLzIKcw", "review_id": "2n3B7JRv72UgAw4yFSMKYQ", "text": "I love the food & the value is great. Service is good, family friendly, nice ambience. It's my favorite place. We usually head out there on Friday's before 7pm to enjoy the happy hour with half off appetizers and alcoholic beverages. \n\nOur usual order includes any one of the curry's, cashew chicken, basil chicken, yakisoba. The chicken on skewers are a great appetizer. They're pretty much always full house, but I've never had trouble being seated within about 5 mins. \n\nYaaay to Flo's!", "business_id": "H7KzlC0-o1wIhlGg-Me5Ag", "stars": 5, "date": "2009-04-26", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "tlOCEZXsDMrC2eBD0CUANw", "review_id": "P4oiCLOnMIFZp-aJMOaz3A", "text": "Awesome food, excellent quality, great service. Every time we've gone here, it's all been great - every time. The ONLY misgiving I have is that they , well, only give you enough for 1 meal without leftovers. I guess there's been built an expectation when you eat out at Chinese you pretty much get 2 meals. \n\nPrice is slightly high, but we don't mind paying for quality. \n\nOh and ignore the dorks here slamming them for not having wi-fi. Get a life and do your internet at home or starbucks or Barnes and Noble with the other social butterflies. \n\nI hope they don't get wifi so the bar isn't filled up this 'those types' sitting with their laptops open on the bar - jeez. (or geeking out w/their phones)", "business_id": "H7KzlC0-o1wIhlGg-Me5Ag", "stars": 5, "date": "2013-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1YfDUkWjrkMU_lEv1wHVXw", "review_id": "J9z-ObxtMThwmQtRWZn73g", "text": "Flo's has a very modern ambiance so I was excited to come and try their authentic Oriental food. I was a little disappointed for a few reasons:\n\n- They don't allow fried rice as a side dish during the lunch special (no subs)\n- The appetizers tasted like they were frozen and fried up instead of made from scratch\n- Kung Pao Chicken tasted very much like star anise (licorice basically) which is not how it's advertised\n\nA plus- they give you an assortment of different sauces with all of the food brought out, which is awesome because I like to dip my food.\n\nProbably won't go back, but a good place to go if you want a quick and cheap lunch with a big group.", "business_id": "H7KzlC0-o1wIhlGg-Me5Ag", "stars": 3, "date": "2015-04-02", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 1}, "user_id": "6pykKmGnZ9E4qehKUVCDHA", "review_id": "V-_Inx05TaXrienUU-0doQ", "text": "4.5 stars.  I stayed here while attending a conference and thought it was great.  I got in pretty late and was feeling cranky, but everyone I dealt with was so nice, I got over it.  I was put on the 9th floor which had a decent view.  I never got to take advantage of the lounge since I was in meetings all day, but it looked nice.\n\nThe room itself was mostly modern and clean, and I didn't really hear my neighbors.  The chair with the ottoman was very comfortable and all the bath products were nice.  The only negatives were that the sheets were a little on the stiff side, and the popcorn ceiling.  \n\nThe food served during the conference, which there was a lot of, was also surprisingly good for hotel food. Seems like a great facility for conferences, and I'd stay here again, if only to have time to use the pool area.", "business_id": "SYqTY48DJa1cYhglvmgvsQ", "stars": 4, "date": "2012-05-17", "type": "review"}
{"votes": {"funny": 3, "useful": 8, "cool": 0}, "user_id": "sLKOFR5xBHq81CFjSURrEg", "review_id": "skPZc1PpdB3D-vm_AOE3qg", "text": "My wife and I decided to stay at the Westin Kierland to celebrate our wedding anniversary this last weekend (4/19/2014).  \n\nYou know how sometimes before a weekend you are looking forward to you envision how you think it will be?  I envisioned getting a nice room when we checked in and then going down to the pool where we would have a couple of lounge chairs by the pool and frosty drinks brought to us by an attentive wait staff.  Maybe a few trips around the lazy river and a nice lunch by the pool.  After a few hours head back in to the room to get changed and go down for a nice glass of wine in the courtyard and then have a great dinner.  Maybe the next morning after breakfast go back to enjoy a few hours by the pool again and then head home totally re-charged from a nice relaxing weekend.  That's what I had envisioned for my stay at this property.  \n\nHere is how the reality turned out:\n\nWe arrived at 1:00 and were able to get checked in, the front desk person was very helpful.  Our room was nice, located on the first floor.  So far so good.  I was a bit concerned when I noticed there seemed to be a lot of kids running around the facility though.  \n\nWe went to the pool and it was a zoo.  Kids running around all over the place, screaming, and no seating whatsoever to be had.  Eventually we locate a table by the bar that is baking under the sun.  We take it and wait for the waiter to come by.  After 20 minutes of sitting there it is very apparent we need to go to the bar to order.  I go to the bar and after waiting in line for 15 minutes get an order in of a bucket of beer and a quesadilla.  The bucket comes with 4 beers, but they are larger than the standard 12 ounce bottles.  I think they were about $6 each or so, not that bad for pool pricing.  The bar guy tells me since I ordered from the bar I have to come back to the bar to get my food, even though I am sitting 10 feet away at a table.  Finally after a few trips to the bar to see if my food arrived, 20 minutes later I suspect it does.  I see it sitting back on the bar but no one will help me to simply hand me my food.  I have to actually wait in the bar line for 10 more minutes to have someone hand me my food.  When I take the food back to the table for us to eat, I notice the quesadilla is ridiculously small.  It looks like something off a kids menu, not a $12 plus tax and tip ($16 all in) appetizer.  There were 4 pieces and they were very thin, one small piece of chicken in each one.  I took it back to the bar to confirm that it was my order and not something meant for another table for their kids.  After 10 minutes waiting in line to get someone at the bar, they informed me that I had indeed received my order.  I have a picture of it here so you can see it.  Overall it tasted awful and was a complete waste.  \n\nThe Lazy River.  Remember my visions of floating down a nice lazy river with a frosty drink?  There is one at this resort, however it is treated more like a ride at a theme park.  You have to go stand in line with 50 screaming kids until you get the tube to float.  You get one trip around and then off the tube and back in line.  The line takes 20 minutes or so.  \n\nOverall the pool scene was complete chaos.  No seating, terrible service, and their food is an absolute overpriced joke.  There is nothing relaxing about being there.  In fact the only relief comes when you leave this resort.  After seeing what they served us at the pool for \"food\" we decided against having dinner and room service at the resort.  We live in the area and know Kierland has great restaurants just a short walk away.  \n\nThe next morning we went to the breakfast buffet.  It was about 7:30 and we were hopeful we would beat the crowd.  We were seated outside.  To our right this kid started screaming \"bird, bird, bird\" over and over at the top of his lungs.  Then he started waiving his knife around.  The parents were trying though and did suggest their child try to communicate with the bird using ESP rather than yelling.  To my left was a little girl who was running around then went to face the wall and scratch at it for about 15 minutes.  Inside the restaurant it was mobbed with kids running around.  I thought I was at Chucky Cheese for a moment.  We finished breakfast, which actually was pretty good and the buffet priced not that bad ($24 per adult).  \n\nWe decided to see if we could get a second try at the pool.  It was about 9:30 and maybe the pool would not be crowded and we could get a few hours relaxing there.  Um, no.  There were huge lines of parents and their kids, each line was probably 75 to 100 deep.  Waiting for the pool to open.  It was going to be an absolute zoo again shortly.\n\nThe greatest relief was leaving the resort.  If you have kids, this is the place for you.  If you are looking for a relaxing adult weekend, this is not the place.", "business_id": "SYqTY48DJa1cYhglvmgvsQ", "stars": 2, "date": "2014-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "K0euQLFAcKhQPZ6JxGAryg", "review_id": "jWmnu4KtWNIKp5maIW3Agw", "text": "A shoe lover's paradise! I cannot believe the amount of shoes they have here, even sneakers.  In some sizes the sneakers had to be stacked on top of each other!  Lots of boots on clearance since the summer is coming.  I liked the setup of the store and that there weren't many people there.  I didn't get a chance to look at the clothes because I was there strictly for shoes, but I'll definitely be back!", "business_id": "WowrRUKvjiLX4zT12xU_yw", "stars": 4, "date": "2012-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "0ouMuScWJ3GuNtWEmmsziw", "review_id": "fsmAU0pl5RIY93OFBSYMNw", "text": "I was thrilled to find that they sell Vegemite here! : ) \nThere are only a few things I can stomach well being pregnant right now and Vegemite on Toast is one of them. Being an Australian product I was very worried as my last jar was getting very low and I feared that shipping it here could take a long time....however I remembered Heather L. had mentioned there was a store in Scottsdale that sold it and I found I had scribbled the name down on a piece of paper.... Cost Plus!\n\nNot only did I find Vegemite but I found many chocolate bars normally only sold in Australia and England here as well! I am very happy now : )  Oh and I cannot forget Patak's Indian Curry sauces....they are great for home made curries.\n\nMy husband also found some very nice international beers (jealous). The staff here are great too, very helpful and friendly.", "business_id": "0Gu2cpJ5x9ZZfDDHohBY_A", "stars": 4, "date": "2010-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ZIRmCbaD1S_wv7Kg1fS9_g", "review_id": "BCzRaVGN2ycmRGhHvM9rUw", "text": "Buyer Beware!!! Do NOT buy from their bankruptcy liquidation sale - they are bringing in merchandise that R&S never carried to augment the sale. We're talking wood veneers and fillers - we were scammed on our dining room set and are out several thousand dollars (the salesperson told us it was solid wood!). You go there *thinking* you'll get a high end piece of furniture but they're using the R&S name to sell lesser quality items.\n\n*Update* After contacting the company handling the liquidation, and even getting an e-mail from the former owner of R&S, we were refunded our full purchase price.   I'm sticking with the original rating only because people visiting the bankruptcy sale need to know they're not getting the same quality they would expect from the R&S name.", "business_id": "kn3nVeUFmYuhd1xonb4Thg", "stars": 1, "date": "2011-04-19", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "Da4aw-NF9ond8U6XYRmT0g", "review_id": "KyDxqMdCVjKvI7fZK_YgIQ", "text": "We had the same experience as a few other reviewers. We actually felt like we were being stalked by the creepiest of all creepy sales ladies. She asked us a series of odd, rather personal questions. We walked the circle and actually found one that caught our interest and while we were talking about it she comes in guns a blazin with an information dump that made absolutely no sense. Maybe it was her first day on the job or something but we didn't stick around to find out. Not the worst shopping experience I've ever had but definitely in the top 3.", "business_id": "Oqd9hAQUAN128Nr1QcbdjA", "stars": 1, "date": "2013-05-11", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "AaHXbzxbLyNivuHHcdpGgw", "review_id": "jtPb8oXxN0vfDnTSxkdwMQ", "text": "We have been coming to this restaurant for the past nine years and haven't had a bad experience yet. My father and and husband are addicted to the veal gorgonzola and ordered it the other night as usual. They raved about the tenderness of the meat and the richness of the cheese sauce. Unlike these gentlemen, I order something different every time we go. This time is was the gnocci with shrimp and argula---yum! The potato dumplings were sleek, plump, and velvety, peppered with plenty of shrimp in the sauce. I find the freshness of their seafood and the pastas pretty amazing. \n\nOf course the service tops it all off. Our lovely \"mustached\" waiter, who had obviously been doing his job well for many years, kept things humming and organized. We received a very warm greeting at the door as well to start things off on the right note as well. We love this place!", "business_id": "fmWyI5ec05F8PJpx3eNpLg", "stars": 4, "date": "2012-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "htBakbWxbIxS6KX46aawSg", "review_id": "eXlVkmkol1ojnoqyqtyDoA", "text": "I just started taking dance lessons at the studio and love them. Everyone is so friendly and my instructor, Sarah, is fantastic. She is really patient and helpful as we learn new steps. She really was helpful in understanding what I wanted to learn and catering the program to meet those needs. Worth the cost of the lessons.  Can't wait to hit the dance floor and dance the night away!!", "business_id": "dqqGDOXRO8diBFTxvfnoHw", "stars": 5, "date": "2015-03-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "IO9_bnzjvzYC0zajCx-iUg", "review_id": "jjmxcod9qfEo7fD7pX1q2Q", "text": "Great local sports hangout! For a sports bar, I give Arena 4 stars; as a restaurant it would be 3 stars. So I went there as a group of 6 to watch NHL playoffs. For some reason I thought this was a newer place, but turns out it's a rather old local neighborhood hangout, and features an OTB. The bar/otb section was pretty dark and very loud (it was Thursday night), so we opted for the dining room. Our server was VERY friendly and accommodating - she got us a big table, and switched the TV to the Blues-Wild game for us - which is why we were there. As far as a place to watch the game, the dining room was just ok - decent view of tv, but no sound at all. The atmosphere in that room was more for dinner than watching a sports game, but since its a sports bar we didn't feel awkward cheering for our team out loud. The OTB half of the place is much better suited to games etc, but on that night we wanted a little peace to be able to focus on the game.\nWe ended up ordering a few beers, potato skins, a hamburger, 1lb of wings in secret sauce, and 2 large pepperoni pizzas. My friend had the burger and said it was good; I was able to try everything else. Gotta say, the potato skins may be the best I have EVER had. They were nice and crispy all around, and covered in lots of bacon - most places barely put a few bacon bits and serve the skins rather mushy, but not Arena. Their skins were AMAZING. I would definitely order them again. The wings were decent - typical sportsbar chicken wings; about 10 pieces made up a 1lb order. They were nice and crispy and the \"secret sauce\" was actually really good - not too spicy or sweet, just perfectly balanced. The pizza was good too, but my main gripe was the use of cornmeal on the bottom. I HATE it when pizzerias use cornmeal - that is pizza blasphemy! most places do it just so the pizza comes out of the oven easier - that is just lazy pizza skills. I've never thought that cornmeal adds a good taste to pizza, and it makes it messy. Without the cornmeal, I'd say the pizza was a good thin crust foldable NY style.... but as is, the pizza is average and just a hair above mediocre, because of the cornmeal. uggh. \nSo, for a sports bar where one would go to watch games like NHL playoffs, or bet on horses, or play bar trivia with the DJ - Arena is a good local hangout, nothing special, but effectively fulfills expectations (which should never be too high with sports bars). With lots of TVs, and games like billiards and darts etc... Arena is a fun place where you can go with friends or even just go alone if you're bored at home. It's pretty divey, but has a local neighborhood vibe that keeps it friendly. The food is not the best, but a cut-above-average for a bar - the potato skins are HIGHLY RECOMMENDED, and the wings and pizza are recommended, but with reservations. The service was excellent, and the prices were quite reasonable for the location and type of venue. You need a place to go and watch the game and devour some food? Arena is probably a very good bet - not fancy or gourmet, but local and friendly.", "business_id": "_TWT58PWunYIyPgpz1fuog", "stars": 4, "date": "2015-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Vh5k4r6OTX51TJZSGs57bQ", "review_id": "V7SslsiXIfmGHdBisQpAnQ", "text": "I have been going to this vet for about a year but not anymore.  Dr. Bessemer doesn't answer calls right away like he used to.  Don't know what's going on with him, but he diagnosed my pet wrong, so I ended up going to another vet.  Am very disappointed in him, wouldn't recommend him now.", "business_id": "ul28DO_afdK_gWDLqmudeA", "stars": 1, "date": "2015-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RGFEN4VprIPkARNJ3wG9tw", "review_id": "MDQoKN-KTLtbD7gy74eXdA", "text": "Faline does excellent permanent makeup.", "business_id": "9Tumn_3WNljLcKl6c3AvLQ", "stars": 4, "date": "2015-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ZuX7Ttb4Z38MMo31ZaJ7UA", "review_id": "eE291Zv6duME0JS9LY-SZg", "text": "Marty does everything from estimates to the installation of the pool fence. He has been doing this for over 20yrs and his experience shows through in his attention to detail, the layout of the fence and choosing the best fence for your needs. \nOriginally my husband tried to do it himself, but there were gaps that my 3 yo could get through and we didn't have any access to the rest of our yard. Now we have a beautiful pool fence that surrounds the pool, peace of mind that our children cannot get to the pool AND best of all we finally have access to the rest of our yard!  \nYay! Thank you Marty :)", "business_id": "WV_JBM_2QtRn40WDlQaTKw", "stars": 5, "date": "2013-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "R2Jr4FiahEETyaB4J_0atQ", "review_id": "7x4NywttfPdi4c_TM1t0lQ", "text": "If you like growing old and probably dying before your food is served this is the place for you.", "business_id": "pmIJn8K3offcYUsrFCWAaQ", "stars": 1, "date": "2015-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5PTruBzQ66veJ-QtereHgg", "review_id": "roKog5oqya86Nc1iL2TgdA", "text": "Dr. Rouhani and his whole team are absolutely as good as it gets! He is such a skilled, personable, and all around great dentist! Kim, the dental hygienist is also soooo amazing! She's the only one I'd ever trust to do my cleanings! She as Well,  is so personable and takes great care while Working on my teeth. I never thought id say this before finding this practice, BUT I love going to the dentist (this one only of course )!  I always walk out feeling fabulous about my smile! I can trust Dr. Rouhani, Kim, and the team. Everyone that is apart of his practice is so genuine and talented, so if you are looking for a reliable dentist...check out amile concepts!  You will not be dissapointed. I highly recommend!!!!", "business_id": "CWbdqgLxnaJBKd1wYPmz-g", "stars": 5, "date": "2015-05-21", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "qh_q-YZzSfOt3iJAXaykrg", "review_id": "s77Tq-PvTt-lXEcXJTNaiA", "text": "Upon entering the place has a cozy home feel to it. May be a little too cozy for some as the tables are fairly close to each other. The menu isn't very extensive, lots of pasta, some calamari, chicken and veal.  \n\nMy boyfriend and I were seated and had napkins laid on our laps. We were left there , forgotten for about 15 min, while other tables around us were being attended to.  The whole meal went that way, it was not a very pleasant experience and we will not be returning.  Other patrons were offered choices with their entrees, we were not, others were offered sambuca after the meal, we were not. \n\n\nI don't want to say that our experience was racial, but it felt that way as I was the only non-white customer in the establishment that night.", "business_id": "gHKB66up5VluCWT4vuSZpw", "stars": 1, "date": "2013-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4XrpU7kpxbFqMNdDEsj-xQ", "review_id": "_wRf9vLvFRuEwwhoUedrfQ", "text": "Morton's steakhouse offers the best steak in Scottsdale.  The Prime Rib end cut is very flavorful.  This place always brings in a big crowd for dinner and the ambiance is very nice.   It's not exactly a five star food quality  like Ruth's Chris Steakhouse but it's good food and great service.   Everything is served ala carte like most high end steakhouses and be sure to order a bottle of red wine to go with your steak as they have a nice wine menu.", "business_id": "_YswYrpv6YdO3R3CP8R8oQ", "stars": 4, "date": "2011-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uq1y9VRH9vOy91x8f4TQSg", "review_id": "04ctGUWNEMb1Gdg_4hJu2g", "text": "Wow...I don't know how they are still in business. For the prices they charge, you would think the food would taste amazing. Explains why they had maybe 6 tables filled at 7pm on Mother's Day. \n\nI placed an order for pick-up and ordered the Maine Lobster Cocktail, Broiled Sea Scallops wrapped in bacon, 6oz Filet, and Creme Brûlée. The Scallops were good, and the Creme Brûlée was decent. I've had much better Creme Brûlée though; this one was a little chunky and as far as presentation, they just threw it in the togo container making it look like a blob of mess. The Lobster Cocktail was not edible. It tasted and smelled like fish that had been sitting out for 10 days. They have better lobster at Red Lobster. Lastly, the filet... First of all, I ordered a medium rare steak and they gave me a medium well steak...didn't bother driving back to the restaurant to return in so I dealt with it. Setting that aside, the flavor of the steak and meat quality was subpar. If you put a Mastro's filet next to a Morton's filet, it would be like comparing a Ferrari to a Chrysler Minivan. \n\nDon't waste your money here, go to Mastro's, Ruth's Chris, Flemings, Eddie V's, Bourbon Steak, The Capital Grille instead. You will get your money's worth and it will be less expensive!", "business_id": "_YswYrpv6YdO3R3CP8R8oQ", "stars": 1, "date": "2014-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "W_pLy7-OTLCCdH-fAInv9Q", "review_id": "UxofIPWyTh6HYNUb5-wrYA", "text": "I absolutely love their Kierland Commons location, and their happy hour menu cannot be beat. We always end up having tons of sushi and beer for less than $20/person. It's a cozy place with a cool vibe as well, great for people watching. Definitely one of my favorite places in the valley.", "business_id": "nk6_ipMkmUvUtq6Xvncf0A", "stars": 5, "date": "2010-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "OrMY-AG_Cx10WD4xDeQAUg", "review_id": "oNLdkH8w21xir3WxSPVjxQ", "text": "My wife and I came here for Arizona Restaurant Week. \n\nWe've never been to RA Sushi before, so we figured we'd check it out. \n\nThis is at the Kierland Commons location in North Scottsdale. We walked in and I thought it looked really cool inside. I liked the atmosphere and thought the red lights were a good touch.\n\nOur waitress was nice, but really didn't understand the AZ Restaurant Week menu. She gave us conflicting information about it. It had been going on for at least a week but she said we were her first customers to order off that menu. Maybe she should have been trained in it better. Whatever, not a HUGE deal.\n\nWe got the pot stickers for the appetizer. It was good. No complaints there. But it reminded me of the pot stickers you sample at Costco. I wonder if they got it from there. \n\nWe ordered the Las Vegas roll and some other sushi assorted platter. The Vegas rolls were way too messy. I didn't know how to eat it with my chop sticks. Kubuki is better. The California rolls were super tiny too. I had no clue what the other thing was. I think it was salmon on top of white rice? Not impressive.\n\nThen came desert. We got the green tea ice cream. I couldn't finish it because it tasted too bitter. My wife informed me that it wasn't bitter, but I thought it was. Maybe my pallete is off? \n\nAnyway, it was overpriced. Our server was nice, but she didn't really go above and beyond. Would I come back? Probably not.", "business_id": "nk6_ipMkmUvUtq6Xvncf0A", "stars": 2, "date": "2013-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "90a6z--_CUrl84aCzZyPsg", "review_id": "3lHdjx27xvkf1oqNesUOmw", "text": "As much as I detest chains, this is not a bad joint to have dinner. The place is absolutely huge, with a log cabin kind of feel to it. The service was above par and the food was good considering they offer about 1000 choices. Beware: everything here is served in monster size portions, I suggest you order a half portion if it is available for the item you desire. This particular location seemed nicer than other Claim Jumpers I had tried in the past, and the service was definitely better.\n\nOverall good quality comfort food.", "business_id": "29g8OBj2FnklSGyl-Dnx0g", "stars": 3, "date": "2008-04-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "-WtEyxSW7rt19jF5mHN6Sg", "review_id": "r_e6JsPzMs7-Tw3BxFWufw", "text": "I called this salon first thing this morning with a dire hair cut emergency and they fit me right in. The staff is extremely friendly, the owner is on premise and makes sure all hair looks good, they keep the areas immaculate, and the prices aren't unreasonable. Shasta cut my hair and chatted the whole time--she's a total sweety--telling me exactly what she was doing to my hair to make sure that I had opportunity to give feedback. A++, I'll be going back!", "business_id": "fRlXdqjH-7Xaxmrcb7ugwQ", "stars": 4, "date": "2010-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "AA2QzaCSRgcJVswAn6CHUQ", "review_id": "tCr7G9XA-YJhJXAxDrYmfQ", "text": "I can't really write a very detailed description on this because we stayed only for 10 minutes. After walking in and finding that my husband and I were the youngest in there, by like 30 years, we had one round of nasty tasting drinks and left.  \n\nOn a plus, the waitress was very nice. The atmosphere not so much. We didn't get a chance to taste the food.", "business_id": "ZXlO9S1MG2I-L5uLSF-nPA", "stars": 1, "date": "2009-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "19BunjXk7zhd811rF42U7w", "review_id": "dn7GHuBTkx4FuMZgNsVllA", "text": "What a pleasant surprise - to find an authentic Cuban restaurant in the state of Arizona!!!!  I had the typical beef plate with rice and beans and maduros.  I've been thinking about the maduros all week long!!!! Pretty standard Cuban food and it was excellent.  It lead me to ask the waitress where the owners are from - one is from New York and the other Cuba which is why the food is really really authentic.  We topped the food off with a really good pitcher of sangria while a Cuban band played live Cuban music in front of us.  For me, this was a 4 star night.  This is a very casual place  My only complaint is that it is sort of pricey.  Two entrees, a half pitcher of sangria and 2 appetizers was over $80.   We'll absolutely go back again!!!", "business_id": "8v1MWkAeU3nEuqGd27jZeQ", "stars": 4, "date": "2010-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "M7r1z0V7S4Wl84CxbprdEw", "review_id": "PZgejiloli5oA_RTMVjYUg", "text": "Here is the problem with Havana Cafe:  Its overpriced.  I ordered a Emparedado Cubano sandwich as carry out.  I liked it.  It was tasty and came with french fries and moros (black beans and rice concoction).  It was supposed to come with cabbage salad but that appeared to be missing in action when I opened the box.  \n\nIt cost me $16.  \n\nIf I pay that much for a sandwich, french fries, and rice/blackbeans, they need to be amongst the most delicious things I've tasted in order to justify that.  But they weren't.  They were just barely good.  \n\nIf they cut the price in half it would be a great meal worth the price.  Until then I would avoid this place.  I wont be returning unless they do.", "business_id": "8v1MWkAeU3nEuqGd27jZeQ", "stars": 2, "date": "2014-05-29", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "Q4bmxDSB-fstCpx6vaguKg", "review_id": "7vATRg4idmLl8gB3Q8Pr0w", "text": "HOME MADE EVERYTHING!\nChicken Alfredo with chicken smoked in house. Certainly worth the $6 more than the chain. Sausage and meatballs all freshly make same day! Next visit I got a steak, I said what do you have. They asked me what I wanted. Went to the back and told me what looked the best, cut in house. Ribeye was amazing Prime beef and cheaper that the steakhouse down the street. For sides I mentioned a veggie, they started listing around 15 different options and said what would you like, any or all. Taking the better half there for her birthday tonight!", "business_id": "863nEWkPZ7uD-ZRTmmJokw", "stars": 5, "date": "2013-03-27", "type": "review"}
{"votes": {"funny": 6, "useful": 6, "cool": 4}, "user_id": "LTX9pmF-zXPYB4wE8b9RZg", "review_id": "24nH2-WB2IzLrIlISoNTCQ", "text": "My east coast Jew taste buds are dancing today! I just ate an everything bagel stick, toasted lightly, with cream cheese...\n\nWe happened to be in Scottsdale for dinner and, in looking for our restaurant, we passed NY Bagels 'n Bialys. The \"open\" sign was all we needed to go in. We haven't had a good bagel since we left Boston. And I hadn't had a good bialy since we left Cleveland in the 90s.\n\nWhen we went in we saw this gargantuan menu. They make tons of flavors in bagels and bialys. Plus they make sticks. I haven't had a bagel stick in forever, either. It took about two minutes to pick out a dozen. I could barely contain my excitement. They sliced them up for us, gave us some sleeves so we could freeze what we wouldn't eat right away and sent us on our way, $9 lighter but infinitely happier.\n\nAnd I am not disappointed. It has been so long since I had a real, east coast bagel that I forgot how good they are. They doughy faux Jew food they have here just dulls the senses and makes a person forget the amazing deliciousness that we enjoy back in the real \"Jew food world\" of the east.\n\nThat said, I do have to add one caution. When I saw they also serve sandwiches I asked to taste their corned beef. I do this everywhere I see they serve it and restaurants are always kind enough to oblige. After my anticipated success with the bagels, and the whitefish and lox I saw in the case I was optimistic. Made getting my hopes dashed even worse. As soon as she set the slice in front of me I knew. Color, consistency, texture - nothing was right about this corned beef. Still, I asked for it so I felt I had to taste it. My husband described it as perfectly good Irish corned beef. I described it as dreck.\n\nSo my review is strictly for the bagels, bialys and sticks. Enjoy!", "business_id": "El_0LAdJ1R0-nL_lHzBT-g", "stars": 4, "date": "2010-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zT0txpEAh9lUOO1-yeDY7Q", "review_id": "DbXQIRTiYT2TxTYaFFflgw", "text": "This restaurant is always a great way to start a Sunday morning. My omelette was delicious and our waitress Jessica could not have been nicer.  She remembered everything about our order right down to my \"lightly toasted\" bagel! Thanks N.Y. Bagels for a great brunch.", "business_id": "El_0LAdJ1R0-nL_lHzBT-g", "stars": 5, "date": "2015-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "gQ5UeLuykj0iOtgJ-qfzCQ", "review_id": "laC-BEykLlC388N2XS1sJg", "text": "A great little ma and pa restaurante with big flavor! \nThe restaurant is small, very casual and I could tell the owners are very family oriented. \n\nThe entire family helps out at the place at some point or another and are very friendly and their hospitality was a nice change. The food however, was even better... \n\nAlessandro's special is essentially a chicken piccata... the chicken was a bit dry, but the sauce was well prepared, it had just the right amount of citrus and capers and not overly sour or salty like most other places prepare it. The eggplant dish was awesome! Normally, the eggplant parmesan I get  is a little mushy, but it wasn't too dry or soggy here. \n\nWhat else can I say? I love this place.", "business_id": "AX8lx9wHNYT45lyd7pxaYw", "stars": 5, "date": "2009-05-14", "type": "review"}
