{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bvu13GyOUwhEjPum2xjiqQ", "review_id": "bMCvh40U7J1xu3IwuulAPg", "text": "Not bad for a Shop N Save, most are privately owned, so availability of items might differ from place to place. The only time I frequent S n S is when the have their huge two day sales usually held on Thursday and Friday at least once month.\n\nGood bakery at this location too.", "business_id": "yXuao0pFz1AxB21vJjDf5w", "stars": 3, "date": "2011-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rMyWUoG0X-3Q1GRVw4i_bw", "review_id": "BZxWKFWwP1lunolyT5WeSA", "text": "First, I have to say that I've been here twice in the past few months, and each time was with a very large group (one group of 20, one group of over 30) on a weekend evening and I'm thoroughly impressed with the friendly, efficient and professional manner in which the accommodate groups. Whether increasing the number of diners at the last minute or providing separate checks, they are flawless. Lots of other restaurants could learn from them. Impressively, even with providing separate checks to such large groups, they chose not to add gratuity (and we obliged with good tips), l managed to deliver food to everyone at the same time, and processed payment of the checks in no time at all. Bravo to this restaurant's management and service staff, it's top notch.\n\nThat being said, the food and beer aint all that bad either! Fish & Chips, chicken mac'n cheese, salmon bites, guacamole and the Maker's Mark burger are all quite good, as are the beers (the Kölsch is my favorite!).", "business_id": "McikHxxEqZ2X0joaRNKlaw", "stars": 4, "date": "2015-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1_jp_aTjqF4NaumpMRpyCw", "review_id": "sj_t-iyN0xqqEoDzoFSjyQ", "text": "Lincoln Bakery is great.  My family has been ordering cakes from here for years, and I always request one for my birthday each year.  We probably order about 10 cakes a year from Lincoln Bakery, and often it's the same one:  the simple and delicious chocolate cake with chocolate icing.  If you like chocolate cakes, try it, and I bet you'll like it.", "business_id": "7wT532x2Qz5Hw9BqtBapqw", "stars": 4, "date": "2012-04-26", "type": "review"}
{"votes": {"funny": 2, "useful": 8, "cool": 4}, "user_id": "nEYPahVwXGD2Pjvgkm7QqQ", "review_id": "AME3AAGxOqLQ5tob_k-9jA", "text": "What a cute little coffee shop in such an idealistic setting!  I sat amongst the gathered hipsters, moms, friends, ladies who lunch, power business lunch people in a sunny little corner of the room sipping my delicious Indian Spice black tea.\n\nService was very friendly and looking at the fresh pastries and lunch list of homemade soups and sandwiches made me want to come back and enjoy a leisurely afternoon or perhaps work day here taking in all they have to offer.  \n\nI was surprised when I asked to see the tea list and the barista told me they didn't have much to offer.  Still looked like a good amount to me and I was pleased to see a variety of different offerings some coffee shops don't offer (because, well, they're usually coffee focused!).  I also enjoy that they use loose leaf tea, so you know it's not just coming straight outta a generic box of Twinings.  \n\nFREE internet is always a big plus with lots of outlets.  Now if someone could just find me an affordable house in Highland Park this could just be my next favorite neighborhood coffee shop!", "business_id": "83_p9vIqOq1TUIf3_GD7bA", "stars": 4, "date": "2012-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Zff7xm0J-C7hV1z3j-JipQ", "review_id": "P78h4Ms-VvJjHUXGxvyP0w", "text": "Believe it or not, this whole foods is actually one of the most successful ones. the location is strange, but it's pretty central for most of the yuppier areas of pittsburgh, and it's the only one in the pittsburgh area. Just for that, they get 5 stars.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 5, "date": "2007-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YjgIAjb2mhRVPGb9N4VnKw", "review_id": "xrGS0nQhl7YoOMJGP8RSKw", "text": "I found a bone in a package of in-store made turkey burgers (the tequila lime ones if it matters). Not cool.", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 1, "date": "2015-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qDPHTcJ6VC2-O-aX6tjvkw", "review_id": "vzvHBlERk3JLbvChIB7M7A", "text": "My husband and I stopped going here, back in 2010, because of the bad service we were receiving. We used to call the servers \"Whole Foods Rejects\"; they were always cranky and we felt not welcomed, rushed. At the end of 2011, I think they got a new manager, the service has been optimal and we haven't stopped going since. Their food is delicious as well as their drinks and coffee.", "business_id": "PzG0XmAmtXFs6Fdnubf41g", "stars": 5, "date": "2012-04-04", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "jwKgiDjVEC8DPjG5NTGllg", "review_id": "hlcwrvYa4eMs6PHAGiCz0Q", "text": "Spices, spices, spices! Best deal in town when you run out of something and don't want to pay $7 for another bottle of parsley at Giant Eagle. I also appreciate the affordable selection of local milk products, eggs, bread (Allegro Hearth, yum!) , and honey. One gripe - salad mix, it's 4.99 a bag! You can get the same salad mix at TJ's for 1.99, 2.99 if you want organic. And currently most of the produce is shipped from other states/countries. I don't know if that will change as summer rolls but more local would be great.", "business_id": "-iVcmhjfq79QoTWzrb6pKg", "stars": 4, "date": "2010-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "yid7st--ROgFLJaBg_Y0Iw", "review_id": "oVyeFQoP-c5InmKUKmindg", "text": "The co-op is an invaluable resource for Pittsburgh. \n\nFirst of all, the selection is fantastic. No matter what kind of health-conscious diet you follow from vegan to paleo - they've got what you need. My favorite items here that you can't really find many other places are raw milk (legal in PA, woo!) and the local meats. The prices on the meat here are higher than most butchers in the area, but on par with the lesser quality meats at Whole Foods - choose your co-op!\n\nI seldom find the produce prices to be ridiculously high. For example, I recently purchased mushrooms at $1.99 per lb. and strawberries for $2.50 per lb., which seem to be two of the more expensive items at any given store. Their sales are worth planning a shopping trip around.\n\nWhen I followed a plant-based diet, the bulk section was my holy grail. For grains, flours, nuts, and seeds, they have a wide variety of unique products. I also love that you can fill a jar and buy it right at the store - most other bulk sections in the 'Burgh don't have this.\n\nAll in all, I like being able to go into a store and not have to sift through the produce to see if it's what I want (organic, local) because it all is! Naturally, they do sell tropical fruits and things that simply do not grow here, but everything is very clearly labeled in its origin and growing method.\n\nThe employees are always friendly and helpful as well. The only terrible thing about this place is the fact that there is almost NEVER parking - I've parked in the lot maybe  ten times out of the ~40 or so times that I've shopped here. I don't mind the walk down, but with heavy bags in my hand, the walk up the street can be tough!", "business_id": "-iVcmhjfq79QoTWzrb6pKg", "stars": 5, "date": "2015-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LiVXtHxGX6TjNHsBWeb9KA", "review_id": "R5xbEve3UY9ktXIOQZrlCg", "text": "The soft serve here is very tasty. They do the chocolate chip cookie sundaes really well. They also pack in the flavor in the birthday cake soft serve. It is always very busy despite a run down makeshift parking area, not much curb appeal, and being cash only.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2015-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "9Ify25DK87s5_u2EhK0_Rg", "review_id": "Kaf1SWzLbJYf5J9ff0PnYg", "text": "I stopped in after breakfast at The Dor-Stop to see what they had to offer.  Potomac has yummy pastries at a good price.  That's pretty much all I can say.  They have a wide variety of goodies to choose from, something to make everyone happy I'm sure.  It seemed like every time I asked, \"What is that?\" I wouldn't even let the woman behind the counter finish her description before I would reply, \"I'll take one of those.\"  I will definitely return.", "business_id": "WY6FFxpa6ztwDH5OhS6WDw", "stars": 4, "date": "2012-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9h7NeYJBBTNAG-POlWxKNA", "review_id": "drHUoQU-RDKC8ipOG9dnmg", "text": "This store is so gross that I was almost sick! Onions peeled and half-rotten. Squishy garlic. Dirt everywhere. I will NEVER step foot in this place again.", "business_id": "_8xYpVdKMllhuuf4PIvq8w", "stars": 1, "date": "2012-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WkHOXw5c3su-KyMsee5h2Q", "review_id": "j-zauwxIfjmZYPJ6p7pnQw", "text": "Came here for a \"quick\" breakfast on our way from the hotel to Fallingwater, and regretted the decision immensely.\n\nExtremely long lines, and poorly trained staff. As a former employee, I know about staff roles and approximately how long it should take to receive your drink. This staff was not trained at all, and it was clear that they were overwhelmed with the crowd. It took me 32 minutes for me to receive my order (there were 7 customers in front of me), and my order was incorrect. I ordered a small coffee, medium latte, a croissant and a sausage breakfast sandwich. I know that the sausage sandwiches heat up for about 40 seconds in oven, so I can't comprehend why it took so long to get my order. Would never come here again. I also received a WARM cheese danish instead of my croissant. First, the warm, creamy colored goo in the middle is extremely unappetizing, and second, they looked so dejected when I pointed out that I ordered a croissant I almost just left.\n\nDo not recommend.", "business_id": "7ijQJV72aBrEoJCtTBCHxw", "stars": 1, "date": "2014-03-14", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "0xIQG-NrqMx5id6yJpQp8Q", "review_id": "cPA4VIVScb-mUhLvhDRSwg", "text": "The only place where I can get my taco fix while I'm in Pittsburgh?  Legit.  I always get two lengua tacos.  Lengua is Spanish for delicious, so that's why I always get two lenguas because that's double the awesome (lengua is actually Spanish for tongue, but I find lengua makes for some of the best tacos; super savory and always tender).\n\nTake a fresh tortilla, warm it up on the grill, and top it with a pile on the lengua.  Yes, onions, cilantro and a squeeze of a lime wedge would be preferred, but I guess the Pittsburgh market prefers the lettuce tomato with sour cream deal.  The customer is always right.\n\nAt 2/$5, it's a bit pricier than what I'd expect a taco to cost elsewhere, but in Pittsburgh competing with other food vendors in the Strip, it's priced just right.\n\nThey also do chicken, pork and beef tacos as well as burritos ($5 as well), but if you're in the mood for awesome, do yourself a favor and get some LENGUAAAA.", "business_id": "buVALudg30kgkDusqB3yJw", "stars": 5, "date": "2010-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jPTr6db3hnEfECKonpvREA", "review_id": "bFZAtZNcrixhoxZ35dSemQ", "text": "I had a short layover in Pittsburgh and was hoping to get a quality caffeine fix in the morning for my afternoon flight. Nicholas's Coffee Co. was closest to my hotel so I decided to give it a try. \n\nI ordered the 'Coffee of the Day' and they offered me three different roasts. I chose the coconut roast and ordered a chocolate covered macaroon on the side. \nThe coffee was absolutely delicious- a really nice taste and not overly \"coconuty\" - I'm already craving another cup. \nThe macaroon was very rich but paired well with the coffee. \n\nThe atmosphere at Nicholas's is super cute. Very eclectic and quaint- really took you back to a simpler time. \n\nMy only upset was that I was hoping to sit inside and enjoy the vibes. There is no inside seating and it was very cold and rainy outside- so I just had to grab-n-go.", "business_id": "J7I85lTCEGr9-qp6AXPUjQ", "stars": 4, "date": "2015-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "57tPrvg7i2R3QjsxTiY-Xg", "review_id": "VWrLSYsONyFzq-whc1U8sA", "text": "The best place in the strip to get asian ingredients.  I love running in there to pick up some young jack fruit in a can.  They have awesome products and honestly, the clerks were happy to explain what certain things were to me.  I love this place!", "business_id": "lVB0HB2PxC9OTtMcz0wagA", "stars": 5, "date": "2010-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BjO_lUbSavA3C5uyoau03Q", "review_id": "Cb1Osq2EB6PmacFseZ6c-g", "text": "great selection, nice store. Prices are high . I wish there was a courtesy card given for frequent big spenders. \n\nTHey pack t hings up well in summer m onths with ice if needed.\n\nI really wish they had samples because I dont want to buy a $15 bar if I wont like it......\n\n2 times i went there and they had NO hot chocolate...\n\nTOday, Jan 7th I am calling them but no answer to their phones to see if they are open\n\nThe service is most often rude. Owners just are not welcoming", "business_id": "gFT2yXDXJ1qfuGOSfSU5Bw", "stars": 2, "date": "2014-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "59A-ZxUMOgIl2MAnySh-Aw", "review_id": "Wzv0kqXvUIQegYMSCLuEhQ", "text": "A great Mediterranean food store. I was impressed by the quality and low price of the bulk spices. If you're having trouble finding a spice in Pittsburgh, then give this place a shot.\n\nThere were also several trays of Greek desserts. Bot only Were there a couple of expected sweets such as baklava and honey cookies but also chocolate baklava and mixed assortments.\n\nThe store's biggest selection of goods is in deli meats and cheeses. I picked up some hot sausage and found the price per pound to be the lowest in Pittsburgh.\n\nI also liked that the store carries some harder to find goods such as tahini.\n\nStamoolis Bros is certainly worth a stop when shopping int the strip considering their prices and selection.", "business_id": "tyXvO1G2qK3MUfaap30auw", "stars": 4, "date": "2014-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5Owl5siqnImojW2u6Fivig", "review_id": "fbLKj2ptwAmLabwI014b_g", "text": "Penn Mac is such a fun Italian Market.  Their cheese station is fantastic with hundreds of different types of cheese to choose from.  The employees are so knowledgeable and helpful!  Another highlight is the olive bar.  Huge buckets of so many different types of olives to choose from.  They come stuffed with different cheeses, garlic, sundried tomatoes, etc.  tons of other grocery items as well.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2014-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "l_szjd-ken3ma6oHDkTYXg", "review_id": "lX7K8kavFvrEXhNGmJhblA", "text": "I've been in (and worked) at a variety of Starbucks locations, but this may be the best hidden gem of all.\n\nThe location itself was extremely clean. That might seem weird as a focal point but I have been to so many locations with dirty tables and other remnants all over the floor. This place was spic and span, bathroom included!\n\nThe table space area isn't very large but still has a variety of tables to hold a small meeting or work on your laptop.\n\nThe staff was extremely friendly, chatting with regulars and first timers. Overall the space was quiet and the jazzy tracks could be heard. It was a really nice way to start off the day. Even when more folks did arrive, the space never seemed overwhelming or full. I would go out of the way to come back to this location rather than my East Liberty regular because of the great experience.", "business_id": "E_-4Y9vn-u-dPgp33TLRUQ", "stars": 4, "date": "2015-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AEQowxQ8076LsWNirwHTww", "review_id": "_vQdgnQcM9vOy8dFcCv_jA", "text": "If you live in Brookline, look no further, this is your one stop shop for Mediterranean/Middle Eastern quisine. You can eat in or take home some groceries. Iv had their falafel gyro and regular gyro. The falafel one was very good with a healthy dose of both falafel and fresh veggies. The regular gyro fell short of my expectations however, the lamb being mushy and slightly gritty. I plan on trying more items on their menu and possibly grab some groceries, but if you just want a good ol gyro, Sams Sun Sandwich in Carrick or Original Gyro on 88 are better options", "business_id": "gCiKiqPGAC_ZVt5bBcwnrw", "stars": 4, "date": "2015-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bFXCfVe5Ln--JxeV5yoiXQ", "review_id": "veOI0VXWItnAgQ752lj79A", "text": "This place just keeps getting worse and worse.  \n\nI've been in Pgh for a while now and honestly, I can't remember a time when I didn't go to Coffee Tree Roasters on Walnut as my go-to study/sit around/meeting place.  I loved the big garage door, the ambiance, the people watching, the free wifi...etc..etc.  The coffee was good and reasonably priced, with tea at hand if I felt like it.\n\nSince then the quality of the place and service has just plummeted.  Started with the bathrooms...rarely cleaned, rarely working.  Nowadays, if you dare to sit in the back near the bathrooms, the whole area reeks of stale urine or something.  It smells like the bathroom.  Inside, the toilets are leaky, the floors are often COVERED in water (lets hope) and paper...I partially blame the patrons for leaving these in such poor condition, but hey, management, could you possibly, i dunno...clean it?  I've gone a couple times in one day, once in the morning, and once after classes, and the bathrooms look exactly the same.  \n\nThen the service declined.  First they started making the \"you must buy something to get internet.\" That's fine with me.  I always buy something there.  But then they started the 2hr limit...then free 2hrs, but then you have to buy something ELSE on top of whatever you bought initially...etc...etc.  Now half the time the internet doesn't work and no one on staff seems to care or know how to reset it.  They just look at you like you are lying about the internet because, hey, they saw someone using what looked to be the internet about 8hrs ago...or that's what their coworkers told them yesterday.\n\nThen the coffee also became watered down...and went up a smidge in price.  Still cheaper than SBux but its...not as quality anymore.  \n\nI still love it for the giant door into people watching in shadyside and its locale. But otherwise, it could be a lot better...because it USED to be a lot better.", "business_id": "1qUYk564SajvwTtkNM6KJA", "stars": 2, "date": "2011-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_7Lg8iTWpFc0O7PEA8FmbQ", "review_id": "bMrT0Q6VKqmKodqp7jZv8w", "text": "I am not sure what makes a perfect bagel but after eating at Bagel Factory I am pretty sure I am darn well close to it. Don't let the drab decor of the store fool you. Bagel Factory churns out delicious perfections of bakery like no one's business and we were told that the Penguins get their bagels from here too so we know we are in the right place. I've ordered the lox sandwich, and egg ham and cheese sandwich - both on everything bagels. The lox I think is my favorite and I'd love to come back to try a Cinnamon one. Soft and fluffy with a bit of crunch. Watch out, you'll find this tasty bit gone within seconds.", "business_id": "LHyGQnuWR2q44bsrw1ZLAg", "stars": 4, "date": "2012-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "hwl6h_fYrCWqNSQsw8wgwA", "review_id": "NH8LAxvF6dq4OuUmQmtY9Q", "text": "Nope. Sorry, I grew up in pgh. Heart of a true pittsburgher. But my gosh. One word for prantl's: crisco. Seriously, my arteries hurt after eating a desert from this place. Not half as good as a few of the French etc bakeries around. Why waste your cardiovascular health on this place--go get gelato next door and you'll be better off!", "business_id": "yWVY1Bq19lDxu3BP7_96EQ", "stars": 2, "date": "2014-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jd5yWDLRt5NnwTZdPRAnuQ", "review_id": "oKORf4SGYWZXaSZZqEqYxw", "text": "Quiet little spot at the end of Walnut street and my fav spot for doing a little work!\n\nI always get the same order of a cup of coffee, but all the other drink options look yummy as well!  They also have a good assortment of baked goods and ice cream!!  And in my opinion, their coffee is better than Crazy Mocha or Coffee Tree.\n\nThe space is bright and clean and the baristas are also really friendly.", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 4, "date": "2014-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "x1tqIO9G1RX3qd6Y4TsHXg", "review_id": "CyHZeBlpohuiQNFC4BSH5w", "text": "Wow. I just recently learned of this store from a good friend, and must say I have no idea why I hadn't heard of it before! I love asian food, and have been looking for the ideal market to stock up with things you just can't get from Whole Foods and Giant Eagle.\n\nThe quality of the items here is unmistakably superior. I love the fresh shiso leaves that I can get here; I love the wide variety of japanese mushrooms and produce they stock! Because of this market, I have been able to delve deeper into the wonderful world of the Japanese one pot meal I so love, and have been busily trying new recipes over the past several months. \n\nI haven't yet purchased their sushi grade fish, but it certainly looked fresh and I will certainly buy it from their market the next time I feel adventurous enough to make sushi at home...\n\nMy wife says I am addicted to having a lot of obscure Japanese condiments around the house, and after looking in the refrigerator the last time we visited Tokyo Japanese Food Store, I absolutely agree - Arigato gozaimasu!", "business_id": "GRrvJchtxskNDsGYUPPzzg", "stars": 5, "date": "2013-04-08", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "2VqU7uoDeiE8OUL14Ce5Ig", "review_id": "ZhjoPQHucIqRKqIFPtCotw", "text": "Good luck getting out\nWith your soul and belongings.\nBring your own flashlight.\n\n\n(b)", "business_id": "TIPebazlAGJsp8zAwhNkcw", "stars": 2, "date": "2011-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GnV8MNKEhHVl27bMVUuQTA", "review_id": "Bud9sfhONLIDhWsM61FE8w", "text": "Oh, Market District. I suppose you are designed to help me get completely lost and wind up buying way more than I *actually* need, but I can't even fault you for that. You are lovely and sell my favorite local meats, and you're just a short drive from the city.\n\nThis Market District has a nice, spacious parking lot (unlike its even-closer-to-the-city counterpart in Shadyside). It's on a bus line as well.\n\nThe produce department is well-stocked with lots of fresh goodies (and some pretty awesome sales from time to time - BOGO cauliflower? heck yes!). They have a charcuterie section that carries meat from Parma Sausage in the Strip District, as well as some other specialty meats from the Piggery in New York.\n\nBe sure to check out their huge flavored popcorn section. You don't have to wait for that boy scout popcorn sale at Christmas; you can get a ton of awesome flavors here (pizza! pizza flavored popcorn!) in ginormous tubs all year. \n\nI swear they make the best chocolate chip cookies of any of the Giant Eagles I shop at. So soft and chocolatey.\n\nI like the variety of local and/or antibiotic-free meats that they carry here, and I'm a big fan of the way they are being more eco-conscious with their enclosed cold dairy section.\n\nBasically, this Giant Eagle is the answer to the question of, 'Where can I go close to the city and get fresher, healthier food while still earning FuelPerks?' \n\nEven though I do have this real problem of wandering the aisles and coming home with way more than what's on my list... Have to work on that!", "business_id": "AK8T92URfkOUoTAVd7l2EA", "stars": 4, "date": "2015-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HtVM3apww5i5x5KRcOlL4Q", "review_id": "poV2-2b0SX6VxvRAR4OcBQ", "text": "We went to Hatoya when we stayed in NC for a weekend.  I wish we lived there so I can go there so often.  I enjoyed books, some Japanese food I can't find...  It is too bad I couldn't try frozen food!!!!", "business_id": "fzpRf9YEyoSYM4MMpiFUbg", "stars": 5, "date": "2015-03-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "-3akdU5UTDn6dwiTCO2cAw", "review_id": "S8uoyVbUqMPnfgYfLvO6LQ", "text": "I live directly above the Goat Wagon so this store is sometimes a God send for myself. There have been so many times that I have been cooking dinner or have friends over and I realize I'm out of milk (or beer) and run downstairs to grab what I need. \n\nThe staff is nice and they chat it up with you if you come in often. The prices are very high but it's a convenience store so it's not entirely a shock. The peeps that live or work nearby keep the store in business and there is sometimes an interesting crowd that gathers outside but if you're in need of a particular item or a frozen pizza for the night and don't feel like walking to The Teeter on 6th St., the Goat Wagon will do just fine. \n\nBonus: Pajamas are not unusual to be seen here, which is always a plus in my book. I wish I could go everywhere in my PJ's!", "business_id": "CC9ttbNktyxl9tRHkUG30w", "stars": 3, "date": "2012-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9gC7uwBVHsdJi1aLiLTASA", "review_id": "Gqmg-rObNaxG2JCMlBbKkg", "text": "OUT OF BUSINESS.  Ben & Jerry's next door is selling Coffeeworks coffee, as of feb. 2011.", "business_id": "2ZQ3EzJVjPkVCk4HLwKIag", "stars": 3, "date": "2011-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "4syyQ5wJW3BYZn7U3uPS1Q", "review_id": "QYp9gZe-ov_12YCTqX3jsA", "text": "This place is expensive.  Really expensive.  Expect everything thing here to be \"boutique\" quality and that means you're going to pay out the nose.  $80/lb of chocolate.  $12 snacks.  $6 coffee.\n\nNow if you ignore price, it's a nice place.  Its sanitation rating was not nearly as high as I thought an upscale place would be (92) and it was a little bit less organized than I imagined, I guess to maintain that \"boutique\" feel.\n\nIt's also one of the only places that you can buy Christopher Elbow chocolates in North Carolina.", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 2, "date": "2012-04-07", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "aTzw3Sww1F_-GOIk3-cp0Q", "review_id": "8bN_DImJFrJkKKSicD9KVQ", "text": "The best goat roti in Charlotte!", "business_id": "90ZdW5Hq-QHKFxLsO3T5FA", "stars": 4, "date": "2013-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4G68oLRY3aHE5XUt_MUUcA", "review_id": "tMU-QS8k_-6Rl9ZpRCnHSw", "text": "Ice cream was very good... have some interesting mix-ins to choose from.  I decided to go with the Cheesecake Break and I was not disappointed.  I think the teddy graham mix-in is what put this flavor combo off the charts.\n\nWhen we originally came into the store, no one was there to greet us, but a nice young lady came out and fixed our ice cream for us.  She was pretty meticulous with the mix-ins and did a good job.", "business_id": "IQbEYPh7OKoUmsI6VoLmTw", "stars": 4, "date": "2011-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XkwLiwXQ8ruxr_uAqo1m2g", "review_id": "dBjrd3fCrg4lLkGfv42PKA", "text": "I've only visited the Wine Vault once, but if you're looking for a laid-back first date type of place, this will work just fine. Their bottles are reasonably priced and they also have wines by the glass, cushy lounge areas, and lots of other seating, including a patio that I'm sure will be hoppin' in the spring and summer. \n\nOnly gripe is their lack of decent cheese/cracker/bread selection, which they substitute with sub par packaged cheeses (I understand that they have no kitchen, but their wine quality and snack quality are terribly disparate,) and low end crackers and there is no bread (that I saw.) \nI'll definitely give it another chance sometime. Hopefully they'll work on their snacks and cheeses! It wouldn't be too hard!", "business_id": "1wIKHSHPOkywuOkyrXt6dw", "stars": 3, "date": "2011-03-09", "type": "review"}
{"votes": {"funny": 4, "useful": 4, "cool": 4}, "user_id": "VhI6xyylcAxi0wOy2HOX3w", "review_id": "iZTflRx-cj6ZRv3zpP9fog", "text": "With the out-of-town supermarket opened next door, this Teeter hasn't needed to step up its game by much to stay clean, bright and relevant. This is a busy market area with those folks and the \"red circle\" people on the other corner, so the competition is rather fierce.\n\nLots of beer coolers, a really good wine section, top notch produce, excellent butcher and fish counter. The shelves are well stocked, the shopping carts all have working wheels. What's not to love?\n\nAnd speaking of love, the pharmacy here is excellent. There's something awesome when they remember your name.", "business_id": "yP20Y-TVGZ2sUNGGLzJ5Fg", "stars": 4, "date": "2015-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "U587ohfK7ts_WSqonURFQg", "review_id": "cgKmCqhn88tFC377RxRsNA", "text": "I have a dream that one day I will be able to purchase hard liquor without jumping through hoops in the Carolinas. Until that day comes, however, and the purchase of hard liquor must be made into a separate event and not just part of normal grocery shopping Frugal's the best place to go. \n\nThe warehouse can be confusing the first time (and possibly subsequent times) you visit because of the plethora of \"just across the border\" vendors. Fireworks! Gas! Carowinds! Liquor! There are turn offs for each of these South Carolina attractions and Frugal's is located a little back off the road. One you get there, you won't be disappointed. There are two sections to the store the left is for hard liquor and the right is for your wine and beer options. I have never been impressed with the selection or price of their softer alcohol choices (Total Wine is much better!) so I only come here for the hard liquor. \n\nThe selection at Frugal's is almost daunting with a variety of brands for your chosen poison. The aisles are big enough for the carts to pass through (I have not actually taken advantage of the carts offered yet), and they have liquor tastings on Fridays and Saturdays (I have taken advantage of those). The staff is very knowledgeable and actually helpful. I get the feeling at ABC stores that I am under high suspicion if I just want to browse, but I have never had that at Frugal's.  \n\nThe best part about this emporium is the price. I always use my debit card to get a further discount, and come out surprised at how much I have vs. spent. My dad's favorite bourbon is at least $15 cheaper here than it is at the ABC store and if you add it up counting Father's Day, birthday and Christmas Frugal's has already saved me a tidy sum of money.", "business_id": "2-M1_ok4NZ-fSF6SbBsp1A", "stars": 5, "date": "2015-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "TAOoRCZFOyySXWfOSaLQiQ", "review_id": "uROFUFmlLHir_xBFksjgmQ", "text": "After reading the last few reviews, I had pretty low expectations for my lunch at Prairie Cafe & Bakery. I assumed I would have to wait a long time for my food and it would be just okay. I was pleasantly surprised. Our food came relatively quickly, and my husband and I both enjoyed our sandwiches.  I had a CBLT which was excellent. The bread was perfect, and I loved fresh ingredients and the special mayo. My husband really liked the special of the day, which was  a tuna melt.  My bean and corn side salad was very fresh tasting, but could have used a tad more flavor. We also had a key lime coconut cookie that was AMAZING. I might have to go back next week just to get another one!!  The servers weren't overly friendly, but they definitely weren't UN-friendly. My only true \"complaint\" is that it is a bit pricy for what you get - it was almost $30 for our lunch of two sandwiches, two drinks, a cookie and a kid's meal- at least the kid's meal included the drink!  I will definitely be back to the Prairie Cafe! Don't let the other negative reviews scare you away! The sandwiches are definitely worth it! :)", "business_id": "ShEYKerTwb2LSORE5o_s7A", "stars": 4, "date": "2014-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ln9SgBsnvl0sWbGpqw616w", "review_id": "xlasK5X1ySSs-pnhMWiujg", "text": "Love this place!! Whenever I am in \nMiddleton, I eat breakfast or lunch here. Home cooking!! Friendly staff! Fresh baked goods.", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 5, "date": "2015-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "A-ccUjBax3iyiBOykZFvTw", "review_id": "9CB62mCajxZmgqtL9jOx-Q", "text": "We've always enjoyed the Mousehouse.  We don't visit as much since we don't drive that way anymore, but that's okay as their prices are a little higher than any of the cheese coops you can visit off the interstate.", "business_id": "jpxlSFhdrtbNyxS6vB036A", "stars": 4, "date": "2013-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "cnHVkfu_oOdAiZsZfZoYQA", "text": "Again... not a fan of Copps, in general. This one seems a bit older and a bit more in need of a facelift, but it's not bad. Wide aisles, plenty of check outs, and decent produce. \n\nPrices are typically higher than Woodman's, but Copps allows the use of credit cards (or using your debit card as a credit card, which I do because my bank gives me 5% cashback when I do).\n\nBakery items are usually stellar - especially the chocolate donuts. ;-)", "business_id": "ZjwZIQM4TfFO7T7ck7FtYQ", "stars": 3, "date": "2014-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Dzc2m6O4vaXCF4ztKPjTcQ", "review_id": "iBtJEYn2hEKPhH4Y1SPmmw", "text": "Updated review,\nI have to give them more stars. For one they have pretty tasty food once I tried more dishes.  The cucumber sauce on the side also really good.  It has also become my stop for mousaka! Mmmm", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2011-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "GIe3fZlWKtnPXTaGqmwl-A", "review_id": "kNFjjlRgpy8rs3o19GkT-A", "text": "Didn't Michael's used to be good?\n\nI remember going to the Michael's in Verona, years ago when I was still in high school.  There was nothing better than gorging on malts and burgers on Friday nights in the summer.  I remember them being glorious, greasy shrines to all that is good and pure in the world.\n\nI hadn't been to a Michael's in years--partially because I had moved out of the area for some time, and partially because there are none in close proximity to my home.  However, the other day I happened to be near the Atwood Ave. one at lunch time and figured I'd go for the nostalgia and try to relive my youth for a few paltry seconds.\n\nTo say I'm disappointed is an understatement.  \n\nFirst, the place was nearly empty at 11:30am.  There was one other couple eating when I went in, but even the drive-thru was quiet.  That should have been my first warning.  I ordered a bacon cheeseburger and fries.  It took a reasonable amount of time for the burger to get to me, but it was seriously lackluster.  It was a cheap, thin, frozen patty and some wilted lettuce and a bland tomato.  The bacon was okay, but there wasn't enough of it.  The cheese was some processed crap.  The fries were equally frozen pieces of bland, tasteless crap.\n\nAfter my first bite, I wondered if I could ask for my money back.  It was so far from what I remembered from my teenage years that it continuing to eat the burger was essentially throwing my happy memories into the toilet.\n\nI hate to make a fuss, so I didn't.  I powered through and finished.  \n\nI know why Culver's is the tried-and-true home for decent burgers and malts.  Unless something changes, I think I'm done with Michael's.", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q", "stars": 1, "date": "2015-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j0mqCBlZemMaYw7tsDQ3dA", "review_id": "5nnq-i9a59XSYzy5psWgJQ", "text": "Slightly weird smell when you walk. This isn't Jenny Street Market in terms of quality products, but the staff are friendly and they have a good variety of products. It is easy in and out, which makes it worth the stop.", "business_id": "LWmlH8MwUnwMWN5Ma8utnQ", "stars": 4, "date": "2013-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GKci9s_NDb2rO6frxyjpBw", "review_id": "tg0b5FpZjEAKBfc3IvXKHQ", "text": "very fresh food. and the self checkout is good since the machine is sensitive.  the strawberry I bought is very good and cheap.", "business_id": "1S07OVrtlA53CACci5jWgQ", "stars": 4, "date": "2015-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7zSppEZd2C6ASpNeBebxAA", "review_id": "BQrgJ-TfiNmQnBDHpDrK5g", "text": "I am proud to call myself an owner. I'm here on a regular basis picking up staples and having lunch at the soup bar. Their bulk section is well-stocked and the selection of local produce is impressive. \n\nI am thrilled for the expansion in the fall!", "business_id": "Q9eZS4qDdJo1ker0w3wnMg", "stars": 5, "date": "2012-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tw3PFgey15p0ruFRVoFidw", "review_id": "iiz5utMEBzuSYcXRdTD31Q", "text": "Because of a yucky spoiled-produce experience at Am-Ko, I have to say that Far East wins.  Of course, they're not exactly close competitors, as their stock reflects differing ethnic focuses (Korean versus Vietnamese & Chinese, as far a I could tell?). \n\nWe found a few fun packages goods, but what we were really looking for - Taro pancake mix - was, sadly, missing.  I asked an employee just to double-check, and got a mostly incomprehensible jumble of broken English which basically amounted to \"I've never seen that before, and you won't find it anywhere in town - or Chicago for that matter.\"  If you've never seen it before, how exactly are you so confident that I won't find it anywhere between Chambana and Chicago?  Interesting approach. \n\nBeing a long-time west-coaster, I'm spoiled by the Asian groceries in my area. But this spot does ok.", "business_id": "BnHVssX00VthoSNsMVO51g", "stars": 3, "date": "2011-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DGbWhr0hm-joggx9G3s6yw", "review_id": "oA1HByzldiYWufEyNspmHQ", "text": "The cafe is totally worth a visit. Though the drinks itself are nothing to die for, the atmosphere is what makes the place worth the trek. I live locally and often go to Kopi to study for tests. The cafe is warm and inviting, and any studying student will be in great company. Just watch your timing! During finals time, you will be hard pressed to find a seat.", "business_id": "yzInxReAkf7r0aRbwj02Yw", "stars": 4, "date": "2015-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "AFK20uwV5Kr-f8at2_BV8Q", "review_id": "Vawlj9k4423pRWaTR-F7uQ", "text": "THE place to go for ice cream/custard/sundaes.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2006-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5IXVukYhb27a-HoBbalLhg", "review_id": "i005wfStY4nlCU98VbbRvg", "text": "Came here per friends' recommendation since I was on a business trip in Decatur, which is 30 min away from Champaign. I had my doubts at first because who would have thought any food could would be this good in a small college town. Boy was I in for a treat. \n\nStrawberry shortcake snowstorm was my choice based on my friend's yelp review and it was AMAZING. The portion for was quite large for a small cup too. DEFINITELY going to come back again in my future trips.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2010-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HcxWWLD3ejPWVAMBzuCoig", "review_id": "gGsQBD14frZUMJanCfnnVQ", "text": "The only negative thing i have to say about this place is that the lines are confusing and i had no idea if i need to stand in a particular line based off what i wanted to order or if i could just jump in wherever.\n\nThat being said, this place is awesome and very fairly priced. To say they have a shit ton of options would be something like saying The Beatles had a few fans. \n\nI will definitely be back here if i am ever passing through the Champaign region. \n\nGet out there, check it and yelp it!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2014-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "66tWp8ThwPATFUxYNPyYLw", "review_id": "EaSA5CX8NQVtKkgxynLfiQ", "text": "My mom and I stopped in here on a whim on a Friday afternoon.  We really weren't looking for the afternoon tea experience, but wanted just a light snack.  We were charmed by the historic Victorian home, and thought the décor was right in line with the era.  Now, if you don't like fussy, doily type settings (think Grandmas and old British ladies) you probably won't like this.  I felt like I should be wearing gloves - or a least be dressed like June Cleaver.  \n\nWe settled on a small garden salad and a scone each.  We tried two different scones, and split them.  They were both really, really good, but we both preferred the Sun Dried Tomato one to the sweeter Cranberry.  \nThe salads were prefect - lots of fresh veggies, good greens and a perfect vinaigrette served on the side.    Oddly enough, we didn't try any tea, but stuck with water.  The portions were delectate, but not too small, and they were priced right.  \n\nThe server was friendly and attentive, without hovering, which is always a bonus to me.  We want to come back for an actual tea service - we didn't have time the day we went in but would love to plan a girls day out.  Apparently they also have Jazz in the evenings.", "business_id": "gBcpDl0quCLABsg5OuSFww", "stars": 4, "date": "2009-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vggE8kitLHHhWeM7ZPdzpg", "review_id": "5bvsQYdumy9ZVngtZWF4rg", "text": "I agree with all these posts.  cheap, colorful, huge menu, good horchata, tres leches cake at the panaderia....\n\nNot much more has to be emphasized, however, one reccommendation: get the ELOTE along with whatever you decide to get.  Its corn on a stick covered in mayo and queso- delicioso.  if you really want a treat, squirt ketchup all over it too.  mmmm market foooood", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2009-03-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "1a6TG-gBusSINawe-YsIuQ", "review_id": "bNKpKqzqyERVv2SIfj1yEg", "text": "La Tolteca is Restaurant/Bakery/Market and sells the best authentic Mexican food I've ever had in the states.  The atmosphere is fast paced/to-go style and there isn't a thing on the menu that isn't to die for!  No need to get dressed up, just sit back, get messy, and enjoy!", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2012-04-16", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "yt6vljLIffAU4WW0-TQwBw", "review_id": "j33cF5btG_momEkjPd0bPg", "text": "So I visited this unique market after reading some of the glowing reviews from other Yelpers and I must say the Phoenix Ranch Market is awesome. Like any good market the wide variety and abundance of fresh food at PRM makes shopping at the old chain store a boring old chore. The operative words here are fun, vibrant, and cheap. I went on a Sunday so I kicked it off with a steaming bowl of menudo, a beef tripe soup with a ton of garnishes so you can personalize your bowl. After I finished I wandered around filling up on fresh tortillas, dried and fresh chiles(my mole can beat up your mole anyday), my eyes were agog as I absorbed the sight sounds and smells of the bustling market. My favorite area was the meat counter where patrons bickered with the butcher over the best cuts and a peeled cows head stared blankly at me.  I swear I saw that thing blink at me.  Anyway a great place to visit if your in the mood for a tongue torta and some mariachi music.", "business_id": "VXIkI9_EbDbYHeO9IzKjJg", "stars": 4, "date": "2008-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "kRH3HttbiNoD-BgomNVVtA", "review_id": "4lktuM0JrMJ1yRU3rWHJbw", "text": "This place was uber cool. I grew up 10 mins from the Mexican border so I was fortunate to grow up with authentic Mexican food- from restaurants and taco stands to my friends Nana making homemade tortillas and rice and beans and well, everything. \n\nWe were in the mood for carne asada tacos to grill at home and decided to buy some meat here instead of food city or the carneceria up the street. I heard about the hype and great reviews but never got around to checking it out. \n\nThis place rocks! 100% authentic and has everything I need to make virtually any Mexican dish I can remember. \n\nThe place is so cool. I can't get over it. Bakery, deli, tortilla factory, cheeses, meats, seafood, veggies, spices and candy. It has it all. It's pretty much the Mexican version of Lee Lee's, only cooler looking and more fun. \n\nCheck it out.", "business_id": "VXIkI9_EbDbYHeO9IzKjJg", "stars": 5, "date": "2011-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pVRiM1yhIaXDrIkwiKaGCg", "review_id": "Y4HwNfLYI30KL34p3w00kg", "text": "Doughnuts are bomb. \nCoffee is weak, so deal with it and get a large.  \nNext to the doughnuts are instant rame cups and assorted treats that somehow someone must buy.\nWhile having coffee a street character rolled up on a bike and had some serious street survival gear, backpack loaded and 3 shopping bags with extra clothes in them attached around his waist to his belt. And HE bought 2 old fashions. \nThe workers sound like \"Tammy\" from the nail salon comedy bit. \nThey sell Oreo cookies by the roll they just took out of the box, no packaged for re-sale here. \nOk now Tammy is speaking good broken Spanish. \nMan I Iike it here, you won't get that \"mas puto!\" vibe you get at Starbucks or Fair Trade when your lady drags you into places like that.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2011-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TLjVeQYCu5scCBgaHdex8w", "review_id": "EiVFE-JMZj7I5vpwBJCPxA", "text": "We had the happy  opportunity to eat at this Coco's restaurant yesterday. It was in-between time (about 4 p.m.) and we had the restaurant to ourselves. The waiter was terrific, the manager was great, the food was hot and marvelous. We both ordered their spaghetti and meat sauce and we shared a piece of coconut pie (they have the best pie in town). We highly recommend this restaurant for family-style food, great for you to take your kids, neighborhood friendly. They need the support of the neighborhood to stay in business, and it would be great if you would try them out and have a piece of their terrific pie!", "business_id": "SZvYxcvYYVRue9MXcEDjsA", "stars": 5, "date": "2015-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "l53FUDHRHLg7BQ89KgAtxQ", "review_id": "dPMiRYh9sjUm5rEqRg3OgA", "text": "Yea, I've spent too much time here.  But it was all time well spent.  I worked right in the area for years so there were many Costco Lunches, and I have to say - it alone was worth my membership.  BUT - I bought SO much more of course!  \n\nWhile this is actually one of the smaller Costco locations, they hold their own in maintaining a good variety of regular stock and keeping some good \"limited time offer\" products going too.  Heck, I bought my pool table during one of those - and I've still never found a deal anywhere near that price.  This is totally our default location for Hams and Turkeys for the holidays.  We tried to get it all at Fry's last year and I'm telling you there was a huge difference in the quality!! \n\nThe biggest bonus here is how this shopping plaza provides such one stop shopping.  Fry's on one side, Target in the middle, Costco - with a newly added gas station - on the other side.  If you need it - it's most likely here.", "business_id": "XLqnjlLYt0_q_NG7l_BpMA", "stars": 5, "date": "2007-03-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pQ6ij6cOBRB3yJGHbVZHUQ", "review_id": "OrGM7acSxAvNSwJpLPPgnQ", "text": "Great employees with excellent customer service. You pay more here obviously, but to me its worth it. They have REAL butchers as opposed to most of the chains that employee meat \"processors\", most of the time meaning they could not identify a tri-tip or flat meat cut if their life depended on it. AJs has a good selection of a wide variety of international foods. My main reason for this trip was DARK or BLACK Sesame oil. Check!", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 4, "date": "2013-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S_aYQ4f1rmcEagPMMhpcdg", "review_id": "tOVePbMO8i0_3wyzpuPoFQ", "text": "I can't help but order the Doughboy every time I'm at Cheese. Mmmm my fave! Yeah, they use an avocado spread rather than the real thing, but that's just the way it's made. It makes it all gooey and delicious. I like to add a sarsaparilla or iced tea, along with a tiny mac salad or potato salad side. It really doesn't get any better. (The Long Tall Texan is another family fave.)\n\nThe space is a blast from the past -- humble beginnings with personal family touches. The family owned and operated shop is clean and always welcoming. The clientele ranges from blue collared to white collared, high school kids to grandpas. You really can't get any local than this, people!\n\nEvery time I'm in the neighborhood, I have to stop in for lunch...or breakfast (tasty breakfast egg sandwiches). Cheese 'N Stuff is a real treat and never disappoints.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 4, "date": "2010-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vT9-huIZEK00oLTfUeT1_Q", "review_id": "LIDnPGoArzCD0lCE6btbgw", "text": "Allison at this Jamba Juice is awesome! Terrific smoothies every time, spot on. I usually go for the \"greens smoothies\" Pleasantly surprised that they were open at 7 am on Memorial Day, healthy breakfast before driving to Sedona :) thank you Allison", "business_id": "a5N-FJqNPOmhoTV5JkQrww", "stars": 5, "date": "2015-05-26", "type": "review"}
{"votes": {"funny": 4, "useful": 6, "cool": 7}, "user_id": "E5QyEU6FCQwnTys0S73zNw", "review_id": "AzTNo-j1FzQ1Ky7lQyXw1w", "text": "i haven't been here since it was called Sonora, not much has changed. the food is pretty decent. i no longer drink alcohol so i got the rootbeer. it's pretty good. i actually like Stevia, and was happier knowing there was no sugar or HFCS\n\ni actually like the fact a restaurant is trying to get away from HFCS. kudos.\n\ni tried the Buffalo, i kinda thought it was a burger...but only because i wasn't really paying attention.  but it was tasty, 3 basted chicken strips on a roll with lettuce and tomato and nasty red onion...no...not saying their red onion was nasty..i just don't like red onion on sandwiches.. sorry. \n\nanyways..they added Sweet Potato fries to the menu and they were pretty good. they crinkle cut them..i think it adds more to the experience.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 3, "date": "2010-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "o8J-ergbGYjrUy85I_rxzw", "review_id": "wBiDJHgErsK960238t5SKw", "text": "I'm not a huge beer drinker so this review is mostly based on their food. I did try a sample of the vanilla porter which was more chocolate and crème than vanilla but I could see it going really well with some cake or brownies after dinner.\n\nHowever, I was here for a late lunch/early dinner so I opted for the turkey sandwich with their mac n' ale cheese side. The sandwich was a lot smaller than I was expecting for the price ($8.50 for a small sandwich and side). The turkey and spinach leaves were really fresh and the roll was lightly toasted and not dry, but the cranberry mayo didn't have a very strong flavour. It would have been better with actual whole cranberry sauce and then mayo separate. The sandwich was good but I was very disappointed with the size. The mac n' cheese was very good and cheesy but it wasn't very noteworthy - it was basically high quality Velveeta cheese a slight beer-esque tang to it, topped with parmigiana. I tried a bit of my friend's parmigiana fries and those were decent but, again, nothing special - just fries with parmigiana on top. \nService was fast (though the place was pretty empty) and friendly. They also had a few different ciders in bottles available which I wasn't expecting (I'm a HUGE cider fan), so that was a nice plus.\n\nMain point: I like going to breweries because they usually incorporate beer into a lot of their dishes. SunUp's beer-battered shrimp (again, what the friend ordered) and ale-infused cheese is an example but where are the beer-battered fries or soft beer bread or other delicacies you can find on Four Peaks' (for example) menu? What do you have on offer to draw in non-beer drinkers to your establishment? I think it's an important question when a brewery decides to also be a restaurant and one I'm not sure SunUp really thought about.\n\nI would come here again to sample more of the beer and for dessert or a Happy Hour-priced appetizer but not for lunch or dinner again.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 3, "date": "2012-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iA-TOq1ena9kA47hY1qorw", "review_id": "rGtYpTVuSRZaqBCraXCECA", "text": "Best brewery I've been to in the United States! I like the fact that there was a wide variety of beer. Something for everybody. But it was also some of the best beer", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 5, "date": "2014-04-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GIcnw0ZhMuax96er2ZW8pg", "review_id": "24Kc2lfNQPzMjMiZARWeeA", "text": "Food was regular bar food, the beer was ok.  Omg but the wait staff, yeah that's what we did, WAIT.  Had to call them over to take our order, bring drinks and our bill.  All of this with only 6 people in the restaurant and 4 wait staff.  Will give them one more chance.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 2, "date": "2015-05-17", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 0}, "user_id": "cH1lLTHReO6uDTif9bfOBA", "review_id": "VgFCUViQfGaShsXbq1bH2Q", "text": "This bakery is hidden in the corner of a strip mall.  When I went in, there was a guy behind the counter.  I was expecting the usual \"hi\" but he never opened his mouth....he just stared at me.  Then, 4,5 guys came out from the back just to stand there.  It was REALLY UNCOMFORTABLE....  Then a lady came out.  I don't know, I felt like I had to greet her since she stood right in front of me so I said \"hi.\"  Can you guess what she did?  She just stared at me.  \n\nIt had only been around 2 or 3 min since I went in but honestly, I just couldn't wait to get out of there.  So, I purchased 5 pastries and got out.  The pastries were....ok.  I mean it wasn't bad but nothing special.  Would I go back there....NO.  \n\n*Food = ok, nothing special at all\n*Service = uncomfortable, a little intimidating\n*Location = ok\n*Price = ok", "business_id": "vaqmESluryt5i4Wbkb6KRA", "stars": 2, "date": "2009-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "bCxB-hgOn8ForK1VTIyEFQ", "review_id": "5aoXSADD3_7ClleKffpq4Q", "text": "Being from the Midwest, I thought we had some good sausage makers.  But Schreiner's takes a back seat to no one.  When looking thru several local menus, I noticed that many items noted that their sausages came from Schreiner's so I looked them up and stopped by.\n\nWe've been back for reorders since.  Wow, are their sausages wonderful.  It's hard to name a favorite.  They do Brats better than my favorite Milwaukee place.  My wife loves their Sicilian sausages and we both can't get enough of their sweet Italian sausages.\n\nAnd that's just the tip of their selections.  I highly recommend a trip to their storefront for the sausage lovers among you.", "business_id": "XRBTHOXaJK_AJ2wy5mX_1A", "stars": 5, "date": "2013-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bmzq_nkjYqp8aWn12RJdhA", "review_id": "MSwJQclEUFZ3xFzlsxTIjw", "text": "3rd week of course 1 complete. Next week is the last week. Today we did a bit more on roses/flowers, made a clown, and did some icing techniques. Lastly, we worked on decorating cakes we brought in. I've been progressively getting better. Pictures and all that on my website. \n\nhttp://www.carmeloricarde.com/blog \n\nI can't wait until next week and to sign up for more classes.", "business_id": "XAaXT0e70-USVYVKcnljsg", "stars": 5, "date": "2010-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NjcHcAq5iT-7B-Ka_WLKgg", "review_id": "4zFcO7WiWD3UuxVWTcYE9A", "text": "Delish!!! Their sticky buns are really good and they have a yummy assortment of baked goods.", "business_id": "Tr3EsurgHqGPTXwAfjZ04Q", "stars": 4, "date": "2012-05-04", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "2KyJLMY3jmASmwtnmlBuvw", "review_id": "IRngNZGJO3Bv216SxSlgsA", "text": "Terrific value AND friendly helpful people!\n\nFirst, I went to Ikea because a friend had *exactly* the piece of furniture I needed and he got his from Ikea.   After wandering around the store forever, I finally found the right department.\n\nThe people working at Ikea were cold. uncaring. not helpful. no concept of customer service.  I left in disgust!\n\nCouple of days later, I was in Cost Plus World Market @ 18th St. & Camelback.  Voila!  I fould what I wanted - for close to the same price.  the BIG difference:  Warm smiles, friendly people, volunteered to go out of their way to help me.  Felt like I was among long-time friends!  They even delivered when they said they would.\n\nAnd, no need to drive half way to tucson and back!\n\nIkea?  Don't be foolish.  Cost Plus?  Now, there's a place that earned my repeat business!", "business_id": "u8bQvtkVa5lW-SNwRLH6Vg", "stars": 5, "date": "2007-03-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "uOdEsOgPW48Ky4j8U8CEcw", "review_id": "1HnwaED16ZeY44ogkgfIOw", "text": "5 stars for the wide open spaces! \n\nWe all know that Starbuck's drinks are all standard, pretty much.\nSo when I look at stores I look for the outlets and the tables...I guess also the location.\n\nWhen ever you go into a Starbucks, no matter what location you instantly feel your in a different place...the company's interior design gets me every time, the insistent Feng Shui is just so relaxing and productive. Or maybe its all in my head..ha!\n\nI like this location because of the outlets and the tables...all very accommodating. \n\nI am purest so I don't mess with Carmel frapps or the peppermint mochas...tall coffee or black passion tea for me my coffee artisans of 16th st and BethHome....and let the caffeine pass through my veins...stirring my inner most career ambitions! \n\nl'chaim!    \n\nR\\_", "business_id": "mOwAbR9_RgBQuFtr71UtzQ", "stars": 5, "date": "2011-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "cc-NjTz637u7EtFd83dn_w", "review_id": "mklMTBJboRuN2k4GP-8XoQ", "text": "Best selection of authentic italian deli food! Wonderful, friendly, and  charming owners!\nLove the treats and wow the provolone, and amazing meatball subs!\ngreat hard to find items as well, don't miss out.", "business_id": "T5HYqRADhAL6VPRAacz74Q", "stars": 5, "date": "2012-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kdI1Jh6wN6WzeTM4-fapOw", "review_id": "H8ibjhJR9beEg4OWjuqQFQ", "text": "OMG this is the best jamba juice in town, they make their smoothies nice and thick, not all watery like most jambas do they make it just right, I'm addicted to jamba  juice all over again =D the staff is nice and I just love it. Probably be back tomorrow, if I have time.", "business_id": "aeRyndix1wheBlff2FBsMg", "stars": 5, "date": "2012-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4kPVOgRPApsSKJM9rFoX_Q", "review_id": "-4loeAID0gmvaHXjafqvkA", "text": "Excellent New Yorker sandwich; pastrami, cole slaw and special dressing, get it one an onion roll! This is a huge sandwich, beware of afternoon naps!", "business_id": "fmuj7u1gflmEjW-h0v9bwg", "stars": 4, "date": "2012-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6OgQoy-mYGhG2GS-8sklRA", "review_id": "ukdQe4JWxD--4_KypFKrAA", "text": "Oh Miracle Mile.. This is one of my favorite places in Phoenix. Super awesome deli and everyone who works there is so nice. I order something a little strange and off-menu because I'm a vegetarian, and they are always so accommodating. My boyfriend usually gets the pastrami and loves it every time. The mac and cheese is delicious and just like a deli should, you always get a free pickle!\n\nThey are moving to their new location in June which will be less then a block away from where I live, so I'm concerned that I'll be there every day. We'll see what happens. Looks like it's gonna be a cool spot though!\n\nStay awesome!", "business_id": "fmuj7u1gflmEjW-h0v9bwg", "stars": 5, "date": "2015-05-05", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "2KNPtV5E44vAiEr5BvMkUA", "review_id": "VI9uqiKuoRBTeS7ojiyE-w", "text": "I have to admit, I have been one of those people who has had nothing positive to say about Cheesecake Factory in the past (other than, they had awesome cheesecakes)...however, last night, after traipsing my in-laws all through the town, upstairs and downstairs in their nightgowns, trying to look for some dinner, we finally ended up here.\n\nAnd it was AWESOME! Great service, delicious food, yummy drinks...they were 100% on point.\n\nI wonder if perhaps I have just been choosing the wrong entrees all along, or if something has changed with them, but whatever the case, last night was awesome. \n\nAt our table, we had two stand-out dishes, the chicken madeira with steak diane, and the caramel chicken something or other. The other two dishes were good, but nothing spectacular, and this is a review about what made me happy, so pbbbbbbbbbt!\n\nSo much so, that we ordered a couple of cheesecakes to go. The lemon raspberry cheesecake, by the way, is phenomenal...raspberry lady fingers, lemon cheesecake, fresh-ish whipped cream...yum yum! I'll have to wait to get feedback regarding the white chocolate macadamia nut caramel cheesecake though.\n\nSo, that being said, I will no longer sully your name with negative comments or nay-saying...and I will be back. Thank you for a great evening.", "business_id": "2r8jGeuYvMkyP2ik_X-Bxw", "stars": 4, "date": "2011-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JDi4pJYzem_X-8v6QkwNqg", "review_id": "jJClDcNMoDi7TJnDm3odxQ", "text": "Always the best options!!!!! I get the louisiana chicken pasta every time!!!! I've only tried a couple other plates but this one is always my number one choose! I recommend it to any pasta lover!  Yuummmmmmm!!!!!", "business_id": "2r8jGeuYvMkyP2ik_X-Bxw", "stars": 4, "date": "2014-04-11", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "KOtzpdbTVniK6buRL6ZmlQ", "review_id": "QRtJnVy8xQQI6PyVPCWttA", "text": "Our server Georgina, took our drink orders and left. When she returned, she had forgotten to bring a tea for one of our party. Moments later, holding a tray with a cleaning rag on it, she dropped the tray just beside me and splashed both myself, and my friend sitting next to me. I absorbed most of the splatter, in my mouth, left eye, and face. She fortunately was only splashed on her body and hand. Georgina didn't even say anything to us, but picked up the tray and kept going. After a few moments of waiting, I got up and went to the restroom to clean myself off, since I didn't even have a place setting or napkin at the table. On the way back, I stopped and asked to speak with a manager. A young man with curly hair, and square framed glasses was brought to me and didn't give me his name. I told him our situation, and what had happened. I told him I could not only smell, but also taste the cleaning solution that had been on the rag and tray. At first I asked if it was bleach based, and he assured me it wasn't. Then he said he'd talk to our server, and left things at that by turning around to talk to the hostesses. Clearly, I was dismissed. So I returned to the table, disgusted, upset, and smelling of cleaning solution. My appetite was ruined at this point, so I choose not to order anything. Having chemicals splashed into your mouth, even a few droplets, will do that to a person. At this point, our friend STILL hadn't received his iced tea. We flagged down a passing server and asked her if she could bring it for him. She went back, and came out with the wrong tea. Now in this, I say it wasn't really her fault. She wasn't our server, and didn't know what type he had asked for. Correcting that issue was minor. Next up, comes our long wait for our orders to be brought out. Georgina hasn't been back to our table for at least 15 minutes at this point. Another young man stopped and dropped one basket of bread and a small dish with 4 butter pats, to serve a group of 7. Another long wait, and the table next to us, who were seated after us, and ordered after us, gets their meals. At this point, my left eye was feeling irritated, and I went to flush it out in the men's room with water as best I could. When I returned to the table, our orders were just coming out. And my roommates order was wrong. He had ordered the garlic noodles with shrimp, and NO asparagus. And he got asparagus mixed into all his noodles. At this point, he notified the food runner who had brought his dish that it was wrong. The young man said sorry, and then walked away without offering to replace or fix the order. he decided to just pick out the asparagus, and deal with it since he was hungry, and didn't feel like waiting another 30 minutes. At this point, Georgina has appeared at our table 4 times total. While refilling glassing, she is reaching directly in front of my roommates mothers face, my face, and our friend seated on the other side of the booth. No excuse me, no words at all, and STILL no apology from her for the splashing. While my friends ate, I again went to the restroom to flush my eye. I again stopped to speak with the manager from earlier, and asked him for the name of the chemical used for cleaning. He immediately told me that \"I already told you sir that we do not use bleach products here.\" He furthermore told me that he had spoken to our server, and she said she didn't have any cleaning solution or rags with her when she dropped her tray. Outright calling me a liar as I see things. Please take into account, from the beginning I told the manager I didn't want anything, and wasn't asking for free meals, or drinks, or desert etc. I simply wanted the name of the chemicals used, so that I could give that information to a doctor if I felt the need to seek out treatment. He informed me that they didn't use chemicals for cleaning, and then said they used a sanitation solution. I'm sorry, but that would be a chemical. I pointed that out, and told him I was very upset with how this had all been handled. I made it clear again, that I wasn't looking for anything from him, except the name of the chemical. He asked if there was anything he could do to make my evening better, covering my meal or anything. I once more told him that I had chosen NOT to eat, after getting splashed and having that rancid taste of chemicals in my mouth. He then said he would get me the name of the solution used, after my having exhausted every other avenue, and telling him I would be contacting the corporate office. At this point, I told him I was done with the conversation, and wanted nothing more to do with him, as he clearly didn't care about the situation. The rest of our evening was spent with little service from Georgina. She had come and taken a desert order from our group while I was speaking with the manager, without even asking if I had wanted anything. Granted, I didn't. She didn't speak a word to me the entire time after the first complaint, and treated", "business_id": "2r8jGeuYvMkyP2ik_X-Bxw", "stars": 1, "date": "2015-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "aEADCw2gYHnLjfx8--aPFA", "review_id": "aIyG0w5xqXuky_kKWOu88A", "text": "Overpriced and dirty.  Had lunch here with my wife and service was ok but salad they served was stale and moldy.  Ordered a raisin croissant, looked and tasted like it was about 4 days old which surprised us they would serve and charge for that.  Probably won't go back since there are better options in the area, scratch, chez vous, ect.", "business_id": "wftoNIA0Q8nX-Da47psBCA", "stars": 1, "date": "2013-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "K_gNqlirV0kppqCGnfGiOQ", "review_id": "5AYDa5i8qHwP7tNgeh-FPg", "text": "Since the positives outweigh the negatives by a considerable amount, I'll get it out of the way and say that if Trader Joe's had a more extensive meat department it would be a one-stop-shop for me. \n\nThe store brand quality never disappoints, the staff is knowledgeable and friendly, and prices are very affordable. That you're greeted by their beautiful selection of flowers, herbs, and other types of foliage and later welcomed to try one of their delicious concoctions cooking in the back is just icing on this mindful preparation of grocery and household offerings. \n\nThe store is always clean and while it's usually crowded at the times I visit, I'm rarely bothered. A friendly place like Trader Joe's seems to attract friendly patrons. If my bright blue insulated tote happens to bump into your bright blue insulated tote while I'm deliberating over the vast cheese or nuts selections, we'll probably exchange smiles instead of middle fingers.\n\nThe folks who work here are approachable and extremely helpful. While I don't regularly drink wine, I find it a nice touch that a personable sommelier is available in the event I need a crash course on pairing and someone can recommend a high fiber cereal.\n\nSome of my favorite products:\n\n-Salsa Authentica\n-Cowboy Cavier\n-Vegan trail mix cookies\n-All-in-one facial cleanser\n-Cruciferous crunch\n-Coconut cashews\n-TJ's brand almond milk\n-Spinach and fontina chicken sausage\n-Spicy peanut vinaigrette\n-Roasted red pepper soup", "business_id": "Sy-hmzSH1OmWpHmAfZtxRA", "stars": 5, "date": "2014-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fSLyFeOWXc1Th_yY1BMYfw", "review_id": "9bd2wRFwx0e0nvpd819Y8Q", "text": "People. People. Some of you negative nancys need to take a deep breath and stop complaining about getting charged 25 cents for using your credit card. Yelp reviews can make or break these local businesses, and small things like processing fees aren't a true representation of what a coffee shop experience should be about. Hava Java is a great independent coffee shop with great tasting coffee and tea. The baristas are on-point and very friendly. For the price you pay, you get a great beverage, and it doesn't taste anything like strbx. The 1 negative of this place is the lack of seating- it is a 'run and gun' coffee bar- and if I want to stay and read or do work, I go to Lux. Maybe make the outdoor seating more compact and expansive? I want more independent local businesses like Hava Java in my neighborhood, and I'm willing to pay a little extra for that- but they do give punch cards here so it all evens out and then some!", "business_id": "2h9LsLPdJ7OvZrYJZhVdAw", "stars": 4, "date": "2012-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "06b4RfKYKTbddGJtf__ViA", "review_id": "Kp-lZSeVOQr7hxerf_EQgw", "text": "Picked some up to bring to the East Coast as a treat for friends, friendly and personable staff. I tried some today for the first time so good!!!", "business_id": "wxPOlYC155x-RLfk1kVdfw", "stars": 4, "date": "2015-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "eBFXojgTo2SWLtzv7jJlxQ", "review_id": "CzOJ5ybZ1hhJSMIFWd_seA", "text": "I have a major sweet tooth and am VERY picky about my sugary calorie intake =) I usually go to tammy co or make birthday cake's myself (i come from a mother that was a phenomenal baker), but it was my boyfriends 30th so I wanted something special, different, yummy and reasonably priced. I am SO SO SO happy that people suggested this place! WOW!\nThank you Barb's bakery! The cake looked so beautiful, just what I wanted and everyone raved about the cake and how delicious it was! I ordered a marble cake with raspberry mouse filling and buttercream icing... every bite was wonderful! \nThank you for making my boyfriends cake so perfect for his special day!", "business_id": "vv1uvJRBUqi707TA5GuhCg", "stars": 4, "date": "2013-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "d0PXN37UgeZPbWg_M9uj9g", "review_id": "hKiDtQADv40P933_5qeDOw", "text": "Looks very sketchy from the outside of the building but it amazing. Been going their my whole life. In a nice neighborhood and area (Arcadia). The sandwiches are unreal. I recommend this if you see it. I don't know anyone who doesn't like this place. Personally, I didn't even know they had bathrooms, but great food and a shy but kind cashier.", "business_id": "gxuVySgACHDqJlwmelFHLA", "stars": 5, "date": "2015-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b2DKC4kC8-QeSeGZ_MF3XQ", "review_id": "oYbYmu-FDOUfb3RebUE6uw", "text": "Interesting little butcher shop/german market next to OHSO.  Rather small selection but what we bought looked fresh and tasty.  The smoked pork chops are to die for.  Not much variety in the 'market' either but what they had looked authentically German including mustard, pickles and snacks.  They also threw a little something in our bags for free.  Only knock is needs more inventory.", "business_id": "fhLb0v5NBj93D7PLQpFXfQ", "stars": 4, "date": "2015-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "5-HR_blOwshfAGkBQM7XSA", "review_id": "qaVzmVMqOtor7Q_0LAVv5g", "text": "More of a 2.5 but I'll give it three because the owner was nice. She clearly knew almost everyone coming in and out of the place and had lots of repeat customers. \n\nThe place is dank and the plastic red table cloths are sticky. The mural is very cheesy and now well-painted. The owner is nice but I have smelled few people who emanate the smell of cigarettes more strongly. It is awful and it made us feel a bit sad/depressed for her. It made the place seem gloomier. And it is NOT appetizing. \n\nThe cheese sticks were ok and the sauce served with them was passable. The pizza was sort of ehhhh...The cheese quality was a bit low and the sauce just didn't work that well as a pizza sauce. Crust was cooked well and had a bit of crisp on the bottom. \n\nI would not come back here. It was middling at best and a bit depressing.", "business_id": "j0Uc-GuOe-x9_N_IK1KPpA", "stars": 3, "date": "2014-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9yO7yHbkLQVuHNc6yL-dng", "review_id": "9MynTxbktNQP3Flo6d--Kg", "text": "This rating is for the \"cafe\" only...when you walk in you'll see, to your left, a seemingly nice looking deli counter where one can create their own sandwich/sub/etc. When you see it, KEEP WALKING. The man working was so cold. He maybe said two words throughout the whole ordering process. His way of communicating was staring at me until I told him what I wanted. Talk about uncomfortable. I might have considered coming back since it might have just been an off-day service wise, but the sandwich he \"made\" for me (threw together) was disgusting (and expensive for what it was.) The ingredients tasted expired, I could only manage to eat a couple bites. Won't be back to this part of the store. They do have a cold case near that cafe with pre-made lunch/dinner items that are a much better choice.", "business_id": "a7OF5WBirAFlVH7Xp1885g", "stars": 2, "date": "2015-05-14", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "qkbiaiS8t8YHWx3J04NjSw", "review_id": "H-GOx33WvSDcf3VtvALZbg", "text": "I was shocked to see all the negative reviews of this place.  I have been to each and every location and there would not be crowds of people most of the time if these reviews were to be believed (the angry vegan made me LOL).  Seriously though people, it's a sandwich, it's not a life-changing event.  \n\nI love their sandwiches, especially the Symphony and the Encore.  This location is close to home and the staff is always super friendly and pleasant, and I always call ahead so I don't have to wait.  They have a very extensive freshly brewed iced tea offering (like 6 different kinds), and the ingredients are always fresh and tasty, not boring or bland.  I seriously can't get over all the haters on here who say they can make their own sandwich at home for less - you totally should!  The prices here are about $6.29 for a large sized sandwich, a mere dollar and a quarter difference from Subway! Plus the free cookie, there really is nothing better for the price.", "business_id": "S8R5c7-plWe3NtmijYAJvg", "stars": 4, "date": "2013-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "oXBahXJCXUEATm5IVexw8A", "review_id": "_n3kh58I2c5UQRQ05B6Q5w", "text": "I have loved this place for a long time.  It troubles me that people write such negative things in their reviews.  Hi, it costs money to have a credit card machine and if you don't spend over five bucks it costs the COMPANY money. Duh.   And in regards to closing early, yes, it is a bummer.  However, it would be a far greater bummer if they had to close down instead.  In an economy where businesses are disappearing left and right, they are still here.  That says a lot.\n\nThe coffee is delicious, latte art very cool and the new baked goods made in-house are absolutely to die for.  Keep up the great work guys!", "business_id": "Mb46iSlA4qmTwXf-WrqtQA", "stars": 5, "date": "2011-05-23", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "49UVlMwjYXZA7OEvApzwnA", "review_id": "m34RVG1W0KcU71fqEAh8fw", "text": "This has to be one of my favorite breakfast places near Tempe. Although it is a little frustrating when it is super busy(which is majority of the time) it is well worth it. And for a college student, it a little out of budget so I only go here when the parents visit or to treat myself! \n\nI am obsessed with the chocolate pumpkin muffins. \nMy only thing is I feel like I see people that have ordered really cool dishes yet I never see them on the menu? Am I missing something? \nGreat food, entertaining atmosphere, couldn't ask for more", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 4, "date": "2009-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "sEC7NsPHCDrvSVI2K6I3nw", "review_id": "VWr0YNbU_9OITeEBRf_UpQ", "text": "I loved this place!\n\nIts very cute and they have a nice selection of stuff. (Food and non-food items.)\n\nI love that everything is fresh and the breads/pastries etc are all made on site. \n\nHad the yogurt with fruit and granola. Yummers!!\n\nAlso had a muffin of some sort... I think it was like blueberry white chocolate. Super yummy!\n\nNote: The place isnt all that big and its crammed with stuff. It can get really busy and very crowded with people inside. \n\nParking is also a bit of a pain...\n\nBut its all worth it. Go here!!", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2010-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "B2NBtdyPbE0LQ-62cU_j1g", "review_id": "j5CBXY-6cIv1J1-Rs9gVUg", "text": "I love this place, and the wait is well worth it. If you are not a fan of waits, crowds or good nosh or novelty food, then La Grande Orange is not for you. But those among you with a versatile and educated palate will enjoy all they have to offer!", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2011-03-22", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 5}, "user_id": "lmiDCrmas8TxRsbIGZX9Pg", "review_id": "ao5AuVx8Mzu2wl6EMYjhVg", "text": "It's like a non-country, trendier version of Cracker-Barrel. Cute, cozy, filled with nicknack's and plenty of charm. On the downside, it can get a bit crowded, and there is not much parking, but overall- it's a nice local spot  with plenty of delicious goodies to try. \n\nTip- lots of good wine to choose from!", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 4, "date": "2012-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RbRgf2_N18vAlWdwnGsDKQ", "review_id": "Tfy2ZCMTf0euOE_7e16JcA", "text": "Would have given 3.5 stars but I just couldn't bring myself to do a 4-star review on this place.\n\nI've been getting takeout from here for a few years and at first would rate them a 5* for service, quality and food. Now, they've dropped in all those categories. \n\nUsed to be, you would call in your order and they would make it for you on the spot. It would be ready for pickup within 10-15 minutes or so, and their special parking for curbside pickup was super convenient. Food was fresh and delicious (my fave is the Evil Princess Thai Salad). \n\nNOW it's certainly not the experience it used to be. Here's what happened today when I ordered lunch - what has happened every time I've ordered in the past 6-9 months or so....\n\nI call in my order (EPT Salad with extra peanuts) and the girl on the phone says \"We don't have any salads made yet.\" Ummmm... so, why not just go ahead and make one? BECAUSE they don't do made-to-order salads anymore. I am asked to wait 30 minutes because by that time all the EPT salads will be done. Even though this is an inconvenience (and pretty ridiculous really) I am willing to wait. She confirms my order and I remind her... extra peanuts please.\n\n(Oh and BTW my associate's Pizzeria Chop Salad is ready anytime- so is that from yesterday then?)\n\nAnd despite requesting extra peanuts from all three people at LGO I've dealt with today (including the girl bringing out my order) - no extra peanuts. *sigh*\n\nMy coworkers and I used to order from them weekly. So now instead every 4-5 months i hope to give them another chance but am just disappointed every time. \n\nPS - they no longer carry Tammy Coe cupcakes (which are heavenly), even though the bakery is literally 3 doors down from them. They have subbed them with their own (again mediocre) baked items.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 3, "date": "2013-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GnLW0116uCkllWMF5L2-cg", "review_id": "-ikm3JFN5twRHN1lkUOdZA", "text": "Great breakfast food, specifically the commuter sandwich!  Often a bit of a line due to the trendiness within the Arcadia crowd, but often worth the wait for this tasty dish.  Every other menu item I've had has been good, but not a standout like this one.  A few of my  friends swear by the drip coffee here, but I'm adamant when I call it 'dismal' which isn't a deal-breaker by any stretch!", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 4, "date": "2014-04-14", "type": "review"}
{"votes": {"funny": 5, "useful": 4, "cool": 4}, "user_id": "rjlb-7-JcmM6fR64ZpyTug", "review_id": "AP2D9_uc5vNRNftRka_ADQ", "text": "I just want everyone to know that I am nearing the end of a 3 week business trip abroad, muscling my way through the stint in India, and all I can think about is how I'm going to eat a commuter sandwich when I get home. \n\nIs this wrong? Do I need help? Maybe. Or maybe it is that good ... \n\nLGO, making people salivate all over the world. I'm coming home soon, my little English muffin!!!\n\n(Ok, yes, I do need help. And a gym.)", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2015-05-02", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 1}, "user_id": "l53FUDHRHLg7BQ89KgAtxQ", "review_id": "VTE9LM1kkxP6p_trIUKveQ", "text": "If you don't know how to make it, don't put it on your menu, don't accept the order, don't have a button for it on your computer and don't try to hand off your creation to the person in the drive through who will be pulling away before they notice.  I'm not asking for much.  \n\nThey screwed up a mud pie blizzard.  I love mud pie blizzards and could have most likely given them most of the things you add to create it.  Instead I got an Oreo blizzard with what tasted like maybe a half a shot of coffee - but not much at all because it was still just as white as a regular Oreo blizzard.  Sigh... so sad.  I finally treat myself and they screw it up.  We also ordered a large dipped cone that came out looking like a kids sized/small.  We actually sent it back for them to re-make.  Sent back ice cream. You know it went uneaten. So sad.  \n\nBut - they have an amazing menu of food.  More food than I feel like I see at other locations.  But of course we were here for ice cream - not food.  And if memory serves from when I worked in the area, they do a decent job with that - though nothing that makes you want to go running back. \n\nIt's convenient.  And with Carvel closed down in the area, it might be getting a little more action.", "business_id": "pkUj-lZb5ZEzLBw87-pOew", "stars": 3, "date": "2007-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tx3WZJMD6vbFVWgpm-OzDA", "review_id": "6WLhw31q-9YU-eWceLanVg", "text": "Love their chicken club sandwich!  It's a small place with little seating inside and a few more tables outside.  During the spring and fall it's great to sit outside.", "business_id": "3rJE7qliy8_ylKhY5FdlIw", "stars": 4, "date": "2010-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MoxaqGOOp8sxdlPZhDgIuw", "review_id": "jEIxc0Nhb5C5K31gRX5WoA", "text": "Staff is friendly and pretty knowledgeable. Got a cold press iced coffee, which is how you separate the wheat from the chaff, for my coffee money.\n\nSat outside at shaded concrete topped tables. A very enjoyable experience.\n\nIf i lived in town, this would probably be my go-to java joint.", "business_id": "4eFIVmbeCvJGCrhzmd-VYA", "stars": 4, "date": "2014-04-20", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "ky9pQ8AKufvZ63IxR41jGg", "review_id": "qrZCgguUZ9AEEMF2F-E3rw", "text": "Well not much to say about this Circle K....except considering that it is near the local car wash I go to and there is a Quik trip across the street and a Jiffy lube as well....this place seems pretty competitive. They seem to do good business...and at least the doors are not coming off the hinges....LOL. Eat, Drink, and be Merry my Friends!!!!", "business_id": "9BPYwkcrItZgnI9V0Cz7DQ", "stars": 3, "date": "2011-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jRtdO03kWbReasB_vBlTsQ", "review_id": "i8GW9hPeL4y4WEOQHkjiYQ", "text": "I rarely give bad reviews however this place needs help. It's not that the food is bad, it's the service and time waiting. The food IS good, once you get it, but it takes FOREVER! I waited 17 minutes for 2 toasted buttered bagels. I wasn't the only one. The problem here seems to be organization and timing.  Perhaps they need more toasters or people, I don't know. But I can say that I wasn't the only one waiting, I personally witnessed  2 other customers that were unhappily waiting for the orders placed for 10+ minutes. That was within the crowd of 10+ people that were also waiting. C'mon EB. Step your game up! You have a good product... Do something about customer service. You need to be quicker with a product that everyone wants.", "business_id": "pNJhovUsGAZ4XqG3lCU-5g", "stars": 2, "date": "2015-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iJREBBdu5NHFmzRsz4Jm-A", "review_id": "jVQQ6rX_iy6nlpA9e4PcBg", "text": "What can anyone say about Starbucks except that they're awesome and this location has amazing employees who make you feel at home and treasured!", "business_id": "UHIL-Sp2VtYkxDa3_8hH3Q", "stars": 5, "date": "2015-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uXYshfP5Qtk0G07cjqmBWg", "review_id": "-nvF_1b1waH3s5rDGfp6hg", "text": "Craig in the hot food department is amazing! My dad got a burger and I got a burrito bowl.  He was a pro burger maker! I don't eat burgers often, but my mouth was watering over that thing. It definitely made me regret my burrito bowl (which was also good) and wish I'd gotten the burger. That burger looked as good as it tasted!  Since they were out of fries, which come as a side with the burger, he was kind enough to let him get a side from the deli to go with it. I definitely want to come back and order a burger!\n\nOn another note, the cookies by the pound were pretty low compared to the Whole Foods on N Scottsdale Rd and Mayo BLVD.", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 5, "date": "2015-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2_tOvm9THqfuxiXSxbE7Zw", "review_id": "ohfv6xS4csqOC5PsYrokDA", "text": "I work for a local bread company...you could say a competetor for these guys...but i love this place.\n\nTheir molten chocolate cookie....yum\nTheir pesto parmesan sauce for sandwiches...yum\nThier breads...burnt crust, cripsy, and wet and doughy on the inside...that is the perfect loaf, and they mastered it.\n\nI can't wait to try more of thier pastries and bread.\n\nThey have limited seating and don't use A/C. But that BS doesn't bother me. Whenever i am near the PV mall area, i stop here.", "business_id": "j5HLcBru7FEirYJPbKFVWA", "stars": 5, "date": "2011-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7nYwi_tVIh4N9l5Yr1X1Tg", "review_id": "rPET0ErOE1XeJjNUW4PEIg", "text": "I think this place is probably pretty good on a normal day, but I guess we came on the wrong day.... The kid (one of the two young guys that was working at the time) that took our order kept getting SO confused and kept asking us repeatedly what we were getting or trying to talk to us about a different sandwich when we had already told him what we wanted. So ordering was like pulling teeth. The same kid went to the back to make our sandwiches and we went to sit outside because the guy said he would bring them to us, but then we noticed the person who ordered after us got their sandwich and left already so we went inside to check on it.... and let's just say the sandwiches looked less than appetizing and I have no idea why it took the so long to make the HOT sandwich  because the cheese wasn't even melted! He also used the wrong bread for each of our sandwiches, forgot the spread that was supposed to be on it, and forgot the veggies. It really just looked like WAY too much meat on bread. Anyway, we brought the sandwiches back in to the other guy that was working and he said he'd remake them. They came back out looking beautiful, but due to the time that was wasted ordering, waiting, and waiting again we had no time to do the things we needed to do in Phoenix before we had to drive back to Flagstaff. That being said, I would still try this place again (which is why I gave it 3 stars) because the person who told us about it said it was owned by two ladies who make everything from scratch and I think they have a great little place, but that guy should not be making them! Hopefully next time the owners will be there. I feel horrible saying that because he was super friendly and nice, but he couldn't stay focused and didn't prepare the food the way it was supposed to be or in a presentable way. Oh, one last thing: there was way too much meat on the sandwiches. Maybe it's just me, but I would've been happy with thinner slices of chicken (we got the Santa Fe chicken and the chicken cordon bleu). Also, the Gorgonzola spread was SO GOOD!!", "business_id": "j5HLcBru7FEirYJPbKFVWA", "stars": 3, "date": "2015-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I2HjcrD-ERw8GXN4hLX2xA", "review_id": "zx7GPPG5c_Yqz0U1JyB42w", "text": "Well let's just start off by saying.. I don't drink I am just the dedicated driver. First bar I've been to that doesn't offer their DD's free sodas. With out the DD's there wouldn't be the drinkers. So that's a bad business move.  So on to the karaoke, the top hat guy plays the favorite game. That to is a bad business move. I was here with a party of about 25 drinking people.  Celebrating 2 birthday's and they came from all over the valley.  Had nothing but good things to say about this place but not no more. The group got their request in as soon as the karaoke got started. Well none of them have been called up to take the mic as of 2 hours into this. None are to pleased and now are leaving. Sounds like a big loss of money to the bar because they are taking their business elsewhere.", "business_id": "-xLwGUmmyKgsTtFOOXzjeg", "stars": 1, "date": "2014-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vtedgK7wCKBqRyPOh6alPg", "review_id": "BAA-moDssFyaacYFiNNkaQ", "text": "The food is excellent. The prices are very reasonable. The people are pleasant. In addition to the four tables for dining in, there is a fascinating array of groceries for sale. We always end up with a few items to take home. The ambience is fine except for the constant sound of refrigerators, which sound in need of help. This is overall a gem.", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 4, "date": "2014-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sLY8Qp8VJAM3oifDpk3hYw", "review_id": "bmwswD5q6N7dskwZygs_-Q", "text": "Good donuts. Great selection. Workers are always cheery. My kids love this place. Me too!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2014-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "l53FUDHRHLg7BQ89KgAtxQ", "review_id": "LcSVveiPlXCFkpe25QTgmA", "text": "You have to love the convenience of a healthy food store right near the mall.  In the PV area, everyone goes to this mall and/or the many stores that satellite around it.  So it's always convenient to go.  And the idea of healthy convenient food - that costs a ton less than Pretentious Healthy Food-Mart down the street (...Cough - Whole Foods - Cough...)\n\nSuper produce selection.  Great selection of vitamins and supplements (though I'm still a Trader Joe's girl for these things).  They also have a nice selection of alt-diet foods.  I've seen South Beach stuff here and they have just about the full Atkins line of products.  Not bad at all.  And as expensive as those products can be, they aren't too bad here.  \n\nBut in the end - it's pretty hard to beat this location.  Suburban enough to have a laid back feel, but in the middle of a big shopping area so they have a great selection.  \n\nOh yea, and my brother worked there years ago.  And we both still shop there.  And isn't that always a good sign?", "business_id": "hHE4OHAc8dONTV8QsGLbWg", "stars": 4, "date": "2007-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9DYasJE3TtxptCcsZAyg1A", "review_id": "oea_ugN6LcInEqXoXEYr3Q", "text": "Dunkin Donuts s at the top of my list for an every day cup of coffee to start the day. As a kid I can remember my grandfather taking me to Dunkin Donuts to get a couple of dozen donuts for the family. Times have changed, and Dunkin Donuts now offers a variety of different breakfast sandwiches and wraps. One of my favorites is the good morning rap. It's pita style bread with egg and your choice of meat. Dunkin Donuts is also a great value unlike some of the other coffee houses in the neighborhood.", "business_id": "AhXcP_o5YAmCePKl0jxBXw", "stars": 5, "date": "2014-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Ixl4VIqhes8h6zR7BnM6cA", "review_id": "UDF23HOKQXf3nB7IUbNIbQ", "text": "We had a valid coupon and they would not honor it because they could enter it in the register. They should not put out coupons if they aren't going to honor them. I will not go back  to this location again!", "business_id": "qeqrsjWXc15KmlK5Z8580Q", "stars": 1, "date": "2015-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tEGhETmKhRPA3LvVtazkJA", "review_id": "QBy6zf38ygy-JuqR63Kepg", "text": "Seriously Paradise...this thing half chicken panini) costs $5 and was 3 bites...not even that good. What a rip!\nLast time I eat here (and I love Panera in ATL)", "business_id": "Cm1jT60fxb1DjwpqjWJ8EA", "stars": 1, "date": "2015-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KpCUBxJfqwC2srtOCtl28g", "review_id": "IB82pjmXWuA-YMBihT1zSg", "text": "Best green chile and hot to boot. Tortillas are thick and hearty, you will leave full if you order a combo", "business_id": "d2AeNB4xw67E1Bzpo1Pm7Q", "stars": 5, "date": "2015-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "7GC9fVWKa4a1ZmBGLH6Uww", "review_id": "GCVqPSzsbSyt3EuuwCuaoA", "text": "this place is great, but i am partial to anywhere that offers outside dining possibilities. actually, it's only outside dining, picnic tables, to be exact.\n\nthe Farm is just that, with an attached lunch counter to get chicken salad sandwiches with pecans, both fresh from on site. Tons of tall, shady trees, picnic tables and wandering ducks and birds to delight the kiddies.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 5, "date": "2007-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "xxqO0Z-neqNlS1myYq7ZrA", "review_id": "KhqURXIlmS9vH38-7Iu3Og", "text": "It's really called Morning Glory Cafe.\nIt's on a farm that's all organic. My sister asked \"Do you think they spray for flies?\" but immediately noticed the incongruity.\n\nThe sausage at the breakfast place was really good.\n\nAn admin at Yelp needs to move these reviews over there. I give it a 5 mostly to counteract the one-star. Otherwise, I didn't pay, but I'd give it at least a 4 on taste.\n\nLook for the rest of the reviews for this place here: http://www.yelp.com/biz/morning-glory-cafe-phoenix#hrid:YAbb2MOxdLvD4qkvlO7Wug/src:search/query:The%20Farm", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 5, "date": "2010-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "uaqPurAsBJZjDa6a5PAkGQ", "review_id": "qZ95BzNAvl2H9PyYpMIsNQ", "text": "This was a great place to stop for lunch. A great sandwich and bowl of soup. The setting with the flowers and trees makes you feel  miles away from a big city nearby. Lots of picnic tables and cafe tables with a  live flower on each one. If you want a relaxing lunch and a stress reliever, you need to find this place and relax. Makes you feel  like you are on a picnic. Your food comes in a paper lined old fashioned basket. Put this on your to do list. They also serve fine dining at dinnertime.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 5, "date": "2013-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "eryLfrk7fabe8G1HPBkNAg", "review_id": "9D7UcwwcM0agGpgTSwYvKA", "text": "This place is a hidden treasure.  3 different restaurants on the same grounds, all hidden away from the rest of South Phoenix.    Good food, good service, outdoor seating, beautiful grounds to stroll around on, plenty of parking, a cute little vegetable garden, a country store and much more.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 3, "date": "2014-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "edUm8D0ow-K45yWLuUcAmw", "review_id": "BYEAxZCFlw09vFAywADS2A", "text": "Had an amazing TAB (Turkey, Apple) sandwich and Seafood Soup. Above all, best Pecan Pie ever! The location has wonderful outdoor seating surrounded by green trees.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 5, "date": "2015-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x0r-IamYgKMgF3v7tJ_PTg", "review_id": "WEAnCtYW4DN4rdh_yiQm1g", "text": "there is one problem with bagel nosh: it's not close enough to tempe! went there on a sunday a little before closing-the bagel selection was sparse but they offered to get us any kind of bagel we wanted. the garlic,feta, and dill cream cheese was amazing and the breakfast sandwich looked hella yummy! went to get a refill on our way out and the owner offered a free large glass of iced tea since they were about to close. the service was great andi might have to make the trip out there very soon!", "business_id": "8H1DwdAAgSBtwDeb2R-hmA", "stars": 4, "date": "2011-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mjP_3XwUXdptvOpQd0OjBw", "review_id": "j3wB2Ubu394hKJmvytcdLA", "text": "I recently visited The Nosh Cafe for breakfast and was impressed with the friendly staff and lack of wait times (even when they were busy). \n\nI chose  the South Mountain Burro which hit the spot perfectly. Tasty and filling but not so much that I felt like a lead balloon afterwards!\n\nThe most important thing for me was the coffee. Delicious house coffee - apparently roasted locally so that's a winner :).", "business_id": "8H1DwdAAgSBtwDeb2R-hmA", "stars": 5, "date": "2015-03-17", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "LXWAXIeYFIdgd2JVPF-9qA", "review_id": "ZZuhlJyjDgiNP2EyrsZ5og", "text": "Quick friendly service. Good breakfast sandwiches, and also lunch.\nYou can eat outside-but watch out for the birds-a girl left her wrapped sandwich on a table, and a lttle tweeter got right in the plastic basket and proceeded to help itself to breakfast!! Yes, we did let her know.", "business_id": "l4ymgiD1WnsSrwxWWk7a3Q", "stars": 4, "date": "2011-04-18", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "AirVzN1BVQBmq5zY0YMNYQ", "review_id": "u5SrU3lha6NzU9gl-K-C6g", "text": "I have heard about the fabulous bundtlet cakes and with a birthday celebration last week, figured it was the perfect time to try them!  I walked in and there were two ladies ahead of me ordering their cake.  The nice man behind the counter welcomed me and offered samples of the red velvet cake, to which I replied \"oh no.\"  That was \"oh no\" as in \"I wish you hadn't told me.\" Not as in \"No, thank you.\"  =)  As I sprinted (okay, stepped) over to get my sample, I could tell by the confused looks that they all misunderstood my reply.  We all had a quick chuckle.\n\nThe guy was very nice, however a few people walked in behind me and I could tell he wanted to get me on my way, I almost felt rushed . . . not quite, but almost.  I didn't expect a steady stream of people on a Wednesday afternoon.  After a few minutes of debating, I ended up with the Chocolate Chocolate Chip and the Pecan Praline.\n\nTurns out, after the big birthday dinner at The Keg (http://www.yelp.com/biz/keg-steakhouse-and-bar-chandler#hrid:Pmx6mtZL2orxMYVvTiHApg), we didn't have room to eat the bundtlet that night. Decided to bust it out the next day, and even right out of the refrigerator, this was super moist and delicious!!  The \"signature\" cream cheese frosting was perfect!  SO YUMMY!!\n\nNBC is now one of my favorite places for a sweet treat to-go.  It is going to be very hard to not stop here every time I drive by.  Then again, maybe it will make dealing with the crowds (and parking lot) at Target a little easier.", "business_id": "vPJ4iCOSuxCxHPtb18gwWw", "stars": 4, "date": "2010-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "jXh12tfZsG8tO0PzC8x-0w", "review_id": "lxFXIl6aMMJQvAL8pYSNJw", "text": "This is a horrible Starbucks! They consistently mess up and don't compensate for it.  It's very disappointing because we love Starbucks! Both gold members and now have to find a new Starbucks:( we even asked if we could have the managers card and none of the regular staff knew how to help us nor did they apologize! It took 20 minutes to get our drinks! First ordered in the drive thru then had to walk in.", "business_id": "onrILeMjuoOlJlX4BMXzQg", "stars": 1, "date": "2014-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w6PRl5uxAwxyjBHoKFXU9Q", "review_id": "-kxwz2HVSYhPKxLDZKp4pg", "text": "Worst coffee I've literally ever had ever. And whoever is baking for them needs to take some culinary classes. It was absolutely disgusting and the woman was really really rude to me, and didnt get my order correctly at all and i had to be charged again because she wasnt listening, YOU HAVE ONE JOB LADY!", "business_id": "JJGkhOmfOFamPbCAaRKPPw", "stars": 1, "date": "2015-05-07", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "SC_bFYaDgDub7tDjKCvV_g", "review_id": "mbtnCuUIo615T1YQfUIv7g", "text": "I decided to write this really quickly while I was still full from the deliciousness that is the Tasty Turkey. \n\nMy sis used to work for Bruegger's Bagels back in the day and brought me home millions of bagels... this is how my obsession began (thanks for that Christine - probably has lead to my wheat allergy...) \n\nAnyway, the sandwich is served on an Asiago cheese bagel, I prefer the garlic one... tastes better with the chive cream cheese. Add cucumber, tomato, sprouts and of course turkey and you have yourself one tasty sammie. \n\nI only give 4 stars, 5 if my pickle wasn't always so shriveled. Also, 5 if you weren't so darn expensive. And, 5 if you were open past 4pm, some of us want to eat you for dinner!", "business_id": "IYWTOj970XqG2z9Xft_8SA", "stars": 4, "date": "2010-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Djb4YYt9Rr4wKvUZbLy-VA", "review_id": "CFB3MnbMDkmwBBDuf5jBBg", "text": "Thank you, Starbucks on Anthem Way, for fueling my daily morning coffee addiction. The staff is friendly and the drinks are delicious. My iced coffee gets me through the workday!\n\nFrom, your neighborhood venti iced coffee with soy milk, two sweet-and-lows, no classic drinker.", "business_id": "brDiv7CufBg4bdFfPBY8Fg", "stars": 5, "date": "2014-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hn9YAMer6l5E4GFQKjTm2A", "review_id": "ko7gdTBtG0KR8NSnVsl91A", "text": "5 stars for being my favorite starbucks in the valley. All of my favorite baristas either work at this location or used to work here lol. They just had a remodel and the place looks fantastic.  Generally speaking I get fast service and everyone knows my name.", "business_id": "uFR7CpDJlW-gNdmk-zhIGw", "stars": 5, "date": "2014-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "T7J9ae0wTskrI_Bgwp-4cA", "review_id": "_Kgf1iQoQZZ7gV_nCGb90Q", "text": "How did I not know this place was here?  It reminded me quite a bit of Haji Baba's and I still prefer Haji Baba's.  However, the service was wonderful and the food was good.  My kids ordered a second plate of stuffed grape leaves they liked them so much!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2012-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LWAZxNJqQGLFEiO0ccMLgA", "review_id": "neb7uXQ2_8hrSFra4VaTzA", "text": "So after going to Flaming Kabob multiple times and having to wait 2 hours for lunch service..and trying Raina's and there food being alright...we figured a new place was in order. \n\nVery happy with what we got there.  It was a little different as it is set up as a market, however they directed us to sit at tables and eat.  Arlano was our server and he was very nice.  I got the chicken schwarma plate with hummus, rice and salad.  All was delicious.  My friend got the chicken schwarma salad and loved the way the meat was seasoned.  \n\nAltogether food and service were great and Arlano even took the time to introduce himself to us and get our names on the way out!  Very personable service. \n\nWill return and probably not hit up the other places anymore.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-03-17", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "-yqgNgb0SK1TovV7PX8nHw", "review_id": "mEnP2nZtnr3EHW8nTUzZeA", "text": "Been coming here for years and will always come here when I want the best custard.  Food is always fantastic and the staff is friendly.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 5, "date": "2012-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "IE_nJq65Qpso5fN4tG9zjQ", "review_id": "RxwjDwQsSRE7flP6N4L4tA", "text": "I come here probably at least once a week. The prices are right, there's a good variety of \"ethnic\" food, the cashiers are quick and friendly, and they're just helpful. I locked myself out of my car when having a space-cadet moment and they let me use their phone to call AAA to bail me out. \n\nFresh flowers + great selection of wine and cheese + all the essentials \n\nThey deal is that they cut out the middle man to get great prices for quality products and they don't have sales because they always sell their products at the best price possible. =) GO TJ'S!", "business_id": "4EeLblEpJc2VeBowa94YPQ", "stars": 5, "date": "2008-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "twd6OI9ZBMu0TbR852wzzg", "review_id": "FJPh_kF1v__WC7EZmHEzLA", "text": "Even though this is a location with no drive thru, it is still faster than the drive thru's at other locations. So I come to this location instead.  The staff is nice and they usually remember my name and my drink which makes a girl patron like me feel special of course.", "business_id": "1FkRvL3fj2ERBoddXwanTQ", "stars": 4, "date": "2014-03-07", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "pqnYZy25nEwGAAjShOpJGg", "review_id": "RnS7MSVOQ_w8awl334rI0A", "text": "This location is closest to my house, but like the other reviewers, this is a really rundown, raggety, dirty, smelly location. There are some really nice people that work here, but that doesn't always cut it. It's always busy, with never enough cashiers. And talk about 'People of WalMart'!!! This place is crawling with some real pieces of work.", "business_id": "OdXjGy_iU6MpbDUmXDU8pw", "stars": 2, "date": "2012-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CktKDSYRlvRnfmDSyoZhMA", "review_id": "mlwH58aDN0u-clEPqpTtFg", "text": "5/9/14: I saw they had remodeled so I decided to give them another try.  As I approaches the door I was greeted with clouds of cigarette smoke from the server who was standing at front corner smoking.  I approached the podium and waited.  Another server was on the phone and I heard her mention \"Medicaid\".  Since that is not an item served at Coco's, I assume it was a personal call. Eventually she said she would be with me in a minute.  She then leaned against the back counter and continued her call. Based on previous bad experiences, my smokey entry, the lack of making guests the first priority, and the district manager never following through on her previous call to me, I will never return.  I will share my experiences with everyone in my office as well, which is just down the street - over 300 people.  \n\n3/7/13: No change.  Slow service to be seated.  Poor maintenance. Tables had excessive wear marks from use as plates sliding across them.  Dirty walls near booth.", "business_id": "c3xkboF2p9rfzUFpBBn_tQ", "stars": 1, "date": "2014-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "V4VW69mBsRzfa3mLmyBqLQ", "review_id": "PjsuM2fTzi2T_B5cK31zog", "text": "I have been using these sauces and products for years.  The hot pistachios are solid.  The Organic Harvest Foods - Gluten Free sauces are utterly amazing.  Try the Organic Harvest Gluten Free Habanero Pepper Sauce.  Hot enough, but not a scorcher.", "business_id": "FX5oqnU5WF0rPhS22k40Mg", "stars": 5, "date": "2012-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "XUauQXMwCAxZ-O__4Lg4ag", "review_id": "1hkQtgV_m5gPaQoM4-pXaQ", "text": "Shaved ice is so soft and delicious! I always get strawberry daiquiri with cream. They give you a generous portion so even a baby size is a lot. Don't forget your punch card!", "business_id": "KHeM4cO2DWK1C09zWCFLFQ", "stars": 5, "date": "2014-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "d_q279uWxKs9dGGV7_BjcA", "review_id": "oQyQoAs3AmZm4fEWbjQIug", "text": "I was really impressed with this Walgreens!  I went out of my way to go there because it is the closest location to me with a take care clinic inside.  The entire store is newly remodeled. The shelves are all back lit.  The pharmacy and the clinic have monitors to show you queue of people waiting for service.  This way you know if they are working on your script or it will show you when it is done and ready to be picked up.  The monitor for the clinic shows the estimated wait time.  There is also a section with deli foods and snacks that looked fresh and healthy.  The only problem is that the wait between being seen at the clinic an getting the script filled was VERY long.  I've also been to a CVS minute clinic and they put the scripts from the clinic ahead of everyone else as a courtesy.  I wish Walgreens would learn to adopt this policy.", "business_id": "uc5SIepmspu_1fL-9v1PNA", "stars": 4, "date": "2013-04-16", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "cH1lLTHReO6uDTif9bfOBA", "review_id": "qJM5o-kMI4PlN6XLlaWBrA", "text": "The place is in a strip mall.  At night, it is well lit and pretty cute.  But I still favor Gelato 64 over this place for the actual gelato part.  Don't get me wrong, it's pretty good here too.  However, Gelato 64 has more complex flavor, more choices, and not as sweet.\n\n*Gelato = ok.  if you like chocolate, try the very dark chocolate\n*Service = ok...not as attentive\n*Price = it was pretty good for the portion", "business_id": "XWpkTxBLgRXxl7g2Hw62Qg", "stars": 3, "date": "2009-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "IJK_soneOLsYRuM2_2cPzw", "review_id": "N93wipWln67UbxVLqJKPSg", "text": "I walked into this establishment today with high hopes and lots of expectations as it came highly recommended by people that have used teas from this place before. I walked it not knowing exactly who worked there and not being greeted. After about 15 min or of looking around the tea area I asked who I guessed was one of the workers of the place \" do you work here\" to have a reply of \" yes but I have three people in front of you \" ... with that I said I would go. I left... I guess it was too busy for just a little bit of customer service. Best Advice..customer service will go a looooooooong way.", "business_id": "Ym256yx44Fpdeqe0NwfWsQ", "stars": 1, "date": "2014-03-12", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "LXOhR4ZUULSbBNztxYZ2dQ", "review_id": "29JDLYdPmTho2C2znafL-w", "text": "Well I read the reviews before going and decided, it's a bagel place, how can you mess that up? \nI was kinda wrong.\nI ordered two bagels toasted with smear and two iced coffees.... The bagels came out and while the other cashier was making my drinks, he was intermittently taking other customers orders... So I got my bagels within 2 minutes and my drinks took about 8 minutes.... \nBy the time I got to my bagel it was cold :(", "business_id": "H74aYRotUzWjAm8CEExOrg", "stars": 3, "date": "2014-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "Rg4gzsz3w00vRlIOXcGUIA", "review_id": "Om-YdF2lRQdKV4FPAQFnnQ", "text": "I grew up around my hometown coffee house where I practically lived, so I was pretty stoked to find this place 2 miles from my house in AZ. I've stopped by here and there over the years, but now I come more often. I'd love to be here all of the time but alas I can't.\n\nI teach and write online and many of the times, the wifi here is so slow. I've talked to the owner and he explains that PCs with viruses pound their routers with packets and it slows everything down. He said everyone should buy MACs. This sounded odd to me, but, in his defense, every time I convince the barsita to reboot the router, it's faster for a little bit. Still not as fast as other places with similar number of customers. This is why it doesn't get 5 stars from me.\n\nI love their drinks. I get a 32oz (no idea why Joe A. said their ice teas come in only 16oz) black passion fruit tea. Totally yummy. I always buy a refill up front for when I leave. If I need a kick, I grab a large hot black and white frost, too. No idea what's in it, but it gets me flying until they close at midnight.\n\nAh yes, they're open until midnight, and NO where (coffeehouse) else around here is open that late. They're also on a lake where ducks are known to walk under your feet and people bring their dogs. If you don't mind the smoking, sit outside. That's the best place to sit. \n\nAnd yes, parking is a challenge but well worth it.", "business_id": "l1MZjZK2tLxfFRB62lQmsg", "stars": 4, "date": "2011-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "OaLILaKTMjQeoSy9IqFGYg", "review_id": "m8SJBs-EoxYX06dNUSqnvw", "text": "2nd time come to this coffee shop. The staff here was rude, almost like annoyed. The wifi is useless as well.", "business_id": "l1MZjZK2tLxfFRB62lQmsg", "stars": 1, "date": "2014-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9cVoiqhgWJ4J4So08ljUDA", "review_id": "WYpLDih_qwJoTI9LaA6SFQ", "text": "Probably the better one's in the nearby area. The Staff are very nice, drinks are made well and never a long wait.", "business_id": "_9JDgUdXbCn1Vx-nj49VJg", "stars": 5, "date": "2015-04-06", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "ODW4e78LfvY5Ch4s1kzzjw", "review_id": "5IuWRovrp8dzoEPHlaJxUg", "text": "The best place to get those hard to find Asian items along with standard staples.  Big selection and good (sometimes unbelievable) prices.   It can be a bit hard to find things and don't expect for help in english.", "business_id": "5KG0A3WlC7K3DAXtrIFFjg", "stars": 4, "date": "2009-03-25", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "k4-6lakq7t3kCgbvPxcuvg", "review_id": "wj5KwvF7ip32E33g82ZzCQ", "text": "The biggest and coolest Asian grocery store in the Valley.  Okay, okay, maybe not the Valley, but of all the Asian grocery stores that *I've* been to in the Valley.  And their prices are very reasonable so you can easily afford to be adventurous and try new things.\n\nNot only do they have products from all the Asian countries, but they have products from many other countries too.  Canned goods, household items, bakery, frozen, fresh seafood and meats, a huge produce section. You name it, they probably have it.", "business_id": "5KG0A3WlC7K3DAXtrIFFjg", "stars": 5, "date": "2013-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "8uFr-CYB9C5lldTGaJg7SQ", "review_id": "Q9brUFKaAGIyfMN50Gwgqg", "text": "Pretty nice place.  I had the Banana Lovers smoothie -- the only fruit in it is banana.  It could've been a bit more banana-y, but I was just really impressed that they had such a smoothie.  I don't ever remember seeing a pure banana smoothie before.\n\nIt looked like  the family was operating it whilst I was there, and the owner was presumably running the cashier.  He seemed like a nice guy, even when dealing with some difficult customers.  I'd definitely come back here, given the chance.", "business_id": "5D1DG-EUUO3pMvMOuY6U9Q", "stars": 4, "date": "2013-05-30", "type": "review"}
{"votes": {"funny": 6, "useful": 8, "cool": 8}, "user_id": "UsULgP4bKA8RMzs8dQzcsA", "review_id": "LejOcRI6cp-MsvfHDriIAA", "text": "I happen to like Starbucks. no matter what all the haters say. \n\nIt's consistent , they make my drink perfect every time and the girls here are always friendly in the morning. \n\nThey can get busy, so I don't really like the line, but when I want a drink that I know I'm gonna enjoy I'll definitely stop here knowing it will be worth the wait. \n\nI LOVE their Green Tea and recently found them to make a very tasty Dirty Chai. \n\nIt's definitely the spiciest chai I've had, also one of the strongest espresso's too. \n\nI like the spice and when I'm really in need of a super boost it's good to know I can stop in for my crack in a cup! ;-)", "business_id": "yMkXrAbKr3C1BjXIj6CIzA", "stars": 4, "date": "2009-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CBeykieWzLwJs0VLliRmqA", "review_id": "8celUw_rhjp2MMLoCVYs9w", "text": "If you want quality meats, veggies and fruits AJ's is the place for you. \n\nThe bottom line is you get what you pay for here. Everything is great.", "business_id": "oOo0xGOVq7cYTP1fORdoFg", "stars": 5, "date": "2013-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "T7J9ae0wTskrI_Bgwp-4cA", "review_id": "wO06xYWYil8J8gGHpt_bhQ", "text": "I go here for the drinks and the avocado eggrolls.  Back when I ate meat I loved the pasta with chicken and asparagus.  I never order cheesecake here though.... maybe I just don't think cheesecake is worth the calories.", "business_id": "78IaYCf9ktUep4UhhjXbTg", "stars": 4, "date": "2008-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fbXyGklF3jZ7hqDetmwDUQ", "review_id": "GZuGivHXZXTs9COJVN2Ksw", "text": "Cheesecake Factory does some things well but breakfast isn't one of them. Tried an egg dish one more time and yep, they still overcook them, brown and dry.  Way overpriced also, $16 for eggs and coffee... \nI'll be back, but not for breakfast.", "business_id": "78IaYCf9ktUep4UhhjXbTg", "stars": 2, "date": "2014-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "C_gziNuJBZNgetGiZw9ZOQ", "review_id": "y6M71ijHx7We_Bs_cWNPHA", "text": "The place I will always remember, the place I got engaged! They always have great food! My favorite is their ranch and Caesar dressings! Cheesecakes to die for! And the staff is always great and on top of everything. Only one time I was feeding soup to my 2 year old and there was a paper clip inside his soup that my husband took a bite of. But you know restaurants arn't always perfect, but this place is way better then some. I love the Cheesecake Factory!", "business_id": "78IaYCf9ktUep4UhhjXbTg", "stars": 4, "date": "2015-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tBYmmLqwI0xFFXy-B52Buw", "review_id": "7erRfEZGPcW2zVke6zmTpg", "text": "Breakfast is still the best thing going here. After that, the place goes down hill. Changes in management haven't been the best and it doesn't feel as friendly anymore. It can get busy on the weekends, but most evenings are relatively dead.", "business_id": "U9iWs_XQ88IEj_Cgawyz4w", "stars": 3, "date": "2014-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uGWoaSdH2gOtl_Gjo9G40g", "review_id": "ZrKGoW01gnNv9_5xKsYmtA", "text": "I remember coming to this location after a long day at work for HH. Not much has changed. The food choices are still extensive....lots of good beer on hand and the service is still as solid as ever. This is probably my favorite location out of this chain just because over the years, they have been consistent and that's a difficult thing to find nowadays.  \n\nI've always liked their fish tacos and calzones. You really can't go wrong here.", "business_id": "IMGW6y8wHQCfr_6k-YXg_A", "stars": 3, "date": "2011-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Eaf8rp_tMi4rRo_WsIP-EA", "review_id": "Y6-S0Gl_ck5Ywjjlw4BLWA", "text": "What is that smell?!? Just walked in, had to leave to throw up... Didn't make it past the hostess stand :/", "business_id": "IMGW6y8wHQCfr_6k-YXg_A", "stars": 1, "date": "2013-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cw-6s5AjOfJnDmOq7N-WaQ", "review_id": "A3cBKToTqD3J-RNatpDzYw", "text": "Stay away. Had to send back to kitchen 3 times a very simple order. Fully discontinued diet root beer. Not impressed.", "business_id": "IMGW6y8wHQCfr_6k-YXg_A", "stars": 1, "date": "2015-04-30", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Eyl4GLdUefGVMIHjS4wvng", "review_id": "JYDHLR6iefh1nefWKhBslw", "text": "Very disappointing. Originally came to restaurant on a recommendation and was impressed, but after 5 years away i did not like the changes. The place has turned into a dive bar, and the servers are truly crabby. It is impossible to tell who is a guest and who is a server. The food is mediocre, service and atmosphere terrible. I will stay away from this restaurant and would advise others to do the same.", "business_id": "xuEsUDFIWIEnBXvj1EBXlw", "stars": 1, "date": "2011-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "CayYjCjDVk6Wn8Ep4EuOCA", "review_id": "y42eyKqZgM2Ws_NtWzeCSQ", "text": "I've got a question - When did cafeteria style, cow herding, awkward, wait in line service become the norm? \nI've been to Liberty a couple of times now and I just don't get it. \nThe food is mediocre. \n\nFor breakfast I have had the salmon plate, the pancakes, and the quesadilla. \nThe salmon was - eh. There weren't nearly enough crackers or toasts or whatever you want to describe them as for the amount of salmon. The \"dressing\" on the greens was almost nonexistent even though it had a pretty good flavor. The salmon and capers were good, but I've had better.\nThe pancakes were just overpriced. I don't think I should have to add in an extra 2 dollars or whatever it was for blueberries. The TINY amount of syrup they give you is ample enough for one pancake, not three. \nAnd the quesadilla? I just don't get their \"homefries\" or \"potatoes\" or whatever they call them. It's more like an onion casserole. They shove them inside the quesadilla, which is filled with eggs and chicken and salsa. It's HUGE. I would split this if I go again.\nThe coffee is SUPERB, though. Great flavor. Rich, robust and not bitter. \nParking is ample - there are a lot of places to park around the neighborhood, and the revitalization efforts of this \"historic\" neighborhood are noticeable. \nThe little market where they sell things isn't anything great. You can go to the farmer's market on Power Rd. and get better prices. And AJs has most everything else at comparable prices. (Yes, AJs prices are comparable to Liberty Markets). I do like the idea though. If they could procure items that were \"hard to find\" then this concept would play out nicely. \nMy overall observation, however, is definitely the flow of the service lines. ?? I really wish there was some other way to herd the cats...without making it awkward and anxiety ridden. \nThe decor is awesome though. It's a great concept - and I was actually a purveyor of the original Liberty Market, so I enjoy the Owner's commitment to keep the integrity of the building. And I love the bathroom idea.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 3, "date": "2009-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "qa05pUVNapADHZXpHMPMeA", "review_id": "cYXOBj3oP7vHBs9uJENcXA", "text": "How do you start off a review when you're simply flabbergasted? Liberty Market has flabbergasted me. What a place. It is so unassuming from the street, almost leaving you wondering if you're in the right place, but then you walk through those doors and feel like you've been transported to some magical dream world. Here's a word of warning, I will be gushing until the end of this review. \n      I asked my dear Kristen to find us a new restaurant last night for dinner, and she, through a very unorthodox way, found us Liberty Market. I asked her if she was sure it was a restaurant and not a market, she said yes, and we were off. While driving over to Gilbert she let me know that the owner of Liberty Market was also the owner of Joe's BBQ and Joe's Farm Grill, this excited me to no end because those two places are wonders themselves, masterfully put together and designed, if I may say so myself, and Liberty Market is no different. \n      Sitting next to a fun water park of sorts (a great place for photography), it is set in beautiful downtown Gilbert, and right when we walked in the door we were greeted by every employee under the sun, it seemed even the chefs ran out from the kitchen to say hello. Now, this was not because it was slow, there were quite a few people there, not quite busy, but hopping for sure, they simply are awesome employees. The atmosphere here is incredible and the interior has a wonderful modern design, there is even a \"market\" where you can purchase various drinks and old timey trinkets. The salad and bread chefs conversed with us and explained how the market worked, so we sat ourselves down, looked over a menu, and picked our delights for the night. \n      Kristen stuck with tea, while I had an Anchor Brewing \"Liberty Ale\" as we began our meal sharing the starter pizza, a delicious, light, grilled flat bread with olive oil, pecorino romano, rosemary and hummus to dip it in. We were already hooked with just the starter. The bread was so good, warm and airy, the cheese had a perfect bite and the hummus was a perfect topper, nothing too heavy and nothing too lite, simply a delicious starter, leaving us ready for the next tasty morsel. I ordered the flatiron steak with chimichurri sauce, garlic smashed potatoes, and fresh from the ground grilled vegetables. The steak... oh boy, the steak... it was so flavorful, cooked perfectly, not tough at all, I'm having a hard time finding words to describe the deliciousness, it was just so good. The chimichurri sauce added a wonderful dimension, it was light but flavorful, never overpowering. I thought the potatoes were awesome, a great blend of big delicious fresh chunks of potato and small hunks of garlic, and the vegetables (carrots and asparagus) had a wonderful grilled taste that brought out their natural goodness. A truly special and wonderful dish. Kristen ordered the liberty bowl with pasta (essentially spaghetti and meatballs) and loved it. The meatballs were big and filling, wonderfully seasoned and cooked. The marinara sauce was done really well, tangy and rich with an intoxicating aroma and the noodles were tender yet had a good bite to them. I am by no means a pasta man, and I thought it was terrific. With every bite, we each were just overwhelmed with our plates. The food at Liberty Market seems to have been very well planned out with careful seasoning and incredible ingredients. \n      We will be back to Liberty Market, many many times. You simply have to try it, you will see what I mean, see why it's so special. Also, don't leave without visiting the restrooms, all of them, peek inside each one. I love cool restaurant bathrooms, and these are some of the best.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2010-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1P8Cojr9yGhVfzvF2j9fCA", "review_id": "wAxs6NypuSrWyvH_dkgeag", "text": "Support this local gem in downtown Gilbert. Simple modern architecture and a unique dining experience. 1st visit was for lunch and there subs are amazing. 2nd trip for breakfast - somewhat limited selection, but very tasty. Coffee bar and different deserts made fresh every morning also a reason to visit. Spread the word and check it out. A refreshing change!", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2011-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-wwNJ0zd82_q8Gh5XXqAEw", "review_id": "EYF8AKF5AP12BiBQLJtTwA", "text": "A friend and I had the special burger at Liberty Market. The place inside is gorgeous and clean, and set up like a bistro. i didn't  get the impression that this was a restaurant that perhaps the way Olive Garden is setup, yet the prices are in line with it.\n\nThe burgers were very tasty and I liked free drink refills\n\nThe tab for my friend and I for lunch with 2 drinks was $30. That's too steep for a lunch in a place that is more like a bistro than a more formal sit-down restaurant. If it weren't for the pricing i'd bump up to 4 or 5 stars.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 3, "date": "2011-05-31", "type": "review"}
