{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "--JzqHAkaNejih4O2O9jjw", "review_id": "n9OPYIIktsVCZeGvb7d8-g", "text": "My family makes an event out of going to Remember When to see Doo-wop Dan on Saturday nights during the summer. I usually go for the small cone, which is comparable to most other ice cream place's large. The large cone is so large that is doesn't fit out of the window, they have to bring it out the side door! \n\nThe ice cream is good, the portions are generous, and the atmosphere (almost) makes you forget you are in Windgap.  I highly recommend stopping by on a Saturday night to see Dan, listen to some oldies, and enjoy some ice cream!", "business_id": "Rjx8GcWuCzfVsKC5iPIcQA", "stars": 4, "date": "2014-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kaR-ZYSgob_8u_UFKBVWHA", "review_id": "1-LHOWIKn3-3gEamfgbyPw", "text": "This is by far, the BEST soft serve ice cream place in southwestern PA. The \"flavor of the week\" is always interesting-and tasty! Though, I am somewhat disappointed that they've switched to a lower grade ice milk, for their vanilla and chocolate offerings. I don't know if this is a matter of cutting corners, or if the better stuff simply isn't available any longer. Either way, this place is still leaps and bounds ahead of DQ, Tastee Freeze, etc. It's definitely worth the trip. It's mostly street parking, though they do have about 3-4 parking spaces off to the side. Serving sizes are huge! The small cone here, is the same size as a DQ large. And the large is SO big, they can't fit it through the window-they hand it out the side door.\n\nIf you want a real \"Kodak moment\"-order a large cone for the kids, and keep the camera, and wet wipes handy!", "business_id": "Rjx8GcWuCzfVsKC5iPIcQA", "stars": 5, "date": "2014-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cuiJrRGgOTf-nGtBMZpA0w", "review_id": "sBdQ72GNVHuYpnKSVv337Q", "text": "I grew up in Baldwin, so as a kid, the family and I would always frequent this place often. The Best ice cream around!!! I have to agree the arctic swirl is the best around!!! I suggest you try the chocolate covered pretzel!!! YUMM-O!!!! Good prices and fantastic people working there!!!", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2010-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FyCBkNXwoI_6X6apbslg4g", "review_id": "srCznxkRqD6_ORCk5hczFw", "text": "I love little soft serve places like this.  The ice cream here gets an A+.  I had my classic--small vanilla cone dipped in rainbow sprinkles.  \n\nPeople were talking about their family memories from when they'd eaten here in summers past in line--I'm not from the area, but it seems to be somewhat of an institution.  \n\nJust on our first stop we saw families of all ages, couples, bikers...everyone can enjoy this place.  Definitely stop by if you're headed to the south side!", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2010-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uqb0nlz_Pqf7zd9Xxh_mQA", "review_id": "lKVDIqKXqlNcX8A0uUl1Cg", "text": "This is one of the places we miss the most since moving from Pittsburgh. We visit every time we are here during its open months though. A visit a few weeks ago was just as good as ever! I adore their Southside Shakes (half shake half sundae). Their homemade ice cream cookies rock as well! And I love that they put plastic covers with a lip on their ice cream cones. Helps keep little (and big) hands clean while enjoying a cone. Prices can't be beat, the line moves fast, and everyone is always friendly. Will be back the next time we visit for sure!", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2011-04-21", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "JEvkfVPf_DuhX-ntE5L6bQ", "review_id": "yHQ_pTCTeJ4Grt3RiNT7BA", "text": "Best place close to the city for a Dippy cone! I grew up in small town that hosted a Whippy Dip! Every time I see this type of privately run ice cream shop it reminds me of home and lazy summer days with my girlfriends. Riding bikes to the local pool, playing at the beach on lakeside, or causing a ruckus at the Whippy Dip! Oh, sooo serious summer romances... flirting with boys while throwing ice from our slushies was a regular occurrence.\n\nFinally, a warm spring day on the books and the only place I want to go is The Page. The location is so weird! Under this huge bridge away from any greenery or picnic tables next to a low end used car dealer. I suggest grabbing your food and heading elsewhere. There is always some sort of line and it gets worse on the weekend. These guys and gals are pros when it comes to ice cream and will recite all the flavors with speed that you might miss them. It's kind of like the Cheese steak place in Philly. Know your order when you get to the counter, pay, and move OVER!\n\nThey have so many flavors of ice cream! The menu is extensive, you can get anything here, brgrs, fries, hot fudge brownie sundae, or a banana split! I will be back all summer!", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 4, "date": "2011-05-11", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "bvu13GyOUwhEjPum2xjiqQ", "review_id": "4AN0UeroJ74adMLPapEXKA", "text": "This is one of many hidden gems here in the Burgh. Check it out, freaky good ice cream, better blizzards than Dairy Queen, shakes that would have Ronald McDonald spinning in his grave if he were dead. \n\nI love Page's dairy mart, and look forward to opening day every spring, then go at least every week on those warm summer nights and have a cone or my favorite, peanut butter chocolate ice cream with butterfingers and reeses peanut butter cups running through it. Then I go run for two hours to burn it off, but it's worth it.\n\nWhy four stars? Bad intersection (Carson and Beck's Run) and parking can be a motherbucket.\n\nYou're still sitting there reading this? GO TO PAGE'S NOW!", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 4, "date": "2011-05-13", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "sS2sSWqZMnQMRoWx-Mdzgg", "review_id": "C9p5UvH_DkdRjrl61H-xcQ", "text": "Considering my absolute love for sweets - and more specifically, ice cream - it just doesn't make sense that it took me nearly 6 years of living in Pittsburgh to go to Page Dairy Mart. The only bad thing is that it's too close to where we live, so I can expect my sugar intake to go through the roof now.\n\nAs you walk up, it's easy to be overwhelmed by the signage and menu, as they seem to have everything that you could ever imagine. In fact, you might just be better off walking up and ordering whatever you want without looking at the menu. Odds are, they'll just smile and run off to make it. I mean, if they have toasted coconut soft serve ice cream, what don't they have, right?\n\nThe people that work there are all really pleasant and the ice cream is excellent! It is cash only, so that might be a downside if you're just randomly stopping by for the first time, but it's one place where the long lines are truly warranted in this town. Don't worry, though, usually the line isn't actually long at all. They take your order quickly at Page and your order will actually be up impressively fast for the amount of people ordering thanks to Page Dairy Mart's army of ice cream servers on staff. That \"line\" of people will disappear as quickly as a new one appears.\n\nA night hasn't gone by since our first visit that my wife and I haven't wanted to go back. Only our conscious willpower has kept us away, and there aren't a lot of places that have left me feeling that way, so kudos to Page Dairy Mart and their staff! \n\nHeck, it's snowing today, and I'm probably going to go!", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2012-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7JDMwDRjhGFEpsL_vqKyRQ", "review_id": "Tp97Zyi8C_3N0LJwVZlk1w", "text": "Amazing. Historical. Unique. Affordable. Efficiently run. Pittsburgh gem!", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2012-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 3}, "user_id": "g8K-AQC2_FKx5soEY0iaZQ", "review_id": "3l-fTVGGGo24Gm_-ICGLUQ", "text": "Hubby and I have taken to driving up Carson street to get to the Southside in order to avoid that HORRENDOUS traffic in Squirrel Hill.  We drove by Page Dairy Mart a few times and each time he would casually mention that he would like to go there someday.\n\nWell, we did.\n\nI wish I could comment on one of the DELICIOUS looking Sundaes, but I'm watching what I eat soooo... frozen yogurt it was.\n\nWhat I can say is that the yogurt was smooth and creamy and I LOVE that they have a ton of flavors they can \"mix into\" the yogurt so you can get almost any flavor you want.  Hubby had a cone of regular soft serve ice cream and said it was really yummy.  He also had an order of cheese sticks and said they were just o.k., so we will probably stick to ice cream/frozen yogurt from this place.\n\nThe kids working were fast and friendly so we left them a nice tip.  As someone who worked her way through college working at a frozen yogurt shop I can say -- TIP YOUR SERVERS, even if just your change -- they will greatly appreciate it.  :-)", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2012-04-23", "type": "review"}
{"votes": {"funny": 7, "useful": 8, "cool": 5}, "user_id": "nEYPahVwXGD2Pjvgkm7QqQ", "review_id": "yuesPs61wg8KL1j2qP77Cg", "text": "Dear God, everything on the menu sounds like my personal heaven.  Shakes, sundea's, splits, soft server... Give. It. All. To. Me!\n\nMy friend and I were driving through Homestead past Nancy B's Bakery when she said \"You know Page Diary Mart makes an ice cream sundae with her homemade chocolate chip cookies?\"  No more words needed to be said between us.  The decision was silently made that we'd head down Carson Street and there as no stopping us!\n\nThe only child in me wanted to order the entire chocolate chip cookie sundae for myself.  The calorie counting adult in me knew the right decision would be to split it.  I mean, let's get real... this thing is monster size!  You can easily split it BUT... I could EASILY gobble that whole thing down in one sitting!  \n\nIt was amazing!  We watched them heat up the cookies and toss them into the soft serve vanilla ice cream that melted it just enough that it mixed in perfectly with the warm chocolate chip cookie.  Add hot fudge and it was ice cream overload to the max.  But in the best way possible.  \n\nMe thinks I'll be stopping here a lot this summer... it cannot be avoided!", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2012-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "_e5drmTJBSV0yiFBrTimtg", "review_id": "qG1Zx9NLDe7E3NarY01ezQ", "text": "Can't go wrong with this place. We've been here a few times and I always get the same thing (small chocolate ice cream in a cone) but now that I'm reading other reviews, i NEED to switch it up and try something else. Plenty of parking for this sweet little place.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 4, "date": "2012-05-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "hB3VhsSKZ5grSGUqYQ-b9g", "review_id": "V0JlUxG1666uB4vtVOc5Tw", "text": "Great ice cream. I used to come here all the time when I lived closer. The ice cream is great and the food is pretty good as well. Just your typical burgers, chicken fingers and other fast food but still decent tasting.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2013-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QYfjdGWoFl9Q_Wj13bgRWA", "review_id": "KpV00_jD4Yu1zFCPqU96WQ", "text": "Best ice cream place in the 412 without a doubt!! Being from Homestead I grew up on Nancy B chocolate chip cookies.\nAnd Paige's Nancy B cookie sundae is like heaven on earth \n\nIt's worth the long line wait they usually have every night", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2014-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_U4Yzv35iTH6aVZ8eqSjoQ", "review_id": "3cowBa0UNArlCJlzQI8Crw", "text": "Bring Cash! Extremely cheap ice cream but it's the very best in this region. We're not wasting our time at Dairy Queen any longer. They are open for most of the year but close  in the winter months. This is our new weekly tradition.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2014-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dqMeWT_n6VN8l078B4cLKw", "review_id": "oqmDkRuVIc8TT-f3m_FgNA", "text": "This place is a little gem! Hidden just down E Carson, past all the shops and busy streets there is a tiny little unassuming building on a large corner lot. I've never been a fan of soft serve or gone out of my way for it, but this place will make you do just that. Not to mention the fresh squeezed lemonade made to order (yes, they squeeze the lemons right into your cup.) Burgers and fries are also made to order, so be prepared for a short wait while you prepare mentally for the heaven you're about to consume. I'm not a fan of their fries (they tasted like they were made in old grease) but wow that cheeseburger. I have a small appetite and can't usually finish most things - so when I ordered my burger and fries I let the bf know he was expected to finish it for me. Little did we know he wouldn't get any of that delicious burger, because the second I took the first bite the rest magically disappeared. \n\nOh! They also have old fashioned dip cones which are one of my favs. \n\nDefinitely recommended.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2014-05-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W60KQR8FFtwko1zbAxLm8g", "review_id": "uN3G79KgYzirwZ_mM3SxNg", "text": "I have had lots of items off of their large menu and everything has been good.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2014-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IB4Oxk8IlNG2K0oH0I9Dkg", "review_id": "rAl6ik5lsDkie92oGs6Fpw", "text": "What can I say? This place is iconic here in the South Hills of Pittsburgh. Rich with history, you can't go wrong on a summer's eve with their treats. I've never tasted their actual food (they keep adding non-dessert items to their menu), but there is something about their plain old soft-serve that does the trick. I think it's just the fact that it's from Page's that makes it so good. They also have great milkshakes, dirt sundaes and countless varieties of snow cone flavors. There may be a line to the street, but it's worth it. Skip Diary Queen and make your way down the street.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2014-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "AEQowxQ8076LsWNirwHTww", "review_id": "RoqHwMDdz5D-8I-kmKZSdA", "text": "Most likely the best ice cream place in the area. Its modern yet nostlagic. They are sure to have something for everyone. Today i had a chocolate malt and it was so legit i may just have to get another one tomorrow", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2015-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LiVXtHxGX6TjNHsBWeb9KA", "review_id": "R5xbEve3UY9ktXIOQZrlCg", "text": "The soft serve here is very tasty. They do the chocolate chip cookie sundaes really well. They also pack in the flavor in the birthday cake soft serve. It is always very busy despite a run down makeshift parking area, not much curb appeal, and being cash only.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2015-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KSS6v5fcZNoelu4eEZCFcw", "review_id": "Yjlq45DgVRPELx1E9nzWpA", "text": "Everyone waits for Page's to open in the Spring and is sad when it closes for the winter. It's a small establishment with no seating, but there is always a line at the order windows. Page's is a Pittsburgh landmark. My family has been going for 20 years but it's been around for many many years. \nPage's serves hamburgers, icecream cones, sundaes, shakes, pretty much anything you can do with ice cream . . . and it's all good. One of my favorite's is a sundae made with a Nancy B's cookie. (Please tell me that you know what a Nancy B cookie is!) but sometimes I order just a simple twist. \nPeople hang out in the parking lot and eat there ice cream. They bring their kids and dogs and everyone is chatty and happy. It's a fun place to be.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 4, "date": "2015-04-09", "type": "review"}
{"votes": {"funny": 3, "useful": 7, "cool": 4}, "user_id": "4DrkZqFqLcyRcLWuQUXFeQ", "review_id": "OTmMiuzuXFnMD_ObeDV_uQ", "text": "I filmed my music video to a song called ICE CREAM ROAD here.  This place will always be a place that's important to me in Pittsburgh.  Beyond that, it's just a awesome family owned Ice Cream Parlor.\n\nIf there's a type of ice cream or sundae or frozen dairy concoction you love they got it.  From blend ins to banana splits and hot fudge sundaes and flavored soft serve.  Speaking of, you can combine flavors which I just learned of and blended peanut butter and banana, it tasted exactly how I had hoped.\n\nThis place gets ridiculously busy on a hot day so be ready to stand in line for a half hour if its one of those days.  While you stand in line copy and paste the info below into YouTube\n\nHITTofMCM - ICE CREAM ROAD\n\nYou can listen to introspective raps in front of the same place and road the video was made while they blend your soft serve.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2015-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KOrggEZ4aa7JzVIuY-Zgkw", "review_id": "dW5wqjur6JwoLB7f7w6Vpg", "text": "I have to go back to this place! It's a gem hiding in an old gas station. I had the cinnamon roll Sunday and it was just big and amazing. I mean for $4.25 it was big. I mean it's like the size of something from the Cheesecake Factory but with a price from the 90s. They have a massive selection and it's hard to pick. If everything is as good as what I had today I can't wait to try something different every time I go back from now on. This place is a must try.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2015-05-05", "type": "review"}
{"votes": {"funny": 5, "useful": 8, "cool": 8}, "user_id": "4DrkZqFqLcyRcLWuQUXFeQ", "review_id": "8qUE6pIbt6auL6IMPw7wBw", "text": "I filmed my music video to a song called ICE CREAM ROAD here.  This place will always be a place that's important to me in Pittsburgh.  Beyond that, it's just a awesome family owned Ice Cream Parlor.\n\nIf there's a type of ice cream or sundae or frozen dairy concoction you love they got it.  From blend ins to banana splits and hot fudge sundaes and flavored soft serve.  Speaking of, you can combine flavors which I just learned of and blended peanut butter and banana, it tasted exactly how I had hoped.\n\nThis place gets ridiculously busy on a hot day so be ready to stand in line for a half hour if its one of those days.  While you stand in line copy and paste the info below into YouTube\n\nHITTofMCM - ICE CREAN ROAD\n\nYou can listen to introspective raps in front of the same place and road the video was made while they blend your soft serve.", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2015-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 4}, "user_id": "WzaaorVCmUTQvu4mScunNg", "review_id": "nU9c4T24SKlifPNUtSVYxw", "text": "I've been waiting to try Page Dairy Mart because i live so close, but didnt have access until i recently bought my car. \n\nWe stopped in last night for the first time. There are soooooo many options. The menu itself is huge, then all around the windows they advertise even more options!! I couldn't get a good look at the menu because the line was long & heads were in the way. The next thing i know, it was my turn and i still couldn't decide. \n\nI asked if they had a brownie sundae and ordered that. Bobby said he was only thirsty and ordered a banana shake. \n\nI enjoyed my sundae but next time I will try something different that's on their menu. They had so many options for an arctic swirl so I'm looking forward to trying one of those next. Also, the banana split i noticed someone having was gigantic. Also, the ice cream itself on a cone even look delicious. I'm so glad to finally have access here and to live a 5 minute drive away!!", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 4, "date": "2015-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "q7MrNVt1FE23rwtWmPYWHg", "review_id": "7VMGr6Ox5aZLPl1CXhF0Kw", "text": "If you're a mint chocolate chip ice cream addict like me, you need to get their Grasshopper Sundae. It's even good in the winter! We came here in early March when it was still wintry out. In fact, it snowed when we got here, and I didn't care. \n\nThe place was clean, the service was good, and the decor is cute.", "business_id": "LV_OCiR9rOHVHgdhbpqw2Q", "stars": 4, "date": "2012-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_e5drmTJBSV0yiFBrTimtg", "review_id": "2I8lVTZ1R06QDG36_mnWcA", "text": "Can't go wrong with ice cream! Tons of flavors, really sweet people working there and plenty of place to sit inside.", "business_id": "LV_OCiR9rOHVHgdhbpqw2Q", "stars": 4, "date": "2012-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mcREO9MgpnetJxJZQMZHNA", "review_id": "BDDcEATiO3CPzB88iD95Zg", "text": "Sweet little shop - great place to take the kiddos, and nice to see a huge selection of hand dipped cones and it's a nice departure from the yogurt bars.", "business_id": "LV_OCiR9rOHVHgdhbpqw2Q", "stars": 4, "date": "2014-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YKcS20VYayiLCEGoO9qFCA", "review_id": "EjKKruascdjgVigxrjcNYQ", "text": "Great shop! Watched them make their waffle comes right in the shop and they are delish!\n\nTried the salted caramel and was surprised to find little chocolate covered caramels inside! Yum!", "business_id": "LV_OCiR9rOHVHgdhbpqw2Q", "stars": 4, "date": "2014-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-mkeftjZkAAmAegAlgZY_Q", "review_id": "LZSSL1AJYvgN0WYu-OKtqA", "text": "We took our three grandsons here today for ice cream--what a find! It's a terrific ice cream shop with a wonderful neighborhood feel about it. The guy who served was also unbelievably patients with our 9-year-old twins who took FOREVER to chose what flavors they wanted. Oh, yes, & the Hershey ice cream was smooth & tasty!", "business_id": "LV_OCiR9rOHVHgdhbpqw2Q", "stars": 5, "date": "2015-05-05", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "9HCfCmd0t5GErgm7He6AeQ", "review_id": "GhjEWSwng-mv2U8cQcIHGg", "text": "A hometown staple that has been here for years. Great place to get soft serve ice cream as well as sundaes, waffle cones, and other food.\n\nOn this visit I was in the mood for a strawberry sundae. Line was short so didn't have to wait long. It comes in three sizes. I opted for the medium. Real strawberries added to the vanilla ice cream made it delicious!\n\nOn hot summer days be prepared for long lines let alone ice cream melting once served. This current stand is under renovation but is open during the process. It is a little tricky to park since it sits on the corner of a major intersection.\n\nStaff is friendly and cooperative.", "business_id": "9aw0t0rlACKkMaxsX0KlKA", "stars": 4, "date": "2015-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "0xIQG-NrqMx5id6yJpQp8Q", "review_id": "T9ptBcdsJXB7Y-dCddJm_A", "text": "Why do people head to Klavon's?  Walking through the door is like walking through a time portal to a simpler time when people were less rushed and people were more chill.\n\nKlavon's used to be a drugstore and the original owner used to be a pharmacist first with the soda fountain as an aside.  The store was closed for 20 years until the current owners, grandkids of the original Klavon decided to reopen it in honor of their dad and grandpa.\n\nAs for their menu, they have all the standards you would expect of an old school ice cream parlor with milk shakes, sundaes, soda floats, as well as just basic ice cream.\n\nBe sure to bring cash, because even though they take debit, there's a service fee to use it.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 4, "date": "2010-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "yfRrC6MhxpIJ4-xMcrmk5Q", "review_id": "qFZGrvJzA9ri-3FFAqlDMQ", "text": "We just happened to wander in after an afternoon of exploring Pittsburgh.  What a gem!  What a lucky place to stumble in!\n\nKlavon's was a drugstore/soda fountain in the early 1900s.  All the original counters, glass cases filled with old bottles, stools, and mixers are still there.  We had the turtle sundae with amaretto whipped cream, which was amazing.  I can't wait to come back and try their phosphates and egg creams!  It was like stepping into a time machine. You can tell this place is beloved by locals; several elderly couples, families with children, and single people with dogs on leash came by for cones, sundaes, and floats on the beautiful sunny day.  The grandson of the original owners was chatting with customers, and the place had a really special vibe.\n\nYou almost never see places like this anymore - if you're in Pittsburgh, don't miss it!", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 5, "date": "2010-05-17", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 2}, "user_id": "E58QYhnS9M53mLSqBGP37Q", "review_id": "A9jnQFSDvhlJpvbSstrkfg", "text": "There are five reasons why you might want to go to Klavon's.\n1. You're in the Strip District anyway.\n2. You're interested in Pittsburgh history.\n3. You've never experienced an old-time soda fountain before.\n4. You're looking for some hard-to-find penny candy.\n5. You want some damn good ice cream.\n\nI went for all five reasons, and I wasn't disappointed. Wait. That doesn't express the depths of my enthusiasm for Klavon's. KLAVON'S RULES!!!!!!!!! There, that's better.\n\nLet's take it in order. You have lots of dining options in the Strip. Now, Klavon's is a few blocks away from most of the popular places (we were at Salem's, which is also great, but that's another review), but it's easy to walk to and easy to find with all the neon signs.\n\nWhen you walk in to Klavon's, you're taken back in time. Choose a little booth or table, and gaze at the decor. Maybe you'll see an old liniment bottle from back when Klavon's was a drugstore. Maybe you'll notice the high-water mark from the 1936 flood (close to the ceiling!). Maybe you'll see the old penny scale or the phone booths. This is a place where history is celebrated.\n\nThe menu isn't extensive, but you still have lots of choices. Why not try an old-time phosphate, malted, or egg cream? It was good enough for your great-grandpa; it's good enough for you. I treated myself to a root beer float. It was the best I ever had. The reason? Both the root beer and the ice cream were made locally. On the way out, why not browse the penny candy racks? For a quarter, you can try a bunch of hard-to-find treats.\n\nI'd be remiss if I didn't mention that Mr. Klavon, the grandson (I think) of the original owner, still runs the place. A glipse of his epic mustache alone is worth the visit, but he's always willing to give you a tour. Friendly people in friendly Pittsburgh. I can't wait to go back!", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 5, "date": "2011-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WzaaorVCmUTQvu4mScunNg", "review_id": "9l6jJq5COhUOuvzrsSD4sQ", "text": "We finally decided to take a trip to Klavon's. Funny- we actually were in such a hurry to get here that we both left without our phones.. which means we'll have to take another trip very soon to take pictures & show off our goodies! ;)\n\nThe menu consists of different sundaes, floats, splits as well as regular ice cream & treats (i heard one girl order a \"Pecan Ball\" I've never heard of it, but it looked delish.)\n\nBobby ordered the Amaretto Sundae which comes with... well im not exactly sure so don't quote me. It had death by chocolate ice cream & multiple cherries as well as whip cream. I want to say it also had amaretto sauce but im not sure. I was too busy enjoying mine.\n\nI ordered the Turtle Sundae. It had chocolate ice cream, caramel and chocolate sauce & pecans. I got to choose my whip cream (!!!!) I chose chocolate. They also had caramel regular & amaretto whip cream (say whaaa?!) . \n\nI think the reason bobby chose his amaretto sundae is for the special whip cream, but i don't remember her asking. No biggie though! \n\n We only ordered the wee size (one scoop of ice cream) but that was more than enough to satisfy us. The service was extremely friendly by the way. We small chatted & she literally read our minds and brought us 2 glasses of water. \n\nIt was fun sitting at the bar and enjoying our sundaes. Can't wait to head back.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 4, "date": "2014-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "d8A2CG-srT6Vbl2tDComkg", "review_id": "O2Btvvidj9kgtSvTeSDYfQ", "text": "Just found this gem.  This is a great place for every ice cream lover.  Great place to hang out with friends or to go on a date.\n\nI recommend the sundaes at this place.  This is pure 50's and 60's style that isn't forced.  Staff are very friendly and patient.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 5, "date": "2014-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "GJI6yunTW74EUfgUFHR5dw", "review_id": "XOfTuik5ydCD36FX72454Q", "text": "My 93 year old grandma is an ice cream maven and Klavon's is her definition of heaven.  Our whole family loves going here.  I would give them six stars if I could.  But before my review, a word of warning - their hours on their website are completely inaccurate and not updated so don't go by the website alone.  As of writing this review, their hours are Noon - 8pm daily, I believe.\n\nKudos to the new owners of Klavon's.  The original family sold it about a year ago and the new owners are following right in their footsteps.  The people who work there are still so dang nice.  The place is so down to earth.  The original 1920s decor is still perfectly intact.  (Thanks for not going over the top and making this place cheesey old-timey.)\n\nVibe aside, their food is great.  They now use Penn State Creamery ice cream.  They have a decent sandwich selection.  The prices are really good.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 5, "date": "2014-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s0pIuSTpb0dLz8UCU0PWPw", "review_id": "5b1N4a-pC8FHNahUb_u27w", "text": "My boyfriend and I wanted to go to the best ice cream shop in Pittsburgh, so he did some research and came across this spot. I have been wanting to check out the area too, so why not?\n\nWe loved it! Finished both the sundaes and they were amazing. The man who was working was so polite and willing to help us out too, which was awesome. I think the hardest part was picking which sundaes to get. \n\nEasily the best I have had so far and I highly recommend. I will be back!", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 5, "date": "2015-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "96dy3zv_epn5kquMj4g2lQ", "review_id": "F-i398lPu8_10xTWk4kw0w", "text": "A bit of a walk from the main part of Pittsburgh \"Strip\" district but the ice cream treats are delish!  We shared the Pecan Ball.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 4, "date": "2015-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "68vjXoLMogT5p1jb8enlVQ", "review_id": "BR_qccsZj8-AOb8ldlHr-g", "text": "There's no place in Pittsburgh like Klavon's. Actual Klavon's. Most believe it's not the same since the take over which is a shame, but we're so lucky to have this one still (I say take over, but really this was saved by the current owner). Unfortunately the current set up with the ridiculous amount of odd candy sold here makes it a little cheap. That's the only negative I can find.\n\nA fair warning, Klavon's seems a bit out of the way if you're doing the typical Saturday afternoon in the strip but definitely doable.  The ice cream is from PSU which is delicious but the real point is to have one of the sundaes in this 20's shop. Not to sound corny, but it is just uniquely entertaining. Where in the city are you getting hot fudge on some white house? No where. The service was awesome too; we spent a fair bit of time talking with the young man behind the counter about the most popular items (turtle sundae!) and his favorite, a genuine, classic banana split. This isn't a frozen dairy historical society so cut the kids some slack, by the way.\n\nTake the extra few blocks to Klavon's and get the amaretto sundae, two scoops! Add the fudge! And chocolate whipped cream! And cherries! I could go on forever, but you understand. It's worth it.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 4, "date": "2015-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LZKSz7J1MAbm2-DFDaTEGA", "review_id": "MPrjOaEcVPwJ6WNeZAF9Rw", "text": "Solid ice cream. When you see the place and the ice cream/toppings, you get nervous that the quality will be poor (syrup comes out of a big container, they put random candies as toppings, something you'd see in your average ice cream shop). Turns out the ingredients are a lot better than they appear.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 4, "date": "2015-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RhpNRexPihjkKcmVBBNQoA", "review_id": "xtVeMrtJKgaQ9wJflOK9GA", "text": "Best place in Pittsburgh I've been to get ice cream so far. Sooooo many options and just not enough stomach space to do so. Next time, next time.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 5, "date": "2015-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "57tPrvg7i2R3QjsxTiY-Xg", "review_id": "2Yp-6Acb3etqnfS1nVgBRA", "text": "They have awesome soft serve, home made ice cream sandwiches.  I look forward to the time when twisters reopens after the winter.  They are cheap, friends, and most importantly delicious!  Make sure you get ice cream sandwiches to go, because after you finish one you'll want another one!", "business_id": "3_3yJMo2dTPeq8woOW69IA", "stars": 5, "date": "2010-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "53zB4qPi1eTctwLXwFfE1Q", "review_id": "kDigb1J53noO8bZ5nR3MNA", "text": "Twisters really wasn't that great. I had a snickers flurry. The vanilla soft serve just didn't have the right texture and the snickers tasted stale. The medium size, which wasn't very big at all, was $4. I only give it 3 stars for the different choices they had. Vanilla, choc, or twist soft serve. Different Hershey's brand ice creams, milkshakes, floats, flurries, cones, slushies. And more! Other than all the choices, I would've given it 2 stars. It does have that cute small hometown charm and the woman working was very nice.", "business_id": "3_3yJMo2dTPeq8woOW69IA", "stars": 3, "date": "2014-05-28", "type": "review"}
{"votes": {"funny": 7, "useful": 10, "cool": 9}, "user_id": "9OZH1Ecw-qUkCW5MS0NefA", "review_id": "m0HxSzJme2kXGBsCeLVM0A", "text": "Three words: Cheap water ice!\n\nAfter a walk in Allegheny Cemetery yesterday afternoon (Memorial Day), CM and I were hot.  After checking to ensure that I had cash, I suggested that we stop by for a cool treat, and he assented.  Fortunately, when we pulled up and parked, I saw a sandwich board sign on the sidewalk stating that they were open.  Hooray!\n\nMy original plan was to order a cone of soft serve ice cream and have it dipped in chocolate topping and then in sprinkles.  However, the woman working told me they didn't have chocolate topping (?!?), so I had to change my plans.  CM was intrigued by the water ice (Italian ice), since he'd never had any, and decided to order one.  I decided to do the same, since I'd been looking for an alternative to Rita's (bleh!), but water ice is surprisingly difficult to come by in the Burgh.  I asked the woman what brand it is, and she informed me that it's Hershey's (I wasn't even aware that Hershey's made water ice, but apparently, they do, and it's sold under the Via Venetto label.)\n\nFor our water ices, CM ordered watermelon flavor, and I ordered tie dye, a combination of lemon, lime, and blue raspberry flavors.  The tie dye was a nice combination of tart and sweet flavors, but I wasn't a huge fan of the watermelon, since it tasted rather artificial to me.  The texture was velvety, as is appropriate for water ice, and it was cold enough that it didn't melt quickly.  Best of all, the price was right ($2.14 w/ tax for a small)--a dollar cheaper than Rita's, which is overpriced IMO, and with comparable or better quality.  (I'll have to see if I can get them to make a gelati!)\n\nOddly, despite the claim that they didn't have chocolate topping, I saw a kid with a cone that appeared to be dipped in just that.  I'll have to try ordering that again next time to see if this was a fluke.  Regardless, I'll definitely be stopping back here soon to get another fix of cheap, delicious water ice!", "business_id": "3_3yJMo2dTPeq8woOW69IA", "stars": 4, "date": "2015-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l-MUNNvM1UKB-xXrfKI8rQ", "review_id": "JML9BBEUNrQJC2T94St8kw", "text": "Horrible service. I have never been treated so poorly in a cafe. The coffee wasn't spectacular, and it was fairly expensive for what it was. Head down to Starbucks or the Coffee Beanery.", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 1, "date": "2009-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DSWiwtUyWK1YwY8NBKDhGg", "review_id": "UrqA-g7uYFLeWpbSAf28GA", "text": "This coffee shop is fine -- decently made espresso drinks and I've had no problems with the service. I use this as a backup location when the others in Shadyside are too busy. Not a huge fan of the atmosphere inside...", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 3, "date": "2010-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_7Lg8iTWpFc0O7PEA8FmbQ", "review_id": "Li7j21s2bBEQgWrZmm7-Vw", "text": "I see people sitting in Jitters' chairs outside all the time and I like the decor so I really, really want to like this place but the first time was the last time. The service was horrible and their coffee didn't taste great. I waited for ten minutes at least before the two people manning the cashier/bar before I was paid attention to and serviced as they were busy chatting with one of their friends who had stopped in. After getting my coffee, they were low on the sugars and milks and other fix-ins so was not pleased even further, especially for what I paid for a small coffee.", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 1, "date": "2011-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WdfCEDpCFMS0jwfpRfinjA", "review_id": "TDzPuD_lR0xvu8GQi8TRIQ", "text": "highly recommend - Ravi and the staff are the best in Shadyside", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 5, "date": "2014-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mOW_Mhjc5jHITVYAk5_Y3g", "review_id": "EGAFyDafwLcKgApDWUEYtg", "text": "Love this place. Their Espresso is damn good and it's a great environment to get work done.", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 5, "date": "2014-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jd5yWDLRt5NnwTZdPRAnuQ", "review_id": "oKORf4SGYWZXaSZZqEqYxw", "text": "Quiet little spot at the end of Walnut street and my fav spot for doing a little work!\n\nI always get the same order of a cup of coffee, but all the other drink options look yummy as well!  They also have a good assortment of baked goods and ice cream!!  And in my opinion, their coffee is better than Crazy Mocha or Coffee Tree.\n\nThe space is bright and clean and the baristas are also really friendly.", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 4, "date": "2014-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "O-KrHQrzpgZ-9nyVTuWaTw", "review_id": "9-i5e8OTKWcddXkidUB2ew", "text": "The friendliest staff, the best coffee and treats, the best prices for coffee in Shadyside. Everything tastes high quality and the employees clearly take pride in their work.  They food they serve is wonderful - I love the chocolate chip cookies!", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 5, "date": "2015-05-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "K55Nczl6Lvf38dIzMOpErg", "review_id": "E1QimnYy2kCFJHspfDLzVQ", "text": "I really love this place. I have come in to get some work and writing done two days in a row and have enjoyed it. It's small but tables are not too close together. Prices are great - quite low. Hot and iced teas are good. Service is good. Bagels taste fresh. Music is not too loud. Great natural light. My new favorite spot. Tons of people stop in for ice cream.", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 5, "date": "2015-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x1tqIO9G1RX3qd6Y4TsHXg", "review_id": "VW7hY6PkX-XSwrc5_ooZ5A", "text": "Very convenient location on Freeport Road. Staff were very friendly, especially to our little one, and gave her a couple of little tastes of some different flavors to help her make up her mind. As with any Baskin Robbins, they have 31 great flavors at all times - happy to see they haven't ever gotten rid of the chocolate and peanut butter!", "business_id": "jt5lOq4Ab33j4LdfjrK42Q", "stars": 4, "date": "2013-05-11", "type": "review"}
{"votes": {"funny": 4, "useful": 3, "cool": 3}, "user_id": "wjb38S00seazA_JmghN1tw", "review_id": "98oRTxVzBCnyLZyrVuf1yw", "text": "Cheap, delicious, fresh coffee.  I'm not talking about the stale cup of plain joe you get at ANY other regular coffee shop that tastes like dirty burned coffee beans.  If your office doesn't have a coffee maker, I highly suggest making a trip down here.  If you're concerned about the preparation - it's regular old drip coffee, not percolator, so do with that information what you will.\n\nA medium java sets you back only $1.70, and they have a ton of flavored coffees if you're into that.  Normally I'm not, but I tried the \"Hawaiian Macadamia Nut\" today, and ALOHAAAAA... delicious.  You can't really beat it for a cheap and good quality cuppa.  (*side note* there is a $3 minimum for credit cards, so bring cash if you're coming down for just coffee)", "business_id": "HzZ3424aEgmElEP06l0KKA", "stars": 5, "date": "2012-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "euKe0VfdPSmt4cjSfOQxUg", "review_id": "16-VqwP0D5Wvcx5YwP-RAg", "text": "Halfpennys has been my go-to spot for lunch for years. Frankly, dollar-for-dollar, it is the best value in Charlotte for that quick, inexpensive, grab-and-go lunch, especially for those who eat out on a regular basis and just need FOOD. I have tried to find other places to get sandwiches (often more expensive), but the value isn't there. I'd rather pay $5 at halfpennys than $8 at some other flashy joint or chain. Just a better deal, better quality, better service. Try the egg salad sandwich. I haven't found it's equal. Moreover, it has been consistently good since i found this place 10 years ago. And if you have room, get yourself a chocolate malt. By far the best malt I've ever had.", "business_id": "HzZ3424aEgmElEP06l0KKA", "stars": 5, "date": "2013-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Ih0H7IESIciiIu7SGOo6SA", "review_id": "dSPq8352tx7IeG3p2u57jA", "text": "Haven't tried their ice cream yet, but I had a burger and french fries there over the weekend and loved it.  Standard short order food, all the toppings are out on a topping bar so you can fix your burger the way you like.  My mom had a Philly Cheese Steak which she said was awesome, too.  They are called Snoops now and there are black silhouettes of spies all over the walls.  Sort of a dive - but great food - I will definitely be going back to fill that greasy spoon need!", "business_id": "nhPdxY-jbf-XVQ6Hq6qJPw", "stars": 4, "date": "2007-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rWbf1_mdXUylzI3jLKKbig", "review_id": "-NW6VDk1vA7PYXRfza-9gQ", "text": "I remember this place growing up only thing changed was the name and the son runs it now still one of the best burgers in charlotte", "business_id": "nhPdxY-jbf-XVQ6Hq6qJPw", "stars": 4, "date": "2011-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "NzWLMPvbEval0OVg_YDn4g", "review_id": "LMnNszl3r1YGk9_2K26HOQ", "text": "Very friendly service - and quick too! \n\nMy food was pretty good, I ordered a chicken philly. The roll was soft and overall it was pretty tasty though and seasoned well.  My boyfriend had a chili burger which he thought was awesome. They have a sidebar with toppings which is great for dine-in patrons but a little bit of a pain for those wanting take-out. \n\nTheir fries are seasoned so well - and taste great with some malt vinegar at home (they do not offer it there). I wasn't as big of a fan of their homemade onion rings as the batter was too hard. \n\nPrices are a bit higher  than average for this type of fare.", "business_id": "nhPdxY-jbf-XVQ6Hq6qJPw", "stars": 3, "date": "2012-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4G68oLRY3aHE5XUt_MUUcA", "review_id": "tMU-QS8k_-6Rl9ZpRCnHSw", "text": "Ice cream was very good... have some interesting mix-ins to choose from.  I decided to go with the Cheesecake Break and I was not disappointed.  I think the teddy graham mix-in is what put this flavor combo off the charts.\n\nWhen we originally came into the store, no one was there to greet us, but a nice young lady came out and fixed our ice cream for us.  She was pretty meticulous with the mix-ins and did a good job.", "business_id": "IQbEYPh7OKoUmsI6VoLmTw", "stars": 4, "date": "2011-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "lpZtfD-vCqUER1yGKEvUPw", "review_id": "tyOPmXZu9f4tWmDhNGdJ7g", "text": "Ninety's is cool and sweet, just like their ice cream. I haven't had their sandwiches, but I dropped by for a seat on their patio & indulged in a little afternoon treat. \n\nThe coconut ice cream was smooth and tasty, just like I thought it would be. The staff behind the counter was a little disenchanted...maybe he was up later pulling an all nighter? Regardless, my order of two scoop of ice cream and two bottled waters came to $6 and change. That, I can handle.\n\nIf you seek a sweet treat in University City,  head over to Ninety's and be sure to enjoy that spacious shared patio!", "business_id": "M8CC5_9vEvt1yOI2pnkvKA", "stars": 3, "date": "2012-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m5Za7GZeK30V4XkpE4WvWg", "review_id": "Lzx2RAv6dV6ifUdvd04lNA", "text": "I recently tried this place and I was very impressed with how delicious their sandwiches are. I have tried the chicken salad sandwich and the reuben and they were great. Super cheap prices and fast and friendly service. BTW their smoothies are pretty good too. I will definitely stop by again.", "business_id": "M8CC5_9vEvt1yOI2pnkvKA", "stars": 4, "date": "2012-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BQmHAxPdwAqslc7VPRUlUQ", "review_id": "IaUbBGzG3b3y8CIbvZVxsw", "text": "Great sandwiches and great staff.  I eat here often and love it.", "business_id": "M8CC5_9vEvt1yOI2pnkvKA", "stars": 5, "date": "2014-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cLqVPC_FWHderGAfCFCh3A", "review_id": "o6WOXgc2PqZtAuLlRUK1xg", "text": "This is a great little spot. Located on the boardwalk, one of the only walkable places in University.During my college days, I'm sure I had a sandwich here, once or twice, but I can't seem to remember. Last night, we stopped in as a celebratory first ice cream of the season.  I got one scoop of the coffee cookies and cream and a scoop of  the butter pecan. No complaints! if you want a sweet treat, stop by this place, grab a seat and enjoy some live music from the Wine Vault next door. \nAffordable, fast and casual.", "business_id": "M8CC5_9vEvt1yOI2pnkvKA", "stars": 4, "date": "2015-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NfDy_RerJ6HH0KmnsfZDHA", "review_id": "x46QdCHThH-IedmjGk5C5Q", "text": "Butter pecan ice cream, strawberries, & brownies is my fav just like a cold stones, but not as crowed", "business_id": "it3sFG__YISMyHKhAku3tQ", "stars": 5, "date": "2012-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OZFgV8sZ_xhlhhxKwKdIIA", "review_id": "kfygXrCh4XFxaiL0-2RMWg", "text": "Great place to spend a spring day. The managers were so much fun and made great recommendations. I had the Better Batter Cake Carnival. Pure deliciousness.", "business_id": "it3sFG__YISMyHKhAku3tQ", "stars": 4, "date": "2013-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4Z4Bv3gEMbEmncLDDcrB4w", "review_id": "Ddu4pw-Yj3Xqk7lnA6Zo1Q", "text": "My meaty goodness...why isn't Culvers a nationwide chain?  This bacon cheese burger is way too good to come out of a fastfood drive through window.  I had a nice little picnic on the tailgate of my pickup (driving cross country....long story).  I could not believe how great this burger was. \n\nThe amazing part is the onion rings might be better than the burger.\n\nIf you're passing through Wisconsin, you need to stop at Culvers.", "business_id": "LRKJF43s9-3jG9Lgx4zODg", "stars": 4, "date": "2012-05-28", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "_xf2ECTRftPV4bzK4mGYEg", "review_id": "NZzs8dSaW6FzMtlJ8ACqkA", "text": "Mcfarland's premiere community supporter! Great food, friendly staff and very tolerant of kids- what's not to love?", "business_id": "ZfIJYXEm6PSxmEc-11mbZQ", "stars": 5, "date": "2010-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gwp42eJ06irmhXsixsMe9A", "review_id": "8KIeh21Di0G4AVSjzdGtsQ", "text": "Awesome Culvers. Great for the community of McFarland. Friendly customer service", "business_id": "ZfIJYXEm6PSxmEc-11mbZQ", "stars": 5, "date": "2013-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2nP4V3CUSU4AylZt-nCE-g", "review_id": "T4W8RGARPNvkID3bG9RShw", "text": "As far as fast food goes this spot is as good as it gets. The custard is, as to be expected, perfect and my fella adores their malts! A large is under $5 - such a good deal! Seriously, for an enormous ice cream treat such a bargain. I really like their kid's meal deal - don't judge - as it offers a taste of everything (custard, sandwich, fries, & drink). This spot is always fast & friendly. Yeah - the price is higher than most fast food places...yet it is so worth it!", "business_id": "ZfIJYXEm6PSxmEc-11mbZQ", "stars": 5, "date": "2015-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Fiec-fG39Gkd5mTK5WEi7w", "review_id": "7ZjI-79IT3uAQhHh9EtRAQ", "text": "I don't recommend going there.  My wife and I decided to go there for some dessert after a very nice dinner.  I wanted an \"Apple Pie A la Cold Stone\".  I have had this before and it is normally very good.  I was told that they had been out of the pie filling for a while.  Yet this is one of their \"Signature Creations\".  I would expect that if this is something that they always have that they would have on their menu, they would have the ingredients for it.  Then, My wife ordered their seasonal \"Funnel Cake Sundae.  My wife ended up waiting 15 minutes for this.  Jacob and Chad told us that they had to reheat the Funnel cake for the sundae twice.  This made is rock hard and she had to throw most of the funnel cake away because she could not eat it.  As we were waiting, I noticed how dirty the entire interior was.  It looks like the floors and base boards have not cleaning in months.  Tables and floors were dirty and sticky-GROSS.  I did not check the bathrooms, too scared to try.  On top of all this, the price for their \"Creations\" is way too high!!!  I am tempted to call the health department for an inspection.  DON\"T GO THERE!!!  it is a waste of time and money.", "business_id": "AYoLKzRFajucKnjIFxc__A", "stars": 1, "date": "2014-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "6H3X_SUEDjPTEvB4KDwsvg", "review_id": "N78rIrbTlP8h7d2gaxqPFw", "text": "Not sure why this place has such horrible reviews. It's not bad. Services is decent and the ice cream tastes good although it's a little over priced. Not sure id stop here very often I do prefer orange leaf to here.", "business_id": "AYoLKzRFajucKnjIFxc__A", "stars": 3, "date": "2015-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "QcywyTUnfgb7ckMTEcD2pQ", "review_id": "_JRi5kUV5NHAJ6Zdtyc0Lg", "text": "Awesome staff. Clean tables. Generous helpings. I always love coldstone. I made my own concoction, sweet cream ice cream with marshmallows gummy bears and gram cracker pie crust. I call it gummy pie. Think about the size you get though, their ice cream is rich.", "business_id": "AYoLKzRFajucKnjIFxc__A", "stars": 5, "date": "2015-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "06YTa8A3QhWXv4l6Htr91A", "review_id": "Mke_lb7OjcIyBSBX_k09cQ", "text": "Recycling in the restaurant.  Our favorites are concrete shakes, the new sweet potato fries, grilled cheese, and cheeseburger.  Very nice & friendly staff.  Food was brought out quick.  Clean tables & restrooms.", "business_id": "kiAsweI4sOjDzGyz3Y_HsQ", "stars": 4, "date": "2011-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Bi7FeOkZ37ceBioYHWnBVg", "review_id": "HooRGoSteAnZRY4jNn33hg", "text": "I love Culver's. This is fact.\n\nThe thing that makes this Culver's different from the rest is that they had offered Wisconsin-fare, i.e. Wisconsin Cheese Soup. Wow, was this fantastic! The facility was clean, the employees were very happy and the food was very tasty!\n\nI'm glad that I can find quality fast-food, yet sit-down food across the nation!", "business_id": "kiAsweI4sOjDzGyz3Y_HsQ", "stars": 5, "date": "2013-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "08JSWE6kaDQHEAYYlnR8jw", "review_id": "UcnLRuIEk6FoErFAj3A_mg", "text": "The food here is always a safe bet. Check your order however because they don't always get it right.", "business_id": "kiAsweI4sOjDzGyz3Y_HsQ", "stars": 4, "date": "2015-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hLYKwQyWLtzZNx6uZPu5pw", "review_id": "wQA7wOOCWZCMpKYLv4wQ-Q", "text": "Great experience.  Great ice cream.  Always a good alternative to the restaurant across the parking lot.\n\nDQ rocks...", "business_id": "RIsEPpt2jM7c_Ko_CyLwMw", "stars": 5, "date": "2012-05-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "jqMa8QhylASA1HT_CG9RyQ", "review_id": "65B-9GO8GS47ff8yNi4Ecw", "text": "I cannot recommend DQ's food. It is edible but not great. But who on earth goes here for anything but ice cream? They have a pretty good selection of grab-and-go stuff in the freezer by the door, and there is a drive-through. \n\nThe inside is very small, and they close up for a month (I want to say January), I'm guessing for the owners to snowbird it. Every ice cream item I've ever gotten from here has been great. I had a pumpkin Blizzard in the fall that was DELISH. \n\nIf you are the first car through the drive-through you should count your lucky stars. If you aren't the first then you might have quite a wait (understandable, since the car in front of you might be ordering Peanut Buster Parfaits for the entire marching band and you'd never know until it was too late). A couple of times I've dealt with employees who seemed to hate me and whatever I was ordering (the median age of these people seems to be about 19), but the ice cream was still great . Other times I've had extremely friendly and happy-seeming people at the window/register. Again, yummy ice cream.", "business_id": "RIsEPpt2jM7c_Ko_CyLwMw", "stars": 3, "date": "2013-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p4ySEi8PEli0auZGBsy6gA", "review_id": "H9npQDdej7vHqx9s4JQTfg", "text": "A lot of selection. There wasn't anybody else there when we stopped in so we didn't know if it was open or closed. Once we found it it was open, we helped ourselves to a delicious scoop. Nothing wrong the place, just in an off location.", "business_id": "0FdNeZAx-afgg8HV9oyqSw", "stars": 3, "date": "2009-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "ocrl96zql-OJY1GbuiIMbw", "text": "The urge for a sweet snack struck the other night, so we hopped into the car and scurried over to the ice cream shop, just a few minutes before they were scheduled to close.\n\n+ Friendly staff member\n+ HUUUUUUUGE selection of ice creams\n+ Mint Avalanche!!! Yes, please\n+ Generous scoop/portion\n+ Reasonably priced\n- Rock-hard ice cream; like seriously - concrete hard... I broke not one, but two, plastic spoons while trying to consume my bounty. The server struggled to dish the ice cream as well; she really had to claw at it. I don't want it to be soft-serve, but wowser... this stuff was ridiculous.\n\n+ Clean venue\n- Dated and hospital-operating-room bright - crikey!\n+ Plenty of parking", "business_id": "0FdNeZAx-afgg8HV9oyqSw", "stars": 4, "date": "2014-03-24", "type": "review"}
{"votes": {"funny": 10, "useful": 4, "cool": 5}, "user_id": "EODtZCvSn13sLsPIAmvJ7g", "review_id": "r_M01L-GLMcvZgDcGLYZ4Q", "text": "Look, I am going to be perfectly honest here...... I have a problem, and that problem is Zoreo ice cream. I had never heard of it until I moved in next door to a Chocolate Shoppe, and now I can't stop eating it. I used to enjoy things in life, like riding my bike, hiking, and playing board games...now? I just eat Zoreo ice cream all day and night. Ever since I had that first scoop, nothing else has seemed worth it. \n\nOh, the rest of the store is okay. Sure, the employees are friendly. The location is pretty good. Prices are good considering the massive quantities of ice cream that is shoveled into your cup or cone. But,  none of this matters anymore....so long as they have a full container of Zoreo, all will be okay.", "business_id": "0FdNeZAx-afgg8HV9oyqSw", "stars": 4, "date": "2014-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VZ7DmRPKsQVJzxxaW4eosQ", "review_id": "yPvsQm1ilJyxRUi43bT4EQ", "text": "I stopped here on the way to my hometown from the airport one of the last times I was in the Madison area. I'm normally a huge fan of the Wisconsin Swiss Melt, but the one I had here was not so good.\n\nFirst, the sandwich was exceptionally greasy. I don't think I've ever had a patty melt-type sandwich that was that greasy in my life. Yeah, I understand this is a joint that specializes in butter burgers, but this was extreme, even for Culver's.\n\nSecond, the size of the burger was pathetic. Admittedly, I've been out of Wisconsin for a few years now, so maybe my recollection of the size of Culver's burgers isn't so good, but the patty on this particular sandwich was seriously thin, and the burger came no where close to covering the bread.\n\nIf you're just passing through the north side of Madison and have a sudden craving for Culver's, I'd suggest you keep going and stop at the location in Waunakee or the location near East Towne Mall, depending upon which direction you're heading.", "business_id": "q83uB6EGF6y2MuR-7VZPRg", "stars": 2, "date": "2009-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "zee7YpFdx96E2sOUgj7F-Q", "review_id": "UtxruOeT-M7j-8HexyP3vA", "text": "This Culvers gives Culvers a bad name. Ive had excessively slow service, hair in my ice cream and burgers that resemble dog food and that's enough for me. Ive never quite seen a burger paddy so thin and greasy before in my life. You've  got to be desperate to eat there.", "business_id": "q83uB6EGF6y2MuR-7VZPRg", "stars": 1, "date": "2012-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e9ALO47DWQYlG4bICLy_yQ", "review_id": "yALSem3ssCE9OR5_WW-2Lw", "text": "Food and service here is always really good. Way better than most fast food joints. Love their burgers and fries and custards!", "business_id": "q83uB6EGF6y2MuR-7VZPRg", "stars": 5, "date": "2015-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kazm9pBM-79VeQFObzaZFA", "review_id": "2T1UnHx-RV-MYqlQ2ZpT-Q", "text": "First of all, this is not the original location... that's why you see so few reviews here on the Atwood store. However, they still have the cute umbrellas and the luscious custard we all love. Stopped in to get a fix and killed two birds with one stone -- delicious frozen custard sundaes and hot fried cheese curds. Could it get any better? Only if you made the entry way and the outdoor tables more accessible for friends and family in wheelchairs, and your servers a little friendlier and better. We sat outside in the sunshine and watched everybody drive by and stare back at us jealously.", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q", "stars": 3, "date": "2009-05-11", "type": "review"}
{"votes": {"funny": 3, "useful": 0, "cool": 0}, "user_id": "6kp815UUjK--ukUjmDlSCQ", "review_id": "YiLC401sox54xCxlnAHeXA", "text": "I had Death By Chocolate.  Now I am dead and loving it.", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q", "stars": 5, "date": "2009-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "2OquMv5WPNNrRX3hTGJhYg", "review_id": "rvP6igG_r8JVt9ZnLtxLYw", "text": "The custard is really fantastic - creamy - the best.  The other food, though, is notably disappointing.  I've had a couple of burgers there and they were greasy and half-hearted concoctions.  I also think that the counter staff could be a lot better.  They always seem sullen and taciturn.  In the winter you get the impression that they aren't really even supposed to be open.  That is all a shame, though, because the interior is decent - 50's diner style - and they could surely draw in a very decent off-season crowd if they chose to work on the food and the staff's comportment.", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q", "stars": 4, "date": "2010-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Zc5DCKBkNkTuQjFJDy0MDQ", "review_id": "aPh3BXG37-QD5v23792jbQ", "text": "Stick with Culvers!  My family and I stopped by on our way biking around the lake. What a rude and disappointing experience. First of all the staff who waited on us, Andrea was short tempered and not into customer service. We tried to order swirl, but they don't have it, we had to come up with a solution, Andrea just said no. We ordered a cone, small sundae and a can of coke. About $10.00 later, I was grudging given a glass filled about 1/3 full of ice for my not very chilled coke. The custard is ok, but nothing special. Another option would to be to continue on the bike path. In Monona there is an ice cream stop by a park on the lake. We will try that next time.", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q", "stars": 1, "date": "2012-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "sgkRdA1a1Vymdp83Qbikig", "review_id": "8ms3H0ay0Axu_6ldom32jQ", "text": "For all the hype, Michael's is quite a disappointment. \n\nMaybe it's because I didn't try the custard. But seriously, I didn't need more weighing down in this weather...so I ordered an orange crush float instead. For something that would have cost me MAYBE 50cents to make at home, I paid close to $5 for a 12oz cup. That is ridiculous. In general, I think their prices are pretty steep for what you get....you'd probably have to order a burger to really get a bang for your buck...\n\nLike RB, I also had an issue with the service. It was slow, disorganized, and not very friendly. The line was almost out the door, but the employees behind the counter didn't even ATTEMPT to speed up the service. One of them just disappeared into a back room. tsktsk. I also thought it was hilarious how one of the employees crumpled up an order form before the order had been completed, and then had to UNcrumple the paper so she could re-read the order to her coworker. Really? \n\nAnyway, I will probably give the Monroe St. Michael's - and their custards/burgers - a shot, but I'm not going to get my hopes up.", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q", "stars": 2, "date": "2012-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "TAOoRCZFOyySXWfOSaLQiQ", "review_id": "Y3rzoGANUjooQfeB6YnDmQ", "text": "Michael's has been around forever...I've eaten more sundaes here than I care to admit.  And, without fail, they are good. Every. Single. Time. Yes, they are a bit pricey.  Yes, they may be small for what you get. Yes they are all pretty similar. But darn it. They are so stinkin' good.  Just eat them before they melt, because gosh does custard melt faster than ice cream!!\n\nI have never eaten the \"real\" food at this location - so I can't comment on that. But the sundaes are worth it every time.", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q", "stars": 4, "date": "2014-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "GIe3fZlWKtnPXTaGqmwl-A", "review_id": "kNFjjlRgpy8rs3o19GkT-A", "text": "Didn't Michael's used to be good?\n\nI remember going to the Michael's in Verona, years ago when I was still in high school.  There was nothing better than gorging on malts and burgers on Friday nights in the summer.  I remember them being glorious, greasy shrines to all that is good and pure in the world.\n\nI hadn't been to a Michael's in years--partially because I had moved out of the area for some time, and partially because there are none in close proximity to my home.  However, the other day I happened to be near the Atwood Ave. one at lunch time and figured I'd go for the nostalgia and try to relive my youth for a few paltry seconds.\n\nTo say I'm disappointed is an understatement.  \n\nFirst, the place was nearly empty at 11:30am.  There was one other couple eating when I went in, but even the drive-thru was quiet.  That should have been my first warning.  I ordered a bacon cheeseburger and fries.  It took a reasonable amount of time for the burger to get to me, but it was seriously lackluster.  It was a cheap, thin, frozen patty and some wilted lettuce and a bland tomato.  The bacon was okay, but there wasn't enough of it.  The cheese was some processed crap.  The fries were equally frozen pieces of bland, tasteless crap.\n\nAfter my first bite, I wondered if I could ask for my money back.  It was so far from what I remembered from my teenage years that it continuing to eat the burger was essentially throwing my happy memories into the toilet.\n\nI hate to make a fuss, so I didn't.  I powered through and finished.  \n\nI know why Culver's is the tried-and-true home for decent burgers and malts.  Unless something changes, I think I'm done with Michael's.", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q", "stars": 1, "date": "2015-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "d-pfuqI3ZYpSfPC4g680BQ", "review_id": "HardWlSHDWe0908ugpGu9g", "text": "One liner:  Ick.\n\nEven the heartiest of cravings for a DQ treat could not make us go here....simply nasty.  Dirty counters, messy machines, and dirty tables.  And super rude staff.\n\nThe ultimate kicker?  Walking in to find the nastiest dust pan sitting right on the counter where they place your food when it is ready.\n\nSeriously...call the health department. We will drive all the way to Sun Prairie rather than ever step foot in this place again.", "business_id": "QwUHifLjoc5hoxa74jpwGQ", "stars": 1, "date": "2011-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dKbFEmnbVIycnq7ld2WjNA", "review_id": "YZOZK_hBkv6cRGc_DeVu7Q", "text": "I ordered a french silk pie. They were out of pie pieces, okay fine. Out of the 3 people there one \"thought\" he knew how to make it. It was like it was there 2nd day there. I get handed a white mass snd I go french silk pie is chocolaty and Ive never had one that looked white like it was just soft serve. They go well its made with a shot of vanilla, chocolate chinks, pie pieces, and whipped topping. I had been in there for 10 minutes to long so I just took it and left. Tried it, it was discussing. Waste of $5. Definitely never going there again. I'd rather drive all the way to Fitchburg. \n\n\nBy the looks of the other reviews the owner doesn't give a crap. Surprised it's still open", "business_id": "QwUHifLjoc5hoxa74jpwGQ", "stars": 1, "date": "2015-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GiZkrFCzBSrdbpIsI7Rvzg", "review_id": "GXIXiyKgPOV6yfIhDyRhng", "text": "great neighborhood staff, the family that runs is  very hardworking serious about their bussiness and satisfying customers. thanks,", "business_id": "FiP9q_YD5vgxu_Sflo5oZw", "stars": 5, "date": "2014-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RvweNJFVkR3ttkWsIBy7nQ", "review_id": "LXTlXnDxIZmE7PB2pMSsyQ", "text": "This review is SOLELY for the flavor Waffle Cone.\n\nBoring.  It has a vanilla custard base with waffle cones and chocolate pieces in it.  First, there was not many piece of chocolate or waffle cone in it.  It was not a fun and interesting mix of add-ins.  \n\nI like their vanilla ice cream, this flavor did nothing for it.", "business_id": "FiP9q_YD5vgxu_Sflo5oZw", "stars": 2, "date": "2014-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RvweNJFVkR3ttkWsIBy7nQ", "review_id": "0enCRtPOuGGb9looXbf9XQ", "text": "This review is for Just Drummy.\n\nBoring.  I do not feel like I had many piece of the \"drummy.\"  It was vanilla ice cream with a couple of pieces of waffle cone.  I should have just gotten vanilla and skipped the frustration.", "business_id": "FiP9q_YD5vgxu_Sflo5oZw", "stars": 2, "date": "2014-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dzKYG04n0nLXv6tGFvJX0Q", "review_id": "2PZCDO8w3H4Ck9RWkdU-QQ", "text": ":| It's not that this place is specifically bad. I think Steak 'n Shake is just not my style. The burgers are too floppy and sad and astoundingly greasy. Shakes are so sweet it hurts.", "business_id": "DWZ1_iy-cTeehK5FTiqH-g", "stars": 2, "date": "2015-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q0XqCjIefzm_dA5qmTcFzw", "review_id": "7kPsPxhM8HEXqKcGcYNqZw", "text": "This place has the worst service ever. When you have people being served cups of ice cream give them a spoon.  Spoons should be behind the counter not where many hands will touch them...ever hear of sanitation?  Ordered coffee and server was going to add sugar/cream.  That is my coffee and I will add that.  This place is in need of training help.  Another business left to run by people who could care less about the customers and how to serve the product and present themselves.  I can't wait for Jarlings to open:(. Worst place ever!", "business_id": "LWCundUtM5OWdYxCU7daXg", "stars": 1, "date": "2015-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "AFK20uwV5Kr-f8at2_BV8Q", "review_id": "Vawlj9k4423pRWaTR-F7uQ", "text": "THE place to go for ice cream/custard/sundaes.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2006-03-01", "type": "review"}
{"votes": {"funny": 4, "useful": 1, "cool": 3}, "user_id": "OazxM5v9i8PQ6NXWQDxCGQ", "review_id": "MB8oucgB1ll1JZl6swz26w", "text": "Example of how good this place is...\n\nMy Dad doesn't eat ice cream very often.  My parents rarely ever have it in the freezer.  He's actually a bit lactose intolerant.  When he was in town we went to check this place out and he ate a whole pint that night.\n\n....let's just say that he enjoyed the custard a lot... and not continue on with the story...", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2007-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "7zSppEZd2C6ASpNeBebxAA", "review_id": "RyDE5jilWrTCBDQOYsCofQ", "text": "Jarling's is quite the summer afternoon and evening delight.    ;)\n\nI'll always order 2 vanilla dips in a waffle bowl (made fresh everyday) with COLD fudge (they only acceptable form of fudge on a sundae) and bananas on top and I'm never disappointed. I am sorry to say they don't carry a S'mores Snowstorm yet... buy some graham crackers and chocolate chips you guys!\n\nThey only accept cash or check as a form of payment - so save up some pennies and head over to get some of the best custard in town before they are closed for the season! Stock up for the wintertime!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2007-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6pC5j-hfP4xLZB2W0Wi1vg", "review_id": "5maK9T2LR4UN_JpKkpF-Lw", "text": "knowing we are soon moving from champaign, has caused us to go to all of these places that we know we won't be able to subsitute in our new locale.  custard cup is exactly one of those places.  there is something about the texture and creaminess of this ice cream that makes it almost worth the outrageous prices.  it's amazing how many people will stand in line to pay $3.50 for this tiny cup of ice cream.  i highly recommend the vanilla cold fudge sundae...yum.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2007-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "CLLoAtkGa9lxeEnGfWlkqw", "review_id": "6PgTSkXUa1-LP2kEDMMtaw", "text": "As good as it gets, Jarling's Cup is a reason to move to (or stay in) CU. Delicious custard, reasonable prices, nice service, retro decor.\n\nSnowstorms are fantastic, and they have many mixable ingredients to cater to any taste. My poison is Butterfinger & peanut butter cup (an emulated cup made with peanut butter and cold fudge).\n\nTo make a night of it, start with a Delicious Seaboat(tm) fish sandwich, just two doors down from the Cup.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2008-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "TZCbIU6_8rTxxtFNUo3hBA", "review_id": "dDgWL-ULrV-ZxBUjfMJvRg", "text": "Good god do I miss this place.  It is delicious.  There are chemicals in it, that make you crave it fortnightly.  Just as well that its a wee bit off campus, or else I would have been there every day it was open.  So many options, and only one short life.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2008-04-30", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "agJz7qFAkwGbzoC3I03h0Q", "review_id": "oUUVwPQ0vNT2UtqhuxYZgA", "text": "When I first got to Chambana freshman year, I hit up my alumni uncle and aunt for advice.  Of all the things they told me, all I remember now is them saying to go to Jarling's.  It all made sense after the first time I went.\n\nJarling's (or C-Cup as my friends and I call it) is a place to take anyone visiting you on campus, or any freshman who wants to go to Cold Stone.  The snowstorms (think DQ's Blizzards) are fantastic, but I always go for 2 dips of either chocolate/lemon or chocolate/orange (recommended to me by an employee).  Just remember that regardless of what you get, eat it FAST...or else you'll have a cup of delicious flavored milk.\n\nThe biggest shame is that they're not open year round, but I always set my goal to go there as soon as they opened for the season, carrying as many clueless Cold Stone aficionados as possible with me.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2008-05-14", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "CX4GcrCCnzfNyAl0cPqGbg", "review_id": "JUChhB215MW92A-RlWBTbQ", "text": "I think this place is a little overrated. I honestly don't think it is as good as some described it to be. My custard was a little too soft and not creamy at all. I would rather have Culvers.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 3, "date": "2008-05-25", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 3}, "user_id": "hYYWsN-6uSc-n4Fe4LfJBA", "review_id": "28B2lXTnVYzYrXlLibxCWA", "text": "sometimes I think about buying a plane ticket just to get some lemon custard..and rescue my secondary stash of shoes from my parents' basement.\n\nDuring the fall, they do a seasonal Pumpkin Pie snowstorm which is making me salivate right now just thinking about it.\n\na funny thing about this place is that it closes down in the winter and they sell xmas trees in the parking lot.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2008-05-27", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "UkcXG477Xcu-iRAnpXW_ug", "review_id": "kutLFmMIGXHrBxMgZAFY2A", "text": "Brought here by my fiance, a townie. It's everything he said it would be and more.\n\nI like the vanilla custard with butterscotch, or the orange custard by itself.\n\nBTW, they don't accept credit or debit cards, so make sure you have cash.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2009-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0nTPhIUU7tjD2dc9JO5uZQ", "review_id": "meuvsl0TdxprOCfVSN7dhQ", "text": "I really like the atmosphere here. Even though I'm not from around here, its the sort of place I can feel right at home in. And its fun to people-watch everyone enjoying their cold treats on a hot summer day. And if you grow tired of the crowd, its across the street from Hessel Park, where you can find a spot out on the grass.\n\nThe frozen custard itself? Nothing out of the ordinary. I mean, of course its good, its cold, creamy and sweet. But so is the ice cream from anywhere else.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 3, "date": "2009-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "H9YgjifTAcsqjUo3pKBTNw", "review_id": "7J1ekAoAZarGTS8p8d1JIg", "text": "Amazing frozen custard. I like to stick to the basics -- vanilla or chocolate on a waffle cone. The stuff is just great.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2009-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "oolWxkuiaGjgh5wv6_Xh-w", "review_id": "jxPPrKFg6ciSBSYUETKwsg", "text": "Overpriced and bland. I got the orange custard and the lemon custard, both recommended by the cashier. They all tasted like regular eggy custard. If I closed my eyes I wouldn't be able to tell them apart. It's also incredibly overpriced at $2-something for a small scoop (or dip, as they call it). The only flavor that seems to be good here is the chocolate. Otherwise, save your money and your time and just go somewhere else. 1 star because it's a campus novelty, and apparently you haven't gone to U of I until you've been to Jarlings.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 1, "date": "2009-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "YW_iT5vBAFJUepWGQCo62Q", "review_id": "-OU3PD9GlJjnroqvG08Irg", "text": "It's pretty good stuff, although a little pricey.  I'm a fan of the cold fudge and tortoise sundaes.  And the waffle cones- yum.  I mean, it's your average local ice cream shop- a great idea for when family comes into town, or you're just not sure what to do with yourself, you want to splurge on a treat for yourself, etc.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2009-05-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "79rXt3p5DWV52ZrVt5ZYUQ", "review_id": "qqSkvqu-wAOjnzcpGNQw_g", "text": "Great custard and great service. A Chambana classic. You MUST go!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2009-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "64i6dDMPoz0U56X0FHSjUQ", "review_id": "uo6EWJXmJXVmXXZ2G1IkTQ", "text": "Time has passed this place by. I used to crave stopping here every time I was back in town. This visit, after a 2 year + gap, I went back on a Friday night. Oops! It was 10:06 so they were closed - the parking lot was full and there was a line at the windows, but it was past closing, so NO CUSTARD FOR YOU!. On Saturday afternoon they were open, so I ordered a one scoop waffle cone... and that's what I got for $2+ - a small round ball of chocolate custard sunken way down in a large waffle cone. Since Culver's has opened up where I live, I now have a comparison, and Jarlings is no better on the basic flavors. When Culver's has a special flavor - say Black Forest Tort, there is no comparison. As I said, the time has passed them by and all they sell is (a bit pricey) nostalgia. A Shame.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 2, "date": "2009-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WRIofodAjmuamUnfQE35Jg", "review_id": "mkaybkih87KbtlWuWF3hJg", "text": "This was my go-to study break place (when it was open) when I lived in C-U. I miss it! I never ordered anything I didn't like.\n\nThe service was quick and helpful and patient considering I always stood under the enormous sign and said WHAT DO I WANT?\n\nThe only downside is cash-only. But there is an ATM in the grocery store across the street, if needed.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2010-03-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wQk4gneiQeM466IymN4wRQ", "review_id": "TUJinB-0la9Kn5rCwWsL-w", "text": "yum.yum.yum. i am so happy when this place is open!!! \ni can't really comment on much of their menu because i continually go back to the peanut butter cup snowstorm. it's not just reese's peanut butter cups that you get at dq (though i do love me some dq, don't get me wrong), but in this snowstorm it's a swirl of fudge and peanuts and my oh my, soooo good. best part is i can only eat half of a junior at a time so i have some for the next day as well. \ncan't wait to step out of my comfort zone and try their fruity flavored custard (here's looking at you lemon custard) and possibly some other snowstorm flavors....\ncash only. but for this treat i don't mind stopping at the atm beforehand. now stay open all year long!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2010-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CYJ2q7cFSSiZtbJE3gMP6Q", "review_id": "A1SDIq96onGuFhPAkDrwOA", "text": "This is place is just awesome. \nI highly recommend the strawberry cheesecake with strawberry custard snowstorm", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2010-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5IXVukYhb27a-HoBbalLhg", "review_id": "i005wfStY4nlCU98VbbRvg", "text": "Came here per friends' recommendation since I was on a business trip in Decatur, which is 30 min away from Champaign. I had my doubts at first because who would have thought any food could would be this good in a small college town. Boy was I in for a treat. \n\nStrawberry shortcake snowstorm was my choice based on my friend's yelp review and it was AMAZING. The portion for was quite large for a small cup too. DEFINITELY going to come back again in my future trips.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2010-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "i5Yzzt4QBkaWIzHUjUAclw", "review_id": "uN9IsJOMqcBlgGAMaa0hOg", "text": "I will freely admit that I have not lived in Champaign since 1996, but my heart still belongs to Jarlings.  Their \"black and white\" was my all time favorite.  We got friends and family hooked on their custard when they'd visit, and it's still talked about when discussions of those days come up.\n\nWorth every penny of the price, and I would make the trip back just for a black and white if I could!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2010-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pjIrFFjl03twCAaQMJQxwQ", "review_id": "418yOhKgP4UNK9O2Kr5x0g", "text": "A true Champaign classic, Jarling's does one thing, and they do it oh-so-right. Long lines, throngs of teenagers, closes relatively early - sure. But the custard is sooo worth the wait! The best time to go, if you can swing it, is lunchtime or early afternoon. I'm a fan of super, super sweet ice cream, and the Nerds Snowstorm made with strawberry custard is like being caught in a sugary blizzard. Wonderful! And honestly, you can't beat those prices. Just don't forget to bring cash (or a check).", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2011-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RQ2c-aCWvf3yhhm6wURMBQ", "review_id": "fhrsahf4wd3Q2BFYDbxQrA", "text": "Just do it.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2011-03-22", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 0}, "user_id": "pjIrFFjl03twCAaQMJQxwQ", "review_id": "RpQLD2odzppSO9ecFpXxoQ", "text": "Just went to Jarling's after lunch at Yellowfin. Urgent update:\n\nThey now have gummy bears.\n\nI'm going to pretend that they started carrying gummy bears just because Jarling's loves me. Regardless of the real reason, I will now have a mandatory once-a-week Nerds and gummy bear snowstorm (made with strawberry custard). \n\nTHANK YOU, JARLING'S. Pardon my brevity, but I need to go start shopping for some bigger pants.. Something with an elastic waist, perhaps...", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2011-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YbURfQVvk9cTMR009baOiQ", "review_id": "UlU4hHU6kegtVty1OjRqcw", "text": "I love this place.  It's not the best, but it' s definitely not the worst.  What's great about Jarling's is that it's always exactly the same, and that's good. Jarling's cares nothing for trends, for fashion, for progress.  You will never go there and see to your dismay that it has gotten a piercing that it thought was cool but is by now completely cliched, a tattoo of something coyly cryptic, or that it prefers only bands that are so pure that they haven't yet been formed.  It's Jarling's.  It listens to whatever station comes in best on the AM band in the car and it hopes you brought your appetite because there's a lot of stuff to eat.  It's beyond cool.  It's eternal.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2011-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jvcqOUPPVBXErhjfdejPng", "review_id": "OL4E_5UysO2aSZBsSVMlOg", "text": "Seasonal place that is always a favorite. A bit off campus but worth the drive.\n\nTake your friends here when it's hot and you'll be guaranteed thanks all night.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2012-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "WERycq-821J9IzjdQFM1iA", "review_id": "wNHZ6DP_-I2Ro9DbpzvwkQ", "text": "Maybe the custard is good, but this is the slowest place I have ever been in my entire life.  Honestly.....awful!!!!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 1, "date": "2012-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZEZ66vewUOCVREwB2GY3tw", "review_id": "g0nB_Xa5Z1HtozheiTJPfA", "text": "Get the Cold Fudge Sundae.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2012-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "EhGhwL-CfIqdJyZEy-imsA", "review_id": "Ahbyw_0BtW01bgLGxQEnsQ", "text": "Absurd wait time. We waited in a line of ~15 people for 45 minutes. I timed the group in front of us (5 orders). It took the cashier 11 minutes to put together five scoops of friggin' ice cream. No business this inefficient should be around. But obviously the ice cream is good.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 1, "date": "2012-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V-rBl-X12vISHVaLSqiV8Q", "review_id": "k7w2Qu9XYRdXBJKRYxWzoQ", "text": "Jarlings holds a special place in our hearts. It's the best ice cream place in town. The staff are somewhat slow at times, and use their bare hands to put toppings on (which irritates me  because they do this immediately after handling money), but there's just no substitute. They don't have Reese's and are fussy if you ask, so just let it go. They also don't have hot fudge and get fussy if you ask. Luckily the custard is good enough that it eclipses any grievances. When we move away someday, I know I will miss this custard sorely.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2013-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xUW77SZf5l2bfp7kabCVwA", "review_id": "UilW80zTLaV1TPicBaMTWA", "text": "An absolute five-star dessert place. Their custards are to die for! I LOVE their orange shake, mint chocolate chip snowstorm, lemon custard and nut parfaits. They have so many snowstorm options, you will definitely find a combination of your choice. They offer a different 'flavor of the week' every week. Of the ones I tried, found peach and peppermint to be super yummy!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2013-04-17", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "3RsMc_SlFtp766CrgoUO4Q", "review_id": "jssuZAWR4GpWVGpjwVj39A", "text": "Old school custard. You can't live here without trying it. In grad school, I lived a couple of blocks away, and I only went here a couple of times. What was I thinking? Skip your  forgettable entrees and come here instead. Delicious!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2013-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xpsAIIztw6rO_C9kT-iELw", "review_id": "G20DUYaU8czoub5SPgTFgg", "text": "I love love love Jarling's!  My favorite is when they have the coconut custard and I then get cookie dough in my snowstorm.  So good!\n\nMy Grams always gets their cold fudge and that's super yummy as well.  I won't lie we've gone twice in one day we love it that much.\n\nA Champaign institution and not to be missed!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2013-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pD0ntLKZOopi2KmaVxSw_A", "review_id": "LV2l-QneokkdSws5vp-W9g", "text": "I love Jarling's Custard. Every time I try something new, I'm never disappointed. A smooth, buttery finish with strong flavors, this place always serves the best. I usually get the coconut seasonal custard, peach cobbler snowstorm, strawberry cheesecake snowstorm, coffee/espresso snowstorm or grasshopper (mint chocolate) snowstorm. Everything here tastes divine, so don't be afraid to experiment! Also, junior cups are huge, so order in moderation.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2013-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QRc9cONXPe4GvsEV8eesjg", "review_id": "a7_FRj40wEwqDuohORK5Ng", "text": "Excellent frozen treats for hot summer nights. The menu is more than just custard. Jarlings has cups, cones, sundaes, shakes, frozen cakes, and floats (i.e. rootbeer floats and other combinations). Lemon custard really hit the spot for me. The lines can be a bit long (and one day they ran out of vanilla custard, which was a buzz kill) but it is worth the wait. Also, $10 minnimun for credit card purchases could be less than fun if you're not expecting it, but they take debit cards with credit logos without a minnimum.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2014-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "acbR6V3UTAsxe05lQiWWcQ", "review_id": "k14KbL4TmZotDDWBefVy4Q", "text": "I personally think that this place is a little bit overrated. Yes, their frozen selections are definitely worth checking out, but I had better ones outside of Illinois. \n\nThe place definitely had revisit values with their seasonal surprise flavor of the week. Sometimes, the flavor may be so wild that we can the cashier would prefer you to try out a sample before you finalize your purchases. \n\nMy personal favorite is their vanilla sundae with crushed peanuts. Their ageless classic serves as my control group whenever I want to grasp how good a chill desert place is. It will not disappoint you! \n\nThey also serves some classic items like frozen custard cake, slushies, banana split, and so forth. The place is almost always packed in weekends, but they have very few seats indoor, so expect to sit outside.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 3, "date": "2014-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GLS1EKLFw81n-3ogxZ_m-w", "review_id": "dxsDdQ0nby97LC8F2axzMQ", "text": "A great, home-town ice cream spot. (although townies will give you a hard time if you call it ice cream). No doubt you are getting a fun experience when you come here. They have everything you would come to expect from standard dips of custard in cones or bowls, to slushy-type drinks and their version of the DQ blizzard. \n\nI give it 4 stars and not 5 because it is not a great value. You will easily spend $5 for a couple scoop/dips of custard and it is hard to shell out that kind of cash when there is 50 cent soft-serve down the street. Also, it never fails to frustrate me that their will only take credit cards if your total order is over $10. So be prepared with cash unless you are buying for you group/family!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2014-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GuI0CNeLXEIVAtoye0WJgQ", "review_id": "IcptYctLxjGzXQJTbeQRRg", "text": "My go-to ice cream place in the summer! The lines are usually long and you have to wait a while, but they have some delicious snowstorms! They also have a drive-thru, which I have never used, but that is because I like to sit out front at the tables in the parking lot. Perfect place to go with friends on a beautiful summer night for a yummy treat!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2014-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HcxWWLD3ejPWVAMBzuCoig", "review_id": "gGsQBD14frZUMJanCfnnVQ", "text": "The only negative thing i have to say about this place is that the lines are confusing and i had no idea if i need to stand in a particular line based off what i wanted to order or if i could just jump in wherever.\n\nThat being said, this place is awesome and very fairly priced. To say they have a shit ton of options would be something like saying The Beatles had a few fans. \n\nI will definitely be back here if i am ever passing through the Champaign region. \n\nGet out there, check it and yelp it!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2014-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S8txCPS1Rd8WHVubqjQBZA", "review_id": "F1R4RePuSl_DS_Y-jYjkrA", "text": "Well...I know that I won't convince many to stay away from this local institution, but if I can convince one, it will make my night better.  I waited in line for 1 hour and was at least 20 min away from getting served when I left.  Yes, it was Mom's weekend and they wee mobbed but there is such an indifference to the way they do business that I am hoping to convince anyone that reads this review STAY AWAY. The same person who takes the order, makes the order.  There are only 4 people working here and the lines are back to the street.  The counter person takes the order, walk toward the back with no sense of urgency, slowly fills the cup, talks to his co-worker for 30 seconds, goes to the topping area, same indifference to the 70-100 people in line, finally gets back to he counter and ask the same person what they want next (God forbid he could've made 2 at the same time). The owners couldn't care less that there far better ways to do things.  Hire 3 more people.  One person, takes orders and money, another makes the order.  The time would be cut b 30%. And here's another idea, the teenage workers should actually be managed, Hurry just a little, don't talk to your co-workers, if one of your friends comes to the window, don't spend 3 mi asking about his life etc.  CARE ABOUT THE CUSTOMER.  But the owner clearly doesn't care about his customers because they wait and wait and wait.  Except for one.  \n\nYes, I wasted an hour, but you didn't get my money because you didn't are enough to earn it.  The service is HORRIBLE because the owner has a \"screw the customer, they can wait instead of me spending more money\" attitude.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 1, "date": "2015-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iWzDpKYPiYZ8190FdJ72CA", "review_id": "4CsZ2emCZ-Wf3FWJ3_lKfA", "text": "If you're in Chambana in the warm season, this is the local flavor. Pick the shortest of three lines. Its old school. Made fresh daily. Worth the wait.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2015-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mlpqV5Ck1jDmVh5qi6ijng", "review_id": "kOjCKKVYDTyPq6bN087Jlw", "text": "Best custard available in central Illinois. First time there over the weekend and I ordered a Berry Delightful snowstorm. Very refreshing! The lines tend to be out the door but it's generally worth it, in my opinion. Plus it moves fast. Tried a bite of the cold fudge and WOW. So good!! No other words to describe it. If I went to U of I, it'd be a problem because I would spend all my money on their custard!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2015-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_PtpJG8lYR0LQ3zKwon6HQ", "review_id": "RIdZQqfp2bRb5TmVYThzrQ", "text": "I use to come here frequently. Unfortunately, the new owners/management have not figured how to run the place. It takes way to long to get through the line. Don't count on it to move as quickly as it has in the past. You'll see more people give up and leave the line than people walk out with custard. The employees don't even appear to be working with even a little bit of urgency. I hope this improves!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 2, "date": "2015-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IAZ-Xm2tkO14YbzeCwritg", "review_id": "RarCRBHGDPl0Jxjwhvt8vw", "text": "The sheer magnitude of customization that this place offers is just mind blowing..the cold fudge Sunday is absolutely the very best and you have to give a try. I visit this place everytime i come to Champaign..perfect place for an evening snack", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2015-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "JnRT9i2d71pY8D8ngzCz9Q", "review_id": "mwP5n4Uy5oLfR1WHQqY3hQ", "text": "Pretty good yogurt.  Its downtown so its a little big pricey but overall I would say its a good place to get dessert or a treat during your busy day.  They update a new flavor pretty regularly.  Today I had the carrot cake.  What I like about them is they put the toppings in the middle and on top.  So you don't get gipped! Like some other places.  They also have smoothes and yogurt to go. \n\nThe place is very clean, the people are nice and dessert is good.  Stop in for a treat!", "business_id": "uaAMGh8gMoJD4nLFzNsM-A", "stars": 3, "date": "2010-03-05", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "AirVzN1BVQBmq5zY0YMNYQ", "review_id": "0F3-okn694iWUTStN6zDIA", "text": "I think Yvette has the right idea for an afternoon treat. The one problem is, I couldn't wait until Friday, I had to go today. It is the perfect afternoon distraction . . . er . . . um . . . I mean treat . . . perfect afternoon TREAT! \n\nThere was a time that I was completely hooked on afternoon frozen yogurt and going almost daily. The winter weather helped break me of that addiction and now I'm back on what others would consider a \"normal\" schedule. \n\nI love that the flavors change every day and you can print a calendar from their website showing the schedule of flavors. There are about eight different flavors in any given day, and one of them is a \"No Sugar Added\" flavor. \n\nThe OCD side of me really shines when a new month starts. I print the calendar, take out my highlighter, highlight all of my favorite flavors and those of my fro-yo addicted coworkers, and hang the calendar outside my cube wall. That way it is much easier for us to tell when we need to work time into our schedule to hit the yogurt shop. \n\nThe flavors that are typically highlighted are: \n- Chocolate Covered Banana & Marshmallow (served on the same day, really good as a swirl) \n- Pistachio (really good with almonds as a topping, I tried getting pistachios as a topping and it was a little much) \n- Butterscotch (reminds me of pudding cups back in the day) \n- German Chocolate & Caramel Custard (also served on the same day and very good as a swirl) \n- Irish Cream & Kahlua (not served on the same day, but the closest thing to drinking at work) \n- S'mores (delicious with a graham cracker topping) \n- And every once in a while I like the Reese's with (you know it) Reese's as a topping!! \n\nSee, with so many delicious flavors, it was hard NOT to go everyday. They have plenty of other flavors as well. The only one that I tried that I was not a fan of was the Root Beer Float. The flavor was there, but it wasn't the same without the soda! \n\nEither way, stop by in the afternoon for a sweet treat, and maybe I'll see you there!", "business_id": "uaAMGh8gMoJD4nLFzNsM-A", "stars": 4, "date": "2010-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "usQTOj7LQ9v0Fl98gRa3Iw", "review_id": "tybCdN9qF-aTsA8V_XNeGw", "text": "In working Downtown I often times find myself walking blindly between point A and point B, not paying much attention to the little nook and crannie shops along the way.  On one of my many visits to Yelp this is a place that caught my interest!   I stopped in on one of my walk breaks.  It appears their flavors rotate and they have several toppings to choose from.  I decided to go for small mix of the Berry Sorbet and Almond White Chocolate (no toppings).  The Berry Sorbet was nice creamy, fresh berry tasting and just slightly tart.  The Almond While Chocolate was good but tasted to synthetic for my buds.   The small was just right for the afternoon pick-me up!", "business_id": "uaAMGh8gMoJD4nLFzNsM-A", "stars": 3, "date": "2010-04-13", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "j8ocPEVty-EEYQk_Zeldyg", "review_id": "4yJyiRcwtks-DbqOexPO3Q", "text": "I found this place on my second to last day in Phoenix and I wish I'd come sooner.  I thought it was really affordable and they had some awesome flavors.  I ended up getting caramel while my coworker got banana with strawberries mixed in.  The guy working was really friendly and actually thanked us for stopping by...I can't remember the last time I got such friendly service.  Definitely recommend if you're downtown.", "business_id": "uaAMGh8gMoJD4nLFzNsM-A", "stars": 4, "date": "2010-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "XBHJCDzNh--mBhJkzyM_iA", "review_id": "-T908uTzbnmL0BVeP8XCwA", "text": "Nothing like a touch of yogurt on a hot (or cold) day.  The owners are so friendly, I love it.  The smell of sugar cones wafting in the air when you walk in is heavenly.  Something about this yogurt here, I don't know what it is but it tastes so good and creamy and not a chemically tone to them at all.  It tastes real, fresh and plopping down inside is a perfect way to enjoy some time away from the office and watch the busy-ness going on around you outside.", "business_id": "uaAMGh8gMoJD4nLFzNsM-A", "stars": 4, "date": "2011-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "usQTOj7LQ9v0Fl98gRa3Iw", "review_id": "x9vBxz9fW2KiIwu1lT5LHg", "text": "Now after my first visit and review I've been back a  few more times. On my most recent I was having a sugar splurge kind of day. I decided on a Medium and opted for the Monday special of one free topping.  Having sampled the low fat carrot cake flavor and its spice cake like flavor, I figured its would go well with chocolate and I topped it all with almond rocca. Oh boy, they filled the cup with both flavors halfway sprinkled \na few spoonfuls of almond rocca then proceeded to fill the cup with more yogurt and another couple spoons of rocca. \nNeedless to say this made my Monday soooo much better.", "business_id": "uaAMGh8gMoJD4nLFzNsM-A", "stars": 4, "date": "2011-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aTi0NVrcPJWbN6jAsJVcAw", "review_id": "H5kZtEMLLdJ1R2eFjSvkgQ", "text": "Across the street from my office is a bad place for this yummy, delicious place to be. Have mercy on my waistline! Anyway, it's delicious -- every day some new frozen yogurt flavors and always the veritable plethora of toppings. \n\nWhat I love about them is that they layer the frozen yogurt with whatever topping(s) you choose, so that it's all mixed together. I usually walk in with a taste for something, especially chocolate and peanut butter or vanilla and chocolate, and the owners always know just how to help me out. They always give free samples, so try whatever you want before committing to it! \n\nYum!", "business_id": "uaAMGh8gMoJD4nLFzNsM-A", "stars": 4, "date": "2012-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "TBi-83lYEqTIM0pK9EAV-A", "review_id": "qgmryXeN2c5jha7C8KpWog", "text": "This yogurt place is just that, a non self-serve yogurt place. The yogurt is tasty, but not exceptional, and none of the fruit toppings are fresh. For some with a sugar tooth, this yogurt place may be ideal for you. However, I am not a fan of syrupy fruit or thawed out frozen fruit. They also offer assorted candy toppings for the yogurt. \n\nThe staff is pleasant and accommodating; very friendly. The atmosphere is pretty typical for a yogurt place and is very clean. The location is ideal for persons with a sweet tooth working in the downtown area.", "business_id": "uaAMGh8gMoJD4nLFzNsM-A", "stars": 3, "date": "2013-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IhcTLLWKS6ZiNyIX9oQQPQ", "review_id": "QC3bKPqokTqQlDNRwsQFsw", "text": "Carrot cake yogurt with granola - yum!  I got a small and should have gotten a mini cup.  The small was more than ample.  Great flavor and topping choices.", "business_id": "uaAMGh8gMoJD4nLFzNsM-A", "stars": 5, "date": "2013-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8donb0ivTXtJbk4kOKt25A", "review_id": "P6xk1ehBq_eft0jzT0xp4A", "text": "Such a Sweet Little spot - the two folks who helped us were wonderful to offer several flavors and make suggestions. Which is great because I'm indecisive. They put toppings on for you- and they put them in the middle, which I like. And although they have huge cups, you don't have to have only that, which is nice. Had a delicious Hawaiian delight flavor- had strawberries, banana, pineapple, and coconut- mmmm!", "business_id": "uaAMGh8gMoJD4nLFzNsM-A", "stars": 5, "date": "2015-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "usQTOj7LQ9v0Fl98gRa3Iw", "review_id": "voP_wrQu9yc07aJ0Io4B1A", "text": "Since arriving to PHX I have been exploring my local barrios for a location to get some of my favorite Mexican treats.  As I was rolling on 16th, I saw the sign...now if you blink you miss it.   I usually look for the big purple Dulceria across the street first and slow down as I near.  It is located in a strip of buildings that have seen better days, pero yo no tengo miedo.  I have stopped in 3 times to date.  On my first visit I picked up un grande Agua de Pina (Pineapple \"water\") and a few Paletas, fresh fruit/fruit juice popsicles (coco, pina, sandia y limon).  While the selection and the quality is not as extensive as one of my favorite places in Albuquerque (on Central just south of Coors) .  I have to say it is close.  At least my Agua de Pina was fresh and not the hyper yellow processed stuff I get sometimes at Pro's Ranch Market.  On this visit there was also a lady inside selling fresh hot homemade tamales for $5 a half dozen.  *Score*!\n\nOn my second visit I went in for another batch of paletas, and this time I also left with 2 Aguas Medianas de Limon y otro de Pina.  MmMMM....I liked how the Limon was still quite tart and just sweet enough.  The Pina I put in the fridge for later.  I also decided to try a Raspado de Mango (Mango snow cone) to which I allowed the addition of a little Leche Condesada/Azucarada (Sweetened condensed milk).  Not as much mango flavor as I was expecting but refreshing and tasty with nice little pieces of fresh mango.  \nI need to go back to try the nieves/helados (ice cream), and  Escamochas (mixed fruit served with coconut and drizzled with sweet condensed milk or sometimes honey and sprinkled with granola or pecans, usually fixed up to taste) or the Pico de Gallo (in this case it is a plate/cup with a combo of any of the following like cucumber , watermelon, canalope, honeydew, pineapple, coconut chunks, mango, jicama sprinked with red chile and served with lime wedges).  They also offer some baked items like bolillos, pan dulce, and other pastries.", "business_id": "9pYBiLe3k5Gi-AJqRklXcQ", "stars": 4, "date": "2010-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IpCH-jaFA-1YgCdi6YmnFg", "review_id": "PdwVUDkww2Pmqb3liOQfnA", "text": "Not as good as the original in Mexico, but as good as it gets for the USofA.  Great paletas.", "business_id": "9pYBiLe3k5Gi-AJqRklXcQ", "stars": 4, "date": "2013-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MNfOCJZsbtMbnDlvJ1LKeQ", "review_id": "0fNTAqo3DePCHyLPqRh_Lw", "text": "I love going here with my friends, I still have to bring my boyfriend here one of these days so he can try some good Mexican ice cream, a diablito, or fresas con crema. All the desserts here are great, I haven't tried their food yet, but i'm sure that just like everything else it must be great.", "business_id": "9pYBiLe3k5Gi-AJqRklXcQ", "stars": 5, "date": "2014-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "-ku2SB6n6TOhp80Q4A1LRw", "review_id": "whGaqavnHw9SulMHsJ_3Gg", "text": "Yep it's a Dairy Queen, It's a little busy around 7, but worth the wait.", "business_id": "zZmhEpiVpRfFQid87-pcOQ", "stars": 5, "date": "2012-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0Yrlfu8-YtHn2k3wr2_wGw", "review_id": "H9SzEcEwXTGhzojs2Ixxjg", "text": "My wife and I are regulars at this location for their frozen treats.\n\nI normally put fast food at 2-3 stars, but this place gets the fourth star for two reasons.  First, I'm really impressed with the cheerful attitude by the staff, even though they are often slammed in the evenings.  Second, this place is always neat and clean.\n\nAwesome Blizzards.", "business_id": "zZmhEpiVpRfFQid87-pcOQ", "stars": 4, "date": "2014-03-25", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "L9-X4KASFfdhOeVeYSDgvA", "review_id": "YNF34FbiTGvbc-j89u8zHQ", "text": "Quick and pleasant drive-thru service and standard issue DQ deliciousness - perfect dessert stop.\n\nIf you've never been to a DQ before, try a Peanut Buster Parfait - the soft-serve is delicious, the fudge is thick and creamy and the peanuts are plentful and salty - it's an excellent combination.  My husband 's favorite is the Reese's Peanut Butter Cup Blizzard, if you're looking for a sure thing in a cup.\n\nEnjoy!", "business_id": "zZmhEpiVpRfFQid87-pcOQ", "stars": 4, "date": "2014-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Rzh6otnpcsIXswsOjb4jcQ", "review_id": "qFdIZy28d8-BC-9o675tmw", "text": "Ice cream was typical for DQ but neighborhood was a bit sketchy on a Saturday evening. A guy outside had a holstered firearm. \n\nVery small store. Very limited seating. \n\nMy only concern was how well they cleaned the Blizzard machine. Just looked like it needed some cleaning. No one got sick so probably fine too.", "business_id": "zZmhEpiVpRfFQid87-pcOQ", "stars": 2, "date": "2014-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_Lz4b5QL0K8ndeyz2vxslA", "review_id": "45BGld16zek-88XlW-VJSg", "text": "I loved DQ as a kid and practically lived there as a teenager.  Fast forward many years and I am now rediscovering the joy of their soft serve.  I am an ice cream fiend and DQ's vanilla cones just seem to hit the spot these days.  Something about the cold, creamy goodness is deeply satisfying, and is rivaled only by their chocolate sundae.  This location has been here forever and has been upgraded.  The staff is very polite and the drive-thru is usually busy.  Most times this deliciousness is worth the wait!", "business_id": "zZmhEpiVpRfFQid87-pcOQ", "stars": 4, "date": "2014-04-27", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "6YXzYi22pjEX8PgPCthRFQ", "review_id": "tMlCOTjuOud-sqs-619Wmg", "text": "I am disgusted with the restaurant!!! Let's see... cater to kids and tell my 5 year old grandson to cross a seriously busy street (Central Ave.) to use the bathroom at a Boston Market.  How about this Dairy Queen... Get a F'ing bathroom for your patrons!!!!  It is pitiful you can't even wash your hands before you eat - that leaves us with the question what your employees do when they need to wash or use the restroom while preparing patron's food.", "business_id": "zZmhEpiVpRfFQid87-pcOQ", "stars": 1, "date": "2015-03-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Ovpa3S8xD96dLE5eDxcxJg", "review_id": "MzKID97FHwKJAi8Yj1ro1w", "text": "Someone please confirm or disconfirm this for me: but I heard that this particular store was shut down? Is this true?\n\nI would be very truly upset if that were the case.", "business_id": "ShlpOxmjFOeiuSdUMVQr3A", "stars": 5, "date": "2007-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "-9mljS0O9mwdOnGv-Oea3Q", "review_id": "ORnnC00AwVMfl9EjOssBpQ", "text": "I have to agree with the others, it's not much but a high priced ice cream stop. The concept was good when it first arrived on the blockmany years ago, but now I wonder why people keep returning. This was my 1st or maybe my 2nd visit to the Creamery, I think I went decades ago to the first one on Mill Ave. \n\nHowever for the $6 I spent on a medium scoop with mix-ins I am not impressed. The coupons given to me I will pass along to some friends' kids who may or may not ever use them.", "business_id": "xAVAqgpZOYYvP4BtfUInsA", "stars": 2, "date": "2010-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "el_BsZHqhCZK_VG27TyPBA", "review_id": "uCkgysrHAFyR1cgqCldZWg", "text": "If you're in the mood for a nice cup of ice cream, Cold Stone will probably do the trick. I've never found anything too special about the place, aside from the pretty decent selection of toppings. I'll probably still stick with one of the frozen yogurt places out there - slightly less unhealthy, and usually a couple bucks cheaper.", "business_id": "xAVAqgpZOYYvP4BtfUInsA", "stars": 3, "date": "2013-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "PgINUOMQqSpro4CF5xsziA", "review_id": "yk2GhJF1z0OiXMZBgYBahg", "text": "I just didn't feel welcome. It was a small place and that's no problem but I just was never comfortable here.", "business_id": "xAVAqgpZOYYvP4BtfUInsA", "stars": 2, "date": "2013-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nR3_hlk1aeh0EdjfOycuGQ", "review_id": "taF-RdHQwJpCqsznsV6g6A", "text": "Went there on my birthday once, service was nice friendly. But today, I decided to walk and get some ice cream, might even get a tub to take home for the month. There were only two people working the store and three customers taking over the counter, talking with them and getting ice cream. I waited patiently slowing exchanging eye contact with the two employees. Hoping they'd notice I would like to be helped. \nThe customers didn't leave, but they paid. So I decided to sit down and wait. Then the customers finally left and the one girl took out the trash exchanging eye contact with me again, the other guy was putting tips in the jar who also kept making eye contact. Neither of them greeted me or asked me what I wanted yet. As They walked to the back, I moved up the case. I said in a nice manner \"since you're not going to help me, I guess I'll just walk home.\" The male employee said \"whatever\" and walked away. I'll definitely be contacting the store manager tomorrow. \n\nI guess the service is only nice with select employees at that store.", "business_id": "xAVAqgpZOYYvP4BtfUInsA", "stars": 1, "date": "2015-03-03", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "4DtBamDdmuYGozIHJN9cig", "review_id": "gtAlK11nOoLVAVjAhN6bLA", "text": "Last time I got ice cream here, the clerk kept insisting the flavor I wanted would be too spicy for me.\n\nWhile that was annoying, I figured I'd give them one more chance because I really wanted ice cream before going grocery shopping. The one gal in the store simply wouldn't acknowledge me or wait on me. I'm dressed for work, so while I probably look like it was a long day, I don't look homeless. But hey, I'm not good enough for your $5 ice cream scoops.\n\nThis store is now out of chances with me.", "business_id": "xAVAqgpZOYYvP4BtfUInsA", "stars": 1, "date": "2015-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TB91-tZ90Pb_irX0il_asg", "review_id": "q76CQ_v4Z816mG6pFbaEDQ", "text": "Never disappointed by the icecream and flavors I can add. Whether I want chocolate with more chocolate or something random. Great place.", "business_id": "xAVAqgpZOYYvP4BtfUInsA", "stars": 5, "date": "2015-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ciJPGIFqsMtnYbyUlwP7TQ", "review_id": "wtwuJ-BT_ejBMpgURmYPMQ", "text": "I walked in on my birthday, unsure of what I wanted. The guy at Cold Stone gifted me the ice cream I picked! I was shocked! It absolutely made my day. The ice cream was delicious. I'll be back!", "business_id": "xAVAqgpZOYYvP4BtfUInsA", "stars": 5, "date": "2015-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zdPRXhhJNCiCOgWQwoPlpg", "review_id": "OiEdxXtfUEtWlDIYJwhLNA", "text": "It's expensive but it's sure delicious", "business_id": "PIu2Rocm6_Vyp2M3v6TKdA", "stars": 4, "date": "2013-04-02", "type": "review"}
{"votes": {"funny": 3, "useful": 9, "cool": 4}, "user_id": "fczQCSmaWF78toLEmb0Zsw", "review_id": "RcKVsajiJN3_Jpu7jnTVNQ", "text": "I scream.  You scream.  We all scream... for ice-cream!  Or, so the saying goes... not so much at B & R on Camelback though... there are 2 big disappointing factors about this B &R.\n\n 1 - unfriendly employees... I've been in on several occasions and not once have I seen an employee smile or be anything other than monotone.\n\n 2 - no soft serve.\n\nSo, it's fine to get a scoop or two, but honestly, I'd much rather drive the extra 20 minutes and go to Ice Tango!", "business_id": "XTtNevBI5G5x_GjFqSBMpA", "stars": 3, "date": "2008-03-29", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 1}, "user_id": "l53FUDHRHLg7BQ89KgAtxQ", "review_id": "VTE9LM1kkxP6p_trIUKveQ", "text": "If you don't know how to make it, don't put it on your menu, don't accept the order, don't have a button for it on your computer and don't try to hand off your creation to the person in the drive through who will be pulling away before they notice.  I'm not asking for much.  \n\nThey screwed up a mud pie blizzard.  I love mud pie blizzards and could have most likely given them most of the things you add to create it.  Instead I got an Oreo blizzard with what tasted like maybe a half a shot of coffee - but not much at all because it was still just as white as a regular Oreo blizzard.  Sigh... so sad.  I finally treat myself and they screw it up.  We also ordered a large dipped cone that came out looking like a kids sized/small.  We actually sent it back for them to re-make.  Sent back ice cream. You know it went uneaten. So sad.  \n\nBut - they have an amazing menu of food.  More food than I feel like I see at other locations.  But of course we were here for ice cream - not food.  And if memory serves from when I worked in the area, they do a decent job with that - though nothing that makes you want to go running back. \n\nIt's convenient.  And with Carvel closed down in the area, it might be getting a little more action.", "business_id": "pkUj-lZb5ZEzLBw87-pOew", "stars": 3, "date": "2007-04-19", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "vn3lecMsL3kXVe-7hg3gLg", "review_id": "xtQaDqsd8mjlYNLB7qWKWg", "text": "$3.79 for the small blizzard. Really??! \n\nI laughed when I saw the size as I picked it up through the drive-thru. I guess it's just been a long time since I've had a blizzard. \n\nDang! Guess I won't be getting one of those again for a while. (Which is probably a good thing.)", "business_id": "pkUj-lZb5ZEzLBw87-pOew", "stars": 2, "date": "2011-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "l5upkLok78p-NQN_3uurrA", "review_id": "rPUZHpdMV6wcsfQ9eYU-kg", "text": "I LOVE DAIRY QUEEN!\n\nWell, mostly their blizzards! I went and was very surprised that you buy one get a blizzard free of the same size or smaller. This definitely made me happy :D\n\nMy favorite is their oreo blizzards! That's what I usually get although their strawberry cheesequake blizzard and hawaiian blizzard is also yummy!", "business_id": "pkUj-lZb5ZEzLBw87-pOew", "stars": 5, "date": "2012-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bcjsPIrWKCbcQZosgA39jA", "review_id": "p3ZBz87_9qnJ58NbwGi_5Q", "text": "Hit the drive thru around 8th on a Monday,  it was packed inside! Got a club type grilled sandwich. My bacon was spicy. ....which was odd. Their French fries aren't my favorite style. Overall for fast food, I was ok. Got a traditional banana split, that was rather skimpy on the toppings. Not many DQs around the valley, so it was a nice treat while staying in a hotel in the vicinity.", "business_id": "pkUj-lZb5ZEzLBw87-pOew", "stars": 3, "date": "2014-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5TvK_ZVEJv7oBUHJtaXagA", "review_id": "UPQPYGOEJVughF87MEFP7g", "text": "Worst service! Ordered a hot fudge banana shake and instead got a Sunday. Instead of being nice about it the girl told me I ordered it wrong but she would remake it for me.", "business_id": "pkUj-lZb5ZEzLBw87-pOew", "stars": 1, "date": "2014-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ja8SAyDdf1aY-E7vVixJiw", "review_id": "PxOqnPZRSao5_A3RFHT28Q", "text": "The Banana Cream Pie Blizzard has been discontinued. That and the Coke Freeze were the only reasons why I ever came to Dairy Queen frequently. I don't know what they were thinking when throwing out the Banana Cream Pie flavor from the Blizzard flavors, but apparently about half of the previously large list of flavors has been eliminated and now you just have the basic Chocolate and Vanilla (so to speak). The closest thing they have now to what they had is a Banana Split flavor. Sorry, no, just throwing bananas and Vanilla, Chocolate, and Strawberry ice cream in a blender is not something to be proud of as a replacement for the Banana Cream Pie. However this happened, this downsizing, whether for improving the budget or whatever it was, this downsizing of selection was a downgrade in service and in product, and I'm not likely to come back. There are other places where I can get chocolate or vanilla ice cream.", "business_id": "pkUj-lZb5ZEzLBw87-pOew", "stars": 2, "date": "2015-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QXJ00CVxUqcpUJpltC9dnQ", "review_id": "mJYYGpVMYq-MX6hehi7mZg", "text": "It has been a while since I went back to Dairy Queen... And now I remember why. I ordered a cheeseburger and fries, and they microwaved a burger for me. Really. Apparently, they have lowered their standards over the years... Or maybe it's just this particular location. They really can't go wrong with getting a blizzard, thank god.", "business_id": "pkUj-lZb5ZEzLBw87-pOew", "stars": 2, "date": "2015-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "x6JK_aPCw6-y0mCo1YQgHg", "review_id": "OE28lBsKEm7J_b9FU4nNTQ", "text": "It's a dairy queen. Nothing really good or bad to say about it.", "business_id": "pkUj-lZb5ZEzLBw87-pOew", "stars": 3, "date": "2015-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Lq5cWFJ_-V-epSEnJY4Gvw", "review_id": "4qXijWSpaB9uJ7SBr99Q_w", "text": "I love Dairy Queen, but this location is awful. The service is terrible, and has been on dozens of occasions- I went through the drive thru and when I got home realized my order was wrong. I called and the manager told me I would have a free meal the next time I came in, and when I came in the guy told me I was only down for free fries and was incredibly rude about the whole thing. Another time I drove through and it was my boyfriend's first time at dq, so I wanted to show him the blizzard trick. I turned it upside down and the whole thing spilled onto my lap, and the two ladies at the window started laughing hysterically closed the window, and i went in to complain and they said that the upside down blizzard trick \"is like so outdated\"", "business_id": "pkUj-lZb5ZEzLBw87-pOew", "stars": 1, "date": "2015-05-27", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 5}, "user_id": "33vUIil_GCaT92aUaZhRXA", "review_id": "4XVrWEKxQfMaqIBdV6-UkA", "text": "Cookie dough blizzards & mint Dilly bars, 'nuff said!", "business_id": "vB3vEjcw9dfHmgP8ac5ZMQ", "stars": 3, "date": "2011-05-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rdH3V72a1AGiItYr6eB75A", "review_id": "WAw5mrmKSQzPk-UtkaUrRg", "text": "This is a clean and efficient DQ. You can't say that about them all... We love this DQ, they are always kind, courteous, friendly & efficient... Never a complaint here. The staff seem to all be interested in doing a great job. Food is always hot and or cold where applicable... They all seem genuine in wanting to work here...", "business_id": "vB3vEjcw9dfHmgP8ac5ZMQ", "stars": 5, "date": "2014-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "l53FUDHRHLg7BQ89KgAtxQ", "review_id": "z0F3MA7isf1wWzLF9ics8Q", "text": "Don't we love to trick ourselves that since it's yogurt, it's good for us?  And once it's low fat or fat free - well heck, we might as well add on some of that fat free hot fudge.  And since the yogurt and fudge are fat free, sure - I'll take some sprinkles/cookies/fruit on top.  It's a tangled web they weave.  And all too often we fall right in.  \n\nTCBY used to be THE Mall treat for the young and fun.  Now it seems to be more frozen custard or those dipping dots. I suppose they each have their fun cool factor.  But there isn't much better than when you hit TCBY on a day when you can get Chocolate and mint or Chocolate and peanut butter swirled together - you just have to get it.  And while I know everyone gives out free samples - theirs are pretty good sized.  Get 3 or 4 of those and you might be able to fill your craving with buying a smaller size.", "business_id": "xHuAAM3LjB6LOzNx80ldew", "stars": 4, "date": "2007-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TWjDnKexHSp0U3UQ3W01Kw", "review_id": "-nmw1iVkVxPxVQxHy8py7w", "text": "I stopped in here with a friend on a whim because a) we were in the area and b) it was hot, and a scoop of fro yo sounded like a good idea. I'm not really a huge ice cream or frozen yogurt aficionado but I'm glad we stopped here. \n\nThe girl who was working alone in the shop was a pleasant little ray of sunshine! They were about to close, and we were probably the last ones to come in, but she was still super friendly and talkative. I have to admit, when I worked in food service I was one of those that would sigh and eye-roll all over the place when people would walk in five minutes before closing time. But that didn't happen here. In fact, she offered up samples of whatever we wanted, even after I made a comment likening the yogurt to play-dough. \n\nI prefer fro yo to ice cream because I don't have much of a sweet tooth, and the stuff here is great. I'll be back.", "business_id": "xHuAAM3LjB6LOzNx80ldew", "stars": 4, "date": "2009-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G72bs75BqgW9NAVv00ADTw", "review_id": "EUmUlorbfdw4GW0zMrmxCA", "text": "This location had closed for like a year but it is back in business for a few months already.\nWe have been there about 3 times this year.\nStaff has been friendly and consistent (prior to closing I had complains about some employees being kind of stingy)\n\nI am not giving them 5 stars because this location does not give the frequent customer cards, they will punch them if you have one, but they don't carry them : (", "business_id": "8WPCqC0Y-yszJi7eqfSllA", "stars": 4, "date": "2013-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ky9pQ8AKufvZ63IxR41jGg", "review_id": "qObQ5tsjMWw75JMgJ4mD0g", "text": "Now for those of you who didn't know this location had closed for awhile....but now it is back open. It is still serving the awesome BANANA ice cream I talked about in my original review. I don't see that any real changes took place....maybe it was a health code issue.....or maybe it was financial......no one really knows. However it is back and I am personally glad to see it. Eat, Drink, and be Merry my Friends!!!!!", "business_id": "8WPCqC0Y-yszJi7eqfSllA", "stars": 4, "date": "2013-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6TaNAdNfSBbrAK4YsDA9TA", "review_id": "lxgotE8zXAbg2fIHJUKEuQ", "text": "It get the second star for the inconsistently nice service. I find Cold Stone Creamery's ice cream to be too sweet and overpriced. Whenever I order a milkshake there is way too much milk. I ask for less, it matters not... they will not shake all the milk. I wish gelato's would be more popular... :-(", "business_id": "8WPCqC0Y-yszJi7eqfSllA", "stars": 2, "date": "2015-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "ngD5RF07pxwlq4euexSluA", "review_id": "P-_kDYkhhJwEP6U6XEo53Q", "text": "GUESS WHAT?  This Baskin Robbins has Daiquiri Ice!!!!!!\n\nThis is a HUGE plus.  HUGE. \n\nSuper nostalgic flavor- those of you who grew up eating this know what I mean.  Awesome for those that avoid milk products.\n\n  80 calories for 1 kid size scoop.", "business_id": "qeqrsjWXc15KmlK5Z8580Q", "stars": 5, "date": "2011-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ky9pQ8AKufvZ63IxR41jGg", "review_id": "mjlu6T37RWIo-XqJ4nCksg", "text": "Not a huge fan of Baskin-Robbins.....but they do have a decent deals during the week but only during certain hours. The place is nothing special and the seating area along with the tables are always in disarray. I hear this establishment has been around for many years but this one is very small....outdated....and a bit messy. Some renovations might improve it....but for the most part I would go elsewhere for Ice Cream. Eat, Drink and be Merry my Friends!!!!!", "business_id": "qeqrsjWXc15KmlK5Z8580Q", "stars": 3, "date": "2013-04-07", "type": "review"}
{"votes": {"funny": 5, "useful": 4, "cool": 6}, "user_id": "K6MrbZeqKG35ZiucFfucvw", "review_id": "tgbIHb_pqrjc7_x0XaRmNQ", "text": "I scream, you scream, we all scream for ice cream!!!  Service is alright, but ice cream in general makes up for everything...You can never go wrong with Peanut-Butter & Chocolate ice cream!! I think that is all I have to say about this! :)", "business_id": "qeqrsjWXc15KmlK5Z8580Q", "stars": 3, "date": "2014-05-05", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "7z6uuJ3fuaurG4dmdGidJw", "review_id": "8BiDORbHvGzhrPGbVKiTEQ", "text": "Get the White Chocolate but leave the Strawberries and Cream flavor, too faux-berry/chemical tasting.", "business_id": "sAwxt4I4gTiL-08nyarJbg", "stars": 2, "date": "2011-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "l53FUDHRHLg7BQ89KgAtxQ", "review_id": "QB3d9aWHEiQgZXGq1U64HA", "text": "The shopping center may be a little questionable, but there is nothing to question about their Ice Cream skills here.  \n\nMore than any other Dairy Queen I've seen in Phoenix, you leave here with something that looks like it could have been in a picture.  And if it doesn't look like the picture, it's because they made the cone too big, or gave you extra ice cream in your frosty.  I'm telling you - it has all been really amazing.  They even handled a more detailed special order super - every time we've gotten it. The interesting thing is, the last time I had anything close to that there was a much older manager who'd been doing it for years.  Everyone in the place seems pretty young - but they seem to have a great sense of pride in doing the job.  I've actually heard workers say, when something didn't come out well - but before it had ever been handed to a customer, \"You know what, I can't serve this to you like this, hold on just a moment and I'll make you a better one\".  Where else are you going to get service like that?", "business_id": "McDRY65dB9a2hyk_bzcnkQ", "stars": 5, "date": "2007-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "-RvaYQU3SfBSbJCtNzIvzA", "review_id": "Lzl4SLA6wDl9X3lRMUSLNw", "text": "These homies are as cool as their icecream. We went through the drive-through and not only were the employees patient with us, but once they had our order, they were very fast and made every order perfect to our standards. \n\nMy sister got a strawberry shortcake shake, and it was quite fabulous. Every bite was packed with flavor, I'm sure they put more of the stuff in it than icecream. The cup was overflowing, but wasn't dripping, and I appreciated them wiping down the cup for us (sometimes you get a sticky or dirty cup in other places). \n\nI bought a peanut buster parfait and HOLY COW. It is so freakin' good. They make sure to layer the icecream with a nice helping of hot fudge and Spanish peanuts. So every bite has the perfect mix. \n\nAgain, the service was great. I can tell that the employees take pride in a job well done. \n\nTIPS & TRICKS: \n* As good as the peanut buster parfait is, it can be slightly overwhelming. Ask for just a hot fudge sundae topped with Spanish peanuts, and you've basically got yourself a tiny, cute version of the parfait. \n* Look for them tipping over your shake if you are inside, they prove that their shakes are so thick it won't fall out of the cup. It's kind of their signature thang, and it's kinda fun to secretly hope your icecream will plop on the ground--even though it never does.", "business_id": "McDRY65dB9a2hyk_bzcnkQ", "stars": 5, "date": "2015-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "9qCPmT6ovJjxL4tJB4ANCg", "review_id": "RhuAclcyqUMxmUipjdfGIQ", "text": "Of all the Dairy Queens I've been to in my life in CA, TX and now AZ, this is the nicest and cleanest location I've been to. I guess that's what happens in Awhatukee.\n\nThe staff is fast when you order inside and also when you order through the drive thru.\n\nI could eat Chicken Finger Baskets and Blizzards all the time! I'm happy to live so close to this location and enjoy all the wonderful treats this place has to offer.", "business_id": "fRtuc2k17r6aZMJWEMcXFQ", "stars": 4, "date": "2011-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l5483pEya57EM9olp-LHFQ", "review_id": "4HkK-7RVBsHmNOQatSZ-Gw", "text": "I  buy 40 gallons of water every week to 10 days. Have gone here for nearly two years. Last time though was the last time. Am standing in line to pay for my 40 gallons and the lady in front of me buying 2.5 gallons pulls out her punch card. When it's my turn I ask clerk about punch cards. He tells me that they have them. Feeling annoyed I asked why he hadn't ever offered me one considering the amount of water and I buy? Clerk says, \"thought you must have had one as much as you come in here\". \"Really,\" I asked. \"Didn't you think that if I haven't ever used it that maybe I don't have one?\" \"Yeah, I'd be pretty mad if I were you,\" the clerk says and hands me a punch card. At this point, he should have punched out a bunch of holes but he didn't. Furthermore, I've purchased water from every clerk and the owner in there and no one offers the card? Yeah, I know it sounds petty but with as much competition as there is out there, I'm going someone where customer appreciation and service is a higher priority.", "business_id": "OeMFOkAqCjKmVLPSsUDB-w", "stars": 2, "date": "2015-04-25", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "OnGKdONTxlNYyjX6KXhL0A", "review_id": "W_onh-XNJPRfuk75_uzecQ", "text": "I am so tired of this baskin robbins location that I am taking the time to warn others... This is the worst baskin robbins I've been to. They don't answer the phone, they won't take an order unless they have 2 days to fill it and after firing nearly the entire staff a year or so ago it has gotten no better. I think the ownership of the Ahwatukee location has much to do with the problems Sad, we now drive into Tempe @ Guadalupe and McClintock when we need a pie or cake and have never had any issues. After trying to get hold of the Ahwatukee branch today for an hour with no success I called the Tempe BR to order a cake for tomorrow night and they were more than happy to do it for us. Time for a drive to Tempe...", "business_id": "rHY8KUStCMQMSZCC2KRMfQ", "stars": 2, "date": "2013-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-7LfdqX286W8zJ01ljY_SQ", "review_id": "UGj-EGo1WzWPcm5UD3XWBA", "text": "The gelato / ice cream war has been raging on for some time now, and the gelato side seems to be wining with me lately- but I can't pass up a trip to BR31 every once in a while. I get a craving for their Gold Medal Ribbon flavor (chocolate, vanilla, and a creamy caramel swirl). I had the kiddo with me this trip and ordered her a kids scoop of the ribbon on a cone and she went to town, never looked back and grinned the whole time. \n\nI noticed there are themed nights to take advantage of- like family night Wednesdays where they have good deals on single or multi scoops. There's also a day where sundaes are BOGO, so that's a great deal as well. Not sure if the web site has more details, but there are signs all over the store promoting these daily deals. I mean, our order of the kids cone and 2 double scoops was $11, kinda pricey if you ask me. You can get hand-packed pints for $5, which is probably the best deal but man that's a lot of ice cream (and calories).", "business_id": "rHY8KUStCMQMSZCC2KRMfQ", "stars": 4, "date": "2014-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "leCRchr3W3TEcVgmEOpuUQ", "review_id": "HLBqcq0WKXJEXBQv-ChH2w", "text": "Went there with three kids. The service was excellent. The ice cream was great and the kids had fun choosing from the many delicious flavors and treats.", "business_id": "rHY8KUStCMQMSZCC2KRMfQ", "stars": 5, "date": "2014-05-12", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "lC4X2crUuxT9Ac9BlOX4Uw", "review_id": "GWBlLn8lBlIm_6zAuXcCjA", "text": "Nielson's is a local favorite. But I am still confused why everyone loves this place SO much. We have a few couples who nearly beg us to go here after a movie or dinner. Usually we'll give in. And it isn't horrible or anything. I ust prefer others better. I think the frozen custard is pricey and the taste is creamy but otherwise boring. \n\nOne bright spot are the sandwiches, called Grinders. Try the Spicy Italian with pepper relish, the Roast Beef w/ Guacamole, and (my favorite) The Finer Things, with turkey, avacados and cream cheese. Probably not the best for my expanding waistline, but a delicious indulgence.\n\nOthers negatives that pulled my rating down a star: since they are popular, the wait can be 10-15 minutes. And with high school kids behind the counter, the service can be poor.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 3, "date": "2007-03-22", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "-yqgNgb0SK1TovV7PX8nHw", "review_id": "mEnP2nZtnr3EHW8nTUzZeA", "text": "Been coming here for years and will always come here when I want the best custard.  Food is always fantastic and the staff is friendly.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 5, "date": "2012-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IMwl862R81TZrq5KTkjKhg", "review_id": "zsaVENCdAsflMBncmBksgQ", "text": "Great ice cream. Food is alright. If your in a hurry this might not be the place for you. Can take a while to get good. They are fairly quick with the Ice cream", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 4, "date": "2013-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UR0yS_45oMOxzRpFMuBI4A", "review_id": "e3JJAk_gjuEjOImNsfK3lw", "text": "we are here from California, visiting family, and they were excited to take us to Nielsons for frozen custard so we decided to eat dinner as well. They younger staff were very nice and helpful but the older woman manager was rushing us as we ordered and became agitated when one of us brought it to her attention that the bacon that she paid 1.50 extra for her burger was basically less than paper thin and full of holes. This woman manager was very rude about our request her 1.50 comped on our custard order, like it was an unreasonable request. Maybe the manager could be more willing to accomodate and have a better attitude towards customers. My 1 1/2 yr old niece dropped her frozen custard from kids plate and they didnt offer to replace it, or to even sell us another one. We had to buy a full size adult frozen custard. This manager is pretty stingy! WE loved the food, and the custard was very good, it would help business for this manager to be more people friendly.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 2, "date": "2013-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f7Hv9J9GTTXd3XsfRgt3Pw", "review_id": "FBT7IMXY57dSY6c1rMtrHA", "text": "This place has been here for several years and I popped in one time after a visit from my dentist.  That first visit had me sold and it wasn't long afterwards that I was talking about the place while visiting my dental office and telling  them how good it is.  Well to my surprise not one of the people that worked in the office had ever had a taste of Nielsen's Frozen Custard.  *gasp*\nCould this be true?!\nI mean how is it possible?  This place is not even a quarter mile from their office.\nSo I brought in several varieties prior to a follow up visit and the staff was thanking me profusely.\n\nREAL frozen custard.  It is delicious, has flavor you can truly taste and real substance that doesn't wimp out immediately when exposed to the AZ weather.  \nI've had Freddy's and Carver's and although theirs is tasty there is something about the recipe that just falls short of Nielsens.\nAnd that Rita's place, c'mon.  The staff there uses a mix and couldn't even tell you the difference between ice cream and frozen custard.  \nAnd someone was telling me I need to try it, it's good.  \nWhen I indulge in something that is going to pad my hips and thighs I prefer authentically delicious, not false a representation.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 5, "date": "2013-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l07vj59TUmjAzqWl87pjzA", "review_id": "jSbegj4mbOG1QhwYdIv6Fg", "text": "Great custard. Very similar to Frozen Custard from back east. My wife also loves the fries and the dipping sauce. We will be going back soon.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 5, "date": "2014-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ySHBXNklSdzm_OttdbW-Rg", "review_id": "rhss_1zBxDfoapkkIV_mOw", "text": "Although this place has some pretty solid frozen custard, I was completely unimpressed by the service. I was treated very rudely by a young man, who was a teenager. I get that he is young and immature, but the manger was right behind him and decided to do nothing. I was totally unimpressed by the service, and I am sure whoever the owners are would want to know about it. The same employee treated the next person in line the same way - with the manager, again, doing nothing. I have nothing to knock on the actual product, it was fantastic. But the service needs to be a focus in this place.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 1, "date": "2015-03-23", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "U6ejkipk98Hn5-NGUFjb4g", "review_id": "HcpHGtPfLco08NJnU2fYGg", "text": "Awful. It was completely overpriced and worst frozen custard I've ever had. I got a mint concrete with Oreo mix in. The Oreos were ground to a fine powder, if there hadn't have been a few black flecks I wouldn't have even known they were in there. It wasn't minty at all, it was just thick sweet milk. I paid $6 for this!? NEVER coming back.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 1, "date": "2015-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "A8IRUIqpT4_6wq2HcXoyqw", "review_id": "fFn3USPnwsX9xavkRJXqPA", "text": "We came here because they  have a PayPal option and when we went to pay they said \"We don't take Paypal.\" Well, if you don't take paypal why Is it even an option? The whole reason we chose to go to this place is because we could use our Paypal account. The manager was not understanding or sympathetic about the problem at all. Bad management kinda killed the whole experience for my spouse and I.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 1, "date": "2015-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "isuDQPQB-GBBQdMW2q-QaQ", "review_id": "gYi105XsR9Uq4a8HdSBRDQ", "text": "I usually love this place however there new funnel cake ice cream and churro ice cream are horrible. the pastry was stale and hard and lacked flavor. I will continue going back but get the old stuff I love. I think the worker was trying to tell me to stay away but i wouldn't listen.", "business_id": "IgMFOK_SOND-4b_DpvFCSQ", "stars": 2, "date": "2012-04-22", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "lAngRi4lwBIHmjCBVLd-8Q", "review_id": "1OiBdsa-dulsRTdN7sp9KA", "text": "I don't really have a sweet tooth.  I feel like desert is wasted space in my stomach that I would rather fill with regular food.  I had to give this place 5 stars though because of the service.  My wife had an ice cream craving at 10pm on our way home one night so we stopped at this place.  As we pulled up we were afraid they were closed but could still see workers inside.  We came up to the door and one of the workers approached us opened the door and told us they were closed.  We must have had the look of two kids whose ice cream cone fell in the dirt because a lady, who turns out was the owner, walked up behind the employee and asked us what kind of ice cream we wanted.  We told her we were simple and we'd be happy with strawberry.  She quickly ran behind the counter and got us a small cup, rang us up quickly and thanked us for coming in!  I was shocked.  Hard to find that kind of service these days.", "business_id": "IgMFOK_SOND-4b_DpvFCSQ", "stars": 5, "date": "2012-05-28", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "9grWfWBCR6y1T8WJs_MHHg", "review_id": "Ffs30ixMXIi_7laHMkbKTQ", "text": "Smash cold stone on the reg yo. If you give any but a fizzle stizzle revizzle than you're mental. You know what you're getting. You have to wait in line? Who cares, that's a good sign. Too much? Go to the grocery store and make some blue bunny broke sundaes. As for this playa, I'll be on the grind with my custom ice cream, G.", "business_id": "IgMFOK_SOND-4b_DpvFCSQ", "stars": 5, "date": "2015-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lrQfSNnNMw3C90WowGVUnQ", "review_id": "AmS1bdIkwnk4DLFpMSf8ig", "text": "It is a very typical Cold Stone Creamery. I ordered something that I was disappointed in, not their fault...mine. I figured hot fudge would be \"hot\" fudge out of a warmer, not out of a squeeze bottle. But, overall they do what they do very well. I like Baskin Robbins better, but Cold Stone always delivers good ice cream.", "business_id": "IgMFOK_SOND-4b_DpvFCSQ", "stars": 3, "date": "2015-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0x5dAoI3FTqkGA8lY6OlCg", "review_id": "G9VzmehdWxgRAXGwtOv6XA", "text": "The ice cream was good. But I'm not okay with paying that much to get good ice cream with a side of snotty teenage girl attitude. We were in last night and if looks could kill....the girl serving us would have killed me. She totally acted put out to be serving us. On our previous visit I didn't get dirty looks, only the attitude.", "business_id": "IgMFOK_SOND-4b_DpvFCSQ", "stars": 2, "date": "2015-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GgUZ324etNyusv993M-S8Q", "review_id": "MsaXxnH-5Y3NqAYSmK1YOg", "text": "They don't take cards, which is a bummer.\n\nWhat I don't like is that it can be a hotspot for teens to socialize (since there's a high school basically across the street); which can get rowdy and annoying.", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 3, "date": "2010-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ewf-2BV0ApO6eRmwfenZ8Q", "review_id": "UAAYrHPI5rvXyxQIR3h-fg", "text": "I go here as often as possible. I went once and realized I had NO CASH after I had ordered, (Mesa FroYo is cash only =[ ), I was so embarrassed but the man at the counter was so nice! The flavors are excellent, the establishment is super clean and the employees are always, always, always wonderful!\n\nIn addition to being a friendly place with lots of options it is ridiculously cheap.\n\nTRY IT!", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 5, "date": "2010-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sWpJ6hxao0yyhP56Re8gOw", "review_id": "LTxBt5h9Xez3PWRglIbmPA", "text": "This place is so cute. It reminds me of a cross between an old-school ice cream parlor and a Philadelphia-style pretzel/hoagie shop.\nYou can tell it's still family run, and so what if they don't take cards, I say!\nHonestly, so far I've only sampled the yogurt (3 different times), but it is some amazingly tasty stuff.", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 4, "date": "2011-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9HhwtAe8mOQiI8_hXQhtXA", "review_id": "0g9wNMBDtFoNFZC5kRR2lQ", "text": "By far the BEST fro yo place EVER. That is all I have to say.", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 5, "date": "2013-04-28", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "RyX1dtn2eACiehBSj7rxEw", "review_id": "mOjcdOPzWNcB3Wp5BQsEpw", "text": "Great local frozen yogurt place! They had a small variety of frozen yogurts which change daily along with a variety of toppings. They have a selection of to-go frozen yogurts that aren't on their daily menu which is nice. Their offerings also included some snacks such as nachos & pretzels. The vanilla frozen yogurt with gummy bears was really good as were the nachos! I'll definitely be going back!", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 4, "date": "2014-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lW7i_XQph_uX_PMkNEUsbw", "review_id": "kd02UAMmJJWqJWKb5q9eGg", "text": "This place is a landmark in Mesa. I think Mesa Fro Yo has been here longer than I have been alive. It isn't super fancy, and there isn't a ton of variety like some places; but there flavors are so yummy and unique. The prices are reasonable and you definitely get your monies worth here! Another great thing is that they have other things besides yogurt; so if you are looking for a little snack or something they have things like soft pretzels, rootbeer floats, and smoothies.", "business_id": "7UAAkWZJnnHIpGdG0JfXqg", "stars": 4, "date": "2015-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EoTooNBcxu0Hy0-XeZI8aw", "review_id": "E_2eWjz3kIgeIaF4zaNssA", "text": "I love Cold Stone.  I think it's the fixins that make the ice cream.  I've found that their bland ice cream is to complement the fixings you put in there.  I love love love their chocolate ice cream with peanut butter and peanut butter cups.  I used to obssess over that.  Thank god I don't anymore.\n\nI wish their ice cream would have a bit more flavor, though.  Sometimes I just want a scoop of chocolate ice cream and when I get it, I am reminded with every bite that I should have jazzed it up a bit with some pb cups and pb.\n\nDon't get me wrong, though -- I'll still mess up a Like It size.  Anything bigger than that will make me feel a bit sick after a while.  I wish they would have a smaller size than Like It.", "business_id": "HEAAXwMrHkxEdRwdtqsogg", "stars": 3, "date": "2007-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "3hPmlMAP3PfHMiwNW_RUZg", "review_id": "P-uSxrPILfkUXvGnMBQ-0Q", "text": "Ok, so anyone who follows any of my reviews should know now, that I love deserts (chocolate especially), so of course I would end up reviewing here! I love the peanut butter cup perfection. But to make it that much better, add a brownie for like $.80. So worth it! Cold Stone has some great specialties, but come on people. Pay the extra for the extra fixin's and make it exactly the way you like it! Even try changing out the flavor of ice cream they use to make it taste different every time. I mean I'm totally a girl who fixates on one thing they love at a particular place, but even I, on occasion, change it up! Keeps my taste buds guessing (come on, you only live once)!! Just enjoy slowly the price and of course to curve brain freezes!!", "business_id": "HEAAXwMrHkxEdRwdtqsogg", "stars": 4, "date": "2010-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9UK28WYQvS7aXyNfa_hLCQ", "review_id": "YTz-wZk-9zREL6ac-rQA4w", "text": "Central location, awful execution of ice cream creations. Ordered my brother and I some sweet treats to beat the heat recently. I normally don't complain about the prices, but for freezer burnt ice cream - $10 for two small ice creams is insane!\n\nWe could have settled for $1.00 McDonald's hot fudge sundaes and probably been more satisfied.", "business_id": "HEAAXwMrHkxEdRwdtqsogg", "stars": 2, "date": "2012-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w9FobM_vIS2TH0xU7NPPJA", "review_id": "fcGaz05GvlTEZvS-L9DGaQ", "text": "I like coming here, only thing I would change, maybe get more employees. I have been in here maybe 5 times. Everytime I come in here, its got people waiting. It takes awhile to make one ice cream when they start mixing everything together. So it does take awhile. But I love the ice cream enough to wait. My Favorite is the Birthday cake Remix and the German Choklate cake.\nI come here mostly with my wife and kids so I feel bad for whoever is behind me,especially with how long it takes to make one. Poor people behind me is gonna wait like half an hour.", "business_id": "HEAAXwMrHkxEdRwdtqsogg", "stars": 4, "date": "2013-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QIDkxqj4fVs3xeEEFLnhmQ", "review_id": "RZIBObTapdcbltNgpZQMyg", "text": "Always been good!  Had a choc ice cream double dipped in cherry!", "business_id": "5C4gtiP5qkBKFF3og7Wt3g", "stars": 5, "date": "2011-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E8OdPGNMMWtEx032vXDLTg", "review_id": "3SCi8TO-oIpIjlbY8_dZyA", "text": "friendly and fast! but they are in need of a remodel.", "business_id": "5C4gtiP5qkBKFF3og7Wt3g", "stars": 3, "date": "2013-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h5-yhYHT-1Yk4h7q7vjQDQ", "review_id": "OZquAktrt3HdFvaby-asWA", "text": "Ah,  DQ and their yummy Blizzards,  what would life be without them? Thank god I don't need to ask.   I always get my favorite,  Heath bar with carmel added.... I really need to branch out,  but it's soo good!  Big chunks of health bar mixed with almost too soft soft serve,  you really can't go wrong.   I always have them add a few squirts or carmel,  it really tops it off.   My daughter got the Triple Berry smoothie,  which she liked fine,  but they gave her a large insted of a medium.   Only a big deal,  because she'll never drink the whole thing.   DQ will always be our cold treat fix, and  my bathroom scale hates me for it.", "business_id": "kqFQLV63mAYCsY1LSB2OZw", "stars": 4, "date": "2014-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SVW4T-uQAG3pR6zkTSinqQ", "review_id": "MAFVpNMkACO4VI7mlTuoqg", "text": "Awful service! They were serving people who came after my party! We only ordered blizzards and cones. When I asked about it, I was given attitude! If you want to be treated fairly do not come here!!!\n\nI would also like to add that the floor was extremely dirty!", "business_id": "kqFQLV63mAYCsY1LSB2OZw", "stars": 1, "date": "2015-05-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Syc4pbEkL3bbzjO4X4HhQw", "review_id": "8H5VSSMoEZ3d3AE6CUZlFQ", "text": "gotta love dairy queen.  This one has good service and seems clean.", "business_id": "zvFhC2Lywo6e8UaRTVj7sw", "stars": 4, "date": "2012-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y09Zhjx7671gvyPqHdAJ5w", "review_id": "Ml_vQfIiJdOS8VZWXHdyAQ", "text": "Hey it's Dairy Queen, what more is there to say? it's always clean", "business_id": "cG1pHlWhdSc2M9ChWZo-dg", "stars": 5, "date": "2012-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pi_f7sm9mclhBMtRHvGL1w", "review_id": "vYxOTzCedl3ROMNYMifK1A", "text": "Cheeseburger and chocolate cone - can't go wrong. Reminds me of childhood.", "business_id": "cG1pHlWhdSc2M9ChWZo-dg", "stars": 4, "date": "2013-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "T7J9ae0wTskrI_Bgwp-4cA", "review_id": "qT48fCJ8XEHveOdTFPByHQ", "text": "cheap good ice cream.  Skip the smoothies they sell here though... yuck!", "business_id": "fN3RgiXJMoYcZzn9y8JRQw", "stars": 4, "date": "2008-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "WcnFWEVx9HO4eplGqvvr1w", "review_id": "hBLJyjhUT6QJVEGJYAs60A", "text": "This place is has exactly what I need..  Black Cherry Ice Cream!   I'm not really into ice cream, except for black cherry, and once a year, I'll crave rocky road.\n\nMy kids love going here.  The prices are fair.  It's how much ice cream cost.  \n\nI usually get Hawaiian Shaved Ice there.. nice, simple, and satisfying.  \n\nI'd add an extra star if they had more seats.", "business_id": "fN3RgiXJMoYcZzn9y8JRQw", "stars": 4, "date": "2012-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E0DwBRVGyUyENL3SSXnhQA", "review_id": "Oqy5m6ERAH6csPH5mGfx3Q", "text": "This water and ice store is owned by the nicest couple.  They are always friendly and smiling. We stopped by on Mother's Day just after close and they warmly welcomed us in.  Shopping local is good for everyone and it's nice to be able to do our part in this small way. Now if I could just talk my husband in to letting get ice cream instead of good for me water this would be a dream come true.", "business_id": "fN3RgiXJMoYcZzn9y8JRQw", "stars": 5, "date": "2015-05-10", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "1mal-cvLhyX8iGEt56_5Dw", "review_id": "jOHMhiuEqg8lJK0JvW7YgA", "text": "I don't get Cold Stone.  My daughter once got the mint flavor w/ mix-in, it tasted like toothpaste, the mint flavor was so strong!\n\nThe mix-ins give ice cream w/ so-so flavor some zip, but that adds too many unnecessary calories.\n\nIf I'm gonna blow bucks on ice cream, its either a special stop to Angel Sweet where the flavors of the gelato on its own make it yummy, no need for mix-ins, or I'll pick up some Ben & Jerry's, Blue Bunny or Breyers from Fry's.", "business_id": "KgYvd2BlQIGUw4Aj5qKevQ", "stars": 2, "date": "2008-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XEWjo3PgujPLSv5hVJJutQ", "review_id": "oR7Fx-DR77P8YoH06HeA8w", "text": "The ice cream is good. Workers are friendly. But god the place was so dirty the last time I came... I literally was tip toeing my way out cause the floor had dirty water or something. It was gross.. And the place is too small and I felt cramped up with the other customers.", "business_id": "KgYvd2BlQIGUw4Aj5qKevQ", "stars": 3, "date": "2013-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vdRbPHg4uq7XfwlgcyS26Q", "review_id": "jfl-E32B-WpH_kl98uVkzg", "text": "Worst service ever! The two girls working completely ignored us and continued cleaning as my boyfriend and I were waiting to order. Amanda who presented herself as manager was nothing but rude and argued with me when I asked to speak to someone above her. Completely disappointed! Food display was sticky and both the girls Amanda and Haley had no emotion I for sure will never come back.", "business_id": "KgYvd2BlQIGUw4Aj5qKevQ", "stars": 1, "date": "2014-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y0gOmDSelsGVshVCv9mjMg", "review_id": "s7CG-91vfUn1DlkoNP4Ejg", "text": "Worst place ever to get ice cream with a smile! - The employee was very racist, just because of my color doesn't mean I stole my own mother's card just to buy some ice cream and I had to bring my own mom here just so the employee can serve me! Definitely never coming back here again. I'm taking all of my business to Baskin Robins. Coldstone Creamery - You have lost my business. Will never come back again!", "business_id": "KgYvd2BlQIGUw4Aj5qKevQ", "stars": 1, "date": "2015-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y0gOmDSelsGVshVCv9mjMg", "review_id": "OygvgrIr15JFub68iyk76A", "text": "UPDATE: Finally, some better employees! These guys know how to serve me right at night! Definatley will come back again.", "business_id": "KgYvd2BlQIGUw4Aj5qKevQ", "stars": 3, "date": "2015-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "HHDqVyBgXMY-VPrt-_j0Ng", "review_id": "0XjaOqkoW2rBeRawoy0cZQ", "text": "Went to the Gilbert DQ tonight for an after dinner ice cream treat w/ my husband and son.  We all wanted a peanut buster parfait.  My hubbie and son both like peanut butter so they decided to try the Peanut Butter Blast.   It looked just like the peanut buster parfait but w/ PB added and the price was the same so we ordered two of those and one p-buster for me.  Imagine our surprise when the Peanut Butter Blast sundaes showed up as half the size of my p-buster parfait.  We really felt ripped off by the deceptive picture shown on the menu and won't be going back ever again.  DQ....you've made my list of companies I won't visit ever again.  Sonic has a better deal and they won't rip me off.", "business_id": "waNp5VTwK1ZRF3XkOwSaSw", "stars": 1, "date": "2013-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "-qufCPk-o3LU6OnF7tvMTQ", "review_id": "oHg_lfonjKAQ0RkmH1pBLg", "text": "Not impressed. They screwed up order.  How hard can it be do make plain hamburger,  no cheese? I told the kid taking my order 3 times no cheese.  So when I get order and check it.  Cheese.  Guy goes to remake it and comes back real quick with new burger.  I burn my fingers on burger wrap....  Why you ask? Cause he microwaved the new burger.  Grrrrr.  When I asked him if he microwaved it he said no.  WTH? No way burger was cooked on grill that fast.  Pathetic service.", "business_id": "waNp5VTwK1ZRF3XkOwSaSw", "stars": 2, "date": "2013-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "17cbO5ibaNtROiDPwqLjtw", "review_id": "k_jAx4yUbmjHnrB4gqwTyg", "text": "The staff at this location is absolutely top notch! We literally drive 20 minutes to go to only this location. There is one right down the street from our home but they refuse to fill our special requests. The evening shift staff is the reason that we keep coming back!! They are all so friendly, and they are always willing to make our favorite peanut butter crunch blizzard. If you've never had one go here and try one. They do an excellent job!", "business_id": "waNp5VTwK1ZRF3XkOwSaSw", "stars": 5, "date": "2014-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lufXhPb2WbbHA_7LxZwlLA", "review_id": "-XFCwf_0SUqtA0P8qa2iOA", "text": "I was so impressed.with the team at the store on Gilbert Rd. I was asking about a new product and before I knew it he almost sold me every new flavor! I had to ask his name because this young man is going to go far. Thank you Hayden for offering the best service I have had at dairy queen yet. He is a company stand out. Also a shout out for Derek. Excellent job Gilbert Dairy Queen :-) :-) Thank you!", "business_id": "waNp5VTwK1ZRF3XkOwSaSw", "stars": 5, "date": "2015-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-oTShoUYoD5_BicYfZsyUg", "review_id": "m7ZhhrmDnYBfuYkMHzSV2Q", "text": "I would highly recommend this location! I have been going to this location for years and it seems like this location just keeps getting better. This store just went through a remodel and added a brand new patio and looks amazing. Customer service has always been top notch and the store is super clean!", "business_id": "waNp5VTwK1ZRF3XkOwSaSw", "stars": 5, "date": "2015-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gNKFTqOAZtHlJPgWhVITEw", "review_id": "UCP7MECbud1nbcUgdVrznQ", "text": "For a company that bases 99% of its workforce on high school aged kids sticking their hands in your food these guys do OK.  Its a perfect location next to the splash pad and a great place to sit and take in the atmosphere.", "business_id": "EJzoRTV3IUSxpnxRAzngDw", "stars": 4, "date": "2012-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "chI2p-ROg2tXI2-tT2_G2A", "review_id": "KDJM-QKKl2pnm2EWTQ_ffw", "text": "I love ice cream but Cold Stone is way overpriced. \n\nThe service here is great!! You can sample a couple of different flavors but for a small cup with only 1 mix-in, it'll set you back around $4!", "business_id": "EJzoRTV3IUSxpnxRAzngDw", "stars": 3, "date": "2012-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jHiDhITbHSP799pPKWpYPg", "review_id": "a2V5nG-NKU-gjwEy_xbBzA", "text": "Close to home, in a shopping center where not much is affordable. The ice cream is pricey but tasty and the place has a good vibe to it. Peanut butter cup perfection creation is fabulous. Nice kids working there.", "business_id": "EJzoRTV3IUSxpnxRAzngDw", "stars": 3, "date": "2014-04-29", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "OQMOgqS1NFIyAW4i66iDYA", "review_id": "wExRQGQ_gdBRLwf5c28mhw", "text": "Ben & Jerry's is still the best chain ice cream shop! The employees are always helpful and polite, and their flavors are just outrageous! The smell of the waffle cones and waffle bowls wafts out the doors as you walk by, and you can't resist. Whether you go for new flavors or classics like Cherry Garcia and Phish Food, you can expect the most flavorful ice cream with the perfect consistency.", "business_id": "uf4AWTEI6RmRUXx-28MZsg", "stars": 5, "date": "2009-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2OLdiDZNdrPkdjp1WmW0-w", "review_id": "TU_ttwYOTXvPad-WcZzkLQ", "text": "Went to the only Ben & Jerry's in the Valley of the Sun to take advantage of the \"Free Scoop Day\" which the ice cream chain offers on their anniversary, every April 12.\n\nArrived to find out that this location doesn't participate.  Really?\n\nGot a cone anyhow, it was good, and expensive. ($3.60)\n\nThe service was very friendly.", "business_id": "uf4AWTEI6RmRUXx-28MZsg", "stars": 3, "date": "2011-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hVXqTGQc_Io3rHYopz165g", "review_id": "QtdjVF3Rv7Pd-M04ey_sfg", "text": "The orders are expensive for drive-through, and sometimes the lines are wayyy too long. This place needs a health inspector, both myself and two others (a friend and my mother) have gotten sick-- violent stomach pains--from this place's food. After about a year we decided to try it once more, and while nobody got sick this time around, their \"containers\" were open ended and all the food was stuffed into a bag which resulted in everything getting spilled. Consequently, I will never be going there again. I should have learned my lesson with the stomach pain incident, but places like this should be given a chance. They failed that chance.", "business_id": "L6Qumi_rEtOAfX2FQXm06Q", "stars": 1, "date": "2014-05-24", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "-4JKqhq0K7_mEp_i4JPbCg", "review_id": "IjO9-D3zPHbuLzqmPxAptQ", "text": "What a horrible experience at this location! I will never go to this location again due to the customer service! The workers here need to realize they have a job here because of the customers! I repeated my order 3 times to the boy at the drive through. After the third time he said just come to the window. I then repeated it again and he still got it wrong! So I patiently waited and asked him to put the stuff he already gave me back in the freezer so it wouldn't melt as it was still 90 something degrees out. He only put some of the order away and left the rest out while he remade the blizzards. He was very apologetic which I was fine with. He finally gave me the new blizzards; however totally made one of them just a little more than half way! He totally half a**ed it! I said to him just because you got the order wrong doesn't mean you cheap us out on what we're paying for! I asked to speak to the manager. A very messy trashy looking young woman came to the window and immediately had an attitude! At first I thought this is what they have representing there store?!?! She looks very homeless like and dirty! I told her what had happened and she said well what do you want me to do about it? I said I just wanted to let you know and she still had major attitude so I asked for her bosses info and at first she was reluctant to give it to me. So I had to repeat my self with this trashy woman. She then said you need to wait I don't know the owners info... I said never mind... (There was already 9 cars behind me I didn't want to have them suffer any longer due to the laziness and lack of common sense from the teens working in here)! So as I was leaving the homeless looking like manager slammed the window closed infront of me and my son! I'm surprised it did not break! This company is really screwed up having someone like her representing them! I would rather go to the location on Peoria then deal with these idiots! We go to DQ every Saturday evening...so looks like we'll be spending our $ there! I then told my son this is why you go to school so you don't end up working behind a counter like those idiots! As we got home my son was eating his blizzard and it was wrong! How hard is it to get an order correct?!?!", "business_id": "L6Qumi_rEtOAfX2FQXm06Q", "stars": 1, "date": "2015-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JSUHJTknGn_UePm75QIeDw", "review_id": "F2lLmFo-l2Tuaf_UsFWYHQ", "text": "This place is a nice one to come and get ice cream with the family.  Clean and always good service.  My girls love their ice cream!!!!", "business_id": "fJfh5j2f9AhivqGelAThsg", "stars": 4, "date": "2014-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1JlPVFzAp6kIUVph80EKjw", "review_id": "nfDGRpC3S7QCAy2TTt2K-Q", "text": "All the workers are so nice and welcoming. They walk out blizzards and food out to us, make us feel like family. The petite girl with curly hair, who took our order is soooo sweet. There's nothing like getting a blizzard unless it's getting a blizzard with a smile. And everyone has great smiles here!! So happy with my service!! I will come here again!!!!!!!!! Yayyyyyyyy blizzards!!!!!!!!!!!!!!!", "business_id": "fJfh5j2f9AhivqGelAThsg", "stars": 5, "date": "2015-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XG0Wr8KxC5JBds70AbcYWg", "review_id": "Ds3BLQIAQJrBYY_HXHz98Q", "text": "Fast service and delicious ice cream", "business_id": "FBNxmgHqP9ksk-56XLJ1eg", "stars": 5, "date": "2015-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3KcdPQFTaoLX4vY5Ml7jwg", "review_id": "1kcBipU_1OPY8s8o-ph73Q", "text": "Best DQ around..", "business_id": "FBNxmgHqP9ksk-56XLJ1eg", "stars": 5, "date": "2015-05-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XXevhxVb6RVZ5NcFQo6Caw", "review_id": "dX4z2m424o3j1JO33f-a1w", "text": "The best ice cream cake EVER!! The cake was the hit of the party! Store is clean and staff was friendly!! Went back today for their $5 lunch WITH a sundae!!", "business_id": "FBNxmgHqP9ksk-56XLJ1eg", "stars": 5, "date": "2015-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JIHbz6V2TJ6ho0yUaBsckQ", "review_id": "T75TCpW8OBFIF_OnCaV3PQ", "text": "So many flavors! Yeah, there's like 31! BUDUMTSS!\n\nI love ice cream. I love ice cream cakes. I love toppings.\n\nI don't love how stuffy it is in here and kind of messy/dirty.", "business_id": "1ctVj76TXrHpqX3px49n6A", "stars": 4, "date": "2015-03-18", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "_PzSNcfrCjeBxSLXRoMmgQ", "review_id": "jpjTyLnfL3Zvyxoxl1d5Rg", "text": "Got there around 8pm and they were packed!!!  All the tables inside were full and the tables outside were full.  CRAZY!  \n\nThey had 3 employees working so the line flowed steady.  We got our ice cream to go, since the place was packed.  \n\nStore the clean, employees are friendly, and the ice cream is good!", "business_id": "v8w1vCDYh6BhXQFzFMUsWg", "stars": 3, "date": "2011-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nwn3JlUwV4huxuuKYvjZmw", "review_id": "czOrZXwxHG1Y5mNBzFHX3g", "text": "It's small, busy, with bad indoor seating but I came for the ice cream! Delishous! I always get the founders favorite, and instead of the pecans I get extra brownies.  Cold stones is a great place.", "business_id": "v8w1vCDYh6BhXQFzFMUsWg", "stars": 4, "date": "2013-03-15", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "8z2mKSqTW-4pLobAUNvrsQ", "review_id": "ZYByZs1t5CiS3k51Dc7apA", "text": "Price of water went up. \nFrozen yogurt is either vanilla or chocolate. \nSome hot food eg: nachos, hot dogs\nSmells musty. \nStaff is slow.", "business_id": "01kU7NKzfCP3tgYmgzXbjQ", "stars": 2, "date": "2011-03-01", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "SEDFpR4oMPKqXMjbJiMGog", "review_id": "H4HYAYx4_-acHc1Hz9aBPA", "text": "If you need ice for a party and live in the west valley this is your place.  Can get 20 pound bags for 2.40.  Which is not bad, considering Costco is about 1.70 a bag.  The best part is I don't have to go all the way to Arrowhead to get ice.  Another interesting note is that the owner told me the 20 pound bags are more like 22 pounds.  \n\nThey also sell reverse osmosis, filtered water at .30 a gallon.  Bring your own jugs or you can buy them here.  \n\nWhat really attracted me to this place you ask??  The Thrifty ice cream sign.  I am a sucker for ice cream and it has been years since I have had Thrifty ice cream.  So in I went and enjoyed a scoop of Rocky Road goodness for $1.80 on a cone. \n\nIf you are looking for ice, filtered water, or some ice cream to cool off in Surprise this could be your next destination.  They are open 7:30 to 7 Monday through Friday and Saturday 10 to 5 I believe.  Sunday is a no go so stock up before.", "business_id": "01kU7NKzfCP3tgYmgzXbjQ", "stars": 4, "date": "2013-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6Jb6ho3Zsu8EX4W7LdaPPg", "review_id": "Du2JrgqNrozPGs9kS4l-BA", "text": "Holy smokes, you want how much for ice cream?  Then again, you're looking at a guy that just buys vanilla and if I get a little bored, squirt some Hersheys Syrup in it and mix it up.  I guess the ice cream is good, but when I can go and buy a steak at the grocery store for the same cost, every bite I sit and imagine that I could instead be eating a ribeye cooked at home.\n\nAnother thing occurred to me, what would it look like for someone to be an ice cream kneader if they werent high school aged?  Well maybe it would work if it were an older guy with a handlebar mustache.", "business_id": "AK2oVi1ppr19mWpNkyTs8A", "stars": 2, "date": "2011-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W3eJOyn4JvUrxGuy9mTSiw", "review_id": "UBYD9cbGYXcznYT9XO6j1g", "text": "Did a last minute night time sugar run, last night, while in Arizona to get some ice cream.  The customer service was awesome,  the ice cream was awesome,  all in all a must go!", "business_id": "AK2oVi1ppr19mWpNkyTs8A", "stars": 5, "date": "2015-05-10", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 3}, "user_id": "CCHwJoIWLRhxqIcwRJW6ag", "review_id": "veYv3Ek9qB3vGBV0-85qsg", "text": "-WOW!! I didn't expect over the top, friendly service in here...I REALLY like this Baskin-Robbins!\n\n-FRIENDLY, helpful, attentive, enthusiastic (I am speculating was the owner)...a guy that enjoyed what he was doing and really likes his customers! The kind of service that keeps you coming back...\n\n-SUPER CLEAN! Bright & cheery B-R decor...makes you happy about having ice cream.\n\n-LOVe their ice cream...just give me all 31 flavors as I head over to Weight Watchers...\n\n-Convenient parking (next to Leo's Island BBQ).", "business_id": "Yt0qDtYzioJTUnDgHHTD-A", "stars": 5, "date": "2011-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rot3rk4yYS933BVcwjNP9Q", "review_id": "con5V8ugtsH_1Wwv-xW7Rg", "text": "Great ice cream, fantastic service. Love it. Had to also get some to take home :-)", "business_id": "Yt0qDtYzioJTUnDgHHTD-A", "stars": 5, "date": "2014-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B6gZizbeBKbjkRkyE0-bxg", "review_id": "zSx2oeAejX6IE4M_tGxgjg", "text": "I ordered a Frozen themed cake for my granddaughters birthday. The cake decorator was so flexible because I thought I was going to be able to find my own decorations (which was impossible). The staff did a beautiful job and were so friendly and wonderful.", "business_id": "Yt0qDtYzioJTUnDgHHTD-A", "stars": 5, "date": "2014-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ha7UXR17m9t6831Y7OVOTg", "review_id": "OXSxVzPQ_rl-eaVdMwvEuw", "text": "2nd review, this time for the ice instead of the ice cream. ..\n\nI bought my ice here for the NASCAR weekend, I bought two block ice and 1 bag of cube ice.  The girl behind the counter said \"We pack em good n full and the ice tastes great\". \nI went home, and just to see what she meant by packed full, I weighed the ice. The block ice together weighed over 22 pounds and the 25 pound bag of ice came in at about 28 pounds. I will definitely be back to buy my ice here, especially considering I paid less than what I typically pay at the grocery store for my ice and this is good quality ice.", "business_id": "B-shvo846pGwHGPUIHqwfw", "stars": 5, "date": "2013-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "EP3cGJvYiuOwumerwADplg", "review_id": "LBEIzDdymPG8yU8wN_ggTw", "text": "They have alkaline water which I am still on the fence with but I am currently giving it a try.  Its a little pricier than the regular but taste great and is supposed to be healthy for you.  The service here is always fantastic and the best part is they have Thrifty Ice cream just like when I was a kid.  This little place is next door to Camineros and Albertsons in that parking lot strip mall.  Check it out soon.", "business_id": "B-shvo846pGwHGPUIHqwfw", "stars": 4, "date": "2013-05-01", "type": "review"}
{"votes": {"funny": 5, "useful": 5, "cool": 6}, "user_id": "AZuSSh8xMwLtoapGa02WZQ", "review_id": "fiwFd6TVpUbWP5V3drjqaQ", "text": "Heck yes! This place is what Yelp is all about. I came here a few weeks ago on a sort of vacation in the desert. Depending on the Yelp app alone, I found this ice cream shop but all it had was one 3 year old review! Never the less, it looked great and it was right in the area I happened to be in already. \n\nHaving had a long week in hot weather, nothing sounded better than an ice cream sundae - for lunch! But it gets better! They actually serve food in addition to sundaes, shakes and ice cream. So while all I had initially wanted was a big ass sundae, I found myself also ordering a peanut butter and jelly sandwich. I believe it was locally made peanut butter and then there were at least 5 options of jelly/jams and even honey. \n\nWIth a black and white checkered floor, wrought iron tables and chairs, a few booths, and even a stage set up for live music, this is quite the hoppin' spot! Nestled right downtown I imagine it's a real staple for Wickenburg. In fact, in the 5 days I was there I actually went back twice. Definitely a must-see spot in W-burg.", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 4, "date": "2013-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aTHHVMbOAsN5iQtbIBBdzg", "review_id": "87Jpj0ceYHDWCqZzUwukHQ", "text": "A good stop on a warm afternoon. C & W singer entertained us while we enjoyed the IC.", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 5, "date": "2015-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5FsGCBXmyUZeGZS2uJ5_tg", "review_id": "BOR9mwzRBPZlfggTsFYvCw", "text": "Simply stated, the ice cream is supercalifragilisticexpialidocious! Their ice cream here is hard to beat! If you're in the area you deserve it to yourself to stop by and have yourself a treat.", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 5, "date": "2015-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BARERbZ5hxM-mt8XJcUbNw", "review_id": "H4QPaX-tmB0yDeXlXmYuFw", "text": "Much more than just ice cream! When they say 'homemade' here, they mean it. All but a couple of their ice creams are made at the store. They even make their own English muffins!  The banana split was delicious and the hot fudge sauce sealed the deal. \n\nVery nice atmosphere, comfortable, and  plenty of parking. Great owners as well. I'll be back here for sure.", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 5, "date": "2015-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "klkq2fT2kQ5QmHamJ9CLzg", "review_id": "vVHZgtUVOMuEHEHRTswemw", "text": "Stopped in on our way to Las Vegas. The ice cream was good and they were really friendly! Thought it was really funny that a single was 2 scoops and a double was 3 scoops. A little pricey but worth stopping at.", "business_id": "t7492xEXVTDGvuihdcaC1g", "stars": 3, "date": "2015-05-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "PV5voYSD43Cn_3gHmxG7DA", "review_id": "hKMhtEMTCaoBVSBshaA0lg", "text": "Located inside the Galleria Mall, Dairy Queen was always a treat to get when you came to do some shopping. The choice to be able to get Orange Julius if you wanted something lighter is a nice option. \n\nThe staff that work this location are friendly than the ones that work down  the street by Green Valley High School. \n\nMy only complaint is that the Blizzards are not frozen enough to create the thick concrete like consistency that they are known for. Mine became soup within a few minutes. The taste was delicious, but I wish it was thicker.", "business_id": "M0d6CT77EK8aS0AcvSNaRQ", "stars": 3, "date": "2011-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7gjyW-V7ZPRRxp40IXWSrg", "review_id": "zyRCJ2-bKcuESIZRiPl1BQ", "text": "I go here almost every time I go to the mall. The Julius's are soooooooo good.\nI'm completely obsessed with the strawberry banana. Easily the best strawberry banana smoothie I've ever had.", "business_id": "M0d6CT77EK8aS0AcvSNaRQ", "stars": 4, "date": "2014-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "GfyVFpckyIxAVa1PAQeDcQ", "review_id": "4vDFTF2OZv9n-2dVLMq7gQ", "text": "Wednesday is buy one get one free for sundaes, this month only. I was there every Wednesdays with my kids, time to give it a break.\n\nGreat employees!", "business_id": "PMpQAV7glwhKhnHfDa30Dg", "stars": 5, "date": "2013-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3YgiWunL0fT_6x4mkklpug", "review_id": "cmpzQbdUnJHf7CgRgfC_xA", "text": "I've been coming to this Baskin Robbins since the early 90's. Trying not to reveal my age here... hahah! Have never left with a bad experience. I love their ice-cream and the clown cones especially. My daughter wanted rainbows for her 5th birthday and I placed an order for a speciality cake. I wanted their St. Patrick's cake, but modified. I even drew a little picture. Everything came out perfect! So it was such a shame I let my daughter hold the cake for the 1/2 mile trip back to our house... She managed to slap the top of the box as I stopped at the lights on Valle Verde and Sunset, and she knocked the end of the writing off on 'birthday'. So her cake then said 'Happy Birth Charlotte' - which I think made it all the funnier. \n\nThanks for the awesome cake, Baskin Robbins! Your decorator did a great job.", "business_id": "PMpQAV7glwhKhnHfDa30Dg", "stars": 5, "date": "2014-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y7gJZa_1LFu-wZVckXLakg", "review_id": "87ik8RsVIaNEcAdSx3etWQ", "text": "I've been going to this baskin robins since I was little! \nIt's in a quaint little corner :) \nOnly down side about this place is there is no bathroom.", "business_id": "PMpQAV7glwhKhnHfDa30Dg", "stars": 4, "date": "2014-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4borqvRwMC_UteKa-1j88A", "review_id": "0mZVYTFbo52JraP1eq-k4w", "text": "Best ice cream ever..worth every penny and they are very nice!!", "business_id": "t8PQ5iKCeeofy-nXvTNk2A", "stars": 5, "date": "2013-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QXmRXXAJ7Gt0WrBiKjqGlA", "review_id": "WXalpdSU3uWSDB6rrokUuA", "text": "Cold Stone's sizes make me want to sing....\"I like it, I love it, I want some more of it!\". Heck yeah I want some more of it. Ice cream made how I want it? I'm down. \n\nThe concept here is simple- pick your ice cream, pick your toppings and watch the talented staff slap it down on a slab and mix it up. They'll put it in a cup, stab a spoon in it and call it a day. If you tip them, they'll even sing you a song :) sweet!\n\nCold Stone also has a freezer full of ice creams cakes and treats so if you're in a hurry you can grab something on the fly. A plus: I always receive good, attentive customer service at this location from the staff. Also this is a clean, well-maintained location as well.", "business_id": "t8PQ5iKCeeofy-nXvTNk2A", "stars": 4, "date": "2013-05-21", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "hCJy_SaAW1BPy_YkL747WQ", "review_id": "opMbwv1EiC0_oxNtBPtV_Q", "text": "I have to admit I used to hate on Cold Stone Creamery bc I'm a bit of a germ-a-phobe and I just couldn't understand why someone would allow their ice cream to be poked, prodded, smashed, tossed, and mixed on a sticky iced slab that's wiped down with the same disinfected rag. I'd always get mint ice cream and made sure I told the creamery artist in a paranoid tone, \"Just in the cup. Don't mix it!\"  \nIt wasn't until I had a strange craving for CHEESECAKE ICE CREAM & PEANUT BUTTER CUPS on a chocolate waffle cone that I allowed a creamery artist to beg me to let them mix it up. As I gave in I watched as my \"virgin\" ice cream was manhandled, stroked, and eventually raped by that wet metal spatula that sits idly in that soppy water cup. After much cringing and regret she handed me my \"love it\" size cone with an accomplished smile. I took one taste with my plastic spoon and it was pure delight! Mmmm! Not only was is heaven, but I survived! Maybe a little bit of germs wasn't so bad! Ever since that day I allow them to do as they wish with my ice cream and I never think twice about it!", "business_id": "t8PQ5iKCeeofy-nXvTNk2A", "stars": 4, "date": "2014-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DcM633eD37qr9g7_Vj38GA", "review_id": "bCymG5FxirWelBNYZv4CXg", "text": "The customer service was the most impressive part of our experience. The workers were very kind and friendly! The ice cream was also good as well!", "business_id": "t8PQ5iKCeeofy-nXvTNk2A", "stars": 4, "date": "2015-03-02", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "jKL5r5nqyrbKnLYOZBMeKw", "review_id": "HKDNwHugz9NQbZwoZO8rvA", "text": "I was quite disappointed with this location because it did not have hamburgers on its menu.  Kinda silly since they have chicken sandwich and hotdog, etc.  I was also disappointed with my hotdog order.  I ordered a foot long hot dog.  The box it came in kinda made me giggle since it was so long...duh...foot long.  But when we got home, it was actually just two hot dogs in the box.  Ukh!", "business_id": "SchSiNdLjuRjjrsXFeggWA", "stars": 2, "date": "2009-03-28", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "i8KMQX7nekLSCzb_DVb6yA", "review_id": "ONA1uDUXvjJaTStm8-OZlA", "text": "We should have checked Yelp before heading out to this DQ. The husband and I were scheming about the hungerbuster burgers we were going to get and were getting all hyped up. We pull up only to find this DQ is NOT in fact a Dairy Queen. It's a glorified snack shack with Dariy Queen icecream. They literally only have a deep fryer. No grill. No burgers. WTF. This location sickens me. Don't call yourself a Dairy Queen and NOT carry the hamburgers. It's false advertising.", "business_id": "SchSiNdLjuRjjrsXFeggWA", "stars": 2, "date": "2010-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HOaWRV72ZQs0me1geSqBzg", "review_id": "f8AaWsBG-J6zBhGJKIgL2w", "text": "Yikes,  the memories of DQ.  You know, ice cream, treats, a nice nostalgic feeling of the past for kids.  What happened to this place?  I haven't a clue.\n\n1.  Ambiance - Been here several times now, and always the same, bland, not exciting.\n\n2.  Service - Hmmm, perhaps they should turn this one to a self service facility, this would definitely improve the service. A guy was there waiting for his kids sundae. The servers assisted and prepared orders for two other customers that came in after. The guy goes to the server to remind them, they said it was almost ready. Then I put my order in, the guy starts to make mine and I remind him about the guy's kid from three orders ago. So, they start to make it and it takes like 10 seconds. Poor kid.\n\n3.  Service Part 2 - they make my order and the shakes are like slightly thicker than milk. I said no whip and guess what, whip. I ordered one dipped cone and guess what, i got two. I guess you can say that this ying yang approach is balanced???\n\n4.  Air Con - What the heck happened here? No air, no fans, hot and stuffy?  Hmmm, what would a normal store do? Offer free dipped cones!\n\n5.  Service Part 3 - to use the toilets, you have to get a key from the cashier. Guess what, they cannot find the key.  I wonder what the dealio is since this place is usually empty anyway, no need to manager the bathroom.\n\nThis is not a bad place, the cones and stuff are decent, but the service and customer care is not in existence.", "business_id": "SchSiNdLjuRjjrsXFeggWA", "stars": 1, "date": "2011-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1iJ0AwkYqDKHYMdUVarN0g", "review_id": "C9X4ZlA5HJN_p7Jxo5I0pg", "text": "No french fries cuz the fryer is busted...hmmm. They offered chips so guessing it's been busted awhile.  :(  Actually one of the worst DQ's I've been to.  They put the corn dog in the microwave!!  ick.", "business_id": "SchSiNdLjuRjjrsXFeggWA", "stars": 2, "date": "2012-04-03", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "TBbME7IpGfOOcB1uFOLjDQ", "review_id": "Fx1cTEW75Pul3iDzz0Wfrw", "text": "Decent fast service. I dont care if it smells like a deep fryer. Theres a great DQ thats been renovated over on warm springs if you dont like this one. However, we go to dq for cheap quick ice cream, no more, no less, & thats what we got.", "business_id": "SchSiNdLjuRjjrsXFeggWA", "stars": 4, "date": "2014-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4oHdWFgEdu9pbcMxL1n97w", "review_id": "WPWtvrx9CpMcT4lhcdEktQ", "text": "Blizzard was good, however, the girl that rang me up looked like she just got out of bed, hadn't showered, no uniform, and had a nose ring. I know it's likely a minimum wage job but I came into the job world with high expectations of appearance. Leave your sweats at home, wear a uniform, put on a smile, take your face piercings out, and act like you enjoy getting your pay check. The male cashier talked down about a fellow employee to a customer as well. This place really needs someone to get the basics of customer service and customer experience back in even the slightest form. I will likely not return due to the lack of professionalism and horrid appearance of the employees.", "business_id": "SchSiNdLjuRjjrsXFeggWA", "stars": 2, "date": "2015-04-15", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "TfyxeRjcbh69gHtu_Cl4oQ", "review_id": "ycgrB7F9W2W2YSma8esiZQ", "text": "I can't believe this place is still opened and it hasn't been shut down due to health codes! I don't even know where to start on this review. Should I start with the horrid customer service from teenagers who don't care? Where is the manager? Besides screwing up my order, after taking forever, the ice cream cone was soft. When I inquired about it, he told me because the weather was hot? Really? Others complained about their blizzard being soup and they were out of product. Plus the teenager who did not appear professional was hiding product in some sort of freezer as ice cream was tipped over. The store was not clean as trash was over flowing and looking in back there was fries and other trash on the floor where they keep the food. Ick! SHUT this place down!", "business_id": "SchSiNdLjuRjjrsXFeggWA", "stars": 1, "date": "2015-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 3}, "user_id": "VzAHWXVOIqylfCtIRXwU9w", "review_id": "z8-gVynhY2y_6OTQJt-uAw", "text": "I went to this Baskin Robbins and had so much fun I couldn't believe I forgot to Yelp it.  The ice cream here is the same great quality as the ice cream in all their other stores (although here in the Southwest they had English Toffee while they haven't had that in Ohio since the 80's I think!)  Anyway, the guys behind the counter kept me laughing the whole time I was there. Such friendly people who clearly enjoy serving the public and spreading cheer.  I think at least one of the guys is Russian, based on the accent.  SO FUNNY, these guys.  Please, go spend some money there and keep them in business.", "business_id": "Ze0mG__i-9ziEjN2gLcHqw", "stars": 4, "date": "2008-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "852u3q1kQY1aLTVjtvzRtA", "review_id": "3_c9aeFHFKutbI_CswKI2A", "text": "the friendliest staff in any food establishment or service industry bar none.  I'm not sure what the owner is doing but the staff is consistently cheerful and attentive.  But then again I have met owners on two occassions and they were awesome.  They make suggestion's about cake choices and go out of there way to greet you when you walk in and thank you on way out.  I need to make sure my customer service in my biz is like this.", "business_id": "Ze0mG__i-9ziEjN2gLcHqw", "stars": 5, "date": "2011-05-03", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "QXmRXXAJ7Gt0WrBiKjqGlA", "review_id": "YlfbmB-h-fVFc8P0K9kLNw", "text": "You scream, I scream, we all scream for ice cream!!!!\n\nMan, do I love ice cream and throughout the years Baskin-Robbins has been my constant. I have never wavered from my favorite, chocolate chip cookie dough. Whether it's in a shake, on a cone, in a cup, or in an ice cream cake it's definitely my go-to flavor. No other cookie dough ice cream compares at the competition.\n\nI particularly like this location for a couple of reasons: \n1.) they maintain a clean store \n2.) the staff is friendly and helpful. Plus, they don't mind giving out a ton of samples to my indecisive 7 year old ;)\n3.) the prices at this location are more competitive than other BR locations\n4.) they have kids scoops for $.99 on Tuesdays and Wednesdays, no limits (an ice cream aficionados dream!)\n5.) they always have extra stock on hand of the various ice cream flavors (unlike another BR location that ran out of all the popular flavors on a Wednesday night. What?)\n\nOn top of all that, this location has a wonderful outdoor area in the courtyard where you can sit and enjoy your ice cream al fresco style.\n\nP.S. sign up for their birthday club for you and the kiddo's. You get a free scoop of ice cream on your birthday as well as a coupon for $3 off an ice cream cake. You'll also stay on top of limited edition ice cream flavors as they release. I say, why not?", "business_id": "Ze0mG__i-9ziEjN2gLcHqw", "stars": 5, "date": "2013-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "O86_66fFhxGoPXHF5Ymleg", "review_id": "04zK4CwrO3cZ5As6bL_Bjw", "text": "Love this Baskin Robbins! They have very friendly staff. My husband and I love coming here for late ice cream in the evening. \nThat seating area outside (right next to Starbucks) is really nice. We love to hang out there and enjoy the wonderful BR treats.", "business_id": "Ze0mG__i-9ziEjN2gLcHqw", "stars": 4, "date": "2014-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G3feFqa7WlQu4vUFi_PEHQ", "review_id": "xlPEXrNYCeJLIdXfy7adTg", "text": "Came in as we saw the dollar cone special and ordered 4 cones including 2 kids.  They never mentioned until after the check out that they were giving us regular cones and only the kids cones were a dollar.  Yes we should have read more careful or even asked but I would have hoped they would have been more heads up about this when ordering kids size cones especially when it was 3x the cost it would be evident it wouldn't make sense to order in this manner.", "business_id": "Ze0mG__i-9ziEjN2gLcHqw", "stars": 2, "date": "2014-04-01", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "OAd-vbR_POac1zHtu-Y2Zg", "review_id": "xn65vMmjCPgeDH_DELKARQ", "text": "I have a confession: I really like Baskin Robbins ice cream. It's some yummy stuff. The standards are good. The seasonals, like Love Potion #31 and Baseball Nut, are great. And there are often bargains to be had like BOGO cones and $1.31 scoops. And kids scoops are almost always $0.99 at this location. This location is not much to behold, which is what really takes down the stars. It's rundown and old and not a place I'd want to sit and eat ice cream (no matter how good that ice cream is). However, the staff, despite being quiet young (which, yes, makes me sound old and prejudice against youngins), are rather pleasant and patient. They'll give you as many free samples as it takes to decide on your choice of ice cream. And even when it gets packed at the last minute (right before closing) with families with kids running around, everything is smooth and quick. So kuddos to the staff for that. All in all, if you need an ice cream fix, there are plenty of flavors and options for you here.", "business_id": "Ze0mG__i-9ziEjN2gLcHqw", "stars": 3, "date": "2015-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nyIJcauW8JuV95XfeKjM2g", "review_id": "-njJ_BinPlGlA9ilScEf6A", "text": "We get a coupon for a free scoop of ice cream via email for the wife's birthday. We stop and each order 1 scoop in a cup. When I give the coupon to them the kid working there looks at the coupon and says, \"This is only for a kids scoop\". I say the coupon doesn't say kids scoop, it says one scoop. So she says, \"But it says 2.5 ounce scoop, that is a kids scoop\". So I say where in this store does it say a 2.5 ounce scoop is a kids scoop ? IT DOESN'T SAY ANYTHING ABOUT A 2.5 OUNCE SCOOP ANYWHERE. OK.. So the wife says to the kid, just take off the price of a kids scoop from the total. The kid says she can't do that. OHHHHH.. I get it now. They do this all time. Great scam. Paid almost 7 bucks for 2 scoops of ice cream that the kids are trained to take from the customers after they refuse to take the coupon. I notice another review for this store says the same thing about them not taking a coupon. I feel bad for the franchise owners that have to bamboozle people to get us to buy 2 scoops of ice cream for 7 bucks. Pathetic.", "business_id": "Ze0mG__i-9ziEjN2gLcHqw", "stars": 1, "date": "2015-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "T0D3c668CUV0JsXU0r_NBQ", "review_id": "ogPR3nBLgrDmPbrSri3xZw", "text": "DO NOT GIVE THIS PLACE YOUR BUSINESS! HORRIBLE CUSTOMER SERVICE!!\n\nI wish I could give this place 0 stars, but I have to give it 1 to leave a review of the HORRIBLE customer service I experienced. I called on my way to California for my sister's funeral (and let the woman on the line know that) to order a birthday cake for my son's 8th birthday tomorrow. Yes, I realize I'm cutting it close, but with a sister in a coma, these things happen. She told me they don't take orders over the phone and I would have to order online or in person. I explained my current situation and that the cake we wanted wasn't available for online ordering. She told me \"Too bad, we haven't taken phone orders in 3 years because we don't trust customers to pay.\" I let her know that when I go to their website a warning comes up that theirs is not a trusted site, so I'm uncomfortable putting my credit card information in. To this she yelled, \"You have a problem trusting our website, well I have a problem trusting you! If you want a cake from us come in or don't get one!\"\n\nInstead of helping and gaining a loyal customer, she basically told me she didn't trust me or want my business. All while knowing I'm on my way to a funeral. Thankfully Ben & Jerry's at The District was able to accommodate me on short notice. It will be a happy birthday for my son after all. No thanks to Baskin Robbins.", "business_id": "Ze0mG__i-9ziEjN2gLcHqw", "stars": 1, "date": "2015-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1fujZVn5be9EooASzMkdng", "review_id": "WRaoh0zv4-xoVfZNIlZTDw", "text": "I love Blizzards! Hard to not right? I dislike Dairy Queens. They are all dirty and dingy. They are all stuck in this 40 year old motif and feel that never ever changes. I wish they would just get a drive thru so I didn't have to go in and see the filth! But, I suffer on for my tasty little Blizzard love...", "business_id": "m4_H2hZKSoA2iu5aqrP1nA", "stars": 3, "date": "2011-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ppaJ3lrEA4v6byT3AIbeTw", "review_id": "fybLsARk7i3vFFs0BDfClw", "text": "Can't beat their softserve. We went here for an icecream and my friend ended up getting chicken fingers and fries too. Quick, friendly, fast service from the teenagers -- it's all fried food and easy icecream so it can't be messed up. They also have a freezer of ready to purchase icecream cakes if you need one.", "business_id": "m4_H2hZKSoA2iu5aqrP1nA", "stars": 4, "date": "2015-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vbs7oDoBdFJ4fRgZ0Z9SlQ", "review_id": "bcnt2fw8qraWdIIa-N8eGQ", "text": "Smells. Like sewer? \nWater problems? Old blood?? And old grease. Strange little shop. No drive thru due to location. Employees are always nice. Take dogs here for children's vanilla cones.", "business_id": "m4_H2hZKSoA2iu5aqrP1nA", "stars": 1, "date": "2015-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XopfVfatmRU8cy-smSnoHA", "review_id": "txhYa22u7pRda7xLdiyjAg", "text": "Sometimes, they have great service, others not so much. Love the fact I can leave my house in my pjs and not get out of my car for ice cream! Thank goodness for DQ drive thru", "business_id": "m4_H2hZKSoA2iu5aqrP1nA", "stars": 4, "date": "2015-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MfB1_zZL8vbz_9y_bXtVrQ", "review_id": "kS0KNP3Z-QzA6SfkYOosLA", "text": "Really good Frozen Custard. Located in the shadow of the Stratosphere on the North End of the Strip.  You will be going to this place for the yummy fruit custards.  It is not in the best part of town so it could be classified as a hole-in-the-wall.  You order at a small walk up window.  If memory serves me correctly there really wasn't any seating or we just chose to stand near our cars while eating our custard.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2007-03-05", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "sjpVZwAX8gQSH82AGyig4Q", "review_id": "wDS41xZY2i2_ZNsO210Cgw", "text": "Luv-It has become somewhat of a secret lately, and it's kinda a fun one.  Everyone used to know Luv-It.  It's been around FOREVER.  It's where you went to get frozen treats, man.  Located by my high school, we'd stop off and grab a cone or a cup before heading back for class.  It was 1995, my shoes were chunky, and I had a cone of Luv-It.  Life was awesome!\n\nSeriously, if you've never had frozen custard, get some Luv-It.  If you've had frozen custard, get some Luv-It because I bet it's the best you've ever had.   People in the desert can make themselves some tasty, tasty frozen treats.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2007-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Uqkha8hDld5Y6f0VK3aWWA", "review_id": "avLs852SNNwT6d2L7p_5lg", "text": "Hmmm...Im not sure what all the rave reviews are about...\nMy husband & I went to Vegas after he returned from a 9 month deployment.  Before our trip, I went online and searched for all the must-do & bargain deals that Vegas offered.  Luv-It Frozen Custard was recommended.  I'd have to say that even before our trip began, I was more looking forward to going to this place than going anywhere else because I LOVE frozen treats.  We couldn't go during the first two days but on the third, when my husband found out that there was a Star Trek convention at the Hilton Hotel, I waved goodbye to him and eagerly made my way to this place.  In my mind, I was going to get Cold Stones portion of the most savory custard and I wasn't going to have to share any of it with my husband...\nWell, when I rounded the corner to this place, I knew I might be in for a let down...just the ambiance of the surrounding neighborhood.  I actually missed the store and had to turn around.  \nWhen I finally got to the parking area, I was surprised because I thought it was a shop that I would be able to walk in to, see the various custards, and pick the one that I wanted.  Instead, I was faced with just a guy hanging his head out the window, asking me what I would like.  \nI ended up getting chocolate chip.  I was unimpressed.  I thought it would come in a cone but he gave me a scoop of it in a styrofoam cup.   The portions were so tiny!  The size...not what I imagined.  The taste...also not what I imagined.  It was like eating soft ice cream.  The price...EQUALLY unimpressive.  How can you call a scoop of ice cream for about $5(?) cheap?  \nI tell you, this place IS NOT a hidden gem.  It may be hidden but it's no gem.  You'll be better off getting your frozen treat from somewhere else like Jean Philippe Patisserie at Bellagio.  You're spending about the same amount of money for more gelato, and you'll get to enjoy it at the Bellagio!  (((I love Bellagio...)))\nAfter the convention, my husband asked me if I wanted to go to Luv-It's now, not knowing that I went without him...I said NO! \nI'm telling you, save your money!  It's just not worth it!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 2, "date": "2007-03-08", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 2}, "user_id": "yf12P_T0AKLNzFt12zj16g", "review_id": "L7hoZN-YCnaLPG3KGpHBew", "text": "The custard is very creamy here. But there are a few things that I have to say I'm not crazy about.\n\nI got here on a Friday night at 10:30pm and waited until 11:10pm when I finally got my root beer float. At that point I was ready to order 4 or 5 things just so I could put them in my freezer and not have to do this wait again for awhile.\n\nNote to self. If you buy the prepacked custard, do not expect real chocolate chips in either the Mint Chip or the Mocha Chip custard. They use jimmies!! What?! ARe you kidding me? Waste this creamy goodness on jimmies alone? This is a crime. Someone should tell them to use real chocolate chips.\n\nAlso, the banana custard was too light in the banana flavor. It was more like vanilla with a hint of banana.\n\nCreamy? Yes. \nLong wait? Yes.\nWill I return again and again. Yes.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2007-04-09", "type": "review"}
{"votes": {"funny": 2, "useful": 8, "cool": 6}, "user_id": "zTWH9b_ItSdLOK9ypeFOIw", "review_id": "ZxavoIhGbDk0vPZN7ywaHA", "text": "I found Luv-It Frozen Custard courtesy of my fellow yelpers!  Hooray for y'all!  And my BF who has been living here for the past three plus years never even heard of the place and now he craves the stuff!  Haha!\n\nThe first time I went, I tried their Wild Cherry.  Creamy, smooth and rich.  Yummy.  Last night I went for the Butter Pecan, once again oh so good.  \n\nThe BF tried one of their classic specials the first time.  He loved the custard on its own, but also found that the saltiness from the nuts really brought out the taste even more.  His only complaint was that there weren't enough nuts!  Last night he went for the Swiss Crunch (swiss chocolate and crunch) and he was a bit surprised with what he got.  Nonetheless, the crunch was oh so good, and I think I have it figured out!  Can it be crushed up honeycomb?!  Well, whatever it is, it's so good with the custard.  He ordered the junior size, which is more than enough.  Those regular sizes are meant to be shared! \n\nMy only complaint, they are closed on Sundays and Mondays!  What a pain!  We drove all the way there just to introduce a couple of friends to the place and as we approached Luv-It, I realized it was Sunday and it means they are closed!  Bummer!  Guess that means I have to be more aggressive about bringing people there during the week.\n\nThis is definitely one of those hidden away locals place.  It's not so far from the strip and touristy section (Stratosphere and Olympic Gardens are only a stone's throw away), but off to the side that you do have to look for the place.  It's worth looking for though!\n\nUpdate! 09/17/07 - I've been to Luv-It a lot more times since writing this review!  And yes, a few times we've drove on by once we saw the 50+ people in line!  But the BF and I order only one thing - the vanilla custard with crunch topping.  We just can't say no to that honeycomb sweetness!  I've tried their lemon one with peanuts, and it was surprisingly not tart.  It had a nice sweetness to it!  I'll keep on bringing visitors to this place because it's definitely better than the chains out there (and I've tried a couple of those frozen custard places and they can't compare!).\n\nUpdate! 10/09/07 - Went back the past weekend and tried their blueberry flavor with crunch! (Yay for crunch!)  It tasted pretty grub, but then I had that yucky feeling happen...y'know, the one that tells your body that whatever you just ate isn't agreeing with you.  So, the BF had to rush me quickly to a casino to take care of business.  And it tasted so good though too!  It's a good thing that my previous experiences there have been positive and this was just an unlucky blow, otherwise I would have to knock down their star rating!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2007-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Gswhjfxr-3rvx5yquzLaWw", "review_id": "8AZZNmJnfOC6vliehTXlmA", "text": "Their Rocky Road is amazing. Real nut flavor and squishy marshmallows. It wasn't too shockingly sweet, just right! It was the only flavor I tried but I'm going to get to the others! Taste wise, it's some of the best frozen treats out here in Vegas. The location is a bit out of the way for most locals. The prices are quite reasonable. I'm just waiting to go back for more!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2008-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AaKSmrEf89z0prF70K5CJA", "review_id": "vF3IWeqyaocnLaULVpaThQ", "text": "If your looking for some old school frozen custard, you have hit the mark with Luv-It !!! The custard that comes out over here is always smooth and silky, and has a great mouth feel to it. Since this is a small mom and pop operation there is only about 3 different flavors a day, and be warned that the popular ones go out early. There are over 15 different types of sundaes that you can create, but I think the best for eating is just a plain scoop in a waffle cone. I would agree that this is not in the best part of Vegas, but rest assured you will not be alone there at night as there always seems to be a crowd of 5+ at any time of night.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2009-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "TP0KBS_uQtGfnXAg0T9k7g", "review_id": "rIPX0ojMqtbBNy94ycOhuw", "text": "oh dear god!! this place was so fricking awesome!!!! me and my love had the 'Scotch Jimmie' which was: butterscotch, sliced bananas, and chocolate jimmies, YUM! the place only takes cash so be ware! the menu has tons of flavors and treats, if i lived in Vegas, i would be here all the time. i dont have one complaint about this place and apparently they have been open for 35 years ?!! they know what their doing, and doing it right!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2009-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "ZfavZCU-AfT-cU1QTl_1lg", "review_id": "scTZZpAce8aNSzwF407wNw", "text": "This was my first taste of frozen custard.  All I ordered was a regular banana shake (you can order it regular or heavy, heavy being much thicker but in the same size cup for more money).  It was very good but I can't say it's the best I've ever had.\n\nThe location is interesting and was slightly difficult to find.  I'm used to West Oakey, not East, so venturing past the 15 to this side of town was fun.  At least two motorcycle officers pulled up to get their custard fill while I was there...I felt so much safer (they can't eat while on their bikes so they HAD to stick around).\n\nSince banana was naturally added (and added to the price at an extra $.50 on top of the $4.35 shake, not a wallet buster by any means), I didn't have a problem with finding a flavor of custard I couldn't get because he didn't have it available.  Even though the list states so many different flavors of custard, only five or so are available.  Last night it was Vanilla, Chocolate, Pineapple, Butter Pecan and Strawberry.\n\nI'd give the place more stars if it offered more flavors at all times.  The location is rough but adds to the appeal.  The custard was very good but not the best shake I've ever had.  I'll try this place again but it will not be a regular spot to go for a fix.\n\nI'm going to try Leatherman's next to compare.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 3, "date": "2009-04-10", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "cNeOX-W3M7pHfTTMMFu-Fg", "review_id": "wSPPfaK0Qfe3BEGadEqqiQ", "text": "I would have LOVED to give this place 4 stars had they not limited my Saturday choices to Vanilla, Chocolate, Strawberry and Banana.  What the???\n\nWe came here because we saw it featured on the Food Network a loooong time ago.  Even with the limited flavors, we were not disappointed with the quality.  We ordered chocolate and strawberry, and although I normally prefer chocolate, strawberry was the clear winner here....sooooo fresh and creamy, much different than ice cream.\n\nIf it weren't for my Chicken McNugget lunch 5 minutes prior, I would have ordered one of the specialty sundaes.  Damn you, Ronald McDonald.\n\nI'll be back...", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 3, "date": "2009-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f5vgLcoKpFcTvD4lOUxcTQ", "review_id": "NkpitPNgu6y60h50j6Wxkg", "text": "This place has excellent frozen custard. Rich, creamy and very flavorful. I like trying different flavors and I think the best one I had so far is blueberry but you cannot go wrong with vanilla or chocolate. There are only certain flavors made everyday so it is  both a treat and a surprise when you get there.  There is almost always a line everytime I go to Luv -It but that is part of the experience; waiting in line while cops bust criminals and/or shady characers. It may be a bit pricey but it is worth it. What a refreshing break from the typical ice cream or frozen treats.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2009-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9hAxvoUVMD4IZWNEb-BuAg", "review_id": "xBIgI46-itbi-vKZuN1Wag", "text": "This is special, homemade-tasting stuff. Super creamy. Awesome remedy to a 100+ degree Vegas night (but bring your patience, there's usually a line). TIP: Check the flavors calendar on their site before going. This stuff is great by itself, but they also have a very tempting menu (huge sign) offering a plethora of incarnations of things you can do to your custard. Cash only.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2009-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Aluc0ilh_rgUIXD5YUf1Mw", "review_id": "Y9jdDMjW-UlEV5A-EEu0ZA", "text": "From the outside it doesn't look to pleasing, but you know what they say, you can't judge a book by it's cover. Luv-it frozen custard is bomb. The texture is nothing like I ever had. It like silky and light and so tasty. It is a very different and unique product. The have different special flavors every week. If you never had Luv-it frozen custard you better try some asap!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2010-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DYcMmWmYwbkVt5M147whxg", "review_id": "_iYhcJfHS97euNrSuTx9tw", "text": "Luv-It is a must stop on any Vegas trip.  It is as good as people say, it is worth going out of your way for.  It is pure heaven - it cannot compare to ice cream or fro yo.\n\nMy favorite thing to get is the Western.  It comes with hot fudge, caramel, and pecans.  A cherry and whipped cream are included if you get the regular size ($5.25), that stuff doesn't come on the junior ($4.25).  The junior is more than big enough for a normal person, so only get the regular if you want to truly indulge, or can handle your sweets.\n\nIt is kind of soup-nazi-ish ordering.  I've always been too scared to get anything but vanilla - the standard flavor everything comes with unless you tell them differently.  Once, a friend asked for whipped cream and a cherry on his junior sundae - it was the equivalent of George asking for bread in Seinfeld.  Scary.\n\nAs long as you follow the ordering procedure (outlined on their website), you'll be fine.  And, like the soup nazi, the deliciousness of the custard makes it all well worth it.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2010-03-19", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "tvXM9NGfiQIEAnvkOSQo1w", "review_id": "m0KjL-PazzLpisBPEslJxA", "text": "To a regular, Luv-It Frozen Custard is not simply frozen custard; it's a way of life. I usually drop by this place at least once a month, sometimes multiple times a month. It all depends on my schedule. And that's the thing, I stalk the website to see what flavors they have forecasted for the upcoming weeks. If I spot a flavor that I absolutely love, I re-organize my schedule to make room for the particular flavor. Call me crazy, but this is what this place has done to me.\n\nMost people that I see here usually order a type of sundae. I've tried this only to discover that it is too much for me to handle, especially for someone who drops by on the regular. I usually roll with a single scoop just to remind my taste buds how much I care for them. I don't want to overwhelm them with a sundae. There's something about the consistency and texture that makes their frozen custard out of this world.\n\nI'd have to say that my all-time favorite flavors have to be Champagne Cherry, Rocky Road and Maple Walnut. The fruit flavors tend to be hit or miss for me. Coconut, Pineapple and Strawberry tend to be the fruit flavors that I love. The rest simply range from good to okay. The everyday Vanilla and Chocolate flavors are always there for me to fall back on, while they have the two other varying flavors that vary by day. Chocolate has always been my Plan B if the two other flavors don't tickle my fancy.\n\nThe location is the only downside of this place, especially if you go here on your own. There can be some shady characters walking about, especially in the later hours. I've struck many odd conversations with the meandering homeless people walking about the area. I'd recommend to just keep your valuables locked up in your car while you place your order. It never hurts to take precautions in an area like this.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2010-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uSTGnoFig4f77rCcaluXnQ", "review_id": "-VDWH3xWg9XN1gY1XGryAw", "text": "I've never had a frozen custard before so this was my first experience.  Was I impressed...ummm.....not really.  I don't know what I expected.  My friend that I was with said to me ..yup, that's how a custard is suppose to taste...\n\nIt was just a thicker, richer soft serve.  Ate it in the car.  Word to the wise, area is a bit on the sketchier side.  \n\nI think I would have been happier if I found a Pinkberry or Red Mango nearby.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 3, "date": "2010-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nI743b31tLRSYxUs9Ku_pA", "review_id": "cM8a-jno0LNKNk5XR3gBxA", "text": "I have been to Luv It several times over the years.  The ice cream itself, and the one guy who practically lives there, are great.  I have yet to be displeased with anything I have gotten there.  Maybe a hair expensive but everything is now a days.  \n\nI think the only reason I give it 4 stars is location.  I am scared to take my daughter out of the car there.  Maybe as a young single person, you might not care about the constant homeless people asking you for money and circling the place, but as a dad, I don't like it.  Parents are over cautious for a reason, because it's not about us, it's about our kids.  Dispite this one extremely important fact, I love Luv It.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2011-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Dta4mJjev396oshvD-8NcQ", "review_id": "LEmZ2UYl0Me3vhATTCxwBQ", "text": "Spectacular!  A co-worker introduced this place to me and ever since I get cravings for their salted pecans!  My husband grew up in Las Vegas and I couldn't believe he had never heard of Luv It...We went there and he's officially hooked!  Lol!  Can't remember the name but we tried the one with sprinkles and marshmallows.  (With a cherry on top!)  Awesome!  My new favorite!  If you're in the mood for a real taste treat delight...Go there! \n\nMake sure you bring cash...pretty sure Luv-it is cash only.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2011-03-09", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "ifFTbGgwjXALO1PgMHzrTQ", "review_id": "HxMLN3nj6JkQdNeHaSYzOA", "text": "Frozen Custard. What's not to like? Perhaps the fact that this place is in the deep underbelly of ghetto fabulous Vegas and nestled under the shadow of the Stratosphere? For sure, it's not in the greatest neighborhood. But have no fear. What doesn't kill you only fills your tummy with sweet goodness.\n\nI'll be honest. I'm never in that part of town. As a result, I can't see myself returning to Luv-It any time soon. But that doesn't make me any less of a fan. It's Frozen Custard. It's yummy. End of line.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2011-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "So5HMCXthdTWncE5S4FevQ", "review_id": "psuU3qrb6c0PNX0fjRCKiQ", "text": "Oh the awesome frozen goodness this place offers. I LOVE the fact that they make their ice creams rather than getting it shipped from somewhere. They have a great selection of flavors; I just wish they would offer all of them everyday rather than a couple of them on selected days. :P \n\nI could see myself get uberly fat off this place. I'm so glad this place is far from where I live or else I'd be in serious debt and/or suffer from diabetes, some kind of cardiovascular disease and just gain weight that I probably won't be able to burn off quickly. \n\nI usually get the Luv it special. It comes with a marachino cherry which I don't care too much for, a great balance of chopped up, semi-salty pecans and strawberries--all topped on the creamiest, smoothest vanilla custard...\n\nAlso, if you're not cool with sketchy places, you might feel uncomfortable here as this place is in a shadier part of town and it isn't well lit at night.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2011-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_WlkI_UbDVLUQO2DOY85sQ", "review_id": "35TxzLM8u4rFMsJprNYBiA", "text": "Ok. Not fantastic. Overpriced and overrated on yelp.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 3, "date": "2011-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "mM3cK_LlnWNKEE282WmweQ", "review_id": "XzL0T8uTD6Y2y6N81E5Rmg", "text": "I never miss a chance to visit Luv It Frozen Custard every time I visit Las Vegas.  The wait lines are a testament to how good this frozen custard really is.  Smooth, sweet and ever so creamy.  Simply the best in the world.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2011-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yIQJU8GbuH5le-XO1977UA", "review_id": "OT_dvGpNHLSjQJ6QroMe6g", "text": "So I came back again in November 2010, about a year after my first visit.  Things haven't changed much, though I think the hours of operation have been cut back even further.. arrived shortly after 2pm and they weren't open yet!   The menu offerings were limited, and no special seasonal flavors this time.. so I'm deducting one star from my previous review.  I'll try back again in November '11!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 3, "date": "2011-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "acx8EDAInw8hbBDHbQkDUg", "review_id": "Kp-5QeB3egtia-djmyh5yA", "text": "February 7th, 2011 I went here while staying at the Stratosphere and started craving ice cream type places on Yelp.  This place popped up and was very close by so I gave it a shot.  Definately dont want to be walking around this part of town at night, felt like I had to watch my surroundings/back when paying for it lol.  Anyway so I ordered a Junior size Western ($4.70 tax included) and it was pretty flavorful, better than I expected from this type of ice cream/custard.  Its kinda cool how you actaully see it come out the the machine there, kinda being squeezed out slowly by a large toothpaste container lol. I will be back here very soon!!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2011-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lJhQFJC3aC38IMLCVoddhA", "review_id": "TFjl2pt92s3ZtJntLzqpPQ", "text": "Finding places in Las Vegas to eat at is difficult.  Invariably, I attend trade shows on the strip, but yet I yearn for ways to escape the strip and eat \"where the locals do.\"\n\nA good rule of thumb in Las Vegas is to find places where a car in the parking lot with a plate from outside Nevada is a rarity.  Luv-It is one of those places.  Even though it's in the shadow of the Stratosphere, my California plates was the only \"foreign\" car in the parking lot.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2011-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WB20H3QbkYoVivCT67y_Mw", "review_id": "ok3JRndOhFlyN-gmi6Q7Jw", "text": "Service - 7\nAtmosphere - 7\nFood - 7\nVegetarian Friendly - NA\nGeneral Awesomeness - 8\n\nCan't go wrong!!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2011-05-15", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "PbATOvcsCNWaGpX8hWtKlQ", "review_id": "iEqYy019zP7xSuPC1aW6zg", "text": "Here's the situation. I think we've all been there\n\n-Its hot in Vegas, middle of the afternoon\n-I had too many free drinks last night\n-Don't really want to blow my meager winnings just yet \n\nThis place has some tasty frozen custard - its heavy, and will cool off that temper of yours. I highly recommend a visit here - you know exactly what you will lose (a couple of bucks) and exactly what you will gain (tasty treat, some weight)\n\nTake a cab, drive that pos rental car, or even go for a walk, this place is worth it.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2011-05-18", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "SV7Y_X2UOXmaGaksXRkrmg", "review_id": "fP_5UvK_dDL2DocCdfye4A", "text": "I Luv-it. \n\nI hadn't had frozen custard before (at least not knowingly) and I definitely like it better than frozen yogurt and soft serve -- which is what it looks like.\n\nI got the Western Sundae. Basically it's deliciousness served in a cup. Heaps of frozen custard, topped with caramel and hot fudge, sprinked with salted pecans, and finished with a cherry on top. Golly Gee Willickers, Batman! Better answer the Batphone because this thing is out of control.\n\nI will say that while the frozen custard is definitely playing the lead role here, the salted pecans stole the show. Such a nuanced performance is truly best supporting actor Oscar worthy. If I were frozen custard, I would be thanking my lucky stars for having such an amazing ensemble to perform with nightly.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2011-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7x3-B0yaO_hqXm42VKStzw", "review_id": "isDrOdCgVeOiHJpj-_oBsg", "text": "Hole in the wall spots are always the best tasting!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2011-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LBFfcqdzl8tbYMmI59GKuw", "review_id": "aevJk43LIxYFwCFh7zieJg", "text": "Ordered the Luv It Special with whipped cream (custard any flavor sundae with any topping, pecans and a cherry).   This was such a great sundae!   If I lived in Las Vegas, iwould go here way too often.  The sundae was huge too!  It is actually perfect to share.  So yummy!!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2012-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "69g7n-G8hGpiu_v1hrvbcg", "review_id": "McyDPF7cjrys79b0x7CgFg", "text": "The Western sundae was delish but kind of expensive for a small dish of custard. We both went with vanilla/chocolate swirl.  I think we spent $11 for two of them, and it's not like this place is in the best neighborhood and has high rent.... Nonetheless, I'll likely return, as the custard was good and I'd like to try some other combos.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2012-03-11", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "FRAD3bSkZjdJF8KdyhdtIw", "review_id": "pqtQUGHe6qqPDzCqJoUVVQ", "text": "3.5 to be exact.\n\nMy good pal Wo Z. keeps raving about this spot whenever we speak about Vegas. I recently had the chance to stop by. Yep, it's in a shady area. Keep heading North on the strip, pass the Stratosphere and it will be on you right hand side. Seriously, you go from Venetian, Palazzo, Wynn, Encore, and then dumpville. Even the guys who hand out those 1800-Girls-to-you pamphlets don't hang out here. I guess that is why everyone blasts this place as \"a hidden gem\" in no man's land. I'm sure the original owners put up this shack back in the day when it was still clean and not so seedy (est 1973).\n\nIf you're able to get past the location then you're in for a sweet treat. After examining their menu on the side of the building, I approached their walk-up window counter. The young girl kind of gave me that look like I was supposed to know what to order and to say it in perfect Luv-It Custard lingo. Guess I didn't read that part on their website where it cites examples on how to place an order. http://www.luvitfrozencustard.com/menu.htm\nI asked her what flavors were available and she pointed to the sign that said, \"Flavors today.\" Again, newb first-timer move by me.\n\nI ended up ordering the Hot Apple Walnut with vanilla custard. First, I will tell you that by default, if you do not state a size then they will automatically make a regular size. However, I believe certain items only come in one size. Also, if you don't mention a different flavor that you so desire, they are going to go with vanilla by default. Be sure to be specific when making your order. My order was pretty good. The vanilla custard was rich and the regular size was good enough to share between two people. Not sure if my apples were canned but other people in my party ordered some other stuff in which they said some of the fruits were canned. Whatever, it was still enjoyable.\n\nWow factor 0-10: about a seven.\nI wouldn't say this tasty little treat was out of this world. It was good but not bangin' status. In all honesty, I would like to come back and try some of their other creations or maybe even a shake/malt merely out of curiosity. You are limited in flavors though, depending on what they are serving up for the day. You can check their website's calendar to see what is available before your visit. If I didn't have a car readily available, then I probably won't go out of my way in cabbing it here from the strip. I do know that I'll make it back eventually. They've been in business this long (nearly four decades), I know they are here to stay.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2012-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SRMKX0-l_3ufBg1cA76E2Q", "review_id": "qX7XDmL2JzEe5-oJlzs55w", "text": "Let's call a spade a spade here... Not a whole lot of options in this town for frozen custard.. There's Luv-it and Nielsen's. I have visited both several times. Luv-it is in a bad section of town, cash only, no seating, limited menu, way too expensive for what you get, and comparing the actual custard, Nielsen's custard is the majors and Luv-it is little league. It's not horrible and since it's the only option in the area.. Go to Nielsen's if you can.. They Accept credit cards, owner is there daily hanging out and greeting customers, about 5 times the choices, great seating area, and nice part of town...", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 3, "date": "2012-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "aS1CZA1riGRI1FtYXmI4rg", "review_id": "8fW_zCAJk0TubI2-r4U1OQ", "text": "So there was this dingy little shack with a huge menu. I was surprised that this tiny little place had so many flavors. Was so excited, after 5 mins of thinking what flavors and topping to get. Got to the window and there a small 8 x 11 sign said they only have 5 flavors every week. Right you Serious. Then you should take down that humongous billboard sign of a menu. After that I was pretty upset. They had vanilla and chocolate is a always, taste test and it was bad. So got the cheesecake flavor. It didn't taste like cheesecake but sugary vanilla with a touch of something. The texture was good. Not like ice cream but a tiny bit of frozen yogurt kind of like texture. It was a bit pricey but what isn't nowadays.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2012-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-4ld1qpaBNLocSBe85jWnw", "review_id": "IWAc9zJyjDPBtX13I7jnKA", "text": "I haven't been here in a while - it is such a drab part of town.  BUT, even with all the time that has passed it is still fantastic.  The neighborhood may be super-sketchy, but after taking out of town visitors to the Mob Museum, this was a perfect afternoon snack.  The custard is truly delicious and I love all of their sundae choices.  I had cheesecake custard, butterscotch sauce, banana slices and chocolate jimmies.  \nEveryone loved their own sundaes and my nephews were happy to see all of the tacky wedding chapels they had heard about.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2012-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dmeyzpzu1cq5lyV2Kg_MWg", "review_id": "4Jf5JVYeu1ktt4W23fdofg", "text": "HOLY BUTTERSCOTCH BATMAN...on regular vanilla custard? Yes, please. \n\nThe night we went they also had a blueberry custard and I've never tried anything like it, waaaas AMAZZZZZINGGGGG. \n\nLocated at the very north end of the strip, seemed to be quite the popular place for families on a Friday night.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2012-03-26", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 3}, "user_id": "yBEVmtqG4HVdKu-nEpeGwg", "review_id": "s4iWKMu2xU6ruxBMKczWDA", "text": "I always get the Western.  I feel really special eating salted pecans. \n\nThe flavors for the week are posted online, but you can't go wrong with vanilla or chocolate, which I believe they always have.\n\nIf you are just arriving or just leaving Vegas, you must go here. \n\nThere is really no need to get a large/regular.  I'd recommend getting the junior so you can immediately feel good after and eagerly await your next sin.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2012-03-29", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "0O4FlFM7-3-NgmaRwigJvQ", "review_id": "XNUZKYryuzrPQnmKGzf_sA", "text": "I lurve frozen custard!  It's a guiltier treat than frozen yogurt, but it's so effing good!  I just don't expect to find frozen custard West of Iowa.  As in the state of Iowa.  \n\nSo imagine my surprise when I Yelped a frozen anything place while near downtown, and found a frozen custard joint?  I asked my pops-in-law if we could head over there, and he.....kinda circumvented the getting of the custard.  So later in the day after eating at Firefly with my wife and sis-in-law and her boyfriend, we wanted something for dessert, and Luv-It became the destination.  \n\nYes it is cash only.  Yes it is in a sorta sketchy area.  But I'm used to sketchy due to living and working in some nasty Chicago neighborhoods, and vagrants don't bother me.  I mean they bother me, but I don't care.  But lucky for us, there was no reason to fret.  On to the custard.....\n\nAmaze-a-zing!  Sometimes custard leaves this strange dairy type of odor on my face, like when I eat cheese sometimes...TMI, I know, but not this custard!  I got a small vanilla in order to get a feel for their basic shiz, and I was not disappointed.  Good and cold, but not so cold that you can't taste the custard, smooth and air-free, just like good custard should be.  My wife got a Butter Crunch sundae.  I was too busy stuffing my face to see what was going on with hers other than that the topping was crushed so fine, I was worried she might inhale it and have a coughing fit.  I finished mine, then I finished hers.  And then I felt sick, in a good way.  \n\n\"Try it, you'll Luv-It!\"", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2012-03-30", "type": "review"}
{"votes": {"funny": 4, "useful": 4, "cool": 4}, "user_id": "bjjKz78zeqYkM2AfhD32ig", "review_id": "oe2eS35KypX52YbeqUn8tg", "text": "The navi sent me on a mini detour but I finally found this place after being recommended by my fellow Yelper Rocky. :)   And I feel very fortunate because this place is a hidden jewel that only the locals know about.  I had never even known frozen custard existed and i'm not even sure if there is another place anywhere that serves frozen custard but if you're in Vegas it's well worth the stop.  I was expecting it to taste like frozen yogurt to be honest but it's not to be confused with froyo! This is definitely NOT froyo!  I had the Western custard which was topped with caramel, fudge and salted pecans.  The custard at first glance appears like yellow froyo but when you taste it, you really taste that egg base and note the smooth quality.  No icy pieces or airiness to this.  Very smooth, dense and tasty!  Even the salted pecans were fresh tasting!  :)~  mmmm!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2012-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7eUCo69LkKTCzmSV4DY-mQ", "review_id": "NW066aYU4t0YoIOR-lLxAQ", "text": "I absolutely LOVE this place! It's me and a few of my friends secret spot. When friends come to town, although, I always have to take them there to get their full Vegas experience. I found this place looking up historic places in Las Vegas. \n\nThe surroundings can be a little scary. Lots of homeless drunks around there, but the custard is so good you don't even care. \n\nI'm not a huge fan of the fact that it's cash only, but you just gotta remember to get some money before you leave, and if you forget, there's a gas station right behind it with an ATM you can go to.\n\nI always get the bumble berry and top it with bananas. Friends and family have tried a variety of their sundaes and daily custard specials and have never been disappointed! A regular is HUGE!", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2012-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3fBoZkTpm3DHa0O_bd0xVA", "review_id": "jHYb7luCXkTSHV8Jrn0EBg", "text": "mmm! sketchy part of town but fun to grab one and go check out pawn stars down the block as well. the killers were right, this is beyond delish. try their homemade special \"crunch\" stuff, it's really good.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2012-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xYZIAY0CghYh7v0w9LiCBw", "review_id": "k4SolUxkV8KSNE3yh1OeQg", "text": "Not impressed. Good chance I won't be a repeat customer.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 2, "date": "2012-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DdPGlglwpwbLaRFTwAL2tQ", "review_id": "kOsjP5GEEuxxpDsxtnlz5w", "text": "The best malt shake I ever had.   The service was fast and the shake rocked.  I can't wait to go back.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2012-04-27", "type": "review"}
