{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "072tu2_MFWmw-jb1O6DQYg", "review_id": "LMl9TSOWrPXp7Cs4oVrLlg", "text": "Great, authentic, classic Italian restaurant in one of the most unlikely places. \n\nI grew up eating here and make a visit nearly every time I come to town.\n\nTry the fried calamari \"Roman Style\" for a little kick!", "business_id": "P1fJb2WQ1mXoiudj8UE44w", "stars": 5, "date": "2010-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FlujvsaLHpX3pVv2AIxN5A", "review_id": "H1kaZDVtDn6t4J-JUfcN1g", "text": "My boyfriend and i went here last night. the restaurant is dark romantic and the decor is amazing. There are photographs of the owners and chefs family on the walls.... its cute. My boyfriend called ahead and told them i was vegetarian and the chef prepared a couple of things for me.  There is no set menu and the waitress reads out what the chef has prepared for the night there are 5 courses. an appetizer, pasta, main course, a salad and and dessert. I thought the salad after the entree was pretty interesting . They are also very generous with the bread which i LOVED!!!!\nEvery meal was made to perfection. It had a homey feeling .....\nMy boyfriend had some scallops that he is still talking about.  My entree was spaghetti squash with mushroom wild rice and berries and limed artichokes. There were soo many flavors and all the ingredients were balanced. The service was great.\n All in all it was an amazing experience. The chef came out to say hi at the end of the night...... i finished off my dinner with the creme brulee and some coffee. Our bill came to $120 with tip and it was absolutely worth it .\nThis is a great restaurant for a super special occasions and  it is very private.Not to dressy and not too casual.\n Pick out a great bottle of wine or two and get ready to get your taste buds blown.\n Im pretty sure my boyfriend and i will be going back.", "business_id": "QVZBd_eu0oJ4IN0md2XPTQ", "stars": 5, "date": "2010-04-25", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "AgyCzWofvhYMsxwKOC-cfQ", "review_id": "NCoih8MZxHEzSNUsXhuBmA", "text": "Hands down, Minutello's is overpriced cafeteria food. Olive Garden seems like fine dining compared to this place. \n\nYou can already tell how bad your experience is going to be when they give you the complimentary bread that looked like it was bought from a convenience store. Not the crusty Italian bread. The generic Giant Eagle whole wheat bread that I buy regularly tasted 10x better. This so-called Italian bread came with pre-packed airline butter. No dipping oil with herbs and spices. Then we had the wedding soup which looked like it's been sitting in the kitchen since this morning and was just reheated. \n\nWe had the appetizer platter, which was composed of allegedly banana peppers, calamari, and breaded zucchini. It was 95% breading. I can barely taste any calamari or zucchini. The worst was the marinara sauce, which tasted like it came from a can. Again, no herbs and spices. \n\nFor the entree, I ordered rigatoni and my fiance had baked ziti. The only way I can describe the sauce is: Think of diluted Ragu. My pasta was also overcooked and there was no flavor whatsoever so I had to put so much parmesan cheese. I couldn't even taste garlic in it. What kind of Italian food has no garlic? The baked ziti was overcooked and dry, and it was tasteless according to my fiance. \n\nService was slow, but there was only one waitress in the restaurant. I requested warm water and it took about 40 minutes until she finally served it. She was generally nice and probably embarrassed for serving such crappy food.\n\nHow much did it cost us? $50, including tip.\n\nThis restaurant was probably good back in the day. As we left the place, we saw a certificate of excellence for being one of the best restaurants in Pittsburgh. In 1993.", "business_id": "Pu5uzlZ05pqVlx6LcZbfgw", "stars": 1, "date": "2012-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3LIzxKdgwQBwdHG9KbgVOA", "review_id": "o05KcbnziGRUpEtNNgembQ", "text": "I have loved Legends since it first opened.  Superior food and good service. Try it. This is the last restaurent I took Mom to before she passed away. She loved it also.", "business_id": "q_BKmbdlYfQJroJVHfYMUQ", "stars": 5, "date": "2010-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tumVH5dpOlLFSsmZpiQYHg", "review_id": "s_PzThDhxENOFMmv8c6lxw", "text": "Pizza was good but really expensive. I also got a 6 pack that cost 14 dollars. The same 6 pack cost 7.50 back in my hometown.  When it was all said and done our pizza, wings, soup, and 6 pack cost 50$.", "business_id": "KZXtzoI84iI1CEcAnD7OPA", "stars": 2, "date": "2015-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2GcdTAj-6-VT8kieygpoNQ", "review_id": "DAPwQLbaEFGF-bncbkBfXw", "text": "Excellent pizza, I got a large slice of silcian pizza with lots of toppings, the toppings were very generous. Definitely will be back to try more menu items. Price was great!", "business_id": "DhDNNHZtaBxYNSqJz64ixg", "stars": 5, "date": "2014-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iYoS9-XGyL9hSDskealglw", "review_id": "erLTPRQfD8ek8t-IFhIeCg", "text": "Really good quality old school Italian in the downtown business district. \n\nGreat service, good selection and some great specials.", "business_id": "SzHTdZR3yY1WBYUxkVxmUQ", "stars": 4, "date": "2009-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ho4MdaBcyjWWDeC8y-t9VQ", "review_id": "MSQDt2CJT-pmr2FvC4L7AQ", "text": "WAAAAY over priced and although their appetizers were good, I'm not sure if it's bc we went in August and the kitchen was hot and the cooks were sweating their butts off back there but they salted their pastas WAAAAY too much. One of the pastas in their trio had sun dried tomatoes and capers in it. You'd think they'd tone down the saltiness of the pasta to let the saltiness of the sundries tomatoes and capers pull it together but no. I felt like I was eating strands of salt.  The ambiance is great and their wine menu is extensive. Maybe it was a bad day but I think I can find better Italian restaurants in Pittsburgh with it's strong Italian roots.", "business_id": "XmdTkxKyJd7TuDLoiic1kg", "stars": 2, "date": "2011-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SJONOpXQaMMRCjuk5Rz6lQ", "review_id": "beMKvubjH8fCSSRC3g3ScQ", "text": "Was staying near the Convention Center and decided to try Lidia's.  Glad I did.\n\nIt was busy but was able to get a table immediately.  Ordered the Mushroom Risotto, which was outstanding.  My colleague had the Italian Sausage which he said was also very good.  The menu had some great choices, will definitely go back again to try other dishes.\n\nIt's a bit pricey ($100 for two meals, a split appetizers and two drinks each) but worth it.  Probably wouldn't take my kids here, but would be a great date spot.  It's spacious and even when it's crowded, it's not too loud.\n\nService is very good, food came out at a reasonable pace.", "business_id": "XmdTkxKyJd7TuDLoiic1kg", "stars": 4, "date": "2014-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hru2IDwSyN61sgWPtJw_hA", "review_id": "k-2y8ZGTJQbamF7VUj4WFg", "text": "Damicos has been closed since December 2012", "business_id": "nUISXnW2Jo9ovnoFBIUY_Q", "stars": 1, "date": "2013-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "hru2IDwSyN61sgWPtJw_hA", "review_id": "u7pKO1LtNa39hyrU3TdG3w", "text": "I've lived in the area for over three years and I must have passed this place hundreds of times but last week was the first time I dined here.  I totally regret having passed this place up!\n\nThe problem is, this place is across from Silky's which I know and love, and based on the exterior I assumed this was a very expensive restaurant geared towards the 50+ crowd.  \n\nIt *is* nice inside, but when we dined here I was in sweat pants and not an eyebrow was raised.  Full disclosure:  I was dying at the end of a long urban hike, and we were right next to Alexander's and I told my friend I would hate him forever if he did not buy me pasta RIGHT.NOW.  :)  \n\nAlexander's totally hit the spot.  It was so good!  I was really surprised!  I had the chicken bruschetta and it was DELCIOUS.  I'd had the same item at Del's a few weeks ago and Del's cannot hold a candle to Alexanders.  My chicken breast was only slightly seasoned which is a sign of a good, confident chef.  The chicken was delicious and perfect and came out tasting like well seasoned chicken, not salt.\n\nIt came with a side of pasta in any sauce I wanted from their lengthy list of sauces.  I chose penne in gorgonzola cream sauce.  The gorgonzola sauce was extremely strong.  VERY cheesy.  I like gorgonzola, but it was a bit strong for me--although it was still very good.\n\nMy friend had a spaghetti and marinara in the marinara was incredible.  You can tell its made on site.  It was excellent.  \n\nOur entrees came with side salads which were very good, and there was bread nad oil on the table for dipping although we didn't get into that too much.  I will def be back, and if you havent tried alexander's, I recommend it.\n\nIts good, and you're not going to go broke eating here.", "business_id": "5MChfa-jZfMo3vBpolkSbw", "stars": 4, "date": "2013-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IbvOxKSps_K5wa3a2_jc-Q", "review_id": "9bmut5SxGgHqxYvZC_lvRA", "text": "Service is just okay--they are rude short with you. No parking. On a brick road that will have your car shaking the whole time. You will get your car swiped if you aren't careful. The cheese blend is good. The sauce is sweet: not slightly sweet, but sweet. There is a lot of appeal to Fioris because of the sauce. I guess I prefer something savory in my sauce and find the aggravation to make it less worthwhile than Mineo's in Mt. Lebanon", "business_id": "r8jeeS3k_diihMDSu9IjlA", "stars": 3, "date": "2013-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KSS6v5fcZNoelu4eEZCFcw", "review_id": "i5IOGpLD71d0anQqPsopqA", "text": "This was our second time eating the pizza from here. They are two doors Down from McNeilly Six Pack Shop. You can get food from here and take it to the six pack shop and eat it while you have a few beers. The pizza is in my top 5. The crust isn't too thick or too thin. They put more toppings on pizza than any other place that I know. But you have to have a good foundation to build on and hopefully not using toppings to cover a bad pizza. This pizza would be great even if it was just a plain cheese pizza. Now that I am hooked on their pizza I need to try other menu items.", "business_id": "UjJMQguryo1jypomvOCZgg", "stars": 4, "date": "2015-05-31", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "gSLy4fdXb2smyGGJ7TAxNQ", "review_id": "FMg3psORnO3WaPnDBzAR2g", "text": "The bf and I were just walking around Mt Lebanon when we ran into this place.  It looked busy from the outside, so we thought we'd check it out.  So glad we did!  When we got there we did have to wait a little bit, but we went up to the wine bar and the wait wasn't that bad.  Loved the wine bar in the back! Comfortable and trendy.  For dinner we started with the insalta caprese. Yum!  We then split a pizza and pasta dish. Both were fantastic. The waitress was very knowledgeable and gave us great recommendations.  Wine selection is good, and their mixed drinks looked really tasty. Made a note to try one next time.  They had a couple large groups come in while we were there.", "business_id": "6-rJjW6ITl5o_FliiNgZRA", "stars": 5, "date": "2012-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "s-8qMkfc96RvuGKlDOQ_-w", "review_id": "zPNs-9AXGN5vj1bLQOu3Dg", "text": "fantastic food and wine! Had the bolognese and some other chicken dish that was amazing!", "business_id": "6-rJjW6ITl5o_FliiNgZRA", "stars": 5, "date": "2015-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "9u7EQvFpZG-OxYLQ74J-dA", "review_id": "hRXnWa6n4w0b3NgMJ7lGOA", "text": "This is the place I imagine sneaking into on an evening spent with that charming someone who captures your heart with the slightest smile. Late spring, strolling along the cobblestone streets window shopping when the sky darkens, and the clouds open up. Huddled under an umbrella, his arm around you to warm you from the sudden chill, you scamper down the few steps and duck into the warmth of Girasole.\n\nYou're immediately greeted like family; with a glow in the background as if a huge fire were burning. The small space is filled with lovely folks laughing, and sharing wine; eyes twinkling as they listen to the live music being played by the gentleman walking around strumming his guitar singing loudly.\n\nThe menu is simply simple Italian. The wine list is the sweet red table wine offered immediately after you sit down. The desserts are so worthy of the extra calories. Home made and delightful. \n\nAlmost as tasty as that good night kiss.", "business_id": "xgK6AAhJ-cYBUCSaLzgTuw", "stars": 4, "date": "2012-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yz1w_k4F0eYHUgxIwJRXvw", "review_id": "2ic9DH_nNO3UMTSD9-NL0g", "text": "Wonderful food. I had the rustic linguine and it was so light and refreshing. Lovely atmosphere and the service was very good. A simple Italian menu and great wine list.", "business_id": "xgK6AAhJ-cYBUCSaLzgTuw", "stars": 5, "date": "2015-04-17", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "UL7QkhKsFcT7Qe9nOKHC1Q", "review_id": "HOi3BxU2WfMTTMLVAIUdwA", "text": "It was sub par, honestly. Maybe the other locations were better, but this wasn't NY Style in my experience. For one, the crust was undercooked. There was no golden bottom, the crust on top wasn't golden. Disappointing. Two, there wasn't enough cheese. The sauce went to just near the edge, but the cheese did not follow. I also did not like the sauce -- it was far too tangy and didn't have much flavor; this could be personal preferences, but the sauce tasted like it came out of a can and nothing was done to fix it up. And they were really weak with the toppings. Like, Domino's weak. And they used canned mushrooms. You can tell because when they use real mushrooms they shrivel up a bit in the heat. These were still slightly slimy and that color that canned mushrooms have. My fried ravioli was way too chewy and the breading was bland.", "business_id": "sJtGRBWYUj013nkFA4Hrdg", "stars": 3, "date": "2014-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "QThOUYubahQgY73IwJWzoQ", "review_id": "fRcHkUxpJ_L5ux1tTuAPtQ", "text": "We originally headed to Olive Garden for lunch while visiting the Charlotte, NC area. After finding that Olive Garden uses latex gloves during food preparation, we had to change our plans due to a latex allergy one our family members have. We called Buca and were assured they were latex free. \n\nWhat a great experience we had. From the friendly staff to the perfectly prepared food. Although not widely publicized, Olive Gardens food is \"heat and eat\", meaning your chef uses a microwave oven. Buca food was freshly prepared, served hot and cooked perfectly! The prices were inline with competitor chain prices but the quality was miles ahead. \n\nThe restaurant was clean and decorated in that vintage style Italian home feel.  Being a Brooklyn born Italian, I have been in many Italian houses and trust me, they have the décor correct.\n\nThis is not meant to beat up Olive Garden, or compare Buca to a family owned Bensonhurst or Bay Ridge Brooklyn Italian restaurant, but to give heads up for meal options when traveling.\n\nI normally would not rave about a chain restaurant, but this location deserves to be recognized.", "business_id": "SVKC_-gIQFkHElZ6bFsE6g", "stars": 5, "date": "2014-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5_FQQmck4Kh8Ofgnm0FsiQ", "review_id": "1Wes9t2mwTckv_mGz5evvQ", "text": "My friends and I went to Luce this past Saturday night.  It was my first time and I was very impressed.  Initially, I was worried about the atmosphere--IMO, the decor is a little stuffy.   But the staff is very friendly and the mood very relaxed.  The food is delicious and very reasonably priced (average entree is $20-25).  Check out their menu on their website: www.luceristorante.net .", "business_id": "z24h6ZYnZiWjlDTuLXG9jw", "stars": 4, "date": "2008-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4xOiaqKOvrP9Sh_hzoNi9A", "review_id": "VgIw0ZpUiYNZb2yVYnHFFA", "text": "Restaurant italiano elegante y cálido a la vez. El servicio es excelente. La comida es de buena calidad, fresca, con platos tradicionales bien preparados. Yo fui varias veces a cenar y nunca me desilusiono. Lo recomiendo mucho, por la buena comida y el ambiente súper agradable.", "business_id": "z24h6ZYnZiWjlDTuLXG9jw", "stars": 4, "date": "2014-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jkr0LTZlqG_L4WCNElX2BA", "review_id": "I62eRXl0L_6cnuBOkJXJag", "text": "Come\nOn\nPeople!!!!!!!\n\nThis place rocks, it's my top 3 place to\neat in Charlotte why all the 4 grades, it's a total and solid 5.\nThe food is consistently great, they do\nA wonderful job presenting the food, the staff is upbeat, know the menu, fast service.  The chicken  parmesan is amazing, they have all types of spaghetti options. O my gosh! have you tried the Mamatini? That's a martini made out of aged pineapple. Ok, if you don't order the  tiramisu for desert you have missed the best home made treat in the house.\nDo I get a free meal for this review\nfor goodness sakes I'm Italian for\nChrist sakes, well not really, but\nIf I was this would still be a 5.\n\nTry this place you will not be sorry.", "business_id": "MQnNtW1lHS-eid3QNUoUIw", "stars": 5, "date": "2011-04-08", "type": "review"}
{"votes": {"funny": 4, "useful": 1, "cool": 1}, "user_id": "T8h6pu2IybYIsyX0tmJqHQ", "review_id": "LtmYog7_ht_QX10aPy_HiA", "text": "Rock Solid in. Solid out. Eat more veggies. \n\nTrue story:\nMy kid liked it so much she kept eating and ended up stuffing herself and barfing it all up at the table. After we cleaned her up she wanted to eat more.", "business_id": "MQnNtW1lHS-eid3QNUoUIw", "stars": 5, "date": "2013-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5B26MegOXxpbh-btjVYeJw", "review_id": "ekykgUoGC4FDVuVjVkeKSg", "text": "I ordered Salmoni Arrostiti Olivada. Oven roasted premium filet of salmon. Absolutely amazing. Highly recommended. We also ordered a few appetizers that was also excellent. No disappointments at all.", "business_id": "MQnNtW1lHS-eid3QNUoUIw", "stars": 5, "date": "2015-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "P_Fj8yMKfF6MMuIRXxobfw", "review_id": "C1uTfJQHGTFa4qugTxJCIA", "text": "The veal dish I had was amazing and you can't beat the atmosphere of one of charlottes oldest restaurants", "business_id": "MCFxbw9hQYejyvg59T44TA", "stars": 5, "date": "2015-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1pYVIztMy31flTckfl-Djg", "review_id": "uVN2NC3hPNs64Bp-es53_w", "text": "I always get nervous when an Italian restaurant brings out less than stellar bread. But Ciros served up some great appetizers (Caprese, Calamari and a delicious Cesar salad) unfortunately as I began to get excited about this restaurant my steak came out overcooked with no flavor.", "business_id": "GNKcvMI0RyVQyEA4jNQXjQ", "stars": 3, "date": "2013-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qoIK-4bJUA5l_HURDQQB-g", "review_id": "3WbFYCdxgeiONPdYOHBrrA", "text": "We have dined at this chain for over 20 years. It was one of our favorites. Well bubba, those days are long gone. Ate at the one nearest us in Savannah and noticed the flavor and quality of my dinner (Pasta Rustica) was not up to par. Server said the new owners are all about the bottom line and are changing the recipes. Hello new owners; this is a recipe for disaster. \"If it ain't broke, don't fix it.\" \n\nDecided to give them one more shot. Big mistake pigboy! The Carbonna was horrible, and that is as kind as I can get. Do they have a corporate taste kitchen? It was a bucket of dry pasta with some cheese and meat. A poached egg on top? Not the way to do it. Egg is an integral part of the recipe, not an add-on to pretend this is breakfast too. I tried to eat it but simply could not; even after dousing it with olive oil. There was no sauce; no moisture. Besides, the egg pasta was too thick. \n\nServer did a good job. I asked to speak to the manager. She was gracious and, to her credit, comped my dinner and gave us a free desert. Class act. \n\nBut that was the last time. If you have patronized this place over the years before it was sold, you can now forget them. Do not waste your money.", "business_id": "hvhogN-3cMny0Nrqbsjpkg", "stars": 1, "date": "2012-03-15", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Me14ToRg4pzJGThwI5wGtg", "review_id": "yhUZI9xK5aRKHwrzQ42NCQ", "text": "\"Ummm Good. Yummy. Tasty. What is this delicious piece? Do you wanna try this? It's good.\"\n\nThose are pretty much what my bf and I said to each other during our Valentine's day dinner. No footsies or romantic hand holding but just shuffling forks with an extreme eager to try each other's plate. Vin Santo is THAT good. \n\nI got seafood Ravioli with pine nuts, which completely blew me away. It is by far the best Italian food I've ever had. They made their own bread: crisp and tender. Their Tiramisu will brighten up all of your taste bulbs. Appetizers and desserts are made for sharing, so be friendly to each other, less conservative and share. Go make a reservation now. You'll love this place.", "business_id": "q8fD82us6uuGufvI44NoAg", "stars": 5, "date": "2011-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6kp815UUjK--ukUjmDlSCQ", "review_id": "MPhwH87ed6-EmSWdFV7Qqg", "text": "Wow this place is the suck.  We ate there twice.  The first time the tofu was massively burned to a crisp and the second time I found a rusty fishing hook in my pasta bowl.  WTF??  I've eaten at other locations and they are just fine, but this one must have bad staff and management problems because they are the SUCK.  Stay away.", "business_id": "0oQFFOdPZycIBmGkoBrlbg", "stars": 1, "date": "2008-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z4dPX0APFCbzr4W92W7c2g", "review_id": "nKtPgxAt9sE9c_JL506Vfg", "text": "I sent a copy of my reviews to the owner and received a gift certificate for ~ the cost of my original purchase.  http://i103.photobucket.com/albums/m121/mt_spiffy/frabonis_zpslfxizs3a.jpg", "business_id": "ki33_SvM4kPjgA44Re8-zQ", "stars": 3, "date": "2015-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "S3dhPGW9PJfK6ZuQoJhKfA", "review_id": "Npg57IWkVxSVgsmSaifDZQ", "text": "An old-school place that has now closed.  But don't fret too hard, it is rumored to be relocating in downtown Champaign at some point - where everything else is!", "business_id": "TYyzrCsnGu7Dy8QbH5b4nQ", "stars": 4, "date": "2008-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VOpFhHIlzfKfuLCrqTCVRQ", "review_id": "oOkD-d6q9G19pd6yajIoeg", "text": "The steak was excellent .  But I ordered  artichokes for the table and they were scrawny and there were only 2   Not much taste.  I had had them the night before at Radio Maria's and they were delish.  Also the price was way too high for this type of Italian food in downstate Illinois.", "business_id": "h9xdY1NO4GnNijNChTy-8A", "stars": 3, "date": "2013-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hHimxg0RrR4--yOwj0mOGg", "review_id": "lyrCMF7ErWrf6L7trqmNSA", "text": "Great food, atmosphere, & friendly staff.  While it's not the best Italian out there, for the price around $10 average, it's one of the best.", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 4, "date": "2009-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 1}, "user_id": "oFUsDRuu8tPgptCj2-kNkw", "review_id": "QKPdNmZkBAK2DTtM-5UrZA", "text": "Horrible Service. Food was sub par. Not as good as an Olive Garden. Expected a more authentic taste. The decor was the only positive. Again, horrible SERVICE! I do not recommend.", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 1, "date": "2013-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LPThzNQ7UiiyL0HguOsJqg", "review_id": "kYueZz_aRMnWW1fZGJ6-QQ", "text": "Pretty cool place. Good value for price. Somewhere your kids would enjoy a lot, not only the pasta they serve but warm friendly atmosphere inside", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 5, "date": "2015-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-9mljS0O9mwdOnGv-Oea3Q", "review_id": "Ydy2HVOl5sRL3yOhhK8bQg", "text": "I like pizza. I don't eat it often though. I like to get away from the chain food producers in many cases and find independent local businesses for pizza generally no matter where ever I live. However no one does a Pan Pizza like Pizza Hut! So I often crave the Pan Pizza crust Supreme Pizza and when I go for one or have one delivered, I am never disappointed. The crust is always consistent as are the multiple toppings I so enjoy. And i so appreciate that about Pizza Hut, which I can't say the same of other national pizza chains.", "business_id": "avPNEqlXgyBvTXjb-ujQFA", "stars": 4, "date": "2010-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Br9mpMhkVunsp8Un5GpYWA", "review_id": "8yd_zc55KVEv8fXg0_vRMQ", "text": "We wanted some quick take out and decided to hit up Red Devil las night.  We got a sausage pizza togo.  Honestly it was just ok, I wouldnt say anything amazing, but not horrible either.  Pinos on central is our first choice and Red Devil wont win out over Pinos.", "business_id": "PEHJjxdw11TGFma9Zhz3ng", "stars": 3, "date": "2013-05-22", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "04xW5mhSBaCzpjbcf2VSZg", "review_id": "rh3Tvjgsh3umXoLeQGrG8w", "text": "Seriously? Shut up. This place blows. Wouldn't last 4 minutes in NY. I'll bet the Vegas store doesn't last either.  This place insults the pizza.", "business_id": "JN2qXIuDXnV2d8WnSqd28A", "stars": 1, "date": "2011-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "KWLpwr7BCgiJ17xeKQvXvQ", "review_id": "pTO-_62YZkwlqK817HL5og", "text": "On the whole, Pane Bianco was worth the trip. I highly recommend that you get there via the brand-spanking-new Phoenix Light Rail (Campbell & Central Ave stop)!\n\nAmazing fresh bread from a glorious oven.I arrived just before 2PM and they had just changed the market sandwich ($10- yikes!) I chose the no-mayo tuna. Good tasting and moist, but not great. For an $8 sandwich, I'd have liked a bit more tuna. \n\nThe picnic table seating outdoors next to the street and the railroad tracks - really not so great in the middle of a warm afternoon. \n\nAfter savoring my lunch, I did go to Lux and was extremely happy to cool down with an iced espresso. The ice and the caffeine picked me up I before heading back to a conference in downtown Phoenix.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2009-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tDSDuMzwQiI44W8cfxU68Q", "review_id": "ICYlutf7yG-jGDAYOb4EQQ", "text": "Believe the hype.  The first time I ever made it in to this place, the same Calexico song playing in my truck was playing on their stereo as well, so they immediately scored some brownie points.  My favorite here is the tomato and mozzarella sandwich, and I generally believe that nothing can be good without meat.  This sangwich disproves that theory, admittedly weak and simple-minded to begin with, but still... amazing, amazing place, especially when the weather's good and you can sit outside.  The staff are usually rude, but fuck it - another case of holier-than-thou hipster a**holes saved by 6-star food.  The owner seems like a good enough dude.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2010-04-19", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "_-Zrzf2QYiw4KHugUTXNYQ", "review_id": "UDJsQka5b4kOw4bqE0RN8Q", "text": "I've gotta get my mozzarella fix at least once a week. Mozzarella sandwich or Mozzarella salad. Nobody does it better than Bianco.\n\nBOTTOM LINE: Yummy", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2011-05-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "M_0dv7Zwsw3dE2o_EoHFOQ", "review_id": "0Bed3YB87ZvVdUY22jfuYA", "text": "Incredible gourmet pizza, tons of rich flavor but ultimately light food. Lovely, interesting atmosphere and attentive, helpful staff. Try it before word gets out and it becomes tough to get in.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2013-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bwmXfjwrogAaGqV33kSVpQ", "review_id": "3Iqsi4AXVyD1LMGOGRzaCQ", "text": "Had the chicken salad sandwich and was not impressed. Bread was whatever. Setting is cool but I probably won't be back. Expected more from these yelp ratings.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 3, "date": "2014-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "0qIsBt4EzBDCKrIviV55Ew", "review_id": "CuzO_XelmcwFByuA6jn8tA", "text": "Great example of a four star restaurant,  Oregano's is feautred in so many credible publications.  I come from Northern IL and love the authentic Chicago feel.  The website is worth seeing.  \n\nBest Place for a first date, voted Rep and New Times,\n\nOne of the most amazing desserts The Original Pizza Cookie.  I was in a class at ASU with 29 ladies and they all voted Oregano's the best dessert.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 4, "date": "2008-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IajbWwj6l-KHrfSEwZBLgw", "review_id": "UJ9b8bfpDqFtaE7iezv13A", "text": "Stopped in for lunch last Friday to meet with a friend. Went at 12noon and was surprised to get a seat right away.  Although it was outdoor seating only available.  I ordered a sausage sandwich with the basket weave fries.. Delish.. love it.. although it takes a little while for food to come out, it's well worth it.  They also give you a huge plastic cup of soda.  Our service was ok, it seemed like our waiter was covering a lot of different tables, but then again I'm a pretty mellow person and didn't mind waiting.  But again the food was mackin, and my friend and I ordered the ice cream pizza cookie.. omgoodness, so good.  soft chewy under baked cookie with vanilla ice cream on top.. Enjoy but it's pretty big so I would suggest sharing.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 4, "date": "2011-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "JcsgdLl4HcmAHMRhgsBK7Q", "review_id": "sf-GRVhn3vQ5hoH2vwSibA", "text": "AWESOME FOOD!!!  I don't know why I've been in AZ 11yrs and this is my 1st visit  here. AWESOME, AWESOME, AWESOME FOOD!!!", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 5, "date": "2012-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "baTpFBIKBUW6cmf1Bo3K4g", "review_id": "VWZ-Nexbx8n5yk3SQJmCtg", "text": "The food is great service is great but they served my red wine icy cold, really!\nI'm not a fan of the old old 1950's music very annoying", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 3, "date": "2014-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 3}, "user_id": "RMX11FC48KZTYIeExtGUCw", "review_id": "qcWH4MG3WB_GT5ywRbD0DA", "text": "One day, I was craving something light and healthy, and this place seemed just the ticket. Trying to avoid the Camelback construction, I wended my way through a residential area, and lucked out on a sweet parking spot.\n\nI didn't really have the time or desire to eat there, so I grabbed a menu and placed an order to go -- the seared tuna, and some soba noodles. And I waited. And waited. \n\nFor the record, there is no waiting area, per se. I just stood around by the door, kind of looming over some poor guy's table. I explained to at least 4 different groups, that I was not waiting for a table, and they could go ahead of me. When my food was finally ready, I quickly paid and bolted out the door.\n\nIn the comfort of my cube, I unwrapped the goods. The tuna looked lovely, a good shade of red, nicely seasoned crust, presented on a bed of greens, with a soy-based sauce on the side. It tasted fantastic as well. The noodles were rather plain, the broth unremarkable, but not bad.\n\nI would definitely go back, but would phone in my order first, or dine there.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 4, "date": "2007-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "M-BM4F7LM3_FXlZhUB-2GA", "review_id": "OhQEhcY09Vieiuq1J0RWjA", "text": "My family visited Cherry Blossom for the first time this evening. We were not disappointed. The cha-shu ramen (it has pork and green onions) was outstanding. The broth was rich but not at all greasy, and the noodles were perfectly cooked. The portion size was perfect. The best part: it cost only $8. \n\nWe arrived at 6:15 PM and were seated at one of the last open tables. By the time we left at 7:30, there was a huge line of people waiting to be seated. And mind you, this was on a Monday evening. So get there early and be willing to try something new--they have a huge menu with lots of interesting choices--choices that I will be trying in the very near future.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 4, "date": "2011-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gxOZMidTXSm2z_0AecgbGw", "review_id": "Qyzu74qIrljTxsXGpSTjcg", "text": "Cherry Blossom Noodle Cafe may look like it has an identity crisis, but I think it's just their way of Asian & Italian Fusion. While most of the menu items are Asian, there were a page full of Italian pastas. The menu had noodles from all varieties of cultures and even some rice dishes and sushi, while their decor was Italian more than anything else. Oh yeah, not to mention that their restroom was French...\n\nIt was a drizzly day in Phoenix. The storm from California was heading east so I was in a ramen mood. Although Cherry Blossom was a little out of the way from where I was staying, I still went the distance to get my fix. They had about 5 different kinds of ramen and I was about to get the Harata Ramen until I saw the word \"spicy\" next to Tan-Tan-Men. I love me some spice so I went with Tan-Tan. My appetite also pushed me to get a Tootsie Roll. My boyfriend decided to go with the Gomoku Yaki Udon. \n\nThe server brought out a complimentary salad and not too long later came our Tootsie Roll and noodle dishes. The Tootsie Roll was good, but it definitely wasn't the best quality. As for my Tan-Tan_Men, the bowl and its contents were huge. I was so excited to eat even though I knew I wouldn't finish it. As for the taste of the broth, it was spicy, even for me. I usually pride myself on being able to take on a lot of spice, but the fact that it was spicy mixed with the heat of the boiling broth made it even more intense. I even choked on it at one point, but as I kept eating it got more tolerable. It was tasty, but if I were to ever try their ramen again, I'd probably go with another one. The Gomoku Yaki Udon was very bland. It had a generous amount of seafood, but not worth getting. \n\nThe dishes may be hit or miss, but for under $7, my ramen was huge. I've been to places that give me less than half of the portion size for double the price. It wasn't the best I've had, but it was good enough to satisfy my ramen fix. The servers were very friendly and efficient. I wish I lived nearby to try more of their dishes.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 4, "date": "2012-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "D30Zx1lFfgOPsFJDA5WgTA", "review_id": "VRfgAN252fZXb7JWt4d7Xg", "text": "I have been coming here for years and the food has been consistently excellent, which is a hard feat for most restaurants. I particularly love the Chicken parmesan (best in Phoenix), and Yuka is my favorite server.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2013-04-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DeEl8Wv1AF8oFTBKazp5Mg", "review_id": "07Jq0bY_zCqHZ9BVcWs_4Q", "text": "this place is wonderful! everything me and my husband have had here is absolutely delicious! everything is fresh and very tasty. great menu and a good happy hour on fridays! check out the cherry blossom noodle cafe!", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2014-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ekFRSWR86jKcJ3ZWy9-9IA", "review_id": "U8ehTw34Iry-nh3OOUxTCQ", "text": "The food here is wonderful and the price is amazing! They have a beautiful atmosphere and the staff here are really nice! It's great for get togethers and parties! What I love most is their dessert! Their cakes are lightly sweet and not bland! Not to mention that their desserts are so light! If you can also order take out! Cherry blossom is truly amazing.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2014-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "x38yaB9Bx3FPNp3JFyY3OA", "review_id": "0tJBOwfAEmKRDh0Xmz95iQ", "text": "It is not often I am a visitor to Phoenix. I do come here for work often and recently I was stuck here for two weeks. So I once again invoked the yelp gods and discovered this little gem.\nNow you would not expect a good Japanese place way out here in Phoenix but here it is.  The decor is friendly, the menu - short and simple.  The cooks....not Japanese. But the food is somehow still very authentic and delicious!\nI had the curry beef which was pretty delicious.  The hint of cumin, the soothing miso base and those delicious soft yet just chewy enough udon noodles.  I also had to try their supposed banana bread.  Let me tell you, this place would get only 4 stars from me but one bite of the banana bread elevated cherry blossom to 5 star!  It isn't as good as my wife's but holy cow it comes close!\nSo next time you are in Phoenix and slowly melting under the laser beam focus of the sun, shelter yourself under the friendly atmosphere of this noodle heaven.  You will be glad you did.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2015-05-05", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "LrCU6cEYJqYPNylwlj5Vkg", "review_id": "XNvix-K2sQ8DKACL1hdTTw", "text": "Again a great meal. I had the poached salmon, one of the best in a long time. As usual service was great and the food was outstanding, can't wait to try his sea bass .", "business_id": "3CSaqRNvYg7ZdN2zwxwzVw", "stars": 5, "date": "2012-04-20", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "6gaUsuUzNnRLXtMQVdxX5g", "review_id": "KPVW4N7x1BP8YJ3ZNLomAA", "text": "Wow...for Liza K to give the food an outstanding review only to drop it 2 two stars because the live music interfered with her internet browsing is...bizarre. (They only play on Fri and Sat nights...) Hey, the music isn't Top 40 radio play. But when I go there for the food, its nice to have \"life's backdrop\", (which I thoroughly enjoy, BTW) going on. And if I stop by for WiFi, which I have on occasion, I mean, really, PUT HEADPHONES ON IF IT BOTHERS YOU. lol Whats even better, if you think you can do better, liza, they always invite folks to jam with them. Overall, its a fun, family environment not intended to be a 'library', as the Ricky C put it.\nAs a loyal customer for many years, I will miss this place when I move (Including Eric & Jimmy Lee play those oldie hits). I stand by my last review...best pizza anywhere around. Great atmosphere (yep, even the music)", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 5, "date": "2009-04-04", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "B4ZfuMEKH_aHW9fcV5PbpQ", "review_id": "A-IWQCdMEjYTlkjFBjg25Q", "text": "this place is awesome! I ordered the vegan super veggie delight with soy sausage and it was incredible! I will definitely be going back", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 5, "date": "2013-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GlTmxGZGMrBAcw0iwy3NdQ", "review_id": "Ikhf6aLKGIgefhpNHFzFcA", "text": "I didn't die, but I have been to heaven... pizza heaven that is. \nThe parking on a Friday evening at 7 was hellish. \n\n\nThe decor was nicer than I expected in the dining room, cozy and romantic and there was live music.\n\nThe pizza was thick and doughy, more along the lines of a dominos style pizza then a fancy authentic italian pizza.", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 4, "date": "2015-04-27", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "M6oU3OBf_E6gqlfkLGlStQ", "review_id": "3IPh5f0LUmEKLCHFh4vT2A", "text": "Fish enchiladas or the 5.99 slices and a drink special. \n\nThis was the dilemma I faced today, as Every Wed and Sunday is Mexican day. The Italian and other favorites are still on the menu, but you can also get an array of meat free Mexican dishes.\n\nFor 8.99 I had one of the priciest menu items, the fish enchiladas. Three talipa stuffed corn tortillas toped with cheese and green sauce, served with rice and beans. The rice was nicely seasoned and the enchiladas were full of fresh tasting fish.\n\nMy friends ordered a whole pie well done, and man it did look good.\n\nThis place is mostly veg (except the fish). They are kosher so they are closed on seemingly random days and Saturdays.\n\nMost food is cooked to order and fresh, and fast. Nice staff and both bottled and fountain drinks are available.", "business_id": "lHKS896yFkmAuWyFnbNP3A", "stars": 5, "date": "2011-03-16", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "kIhH6s8zCklTHqrbEB5RuQ", "review_id": "OJXORnacxZXPcquEM6wDxQ", "text": "5 is not enough stars.\nI'm a vegetarian, and off the menu, there is a grilled veggie subsandwich, that's Hot!\nsuperb value, excellent authentic taste with natural ingredients.\nthis is the place to be.\nexcellent service, great location, perfect food!!\n:-)", "business_id": "Tk2dSL0TwQeI_zNJmb442A", "stars": 5, "date": "2013-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "KXC_n5pRVdofmKH7nyxJZg", "review_id": "XGyVrd-nJi2AmIZ8uIYWTQ", "text": "I've been coming here for years! Never had anything there I didn't LOVE!!  \n\nthis trip was the Italian beef. FANTASTIC!!", "business_id": "T5HYqRADhAL6VPRAacz74Q", "stars": 5, "date": "2011-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Wy7f9DOuBEOenhnA7KIKoQ", "review_id": "qZx8gOMrlxb6pKFL7Mv_qQ", "text": "If you read my reviews you will know that I LOVE PIZZA!!!!!  This is one of my favorite pizza places in town.  I just can't complain.  I get the same toppings as I always get:  extra cheese, black olives, mushrooms and artichokes and it's always perfect!\n\nTotally reminds me of getting a slice in NYC.  It's even better cold the next morning!", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 5, "date": "2008-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "LqMpbjrAR2SZGCyahK-9Gw", "review_id": "T0tx0fCpELX3xv770V2fjw", "text": "I have lived in Phoenix since 1985 and have been searching for the perfect pizza.  Finally found it.\nThe Sicialian is excellent.  I remember walking down the streets in the Big Apple and going up to a pizza parlor with window service and buying a slice of the Sicilian pizza pie and continuing down 42nd St while devouring it.   Well NYPD did not dissappoint me.  One bite and I was hooked.  I no longer have to wander from pizza joint to pizza joint looking for the taste I have so long craved.  \nNow if I could just find a pizza like the Vinnie Pie I used to buy at Vinnies on Ardmore Blvd back in Pittsburgh.\nWell I guess you can't have it all though so I will just stick with what I have found at NYPD.", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 5, "date": "2013-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kdxpl6TBh0t3dBpeNkR6lg", "review_id": "FqbTUbzuXZh1PJOMA4oBSw", "text": "First time here and it was yumtastic. We ordered 2 appetizers. The fried mozzarella cheese & the fried zucchini . The zucchini was your standard , average , fare .. Now the fried mozzarella cheese was life changing !! The cheese was so soft , fresh and  tasty . The outside is fried perfectly crisp but not greasy . \nThen came the large cheese pizza , and a bowl of spaghetti  and meatballs . The pizza was phenomenal !! It's one of my new favs  my daughter and bf loved their spaghetti and meatballs . They both raved about the marinara sauce . If your in central Phoenix and looking for some Italian food be sure to check out NYPD  pizza", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 4, "date": "2015-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "9bP3urjM__IP5csFh9ZsuQ", "review_id": "kSwsu0MRnB-PLfjB46ROPA", "text": "Went to this place for dinner a few weeks ago and it was great.  Went there for lunch today and was disappointed. The food is consistently good however the lack of service killed the experience today. Unlike dinner for lunch you have to walk up to the counter and place your order, pay and retrieve your own plate when ready.  I sat in the middle table which was a big mistake as people kept coming in and I had ass and elbows side to side with people waiting to get to the counter.  With the amount of lunch business you think they cold have a server like dinner.  They also do not do half orders for lunch.  Sadly I will not return for lunch but will for dinner someday.", "business_id": "VpW40mznMS43CqdbelX2wA", "stars": 3, "date": "2012-03-14", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "1gGXhRejYAZdFHfmmEwYSw", "review_id": "FqCVCfHvXSxtBexoAGpcAA", "text": "Anyone that give this restaurant less than 5 stars has no idea what they are talking about.  It is a restaurant that is for foodies.  It is NOT fancy, because that is not the point! Everything is made to ORDER and is fresh!  \n\nI have been here several times and think it is a fantastic spot.  Get to know the owner Richard. He is awesome. Tell him you like wine and he will pull something out that will surprise you.  Tell him you like good grappa and he will shock you!  \n\nIf you think the restaurant is crowded go home! This is a true little hole in the wall! \n\nIf you think the food is expensive, try and make home made Italian food on your own... Not happening cheaply! Oh, add a bottle of wine and guess what it gets even harder!  What is surprising is that Giuseppe's does NOT hit you for expensive wine.  Everything is reasonable. \n\nThis is a restaurant for people that love good food!\n\nEAT, DRINK, and enjoy!", "business_id": "VpW40mznMS43CqdbelX2wA", "stars": 5, "date": "2013-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9aB8lTUaa5mUVjbpUlqmkA", "review_id": "cAvb7-85Yn7qxQ5KL-8WTA", "text": "There was a longer wait than we were used to but the food was superb. The people who went with me all enjoyed their food very much. The dessert was excellent as well. I hope to come back to this restaurant again.", "business_id": "VpW40mznMS43CqdbelX2wA", "stars": 5, "date": "2015-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5zlQyarzjIu9jhGrJer2AA", "review_id": "ziTxdbK430PVH5eLp4czZQ", "text": "My friend and I had a coupon for a 4 course meal at Avanti that cost us $59.00.  It was the best money I've ever spent.  The restaurant is lovely, the food was fabulous and the service very attentive.   \n\nOn a recent Saturday night, we each had the gnocchi and ravioli appetizer - to die for!  The Caesar salad was one of the best I've ever eaten.  When choosing our entree, there was no vegetarian selection listed.  'No problem' said Jon, our waiter and he had the chef prepare a delicious risotto primavera for us.  \n\nThe only thing not superior was the tiramisu.  Although it tasted great, the bottom layer was too soggy.  I'll give them a pass on that because having assembled that desert many times I know how tricky it can be.", "business_id": "vvA3fbps4F9nGlAEYKk_sA", "stars": 4, "date": "2011-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Ky0NIKlHVEikAgYSk5UDcA", "review_id": "U6KJXQ_HMhRj2jVPmQ7LCg", "text": "I'm picky about restaurants and service. This place is a solid A+. The only regret is not coming here sooner.", "business_id": "vvA3fbps4F9nGlAEYKk_sA", "stars": 5, "date": "2015-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0-CJuByDISHBDa-IlOXb2g", "review_id": "o2TXRLaWUJ8t-U-sNxj59A", "text": "Good pizza for sure. Slice and a drink for lunch won't break your pocket. Just a divey, neighborhood pizza spot but worth a try. They have more than just pizza but I've yet try anything...", "business_id": "VWcaFOSFcDwmFquycBzFyQ", "stars": 3, "date": "2015-03-27", "type": "review"}
