{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4H-IfBDP5GkfNsQeHi4sHA", "review_id": "OEopG9TyhSyyrTk2Uy5SZA", "text": "My fiancé upgraded his phone at the Apple store, but got a strange text on his new phone about his plan. We went over to the Verizon store to see what was up, and that was about as pleasant as having forks jammed in my eyes. Awful customer service. No one came up to ask us if we needed help. We had to tear a disgruntled man away from looking at his instagram feed to help us. He didn't say there would be a wait or to sit or anything, just said \"okay then\" and left us. So we stood there waiting for help or even just directions for far too long, were ignored and told him we were leaving. Awful awful awful customer service.", "business_id": "HZdLhv6COCleJMo7nPl-RA", "stars": 1, "date": "2015-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "JbWnXwjLaO1kncUkQOMajg", "review_id": "JNdcAWR3AyfPaC0lBUTDZg", "text": "Good selection, but it will cost you.\nMultiple fridges of cold beer, but only the cheap beer is cold.\nNice in person, but rude on the phone.\nParking lot, but none of the customers understand how to park.\n\nEvery good thing about this place is equaled with a bad thing about this place - hence it probably deserves 3 stars. I would really give it a 3.5 if available as this is currently my beer distributor of choice, but since its not possible I have to go with 4.\n\nWhy 4 you ask, when I just went through all that 3 star crap? Any place that offers beer samples provided by attractive women gets a half star boost for sure, and as long as I'm going there anyway it really makes for a more interesting trip.\n\nAfter all, if you don't like free beer, you are probably a terrorist.", "business_id": "s74Tq6WKV1b91UFRr7ch7g", "stars": 4, "date": "2011-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pMf6ebP3jCkELI8RdUebPw", "review_id": "i9MU136vA3xT9s0t5wKFyQ", "text": "Bastone offered me a fair price for the work they did.  I took it there to get a second opinion and despite the fact that they have a sign saying they charge for check-ups, it was free.  They quickly got back to me telling me what had to be done and what they recommended giving detailed reasoning behind it.\n\nAt no point did I feel like they were trying to cheat me or up-sell me.  And they were the cheapest place I checked out.", "business_id": "l-dc5DeNBiHYJA1XO4cFPA", "stars": 4, "date": "2009-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "33lGHHGU5t6Fah8G-dU0zg", "review_id": "cm-tramIAilApTClNhbBSA", "text": "I like this place. Its rarely as busy as the GetGo, doesn't play stupid grocery-store point pricing games, they have Diesel now, and a pretty decent automatic car wash that is priced just right. Its also conveniently on the right side of the road when I'm heading westbound on Baum.\n\nOther than that, its just a gas station. But, hey, at least I can clean my car here.", "business_id": "w8N1BIB2MiP53PM7ouYPQQ", "stars": 4, "date": "2015-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "4cW3iQW6JD1C8VxYP0eyXg", "review_id": "7FMJ2g9fNVrpiLs1x5d11w", "text": "Coffee, Coffee, espresso, cappuccino, coffee, espresso...TEA!!!  Amazing selection of TEAS; high-quality, loose and those that I've tried have been so delicately balanced, the word perfect comes to mind. \n\nWhile their espresso is also excellent, I've not been pleased by Tazza D'oro's (soy) lattes, so I am going to indulge my renewed enthusiasm for fine teas and work my way through their extensive menu that which is not to be overlooked if you have even the slightest interest in exploring beyond the weak frontiers of Lipton.", "business_id": "83_p9vIqOq1TUIf3_GD7bA", "stars": 4, "date": "2010-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ekHwPi7mifQ2ALpUSsYnmQ", "review_id": "pVP7c1k-DfMxj6UJTySCqw", "text": "Great Pittsburgh Happy Hour! $5 dollar apps and dollar off tap beers.\n\nThey have a wide selection of draft beers, so if you like to enjoy flavors other than Miller Light this is a great place to go and enjoy some IPAs at a good price.\n\nWide selection of $5 apps too. We ordered the BBQ Nachos, and they were amazzzing with multiple z's! I crave them all the time now.\n\nGreat service too. Our server was happy and excited to be there. She made the atmosphere more fun.\n\nGet there :)", "business_id": "Ts4xsKPU7FNPPZRj-nRjIg", "stars": 4, "date": "2011-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "fw6zu0lgQ6X432veD7PgtQ", "review_id": "1HXLDpvCCW2lJyldHwnaOA", "text": "I cannot say enough good things about Walter's.  Tim, the head mechanic (Tim Walter, hence the name of the shop), is amazingly helpful and accommodating.  He repairs my car quickly every time I go in, and I never have to bring it back for further repairs.  He also fits me in right away (though it is a good idea to call ahead - they do get super busy because of their sheer awesomeness and small size).  And when I pick my car up, he'll explain what was wrong and how he fixed it in a completely unpatronizing way, then usually undercharge me.  I know, sounds too good to be true, but isn't.  I'll be moving for grad school soon, and I can honestly say I will miss Walter's.  I don't think I'll ever find a better shop/mechanic.  \nA quick word of warning: Tim's adorable, but completely ADD.  He'll fix your car well, and quickly, but he does get easily distracted sometimes.  Bear with it, he's totally worth it.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2009-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Zr1mOOpqhxLkvFKWV5y5yg", "review_id": "bZPAEO5MfE2D9gZuF71lrA", "text": "I love these guys.  I have been renting off of them for 4 years now and now am moving to another building.  they always fix the stuff i ask them to and although the buildings arent beautiful they work and are worth the  price.  they stay out of my business and you dont hear from them unless  you call them, which i love.  I will prolly stay with them until i buy a house in the next couple years.", "business_id": "eRcfdmon9Tj_F42qzgB5SQ", "stars": 5, "date": "2010-04-06", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "2VqU7uoDeiE8OUL14Ce5Ig", "review_id": "Nl-oOCyoiEptte2mEadZ5w", "text": "Combinacion!\nThis place is the shit for real.\nWhere's the Patron at???\n\n(b)", "business_id": "ZDKi3qsO8lSSogrIdbLJKg", "stars": 5, "date": "2011-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f6bEZs7UwxvgGgSAknQ34Q", "review_id": "BbM0QumcHFUNnigQ1lFRXA", "text": "Ahh, the only place near the train station that is open past 9 PM, isn't overpriced and/or full of people who are way too jolly for such an early hour. I got a slice of cheese pizza and onion rings. The pizza was decent. There was nothing flavorful about the sauce and the grease would not stop oozing out of the cheese. I felt sick before I got halfway through it. That reminds me - the slices are HUGE, and are $2. The onion rings were extremely basic - I gave most of them to a couple of drunken girls who debated about what to eat for half an hour.\nOne irritating thing I overheard: as a girl was trying to place an order, the cashier kept interrupting her to say things like \"we don't have those anymore\" or \"no, we can't cook wings dry.\" Sounds like the menu and staff needs to be updated.", "business_id": "B9C6j80ob0f1pwi1Cnnd1Q", "stars": 2, "date": "2010-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "4cW3iQW6JD1C8VxYP0eyXg", "review_id": "d4g84_LsvqlVapVNwKR4Nw", "text": "I think Whole Foods and Giant Eagle Market District are competing for the title of most annoying place to shop. It all starts with the parking experience, which is ridiculously horrible at this location - very poorly planned. And then, there's the prices - Giant Eagle being quite expensive compared to similar grocers in other cities, Whole Foods obviously has to get a one up on those; it's inherent in the scheme of selling premium \"natural\" goods. Whole Foods does have better lighting and layout than GE, and yes, a more discriminative selection of products, especially for people with specialized diets, like vegans (me) and gluten free adherents. The house baked bread here might be worse than GE (tough contest) - often under baked and thus soggy in middle and crusts tend to fall off; making gluten free-dom seem appealing. And I don't even need to talk about customer demographics, because you've all seen Rachel C.'s link!", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 2, "date": "2013-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TCQKvNT-Z_kZQP_oJpzp0Q", "review_id": "b0e8YXb3RkVcyZXy3ckMgQ", "text": "I have to agree with the \"hit or miss\" reviewers about Casbah, at least when it comes to the food. I came here for brunch last weekend with a big group. They were very accomodating to us throughout the reservation process and the brunch, which was good. And our waiter, Daniel, was great. \n\nThe previous reviewer who said the Bloody Mary is the best drink was spot-on. It had a great spice and was the only drink that seemed like it had any alcohol in it at all. The mimosa and sangria were very \"eh.\" \n\nI loved my smoked salmon appetizer (and that did seem to be the hit at the table), but entrees around the table left people disappointed. The goat cheese and mushroom omelette could have had a heckuva lot more goat cheese and mushrooms, and my scallop/sausage/grits/egg dish just had way too much going on. The grits were actually fabulous, but the scallops were overcooked and got lost next to the scrambled eggs (?) and sage sausage crumbles. \n\nIf I lived in Pittsburgh, I could see myself coming back here for wine and appetizers, but I'm not sure I would make it a regular brunch or dinner spot.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 3, "date": "2011-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "q4_kY8bBeigYPVS0Ak7QGg", "review_id": "jOzbZ8yeKq_hmAiyCvrvXw", "text": "Ah Casbah...  the epic tale of bi-polar experiences.\n\nAs with all the other Big Burrito restaurants, I'm definitely a fan of the upscale and unique spin on an ethnic cuisine (in this case Mediterranean).\n\nThe fiancee and I's first venture here left us with some of the best scallops we've had in Pittsburgh and a Jamison Farm's lamb shank that was to die for.  I wish I could remember the waiter's name, but all I can say is, he definitely deserved the 40% tip we laid down.\n\nTake two, brunch.  We sat this time out in the covered and heated patio up front.  While the food was great (I got my obligatory fat kid french toast variation), a rushed server caught her arm on the back of my chair towards the end of our meal and dumped an entire pitcher of ice water on my shoulder and lap.\n\nWhile I'm completely sympathetic when it comes to legitimate mistakes (and the server was obviously extremely embarrassed about the situation), I was surprised when no follow-up occurred.  The server apologized and ran immediately to the back of the house, leaving two of the surrounding tables to come to my rescue with their napkins.  The server brought us our check, but despite the public scene it caused, not a single manager stopped by to verify that everything was alright.\n\nAfter writing to Casbah, the manager did respond quickly and offer to rectify the situation, so I'll give them a pass assuming it was just bad timing and an issue where the server was too embarrassed to do anything.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 4, "date": "2013-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4cW3iQW6JD1C8VxYP0eyXg", "review_id": "Dpq_qP6kPNHixlMbjlwYjQ", "text": "Quiet Storm is, perhaps, the most expensive vegetarian diner I have ever been to, even by big city standards! Cash-only makes this even more difficult. Tofu wings appetizer was simply not very good; and I usually love these things! I tried the gyro wrap which was also a big disappointment. As far as I know, gyros are supposed to be pretty meaty, but this was mostly lettuce with sporadic chunks of seitan and cucumber,along  with dreaded diced unripe tomato. The wrap was dry and upon looking at the menu again, I see that the sauce that it probably requires costs an extra $.50. The tortilla itself was very white and seemingly unnatural compared to those found at most veggie establishments. My beverage was good and affordable--ginger lemonade. It was sweet for my tastes, but I am sure most people would have thought it perfect. I'll keep Quiet Storm in mind as a coffee shop, only.\n\nF.Y.I after splitting the cost of the appetizer with a friend, my lunch cost me $17--ouch! I did have half of the wrap leftover and ate it later as a salad with my own dressing. It was quite good that way and I might recommend that QS rethink the Gyro presentation if they want to continue using so much lettuce.", "business_id": "PzG0XmAmtXFs6Fdnubf41g", "stars": 2, "date": "2009-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SRAaub14pZxTitU4Lj77-w", "review_id": "s-LwD3Lq2EZ-hMztMPD60Q", "text": "My boyfriend and I come here every other Saturday, at a minimum. He gets the QHF with eggs, I get the QHF tofu, side of onion gravy. It's potatoes, eggs or tofu, cheese, seisage, PICKLED ONIONS (the best), and this yummy aioli (let's be honest, it's mayo). I wouldn't call it healthy (maybe I'll consider adding some vegetables to switch it up), but it's the perfect hangover food or post-long run indulgence. They do have many healthier options as well, we're just hooked on the QHF and can't stop. I have also loved the country burrito, grits, and hangover hash. They only have the QHF on Saturdays (and other days) and have a different pre-fix drink included brunch menu on Sundays. The coffee is delicious also. \n\nSometimes I wish the staff were a bit friendlier, but they're all pretty busy running around. \n\nThe absolute best part is that they're always crowded but there's almost never a wait when we go, which makes for the perfect brunch spot!", "business_id": "PzG0XmAmtXFs6Fdnubf41g", "stars": 5, "date": "2012-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "N2IkAI_uppNUMWAoU3RRrw", "review_id": "3A2vIo3aHXCYXQR0YFvLzw", "text": "I looooove their pizza! They bake my cheese with ricotta and tomato extra for a crispier crust. I'm a crust girl, and theirs is perfect. I always get a salad too but they continue to disappoint on that end. The lettuce is often brown and never crisp. I hope they get it together soon or else I will just stick to pizza. Fast delivery and good price :)", "business_id": "lHP5STO7aomlEQixH8m1aA", "stars": 4, "date": "2015-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "L2ne7hSJDy0U6sBD8wVaQA", "review_id": "pM7W808ClCW9J07_Ua2TWQ", "text": "Coffee, dry beans, bulk foods, fresh fruits, and veggies oh my.\n\nOnce a staple place of mine when living in Friendship and Point Breeze, now a novelty that strikes up fond memories.  Even now that I live in the North Hills I still enjoy to seek out the East End Food Co-op on a semi-regular basis.  I go there for the bulk bins mainly, but always end up grabbing some other things.  Their fresh fruit and vegetable selection is always good and cheaper than Whole Foods and Market District for sure.  I am a gigantic fan of their whole coffee bean selection as well.  Very good place.  And not swarming with hippies all the time, though that's not that bad of a thing.", "business_id": "-iVcmhjfq79QoTWzrb6pKg", "stars": 4, "date": "2013-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RPXdlI-G-JwmwvICXWT4zA", "review_id": "313azZPFznG-ACdexg4pJg", "text": "Sub-par setting quality, infrequent wall resetting, inconsistent grading, poor climate control, poor air quality (no chalk filter), silly rule where they make everyone wear paper wristbands before entry. + 1 star because they are finally installing air conditioning.", "business_id": "5V1K5DRpGrObijbtCuPbcg", "stars": 2, "date": "2014-05-20", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "FpG7tvQ3WKrxUF0_MpXNhg", "review_id": "75U0FkyIjFyK3Kj7o_gRNw", "text": "I am a history fan...so when a friend told me about this I made sure he took me to go see it.  The property is very beautiful...\nWe waited a few minutes and signed in....surprising it was discount day!  The waiting area itself was exquisite and already gave rich history of the property and the people who had lived there. By the time we finished looking it over, our tour guide came in.  She was perfect...very knowledgeable and sweet.  She answered any questions we had and made us feel very welcome there.  She gave us ample time to roam around each room.  \n\nThe house is amazing and moreso the car collection.  That is free...and a must-see.  Also is you like art don't miss the art collection.", "business_id": "XWLtYPhCpHht5Zn52zp3-Q", "stars": 4, "date": "2009-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7JDMwDRjhGFEpsL_vqKyRQ", "review_id": "Tp97Zyi8C_3N0LJwVZlk1w", "text": "Amazing. Historical. Unique. Affordable. Efficiently run. Pittsburgh gem!", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2012-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-VRATjWgpYV2IaA8b_B1HQ", "review_id": "LmVbPwo3diVZ2saSZF9xpw", "text": "Had dinner last night.  Amazing flavors, the sauces are wonderful.  Like the other reviews, a wonderful dining experience.  A little pricey, but well worth it.  Be prepared for large portions.  The staff is super friendly and well informed.  Nothing here is \"normal\".  It is truly a unique Italian dining experience.", "business_id": "qUeBDN0D8SC93KeAHhiL-g", "stars": 5, "date": "2013-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5mOO95EHwbvMb5epfWfmBA", "review_id": "_sxagRJcxYIi6Bip6Sep_Q", "text": "Stopped in to see about an oil change. They got my bike in immediately and were very happy to answer questions and even teach me a little about how to do it myself. Ended up buying a new pair of gloves too for a great price. I will be back!", "business_id": "fnAU_q5JWWuPzMvwtQh3Tg", "stars": 5, "date": "2015-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ynt9QATr3tur66_OVQNCng", "review_id": "Pnlm5tqMoZi3j2M84iIq1w", "text": "I really like this Northside institution.  They serve the beer in jars and I had Spaten German beer- very good.  They put really buttery free popcorn on the table so be careful- the grease sticks to your fingers.  In the bar they have an old fashioned player piano.  I really like the German fare- big portions. The schitzel is good but not great but overall way better than Hofbrauhaus and not Disney- it's the real McCoy.", "business_id": "IxQ1ATP_Wg_QujO9nywzcQ", "stars": 4, "date": "2011-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bQZjwktak2gnFNvQOvtpvQ", "review_id": "Gk1iZzIe7lZMz8dDYJY1bw", "text": "Honestly, the coolest pub in North Side and arguably one of the best in Pittsburgh. Max's offers some awesome German Pub grub with a delightful atmosphere whether you'd like to sit down and dine or sit-in at the bar and enjoy the ballgame.", "business_id": "IxQ1ATP_Wg_QujO9nywzcQ", "stars": 5, "date": "2015-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "X8-LPVz2rxvXrHxYcFO-vQ", "review_id": "YEPbEmzYDJqWWTpLaLTN-A", "text": "Incredible bread here!  They don't use preservatives so you better make sure you eat it up fast or have room in the freezer. They have a large selection of breads. The daily rotation of Focaccia is something worth checking out. I think Monday is pepperoni focaccia day", "business_id": "Z7HNl4Gz00cA0_wt0S-vSw", "stars": 5, "date": "2015-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "TzQtvHdEf4GarDPy-HZZSA", "review_id": "AzhFTE6ipC9geOs1a2C1_A", "text": "Very good home style Italian... Very friendly staff. You should bring a bottle of red to go with your dinner... Worth it!", "business_id": "q_BKmbdlYfQJroJVHfYMUQ", "stars": 4, "date": "2011-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WzaaorVCmUTQvu4mScunNg", "review_id": "66mHF47xAQ8oks9OLrdaNA", "text": "I'm not really sure how to go about this review. My nails look great and a full set here is $25. They do hand-painted french manicures which turn out really nice. $5 extra per polish color. \n\nI'm going to also say that this salon isn't for everyone. There are no peaceful water fountains and no soothing music. Actually, the only music playing during my visit was \"Drunk in Love\" by Beyonce from the Grammy's via laptop. (although I'm sure everyone can admit that performance was hotttt. I didn't mind watching it again)\n\nI was in & out in a half hour, 35minutes and Kim did a very nice job on my nails- I would personally recommend Kim. The other nail lady was texting while working on someone's nails. Even though the girl was only 10, she might make that a habit. Oh no no no.\n\n I stopped in because I always ask my (only 3) friends in Pittsburgh where they go to get their nails done, and they all have answered \"Nails Today on the North Side\"\n\nAgain, this salon is not for everyone. However, if you're pressed for time, money (a quick $30 & you're good to go) and can handle the (sometimes loud) clientele, try them out.", "business_id": "NKT8-CeoqUYIGUeNXBPVVQ", "stars": 3, "date": "2014-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "s_sAdwMW2aimtkrJyi0UCw", "review_id": "tjDUjF3YFvQMKSdRVZqHfQ", "text": "Play time!! Brought the little man here for a day of fun and adventure. Walking in you are greeted with bright and inviting colors. We went over to the ticket area with a big sign that says HI (can't miss that) and got our tickets and of course did what most parents with young children do we headed to the bathroom. Next we went into the art room. My son headed right to the paint area. There are little aprons so children don't get paint all over there cloths. After clipping on a piece of paper my son proceeded to make his master piece. Once done we placed his artwork one of the drying racks. Then continued to a room that had sowing machines woodworking and several other stuff. This area my son (4) wasn't as into so we continued on but not before his dad connected on the electrical stuff together to turn on on the little lights and all the trinkets work. Next there was a little area with a slide and some other interesting stuff. It reminded me of the its a small world ride at Disneyland. Just a little creepy with all the dolls and such. The next room was my sons favorite!! There was a huge slide a parachute thing, car tracks that the kids could make and lots of other stuff. We spent about an hour in this room. It was quite fun. Next was a room that had lots of little sized play stuff. I want to say houses but it wasn't just houses. It was fun. We continued upstairs to the nursery area. This was fun. There were lots of tables with different things to play with like trains or colored sand. Next was the water room. Some of the things in the room weren't working right however it was still fun. I wish there was more dryers for the children but now I know to bring a towel and change of cloths. This is such a great place for kids. I don't think it'll be a place we will frequent often but if you haven't been with a little one you should.", "business_id": "-Gfj1gA0Ir07zToO-4fBpw", "stars": 5, "date": "2014-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5RcIWgLTJmqeBv2yV-ZcUw", "review_id": "zYeEHN1PLmIfNVxrMRoIYw", "text": "I was raised Catholic (but no longer practice), and have always been fascinated by relics and the stories of saints--so I was really looking forward to our tour of St Anthony's. BEWARE: I can't speak for their other guides, but the gentleman (a lay person, not a priest) who \"led\" ours was far more interested in haranguing the crowd on the nature of TRUE believers, the infallibility of the Catholic faith, and whether we'd all found our \"charisms\" - the gifts we needed to be using if we were going to be saints, too--than showing us any relics. After an hour of his sermon--and nary a single fact about the hundreds of relics that surrounded us--we left. What a disappointment. What a huckster.", "business_id": "I5JRRkFZrrdcdiT91WwdUw", "stars": 1, "date": "2014-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BX-Mq-oAt1XyCiOBt1ovTg", "review_id": "-MqtFh4zLjdl0Wyuef-_dw", "text": "I'm underwhelmed. Being a Mike & Tonys kind of girl, I was not really expecting a whole lot. But this meal left me feeling totally \"meh\". I've personally made better tzatziki sauce before. Their gyro meat has some flavor but it's way too salty for me. I give it a 3 purely for the fact that their staff is helpful and super nice. That always makes a difference to me. Still it is not going to be enough to make me want to go back. I'm sticking with my original choice!", "business_id": "PSlOtPIo28BvWOzdLmRRRQ", "stars": 3, "date": "2012-03-20", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "NDrS9sG1w9hfLDt5gAIGsA", "review_id": "IWiocS6oxlJ26A_HkDoWbg", "text": "Do you want a pancake breakfast, bacon cheddar fries, and a gyro platter at 2 am...?I know I do!!\n\nOh, and by the way, you're gonna be drunk, and you're gonna like it..\n\nThe worst part about eating Tom's diner is waking up the next morning and feeling like you ate chemical waste, and no, not the Alex Mack kind.", "business_id": "m61vZsAxmTEq3uiCjFjM8Q", "stars": 4, "date": "2012-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "NDrS9sG1w9hfLDt5gAIGsA", "review_id": "KL6ThiIE-Xp8z3_6bL7GPw", "text": "Beto's Pizza is definitely my go-to pizza in Dormont, even though I have to hop in my car and drive down there. Trust me, the drive back always seems like it takes forever, because I feel so weighed down from their delicious pizza.\n\nBeto's is a little unorthodox when it comes to your traditional pie of pizza. First, they sell pizza by the square slice ( which isn't so unorthodox, I know) and second their pizza comes out with the cheese uncooked on top of the hot crust, along with any other toppings you might fancy. So, yes, you will eat your pizza with uncooked cheese on it. And yes, YOU WILL LIKE IT.\n\nBeto's breaks the holier-than-thou commandments of pizza with their methods of pizza production, and while indulging yourself with their pizza, it never felt so right.\nTry eating more than four pieces, I dare you.", "business_id": "93UCt9OgWYmypZCpXtUu8g", "stars": 4, "date": "2012-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "S8Q5h_8B5xdYuWFs2VbYOw", "review_id": "VFmnSwsWMcETfGZ8WvZgog", "text": "Much has been written on that of the mythical Beto's pizza, so I will keep it brief.\n\nA local favorite; the dough and sauce are baked in the oven, and THEN the mountain of fresh mozzarella and toppings are thrown on afterward, right before it's served to you. Resulting in a multi-temperature slab of pizza goodness that is actively melting together as you eat it.\n\nExtremely inexpensive. Quick service. Down-to-earth staff. A very 'family-run' feel. Bring your buddies or your S.O. or your family, eat some delicious pizza, and then disappear into the night toward your next destination. You will be satisfied.", "business_id": "93UCt9OgWYmypZCpXtUu8g", "stars": 4, "date": "2015-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "e59s01jARL-4_MPMfuz4Kg", "review_id": "84dy5RDRtgb4QR6qVYEfiQ", "text": "It's nice to have a local resturant/bar that you can walk to. Cain's is ours. The service is always friendly and good. The prices are fair and it is always clean. I would have given it five stars instead of four, but some nights the food is better than others. I think it depends on who is cooking on a given night. It is never bad, sometimes it is great. Thursday night's prime rib specials are particularly good.", "business_id": "5Udv4CASAXB2eH66TefWPQ", "stars": 4, "date": "2011-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p6vLMwqwXQjZM-1fCNgNkw", "review_id": "NsVkUiMTfKkD4CXwKIio7Q", "text": "It's places like Cain's that are turning Dormont into a Pittsburgh hot spot. Great Beer selection, food is always good and the atmosphere is always pleasant.", "business_id": "5Udv4CASAXB2eH66TefWPQ", "stars": 4, "date": "2015-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8YL4sIcu0LH1PTNYVgeL1w", "review_id": "vwbumV76m4Z87ONgPpxgdg", "text": "Another DDD spot to cross off my list. First one in the East Coast!\n\nI was intrigued with their pumpkin pancakes and raspberry stuffed french toast when I watched the segment on DDD. Finally had the opportunity when I visited by brother for his graduation at Carnegie Mellon. The wait time is killer, so be sure to bring something to entertain yourself for the time being. I think we waited for half an hour, but we weren't terribly hungry, so it was fine. Finally sat down and looked at the menu deciding what to order. Both the pumpkin pancakes and raspberry french toast looked so good, but I didn't want to be a pig and eat both of them (well, I could if I wanted to). My mother suggested that we can order both items and split it from there. Brilliant! Get to taste the both worlds. :)\n\nPumpkin pancakes were delish! A bit on the dense side, yet still fluffy. Spices were so fragrant, like it was Thanksgiving! Not terribly sweet, but at the perfect amount where you don't need the syrup. Huge servings; your serotonin levels will rise. :) The raspberry stuffed french toast would probably have to be my favorite. The crusty/crunchy exterior of the french toast slices stole the stage. The whole dish was sweet enough that syrup was also not necessary.\n\nTheir peach cobbler french toast special looked tempting, but sadly they ran out right when we were seated. Sad. :(", "business_id": "2Igiyhi82R8_QaaPplRmCw", "stars": 4, "date": "2012-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-0AJKCmmeARWQLkGySH1TA", "review_id": "nfRukQ3mXQMapvJoAeLjYg", "text": "Delicious food. Friendly and prompt service. Only complaint is there is no pork alternative (I.e. Turkey bacon, turkey sausage, etc) the staff makes sure you feel comfortable and always keeps your coffee cup full! Definitely would like to return!", "business_id": "2Igiyhi82R8_QaaPplRmCw", "stars": 5, "date": "2015-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mDdBZ5MvWFG6BW1FPd7xJw", "review_id": "B57x6Nr08dx4JbvRrGiHiw", "text": "After being told by a few friends who grew up in Dormont that \"this is the best\" I decided to give it a try. I walked in and ordered a large pep. and sausage. I'm sad to say however I was expecting much more considering some of the hype I was hearing. The pizza was just ok in my book, my favorite part being the small spicy pepperoni. As I ate I watched an Italian sub being assembled. As soon as I saw that peice of capicola...  I new I screwed up, there using the good stuff. To each his own I guess. I will return but not for the pizza.", "business_id": "Cex2R008tMFg8R5fAtf77w", "stars": 3, "date": "2012-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yuc1uHqoyLMG-zFn-Ugeng", "review_id": "R3cOVC3E6ctzjmFhBuuy6A", "text": "Sadly really went downhill. They switched to a new vendor, the prices went up and they are no longer having sales.", "business_id": "21hqlWgjmNgW4pBZJDuziQ", "stars": 1, "date": "2013-04-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "K0JEuehAT3d7wDs3J89-LA", "review_id": "1LHcyXoYgBqrxKru_vwPZw", "text": "We know it sounds crazy but this place has seriously upped its game. This used to be our go-to place when we were drunk and the other better pizza places had closed and we were at the \"anything tastes good when you're lit\" stage. But tonight we decided to relive old times and this time...the pizza was legitimately good. Like really good. Like delicious savory sauce that made Giovanni's and Nicks and other local places seem very unimpressive, a flavorful cheese blend that was melty without being crusty, and a solid crust. If they worked on their crust, they would be closer to the Apizza Badamo level, but the doughy, cheese-bread-y crust isn't quite there yet. \n\nWe don't know if this place is under new management, having a rare exceptional night, or what...but this pizza was a  delicious, quickly delivered midnight treat, and we will be back soon.", "business_id": "iudRNo5Q8W7firUBYJEqQQ", "stars": 4, "date": "2015-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "wzewQMHDSnEeh0ZGC7DU0A", "review_id": "je8l5khcHmIlIh65MxD-wg", "text": "Tourist perspective:\nThe beers were flowing here. Dozens of microbrews that I need to get to know better as well as Guinness, black and tans, and Unibroue Terriblé...a 10.5% ABV, 12 oz challice of dark strong flavorful brew.  Pints are $5-8 depening on how obscure a beer you are ordering.  But there is crazy selection.  Try something different. \n\nDid you know, in this town....and I guess in this state, you don't buy your beer in the grocery store?  You gotta go to spots like this for a sixer.  If you need a beer, pint or to-go, this is an effin' cool spot. mix and match a sixer.\n\nWe tried a bunch of dogs, wings and beers.  \n\nThe crew here managed to keep our glasses full even though it was packed on st. patrick's day.\n\nWe tried a few dogs: the mac and cheese brat (with bacon)....really! bacon, mac n cheese on an effin' hotdog, a bacon cheddar brat and something called the mason-dixon, which was french fries & coleslaw on a dog.  All the dogs were good eats.  You can get your order vienna, veggie, turkey, cheese brat, or on a spicy dog.  The dogs arrive well grilled with a little bit of crisp blackening going on.  There are a shit load of additional toppings you can request (avacado, bacon, various mustards, saurkraut, etc.) and they seemed to be free...at least we didn't get charged anything additional .....Everything was included in the dog prices.\n\nWings were ok.  We did dry wings: jerk, spicy ranch, and parmesean.  They were all decently meaty.  The parmeseans with a side of the spicy mayo were good stuff, distinct flavor and good for dipping.  The other flavors of dry wings were ok. Mostly just salty, but ok.", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 4, "date": "2012-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p9OvcIakpDoDXl0Lez5CJQ", "review_id": "kEEMxda62r9NsirzM8kDCg", "text": "i really like this place and if i were in squirrel hill more often, i'd definitely visit more. there is only one reason i gave it 4 instead of 5 stars, but i'll get to that in a minute.\nthe first i had heard of d's was their six pack shop. they have a large selection of room-temp, cold, domestic, craft, import, normal-size, giant bottles that you can make your own 6 pack with. this was the first place i had ever been to with those kind of options, but now i realize (here's why one star is taken off) the prices for 6 packs are not nearly as wonderful as the selection. now, obviously, with mixed bottles, the price will go up, especially if you have expensive kinds in there. but it seems they charge full price per bottle, which is a pretty lousy deal in the end.\nbut prices for eat/drink-in are totally acceptable! in fact, i don't believe i had ever eaten at d's until a recent yelp event. their hot dogz are FANTASTIC and i only had a beef dog with sauerkraut, not exactly anything fancy. i also got to sample their hummus and dry-rub bbq wings, both of which were also super tasty.\nthe service is always really friendly here too. there's plenty of room to sit down (bar, table, \"loft\" upstairs with a bar and a few tables). and there's even darts upstairs, too.\nd's is definitely worth checking out and if you've never seen the 6-pack \"cave\", at least take a browse, buy one if you're feeling spendy or simply don't have a place like this anywhere near you.", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 4, "date": "2014-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "o5gTRCZkIUXlXFmIGXaEAw", "review_id": "xbAT63aH3WoZ32I6HZB0hg", "text": "Superb beer selection. Great hot dogs. Super fast and friendly service! They ask work as a team. I had everything and was done in less than half an hour, without being rushed. That's great service.", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 5, "date": "2015-05-15", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "iTmWHtltCtk0Gm55AOxrUA", "review_id": "9I2y9lguQKaAwjtMEdiFrw", "text": "It's amazing!  I'm a thrifter and a film buff but in all the years I've had a Screenie pass to the Regent Square Theater, I've never been here.  I've always been promising myself I'd stop in here sometime.  So f-i-n-a-l-l-y I was able to get my butt in here & do some serious thrifting.\n\nAmbiance Boutique is not like any other thrift store.  They don't sell crap here.  You won't find any Kmart knock off brands.  And if you take a close look at their website, you'll notice they are v-e-r-y picky about what they accept http://www.ambianceboutique.org/html/documents/consignment.pdf http://www.ambianceboutique.org/html/faq.html\nBut this totally benefits the consumer.  You'll find a lot of great high end, gently used brands here.  You'll also find that this store is clean 'n' bright, well organized, and the sales staff here really knows their stuff.\n\nWhat's truly wonderful about Ambiance is it's part of Bethlehem Haven.  Bethlehem Haven is an organization that provides services to homeless women, giving them housing and teaching them life skills in order to be self sufficient.  I'm all about vintage wear, thrifting, and reusing still-viable goods.  And if by doing so I'm supporting a valuable charity, so much the better.\n\nWell the upshot was I didn't quite find what I was looking for.  I wanted some spring and summerwear, particularly sundresses and halter tops.  But I came away with a nice gently used Michael Kors brown leather bag and a sweet men's Polo button down shirt.  No, it's not for Rick.  It's for me!  Hmmmm--might be for me to wear for Rick!", "business_id": "V4rrrgVfAVwCI2737bhLIQ", "stars": 5, "date": "2011-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j1JDLZ9Fd61pT6ceJ7FBAg", "review_id": "47Ozr3wKq1z21FRK5AmPTg", "text": "Gonna get some cold cuts today!  I must say that they know how to make a quality sub or \"BattleShip.\"  You come in to this place and you know its quality by the line stretching to the door. I saw one guy walking out with at least five. I've ordered these for parties and events but will always stop (even if I'm not hungry) when I'm in the Swissvale area.  There is just something about these subs I can't explain.  They do everything right here.  From the breads to the meats, to the shredded lettuce these battleships are legit!  They serve 40's too!", "business_id": "DzOPHyrG2XuVqKEvHCnN7w", "stars": 4, "date": "2015-03-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "jThUkO26of_9arLY5zUszg", "review_id": "-qnbj7wNw5Mpfk2xgqzsXw", "text": "Benihana is good, yes, but it is not updated as other hibachi restaurants. The furnishings, carpet, set up hasn't changed in years and the staff/food isn't always up to par. I can eat Paleo here though, which was a new discovery. I've always appreciated sushi, but I never ordered it raw without the fun additions of tempura, sesame seeds, soy sauce, cream cheese, and everything else that makes sushi AWESOME, so this was a new experience. I ordered the Tuna Tatiki, which was 10 chunks of raw tuna. I ordered it without sauce or seeds. It was a little tough to get down because there were so many pieces and after a couple raw pieces, I needed some extra searing, which they did for me no problem! The server was wonderful- she was helpful and had no problem going to extra mile for someone with diet restrictions! I was very happy about this because the last time we sat in the bar, our waiter was really odd. He didn't explain the foods and extra charges (our waiter last night did) and he seemed like we were bothering him. I was happy to have a better experience last night, but I do think that Benihana needs to monitor their staff better. I had negative experiences twice related to incompetent staff, which really made my overall feeling of Benihana go from positive to neutral. Not to mention, the last time I was there, perhaps because we got hibachi at the bar, but it was not very good at all, and I got the most expensive dinner on the menu: \"Ocean's Treasure.\" More recently when I visited Benihana though (the same time I got the raw tuna), I had a better experience- I ordered salmon and yellowtail sashimi. I was very nervous to bite into a raw cut of fish by itself, but was pleasantly surprised at how good the cuts of fish were. The yellowtail had a sweeter taste and the salmon was less sweet, but more flavorful. It was a great to jump outside of my comfort zone and appreciate the rawest of the raw food! I would definitely recommend Benihana due to its location- I love that it is on a hill all to itself, and it's unique mark in Pittsburgh, but I would choose other hibachi restaurants before I would choose this one.", "business_id": "1vQLTKwmcmZXtNzfKEvMmA", "stars": 3, "date": "2015-03-23", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "bvu13GyOUwhEjPum2xjiqQ", "review_id": "c8_Px9yNGFBEjUHtmNNgJg", "text": "This IS your father's hardware store. Walk in and it smells like hardware, if it's big or small they will have it. A few years ago I undertook a pretty good size project that I had no business even undertaking. I had more questions than a priest in a confessional and the great associates here at Greentree hardware answered each one of them for me, even drawing me a diagram for one tricky part of this project. When I went to purchase some things I thought I might need, the associate told me not to waste money buying a certain brand and the cheaper part would be just fine. Now that's service! Now, I'll go out of my way to give this place my business and keep them a float.", "business_id": "Pw-3oiOq1uaFJkkZXQsUYA", "stars": 5, "date": "2013-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LZunC_IJ2ociM1DlJNyvhg", "review_id": "Q7pt8ofiq6XuZ2JUIOusZw", "text": "Good place to relax and have a beer", "business_id": "EtnMSBRlMQWrdTla-jz9RA", "stars": 3, "date": "2015-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f2jXY1WrclY6OFAMnCkNkw", "review_id": "_WTf5pJ_2j-ChqbZz-8pNw", "text": "This review if for the Holiday Inn-Greentree. I was traveling in Pittsburgh for work and picked this Holiday Inn due to it's proximity to downtown. I was not disappointed. This has been one of the better hotels I have stayed in.\n\nThe facility is very clean and the staff is very helpful. You can tell they recently renovated. Their workout facility was great, which is a nice change of pace from the majority of the hotels I have stayed in. The rooms are very spacious and have a refrigerator and microwave. This is great if you don't feel like going out to eat. There is a Giant Eagle right down the street too.\n\nThe hotel offers free wifi which has great speed and makes working from your room easy. There is a shuttle service that runs from the hotel to down town ever hour. All you have to do is ask the front desk and they will help you coordinate. They offer a free breakfast in the morning which is always great as well.\n\nThe next time I am in the Pittsburgh area I will be returning.", "business_id": "chDzLfj8CqvsJq4wzW1ZqQ", "stars": 4, "date": "2014-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "31F3sFFK_bduZDG0TvsnfA", "review_id": "EwTNYNMi-NOYXaqaw8WJsA", "text": "Adequate and could be best in the area, but definetely not in New York league. The space is the best thing about it- large, new and beautiful decor.  They have good products too like Bumble and Bumble but they also push the Kerastase on you, which I don't like. For the value, the prices are very high with mixed results.  Ask about how much experience people have because there are some people with little experience (less than one year). I think Nicolette is the best- has good experience and she did a great job.  Tried the owner Jim and hair came out brassy orange instead of blonde.  When came back to have it fixed, he handled it poorly with me. There is something to be desired for the customer service overall- have definetely had sub-par treatment at front desk and others.", "business_id": "ih6d7hBWss05xXWUznuFaw", "stars": 3, "date": "2010-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ii7G2Yj1LevFs_nfFdDACA", "review_id": "a0vwT-c2sTr-0krbjHTA8w", "text": "I've had better.", "business_id": "FtjvnLhh51ZBYEpKAARaFQ", "stars": 3, "date": "2013-03-25", "type": "review"}
