{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "-Gdjho_gZhgTXkYmSPy0qw", "review_id": "ak6OW0aOQFOZGBGtgXiubQ", "text": "Eh, went here a second time because we were looking for a place to get a sushi boat that wouldn't cost us an arm and a leg.\n\nWe got the Love Boat, which is the mid-sized boat, and it was pretty disappointing. Lots of sashimi, a couple pieces of nigiri, and no maki. Also, the only fishes represented were salmon, tuna, yellowtail, and whitefish, save one piece each of octopus, squid, and shrimp. I felt kind of ripped off, since they basically just took all of their cheapest fish, chopped it up, and threw it on a boat. I wish we would have just payed the extra $15 and went to Chaya instead.\n\nThe Korean is not the best but it's decent for Pittsburgh. I'd come back for Korean, but probably not for the sushi.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 3, "date": "2010-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8GccAq9PTpIWlp0gnCHoRQ", "review_id": "U6rs06Kic4uHGyY6_2_paA", "text": "Went here for the first time -- had the 14 piece sushi platter.  Although the presentation wasn't flawless, I thought the sashimi was fresh and delicious.  The service was prompt and attentive, the portions were generous (well worth the $19.95...I left full).  I'll be back sooner than later!", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 4, "date": "2010-05-08", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "FYdpS8hpJUzzKD1VT1z3iA", "review_id": "uRsiLyPdZYGVbUafp5cVhg", "text": "This used to be my favorite spot.  Ten years ago, I ate here sometimes twice a day.  Over the past year or two, it has gone downhill.  And now?  Well, I hope they read their reviews, but I doubt it.  It would not take much to correct what has gone downhill, but I have seen negative reviews for awhile, but I kept coming back, because I was a regular, maybe I got better food.\n\nFirst...  I like Korean, because I like the ban-chan.  These are the side dishes you get with any Korean meal.  You used to get seven dishes, and they were good, well seasoned, always great.  Then it went to five, now it is down to three or four.  I asked the waiter if this was really all they had.  I tip well, the waiter knows this, and was apologetic that, yes, they only had four type of ban-chan.  And not the \"good\" kind.  You used to get slices of the Korean pancake, or sweet potatoes, not to mention excellent kimchi.  Bean sprouts, and broccoli yum!  Now, you pretty much get kimchi, the sweet red beans, bean sprouts.  That is it.\n\nSecond...  The portion size of the meat was way down.  And I mean miniscule.  Hey, if they are having trouble paying the reant because they expanded out of all proportion to the actual number of paying customers they have, that is not my issue.  Unless they start shorting me on the size of my portion.  In which case, I vote with my feet.  I am not eating here again, period, until I see a turnaround in the negative reviews.  And if I suddenly see a bunch of reviews that sound \"planted', well, that is not too hard to figure out.\n\nThird...  Their sushi has gotton way overpriced and the pieces of fish have gotten really small.\n\nSo, I am done with the place.  I will probably stop by in a few months.  But right now, that Pho place down the street is way better than this.  Not to mention the sushi I can get at that one Asian market that is just a little further up on the strip.  Too bad.  I LOVE dol-sut-bi-bim-barp, and this place used to nail it.  I am not a small ticket customer either.  Just for me, my standard order was a bottle or two of soju, dol-sut-bi-bim-barp, or the grilled korean short ribs, a few pieces of salmon sushi, and then whatever the wife wanted.  And I would tip 20%.  Way to save cash dude!\n\nedit - 12 June 2011...\n\nI have eaten here about three times since I wrote the above review.  I still do not get sushi here, but the side dishes have taken a turn for the better.  Still not enough different ones, but better than it was.  And the food has gotten a little better.  I still have not really pigged out at the weekend meat buffet.  And it is on my list of \"things I REALLY want to do\", will write it up when I do it.  problem is, for what they charge, and how little the wife eats, not worth it.  Maybe I will be able to sneak down there some night.  I'll just tell the wife I am going to a strip club.  She gets really torqued off when I eat out and I don't take her...", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 3, "date": "2011-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gISoLf7Nj4myc-A2R5sqRg", "review_id": "zWtICsMPy4rjTk8HN5_g5g", "text": "one of my favorite restaurants! This is by far the richest bolgolgi I have ever tasted. The staff is the friendliest, Michael is my favorite waiter..super funny! Yes, I am slightly bias because I am Korean but its great food. It's def more on the pricey side I would say compared to most Korean places. I always order the fried pork dumplings and beef bolgolgi. It's obviously cheaper during lunch but I feel that the portions are rather small in the \"box\" your food comes in. I'm not impressed with their alcohol selection, they need more mixed drinks! I have never tried the sushi so can't comment on that. I do wish it was more of the traditional Korean BBQ. They bring a small cooker to your table and make it but still isn't the same. Nonetheless food is great, this place is def worth checking out.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 4, "date": "2012-03-14", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "3gQeZj9dlVNlRVI-pcUc4Q", "review_id": "koNNPROp2Yi4wW88AmvaCg", "text": "Food is completely un-authentic, but tasty.  Service is mediocre.  Ambiance is fun.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 3, "date": "2012-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Vy6oxUFDSGCLmNA6GoA1tQ", "review_id": "5Plgs7SlnR38l5KwfeXPGg", "text": "A group of friends and I went to try out the Korean BBQ. Apparently that is only available on the weekends, so be warned. We started off a bit on the wrong foot, because we had made reservations in advance, only to be told when we got there that another, larger party had booked out the upstairs BBQ area, so they wouldn't be able to accommodate us. After staging a bit of a hissy fit, they were able to find a place for us, and the adventure commenced.\n\nSo, having had Korean BBQ in both New York and San Francisco, I can't say that I thought this was the best experience. The kim chi selection is pretty limited when you're used to being plied with multiple little plates of different kinds of tasty kim chi. Here, they only give you the pickled cabbage. If you're looking for vegetables, this is not your place. You can take marinated bulgolgi, kalbi, pork, and chicken, plus there's calamari and shrimp for seafood eaters. The chicken was really tasty, but the rest of the selection was a bit bleh. As one of my friends put it, the bulgolgi from Trader Joe's is better than what we had here.\n\nIf you go, be nice to your tablemates and try to rotate the cooking duties. It's really lots of fun to go with friends and to have a communal experience, so even though I'm not sounding like I had a great time, the reality is that we all had a lot of fun and enjoyed ourselves. But don't go thinking that you are going to have the culinary experience of your life.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 3, "date": "2012-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SqJ3xHEcHpH1ylOQvkfXcA", "review_id": "Xk9cJ5QAKlB8rlZF0iMmLQ", "text": "Sushi Kim has long held a reputation as one of the best sushi restaurants in town. However, after repeated visits, I wonder if this stems from the day when Sushi Kim was practically the only sushi restaurant in town. \n\nPlease note that this review pertains to the sushi dining only, for dinner. I've not been there for lunch or had the Korean food.\n\nMy most recent visit typifies each time I've had there. Upon arrival, the place is nearly empty. The service is attentive but indifferent, as if they realize you're a dirty dish that needs to be cleaned - you're taken care of like any other chore.\n\nThe miso soup arrived, and was very tasty. However, it was also past lukewarm to the point of being cool. This is pretty normal, as well. \n\nThe most disappointing part is the sushi itself. It is not inexpensive (really, sushi is rarely inexpensive), but upon arrival, it is a bit too warm, and just doesn't taste fresh. Being that much of this dish consists of raw fish, freshness concerns me a bit more than, say, french fries at a bar. Each and every variety is equally disappointing, with the end result being \"Meh\" to \"Yech.\" \n\nWith such a large population of sushi places in Pittsburgh these days, and even Giant Eagle in a pinch, there is not really a reason to frequent this place anymore. After a handful of visits based on reputation and the hope that this time might be better, I've made my last trip to Sushi Kim.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 2, "date": "2012-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l_ry1QEsGk8V_-Y64HOJHw", "review_id": "YQlV-C9YtPxgaP6x7Mzysg", "text": "good Korean food, killer miso and seaweed salad - we'll be back.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 4, "date": "2013-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q7MrNVt1FE23rwtWmPYWHg", "review_id": "DuQjn5b_6n4Lsr1pFCY5pw", "text": "This place is cute! I adored their sushi as did the hot, spicy beef/veggie soup I had with kim chee (I can't remember the names of everything). Great service too.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 5, "date": "2013-05-06", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "FuSWB3HKljZn6cUOzf6EMw", "review_id": "JqTZUZGZORx1eb5so_zxdQ", "text": "Hard to rate this one. The Korean BBQ is tasty (though it is the only Korean BBQ I've ever had, so take that for what it is worth), but the sushi is just awful.\n\nThe salmon sashimi that I had on my last visit was terrible. It was warm, and didn't taste fresh at all. Their rolls are very limited and are mostly pretty boring. Even if simple maki is your thing, these seemed very expensive for poor quality.\n\nOn the other hand, the Korean BBQ was fun and tasty. It's a shame it is only available a few days a week.\n\nMy advice? Skip the sushi. Eat the BBQ.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 3, "date": "2013-05-09", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "3ZQUnl7tihfI_Y4INNgLQQ", "review_id": "bSUygjgN7jPUbQxd278ZBA", "text": "If you're in the mood for fresh, tasty sushi, this is not the place for you. The food that was delivered to us was simply inedible. Point blank. \n\nMy husband and I ordered a bunch of sushi for dinner with the plan of having tasty leftovers for lunch the next day, so we splurged a little, spent like $60 on various rolls. The presentation was pretty pathetic - wilting nori, leading us to believe these rolls were pre-made; hot pink ginger, meaning it's the MSG-soaked kind; glue-like rice, where you can't see the individual grains - but what really horrible was the smell. When we took the lid off the tray, the stench of rotten fish knocked both if us back. I honestly gagged.\n\nIt was so awful, we just stared at each other, amazed that we just spent our money on a pile of stinking rot. Determined to not waste everything, I picked up a piece of spider roll to sniff/inspect/try. IT HAD A HUGE HAIR IN IT, all wound around the crab. Totally disgusting. My husband attempted to try the inari - just tofu and rice, right? It tasted like rotten fish, as it had absorbed all the smells from the other fish rolls. \n\nWe had also ordered a vegetable and tofu soup, and a green salad with ginger dressing. Can't even believe this, but the salad leaves were brown and slimy on the ends! They actually screwed up a green salad. The soup tasted like the inside of an aluminum pot, all metallic and burnt-flavored. Horrible, horrible, horrible. We literally dumped everything down the garbage disposal. Total waste.\n\nWe tried to call and complain, but by the time our order was delivered, the place was closed. We will be calling again today to get our money back. Maybe they will earn themselves another star if they do the right thing and refund our money.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 1, "date": "2013-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f03Mw5lVrISZj41f5sBnVA", "review_id": "akOlxfQBTu_aXNcSI7BxWg", "text": "LOVE THIS PLACE! Real authentic Korean dishes! I just moved to Pittsburgh and their aren't really a lot of good asian styles food around. Went into sushi Kim thinking I would only order sushi, but my friend told me to order from their main menu. The short ribs are to die for! Plus they have homemade kimchi which was very tasteful. I came to this place about 5-7 times since I moved here. Love the Korean BBQ! GREAT SERVICE OVERALL! Prices are a bit to high but is worth every penny! DEFF COMING BACK!", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 5, "date": "2014-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pML_vIbED-QsgB58nEoe5Q", "review_id": "ZZFOlu4mzDkhjBXg11mVVQ", "text": "Wow, amp up the spice, make it hot and wash down with a bottle or two of \"SOJU\" and you can have the BEST KOREAN MEAL EVER - add the sides and have a meal to remember with great service. My fav is Pork Bulgoki and my husband's is Bi-Bim-Bap and they are always exactly the same, piping hot and absolutey authentic and delicious each and every time. Our go to place for our celebrations as well :)", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 5, "date": "2014-05-02", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 2}, "user_id": "hkbwjnY42LDloMV84Yoy5g", "review_id": "nbEGBGBnEpaKqYY2nh8fwg", "text": "I cringed when I saw that their BBQ buffet price went up to $24/person, considering that I can go to a seafood buffet 10 minutes away for much less. Sushi Kim is a clean and bright place with seats on all two floors. The Korean BBQ buffet is on the second floor and only available on Friday and Saturday evenings starting at 5pm. \n\nThe service was wonderful and the servers really helpful. The Korean BBQ is buffet style, so you help yourself to the raw proteins and vegetables at the buffet bars and then cook them on your hot plate at your table. It's a really fun and interactive eating experience. There weren't that many choices for proteins, but the choices that were available were all delicious. Protein choices ranged from mussels and shrimps to pork, chicken and beef. My favorite was the bulgogi beef. \n\nThere were a few things I disliked about the Korean BBQ at Sushi Kim though. First off, they offered no butter or oil for the BBQ. I understand that they are trying to keep things healthy and all, but without any grease, the food was easily burnt. Butter or oil should always be an available option. Secondly, I did not like the design of their hot plates--the interior cooking area was way too tiny so it took forever to cook the food. And finally, they need to add a DESSERT BAR. After eating all that grilled food, I craved something sweet and refreshing. But, Sushi Kim left me hanging. Sushi Kim is already charging a whopping $24 per person--it would be nice if they throw in a dessert bar to sweeten up the deal (pun intended). \n\nOverall, I'm very thankful there is a Korean BBQ place in Pittsburgh. For being the only Korean BBQ buffet place in the area, it deserves a standing ovation. I had a great time at Sushi Kim and would gladly recommend the Korean BBQ buffet special. Buffet price was a bit high though, so crack open that piggy bank!", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 4, "date": "2014-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "2Az24juAhTJtmlqr5UWXSQ", "review_id": "vw1G8j1YHQF32HlDIzzubA", "text": "Now that the weather has warmed up a bit, I don't mind venturing more than a few blocks from the office for lunch. Since today is my birthday, I thought I'd treat myself to something I haven't had in a long time, bulgogi. \n\nI was greeted by a tiny Asian woman as soon as I walked in the door. \"Only one?\" as if I should be ashamed of being a solo diner. She wanted to seat me at a table in the front but, noticing an identical table in the back, I requested that one.  For some reason she didn't want me to sit there and lead me instead to a side room adjacent the bar as if to hide me. \n\nThe server came by shortly afterwards, with a menu and a glass of water. Although I had already made up my mind to get bulgogi before I even got here, I did take a moment to take a look at the menu and was almost tempted to get the kalbi instead. But stuck with the bulgogi when it came time to place my order.\n\nAbout 15 minutes later the server brought me a bowl of soup politely confessing that he almost forgot about me. I suppose the hiding of me was a success. The soup was a salty broth with a few slices of scallion floating on top. Not much to my liking, but hey, everyone's taste is different right?  I'll admit that at this point I was starting to regret my decision to dine here for lunch in the first place but that attitude changed in about five minutes when my plate arrived. \n\nThe plate was divided into four sections. If you look at the photo that I took of it, I'll go clockwise from the top left. The salad was scrumptious containing red pepper slices, carrot slices, cucumber slices, and a slice of orange on top of a bed of lettuce. Everything was very fresh and there was something that resembled candy coated seeds sprinkled on top. This was all dressed with a delicately sweet dressing. Yum!\n\nIn the second quadrant was some of the best kimchee I've ever tasted. The fieriness of it was perfectly balanced off with cooked, yet purposely chilled, broccoli alongside two pillows of something doughy.\n\nBelow that was the main attraction; the bulgogi. I suppose I can talk with some authority here beings that I spent two years in the Republic of Korea. Granted that was about twenty five years ago but I can still detect an imposter when it comes to bulgogi. This is some of the most authentic bulgogi I've ever tasted. Masitneun! \n\nOf course bulgogi and kimchee just wouldn't be complete without a generous serving of sticky rice. The kind of rice that you can easily pick up with chop sticks.\n\nThe total came to $10.65 which I consider a bargain for the quality of the meal that I had. Ms. Personality, the one who originally greeted me, took my check and credit card and rang me up. She didn't bother to look at me when in a halfhearted tone said, \"Thank you\".  Despite the \"hostess with the leastess\", I'm giving this place a four star based Seoul-ly on its authenticity and down-right deliciousness.\n\nkamsahamnida", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 4, "date": "2015-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r4rcbg6JfvSgw9ivHxQwHw", "review_id": "CwrRKTCKXPLm-G83kzqeBA", "text": "Great service but the sashimi was bad. I'm not even kidding when I say I've had fresher sashimi, maki and nigiri from Giant Eagle GetGo's prepared foods. Next time I'll try some Korean fare.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 2, "date": "2015-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2YJU-oXb_iHpK_bjxUwzTw", "review_id": "XzVSaEUbsp05pX8vg7S0eQ", "text": "Never been here before. Hadn't even heard of it. Inexperienced as I was, I expected to be shown what to do or how it works. One of the Asian gentlemen pointed and instructed, but that was it. Disappointed in that. The water I was served came in a plastic cup. What reason would a restaurant serve water in a plastic cup is beyond me. Not inspired to return, mostly because of the passive and lacking service.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 2, "date": "2015-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "H9YgjifTAcsqjUo3pKBTNw", "review_id": "ZGIoejOQYhtKDoXyxBmPDw", "text": "Pretty fast. I've had their soup, fried rice, dumplings, rice sticks, and some Korean stir fry thing and they're all pretty good.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 4, "date": "2009-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bWNjCQyTJttofo3dKtTTPQ", "review_id": "RbPDw60bIkggUC3W_5thdA", "text": "I loved the beef bone soup I got to go from here and I found the crankiness of the owner to be charming. This is a low key campus joint so what do you expect?? Actually, the owner was fairly nice to me and smiled, probably because he figured I wasn't a student. It looked like most of the foreign students in there were also ordering soups (could have been because it was really chilly).\n\nThe soup came with a large portion of rice and only 3 kimchees (not really banchan). Oddly enough, there were somen noodles in mine but the soup was deeply flavored and I was more than satisfied it. I can't wait to come back to IL to get another bowl of this soup, its my comfort food when I am on the road for recruiting.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 4, "date": "2011-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pD0ntLKZOopi2KmaVxSw_A", "review_id": "zRnlQ59wbs_43_T9Gj9BKw", "text": "This is my Korean staple on campus. I always get the budae jjigae. Be warned, it is HUGE. Come during finals, as it is only a hop, skip and a jump off from the Union. They make great kimchi as well, especially the potato variety. With a huge main dish, two side dishes and unlimited tea at less than $10, this place is a jjigae dream. Cafeteria style seating, but so worth the delicious food. Give it a try and fall in love with the spicy soups.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 5, "date": "2013-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "acbR6V3UTAsxe05lQiWWcQ", "review_id": "hPCisPuhBLzy2MMYkpVQHw", "text": "There are many Korean restaurants on campus that are readily accessible for students at UIUC. The market itself is a war zone. With that said, each and every one of those would try to have their specialty to out-do the others. A-Ri-Rang, in my opinion, does stand out compare to its competitors in its own unique way. \n\nIn my personal opinion, I find A-Ri-Rang to be much cleaner than its competitors. Furthermore, the layout of the tables were done in such a way that it would not block incoming traffic, which, if you are a regular at Woorijib, would probably understand what I mean. \n\nEvery day, there is always a lunch special going on. And it is most definitely worth every penny! For approximately $7-8 dollars, you would get a bowl of rice, a fish, and a soup of choice. Now, this may not sound like a lot, but the soup that comes with it is more like a stew. I always get the Soon-dobu jigae (forgive me if I spelled it right). In English? Tofu Stew. It is a LOT more filling than you think if you never had it before. Trust me on this. \n\nIf there is anything you really need to know about A-Ri-Rang, is that their stew/soup food items are superior than their competitors. Therefore, if you are not sure what you want to get, if you stick with this guideline, you really can't go wrong!\n\nWith reasonable price and delicious food, I would highly recommend this place to anyone!", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 3, "date": "2014-05-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JsHky2NY-FvugF8WTMsZtQ", "review_id": "1FcU0vYWzIX5NPZqAX3sow", "text": "I adore the budaejigae here! If you must order something, get that. For those who don't know what it is, it's basically ramen mixed with sausage, pork belly, spam, dumplings, and vegetables. You can also choose the level of spiciness of the broth. For the typical broke college student, the prices are low compared to other places on campus and they give you a lot of food all for under $10. If I had to rate the budaejigae, I'd give it five stars based on taste and the sides offered along with it. Also, there was so much, I had to take home half in a box.\n\nIt's true the owner isn't very talkative, but that's due to a language barrier and it's not fair to deduct any stars for that. There's also no waiter service, but it's a casual restaurant, so this is to be expected. Another thing to note is that it's very clean compared to other places, which is a nice touch. It's not the best Korean food I've had, but it's quite filling especially when you've got an urge to get Korean food.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 4, "date": "2014-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "piHfqvlPPfmoJpgCtIp4Eg", "review_id": "w7d6Z25-ra55s9su9dKTkg", "text": "Like the Bugaejigae and soup there. The food here is reasonably priced with a large portion. \nWaiting time is a little big long--it often takes more than 20 minutes", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 4, "date": "2015-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eFIlrOz3TnuZQeh2Y1e17Q", "review_id": "RXSlQ75k2EOB_Fcy2OrWCw", "text": "I tried out their Bibimbap and it was fairly average. Not much else to say here. It's your stand fare for around $10 if you're looking for Korean food to satiate your stomach's desires.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 3, "date": "2015-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "cH1lLTHReO6uDTif9bfOBA", "review_id": "WUyldu1LnHpkFZMYCurVhA", "text": "So far, our experience on Asian dinning in AZ has been..well, less than average.  But tonight, we were pretty content with the food at Hodori.  Finally, a place we can put on our list of fav restaurants in AZ.\n\n*Price = a little over priced.\n*Portions = the meat dishes gives you a huge pile.\n*Side dishes = they were ok.\n*Service = very polite but a little slow paced.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2009-03-07", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "XfUbS8krsXec3nKYA63jrQ", "review_id": "ycFMcP90VWwmaoxDcb06XQ", "text": "Best Korean restaurant that I know about in this state.  Sometimes the service is terribly slow, and the owners seem to keep changing, and the side dishes are not the greatest, but the chef must stay the same, because the food always stays the same, excellent!\n\nUpdate 12/12/09.  Consistently excellent always.  Friendly service (and fast!).  Best Korean in the state.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2009-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PV8-ly0M_gC8LgmLvgArFw", "review_id": "2TsMW9HvUgAb9ckuny_vNg", "text": "I went here last night and the food was right on! I come from NYC and I know good Korean food when I see it, and Hodori has great Korean food. The side dishes are so much better and there are so much variety than other Korean restaurants that I've been to in AZ. This place always seems busy whenever I come, but I'm sure there's a good reason for that... their food is awesome! Try the seafood pancake for an appetizer and one of the great bbq's on the menu (I like the kalbi). the portions are huge and the side dishes will fill you up! They don't have dessert on the menu, but they give fresh fruit at the end of the meal. YUM!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2009-04-16", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "QUlZ0qEpV3eYeZx_jMtnoA", "review_id": "xwOrErXRcgluNF1yPTpRYA", "text": "When comparing this place to the previous Hodori of days past it has gone down hill considerably. I have seen it's ups and downs but with changing of hands as if it were currency this place has been through a lot. The current owner who ever it maybe is doing it a little better than the others but that's not a far reach from them. \n\nThis like a few other Korean places in town specializes in Tofu stew. The stew here when it first opened many many years ago was very good. This restaurant if you think about it changed the way many Korean restaurants are done here now. The way the food is, the look and I have to say the onset of the tofu epidemic to AZ. \n\nThe stews are good right now with lots of flavor and and great portions of meat in them if you get the pork or beef. The stir fry pork bellys with spicy kimchee is my favorite and the spicy octopus stir fry is good as well.\n\nThere aren't a lot of Korean restaurants here in the valley but I have to say when Hodori is on point they are good. As far as service goes, it is a hit or miss. But what place isn't like that. I have had days where at Denny's I have spectacular service but poor service here. I just don't expect anything more from Arizona Korean restaurants since it's not like LA.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2009-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "NrrXu3AGQYAnv3JdQB1iDQ", "review_id": "budl_yNnunC6daJAJkPQXA", "text": "The Kimchi Jjigae (stew/soup) is great! One of the best I've had in town next to my mom's though. She makes the best. The next favorite item is the pork bulgogi bbq. These are the only two things I get every time I go so I can't really comment about the other stuff. The side dishes they bring out are okay but again I keep comparing everything to my mother's cooking so everyone else is not really getting a fair chance.\n \nPrice:  A bit pricey but the portion is large. $11-15 range for the dishes I mentioned. Two people can split a dish.\n\nAtmosphere: Mostly Korean's as customers, relaxed nothing special, and crowded after church on Sundays.\n\nService: hit or miss, be patient, no one is trying to give bad service on purpose, relax, get up and ask for something if you can't bare it any longer. (it really depends on how many servers are working and how busy it is)\n\nTop two Korean food place in town. (they have awesome stews/soups)", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2009-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2sM4fCVg6FNdfq3FLDJbIw", "review_id": "YhTMCIrpWR_GYeHP3bgkPQ", "text": "Finally found a decent Korean restaurant around town.  I finally had the LOVELY kimchi taste in my mouth once again.  The menu is a bit over priced but the food is great.  Nothing like LA but it's acceptable.  \n\nI've been to Hodori numerous times and got exceptional service every time.  All the FOH staff has a smile on their faces and extremely polite.  The portion sizes are fairly big so one order could probably fill up two people.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2009-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6wpEHXevnaIZp2kUTUfhxQ", "review_id": "lnAnivB6CSk41FhhCXHirw", "text": "I love this place best korean in town!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2010-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8jpGhTgxVQJ1x5p7b9wSug", "review_id": "Ulj2Qz-nKIvIlnq44tFyXQ", "text": "The dishes are excellent. Traditional flavouring and spices in all their dishes including with their condiment dishes. Service is mediocre to below satisfactory.  That's okay because when I go to an ethenic restaurant, I don't go there for service;  I go there for authtentic tasting dishes. Ergo, this is not a restaurant for holding a junket or power meetings.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2011-03-22", "type": "review"}
{"votes": {"funny": 2, "useful": 6, "cool": 4}, "user_id": "usQTOj7LQ9v0Fl98gRa3Iw", "review_id": "NZNp_iXAbo40ojcqG5bcLw", "text": "Hummm I had no poblem with the service that other people mentioned here.  \nIt was a relatively busy Wednesday evening when I walked in (just me) craving some korean goodness.  I was greeted and seated promptly.   \n\nAfter a short wait I ordered a Heit (beer) and the Kalbi (shortribs).  I  found it a bit pricy at 19.95 for the kalbi but I  had enough for 2 people  including the dishes they serve to accompany your entree. So that lessened the sting a bit. The kalbi came sizzling on a bed of onions. Well marinaded and very tasty.  I couldn't get enough of the kimchi or the dakon or that tofu or the potatoes....yum it was all quite good. \n\nAs it is next to one of my favorite places to pick up a boba drink (The Street) there is no doubt I will be here again.  Maybe during Happy Hour when they offer food and drink specials.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2011-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "g2D5QttnvZTX9yVzWWXYxw", "review_id": "ubhNP4yFEQaRKznzG5PGMg", "text": "As I think of my $80 tab and try and remember anything memorable about the meal, I stare off into the distance and forget to breathe through my nose.....\n\nBeef bulgogi was run of the mill and the wee sized pot of steamed rice was, well, wee.\n\nNakji Dol Pan (Octopus stir fried with chili paste) was spiced properly and pretty tasty, but had no contrast and was getting monotonous\n\nTonkatsu (breaded pork cutlet) was pedestrian\n\nkimchi and accoutrement were also pretty bland.\n\neh\neh\neh", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 2, "date": "2011-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DZH5pRRxBBHRT5tF1wQ1_g", "review_id": "TmHiQAsmDLrQj7IS6NN5dA", "text": "Awesome food. I've gone here on several occasions so I've tried a variety of dishes. The sides are great. I've had their bulgogi, bibimbap, a hot soup (can't remember the name), and a cold noodle dish (it was spicy and sweet) - all were delicious. Service is slow, but the boys are polite - the ladies can be a bit frustrated with you - once my family and I asked for wooden chopsticks, we hate the metal ones, and the waitress seemed annoyed. But honestly, the service doesn't bother me - not when the food is this good!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2011-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "l2qZm-1Q39u-IJ3jBhgf6Q", "review_id": "mEdgRPfYtGh_T7SeHmbLfQ", "text": "In all Korean restaurant I have eat in AZ, I place Hodori second. Go eat with my sister for lunch. Since she know all Korean, I let her order. The service is nice but it seems they are understaffed but I can't complain because it is a busy lunch. The kimchi soup go out first. I like it! Hot, sweet, salty, and sour combine all in one. Yes! Score! Then the barbecue meat with rice. It is pretty okay for me but the meat is a bit tough. I though Korean barbecue beef always tender? However, minus one star for the bathroom. I really lose my appetite when come to the bathroom. It is really dirty. They should have cleaned. Until it clean, this remain 4 stars.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2011-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vFyoKM5nvm3kRpmoE6By8Q", "review_id": "sgto4BQsP0W05iOJv1APtw", "text": "Sooo yummy!!! I love their kalbi it's the bomb and they give u a lot but it's expensive. About twenty dollars for that plate but it comes w rice and all the side dishes. If u want tofu soup then this is the best place to go in AZ cuz they have great variety w the cheapest prices. It's cheaper than chodang in Chandler and comes w more tofu too. I Really enjoy this place but don't come often cuz of the price. Their lunch specials are great though from 11-1 I think it's half off for Korean bbq but only on weekdays.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2011-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "5gmnzvjYprzK21Q5awYF_Q", "review_id": "TeWAplF6UCFsLySRgsNFgQ", "text": "This is where I come to get some good old Korean food. I have tried their tofu soups and their jap chei (I don't know how to spell this). Their tofu soup is offered with a variety of meats, kimchi, seafoods, and vegetables. I tend to get their vegetarian one that has seaweed, kimchi, and mushrooms. It tastes great. The jap chei (wrong spelling!) is vermicelli noodles with meat and veggies. It is also very good. The best part about this place are the side dishes. They always give you a lot and they taste great, except when they put something american in there like sliced hot dogs. The service is also great and I love the endless supply of side dishes. You get a lot of good healthy food for a small price. Their tofu soups are around $8.95 and come with rice and all the sides. Their bbq is a bit more expensive though. They also have these delightful coffee candies they give you with the bill.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2012-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uq1y9VRH9vOy91x8f4TQSg", "review_id": "gifKwL9gD7XN0P3z7NvFaw", "text": "Love this place. One of the best Korean BBQ restaurants in the Phoenix area. They have excellent service and the private karaoke rooms are a blast, especially if you have a group. Just be aware of the soju, it'll creep up on you.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2012-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4sgxfhGwXg3OGzrxRjqDcQ", "review_id": "c8iY41M_UqcHJs9DogQ0oQ", "text": "Coming from Southern California, where Korean restaurants are abundant compared to AZ, the pickings of where to go for good Galbi and Jap Chae are very slim.  I tried Hodori last night and I was pretty impressed with the Jap Chae and the Galbi was really good although the sauce is very subtle than most.  But I'd definitely go here again to fix my cravings.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2012-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7knTjXA1lNJw7AMIIJi4YQ", "review_id": "8CglcZoPqXz7N1Za4w3Lyg", "text": "My wife and I both like Korean food.  We went to Hodori for the first time yesterday.  The food we ordered was very good.  The last time we went to a Korean restaurant worth mentioning was a place in Nashville TN (Antioch TN) called Hai Woon Dae.  This place ranks comparable to that.  \n\nI ordered Dalk Bulgogi (Chicken Bulgogi), and it was good.  The chicken tasted very fresh.  \n\nMy wife ordered Soon tofu with pork.  She liked the soup.  \n\nAll of the common sides that were brought out to us were very good also from the kimchi, to the eggplant, to the bean sprouts.\n\nMy wife and I will go back to this restaurant.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2012-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Zm2k6dJtqKDz3pZ70SwohA", "review_id": "xhUZCA8Q-jh3Ua6l5W1usA", "text": "I love their tofu soup. I always get the seafood tofu soup. Korean pancakes (Pajeon, spell?) is really good too.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2012-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "MtwKgPbXr71HumNRtZ7YEQ", "review_id": "U2X5jDfLJ0gLjS5iT5Kp5g", "text": "Nice lunch menu...I cannot review for dinner, I haven't been back to this place for over 5 years....my most recent trip was for lunch, the menu is extensive and great pricing.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2012-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PB5f_4Ojjv6Nf-iGg6JN3Q", "review_id": "qnG23FCAH9nW8AKEg0Yj4A", "text": "I completely forgot to update and mention that I spent the next day throwing up. On my birthday. Again, what a terrible experience!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 1, "date": "2013-03-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "x2YvACuYl25P9v-G4q27JA", "review_id": "jq2yxf-bmBJAc7-4tfQ6dw", "text": "Even though my friends were forty minutes late and I was forced to sit in shame like a pathetic loser, the staff offered me water and politely ignored me otherwise, even as the restaurant began to rapidly fill up for dinner. We had various forms of soondoobu (spicy soft tofu soup) - I had mine with kimchi (I am Korean, after all). We topped off our meal with some pork barbeque, which was pretty good but not as yummy as my mama's. Finishing up with mochi ice cream (not exactly Korean... but oh well) in a yummy chocolate sauce rounded out a pretty good meal overall.\n\nThe side dishes (banchan) were okay - the bean sprouts were excellent, but I didn't try the kimchi ('cause, hello, it was in my soup - kimchi overload = not a good night). I would probably go back again, but only if my friends suggested it 'cause most Korean restaurants in America don't have the Korean dishes I really like. D:", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2013-03-08", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "lMsucBpaRXPKlKgx_q1w-g", "review_id": "WswiM45FDftIQsf85VXL1A", "text": "I brought some Arabians here. They never experienced Korean food, or even held chop sticks.\n\nThe waiter taught them how to use chopsticks. And the guys fell in love with both the Korean women there, and the bulgogi. \n\nI have converted them from Islamic to Bulgogi-ists.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2013-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EUZjPD9bRyw0jQK-PBPVmg", "review_id": "RgRY5DpVT81aszKgWaFvdA", "text": "I love Korean food and this is the place to get it. Always good food, generous portions. The staff are courteous and attentive.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2013-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MuwAEtuXNcbwoA3FlG-QIg", "review_id": "6qWui7ut6HWWphnwrHqkEg", "text": "Went there and have lunch with colleague.  I have no expectation before going there as no one tell me whether it is good or not.  I ordered a lunch special with BBQ meats, it is reasonably priced. Oh my god, by the time you start tasting the food, you will know that this is real Korean food you are tasting!  It is so delicious that you can't resist.  I am not very hungry but I still can finish my whole plate of food.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2013-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kkFOxRKRXJyS-HH54PKKXg", "review_id": "WxZRIP5LN0QF91VrFb9tdA", "text": "A really diverse and interesting menu - everything was tasy!  Large portions and fast service with frequent refills of kimchi and sides.  If you want boba afterwards from the place next door, be aware it closes at 8 during the week!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2013-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "P__qtl1LrHtCcqpgrQmA3Q", "review_id": "AApzxMOdpIdjUtHzYybHiA", "text": "This restaurant so deserves a 5 star rating. I'm from LA and used to eating in Ktown where it's hardcore koreans. Since I relocated to AZ, I haven't found any good Korean food, just sub par. I checked this place out and was pleasantly surprised how good it was. I tried the Bulgogi hot pot, kimchi friend rice, Yuki Jang and the Kalbi and they were all delicious! Most places make the Kalbi too sweet... this place makes it just right! The staff are very friendly and helpful. Too bad they don't do \"All you can eat Korean BBQ\" here.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2013-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lsY05eqfv9KPFbRCJrw_fA", "review_id": "aTx2BVauPWNzA6sbAmBPmA", "text": "This is a really good Korean restraunt, went with a big group and everything was taken care of, I didn't give it 5 stars because they forgot my brothers order somehow and I didn't like how their bugolgi was marinated but everything else was great. Will definitely come back when I visit Phoenix again.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2013-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "CdQi_Vj7xgr8k0dXLcO3Gg", "review_id": "p1RaRCYAn5husHxu1zotNg", "text": "Good Korean food makes me happy. This place makes some damn good Korean BBQ, so yes, Hodori makes me happy. Not everything they make is that great, but every single one of their signature BBQ dishes are amazing. New Times magazine, the Arizona Republic, and Phoenix magazine all rave about this place, and I must admit that I rave about it to people. The food is just so good, and the portions are so BIG even Adam Richmond would need a to-go box.\n\nNow I'm no expert, but this place seems really authentic. I've been to a number of Korean restaurants in southern Cali, and this place is one of the most \"Korean\" that I've been to. Being on Dobson, it's right in the heart of the Asian community of Mesa. Smartly, they're not just another Asian food joint a mile up by Mekong palace and they're located right by MCC and the hospital right off both the US60 and the 101. Easily in contention for the best Korean in the Phoenix valley, Hodori is a must try for anyone in the metro area.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2013-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "k_sY1_dt3qYtiKj6SOYTuw", "review_id": "P-gzyGuJaerU3VO4CtBssA", "text": "My Korean friend says this is the best there is in the Phoenix area.  Based on the clientele alone I would say they must be doing something right, it is a majority Korean Americans eating in there.\n\nAll your standards are delicious, try something new, you will not be disappointed. \n\nAnother thing I love about Korean food, is I feel good after I eat it, because it seems healthier than other Asian cuisine. More vegetables I guess.\n\nThey also serve Korean wine and barley tea. Check those out.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2013-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gvbkgFyu7o1WpPA70_ec-Q", "review_id": "nHRj8udC60MdXTcoMZatfw", "text": "This is a very good Korean place to eat.  It is just a little on the pricey side if you get a drink or two and also eat a full meal.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2013-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "dEudxDkuBjAKKvN-5BrG1g", "review_id": "zp-UtZK_DNuKIMJH5tw2_w", "text": "Hodori serves pretty good food. My husband turned me on to it, however, they have a B rating from Health & Sanitation which freaked me out when I first ate there. Also, the service can be a total hit and miss, but the food tends to make up for it.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2013-05-28", "type": "review"}
{"votes": {"funny": 2, "useful": 9, "cool": 2}, "user_id": "32Dfj21nQ-xTDwfCJxZvhg", "review_id": "wibrnS7YbfxDvYsbfDWqXQ", "text": "I've been coming to this place since I've moved to AZ about 10 years ago.  I ate here so often that at one point I was a \"Mayor\" on FourSquare and \"Duchess\" on Yelp!  They've changed ownership twice since 10 years ago, and the new one took over about 4-5 years ago I believe.  Their food's ok, but the best thing on the menu is their kimchi jjigae.  That's the reason why I came here all those times and I don't even touch their banchan, because it's so subpar compared to LA, SF, or NYC that it's laughable.  Their Soon Tofu is average and the Kalbi is average as well.  But you take what you can get here in AZ when you have a craving for Korean food.  \n\nWell, if you're serving mediocre food, at least you expect them to provide really good in service right?  NO!!  I have always been unhappy with their service since day one, but I just dealt with it.  Well, I've just had it today and sort of lost it!  The waiter (in his 20s, about 5'11\" tall) who speaks fluent Korean and Enliglish, just pushed me over the edge!  WTF??  Are you kidding me??  I could not believe the service I was getting from this guy!  OK so here's what happened.\n\nI ordered 1 Soon Tofu Jjigae with only beef,  2 lunch special Kimchi jjigae, 1 Lunch special kalbi, 1 lunch special kalbitang. (5 total items)  He brought the banchan (side dishes) and rice and asked me if I wanted eggs in \"all of our soon tofu jjigae.\"  I said I only ordered one soon tofu.  Then he said I ordered 2 kimchi soon tofu, 1 beef soon tofu, 1 kalbi, and 1 kalbitang!  I said \"no I didn't\" and I repeated what I ordered.  Then he argued with me and said \"Yes you did! You ordered 3 soon tofu, plus kimchi jjigae, kalbi, and kalbitang!\"  I said \"are you kidding me right now?  Look here!  We're only 4 people!  Why would I order so many soups for?\"  The guy must be a moron, because he can't even count how many people there are to be ordering 7 items?  Do we look like we could eat that much?  We were two slim adults, and two kids under 15!!  Then he let out a big sigh and then stomped off to fix the order at the kitchen.  He comes back with our food and he literally bangs the soup bowl onto the table!  He is obviously emanating a negative attitude, bangs down the rest of the stuff and stomped off.  I just shook my head and we started to eat.  Half way through the lunch we needed more rice and napkin so I called him over since he was bringing stuff to the next table.  He obviously heard me and didn't bother turning around.  OK, so I'm thinking to myself, maybe he didn't hear me.  I call him again second time and he pretended he didn't hear me.  Then the third time, I called him loud enough for the whole restaurant to hear me and then he turns around, rolls his eyes, makes a face and then comes over.  I couldn't believe my eyes!!  I asked him \"are you giving me an attitude right now?\"  then he yells (yes he yelled at a customer) at me and says \"did I even look at you right now?\"  Then he passes by our table, goes to the next table and \"politely\" asks  \"may I take your order?\"  WTF?  I asked him to help me get something and he completely ignores me?  \n\nOk so let's recap here.  He takes the order wrong, puts in 2 too many orders of Soon Tofu, then gets mad at me when I correct him that isn't so, then he practically throws the food at us banging every chance he gets, and then he ignores me when I call him!  OMG!  At this point, I'm FURIOUS!  I get up and go talk to the owner who happens to be there today.  I reiterate everything that just happened and he doesn't say anything but to just look towards the direction of the kitchen!  Then I say to him \"is it ok for the server to do that to a customer\" and he turns and apologized.  He said that it's his fault for not training the staff correctly.  OK, so I'll take that for an apology, but then he should go quietly talk to the server, have the server come over and apologize to me personally!  Nope, that never happened, and guess what happened next?  The owner comes over to our table, being extra nice, and says he's going to take care of our lunch on the house.  At this point, I'm still shaking from rage and I can't even eat anymore.  I said I'm not making a scene, because I want free lunch.  I'm going to pay for what needs to be pay for, I don't want free lunch.  So while the owner's talking to me at our table, that server is standing near the kitchen talking to another server, looking directly at me, and laughing at me!  WOW!   Just amazing!  I've dined out at so many restaurants over the years in my life at all different levels, from Michelin starred to hole-in-the-wall scary places, but this was just the worst service ever!!\n\nStay far away from this place!  I called my mother after what happened.  She was at a luncheon with 20 of her Korean friends for a church function.  You can bet that she spread the word.  None of those ladies are going there in the future.  And neither am I.  To the Owner:  word of mouth is a scary thing.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 1, "date": "2013-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iKDDbFu1lyA8-CVlGLFHcw", "review_id": "l7xZvHL_Zs6tQeuYep-jPQ", "text": "This place was packed on Friday night! Every table was full of happy people getting their kbbq on! It smelt amazing from the get go and we were excited to eat some good Korean food. \n\nWe got the daeji bulgogi and the seafood tofu soup. The tofu soup was just the right spice and warmed our bellies. The meat came out sizzling and tasted sweet and spicy. I wished that the meat was cooked a little longer because I like a little char, but still yummy! The only downside was the side dishes. There were only a few that I liked: kimchi, seaweed and the fish cakes. The others were not as exciting like cole slaw and stuff. Not a huge deal though. \n\nI was still really happy with the food and would come back again!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2014-03-01", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "JW4iRjIP4gGgl-A8mhCKGA", "review_id": "Cl7qD5XMp0Cik_izpwZuUg", "text": "What can I say about Hodori, I love it, I'm annoyed, then I love it. I been coming here for a long time and it's time for a review.  Everyone knows that the service is not the BEST BUT the yummy food is what keeps me coming back. I even stop coming for a while because the service irritated me so much but here I am back. I have notice the service is so much better. You gotta know that this place is BUSY.....and that there are usually 2 or 3 servers for the whole restaurant so make sure your not in a rush or you will not enjoy your food. We usually get the tofu soup (spicy w/ egg) and lunch special spicy pork, lettuce wraps and go to town. My first bite makes me do a butt chair dance cause it's that good. So find out what makes you dance. ; ) Happy dancing !!!!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2014-03-15", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "2Cp86Vk6FPoRcjc5NKmYvA", "review_id": "XRoQtF0jSpPgUADarm2iNw", "text": "First, I would like to say that the staff and waiters were nice. Now, I ordered a bulgogi soup, and it had hair in it. Wasn't proud of that at all. I changed my order to a regular bulgogi and that was good. The place was decent, nothing fancy and nothing too dirty. So overall my experience was a 2 and a half of 5.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 2, "date": "2014-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8Xpn2aFtPnwNoCjk7DXMvA", "review_id": "-Bhc5VWcY8LiwFvdS1Re0g", "text": "Been coming here for about 10+ years now~ the staff has always been superb and friendly, and the food consistent. The prices are reasonable ~ I can go to Chili's and get two meals which would cost $50 for the two of us or dinner for two here at $27. \n\nIt's healthy to the alternative as well! Not saying it's the healthiest choice but you eat a lot of veggies and get your proteins in as well. \n\nI absolutely love it and hope it will be one of the long standing restaurants.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2014-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "pjPs-m67V8VEhN9H5EP6dw", "review_id": "4D3scTopuW1-T9j9XtX8Yw", "text": "Absolutely love this place. Best authentic Korean food I've found in the valley. Highly recommend to all.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2014-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "sSeAR3criFgLU4DVfGhBxA", "review_id": "S3cuLh5PjAABuY4l1_HC3A", "text": "Objectively speaking, this restaurant is positioned right in the median line among Korean restaurants. However, I've lived in both LA and SF for several years each, so I could be a harsh critique here.\n\nThis is the only Korean restaurant in Tempe (aside from the one-offs like Paradise Hawaiian BBQ) and so you're not exactly picking from a bunch anyway. The food tends to be well-portioned, though many of the dishes had been pre-cooked and are just heated to order (i.e. Yukkaejang). My biggest discontent is the price, which is quite expensive comparing against the price level of other Korean restaurants I've been to, and absurdly expensive when compared against the other restaurants of similar caliber in Arizona.\n\nThe best thing happening here is the pancake, so definitely try it out if you're new to Korean food. It's about $13 (maybe even $15?) and serves as a great appetizer to split between 3-4 people. Don't go for the happy hour stuff-- they are puny in portion.\n\nThe second best thing happening here is the service, though it depends on who you get. The younger servers tend to be really friendly, well-spoken, and willing to take your fight to the kitchen for you. For example, my Yukgaejang (spicy noodle soup) showed up with no noodles-- the girl server had the kitchen serve me a whole side bowl of noodles and soup for free! The older servers, by contrast, tend to be hags.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2014-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wcOqMTV92kxOornA42KyoA", "review_id": "yyQY18s6ow9NT89al55qmQ", "text": "At ASU for a yoga festival; so, was craving Korean food.  This was one of the restaurants they suggested we were only a couple of miles away; so, we went.  Have been to several Korean restaurants here in Phoenix, Glendale; but none in East Valley. I was craving Bulgogi and was not disappointed; my friend is gluten free; so, asked if the \"sauce\" was soy sauce based; they couldn't answer; I even tried to say shoyu; at last they still didn't know what I was saying; so, my friend got the Bibim Bap. I really enjoyed the Bulgogi along with the Banchans that were served.  Not all of them were spicy; so, I really enjoyed it!!!  My friend really enjoyed the Bibim Bap; and so really liking this place.I will be back!!!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2014-04-13", "type": "review"}
{"votes": {"funny": 4, "useful": 2, "cool": 0}, "user_id": "XqMkm-DD9VsdcKx2YVGhSA", "review_id": "dHj4bFu73KzqQIVb4B__3Q", "text": "(Lyrics - Lady Gaga - Edge of Glory)\n\nI'm gonna Yelp Hodori\nAnd I'm tasting on some Korean food\nI'm gonna Yelp Hodori\nAnd I'm tasting on some Korean food\n\nI'm on gonna Yelp, and Yelp, and Yelp, and Yelp\nand Yelp, and Yelp, and Yelp\nI'm gonna Yelp Hodori\nAnd I'm tasting on some Korean food\nI'm gonna Yelp Hodori\n\nHodori is one of those popular Korean restaurants that serves up some nice traditional Korean home cooking.  \n\nI came here with a large group of people and service was on top of it's game needless to say.  Nice and funny at the same time!\n\nI ordered my favorite of course the Seafood Tofu Soup, while some of my friends order the Dol Pan Bibam Bap; a vegetarian dish for sure. Finally the the Bulgogi hot pot.  I can say I enjoyed my Seafood Tofu Soup.  The Bibam Bap was nice, but not as flavorful according to my friend.  Nicely plated for sure I think.  Finally the bulgogi was sweet, but definitely needed more spice!  \n\nOverall, pretty good place for a quick Korean home style cooking.  You don't get a lot of side dishes like some Korean restaurants, but I didn't really cared for it anyways. Enjoy!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2014-04-14", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "J0YgzBL5AOdjWdj_y3ZGjA", "review_id": "zsjtpY9HdB7Yh3zqAXP1Ag", "text": "So I've been to this restaurant 3 times just to make sure it wasn't me that was being rude or a jerk. \n\nSo to start off the food is just ok, nothing too spectacular but not bad, but the pricing is high for the things here, I can get it at any other Korean restaurant for way less.\n\nSo here's is why I gave the place a one star.... The service it's not nonexistent it's pure rude like I borrowed money from them and didn't pay them back!! So every time I ask them about any dish on the menu they look at me like I was crazy, like I was from another planet or something for not knowing what I was asking about was. One time I was there for lunch at 2:30 or so with a buddy of mine and I asked them if I could order the happy hour dishes that starts at 3 and naturally they said no which was understandable so we order and started to eat til 2:57 when I asked again to get something from the happy hour menu the waitress looked at me with a look the a mom would give to her child when he did something bad and replied it's not 3 at that point I wanted to het up and leave  but my buddy said wait and at least finish lunch, ok I finished stood up and asked our waitress for a togo box from behinds the counter she the replied \"for what?\"....I was so done with this place told me buddy to pay and stormed out \n\nSo for all you awesome people that read the my whole rant thank you and those who didn't.....well I STRONGLY would not recommend this place to eat maybe to get pissed off at but other then that yeah that's my two cent.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 1, "date": "2014-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "X8LzH3gWUIoLOBIxa5XjBw", "review_id": "2Fmm8K7jcsNih-KkpvFVQQ", "text": "I'm SO happy to find tasty Korean in the area. \nI had the soft tofu and beef soup. I liked all the little sides that came with my food.\n\nMy husband tried some sort of bolgogi hot-pot. It was sweet but he LOVED it.\n\nI'm looking forward to going back and trying the bbq.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2014-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SHcX9hp5RG3-OqsbvissIQ", "review_id": "yCSx1e8MPr7NTw-WLSww1A", "text": "One of the better Korean restaurants I've ever been too.  Service is friendlier than most, and the food quality is excellent.  Prices are good, too.\n\nThe Bulgogi is my favorite, and they do a really good job with it.\n\nI'm sad that I now live across town from here, and can't make it very often.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2014-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IdBWdv6I6gn4M5ZDMQ_cVg", "review_id": "9j3tAWEjShlmOlC9ezEnfQ", "text": "Went for dinner. Self seating. Waitor was very nice and explained what everything was. Great flavors. Amazing portion sizes. Everthing was very taste full. I will be going again for sure.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2014-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AOSAYR_1rFVVGGY1ajEZ3g", "review_id": "MBMDIo-yz1GvkXaKLWvasQ", "text": "This place is the most authentic Korean place in Phoenix! All the food is spectacular and I will most definitely be coming back. The food is cooked quickly and there isn't that much of a wait. It's worth 49 min drive", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2014-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1kEfHAJte1XIPyquE9gGmQ", "review_id": "hYmgIv3EH9Q5LE1kpDasaw", "text": "Terribly old decor looks like it wasn't renovated from the middle of the last century. No booths, uncomfortable tables and chairs. Pictures of menu items with prices make you feel like you're in cheap Chinese take-out restaurant. Well, Chinese take-out is at least cheap.\n\nI had chok kalbi. Cured vegetables, kalbi comes with, are disgusting and inedible. The meat was so unchewably hard and unreasonably priced for the low quality.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 1, "date": "2015-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "fdfKD_cS0AbOv2svRa36jw", "review_id": "yP34JKHdYx6rBLZHGkjesA", "text": "The food was just delicious! The bibim bap was just perfect on the hot stone bowl. I would definitely come back if I ever pass through Arizona.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2015-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W7mwqtLBG7I0c97vfvTN_g", "review_id": "g9oU0F6HKF0paxeiGHrYVw", "text": "Food is good, but they are VERY VERY stingy about the side dishes.  They refused to give you the side dishes before your meal and once, they told me they ran out, when CLEARLY they didn't as they were serving it to other tables.  I would rather go to Takamatsu or Banchan.  Very bad service.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 1, "date": "2015-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "v2QRR1kvRAipwXzfxVD2RQ", "review_id": "VpNpEYe5GDGFAPvhRlL_mg", "text": "Korean foods are very interesting to have a try. I heard from friends here have traditional Korean foods. But I am sure is it real, at least taste is okay.. It's spicy... If u like spicy taste, here maybe is a good choice.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2015-03-13", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "qdw7JlxuNOX8RR8Ga9Im8g", "review_id": "NPoTyZAp5zTQlA6Y_YFu9g", "text": "So I'm going through this faze thanks to Netflix where I wanna watch Korean dramas. In these Korean dramas, they are always eating, eating, EATING. Ususally it's some version of kimchi. So I've been looking around for a while to find a Korean restaurant so I could get some kimchi (little did I know Fry's has it in the produce section). \n\nThanks to Yelp...Hodori is the highest rated Korean food restaurant I've found. It deserves the rating. The people are really nice, and the food is really good. Did they make a kimchi fan out of me...not really. So why just three stars? I was really lost when it came to ordering and everything. I didn't know what to get and what was what. I wished the waiter could've explained the side dishes and everything. \n\nI would definitely come back, but only with someone who's a little more familiar with Korean food so they can explain to me what to get and what I'm eating.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2015-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M6oU3OBf_E6gqlfkLGlStQ", "review_id": "m1MhTeXNgJFXtOA5KcMY2g", "text": "This is a great find, Large menu full of interesting options, helpful staff who can help you craft a vegetarian compatible dish if you don't see it on the menu. \n\nFor me this was my first venture in to authentic Korean food and I really liked it. fresh flavors that on the surface seem healthy. Food sizzling in pots, fresh cracked eggs a real adventure compared to generic Asian food. \\\n\nThere are many tables and service is decent but it takes time for the hot pot to get hot so keep that in mind when odering.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2015-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ORw9B3t2WJ6G-54r59wQ-g", "review_id": "dTFF5kfbkZzGZeSqtsXjVA", "text": "Absolutely the best Korean food in the valley,  never had a bad meal here and this is our 10 th visit!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2015-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "co9K8_dsVR32I9XaUel28w", "review_id": "5urPHgCC7q3PUMMoxsLYfg", "text": "A very great place to eat Korean food! Definitely come during lunch hours for cheaper price. Food is on point and very flavorful! Will definitely come again!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2015-04-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "vJtRBCcYEToVq6r6SWng3w", "review_id": "xElnJccO8zHIwpy4TZZP8w", "text": "The food was ok but the service was not. The waitresses did not smile or whatsoever. Never refilled our drinks. Only came by once and asked \"everything good?\" .. Probably will not drive from school to just come to eat here agin.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2015-04-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "munckAXPtNZ7FvwUa6DslQ", "review_id": "aDIW_0Xci2SB-cdAFzg7AA", "text": "I really love korean food. I ordered a bunch of things last night. I had ordered a vegetarian soon tofu soup with everything in it (seaweed, mushrooms, and kimchee) and eveything else ordered was shared with my friend except the soup. Although my friend tasted the soup and thought it diddint taste fresh. Towards the end of dinner, around 9:15, I began to feel suddenly ill. I went to the bathroom and threw up violently and painfully. :( Went out, and went back to throw up. Struggled to walk out of there, I threw up multiple times on the way home. By midnight I was hyperventilating, in extreme pain everywhere, and could not walk. I called my friend who was just with me to take me to the emergency room. I considered calling an ambulence. :( I truly felt like I was going to die.\n\nMy friend found me on bathroom floor. Rushed me to hospital. In the hospital, I blacked out a few times, saw the light, as they rushed to attend to me. I couldn't talk, walk, or function. I had severe food poisoning.  I had chills, sweats, shakes, and feeling hot and cold. Absolute worst feeling in the world. They immediately gave me fluids, nausea meds, and morphine for pain. I was there untill 3:30. My feeling is that soup was bad. It diddnt taste right to begin with, nor did it look right. Also, considering it was a veggie broth, I wonder if because it may be something the Asians there NEVER order (perhaps), they probably had a batch that went wrong, or... maybe something else in the soup wasint right. Lastly, the soup is usually super boiling hot. I felt like it wasint, cause my egg diddint cook right away as usual. Maybe it was the egg from samonila poisening. I'm going to talk to the manager, I want a full refund.\n\nThis has been the most traumatic health issue I've ever felt, and certainly the worst case of food poisoning I have ever had. :(\n\nUpdate: Sean the owner helped to get me a full refund. And I expressed that I would like to give this place another chance without getting sick. He also gave me a gift card for future use. Thank you Sean.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 1, "date": "2015-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4kMWD1PfISI9qmPBXQYMqQ", "review_id": "JFZ7ulG6lNRazYdzsgXq_Q", "text": "Nestled in Mesa, Hodori was a great find for solid Korean food! My friends and I ordered the Bulkogi(Korean BBQ), Tonkatsu, and Dumplings! Man were we amazed the sauce lathered on the pork Tonkatsu was delicious with the egg salad and cole slaw! The pork was breaded to perfection and served like a fancy restaurant style etiquette! The dumplings were great in soup with the yummy rice cakes which were moist and chewy, a pleasant delight! The main attraction the Bulkogi was great with the rice and Kimchi/other side dishes served! Also, the server was delightful and so attentive and caring. My friend had dropped his chopstick and the waiter noticed and brought him a new set in seconds! Great location too near Asiana Market, Chinese food nearby and other Asian food eateries in the vicinity. Glad I found this treasure in Mesa, due to the lack of many quality Asian restaurants! I will definitely be back and plan to further taste the other awesome choices on the menu!\n\nService 5/5\n\nFood 5/5\n\nCourteousness 5/5\n\nWaiting time 5/5\n\nAmbiance 5/5", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2015-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FTvZGB2L71P_OiIP7fbjsg", "review_id": "bT-N3OLPmTfw6G9HYpjLxw", "text": "Awesome food. But 4 stars because I asked for extra meat in my dish and I got extra rice instead.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2015-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8T0evnkvRaTomru7ghPGeg", "review_id": "_h7KLkZSSymhr8O4oBWtug", "text": "Ordered the pork bulgogi and beef bulgogi soup.  Both were good and both came out hotter than hades.  Sides were ok.  Restaurant was relatively busy but food came out reasonably fast for the number of people there.\n\nOverall a little happier with the Korean food here than at other locations in the Chandler/Mesa area.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2015-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "EXBOkXWPNYZk5HFBg5NbTQ", "review_id": "XXgh6a1e1l8naMNpx9-Ibg", "text": "I feel the need to review this restaurant to offset the low score by the only other reviewer.\n\nI've been here a few times, and I've always had great service. One of those times, I sat at the bar with my boyfriend, and the sushi chef chatted with us. He was really chill & polite, so I'm surprised by Bret's comment -- perhaps it was a different chef?\n\nThe food is good, and I like their menu a lot. They have a variety of ingredients in their rolls beyond the standard California roll-type options. One of my favorites is the salmon & mango roll. It always tastes really fresh and tangy delicious.\n\nEvery time I've been there, I've been offered dessert on the house. I usually turn it down, as I'm too full of sushi, but one time I accepted and was presented with a cute little dish of green tea ice cream. It was better than green tea ice cream that I've had elsewhere. They have mochi too, I believe (yay!).\n\nI also really appreciate the fact that they don't blare hip hop music (as is typical of some sushi bars, especially in the Tempe area).\n\nOverall, I have no complaints! This sushi restaurant is totally worth giving a try.", "business_id": "QQvzErQ8Ijdy3SyEmYVG7Q", "stars": 5, "date": "2009-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "KyV17r3L-Df4SVpfY14HzQ", "review_id": "a8McH5bAKJoM6_6YkWMZBw", "text": "Not sure why this place is getting such low reviews. This place is very good, not the best but very good. The service is always good, and the quality and cut of the fish is great. I go there very often for lunch with coworkers, dinner with my girlfriend and have even gone in large groups. \n\nThe Sushi Chef is always telling jokes and interacting with us and the owner or manager makes sure we are taken care of.\n\nThe only problem is the cost, it can be a little over priced, but still better than other places around.", "business_id": "QQvzErQ8Ijdy3SyEmYVG7Q", "stars": 4, "date": "2011-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j2ZpCgf6DA_8FTgooQu5kw", "review_id": "96y897fxw8_NdT20GtNwHw", "text": "I have been to this spot several times and service is usually good and the food is always yummy. The manager is so kind, she makes sure everyone is token care of. The wait staff includes young ladies that will get better over time. The price can be a little high, but so are most sushi places.", "business_id": "QQvzErQ8Ijdy3SyEmYVG7Q", "stars": 4, "date": "2011-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "fUs5XxOR82Hfrnyl4wi2QQ", "review_id": "juxW3ne0S9KbQuwbuKbSNg", "text": "Has this place closed?  Went looking for it yesterday and I did not find it.  Anyone know?", "business_id": "QQvzErQ8Ijdy3SyEmYVG7Q", "stars": 1, "date": "2013-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 3}, "user_id": "fczQCSmaWF78toLEmb0Zsw", "review_id": "LJ0HpXXc3Kr0IAeAPswFRg", "text": "A fast casual Chinese concept that seems a little less chain-ish than Pei Wei... My friend Allyson B introduced me to this place.  I love that it's around the corner from the dog park - it's perfect because I can take Minnie to the dog park to play and call my order in as I'm leaving and it's usually ready when i arrive.\n\nI've been a handful of times and always done take-out.  It's really not the type of place you want to stay and hang out.  There is no atmosphere and it's located in a strip-mall.  Since the tag line is \"A Healthy Food Bistro,\" I feel like it's healthier for me than other Chinese in the valley... but I think that's just in my head!  Still, I tell them 'light oil' whenever I order.  I feel less guilty that way!\n\nUnfortunately, I'm not a big fan of the protein options.  First time around, I ordered shrimp with veggies - the shrimp did not taste fresh so I picked around it and ate the veggies and brown rice.  I went with chicken the next few times, and when I saw that they have eggplant (my fave) on the menu, I started requesting a combo of eggplant, mixed veggies, and chicken. Still, the chicken tastes almost processed - Once again, I eat the veggies and rice.  Maybe the key is to order beef or tofu... I'll keep trying until I get it right, or maybe I'll just have to find an alternative.  \n\nEither way, China Lite gets 3 stars from me.  If you go, get the eggplant - that's the only item I can really recommend!", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 3, "date": "2008-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "2KNPtV5E44vAiEr5BvMkUA", "review_id": "Fu6fK0hZCtLl4_UkHVO-Xw", "text": "Delicious! I went here today with my friend because we were looking for something light for lunch. We decided to try China Lite because she heard that they offer quite a few healthy choices on the menu. Not only was the service friendly and prompt, the food was yummy! I will definitely be going back, today I had the Mongolian chicken, but that is just because I didn't see the spicy eggplant dish. My friend had the Thai chicken and said she enjoyed it very much.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 4, "date": "2010-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uq1y9VRH9vOy91x8f4TQSg", "review_id": "669rUv8wMXy-RWNKZOGuew", "text": "This place was recommended to me so I decided to try it out. BIG mistake. I tried their Jampong soup and it was the WORST Jampong and worst soup I have ever had. The noodles weren't fresh...infact they tasted like they had been frozen for 5yrs too long. Extremely mushy and not edible. The soup was bland and was not proper Jampong soup. I think they mixed a couple sauces together with water and called it Jampong. The seafood and beef were dismal and the shrimp that was in the soup wasn't cleaned properly. Please do us all a favor and take this so called Jampong soup off your menu.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 1, "date": "2012-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "SU74tBtwUJR_19r2c7532Q", "review_id": "BQsU8vcrZX1HYmme6mBDzg", "text": "Good quick Chinese food place with healthy options. They do the basic meals as you would expect from a local Chinese restaurant. It doesn't have a nice interior, but it's good enough for a quick lunch or dinner. It's about as good as you can get for takeout Chinese food type places, and the healthy options are really convenient.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 3, "date": "2013-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "twZoTvWG92ntMVfEvbCnIg", "review_id": "hLLopktF4epk-sBp1zdsoA", "text": "This place has been updated and seems a bit smaller and make sure you call in an order ahead of time because they are BUSY during lunch.  For good reason though, this place is amazing.  Affordable and consistently good quality food makes this place choice for lunch or dinner.  If you like traditional americanized chinese dishes, orange chicken or beef and mongolian beef are a wonderful choice.  The fried rice is incredible.  However, if you are looking for something more exotic I cannot recommend enough that you try the curry laksa.  It is delicious.  I am so glad this place exists.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 5, "date": "2014-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "paA8omEt1hzVLNQoto4R6Q", "review_id": "AJt2WORivQpCnYcAKVAtoA", "text": "Went in today, excited by the items listed on a special board outside.  And the food I saw go out looked and smelled very appealing.  Waited for a few minutes, standing there awkwardly, finally was told to grab a seat.  After a few minutes the sole harried looking waitress asked if I needed a menu.  I said yes, and asked for water in response to her question as to what I'd like to drink.  Never got that water by the way.  Several other people came in after me, until each table was full.  I kept trying to catch her eye to place my order, even waving my hand and saying excuse me at one point, but it was like I was invisible.  After watching her take orders from multiple parties who entered after me, I gave up and left.  As I said, the food looked and smelled good, hence two stars instead of one, but that didn't fill my empty stomach!  They obviously need more than one server (I witnessed three people tired of waiting get up and go to the counter for chili sauces and chopsticks), but that doesn't explain why she took orders from people who entered after me, while completely ignoring me.  It's a shame, I really did want to give it a try.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 2, "date": "2014-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3ppKm3MFs6XXLgYefHo2_A", "review_id": "VgvzvmL2PcXX0XsvXrtafg", "text": "My husband and I picked-up take-out from here last night for ourselves and my in-laws. We had the Cashew Chicken, Mongolian Beef (one plain order/one spicy) and Lite Chicken. We served it family style and everyone was delighted. It was all delicious!!! Great flavor, pricing and portion size. A healthier take on the traditional; we will absolutely be going back!", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 5, "date": "2014-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QFj64b_eNwQaeJTvgkcvQA", "review_id": "ITbWq_VMUW3w9EO1M7iCoA", "text": "I've come here a few times for lunch during the week and I really like it. It's quick, tasty and inexpensive. I really like that they don't use a lot of salt and most of the food is pretty \"lite.\" The Mongolian beef is probably my favorite but I've had a couple of other things on the menu. The fried rice is a little bland but truthfully I'm glad because then I can skip it and save the calories. I also like that the owners are pretty much always there and are very friendly. If you're in the area and need something quick this is a great little spot.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 4, "date": "2014-04-28", "type": "review"}
{"votes": {"funny": 2, "useful": 8, "cool": 5}, "user_id": "zTWH9b_ItSdLOK9ypeFOIw", "review_id": "ZpHQycfRTk8tZEPPuIPYxQ", "text": "In the Bay Area, I noticed a surge of Korean Tofu restaurants popping up.  And those that had been around for awhile, it appeared that they were getting a new surge of customers.  I was damn curious to see what the hype was all about and with a restaurant named \"Tofu Hut\", I figure it would satisfy my curiosity.  We actually passed another Korean restaurant first, a new one complete with the \"Grand Opening\" sign up.  I figure we'd try out \"Tofu Hut\" since it had been in Vegas for awhile and has lasted.  Usually, it's a sign that the business must be doing alright, right?  Wrong.\n\nSo, my first mistake was assuming that because it had been in Vegas for awhile, it would be decent.  The second mistake I made was not checking Yelp first to see if anyone had anything about this restaurant.  If I had done this first, I would have seen TWO 1 star reviews with no other good reviews to counteract the two.  If I had done this research first, you would not have seen me eating here.\n\nWalking in for an early Sunday evening dinner, our party of four chose the cooking table with the plan to cook some serious meat.  Instead, we ordered the Kimchee Beef Tofu Soup ($8.36), two orders of Short Ribs BBQ ($12.59 each), and a Kimchee Pot Stew ($8.95).  If you do want to do the table barbecue, it's a minimum two orders to do that.\n\nThey brought out a side salad for each person to start and then five banchan (side dishes) to share.  And yes, I said five.  I thought this was a joke - April Fools' Day, haha kind of joke.  No.  I know at some Korean restaurants they give out more banchan to the Koreans, so we even asked for more and they said that's all they had. I thought we were being gypped and looked over at the neighboring table of six Koreans to see if they got more than we did.  No, they did not.  Tofu Hut only gives out five banchan!  Blah!  They were this coleslaw concoction that I have never seen before, cabbage kimchee, fishcake, bean sprouts, and cucumbers.  I'm used to getting 5-10 banchans, you can imagine my shock and disappointment!\n\nWhen the tofu soup and pot stew arrived, the waitress asked if she wanted her to crack a fresh egg in there.  Sure!  As she passed over my hot tofu soup, she knocked over the BF's water glass.  No big deal, she apologized and cleaned it up.  (I was just glad she didn't drop the hot soup too!)  I had my tofu \"spicy\" and it was more mild.  There wasn't much taste going on here and I was less than impressed.  I did like the hot stone burnt rice that comes out with my tofu soup though.  My friend's pot stew was more soup-like than she cared for as well.  The only thing really good was the Short Ribs.  We ended up ordering another plate because it was pretty good.  Everything else fell below par.  \n\nTo close out our meal, the check came.  We asked if they had shikhye, which is a this cold beverage that is usually served at the end of the meal.  It's refreshing after a greasy meal and I'm used to getting this automatically after our meal concludes at Korean restaurants.  They told us they did not have this.  Oh my goodness.  Five banchans and no shikhye?!  \n\nFinal bill: $70 including tip and tax.\n\nThis restaurant is sparse.  Lots of Koreans eating here, but perhaps I just have higher expectations and Tofu Hut doesn't cut it.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2007-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Gswhjfxr-3rvx5yquzLaWw", "review_id": "p91WmPO3LJnF1xdEfDytew", "text": "I gave this place 5 stars because of their constant improvement against all the new Korean BBQ restaurants opening in Vegas. When this place first started, the menu was based very consistently around tofu dishes but now, they are more on the BBQ edge.\nI went there about 1 week ago and the galbi was marinated nicely, the taegi bulgogi was very fresh, good portions, and 10 dishes of panchan, very fresh lettuce, and the service was incredible. It was very reasonably priced as well. I'm definitely coming back as always.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2008-03-03", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 3}, "user_id": "Z0_mIPI_WUAoOgH1Csk2cQ", "review_id": "teI3ezFaeXbHf_zIXhnwsQ", "text": "I'm not sure what all the negative reviews are about.  My crew and I stormed in here and carried out and loved every bite of our food.  It was spicy, hearty and decently priced.  Just what we needed to tie us over in our alcohol drenched evening.\n\nI guess the name is a bit of a misnomer.  I don't really think you're supposed to come here and enjoy their \"tofu mastery\" (isn't there another \"tofu\" place right across the street?).  From what was relayed to me by a local, this is the place to come for Korean \"street\" food like ddukbokki (spicy rice cakes) and odeng (fish cake soup).\n\nThis place loves jalapenos like Ricky loves Lucy.  We found traces of it on the ddukbokki, the marinated pork and the chicken wings.  We even expected to find some in the fish cake soup but no such luck.  No one is perfect, after all.\n\n+1 for being relatively close to the strip.\n\nThe crew and I will definitely mark this for another go the next time we're in town.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2008-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4HZ2NWZvtJA8A0kv8bmHew", "review_id": "ro7ToGEVhIbJQ8LoMu3Afg", "text": "Wow, such bad reviews for this place?  I ate here a few times with my gf and everything seemed fine.  Their tap water was actually palatable considering it's Vegas.  They must filter it or something.  I guess I won't be back if those health violations posted by BK are true.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2008-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MOQCD2EBU9YVyt0anea4UQ", "review_id": "Ghpc6i90Vv9ocaCc8yP87g", "text": "$12 for All You Can Eat Korean BBQ from 11pm-5am. What more can i say, what more can you ask for?! Great service even at 4am in the morning when I went, the sides were fresh and the meats were tasty. -1 star for no Galbee, but at this price, who can complain?!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2009-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qMzgx126DViYqlV28xwy-A", "review_id": "tZQmXD_1AjYtq03ryYo0_Q", "text": "I love their soups espcially the beef, and for $8.00 with a lot of sides that comes with it you can't beat it....I go at least 1 a month.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2009-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6jSwhwLGUH00ZTM7t9tRKA", "review_id": "VcjRYbluGOgHiVBNk7fdYA", "text": "I come here strictly for the Tofu Soup. Its bbq is decent and its bibimbap is pretty good (not rocket science) , but if I'm headed to Tofu Hut, I am getting Tofu Soup.\n\nService isn't stellar, but it is what it is.  On a good note, they usually offer quite an array of side dishes. You just have to be assertive if you want more.....of anything really.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2009-03-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "0-VwUaC7R2vKE7A9n154zw", "review_id": "C5akceKncPzD0ageiV6uJA", "text": "ALL YOU CAN EAT KOREAN BBQ. yum!\n\nThe cheapest all you can eat korean bbq that I've been too (13.99) and preeeeetty good. Although they did raise the price (use to be 11.99) Starts after 11 PM so its perfect for a late night snack. They let you pick from a variety of meat (except for kalbi that cost 16.99) and they give plenty of side dishes. I looooooove coming here.. pork belly and brisket... mmmmmmmm...", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2009-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4h4XKgZ1lP3iv1fVST2vZw", "review_id": "dgaZHNsNhTjjR1V2YZ4vdw", "text": "I think I went there at the wrong time.  They didn't take our order until 15 minutes later when we asked for it, the lady who served us seemed so nervous and careless.  She didn't know where to sit us, she dropped a cup of water and put the rolling trash can right in front on my face.  She might be a hostess and forced to wait because they seemed very busy even though there were not that many people in the restaurant.  Side orders were good but the bulgogi and galbi were not that great.  Price is good though, cheap.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2009-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wlrF43CZM6ZygKUmGltyTQ", "review_id": "kHcC2IwtoRrfLVcjJBb7Cg", "text": "This place is great.  I have a group of friends, several of whom are Korean-born and raised in Korea.  They do frequent this place, and I love it, especially when I have a cold, etc.  I will say this is NOT 'typical' Americanized Asian food.  It's KOREAN food.  Service is very good, and I think prices are quite fair.  They do serve a lot of \"extras\" with their food.  I will say that I am sort of a foodie and am picky, but their food is GREAT.  I definitely recommend this.  Oh-lived in LV for 5 years.  I recommend one of their \"hot pots\".  You'll get out of there for 10 or less per person.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2009-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jmK-F4c9x2tIzOTEwrdZ7g", "review_id": "wTUDjL5kDcl6oN6Xmu7PFw", "text": "All you can eat for $16.99 including bean soup and steamed egg, good bargain for Las Vegas. Place is kinda dirty, and service is poor depending on who is waitering. \nLike many asian places, this place also recycles food, so if you have untouched side dishes, rest assure, it won't be wasted here, it will\nbe served to someone else!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2009-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tpRwDEZVNUtLBk17OSJDUA", "review_id": "cTsXyLP9NoeosD_-i9ShQw", "text": "I wanted to take a friend of mine to experience some Korean BBQ (my fav!) We just got out of a show and my first choice for AYCE was closed so of course I pulled out my phone with my yelp app. The meat that they pulled out was not very fresh the calamari looked just plain weird and the meat was so fatty that when it finished cooking it was like bacon. The waiter took FOREVER to bring the check. Only reason they got a second star is because they were open late. Only reason I would go back is after a really late night with nothing open and I need a fix of Korean food.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2010-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "vex6uMiU7oGflro3ti4W6g", "review_id": "2caWwKxfjUUHoRD4wCAP7w", "text": "When I want a delicious, fulfilling and cheap meal, I alway come here. The only thing I always get is the seafood tofu soup. It cost 8.95 for hearty portion along with 7-8 other side dishes. They even refill it when you're done with one of the dish. \n\nNow do I call that a deal or what? :)", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2010-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "XWtoW-j52ld7Kl7hBwhxIA", "review_id": "k0I1nFyKKCOBCMsEuTeApw", "text": "I love this place . Open 24 hours a day and all you can eat ! mmm", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2010-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "jsxUKAocdHlBbA-V2moZAw", "review_id": "6d-gzDxGmB5WQYK474yaEg", "text": "I am a frequent customer of this place.  My favorite dish is one of the free complementary dishes; chapchae or however you spell it.  The tofu bowl size is a bit small bit but still fills me up.\n\nThe spicy BBQ chicken is my other favorite, a bit sweet but so good..\n\nThe price tag is about $10+ per person, or you can order a lunch combo and share with a friend for $14.\n\nThe service can be good, depends on who your waitress or waiter is.\nOverall, I give it two thumbs up.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2010-05-01", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "mBApNPdqoirj5WkHEaIpOg", "review_id": "RxpSXgQg2FxUuSoOeqTUhA", "text": "Stopped by an old favorite last night: Tofu Hut on Spring Mountain (just east of Harbor Palace on other side). I was craving for some hot tofy soup with seafood, but noticed a huge sign in the window advertising their all you can eat bbq for $16.99. The wife and I had to have it! We'd been craving for korean bbq, but never got around to it. \nWell, we were impressed! The amount of food provided was great. We like to share and we ordered half portions of about everything: bulgogi (deliciously marinated), marinated pork belly (like bacon but better), beef tongue (tin slices of beef carpacio), squid (bit too chewy for me), rib eye and short ribs. All this came with rice, a huge bowl of a very tasty salad en the usual assortment of kimchee and other interesting stuff. It all tasted great and goes well with a big bottle of Hite beer. Why does korean bbq go so well with beer? \nForgot to mention they also offer steamed egg and tofu soup (one serving only).\nAnd my check came to $44 for both! Areyou kidding me, this is the best value in town. Love this place. Ate soo muich meat, I am now awake at 3am... need to eat more meat more regurarly and get used to it again...", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2010-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "r5QPTFb8FFHQkZPumA9FaA", "review_id": "sYBoasaEJWdMs7l3zaCb9A", "text": "This place's best deal would have to be their all you can eat buffet. They have one for dinner after 11 pm, and one for lunch. $16.99 or $13.99 is way cheaper price than some other korean places. I wouldn't recommend the squid because it came as a whole piece and not flavored. You should get the beef flank or marinated beef - those are pretty good. comes with salad bowl. I got the seafood beef tofu soup - not that great. I had it extra-spciy. Basically mean they add more red pepper, but not spicy. And the soup had like clam shell pieces, so I get this random \"crunch\" sound when I bite. Their appetizers are probably one of the best, if not the best I have in vegas. seaweed, fish/tofu strip, soybean sprouts, kimchi, cucumber, onion pancake (best), clear noodle.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2010-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8VgygrqFSInjKdDQ3tLKFw", "review_id": "JXtKF147qSV50_1ORRfduA", "text": "Eating at Tofu Hut is the most unpleasant experience I had. The server who happens to be the manager is so rude and arrogant. Asking for a fork and a dinner plate to be able to eat well was so difficult . She has no manners to run a business like this. Would never recommend a place which is not so inviting like the people who serve. They are not the only \"eat all you can korean barbecue\" in town. There are so many in Spring Mountain a lot better. Remember their place was already shut down for cleanliness. Stay away from it if you want a happy meal.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2011-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bddW9P6WE4y1PQyaya5VxA", "review_id": "FHpqsvc8bZHAu1IT0Ea7fg", "text": "Service is lacking sometimes.  If it's busy, you can forget about them coming around as much.  \n\nThe entrance and along the walls is very dingy.  Don't stare too hard, you may not want to eat your food.  \n\nThey serve can sodas.  WTH? We usually get the AYCE bbq for $16.99.  The kalbi is not what it used to be.  Where's the short ribs?  They now serve it boneless, I think the short rib style is more tender.  Pork belly has a weird taste to it.  Hubby likes the chicken.  Good banchans, they used to have potato salad that was oh so good.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2011-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "9M6sVYXlOvwCEE8c8pAWzQ", "review_id": "y4UJTj6DKN1-CybsI-umYQ", "text": "This is a pretty good place to eat at and comes with tons of food!  So make sure you come hungry!  My g/f and I love this place! Everything you cook in the grill and can order anywhere from sliced rib-eye to cow's tongue :)  The appetizer is one the of best parts as it comes in 6 little different dishes to try and comes w/ a big bowl of SALAD (which is pretty good and different) It's decently priced $16.99 during the day and $13.99 after 11 p.m.  So if your craving some korean BBQ...this is a pretty good place to start off at!  Only problem is tho is they usually only have 1 server so it's kinda slow....so be patient!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "38JK-SfO9NkAGs1RwlH2Gw", "review_id": "AyMJyaob2kxC7edSeUeAXg", "text": "At this visit we shared orders of tender beef and shrimp along with a bountiful salad and 6 banchans.  Pak, our server, was particularly informative so we learned a little more about this cuisine than during our last visit", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "sjWs238GgI2ajrtSteRI4w", "review_id": "auh1nzarqXdYHHVylOwlhw", "text": "LOVE veggie tofu soup. I always order the spicy ones. The price is reasonable.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7OX9wtjVlP2LukWA0wXRVg", "review_id": "C3sZvfO49V9-Y6Cx0rP98A", "text": "This place was my first experience with Korean BBQ. Loved it!!\n\nMy husband really wanted to eat Korean BBQ, but I was hesitant since I never had it before. After reading reviews on Yelp, he decided this was the place to try. The place is small, but it's not too busy in the early evening so waiting isn't an issue. We went at 5pm and at one point we were the only people in the restaurant. It got busy around 6pm. \n\nThe food was good; loved the sliced rib eye, but my favorite out of everything was the salad!! OmGosh! The dressing is to die for, I put a little rice in the salad which made it that much more delicious. \n\nThe service is sloooooooooooooowwwwwww. There are only one or two servers for the entire restaurant, but since the place is small and isn't too busy before 6pm, you should get okay service. But at busy dinner time, I'm sure it's hard to get your needs taken care of.... that's just the vibe I got from that place.  \n\nOverall experience was good and the food is delicious. \nI will go back!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Hv_1sn6R3hqOesDiJ0IS_Q", "review_id": "yzas-vubRyN7ACiNEVI25w", "text": "Korean bbq is so good and I was excited to try this place with all the good reviews. The restaurant is pretty small and grills are at each table. \n\nThe staff wasn't very excited to help my friends and I. It was a quiet night and they could have been a little more excited to have people. They never came to refill our drinks, refill our meat, or our sides. All you can eat- yeah right! :(\n\nThe staff also sat up by the very loud TV the whole time and ignored pretty much any one who didn't need to be seated. They also took 20 min to give us the check. They asked the table next to us to \"hurry up, people need their table,\" which was pretty rude! The bathrooms were a disaster which makes me wonder what the kitchen/fridge looks like..\n\nI have the feeling had I been Korean the service would have been a bit better...Even my Korean friends agree the service is bad! Major disappointment!! \n\n*Try some place clean where people actually want your business!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2012-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IJJ1nCtBQVujChSKlg_QhA", "review_id": "Qpnuv0Fy7U2WshMLg3DMdQ", "text": "I came here with my fiance and another couple.  We wanted to eat at Mr. Tofu, but they are closed on Sundays.  My fiance used to come to Tofu Hut a lot before discovering Mr. Tofu.  Since I have limited experience with Korean restaurants, I will be comparing Tofu Hut with Mr. Tofu, which is directly across the street.  The parking in both places could be better.  Tofu Hut has more seating and was busier.  Some tables at Tofu Hut had grills built into the tables.  As you may know, each meal comes with some complimentary sides.  The sides at Tofu Hut are better.  I like the fish cakes.  Also, they gave us slices of bread made from rice that was pretty good.  I always order the same thing, bibimbap dolcet.  They are equally good at both places.  Tofu Hut gives you a large bottle of spicy bean paste.  Mr. Tofu provides a small portion.  The rice never got crunchy, which is my favorite part.  I guess the hot pot cooled down too much before they could add the ingredients.  Perhaps an oversight because they were so busy.  A careless mistake in my opinion.  That is the best part of the dish.  At Tofu Hut, bibimbap dolcet also comes with spicy tofu soup made with spicy bean paste.  That was the best part.  Really good and hot.  They add one raw egg.  I love dipping the fish cake in the spicy soup.  I think the price is similar.  My fiance got her usual, which is tofu soup.  It was not very good.  Our friends ordered galbi, bulgogi, and some sort of spicy chicken dish.  The galbi was very good.  The bulgogi was disappointing.  The other chicken dish was really good.  Overall, I liked Tofu Hut better, but I doubt my fiance will agree, so you will probably see me back at Mr. Tofu.  Both are good.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-03-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZU6ochQHevzKffyTZ-1amw", "review_id": "JdP95QAoZMyhS9hiJDXgXQ", "text": "So my mission for an AYCE Korean barbecue restaurant in Las Vegas has finally come to an end! Last night I started feeling a grumble in my tummy and I knew that I was hungry. I wanted to try a new restaurant but wasn't too sure where I could go at 10 pm on a Thursday night. I needed both a place  that could fill my food standards and my hunger. I had heard a lot about Tofu Hut so decided to give it a try.\n\nOnce arriving at the restaurant, the server was very prompt in seating us and taking our order. The Banchan came out just a few moments after. Most were different from the other Korean Barbecue restaurants I have been to, but they were all very tasty. My favorite of the dishes was the Oi Sobeagi, also known as cucumber kimchi. It had the right amount of spicy and wasn't too overwhelming like others I have had before. \n\nThe meat was all very flavorful and delicious. We ate the brisket and marinated beef mostly. For all you Samgyeopsal (pork belly) lovers out there, I recommend ordering it marinated. It adds a little more flavor to the pork belly making it even more delicious. \n\nMy only complaint is that they did not have the usual dipping sauce that is served at most Korean Barbeque places. The sauce the did have was unique, but not my favorite.\n\nRecommendation: They have a special there from 10 pm - 2 am where you can get AYCE for $13.99, instead of the usual $16.99! I recommend going around that time to save a few dollars.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "H6N5CXJkCXmRS1vD4jU0Vw", "review_id": "RM3K7n_QdpQyaSJytvZX-w", "text": "I want to give this place 3 1/2 star.\nCompare to Mr. Tofu, I would come here instead. I ordered Kimchi Beef Tofu and I thought it tasted a little better. The guys that was working here were a little overwhelmed by all the business, but they managed to come over and check on us. I thought the service was way better than the other place.\n\nI would come back here again, for sure.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2012-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "VsGlXCCjzsKyuel6Gpu-7A", "review_id": "DLzm55Yb5sY7k6jlVmFyFA", "text": "I'm going to fess up and admit I know nothing about Korean food.  I had only been to one other Korean restaurant prior to this, and it wasn't good.  But now that I am vegetarian, I am always afraid to go to a different place in fear that little fishies might be lurking in what I eat.  Well, after getting a coupon for Tofu Hut I decided to finally make a go of it and try some Korean food again.\n\nWe went in on a Friday night and the place was dead with only a couple of white 20-somethings sitting at the tables.  I guess that wasn't a good sign.\n\nUnlike most reviewers, I actually had a really great server.  He pointed out everything that was vegetarian or could be made vegetarian (2 tofu soups and 2 entrees) and even brought out the bottle of sauce they use on some of the dishes so I could look at the label (bonito- not vegetarian).  He was very friendly and was never annoyed with our questions.  He was also attentive and kept our water glasses full.\n\nThey started us out with a salad.  Not much to it- just some iceberg lettuce and dressing- but it was actually pretty tasty.  We ordered the bibimbap and buckwheat noodles, both without meat (of course).  The bibimbap came with an order of tofu soup which was a nice little surprise.\n\nThe tofu soup was really flavorful and my favorite part of the meal.  They were even nice enough to ask if they could crack the egg in it before they did so, knowing I was a vegetarian.  I was expecting good things from everything else, but sadly it just got progressively worse.  \n\nThe banchan were boring.  The kimchi and bean sprouts were iffy on their fish content, the pickled seaweed was ok but had little flavor, and the potato pancakes tasted like absolutely nothing.  The bibimbap was ok but lacking flavor and depth.  This could, of course, be my fault for my dietary restrictions but I don't think it should be that hard to season some rice and veggies.  The buckwheat noodles were just some cold noodles drowning in a salty liquid and covered with some iceberg lettuce.  Meh.\n\nIt makes me sad since I had such a helpful server, but he really couldn't save this meal.  Perhaps it's just me and my under-developed Korean food palate?  I really hope not. \n\nIt appears as though everyone comes here for the barbeque, so maybe you're better off ordering that.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2012-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oLd1pdp0Ic9HlTTCUW0Y2w", "review_id": "iuN1MhpkeX8bkZOCoOAzyw", "text": "I dig the vegetable tofu soup. Everytime I have been here, I asked for spicy. The soup looks spicy, but has no spice. It still has a great flavor. The egg dropped into the soup is a nice touch. I took my friends to eat the all you can eat barbeque and they got sick the next day. I don't know if they cooked the meat wrong or what, but that's reason for a drop down on the star rating. Side dishes are pretty decent too.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2012-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "M1Q8IL1Qmfat5rG-_o1NCw", "review_id": "NmFAyDnovLzCG5JF1tyLAg", "text": "Came in with a few friends for a little late night dining.  It was my first time and I've heard quite a bit about this place and it didn't disappoint.  The prices blew my mind, I didn't know it was that inexpensive.    \n\nWhat impresses me the most are the condiments.  The kimchee and other vegetables are really fresh and go well with the good meats.  The meats were seasoned well and when eaten with the condiments, can't be beat.  Will definitely come back.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oYwviLQG8CUmhRbjD8X-gA", "review_id": "nI64BNynyoKgwNHrSuC2eA", "text": "Best Korean I've had yet in Vegas. The Dumpling Tofu soup was divine. I asked for spicy and got it! The food arrived sizzling to the table. I love every single side they give complimentary. You can really fill up for $10. a person. The Short Ribs were the bomb! The staff is wonderful. I love the ambiance and decor, everything, even the simple wooden chairs. There's two sides to Tofu Hut, the BBQ table and regular. The late hours are a plus! I will come back frequently, now that I know of this gem. I will bring friends. I'm gonna try the BBQ next time.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2012-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GKmYXOk37r0u550bZwSKCQ", "review_id": "agHGb1wJO_MBHRQf3qXACw", "text": "First time I've tried kbbq in Vegas. The sides were pretty good n they kept bringing these whenever we asked. The flavor of the meats were also good n there was hardly any fat on the brisket everytime. Now the part that really sucks...the lag on meat big time. We had to ask repeatedly and when I say repeatedly I mean at least 5 times before they brought out another plate of meat. One guy even pretended he couldn't hear me when he was walking past me as I was trying to ask for meat. For me if your not giving me my order then you're trying to rip me off. So if you like the sides at kbbq, then go but if you like a lot of meat skip this place because they're fuckin shiesty!!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2012-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8l_6XrBgg-xShr8a2-mEzg", "review_id": "hAoWHE8KcJanxOKl8JQgIw", "text": "Me and one of my best friends LOVE eating here to \"Chop it up\". We always get one of the tofu kimchi soups. I usually get the seafood one, and she normally gets the mushroom one. When it comes to ethnic foods, I am a big fan and I respect it So no racial but if you are not korean, or asian at that..please shut up about talkin shit about the food at Asian places lol. If you don't like it, just say you don't like it. But to say they don't know how to make it..SHUT THE HELL UP! lol. I love this place, but I'm half thai and I love salty foods and I guess Koreans aren't big on fish sauce. But i can't wait on my next trip to Tofu Hut :D The only reason I didn't give this place 5 stars is because they don't give you the yogurt drink at the end anymore, that I know of and they're not really friendly, but I still respect them..not everyone can act as \"white\" as you think they should lol.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8LgqyZTHzvD6yrl-JZTdtA", "review_id": "T1SJGQ7m9YLTsnNRVR0nEg", "text": "I was introduced to this place by a friend of mine and it is an all you can eat dine in restaurant but only on the left side. The prices range between $15-18 for the all you can eat. They do not have a menu on this side, they basically just have a list of the meats you can choose from and it is unlimited including the sides. I give the food four-stars, as the food is delicious. I love Korean food and sides! However, I need to give the service three-stars. \n\nThe first time I went there it was around 5pm, there was no line and we were seated fairly quickly. We had a lady serving us and she was nice but very hard to flag down. I enjoyed the food there especially the brisket and the sides. I was just not impressed by the service. \n\nThe second time we went there, we decided to go to dinner and we brought our friend with us. I made sure to arrive early to get us seats. The all you can eat side was pretty full so I stood by the sign that says, \"wait to be seated\". No one was behind me at the time so I did not mind waiting. However, another person arrived and spoke to one of the servers. He decided to seat them first which I'm sure would upset a few people. I spoke to him before he seated them and explained that I was clearly standing there first and he should not have sat them before me as I was waiting and was not with their party. My friends arrived soon after he seated that party of three I was not too happy about that. I had a good time otherwise, but I just feel that in order to get more people into the place, the service has to be just as good as the food. If you don't mind good food, but lousy service, you should try this place.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2012-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "6SUdWJu47ZhfAQZnvitgkA", "review_id": "klYa9gzCbcWPhw4rVHkIDw", "text": "Went here with some friends for the all you can eat dinner. Pretty cheap compare to other place and the food was good. We got seated as soon as there was a table available. We order our meats and our server was very attentive refilling our drinks and bring more meat as we ordered. Everything was great from the beginning. But beware of smelling like Korean food as you leave!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "PV5voYSD43Cn_3gHmxG7DA", "review_id": "XI34G-4BoVe-lxOeFzsdOg", "text": "As one of the late night options for Korean near work, Tofu Hut is not a shabby option. Is it my favorite for soon dubu? No, but their kalbi is rather delicious. A group of us came in to grab a bite after work. We did not feel like doing all you can eat, so we ordered off the menu.\n\nJapchae- glass noodles with beef and vegetables used too much soy sauce. Normally they are lightly colored by the dark sauce and has a complimentary taste of sesame oil, but this one was predominately soy sauce. I didn't eat more than a few bites of it.\n\nMixed beef and seafood soon dubu had plenty of seafood and beef pieces. The abundance of soft tofu made the dish enjoyable, but it lacked flavor. Same could be said about the mushroom pot.\n\nBulgogi- thinly sliced beef marinated in soy sauce and sugar sauce with vegetables. This dish was on the sweet side. Combined with the kimchi, it balanced out, but too much on it's own.\n\nKalbi- soy sauce based marinated beef short ribs. These are the best! It was so good, that we ordered another plate. The flavor was balanced and the meat was so tender. I could pull the meat right off the bone without much resistance. It definitely was the saving grace of the meal.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2013-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 3}, "user_id": "VUzGMSH9u1E3h4QxaIl6cw", "review_id": "B4JeYBwS6MQJI-TkoJpwoQ", "text": "Huge fan of Tofu Hut when it comes to AYCE Korean BBQ. The one downside to this place is  it's quite small. Only half the restaurant is dedicated to BBQ and the other half regular menu service. So with that in mind, on busy nights, there can be quite a wait, especially if you have a larger party.\n\nNow on to the good stuff. Everything here is awesome! I mean where can you go wrong with AYCE BBQ? There are plenty of sides and the staff is quite attentive. Personally I love to sit there, grill my meat and just mix it right in the salad bowl and go to town. Man do I miss this place. Because when it comes to Korean BBQ, fancy doesn't always mean good. \n\nTip: $13.99 all you can eat 2300-0500", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7yiAXjbxeHfrBypRm2PPjA", "review_id": "3rBv4cBxC23ZZ5RexLYO2g", "text": "First time here...as a vegetarian I didn't find a whole lot on the menu for me but ordered the bi bim bap meat & egg-less. it was 'ok'. The tofu soup in medium heat however was AWESOME.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2013-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "UvAFHdv34wR-B3ZXuS2_8A", "review_id": "nOGrDw5RE5cwWXOLv4uG7w", "text": "My boyfriend, my sister, and I came here on a whim and im glad we did because it was such a fun experience! We waited less than 5 minutes to get seated and we got a pretty nice view lol  I loved that they play kpop and not to mention that the meat was ABSOLUTELY INCREDIBLE!! My favorite was the marinated sirloin and the ribs. Everything from the kimchi to the potato pancake was delicious even though it was a bit pricey ( $65 for 3 people) it was definitely worth every penny!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2013-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oGrBhuLCk90LtS4bgG5LFQ", "review_id": "5SYD1N235p_8myjXz0ZQZw", "text": "A family friend introduced me to this place and boy do I love it! I always heard about people talking about eating Korean Bbq, what I didn't know was that it was All You Can Eat (AYCE) and that you cook it yourself! #Fun\nBesides the actual place being a bit run down the food and price makes up for it. I am Samoan and we come with an appetite, this is a perfect place for a food coma fix!\nBeen here a total of 3 different times and have tried 4 of the meats so far and have yet to be disappointed.\nI'm definately a repeat customer!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UDOe7JEQDTNMMaMO4X8zYQ", "review_id": "D0lqn18tsedgJRvE1WZ0JA", "text": "Been here a few times now. All but one visit was for the AYCE, grill it yourself korean BBQ. It's not a real fancy place and not too big, so yes, sometimes there can be a wait when it's busy. Last time, we had to pass on Tofu Hut since it was full and some people were still waiting. You will leave there smelling like a korean restaurant unless you avoid the grill, not to say that's a bad thing!(Most of the time)\nService for the most part is decent. Like some of the previous reviews noted the AYCE is $16.99. $12.99 after 10pm unless you want to order kalbi & steamed eggs I believe? A medley of korean side dishes and rice are served with your meal. Instead of the traditional green leaf lettuce to make wraps they have an unusual but tasty twist. A salad of shredded lettuce with a vinaigrette composed of soy sauce, sesame, chili flakes and probably a few other seasonings.\nThe only real knock for I is that they have no steak like a tri-tip found at some BBQs, but that's more a personal preference and tends to be usually a dinner option if it's available. I tend to favor spicy pork & steak when I frequent korean BBQs. Can't really vouch for their non-AYCE portion of the menu but overall it's a decent place to get your korean fix.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EIaKHq03bpi4yVYqM_usvA", "review_id": "h88sKihNgd3r26k8_54blg", "text": "I usually go to the other tofu place across the street, they were closed so i went to tofu hut to check it out. Its a fairly small place with a home like feel to it. My wife and i ordered the beef soondubu spicy and chilled soba  noodles. Lets start off with the banchan.  The banchan was extremely meh....nothing special what so ever. The tofu soup came out first....first of all it wasnt spicy at all, and the soup lacked flavor, pretty bland. About 10 minutes later we received our chilled sona noodle dish. The dish was covered in lettuce, and was overpowered with vinegar.  The dish wasn't very good at all. All in all a very mediocre meal. I was alittle disappointed that the name tofu hut suggests that they specialize in tofu. Yet their tofu soup was absolutely forgettable. I for one wont be returning", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2013-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sB6gny9xl3kQwc6wu694Ng", "review_id": "4VDlYKiEefsCKvc3dwLGkQ", "text": "We went to Tofu Hut because mr. Tofu is closed on sunday. A few tables were bbqing meat and we ordered one sun-tofu and one guk-su. The side dishes were all suck!! Jab-che was over seasoned with too much soysauce. Kimchi was too old and jun was all burned. One side of jun was all black and tasted nothing more than flour. Sun-tofu was not bad but not good either. We ordered spicy but it wasnt spicy at all. Guk-su was terrible. Too much vinegar was used.. i almost threw up while eating. Staff was not bad. They walj around with ice water and refill it everytime you ask. Overall i will never go back. I cant believe tofu hut became this horrible. It wasnt used to be this bad. I will rather wait until mr. Tofu opens on weekdays. Please do taste before serving dishes to customers!!!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2013-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "-TvchvJ_3T-crZzmh82OsQ", "review_id": "nO4bXtAiZ8hAljI1tGcxEw", "text": "The small dishes are a lot better comparing to all other Korean restaurants on Spring Mountains. The price is decent and the portion size is very generous. Other korean restaurants sometimes reluctant to give out seconds on the small dishes, Tofu Hut has no problem with that. Ther servers are nice and they always remember what I want!!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2013-05-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "A3Eyb1M2aQmfL8JYw_S_ig", "review_id": "z0rVxGcWjF25k9GE0SkLwQ", "text": "First visit was p,easing. Especially enjoyed the chicken and spare ribs.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2013-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "AlkZ6hhB9rcm504vjI1mNw", "review_id": "wIZfoRxxiDGFMKKaCDDupw", "text": "After visiting Sura so many times, we decided to give Tofu Hut a shot after a coworkers recommendation. In short, tofu is just the tip of the iceberg. This review is for the AYCE experience.\n\nAYCE is served differently here than most buffet style restaurants. Yes, it's all you can eat, however you place up to four orders of meat and they bring it out to you, which are actually perfectly portioned so you don't get charged for wasting items.\n\nFood wise, the food is fantastic. They bring you out six small appetizers to snack on while your meat arrived. We decided on the sliced ribeye, short ribs, beef tongue, brisket, and pork belly. All we satisfying. One of the things we wished we had was some kind of sauce (be it soy, tempura, teriyaki, anything) to dip our meat in. Granted, the natural flavors of the meats are great, however some of the meats other than the pre-marinated ones are lacking in seasoning. \n\nThe downside, the service is awful. We only seen our waitress twice, and that was to drop off our water, and present the check. We were never asked for any soft drinks, beer, etc, and we had to order from another server when we wanted refills on our drinks, and to order more meat. We just sat there wanting to eat more, and it was a good fifteen minutes before we grabbed the attention of a friendly male waiter. I know most traditional inspired Asian restaurants aren't known for their service, however if I'm giving you my money, I want to at least be acknowledged from time to time!\n\nDecent experience, food was great, kind of overshadowed by lacking service. Oh well. Still full!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2013-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7zBel_AGF4Ek_yN13CV7Cg", "review_id": "RabbUkxY8qSvQEBMVoU2rA", "text": "I love the tofu soups they taste amazing! It was little spicy for me.\n\nI give the food a 5 star \nService 1 star.\n\nBut the service is horrible.  They didn't fill our water and when we paid they were surprised we paid with a large bill.\n\nI'll go back but only to the sister store Don.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2014-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XDjidpP8Jgf6Yy41HuVO6w", "review_id": "TSxqlbR_wcUzL-DKc400dg", "text": "My first time here.. And definitely my last! While the food was okay, the cleanliness level definitely turned me off from ever returning. \n\nI came here with my fiancé and 10 month old son on a Monday afternoon. When we arrived we had to wait just a couple of minutes for them to \"clean\" off a table. When we got to our table, we noticed that it was still dirty! Still had condensation rings from cups, and still greasy and sticky on multiple parts of the table. We ended up cleaning it ourselves with baby wipes. \n\nWe needed a high chair for my son - and oh how I wish I had a high chair cover for what was provided for us. Their high chair was the nastiest high chair I have ever seen. There were lots of dried up food, and it was sticky all over! I tried to clean it with baby wipes - but there was only so much I could do. I doubt they have ever cleaned that high chair. It was so disgusting and nasty.\n\nWe were seated against one of the windows and you could just see the amount of dust and dirt on the window sill. The floors were also super greasy.. You could literally slide around on their floors. And I just loved getting my banchan served on a filthy tray that had pieces of raw meat and rice on it. Would it kill them to wipe down their serving trays?\n\nNormally we wouldn't stay in a place like this after all the red flags. But we had an appointment to get to and didn't have time to go somewhere else.\n\nWe ended up ordering the marinated ribeye, short ribs, beef tongue, beef brisket and pork belly. They were all pretty standard as far as Korean BBQ places go. \n\nStandard Korean BBQ in a filthy restaurant. No thank you.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2014-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "wJv-7qPE2Knmy9OZDCpmEA", "review_id": "CnWk1-cEJbfGGQWuyWyo1w", "text": "I really like coming to Tofu Hut. Their food is always delicious and so very satisfying.\n\nTofu Hut is popular for their late night ayce special, but I would like to note that I am not reviewing for that, my family and I usually just sit at a regular table because there is never any wait time for the cooking tables.\n\nMy family and I ate here last night and we had a good dining experience. Normally their kim chee is lovely, but last night is was way too spicy and my water was not getting filled up fast enough. All of the other side dishes were marvelous, though. Last night, my favorite was the Jab Che. Everyone at my table ordered the Kalbi plates. Last night my Kalbi was sooo tender! I finished everything! Oh, we also ordered the Barbeque salad, and I felt that too was also a tad but spicier than usual. Other than the spice, everything tasted great, like it always does.\n\nTofu Hut is a great spot for having some great food! Definitely choose to sit at a regular table if you want to avoid waiting.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "y7gJZa_1LFu-wZVckXLakg", "review_id": "ADeBpgLPhr3JEikGKdITjQ", "text": "This place is awesome!!! I mean $17 for all you can eat Korean BBQ! Must try the beef tongue! Sounds weird and crazy, but it's really good- and it cooks fast too! \nSquid is also delicious! Order the short ribs first and then dip the squid in the short ribs marinate.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2014-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ww8epn7XyagVWLPvdg4etQ", "review_id": "lnH2q_Kxyeen33uv13CXSw", "text": "So sooo good! 16.00 bucks a piece and my friend and I ate like queens. Delicious meat and rice and salad. Recommend it for sure.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Fju_dLKhwg6pV4ejPRzQig", "review_id": "81zvi-vj_8__vYNE14UrZA", "text": "This is an inexpensive quality Korean restaurant w/a big menu.  Soups, short ribs, barbeque chicken, buckwheat noodles and generous side dishes mean you never leave hungry.  Easy access location and good service at all hours keep me returning,  All you can eat option is a bargain.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VVzrPoLAPASiwsVPHas90g", "review_id": "6Ei6-QUsX5Xhjg-1cdldFg", "text": "They have all you can eat and regular dine in. Before realizing they had the AYCE, we would always come and order 2 soups (tofu + veggies, tofu + beef) and the kalbi short ribs-- our absolute faves! \n\nWe finally waited one day for the AYCE and haven't returned back to regular diners. Yes, there's almost always a wait but it's well worth it. Service can be kind of slow but with the amount of guests, it's fairly reasonable. The quality of meats and foods is good enough to satisfy your Korean BBQ cravings! Love this place!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2014-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k8zh893FC07uFif52JMjug", "review_id": "rQ4kEp9cCSp0HuXnJpYXXA", "text": "My boys now love Korean BBQ.  Since one is a teenager, AYCE is the only way to go.  \n\nThis visit was better.  Same time, 4pmish on a weekday, but only one other table was occupied.\n\nWe had the rib eye, brisket, pork belly, beef tongue, and two orders of kalbi.  \n\nThe servers were a little more attentive, and were great at bringing out refills and clearing plates.  They also refilled the banchan when we asked.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hRXu6-MJhuhPF5jvYCoVrg", "review_id": "QXyaqtVtLDYAEJj7a2S0MA", "text": "I always come here during lunch because they have good specials on the tofu soup! It's cheap, delicious & comes with a lot of food! And usually the service is quick- not too long of a wait.\n\nHowever, I ate here for dinner the other night and the wait was ridiculously long! It was just a party of 2 but we waited over an hour. What made me angry was the fact that there were seats open!! There were at least 4 tables open but they didn't fill those up. They made us wait an hour and they finally sat us- at the table that was open this entire time!!! \nWe did the all you can eat and it was only $16.99. Lots of food & it was good~ love their short ribs!!\nIt's good, cheap food but you just have to wait a looooong time!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2014-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XnQYb4vlbcsZXy9MAd-cEg", "review_id": "B8kD6ZXwINrHAGw1LJG3Qw", "text": "This place is always packed! Huge portions and for how short staffed they are pretty good customer service! Not the biggest selection, sad there was no bulgogi but gets the job done. It's $16.99 for ayce and after 10 on it is 13.99!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V7AqDMh5rP8z11r2x2fP1Q", "review_id": "He7IvDx35E-cHJq2wdBoYg", "text": "Best Korean BBQ in Vegas. Love their marinated pork belly and squid. Their salad is addicting. Staff is friendly. Can be a long\nwait on weekend nights, but that's to be expected. My go to Korean BBQ spot!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2014-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JYgBZXPocp2QuRRzPCmhWw", "review_id": "fZXgPDZ39yllMPcz7OHnYw", "text": "Although the wait was long, the food was definitely worth it. It is open until 2AM for those who would love to indulge their need for some good Korean BBQ. I would highly recommend ribeye and brisket. Its always fun grilling up fresh, delicious meat at your table. . While also enjoying the side dishes provided !", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bnnWKBbhN29s5yT0Wuy59A", "review_id": "GMZY6eGba2ZPjijsODx9oA", "text": "horrible service, the line was 20minutes long even though there were open tables. they made us switch seats just because we can't just get one order of meat. they said you're not allowed to order just one plate of meat which makes no sense.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2014-04-13", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "InmJXkfJ_lKJe87T2431xQ", "review_id": "DzBDxlmhBFDB9Xty1F-laQ", "text": "Once in, we got seated at the non-BBQ section and then they changed their minds and decided to seat us at the BBQ side, which we had to wait 10 min to get seated. Once seated on the BBQ side, our waitress then move us back to the Non-BBQ side. Huh??\n\nWe got seated, and the waitress brought is 3 glasses of water and disappeared. I had to go to the front desk to ask for menus... Then she took our order and another 20 min later, we were waving our hands to get the waitress's attention, but they walked past us at least 5 times. We finally got our ban chan after the 20 minute mission of trying to get her attention. 10 minutes after that, our food came.\n\nI ordered the mushroom soondubu, which was basically all tofu. I counted exactly three mushrooms... I had to take half of the tofu out of the soup but it was still just tofu. Don't get me wrong, I am a big fan of tofu, but I thought I ordered tofu SOUP.. Not just tofu.\n\nMy friend ordered kimchi jjigae, which was ok.. You can't really go wrong with the simplest Korean dish. She also ordered chadol (beef brisket), which was over-cooked and chewy, so we sent it back. \n\nMy other friend ordered dwenjang jjigae, which was alright, but didn't really taste like dwenjang jjigae. \n\nNext we asked our server for some napkins, and he brings us one napkin... Lol is this some kind of joke?!\n\nI didn't expect to eat amazing Korean food in Vegas, but I didn't expect the food to be so foul. Horrible food. Horrible service. I vow to never step foot in Tofu Hut.. More like unappetizing tofu cardboard box.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2014-04-13", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "bAA4OXxw5eJamNnX8Xo_5w", "review_id": "ivgApXKDzh-RZTbziuTOcA", "text": "I'm not entirely happy with going to this place this time around. Service was awful and had to get the waitress' attention just to ask for something. The food was tasty at the time but now my stomach hurts. I wonder if they even got an A from the health department.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2014-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AU6GcLkwDIZETfhcmyEXVw", "review_id": "d41aQ2SFnRiPcNh5SF4DBw", "text": "Beware!!! As numerous other reviewers have mentioned about their poor service, poor quality of meats, dirty establishment, etc...  This place was shut down due to numerous violations 2 weeks ago. Staff are not trained properly and do not have any common sense. Seating is first come first serve even on waiting list. A 2 person group will be seated at an 8 person table while a group of 6 (2nd on list) will be left waiting for next available. Meanwhile, 3 groups of 4 ppl are left waiting for the 6 to be seated first before they can sit at one of the many empty and available tables.  Gratuity is automatically added to the bill if you are on the bbq side, even though it is not specifically mentioned anywhere. Will not be returning.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2014-04-29", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "aCoFnFdRvJjtniV_9AaKpQ", "review_id": "2V3_sURaNEpfp1Yo-QvphQ", "text": "The bbq was moderate, however, the service is horrible. Our server was definitely either having a bad day or Hayes his job. :\\", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2014-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2I0mgiAbds0OEdCDzvL6YA", "review_id": "-gJLYfkur7n_NnX9vySipg", "text": "I just ate here yesterday and I enjoyed it! I read the reviews on here and decided to go around 3pm to avoid rush time, we were the only ones besides another table in the restaurant so there was no problem with service; however, our server seemed a little spacy and forgot to re-light our grill after we asked a couple times when the flame went out. \nWe ordered short ribs which were tender and tasty, I also ordered squid which was okay but hey it's just plain squid so it's okay. \nThe ribeye was tender and I enjoyed the texture. You get to cook the food yourself so it's up to you how long you want to cook it so no waiting and waiting and waiting for it to come out. The sides went great with the meat as we had white rice, kimchi, salad, and some kind of clear sauce to dip the meat in which actually improved the taste, I should have asked what it is but I didn't bother. I would recommend coming early to avoid rush time as I did.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z70BnltfejEb2-mO1G_ZkA", "review_id": "ot-1bxrwJQzcXlQN6a9QwQ", "text": "I've had several different Korean BBQs. I wasn't feeling this one. The table we had had poor ventilation and I got smoked out and I got so hot I didn't feel like eating. That and none of the food really had any flavor to speak of. There are better options in the area.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2014-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gjv2cM7GAgdicJ6Xh0butg", "review_id": "wpGp9YvQX7OhOhFXbFHzZw", "text": "An excellent and affordable (AYCE $16.95) DIY Korean BBQ joint. I'm sorry Sura, but I think I like this place a little better. For the most part, the cuts of the meat are great. The beef tongue, brisket, and ribs have great meat to fat ratio. Although, one time the tongue had no fat and we ended up with charred rubber-like disks...but oh well. \n\nMy favorite part of the meal are the little banchan plates that accompany the hot meat so damn well. Kimchi, cucumbers, bean sprouts, fish cakes, and noodles are given. The plain looking shredded salad surprised me the most. It's laced with delicious vinaigrette and it's so good, I want the recipe now!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ylSCq3ABtpVhCbPMvBoLsg", "review_id": "uZKalyTKNVKN_OdNHMnWxQ", "text": "A La Carte menu:\nI've been to Tofu Hut plenty of times before and no other Korean place I've went to had tofu soup comparable to this place. Sometimes salty, but nonetheless distinctive. I usually order the Bulgogi combination and Short Rib combination which are about $13-14 each including soups and sides. For the price, the food is quite a bit and enough to get a group of three to four full which is great. I tend to finish up the sides too. Rice cake, noodles, spiced cucumbers, kimchi, beans sprouts-yummy.\n\nDownsides?:\nBulgogi was overcooked this time I went... not too much of a biggie because the short ribs were perfect. The biggie was customer service. When I asked one of the employees politely for a refill of a side, she walked right past me without acknowledging me, then returned later just taking the dish without saying anything or looking at me. She quickly came back with a refill but I found it rather rude not being acknowledged at all...as if I wasn't there. Not cool. Overall, service is inconsistent every time I head here. Depends on server of course, but everyone on Yelp knows I love friendly people and tip generously for it. For Tofu hut, I realized not to expect much from staff anymore.\n\nI like eating here for quick fix Korean. If it wasn't for my affinity towards the soup here, I'd prefer the ambiance and experience at Soyo (located Rainbow Blvd/Warm Springs)", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2014-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ime6Np-3CL-ws04Wn_pR6w", "review_id": "vGXdMdIXDv8DDRNwGM11jQ", "text": "Came here with my Family for the first time a few weeks ago. I was definitely not impressed. We sat in the section where you get to grill your own food, ordered just about every type of meat on the menu as it was four of us, we were hungry, and we wanted to try everything. I honestly cant remember one thing that I thought was good. The meat was so bland and tasteless! The sides were not very good either.\n\n It could be that I am just not used to this type of food but in my opinion it was not very good at all. Mind you I was HUNGRY when I went here.  My family did not care for it either and we all agreed we would most likely never return.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2014-05-28", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "n9K5dGpf_0530WePsc-aNQ", "review_id": "09jWKmG_tjGIRP253xeZHg", "text": "I specifically made a yelp account to write a review for this restaurant. I used to be frequent at tofu hut before they got shut down. I finally went back today after they reopened. I will RECOMMEND EVERYONE to stay away from here so they can straighten out their defects. Horrifyingly found a BUG in one of my side dish. A Rolly Polly to be exact. I should've learned my lesson when they closed the first time.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2014-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vo2-wn5pcYSaQqylAjoeQg", "review_id": "5Oinx-26fZ-xYt-8_rJnWg", "text": "Price is good. Food is great! BBQ ribs too fatty for my taste but really tasty. Been here twice and will be back for more. It is always packed! Gave it 4 stars because the wait is long to get a table at the eat all you can eat tables.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "37aZlCJIEWW6H85JShheNw", "review_id": "PjcyrEMOiXac-fes9gcSkQ", "text": "This place is very small. I had to wait for 1hr to be seated.  The food was not the best because the grill was not working. I think I ate raw pork and chicken because the grill was messed up. There was so much smoke coming from our grill that they didn't brother to fix it after we were done eating raw meat. Place was too small and not worth going even if the price was cheap.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2014-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3GTxx-wh6ezfML72XzrErA", "review_id": "CX_eeMVpNfPTOFfgQnZrfQ", "text": "Good all you can eat korean bbq at a great price. If you crave korean bbq, but dont have much money for it, just go here. Its all you can eat, but you are locked down to what meat you can get depending on the package you order. I think the package I usually get is the Las Vegas one, but I cant tell if im thinking of a different Korean BBQ joint. The environment is on par and theres nothing to complain about it. Service is also on par with no complaints at all.\n\nThe meat is good at a good price. If you have a friend whos never had korean bbq, this is a good place to have them start off since it has good and affordable food. If I were to define this place on the korean bbq scale in town it would have to be the most introductory one. Decent and filling food at a decent price is all I can say really.\n\nService is good and the employees are always willing to cook for you which only adds more to the introductory title.\n\nEnvironment is nice, but somewhat small. With a small building, its going to have a limited amount of seats. Theres a waiting list at the host stand that is used often, so try to get there before the lunch rush starts.\n\nPros: perfect for people who are new to korean bbq, good food at a good price, good service. Everything is pretty much on par.\n\nCons: can get busy easily, seats can easily become unavailable.\n\nAdvice: bring people with you, its suited for that obviously.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-03-04", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 5}, "user_id": "qLFQOOkxF7RikbXBrmKIig", "review_id": "qlpjfK88I14abXWUAc52mA", "text": "Tofu hut needs more credit in my opinion.  Their prices are the most reasonable in all of Vegas. $16.99 all day up till 10 pm then it is $13.99 for their late night special.  \n\nIt's a hit or miss with the service!  You can tell when they are in a bad mood or not.  When they're in a good mood, they're very kind.  \n\nThe food is great!  I always order brisket,  pork belly,  beef tongue, squid,  spicy chicken,  and the tripe. I don't really like the tripe,  I just order it for the honeycomb that comes with it. Ask for brisket sauce!  It's yummy!  They also have very tasty side dishes: japchae, cucumber salad,  fishcakes, korean pancakes,  and kimchi.  Oh and by the way,  they have the best salad anywhere!  I've tried a lot of korean bbq places and by far,  tofu hut has the best house salad! \n\nThere are definitely other places where you can get better meat quality and better service,  but you will never get this great of a deal!  \n\nHot tea is free too!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "8R1ZA7_94b_vNMJsVRyBsQ", "review_id": "ZStCqkBi6rO3ha78NUGPxQ", "text": "My favorite AYCE Korean BBQ in town.  Tofu Hut is like a hut - only because it's tiny.  I've gone here about a handful of times, and even though it gets super packed, the wait times are never ridiculous.  Also, Tofu Hut is cleaner than most AYCE korean places that I've been to.\n\nThe best price - $16.99 for AYCE.  They have a late night special price, but I forgot what the dollar amount is.\n\nGenerous portions of meats.  It's not the kind of buffet you get up and grab.  They bring the meats to you.  I love the ribeye, the marinated pork belly, and brisket.  There's a list of about 10 choices for AYCE, but if you are sharing with one other person, 2 or 3 meats are plenty.\n\nAlso comes with a side of salad and of course kimchee, bean sprouts, tofu (the usual 8-10 side dishes that come with your meal for every korean restaurant ever).  \n\nWash it all down with hot barley tea.  A must every time I go to a Korean restaurant.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-03-06", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "oMskzR5eWQTgT1AKSAN2pw", "review_id": "Nh5k2praCHSnOWSXUGLEqg", "text": "I'm currently waiting to be seated... It's been 50 mins so far.  My boto itchi and I like eat. Take too long.  Food smells good.  Opening my mouth as people take a bite of the lovely korean food.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2015-03-08", "type": "review"}
