{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "PrMlXX6fbMsJie9ausN41g", "review_id": "Phd_OwFhKQptiVL5Tbl-Lw", "text": "If you want a true understanding of Pittsburgh in the morning, come here. This greasy spoon is always packed, and is one of the better of its kind south of the city.\n\nThey serve waffles in halves, which is great. The eggs and toast are good, the homemade hot sausage is excellent. The drawback are the barely cooked potatoes.\n\nIf you're hungry, get \"The Mixed Grill\"... Gab and Eat's brand of the \"kitchen sink\" breakfast that all Midwest places are about.", "business_id": "b9WZJp5L1RZr4F1nxclOoQ", "stars": 3, "date": "2007-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nyDUmYdLrdHNWCopqJmZ5A", "review_id": "KMv8N5Bix9zyCwFiUxZW2g", "text": "Amazing amazing place and I really enjoy to eat there and drink the prices they not high, very good service and fast .", "business_id": "FiXamVMgMf9U0VqFHDZSEA", "stars": 5, "date": "2014-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Z4hioWIFwOtGgTtsP8GyAg", "review_id": "3VCZO7LWkfNs3tTHgpbSQA", "text": "I have been a customer of the Triangle Bar & Grill for over twenty five years.  They have the BEST subs ever. \n\nBUT on this trip I was buying several to share with people from out of town.  They are cash only and more than happy to show you an ATM that charges you $2.50 per transaction.  The employees don't set the rules but have to live with them.  That $2.50 came out of their tip, they can hit up their boss for the rest.  Its 2014 and they still don't take credit and or debit cards.  Shame on them.", "business_id": "DzOPHyrG2XuVqKEvHCnN7w", "stars": 2, "date": "2014-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NXjGvODQKl69NDf-GYPCLA", "review_id": "h_VSXbMQIXVIzkBHdRasUQ", "text": "Primanti's sandwiches pretty much sum up Pittsburgh in many ways:  big, over-the-top, tasteless, and unhealthy.  What more could you ask for? Unfortunately, this place is pretty dirty.  Make sure no flies land on your food.\n\nIt seems like Pittsburgh natives love this place, which is fine.  Its food certainly is unique.  However, if you're not from Pittsburgh, there's a good chance you'll walk away with a rather bland taste in your mouth.\n\nBy the way, do not pronounce the \"t\" in Primanti.  It really irks native Pittsburghers.  It's pronounced \"Primanny.\"  Unfortunately, I learned this the hard way.", "business_id": "NeUf9FyCCIN4MEseNyqkXQ", "stars": 2, "date": "2009-05-17", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "6nKXZBMJmxunTfiid--y5Q", "review_id": "eKJ9TlIoMWJ8sKRSCmxlPw", "text": "This place was featured on Man vs Food, which happens to be one of my favorite shows so I knew I wanted to hit it for lunch while in Pittsburgh. I tried really hard to be blown away by the experience but in the end it was just \"A-OK\" for me. Nothing really special about it. \n\nFirst, our server was horrible and I have hard time with poor customer service. Trust me, I'm not a guy with ridiculous expectations either, I rarely (if ever) complain to a manager, etc.. Anyway, she was really preoccupied with this group of young guys who were drinking a few beers and giving her some attention. To say she was train wreck would be an understatement so I'm sure it felt good to have a couple of buzzed construction workers flirting with her BUT I don't want to suffer over her self-indulgence. Just saying. \n\nWe both ordered the pastrami sandwich and it came out rather quickly. The bread, which is made fresh daily was amazing; it literally melted in your mouth. The pastrami was just \"ehhh, ok.\" It was lean but it didn't seem to pack a real punch from a flavor standpoint. I prefer mine I little more charred up with some seasoning. I could probably go with out having the fries on my actually sandwich as well. Apparently, that's there big move; they put the fries and cole slaw on your sandwich. I was also a little bummed about the fries; they end up getting really greasy and soggy. I'm a fries \"well-done\" kind of guy so this didn't really impress me from a flavor or texture standpoint. In the end, it didn't add to the flavor of the sandwich for me; it actually made it a big soggy mess.\n\nThe portions are enormous and the price is right for lunch. Well under what I think they could charge for the amount of food they give you. \n\nFor those Pittsburgh-ians who travel to the Los Angeles area, let me recommend Langers (look it up). The place is a landmark in Los Angeles and their pastrami and corned beef is absolutely second-to-none. In a fight, it would smoke Primanit Bros. like cheap crack. Just my two cents. The neighborhood is a little sketchy though so pack some heat if you have it!", "business_id": "NeUf9FyCCIN4MEseNyqkXQ", "stars": 3, "date": "2011-05-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "u14RV98SF-gAyFmP7r5nhQ", "review_id": "fDQmKF9Dl_Oi3WfUVfi46w", "text": "Can I give this place ZERO stars? They're supposively \"famous\" for their sandwiches so some friends and I go when we are in town. The waitresses all rolled their eyes and glared at me for not wanting my fries on top of my sandwich. (Not to mention the waitress was in the skimpiest tank top with her bra hanging out while waiting on us and grilling food. Gross.) I get that your famous for having fries on the sandwich but regardless, a customer should be able to get what they want. This place was trashy, dirty and probably not even up to code.", "business_id": "NeUf9FyCCIN4MEseNyqkXQ", "stars": 1, "date": "2014-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZjEj5nzJySJ2JAtL0srsHg", "review_id": "pnSj9Tddcnb24l5GQc9czg", "text": "Place sucks. Loser rude servers ignore you even if you stand at a register and wait- you will get ignored. This place is going down. Server said\"you don't matter - I have a million people to take care of\"\n  This was after waiting 20+ minutes at the register with cash in hand. I understand it's busy- but acknowledge people - appreciate customers! When you tell us to F off- you ar going DOWN! Rude! Not worth it.", "business_id": "NeUf9FyCCIN4MEseNyqkXQ", "stars": 1, "date": "2015-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FpG7tvQ3WKrxUF0_MpXNhg", "review_id": "863i8JQEJOpEsryR69vecw", "text": "The best sandwiches in Pittsburgh as far as I am concerned....everything is always fresh and cooked to order and tastes really good!  The place is nothing special...I have never sat in the one downtown, but there is one more on the east side and it looks the same.  Small place, but clean and worth going just to grab a sandwich or fries!!!", "business_id": "pvGT62T6Ci1LKOS9DL42pg", "stars": 5, "date": "2009-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bIDDOtvBE4MnNbbJIKoLnw", "review_id": "P9IerZDjs3CI5MpQtHmoeA", "text": "Mama Ros's (sic) is a great place to eat late at night or early in the morn. They have weird hours, weird cooks, weird customers, and great food. \n\nThe price is great and the silver dollar pancakes are soooo good.", "business_id": "o_wRqOpli9kyZGXlJtLLdA", "stars": 4, "date": "2014-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "zamPsIVL88f3yNXFslONeQ", "review_id": "mE_fGBiiFIjAVyv8kvsq-Q", "text": "Pizza by the slice are VERY large. Great garlic knots! It's in the parking lot with food lion. Nice atmosphere inside and quick service. I will definitely be back.", "business_id": "sJtGRBWYUj013nkFA4Hrdg", "stars": 3, "date": "2012-05-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "OiV9jwVwAE1E2KuQkikokA", "review_id": "bY8k77z56VJ7t8nUj8ufUQ", "text": "Matt's is a great stop for lunch. I have been here many times and always had great fast service. Contrary to their name, they serve food other than hot dogs...actually I think the majority is something other than a hot dog. \nI have had the cheese burger which is good, better than fast food. The homemade chips with a side of ranch are amazing! \nI have other friends that have tried other items and love them. This is a must have stop in our lunch rotation.\nOn the healthier side, they have an apple blue cheese salad that is AWESOME. It has huge slices of apple, pecans, blue cheese crumbles, and romaine lettuce with a balsamic dressing. It is one of the best salads downtown!", "business_id": "gpCtDCSXIoQx70cq9itfNA", "stars": 4, "date": "2011-03-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "JzM0bY8c7M2UN3uJGTSq6w", "review_id": "DrkkVZDMy9030YBaLs5cgA", "text": "Best subs in Charlotte! No frill local joint with great prices. Same people all the time and they work hard. It may take some time if you go right at noon. Call ahead if you are in a hurry. If you pay cash it saves you 50 cents. I love the New Jersey sub with extra sauce. A little on the spicy side so beware.", "business_id": "4-B5ou1FbGVjVEQd3FAoIA", "stars": 5, "date": "2015-05-28", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 5}, "user_id": "VhI6xyylcAxi0wOy2HOX3w", "review_id": "uMLEH6B9vjTGy_t-FGIhiQ", "text": "Lunch with Mrs. K. who really wanted a New York Jewish deli but we didn't want to drive all the way to Arboretum today. Instead, we headed to Rusty's. Sandwiches and other platters, nothing quite \"New York\" style.\n\nI chose the Turkey Reuben. Grilled and topped with sauerkraut the way Reubens are supposed to be but the amount of turkey in there just didn't meet (meat?) my expectations.\n\nMrs. chose the \"mixed cheese baked potato\". Lots and lots of cheese on here and the potato was nice and fluffy but WOW was it hotter than Hades.\n\nOverall, pretty good. I think the Reuben is better at Katz's though.", "business_id": "WkD7OrSIHLzgOQo9wQHu-A", "stars": 3, "date": "2014-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cLqVPC_FWHderGAfCFCh3A", "review_id": "o6WOXgc2PqZtAuLlRUK1xg", "text": "This is a great little spot. Located on the boardwalk, one of the only walkable places in University.During my college days, I'm sure I had a sandwich here, once or twice, but I can't seem to remember. Last night, we stopped in as a celebratory first ice cream of the season.  I got one scoop of the coffee cookies and cream and a scoop of  the butter pecan. No complaints! if you want a sweet treat, stop by this place, grab a seat and enjoy some live music from the Wine Vault next door. \nAffordable, fast and casual.", "business_id": "M8CC5_9vEvt1yOI2pnkvKA", "stars": 4, "date": "2015-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "lr6c11Xnn77XlsZrMe7D4A", "review_id": "L6V1NPmKjjdjsqM6tiX3cw", "text": "Who knew Fort Mill could boast such a cute little coffee/lunch/wine spot?  I was brought here by some collegues for lunch since I was in town to visit HQ.  Not really excited about the lunch options based on my last trips, I was glad to see they branched out to find this place.  \n\nI think the guy behind the register was having a bad day....we had to repeat our order a couple of times.  And even though he asked if I said Regular or Diet coke, and I answered \"diet\" - I was handed a regular coke.  No biggie - I have a day like that all the time, and at least he was nice about it.\n\nMy lunch was the goat cheese salad - what I failed to realize was that the goat cheese was fried.  EVEN BETTER!  It was a delicious salad and something I would definitely look forward to ordering again next time I am in Fort Mill.", "business_id": "rPQsep_POg0YATvt-6MEfg", "stars": 4, "date": "2012-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6Y9IY1Q44QxorqNs_nOgMQ", "review_id": "Z9Pw0J6z8_pc1i0AKjJLKg", "text": "Good food for a good price...\n\nI finally got to try out the New Orleans Take Out Restaurant and was fairly impressed. The wife and I split an order of etoufee and black beans and rice. It was plenty of food. Nothing too fancy, but it was tasty. I will definitely be going back and will hopefully try out a poboy and some of their other dishes. . \n\nFor the people saying no place to sit. Are you sure you are rating the correct location? They had plenty of tables there complete with copies of the northside news paper, isthmus and the onion.", "business_id": "cpGv6ES2hzPCtCUQgipwXw", "stars": 5, "date": "2011-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XzIKZTb4I-7wW4BjKwV2Mw", "review_id": "5gs4ysLCjFJekoYQ7Vwp2w", "text": "I was hungry after class and decided to check the Hooked local deals for anything good. I saw that Silver Mine had buy 1 get 1 on any sub and ran over there!\n\nI got one comstock (roast beef) and then a Dodge City (Pepperoni & Salami).\n\nI've had the comstock before and it's decent. The Dodge City also wasn't bad either.\n\nPortion size was good, I was full after 1 sandwich and saved the other one for another day. \n\nTasted pretty fresh and put together really well.\n\nFriendly guys behind the counter.\n\nI saved over $8 with the Hooked deal and the subs were good.\n\n5/5 this time!", "business_id": "Uw1DZhEtTmLzMcXmdpR8Pw", "stars": 5, "date": "2015-04-04", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "sleEMt44E1StWrjz3mcujQ", "review_id": "L3eRPlAN6jtKwXzpmYghNg", "text": "Ugggh I hate this subway.  I hate it the most of any subway I have ever been in, including those I've been to in gas stations.  Especially given that Silvermine is right next door, I would never, ever go here except that I really like the subway tuna salad wraps and the silver mine tuna salad just can't compete.  The vast majority of the employees I have encountered at this particular franchise have been either cross-eyed (no joke) or unwilling to interrupt their cell phone conversations to make me a sandwich.\n\nThe best part about this subway is that if it weren't so terrible, I probably never would have tried silver mine, and silver mine is awesome.", "business_id": "79hY0d7j45ZRjTAB2d0jQQ", "stars": 2, "date": "2008-05-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "uj79HTtyOdAdd_TaPcdxjA", "review_id": "c8-n8xuUnmmTguKIvR7RfA", "text": "All around great.  Great food, great atmosphere and great location if you work in the downtown area.", "business_id": "9BH18avE46LlHMvJn67MaA", "stars": 4, "date": "2008-03-02", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "sEWeeq41k4ohBz4jS_iGRw", "review_id": "VjOACE8c0dhs7fBuniWjnA", "text": "Zoe's is fine, clean and simple with just enough trendiness to make you feel better about yourself for coming here than a fast food restaurant.   Our food was plain and simple, chicken kabobs and a quesadilla.   I guess we should have tried the lime ade and the cake, maybe next time, and then I'll give then another star.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2008-03-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "Ry48Bta6spNowOkiMNC_xg", "review_id": "UybrX_o8-KdR5yXALetRHA", "text": "I had no clue I've the sophistication of an earthworm when it comes to food until I read other Zoes Kitchen reviews.  For our information, looking at the Zoe's Kitchen web page, I found out they are a national chain.  Call-in/Take-out and catering are  big parts of the business model.   The fine points of excellence are up to the franchisee.  \n\nIt looks like people having the worst experiences come in for lunch.  We tried Zoes for an evening meal.  Nicely styled with an attractive glass wall on the north facing McDowell Street.  Outdoor dining.  \n\nWe got a chicken kabob and a hummus and salad plate.  Both came with a haystack of mixed green salad with onion, Greek olives and feta.  That's fine with me.  The health survey my insurance company bribed me to fill out determined I don't eat enough greens and fruits.  Score one for Zoe's there. Each table had a bottle of Greek dressing so salads are seasoned to taste.  Mine also came with a tiny tub of Tzatziki.\n\nThe chicken kabob was good.  Chicken, green pepper, onion, cherry tomato.  I found out I like cherry tomatoes much more when they're grilled.  Apparently my family has a gene for fresh tomato aversion.  The grilled cherry T's were very good, the chicken not overcooked, and the rest of the veggies very good.  \n\nThe amount of hummus, about 3/4 cup, was decent, the pita was served as small wedges.  The taste was hummus and pita.  Not Great, not Terrible.  \n\nOur beverages were endless ice tea.  \n\nThe bit of the meal that was unprofessional in the food service industry was a salad core in Sweet D's greens pile.  The price of our meal was $21.00.   I'm thinking the goal of this Mediterranean fast food franchise is a meal for $10.  We'll go back.  After we try more of the eateries at 7th Ave and McDowell.", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2013-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Mj-cvpzPLx5IXNHOAWQXYQ", "review_id": "sI8FrSu90LPrcC4VijA-7A", "text": "This is my favorite Subway in town! I often go with my little boy and they are so friendly and patient while he practices ordering. The service is the best at his Subway and i will drive by several others just to go here for the awesome service!", "business_id": "Vvh2Hd4SsZjEEfKLNKAEWw", "stars": 5, "date": "2014-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MtZ9pTrYhUhXEE45Ee4pnw", "review_id": "-d-YJRW2Rxc1f_4lrVhI9w", "text": "Amazing!  Simply all around great.", "business_id": "OoHWabV-ym7_HWlHeXTsVA", "stars": 5, "date": "2011-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "100Df1wcVrl9rJgB7EG6xw", "review_id": "xdFbeIRF-xup6bqz4QfrFw", "text": "I actually stumbled upon this place when I was on my diet and I have been a fan since.  I love that it is a local place and it is family owned.  Not to mention they are Chicago Cubs fans!!!  \n\nThe food is great and the portions are just enough.  I love the chicken picado salad and love that it comes with warm pita bread as well.  It is always busy around lunch time but clears out around 1 or so on the weekdays.  I have been here on weekends and the place is pretty quiet.  \n\nThe only complaint is that it can be pretty slow sometimes but the food makes up for it!", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2011-05-10", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "sEWeeq41k4ohBz4jS_iGRw", "review_id": "5TiqEUIzvTXI0NdYjl3SPg", "text": "Cool place, just wish I had been coming here more often.      It's in an old house so it has that cool \"old school downtown\" vibe about it. \n\nPretty healthy menu items with funny names that you'll be sure to remember, like Cheech and Dijon Chicken, The Very Brady Clubster,Teriyaki 90210, Gringo Star, In Like Fin, Rocky VII, The Veggie Jackson, and Bird Is The Word , just to name a few.\n\nI had the Prince of Thai which I really enjoyed. Just spicy enough for my tastes. I tried the pasta salad as a side and was impressed that it wasn't oily or had too much useless stuff on it, simple is good.  At $6.95 I thought it was a heck of a lot better than a drive through or a sub sandwich.\n\nI'll be back soon to try one of everything on their menu!", "business_id": "ZoQAOnEFnyHjSpomtfqesA", "stars": 5, "date": "2008-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "FgbBjf2XCDXw9bRWka5R-w", "review_id": "p9qorVLi4ULsTZ2sD8j32g", "text": "I had the BEST sandwich today. Got one each for my boyfriend and I. Both on the jalepaño bread, which was the softest bread EVER. Brought it home to eat and first thing my boyfriend says is \"this is a dang good sandwich!\"\nHighly recommend this place to anyone who wants a good sandwich.:)", "business_id": "_8Y-XNHmQ76xmxUQIrn0sA", "stars": 5, "date": "2014-05-07", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 2}, "user_id": "nifQuBZYwHNnGLUU105EZQ", "review_id": "osMWTLtuvYz2FVFZN9FfyQ", "text": "Four and a half stars.\n\nFresh and Delicious. Ill say it again. Fresh and Delicious.\nThe food gets 5 stars.\nSeating/ outside patio is where I doc points. Oh, and the beverage selection. I don't want to go next door and stand in another line for my drink. If they had fresh juices or something I would look past the seating.\nThe patch of grass behind the building is nice on a cloudy day. \n\nyou will see me there again.\nI would like to eat there on a Monday.\n\nand I have nursed in the parking lot.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2008-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nipk_sugg1jp-1e7ooqWig", "review_id": "q1xcE46ItQZ1og4KLs7B4w", "text": "AMAZING! thats it. simply put. ahhhhhh, I love this place. makes me do the happy dance. that is, if I had a happy dance.\n\nSo, what to get. always the dilema. EVERYTHING is good. Although I did a stint as a vegetarian for a while, that is, till I got pregnant, and lived on the Mozarella tomato sandwich, I do have to say all the sandwiches are fabulous. He makes the mozarella in house. cant get fresher than that. it is so buttery and creamy and compliments the other ingredients on that nice crusty chewy bread so well.\nThe tuna sandwich is the only tuna sandwich I will pay someone to make for me. Yes, it is that good. mmmmmm... and their market sandwiches are to die for. especially the lamb. oh and the mortadella. oh and lets not forget the pork. it doesnt matter. just give me one. hehe. and hopefully you are early enough to also get some of their tasty and oh so creamy rice pudding. best Ive ever tasted\n\noh and while you wait for your sandwich, after you pay for it of course, go next door to Lux and get a tasty fresh squeezed lemonade. Yes, that will make anyones day better.\nI feel happier just thinking about that. Wish I didnt live so far away...", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2010-03-08", "type": "review"}
{"votes": {"funny": 5, "useful": 7, "cool": 3}, "user_id": "1kED3-g-gqnc4JgHe89Xqw", "review_id": "Fm-jcj-C4Z2WamfdJw971Q", "text": "Totally expect to get my ass kicked by the serious Pane Bianco devotees on here, but oh well. Meh. I don't like paying $10+ for a sandwich, and then almost $4 for a side, and $2-3 for a bottle of water/bottle of soda. That is not an acceptable lunch option to me. Especially when I have yet to patron Pane Bianco one time and not been hungry an hour later. This is the freakin' sushi bar of the sandwich world.\n\nWhile I'll agree that the ingredients are fresh, you get so few of them it would be difficult to know otherwise. I've been several times now and pretty much always get the tomato/mozz sandwich as I don't eat tuna salad or have a taste for sopressatta. The other day however I got the market sandwich and I was so excited to be able to try something new because it had turkey in it. 2 whole super thin supermarket looking slices of turkey. Mmmmmm. Delicious giant pieces of bread with two super thin slices of turkey in the middle. How could I say anything nasty about paying $10 for you? How dare I be hungry an hour later when you made me so full with all of that bread? You get the picture. Stick the the tomato/mozz sandwich if you're heading this way. Oh, and make sure someone else is picking up this ludicrous tab.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 3, "date": "2011-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hVnHDo3ZZiTXQV9n047uyg", "review_id": "BDC0k6wcCHaD0ryRixvmAw", "text": "Probably the best tomato mozzarella sandwich ever. Bean soup delicious. Pizza- awesome! The place recently expanded so you can now sit inside. They really did a great job on the decor an created two separate rooms that can sit 8-10 people. Great ambiance.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2012-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "u8Nb6ggdUFleRZjuRJRO3A", "review_id": "C-R3FMzuOU_T-IdxZucLlw", "text": "Pane Bianco doubles as a fantastic bakery and restaurant. The menu items are made with the freshest of ingredients and delicious. The price is moderately high for lunch but definitely worth it. The decor and interior work wonderfully together to give you a very pleasurable dining experience. The most unique part of the interior is the bar which I was told was salvaged and was formerly an alter. Staff is friendly and knowledgable about the menu, ingredients, and specials.\n\nA little known secret is that Pane Bianco is owned and operated by the same family who owns Pizzeria Bianco and you can get the same exact pizzas here even though they are not listed in the menu. All the same great taste, without any of the downtown wait for a table.\n\nA must try location for anyone in the uptown area.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2014-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mMX_VWr4D905XlC3bBoojA", "review_id": "l4I5bXFTwTdJZED76B4jzg", "text": "Stopped in before a doctors visit and was very pleased. Victor is the new owner and he seems to be doing a wonderful job. I had a ham and green chile burrito that was delicious and was very affordable. Thanks for the wonderful food.", "business_id": "SfrBXbRdNB_gqPkIgJyKCg", "stars": 5, "date": "2014-05-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "IXu9fK8c4_ipIKEynFxfgg", "review_id": "yzZ9h4Z3nUqkWg54xUfvTQ", "text": "This is my favorite deli in the valley.  Whenever I am in central Phoenix I work my schedule around making sure that I get to eat here.  They remember my name and ask about how my family is doing even when it's been months since my last visit.  The fact that you can see pictures of generations of family working behind the counter in one place really should mean something when trying to figure out why you should eat here instead of subway or some other massive chain.  I always get the new yorker.  This is the place everyone craves in their community for lunch and it exists!", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 5, "date": "2012-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PVIJ0S6sVxGYstpyWAUciw", "review_id": "2fnqJrCofmBAdhmV-CKdwA", "text": "Scott is here almost all the time. I've eaten at Scott's since they opened and have never been disappointed. Scott makes the best LEO (lox, eggs & onions) in Phoenix, has lox spread to die for, and is picky about his bagel supplier. I love the knishes and smoked fishes. He even remembers I don't eat meat. This is also my go-to place for a take-out brunch spread.", "business_id": "PxeX1M8WtyPxX1MuuGIh-g", "stars": 5, "date": "2009-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "sGZpZoEKwQVNPRhG3OjudQ", "review_id": "D0mAjIVXCfwDTLc424IAxQ", "text": "The food was excellent.  i had the pastrami Reuben, which was probably the best pastrami that I've had in AZ, very flavorful.  The fries and pickles were excellent too.  Fresh cut fries, can't beat that!\n\nI also had a potato knish.  I haven't had a lot of knishes in my life so i don't have a lot to compare this one too, but It was good.  The only complaint I would have is that the potatoes weren't very moist, but it was still flavorful with a very nice flaky crust.\n\nThe only negative thing I would say about this place was that the day I went it was 90 degrees and out and they didn't have the AC on!  We asked the server about it and she said the owner didn't want to turn the air on yet.  I mean, it was ridiculously hot inside that place!  So hopefully that was an isolated incident because the food was so good I can't wait to go back!", "business_id": "PxeX1M8WtyPxX1MuuGIh-g", "stars": 4, "date": "2012-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fbzvWrI2sRGeOVxQ6w8zrw", "review_id": "duOcJ6Z6kr-Onm-OzqL0yw", "text": "New to the area so am trying out all the places near me. Scott's Generations Deli & Restaurant was on my agenda for today. Do I know anything about NY delis and matza balls? No. ( I cannot even spell matza ball). Do I know anything about ordering meats or deli fish? No. I'll just review what I know. And I know design, good service and breakfast food. Design of the place including the logo and menu...Stale and dated. Quality of the service...quite excellent. My eggs Benedict... Very average. After I got over the shock of a cheese slice somehow showing up sandwiched in between each English muffin and the hollandaise sauce, I did enjoy it and the home fries. Obviously not the best hollandaise, and I guess they know this already because it needed to taste more like cheese and less like hollandaise according to the cooks that probably should just remove this item instead of pretending. But what the heck...it was something different. Next time I'll order a Reuben and see if my 3 stars can become 4.", "business_id": "PxeX1M8WtyPxX1MuuGIh-g", "stars": 3, "date": "2015-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ux7a5tbceLU6anNycjwt_Q", "review_id": "LJvaUVk-2tbBwSJbBQsLoQ", "text": "I really love the duck sandwich at their deli which I never had before.  The wine bar is treat too for washing down your food and plenty of outdoor seating for a group meet.  The rest of the place is kind of confusing in terms of the varying stuff that they have for sale. I'm not sure how it blends in with the deli but then again, this is an opportunity to try out a new place.", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 3, "date": "2010-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "X7dxykmIV9LL5ZxLtgQYXA", "review_id": "Zefe7nEMJGm6xTItX2q64g", "text": "I went to duck & decanter with a friend of mine from work on a whim, and really enjoyed it!  You order and pick up at the counter, and while you're waiting you can look around in their little shop.  They have a snack section too where you can pick something up to go with your sandwich.  I tried a bag of the popped sour cream and onion chips, which were awesome.  These are not unique to D&D though.\n\nAs for the main course, I got the D.A.M. Sandwich.  This bad boy is pork roast rubbed with southwestern spices, slow-cooked, pulled, and marinated in a jalapeño and onion barbeque sauce, topped off with their special coleslaw, and served on a onion roll.  Holy amazing.  One of the messier sandwiches I've had, but I was too busy nomming it to care.  The portion size was generous, but that doesn't mean I wasn't left wanting more!\n\nThe restaurant itself is fun, with several indoor and outdoor seating areas.  I sat in a little nook in the back wine cellar area with just a few tables.  They have a separate wine bar back there where you can choose from any of their wines, if you're into that kind of thing.  They have a good selection of non-alcoholic beverages as well.\n\nI'm not normally into sandwich places, but I really can't wait to go back and try it again.  Once I've had the option to try other things and get a better feel for the place, I may revise this review and bump them to 5 stars.", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 4, "date": "2014-04-09", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "_1OTipGDKze-M0XaYh-kXQ", "review_id": "PtGXlsu91_otLUudUmM7kg", "text": "I tried a few different kinds of pizza and they were all okay.  A few people had told me that they made \"incredible\" pizzas, but I didn't really think so...I'd say they were pretty good pizzas.  What I liked were the fresh tasting vegetables which topped some of the pizzas.  The cheese was a bit disappointing, especially since I don't think you can really go wrong with cheese...it just lacked flavor.\n\nAll in all, I probably wouldn't go back...it just really wasn't all that impressive.", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 3, "date": "2009-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9l6rz1t9n5Pp415MOPNyhw", "review_id": "vm-fGNe_fDuKktI-JDPnHw", "text": "Came here on a vacation and have never tasted a better pizza. Service was absolutely incredible. A bit pricey, but we definitely got what we paid for.", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 5, "date": "2014-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bZ_VH7x3FJFaqtBYumSgRg", "review_id": "cp3Ts7tB1LcIR35KWWfHjA", "text": "Mexican making pizza ? This place has a very weird atmosphere , staff was awkward and weird. NOT TRUE NEW YORK PIZZA. This is a chain of restaurants so that should say something. This place sucks save your money and go to Ray's pizza or Isa Pizza or even Barrows pizza .", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 1, "date": "2015-05-28", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "ohRev2g3tvXpV3gBnhC-og", "review_id": "DkTpGYf-F37pfelTkYYtAQ", "text": "Had lunch here withRobyn N. and Rand H. I had the #1 straw  which consisted of pastrami on a bun with saurkruat and and mozzarella cheese and a potatoe pancake.well the potatoe pancake was only 3 stars and the sandwich was not bad but not as good as scotts generations. I like deli's and this one did not shine over the others I have been to.", "business_id": "fmuj7u1gflmEjW-h0v9bwg", "stars": 3, "date": "2013-03-21", "type": "review"}
{"votes": {"funny": 7, "useful": 17, "cool": 6}, "user_id": "0bNXP9quoJEgyVZu9ipGgQ", "review_id": "G0XcFHnzidg_gJ4TWOY93A", "text": "I stopped by for a ham and cheese croissant two weeks ago, and I can't recall the last time I felt so ripped off.  I actually wanted to get my hazelnut royale fix, but balked at the price tag- $6 a piece!  After a few minutes, the male owner talked me into trying the croissant.  After he heated it up in the microwave, he charged me $8, plus tax, which I felt was too much, esp. for a croissant that is almost a day old.  I wished it was more crispy, but since it was microwaved, the bottom was very soggy, and only the very top layers were slightly crispy.  After a few bites, I perused through tthe take-out menu and couldn't find the croissant under the dinner menu; Instead, I found it under the breakfast menu- $5.95 with white sauce, and $6.55 with scrambled eggs.  So I was charged $8 for a plain ham and cheese croissant that was a breakfast leftover??  \n\nI left very disappointed with my dinner selection that day, and with ever-increasing prices, I won't be coming back soon, if ever.", "business_id": "wftoNIA0Q8nX-Da47psBCA", "stars": 2, "date": "2009-05-19", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "TvxFC55kyohNh-n-Yy4z5w", "review_id": "VaoQsClivhqaY_WanV8yXw", "text": "The guys that work at this place are super friendly. I work next door at so I come over occasionally for a sub. They have a deal that if you come after 4pm you get any foot long for $5. It's super cheap and a lot better than Subway. They actually slice the meat in front of you. The subs are still kinda mediocre, but for the price you can't beat it.", "business_id": "U2hhSRVHfBryKPNTgasprA", "stars": 4, "date": "2014-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8bFYurkTsTw_66YydugbfQ", "review_id": "aXJGXWROUrEdWij1C4Flaw", "text": "The pizza is pretty good and so were the wings but without good ranch, it just kills the entire meal.  I'll never understand how pizza and wing places can have basic ranch that tastes out of a packet.", "business_id": "VWcaFOSFcDwmFquycBzFyQ", "stars": 3, "date": "2015-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "d0wJVf7Gv7v1B-HHYhxZtQ", "review_id": "gjRRV94C-ZdbzbEu_XZ9GQ", "text": "Let me preface this by saying I was a \"sandwich artist\" once.  \n\nI ordered a meatball sub and typically they ask what kind of cheese you would like first so it can save the bread from the sauce so it doesn't get all soggy.  The lady didn't do it in this order AND put the meatballs right at the weakest part of the open bread - right in the middle.  Needless to say, when I got home 5 minutes later, the food was still hot but the sandwich was a sloppy mess.  I lost meatballs left and right and eventually just ate with a fork.\n\nI'm hoping that this isn't another change in procedure at Subway - I was very sad when they got rid of the U-cut, though it is understandably hazardous for all parties involved..  Meh, I still cringe at the memory of soggy bread!", "business_id": "9Dj2we91vaYDVhfq6t-Luw", "stars": 2, "date": "2015-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7nlZJW84Adt6oYn2shnn_g", "review_id": "jIa0tcbqDEcCLhcejlqIzg", "text": "Ambient - Casual\n\nService - The waitress/ cashier/ owner is very attentive and considerate.  Treats you like family.\n\nFood - Its good.  Although I'm not sure if they are cooking everything from their frozen state... I once had their chicken parmasean and it tasted that way.  I've also had their spaghetti and ravioli, I enjoy their sauce.", "business_id": "j0Uc-GuOe-x9_N_IK1KPpA", "stars": 3, "date": "2013-05-20", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 2}, "user_id": "dj-vs4rukH6dXWVpPOq0_g", "review_id": "QKzZthFMHMSXAGKSKnNeMA", "text": "So I came in earlier today... (8:30 on 5/27/15), and ordered a non-toasted Everything bagel with Garlic Herb cream cheese. There was a horrific line, but it was zipped through fairly quickly. After waiting for 5 minutes to get my food, the food runner (middle aged man with a European accent)  called my name and then confirmed... \"Everything bagel with plain?\" I was rushed and said \"Plain? It's supposed to be garlic herb?\"\n\nHe then proceeded to take my bagel out of the bag, open it towards him (so I couldn't see) and said \"oh yeah!\"  \"It's garlic herb?\" I questioned. \"Yeah\" he said, put the bagel back in the bag and held it out toward me. I laughed (somewhat rudely, I apologize) because the man roughly defiled my bagel while we were standing by the windows and then basically dismissed me to leave. I took the bagel (hey, I paid for it) and walked out feeling like it was a 3-4 star experience. \n\nI get into my car and drive off. When I finally got a chance to eat my bagel, I bite into it. Plain cream cheese? That guy CHECKED MY BAGEL AND LIED TO ME!!!\n\nI am not so much of a priss where my order cannot be wrong. It's happened before and I deal, graciously and more often than not just eating what I was given. HOWEVER, DO NOT LIE TO ME. He looked at my shmear, saw it was wrong, and told me it was fine.  Ugh!!!  If he's lying to customers, what else is he lying about? Not a good look my man. \n\nMy bagel is the EASIEST THING EVER to remake. I am SUPER LOYAL to Einstein's, but I am DONE with this location.", "business_id": "5Js9G0axfWhbYlB9UgXLww", "stars": 1, "date": "2015-05-27", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "tHz9cWxwSfcP4qRaPIHvww", "review_id": "IhQ7aVV79nBnG081Jhac9g", "text": "As I've said previously, I love Sacks and their sandwiches. Compared to the downtown version, this location is nice. The parking is a little confusing, since it is shared with another restaurant, but at least there is plenty of parking! Both outside and inside are pretty cool. I've always called ahead and had my order ready and waiting to be devoured. For such a delicious sandwich, the price is great. My fav is the Symphony - turkey, avocado, and bacon on wheat. Perfection. The employees are really nice as well. I like that I can get in and out quickly at this location (compared to the downtown location). I just wish there was a Sack's closer to home!", "business_id": "S8R5c7-plWe3NtmijYAJvg", "stars": 4, "date": "2013-03-01", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "u5NejIEXa3qZVTSB4lri_g", "review_id": "TWjyiT44tsd26pTKQHlpaA", "text": "I did give Pat's 5 stars, but there is one thing that I really hate and it just drives me crazy!  The food is too good that I don't know what to choose!  The pizza is just as good as any pizza place in NYC.  The appetizers and wings are fantastic.  If you have a appetite of a horse, you need to try the DiVinci.  It is a meal with three pastas!  You can eat there, but I prefer delivery.  After eating Pat's I can't get up from off my seat.", "business_id": "GvwDppcJLm9lso9iS2hSIw", "stars": 5, "date": "2008-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cmtJJRspbIYSLcYWAe-CKw", "review_id": "sa94XYGjynAZ2bhGS1BV_g", "text": "My husband had a taste for pizza and found Pats Pizza on Yelp and decided to it  since it was in the neighborhood and delivered.  Well lets just say we do not plan to order anymore pizza from here.  In our opinion,  the pizza contained a lot of bread and very little of everything else.  The pizza looks like toasted texas toast bread with some toppings on it.  I would recommend viewers to try for themselves though.  We really love Rosatis Pizza but is too far a distance and maybe we had too high of expectations when going to Pats.", "business_id": "GvwDppcJLm9lso9iS2hSIw", "stars": 2, "date": "2015-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8wvbovLW0Ip3UaY8QqZbLA", "review_id": "-R1eMMls7KGZCV1upMp7bQ", "text": "I had a great experience at Spinato's Saturday night. The food and service was awesome. We started out with garlic and cheese breadsticks with marinara. Orgasimic. :) There were three of us dining, and we ordered three different things to share. I have had their meatball pizza several times, and it is my absolute favorite. We also tried the baked spaghetti and meatball calzone with ricotta. Oh my! This calzone was like heaven in your mouth. It was awesome, but a tad on the rich side. A few bites of this were enough to share. We also got an Italian sausage and mushroom pizza. It was also extremely good. Our server was fantastic. She was attentive, and was very helpful in explaining items on the menu. On top of all of this, it was very affordable.", "business_id": "YldXB1hRpnE1CWLF3mvgpQ", "stars": 5, "date": "2011-05-22", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "7cR92zkDv4W3kqzii6axvg", "review_id": "fIDEptEHchjUsbrk5F-f4w", "text": "Nice little coffee shop. They have their own roaster, which is a big plus.\n\nThey have a nice large table, for setting up a laptop or whatnot.\n\nThey have ample outdoor seating, which is always a big bonus!\n\nThey tend to close on the early side; 7-8 PM, which, for a coffee shop is kinda weird.\n\nThey have delicious blended and iced drinks, as well as their hot drinks. They have a selection of bulk beans, but I have not tried any of them as of yet.\n\nThe Sunnyslope Art Walk happens in this shopping center, so that could be your opportunity to stop in and check them out.", "business_id": "4eFIVmbeCvJGCrhzmd-VYA", "stars": 3, "date": "2010-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "IhcTLLWKS6ZiNyIX9oQQPQ", "review_id": "o4k2QEjsQXaFhH-RTlDt9A", "text": "I have had food delivered a few times and each time it has been perfect.  I like that you have the option to get garlic bread and salad with your pasta entrée.  The pasta dishes are delicious as are the salads and garlic bread.  Everything is very fresh.  Also the delivery person is very polite and personable.  It is a bit pricey, but an enjoyable once-in-a-while treat and is so much better than the big national chains.", "business_id": "hIe65VALe8rxseYECVj08w", "stars": 4, "date": "2013-05-27", "type": "review"}
