{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "t95D1tnWvAOy2sxXnI3GUA", "review_id": "4ibY4fPQYM7FBSVPrvrYvg", "text": "Not the same Domino's pizza I ate too much of in College. Vastly different and a major improvement! Ordering on-line couldn't be easier, and pizza was made exactly how I ordered. Piping hot, flavorful, better than average crust, nicely blackened in all the right spots, tasty toppings, robust sauce. Friendly delivery by John. Price is fair. Much, much better than Pizza Hut!", "business_id": "x5Mv61CnZLohZWxfCVCPTQ", "stars": 4, "date": "2010-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ko8VZygoMdKmw5OKf2HmHA", "review_id": "hON2krqwND1q41T_tHY6fA", "text": "I was tired of going to the dealer for my truck, which is out of warranty coverage and tried Virginia Auto on the recommendation of one of my business partners. My truck had been shuddering and shaking badly at certain RPMs & speeds. The dealer diagnosed the problem as my catalytic convertor and replaced it. After driving my truck for a day, I could tell the problem was not fixed and even felt worse.\n\nRather than go back to the dealer, I thought it was a good time to sever ties and try some place new. They had to keep my truck a few days to fully diagnose and repair the issue and actually took the time to drive the truck, first to recreate the problem, then to be sure it was fixed. Doesn't seem like a big deal, but the dealer clearly did not do this. They kept me updated throughout the process (what tests they were running, possible causes and next steps), offered me rides to and from the shop and a loaner car when they had to keep my truck a few days. Turned out to be a spark plug issue, adding to my frustration with the dealer, as the technician there had even written, \"probable spark plug issue\" on my receipt/work order, yet failed to fix it. However, their lack of follow through and poor customer service forced me to find these guys, who I feel like I can trust, so all is good in the end.\n\nI went into the situation a little standoffish because I knew my fix would be expensive, but I left feeling good about the service I received. They also warranty their work, I believe it's 2 years/24,000 miles? I've been to other shops that will fix your car for cheap and do a quick-fix repair that will mask or even fix issues for a time. If that's what you're looking for, don't bring your car here. These guys work hard to find and fix the source of the problem, not just the symptoms.", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 5, "date": "2015-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ZHDv3b9ydYpLoG-Ez4HBhA", "review_id": "Rqd_QdZ56wvcR9eO-HTnEg", "text": "Wow, just realized my reviews were never finished... So, this is from a year ago at Thanksgiving.  Haven't been back, but would definitely try it again.\n*************\nWe just returned from a delish meal at Wild Thaiger, after reading all the great reviews.  I'm happy to say it didn't disappoint!  We had appetizers as well as dinner, and everything was sooooooooo tasty!  The presentation was pleasing, the portions outrageously large, and the service exceptional.  Granted, we did have the place pretty much to ourselves (being the day before Thanksgiving...).  Still, it was a great experience.  We'll definitely be back!", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 5, "date": "2011-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wUEp87FqOB9ew27Iz6zk_w", "review_id": "kS1jORvGYwCNJVyQY1CkMw", "text": "Ate here a few months ago and I liked it enough that I would go again. I ordered the pineapple fried rice and I had enough for leftovers that lasted me two more meals!\n\nOnly negative is that I came here with a guy that was an idiot, but that's not the restaurant's fault :P", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 4, "date": "2013-04-03", "type": "review"}
{"votes": {"funny": 4, "useful": 3, "cool": 0}, "user_id": "cc-NjTz637u7EtFd83dn_w", "review_id": "hvJUoHkDGqpTTj7WsKZFCQ", "text": "Eeeeee. Long yet important message to follow!!\n\nIf I was blind and If this place gave me the ability to see again.... Eeeeeehhhh I still wouldn't go back.\n\nThe first time I went, a few years back it was good. Good food! Then got take out and yeah, just well cooked good food. Nothing to write home about but still good. \n\nThis time... Wild tiger turned into wild sloth. Arguably just as cool in animal comparison but the tiger could, if he so chose to, rip apart the sloth with vigor. \n\nThe hostess was hard to find and inattentive. Se really wasn't present or rememberable. We sat down and ordered. Waters came out. Then our app. It was some roll thingy. It tasted like frozen shrimp wrapped in rice paper for 9 bux. Oh oh oh it tasted like the rolls you get at the sushi place in Safeway. Yea no thanks. Plus the waiter seemed to disappear. A while later the food was delivered. Hhmm. Pad Thai you say? Uh nope! Well if you call over cooked noodles shoved under a huge pile of cabbage pad Thai the yeaaa.. I guess. \nCurry you say.... Hmmm nope just over spiced over cooked and tasteless except for the over spice thing.., which is just down right confusing. \n\nThe waiter never came back to check on us. My lady dropped her eating utensil on the ground and I went inside to get another. Standing at the empty hostess station looking around....looking....still looking....oh oh hey  hostess can I have a.. She cuts me off. \"I'll be back\" denied!!!! By the drive by host from a terminator movie. \nWell waiting still. Find someone. Utensils. Cool. Thanks. Sorry to be a bother as a paying customer.   \nThen I sit back down. Take a few bites and realize everything tastes the same. Cold, over cooked and over spiced. \nSo in effort to try to salvage this meal I try to ask for some limes. Guess what... Shocker..... It took me getting up to find someone. Cool got em. Cool, great, not real limes. Just little ones, like the ones you use for Mexican food!! Wtf!!! \n\nAnyways. Forcing it down cuz I'm sick of the search party of two game that they have thrust upon us, the waiter still never came back. The lady bussing the tables cleared our stuff except for the untouched pad Thai. We actually tipped the bus lady she was nice and a very hard worker.\n\nStill\nWait\nIng\n\nOh wait I forgot the rules of the game.... I got up to search for the check. Yeaaaa! At what point do I win? And really what could the prize be?   Oh nothing. I guess you could say I win by not ever having to go back there. \n\nSad really. Was a good place. I understand running a place like this has challenges but no care was shown from beginning to end about the customer experience. Oh well except for the bus lady she was cool.... Maybe she should own the place? Winning! \n\nAnd I'm out!", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 1, "date": "2014-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ldEZDZxg0IWhQ-kWh6_3RQ", "review_id": "reihAUZXOnFd8ajJX0cynQ", "text": "My wife and I went to have dinner here for the first time. We arrived around 6:15. We were told there would be a 20 minute wait. As we waited we noticed several tables open. I asked about this and I was told they were preparing tables for a large group and once they were done they would assess the seating availability. The open seats were booths and a small table for 2 on the patio. A large group would not use any of these open tables. We Waite some more and when I went to see how much longer it would be I was told about 10 minutes. I reminded the hostess of the original 20 minute wait she originally stated that we were already beyond, and once again pointed out the several booths and tables that were open. She then tells me they only have 3 servers and that is why they're not seating all tables. If the hostess had been honest with me from the beginning I could have made the decision to wait or not. Instead my time was wasted. I could see the owner busy cooking in the kitchen. I would suggest she spend a little more time on the front. We wound up leaving and ate at a very nice place called Sushi Station. It wasn't Thai, but it's a very nice place, and the Sushi is really good. You should check it out. As for Wild Thai, I may give it a second chance, but the first impression has been made. I usually have my Thai fix at a wonderful little place called Sala Thai.  Great food, friendly owners and staff. The complete opposite from what I experienced at Wild Thaiger.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 1, "date": "2015-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e2JS6BmsZ6fWD0MR_kntuA", "review_id": "78o1xO-6CU0yd6Bs21bObA", "text": "A true Thai culinary adventure right in the middle of Phoenix, a must-see! All of the authentic flavors, smells and textures you'll experience from Thailand in the comfort of Arizona. They really hit the mark in every which way and more. All ingredients are always fresh with meals and plates made to order. Family owned and operated, true Thailand tradition is what chef Olashawn Hasadinratana-Weaver brings to each item on the menu. A great mix of food and drinks to enjoy, the atmosphere is also worth mentioning. There are an incredible amount of good things to try such as their signature Coconut Asian Pork and home-made Dumplings. Also try the Coconut Ice-Cream, Dragon Eggs, Beef Panang, Classic Pad Thai, Pineapple Curry Chicken, Mahi Mahi, Beef Mangone and much more.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 5, "date": "2015-04-26", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "i2QqqRhuc20r27y_fx59KQ", "review_id": "JIuX1wXmd3iKViZ4J-NAfA", "text": "Granted I only needed a new watch battery.  But I have to say this was a very pleasant place to stop and get the work done.  As others have said, Jaime, the owner and his wife were very friendly and inviting.  I enjoyed my 10 minutes there while he worked on the watch.  We had a very nice conversation and I will head back there to buy the next piece of bling for the missus. \n\nNice personal service deserves a return visit.\n\nGreat find.", "business_id": "cBH0kCvvUjQ9DBaAMUDSMw", "stars": 5, "date": "2013-03-09", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 3}, "user_id": "sEWeeq41k4ohBz4jS_iGRw", "review_id": "UJdZbgwUUwt4P08z3WVgWA", "text": "Margaritas were tasty but a little light on the booze.  Complementary chips and salsa were better than average.  Even though we didn't get any food the waiter still brought us a white chocolate with pecan mini tamale for desert at no charge.  Nice touch, just for that kind gesture I'll come back to eat.", "business_id": "e5kc0CQ4R-PCCDgb274gSg", "stars": 4, "date": "2008-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "AirVzN1BVQBmq5zY0YMNYQ", "review_id": "Ey2x8MZOUuh3-hZQfZwuag", "text": "I was at Sam's for a work dinner with a group of six.  I couldn't believe that I had never been here before and I was excited to try a new place, so I could Yelp about it, of course!\n\nMy co-workers and I walked up on the wrong side of the cafe and came through the patio area.  Normally, I don't think this would have been a problem, however this night they had the majority of the patio roped off for a private function and we looked like we were trying to crash it.  Oops.  No harm done, they still let us into the restaurant.\n\nWhile waiting for everyone in the group to arrive, the two girls at the hostess stand were watching us with little to no expression on their face.  I felt a little uncomfortable, they were not friendly and welcoming by any means, but they eventually sat us none the less and our service was great from there out.  We decided to sit inside as it was a little warm outside.\n\nThe server was nice and even joked around with us a bit.  I ordered the Orange Beso margarita.  It was good, since it was made with vodka instead of tequila, it wasn't quite a margarita for me, but hey, it tasted good.  Since they drop off the shaker so you can refill your own, it was the margarita that seemed to never end.  That made me happy!\n\nPlenty of other people have mentioned the cool assortment of chips and the great salsa so I won't get into details.  I just leave it that I loved both!\n\nFor my meal I ordered the Black & Blue quesadilla.  It sure was yummy!  The steak was cooked and seasoned perfectly and as I've mentioned in many other reviews, the right amount of blue cheese is always a winner in my book.  This quesadilla was right on the money, not overpowering with the blue cheese.  I ended up taking half of it home.\n\nAs plenty of other reviewers have mentioned, the white chocolate tamale was great finish for the meal.  I'm not so big on desserts, but I usually crave a bite or two of sweet to finish lunch or dinner and this did the trick!\n\nI can't wait to go back on the weekend to relax on the patio, drink some margaritas, and try more food.  I think next time I'd like to try some tacos . . .", "business_id": "e5kc0CQ4R-PCCDgb274gSg", "stars": 4, "date": "2010-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "oQZeITmS8rppOi9YukhbaQ", "review_id": "6xRh-q-tA9D98Rc5DYxF1w", "text": "This place sets a new bar for complimentary chips and salsa. The chips are a cornucopia of crispy warm blue corn, white corn, four, sweet potato, and wonton style flavors sprinkled with yummy seasonings. The freebie salsa is thick and delicious, far beyond freebie grade.\n\nThe Grand Canyon frozen margarita was tangy and superb. First time I've had a margarita dressed up with bits of fresh orange zest.\n\nThe table-side guacamole is pretty good. I think I'll ask for extra spice next time.\n\nThe outdoor seating s great...overlooking the courtyard mini waterfalls & fountain.", "business_id": "e5kc0CQ4R-PCCDgb274gSg", "stars": 5, "date": "2012-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "THYIqfnLV54VZ_v2hCfq2Q", "review_id": "snDPgGi6OUl1LHdsuN9OjA", "text": "This is a perfect low key relaxing restaurant with great southwest food outside the usual tacos, fajitas, etc.  I sat outdoors today and there were kids present but it was quiet, and relaxing.  I ordered the southwest Caesar salad which was a perfect variation on a classic.  I then received my entree the Santa Fe stuffed chicken breast.  So flavorful and huge!  The asparagus was cooked perfectly.  I also got a free dessert for checking in on yelp.  There are small remnants of the previous Sams cafe but it's the good things.  Staff is friendly and low key.", "business_id": "e5kc0CQ4R-PCCDgb274gSg", "stars": 4, "date": "2015-03-22", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "1WETDRBnnaslCNteq4pcIg", "review_id": "Otr9PvcefaRfzynCqVNjaA", "text": "The desire to bring my mom here is damn near overwhelming.  Victorian antiques, kitschy decorations, and brocade wallpaper - and did i mention fantastic scones with Devonshire cream?  I'm not even a girly girl (look for me slurping Irish breakfast tea in a Dramarama t-shirt), but I just can't help feeling frilly and feminine in this place.  Spot on, my good man (translation: 'aw, hell yeah', for those less pasty).", "business_id": "gBcpDl0quCLABsg5OuSFww", "stars": 5, "date": "2009-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "nkF7xDv8v-HITsU8KvrjNA", "review_id": "iFx68BdVBZWyQIUSUQ82lQ", "text": "A colleague of mine who used to work in Phoenix recommended a visit to the Heard Museum and, wanting to indulge in a little bit of culture that wasn't an art museum per se, I knew I had to stop by.\n\nI've never been to a museum solely dedicated to Native American history; I've only seen small collections in art museums.  The Heard's collection is amazing:  everything from a thousand year old pottery to Navajo rugs to an exhibit introducing the visitor to each of Arizona's many tribes.  Many are interactive and include activities for kids.  I can see this being a great place to take children to.\n\nBeautiful building and wonderful collection.  I hope the Heard continues to do well and educate the public on Native American history.\n\nQuick side note:  Excellent little cafe, stop in for a bit to eat after exploring the museum.  Don't forget to pop your head into the gift shops, either.  Beautiful pieces, but really expensive!", "business_id": "SG_gEmEXL4ID6RAEinC5Bg", "stars": 4, "date": "2011-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XKJtY1e-RX7AqehW88kYHg", "review_id": "QzFjn8_tIu-JUjQ8H_Ss-w", "text": "This was a very interesting museum. There is a lot to look at and learn. The people were very gracious and knowledgeable.", "business_id": "SG_gEmEXL4ID6RAEinC5Bg", "stars": 5, "date": "2015-05-28", "type": "review"}
{"votes": {"funny": 7, "useful": 2, "cool": 1}, "user_id": "66tWp8ThwPATFUxYNPyYLw", "review_id": "AF_zKhFM1Vbi2NN6m3TxAA", "text": "Are you a douche bag?  Do you have more money than sense?  Does it make you all warm and fuzzy to way overpay for a mediocre drink?  If so, Majerle's is the place for you!  \n\nPersonally, I never cared for the \"owner\" when he was with the Suns, and this establishment has done nothing to change that opinion.  The food is bland at best, but for the prices it should have a little flavor.  I'm not sure what criteria the staff uses when deciding who to grace with their presence, but the female servers sure weren't responding to me (a woman) even when I held out a $20.00 - my 6'3\" friend had much better luck, he was the one that had to order my drink.  \n\nI'm disappointed, this is such an easy place to hit on a light rail pub crawl or before or after a game or concert, but I just don't think I can bring myself to go back willingly.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 1, "date": "2009-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S3Mu8tTBib4KxrxGob5icQ", "review_id": "8BqFOKqO8tpzdG-4udmJhA", "text": "Very good food and nice atmosphere. I tried the tenderloin sliders and they were fantastic. My daughter had the kids meal of chicken and fries and she loved the flavor. We also ordered dessert of the chocolate eruption which had cheesecake bites in it. That was worth the calories. :D\n\nThe only downside is when it got busier we were a bit ignored by our waitress. Took several tries to get her to come over. Other than that, the entire meal and service was  good.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 4, "date": "2012-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kBaItLrRUKJ6_K5xzNo7_w", "review_id": "0R2CfvvoIUgJ8fRF_r8Vbg", "text": "HUGE disappointment!!!! Stopped for a quick dinner before a show. Ordered 2 burgers medium. They came out extremely well done & the buns were hard & dry. The waitress took them back to the kitchen & returned with 2 more well done burgers! What the heck?! When we told her (& showed her), she apologized & took 20% off the bill. We didn't have time for round 3. They didn't even send a manager over. $30 for an inedible meal. We will not be back. I'd recommend trying somewhere else.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 1, "date": "2014-05-28", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "EKwGhgLrM18ErVKKeYE2UA", "review_id": "Pln10jGHy-z2hsA5RmdHdA", "text": "I stayed here once in July (didn't know the fan was what would keep us cool at the time) because it was close to an event at the Orpheum that I was attending very early the next morning and I got a super cheap deal. \n\nI thought the place had charm and was told of the about the ghosts who haunt the place and all the celebrities who had once stayed here at check-in. Fun place to stay if you're doing something downtown, but not anywhere I would stay if I was looking to book a nice relaxing weekend.", "business_id": "_yfprBETaYgySkKyl8ZWMQ", "stars": 3, "date": "2009-03-24", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "8L42GplpDuiX7WUEUf6AMw", "review_id": "Ar6FlbLEK8TTKGg_RfJCeg", "text": "All I have to say is, should've listened to the reviews before staying here. Lol. \n\nFIRST of all, the front desk service was OK. Though they didn't explain much and basically just said sign here here here. Umm ok. \nSECOND, the rooms are  small but not too small--except the shower. \nTHIRD, the bed was super comfy and a lot of pillows  \n\nOk, now the bad part.\n\nI was asleep (well trying to), THEN I  heard moaning. Then it got louder. The people next to us were having sex all night and all morning, TF? That's how thin the walls are btw. \n\n2 stars. Never again.", "business_id": "_yfprBETaYgySkKyl8ZWMQ", "stars": 2, "date": "2014-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "pKMZ8ZoPYPq3NrtQVEQ5yw", "review_id": "srDW5bj0gnCut6HEHTx3CQ", "text": "We were at IHOP for Easter breakfast because our big plan for going to Matt's Big Breakfast was squashed when we drove by and discovered that they were closed that day. So, a little disappointed, we turned around and hit the IHOP on Central that we had passed 5 minutes before. We already knew the quality of the food would be fine, as all IHOPs are fairly consistent. But what impressed us was the friendliness and happiness of the staff that morning. We walked in and were cheerfully greeted by Anita at the front register. She looked around and seeing all the staff was busy, she bussed a table for us and sat us immediately. We were impressed right there. Then we were served by Kamal, who was super friendly, attentive and in a great mood. But it wasn't just the 2 people we had direct contact with. Must have been the Easter spirit or something, but the whole staff seemed to have smiles on their faces while we were there. We kept noticing and commenting to each other how odd it was to see happy restaurant staff (how sad is that?) I can't remember the last time my boyfriend and I went out for a meal and called the manager over to tell her that we were thrilled with the service. On a $22 check, we left $35. Well worth it.", "business_id": "P7wKlbSRsoRrfH3DFOY08A", "stars": 5, "date": "2010-04-05", "type": "review"}
{"votes": {"funny": 7, "useful": 8, "cool": 9}, "user_id": "4lkTIhTuMhLprQprGlTRlA", "review_id": "R4YjhE93C3fbWkVio1LrJw", "text": "There's no better way to undo a 3 mile morning walk than to end up stuffing your face at the Comedor.  This place is muy grande and could be the perfect spot for a very very large dinner party. The parking lot is huge and is tended by courteous security guards who welcome you in at the door. The menu is extensive and offers some unusual items such as Chicharrone (pork rind) and Nopales (cactus) dishes along with an interesting   Caldo de Mariscos (Seafood Soup). Great if you're looking for some food adventure! Que suave~\n\nI started my post walk lunch with a cold Pacifico that came with a large frosty mug. Man that beer went down good!  The chips were delivered warm with a side of chili tepin style salsa.  For starters, we ordered the Frijoles con Chorizo dip. I'm not huge fan of chorizo but really enjoyed this dip. The chorizo was mild (not greasy at all) and was served with oven toasted chips topped with melted cheese. We shared a plate of the Chili Verde con Papas which is a rich green chili sauce with chunks of beef, potatoes, and onions served with refried pinto beans and tortilla. For our other dish, we had the Chilaquiles Y Huevos. This dish was the main reason we went to Comedor and it didn't disappoint.  This was layered corn tortillas soaking in a red chili sauce and topped with two over medium eggs and served with a side of frijoles and warm tortilla. The only problem I ran into was eating way more then I should have. It must be a good sign if you waddle out of the place whining and holding your gut.\n\nI'll be heading back very soon to try the Nopalito dish and the Pescado Entero Tilapia; Pan Freed \"whole\" Tilapia. Can't wait!", "business_id": "BESmH-lmMm34_EefL8X9fQ", "stars": 4, "date": "2009-03-09", "type": "review"}
{"votes": {"funny": 6, "useful": 11, "cool": 10}, "user_id": "8dbRf1UsWp2ktXHZ6Zv06w", "review_id": "C-WeymwLb1xJGomNCklnWQ", "text": "It was the 2nd meet up for The International Supper Club and this time Comedor Guadalajara was the place to be!\n\nFrom the outside, you are not quite sure of what are you are getting into, you walk up to the place and you see a huge concrete pad that looks like it's used for outside parties maybe?  You go through the doors and then are shown your table and your mind is thinking how is it possibly this is the same building you were looking at on the outside.  It's huge, and opened, and I didn't even see the entire place. It's well lit and the colorful! A very nice surprise!\n\nWe were a party of 8 and our server was Maria, and she was amazing, she made sure we had everything we needed and more. When you 1st walked in the podium for the hostess says NO SPLIT CHECKS, so our party didn't even ask, we would have figured it out, but when it came time for the check, Maria had already split them up for us.  Love great service!\n\nThe chips are fresh, the salsa, well for me it's perfect! I could have stood it a tab bit hotter, but it had the perfect bit of heat for me, but for a fellow dinner, it was too hot for him.\n\nOrdered a cheese crisp and some guacamole for appetizers and the cheese crisp was just that, a cheese crisp nothing too exciting to write about, but the guacamole, omg it was soo fresh tasting, I loved that stuff!! I think I might have even licked it off my fingers, I'm sure I could have eaten the entire bowl myself  (or did I).\n\nOne of the Wednesday night specials was a poblano pepper stuffed with cheese and topped with green chili sauce with grilled chicken, and it came with beans & rice. OMG AMAZING!!!!!!!!!! I didn't even see it on the menu but damn I want it again! The pepper was fresh, the green sauce was delish, and the grilled chicken just tied this dish together! The beans and rice were perfectly cooked. AMAZING!!!!\n\nMy meal filled me up pretty well, but I did order a churro, and it was the perfect way to end a great meal. Love churros!!! Warm pastry stick covered in cinnamon and sugar. Oh yea I went home a happy girl for sure!", "business_id": "BESmH-lmMm34_EefL8X9fQ", "stars": 4, "date": "2013-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pPc30H6hGXeUO23Hb7wrSw", "review_id": "OAqgPPDI_Me2NiARe1ioEg", "text": "Amazing!! Top notch customer service and delicious authentic Mexican food. I love the fact that there salsa is actually SUPER HOT and not mild. They have good daily specials . I recommend the parrilladas, and the enchiladas. The beans are to die for !", "business_id": "BESmH-lmMm34_EefL8X9fQ", "stars": 5, "date": "2015-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r8nui9jtCqLJvU8IJfUZsw", "review_id": "wZOdkhjz1dN78hPgTjxJSw", "text": "I have been along with my friends to several events at this Theatre and every time it has been a pleasing experienced, they offer good quality shows for a decent price.", "business_id": "X9ih9Iotd-VEZ8tTYfoarw", "stars": 4, "date": "2012-05-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "oXnp_Gn9sdL3dJ_nauxfig", "review_id": "R0Fx8VmO9A79D4eeG4kurA", "text": "You're joking right? \nWent here for Taco Tuesday and I have to say; Worst Taco Tuesday EVER!!! \nDon't be lured in by the $1.29 Tacos, go somewhere else. \nThe Chips were very basic, and the salsa bored me. My 3 Tacos came out and I didn't quite know what I was looking at. \nAre they hard shell or soft shell? Why did they put lettuce and cheese on them? \nThe Shells were OK, but the meat was a poor attempt. The Shredded Beef was mushy, no flavor. Chicken texture was ok, but no flavor. Ground Beef? What is this stuff? Mushy as hell, no flavor at all.....", "business_id": "D09yG6Z3gcsh24Qn7Y4gYA", "stars": 2, "date": "2015-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "GhwQHsKCeHEdGfVRnuWX5g", "review_id": "tcj1CH3OxDG9iY3pOEyB9A", "text": "I followed the trail left by fellow Yelpers and this was as accurate it goes. \n\nAmbience: There is not much to it. Even the owner admits that much. However, it is bright and open. Most of all, it looks welcoming.  \n\nFood: It's very good, but most of all, it's excellent bang for the buck! The teriyaki is not too sweet and it is well seasoned. I ordered the chicken fried rice with Iced tea. It was great. The iced tea comes with unlimited refills which the owner often reminds the customers while I was there.\n\nService: Although it is a \"self-service\" restaurant, the owner and staff was extremely helpful to a fault. She refilled my iced tea a couple of times.\n\nI will return for sure. The owner did take her time to talk to most if not all her customers. If you are looking for a friendly place with good food, this would be it! It definitely does not hurt that the food is very affordable.", "business_id": "kaIue7GRCmkPzDeHDBTttQ", "stars": 5, "date": "2012-04-20", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "o33IBagNFxdJhIrRTl691Q", "review_id": "irbwgWJfaQixllQqsC6PSg", "text": "The places I hate most in this world are those that can't figure out what they want to be.  Coach and Willies is the epitome of this syndrome.\n\nWe came here for a meal, some drinks and to watch March Madness.  Boy what a mistake.  Being near the stadiums, I figured this place for a low rent, liquor up before the game place.  I should have done my research. This place desperately wants to upscale.  From the prices to the menu, it screams 'Look! Aren't we above the fray?' Well you know what, places above the fray don't have 87 TVs tuned to sports.  They also don't have a waitstaff that approaches you with a 'What's up yo?'  They also don't have facial tattoos.\n\nBut I was alright with delineation of style initially as the pizzas were half off.  But of course they were doughy and meh.  Well at least the games were on and the audio was being pumped in through the bar's speakers.  Oh wait, at 7 they turned down the lights and changed to some crappy R+B radio station. I guess that crowd who was coming in to get their 5 course wine and food pairings didn't want to listen to the game.  Why exactly they came to Coach and Willies then, I'll never know.", "business_id": "j8nyAaN_w5t6wYv-ni23sg", "stars": 2, "date": "2009-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "V2dNkzZOk61E-ChEOwDlxA", "review_id": "6KsE-4w6AkJhzgrm0JB8Ug", "text": "here's the deal. fate is costly. the drinks are costly. the food is costly. the atmosphere, quality,  and service are priceless.\n\ni don't mind waiting forever for something that is worthwhile and fate is.\n\ni have only been disappointed in one fate experience and it had more to do with being in a large party in a small restaurant. \n\ntofu is amazing.", "business_id": "VsO_rhXi5lgbaGxNwoEZsQ", "stars": 4, "date": "2008-03-08", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "j8ocPEVty-EEYQk_Zeldyg", "review_id": "Pbpcqczp2KiOn0xqZaGAvA", "text": "Six of us stopped in here for lunch earlier this week.  Our service was actually quite good, maybe because we got there at about 11:30.  An hour later the place was jam packed.  They do have a take out counter if you're in a time crunch.\n\nThey had quite the variety on their menu, Greek, burgers...even grilled cheese!  My friends told me they'd disown me if I ordered grilled cheese at a Mexican restaurant, so I got the chicken fajita salad.  This salad was so big they had to carry it out on it's own platter.  The chicken was cooked perfectly and all the veggies were fresh.  The other folks at my table ordered some of the $6 specials of the day (tacos and burritos) and those looked really tasty as well.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 3, "date": "2010-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7o7MF9B9lxcWupE8jiLOaQ", "review_id": "-Xf11cS9AmDzdph2qTl1bA", "text": "This place is pretty cool. It's a real chill atmosphere and there aren't an overwhelming amount of people there (which I like!).\n\nI showed up to meet some friends on a Friday night. The inside is great, there is a big horse, a small stage, and a bar maned by a fun staff. The decor isn't fancy, but it has character. A band was setting up getting ready to play. I would have loved to hear them, but my friends were outside so I headed there.\n\nOutside there is a big patio. It was a little chilly, so there was a fire goin' in the firepit. There was also a musician outside, so I wasn't missing out on entertainment. She was playing calm, folk acoustic, making the mood of the night even better.\n\nThe group of 7 that I was with were able to sit comfortably, there was plenty of room. We enjoyed good conversation over the music and weren't bothered by wanna-be types trying to be cool. All of the customers and staff there seemed very down to earth.\n\nGreat atmosphere, decent prices, and cool people.", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2010-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tNxNMmLZmCF2A_PXcSRVLw", "review_id": "6kGOFU37LlVmPsFFJq9cJw", "text": "Great service, ok food, average chips and salsa. \n\nFOOD \nThe chips and salsa are very average. Large tortilla chips and a pretty mild salsa with huge tomatoes in it. \nI've had tacos, enchiladas, burritos and cheese quesos here. As pointed out in a previous review, the food here is very Americanized Mexican food. Everything is pretty bland and mild for Mexi-food. Bean and rice are your stereotypical refried bean and orange Mexi rice. The cheeses are a little greasy. \n\nSERVICE \nOur waitress was fantastic. She gets 5 stars. We had plenty of chips and salsa, and our drinks were never empty. She was friendly but not overly pushy. \n\nAMBIANCE \nIf you're looking for quiet and romantic, don't come here. The restaurant is very open and the acoustics are awful. The decor is simple with Mexican flare, but not terribly gaudy. \n\nOVERALL\nGreat place for a quick downtown lunch if you don't mind Americanized Mexi-food that could be cheaper.", "business_id": "-lOSaCuBRAvX5JBifx-EMw", "stars": 3, "date": "2009-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ND9akstNWE8r6zcjgr8ymQ", "review_id": "222xsa1oqDwGQjMKIfIn1g", "text": "Every trip I make to Phoenix and stay downtown I plan at least one meal here. The green corn tamales are my favorite. And the home made salsa is to die for. A great happy hour and friendly staff makes for great casual dinning. I'll be back!", "business_id": "-lOSaCuBRAvX5JBifx-EMw", "stars": 5, "date": "2015-03-20", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "y2ClTl6I-utHQ4Les8zGTQ", "review_id": "1F5853udo_1UR9xXMr0R-w", "text": "Brittany, you are a TERRIBLE waitress. You should find a job that doesn't involve customer service.\n\nMy friend and I were super excited today for Wing Wednesday ($9.99 all you can eat wings). We walk in and are greeted instinctively but the female bartender who also tells us to sit wherever. I choose a table next to the double doors that leads to the outside seating area. For 10 minutes we sat there without even so much as eye contact or a smile from any of the waitresses. I see that there are two moderate groups outside (6-8 people each), but don't give it a second thought. Still no acknowledgment from anybody. After 15 minutes, my buddy walks up two managers who were fiddling with a tv monitor and 3 other waitresses surrounding them. My buddy goes, \"Umm, can we get some service??\" The female manager immediately appoints someone to go to our table. \n\nThis blondie informs us that **Brittany** is our waitress, but she would take our first order. A few minutes after she takes our order, the lovely Brittany shows up. We had already watched this girl walk right past our table about 10 times back and forth prior to talking to the managers. She apologizes, like a child whose been forced to do so, for \"not seeing\" us. A) Simple acknowledgment would have sufficed. B) My buddy is a BIG tall guy with a mohawk wearing a bright red shirt. How the heck could she not have seen us? She then makes a pathetic attempt to explain that she got slammed, and says that she will now take our order. I tell her that our orders have already been taken. We get our first round of wings in a fair amount of time after the order was put in by Blondie. I asked for ranch and never got it. My buddy's cajun wings were too salty so he only ended up eating 6 wings. Brittany came back and only asked to refill my friend's drink. He told her Mr. Pibb, and she brought back coke. She took his plate away and didn't bother to ask if he wanted more wings since it was all you can eat. He's a big guy!!! Oh that's right. She didn't take our order so of course she didn't know. Shortly after I finished my own round of wings. Typically, the girls will see that you have finished your wings halfway and immediately ask you if you want the next round put it. No one asked us this. So I finished my wings and asked my friend if he wanted to go or keep hoping that the service will improve. BTW, those big tables were long gone by then. It was actually pretty empty by then. The whole time we just watched Brittany try to calculate her tabs and collect her tips. \n\nMy friend wanted out, and he said he'll refuse to pay if they asked us. We head straight to the door and NO ONE bothered trying to stop us. Instead we heard Brittany,\"Sorry guys.\" as we left. They knew what was going on. This is the very worst service that I have ever had. I would have still tipped had we stayed til the end, but it was so terrible. My wings weren't even that great. \n\nIf you come here, and you get a girl that is tan, has shoulder length curly hair, and is named Brittany, ask for another waitress.", "business_id": "qsWxbgQwuomXvMseg23DGg", "stars": 1, "date": "2013-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "b4C9E7vTJrOdkJQA86xYSg", "review_id": "cZK5gylqusNKH3XyH4O5Ig", "text": "I agree with what other reviewers are saying when it comes to the quality of food.  While it does not blow me away it is not that bad or should I say consistently average.  I have not disliked anything I have had here.  The servers are always friendly and attentive and seem to handle really large groups very well.  The bar is pretty cool and they do make a really good margarita:).", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 3, "date": "2008-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Shbh-dhEjU4J50HHkParLg", "review_id": "5pE_LLmqYppU-cOBgnxbJA", "text": "I went to the OSF yesterday for lunch.  I ordered one of their classic dishes, the Lasagna.\n\nThe service was fast and friendly.  The serving was good size and came with a drink, salad and a small loaf of sour dough bread, all for around $12.  The lasagna had plenty of cheese and a meaty sauce, but was laking in taste.\n\nA lunch menu was available and would have been a few dollars cheaper.\n\nIf you are looking for a quick and affordable place for Italian food, The Old Spaghetti Factory is a good choice.", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 4, "date": "2012-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S5pCl_bY4ztkNuy5lkTYtQ", "review_id": "7S5OgE83HR5zXVFpZVkLSQ", "text": "Our spaghetti was fresh! What a hoax!", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 1, "date": "2014-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vI0iWoZ91TIVzKzTUCSiZA", "review_id": "7vqEDOf-5Xt4vdPC5TbD2A", "text": "Been here several times. Love the food, garlic miztheria is my go to. The bread and salad are amazing too. My daughter's favorite place to eat. Not a close drive, but worth it. Can hop on the light rail for a game too.", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 5, "date": "2015-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1wAuDjwzId30Kx4GUGZoWA", "review_id": "GIuMtWjAhj06szzF66aD2w", "text": "The BBQ pork tacos at $4 (for 2) on the happy hour menu were good sized, delicious, and quite the deal. Paired with a Four Peaks ale made for a tasty and inexpensive night out.", "business_id": "2I666dqzs1XB6xigIKa9bA", "stars": 4, "date": "2015-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8ZchNx1nHZMXe1WpVTbDcw", "review_id": "PT5xEwzzw4G3RkoVDz8yIQ", "text": "Great place to get a good hand car wash.  Much better than a machine and worth every penny.", "business_id": "Li5LOL873Ep8HoPRML18sw", "stars": 4, "date": "2011-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nGN2BkSFA2CbasaIqJ-7Pw", "review_id": "10UWGUOHYKTTbURJRl1Nag", "text": "Back again a year later for Spring Training and these guys still have great, friendly service. My go-to car wash in Phoenix. I drove across Phoenix and 15 minutes out of my way to come here!", "business_id": "Li5LOL873Ep8HoPRML18sw", "stars": 5, "date": "2015-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "yuPBS3fak77lgwO_9SXVYQ", "review_id": "F4DIYG4R8ZulZciPLMByKA", "text": "** Update: I still LOVE their food here, but I always seem to get attitude from the man behind the steam pans. For example, I walked in today for their chicken enchiladas. He gruffly barks at me, \"We're out!\". Ok buddy - take it easy - I order their homemade chicken noodle soup instead which I lOVE.\n\nNOTE: The staff at cash register are *always* friendly w/me and joking, it's just the man w/the moustache who is a bit prickly. He has a sour scowl on his face everytime I'm in there.", "business_id": "9BH18avE46LlHMvJn67MaA", "stars": 3, "date": "2014-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m-KukDHoMGdkmE74hUsc4g", "review_id": "HcoZ4holAl0nJQEz-Mj3xw", "text": "I'm going to keep this review very short and sweet because until yesterday, I never really felt compelled to yell from the rooftops about Zoe's meals. Especially for my fellow vegetarians.\n\nBut the tides have changed, my friends. Yesterday, because they are close to work and I was starving, I decided to hit up Zoes for the only thing I ever really eat there - the Grilled Pimento cheese on rye which I highly recommend! Sometimes the cheese doesnt melt right and its lumpy but the flavor is divine. No boring grill cheese there. The rye adds a lovely added dimension of grilled-cheesiness.\n\nNow for the new, sexier menu, there are a few more veg options. \n\nI had the hummus and salad plate and I was so surprised at the awesome flavor. The hummus was as good as my homemade hummus and the salad is very well done with real lettuce (no nutritionless iceburg here) and fresh veggies and of course, the requisite Zoe's feta cheese. The cucumber Raita was just the right touch. \n\nSoooooo tasty!\n\nNow I'm not a fan of any of their sides, till now. The Braised white beans are a dream. I dont know what spices they used (ginger maybe?) but I couldnt believe my tastebuds. So proud of Zoe's.\n\nTwo notable changes:\n\n1)There is now a separate charge to grill the Pimento cheese sandwich (10 cents - really????) in addition to the 22 cent price hike.\n\n2) Chips no longer come with the sandwiches but are an extra 65 cents. (cheaper than the vending machine at work still)\n\nEither way, I'm compelled now to patronize this little spot more often. Next time I'm trying the new spinach wraps...mmmm", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2011-03-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "uJmhtw96vwvggofqzJyi4A", "review_id": "plxsOl0rV_GBpYzjGH41eA", "text": "This subway is pretty clean and in a good place.  customer service is very slow and too crowded at times.  They try to hurry u up to chose but when u choose what u want they take forever on the rest of the stuff. it is a normal tipical subway but they do need more friendly people.", "business_id": "s6zzKc7UvwDRxn-BFlhiTg", "stars": 3, "date": "2015-03-10", "type": "review"}
{"votes": {"funny": 5, "useful": 9, "cool": 7}, "user_id": "eshIqohS-9FMLdKOhTr2Ng", "review_id": "RjJw7MaX-8Di1gDZRFJzQw", "text": "-- Great little Hard Rock Cafe in Downtown!!\n****Service and food were pretty good.\n  They even had a small fashion show going on the night of the 26th. :) \nVery entertaining!!", "business_id": "gkv2XvXpFgiq4Bb2XK7YmQ", "stars": 4, "date": "2012-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zwZytzNIayFoQVEG8Xcvxw", "review_id": "IMqYr8EPE_5zxuyeFZbgDQ", "text": "Good soups. They have stuffed peppers on Thursdays. One of my favorite downtown lunches.", "business_id": "If2DUhmWIvlu2JFc_rR-Bw", "stars": 4, "date": "2015-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dn9DSDp9CYCRffmL1voq6g", "review_id": "lBJehIlTzWSKTthPYKMQtA", "text": "Went here for Comic-Con.  Wow, lots of people.  We had a great time though and the Phoenix Convention Center was a great location.\n\nThe security was a little lax though.  That was scary.  We got into the building every day without going through security b'c we went up the elevator from the garage.  The first time we had no idea and it took us a while to figure out where registration was.  Total glitch in their security surveillance though for us to be able to get in like that!\n\nNonetheless, we had a great time.  It was nice and cool in the building which is always a plus in Phoenix!", "business_id": "F6BedoYgbAQHqwKX9F0zDQ", "stars": 5, "date": "2013-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "7S7-2K15mjuPDIqJn91szw", "review_id": "nzThHE-a7CaBnWh5qnnFbQ", "text": "\"The Duck\" as I like to call it never disappoints. This, as with all places downtown, gets pretty busy so I would recommend going earlier in the lunch hours. My two staple sandwiches are the fiery Italian (and it is) and a build my own with turkey and havarti. The fiery Italian is as it sounds, the usual Italian meats and cheese but it's their hot peppers that give it the extra something. Also, the quality of their products make it a much better sandwich than a lot of the other options in the area. The best part of the build my own is the champagne mustard. It's kind of like a honey mustard but possibly more delicious. If you are downtown and looking for a sandwich this is definitely the best option for quality and taste.", "business_id": "wki-Qlp3OWgH0XtZ-Jz_WQ", "stars": 4, "date": "2013-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uQNs3g8rXB9DcFg_jKiKUQ", "review_id": "wBiOXQttbWaXFbUnZpEXZQ", "text": "I was heartbroken on my last visit.  Rather than increase the price (which I would not have minded), They are now using frozen, generic steak patties instead of the fresh sliced prime rib.  I didn't see any of the novelty items (ie.. TastyCakes) and I think they fired their cook as the owner was manning the grill.  Too sad!", "business_id": "OoHWabV-ym7_HWlHeXTsVA", "stars": 3, "date": "2013-05-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-PiVf4t_cJ7orn1-H11hsQ", "review_id": "867U3UEnO_g5u9wkWbw7Dw", "text": "This is just sad. Half the stores are closed, and the other half are under rennovations. I walked away, as I was at the convention center, willing to spend a few shekles... and left annoyed at the state this center is in.", "business_id": "JIV4LF8KE8pAUnU28QAhIw", "stars": 1, "date": "2014-05-12", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "nc3cqVN0UuB3m50-CcMftw", "review_id": "ttEx8SNAFDmwEzdfEqF6Zg", "text": "Is this, like, the only place in midtown to get sushi? The portions seemed a bit on the lean side for the price, but are otherwise good. Nothing I'd had has been orgasmic, but nothing I've had has made me volcanically erupt. So, a good little sushi shop, for what it's worth.\n\nThe service tends to be hit or miss and we've not had to wait for a seat.", "business_id": "oSKT5oZX1NWYaHwOWL5lag", "stars": 3, "date": "2009-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "HY9qpAamqLXFoa7xMwNntg", "review_id": "OOP-0iZ2Shm3utN0WG5qmA", "text": "i used to visit this place a lot when i worked in the area, oh say, 4 or 5 years ago, and i got it again today for the first time since then and i don't remember it being this mediocre.\n\nlunch time, the place was packed. the line moved fast and my order go to me in a decent amount of time. i chose the bbq pork with fries and my friend suggested i get the peach cobbler. their bbq sauce is pretty good, but they don't actually put it on the sandwich. i prefer my bbq pork sandwiches to be soaked and dripping with juicy wet goodness upon first bite, but i got exactly the opposite. the meat was very dry and tough in most places. the fries were ok. the peach cobbler was warm but nowhere near sweet enough for a good peach cobbler - rather bland. \n\nyou can find better bbq in phx, try stacy's on indian school and 17th.", "business_id": "q1nDSpmV-FdTBNj6UuZvTg", "stars": 3, "date": "2009-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7nlZJW84Adt6oYn2shnn_g", "review_id": "w2szl_X_xSkX6Q7Z48kb2w", "text": "Love the food, but all this type of food can get you a bit gassy. :-P", "business_id": "q1nDSpmV-FdTBNj6UuZvTg", "stars": 4, "date": "2013-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wc8ug1dhhzXCW3GSTBQrIQ", "review_id": "pYdK53rDw1rydHVGyFr-4Q", "text": "Nah my fav food, fast food type of thing, I tried their breaded catfish , the was no flavor but tastes salty.", "business_id": "q1nDSpmV-FdTBNj6UuZvTg", "stars": 1, "date": "2015-03-12", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "kq5Pdsy8Znyh9KEkxWT_QA", "review_id": "gl4qxw6cbjmS1kDEwjRBEg", "text": "I recently visited Cheuvront on a Sunday evening. We were the only people in the restaurant, with the exception of the bartenders and wait staff, so you could definitely say that the service was fast. :) No happy hour on a Sunday evening, but we decided to test it out anyways. \n\nOne whole page of available cheeses, so if you're a cheese connoisseur (not me), this would be pretty exciting. If you're not, it's a bit confusing and overwhelming. We asked our server for suggestions, and we were pleasantly surprised with how knowledgeable he was about the cheese selections. Apparently, all of the cheese are flown in (no sure from where), and then held until they reach the prime age for serving. We ordered the three cheese plate with the Roaring 40's blue cheese, a sharp cheddar, and a Spanish cheese that I absolutely cannot remember the name of. All were delicious and were fantastic recommendations that paired nicely with our wine choices.\n\n We had also heard great things about the macaroni and cheese, so we decided to test them out. They have several variations on this old classic, so we chose to try the Blue Cheese and the traditional. The traditional was delicious- not overly cheesy (both literally and figuratively), and was baked. Yum! \n\nHowever, if you're on a tight budget, I wouldn't recommend visiting outside of Happy Hour. We ordered two glasses of wine, one soft drink, one three-cheese plate, two bowls of macaroni and a lasagna and found ourselves on the receiving end of a $70 bill. \n\nWhile the service and food were delicious, I thought that the price was a bit extravagant for the portion sizes. Overall, I enjoyed my experience, and will definitely return during Happy Hour.", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 4, "date": "2009-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "N6fXTxMFxtHntDZnEotAtw", "review_id": "y_3frU10oLIx0ooq79kaIg", "text": "Sadly, they have discontinued breakfast/brunch, though they are doing a really nice Easter brunch. Look for my next review of another place that does breakfast without the crowd,Carlys Bistro!", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 4, "date": "2011-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "-F32Vl8Rk4dwsmk0f2wRIw", "review_id": "ygehd-QF1mVj-AB_ydYnYw", "text": "As the public house cornerstone of the country's dullest downtown, it does not surprise me that Cooper'stown is as inert as a Swiss nationalist.  What is confounding is that the shock-rock nature of the bar's namesake allowed such a gimmicky, flat concept to be executed.  While AC is something of a badass, this pub does not reflect the image of his avante-guard style.  In fact, its just pretty generic.\n\nI couldn't even recommend this as a meeting-for-a-beer-before-the-game spot, as the set-up is awkward when you do not have access to a table or stool (and you likely won't), so while standing up in the bar, you often feel like you are in someone's way -- either the patrons fighting for elbow room to gnaw their sliders or the pitifully eye-made wait staff expediting that woeful fare.\n\nStill, to its credit, Cooper'stown has been a downtown pioneer, and everyone should give the beautiful warehouse building a hearty brick-slap in appreciation of its solidarity as a Phoenician-style Mos Eisley.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 2, "date": "2008-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QHWGKJlwpchGsEURbbSDKw", "review_id": "ANTezRs2Rzp2wabWDtmYqQ", "text": "I went here with my friend for lunch. The hostess (if that's what you'd call her) ignored the line of people to cash a tab for a server and didn't acknowledge us. I think everytime she sat someone down, she went in the back to stuff her face, because she took forever to come back. So finally when we thought we were going to be seated, she goes to cash another check and tells a waiter to seat us. He seats us right next to the men's restroom, so my friend went and asked the hostess if we could move and she said yeah sit wherever. Finally a server says he'll be with us, then a famale server takes our drink orders. It wasn't organized at all. Then my friend ordered a beer on tap and that didn't work. So she just ordered a bottle which was $5.00. I ordered the chili cheese fries. The chili came on the side, which I was glad for. It was pretty gross, it tasted like they put sweet bbq sauce in it and it's called volcano yeah right. I was very disappointed and will not return here. If you like crappy service and frozen, reheated food then go for it.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 2, "date": "2011-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "qQns9dP75RNOWOVWI_ZKZw", "review_id": "4WTG1-9mw8YHEyaTu8dQww", "text": "The prices are fair, especially for those attending sports events downtown. The food is very good, especially for BBQ fans. We tried the macaroni and cheese, which came with bacon and chicken, and had excellent flavors. The hot links are a nice, simple, flavorful BBQ sausage appetizer. We also tried the BBQ sampler platter, which comes with ribs, brisket, pulled pork, and hot links. The ribs were the best and are probably a good item to try as a standalone dish. The drinks come in huge ~32 oz glasses, so you probably won't need refills. There are plenty of huge screen TVs located around the dining room for watching sports. There are also many rock memorabilia pieces located around the restaurant.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 4, "date": "2012-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "9oYWYfQ1ubAPszRqjD3ukg", "review_id": "DY8nDNkAUIO0wd5Z47kJvw", "text": "You can get anything you want, at Alice's restaurant....\n\nHad out of town guests and we went there on a weekday. Arrived just as they opened at 11 and were immediately greeted by hostess and seated. Loved the \"decor\" and spent several minutes (well, actually quite a while) checking it out. Yeah, it's similar style to the Hard Rock Cafe, but that's to be expected. As for the food, well it was plentiful, delicious and fair priced. I had Cooper's Turkey Sliders and they were awesome. I really liked everything about the place and despite the 30 min drive will be back often (esp when we have visitors or go to the Sky Harbor). Location is perfect for before or after a Diamondback or Suns game. Awesome classic rock playing made it even better!\n\nOne suggestion: this place would be even more fun if the staff looked like they enjoyed their jobs. Not a lot of smiles or friendly small talk.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 5, "date": "2014-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "1Y0o8Z0OuFfI2F9hKvyhTA", "review_id": "loTF-kqhhNKiQweqqFIFBA", "text": "Great sports bar type of place just down the street from the Diamond Backs Ballpark.  The service was great!  The Bacon cheeseburger, sliders, chicken strips and the low carb \"Sonoras\" chicken breast were good.  I would like to have tried their famous \"Man vs Food\" Big Unit, but that would be sure to put me in cardiac arrest.  \n\nWorth a visit if you happen to spend time in Phoenix.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 5, "date": "2015-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "90a6z--_CUrl84aCzZyPsg", "review_id": "nwuUplTVj_f64poUCOMRgA", "text": "Walking distance to Chase Field makes this a popular destination. \n\nThe Mexican food is very good, the drinks are cheap, they have a huge outdoor patio, a large bar area, and you can wobble over to the ballgame when you're finished.\n\nIf you get here early enough you can park in their own private lot for free.", "business_id": "eK6KGMKqU_4nB9RdayZD7Q", "stars": 4, "date": "2008-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "66tWp8ThwPATFUxYNPyYLw", "review_id": "sIanEber2dA5K7C-6JMx4A", "text": "Other than the fact I can't get used to the new name, not much has changed at the Arena since the days I was a regular at every Rattlers home game.  The upper decks still cause heart stopping vertigo, the bathrooms have too long of lines and not enough toilet paper, and the concessions are the wrong temperature and way too expensive.  However, that all comes with the territory of any arena type event.\n\nMost recently I saw the Billy Joel Elton John Face to Face concert here.  My tickets said \"Obstructed View\" but overall, we still had a decent view of the stage.  The large screen projections made up for the height we were at.  The sound was good and the concert itself was amazing.  \n\nThe biggest problem I have is with the actual concession stand staff.  Is there a rule I am unaware of that forces these people to take 15 minutes to ring up a beer?  I understand the \"I have to pour this into a cup\" taking a minute, but it's like the longer the line gets, the slower these guys work.", "business_id": "uFJwKlHL6HyHSJmORO8-5w", "stars": 4, "date": "2009-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ek_t82OUnerdlO0D-GVcxA", "review_id": "YHEam6SfTZo2kFQvHflLIg", "text": "wow this theater is pretty big and nice! Saw the Muse concert here this past Saturday and it has very clean restrooms and a different concession stands - even though my bf had VIP tickets to the lounge with complimentary dinner, I still noted that they had a good selection of concession stands because they had Cold Stone Creamery and that's rare that I see that in venues - at least the ones that I have been to. But of course the prices are still high - but options are nice. The complimentary dinner that came with the VIP Tickets - not sure if it was part of the venue or not but it was pretty darn good  all you can eat  three types of meatballs, there was salad, bread, vegetable quesadilla and grilled mozzarella caprese. \n\nOur seats were on the front row on the left side of the stage - super duper close! Nice to be able to overlook the pit at such a close range. the seats weren't too bad to sit on but we stood most of the time anyways. \n\nOverall everything was pretty awesome - Muse, food, company and venue.", "business_id": "uFJwKlHL6HyHSJmORO8-5w", "stars": 4, "date": "2013-03-19", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "xofFo7WFfHOkzbtoG6SgPg", "review_id": "BsgWNf9mYT-cXgEnCmHFGA", "text": "Beyond great hotel! \n\nI was very happy with my five day stay at Hoilday Inn Hotel and Suites. Guest services were very helpful, friendly, and nice everyday with every person. They helped me out when having payment issues due to a third party setting up my stay for me. My room was nice, with a microwave and fridge, which I do not see often. This was prefect for a yelper on the hunt for great food; meaning I could bring things back with me. My bed was comfortable and room service cleaned everyday, placing things just where I left them if they need to making the bed or cleaning the sink. I was able to control the heat in the room! Big screen tv with hbo. Coffee maker in the room, iron in the room and FREE WIFI were a plus!\n\nI also loved the workout room. While small, they had a few machines that could keep this girl happy. This room was next door to me and I barely heard the machines being used on the other side of the wall! Thanks for thinking of me! The wokout room was also clean. Breakfast was great and full of hot/cold selections. Not only pastries, but egged, bacon, cinnamon rolls, cereal, oatmeal, biscuits, ect. Things changed from day to day, but this was what a continental breakfast SHOULD be! \n\nLocation wise, this hotel was only 7 min walk to the convention center. It is not far from the airport. I would save money by riding on the metro rail and walking down if you have carry-on, as the $24 dollar shuttle was not worth the distance to/ from the airport, but that's just me being cheap. \n\nI really loved my stay here and would recommend this place to anyone!", "business_id": "jYsa5qLFZxhVtwDHZMW-SA", "stars": 5, "date": "2012-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xR7T-HpPJRFBh-wO0c3XMQ", "review_id": "QKBjdm5lzcip1RgjqjvWog", "text": "A chain but a most unusual one, at least in this particular location. That's because this one is located right in the stands of the baseball stadium! Seriously, you're right there and it would be a great place to watch the game. \n\nI suppose you could have your dishes shattered by a foul ball or something. But OH what a story to tell that would be!!!\n\nCame in for lunch with a couple of coworkers one day, and there was no game on. The TGIF menu is the standard, familiar one. I went with a relatively new dish called Korean Steak Tacos. They were good, pretty well seasoned. Not as good as you'd get at a Mexican restaurant, but hey! It's Friday's!\n\nService here is impeccable and the view great. It's still a chain, but if you're going to hit a Fridays, this is the one. It almost feels like it's NOT a chain.", "business_id": "1-1VcGTL3GyCqUpXZLFTZA", "stars": 4, "date": "2013-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UgQBKgtczGnrpxye6vAwfQ", "review_id": "nsFpFFGPdEhGJ-mVv57GJA", "text": "Great view and good service ! AJ our waiter was awesome very friendly. He also made us a root beer float for dessert not on the menu but very pleased he made it happen ! Will definitely be back next time I'm in town !", "business_id": "1-1VcGTL3GyCqUpXZLFTZA", "stars": 5, "date": "2015-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "XBHJCDzNh--mBhJkzyM_iA", "review_id": "-T908uTzbnmL0BVeP8XCwA", "text": "Nothing like a touch of yogurt on a hot (or cold) day.  The owners are so friendly, I love it.  The smell of sugar cones wafting in the air when you walk in is heavenly.  Something about this yogurt here, I don't know what it is but it tastes so good and creamy and not a chemically tone to them at all.  It tastes real, fresh and plopping down inside is a perfect way to enjoy some time away from the office and watch the busy-ness going on around you outside.", "business_id": "uaAMGh8gMoJD4nLFzNsM-A", "stars": 4, "date": "2011-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "C9fI_Y9i3lotXFks-B2ubg", "review_id": "PplJ9bn1GVG37vkcs_QOUA", "text": "Bar Bianco has contributed to some pretty great memories. I have been here to wait to be seated at the pizzeria, it is part of the experience ad I always look forward to it. The bar is cozy and the music is conducive to that experience. It's a great place for a romantic date or to have a laugh with friends. The bartenders are always extremely knowledgeable and friendly, which when it comes to wine bars is not always the case. Their selection of beer and wine is always on point. I like knowing that every time I go they will have something different to try. Their appetizers are great and the system they have to get you seated next door is incredibly efficient. All you have to do is relax and have fun.", "business_id": "JR95uaM82xBUIZ-kQ785iA", "stars": 5, "date": "2015-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XGiAs4fHzMr0rJhJeOyQyg", "review_id": "UhDFBewAoLWgLUaETlJuZA", "text": "Service is the best. Everyone is super friendly. Love love love the Authentic Greek Salad..... The veggies are just so fresh and the feta is so creamy!!! One of the best lunch places downtown. I love the quirkiness of the restaurant. The only reason it is not five stars is the bread is usually hard around the edges.  But don't let that keep you away.....", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2014-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Tf9YXkJLGPbL9dQx3p7FHg", "review_id": "yNZ8UDnBz90LpWzHb665pQ", "text": "Wow... what a great time at he yelp event.!!! Very impressive night.", "business_id": "MwmXm48K2g2oTRe7XmssFw", "stars": 5, "date": "2011-03-22", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "U42c5lZYBg3sVYSg1sqQfg", "review_id": "E3bGD5VHQSoHcj9kE7coOQ", "text": "Totally boring, I am glad my trip there was free.", "business_id": "MwmXm48K2g2oTRe7XmssFw", "stars": 1, "date": "2014-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DcCUgTOOeJOPTVJVBWfyCA", "review_id": "rmtNL90wYe35ZQX3Ya2dTg", "text": "Valley Towing Company was great! My sister's parked car was hit by a construction truck and we wanted to get it towed to the body shop. I called Valley Towing and they were able to send out a driver immediately. Unfortunately, the police took forever to come do a report, but the driver, Steve, stayed with my sister and helped her navigate the issue. He even offered to drive her to her class at ASU! \n\nThanks Valley Towing for taking such good care of my sister's car.", "business_id": "Vu-c7qfc77p0VMMJ00hzeA", "stars": 5, "date": "2015-04-08", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "wYzOrThSYP8WwioLfsu4vQ", "review_id": "1stEWkfVW0x_wPSKQGOStg", "text": "This is where it's at! If you are looking for really good, cheap and somewhat late night (I think they are open till 11pm) mexican food, you've got to try Rosita's. I absolutely loooove their mole sauce-- best in the Valley. Try the beans and rice burro, enchilada style with mole.  Pair it with a nice cold Pacifico-- Sunday afternoon Heaven! Their salsas are to die for, and both the red and green pack some serious punch!  You've got to pay a dollar for chips, but it's so worth it. The tamales are also muy delisioso!\n\nThe little old ladies who work here are absolutely adorable in their little matching dresses. They are no nonsense, too. There's a sign posted that says \"Please control your children!\" I love it. Plus, they have a kick-ass temporary tattoo machine at the front where you can buy \"Dogz\" tattoos, with realistic looking dogs in gangsta settings. Classic.", "business_id": "hWhVP-28LYP3llaMlAJ_JA", "stars": 5, "date": "2007-05-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IJq0h80y-eI7CI0TJYn9qA", "review_id": "PgTA3B4SMVIPFv39FpCcZQ", "text": "The Barrio Cafe was really busy, so I decided to accept Yelp's recommendation for Rosita's Place. The portions were generous, the prices were fair, and the food was good - but nothing special. The neighborhood seemed a little marginal, so I was glad they had their own parking lot in back.", "business_id": "hWhVP-28LYP3llaMlAJ_JA", "stars": 3, "date": "2014-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Arz4isuZ87TPKNVWLXBYhA", "review_id": "_-d69gbKYvZMOlJF6kJB9g", "text": "Best Mexican meal we could have asked for! We stopped for our first meal in Phoenix and loved it. It was authentic, tasty and had a great vibe. Would 100% recommend to anyone in the area!!", "business_id": "hWhVP-28LYP3llaMlAJ_JA", "stars": 5, "date": "2015-04-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Ps1Db9zOatoF_76FZNO5CQ", "review_id": "e6EClNXsgFkGIbfmeB0Hig", "text": "Whataburgers are rapidly disappearing around here which I think is too bad as I like their food.  And they have used the fast casual approach in their dining room decades before the label.  They have always been good at preparing it with your choice of toppings and you can get a side of gravy for your fries.\n\nThis particular morning I was driving a bit of a different route and wanted a breakfast sandwich of some sort for a snack.  I spotted this store and got a breakfast biscuit with sausage, egg and cheese.  It came out quickly and it was indeed a good snack.  Of particular note was the biscuit itself was not old or crunchy.\n\nThis one I rounded up from 3.5 just because.", "business_id": "ixTr1qXUFGTzyaZUuCDDvg", "stars": 4, "date": "2013-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kq5Pdsy8Znyh9KEkxWT_QA", "review_id": "n1C16hlhvTOn5DzsZHGEsA", "text": "Stopped in to pick up some lunch today, and I went with the veggie jackson. i ordered it sans eggplant, so it came with broccoli, asparagus tops, carrots, onions, feta cheese, garlic rice and a balsalmic salsa. It was exactly what my tummy was hoping for. :) I opted for the tortilla chips and salsa today instead of the miso soup (which is delicious), and was happy with my choice. the salsa is chunky, with lots of veggies and flavor. The place was pretty empty, so it didn't take long for my food to come up. Quick, affordable and delicious!", "business_id": "ZoQAOnEFnyHjSpomtfqesA", "stars": 5, "date": "2010-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "085TP4qzSt6sr2COT4lVCg", "review_id": "gRavtWoswLjeiKIEuZeYWw", "text": "I haven't been to La Tolteca for several years but yesterday we were down the street at the Children's Museum of Phoenix so we just had to go.\n\nWhat can I say? These guys make some awesome everyday! There's no Mexican food any better in my opinion (including all those 'bertos places) on this side of the border. Huge portions, great prices and there's so much other things there to compliment the food.\n\nOther then the food, there's a grocery store in there as well as some other stuff you can buy. I got a kick out of the 3 foot loofahs. Not sure what you would do with one, but they were interesting to play with. Cadie (my 2 year old) and I had a loofah sword fight.\n\nI kinda want to buy the tortilla making stuff and try my hand at home made tortillas. Maybe I will next time I'm there :)", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 4, "date": "2010-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GPBTrGZjM7m-hndPP9BrsA", "review_id": "NSght32IgwbcPhqzHb4SRQ", "text": "Not good. Sorry. I can get pass the decor if the food was good. Keep going. Big warehouse style with table and chairs at the end. Some good reviews???? Must be the workers.  No Flavor unless you add the sauce (a lot)! The server was very kind. So close to Mexico we thought it would be a no brainer.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 1, "date": "2013-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0zC-ws9bQNv5zjTSXYu-NA", "review_id": "buE-dL4Pl_MWYZ-HhBpc3A", "text": "Adam M. was absolutely right: The Chinese Broccoli in Garlic Sauce and the Mixed Seafood Hot Pot (Casserole) are really, really amazing! I've also become a big fan of the Tomato Sauce Shrimp - tastes nothing like what you're thinking. \n\nEat these items we recommend or be seriously disappointed trying the chinese staples you've become brainwashed into enjoying elsewhere.", "business_id": "ykfTh6HI219NoMsWBxulxw", "stars": 5, "date": "2010-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "Xm8HXE1JHqscXe5BKf0GFQ", "review_id": "mEnEhHATNt4X-rT-d08UYg", "text": "Art Gallery house in a space that is, well, a house. There is a huge backyard that is excellent for art openings because they can set up a stage for entertainment, a small bar area, a small appetizer area (veggies with dip and some desserts), and still have room for chairs and tables, seating around a fire pit, and there is a koi pond as well. \nI have found that the art varies, even by artist. I've now come to two different exhibits and I enjoyed both very much. There is a good turnout at events and exhibits will run for several weeks following an opening. \nThe vibe is friendly, eccentric, and casual. Street parking in the neighborhood.", "business_id": "F3L3UuWJUez6ybJr4y5Agw", "stars": 4, "date": "2010-03-27", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "2LCrT_BOJvGV4xi_lmoRcA", "review_id": "6xjRXLvR_mRwohO_QLzdsQ", "text": "Welcome Diner recently reopened with the chef/owners of Old Dixie food truck.  I LOVE, LOVE, LOVE this place.  I've been to Welcome Diner three times in the past two weeks.  I've sampled the lemon ricotta pancakes, the Holy Puerco special and a breakfast biscuit sandwich.  All were delicious, but the Holy Puerco was amazing.  A cheesy grit cake smothered in the most delicious pork I've ever eaten, topped with an egg and house-made pork cracklings, served with flavorful, crunchy potatoes...\n\nI love to sit at the counter.  The crowd is friendly and the WD team is personable and efficient.  There is also plenty of seating outside, as there are only 9 stools at the diner counter.  And since it's in my neighborhood, I can easily walk or bike there.\n\nFood is locally sourced when possible.  I was there yesterday when the guy dropped off the duck eggs.  Most entrees are in the 8-10 dollar range.  They have beer, wine, and limited cocktails.  I highly recommend the Hurricane, with fresh-squeezed juices, light and dark rums, and pomegranate grenadine.  And the new management DOES take credit/debit cards with the square.  You can have your receipt sent to your email or phone number.  I mention this because I saw a couple order who'd never paid with the square before.\n\nWelcome Diner is open for brunch and dinner, but not every day.  I know they close at 3 on Sundays.  They are open Thur. thru Sun.  Oh, and the music is good, too!  Get there and enjoy the patio before the hot weather hits!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2013-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IPu2iHwmJLBLmuGafnPo2A", "review_id": "of39yp4NjV5Cpj1f5yFSig", "text": "Although a little pricier than I'd prefer, I'm giving Welcome Diner 5 stars for the delicious locally-produced food, relaxed and friendly atmosphere, and the outgoing people who work there.\nYou know a restaurant has something good going when a college student is willing to pay $10 for a watermelon salad. Or $5 for french fries with an egg on top (seriously, you have to try it. So delicious.)\nWelcome Diner has a unique operation--in the warm Arizona months, Welcome Diner operates from 5pm to midnight, and during the cool Arizona months, it's open for brunch and lunch. Whenever you happen to visit, you'll be greeted warmly, offered delicious food, and given a wonderful starry opportunity to enjoy the night (or morning) with dear friends.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2013-05-31", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "8q716Te4Ywx96UVzU0md4w", "review_id": "u1OZggJIeKkuLwqtV5xQXw", "text": "Great food, great drinks, great atmosphere, AND a great staff! Say whaaaaaaaaaat?!?!?  \n\nI had a brief, but torrid affair with the grilled cheese, and that delicious SOB left me wanting more!  \n\nI HIGHLY recommend this spot!!!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2014-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Int2FoYlAaC8vwegI2Kong", "review_id": "JeeJYcbSk2kxdwy_R-00Gw", "text": "This place is awesome! It totally remind me of hole in wall joint in San Diego. The vibe is great and the food is amazing. You know it's a great place to eat when the line is hitting the street.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "51oaHvMja_XPJpAoJf054A", "review_id": "3WbXVRFiprFQGKgcpGrXSQ", "text": "What a great dive! Welcome Diner has a Happy Hour. I got Carolina BBQ fries and a homemade ginger beer.  That beer had so much ginger it tasted peppery and it is strong! So delicious! The fries were a touch too salty with the mustard based BBQ and vinegar slaw. John got a Big Jim with was a huge biscuit with fries chicken, bacon, and covered in a yummy peppered sausage gravy. We also got sausage gravy and biscuits. For dessert we got beignets. Foods not perfect but VERY freshly prepared and pretty darn yummy!  This place is definitely worth a visit!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 4, "date": "2015-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kkCIHEqEvijIzVn5otra8Q", "review_id": "4xYHleM9m2Z9r90TYxQhhg", "text": "This is my late night joint. Fire biscuit selection. Staff is fantastic and loving. Top 5 pics In Phoenix handdddds down.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-05-26", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "yt6vljLIffAU4WW0-TQwBw", "review_id": "j33cF5btG_momEkjPd0bPg", "text": "So I visited this unique market after reading some of the glowing reviews from other Yelpers and I must say the Phoenix Ranch Market is awesome. Like any good market the wide variety and abundance of fresh food at PRM makes shopping at the old chain store a boring old chore. The operative words here are fun, vibrant, and cheap. I went on a Sunday so I kicked it off with a steaming bowl of menudo, a beef tripe soup with a ton of garnishes so you can personalize your bowl. After I finished I wandered around filling up on fresh tortillas, dried and fresh chiles(my mole can beat up your mole anyday), my eyes were agog as I absorbed the sight sounds and smells of the bustling market. My favorite area was the meat counter where patrons bickered with the butcher over the best cuts and a peeled cows head stared blankly at me.  I swear I saw that thing blink at me.  Anyway a great place to visit if your in the mood for a tongue torta and some mariachi music.", "business_id": "VXIkI9_EbDbYHeO9IzKjJg", "stars": 4, "date": "2008-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "kRH3HttbiNoD-BgomNVVtA", "review_id": "4lktuM0JrMJ1yRU3rWHJbw", "text": "This place was uber cool. I grew up 10 mins from the Mexican border so I was fortunate to grow up with authentic Mexican food- from restaurants and taco stands to my friends Nana making homemade tortillas and rice and beans and well, everything. \n\nWe were in the mood for carne asada tacos to grill at home and decided to buy some meat here instead of food city or the carneceria up the street. I heard about the hype and great reviews but never got around to checking it out. \n\nThis place rocks! 100% authentic and has everything I need to make virtually any Mexican dish I can remember. \n\nThe place is so cool. I can't get over it. Bakery, deli, tortilla factory, cheeses, meats, seafood, veggies, spices and candy. It has it all. It's pretty much the Mexican version of Lee Lee's, only cooler looking and more fun. \n\nCheck it out.", "business_id": "VXIkI9_EbDbYHeO9IzKjJg", "stars": 5, "date": "2011-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EL52vBo8SN_Gs76gSsJwzQ", "review_id": "x7ztrJtmmfvCkxMxk7hZFg", "text": "I can't thank Andrew and Randy enough for their honesty and integrity. My daughter is a student at GCU, she took her 2001 BMW 325i. My husband and myself have always taken excellent care of our vehicles and before she took it we had the vehicle checked thoroughly. There was no way of knowing the car would blow the transmission with just 130k miles. \nAndrew diagnosis our problem and I wasn't  willing to replace it so I offered to sell him the vehicle  he agreed and offered a fair price. He has the ability to fix it and it would be a great car for a beginning driver because it is immaculate inside & out.\nFor myself as a parent I couldn't replace the transmission and then send my daughter back to AZ from California next Fall with that car. \nThank you Andrew and I feel 100% confident sending my daughter to your shop in the future should she have any vehicle problems. Even something as minor as windshield blade  replacement.\nIts nice to know there are good honest business owners with integrity still out there.\nMy sincere appreciation to you and your team!\nBarbara, California Mom", "business_id": "OceUtK4lKAziifRdkRh4Dg", "stars": 5, "date": "2015-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MrCMqjbAjxVT9Cl1_hO0tA", "review_id": "mP3mHVwAdGxkisniGoxz-w", "text": "Ryan's Pet Supplies is definitely the place to be! There is not a single place besides Ryan's where I can buy tons of treats and other goodies for my dogs and actually save money! I now cringe at prices at other pet stores because I know that Ryan's has the same exact item, but significantly cheaper. \nThe drive is definitely worth it, and what's best is that you can place pick up orders (which will be ready within 3 hours of you placing the order) and there is no additional cost for that, which is great if you are short on time or can only make it in before they close but don't have enough time to walk through the warehouse. You can call in orders and place them online as well. Definitely a great place to be, and if you ask for help, the workers will definitely help you out!!", "business_id": "Dj3i6a_vboALYTRKTmBABQ", "stars": 5, "date": "2014-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "oVY1zfoXW7M0Q0dczzxJJQ", "review_id": "YACBPDjN36hpLr_7jH_Saw", "text": "There's a few trendy doughnut shops opening up around the city. Those are great, but I prefer Rainbow! The doughnuts really remind me of a doughnut shop from my childhood. We'd wake up early on Sundays for church and as a reward, we'd get to eat sugary doughnuts after. But that's besides the matter. \n\nTHIS PLACE IS AMAZING! They've got tons of yummy options. Doughnuts if you want something sweet and croissant-wiches if you are partial to more savory options. So far, I've only had the doughnuts. Dough is perfect, icing is just sweet enough. My go to is a chocolate glaze, but I've ventured out to try other flavors. Recently, I tried the milk and cereal doughnut (which I loved) and the orange glaze (surprising, refreshing, but not really my preference). \n\nThe prices are really great too. Cheap but not like they're just giving away food, like a local doughnut shop should be. I don't leave with three or four doughnuts and coffee wondering what I just spend my $20 on like I've done at some of the trendy doughnut shops in town ( I'm definitely not ragging on them. They're good and their designs are awesome, I just like Rainbow better). \n\nMy best advice is to go here early, or on a weekday, but still morning. They tend to run out of the more popular doughnuts towards midday.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2015-03-02", "type": "review"}
{"votes": {"funny": 5, "useful": 6, "cool": 6}, "user_id": "IDHrwv_RCildFvmfWTkj5Q", "review_id": "jyD7tt7Q_qb_SvLyJQWilg", "text": "****Entrance is in the back******\n\nThis an attractively unusual restaurant situated inside of what looks like an industrial strip mall with store fronts.  This place is not easy to see from the street because it is in the middle of this industrial looking strip mall.  Be mindful of that. The drive to turn into the rear parking lot is just west of the building.  The building is on the north side of McDowell. \n\nThis was the perfect place for a Sunday afternoon dinner.  A lot of families coming in for Sunday dinner and tons of laughter and friendly banter filled the room.  The menu is full of Sal Vadorian favorites and I had an interesting time perusing the menu for a selection.  I ordered 2 things.  I ordered El Plato Tipico and   Ensalada (not a salad, but a fruit drink with fruit in it.).  \n\nI especially enjoyed the flavors of the Ensalada.  It was surprisingly delicious and sweet. I don't usually care for sweet drinks; however, this drink was refershing and the sweetness wasn't overpowering.  The chunks of fruit was nice too, but caused a bit of a challenge when I attempted to drink from the straw.\n\nOne of the things I love about South American restaurants is that there is always some type of \"typical meal\".  At a Colombian restaurant, you order the Bandeja Paisa.  At a Guanaquito, you order \"El Plato Tipico\".   This dish comes with an array of things that allow you to sample some of the simpler offerings.  My favorite part of the meal had to be the cheese and meat pupusa,  This is quite similar to the Indian paratha in style, not in taste.... A pancake stuffed with goodies.  The pupusa was so tender and moist with the appropriate amount of cheese and the hints of meat.  I savored every bite of those.  I also enjoyed the tamales.  Their tamales are wrapped in banana leaves and was the most moist and tasty masa I have had in ages.  I wasn't crazy about the chicken, I wish I'd gotten a pepper or veggie tamale, but ... still very tasty.\n\nReturn Factor 100%.", "business_id": "rbiRLiFTG098z9JaK3Nshw", "stars": 4, "date": "2015-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "zU5NcD0VC9orDsznksXGfg", "review_id": "u4NRNYyAWbWYaatiAX3-KA", "text": "Stopped in here for lunch on our first day in Phoenix.\n\nIce cold Corona's at $4 a pop. Nice.\n\nA bowl of fresh and warm nacho chips with two types of salsa was served with the menus. Nice.\n\nMy other half had the shrimp cocktail. She said she liked it. Nice.\n\nI had the shrimp with a butter/lemon sauce that came with a salad, rice and beans, and a flour tortilla. It tasted great, but they lose a star because they did not deshell any of the shrimp. Not nice......", "business_id": "cgNIBHS2mLdbTRiodAT6EQ", "stars": 2, "date": "2014-04-26", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "51X2v_uiLAdazERB2ClDHg", "review_id": "pHf_Q0urmhGXXDnJ2r4Ojg", "text": "Friends and I went to this Cocos location because it was on our way home and I have always had pleasant experiences with this company. I have to say, this is the worst Cocos location I've ever been at. The food made us feel sick, the service was horrible and the waiters and waitresses were rude. Our original plan was to go to National Pancake Day at IHOP. After seeing the line at IHOP we deiced to find somewhere else. I saw the cocos on the way home and we decided to stop there. \n\nWhen we first got there, over 6 of their tables were dirty wish dishes piled high. The waitress came out and said there was a party of 30 and it would take an hour for our food to be out. She cleaned off a table and sat us. We accepted and started looking at the menus. \n\nA random waiter came out, brought us our drinks and told us that they were no longer making pancakes, which is the reason we went there in the first place. We all decided to change our orders when our waitress came out and offered us the pancakes. We assume the cooks did not want to be bothered making more pancake batter and asked the waiter to tell us they were out. \n\nSome time had passed and we were all out of water with no service. I asked another random waiter for water and our free bread basket that every cocos normally provides. He gave me a dirty look and went into the back. 25 mins later our waitress comes back and finally asks if we need anything. I asked for the bread basket and she rolled her eyes and explained that they didn't have any bread and started walking away. I had to raise my voice to ask again for at least the water refills. \n\nWhen we got our food, it tasted fine, at first, but it made all of our stomachs hurt after a few mins.\n\nIt was the worst service I've ever received at a Cocos! I didn't even tip and I am always a generous tipper. \n\nAlso, this terrible service was from the night shift staff.", "business_id": "SZvYxcvYYVRue9MXcEDjsA", "stars": 1, "date": "2015-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L25FAd7JKVaaoHmYQ8v9Nw", "review_id": "A1A_2Fm-ezYVXNVOH2wwIA", "text": "Things have changed a bit since I started dining at The Coronado Cafe a few years ago and it is turning out to be for the good.  Everyone there is very friendly, the atmosphere is relaxed, the service is great and the food is excellent.  They are in the process of some menu changes and so far it is a plus.  If you have not tried it out you are missing something special.", "business_id": "5-X03Zc0nN7U5eoe8uFUdw", "stars": 5, "date": "2010-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "VURvHke7yvGL673wgcp9nA", "review_id": "A_VQJwu_DXw_Gtm9qpvSGA", "text": "Lite lunch with the ladies.  Two of us shared Crab Cakes and Caprese salad.  I could have eaten an entire platter full of the crab cakes.", "business_id": "5-X03Zc0nN7U5eoe8uFUdw", "stars": 3, "date": "2013-05-26", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "gO71ikoIl4SzgQZtrkNFxg", "review_id": "cBsl5PlwdBENypU1o_o8PA", "text": "MacAlpines, where do I start?  From what I can tell from my days of watching Happy Days, it's just like a 1950's diner.  Their sundaes are absolutely D-lish.  They also sell vintage kitsch like furniture, jewelry, hats.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 5, "date": "2011-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3M-ZWy1OLvFHHC0PIP876w", "review_id": "4mZ_z4Jp4VpcfkH_osJqTg", "text": "This place is quite the combo- vintage store, soda shop, cafe and candy store! I felt like I walked onto the set of I Love Lucy! The store portion had all kinds of goodies ranging from retro furniture that was sitting in your grandparents house to old school clothes, hats, barbies, dishes... ALL kinds of knick knacks!! \n\nWe ate lunch here and that is the only reason why I'm not giving it 5 stars. I had the Mac Cheeseburger and it was OK... nothing special. The hawaiian cole slaw was ehhh too, a little dry for my taste. They had probably over 100 different \"sodas\" I ordered the hubba bubba soda which was flavored soda (or syrup) with strawberry ice cream. I wish I had ordered a regular flavored soda like a good old fashioned Cherry Coke! This place was awesome! It had such a fun retro vibe!", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 4, "date": "2013-03-29", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "hdZ3rlgFXctCOUhzoOebvA", "review_id": "69GU11TtkzTtugslcuS4JQ", "text": "This is a very cute place to go, there's a lot of fun things to look at and shop for.  The food is very basic food but it was good.  The service was good.  I look forward to going again to actually have one of the specialty sodas.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 4, "date": "2015-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GzMh3V8oVBoII38x1GpajQ", "review_id": "FAqr_Edp7g68DQPtJGI-nw", "text": "Yummy.\n\nGreen chili chimichanga enchilada-style is the way to GO. I got the plain green chili burro and was basically making my own enchilada-style with the sauce, guac and other toppings from my boyfriend's plate. It was amazing. \n\nYou pay extra for the enchilada-style, for guac, for cheese and even for extra hot sauce (it's homemade). Though still not expensive, the pricier your meal gets, the more delicious it gets. It's worth a bit more to add extra flavor to the burros, which I actually thought was rather plain without my doctoring.\n\nRito's is a cash-only take out place with some picnic tables outside, and at lunch time it was hopping with people. The only negatives I can see are that it's set up sort of like a bank teller, so you feel quite disconnected to the staff the whole time. I also couldn't find the bathroom to wash my hands after my messy food, nor could I find any extra napkins.", "business_id": "Xo9Im4LmIhQrzJcO4R3ZbA", "stars": 4, "date": "2011-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7nlZJW84Adt6oYn2shnn_g", "review_id": "Gu9Ro-w4NzQyER9yLV0VLw", "text": "The food is over priced. The restaurant has no place to sit indoors.  The exteror tables aren't even covered by a shade structure to protect you during the middle of the day when they are open.  They have limited hours. The food its self its okay, but I could get the same thing for a lesser price else where. they charge you per item, even the salsa 15cents for 1oz and 50 cents for 4oz.  No way!  Never returning here.", "business_id": "Xo9Im4LmIhQrzJcO4R3ZbA", "stars": 1, "date": "2013-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_NVlwWTs9PNTioaKX1kKlg", "review_id": "-nrL2g4LwnMdJ4ZoUnYYEA", "text": "BEST MEXICAN FOOD EVER!!!\nThere is a reason the line is out the door and people are willing to wait 10 to 15 minutes to get their order. It's authentic and made to order so if you're short on time call ahead to place your order but it's well worth the wait  Whether it's a burro or chimichanga, red or green, taco or enchilada, it's all amazing.", "business_id": "Xo9Im4LmIhQrzJcO4R3ZbA", "stars": 5, "date": "2015-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vVx_WxiVHp7sWZF1pJbsYQ", "review_id": "8ghpZW5KtTj7P6bSeqquaQ", "text": "Sufficient. Barely.\n\nThe pool and hot tub have a very, very rough bottom. Both of my kids raked their toes and knuckles and drew blood.\n\nThe breakfast ran out of coffee 3 of 3 mornings, need to be on top of that! The waffle maker was a nice touch, but just about the only thing worth eating. \n\nThe room was barely sufficient. 2 mushy queen beds, a couch and 2 tvs. It was oddly configured and had to squeeze by the randomly placed tv stand to get to the beds. \n\nLocation is really the only reason to stay here. We didn't rent a car - walked to Chase Field, Walked to Arizona Center, Walked to Arizona Science Center.\n\nNext time, a different place for me.", "business_id": "Lt-dQ0kUWFm0nDgLwdEo_g", "stars": 2, "date": "2015-05-03", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "mqyH3CqjMufsm5FccDrjLA", "review_id": "G7GewNQsfCe-OJuUWCfVfA", "text": "The further into the sketchier parts of Phoenix we drove, the more I knew that Mariscos Playa Hermosa was going to be legit. Its quite unassuming from the outside but the overly-enthused lobster sign out front let's you know you've arrived.  Don't judge a book by its cover.  Mariscos Playa Hermosa may appear a bit ghetto but open its doors and you've entered a tropical island paradise.  The inside reminds me of what the Chiquita Banana lady's house would look like...  blindingly bright colors, suns, moons, parrots, wooden fruit, flowers and trees.  \n \nThere was one man running the show and he was superb.  Very attentive, expedient and friendly.   You won't be disappointed with the shrimp culichi or any of the cerviche menu options... not to mention the wide margarita selection.", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 5, "date": "2011-03-21", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "ewm2vLryyKxBpDCQdWq3XQ", "review_id": "5rWx-cW87luDBfo0tvOWJQ", "text": "Excellent place to get great seafood!\n\nRestaurant and Food:  The restaurant is nice and cozy.  At max, there are maybe 15 tables in the entire joint.  However, don't let the size, location, and lack of flashy chain-like display fool you.  The menu has a wide array of choices from fish tacos to different styled fish plates.  I had a fish plate prepared with garlic and a lemon pepper seasoning (Pescado Ajo Mojo I think) as well as an horchata for my beverages.  The food was impeccable!  In my experience, coming across fresh seafood in Phoenix is hard.  The seafood was well prepared and fresh (no gamy-fishy taste).   Additionally, the menu has pictures of almost every dish so you can gauge your interest in a choice (Visual examples appeal to me).\n\nService:  Spot on along with the food!  As mentioned previously, the restaurant is not that big.  Our server was always on top of her game and frequently stopped in to check on us.  \n\nAtmosphere:  The restaurant has a bright decor that is very fun and fitting for the type of restaurant.  Not to sound cliche, but you will feel almost as if you are at mom's kitchen (I'm Hispanic and my parent's house has similar decor).  \n\nOverall, this place wowed me with the food and the service.  For the price and quality you will receive at Mariscos Playa Hermosa, I doubt you can find many places in the neighborhood that will compete with this place.  Try it and see for yourself!", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 5, "date": "2013-03-24", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "KRC-FJ2kshlPeno_JHO9rQ", "review_id": "So7Gk6z31OB4RjJKoLBX3Q", "text": "Not sure why so many people wrote that this is in a sketchy neighborhood unless they have never been outside of the suburbs. Just because a neighborhood is not all white does not mean it's bad. This great place is on a main road across from a church and near a senior apartment complex and a hospital. Seriously folks. Let's not be so judgy.  \n\nAlso, it is not crappy from the outside. In fact it is brightly painted, inviting, and has a patio with lights strung over it. Inside is decorated just as beautifully, with colorful paintings, lush greenery, and cozy tables. We happened to stop by on a Friday night and were entertained by a mariachi band. It did mean that it was a little loud at times, but everyone in the restaurant seemed to be having a great time. It was family oriented--several groups with kids--as well as couples on date nights. \n\nThe food was excellent. Shrimp ceviche -- incredible. The waitress recommended molcajete caliente (cheesy hotpot with fish, shrimp, chicken, carne asada, and octopus). It came with beans, rice, tortillas, and a little salad. Yum yum. Chips were a little greasier than we would like but were free and came with two good salsas. If we lived in Phoenix, we would be regulars!", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 5, "date": "2014-05-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7geT4TAPqDBYw3X8iAKjjA", "review_id": "_nWY5crF2Rf2z2dZcNgcLw", "text": "We came here for cinco de mayo.  This place was amazing with great service.  Our server Milsha was great.  I'd recommend the breaded shrimp plate and shrimp tostadas.  Don't forget to check in so you can get a free piece of cake for dessert.", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 5, "date": "2015-05-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "dxPBchN0OnHTENctEUm7NQ", "review_id": "uCdLSQa-bH_aYM-5DNuQJQ", "text": "I just got back from an Arizona spring training vacation, and one of the highlights was definitely the Desert Botanical Gardens.  We came really close to skipping on a visit altogether because it was 5:00pm, but decided to give it a shot...it was worth it!  I was a little disappointed that the Butterfly Pavillion had closed for the day at 5:00pm, and several walking areas were being used for weddings/receptions (who could blame these people??) but still got to see a lot of beautiful desert plants and wildlife.  We managed to get in for free, not sure if it was because of the time of the day or all the people just walking in for the weddings though, which totally made the park that much more fun.  I am not sure I would have gotten as much enjoyment out of it if I'd had to pay $5 to get in...\n\nThe little desert rat-sqirrels, and rabbits were totally fun to try to find hiding in the many different plants and burrows.  I felt like a little kid ooh-ing and ah-ing at the different varieties of cacti and desert wildflowers, and have to give this place the ultimate rating .  If you're ever in Arizona, please give this place a try, it's very well put together and a beautiful site to see.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2007-03-12", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 5}, "user_id": "EKwGhgLrM18ErVKKeYE2UA", "review_id": "KULUVg42hUlm7XWUaJeAFA", "text": "The Desert Botanical Gardens are beautiful. I'm just amazed by all of the different types of cati that are on display here. It's a great way to get some exercise and enjoy the beautiful desert plants. They are blooming right now and the gardens look amazing. \n\nWe came to see the Chihuly exhibit yesterday (with some free passes, woo hoo!) just before sunset. You have to see this during the day and at night. Some pieces look better during the day and others look better at night. I would suggest going to see this exhibit during the week. It was pretty busy on a Tuesday night, so I can't imagine how busy they are on the weekend. \n\nIf you're into desert plants, Boyce Thompson Arboretum is another great place to check out near Globe. \n\nSome of the trails close at sunset, so get here before the sun goes down to check them out. And the butterfly exhibit closes at 5pm. Also they are now open until 9pm.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 4, "date": "2009-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "mNdiEeyPpNU449ykxc8TAA", "review_id": "jPtejtMokvXnpVpnyGAXGw", "text": "I'm new to the Phoenix area and am anxious to check out all the places that people keep recommending to me. Thanks goodness DBG was high on the list. I LOVE it there and can't wait to go back. I went on free day and it was crowded in the parking lot. I was toting a stroller and 3 month old so I was slightly concerned that it would be too crowded to enjoy.Thankfully that was not a problem at all.With all the many trails and areas to explore there were times when 10-15 min would pass without seeing anyone else. Highlights included the butterfly tent, oasis area and some weird little rodent with GIANT male parts. Wish I would have had time to stop and get a bite to eat - next time for sure! I would also love to check out one of the evening events.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2011-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qQBPEkrMCoQ4wSsofxBvDg", "review_id": "EoSQXvMqPIkKLEdC3lFcRg", "text": "What a neat place to visit and experience! Loved walking through the different trails (Wildflower loop, hummingbird area, desert area, etc.) and seeing the different plants that can survive in this environment. Not to mention all the birds and little critters you get to see along the way.\n\nDidn't rate 5 stars due to the cost of admission", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 4, "date": "2012-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IMl7VHZC4M5nJF1DqqhK9w", "review_id": "L76Z_qCBy6NyAhQuOkURuQ", "text": "Gertrude's is wonderful. Located at the beautiful Desert Botanical Garden, the food is delicious, the building new and attractive and the staff extremely helpful. I had the green chile pork, others in my group had fish tacos and hamburgers - all were very well received. For desert, we loved the chocolate soufflé - mmm good all the way through. Go eat there as soon as you can.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2013-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Skaeiq3BktGjRnVjL6AQJw", "review_id": "jXFiY9HDWN3hYLMsMHjiAA", "text": "Totally loved this place. My kids are 12 & 10 and it captivated them for a few hours before we had dinner. I'm sure we could have made a longer day of it, but we arrived at 3:30 to avoid mid day heat. The chihuly sculpture was amazing. No need for the tour time slots.  Because we live in Chicago, and right near the Chicago botanical gardens, we knew what to expect, but it was so great to see a new plant life in abundance. This is a beautiful environment and worth as much time as you can give it. The gift shop is standard and the restaurant 'Gertrude's' was very good and very busy. Need reservations for that.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2014-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VnGZK3XcyFlBgLPl0WQbQg", "review_id": "V5xreoOSyJ4zuzzT5YfhnA", "text": "I love the Botanical gardens! The plants and flowers are beautiful. It's a lovely place to wander or sit and think. Their special events are great too, like the luminaries and the tequila festival although a larger selection of tequila would have been great. I've been a member for a few years.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2014-05-04", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "fP-qon7H9q3LbdrDshFn0w", "review_id": "ewhMHjufQvwidLKAFqZZBg", "text": "A group of us decided to visit after hearing about some reviews. It's a pretty cool spot, but it gets old after a while. There were a few areas that were closed off due to weddings, so we weren't able to see everything. \n\nMake sure to go when the sun is about to set. We definitely enjoyed it more because we were not dying in the heat. There were plenty of water spouts on the trails as well. I enjoyed seeing some wildlife roaming around the garden- rabbits, woodpeckers, and quail were a few. \n\nI was hoping to see some Chihuly work, but it was a temporary exhibit. There are only a few near the ticket booth. If you have AAA, make sure to use this for a discount on your ticket. Parking is free & plentiful.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 3, "date": "2015-04-02", "type": "review"}
{"votes": {"funny": 4, "useful": 7, "cool": 7}, "user_id": "joEN2Mx6n2FNzsIrR0CpjQ", "review_id": "MKyXN80_fDOg7JPVHhxU9Q", "text": "Fellow males of the human race, take it from me: Have you had a 5 star first date recently? Are you on one right now? You are? I am talking about one that is going insanely well in every way, AND the girl across from you is drop dead gorgeous? You know..the date where its totally time to head out, you both have overstayed your welcome at the bar you are at, but its so not time for you to two to part just yet? Wait...really? Awesome, HIGH FIVE! But wait.... what if the date is *drumrolls* DURING THE DAY!? Yes, that's right, a day date! Where do you two go on a crisp Spring day?! THINK QUICK!\n\nGood ol' Jefe had this occur recently. My pretty little sidekick wanted to continue our date, and in a spur of the moment, I chose Desert Botanical Garden. Why? Its pretty....about as pretty as her. Right? Right? RIGHT?! So you go here and can quickly find out if she is a keeper! Easy: if she whines about being among the wilderness, there's your sign fellas. Ditch her and go frolic and try to catch butterflies....I'll allow it! Thankfully she was a keeper and we continued on. The weather was gorgeous and so were the views. Walking among the endless flowers and cacti, you can clearly see all of the amazing fauna Arizona not only supports indigenously, but can support from other locations. Broken into numerous sections, from the Native American Era Southwest to a \"Butterfly Garden\", this entire location is bound to please anyone. The views are beautiful, and so are the fun evens they put on all the time at night and throughout the year. It truly is an educational experience, and one I have enjoyed since I was a wee little Jefe in Elementary school field trips. Now as a man, I can enjoy it....in other ways.\n\nIt loses a star however for prices. $22? Seriously? I was not going to be a cheap ass and get my student ID discount on a first date, but c'mon man? 22 bucks? The zoo might be worth that....but flowers? Ahhhh! Also, they have a gorgeous selection of eucalyptus and other huge trees fenced in just beyond our reach....WHY can't I stand near the trees and enjoy their epic smell? Why...sweet Botanical Gods?! WHYY?!\n\n4 stars it is. A good random date spot for you dudes who are smart, like me. Trust me, I have a beard.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 4, "date": "2015-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XgCReN0_f4_4xO5H5pkPjA", "review_id": "jR4s0RbjrNyvW6UtnTWXcg", "text": "Had a great time staying in this hotel. The breakfast is free and probably one of the best hot breakfasts around. The warm cookie at check in started my visit off right. The room was very spacious as advertised and clean. I had no problems and I stay for almost a week! I would recommend to anyone that has to visit the phoenix area!", "business_id": "qIhBNeE64skjowRs6TTwJA", "stars": 4, "date": "2013-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 3}, "user_id": "N-D-d1Z4UybdlkK1HxlNPA", "review_id": "adGBO7QLvZOaEAHq2Oe42g", "text": "I love, love, love Eliana's. I have been eating here for years and enjoy bringing people new to Salvadoran food. The interior is cheerfully decorated with colorful folk art, and the service is always swift and friendly. \n\nMy favorite items on the menu are: 1) the pupusas, kind of a soft gordita-like exterior with a meat and veggie thick stew-like interior - outrageously good!; 2) the yucca frita, fried yucca plant (very starchy, like potatoes) with some deep fried chunks of pork and garnished with radishes and cucumbers; 3) the ensalada drink, a bright-yellow fruit beverage with finely chopped assorted fresh fruit- comes with a straw and a spoon; 4) the plantain with beans and sour cream, a dish I wasn't sure about at first because I am very picky about my banana-type foods, but it totally and unexpectedly works and is ridiculously delicious.\n\nEliana's is so inexpensive and such a wonderful experience. Everyone can find something they'll like- low spiciness, but full of great flavors and textures.", "business_id": "q2SZa5g85758iW1L9sSL1g", "stars": 5, "date": "2007-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zLgkT2QxH8aauHzeLb44-g", "review_id": "lhvbyCG3gfFnlMOMZIDRyQ", "text": "Great place and Anthony was very nice.  Quick and good", "business_id": "po5FyERB4lUZNnBIwnhFlg", "stars": 5, "date": "2010-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "vXcKVMyHZCvFP1qXbunU_A", "review_id": "5tYdS8qvZCyGdTb5wEMcew", "text": "I have difficulty sleeping in hotels if there is noise coming from vending machines, ice machines, noisy neighbors, parties... So, I add a request for a quiet room to my reservation in the comments section.  I guess I forgot to mention street noise on this reservation.  Rooms facing 44th Street get considerable street noise all night.  And, o.k., I get it... we're trying to go green (everyone applaud).  This hotel does not allow you to control heat vs. air conditioning.  Yes, you can set the thermostat, WHEN THE SYSTEM IS TURNED ON, BUT...  When the outside temps are above 70, they turn on A/C.  When they are below 55, they turn on the heat.  When they are in between, everything is shut off.  Can't even get a fan to recirculate the air in the room.  It would be nice to be able to decide for myself whether I need heat or air conditioning, or turn on the fan to circulate air and get some white noise to cover the street noise.  I won't be back.  There are plenty of other choices in the area.", "business_id": "LtJszEtHhXMZR0y6lbdswA", "stars": 2, "date": "2009-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "0TRh7OOVLQ-IOkchcMVWsw", "review_id": "5Bm69FxnXkSu0IUf7PdH3g", "text": "I went here for lunch on a Sunday. The parking lot had quite a few cars, but I got right in. :-) \n\nI got the buffet and had the chick peas salad (very good), chicken tikka masala (flavor was great, but the chicken was slightly dry), goat masala (this was amazing), and their tandoori chicken (which was some of the best I have had). Overall a great lunch. \n\nWould have done 5 stars if it wasn't for the dry chicken tikka.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2012-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F_a-8UmB8OEwlAVd37f9TQ", "review_id": "JihDZ3szACiCMW_U92K3zQ", "text": "Very clean, comfortable, and employs friendly and helpful people at the front desk. Their shuttle service from and to the airport was prompt.", "business_id": "CfzoA3TQ8YQcFTOncJFbQQ", "stars": 5, "date": "2013-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "s5XBIeR6g12dSJGak6-B7g", "review_id": "9Jc0Sf71duZ550i2uLtk1w", "text": "This is my FAVORITE pizza in the world!!", "business_id": "PEHJjxdw11TGFma9Zhz3ng", "stars": 5, "date": "2013-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_7IhJmcXodZ3VXNcL9LOgg", "review_id": "TS1UTsTjLmjn8kUr5pUbRQ", "text": "We had 20 mild BBQ wings and the large salad. Everything was awesome! You can't beat the great service from Debbie either. She is by far the best waitress we've experienced in a long time! So refreshing! Thanks and we'll be back!!!", "business_id": "PEHJjxdw11TGFma9Zhz3ng", "stars": 5, "date": "2015-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XLPsieRTGFHks1FDLDHsiA", "review_id": "qlrZhOsl5XW7hCHFYHsywQ", "text": "Stay away from this medical center unless you have plenty of time and don't mind having your credit ruined.  My insurance company paid them and I paid my copay for one office visit.  So far I've wasted two hours proving the $100 office visit has been paid in full 8 months ago. They are now telling me I have 10 days to pay $206 (instead of the $100) or they will send this to collections. Anyone know of a good attorney?", "business_id": "7_pBQ2IJKxAumHl8hMAPXA", "stars": 1, "date": "2013-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MITc1i9HRyL2sGcy3ss6Cw", "review_id": "nq2PsWphiCsX2pN_w8Jn5w", "text": "This guys are the best , yesterday i drop my iphone to the pool , It got completely wet \nI ran to there store and they told me they will try to fix but they cant guarantee \nI left my phone there for few hours and when i came to pick it it went back to life , my phone works perfect, the amazing part was they didn't charge me for it, Im impressed\nThanks  guys i will highly recommend you", "business_id": "4anyLAWqWVZh5BFpol9czQ", "stars": 5, "date": "2015-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4sylWPC-GQvZGmjWBr5B4w", "review_id": "e_nVH1ITwGA2cSFN-BYzmA", "text": "Great place for pulled pork BBQ sandwiches! Awesome beans and coleslaw to go with your meal. Just enough to fill you up and make you happy at lunch time. They also have Big Red! If you're in the area, also look for Hap's Pit Barbecue and you can compare both places, see which one you like better!", "business_id": "xfk9eY8gmwn8qsbyd-W6lQ", "stars": 4, "date": "2010-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "voQya04xCSP8Zrkyo_pHoQ", "review_id": "nLsUGAXSbk6w8FioAYsbpw", "text": "3 of us went there each had a regular sandwich, combo 1,  which was GROSS.  The bottom bun appeared to be dipped in the meat juices prior to the meat being placed on top.  The meat did taste good if eaten with a fork and all bread products were avoided.  Coleslaw was only tolerable, to soupy and peppery.  What happened here?", "business_id": "xfk9eY8gmwn8qsbyd-W6lQ", "stars": 1, "date": "2013-04-17", "type": "review"}
{"votes": {"funny": 5, "useful": 9, "cool": 6}, "user_id": "4dnDsoHuxUtzhaumxbpR5w", "review_id": "ufiO2QETeqf_PtQYZtaUKg", "text": "I'm not sorry that I love this zoo. I have many fond memories here.\n\nYes, it's a smaller zoo, and yes, they are somewhat lacking in good animal watching..but come on people, six months out of the year it's blazing hot outside. They can only do so much. \n\nI recommend coming here on a beautiful spring day. If it's hot outside, you'll hate it. Bring your bike, too. I used to bring my bike and just ride around all day.", "business_id": "1Ap6ZNCvyLLKHP0wvCk9yA", "stars": 4, "date": "2008-03-14", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "q7Zn9s5wXAjhhSJMf7GiVg", "review_id": "L813KZcEENNPTfN3dECZMQ", "text": "Fairly large sized zoo tucked in Phoenix, AZ with a $15 ticket price for students that have an ID card ($18 for adults).. In my mind, nothing compares to the San Diego zoo but the Phoenix zoo definitely put that to the test! They have a large variety of animals here that I haven't seen or heard of before and that's always fun because I'm tired of staring at elephants, zebras, and giraffes.. They have a tram that you can ride around the park for a fee, as well as a stingray bay, and food court.. This zoo can definitely be completed within an hour or so but it will tire you out because things are kind of spread apart.. I was disappointed to find that many exhibits were unavailable for viewing during my visit but it was still a good experience.. Luckily most of the animals were within view when I was there and you could even see the ones that were asleep! If you're a fan of zoos like I am then I would recommend making the effort to come visit this place..", "business_id": "1Ap6ZNCvyLLKHP0wvCk9yA", "stars": 4, "date": "2011-03-24", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "uZbTb-u-GVjTa2gtQfry5g", "review_id": "j8IlqvxVFM3wrFq1nqCRZQ", "text": "A nice zoo with a diverse range of wildlife to look at. It's great for kids, and I think the idea of opening up the zoo at night for Zoolights is awesome. The scorching heat of summer does limit the times when I actually feel like visiting though.", "business_id": "1Ap6ZNCvyLLKHP0wvCk9yA", "stars": 4, "date": "2013-03-10", "type": "review"}
{"votes": {"funny": 5, "useful": 6, "cool": 6}, "user_id": "vUWfWfGW6L_DVKHk6I5YYQ", "review_id": "KmVoQbo_ksACmebcDSv11Q", "text": "It has promise, but could be so much better. So much better.\n\nThe time I visited, there were way too many animals unavailable, too many obnoxious, unruly children (raise the price of admission, maybe?), and (some) employees apparently left a lot of their motivation to actually work at home, on their outstretched, unnaturally stiffened tube sock. \n\nHighlights:\n\nGiraffe feeding \nFor a nominal fee (5$ when I was there), one can feed these lovable, majestic creatures two biscuits, which are provided. Additionally, the personable staff at this section will tell you the whole life history of the particular animal you have fed. These animals -- giraffes and zoo staff at this section -- are among the best and top of class of any zoos I have visited thus far.\n\nMonkey walk\nFor free, one can go inside an enclosure where small monkeys are running, swinging, and otherwise monkeying around.  \n\nStingray petting \nFor a nominal fee (I cannot recall), one can get up close and personal (as close as Mandalay Bay's Shark Reef allows) and even pet/feed/whatever the stingrays. Seems like a highlight, although I would not know, since the staff at the pay booth refused to do their jobs because it was ten or fifteen minutes before closing. Did not realise it required arriving an hour early just to purchase an admission ticket to a small section. Note to Phoenix Zoo: Fire everyone at the stingray exhibit working the admission booth.\n\nWolves \nThe Phoenix Zoo has wolves. Some other zoos have them as well, but there they are used exclusively as companion animals to cheetahs and thus are not on exhibit to the regular paying patrons. In Phoenix, they have a relatively large enclosure which gives them room to run around, although the downside is that it affords them plenty of opportunity to find hiding places.\n\nOn an additional editorial note, I have to congratulate the Phoenix Zoo for their efforts on animal conservation. I read somewhere sometime ago that they took an endangered species -- on the verge of extinction -- and, successfully bred them to the point of being able to reintroduce them into the wild. I think this zoo has been around since the 1960s, so okay -- cool.", "business_id": "1Ap6ZNCvyLLKHP0wvCk9yA", "stars": 3, "date": "2014-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "izpmWq4eZ2fiIO3BK6NAuQ", "review_id": "l0gezy2cKbje4JFHqcvK7A", "text": "My partner and I were visiting from out of town, so we decided to stop here for something fun to do. We were pleasantly surprised because it was decently priced ($20 for general admission) and parking was free. There were a lot of animals and for the most part they seemed content and their exhibits were well kept. The only thing we did not like was the lack of information about each animal. Other than the species name and a few facts, there was no information about the individual animal - like where it came from or why it was there. It made it seem like the animals were there for show, rather than any sort of conservation effort. However, many of the zookeepers we saw were very excited to discuss the animals, so it did seem as though they were generally interested in their job. Overall, it was a fun experience and I would recommend visiting it if you are looking for something unique to do while in Phoenix.", "business_id": "1Ap6ZNCvyLLKHP0wvCk9yA", "stars": 4, "date": "2015-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Yj_zsi9IKrahvt1vxtqAhw", "review_id": "tNoBjKNt882-8upVf6uapQ", "text": "Clean, well run, organized staff.  Rooms are pretty typical of Marriott hotels.  As a platinum member, they do provide upgrades to a little larger rooms.  However, I consistently miss the concierge floor and need to take an elevator.  Food is good and the Red Rim Bistro staff is fantastic.  This is a good hotel if you're staying for a day or two on business and don't expect to see much of Phoenix (there's really nothing nearby except the Asian square...there are  few good restaurants there for dim sum).   Overall a good Marriott, but again, average as hotels go.  Exercise room leaves a lot to be desired.", "business_id": "_yGo2ubkwQPXcKrdcURSNw", "stars": 3, "date": "2013-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "grJc6k-n-aYO9CQMz1IsPw", "review_id": "BVxWu240osRNJxeW9SBabw", "text": "True local neighborhood dive bar, however not a place where the regulars stare you down and want you to leave.  They are really quite friendly.  The bartender was attentive and friendly and actually quite the eye candy.  Granted its in a shader area, but if you're already in the area and need cheap booze, Good times!", "business_id": "JWvdQoRe00tbdNwfZYeK6g", "stars": 4, "date": "2015-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BaHlhZ4dUO1AUY87ZXY6Tg", "review_id": "CNWeRtf5wM-qFdvqUmwLnQ", "text": "Truly.... thought it wld b boring, but was pleasantly surprised!  One of the least expensive museum, which was great.  Lots of stuff to keep kids interested.  Great to see the changes in fire fighting equip over the centuries & throughout the world. \nHighly recommend", "business_id": "fKwCjTBOmwcbl4XtYRZToQ", "stars": 4, "date": "2012-04-11", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 2}, "user_id": "jccGOMPTOGS22Tp2m9PAog", "review_id": "A1GbG-fyS22_BYxhwhmdJw", "text": "This is not the place to go for dinner.  Period.  They have limited evening hours and it's for a good reason.  During the 30 minutes I was there, not a single other soul ventured in.  I think they save the lunch leftovers and schlep them onto the unsuspecting evening customer.\nI can put up with a lot of things for a cheap dinner.  I don't need good customer service.  I don't need to eat in a safe neighborhood.  I'm not expecting gourmet, either.  \nBut, damn it, when you turn the lights off during business hours while I'm in the middle of chomping down my stale pizza, I'm drawing the line.  \nSure, come for lunch.  I'm always a fan of pizza by the slice places, and if my pizza was fresh, I'm sure it would have been good.  Pretty sure, anyways.", "business_id": "ZAgPh4v-oOb1g6cdlkKI0g", "stars": 2, "date": "2009-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "xdWsnbaTEfBMVHttqZDHxg", "review_id": "OJIDOnY4HTKEdREfs0xP4Q", "text": "Honestly I go here rarely.  My recent visit was to watch my godson while his parents were doing family picture photo shoot in the Chinese gardens and pond areas.  You can walk the whole cultural center and its gardens in 10 minutes, so there isn't alot of sightseeing here.  But to get a little glimpse of some replica gardens and seating structures from China, where else to go?  So 4 stars for the somewhat idyllic gardens in back behind the shopping plaza, cuz there isn't any other place in the valley like it.", "business_id": "PsuvqWNmLBU8ABkch2d9vA", "stars": 4, "date": "2010-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GuFEQ9FWT96RtBCoowDGKA", "review_id": "KcRL8b49eOiQbi0S5j-MOg", "text": "I'm an out of towner and came to this Chinese Strip mall, seeing the Ranch Market, I knew I was in the right place.  There was another restaurant called Golden Buddha next store, I decided on Lao Ching Hing based on the authentic decor, the smell of pepper outside the restaurant, and the menu selection.  I was looking for a Fish Fillet in Spicy Sauce and a Hot and Sour Soup.  Both were of highest quality.  I was impressed by the taste and the quality of ingredients.  I hate fatty meats and excessive oil, and Lao Ching Hing prepared both dishes to my likening.  I am writing this review because there was hardly anybody in the restaurant when I came in, and I believe this place should be packed.  In addition, they have a review listed on the tables which I consider ok, but not exceptional.  The food is priced reasonably and of great quality, it doesn't get better than that for me.", "business_id": "2unQHR9uaRxk3dsW6f3MGA", "stars": 5, "date": "2010-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "AWTv37Rg4YBfXN6wUbSHvA", "review_id": "7Y-GGLHhjjyyBexGpmLmJg", "text": "Was referred to MB Motors through a friend when my car had started to stall throughout the week. Couldn't be more pleased with their service. They were quick, informative, extremely affordable and honest. Will definitely continue to use them and refer them to other Mercedes owners, as well.", "business_id": "0Xnduj9w6aYHOtN_RlHUng", "stars": 5, "date": "2011-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "jKeaOrPyJ-dI9SNeVqrbww", "review_id": "GKgnNAElM0ybDix0M5xq5w", "text": "My experience here this past weekend was mediocre at best.  I arrived at the Chinese Cultural Center at about 4pm, after Dim Sum had ended at the Golden Buddha, so I decided to give this place a try with my Taiwanese boyfriend and visiting family.  The prices were a bit of a rip off for the portions that were served.  I order the vegetarian chow fun for $1 extra than it would have been as \"chow mein.\"  I'm assuming we just received the American menu, but who knows?  The service was conducted half in English and half in Chinese, which is typical when our mixed race party shows up at a Chinese restaurant.  I sampled the lemon shrimp my father ordered.  The sauce was a bit too sugary, like lemon drops, and the shrimp itself had such a thick, hard shell of batter that it was hard to taste the shrimp.  No drinks were suggested; we were left with only the water that was refilled every 5 minutes.  When we boxed up some leftovers, they did not give us the rice to take home, which makes me wary that it is being re-used.  A child was with us, and there was no kid's menu, which was a bit of a disappointment.  The food overall tasted alright, but I have definitely had better (and better service too!)  Nice try, but I'll stick with the Golden Buddha or something closer to Chandler.", "business_id": "yQONzVpX-DEpGSuKMIov6A", "stars": 2, "date": "2008-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9rnGNvOtWNwmd0sLL9FTyA", "review_id": "JobNPK35zd9m3UneygAg7w", "text": "Kungpao chicken is the best iv ever had!\n\nFood is great, they are fast, and friendly. \n\nI love this place!", "business_id": "yQONzVpX-DEpGSuKMIov6A", "stars": 4, "date": "2013-04-11", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "yy8vNTtESId44OcGyaVnbw", "review_id": "0eMuStbAf_cDk4HG-3QgdQ", "text": "Two stars is generous considering what was delivered tonight. I have had worse, but not often. The food was sub-standard by any evaluation, and almost an hour late to boot. The Kung Pao shrimp was wimpy. Likewise the Chicken in Garlic Sauce, contaminated with green bell peppers that we specifically requested be omitted. Seldom have I tasted blander Chinese food. The cook on duty tonight was simply incompetent.\n\nSupposedly they're \"under new management.\" This is probably a BAD thing.\n\nTo be fair, I grew up with very good Hunan & Yunan style Chinese food. I am spoiled. I do know the differences among good, mediocre, and lousy. To call this mediocre is generous.", "business_id": "9tefv6uPxoHhp_OlQQJVXA", "stars": 2, "date": "2011-04-06", "type": "review"}
{"votes": {"funny": 4, "useful": 7, "cool": 8}, "user_id": "ZmIgP4U4Ht9CYmNX0_zP6w", "review_id": "_SA4I3CltF-9hi6lEQNvlQ", "text": "After a trip to Target, we were hungry so my daughter and I stopped in for some dinner here.  She loves salad bars since she can pick out what she likes and just eat that.  It was about 8pm on a week night so they were not busy.  We were greeted warmly and paid then went to the salad bar.  Things had not been restocked but that's ok, there was still plenty and it was good.  They had some different salad....an oriental noodle one that I liked, and of course soup and bread.  For dessert they had the soft serve ice cream that is so yummy and lots of toppings to go with it.  \n\nThe place was clean and the staff was nice.  It's nothing outstanding but it was good and we were full.  And it was fairly inexpensive too.", "business_id": "Um5VnQXli9IwplV2rmgggg", "stars": 3, "date": "2009-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9G-MPhadAoE0WuA9n2ZpnA", "review_id": "qgR_3d-XLenFTjpqUKPk2Q", "text": "Applebee's is a great restaurant to eat at. The food, drinks, and prices Are great. But not at this location. The service sucks. And if you ask for a booth table they get pissy with you. It takes forever for them to bring the drinks. I don't like this location. I drive further down the road just for the better service.", "business_id": "hzUOqxpcnYYBgLlrgvjQYQ", "stars": 2, "date": "2013-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TmEPymvZ2Q9QCSJi6Q63Cw", "review_id": "5lp7FVVwKZieGOClKlclqQ", "text": "My husband and I heard great reviews about this restaurant and we decided to give them a shot. One word can describe this place GROSS!!! The food sounded great but then you took a bite and ewww disappointment. The salsa was lame, the chips stale. There were only two good things about this place the soda and the waitress was nice. Other than that don't waste your money GO TO ABUELO'S...it may be on the west side but it never disappoints.", "business_id": "jzPMl-NoB5F2fwoHX3hN8A", "stars": 1, "date": "2010-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FYsAZu6zAD0aCGqg4T7eJw", "review_id": "6Da4d15XqS_RVkiuGQNP0g", "text": "The food is always good, which is why we keep going back. The big issue is the noise and how hard it is to even have a conversation there. It may have been because of all the noise that the waitress got my order wrong, but either way it just shouldn't happen.\n\nI tried the blood red orange margarita, which was nothing special and over priced. I think if you are going to go that route you should just stick with their regular margarita. \n\nI will say that one other thing you can never go wrong with is their green corn tamale with Baja sauce. It is fantastic!", "business_id": "jzPMl-NoB5F2fwoHX3hN8A", "stars": 3, "date": "2014-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "siS-k56QvYx3QlUkiTFLcw", "review_id": "903mO5JLjoKuLmrNxXpx8g", "text": "Stayed here this past weekend while visiting Phoenix with my boyfriend. Rooms were very clean & pretty modern (except for the dated wallpaper). I think the hotel's located about 10 minutes from downtown Phoenix.\n\nSuite had:\n- Small counter w/a microwave, mini-fridge (actual fridge, not a mini-bar fridge, so you can store your own beverages in it), 2-cup coffeemaker (with coffee, tea, Half&Half creamers & sweeteners) & a teeny-tiny sink\n- Living room w/leather couch & fabric armchair, kind of flimsy coffee table & a flatscreen TV (Note: Remote was reaaaaally annoying to use b/c there was a 2-3 second delay each time you changed the channel)\n- Bedroom w/very comfy King bed, nightstands w/an alarm clock on one, a dresser & another flatscreen TV\n- Very clean bathroom, with 2 doors: 1 leading to living room, 1 leading to bedroom. Oh & must mention that this is also where the closet is. Yes, you read that right: The closet is in ... the bathroom. Huh?? (Closet had ironing board, hangers)\n\nEveryone at the hotel was very nice & accommodating, I was always met with courtesy & top-notch customer service everywhere (Front desk, lobby shop, bar/grill, valet, etc).\n\nHotel also had a lobby store (which sells beer & wine, for anyone who'd prefer to have a quick drink or 2 in their room without hitting up a bar), a lobby bar & restaurant, an indoor pool (which I didn't get to try out because I forgot to bring my bikini with me).\n\nMy only complaints (really minor):\n- Good yet Cheap Eats: Only place to eat at the hotel (without driving somewhere) was the hotel restaurant. Wasn't very happy with paying $15-$20 for mediocre (but edible) food each time I wanted to get a quick bite to eat. The lobby store had some snacks & Cup o Noodles, but that's about it.\n- Noise: Since the rooms face the atrium of the hotel, noise sometimes traveled up from the bar area & I was able to hear some loud laughter constantly at night. It wasn't crazy loud & didn't keep me up, but even from the bedroom, I was able to hear it a little. I guess my own stupidity was that I didn't shut the bedroom door, but I guess the comfy bed made me too lazy to do so.\n- Parking: Is $11/day, which luckily my man & I were exempt from due to a special deal he booked.\n- Elevators: Only 2 out of the 3 seemed to be working, for the most part they ran ok, but sometimes were a bit slow so there was sometimes a line of people waiting in the lobby for it.\n- A/C: It was kind of on the cold side in the room, even though I kept raising the temperature, it kept blowing out cool air.\n- No Safe: Didn't see a safe in the Bathroom Closet (feels weird saying that! haha).\n\nOverall though, would definitely stay here again!", "business_id": "urBWfXQjyyWIO5B7FvnOpg", "stars": 4, "date": "2011-04-13", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 3}, "user_id": "PVIJ0S6sVxGYstpyWAUciw", "review_id": "N-ohDZHx8pPu9FWN8ygs7Q", "text": "AJs is\nmy regular Sunday morning coffee walk\nmy florist\nmy gourmet mustard\nmy Karsh's buns\nmy Simply Bread Monkey Bread & Challah\n(so sad, no more Willo bread)\nmy wine store\nmy salad stop\nmy pizza place (trivia - Chris Bianco used to work the oven here, maybe before it was AJs)\nmy deli\nmy dinner (usually salmon)\nmy fresh fruit & veggies (Utah peaches!)\n\nStaff is happy, making it so pleasant to shop. Jason is a terrific barista!\n\nA few cautions - some out-of-date items still on the shelves (two weeks ago it was eggs) and one barista/bakery worker who has been there for years who just can't get an order done. They also seem to be closing earlier.", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 5, "date": "2009-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "HIldgLcrrY5Sv0orPkLG3Q", "review_id": "zCpTpowSbi3vQbrV2NCWFQ", "text": "Don't Do Online Ordering!\n\nTypically, I really like the food from STNY. Today was my first time ordering from them online - but it will definitely be my last!\n\nI'm no novice at online ordering - I buy lots of stuff online, including local pizza delivery. Wanting something, different, I visit the STNY website, see they have online ordering - cool! So, I create my account, place my order, pay online, get my email confirmation... a few minutes later, one of their employees calls and says, \"Yeah, we don't know why but you got two free toppings on this pizza. We're gonna go ahead with it this time but in the future we're gonna have to charge you extra.\" \n\nUm, WTF?! All I did was click the buttons to indicate what kind of pizza I wanted, the toppings, followed their prompts for payment including adding a tip (even though that was confusing to do). If there's a problem in the way their system calculates out my total, it is CLEARLY a problem with their programming NOT with me the customer! She seriously made me feel like I was trying to get away with something... how could I \"sneak\" in a couple of extra toppings on their system?! Do they not even think things through before calling their customers with accusations?\n\nThey just lost my business. NOT COOL!", "business_id": "JN2qXIuDXnV2d8WnSqd28A", "stars": 2, "date": "2013-05-17", "type": "review"}
{"votes": {"funny": 8, "useful": 11, "cool": 10}, "user_id": "HOleI3jz1MLNUJ6cc1x0Pw", "review_id": "ga65pZBMvWC2gaKS6AkzVw", "text": "As any normal person would when trying a place that has 4.5 stars based on 70 reviews (and that just *happens* to be related to the notorious Pizzeria Bianco, where people wait hours upon hours for pizza), I had very high expectations for Pane Bianco. I expected to bite into my sandwich and be wowed. While I really enjoyed the mozzarella and soppressata sandwiches we split and certainly found them both more enjoyable than many sandwiches I have had in the Phoenix area, I just don't think this place is deserving of the Salvation Army of fans that seems to be willing to fight a holy war for that mozzarella sandwich. \n\nIn my eyes, what makes Pane Bianco's sandwiches good (and still worthy of 3 stars) is the fact that they are simple. Unlike some yuppy establishments where Arcadia ladies \"lunch\" (think Wildflower, Acacia Cafe or Chelsea's Kitchen), Pane Bianco (and by the transitive property, Chris Bianco) clearly has the European sensibility of \"less is more.\" A sandwich doesn't need to be piled high with garlic aioli, carmelized onions, and herb goat cheese to be good. If the ingredients are high enough quality, the bread and a few fillings should be able to stand alone and make for a great sandwich. \n\nI guess that's where my problem with Pane Bianco comes in. The individual ingredients of the sandwiches just weren't that great. Certainly, the mozzarella is good but I have had better mozzarella from nice local grocery stores and of course, at countless Italian places. I also agree with Kristin S that the soppressata was overly salty, which obscured the flavor. Finally, I didn't think the bread was as delicious as I had pictured it would be many times before actually coming. It certainly tasted fresh but I thought it could have a bit more flavor complexity (as it was, it tasted very white-bread and didn't have the slightly sour kick that housmade bread often does. \n\nI've got to be honest that after trying Pane Bianco, I am convinced that I would be a bit disappointed if I waited in line to eat at PIzzeria Bianco. While I can definitely appreciate a simple but delicious Pizza Margherita in a world where buffalo chicken pizza is somehow an appealing dish, the individual pizza ingredients would have to be better than the ones at Pane Bianco for me to truly feel like the wait was worth it.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 3, "date": "2009-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sOgoEBH5rCJ1ug2wHhhvYg", "review_id": "nTwvCvHjAb7S9AucPgoAww", "text": "Not a bad sammy at all.  I had today's Market sandwich which was a lamb sandwich with a light italian dressing and lettuce.  \n\nThe lamb was wonderful and strong in flavor.  The bread very flavorful, and chewy.  The lettuce which I think had a fancy name was to me, just lettuce, and I'm sure it wasn't italian dressing, but thats what it looked and tasted like.  \n\nWhat I like though is a very simple ingredient list, and simple prep, but with perfect execution, make for a wonderful lunch.  \n\nI still have a favorite in Seattle, which is Armandino's Salumi, whom used to be run by Mario Batali's father, now daughter.  The meats there are to die for.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 3, "date": "2010-03-24", "type": "review"}
{"votes": {"funny": 1, "useful": 7, "cool": 4}, "user_id": "lPaYMDmJbAnv_3pmZH_inw", "review_id": "t22ygSvsRVfiymTcsuR2Ig", "text": "Yay dinner!!!\n\nIt's no big secret that I'm a huge fan of Chris Bianco. His simple honest to goodness approach to food is not only inspiring but down right delicious. If you're one of his fans who don't mind waiting 4 hours for one of his amazing pies at Pizzeria Bianco, then you're in for a real treat. While they don't serve pizza, one of my all time favorites, Pane Bianco is now serving dinner and no serious wait either! In addition to ordering one of their famous sandwiches, you can expect an ever changing menu of rustic Italian inspired plates.\n\nIf you've been to Pane you know the drill, go in, order at the counter then either decide to take your score home, or eat there on one of the communal outdoor tables. No wine or beer is served at this time but there is talk of Pane expanding into the Lux Coffee space next door which will eventually offer inside seating and hopefully wine by the glass. If all of this goes down, Lux will simply move to the adjacent building also getting a larger space. For me Bianco's food just screams for a glassed of red wine.\n\nOrdering the Crespelle ($12) had me really excited due to the unique nature of the dish itself. Basically an Italian crepe made the garbanzo bean flour; it's filled with luscious ricotta cheese, hints of spinach then bathed in a slightly sweet tomato sauce. It was clear that after the first bite I was in love with this dish, I simply couldn't stop though glares from my dining companions made me to relinquish the plate. \n\nI can't sing enough praises for Biancos Housemade Mozzarella ($8), thick slabs of hand pulled cheese is paired with fresh tomatoes, a few leaves of basil, olive oil and a sprinkling of salt, that's it. The resulting texture and flavor is so toothsome and fresh that I've yet to have another as good. The salad comes with bread which I put to good use soaking up every drop of the salads milky elixir. \n\nServed on house made flat bread, the Soppressata with Aged Provolone ($8) which also comes topped with a healthy shave of Parmesan cheese and slices of roasted onion. The pungency from the provolone is a nice compliment to the pork-tastic slices of soppressata. \n\nBianco is dedicated to local purveyors and for good reason, they make some of the best Phoenix has to offer. Take the Sausage with beluga lentils and polenta ($10) for instance. The sausage comes from our very own Schreiner's Fine Sausages over on 7th Street and let me just say, this plump link had just the right amount of meaty well seasoned punch to compliment the hearty lentils and super moist polenta cake.\n\nIf you're more of a lighter eater, I'd suggest the highly flavorful Roasted Seasonal Vegetables ($5). On my last visit the pan was filled with long thick spears of asparagus, sweet potato, cabbage, radishes, broccolini and cloves of garlic. Grab a loaf of their chewy bread ($3) and you have yourself a vegetarian option even a meat eater like me would love.\n\nNow if they added pizza to the menu, my life would be complete.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2011-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cYQBVK4mo1z62x7_kT_4HA", "review_id": "u9MlkXnguue4FIvXFF9hqA", "text": "After reading the reviews, I was expecting more. Pane Bianco is okay. It is a little expensive for what you get. I had the tomato, basil, and mozzarella sandwich for lunch. The mozzarella slab was huge and disproportionate to the tomato and basil. It was just too much of one flavor. I feel lucky that I had someone to trade sandwiches with halfway through the meal. The tuna was okay though nothing special. The iced tea was good, and I appreciate that.  It is often hard to find decent iced tea.  I also enjoyed the rice pudding.  I would try Pane Bianco again, but I think it will always be too much of the same flavor.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 3, "date": "2013-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Avf58wphDluj8O4QtMgdzw", "review_id": "7Bw6nwD_29ZJWLalGjfmIA", "text": "This place is so quant I LoVE it!! Try the traditional marguerite pizza it is soo yummy and thin crust with a great crunch! I will definitely be returning", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2014-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Ovpa3S8xD96dLE5eDxcxJg", "review_id": "nXTDfOjgsRRCYsndOc0WIA", "text": "I have to concur with Shannon and Sarah on this one. \n\nIn high school, we used to get out n Friday's at 12:30 and then we would rendezvous with our lady friends for lunch. There were an amazingly high number of awkward teenage lunches that took place at this Duck and Decanter, until one day I realized that I really don't like the food there, or anything about it really. \n\nIt somewhat effectively passes itself off as a gourmet sandwicheria/deli but more by pricing everything high than serving good sandwiches. \n\nI'll still drop by from time to time and still have friends from high school that love it, I just don't think I ever will. \n\nTwo and a half stars.", "business_id": "7Jmri1RCl9Ksmpi5EoIOZQ", "stars": 3, "date": "2007-03-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "79XESLXqHug_X8MMUETnWg", "review_id": "iJIQzPP_xjbYJXiBmoUrlQ", "text": "Love this place!  Since discovering the George and Dragon, my friends and I make it a weekly stop.\nThey have a huge selection of beer!  Also, a late night menu of home-cooked food... which is actually delicious!!\nThe outdoor patio is a nice addition, especially for socializing and smoking!  Really, the only decent place to hang out in the NorthCentral Phoenix area.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 5, "date": "2010-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "htpCOKrgn_-F7gXgBNKQiA", "review_id": "7rhiHgzNT7nYU9dsE6Jw_g", "text": "I've been popping into the George and Dragon nearly every Thursday since last April for trivia nights.  I like the place.  The trivia host is entertaining and the place feels worn in, but not worn down.  I feel comfortable and welcome every time I visit.  Most weeks I end up ordering a couple beers from the rather large selection.  The drink prices, while high for some people's tastes, are comparable to what I've seen in other places.  Imports are going to cost more, it's the price you pay to have a selection of Boddington's, Murphy's and Guinness all in one place, among other things.\n\nNormally on trivia nights I don't end up getting food, as although I find their portions proportional to the prices, I don't feel I need to eat half my weight in fish and chips in one sitting.  I have no qualms with the quality on the few occasions I've grabbed some eats, for example the curry chicken is very flavorful and highly recommended.  The dragon wings are another of my favorite, spicy but not overwhelming.  The fish and chips, as previously mentioned, are served on a giant platter and have generally been excellent.\n\nI recommend at least one visit to this bar.  Don't be scared off by the divey look of the pub-front.  The F.C. scarves adorning the ceiling, British booze advertisements on the walls, and the cozy but not claustrophobic seating arrangements make it a unique place in the middle of the desert.  If you do visit, pop in on a trivia night so you can listen to the host demean the guests with some clever snide remarks and give yourself an entertaining diversion for a night.  Who knows, you may become a regular before you know it.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 4, "date": "2012-04-06", "type": "review"}
{"votes": {"funny": 9, "useful": 10, "cool": 9}, "user_id": "cRyNICH0mhjxagvSyVr60Q", "review_id": "CEIc0zDOWkUjowV3_dVLmA", "text": "This is probably my favorite neighborhood bar, and mostly because it's just a hop skip and a jump from my front door - or a scoot on my bad*ss kick scooter. (like a razor scooter, but more awesome)\n\nLock that puppy up (again, bad*ss scooter reference here) on their bike rack, hop in with your pals for a late night clandestine meeting of the minds - at least that's what it'll seem like after a few of those $3.75 well drinks on a Friday at 9 or 10 pm, when in reality, it was just two or more buffoons boozing around making fools of themselves.\n\nI'd say that I'm more a fan of neighborhood type bars than dance clubs, mostly because they tend to be lighter on the wallet than the latter. Call it a dive if you must, but I wouldn't classify George like that. Sure there's the obligatory pool tables and darts that make up a good dive. On any given evening, you might run into someone toting along their children for the 'grille' part of this bar and grille, but really, it's certainly more bar than grille by hefty proportions. I can't recall how many nights have ended at George, but you can rest assured that there will definitely be more.\n\nHappy Yelping Phoenix, come meet George, he's kind of awesome.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 4, "date": "2015-03-03", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "saNCRlGYQEBkgpvalJsvRw", "review_id": "Z9-T0uG5nntwX14kYHaijQ", "text": "Update 9/25/07 - Received a phone call from a salon manager today.  The $85 I spent to get my haircut corrected (not to mention the time) will not be reimbursed.  She stated over and over again how they offer a 100% guarantee...apparently not.  She just didn't understand why I wasn't willing to risk yet another haircut with them.  I told her I just didn't have faith in their services.  I don't think you should either...\n\nUpdate 9/20/07 - I got another cut and color in August.  Color was wonderful as always.  Cut was atrocious.  It was kinda in the $8 super cuts range.  I hardly trusted them to give it another go.  If you did this once, why would I let you take scissors up again?  So, I headed to Rolf's and $85 later, I had a real haircut and style.  Sent a letter to the management of the salon...still waiting to hear back from them...", "business_id": "VAHiEHdVPlG2DVG3YO6C7A", "stars": 1, "date": "2007-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y9sl_xyBdzDTaXtwMwA8Tw", "review_id": "P6Cq7qrbbJN7tUfOta7Qgg", "text": "The man is a perfect gentleman and takes pride in his trade.  Its true, he follows you into the humidor and offers suggestions and an education on cigar if you are interested.    Give him your business. He deserves it.", "business_id": "vQxxDYo-riHU5j9jHhi_tw", "stars": 5, "date": "2013-04-22", "type": "review"}
{"votes": {"funny": 4, "useful": 6, "cool": 1}, "user_id": "EHf-ZSXjGFZG7ZJcpdZI8Q", "review_id": "hfiDr8qX8v3E5mXcAQv1xQ", "text": "Im very sorry that I spent money on a groupon before attending a class but alas, you live and learn. The staff is very rude especially if you had purchased the groupon (THE NERVE!) because apparently, you need to know ALL THE BIKRAM. Not a good place for beginners or anyone with a sense of smell for that matter. The carpet really is a health hazard and I left feeling sick from the stench. The instructor didnt bother to take one second to explain things carefully or slowly, just reciting the poses SO FAST it was hard to keep up. How can one relax and focus when they dont know what to do? HORRIBLE. I wouldn't ever recommend this to anyone. Sick.", "business_id": "5EyT-ZbhJR6LwtVaPyE3bg", "stars": 1, "date": "2013-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6aZE5eD5vL6SYh7rgXtFKQ", "review_id": "Z7p7iscCU05ZcxGkfW9aUg", "text": "First visit yesterday to get my road bike fit checked because of some shoulder stiffness. I had been fitted by complex computer aided fits and never felt comfortable on the bike. The staff was very friendly, knowledgeable and did not pressure me into buying a lot of extras. Road bike fits can get very expensive if they recommend new seat, stem, shims, etc. They took the time to understand the issues and discuss an acceptable solution. \n\nFirst ride went well. I will be back to support the shop", "business_id": "42Ai9wcFPE2HZ_aADGXI9Q", "stars": 5, "date": "2014-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3wSdAy0qbV_vtvbxHQrJkw", "review_id": "MYP4Go1yF4DRaD55Tm0HMw", "text": "I went here for breakfast with a friend. Its really your typical breakfast diner. They had a turkey omlet special that was really good, and massive. I also got a side order of pancakes...my total was like $16 for that. Way too expensive for a basic breakfast diner. I have gone to gourmet breakfast places and paid less for much more impress food. The staff and service was great..but the cost just really bogs me down.", "business_id": "SkNUbFJiJtbZjY-S_S0u7g", "stars": 3, "date": "2012-03-07", "type": "review"}
{"votes": {"funny": 1, "useful": 6, "cool": 4}, "user_id": "Ovpa3S8xD96dLE5eDxcxJg", "review_id": "cJFplifWhtwRRmuOBYqrUA", "text": "After seeing Kristin's review of Xavier, I felt compelled to scrawl a little something about my alma mater, as well. \n\nFirst off, I should disclose that Brophy has changed significantly since I was there: the huge arts building, the new library, a new gym, and quite a few other additions have made it such that I barely recognize it anymore. \n\nThankfully, the crux of the positives are the same. The teachers are overwhelmingly good, with a few exceptions, and the experience is as positive as one can have in a high school environment. \n\nThe all-dude \"fratmosphere\" can be a little off-putting, but it is surprisely beneficial in a four year timeline. By senior year, the comfort of single-ed classrooms far surpassed the need to ogle ladies and allowed for many fewer inhibitions and insecurities as in a typical co-ed setup. \n\nBy the time I arrived at college, I felt more prepared than the vast majority of my classmates and even more mature, in certain ways. I am a far cry from a die hard Catholic, but the Jesuit style encourages and facilitates renaissance learning, which should be the goal of any educational system, as I see it. \n\nEvery high school has its downfalls. I'm convinced that it is an awkward time for everyone, but I guess my parting thought was that this environment actually spurred growth from the difficult nature of the common experience, which can't be said for many institutions of this kind.", "business_id": "TPyGIwybbUsOvwERNzNYnw", "stars": 5, "date": "2007-03-23", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 0}, "user_id": "A_O8wZOsMTPwyeYA4-Rsow", "review_id": "2v1Ju1j4UFSR-2eWLFM6MQ", "text": "Wendy's new BREAKFAST blows!\n\nI've never been a huge fan of Wendy's food, however seeing their big window sign of their new breakfast sandwiches drew me in.  My God they looked good!  And my God was I disappointed.  \n\nI had a sausage biscuit with a kick ass looking buttermilk bun that was infused with syrup.  The meat was spicy (ala McDonnalds) but the rest was just yucky.  I highly recommend you skip Wendy's for breakfast.  Bummer.", "business_id": "g4Eit1EeeEGhTVik6AWYsA", "stars": 1, "date": "2008-04-17", "type": "review"}
{"votes": {"funny": 5, "useful": 8, "cool": 6}, "user_id": "kffxYQVQsEpF1DVlQlcGCg", "review_id": "8cVmLOiABiz8zjHLVasJ_A", "text": "This Shop has been here for many years. In fact as long as I can remember.\nIt has always been my family favorite. My girlfriend tried to convince me that Godiva is better, But I think I have convinced her that See's is better.\n\nDuring the Holidays they always have some really great products. Everyone loves gifts from See's for sure.\nThey always give you samples when you come in as well. \n It smells wonderful in here as well. When you walk in it smells like fresh chocolate.\nI perfer the dark chocolate over the milk, and they have a really good selection of that as well.\nLots of parking outside as well.", "business_id": "ezM-93i6eNb4LnYp3J101Q", "stars": 5, "date": "2013-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UBu9AkLTiECU1YAuFyAepA", "review_id": "sqHDE8JRj0duCwNHj4YZYw", "text": "I like the food don't take me wrong is just the price, quantity n quality of the food don't seem to be equal, but nice place to have some fun with friends and family...", "business_id": "cjUmPLRT43wN9Z87A9BOpg", "stars": 3, "date": "2014-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "qRo9gHN5OiV1-peDuhCh-g", "review_id": "i6atl9JAXgmB-ndNN1RRVQ", "text": "I lived in the neighborhood for a good year before trying this place. Shame on me! This is mom and pop at it's finest. Great portions of high quality meat and yummy breads. Price is such a good deal for what you get and it's always super fast service. My man and I usually split one sandwich and side and are happy full when done. I love the selection of Boar's Head meats as well as I can't find them at the Fry's down the street.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 5, "date": "2011-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "C6BYesCiITaw_STVT1GI6g", "review_id": "XdoZsB5AUcsOnJ_XoD5wdg", "text": "I think as far as the food goes it's pretty average.  Have never been disappointed with the food but it's not \"great\" by any means.  What I do have a problem with is their service is TOO GOOD.  I'd like a few seconds after I lay down my fork to chew before you come and snatch my plate out from under me.  Servers are all over your table all the time.  I know they assume this is good service but to me it's annoying.  I love good service just as much as the next person does but it does not take 18 (yes I counted) visits to my table and 3 different waitresses to accomplish good service. You got to give them credit for trying but sometimes I think they try a little too hard.  My first visit I was impressed and thought \"wow what great service\".  The rest of my visits I have just found it overly annoying to have a server at my table 15+ times every time I visit for dinner. Slow down !!!! It's ok if my plate sits on my table for empty for 2 mins even 5+ minutes. Just as long as you eventually clear it BEFORE bringing me my check you'll have accomplished your job of good service.  But 15+ visits from a server EVERY time I've dined here is becoming annoying. I feel like I\"m talking to the servers more than my dinner guest.", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 3, "date": "2009-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LhUE4c6gfuImp5XZcF-_DQ", "review_id": "wk3v-EyEPx1j3TsNp1p7vg", "text": "Food exceeded expectations. Waitress was quietly attentive. We are discerning Chinese diners and will definitely come back.  Spicy Hunan Tofu very nice!", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 5, "date": "2013-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BaoM3CBH3_AH47wujyC4FA", "review_id": "wf-Ot-bpxqttrTEI9noXDA", "text": "Went on Tuesday with a few people from work. 3 out of the 4 people that went were out with food poisoning having the worst nights of their life. Somewhere between the Sweet & Sour Pork and Lemon Chicken only I remained safe with some decent Sweet & Sour Chicken.", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 2, "date": "2014-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PUwuWFTEYIzhFsKhy_oi3w", "review_id": "tSjTSs1C3-SAa21kTfSpFw", "text": "First time sitting in China Chili and so glad that I did as I was able to get their fresh wonton soup. (Unfortunately I could not remember the name of the soup--thank goodness the table behind me was eating it and I was able to point it out the waitress) The wonton soup came with 8 large wontons, broccoli, chicken, green onions, and other Chinese vegetables in a savory white broth. The soup came out in a large bowl and was piping hot--almost burned my tongue a couple of times, but it was worth it as it was very flavorful and not too salty.The soup with tax came to $8, which was a surprise as I thought that it would be more for the size. I would definitely come back here for lunch as the price you pay for the amount of food that you get and the quality is great. The only negatives was the service (the waiters stood around not too far from our table looking extremely bored) and the chicken corn chowder soup, which was bland and left a lot to be desired. I only ate it because I was very hungry and had to wait 15 minutes for my friend to show up (smile)", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 4, "date": "2015-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "rlcJkEoYzuiS7iF5XfXCMA", "review_id": "S9FHWkrKAtbmIzubkjnhew", "text": "i had my first appointment today. I saw Kim. I wanted to try acupuncture because my dad in Florida has had such great results for a skin condition. I don't really have any specific health concerns so more for overall health, though I did remember m y wrist has been a little painful the last few days. The grounds around the school are actually pretty neat, with a great little creek that flows around the courtyard, and is really calming. The first session took about an hour and half, which included going over some history. Today they needled my hands, feet and ears, so I didn't have to disrobe. The table was warmed and very comfortable :) After about 10 minutes, Kim came to check on me, and then left me alone for another 10 minutes. \nI can't say that my wrist feels very different, but I feel a little more energetic overall after the session, which I thought was strange, since I am a bit of a skeptic. I have another appointment for one week and I can't wait!", "business_id": "DeuczlKSckFFFV2IVR8EVQ", "stars": 5, "date": "2011-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bymcwh4EHM_MWiYF435gdg", "review_id": "LycEGW4yxciViThF_hF6OA", "text": "I was satisfied with my meal here. We have a strong lacking of buffets in San Francisco, where I'm from, so I was appreciative of what this restaurant had to offer. Unlimited soup, baked potatoes, and soft-serve ice cream? Oh yeah, and salad right?", "business_id": "wTiQXYB9fE9rcSZDsZgbtQ", "stars": 4, "date": "2009-03-28", "type": "review"}
{"votes": {"funny": 4, "useful": 1, "cool": 1}, "user_id": "fev0iI-XDrteD4SYRKjiUw", "review_id": "k4AUWPbHY8G4zwnBL4PsDQ", "text": "I'm really torn on the number of stars this rating should be.  We didn't go inside, so I can't really judge the place.  The drive-thru was full of pigeons having sex which made me tense and uncomfortable.  I didn't have to wait in the Aviary Burlesque House for too long before you took my order and let me get up to the window.  I thought the prices were high for cheap asian food but the quantity was there.  \n\nThe egg rolls were probably the best I've ever eaten.  I hate egg rolls but I would order one of those again.  My orange chicken, however, was tough and rubbery.  The orange flavor was fine, but those pieces of meat had been sitting out a LOOOONG time.  Too bad too...\n\nI may go back and try something else in the future...but for now, you suck.", "business_id": "L19_1cG2ALVjdBQ456h26A", "stars": 2, "date": "2009-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Rzh6otnpcsIXswsOjb4jcQ", "review_id": "qFdIZy28d8-BC-9o675tmw", "text": "Ice cream was typical for DQ but neighborhood was a bit sketchy on a Saturday evening. A guy outside had a holstered firearm. \n\nVery small store. Very limited seating. \n\nMy only concern was how well they cleaned the Blizzard machine. Just looked like it needed some cleaning. No one got sick so probably fine too.", "business_id": "zZmhEpiVpRfFQid87-pcOQ", "stars": 2, "date": "2014-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EgfTy81qQBFFn4lqCtjMeA", "review_id": "9OcpYg1GTkhvsMofFOnhwQ", "text": "I wanted to get my husband a nice cigar for his birthday. These guys were super excited to help, asked me questions about what he likes to smoke, and helped me pick out 2 quality cigars for the amount of money I'd told them (instead of just 1 expensive cigar). \n\nThe building doesn't look great from the outside, but don't let that bother you.\n\nThis review is from someone who knows nothing about cigars, so take that as you will. But I felt completely comfortable here, and the customer service was great. Looks like they have a really big selection. They also have a smoking lounge.", "business_id": "PQ-h1-ahAwkICsz5-Zl5Qg", "stars": 5, "date": "2012-04-05", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "W_QXYA7A0IhMrvbckz7eVg", "review_id": "RnaHFNTMlXWPi9w9yfUDyA", "text": "After stopping in here after work last week, I can now die knowing what a 15,000 dollar light fixture looks like.  It sure is pretty, but I had no idea a light could cost that much.  We've been looking for a light for our near-completed bathroom project for quite a while now.  Our taste is a little left of the middle and after leaving Modern Lighting empty handed, this was kind of our last hope.  Luckily, we found something we really liked, and amazingly enough we managed to pick the cheapest thing in there!  They have a huge assortment of chandeliers, fixtures and sconces.  The store is quite beautiful to look at and just browse.  Hinkley's is sure to please everybody's tastes and wallet sizes.", "business_id": "nV_7lAYFVISEs-Te4e39gA", "stars": 4, "date": "2009-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0VfJi9Au0rVFVnPKcJpt3Q", "review_id": "G0w4V47CWRkKBeDqaIlJiw", "text": "Atmosphere is wonderful. Outside patio dining with powerful misters. 70's / 80's music pumped in for effect. Staff is very friendly, cordial and fast. Food is good for bar food. I give it 4 stars for atmosphere.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2009-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9hV2Tf54ZFPcllBI-dwM_A", "review_id": "BypGF86Atx3eBHODqAMyGQ", "text": "Nice place over all.  The beer is good.  Other than beer, I have only had the nachos and they were average/tasty.  The waitresses are always friendly and helpful.  The restaurant is comfortable and they also have a nice out door patio.  The beer sampler is a good way to start your beer quest!", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2011-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "V6rhoTCw7S6H8eHwv2M6Vg", "review_id": "2xXTQLfF1VFT6QqY1WOR4g", "text": "I like sunUp.  I like the beer, its good, I especially love the IPA.  Oddly enough, I have yet to eat at SunUp.  I just really like that this is a nice place to kick back and have a cold one.  The services is consistently quick and friendly, and the selection is great.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2013-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yXa1HFUJ3BtSqkDwTHdAUQ", "review_id": "9--0HoeoqdLgIRUGrBUx8g", "text": "Whenever I know I'm going to be in the area I always have my growler ready for a pour. I've been twice and don't remember anything about the food to blow your mind away but their beers are tasty!", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2015-03-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ku83Hm5S08f7zEeePBl1Yw", "review_id": "ngveeHpSCuTw6jIY2HTpQw", "text": "I, also, have been using this place for 6 years and I think it is way better than the cookie cutter opticians. They make sure I understand my options and help me with choices. I love this place.", "business_id": "c8JCwGEj6WMDEpb1Tqp_cg", "stars": 5, "date": "2015-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "w4dgIzMwwZvKsHaC47Ox3A", "review_id": "fkhGVNqe93YFwxOZ0HBDng", "text": "I Love this Place!!! Alway running into friends when on my breaks or lunches here is nice. And My Lovely Baristas have My Grande Quad Shot Americano with Caramel Drizzle down packed!\n\nPeople always ask me why I selected a Brand name when it came to my morning JOE. Well, just like the bars I frequent, I like regular(s)\n\nHave an Amazing Day!", "business_id": "dSQh1Hx2BiSrYog4ad740A", "stars": 5, "date": "2012-04-23", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 1}, "user_id": "0N0ngSQ8Njxfuvdxm1RpFA", "review_id": "Go6VVqiG9hcYo0M-NrIxJA", "text": "Cruising 7th is quite an odd little joint. It smells like sewage and old mops. It's the definition of a dive. It's dark, and downright awkward at times (rare, but if you get stuck talking to one of the few quite drugged out patrons). The parking lot is small. There is a small bench outside with people usually smoking and chatting about. Half of the crowd is really cool. Mainly gay, but some straight people, too. There are transvestites, some businessmen, some crackheads, and some really fun and hilarious people. You never know what you are going to get! There is a large bar, some really old tables with stools, a jukebox, digital bar game, a dartboard, pool, etc. This bar actually has 2 sides, but unless it's a weekend or a drag show night, you only get to see one side. The other side has some creepy clown-like decorations and a stage, as well as another bar. They have karaoke sometimes, too and I highly recommend this. It's a HOOT! There is also a pole in the center. ;) \nThe service is usually really good (Gary and \"mother\" are a lot of fun) and the drinks averagely priced. Sometimes I'm a little scared of the glass cleanliness. The bathrooms are horrendous. I actually cleaned one when I was super drunk one night because I couldn't take it anymore! \nI do think this is a big staple bar of the LGBT community and everyone can have a blast here. Just don't set your hopes too high. Expect an eclectic crowd and go in with an open mind.", "business_id": "hKB8OTUVIYLlDVWqFg8lnw", "stars": 3, "date": "2011-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BsgXTs_hz4AwgbK0wSIIxw", "review_id": "m60KBrWPuSC848o5aV55zw", "text": "I love this local stationary store!  I go for unique gifts and cards you don't find anywhere else.  The staff is terrific and helpful.  They have invitation orders and some fine paper.  Scrapbooking supplies and some gifts.  Perfect escape from corporate hype.", "business_id": "stVENgLTS3MiMhyeJ7XQZg", "stars": 4, "date": "2015-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "D80HWJeLhtJNTo82RFhy1w", "review_id": "EBA0tRKcKe4LpqHRxzSu-g", "text": "I have been frequenting Juan's for about 15 years and have never been disappointed. Their works burrito is the best in town, especially with their homemade green sauce which is creamy and cheesy and gooey and spicy and otherwise indescribable. You can dip your chips in it, put it inside the burrito, outside, or just drink it straight out of a cup (I haven't done this, but given the opportunity...). I've customized my works burrito in a variety of ways. I've had it with shrimp, fish, carnitas, carne asada, pollo asado, chile relleno, machaca, shredded chicken, a combination of several meats at once, with one tortilla instead of two (less carby), and with no tortilla at all (great as a chip dip). I actually drive nearly 20 miles just to eat here. Their salsa is excellent, and their chips always fresh. This is one of those gems that you would never suspect from passing it by on the road. This isn't just another burrito shop, this is the best Mexican food in the valley!", "business_id": "DeAnVirgOxQnI36V1W158A", "stars": 5, "date": "2013-04-18", "type": "review"}
{"votes": {"funny": 12, "useful": 11, "cool": 13}, "user_id": "6kmu0mYbdpMIOZ6Y0eVsxg", "review_id": "amqN2BmZPZjyH4XIbOeG4g", "text": "A man came over to my house last night with a bag of food.  Luckily, I knew he was coming.  OK, it was a \"dinner and a movie\" date and he brought a huge bag from Oregano's.  \nAs I started to get out plates and silverware, he mentioned that paper plates, plastic utensils and napkins were in the bag.  Well, he sprung for dinner, I can clean a few plates, right?  \nHUGE portions!  He brought spaghetti with marinara.  It was angel hair.  I think there *could* have been more sauce.  \nThe lasagna was their \"Italian Flag\" lasagna and really good!  Ooey-gooey with sausage and meatballs stuffed inside.  The portion was enormous as well.  We both had a hunk and I had another one today for lunch.  \nBoth entrees had different kinds of garlic bread included in the container.  \nThe appetizer was something I'd never had before: Toasted Ravioli.  WTF???  Handmade ravioli, stuffed and fried with a side of marinara sauce to dip them in.  There was definitely some kick to it, as they were stuffed with cheese and jalapenos.\nIt was a very satisfying meal and I'm giving it three stars.  The portions were big, the prices were reasonable (looking at the website since he brought it to my place) and everything was full of flavor.    \nThis was no Harley's meal, but for something quick and Italian, it wasn't half bad!  Of course, eating a meal on the couch with a cute guy will always be a plus!", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 3, "date": "2009-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GZTl2jYpBV5nFnjeoksyCw", "review_id": "k0nYdjsmaMobzJiwMUlrOQ", "text": "No one, I mean NO ONE does the thin crust pizza better that Oregano's. 'Tis a real shame this place is no where near my home on So Cal. Their sauce is the perfect amount of salty sweetness and the cheese blend they use is superb. I wouldn't mess around with those specialty pizzas they have on the menus because their classic traditional pizzas are top notch. Please come to So Cal, please ...", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 4, "date": "2011-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "feOEYwYbHDefLDhNfvxJ9g", "review_id": "POPRvl9HaYWgGC4LdaT39w", "text": "Oregano's does so much right with their pizza and sauces that it was difficult not to give them five stars, but I am trying keep it real here there are a lot of really good pizza joints in the Phoenix area. Honestly though I think I can rate them higher on their wings than on the pizza, not many places can get just the right amount of crispy and just the right amount of meaty when it comes to chicken wings and for my taste these guys nail it. I give the wings 5 stars hands down I will put Oregano's up against anyone in town for chicken wings. I have tried multiple locations and they are consistent at all three that I have tried. The only thing that is frustrating is that they are always busy and the situation to get a table can be a bit irritating when you have been waiting all week for cheat day...and speaking of cheat day the pizzookie or whatever it is called is super good as well if you are in the mood to pack on about 2500 calories in one meal these guys are one of the best places to blow a clean eating streak.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 4, "date": "2013-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HlpEwe0bWAl3sAWYVTxSEw", "review_id": "UirfB2KZeareu7vsHxpnVA", "text": "Great food and service. Awesome staff, very Friendly... Ryan. Lots of great choices in food. Yummmmm", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 5, "date": "2014-05-02", "type": "review"}
