{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UANFI1i2-xcOVIU8DYBdkw", "review_id": "qUkI_rNF-xpaQXqvdpb1hg", "text": "I travel a lot and have eaten at a lot of Hibachi restaurants. I happen to have a project in the Pittsburgh area and was looking for a Hibachi place to take my co-workers. I read several reviews on other Hibachi places and they all sound the same. The typical they are so busy the service sucks and they rush you in and out to turn tables quickly.  I found Sapporo and was very pleased! It is in an odd location but once you step inside, you feel the ambiance of cozy and family style. My party felt the staff was very friendly.\n\nI had ordered the filet and shrimp with fried rice. The others in my group ordered chicken broccoli, and the Sapporo Deluxe which consists of lobster, filet and shrimp. We all got started with the soup and salads, which was a pretty good size. I didn't want to finish it all because I wanted to save room for dinner. Our Chef was one of the most personable Chef's I have encountered. He was very talkative and really wanted to get to know us. My file was delicious and the fried rice was excellent. They make their fried rice from scratch. It's not prepared ahead of time like I see at most Hibachi places. I can definitely tell the difference. My friend Sam who ordered the chicken broccoli could not stop raving about the sauce that they used. It is unlike soy sauce or teriyaki sauce. We asked the Chef about the sauce and sure enough it is one of a kind. Dan, who ordered the Sapporo Deluxe was very pleased with his meal and couldn't even finish it. Actually we all needed to-go boxes. The portion amount here is incredible. You definitely get your money's worth here!!\n\nI would highly recommend this place to Hibachi lovers because this place is surely a secret in Pittsburgh. I can not stress how different this place is compared to other Hibachi places. I think this restaurant is family owned and not a chain which I can always appreciate. \n\nThank you Sapporo for a great Hibachi experience!! I will be back for sure!\n\nAnh", "business_id": "8Nm_jcCYtMXYW0ODSHDiXA", "stars": 5, "date": "2013-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GMtILOfAHXUMrfMgLPG0gg", "review_id": "Q44Ie5tBu4CqXLzeL9iLzA", "text": "This is now my favorite sushi restaurant in the Pittsburgh area and it is worth the drive to Mt Lebanon.  The staff were so super friendly at this family run place and provided excellent service. The owners were a nice couple that both stopped by to make sure we were happy, in addition to our very attentive waitress.  My friend and I shared a sushi boat that included maki, sushi and sashimi and all the sushi was very fresh and tasty.  It even included a spider roll as one of the maki, which is unusual when you get a combination where they usually give you smaller/cheaper rolls at most places.  They also had a decent selection of wine and beer which is unusual for a sushi place.  Would definitely go back.", "business_id": "mPlWLIA4pkHMRtlQDm6UyQ", "stars": 5, "date": "2013-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 7, "cool": 3}, "user_id": "nEYPahVwXGD2Pjvgkm7QqQ", "review_id": "0X-Yot10Q0Q5BFMdbak0fg", "text": "I can't believe I haven't reviewed this yet because it was simply incredible!\n\nSeriously folks, if you're looking for a nice night on the tahn, look no further!  And my words of advice: DO THE OMAKASE TASTING MENU!  There's really nothing more to tell you other than you will find it incredible, I guarantee!  \n\nThe Omakase tasting menu is either a seven course or eleven course dinner with dessert.  It's indulgent and worth every penny (at $85 and $130 respectively).  The plates served to you are small, but honestly not as small as I thought they'd be and the desserts, seriously, massive!  \n\nWe had the salmon tartare, sawara seared with hot sesame oil, fluke sashimi, black cod with miso, tuna shashimi rock shrimp tempura and an array of sashimi (toro, snapper, salmon, tuna and saward).  Honestly everything was fantastic and fresh, just like fish should be.   \n\nLike I said, the desserts were all amazing and most of the choices were very rich.  I really enjoyed the chocolate maki and the inventive house made ice creams.  \n\nThe overall experience blew me away.  From the service, to the food to the atmosphere it's a perfect 5 star place and if you live here and haven't been, don't wait any longer!", "business_id": "Cy9XgM3ZG2jZ1ganvolb6Q", "stars": 5, "date": "2012-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x-HHJ7gvqlxVDPbC1rOHBg", "review_id": "LSHf1vYdHOOHzsVizY2UBw", "text": "I acquired a taste for Japanese food during my frequent business trips to South East Asia and Japan. In India, it is impossible to find good Japanese food without paying eye-popping prices. When I moved to the US in 2009, I'd expected to be much better off. Columbia, SC where I worked was not exactly the big city I'd hoped to live in and dining options were very limited. So Charlotte is where I ventured for some variety.\n\nMusashi is the only authentic Japanese place in Charlotte. I used to stop by here every time I drive through Charlotte or would come to the Charlotte airport to pick up my girlfriend. I moved to Charlotte in 2010 and thought that I'd be a regular visitor after that. The 10-11 mile drive from uptown where I stay meant that I actually visited them even less frequently than when I lived in Columbia.\n\nI'd say that the Sushi has gotten better here from what I remember from my 1st visit in 2009. But the real treats here are the Ramen (love the Tonkatsu Ramen) and the Japanese menu (my faves are the Fish Liver and the Beef & Tofu). Ingredients are top-notch. For example, just try the fried squid - perfectly cooked and the best quality that I've had anywhere including Singapore. \n\nMy girlfriend had been very relucatant to try Japanese food because she was always worried about using chopsticks. One visit to Ippudo NYC convinced her that she needed to eat more Japanese food. We went to Musashi twice this weekend when she flew down to visit me :-) Sat lunch and Sun dinner! So now she is a convert too!\n\nIt is not cheap. But I'd say that it is great value for money - you do get more than what you pay for! Excellent service, nice traditional kind of ambience that is way more than the outside strip mall exterior might suggest. And most of all, fantastic food that I will miss when I move from Charlotte in April :-(", "business_id": "Y_OeiGhTm6ZEfZ1UQgM_wA", "stars": 5, "date": "2012-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DtSQQ5FhvdMwQbOKeU2y7g", "review_id": "NG3u5Q6qsKYMaFi-6wcaeA", "text": "We moved to Charlotte in Summer 2013 and we are so blessed to find this restaurant. I worked for a Japanese company and I have taken several Japanese guests to this place. All of them claimed that the dishes are very original and they felt that they are in Tokyo.\n\nOur family eats at this place once a week. Chirazi sushi, Agedashi tofu, tonkatsu and ramen/udon are our typical order.", "business_id": "Y_OeiGhTm6ZEfZ1UQgM_wA", "stars": 5, "date": "2015-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "iAOyEnsNLVgtov0_PjjbDg", "review_id": "NZQn6HSkOmXGZqXnP-Jk_A", "text": "We went for dinner with friends. It's hibachi and sushi place.we tried couple of hibachi items sitting in front of cooking place.The food is really delicious. \nI have tried shrimp tempura,chicken noodles with mixed vegetables everything is great.\nIn the menu they have different kind of  Asian beers too.\nit's good place to go with entire family and having dinner.", "business_id": "xLZilmaLXY0r-dBFaiLxww", "stars": 4, "date": "2015-03-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TMq1f_-vg5qj0E6DYYd7Ag", "review_id": "ml50cr2kCdLDa0INza5mAQ", "text": "In the style of Beni Hana but a little \"up scale\". The seating and service was prompt and courteous. The food ( steak and scallops) was totally delish.  In a departure from similar restaurants, noodles instead of bean sprouts were served with the vegetables. Next time I visit Charlotte (from the left coast) this place will definitely be on the itinerary!", "business_id": "1PSnPPFVfp03iPfJRPWWQw", "stars": 5, "date": "2015-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9iRDAeoTW08yZgR0JaaOHg", "review_id": "1D9lh4ARjdVy_uP7hIEsFA", "text": "I think this place deserves a 3.5 star. \n\nIve been here about 4 times. The food was consistently good, but it's not something to write home about. The price was on the high side, but it's totally what you expected from this kind of place (the decor is nicer than what it seems from the outside). I really have a mixed feeling about this place. The food is authentic though for the most part, so I guess that's a good change from Americanized Japanese food. \n\nThere was one thing I didn't like; fried salmon roll. The breading was thick and greasy. Otherwise, food was good. The whole experience was good, but there really wasn't a \"wow\" moment.", "business_id": "K5PfWwW61Ajommy9xvXdAw", "stars": 3, "date": "2010-03-25", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 5}, "user_id": "vsXP832M0kOxKpfduD7dWw", "review_id": "sBbTYCFoUNJeqxz0mk76iA", "text": "The service at Blue Fin earns all the stars, as far as I'm concerned. There are other equally tasty (and in some cases more flavorful) places to grab a rice bowl. The service is outstandingly hospitible though; so, you can't help but leave Blue Fin with a warm fuzzy feeling toward your hosts!", "business_id": "kaIue7GRCmkPzDeHDBTttQ", "stars": 3, "date": "2011-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J_ueX7B4F4ggrJsom_qocw", "review_id": "KRk7vmg0WsTYpicvLSV-oA", "text": "Awesome staff! Great food at great prices! I love the chicken curry, panko chicken, teriyaki chicken and the ninja fries! Love the ninja sauce!", "business_id": "kaIue7GRCmkPzDeHDBTttQ", "stars": 5, "date": "2015-04-03", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 3}, "user_id": "7izaZThzAWk2UjrDTL849w", "review_id": "s57yRtZGnlEzQUS2kuH9RA", "text": "Dear Yoshi's.  You and I go way way back.  Remember that one time I ordered Combo #2 (Teriyaki chicken)?  Oh yeah I mean that was about 500 times.  Remember that time the girl behind the counter was puzzling over my request for some Gomasho?  Oh I meant the 500 times (it's ok, eventually she figures out what I'm asking for).  Remember that time Kirk and I saw a cockroach hanging out near the bathrooms?  It really happened!  But only one time did I see it.  Don't get defensive now, Yoshi's, but please take care of that problem if you haven't already.  It's ok, we will still do business together---especially if you keep your prices moderate.  I'll still order Dragon chicken.  I'll still brave your parking lot, fending off the odd transient here and there.  It's nice to know you'll always be there for some decent japanese style food at a moderate price.", "business_id": "L19_1cG2ALVjdBQ456h26A", "stars": 3, "date": "2008-03-04", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "Wy6JfQaebNErtuk1mt5aEg", "review_id": "m3PVNy7Qn0Wih1MI9GBudg", "text": "We probably should not have waited as long as we did, for what we were served. \n\nIt's not bad, I guess... if you feel it is adventurous to try flavors fused with one another. I'm down with the fusion, only if it's done tastefully. I mean, after all, you are there for the taste. \n\nSeared tuna... was far from seared. They just let the flimsy slivers of tuna saturate in the acid for a bit to give it a seared look. But uh, it was missing the crisp in the sear, and all I could taste was the acidity and pepper sprinkled on top. \nTakoyaki... supposedly had some octopus bits in it. Luckily, I found 1/4 of a tentacle in these things. However, this was sabotaged by the sauce these little balls were drowning in. Too much basil in the hoisin or something. \nThe caterpillar... haha. Cute, but was searching for some significant pieces of eel in here. Sushi rice was a bit soggy too. \n\nEbi-ten, basically udon/soba (opted udon) with two shrimp tempura, was okay. I've whipped this up myself before, so...\n\nWow, unfortunately not very memorable. Good job, presentation... but not so much a sensation.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 2, "date": "2008-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Lp_Ykqfbv5Q-oyGYlMGJRg", "review_id": "zDfTnOJRcUSeIYWd4FudCw", "text": "I was surprised to see how packed this place was at 9 pm on a Sunday night. There were only two tables that were open, just because people had left a couple minutes prior. That was a pretty good sign of things to come.\n\nI wasn't sure of what to expect from this place cuisine wise, as I was hoping for Vietnamese food but all the places on Camelback were closed. Some sort of Asian cuisine was needed, and CherryBlossom seemed like our only option.\n\nWe came in, got our tofu Pad Thai and shrimp lettuce wraps. The food came out promptly, but I'm guessing that's because they half-assed it food wise. The shrimp lettuce wraps were incredibly gritty, and I felt like I was eating small rocks. The Pad Thai has way too much fish sauce, which overpowered the whole dish. The food wasn't too bad, but definitely didn't live up to all of the rave reviews.\n\nService was prompt, and the food was cheap, so that's a plus.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 3, "date": "2011-03-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tTQwXGXwGrcEnrJ4gziGAg", "review_id": "FM5zY5vJwzda3UZdeuuoUQ", "text": "I love this place! It's where I first discovered my love of sushi, I had eaten sushi before, but nothing quite as amazing as the Vegas roll I had here, and I am OBSESSED with it, it is the best I have ever had. also the ramen here is delicious. I recommend getting a big bowl of the Hakata.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2012-04-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "V6rhoTCw7S6H8eHwv2M6Vg", "review_id": "jMfHj0bGOQtuyzItwxST3g", "text": "We needed a break from St.Patties festivities, and some food, and one of my fav yelpers Nader suggested CherryBlossom.\nYou can't beat this happy hour.  A beer for under $3, various appetizers for $2, $3, and $4.  Nader raved about the spicy gyoza hot pot, so freaking good.\nI got the tantan-men, spicy noodles with minced pork.  I like pork in all it's forms, and this was good.  I'm a sucker for ramen, and this is a great place for a fix!\nThe sushi, was ok, not show stopping.\nGreat place for happy hour!", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 4, "date": "2013-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "K6HwBKlC8Z-PBPuFC1dnZw", "review_id": "Sm7f5gseXoMCurMSClRjHg", "text": "I'm relatively new to the phoenix area and my girlfriend was craving some ramen so we looked up this place and it sounded like sonewhere we wanted to try.\nAt first glance its a tiny hole in the wall restaurant but after entering its actually a little bigger than it looked from the outside. seating is still relatively limited and we showed up right at lunchtime so we had to sit in a back corner but I stil diidnt feel cramped. the interior is kept clean and smells like a combination of good food and floral arrangements. \nThe food itself was really good. I wasnt disappointed with anything we ordered. I had a chasu-pork rice bowl that was delicious.It was a little on the small side as far as portions go but  it came with a small bowl of miso soup that was pretty tasty as far as miso goes. I also ordered a california crunchy roll which was great and for a good price $4 and change. my girlfriend ordered a bowl of tan tan men- bbq pork ramen that was a really generous portion in a larger bowl. The food was also served with some complimentary bread rolls and we had some sweet pink lemonade to wash it all down. All in all the food was great and we ended up paying only $26 which for a pretty good lunch.\nThe service was great once we got to the table we were taken care of the entire time and the waiter was really nice. \nI definitely recommend this place ad will be coming back.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 4, "date": "2014-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-IA6qgrB0Wgy_CnWKV371Q", "review_id": "Czvcgpg88VMAEH8Vvq-8Iw", "text": "LOVE this place. Atmosphere and food is great! For drinks, the milk tea is a must try. Wish they had a location in Scottsdale so I could go here more often. \n\nThink of a French, (though it says Italian, I got more of a \"Frenchy\" feel), and Japanese mixed into one. Thats what you get here. The place is small, yet very elegant and everything is done right.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2014-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "ThlEVnHMImzss2RhqMX6XA", "review_id": "ffEGyDgG2W49msap_ZXPsA", "text": "I really was excited to try this place. \n\nUp on arrival, we were seated in great area. The place was super nice and cozy. Also great for blind dates, etc. \n\nService was great. Fast, friendly. But, food did not work for me at all. I had fired tofu soup and Pad Tai. It did not taste bad at all, but I was up whole night sick from it. So my stomach didn't really like it that much. \n\nUnfortunately, For that reason I can't go back but I really had a nice experience.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 3, "date": "2015-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nYkl81jUQxJVFYze0q46xA", "review_id": "YwUY6DcqO5GJrkfr74W_-Q", "text": "BEWARE: this location has changed!!! I've loved many meals at Tokyo express until today. Many fond memories of delicious  calories was replaced by this unpleasant rice filled 'meal'.  Sadly, the food quality and flavor has left this location. I hope it's just this location and not the whole brand. \nThinking back, I remember many meals at T.E. Thinking, 'I'm full. why can't I stop eating this delicious food?'. This is no longer a problem. It seems that most of my meal could easily be tossed aside. On the positive note, the line to order is much shorter. And another negative, the food take just as long as when the food was awesome. Why Toyko Express, Why?", "business_id": "W8WyVVxinyRjzP8gJa7ILg", "stars": 1, "date": "2015-04-13", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "_PzSNcfrCjeBxSLXRoMmgQ", "review_id": "Cb7InrS6IWqAa2u95bCc8A", "text": "The appetizers were yummy: \nAsian Nachos - LOVED IT! \nGyoza - Good \nWonton Soup - 2 wontons and salty soup base \nI did not tried the rolls but the girls ordered a Kalifornia and Tootsie \n\nFor my entree, I got the sesame chicken with brown rice. I thought the sesame chicken was going to be salt, but it was the sweet sauce coating the fried chicken pieces. It was ok but a little tad sweeter than I like. Everyone had a fun time. I knocked them down to four stars because the service was terrible. We had to flag or get our waitress every time. She never refilled drinks or come back to check on the table. We had to get her attention and sometimes she is no where to be found.", "business_id": "c0RSs2KYK5Y-ZlSrNq9LyA", "stars": 2, "date": "2010-05-17", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "oJsnqRror1DUmi3jWgbwaA", "review_id": "_SsF22yeF6o6BzSxMw4E5g", "text": "Decent sushi, I prefer to sit up at the bar counter.  I went there for lunch the other day by myself and it was fast service but there were tons of \"regular\" types in there drinking and chatting up the staff.  It made me wonder why they were just hanging out on a week day in the middle of the afternoon...but they are lucky I guess. Oh the food: I started with miso soup and edamame (both hard to mess up), they were good. I ordered a tempura shrimp roll...it was okay, the end pieces had the parts you don't eat so there were only like four pieces.  Overall it was okay and one of the only sushi places by my office (now that I work nearby) so I'll probably be back.  I'm open to recommendations...but I've definitely been to plentyyyy of better sushi spots.  Ohhh and the parking lot is a nightmare -- whether you're trying to run into Subway or Moto this shopping center is sheer chaos during lunch especially.", "business_id": "c0RSs2KYK5Y-ZlSrNq9LyA", "stars": 2, "date": "2012-04-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bzJErDpsGdM2c11Gb16-tQ", "review_id": "-95i4xAv22FgwWLl8BE82w", "text": "You know you're in a sushi place when you walk in and it smells like a fish market... in a good way. Food was super fresh well prepared. The September roll was spicy crispy excellent. The veggie spring roll was plenty big as an appetizer, however that steamed vegetables were kind of bland. Great service too!", "business_id": "c0RSs2KYK5Y-ZlSrNq9LyA", "stars": 4, "date": "2014-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y__MQ0huPNC4qarwMD8GlQ", "review_id": "RRnLKZlwxr4qXoHfUMS0kg", "text": "GROSS! \n\nIt was like every roll that we ordered was drenched in a teriyaki sauce. The sushi was craptastic and the price sure as hell didn't reflect it. The service was okay, I was surprised at how fast they got the sushi out to us..", "business_id": "NDKkce5Au-o_OhIt5f2ZBg", "stars": 2, "date": "2008-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5aIJuQ8Ily9JWh9ZJxUzMg", "review_id": "F7QC5Xo3xlN2r_bDklN8WQ", "text": "I really liked this location. I had a large dark meat teriyaki bowl and it was very good! Both people behind the counter were very friendly!! I will def be back!", "business_id": "n7dkpRLUl7C6zLRRXk_BDg", "stars": 4, "date": "2015-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Lx2B6hJhr66uFpxMEIKV1g", "review_id": "PTsRQjEQr4yLglKjHflRdw", "text": "Delicious food, great atmosphere, and an overall good time. We came in for some sushi and drinks and we were not disappointed. Food was delicious, drinks reasonably priced, and the service was awesome. Our bartender, Rob, was attentive, not to mention funny. He was on top of everything so we were never left waiting. Great time and we will definitely be back!", "business_id": "r7Ge8_c5Y2TXthb4CSjzaA", "stars": 5, "date": "2013-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "X01EFxZ1-nNAXh5W5puMww", "review_id": "joyFEisyRn_pldQ4T09E9w", "text": "Excellent place.  I have eaten here several times and the place is always busy.  The sushi is good and you can order things that are not on the menu if you know what you want.  I have a friend who works for Intel with a lot of Asians and they frequent this place a lot, which is how I came to discover this place. \n\nThe prices are good and are much cheaper than the RA or Kona when you take into account how big the portions are.", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 5, "date": "2007-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6Q_NHOoun3f0t8xmDv1mog", "review_id": "bIU-xey9rIH4Fw8c-9ZsnQ", "text": "Always pleased.  Good portions of fish in rolls.  Unlike RA!", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 4, "date": "2012-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "hnzx7Q7IWq5EDVe0yjKK8w", "review_id": "RGKBwqYbsD3P69Sk3mwdNQ", "text": "So their tagline is Friendly Staff. Generous Portions. Quality Food and I think they really did a good job of that. \n\nStaff - everyone seemed to enjoy their jobs from wait staff to the chefs to even the owner. We sat at the sushi bar and they toasted us any any new arrivers up as a welcome to the bar acknowledgement. \n\nService - I redeemed my check-in offer with a smile...had enough attention and plates were cleared away quickly to ensure we had room for more goodness coming out.\n\nQuality Food - The rolls were unique and plentiful. Someone mentioned order light and work your way up to new rolls and that is so true. And the prices to quality and portions is surreal. I would only get half of that for more in Chicago. We had the Smokey Bear (Shrimp Tempura, Smoked Salmon, Habanero Sauce) and the Crazy Roller Coaster Roll (Tuna, Yellow Tail, and some other goodness). You didn't feel heavy after eating them. \n\nYou can pass on the edamame.. it seem undercooked and packed with table salt.\n\nLastly and most importantly, don't judge this place by the cover. It's probably more on the divey side of things or just random placements, but the food doesn't disappoint.", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 4, "date": "2014-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cygnf5iafklstpr33jks5g", "review_id": "Zq3raRaNvecuLR8pCl9kzA", "text": "Was in town for a day and really wanted some sushi, so I gave this place a go. Only positive thing I can say is it's reasonable priced. Other than that, YUCK!\n\nThe quality of the fish was very poor. Obviously once frozen and not fresh. To make matters worse they give you huge chunks of fish that really drive home how bad the quality is. Almost all of the rolls have krab meat (gross) and the rice they use is below the sushi standard. Every thing was just a mushy mess. This is also the first time I've had sushi and felt like I was in a TGI Fridays. It was a really unpleasant atmosphere. AVOID!", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 2, "date": "2015-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0im6WIvEj7MWfJSLCuZYaQ", "review_id": "uTX31RwrK3ur8TFMoisZJw", "text": "I would highly recomend ordering a sunami punch from the bar.  I really really hate sushi, but coming here for drinks is well worth it.  Most of my friends like the sushi here, but for me the drinks are top notch.", "business_id": "nBfusVbqwul0BU0Rcrlelw", "stars": 4, "date": "2011-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PfuPTOzx5u0vucw4fLllKw", "review_id": "5lkGjeLQrTER88de8mynDw", "text": "Sushi is over priced. Service was very good, ambiance was nice BUT very disappointed that there is no changing station for kids!!", "business_id": "nBfusVbqwul0BU0Rcrlelw", "stars": 3, "date": "2015-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "N646f4MjFUgMPLeyntST6A", "review_id": "KCdsRD5g4n1ozsN7YHMp-g", "text": "The firs time i and my hubby dinner yesterday night at Hongkong Gourmet,\nanything food delicious .  after we paid, waitress give discount $ 5 for the next we coming., maybe because our the first time coming.and they bring us for  2 stamp,if after 10 stamp for the 11 th stamp free. awesome.\n the waitress and any worker so nice.they can speak english and helpfull.\nwe met some people same our country,unbelieveble.\n if you like sea food or american food , or chinnese food, japanese food,go there.\nsea food not fishy. and they have sushi bar too, they have brown rice and white rice.\nprice cheaper $ 2 than pacific  seafood buffet.\n maybe next week we go there again, so far with our house (40 - 50 minute),\nbut if any food delicious, we can go.\nthey have mongolian stir fry too. \nthey have room for party.\ni think this place bigger than any buffet at arizona.\nif you vegetarian or vegan , you can eat this place ,they  helpfull what you want.\nif you have family go there every  Tuesday,because family night \none child  free per paying adult age 2- 10 every Tuesday.\ni recommend  this gourmet buffet .", "business_id": "-Ogv7rpcgUHkFaSy3vD8Sw", "stars": 5, "date": "2012-03-04", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "lTmETvJD199gop4fNEqj_A", "review_id": "QGZtxWtGxAucdD8S0tDVwA", "text": "My favorite place. They have so many options you're guaranteed to find something you like. I recommend the sweet pork ribs- so delicious! You can also make your own sushi rolls and chow mien stir fry, all included in the price of your buffet. Unlimited crab legs, and tons of savory Chinese classics. Also love the staff there, Vicky is my favorite waitress. If you become a regular, they'll welcome you by name and always remember your drink. They make it a really fun experience.", "business_id": "-Ogv7rpcgUHkFaSy3vD8Sw", "stars": 5, "date": "2015-05-28", "type": "review"}
{"votes": {"funny": 4, "useful": 3, "cool": 3}, "user_id": "uO3pavwCb8ylw-aog3Mn6w", "review_id": "2cV2BLnPBInDGZqwkR3IEg", "text": "As already mentioned by other yelpers:\n\nThe best miso ramen in Phx.\n\nVery tasty soba noodles.\n\nKatsu chicken entree is also very good.\n\nNot pricey at all for what you get, which is a significant amount of very tasty food.   \n\nDecor: \nBooth seats.  Kind of out of date.  Just like any other mom and pop restaurant that has been open since the 80s.  Picture of a Japanese Kimono on the wall.  Not \"cool\" in a \"I wear D&G sun glasses and think RA has amazing sushi\" kind of way, but cool in a \"this place has great food, who the hell cares what it looks like\" kind of way.\n\nService: \nDon't expect to be seated at a table and your drink order taken by a waiter.  We were handed two menus when we walked into the restaurant.  We took the menus and made our own way to a table to figure out what we wanted.  Once we had our mind set on what we wanted, I walked over to the cashier counter and placed our order with the owner.  Only time we interacted with the owner again was when our food and drinks were brought to our table, and when we got up and payed at the cashier counter.  So, yeah, you will not be waited on hand and foot.  But I think that aspect of the owner's personality somehow adds to the Toh Zan experience.  It's like, \"You want what? To be served? LOL. First time?\"", "business_id": "BBPkwpj9kSeDuy0uOwWHJA", "stars": 4, "date": "2010-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "KB9pCswdx3ldg6n5t25FiA", "review_id": "dPraf1peDb1LzqdRC4CbhA", "text": "Best tempura in the valley!! This place has the authentic Japanese food in the affordable price range. The food is satisfying in both quality and quantity.", "business_id": "BBPkwpj9kSeDuy0uOwWHJA", "stars": 5, "date": "2014-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l07vj59TUmjAzqWl87pjzA", "review_id": "Q7qWgnIwZAx0q4vgMsJYLw", "text": "Absolutely love this place. Ate there today and it was as good as it always is. I love the Orange Chicken over rice and the Broccoli Beef over noodles. Amazing!", "business_id": "Js7xxK2D4Dc0W8XkAzc4cg", "stars": 5, "date": "2014-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Qz_WQ6blpBBSaEwsofbB_w", "review_id": "PbpFDwAlNeBXQIYD3ZGgWA", "text": "Yum yum yum! I love this place. My favorite thing to do is share some sushi and a bowl of their rice with chicken and curry. It tastes like comfort food and is always warm & fresh.", "business_id": "6syMU43FKGkcbX2957Ga8A", "stars": 5, "date": "2011-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VG91DXastcaRO-ocJjkcPA", "review_id": "QSDeauWDxLzHU5NkMY11NA", "text": "I have had the pleasure of being served by Johnny(san) three different occasions and under varied conditions... 1. Busy, 2. quiet and 3. over the top busy where I felt like I should jump the counter and help!!!  \n\nThis is one cool calm collected Sushi Chef.  He is fantastic and full of class.  Much respect to Johnny and his staff.  I only know him through being a customer...he excels at making you feel like family.  The Sushi is very very good and great care goes into the preparation.  I love Sushi and this place has moved up the list of my closely held favorites.  I'll qualify this by saying that I travel quite a bit and I ALWAYS try the local Sushi... LA, NY, TOKYO etc...", "business_id": "rHFWPJML2WlGbad0Tqevxw", "stars": 5, "date": "2009-05-12", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 0}, "user_id": "bLU-JK1dAmSnztxWgFjWCw", "review_id": "uZ93XoGHJs7vbCEnTkGL0A", "text": "Cool music, awesome service, amazing sushi, SCARY-ASS bathroom.", "business_id": "5vgmIwBB48fwo_WC8vGiXA", "stars": 4, "date": "2012-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RGiphZjGuN36sPpThcu9dw", "review_id": "2VS-_arhmiCR3xCjT94AfQ", "text": "We showed up to this place and it just looked dirty. The service there does not exist and the restaurant was dirty. We ended up leaving because the whole experience was awful. There was a ton of food bits on other tables and grime in between the grill and the table. The price was high and it did not seem worth it.", "business_id": "5vgmIwBB48fwo_WC8vGiXA", "stars": 1, "date": "2015-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "j2Zx2PYK7TdxtEPlvRmD1w", "review_id": "Ah0yvwAabOFdiwvWMrDibg", "text": "For my first visit here, I'm only giving this place 3 stars. This is a small little sushi place, so not really a place for large groups, but great for small intimate groups. My only concern, either way, is that it's not very private in the conversation department. It's that small....A little background music would have made this perfect--but this place did not deliver.\n\nService was ok, i suppose. Our orders were simple, and we had water to drink, so not much to do--plus there were only two of us. The only saving grace was this: i wasn't so hungry i was about to gnaw my arm off (it took forever to get our food and we ordered 2 *simple* rolls a piece) and that i had great company filled with entertaining conversation. If those two things not had been factors in this dinner equation, this could have been much worse.\n\nI will say, however, the sushi was pretty good. Fresh fish, unique combinations, and it kept well for take out. I had to bring dinner home for someone and got the thumbs up from them. Seeing as how it was over an hour before i showed up with it after they brought it to me, that's a good sign, lol.\n\nI will definitely go back if given the chance, but it's not a place that is high on my radar. If the atmosphere was better i might feel differently.", "business_id": "un3KC2gyMrSG6yqjVRctXg", "stars": 3, "date": "2011-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p9H7tt-Cxi2cr4vne8QyhQ", "review_id": "fqfuMwC5kUGO55ZoQfRPKQ", "text": "Love this place!  Some of the best sushi I've ever had.  Two words to describe everything: fresh and delicious!  Good service even when crowded, food may take a little while bit well worth the wait.!", "business_id": "un3KC2gyMrSG6yqjVRctXg", "stars": 5, "date": "2013-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "mNRNO1LliIUqeYHh6hc7QQ", "review_id": "yNo1U-j05EatY8o6e6GvIg", "text": "The sushi was great (one of the better sushi restaurants in Chandler), but the service was SLOW and the servers were RUDE. \n\nMy friend and I placed our order and after about 45 minutes, it arrived. The portions were small, we decided we would order another couple items. We tried for 30 minutes to get the attention of the waitstaff (and considering this place seats maybe 30-40, it shouldn't have been hard...), but they blatantly ignored us and walked by our table at least 4 times, avoiding eye contact and seemingly deaf. \n\nThis would have easily rated 5 stars, but the service made the experience almost painful...Will never return.", "business_id": "un3KC2gyMrSG6yqjVRctXg", "stars": 2, "date": "2014-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dik8vtcYMEIHHMHsNbDYpg", "review_id": "YcsWqcUxBFmr24xTrNtgTw", "text": "Not the best sushi I've ever had (I prefer Bei or Akai Hana) but it does the job... And they have some good lunch specials and service was excellent.", "business_id": "un3KC2gyMrSG6yqjVRctXg", "stars": 4, "date": "2015-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YgwcFYrSBcZRwzIE10gm3g", "review_id": "0xBQthz2QEuOxa0-SyOVOA", "text": "Mr. Foo was the rare gem of this place and although I don't know what happened, as an owner I would of reevaluated his worth. As for the food changing I honestly think that's just a placebo. The food has always been delicious pretty much no matter what you get. The new owners are nice but they will never make you feel as warm and appreciated at that impossibly always happy old man did.", "business_id": "l1kqHWtICTNk8TdCNisf5A", "stars": 5, "date": "2015-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "M9HEoGLUVVt88apG1u76fQ", "review_id": "MlpE5pXLiarZjGzhlRvjow", "text": "We moved here from southern Cal and have always liked the smaller, more intimate sushi bars we found there. The last two years have taken us all over the valley trying various sushi bars and find ourselves returning to Temari for above average sushi and rolls in a smaller, more personalized atmosphere. The service is above average and we have yet to be disappointed in the quality of the food. Danny and Sake are talented and knowledgeable sushi chefs and the prices are definitely below what you would expect to pay for the quality of food served here. \n\nWhile I enjoy sashimi and sushi, my wife loves the Sumo roll and also has a new favorite that Danny makes special for her called the MB roll. \n\nDo yourself a favor and stop in if you are in the area. Don't let the location or exterior appearance fool you, this is an above average, regardless if where you are from, sushi restaurant.", "business_id": "Er20nsiOS6TFHmAE717iTA", "stars": 5, "date": "2011-04-23", "type": "review"}
