{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "TckShYnQa0eD3WQxdoE3GQ", "review_id": "8_DeGxmC5c3jKrfY0ZFovA", "text": "There is nothing really to complain about here.  This Mortons is like most in other cities.  It's definitely for the expense account crowd.  It's fun to go to a place and to know exactly what you are in for.  I've been to Mortons all over the country and this one stacks up pretty well.  It's like most other high end chain steakhouses (Palm, Ruth's, Capital Grille, etc.).  The bar is pretty lame, but I'm guessing most go here for a sit down dinner.  Capital Grille or Hyde Park bar is much better for bar scene.  But, one thing I definitely appreciate about the bar is  the bar menu.  If you've never been to Mortons and you are watching your budget go to the bar have a cold beer and order the PRIME cheeseburger trio or the Filet sandwiches for only 6 DOLLARS.  Plus, the fries are awesome.  The dining room is really nice with dark wood and lots of leather.  The service is awesome because I'm guessing you have to be pretty good to land a server position that might end up paying you 6 figures.  The food is great.  However, my opinion is that most true high end steakhouses all have similiar quality steak.  I eat here a few times a year and my favorite first courses are the lobster bisque (Very good, but not as good as capital grille) and the tuna tartare.  Stay away from the filet.  I mean it's tender and delicious, but try a steak with a little flavor.  I'm guessing if you're like me you don't go to Mortons often, so try something that  is hard to get elsewhere.  Get the Cajun ribeye.  I can't remember if Pittsburgh location does a bone in ribeye, but if they do I would say a cajun bone in ribeye will be one of the best if not the best steaks you ever try.  I also suggest getting the \"lazy\" lobster.  There are few things in life more indulgent or enjoyable than having a two pound lobster cooked perfectly already cracked for you.  It's pure indulgence.  The asparagus is great and as big as a baseball bat.  The spinach is great and the hash browns are a must have.  You should definitely save room for desert and there is no better desert here than the chocolate souffle'.  Remember to tell them that is what you want for desert when you order your entrees.  I wish the bar was better, because if it was I'd go here more often.  This place is exactly what you would expect.  And, that's a good thing.", "business_id": "90Fqfzd8zD9AuuNBSv9lAg", "stars": 4, "date": "2008-04-13", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "aFyLy78gsMTFxk2y7RTlUw", "review_id": "mFjFiS-apnse0WyQnlQPUw", "text": "Hostess: 1.0\nBartender/ waiter: 2\nFood: 3\nProperty: style decor ambiance: 2\n\nWhen did they start storing their stuffed olives in Styrofoam cups?", "business_id": "0FgwBx7pgmNdUtsd_T8UYQ", "stars": 2, "date": "2014-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "7xH9Qey07WJYq5E1sFxo_g", "review_id": "EALUgBXcXz5gSQAfvxrA7g", "text": "I haven't been here for several years.  Prior to that, I'd eat there about four times a year.  I guess I was worried about what the new management would do to a Pittsburgh tradition.  \n\nMy fears were relatively unfounded.  Tessaro's is still  the same warm, local and friendly place it's been for decades.  The new ownership retained everything that mattered -- and a few things that are problematic.\n\nI need to say that I'm a steak fan.  Good steak.  So I'm always just a BIT disappointed because the steaks at Tessaro's have too much gristle.  My friends, however, always order the burgers and they swear by them.  \n\nWhat continues to disappoint me are the little things.  The bread is NEVER fresh.  It always feels and tastes a few days old.  The salads also taste packaged.  The vegetable side dishes are limp.  I once commented about this to my server at Tessaro's.  Her reply?  \"Oh, honey, this is a bar-and-grill, not a fine dinin' establishment!\"  I laughed and had to agree.\n\nSo go for the burgers.  Get the potato sides.  Have a good cold beer to go with it and you won't be disappointed.  \n\nI see others say that the tables are too tightly packed and you overhear others' conversations.  That's one of the features of a place like this.  It's like one big family meal where you're always meeting new family members.  \n\nOne rule I've come to live by, though:  \"Never order fish/seafood in a steak place and never order steak in a fish/seafood restaurant.\"  That applies to Tessaro's too.  My wife has NEVER had a decent fish entree at Tessaro's.  Not a slam, but an acknowledgment that you can't be everything to everybody.  \n\nA nod of thanks to the \"new\" ownership for keeping the place comfortable and friendly.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 3, "date": "2010-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ihC1T8TkW3QTVAUmkz5odw", "review_id": "kywZLwjNx6yvwB_g3RoZ-w", "text": "Been going here for over 20 years, Bacon blue, dry blue and full dressed.  Hands down. If you know your meats, you will understand this place", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 5, "date": "2014-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "feu2yFY92DfVdWCCxq9d0g", "review_id": "Uz_AA0Lffp6tSMEwDHcGrA", "text": "Dinner last night at bar. Actually a great steak with super service. Enjoyed. Wasn't too crowded and surprisingly quiet. Recommended.", "business_id": "AUDuCSWYzzRP3H2w7TxtuQ", "stars": 4, "date": "2013-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YuiJdaZj9GtIiBpjMtiSgA", "review_id": "hLFWYCkifAGWqLCyd-VCDg", "text": "Still the best steakhouse in Charlotte. \n\nGreat service, great food, great ambiance. There are other good steakhouses in the area but with the closest competition (Mcintosh) closed, this is the best in Charlotte.\n\nI have never had a bad meal here. It is consistently excellent. The strip, filet , lobster, etc. -all good.", "business_id": "Lt9o2RmacVY2L-IWLA8uTg", "stars": 5, "date": "2015-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E4-lxS36_PSzy17b4a-Hkg", "review_id": "IzIA2xa3gFDYM7dasHUB_w", "text": "Yes please restaurant week for giving me the reason to put on my fancy shoes and valet my late model ride at Capital grille uptown. We had a large group so we grabbed a drink at the bar while we waited on our party to arrive. We ended up enjoying dinner in their private dining room- hello fabulous service and an exclusive feel. This may have not been the best steak I ever had but some of my friends were kind enough to share and their entrees were stand outs. Salads and soups were just so-so but they do their meat right. Dessert was also amazing. Several months later I still remember the service and experience here. Highly recommend if you are rolling in the dough or looking for a special evening.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2013-04-28", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "nFnMOEJPy98wdEKAVzFs3w", "review_id": "igdakVgMsmdiBGp1S-togw", "text": "Old school steak house feel but a good spot to hit if you son't want to head downtown for some real grubbing!", "business_id": "OigTHfCur-D8Ne-bV1ngOg", "stars": 4, "date": "2013-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "deawd7Iic_07CsYoBfzA2A", "review_id": "KggsVV7UhNRWZgz9FXw4MA", "text": "Today the office staff had a going away luncheon for a employee; I choose the fried calamari as a starter and the entrée Nova Lobster Salad  with an Arnold Palmer.\n\nThe calamari was a minute over cooked but great flavor and love the fried lemon slices, I shared with co-workers - NONE WAS LEFT.\n\nWhen my salad was served my co-workers was in awesome, and said, we did see that on the menu, lol. it was great and plenty of lobster throughout. \n\nThe Arnold Palmer was ok, but not sweet enough, it was off maybe to much lemonade.\n\nI had the flourless chocolate cake to-go, left it at work for tomorrow, will let you know how it was.  All-in-All loved the spot and walking through the area.", "business_id": "1gKBusJMk66ypwEKF0vOAA", "stars": 4, "date": "2015-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hf6EBefeMPypTQhj41JhMQ", "review_id": "HXA3v0WIxwIN98B0l4Kv4w", "text": "Good food ,Great service!   Great service from the moment we entered until we left. The server was pleasant very attentive. Our order was exactly as we ordered and we all enjoyed steaks, salads and side dishes. We will return when we go to Charlotte!", "business_id": "i3HfmM-evIOLpJ2wuTZVKA", "stars": 5, "date": "2013-05-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "3bwkqJP_3ewSCRGOZ73UPw", "review_id": "W5SB7NlcOJZmS969htZiHA", "text": "This place is a waste of time. Had enough of the crappy customer service, food and management to ever come back again. If only Sweetwater could takeover their location.", "business_id": "Zc2IwSzGY63zkyhfNrr7HA", "stars": 1, "date": "2015-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KfsxMnCYEhDyBSxGfMP1iQ", "review_id": "UPGRkhR8_gqQOC-5TYKDgA", "text": "My wife and ate there tonight. Food so so. Service not good. Efficent but not friendly. I had the feeling she wanted to be somewhere else", "business_id": "68JsiWNLKs8NDCrBCxIWMA", "stars": 1, "date": "2014-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HAej022BsQHMXSrvSLuTWw", "review_id": "AatLeDhYJPAJ7aJMRtwx3g", "text": "Great concept - pick your own, cook your own steak.  Unlimited salad bar, baked potatoes, bread.  Steaks are huge......\n\nSure, the decor is circa 1984, and could use a little updating, but the food is good, and it's a fun place.", "business_id": "562AuYjOuZwtTbS1UYhY6Q", "stars": 4, "date": "2011-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OHy8hC5ZKD8VrUk2M_IGKA", "review_id": "80edtpKBMYF9hxgVp-417w", "text": "Applebees is a decent place to get a hot meal. They've been remodeling a lot of their locations it seems, and this one has a nice feel to it. I think overall they have fair prices and a good selection. I wish they wouldn't have changed their menu so much. They took away my all time favorite dessert, the maple butter blondie. Sad day. But they've added some good stuff (shrimp and parmesan steak is not bad at all!) Applebees is a good deal, nice staff, okay design, nothing extraordinary, but does the job. I'll be back.", "business_id": "cjUmPLRT43wN9Z87A9BOpg", "stars": 3, "date": "2013-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WHuUVyxbRAhRS0YbgYKGAw", "review_id": "TpWGs2-Asl6uasXT2T9ZHg", "text": "We  had read some very positive reviews about this place in Yahoo Travel.  What a great place to visit!  The chicken fried steak was huge and delicious! Outrageous portions!  A perfect place to hit after a day of Spring Training baseball.", "business_id": "18TUn9oiW0k0yB6lheiOvw", "stars": 5, "date": "2009-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "COb5dq83Y59W7ySBCm4AZg", "review_id": "h1yGXbbs6e98QNlqBcIDtQ", "text": "Went back recently, and it was just as good, if not better than I remembered.  I was too long in Las Vegas.  Price, portions and service are all excellent.  I just wish I lived closer.", "business_id": "18TUn9oiW0k0yB6lheiOvw", "stars": 5, "date": "2012-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "n0M0KZlYM5FwB4j8_nFAlA", "review_id": "Gap7Rs7054qzAZhBpGZeDQ", "text": "After reading all the reviews on this page I made the decision to have dinner here on Saturday with my husband. We were both very excited, my husband loves chicken fried steak and although money is a little tight we wanted to splurge a little for date night. It was busy but we got seated right away and knew within minutes what we wanted to order. We started off with a bowl of chili to share. The chili was very good, with lots of meat and had great flavor. The side salad that accompanied was fine too. Our server was very friendly and attentive. Now on to the main course, and this is where I have to say we were very disappointed. My husband had the chicken fried steak, and yes it was definitely huge, however there was no flavor to it whatsoever. Even the gravy tasted of flour and not much else. A little seasoning (salt & pepper) would have gone a long way. I had the grilled pork chops and mashed potatoes. The pork chops were a little dry, and again under-seasoned, the mashed potatoes were ok, but I could see what my husband was talking about on the gravy. We so wanted this to be a great experience for us but the food just missed the mark. My husband did want to tell the server about it, but I'm always too self-conscious about making a complaint that I begged him to let it go.", "business_id": "18TUn9oiW0k0yB6lheiOvw", "stars": 2, "date": "2014-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-MN1Mwt-y8uv_1ynClIimw", "review_id": "0eaOo0GM2REVrrwmM9Z4BQ", "text": "Wow. I'm tempted to hide in the booth and spend the night so I can wake up and eat another chicken fried steak for breakfast . Nancy took great care of me and kept my ice tea filled even with my post airplane ride thirst. The chicken fried steak was incredible. Very good mashed potatoes though I didn't eat much of them as I was trying to get all that chicken fried goodness down. I will make this place a regular stop when business brings me to Phoenix!", "business_id": "18TUn9oiW0k0yB6lheiOvw", "stars": 5, "date": "2015-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Q6FaSZpCtVv7PXECwDL1bg", "review_id": "MxGHXfgKInumljtxVgCOaw", "text": "I ordered the $12.99 special that came with bleu cheese topped sirloin (the best medium rare I have had in years!), a house salad and cheesecake for dessert. Great service. No complaints!", "business_id": "gQjTs4BDNYSu9oJhkEsssw", "stars": 5, "date": "2013-04-24", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 0}, "user_id": "Ofxlhi_HKp7myFDpwg9aIA", "review_id": "Zch3_tilPVyJXWbwUyV1JQ", "text": "In all seriousness, I have heard good things about this place from several people, I kind of walked in and was trying to think what the hell was the theme here, seriously if PETA ever went in here they would close this place down, with stuffed animals on the walls they would have a field day. I would say from start to finish I was thoroughly not impressed. I will honestly say that I will probably never go back to this location. It wasn't even that the food was just blah, but the fact that the staff seemed to ignore me, maybe I was under dressed for this establishment. I guess my money truly is no good here, because I honestly did not feel the staff gave two fucks about me the whole time I was there. Garbage. I grabbed a card on the way out from I believe was the hostess. Torri McFarland...you and your staff from the top down got work to do this place sucks!!!", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 1, "date": "2009-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "3gIfcQq5KxAegwCPXc83cQ", "review_id": "mxKaX6QHpJQFaNnuNEN_UA", "text": "Ok, I am totally breaking some of my general Yelp rules here...but I have to, because this place was so good. I generally don't give 5 stars on a first visit and I also don't generally give 5 stars to a chain restaurant, but this place really blew me away. The BF and I went here last night for Restaurant Week. We had actually just gotten our reservation because we had a res somewhere else but then had to be out til after the other place closed....lucky I guess. So anyway, we get there and there is complimentary valet (which I generally find annoying, but was nice last night because we were running late). We came into the restaurant and immediately felt welcome, everyone was very friendly. We were seated right away and our waitress, Sarah, came by to explain the menu. She was super friendly and helpful and really on top of things, so that was nice. \n\n\nOk, the food: After being seated, they bring out an assortment of warm breads with softened butter. And I mean a real assortment: cracker type bread, a roll that looks like an everything bagel, delicious onion bread, and a wheat bread with raisins or some kind of fruit in it....each bread was delicious (take that Atkins!). The BF ordered a Manhattan ($11.50) and said it was 'damn good' and he is a regular Manhattan drinker, so I gotta believe it. So start, I had the french onion soup (on Sarah's recommendation) and the BF had the field greens. The soup was SO good. I generally am not a huge fan of french onion soup because it has a weird texture, but this one was full of flavor and had a ton of cheese on it. I literally was peeling cheese off the side of the bowl and eating it (I know, not so cool in a fancy restaurant...but it was so tasty!). The field green salad was light, with a flavorful, but subtle vinaigrette. It had several types of tomatoes on it, which the BF loved. For mains I had the filet mignon and the BF had the kona sirloin. They came with a little share plate of mashed potatoes and green beans. The sirloin was delicious...it had this amazing sauce on it (don't know what it was, but it has some great caramelized onions in it) and was cooked perfectly. The filet was equally good, it was simple, but cooked to perfection, it was melt in your mouth and had the perfect steak texture (no fat, gristle, anything weird feeling). I will say, the filet was even better with a little of the sauce from the sirloin, but I understand why the serve it the way they do (steak purists and all....). The mashed potatoes were divine. They were some of the most creamy, buttery mashed potatoes I have had. I wanted to lick the plate. The green beans were also delicious, very well seasoned and served with onions....yum! Now on to dessert- We shared the creme brulee and the chocolate espresso cake. Both were amazing.... When I had my first bite of the chocolate cake it was like the most intense chocolate explosion in my mouth. The espresso just adds to the intensity. I will say this, this is a dessert to be shared...it truly is too chocolatey (and large) for one person....and I love chocolate. The creme brulee was equally amazing, it was creamy with just a hint of crunch, but the most impressive part (to me anyway) was it had blackberries on it that had no seeds. What?!?! Where do I get these blackberries? They were phenomenal! \n\nAt the end of the meal, Sarah went outside and had the valet bring our car around before we even left so we didn't have to wait....ummm, seriously awesome service. \n\nSo, overall, the meal was excellent. I probably ate about 3000 calories....sorry thighs....but if I got to choose a place to destroy my diet, this would be it. The restaurant week deal was amazing too because my steak alone was 41$, but the whole meal was 30$ on special. Insanity. I would definitely come back again.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 5, "date": "2012-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6GvAMZL4XyPWYjyJDc3J0A", "review_id": "-BeIAvVuG8pKZGll69lbVw", "text": "Fantastic  dinner. Highly recommended  if you are in the area the service was fantastic. Waiter was highly  imformative about the menu", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 5, "date": "2015-03-26", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "90a6z--_CUrl84aCzZyPsg", "review_id": "ipOzD_-dms1IZDJgO0glxw", "text": "One of the best steak restaurants in the city. I have consistently been treated to top shelf food and service here. I prefer the Indian Bend location, though the Camelback spot is convenient for business dinners.\n\nSorry to hear about Sarah's misadventure, I have not yet tried their seafood -- Ruth's Chris is all about premium aged steaks to me.", "business_id": "iDoigI3605ixHl_qHly3Tg", "stars": 5, "date": "2008-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Oc2Kl53ls_nwezSzUZ0MEg", "review_id": "uA9keTODthR4xx7C9E9e9A", "text": "Stopped in for lunch, waited over 45 minutes from order time to entree delivery, Manager indicated he thought performance was unacceptable and offered a step ped up beverage ( what can you do to iced tea?) or a free dessert, We declined dessert at lunchtime and really just wanted to receive our order in a reasonable amount of time. Manager's apology and offer felt scripted, except he said \" no worries\" about 10 times. When the entree's arrived my guest's side item was missing.  It couldn't have been much worse and no genuine attempt at service recovery occurred. No rules, just wrong...", "business_id": "4mZ__NR8jLD1k0rYpSbplA", "stars": 1, "date": "2014-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 4}, "user_id": "4sIK_74UwkKU9YQXIfgCdg", "review_id": "6k10WTLws4YhK9h3evIJkQ", "text": "\"Fine dining\" is not just a setting.  it isn't just good food.  It is many things that add up to an attitude. I have had the opportunity to find it in different cities. I found it the other night at the Stockyards.\n\nWe were seated by a host who took us to our table and when we were properly seated gave us menus.  Our server came to the table and introduced herself and said she would return shortly.  It was nice to have a moment to chat before we had to think about ordering.  When she did return,  our glasses were filled-not something we should have  to wait for her to do when the service is right.  She knew the selections on the menu and all available options and could make sensible comments concerning them.  Our salads were served promptly by two additional people and were as fresh as I could ask for.  When my friend was finished with hers they asked if they could take her plate.  I was pleased when they didn't ask me if I was finished with my salad and could they take my plate.  If I'd been finished I could have told them.  We were able to continue our conversation uninterrupted as I finished my salad.  The salad plate was removed  when it was appropriate and we had a few minutes before the entrees were served.  All was in keeping with a relaxed dining.  At no time did I have to think about having drinks refilled, it just happened quietly.\n\nAfter a few minutes our dinners were served by the two gentlemen and our server appeared to make sure they were to our satisfaction before we started.  There was no room for error there that couldn't be resolved before we started.  \n\nMy friend had ordered a small steak. My friend is  quite elderly and Kathy, our server, discretely asked her if she'd like it cut for her.  A potato also was served with her dish.  I asked my friend which of the condiments she would like it prepared with.  She look at me and said \"Prepared with?\" She didn't understand what I was getting at but Kathy did and was already reaching for the potato.   She opened the potato and smiled while my friend said a bit of everything.  One doesn't go to a restaurant like the stockyards to have to deal with opening a hot potato and preparing it.   When serving is done properly, these things don't have to be discussed.  Kudos to, Kathy!!!.  That is part of the fine dining experience.\n\nI had a full rack of ribs which were so tender the meat fell of them.  The sauce had spice to it but not so strong the flavor of the meat was concealed.  I also can tell you that unless you are a big eater, half a rack would fill most people.  My friend said, \"Yummy!\"  and I agreed.  I am used to getting a finger bowl for clean up after eating, but I can't complain about the two extra napkins and several ways of cleaning my fingers that accompanied my ribs.  \n\nMy friend let them know we were celebrating the 17th anniversary of my 39th birthday so they served me a free desert.  I can assure you the pecan pie is a delight!  Warm and laced with brandy, it was perfect way to finish our dinner.\n\nThe stockyards, I might mention, is not inexpensive, but what an enjoyable way to spend your money. They do offer two dinner specials you won't find at most other places.  They do have a luncheon menu that has lower prices.   Don't expect chrome and music that is a bit to loud as many of the new places offer.  Instead, just enjoy a time and place where they pamper you as you should be when you go to the Stockyards.\n\nI don't consider the stockyards to be a place you where shorts and Nike's, but of course there are always a few.  I would say a nice shirt and slacks at least.", "business_id": "7U8TYNW4Mvx6m3zexsO0sg", "stars": 5, "date": "2009-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "II9J8Gwlap_uwxpY74duQQ", "review_id": "s3vZNjH6JzfHue2kGUxsDA", "text": "My wife and I were celebrating our 13 wedding Anniversary here.  We were greeted with a Smile and a Happy Anniversary Mr. and Misses Kelly.  Your Table is ready, right this way please.  After being seated we were immediately visited by one of the servers and our Drink order was taken.  After looking at the Menu for a few minutes our waitress cam over and asked if there were any questions.  Asked and answered.\n\nWe ordered our meals I had the  Prime Rib with a baked potato and a vegetable. along with a salad.  All I can say is that from the salad to the desert this was a GREAT MEAL!!!  The Prime Rib was cooked PERFECTLY the best Prime Rib in AZ. to this point and I have eaten a lot of Prime Rib over the last 13 years.  My Wife had the same meal except she ordered the Rib Eye.  I had the privilege of tasting the Rib Eye and it was great to say the least.  I feel my wife and I  will become regulars at the Stockyards Restaurant.\n\nOur Dinner came to approximately $140.00 and I left a $50.00 tip.\n\nThank You Stockyards Restaurant.", "business_id": "7U8TYNW4Mvx6m3zexsO0sg", "stars": 5, "date": "2013-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IM9RsR5oHd854Ov6GlERyg", "review_id": "J-LDrVuTCcgdY0xzDItDAg", "text": "Happy to say the Stockyards remains the best steak restaurant in the Valley.  Fish options are also good and one of our party enjoyed the chicken.  We appreciated their flexibility in changing out side dishes so we could try things.  Also fun choices in salads.  I love the Green Goddess, but the wedge looked good too.\n\nThe Stockyards holds its place in Arizona history and does a good job introducing new comers to the time when we were all about cattle and cotton.  The bar(saloon) has been beautifully kept, fun to see whether you drink or not.  Go if you have not been.  Take your friends who don't know  about it.", "business_id": "7U8TYNW4Mvx6m3zexsO0sg", "stars": 4, "date": "2015-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tdcvegYNnsM6aC7nbWpeZQ", "review_id": "QYvOVMNUVD88sqYlkZ2oyA", "text": "Worst service I've ever had. Waited 60 mins for a table even though many tables sat vacant.  Even if they were waiting for a reservation, there was plenty of time to feed us before the reserved group showed up.   In the meantime, the  waitress we had at the bar had a melt down  after dropping  a tray of drinks--as a result, she never came back to the table. Only after threatening to leave were we given drinks and shown to a table. The steak was so tough you couldnt cut it with a fork, the Salmon was extremely fishy, and everything else was average and nothing special...band avg as well. Wasted three hours of my life I'll never get back.  Additionally, get ready for parents who love to use this place as a day care service...screaming kids running around unsupervised everywhere.   Seriously? Why do so many people come here?", "business_id": "wZwZcte4lcbu51NOzCjWbQ", "stars": 1, "date": "2010-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "uYecHRyGu6zbLP5NRnNFyA", "review_id": "UH6NAyPHwyt3wJWlYaJQ3Q", "text": "Growing up in Tempe, I've been to the Rooste a few times. Overall, the experience is good but nothing to write home about.\n\nOne of my recent visits was on New Year's Eve. I made a reservation ahead of time and the process was perfect. They said upon arrival, if there is a wait for tables we will be bumped to the top of the list. When we arrived, the hosting staff said it was going to be a 30 minute wait. I was a little confused but no point in causing a fuss because we didn't have a strict time schedule for the evening. We walked over to the outside patio to check on the view. Within 5 minutes our buzzer went off and we were seated. Our server was fantastic and friendly. The food was delicious with LARGE portions. And surprisingly not as expensive as i thought it would be.\n\nMy next visit was about a week ago on a Saturday night. We forgot to make a reservation so when we arrived we found out it was going to be an hour wait. We waited maybe 30 minutes before we were seated. Our server, however, was not as wonderful as our visit before. It took 20 minutes to get waters and she kept blaming the bus boys for everything. The food this time was OK. My dad's prime rib came out cold, like it was straight from the fridge. All the side dishes were cold or overcooked. It was a less than stellar experience this time around. If I hadn't been here before, I certainly would not return.\n\nIf you want to give it a shot, I'd say go for it but don't expect the best meal you've ever had. The view and atmosphere is what makes the restaurant.", "business_id": "wZwZcte4lcbu51NOzCjWbQ", "stars": 3, "date": "2012-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "MuwAEtuXNcbwoA3FlG-QIg", "review_id": "kxYP5Z_L2tv8okM7EhI90A", "text": "It is highly recommended by my colleague down here.  The atmosphere is great, cowboy themed restaurant and this is a great band playing.  We are seating by the windows and you can see a great view of Phoenix.  I ordered a T-bone steak but I have to say the the steak is good except it is not hot enough.  It will be much better if they can heat up the plate a little bit before they served the steak.", "business_id": "wZwZcte4lcbu51NOzCjWbQ", "stars": 3, "date": "2013-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "IlncelYv3U1TucLVboS1SQ", "review_id": "9-Ag7vY6rvyZg1iHp0019Q", "text": "Food was not great at all. Have been here on 2 occasions and was not impressed with the ribs (beef and pork), bbq chicken, or steak. The beef ribs did not have much meat, pork were very salty, steak was a bit tough and chicken was just okay (nothing special). The cotton candy is fun, and the scenery is beautiful, but that is as good as it gets. Have not tried anything else on the menu, but would go again, as there may be something on the menu with flavor. Kids will enjoy the slide and atmosphere, and the live music is nice.", "business_id": "wZwZcte4lcbu51NOzCjWbQ", "stars": 3, "date": "2014-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "R9MCblrFKWFjy4ky3sg_WA", "review_id": "e-2PPm2lgMdo6e5D4-vtBw", "text": "I make sure that I stop here every year when I head to the Phoenix area for spring training. It is situated atop a hill with great views. The long horn bull at the front door is neat for having photos taken with. My favorite part of entering is the option to go down a slide from the reception area into the restaurant. \n\nThe service is great, family style serving platform. It's not a formal place, more a place that you can be comfortable (being from the Midwest). They had live music which was nice. \n\nThe food is good, service is great, a place you absolutely need to check out.", "business_id": "wZwZcte4lcbu51NOzCjWbQ", "stars": 5, "date": "2015-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_H3HZ_x_1dK3APAzm3rPrw", "review_id": "76GktEVEP28JSKkMYl4WTQ", "text": "The Rustler's Rooste was recommended by the concierge at our resort. I like anything western or the western atmosphere restaurants, so we decided to go check it out. From the moment we walked in through the entrance door it was like going on a Disney ride. Even though the place was packed the hostess sat us right away by a window with a view. The hostess took us to our table, on the way there you can either go the the stairs or go down the slide, of course my 30 year old daughter and I chose the slide while my husband took the stairs and took pictures of us having good old time and laughing hard as we slid down.  After we sat down the waiter greeted us and took our drink order, a minute later someone brought us a big bowl of salad, basket of biscuits and fried bread to share. I ordered the pork chops, every bite I took I was in Ecstasy!  My hubby and daughter ordered the Filets and they enjoyed it too. My hubby said he can cut it with a fork it was so tender. After dinner they bring you a bucket with cotton candy in it to share. Did I mention they have a country band playing while you're enjoying your dinner and looking at the beautiful view! We had an awesome time and if we travel to Phoenix again you bet your a$$ we'll be going there again.", "business_id": "wZwZcte4lcbu51NOzCjWbQ", "stars": 5, "date": "2015-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dRlFpr-r1ebF1FGp4jGriw", "review_id": "XWv_3J_6iV5b5CQMtwCpxg", "text": "We have visited this location many, many times.  We love it.  It's the best steaks ever.  The management sure seems to pick the best wait staff too because they certainly make your dining experience a pleasant one.  We LOVE this place.", "business_id": "Mm8x_jzeLrWlvDEnqhuCBQ", "stars": 5, "date": "2013-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E8OdPGNMMWtEx032vXDLTg", "review_id": "21X9VDzT4vwxNGs5eqs-5A", "text": "Texas Roadhouse is one of my favorite places for a great rib-eye steak. They are friendly and i like how they treat veterans. They are usually pretty crowded so make sure you plan to be there a while. Sometimes longer than it takes you to eat your meal. And we actually got our meals in good timing. It's a good place to go for a family dinner.", "business_id": "Mm8x_jzeLrWlvDEnqhuCBQ", "stars": 4, "date": "2015-05-03", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "NAohdbmsThewbeUkMMBohg", "review_id": "ilWCn1pcTEzuA93jnXUYkw", "text": "The food is absolutely five stars. However they have raised the price and taken away the salad, you now pay an extra $3 for a salad with the prime rib. Rarely do you find a place where a salad doesn't come with a steak and it makes it really expensive. The food however is always excellent. Prime rib, garlic mashed potatoes, creamy garlic dressing, croissants, and spinach dip are all amazing, some of the best ever! Service is always superb and your drinks are always full.", "business_id": "Rus-ewyqLj2D1RlqK-je4w", "stars": 4, "date": "2011-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FsuumOKr-FsPxiAjnmqPVA", "review_id": "Rn97kmSBBA_uaKvsWSSeIA", "text": "Excellent service. Food is fresh and very tasty. Bread pudding is amazing. Only complaint is that they do not have certain desserts or menu items all the time. Love the pineapple upside down cake and the Hawaiian steak, but those items aren't always available.", "business_id": "Rus-ewyqLj2D1RlqK-je4w", "stars": 5, "date": "2015-03-14", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "rAC7fo1bPMEy-HjsHf9H-w", "review_id": "9ovenSoWfJoeVJBYG6VVag", "text": "I'm not a black angus fan but my girlfriend is so i tag along,\nHere are a few of my observations:\nPro's\nGirls at the front desk were great and efficient\nThe waiter was helpful and courteous\nGood ceasar salad\n\nCons\nPrice...  7.25 for a margarita and 11.00 for a 6 shrimp cocktail ??\nBurger and fries 13.00?\nMy girlfriends filet was small\n\nIn the end...there are better values out there for sure. I dropped 60.00 on dinner and had a burger , fries and water. 13.00\nMy girls dinner was 47.00 !\nJust imagine if i ordered an appetizer and had a drink as well !  80.00 + No thanks!", "business_id": "OreqUicD2AP5QW2HblqRoQ", "stars": 2, "date": "2014-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ixgYqRHucl21_3-qtPcVoA", "review_id": "Dup9qyH9wysPs76apVMZ1Q", "text": "Outback is Outback. I like the pork medallions here but don't get there too late or else they run out. The wait staff here is quite nice. \n\n*serves coke products", "business_id": "r6zT-YqmOtHg8BJT3LLzfg", "stars": 3, "date": "2012-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "H4HyYjNt9Vcu-a4ZMugdeA", "review_id": "qsbwQBJwj688roPGo5tHdQ", "text": "The food is just ok... A little over priced compared to what you get. WIll choose a better steakhouse, at the same price point, before coming here again... very disappointed in quality, portion size, and price point.", "business_id": "OjNTZTZ6HYQghJN-3jmwnA", "stars": 2, "date": "2013-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BU070HYdGHGKYzxMU3FJ7g", "review_id": "g3klaU8vl7fCtV4eCo8KUA", "text": "My co-workers and I have tried going here for happy hour drinks/food twice. The restaurant is great. Don't get me wrong but, I don't think they know how to deal with a large party. I've even called ahead and all they say is well we can't accommodate you until you've arrived and then they run around like a chicken with their head cut off for 10 minutes pushing together 2 tables. Pretty good prices overall though.", "business_id": "xMK01ZbVUYLLoyqoeWAIVw", "stars": 3, "date": "2011-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l2zoX2M4OBuAE_q2A5qW8A", "review_id": "RXvi1knMDeOSxUrhVRkBUA", "text": "As you know from reading my other reviews. Im a picky mofo. And not much of a meat eater. But I do like prime rib. So when I saw this was the specialty I rushed right over. It was great. Cooked perfect. Loved the twice baked pot. Server was sweet and recommended a nice wine. Bread very fresh. Manager even checked on us. I always appreciate that. A really great experience.", "business_id": "xMK01ZbVUYLLoyqoeWAIVw", "stars": 5, "date": "2014-03-29", "type": "review"}
{"votes": {"funny": 1, "useful": 8, "cool": 9}, "user_id": "8qoEnuFvMAQWv7qmhKyulw", "review_id": "W0j8gjQ8bzvXQHm16fLyBw", "text": "I have to say that I fought going here tonight for dinner. I mean, I am in Arizona and there are Fleming's restaurants in California, so like any good yelper of course I'm going to want to experience the best and most unique restaurants that Arizona has to offer. However, this just so happens to be my brother's favorite restaurant so he won because this was our family's last supper, of sorts, before we leave him by his lonesome in Phoenix. Well off to Fleming's we went and it was fabulous. For a chain restaurant Fleming's does it right; nice decor, impeccable food, excellent service and over 100 different types of wine. Our server was extremely knowledgeable about the menu and the wine list and checked up on us at all the appropriate moments. The additional support wait staff was very attentive so much so that when (like the klutz that I am) spilled the last sip of wine all over myself, he quickly took my sweater to the bathroom where he blotted it with ice water and handed it back to me in a Fleming's handle bag and recommended that I take it to the dry cleaners and ask that they treat it with the spray that removes wine stains. What a sweetheart! We ordered the sweet chili calamari to start along with a bowl of roasted corn chowder soup with lobster, shrimp and potatoes. I ordered the petite fillet mignon cooked medium rare, my bro had the 20 oz steak and my mom had the Mahi Mahi. All of it was amazing. We finished it off with creme brule and our bill was about 2 bills. Overall it was a great experience and I'm glad my brother won this round.", "business_id": "0ONypOKIhttBz9IJzBE8jg", "stars": 5, "date": "2008-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "ihiOEfBPiUegNbFvGzx6iw", "review_id": "Cg5_eHeAr-CF6BBuVSPJJg", "text": "5 Stars across the board. Made the reservation online for a small celebration for a 60th Wedding Anniversary for 4 people. We were running late and called the restaurant twice to change our reservation times; Jessica and Gabrielle were very accommodating and took care of it immediately. The valet Matthew was outstanding. We got seated right away with the awesome Jason and Julia waiting on us. The Calamari, Mushroom Ravioli and Crab Cakes were amazing. Jason recommended a  Merlot from their iPad wine list and it was great. The New England Clam Chowder and the Caesar Salads with the anchovies were fresh and tasty. Bread was warm and replenished right away.  Entrees were cooked perfectly with juicy NY strip steaks  and big scallops, served hot. The side garlic mashed potatoes were delicious. For dessert we got the Creme Brule with the chantilly cream and it was to die for. The manager Bruce stopped by to wish the anniversary couple and see how we were doing, and our waiter presented the couple of the evening with a box of truffles and a $25 gift card, which was a very nice and classy touch. Great ambiance, fantastic food and wonderful attentive service. I have eaten at the Scottsdale location and this one is just better and warmer. Thank you so much.", "business_id": "0ONypOKIhttBz9IJzBE8jg", "stars": 5, "date": "2014-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "Ovpa3S8xD96dLE5eDxcxJg", "review_id": "j2B4W-7j6lG1rpnyBFkYOw", "text": "I've only had the good fortune to dine here once with a friend, and I can't say much about it other than it was glorious. \n\nIt is everything you'd expect from a premier steakhouse: excellent high caliber beef, amazing service, great drinks, tasty desserts. \n\nIt isn't cheap but neither is the food they serve. In many respects, I prefer it to Houston's because it feels like less of a scene to me and much more about eating a drinking really high quality things. \n\nPaul Fleming (of PF Chang's fame) does steakhouses even better than he does panasian, in my estimation, and the next big payday or birthday (hint, hint) I may opt to celebrate here.", "business_id": "9AbyBqGWHYZC73GlyAuTrQ", "stars": 5, "date": "2007-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kJyR4gT1pfCcNjEY9-YMoQ", "review_id": "Mp86KEW-iJ-QUDxpiA8yHQ", "text": "i tend to go here for there happy hour 5-7 mon- sun 6$ gets you a great shrimp app, carpaccio, burger ect excellant martinis and service", "business_id": "9AbyBqGWHYZC73GlyAuTrQ", "stars": 4, "date": "2012-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5C8TXHKf9wAven9lZsgzWg", "review_id": "9ey9WPHpkDZWriuwhhEKaA", "text": "I visited Flemings for the Happy Hour which has been toted as a fantastic value.  Inexpensive does not mean good.  I ordered the Hamburger,bacon, cheddar sandwich.  Not only was it cold, the grease dripped out enough to cover the ENTIRE plate. What a mess!  I had a total of five (5)French fries on my plate.  It may have been an off night, but it was my night out too.  I doubt I will return for Happy Hou at this location in Scottsdale.  There are far too many excellent choices in the area.  \n\nS.Smith", "business_id": "9AbyBqGWHYZC73GlyAuTrQ", "stars": 1, "date": "2014-04-28", "type": "review"}
