{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Nhvkukz5MECqEUQVfh6A6w", "review_id": "xMxam9Fh0GLCJ-ttO19qwA", "text": "Awesome experience!   I came in all fatalistic with my flat tire on a workday morning with a full schedule. \n\nThey saw me and worked on my car like a NASCAR pit crew.\n\nI was prepared to buy new tires.  They offered to look to see if they could repair.\n\nThey repaired them.  I saved alot of money.  #integrity #greatcustomerservice", "business_id": "b12U9TFESStdy7CsTtcOeg", "stars": 5, "date": "2015-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rcJOIO7wSgb-02sx656DtQ", "review_id": "QdW8YPDUJ6MW2tpIhEcC9w", "text": "I took my wife's car in for new tires on good Friday. I felt that the prices were reasonable, I didn't feel pressured to buy the most expensive tire, and I was out in less than 2 hours with no appointment.", "business_id": "b12U9TFESStdy7CsTtcOeg", "stars": 4, "date": "2015-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pMf6ebP3jCkELI8RdUebPw", "review_id": "i9MU136vA3xT9s0t5wKFyQ", "text": "Bastone offered me a fair price for the work they did.  I took it there to get a second opinion and despite the fact that they have a sign saying they charge for check-ups, it was free.  They quickly got back to me telling me what had to be done and what they recommended giving detailed reasoning behind it.\n\nAt no point did I feel like they were trying to cheat me or up-sell me.  And they were the cheapest place I checked out.", "business_id": "l-dc5DeNBiHYJA1XO4cFPA", "stars": 4, "date": "2009-03-31", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "yIjl1ATWO89IdsbnWqG3Ag", "review_id": "ksWAObzettmN-g9aHNthWg", "text": "The best, most honest and reliable car guys in the Burgh. I lived in Pittsburgh for eight years and still have family there. I drive in from out of state so these guys can do work for me.", "business_id": "l-dc5DeNBiHYJA1XO4cFPA", "stars": 5, "date": "2009-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "N4_kXuPAh9db1IgFLWAk6A", "review_id": "eykCQph-LBWWsGJBDzGt9Q", "text": "Great service. I had my tail light replaced and had it bought online. Other places said that they wouldn't install something that wasn't bought at their place. Bastone finished the work very quickly and did a great job. Great service and value.", "business_id": "l-dc5DeNBiHYJA1XO4cFPA", "stars": 5, "date": "2009-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "c9CORaHN_4GHVFfvu1dnaA", "review_id": "D_oMf5-jzKh6uozYG3olBw", "text": "Perfect place! I needed help today and they helped me....no charge...just asked me to do something nice for somebody else today!", "business_id": "l-dc5DeNBiHYJA1XO4cFPA", "stars": 5, "date": "2015-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "i5u7z972f0hyuv3rk2kv7w", "review_id": "2UP5SKK-5Og4rio2vcSvKg", "text": "I had to get new tires mounted and balanced and when I went to pay, the guy at the register actually says something to the effect of \"Do you have any idea what this is supposed to cost? So, I could charge you $400 and you wouldn't know the difference?\" Joking or not, why even go there?", "business_id": "t15LDNaHFpu-bAEJSdoV-g", "stars": 2, "date": "2009-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "fw6zu0lgQ6X432veD7PgtQ", "review_id": "1HXLDpvCCW2lJyldHwnaOA", "text": "I cannot say enough good things about Walter's.  Tim, the head mechanic (Tim Walter, hence the name of the shop), is amazingly helpful and accommodating.  He repairs my car quickly every time I go in, and I never have to bring it back for further repairs.  He also fits me in right away (though it is a good idea to call ahead - they do get super busy because of their sheer awesomeness and small size).  And when I pick my car up, he'll explain what was wrong and how he fixed it in a completely unpatronizing way, then usually undercharge me.  I know, sounds too good to be true, but isn't.  I'll be moving for grad school soon, and I can honestly say I will miss Walter's.  I don't think I'll ever find a better shop/mechanic.  \nA quick word of warning: Tim's adorable, but completely ADD.  He'll fix your car well, and quickly, but he does get easily distracted sometimes.  Bear with it, he's totally worth it.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2009-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LmLEybdrVdoyj7nxDOBilA", "review_id": "_ac4ogQrDh3Qw_wv9KKVjQ", "text": "My car wouldn't start so I started yelping the closest option to my apartment. I found Walter's and with such great reviews below I gave him a call. He drove over to my apartment and looked at my car hoping that it'd be something simple before we got it towed. After witnessing him take time out of his busy day to do this, I knew he was a good guy.\n\nUnfortunately, it did need towed and he was afraid it'd take a week to fix due to his booked schedule. He called the next day to tell me that he looked at it, realized it was a simpler fix than he originally thought and had it done later that day.\n\nI had a great experience and am sure everyone else will. Thanks Tim", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2009-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WjopORV2YaHqdRqtDzQ9bQ", "review_id": "VLXmeMSmfzET5UVORfXAEQ", "text": "I just want to echo what everyone else has already said about this mechanic.  My brakes gave out and I came upon the glowing reviews for Walter's, so I gave them a call.  Not only did Tim fix my car quickly and inexpensively, he actually came to pick it up himself so that I wouldn't have to spend money on a tow truck!  He's also an extremely friendly, funny guy who puts you at ease immediately.  I'll be going back there without hesitation the next time I need anything done on my car.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2009-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tPUGLlDZLF7HrOC46NqTOA", "review_id": "C7hlcDI1EBdbra7NP7YUnQ", "text": "I love Tim.\n\nI bought a shitty used car and it kept DYING when I would drive uphill, and I was new in town so I asked for some shop recommendations from people online and a bunch of people pointed me to Walters. He helped me isolate the problem to my EGR valve, and while it wasn't a cheap fix, I can't imagine I could've gotten the work done any cheaper. I've also had several other problems, and he's always trying to save me money and do things as inexpensively as possible.\n\nI wouldn't say my shitmobile runs like a dream or anything, but it's definitely in much better shape than when I started.\n\nAnd I usually don't have to wait too long for repairs. Typically I can drop it off in the morning (after making an appointment a few days in advance) and pick it up later that day. Though, they do seem pretty busy so I try not to expect them to get it done too quickly.\n\nAnd I have to say, I really don't care if my mechanic is a friendly, personable guy because I'm just paying him to fix my car and as long as he does that right I'm happy. But Tim is one of the nicest guys I've ever met, and I really enjoy talking to him.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2010-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "eDhbpC9XvlKsG0MiFsocNA", "review_id": "bAwdECIzxHgtgRQLDu0HoQ", "text": "Wonderful experience. I had a flat tire, and he checked it inside and out, tested it overnight, and put it back on my car. When I went to pay, he said it was nothing. He even gave me helpful advice on some other aspects of my car I was neglecting. During a bad week, this was a much-needed act of generosity.\n\nHighly recommend.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2011-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "YTHnhkhUY9m83m915xsjJg", "review_id": "8p75a7yoKe-ebQlTDad9BA", "text": "What can I say about Tim that hasn't already been said? Although I didn't end up getting my car serviced at Walter's Automotive, Tim gave me a lot of helpful advice and was very personable. You can tell he genuinely cares about his customers and their concerns.\n\nI'll definitely be going to him if there's anything that I need to get fixed in the near future.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2011-05-18", "type": "review"}
{"votes": {"funny": 6, "useful": 5, "cool": 5}, "user_id": "pRyrLnk2ayyAdeZRsh5kVQ", "review_id": "KLAx0UUkhXS3ykfuCDK8Ew", "text": "I have a general rule of thumb when picking out an auto repair shop:\n\nThe \"office\" must be very messy and grease and dirt must be everywhere.  \n\nIn my opinion, if an auto shop has the time and money to keep a squeaky clean appearance, they're wasting some of your money you pay for service.  Walter's Automotive fits the bill with their \"office\" being a small cluttered desk in the service bay.  Their \"lobby\" is the doorway that you stand in just outside the \"office.\"  I couldn't be happier with my first impressions--to me, minimal overhead means maximum service and value.\n\nSure enough everyone at Walter's is very nice and helpful.  Apparently, everyone else in Pittsburgh knows this since I have to schedule an appointment 10 days in advance just to get my car inspected.  So please, even though Walter's is awesome, don't come here--I want this place to myself.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2012-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CWV-G7w9mutxrp1aNRIuvg", "review_id": "3bzw8zq-GANIohIfcbB4nA", "text": "I thought I need an alignment and turns out all I needed was a tire balance. I stopped by he had me go with him and we drove around the block. I didn't cost me a thing because the tire balance was under warranty. Really  nice guy.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2012-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_GE7cu9Kwr2BmMLu0-kW-A", "review_id": "AezvLEDoYuEWQ9RctaxviQ", "text": "I heard about Walter's by the great reviews here on yelp. They did not steer me wrong. I went to the shop and asked for an appointment for leaking oil, but the secretary said they didn't have one for a couple weeks. Walter was doing work and asked me a couple questions, then asked if I could bring it in the next morning. The next morning! I did, and Walter and his employee lifted and took a look under my truck. Literally in seconds they found that it was simply a botched oil change, tightened the cap, and brought my truck down. He even topped off my oil, I believe. All this, and he said \"no charge on that\" as I went to pull out my wallet. I was in shock. \n\nAs a side note, Walter and his staff are also very approachable. While his employee worked on my truck Walter, a fellow mechanic (?), and I talked about various things.\n\nI will recommend Walter's to my brother who lives here in Pittsburgh, and will go to Walter's with any car trouble I have while I am here for school. I recommend Walter's in the highest degree.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2013-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HlNo12lLfLoHai1_umx6aA", "review_id": "9z3VbRFgfS3as4khsEeZFw", "text": "Walters is the best!! I came in from Charlotte with my Son and picked up my Mother's car to drive back home. It was only going to be a one time fix. They treated me like I was special. They looked at the car and did what needed to be done to make the long ride back safely . The money that they billed me was incredibly reasonable and before we left I  had to go back to them after I discovered I had a blown fuse for the power outlet - they fixed this for no charge!!!! \nI will always recommend Walter's Automotive to anyone I know who lives in Pittsburgh and needs any type of car work to be done.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2013-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4yxGoEXjYqlk5ifkyG7zcw", "review_id": "DZuSnQYIXPxOiSIrG--_KA", "text": "I had to give Walter's 5 stars, if there was a way to say it was exceptional, I would do that.\n\nI found Walter's through yelp and was not sure how a auto repair shop had all 5-star reviews. This is totally unheard of. And now having gone there for a repair and inspection, I can just say, BEST MECHANIC IN TOWN. Other people have sung praises for Walter's already, so I won't get into that. My recommendation: If you are looking for an amazing, trustworthy, competent and humble mechanic, dial Walter's number. You will not be disappointed.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2013-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "7xXmoShBHGcF1_Yok4g-iw", "review_id": "xpbsnE_pYU1TFjh6Wof-NQ", "text": "Walter's is the best and most honest mechanic I've ever worked with. They are super busy because they are so great, so they have no need to do unnecessary repairs. Can't speak highly enough of quality of their work and integrity!", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2014-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "KOrggEZ4aa7JzVIuY-Zgkw", "review_id": "XS-yp7qP6Qy816tXzSkS7g", "text": "Anything my car needs I go here. No matter what, Tim has a fair price and gets the job done. I never feel like he is trying to sell me anything extra. He just gets the job done and sends me on my way normally with in the day. This is a place you can trust and if he has an opening he will take you.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2015-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vSOScXB0a8jhqJ6dn9GPFw", "review_id": "1Sq_wtHXvWxMuM1V9vYbyw", "text": "Great service, friendly people. I have been taking my car to Walter's for over two years now. \nFour months back, I got my wheel bearing and hub changed in my 97 Accord. But when the noise came back recently, Tim replaced the hub without costing much.\nHonest would be the right word to describe the people at Walter's automotive.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2015-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a15UWzVolwNxrboFqEcipg", "review_id": "Nrq7STx797YUpEP-oBnuOQ", "text": "Prices are reasonable and they have not given me the \"I am here to screw you out of a bunch of money\" feeling you get from dealerships and other automobile garages.  I will continue to use this place.  They are very knowlegable when it comes to fixing vehicles.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 4, "date": "2015-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vXw5WO5NJaZNVATsz0vBEg", "review_id": "KwYyzi7pmg27HOHWCxxuFw", "text": "This man is the real deal, a great mechanic, funny guy, and honest businessman. I was fearing the worst for my car after pep boys gave me a very high price to fix my cooling fan and miscommunicated vital info about the repair, prompting my earlier negative review. It took awhile to complete the repair as Tim told me two other cooling fans they tried to put in were also faulty. They finally got a third one in that worked, and charged me only for the parts and labor to put that fan in, which ended up being hundreds less than Pep Boys. Plenty of places could have tacked on a lot of extra labor costs for changing out those failed fans. I was blown away by the good experience I had, even if it took awhile and a couple fans to get right. Tim has won a loyal customer with that kind of service.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2015-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "O4RI4RpJ0EgCxxqgyPl8BQ", "review_id": "uKzso4_YWuGMqJm4NHLToQ", "text": "The staff at Walter's treated me like an old friend even though this was my first time there. Everyone was so nice, the prices are unbelievable & I will definitely bring my car here for any services it needs!", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2015-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IjMtq2BG18pD6oc5hpRZhw", "review_id": "wAc3kfx2Hy3WQdYWuq9kPQ", "text": "Consistently awesome. Highly recommended. They always get my car in quickly. Their estimates are spot on. Very friendly.", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2015-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OJ02OohAV4f8cQZofvHnmg", "review_id": "qftJ7mUuINPr_1ZtBhgZtA", "text": "I kinda accidentally walked in ten minutes before these guys closed, asking for an oil change.  Oops :/\nLike the awesome guys that they are though, they let me know that, while they would do it quickly (like, not check anything else), they would still be okay with doing it.  The guy was super nice about it.\nAfter all of this, he took me out to look over everything, was super friendly, and answered all of my questions.\nThey are great.  I will be back if I'm ever in this area when I need anything.", "business_id": "FZ67NZD-_aou82e-7TT_nA", "stars": 5, "date": "2014-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wQVoeO2hOEDc8MrwjU3ieA", "review_id": "6tprBRjOYRiuT92r5B2uUg", "text": "Don't go. I got more problems and sounds on my car after I spent $800 there. unbelievable!", "business_id": "t_Mjhtr0KTB9uGNzxl37WQ", "stars": 1, "date": "2011-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "g15FSXiE1Ov60AUp4ZDGCA", "review_id": "cxpIwZTRAkmu5jLasuWaOA", "text": "I needed a new flex pipe welded. Meineke took care of it quickly and for cheap (after a different mechanic said what the fair price was).", "business_id": "t_Mjhtr0KTB9uGNzxl37WQ", "stars": 4, "date": "2015-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l0NfdBJDva7anZN3J8zS6Q", "review_id": "vbdPRIQAFoBr9pdz48OqXg", "text": "My '99 Camry has had a check engine light on since buying it used 5 years ago. I don't take my cars to dealerships (too pricey), and I was always told a dealership was the only people that could turn it off as there was nothing wrong with my car. \n\nI tried Angel's for the first time off of a recommendation just for inspection last summer, and it was some super obscure part that needed replaced that only cost $100. Been taking it there since, as the service is fast, friendly, knowledgeable, and affordable. \n\nYeah, it's funky looking on the outside, but don't let that deter you!", "business_id": "4pDO3TZ-WJDofAt4uREMig", "stars": 5, "date": "2012-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eBWnPVjNO64o--7e_EFs-g", "review_id": "5ZYw6-1sSIipYQNdv_ip_g", "text": "For normal maintenance, inspections and other auto related service, check these guys out. I couldn't be happier with my experience. Labor rate was quoted at $65 per hour, which is approx half what it would be at a dealer or some corporate garage.", "business_id": "W25mXeVDTHBIXAidJrwHPg", "stars": 5, "date": "2013-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AjQOyzdWx5MbfODCC_VrIw", "review_id": "0YHHtLUwDM0B_v-AEbsx8g", "text": "So, this is what happened.\n\nI went their complaining about a possible over heating and requesting a change of oil. This was my first visit there. They topped off my coolant for free and changed my oil. I had a check engine light on for which I knew the code and was holding off on repairing it. \n\nThey charged me $20 for reading the check engine light code and turning it off. I didn't want that. I pointed this out on the bill and he said that, its fine, I can just pay for the oil change (~$42). He asked me if I had $42 cash on me. If I did, I could have paid and left a happy customer. But I didn't, so I gave him my card and he went in the back and swiped it for the full price ($42 + $20 + tax). When I was signing the transaction receipt, I told him that he swiped for the full price. This apparently pissed him off a lot, he very rudely handed $20 from his pocket and asked me to \"Get out of there\" - and walked out. I tried to talk to him and explain my reason of asking - it not being the matter of $20 but of the principle that he said he wasn't going to charge me for what I didn't want. But he wouldn't listen, was very rude and said \"You're Done\" and \"Get out\" more times. I left. \n\nI ain't going back where they treat customers like that.", "business_id": "W25mXeVDTHBIXAidJrwHPg", "stars": 1, "date": "2014-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8H5e_08sWQ1Bbk-U4nBa0Q", "review_id": "D_o8r7ZAet7RQiqDP12YRw", "text": "Had a problem with my hood latch. It was small enough that they fixed it for free! Really nice guys.", "business_id": "JtViWM5LYyQ22uq2DYqt6A", "stars": 5, "date": "2015-04-13", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "WuLAwvw5Z4ttYZFnAMUULA", "review_id": "LrUhcCXvWxLuuDulZe4Ppg", "text": "My girlfriend and I have both taken our cars here for inspections and both times they told us we needed several hundred dollars on repairs to pass.  After getting a second opinion both cars passed with none of the same \"issues\" being found.  They did a battery repair for me and were reasonable, but I do not trust them and they overcharge.  Don't go to them for an inspection.", "business_id": "vWrXsnk4DMRUckSR1tMmXw", "stars": 1, "date": "2013-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "DWEJBZOCHHcUhRk-VfgR6A", "review_id": "2NHJyd0oiCP0FwGEeRvV2g", "text": "I work a really crazy schedule, like yesterday I worked 2pm to 12 am and today I work 12pm to 10pm, so it's not like I have an abundance of free time. I have an engagement this weekend 5 hours away and the a/c in my car isn't working so I had to find a place close and an appointment early. I found one at a local mechanic literally 3 minutes from my house. Booked a 9am appointment online and got a confirmation via text. I reluctantly woke up on time this morning, had a cup of coffee and headed to the shop. There was no place to park or any signage indicating where to do so. Regardless, I walked in and the guy asked for my name and he found it on the appointment list only to tell me I'd be getting in at 11. 11?! Why even bother making an appointment?! Why let your customers make an appointment if you have full bays at 8 am! Why tell me I should've been there at 8am when I was never told that?! I literally had to scramble to find another place to get this checked out as I truly only have 3 hours tomorrow to accomplish this now. Great job on customer service, dude, great freakin' job.", "business_id": "vWrXsnk4DMRUckSR1tMmXw", "stars": 1, "date": "2015-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ENxS3ie6R6drgtEdAigaYA", "review_id": "qJjB9_9ge7OAguGG_Kw7Ng", "text": "Made the same mistake 2x by going to  these clowns. Got tires off of these fools and alignment machine was broken. Scheduled appointment for an inspection and there damn emission machine was down. Couldn't even call me to let me know. Drove down there so they could say sorry want to do it tomorrow?", "business_id": "qfE56Noi-gtgy0WcSMtfIA", "stars": 1, "date": "2014-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7Mg6r6g7RUwQH_Bllrd-wQ", "review_id": "wVo9HiniAI-MgLHEyGqVUQ", "text": "So I have to be honest I stopped by the pep boys first since I had a coupon. Pep boys not only had a long wait but couldn't even get my tires in (at all) \n\nThe manager actually recommended try Mr Tire. \n\nAfter a quick 1 min drive to Mr Tire I was met by the manager at the bay door. \n\nHe talked me though several options and was extremely helpful! I got a buy three get a fourth tire free deal with a 40,000 mile warranty \n\nI ended up getting rear brakes for a great price and a free oil change as well. \n\nI will 100% take my business back to them and even spread the good word to my friends in the south hills.", "business_id": "qfE56Noi-gtgy0WcSMtfIA", "stars": 5, "date": "2015-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "v-8T8q0-uVVV8cv1pVxu0w", "review_id": "jkxa3qwfRbikmkKkHVG5xw", "text": "I set up my appointment a week in advance.  I was told it was not an issue to get it done in one day.  When I showed up at the scheduled time, I was told \"oh was that today?\"  Late in the day I called to see if I could pick up my car and it wasn't done and was told it would not be done until the next day.  When I went to pick it up the following day I asked what happened.  The guy,(George) who had mishandled my experience from the beginning, proceeded to blame me saying that there was no way that job could be done in one day.  If you'd like to be blamed for their shortcomings, you should take your vehicle here.", "business_id": "FXj0ZOHbyV5n_0S_QZOOuQ", "stars": 1, "date": "2013-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x1tqIO9G1RX3qd6Y4TsHXg", "review_id": "LrykNEmlEVKeCjc5dJpUiQ", "text": "My review shall be a little bit of a contrast to the previous one listed.\n\nMy experiences here have been excellent. My car is finally old enough for me to take it to repair shops that are not the dealer - I know that dealers typically overcharge for mundane things like oil changes, but while my car is under warranty, I just suck it up.\n\nThis place is close to home, and very convenient. I have had new tires, a new battery, hydraulic fluid flush and fill, coolant flush and fill, and multiple other services performed here recently, and found the quality and speed to be excellent. When I need to get work done on my car at the last minute on the weekend, this place is clamoring to accommodate me and get my business!\n\nThus far, Mr. Tire in Fox Chapel has proven itself to be a reliable and fast provider for my car needs - we shall definitely be back.", "business_id": "H27egCbna1FH8X8HFpLD_A", "stars": 5, "date": "2013-04-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "tJ6KhNRJSfavHNKl2GLLTQ", "review_id": "Z2GrwTU9I5qZZgntIGhstg", "text": "I would give Carolina Auto Repair no stars if possible. \nI took my car here for a simple oil change. When I picked my car up and started to drive home my hood flew open and broke my windshield also destroyed my hood.\nJohn (the owner) refused to pay for the damages even though it was clearly his fault. He was very disrespectful to my father and I while lying about who actually did the work on my car.\nWe are now going to sue him for damages.", "business_id": "fvKQpza6x2daBFXaGSm4Fg", "stars": 1, "date": "2012-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_bejEIFBukC_m9rHj7JGQg", "review_id": "19tNPkV9_sR3DD_-JQXZgw", "text": "I was in Charlotte visiting family over Spring Break when my engine started misfiring.  It was Good Friday afternoon and I was planning to drive back to Chicago the following day. All the auto shops were going to be closed for the holiday weekend, so I knew I had to get it taken care of that day.  I called and spoke to Todd, who told me it might be a bigger job than they had time for, but told me to bring it right over and he'd see what he could do. \nI'm SO glad I brought it there.  Three men worked together to quickly diagnose the problem, go get the part I needed, WASHED the car while they were waiting for the part (just to be nice!!) and solved my problem in about an hour.  The price they charged me was much less than I expected, and I can honestly say it was the BEST car repair experience I have ever had.\nPlease take your car to these guys with confidence.  There's just no way you'll regret it.", "business_id": "MrEABR3VfV0jDm_6oOfvXQ", "stars": 5, "date": "2013-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FY9Cl4ws26yYjUU5kLhg-A", "review_id": "IeJSm-SHelFSTL1Knru5bg", "text": "2 visits. In the first, the salesperson had no clue about what a bathroom auger was - I had to find it myself.  In the second, in the auto section, the salesperson - a different one - was highly knowledgeable and helpful about jumper cables, and helped me pick a good pair.", "business_id": "zKGGHa7AXr4EnPvBAaum5A", "stars": 4, "date": "2015-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RbSPl5bMKm_INZKn_Y05FA", "review_id": "ClXAj0clARrJ38gel15aiw", "text": "My experience the other day was WAY better than my first interaction with them a few months ago. I came in at 1 pm and the gentleman I dealt with stated that most likely they wouldn't be able to service the vehicle on Tuesday but that I would have to pick it up the following day. I explained that I had purchased my tires at Sears in 2011 and had the warranty. I stated that only 1 tire needed to be replaced due to a gash in the side wall and he said he would try his best. I received a call around 4 saying that they were replacing the tire and I could pick it up the same evening. The warranty discount was applied, they rotated and balanced my tires, and they were very friendly and helpful in the process. I was a satisfied customer.", "business_id": "zKGGHa7AXr4EnPvBAaum5A", "stars": 3, "date": "2015-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Zw02OUyjMbkHDMJHUae-vQ", "review_id": "tb9VxTBZhBA6a38yPL76-Q", "text": "I understand that there are appointments as soon as the store opens in the morning, but associates should still be able to give some sort of estimate on the anticipated wait time.\n\nWhen I arrived (at 10:30am), I waited patiently for the store to open at 11am.  As soon as I pulled into the garage, I was informed that there were four appointments at 11am (only 3 had arrived and it was 11:20am).  Then I was told that there are two more appointments at 12pm and one at 1pm.  I asked for an estimated wait time, not how many appointments there are.  Telling me I have to wait until all of the appointments have been taken care of says to me that I will have to wait until the 1pm appointment is finished before you start working on my car.  It would help tremendously if Sears could train their associates to speak in a more polite and tactful manner.  I understand completely that I will have to wait, but the associate did not appropriately phrase her response to my question.\n\nAfter all of this, the associate informed me that she is a transfer associate at this store.  So you chose to make my experience a bad one because you don't know what's going on and haven't acclimated to your new environment yet?  I have been waiting for two hours now; that's not an acceptable apology.  Then I find out that the tires I anticipated buying are not in stock in the store, although it says they are online.  If I had known that beforehand, I would never have wasted time coming to Sears in the first place.\n\nConsidering my car isn't finished yet, they may get one more star, but I plan to avoid Sears Auto from now on.  Bad business practices are very disappointing.", "business_id": "zKGGHa7AXr4EnPvBAaum5A", "stars": 1, "date": "2015-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5evSUr4xbyfU2e_rOuv7AA", "review_id": "kTHBfEXwbp5wvcrXXnJ_Rg", "text": "I have been servicing my car here for a year, and I have only had good experiences here.\n\n1. The staff works hard to make sure you are getting the best prices on parts and they charge reasonable rates for labor.\n2. They stand by their warranty.  I had my timing belt changed, and after a couple of months i thought it was idling loud.  They took care of the problem with no additional charges.\n3. They don't nickel and dime you.  At the Subaru dealership and Woodies, they charge me $75 - $90 just to look at the car.  At tread quarters I asked for a couple of lights to be replaced on top of getting my breaks replaced, and they took care of it for no additional charge.\n4. They stand by their quote, and charge you for the exact time worked, even if it comes in under the quote.  At woodies they charged me the full price of the quote, even though they only worked on the car for half the time of the original quote.", "business_id": "n3jucIUCSjIXrKU-ykIb0w", "stars": 5, "date": "2014-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "piT_1raZ-9uY7rAT2S6oeA", "review_id": "O74VjCskwO5peeQg0vTnpA", "text": "I recently took my Acura TSX here for some serious service as it has very high mileage 200k +.  After getting a maintenance check from Hendrick Acura, I was looking at nearly 3k of repairs and it appeared a new car was going to be necessary.  I decided to get a second opinion and Treadquarters was able to diagnose that some of the repairs Hendrick recommended were not actually needed at all.  With tires and all repairs I was out of the door under 2k.  Kevin and the mechanic who worked on my care were very friendly and informative.  They promptly explained exactly what they did for my car and what I need to pay close attention to in the near future.  I would highly recommend them to anyone as I have recently moved down to Charlotte from Ohio and have already saved them in my phone as Auto Mechanic.  On top of everything they did, they even replaced my headlights at no additional cost.  Great people and great business.", "business_id": "n3jucIUCSjIXrKU-ykIb0w", "stars": 5, "date": "2015-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jTvXye1zIyKXM8V2SJB-6Q", "review_id": "Zum5XsmIaQljspGGHTixnQ", "text": "I have to admit I would like to blame these guys for how much money I have had to spend fixing my car, but it's my stupid car's fault.  They always do quick repairs, give me my options and exlain them to me in layman's terms before doing any work, and unfortunatley they recognize me and my mother now for all the work we have had to do on our cars but they are pretty nice and respectful.  I can't say they try to break me any deals like the ones you may get from a non-chain location, but I am happy with the work for the most part.", "business_id": "0OvmJ272j8qYwzDzrCR7wQ", "stars": 3, "date": "2011-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7KW8O0c5tmtzmYd6OsDAIA", "review_id": "PU6fN-hFPmELgA0I9W24Fw", "text": "Great service - very quick, definitely use the coupons - and the evaluation was honest and fair - and no pressure is applied - I would go back again", "business_id": "VTu63fFRaKQV_BgoU8rquw", "stars": 4, "date": "2011-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "npgfNG9-cd-QWEt2rwyWYA", "review_id": "ZNwIKra2fFbc1uEhiK-uEg", "text": "I trust these guys. Since Tim has been in charge I have been taking my Saturn there for all sorts of repairs and to get the oil changed. Where as other shops cannot do the work or overcharge/ripoff Tim and crew get the job done and they are HONEST!!  I would reccomend them to anybody. \nThanks for the good honest work guys, keep it up", "business_id": "VTu63fFRaKQV_BgoU8rquw", "stars": 5, "date": "2013-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "3eY9tFgtCwCu6iRy6NZLHQ", "review_id": "BpglSFNahT4keVWyMos_Sg", "text": "This is the only place I take my vehicles to get inspected.  \n\nThis is all they do- inspections. They do not do oil, do not change tires, they do not try to sell you a car.....they just do inspections.\n\nNormally it does not take more than 15 minutes or so to do an inspection here, as they do have three bays open, and the staff is friendly.\n\nThe waiting room is small, a small tv in the corner, and lots of magazines, to choose from.  Since it is only a few minutes for the inspection.....it is hard to complain about the chairs, or the limited tv channels, and most people tend to sit outside while they wait.\n\nI am glad they only do inspections, it just makes it easy to have the same place do it year after year, without the hassle of someone trying to sell you things you do not need.\n\nNCFoodGuy", "business_id": "nLTTeGZrT2S2xaUISCgrSw", "stars": 4, "date": "2011-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "480gZvQ4qe1BlWaDtFQCKA", "review_id": "w1rv9YWru3a6UMzgUkzMMw", "text": "These guys are great. I hate dealing with cars because as a young woman I often feel like people will try to take advantage of my little knowledge about cars. Everyone in here was so nice and Danny was the best. He told me straight up that the repairs my car needed were going to be expensive and referred me to a friend of his who would be able to do the work cheaper. I've never had anyone give up a potential sale, in favor of saving the customer money and that made me feel like they actually cared. I'll definitely come back.", "business_id": "mnOTw4P5NaLbzFp2bTsm9g", "stars": 5, "date": "2015-03-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "37MDvNCXpRqkTRwk_a_IxQ", "review_id": "GsqxdAdQWgn5iqW35uj7uA", "text": "They offer free popcorn and cold drinks as you wait, which is amazing. They have an actual carnival-like popcorn machine and a refill soda machine to drink all you want as you wait and watch TV with a remote control. They also have a play area for kids, which is unheard for a car shop. It's a family friendly shop that keeps you entertained as you wait.\n\nI'm glad they offer all of that because it took 1 hour and 30 minutes for an oil change and lube. I had an appointment to attend, so that was very inconvenient. They don't tell you how long it will take and maybe  don't care about your schedule. Simply saying an estimated time will solve this.\n\nGood service but too slow or shorthanded, at least on that day. So if you have an appointment, make sure to be prepared to wipe your schedule clean, or go to someone faster. \n\nOverall, I would give them another chance and go again. Just by simply offering popcorn, drinks, and sometimes cookies for free, shows that the owner or manager cares about the customers. No other auto repair place does this and that's why I recommend this place to my friends. But also warn them about Griffin's super long oil change sometimes.", "business_id": "mnOTw4P5NaLbzFp2bTsm9g", "stars": 3, "date": "2015-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HIWv58C1rBqohyNaGpKFdg", "review_id": "u1EMLxgFpwu7dUQjQC1Xqg", "text": "Our Escape broke down this morning and we had it towed to Axles, and for a first-time service, it was excellent and done in a timely fashion...a.k.a. same day!! Prices were fair and appropriate! Axels was recommended by a friend, and proved to be a great recommendation.", "business_id": "bxKCFY8TqRl-nNaXvbN6xA", "stars": 5, "date": "2013-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bpuIrmRODBGwCz_Pl1TfDA", "review_id": "GH4_ToGH3i4nkfzgFdXJCg", "text": "My husband took his Mercedes to Axles Unlimited due to a water leak.  The vehicle was picked up after the repairs were completed.   Once he got the car home it still was leaking.  He took the car back a second time and was told by one of the employees that he had advised the mechanic that was they fixed was not what was causing the leak.  My husband left the car again to have the repair corrected.  He picked the car up yet again and got it home and it was still leaking.  He again took the car back and was advised that it was something different that was causing the leak.  Needless to say he took the car to get a second opinion and it turned out to be the water pump the entire time. He has paid someone else to fix an issue that he thought was fixed and paid for.  I do not recommend taking your vehicle to this shop for repairs due to the employees know when the customers are being shafted. I wish I could give Zero stars!!!!!!!!!!!!", "business_id": "bxKCFY8TqRl-nNaXvbN6xA", "stars": 1, "date": "2015-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_i5USXv8LSAucyTgQv5AKA", "review_id": "q5Z86T3jn3CVXXvv_okdVA", "text": "I came to this Firestone 15 minutes before closing. I was overdue on an oil change and making a trip the next day with limited time to take care of the change. \n\nThe associates were willing to stay a bit late to make the oil change happen for me so I wouldn't have to worry about it the next day. It was really great of them to go above and beyond for me. \n\nI had an excellent experience at this location.", "business_id": "-_SZy-tV0oNRiFgMStMdyA", "stars": 5, "date": "2015-03-19", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "PRKmPhfncHKGsN5Ol0EbhA", "review_id": "oDeuAB5s3xp0LSilNJpIlA", "text": "I had good Friday off....but as it developed, it wasn't a good Friday after all.\n\nI took my truck in for the differential surface rust most of us have on our new trucks, across town, to the sister dealership from which I purchased the truck. The dealership I purchased from has no body shop.\n\nAppointment was set up by a Ford regional rep on Wednesday at the body shop. I called the body shop Wednesday and left a message to confirm my appointment, no return call. I called the body shop again Thursday to confirm my appointment. At that time, she wrote down the info that she should have written down from the Ford rep's call on Wednesday, like the warranty claim number. I set my appointment for first thing Friday morning, 8am, to get me in and out as quickly as possible.\n\nI show up 15 min early Friday morning. The lady I had been talking to, arranging this entire process, called in sick. She failed to fill out any paperwork, and was told that she was the only one that could fill out the paperwork.....so no one could work on my truck. At this point, I was pretty frustrated, having driven a hour to get to that dealership for my appointment.\n\nThe body shop sent me to the dealership since they had a undercoating bay. Great, seems like things are working out now.....\n\nIt takes them around two and a half hours to do the job, including a hour of dry time. I get in my new truck, happy the rust is taken care of and drive a hour back home.\n\nI get home, and what do I see? Black undercoating all over the sides of my new truck!\n\nSo, for the next hour, I am frantically cleaning all this crap off and detail my vehicle (that had just been detailed) to get all this crap off my paint. It was ever where! All down the rear sides of the truck and even some on the tailgate!\n\nTurns out, they undercoated the entire rear of the vehicle, including the rear wheel wells! I didn't ask for this...they were only supposed to fix the rust issue.\n\nThey also got undercoating on my wheels and chrome exhaust tip...that I can not get clean now. A monkey could have applied the coating a more professional way.\n\nhttp://www.f150forum.com/f118/got-rust-do-yourself-favor-fix-yourself-296666/", "business_id": "j3nqWy30B-663uuc1AbDbQ", "stars": 1, "date": "2015-04-17", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "m9eoKjofAtoE5b2pYDSZkw", "review_id": "3DOQKAsy1K6CYqDSpTvpFg", "text": "Its a dealership.   They are salespeople.  Some are good and personable, some you wouldnt trust with your ugliest sister.", "business_id": "j3nqWy30B-663uuc1AbDbQ", "stars": 3, "date": "2015-05-23", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "gy4RviT8DDuvHZHMb57_Hw", "review_id": "s_0_4P0iO_9SV8qZqEfRmg", "text": "Before getting out of the car, my husband and I had a game plan:  show them the car I had found online, ask to see only THAT car, and don't let them push us into staying. I walked in with the exact car I wanted pulled up on my phone and asked to see it. Cody S did just that!  After a quick test drive, he was happy to answer questions. When we said we were going to lunch, he actually allowed us to leave (unlike most dealerships were they grab your arm and won't let go)!  After a quick lunch with much decision, we went back to buy!  Again there was no pressure!!  Cody walked us through the whole process. By the end of the afternoon, I was driving home in my dream car!!  Cody took the time to show me all of the perks of my car!  I'm so happy we stopped in just to look!!  Thank you!", "business_id": "j3nqWy30B-663uuc1AbDbQ", "stars": 5, "date": "2015-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DK2gGNdN3ihOu_uwt2AgLg", "review_id": "2ua1cA2cLiafA5u40qTXjQ", "text": "Once upon a time, my partner made the mistake of purchasing an old Subaru off Craigslist.  This car, while it looked good, turned out to be a total lemon.  After taking it to three separate places for an issue that never got fixed, he finally broke down and took it to the dealership here.  \n\nFortunately, after two visits here, the mechanics were able to temporarily fix his issue, but it cost him nearly $2000.  Less than two months later, his car broke permanently.  Let me make it clear that the car did not break due to any fault on the mechanic's part; the car was just a lemon.  The mechanics were nice and able to diagnose a problem 3 other mechanics could not find, but it was quite expensive.  It was a bit frustrating that it cost so much money to determine that the car was not worth investing further money into repairs.\n\nNow, we will go forward to the great experience - purchasing a car.  Since the repairs were out of the price range, we decided it was time to buy a new car.  This is where this place shined.  My partner told them a price range and the salesman helped him get everything set up.  We checked the value of the car we were purchasing beforehand, and the price really did reflect the value of the car (which is rare at big dealerships like this).  The staff people in the sales department were great, and both of us left there feeling like we got a good bargain.  They made everything really easy.\n\nI'd highly recommend this place to purchase a car for a good value.  I give the service department 2 stars and the sales department 4 stars.", "business_id": "zpNqsFrhLJlxAtPrSkbImg", "stars": 3, "date": "2013-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Pe5eovrKGuxIKdj_VWbrVA", "review_id": "hByJS5lH3GhKUpsfSa4pjg", "text": "They are the best out there. Quick and friendly. Will definitely be using them again!!", "business_id": "zfwMKwIlAwWUoBNtYMLh5Q", "stars": 5, "date": "2014-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5t5zqq9DKG3-zUe70g-o2Q", "review_id": "syL0nPAZytBHv9-rXbqKug", "text": "First off, I NEVER right reviews unless it's positive. Since I am a small business owner and work in customer service, I know the impact of word of mouth. Let me just say Meineke gave me the worst service I've received in my year and a half since moving to NC. First visit, a mechanic talked me out of getting my brakes repaired after I came in expressing concern about a grinding deeling I experience when I back up. Nothing is wrong, its just the brakes adjusting after it rains he said. Your brake pads & shoes have 40% left he said. A month later I was at Lexus getting my shoes AND rotors replaced. AND was told the front had 5% wear left... and like an idiot, I returned fir my last free oil change (2 free preferred oil changes from Groupon). From the beginning I should've turned around. I came in expressing I ONLY want my preferred oil change because they dropped the ball on the brakes. After explaining the last situation, there was no offer to rectify the matter in any way. A mechanic doing the oil change brought me to the back to show me my front brakes like I didn't just tell him what he was telling me. Then told me I need an air filter. Smh. Simple quick fix. I tell him to add it. Can't mess that up right? Wrong. It took an extra 35 mins to add the add filter. Then I get my bill and see they've only done a BASIC oil change. No topping of fluids, no rotating of my tires... so I ask what oil change did you do? The mechanic says Basic. And I asked, what does the Groupon say? He says Preferred. And I said, my car requires a synthetic blend. And what happened to my tired rotation? The mechanic said oh we rotated the tires too; I watched him do it. Everything that should've been done is handled miss. I go outside, and the same chalk marking that was there on my left rear tire, is still there, on the left rear. Smh. I was already late for my next appointment and beyond sick of this ordeal so I left. And the ENTIRE time this disaster is happening, the store manager is periodically coming out to greet everyone who comes in EXCEPT me. He hears my complaint, and NEVER comes out to at least apologize for any inconvenience. I just pray their basic oil change doesn't harm my engine. I will never in life return to nor will I recommend Meineke as a company to trust your car with!", "business_id": "zfwMKwIlAwWUoBNtYMLh5Q", "stars": 1, "date": "2014-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "-_1ctLaz3jhPYc12hKXsEQ", "review_id": "CUIVHhUUkqqOAK-hV8mKeg", "text": "Unlike the ongoing soap opera that involves us trying to get our Nissan problems solved, we have a great mechanic for our Honda.  The folks at Compact Car Service do a bang-up job keeping us reminded of when it needs to come in for service, and when something does go wrong, they do an excellent job of fixing it.\n\nFor a vehicle that is more than ten years old and approaching 150K miles, they don't seem to have a problem working on it - not that they should, but they don't bat an eye, are very friendly, and the prices aren't bad either.  I love these guys!", "business_id": "F5DJEqbNveNq8x94XU_Vqw", "stars": 5, "date": "2008-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-8S6qxlGZTvv3gjzakNF5Q", "review_id": "Mwv0agb8EvUiTm5lHRrmug", "text": "This is how your mechanic should be. Honest, friendly, with fair prices. I am a new customer here, just got back home from my 3rd visit here over the last 6 months. This time it was just a simple oil and transmission fluid change, and a battery/alternator check.\n\nI love how they come out to the waiting area and teach you about how your car works. It is like they are a surgeon and they are telling you the pros/cons of what needs to be done.\n\nThere is also no pressure to get services done to your vehicle. They will tell you honestly if something needs to be fixed asap, or if it can wait. So far, they have saved me about $300 over what Metro Honda was going to charge me for the same services. They also gave me the option to use Honda parts or 3rd party on a previous issue, which is great because I prefer to use Honda parts. I have no worries when bringing my car here. I know they are going to quote me a fair price, and the work perform is going to be at a higher level than any other place in town.", "business_id": "F5DJEqbNveNq8x94XU_Vqw", "stars": 5, "date": "2014-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "C_u_VpW4DoEYs4F-Vdq6uQ", "review_id": "zLel0icX9SGeXqfWqmpH7w", "text": "Having an issue with my Honda so these guys were recommended to me by a neighbor. They looked the vehicle over and even test drove it and did not experience it. Unlike others who would have done something for the sake of getting money these guys charged me for only my oil change. They have earned my business and I will make sure other Honda owners know about them.", "business_id": "F5DJEqbNveNq8x94XU_Vqw", "stars": 5, "date": "2015-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LaHkzpU1yHd-u25FpdvggQ", "review_id": "Pn3kSh-_VEYTKbFO9aaGdA", "text": "Every time I have been here the service I get is beyond amazing. They are quick, informative and compassionate in what they do. I've had several of my car troubles fixed here including regular maintenance. Again, I cannot stress how great of a team they have here and how amazing their customer service is! I don't mind making an appointment when I know my car is in great hands!", "business_id": "F5DJEqbNveNq8x94XU_Vqw", "stars": 5, "date": "2015-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "32tURdWdgadmwPUd10z3fA", "review_id": "ABukXJi5nhq1lTHBJFf05Q", "text": "I have a Honda Civic 06' 4 door. I was experiencing some squeaking noises coming from my front brakes. I know off the bat it was probably time to get new brakes pads, etc. I was recommended by a dear family to come to Compact Cars. I went for a consultation- was pleased with the way the receptionist were so kind and helpful,\n the mechanics- easy to understand unlike most mechanics in town. After my appointment today to change my brake pads and rotors- I'll definitely keep going back to them. Thanks guys!\nOverall really great experience.", "business_id": "F5DJEqbNveNq8x94XU_Vqw", "stars": 5, "date": "2015-05-13", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "8PtrKdFCuafnfOYK5nBLzg", "review_id": "BVbi7QnMZZJsBXRbWasPxQ", "text": "My husband is pretty handy but you have to have a back up!  I had an emergency brake problem and they inspected it ASAP.  Bumped me to the top of the list.  Not only did they see me as soon as I screeched in but since it was a simple fix (a slipped pad clip) they didn't charge me.  WHAAAAA!  Honest, nice and helpful.  Not words I use for all car places.  \n\nThanks guys...you are my go to back ups when the hubby is out of his league or out of town.", "business_id": "EF4UNFplUpjEEx9LglIR_g", "stars": 5, "date": "2012-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gIL_2EZgvJOqJomaRxp3Ug", "review_id": "XkJXQbVrSRC-38jSOXdf7w", "text": "Didn't mind the high price! Dropped my vehicle off a week ago and am still waiting. Every time I call it's 30 more minutes.\n Will not be going back for any service. Even though I was referred by a friend of the owner, I never let them know that. \n Your experience will be like this! You walk in and they may be talking amongst themselves to figure out who is gonna help you. After a few minutes they'll ask what you need. If your lucky and it's a minor issue (check the air in my tire) you'll be out the door in no time. Anything else good luck and be prepared to rent a vehicle for a few days to a few weeks!!!!", "business_id": "EF4UNFplUpjEEx9LglIR_g", "stars": 1, "date": "2014-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NTRHnt3wWo-Lb_YGS2WAdQ", "review_id": "0T8h5Ek7Qj3BukrA27cHgQ", "text": "The guys are really friendly and the prices aren't too bad. They aren't the quickest, but they aren't too slow either and they usually have something good on the TV in the waiting area.", "business_id": "EF4UNFplUpjEEx9LglIR_g", "stars": 4, "date": "2015-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ctyBge4602JYSu94Zcr3Iw", "review_id": "ccvp0RyulWQn4fL47mOZLg", "text": "Quite honestly, I would prefer to give my Volvo away than ever deal with this organization again. I had my vehicle looked at by 3 different independent mechanics to tell me that I had a bad fuel pump and that the fuel pump was covered under warranty/ recall. When it was towed to University Volvo, magically, it was not the fuel pump but rather another part that was going to cost me $500 to fix! The service manager is not an individual I feel that I can trust!  My research on line shows that I am not the only one that has experienced this.\nFurthermore, in my several attempts to voice a formal complaint to the Manager and Owner of this facility...NOONE RETURNS MY CALLS.\nPoor customer service or, rather, lack of customer service exemplifies this organization...TAKE MY ADVICE, DONT WASTE YOUR TIME, MONEY, ENERGY with University Volvo of Charlotte NC", "business_id": "UWtpIca-ub74r6Lgwfu0Og", "stars": 1, "date": "2011-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "LFKpgPdoFbajW5gwSbrO8w", "review_id": "rfRo3NOq7aCNyLzDRXWnwQ", "text": "do not spend your hard earned money here unless you want lousy repairs made, sass from the service representatives, and huge labor cost.\n\nbrought my vehicle in for emergency service. was told the wait would be over 4 days due to mechanics quitting! are you kidding me? once the shoddy repair was made, a new major problem was created so i bring me vehicle back so they can fix it right, and am greeted with \"i'll see if we have time for this\" from the service representative. what a joke. worst part is my vehicle afterward still had a problem! you do not pay hundreds of dollars for less than perfect service. for the amount of money spent on 1 repair, you could buy yourself a brand new bicycle and be much happier.\n\ni ended up taking my vehicle to my trusted import mechanic in greensboro, where the problem was finally fixed the right way.\n\nin the end, do not trust this dealer--this is one of the worst volvo dealerships i've seen and i have seen many.", "business_id": "UWtpIca-ub74r6Lgwfu0Og", "stars": 1, "date": "2013-05-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "LRd5CZ8tkdV2Pa4Zz2pSbw", "review_id": "ZTL5RyMETMaCQw_aQ3UGeQ", "text": "What a terrific experience for a really crappy situation.  I bought a used car yesterday and the A/C was working fine.  Today I take it for a ride (about 15 minutes) and hot air is blowing out.  I bring it to this Meineke and...bad news.  The compressor is not coming on which is a $500 repair.  Josh, the guy behind the counter, tells me that he will not charge me for anything if I just want to stop diagnostic services and take the car home.  He also gives me a quote to keep going to see if there is something else going on.  I take that option and hope for a miracle.  \n\nAfter hooking it up to \"the machine\" and putting some dye through the system, he finds out there is also a leak. He gives me a quote for the new part which he would need to order.  I decide to take it (about $175 for the part and labor).  He got the part same day and fixed the A/C.  He explained everything to me with a diagram and showed me exactly what was wrong and what he was going to fix.  He also was very upfront and shared that while although the A/C is running cold now the compressor will eventually need to be replaced because it is damaged.\n\nMy only disappointment was that it took nearly 5 hours of me sitting there and waiting.  However, I was a walk-in with no appointment and he had to go get a part for me.  \n\nOn a side note, I did really appreciate him helping me get my laptop connected to an outlet.  I needed a three prong outlet and there were none around me.  He went into the shop and brought out an extension cord, hooked it up behind the desk and got me situated.  Honestly, I'm going back here for any other services I need.  I really do trust, Josh.  He did not push me to go forward with fixing it because he was not 100% sure it would work.  He also thanked me at the end for my patience because he realized how long I had been sitting there.  Small thing - but that's what us Yelpers look for when we give 5 stars!", "business_id": "dsOZa4ox94jUyJRAFnt54g", "stars": 5, "date": "2011-04-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tANl4pQy_hSfYMmF2zBOHQ", "review_id": "AnBgZNKEMeN96IdtYBQTkQ", "text": "I have taken all three of our vehicles there and they always do a great job. They are very professional and their labor rate is reasonable.", "business_id": "fniL8DdDAQnFDxoSmuDBmg", "stars": 5, "date": "2014-05-01", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 2}, "user_id": "kYGPt0kFvkc1ItH3G_dT4w", "review_id": "38WriQ0aKitAoCsGpYGgPg", "text": "I started going to Dunn's Import in 1981 when I owned my first car, a Datsun 210. Almost 30 years later, Jeff Dunn is still taking care of my car, along with my 3 children's cars too! Every experience is a great one at Dunn's. The staff are friendly and professional, and know their stuff!!\nI would recommend Dunn's Import to anyone who has a foreign car. I trust him to service my own children's cars.I think that says it all!", "business_id": "O16EckCLtNoA49hewGht_w", "stars": 5, "date": "2011-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lhp2UhUr93R24dkaMySm_g", "review_id": "XhBtqx0YhtPoLZ8aCHblhQ", "text": "This is where I take my 5-series BMW for service and I have been very pleased.  Friendly, honest, and they take pride in their work.  I have recommended them to friends and business associates that have foreign luxury autos as that is their specialty.  \n\nI also bought a set of Nokian All-Season hybrid (winter/summer combination) tires from them two or three years ago on their recommendation and they are the best tires I've ever owned.  Highly recommend Dunn's.", "business_id": "O16EckCLtNoA49hewGht_w", "stars": 5, "date": "2014-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B86w8hyU1XFRQvaqgFZn-w", "review_id": "7OXBUFZBogjasKeholSnRA", "text": "Idiot general manager.. Complete hack that wants everyone to know he's buddies with the District Manager...plays good cop bad cop to threaten employees...over worked.  Under paid and under appreciated... Run from this place if you haven't yet..", "business_id": "ugGTR2EvJ0c_-TpMS1LSNw", "stars": 1, "date": "2015-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iRLPBwOuYmVAo-o4IUKtGQ", "review_id": "9Wj9A3nuuL-7HW7zsPetog", "text": "Recently bought a pre-owned 2009 Eos. Worked with Doug Marshall. He was quickly able to \"read\" us and introduced us to a model, which I,quite frankly, did not know existed. Within 48 hours, with Doug's description of the car and it's features, I owned one. He was the consummate salesperson, working out the details of the deal, getting the car ready, etc. During the final walk-through, I even commented, \" Boy, you guys think of everything.\" Doug brought a degree of pleasure back to the car-buying experience. I'd be happy to work with him again.", "business_id": "uyp8kpTXKfKXvAB8HdJSAA", "stars": 5, "date": "2013-05-01", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "prIJDb2RSRqk106KR0Cvug", "review_id": "sT5pjGWidNCujHnevAXBbw", "text": "Every experience with Zimbrick is painful.  Why did we buy from them? I ask myself that question all the time....", "business_id": "uyp8kpTXKfKXvAB8HdJSAA", "stars": 1, "date": "2015-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kkDrD2dXd0_52PwSER8tzg", "review_id": "WQSgP4hWHlwJ0_2j_hzJvQ", "text": "I've only been here once, but it came highly recommended. The automechanics are known for not inflating the prices too much. I booked for a Tuesday on the previous Thursday. They were done in a few hours.", "business_id": "Y_RXxkTlzXmir57sp2SvSA", "stars": 4, "date": "2011-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nqs6Avj7bfyavMUHO0XVBg", "review_id": "k06JjgBf5Tusk9PBfeJtOQ", "text": "I brought my car into Tom's after a little flash flood incident. They did a couple flushes and cleaned out my engine compartment. It was done on time and at a reasonable price. Next time I need something done, I'll return.\n\nThey can sometimes be spotty to reach over the phone, but they'll return your messages.", "business_id": "XStsiplxlx8Guqf-oV5LAw", "stars": 4, "date": "2011-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ranYilVFp1ED5N-iWFUtVw", "review_id": "NccKr8V3LrAXsxxs7pg1Mw", "text": "My mechanic of 30 years retired, so I went in search of a new shop. Went to Tom's based on a strong recommendation from good friends. Very happy with the work at Toms. They returned my call promptly, scheduled the work in a timely way, were easy to communicate with, straightforward and honest. Laid out the options for the work clearly, completed the work promptly. I'm confident that I've found my mechanic for the next 30 years!", "business_id": "XStsiplxlx8Guqf-oV5LAw", "stars": 5, "date": "2015-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GQNlXRCbopaqnhTty2Gcrg", "review_id": "EZspNhYZyuau1pcriIXawQ", "text": "Honest repair at a decent price.  I took my car in to have an electrical issue looked at  after a downpour.  Northside did a diagnostic on it for 45 minutes, but did not charge me. He pronounced it water intake due the enormous puddle I drove through, but I should return if the problem persisted.  It did not.  Thanks for letting me off easy, Jeff!", "business_id": "Slv6Y4kw_wzZjbiVERII5g", "stars": 4, "date": "2013-03-17", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "OCs7IE3ivzvaILJyfaIWSw", "review_id": "J4QwQnadr5YHXbzX0TarkA", "text": "Here's the lowdown:\n\nThey're like every other shop that makes you take it in the Chili Ring. They only did the bare minimum amount of work possible to align my vehicle. I know a lot about alignment, I would have done it myself if I had access to the equipment. They only adjusted the Toe-in, and reported back that the bolt which actuates the upper control arm eccentric was frozen so they couldn't make the adjustment to the caster angle. \n\nI then informed Jr. Pinhead that I have a Benzo-matic torch and can heat the bolt to loosen it, which he replied that his tech had use a torch on all the bolts. Funny thing is in the report from the equipment, all the angles were within spec that would have required heat to loosen the adjustment hardware, with the exception of the 'frozen' one.\n\nI used to work at a Firestone and I thought that lazy shit was just at my location. I was expecting this type of work from a local shop with a couple of random dopers.... not Firestone", "business_id": "Yn89vJYXcdprx9U_w1qmMw", "stars": 2, "date": "2010-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GPKpFunI60IWOC6ivb8x5A", "review_id": "G7UefMAtiX9-TXyAV-bWtA", "text": "Orders tires online.  They called to setup appt and said they'd let me know if there are an issues.  Drop wheels off a week later for appt.  Get a call later saying they can't get the tires.  Where was the call before I dropped of as promised!?!  Waste of my time.  Won't go back...", "business_id": "Yn89vJYXcdprx9U_w1qmMw", "stars": 1, "date": "2013-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5MoZgTuA-jc6Ua8gFmTfig", "review_id": "OeCobzIbAVL-f0TAF0tqLA", "text": "I brought my car in for an oil change and told them I had noticed that the front tires vibrated or shook at high speeds.  Left the car for them to check things out.  The called me to tell me I needed new tires, that there was uneven wear.  I told them to put them on and do a front end allignment.  When  I went to pick up the car, they told me it needed ball joints and tie rods, so they did not do the allignment (said it would have been a waste of money with the bad ball joints and tie rods).  When they discovered the problem with the tie rods and ball joints, they should have called me back.  Took it some place else to get a second opinion.  I was told Firestone should have never put new tires on the car when ball joints and tie rods were needed.  I will never go back to this Firestone.", "business_id": "Yn89vJYXcdprx9U_w1qmMw", "stars": 1, "date": "2013-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qpTR-5Ks2cj0tJnwR7UL6Q", "review_id": "vQc27Jzk9-2a-lLmMVxhFQ", "text": "I've always had great experiences at Chet's. They are friendly and informative. And the price is totally decent.", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 5, "date": "2012-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XnryGO0P6HFNXagIPPLLgQ", "review_id": "vjl61KQ5xvP9rcUOzfTx2Q", "text": "I've had my stalling car fixed and my tires rotated at Chet's. I've had nothing but good experiences there in the short time I've been going. The front desk is as friendly as all get out, and they make sure you know how much things are going to cost before they touch your car. It's clear they are there to help you and not rip you off. What great people!", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 5, "date": "2012-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8jz6S08cv-fqoHnh6vWfTw", "review_id": "7O_lHdcFKbMIl2vtAzMKUw", "text": "Great place. The price of tire rotation was HALF that of West Towne Monona Tire's quote. Also I accidentally forgot my wallet and had to run home to get it and pay after the car was serviced...they didn't hassle me about that at all. Large waiting room, very friendly staff. I would definitely use them again for future car needs.", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 5, "date": "2012-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sd4kstHD9zl4UIG47mSUCw", "review_id": "PADw79K2i_kow6MU8ouudA", "text": "I came here to return a UHAUL truck and that is all...but this place had an impression on me.  The staff and owner were very friendly and nice and seemed like genuinely nice people.  All the customers that walked through the door seemed to be on a name basis with the mechanics.  I left my cell phone in the UHAUL and they were very nice about retreiving it, even though they were very busy.  I think I'll be back here for an oil change.  I like all the old Pepsi and Coke ads and trinkets they have.", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 5, "date": "2013-05-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nbCirGvhw0TIf4HaNzwfVw", "review_id": "RkUpa4FFc5JdGlvcMI5sGw", "text": "Went once to get the oil changed there. The people are really friendly.  I waited in the waiting room until it was done (about an hour with other customers).  They gave me the price with a coupon even though I didn't know there was one.  They didn't try to up-sell me on anything.  Overall, I'd go back.", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 4, "date": "2013-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QeeDxNtb5mauXRfmE3e2rg", "review_id": "32mK8zIUYrt5-FeggQYcMA", "text": "Ordering and having installed 4 new tires was the way to go with Chet's!  I had chided myself for doing so, when during the same visit, they said that I needed a new battery.  I thought \"Here we go again. Just I expected.\"  But they showed me what they could of the battery and I couldn't argue with them.  (How was it possible that my car was even running w/ that old battery?!?!?!?)  I had no inclination that they were going to swindle me, because they weren't.  They were solely focus on making sure that I left a happy customer with a 17-year old car nearing 250,000 miles.", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 5, "date": "2014-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nxJHwfQo83APOpji8vdUFg", "review_id": "Em0ld_frqauKKg7UM3bHiA", "text": "Bring your business here and you will not have to worry about taking it anywhere else. These guys are trustworthy and responsible about what they do. Probably the only place that will try to find you discounts that apply to you at the spot.", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 5, "date": "2014-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V8509oy7QEAoD194zqugDA", "review_id": "ZZQZybWqU8SgyBvPi6ja0A", "text": "I guess I'm the oddball out... I was not impressed and avoid this place now.  I've been here on two particular experiences and left annoyed after one of them and it took a few weeks to discover their error on the other problem but you can bet I was good and mad when I found it.\n\nThe first time I went here was to have good old Wisconsin license plate screws removed.  Just walked in, paid cash, had it done.  I put temp tags on the car until the plates came to put on and went to put the plates on and discovered the screw holes were instead stripped out.  I could have done that at home myself instead of paying $40.  Obviously, now I can't put plates on my car where they belong.  I would have just broken the old plate off if I wasn't intending to reuse the screw holes instead of paying $40.\n\nSecond time they just patronized me and seemingly implied I was dumb when explaining the problem I was having with my car.  I may be female, but I was there when the problems were happening.  It would have been nice if they listened carefully and didn't look at me like a deer in the headlights.  \n\nNo thanks, I'll shop around for places that do it right.", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 2, "date": "2014-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "xXG_VK0weNblWwSO1R9s2w", "review_id": "hDdrBicucVM9FCTWBgYlLw", "text": "I am from Columbus Ohio and had stopped in Madison for the night. I was headed to Minneapolis the next day but on the way to Madison I realized I thought I had a bad wheel bearing. I was in my hotel looking for mechanics and i came across this place. As a woman, it is incredibly difficult to find a mechanic who will be honest with you. More often than not I have had men tell me there are unicorns in my exhaust and the like. Obviously not that, but just selling me things I didn't need. I came into this place and Eric was very friendly and drove my car to diagnose it. He was very straight up and very nice. They got the job done in a couple of hours and I was on my way. I could not write more incredibly nice things about this place. You can tell people have taken their cars here for years for obvious reasons. If you live in Madison or happen to be here overnight with a car issue like I was, I highly recommend this place as this might be my only review of a mechanic ever.", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 5, "date": "2015-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 7, "cool": 3}, "user_id": "Ywy7mqBol1KIMVVgtEU_TQ", "review_id": "yPcereafHMo4nV0VIkZw8g", "text": "I just moved to Madison from Cincinnati and found Chet's here in Yelp. I chose them for their business hours. I do alot of highway driving for work.\n\nChet's is exactly what I want out of a car care center. \nThey asked questions around how I want to use my car, how long I want to keep it etc. Oil change was quick and affordable. The shuttle service is obviously well staffed as I was asked if I needed a ride twice!\n\nThey quoted me an extremely reasonable price for fuel injection cleaning and new spark plugs and agreed that I do Not need it right now.\nNo pressure. They checked everything and never once tried to upsell.\nI will treat them as my partner mechanic.\nThankyou Chet's for helping a Lady feel secure in car care in a new place.", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 5, "date": "2015-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W0q0-VOTmPx4lYtpxI84IQ", "review_id": "a8IDQeA9i4FUhQ2Uqw7rkA", "text": "The folks at Chet's are great.  They genuinely care about their customers and making sure your car is safe and working optimally.  Once you drop off your car they'll drive you wherever you need to go, and pick you up when your vehicle is ready.  Prices are reasonable and they offer a AAA discount.  They also have free wi-fi, soda, coffee and hot cocoa.", "business_id": "cbodGg8dt0gZpdtrQBgduQ", "stars": 4, "date": "2015-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "aayzStUot2Mkzumx1TuN4A", "review_id": "NoMMgaaUDu6vKX1Ncshktw", "text": "Extremely poor service and piss poor attitude from employees - they attacked a personal friend of mine on Facebook when she raised concerns on her personal page about the quality of service and the price.  Like Paula P. she went in for one thing and when she left she ended up having something else wrong with her car.  I would suggest staying as far away from Seversin's as possible.  UPDATE: I spoke with the owner today and he indicated he would rectify the issue with his employee.", "business_id": "IFzagko8Y344ajAhWOxnUw", "stars": 1, "date": "2012-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "J2eldezpGyQTK3zuB8IpOw", "review_id": "IMJn1jH-ZpXHky4p1sndFg", "text": "Had to have my GTI towed here on a Sunday afternoon, Dave called me at 7:30 Monday morning to see what happened and I had a new water pump and timing belt in by 5pm. Honest, quick, fair prices, no annoying upsells. If you drive a VW, you should be taking it here.", "business_id": "IlE4UouTsBEGiJ_bNrb5ug", "stars": 5, "date": "2011-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gS2LzYd97r-X_j9bVJItFg", "review_id": "k8hSIHo4T7tUsQC4N0fKOw", "text": "Very impressed with Sam and Dave at Courtesy Auto.  Very professional and timely with the replacement of new rear brakes and rotors on my 2006 VW Passat.  Would highly recommend as their pricing was very reasonable.  Thanks guys.", "business_id": "IlE4UouTsBEGiJ_bNrb5ug", "stars": 5, "date": "2012-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tOS1MVVagkPxR-fiodhjXw", "review_id": "s5s4NMbEWdeIJY9ghfon1A", "text": "Courtesy Auto is THE only place you should take your VW.  They do outstanding work and are super honest.  I have used them exclusively for almost 80k miles worth of service and couldn't be happier.  They know these cars in and out and won't sell you something you don't need.  Once I asked Dave if I needed front brakes and he said - I am betting your light will come on close to your next service so you probably have 7500 miles left on them.  The light came on at 7800 miles.  If you want to support a great shop - head over to Courtesy Auto.", "business_id": "IlE4UouTsBEGiJ_bNrb5ug", "stars": 5, "date": "2014-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "zijSlqmqFSPNK3j2XIheIw", "review_id": "wbHrWB3tcIft0n5Opr3iNA", "text": "I bought 2 tires and new wiper blades. If I knew I needed other work done, I would've scheduled a future appointment. The staff was going to look over my vehicle but didn't tell me of anything either way with my car.", "business_id": "zHdt_KW2QqgJJ9bLmtShdQ", "stars": 4, "date": "2015-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WcTiborQC0a2O83P1hMhyA", "review_id": "sUKys76Uymza8i1nGpbC0Q", "text": "Had a broken exhaust pipe, told me I needed to replace my catalytic converter as well as the broken pipe for $650.  I may be a woman with a limited knowledge of cars but I wasn't born yesterday.  Went to another shop, they charged me a FRACTION of Exhaust Pros quote.  They did NOT replace the converter", "business_id": "50SekjFjmwgN-lGXDu48qw", "stars": 1, "date": "2013-04-16", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 0}, "user_id": "hBt-kSMd4Z7C-sxcG1djGw", "review_id": "qPjL-L8ZkX3p_r-3nr5YHg", "text": "They said I needed a timing belt replaced when Honda Civics from 2006 don't have a timing belt.", "business_id": "8E1EzFMYtuJdrOfgft_nMQ", "stars": 1, "date": "2011-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "WTU4O_gfkbsIHoLNBoEAfQ", "review_id": "8PZBFiGodXfR5G5ovju3kw", "text": "Happy to echo the sentiments here - good, honest shop with fair prices.\n\nNo up-sell here - I've actually had them tell me I didn't need work after another shop tried to tell me I did.  Keeps me coming back, for sure.\n\nAwesome building, and historic - apparently, the city of Monona was founded there! http://www.mymonona.com/pages/parks_recreation/parks_open_space/details.php/31/parks_open_space/schluter+beach/ \n\nIf you have time, grab an ice cream at the bait shop a couple of doors down, and wander over to the lake.", "business_id": "xod-YOn69KMhUHBkd6boOQ", "stars": 5, "date": "2013-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Vgg4i0z3P0tfA2ahPXly2Q", "review_id": "-65jhfuVO52ZRKIQ1jzmnw", "text": "Great prices! Speedy service! Honest dudes! Great work done on my car!", "business_id": "kZiRL1dkGowCcL7nM86OYg", "stars": 4, "date": "2011-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oXUNp_ozKepg1Ni9Tp-HXA", "review_id": "84nhPtC_2TH9mz4YK5cnUA", "text": "Gates Auto on the East side is totally spectacular! I can't say enough! I've worked with Colleen, Andrea & Pete and each of them have displayed stellar customer service. I always feel confident leaving my car in their care. The major hail storm back in 2006 left my first ever, brand new car severely pummeled. All of the employees at Gates did a wonderful job! 7 years later, in 2013, when my car roof started leaking, they stood behind their original work and repaired the issues free of charge. What's more, they have always provided me with a loaner vehicle and they make each step of the repair process easy. I will always go back to Gates with any auto body needs. Every time.", "business_id": "L3dTz2TQIyov5NbPdJLkSA", "stars": 5, "date": "2014-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OlchdfJ1opjbZIyjD-DIXg", "review_id": "ruU8xMtcEkZ2G_jB0fyORw", "text": "Horrible place! Bad service! They make promises they can not keep. I dropped of my car and explained to them I needed my car by a certain date. I gave them 4 full business days to fix my car. They promised to call me and keep me updated and never did! I had to be the one constant calling them to get an update. I called my insurance company to let them know they are bad for business! They don't even deserve a 1 star!", "business_id": "L3dTz2TQIyov5NbPdJLkSA", "stars": 1, "date": "2015-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wJUSTYjsGMQ9laVxtrg_QQ", "review_id": "d3N2hQ2ldQVQewquMtVFkA", "text": "These guys did a great job, fast, and at a fair price. This is where I will take my cars from now on.", "business_id": "G_NB9evo2fn3_Lgfpap6iw", "stars": 5, "date": "2012-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 7, "cool": 0}, "user_id": "GnIyqTzCtfcOXW7fUK8Vjw", "review_id": "PEqbAPpqs6PA1hALBuYfwA", "text": "Got my rear bumper 'fixed' there and a couple weeks after I got the car back, I noticed that the paint was cracked and chipping in four different places across the bumper.  They also forgot to put the fuel tank rubber seal back after fixing fender.  The lady looked at the bumper and said that someone probably hit my bumper and they don't cover chips caused by outside sources.  There was absolutely no sign of bumper flexing or denting and regardless, the paint was chipping way too much to have been properly done.  She also said I couldn't verify they were at fault for losing the rubber seal so it wasn't their problem.  And then she just went back inside.  Save yourself of dealing with a crappy maaco-grade paint job and a good-for-nothing \"lifetime quality guarantee\" and invest in a quality shop.  \nTook my other car to gallo-miller and it was much, much better quality of workmanship and customer service.", "business_id": "4jlqFH3cZsgRdWxZ6kwwvg", "stars": 1, "date": "2013-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qziLHkcwu3DjPoMTrsZhCg", "review_id": "ALZ_QOuKnhM3K_wOkhYj7g", "text": "The two guys who run this shop have served my family for over 10 years. At every step, they have proven themselves honest and trustworthy - always making suggestions that were in our best interests. They are really experts at what they do - so abandon the dealer and take your car to Pro-Tech. You will get the straight scoop from the actual mechanic that will be doing the work! You are likely to become a long-term customer as well. We've since moved out of the area, but still recommend them to our friends in C-U.", "business_id": "P_X0pRArVxBjCihppLmHJg", "stars": 5, "date": "2014-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gadhwTVlP9HWHzvK-cwYbw", "review_id": "ewBO4EL7wDUXkLD5sZIMyQ", "text": "The best in town for tire services!  They have repaired tires for me twice and also put on new tires.  They are always very friendly, honest and low-key, not pushy salespeople at all.  The work was great and done very quickly.  I feel like I can trust their input.\n\nThey most recently repaired a tire for me that a larger chain store in town insisted was beyond repair.  I had gone to the larger store because it was Sunday and Urbana Tire was closed.  Through a series of events, it became clear that they were dishonest and only interested in selling tires at all costs, so I opted to wait to visit Urbana Tire on Monday when they opened.  They were perplexed by the diagnosis by the other shop of needing a new tire when the only issue was a screw about a half an inch inch long.  They fixed it quickly and put on 2 new tires, taking the time to explain my options and not at all pushing for the top of the line.\n\nAs good as it gets!! :-)", "business_id": "XL5MmKKzob_TIiRW_GnhAA", "stars": 5, "date": "2014-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3mEsVTy3VEDI3_f9bNTBVQ", "review_id": "ZJO8Hr_sR3mTSp_aRxQiYw", "text": "Urbana True Tires was recommended to me by a family member due to their personal attention to detail, fair price, and honest approach to the business. They were spot on! Rich, Ryan and the staff not only helped me fix my car, but when I had follow-up questions and concerns, they readily helped answer my questions and even made adjustments and unrelated follow-up repairs free of charge. I would gladly recommend them for anyone looking for honest, fair car repair. Unlike so many other auto repair businesses, this place is reputable, fair, and honest. Highly recommended!", "business_id": "XL5MmKKzob_TIiRW_GnhAA", "stars": 5, "date": "2015-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Hd7KPlC4ZUM-4rOsigJi0Q", "review_id": "mG4prHjOr6bevs2yT_pCPg", "text": "I used to go to Peter B.s which I was very happy with as far as work and prices went but it is so busy you usually are looking at a 2 week wait for them to be able to look at your car. As a single car household we can't wait 2 weeks. So I tried Fairfield Automotive and have been there twice. The first time my new belts just needed to be adjusted and he charged me $20 (!!!). This last time was more complicated with an eroded exhaust pipe but a fair price and super friendly and knowledgeable service. I strongly recommend them.", "business_id": "umWStNDUdE1QtbnPjPCfwg", "stars": 5, "date": "2009-05-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7zSppEZd2C6ASpNeBebxAA", "review_id": "cQ-XroLBXbOr2U9fHlwRfQ", "text": "For over ten years, Bob at Meineke has been keeping the cars in our family in tip - top shape. I never used to like going to car maintenance facilities. I felt venerable. I felt as if I was submitting to Jiffy Lube's bullshit schemes to have me replace a filter I didn't need or add on the premium package.", "business_id": "vXxsDHzRvQEhK6YbNs3Nww", "stars": 5, "date": "2007-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DJbX0XH6Kn3Nm5uo58lu9A", "review_id": "FuN5briussu-aUtsMmez_A", "text": "I went here today because my car needed an oil change.. badly. I'd been putting it off because I just moved here in August (am I allowed to say \"just\" still?) and wasn't sure how to go about finding a reliable place. I chose Meineke from the five or so car places I had coupons for by looking at the reviews on yelp. For 19.95 (or a little over $22 including tax) with my coupon (basic oil change is usually 24.95) I had my oil/filter changed and the oil disposed of properly, fluids topped off, and a basic belts/tires overall inspection. The men there were so friendly and speedy! They didn't give me the runaround.. just my oil changed with a smile. I would recommend them to anybody and will be back! \nAlso, from drive up to drive away it took maybe.. 30 minutes even though there were several other cars in the garage (I went at 2pm on a Tuesday afternoon).", "business_id": "vXxsDHzRvQEhK6YbNs3Nww", "stars": 4, "date": "2009-04-07", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "pqEyHc7q88jo6M0D0VqdFQ", "review_id": "jMV-LUTkXkyg79JMqEhPGQ", "text": "SEWWWWWWWWWEEEEEEEEEEEEEEEEEEEEEEEE.......\n\nI grew up coming to this Farm and Fleet. I still buy Keys coveralls from this place for under thirty bucks. Work n Sport boots that last forever... and well... anything I could ever need. They sell anything from horse-bits, saddles, tires, carburetors, Red Rider BB guns, boots, bikes, sledgehammers, chainsaws, any carpentry or automotive tool, heavy bags, horse food, mudflaps with stripper silhouettes, stereo equip...etc...etc... they have a full service auto department that has good deals on services too so you can shop around and play with the power tool displays or make things out of the pvc fittings while you're waiting. Man, I love this place.", "business_id": "vA8ed8BFvQxz4HFt8cHd9Q", "stars": 5, "date": "2009-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "opV7QWbvhzooX5_0rbCkiw", "review_id": "CaitrymwYlQO4MM9YYYv0A", "text": "Prices are competitive with big box stores and the employees are much friendlier.\nI buy my garden supplies, tires, oil changes and hardware here.\n\nIf you need it, you can probably find it here.", "business_id": "vA8ed8BFvQxz4HFt8cHd9Q", "stars": 5, "date": "2010-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "K9uvy5T1ElR96Hcwz5Yy8g", "review_id": "XK9h50nOyVWxR5dUFEgYJg", "text": "Items I have found at Farm and Fleet (in no particular order) include but are not limited to: cracked corn, PVC fittings, a fan, candy, chicken waterers, oil filters for my 1992 Toyota, several hole saws, winter hats, day-old chicks, and did I say candy? This place is classic. Don't miss the festival days in the spring: a great time to see a man train a horse.", "business_id": "vA8ed8BFvQxz4HFt8cHd9Q", "stars": 3, "date": "2011-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G-eMHCePQeehpzoEDnoC0w", "review_id": "gPkG-tmEUzT55n7Z6teNSg", "text": "I was in need of an oil change and some other minor maintenance on my car, so I followed my WWMFDD?* rule and left my car in the hands of the service center team at Farm & Fleet. I already liked this place for garden and painting supplies, but after the friendly service I received at the service center, I'll be going here for my routine car maintenance from now on, too. Prices were more than reasonable, customer service was friendly and helpful, and they didn't try to push any further services (and costs) down my throat. \n\nPlus, they're open on Sundays. And I saw baby chickens there once. Peep.\n\n*(What Would My Farmer Dad Do?)", "business_id": "vA8ed8BFvQxz4HFt8cHd9Q", "stars": 4, "date": "2013-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GZ3-_JOf13K-Vh9LFrtfOw", "review_id": "hyWyknV6O1y8uycP55nxKw", "text": "Peter is the ONLY person my wife and I have trusted for auto repairs since the early 80s, when he was working out of the garage of his home. His current shop in Urbana is so pristine that you could eat breakfast off his shop floor.\n\nPeter knows cars obscenely well. And he's uncompromisingly honest. On many occasions he has told us there's a potentially expensive problem with our car, but \"We can wait and check it out in a few months.\" And a few months later, he would say, \"It's still OK, we'll just keep an eye on it.\" And we would end up getting rid of the car before we ever had to have the work done. \n\nA number of people, I have learned, bring their cars to Peter from Chicago and even St. Louis, having moved there from C-U, because they trust no one else. He specializes in higher-end vehicles, but is willing to work even on our ancient minivans.\n\nWe never purchase a used car (the only kind we buy) without having Peter do a buyer's check. Once I drove a potential purchase for him to check it out. It was summer, and the large shop door was open. He apparently heard me coming, because before I could get out of the car he was there, saying, \"Take it back. You don't want this vehicle!\" Then he explained. He had me get out of the car, with the engine running, and said, \"Do you hear this very faint sound. . . ?\" (and he described what I was supposed to listen for). \"That's such-and-such [I'm ignorant about cars, so I don't remember what it was], and that means that pretty soon this car is going to need very expensive work.\" He could have charged me $85 for a buyer's check (it's more now), but instead he saved me money and a lot of time.\n\nI trust Peter absolutely. Having him as our mechanic is one of the aspects of residing in Urbana, both my wife and I agree, that adds significantly to the quality of life here.\n\nIn fact, Peter B's is so classy that on a number of occasions I have called up Cindy, the office manager, and asked her about my car, and she has provided highly useful/ technical advice. A VERY amazing place!", "business_id": "bshpPwiOvUdr_m9jFfsWTA", "stars": 5, "date": "2012-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "19MN_BLvpQe-isX7oPWypg", "review_id": "5OAhAhOj__CP0eu8Uh4X8A", "text": "I've been going to Long's Garage for about 5 years now and have been very happy with their service.  They've always been honest with me.  The prices are comparable to other shops. The repairs are done quickly and professionally.  My truck is 16 years old, yet it drives like it's only a few years old thanks to Long's. \n\nThe only criticism I would have would be if you need something done with a truck topper.  I didn't know what to do with the rubber seal that was falling off.  Their body work person offered to epoxy it, but that didn't stay on very long.  I didn't know at the time that I could get a new seal at Truck Trends in Champaign.\n \nSomething that really impressed me though was how honest their detail person was about the state of the paint on my truck.  I wasn't sure how salvageable it was, and he was honest in telling me that my paint was too thin to try polish on (would rub the last of the paint off), but he did give me some recommendations on how to keep what paint I have left on the truck for years to come.  I followed the recommendations and get compliments on how good my truck looks all the time.  What impressed me was that the detail person didn't try to convince me of paying him for things that might not have helped or made my paint situation worse.", "business_id": "BH5ItzgUlz0GoYJxknV3Zg", "stars": 5, "date": "2011-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t7MChsAqXW1AEzPvpD6PBQ", "review_id": "_cyXJLCd03MP2sY07ZpoFQ", "text": "I called for an estimate for the passenger side mirror for my truck, spoke to Rudy. He was very friendly and asked to call me back. He called me back within a few minutes with an estimate for the mirror and installation. I came back a few days later to install the mirror and he charged me less than estimated. He said it was easier to install than he thought. Very honest shop.", "business_id": "BH5ItzgUlz0GoYJxknV3Zg", "stars": 5, "date": "2014-05-06", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "NGX1PZwHET_oQOT7vkkxag", "review_id": "it8TuH9TVFYkeKPmoEdq8g", "text": "This is the only place in town to go for major work on many foreign cars. Its either Rick's on Springfield or drive to B M'F'n Naperville.  Labor is $60/hour, but if I ran the only place in town certified to handle goofy obscure cars, I wouldn't be Wal-Marty about it either. \n\nRick (I assume it was Rick) and his people are less than super coffee-shop friendly fuzzy and warm, but they are mechanics, not Red Lobster hostesses.\n\nSo, the work is quality and they do not gouge you.  If you have the option of shopping around, or to have other places handle your 'lighter' maintenance issues (like brakes, oil changes, suspension work, etc.) you probably should look into it if you want to save some scrill. You could do much worse than Rick's.", "business_id": "-StiqyQX9YxKb6VYp2DRfg", "stars": 3, "date": "2011-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "1uljPzFtcjupFvXpvLNqcg", "review_id": "-IXExxlanlN9SNHF0sF_4w", "text": "Janus - May 2012\nI have FINALLY found someone I can trust to work on my 2006 Prius and 1996 Town & Country van!  Having been overcharged for years by O'Brian's for maintainence of both cars (and last fall given a faulty brake job by Midas), I was ready to pay whatever Rick's charged me to get the repairs done RIGHT the first time!  (Also, I didn't have to risk my life in the hands of O'Brian's \"courtesy drivers\" who drive with one hand -- sometimes one FINGER -- on the wheel while talking on the phone back to O'Brian's and try to write down addresses and phone numbers of their pick-up victims.)  I can WALK to Rick's from my downtown Champaign home.  But the best thing about Rick's is that they know what they're doing without me having to tell them.  When I dropped off the Prius the night before it's service appointment, my neighbor followed me over and told me that one of my brake lights was out (how would I know??!!).  I stopped by Rick's on my way to work at 9 AM the next morning, in my old beaten up van, to tell them to please add that light to the list of things they were to do -- and guess what?  Not only had they found and fixed it, they were DONE with the Prius!  (It took O'Brian's all day to replace four spark plugs!)  I was so pleased with the low bill that I left my van and took the Prius to work that day.  I told them no hurry, but that O'Brian's had quoted me a $2,000 fee to fix the AC's slow leak, and I wanted Rick's to see if THEY could give me a better price.  A week later they called (twice, because I failed to call them back after the first message) to get my approval to re-fix the brakes (Midas' \"fix\" had left it without fluid, DUH), and replace the rusted out straps about to drop the gas tank onto the street.  The next day it was all done.  The AC problem was simple:  they refilled the freon and, when it held for an hour, added a sealant.  Brilliant!  So now I have AC, brakes, and a gas tank that will stay in the van, all for about $600.  I'm thrilled.  After 40 years of having cars fixed in this town, and being overcharged or disappointed, or having to go back again and again, I have found my men!  James worked on the van.  Cudos, James.  No longer do I dread a MAINT REQRD light on the dashboard.  These guys know their stuff and do it quickly, efficiently, and competently.  They're a rare find these days.", "business_id": "-StiqyQX9YxKb6VYp2DRfg", "stars": 5, "date": "2012-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kmQdb_Edd-DjKnJIavQcjA", "review_id": "EMQDui8M9DTy23orQYhUJQ", "text": "My first (and last) experience with Rick's was an interesting experience.  I am new to Champaign and called to schedule my BMW for repair to what I believed was a caliper problem.  I was told to have my tires checked first at the place where I bought them.  I explained that wasn't possible since I had moved from out of state and again repeated what I thought the problem was (I knew it was not tire related). I was again told to have my tires checked, but they did not do that there.  If there was nothing wrong, I could call him back.  Incredulous!!! Not only was he not \"super coffee-shop\" friendly\" as described by Tim J., but I got the impression he didn't want to be bothered!  I went somewhere else that promptly got my vehicle in ... and it was a stuck caliper!!!!  Since it was in for repairs, I also had them do some other maintenance work done - THEY  were great!  Rick's Automotive Service LOST OUT!!!", "business_id": "-StiqyQX9YxKb6VYp2DRfg", "stars": 1, "date": "2013-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xJZlN71GpCs_lEboEeIJWg", "review_id": "ifLNUtAJvAekiuNQwrm1Qg", "text": "My car is a Range Rover. Although the price is a little bit high, they are the best. They know my car and can solve the problem exactly. Best in town for Europe cars.", "business_id": "-StiqyQX9YxKb6VYp2DRfg", "stars": 5, "date": "2015-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "0nTPhIUU7tjD2dc9JO5uZQ", "review_id": "2yiou3evGSWIcy0q3BpKnA", "text": "I started coming here after the dealer said I needed $600+ in repairs, and I called around for other estimates, and they were 40% cheaper. Of course, there are others who can do work for similar rates, but the deciding factor was that Rob, who is usually at the front desk, was apparently the only guy in town who could handle a phone call in a useful and professional way. I know thats a fairly small factor to make a decision on, but I don't regret it, since its been representative of how they've been to me since.\n\nAlso, if I bring the car in for an oil change or other regular maintenance, and ask for them to check some potential problem out, and it just turns out to be something trivial that takes a few seconds to fix, they don't use that as an excuse to charge a half-hour of shop time. Which I appreciate.", "business_id": "UvQCdPSXUdnmzbDEtUaoXQ", "stars": 5, "date": "2009-03-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WQUaC-8zxLg3dphaLu9cYA", "review_id": "QiHgGpBzwTLSiG1SJBYzqA", "text": "I had a problem with the muffler and i took my car first in the morning. The mechanics were not there yet so i needed to leave my car. They called me 3hrs later telling me i need to change my converter in order to fix my muffler and gave me an estimate of 2k. I am pretty sure they were trying to take advantage of female customer who seems to be not knowledgeable in car system. I wouldn't go to this shop anymore.", "business_id": "UvQCdPSXUdnmzbDEtUaoXQ", "stars": 1, "date": "2015-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "N4JX0lJ92GoO87qhLSipOA", "review_id": "eFBdaNv8jscA8qs6r9V4tg", "text": "These guys are awesome. I had a strong recommendation from a friend to check them out vs going to my usual overestimated tatmans. And they delivered.\n\nWhen going in for my estimate they were very thorough with showing me what I was going to be paying for and what the options were.\n\nI made an appointment, dropped it off and then the same day the car was as good as new.\n\nThey may come off a bit gruff but these guys are honest, know what they are doing and know what it means to put in the work and get results. I highly recommend them.", "business_id": "lPySbFYBYXW1zepKUV4euQ", "stars": 5, "date": "2014-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RUCiKHuBvVMF88G56zWkuA", "review_id": "7oKsEy_mvt8uqqiRnQz2lw", "text": "Charlie at Central IL Auto Body was very courteous and thorough during my estimate. He was much more hands-on with my bumper than any of the other 4 places I went to get estimates. He explained every last detail of my repair on a computer that showed all the repairs they were going to make. The price on the estimate itself was competitive with other shops in the area but not the lowest. However, the initial interactions I had with Charlie made me feel comfortable with going to this shop despite not spending the absolute lowest price possible. \n\nHowever, once I had put my car in for repairs, I found the customer service of this office to be incredibly lacking. I turned my car in on a Monday morning and was told that it would be done on Tuesday near the end of the day. After receiving no calls from them, I called their office late Tuesday afternoon and was told it would take another day. The same thing happened on Wednesday, and my car was finally done on Thursday afternoon. At no point did I ever receive a call with an update on my car's progress. I had to call at every step of the way and extract the information from them myself. I will take them at their word and assume that these delays were legitimate. But the fact that they were not forthcoming with these delays does leave some shadow of a doubt as to whether or not they were due to circumstances beyond the shop's control.\n\nAs for the repairs themselves, the bumper looks good as new and the paint job matched perfectly. Overall, a 3-day repair is not too far outside the normal time window for service from other shops in the area. A big plus was that my car was washed and vacuumed on the inside when it was returned to me. This was a much welcomed amenity given that my car had been excessively dirtied thanks to the winter weather.\n\nIt is currently one month after the repairs have been completed and I have no complaints about the work done on my car whatsoever. However, I emphasize again that I find it incredibly unprofessional and discourteous that I was not informed of the changes in the schedule of my car repair. I feel that repair shops should be incredibly forthcoming with this information given that people who have their car in a shop have to make alternative transportation arrangements and oftentimes have to rearrange their daily routines such as work. \n\nOverall, great work, competitive pricing, but on the back end be prepared to be a little more proactive in getting the needed information. To be quite frank it seems like this is a top notch shop, but I would rate my particular interaction with them as slightly less reflective of that rating.", "business_id": "lPySbFYBYXW1zepKUV4euQ", "stars": 4, "date": "2015-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G73eGQJg3F_gvDYnlgWVMw", "review_id": "uCKCYlL422NYpvqbbGgI6g", "text": "The service dept is excellent... Too bad my car was not.", "business_id": "12Cz9K4vwj1cSy2r0sYVQA", "stars": 4, "date": "2007-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2SSHbXmy3K3BzBhojhNUAA", "review_id": "zuxxJ2dVljOJki-ZbEtrKA", "text": "Excellent service.  Had a concern with the products i purchased, but the manager took ownership and helped me get everything straightened out.   Friendly staff.", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 4, "date": "2010-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SgYDVxr5nVRoe_XpqhGN9A", "review_id": "ozmiBnl29ZgbdxbIdLHNHA", "text": "I too had the Groupon. I think most of us are more inclined to write a bad review than taking the time to write good reviews so I am going to change that for me today ( it is a Lent thing but I hope it will carry on).  That being said this is why I give my 5 stars to Virginia Auto. Being a single women is always a bit unverving taking my car in repairs.  After dropping off my car the women at the desk called me to explain things they found on my car. First thing she told me was the good things about the car which I think is very important like tire wear looked good etc so I could quit holding my breath. Then she went into things that may be needed but could wait and then she sugested having my headlamp covers cleared to help with night diving which I did and it was the best money I could of spent.  I found the people answered the phone right away when I called to make the appointment and everyone was very polite and friendly. Definately a find for a single women and I won't  tell my age but driving at night is easier with shiney headlights!", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 5, "date": "2011-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z9BH9OxWOQBqholAAaHLvw", "review_id": "ysuQgpaT2t0Km_XBbnZIMA", "text": "This is the first review I am writing for Yelp and I am inspired to do so because of my great experience at Virginia Auto Service. \n(Although I didn't know it) My engine belt broke on my way to work while driving on the highway. I managed to get safely to work and I ended up calling Virginia Auto Service upon the recommendation of a friend. Within minutes of talking to Matt he had provided an initial assessment (which turned out to be correct) and advised me how to proceed. He encouraged me to get the car towed and was VERY clear that he would rather I bring my car to another shop if it was less expensive for me and/or safer. How refreshing! He also took the time to look at a similar car in his lot so as to better inform me of possible scenarios.... all before I had committed to utilizing his services. \nI towed it to Virginia Auto Service (thanks for instructing me to contact my insurance company- towing was free) where it was assessed, fixed, cleaned and ready in hours. \nI really really felt like Matt wanted to educate me about my car and ensure my safety before getting my business. \nI cannot compare their prices to another shop's but I would rather have caring, honest and thorough mechanics than a cheap bill. \nI fully recommend", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 5, "date": "2013-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nCu2AQILfu5uLE7Dk4m4Vg", "review_id": "LZjQUS-Hvny3tMO37VNkHQ", "text": "have been taking my vehicles here for a few years since we moved downtown. up front: they AREN'T the cheapest but they go over and above normal places, don't treat you like an idiot and tend to fix small things for free. in the end, you do end up getting what you pay for. my beat up old car pretty much still exists due to them, and my wifes newer car gets taken care of so as to last us as long as possible. \n\nplus its right by Band-Aids so you can drop your car off and 'wait in the lobby' at the gentlemans club, wink wink nudge nudge", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 5, "date": "2014-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "OL-OR_j5QE_7tpo6Yh053g", "review_id": "cn1jV_-FuGBBisPIVBB44Q", "text": "*Updated*\n\nIn the interest of transparency, I'm including my original review and a follow-up.  But here's the summary: they're a good, dependable local business that has earned their strong reviews. \n\nOriginal review: \n\"My car died on a Sunday. I had AAA come out and do a diagnostic.  I was hoping it was just a battery problem, and they could fix it and be done with it. The AAA guy worked with my car for almost an hour, but the starter was shot, so I had to have it towed.  I decided to have it towed to this shop because it's around the corner from my house, I like to support local businesses, and all the reviews were so positive.  Robert called me early in the morning and he was initially very friendly.  He told me they would do a diagnostic test for $64.99 and call me back.  I declined the test (because two different AAA guys already told me the problem), and his response was deeply patronizing: \"Wow, well, if you feel confident that *you* know the problem, sure I can give you a quote for the starter.\"  His quote was $500.  I called a couple other shops, including my trusted mechanic in Tempe, who all quoted me around $300.  I called back and asked if $500 was the best they could do.  Robert offered me a different starter (\"it's decent, and it just has a 1 year warranty\") for $414.  I understand that all shops have different prices, but I am disappointed. I won't be giving them my business.\"\n\nUpdate:\nShortly after I posted the review, the owner of the shop (Matt) called to discuss the situation. We chatted, he took down some information, and called me back later in the day.  We talked for a long time about labor costs, parts and vendors, how shops arrive at estimates, etc. He was professional and courteous. I haven't yet decided whether I will ask them to fix my car; I'm updating the review mostly because I agree with Matt's replies to other comments below -- that price quotes alone aren't worthy of bad reviews and that if we have a mechanic we like, we should stick with them.  I left a bad review because I didn't like the way Robert spoke to me *and* because the price quote was dramatically different than other places. I felt exploited because I was vulnerable -- my car was towed there and I was stuck. (I couldn't go to my mechanic because he was too far away and I was running between my two jobs.)  I'm fixing it because Matt has a lot of integrity as a shop owner and I'm grateful he took the time to research the situation and offer me a better solution.  In yelp-speak, everything is A-OK, and I would recommend them to others.", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 3, "date": "2015-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ko8VZygoMdKmw5OKf2HmHA", "review_id": "hON2krqwND1q41T_tHY6fA", "text": "I was tired of going to the dealer for my truck, which is out of warranty coverage and tried Virginia Auto on the recommendation of one of my business partners. My truck had been shuddering and shaking badly at certain RPMs & speeds. The dealer diagnosed the problem as my catalytic convertor and replaced it. After driving my truck for a day, I could tell the problem was not fixed and even felt worse.\n\nRather than go back to the dealer, I thought it was a good time to sever ties and try some place new. They had to keep my truck a few days to fully diagnose and repair the issue and actually took the time to drive the truck, first to recreate the problem, then to be sure it was fixed. Doesn't seem like a big deal, but the dealer clearly did not do this. They kept me updated throughout the process (what tests they were running, possible causes and next steps), offered me rides to and from the shop and a loaner car when they had to keep my truck a few days. Turned out to be a spark plug issue, adding to my frustration with the dealer, as the technician there had even written, \"probable spark plug issue\" on my receipt/work order, yet failed to fix it. However, their lack of follow through and poor customer service forced me to find these guys, who I feel like I can trust, so all is good in the end.\n\nI went into the situation a little standoffish because I knew my fix would be expensive, but I left feeling good about the service I received. They also warranty their work, I believe it's 2 years/24,000 miles? I've been to other shops that will fix your car for cheap and do a quick-fix repair that will mask or even fix issues for a time. If that's what you're looking for, don't bring your car here. These guys work hard to find and fix the source of the problem, not just the symptoms.", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 5, "date": "2015-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nuZSHFngG8dFCsLuS0m0Yw", "review_id": "JMeU2QjTJG-Rj5m4a3wCOg", "text": "I took my 2000 Ford E-250 van in last week after I rebuilt the engine and transmission.  This isn't the first rebuild that I have done and it won't be the last, but it will be the last time I give Virginia Auto another dime!  I replaced just about every sensor and I used brand new parts while performing a complete rebuild.  Chuck's Speed Shop did my block work @ $680.00.  Between the engine and transmission, I have over $4,500.00 just in new parts, the labor was from myself...and the van does run.  I'm just not happy with the idle once the engine is at temp.\n\nHistory: My van fired right up after the rebuild, but it began to run rough after warming up with 50 miles on the new rebuild.  The dash cluster temp gauge wasn't reading the temp, or it was inop., so I figured that the computer was unable to read the temp and make fuel mixture corrections . It turns out that the temp sensor on the cylinder head does this job, but Virginia Auto never mentioned this fact to me. In a weak effort to find what was wrong with my van, they checked the fuel pressure, which they said dropped off shortly after turning the ignition on.  They recommended changing out the fuel pump, fuel filter and swapping out the temp gauge with Ford Motor Craft parts. I had already changed the fuel filter. I asked how much they would charge to install a new Motorcraft fuel pump and they told me $900.00 - $1,000.00!!!  I asked how much the fuel pump would cost and I was told $600.00!!!  WTF?! You can purchase the Ford fuel pump for $297.00 from rockauto.com!  I chose the Carter for $135.00 and they looked identical during the swap.  I used a new Motorcraft temp gauge too.  Virginia told me that they have never heard of \"Carter\".  I'm not sure how much these guys know about anything.\n\nMy major complaint comes from having to argue over how much the diagnostics fee and time should run.  They gave me an attitude when I told them $300 - $500 was too expensive and I'd give them 2 hours, then I wanted a call because I wasn't giving them an open checkbook of mine.  Their shop rate is $127.00.  The second service writer chimed in and informed me that they would need to retrace my steps on my rebuild because I might have stuff crossed, missing, or incorrectly routed, which pissed me the F@#$ OFF!  I kept my cool and I told him that I took pictures, made diagrams, and I purchased the Ford repair manuals, which are three thick books!  After just over an hour, I walked over and asked about the progress where I was informed about the fuel pump pressure, which they said they found within the first 20 minutes.  The rest of the time was spent doing god only knows what, but they didn't even come close to helping me fix the poor idle at temp or the rough start and they charged me $289.00 without finding a single issue.  NOTE: They had the van for an entire day, but only worked on it between other jobs - this info came from the manager.  I told them what I didn't change out during the rebuild because there was only a couple parts.  I also wanted the timing checked, but they never wrote that down because they were way too busy pressuring me into giving them an open checkbook!  Seriously, does anyone do honest work anymore?!\n\nTo: Matt A., (business owner)\nSave your time addressing my review with your wit and sarcasm and spend some time and money teaching your guys some ethics!  I may not know everything, but I have honor and integrity.", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 1, "date": "2015-05-04", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "nuZSHFngG8dFCsLuS0m0Yw", "review_id": "yRluiWAJC2nCN_RJxzZ3iQ", "text": "Yelps review process is totally rigged...what a joke!  They only claim to be impartial. \nI took my 2000 Ford E-250 van in last week after I rebuilt the engine and transmission.  This isn't the first rebuild that I have done and it won't be the last, but it will be the last time I give Virginia Auto another dime!  I replaced just about every sensor and I used brand new parts while performing a complete rebuild.  Chuck's Speed Shop did my block work @ $680.00.  Between the engine and transmission, I have over $4,500.00 just in new parts, the labor was from myself...and the van does run.  I'm just not happy with the idle once the engine is at temp.\n\nHistory: My van fired right up after the rebuild, but it began to run rough after warming up with 50 miles on the new rebuild.  The dash cluster temp gauge wasn't reading the temp, or it was inop., so I figured that the computer was unable to read the temp and make fuel mixture corrections . It turns out that the temp sensor on the cylinder head does this job, but Virginia Auto never mentioned this fact to me. In a weak effort to find what was wrong with my van, they checked the fuel pressure, which they said dropped off shortly after turning the ignition on.  They recommended changing out the fuel pump, fuel filter and swapping out the temp gauge with Ford Motor Craft parts. I had already changed the fuel filter. I asked how much they would charge to install a new Motorcraft fuel pump and they told me $900.00 - $1,000.00!!!  I asked how much the fuel pump would cost and I was told $600.00!!!  You can purchase the Ford fuel pump for $297.00 from rockauto.com!  I chose the Carter for $135.00 and they looked identical during the swap.  I used a new Motorcraft temp gauge too.  Virginia told me that they have never heard of \"Carter\".  I'm not sure how much these guys know about anything.\n\nMy major complaint comes from having to argue over how much the diagnostics fee and time should run.  They gave me an attitude when I told them $300 - $500 was too expensive and I'd give them 2 hours, then I wanted a call because I wasn't giving them an open checkbook of mine.  Their shop rate is $127.00.  The second service writer chimed in and informed me that they would need to retrace my steps on my rebuild because I might have stuff crossed, missing, or incorrectly routed, which pissed me the off!  I kept my cool and I told him that I took pictures, made diagrams, and I purchased the Ford repair manuals, which are three thick books!  After just over an hour, I walked over and asked about the progress where I was informed about the fuel pump pressure, which they said they found within the first 20 minutes.  The rest of the time was spent doing god only knows what, but they didn't even come close to helping me fix the poor idle at temp or the rough start and they charged me $289.00 without finding a single issue.  NOTE: They had the van for an entire day, but only worked on it between other jobs - this info came from the manager.  I told them what I didn't change out during the rebuild because there was only a couple parts.  I also wanted the timing checked, but they never wrote that down because they were way too busy pressuring me into giving them an open checkbook!  Seriously, does anyone do honest work anymore?!\n\nTo: Matt A., (business owner)\nSave your time addressing my review with your wit and sarcasm and spend some time and money teaching your guys some ethics!  I may not know everything, but I have honor and integrity.", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 1, "date": "2015-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QKHHGv3OGFtJIAQjwVteEQ", "review_id": "6stppmFBoHVjdaJDO3gCdQ", "text": "Amazing service and trustworthy, coming from someone who just moved to the Valley. Would definitely recommend them; ask for Robert", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 5, "date": "2015-05-15", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 0}, "user_id": "SkPYsxtWp4Vbde7DRWFF4w", "review_id": "Kva0G4j1V0nA4D3ofhMEUQ", "text": "Today was my first visit to Bavarian, and while it was just an oil change and spark plugs, these guys were quick, fair and friendly, not to mention substantially less expensive than the dealer.  I will be taking my '07 335 back as needed in the future.\n\nI realized last month it was time to walk away from the shiny showroom and free coffee after Chapman BMW on Camelback refused to complete repairs covered under the CPO warranty (thanks to their liberal definition of \"normal wear and tear\").  I'm glad I've found a place that will help ease the transition back into paying for maintenance and repairs.", "business_id": "OceUtK4lKAziifRdkRh4Dg", "stars": 5, "date": "2012-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "GsV3NW9Yo7kSWopE3ekk6g", "review_id": "pzj1lRFpUPPjByU8uP2ixw", "text": "Bad Customer Service is always a sign that they really don't care that much anout doing a good job.\n\nI have been putting off maintenance on my Mini Coop a little longer than necessary, and I am anticipating alot of work being needed. So, the plan was to drop off the car after work on Friday. It just so happens while I was working on my sales route, I visited \nan account that happened to be rite next door to \"Bavarian Motors\".  Having never been there before, I decided to case out the joint and see if this was the right place for my business. Well, I am glad I did that because it is definately not.  I walked in and encountered a guy by the name of \"Andy Garcia\", who I believe is the owner of the Shop. He was sitting at his desk doing paperwork. When he saw me walk in, he appeared to be uninterested in talking to me. I began explaining to him my situation.\nSuddenly, he interupted me and scolded me for leaning against his stupid door jam.\n\"Can you not put your dirty hands allover my door jam please\", he said. Surprised, I responded \"What? Are you serious?\"  The freaking jerk seemed to be more interested in keeping the whit paint on his door jam clean than adressing my concerns about my car. News flash buddy, you work in a mechanic shop! It is not a Dentist office!\nI asked him, \"Do you even care about earning my business?\".  \"well, you are cleaner than most people who come through here\", he replied.   \"What?!  Are you kidding me?!?!\"\n\nSo, that is my 5 minute experience at \"Bavarian Motors\", and I assure you it will be my last. These people forget that if you work at a service shop, ocassionaly you are going to have to deal with customers. If you don't like that idea, sell your business and go work as a janitor somewhere, so you can clean door jams all day and never have to talk to strangers!", "business_id": "OceUtK4lKAziifRdkRh4Dg", "stars": 2, "date": "2014-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HG8Wc8uNVfVg6NFeexlbeQ", "review_id": "uey7eRJkqff3Sg208-j48Q", "text": "Honest, well-priced service! I'm so glad I found them because working with Chapman BMW is a nightmare! Bavarian even gave me instructions over the phone on how to change the battery in my keyless entry remote when Chapman wanted my vin number just to let me know if it was possible to change the battery. Thank you, Bavarian Motors!", "business_id": "OceUtK4lKAziifRdkRh4Dg", "stars": 5, "date": "2014-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XNUID_eWSQ_7EBl-tbmuTg", "review_id": "-WcpA-8JmxtFXxrxRaW41A", "text": "I hit something on the freeway on-ramp and lost power. The second call I made was to Bavarian informing them I was coming in on a flat bed. AAA towing rocked and I eas there in no time.\n\nAndrew called and told me what the problem was and its cost. I asked if its possible to add oil change and engine mounts. We'd discussed mounts at the last visit, there was a wear mark on an pipe.\n\nI was expecting at least another day to get my car fixed. \n\nIt took about 38 hours from accident time to fix plus adding in extra repairs to get my car back.\n\nAnd affordable for BMW!\n\nBavarian Motors... you rock my face off!!!", "business_id": "OceUtK4lKAziifRdkRh4Dg", "stars": 5, "date": "2014-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EL52vBo8SN_Gs76gSsJwzQ", "review_id": "x7ztrJtmmfvCkxMxk7hZFg", "text": "I can't thank Andrew and Randy enough for their honesty and integrity. My daughter is a student at GCU, she took her 2001 BMW 325i. My husband and myself have always taken excellent care of our vehicles and before she took it we had the vehicle checked thoroughly. There was no way of knowing the car would blow the transmission with just 130k miles. \nAndrew diagnosis our problem and I wasn't  willing to replace it so I offered to sell him the vehicle  he agreed and offered a fair price. He has the ability to fix it and it would be a great car for a beginning driver because it is immaculate inside & out.\nFor myself as a parent I couldn't replace the transmission and then send my daughter back to AZ from California next Fall with that car. \nThank you Andrew and I feel 100% confident sending my daughter to your shop in the future should she have any vehicle problems. Even something as minor as windshield blade  replacement.\nIts nice to know there are good honest business owners with integrity still out there.\nMy sincere appreciation to you and your team!\nBarbara, California Mom", "business_id": "OceUtK4lKAziifRdkRh4Dg", "stars": 5, "date": "2015-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "xZlHrWsrFTibs8zvRNcQQA", "review_id": "isethoorlN-zNtpfldMbkA", "text": "Andrew and his crew are the best! I live in north Scottsdale, a 30 minute drive away. I will only have his shop take care of my Mini Cooper even though there is a dealership 5 minutes away.", "business_id": "OceUtK4lKAziifRdkRh4Dg", "stars": 5, "date": "2015-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Cw83M5ebeeZ_vo0Ua-PZtQ", "review_id": "S1xT3xgv09MfKssrNTlNzg", "text": "Help fix what another shop ruined", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 5, "date": "2014-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1sTIJSux2HnxUt_ezDOtTw", "review_id": "J8Rc3armidgqubQujxwM2w", "text": "Came here for an oil change after making an appointment online. Took almost an hour and a half for it to get done, however without me saying a single word to them or complaint the guy who had me sign the initial paperwork walked in and said \"sorry it took so long, there's no charge\" and I was on my way...WOW..I was going to pay and just cut my time as a loss because shit happens. They made it right and I didn't even complain once about a single thing, just waited patiently.", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 5, "date": "2015-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5xIwOSdQDmtE_lM9ZO_6RQ", "review_id": "5-RXwbkzxYWCe4GVTqq2pQ", "text": "I had a nail in my tire and was initially quoted a few hours for the new tire install. Good ole Ken, said he didn't want me leaving with my tire like that and would take care if it right away. 35 minutes later I drove away with a new tire and feeling very cared for. Thanks guys, you're the BEST!!!", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 5, "date": "2015-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SimBqxBHYwkPE8X7f_RnVg", "review_id": "vbucH0h5X9i-6JmXtwAakg", "text": "Need a good auto repair place, this is it. \n\nI have been using Terry's for over 8 years. I was introduced to Terry's Auto by a friend.  Since that time, I have used this place exclusively for my cars. \n\nIt is very tough to find an auto mechanic that you can trust.  With Terry's, I drop my car off, tell them what I need and walk out. I come back, usually by the end of the day, and he is done.  Fair price without a worry. \n\nHave been taking my wifes 1997 Chrysler there for years. Have had new transmission, new sets of tires, and multiple other basic maintenance.  A vehicle that probably would not have lasted more than 100k miles is still running well at 150k plus miles. \n\nTerry has even been kind enough to work with me on payments when I had transmission installed. \n\nCan't promise he will do the same with you, but then, I have been going to him for 8 years. \n\nNeed a good mechanic, look no further...", "business_id": "NUR1pLEwUETAvcW_1rfGFw", "stars": 5, "date": "2010-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rqG0g5PagiFbrAGSVzdAvw", "review_id": "k5_zUHOMOwVNSn3ju_F1lg", "text": "The customer service here is poor, and this business does not exercise proper security practices in my opinion. Last week I went to pick up my vehicle from repair just before 5pm, and despite that I was the only one in the waiting area, it took the front desk clerk more than 10 minutes to even acknowledge me! He made me wait, taking phone call after phone call in another room.  While alone at the front counter in the waiting area, I noticed that the keys for all the ready vehicles in their parking lot (including my own) were right there next to me on the countertop, along with the paperwork indicating which keys went to which cars.  It would have been easy for anyone to walk in off busy 32nd street, grab keys off the unattended front counter and steal vehicles right out of their own parking lot in less than a minute.They did fix the problem with my coolant system, but I think this shop is overpriced on top of their other problems. So I'll look elsewhere next time my car needs service.", "business_id": "osI3BT6AagWA-ravXrmK3w", "stars": 2, "date": "2015-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "AWTv37Rg4YBfXN6wUbSHvA", "review_id": "7Y-GGLHhjjyyBexGpmLmJg", "text": "Was referred to MB Motors through a friend when my car had started to stall throughout the week. Couldn't be more pleased with their service. They were quick, informative, extremely affordable and honest. Will definitely continue to use them and refer them to other Mercedes owners, as well.", "business_id": "0Xnduj9w6aYHOtN_RlHUng", "stars": 5, "date": "2011-03-15", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Pr1Z6jWvfYBZXozRsDMFWg", "review_id": "x4r1FVOHBiRnYWRtNx0isQ", "text": "Brought in a used MB I had just purchased to have them check it out. Bud's service sold me not only on his shop, but on MB in general. While I've taken my C230 to the local MB dealer for service once (mainly for some warranty fixes), I can't say I'd make a habit of it when I can take it to MB Motors instead. It's a great feeling to have a mechanic you trust with such major investment. Bud is reasonably priced, knows his stuff, and has a fine appreciation for the brand. I'd give these guys ten stars if Yelp let me.", "business_id": "0Xnduj9w6aYHOtN_RlHUng", "stars": 5, "date": "2012-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-QxS8P_eKCToI4qiEsoorQ", "review_id": "xbU60OSnNB-4jC1KxPKmKA", "text": "I have an 8 year old Mercedes C280 with 90,000 miles on it and the transmission started giving problems. I wouldn't consider taking it to a dealer and instead took it to one place that was highly recommended - and got an estimate for $2,200. But I didn't feel confident in them. So I brought it to M.B. Motors and was immediately impressed with their knowledge and professionalism. They pinpointed the problem very quickly and repaired it within a couple of days. The final bill was $1,500 and they did a super job. From now on I'll use them exclusively for all my servicing needs.", "business_id": "0Xnduj9w6aYHOtN_RlHUng", "stars": 5, "date": "2014-04-11", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "4CgusCZkipvUhvBZrRD46w", "review_id": "ZPVMGU4nRmgo5k0IeOpsbw", "text": "First time at MB Motors based upon Yelpers' recommendations.  Normally, I would go to the dealership and then cry on the way home after seeing the bill.  Gave these people a chance when my Mercedes had a noise and then showed the check engine light.  I am a cautious person so I was not driving the car with that light on without having a mechanic check it out.  Spoke to Jamie who assured me I could drive it in because it might be spark plugs or something to do with emissions.  As soon as I drove in, Bud, the mechanic/owner identified the noise as having to do with the power steering. Good hearing, experience, or both?  The problem was identified and after I picked up the next day, my car was driving beautiful with no noise and no \"check engine\" light.   I always wish my car repair bill was lower but considering that they also did some brake maintenance work as well,  I think the price would have been significantly higher at the Dealership.  \nIt was also a nice place to be people-wise.  Jamie, was very nice AND professional.  She also did me a big favor of driving me to a place to eat considering that the pickings are slim in their \"iffy\"neighborhood.  Super cool young lady.  Thanks. Jamie.", "business_id": "0Xnduj9w6aYHOtN_RlHUng", "stars": 5, "date": "2015-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_k33e5ViR9MeBFxtrSj84g", "review_id": "RVaYKnE9U4ts2UUpEPCzmw", "text": "As a new (used) Mercedes owner (2008 GL550) a couple of years ago, I was on a quest to find a reliable, honest, and reasonably priced service facility.  Thankfully I stumbled onto MB Motors.  It was the only business that I'd ever researched that had nothing but 5 star reviews...too good to be true?  NOPE.  It's about 25 miles from our home, so it's not the most convenient, but there's no other place that I'll even consider taking my Benz.  \nMy most recent experience will explain exactly why.  We were driving from Seattle back to Goodyear last fall, and knowing that the tires were getting pretty thin, I made an appointment to have new tires installed along the way (in Oregon, no sales tax!).  Everything worked exactly as planned; we were in and out of the tire shop in about an hour...just enough time to have lunch.  A couple of hundred miles down the road the trouble began.  The traction control warning light illuminated...what now?  After looking through the manual we finally figured out how to deal with (disable) it; but it was persistent, illuminating almost every time we stopped for a break.  I called a Mercedes dealer and was told that it was safe to drive, just not in \"slippery\" conditions.  OK, fine, we won't go skiing.\nA couple of days after our return to the Phoenix area we found ourselves running some errands in the general neighborhood of MB Motors, so I decided to stop in and make an appointment to get this annoying problem taken care of.  The good folks at MB jumped right in trying to figure out what was causing this to happen...thinking and hoping (like I was) that it was something simple.  After about an hour of testing, tinkering with, and driving it (of course the darn light wouldn't come on with them looking!), they announced \"GOT IT!\"  \nWell folks, it turns out that the tire shop had inadvertently installed the correct size tires on one side of the car, and a slightly different size on the other side, which caused the traction control computer to warn us of a stability problem.  \nAs you already know if you're an MB customer, they refused to charge me for their diagnosis, and even called the nearest tire store (same national chain) to explain the problem and get the ball rolling for replacement of the two incorrect tires.  As an aside, I can't help but wonder if I'd ever have figured out that the tires were different sizes if the car wasn't so darn smart...smarter than me obviously. \nThis place is simply the best...thank you!     \n\nClark", "business_id": "0Xnduj9w6aYHOtN_RlHUng", "stars": 5, "date": "2015-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "noVNs0cepEonmDUrAf8RSQ", "review_id": "eupmPu1IbMuAWbP-G0qxdQ", "text": "There is a good reason this shop has 5 star ratings.  This is my second time using them I am very pleased with the work they performed.  As the case from my previous visit, my car was properly diagnosed and I was promptly called with details on the repairs.  I have owned this particular Mercedes for 10 years and do most of the work myself.  I knew what the issue was with my car before I took it to them, so I can with confidence say that they are honest with the repairs they recommend, and they are done properly.\n\nIf you have never seen this shop before, it is clean and orderly.  The last time I visited,  the bays where filled and they where working on some old SL's which was nice to see.  Instead of going to the dealer come here and like myself you will end up being a repeat customer.", "business_id": "0Xnduj9w6aYHOtN_RlHUng", "stars": 5, "date": "2015-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FF1M2dA8sCJ89pjjvMWI9w", "review_id": "VbOyUC_zrmP97hJ78CZeVg", "text": "Dario is an excellent guy to work with. Very honest and fair. Probably the only mechanic in the valley that I trust and don't have to worry about my car without.", "business_id": "KXh8CE7KF3u3RdC70Ecenw", "stars": 5, "date": "2015-03-18", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "Ixq_feoJpn3aua9j6PLITg", "review_id": "BrJsAyv653YHdQZ2NRERVg", "text": "Phenomenal customer service! Came in with a warranty issue, they got me in immediately and replaced everything for free! Great feeling knowing my money is appreciated here and that I am truly covered under warranty :)", "business_id": "6jsv1cp0Gd26X0BiE2tmTw", "stars": 5, "date": "2012-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "vPqHgu2g5BJ5czNvh6h0cA", "review_id": "aMUqe_Vi6aL9saWfhL2XDw", "text": "These guys are easy to work with. They talk/walk you through the issues that you may or may not know about. They back up their work 100%. \n\nI originally came in early feb for new brakes. A few days later, I noticed a squeak coming from the back right wheel. Other than an annoyance, it wasn't causing any issues so I left it, being pressed for time. \n\nI answered their online survey two months later, leaving a comment about the noise. The next day, I received a voice mail asking for me to come in. They found the issue and fixed it without any charge to me. \n\nFunny guys, too.", "business_id": "6jsv1cp0Gd26X0BiE2tmTw", "stars": 5, "date": "2014-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "xDQErykLGB9Q-cGBw6HcZg", "review_id": "SzySrikMtufWPZYLn4draQ", "text": "Worst brake job I've ever had.  Where do I begin.  To start the price went from 99 to 300 in a matter of 20 minutes.  Then the brakes squeeled. Brought the vehicle back and down they won another 300 dollars to fix my squeel I won't be back", "business_id": "6jsv1cp0Gd26X0BiE2tmTw", "stars": 1, "date": "2015-04-13", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "pjH06728XKMZi_T6f2KoIA", "review_id": "YrkwKHXFrrSbLKN-15_2ww", "text": "I can not believe the level of dishonesty in this world. \n\nI took my little car down to this location to get my brakes checked because I bought it used and I just like to know everything is okay.\n\nThis is the first time I have ever taken my car to a mechanic other than an old family friend of ours - and now I know why.\n\nI cant even tell you what all they said was wrong with my car but it turned out to be about 800$ worth of work. \n\nI picked my car up and took it to my mechanic and they said I needed new brake pads and would charge me about 100$..... which seemed too good to be true after hearing that it would cost 800$ so I took my car to another Just Brakes location up in north Scottsdale and they said the same thing of course the price wasn't quite as good as our family friend but not even close to half of what this 7th street location told me. \n\nTOTAL RIP OFF ! NEVER AGAIN! I genuinely cant believe people can be that dishonest!", "business_id": "6jsv1cp0Gd26X0BiE2tmTw", "stars": 1, "date": "2015-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Nbg7f3pzwZY9frPSDHgM6Q", "review_id": "Q4BcAWxQJpy54BvkfK--2Q", "text": "Not entirely good.  The customer care rep. had a super slimy disposition and I felt like he was out to rip me off.  The service was OK and they finished on time.  However, I later learned I was grossly overcharged and several fasteners were left off allowing the under carriage to drag and get damaged.  I have since begun to get my Cadillac serviced at the Tempe Coulter.", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 2, "date": "2012-03-14", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 0}, "user_id": "bnCXjMKMgbwsxIN9Jnsqtw", "review_id": "QOXYtsukd0wkGxeKunY2wQ", "text": "Let's start by pointing out a few obvious things here.... because I hate when people write reviews and get mad about things that exist no matter where they are.\n1 - Buying a car sucks, period.  It's always a depreciating investment, and usually a pain in the behind.\n2 - Car dealerships and sales people are THERE TO MAKE MONEY.  The odds of finding somebody that is willing to eliminate their bottom line to help you are slim.\n\nWith that being said, I was in the market for a car... knew exactly what it was that I wanted, had money for the down payment and a trade in, and was just looking for the right deal.  I had been to a few different dealerships, talked to a few sales reps - and in the end, I ended up purchasing my 2011 Sonata Limited from Coulter Cadillac.\n\nWhile I was test driving the car, I did notice that it pulled a tad bit... which ended up being a bigger problem for me than I had anticipated.  Because of traffic, I was not able to take it on the highway.  Once I finally did, which was the next day - I noticed that the car was shaking, bad.  Luckily I know enough about cars to know it was related to the tires, rims, or some sort of an alignment issue.\n\nI can't lie.... the next week or so for me was a real headache.  I was upset that I had bought a shaky car, and really just wanted it fixed.  I had spent the next week driving up to Phoenix to get my car looked at.  I was even given a loaner at one point in time.  Every time my car was given back to me, I was told that it was fixed, and it was not.  The last time was the charm, my car was picked up, and it is now back in my possession and working properly.\n\nSomething else that kind of irked me during this experience was the issues with my interlock device.  Yes... I have one in my car (thankfully it comes off in July).  While my car was being serviced, I had NUMEROUS violations because of missed retests.  Luckily, I have a good relationship with the guys that service the device on my car.... otherwise, I'd probably have to pay a $50 reset fine, and have the device on my car for somebody else's screw up.\n\nNOW... that I've done my \"complaining\" which was merely telling you the truth - I will say that the staff I was working with were very understanding and made it a point to take care of me, even AFTER my purchase.  So yes, the things I had to deal with were a pain - but they could have happened to anybody.... and I could have been ignored and still driving a shaky car.  BUT I'M NOT!  Which is great... and I LOVE my car!\n\nI recommend going over to Coulter, despite my headaches.  They will take care of you.", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 4, "date": "2012-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "IlCeN--3_-AzWxNZgZco2w", "review_id": "S6KTW6iUJAd18dz4I-QUYw", "text": "I'm typically a very patient guy and don't like to bash any business but since I'm still stuck here, I might as well make my time useful. Do NOT, and I mean DO NOT come here for an oil change or any service. As soon as I pulled my truck in, I noticed two gentlemen sitting in their stalls doing paperwork. Both just sort of looked at me like a lost little child or soul, trying to find their parents and without the tendency to come out and just say we will be with you shortly. So I waited 10 minutes and just as soon as I was about to hope back in my truck and drive off, a gentlemen comes out and asks me sorry about the wait but what can I do for you. ? I want an oil change how long please? About 1-1.5 hours. Okay long story short, there were others in the waiting area bitching and nagging about the super long wait and Never again will they come here.  After about a 99.5 minute wait I go outside and ask my advisor, do you know how long until my car is ready. It's been over 1.5 hours? Let me check... Waited another 15 mins till my 100% charged IPhone had about 20% left . Finally went back outside and this time I walked into the auto area and saw my truck just sitting there. I go and let him know what's my truck doing there?  Looking puzzled, he goes to the back yells out a name and said bring the truck up! Then he looks at me and said I guess you don't have time for the free car wash eh? Paid and left.  That's how my experience went.  You've been warned", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 1, "date": "2014-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "UNg3fV3HlaVewS-CNaBU5A", "review_id": "hAaxhgqMArS4gTn_VqR4wg", "text": "One of the worse places to get your Caddy serviced.  Been a buying customer of Coulter's since 1968, but service sucks!  Only used them because of vehicle warranties.  Their 17-point inspection is a joke.  Every time we've gotten back our Caddy, we find our fluids are low or empty.  Even our wiper blades needed replacing & they said nothing.  They replaced our front brakes resulting a horrific noise & vibration as soon as we drove out.  We took it back & they said nothing was wrong with them.  We took it to a AAA location & they fixed the problem.  Coulter needs to fix \"their problem\" because we are changing Caddy dealerships.", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 1, "date": "2014-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ce3CaAGUe3IFqCMdkSr7FQ", "review_id": "25bkzjzUuPaL3wF5KEmt6w", "text": "These guys are usually great, but I have been standing around in the service line for over 15 minutes.  There are about 5 service managers in the cubes, but no one seems to want to help.  Mine is actually out helping someone.  Now at the front desk talking to the receptionist.  What happened.  Everyone just looks at me and looks away. Technical service manager just kept looking at me .....", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 3, "date": "2015-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "GBt1w12fhhVJSuMchbrMIQ", "review_id": "zTVn78TSku05JjiIUf1hug", "text": "My car was dropped off at night with a note of the problems.  At approximately 7 AM the next day Bill Large called me and reviewed my list.  Around 3:30 PM Bill called and said the problem was still not identified by the technician and that they would be performing a test overnight.  The following day Bill called, said the test did not work but they located the problem.  They would get the part and have the car ready.  By noon Bill called and said my car was ready.\nWow, I never had to call--very unusual when dealing with other dealerships.  Bill was totally professional and kept me updated.  I am totally pleased with the service and believe Coulter is a top dealership because of Bill. \nThank you Coulter and especially Bill.\nJim\nJim Kopp", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 5, "date": "2015-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "llcMXnEbbaeE4vY0HC_JtA", "review_id": "viA3yEKH_dfc5v9KOWhC7Q", "text": "We had a Saturn that would not let you shift out of park.  We called Coulter, the closest GMC dealer to us.  They got us in that day (a Saturday), they did not have the part in stock but ordered it.  In the meantime they showed us how to override the problem and keep us from getting stranded again.  The problem is now solved.  Mr. Ron Hammon made the whole process seamless and actually nice. Car was washed both times of service. Total class act.  They also honored an online coupon for my wife.  Saving us $50.", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 5, "date": "2015-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ilPveGTgb_lhJgO_OkH0Ig", "review_id": "CBN2Ye6oeC_UYoc6EBN9bg", "text": "Super cool guys, they stock a ton of stuff", "business_id": "R72PRg4ZKOjstjUiTCUWTw", "stars": 5, "date": "2010-03-14", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "8Lqlo-EzPVpD6x9_qJc2OA", "review_id": "iWYCWatwSBrdsKpOOzM5xg", "text": "Highway robbery plain and simple. $900 to have a starter motor and fan put in. The cost exceeded the estimate by hundreds of dollars, but the only call I got was when I they told me the work was done. Imagine my surprise when I found out that their shop labor rate is $125 an hour and my total to have two simple parts replaced was nearly $1000. \n\nLearn from my mistake, and stay away.", "business_id": "R72PRg4ZKOjstjUiTCUWTw", "stars": 1, "date": "2014-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lAngRi4lwBIHmjCBVLd-8Q", "review_id": "cyXY6g9w20GZ7fMPoAnnaA", "text": "We were referred to this place by Chapman BMW because we had a nail in our tire. We went there and they treated us well.  I followed my wife in my truck and she noticed I had a nail in my tire too so we asked them to look at it. They took care of my wife right away for $20 bucks. Then they looked at my truck and figured all they had to do was pull the nail and needed no additional work...At no charge!  Willing to help us right away...$20. Total honesty?  Priceless!!  These guys were great and I would recommend them to anyone.", "business_id": "n4N4NyNS78JUvamWttTxJw", "stars": 5, "date": "2012-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_kRa04tF4lg1cMTA1ovWoA", "review_id": "gu-yAEYwliarQn7ELZ3VMA", "text": "Took my 2000 Ford Ranger in for a trip check and oil change. AC was also out. I learned my front brakes needed replacing. Price was fair. They did not hassle me to get other work done that was not essential. Work was done quickly. I also liked that they have a rewards program. A couple weeks later, I took my wife's Jeep and service was also great. Also saved a couple bucks since I had rewards to use!", "business_id": "n4N4NyNS78JUvamWttTxJw", "stars": 5, "date": "2015-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "PVIJ0S6sVxGYstpyWAUciw", "review_id": "xsa-dHj_108aezejS1f7fg", "text": "I have been a customer of Precision Imports for nearly twenty years, starting with my 1986 Acura Rx. Al and Frank are the nicest, most honest, affordable mechanics I have used. They have checked out my cars before road trips (free) and have even given me a lift home. My neighbors have also been using them for years and won't trust anyone else. I have never felt ripped off or left without understanding what was wrong with my car. Most of my cars are Japanese, but  I had one GM that was so unreliable and so much fun to drive, Frank knew it was me when he picked up the phone.\n\nThey do have loyal customers and sometimes get busy.  (Maybe that's why no one has reviewed them before.)", "business_id": "WH0Q0CmYW00vnJpG37O_cw", "stars": 5, "date": "2009-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Q0eGJ635u79UgxOIUi8NLQ", "review_id": "RD65kHxJPDM7FHPM8X0YCA", "text": "Honest, forthright, great customer service, affordable.", "business_id": "WH0Q0CmYW00vnJpG37O_cw", "stars": 5, "date": "2010-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "HFzJb1EnBsB6fD5s-9fXUA", "review_id": "9T_Q33SIWIq8OrQUh071CQ", "text": "I can't say enough good things about this shop. Frank really knows what people need and that's honesty and trust. He never has once tried to pull a fast one on me.  His costs are very low and the service is better than anyplace I've been to my whole life.\nEver since I lost my father I've felt that everywhere I went with my car I was getting the wool pulled over my eyes....not here. You walk out of there feeling like you have a friend in the business and I'm not kidding. \n\nI've recommend this shop to everyone who had complained they have something wrong with their car. 7 cars, including mine, that will only go to Precision.\n\n I'll be a customer for life. Thanks Precision for restoring my trust in auto mechanics, my dad would have definitely approved of you all working on my cars.", "business_id": "WH0Q0CmYW00vnJpG37O_cw", "stars": 5, "date": "2011-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 7, "cool": 1}, "user_id": "9Z5ew1LibX4RekMA0aoLpA", "review_id": "qOzNb17SB9a4WY6VB4qgFQ", "text": "I've been taking my BMW and Nissan here for about 3 years.  In the past year, business seems to have gone up to the point that they CANNOT MAINTAIN PREVIOUS LEVELS OF GOOD OLD FASHIONED \"MOM AND POP\" CUSTOMER SERVICE.  Maybe the perfect 5 star rating here has something to do with that, causing business to explode.  However, when this happens a business either expands, or customer service declines.  Precision imports does not seem to desire expansion, and their customer service has become inconsistent and disorganized.  \n\nTrust is vital with your mechanic, and Frank/Al broke trust with me in a few areas.  I trusted them up until the past year.  Earlier this year Al diagnosed my Nissan with a \"pinhole oil lead causing oil to pool in the back of my engine, replacement required around $500.  It's a very common problem in this model.\"  I have not seen any oil leaking from the Nissan, but they assured me \"just wait it's going to leak.\"  \n\nLater this year, the service engine light came on in my BMW.  I trusted that Precision Imports would run appropriate diagnostics.  They did not.  Instead, they insisted that I had \"run my car too low on gas, which caused the light to come on\" and rebuked me not do let the gas run too low in the future.  (I had not recently let my tank get too low, and it had been low in the past but never caused problems with the service engine light). They got the service engine light off, and charged me $45.  \n\nA few days later, the service engine light came back on.  I thought, ok, the problem must be more serious or a new problem.  I brought my car in.  After several days of waiting, I called to a rude response that they were \"extremely busy and just hold on we'll call you when it's ready!\"  I let it go, and let a few more days go by.  I called back again, and was returned \"It's been ready come and get your car!\"  When I pointed out the poor customer service politely, I was returned with \"Sorry we've been swamped.\"\n\nWhen I came to pick my car up, the reason given as to why the light was on astonished me: \"pinhole oil lead causing oil to pool in the back of my engine, replacement required around $500.  It's a very common problem in this model.\"  SAME SUPPOSED \"COMMON\" PROBLEM AS MY NISSAN WORD FOR WORD!  AND, they were unable to switch off my service engine light.  I just stared at him.  My read: FULL OF BS.  I said nothing regarding this diagnosis, paid, and left.\n\nI have googled this problem in both cars, and asked around a little.  Neither is a common problem in either car from what I\"ve found.  I was even told they have patch kits for the problem, which was never offered to me as an option.\n\nI should add that I also have had 2 \"underquotes\" on mechanical problems here.  I mean, quoted by phone at one cost, then when I go to pay it was higher.  When I've asked about the higher cost, i feel I was given lines of BS.\n\nWHY DOES A SECOND OPINION MATTER?\n\nThe next day I was driving my BMW.  Now call me a jackass for not opening my engine and checking the coolant, but the car was JUST serviced (including oil change, etc) at Precision Imports!  My car started smoking like crazy, and died on busy Bell road.  I was able to get the car into another auto shop.  They found out THE COOLANT WAS EMPTY.  THIS IS WHY THE SERVICE ENGINE LIGHT CAME ON.  The charge was $10.  PROBLEM SOLVED, smooth sailing since.  \n\nI have now taken both cars to 2 different mechanics.  Nothing has been discovered in the area of \"pinhole oil leak\" on either car.\n\nIt used to be that Frank always overstated the price a little, went above and beyond with communication, and took care of me.  He came across as an honest old school guy to me.  It's different now.  Frank's more detached.  I get the feeling Frank is eying retirement, and would prefer working on a much much lower volume of cars.  No comment on the younger guy Al.  Earlier this year when I brought my car in Frank said \"make sure you deal with me.\"  I didn't make much of it, but this could have indicated some other issue going on at the shop.  I did attempt to deal only with Frank this year, but his availability has been very low and he had to route me to Al and others.\n\nI saw a few guys in the shop with a lot of signs pointing to \"previously convicted felon.\"  I'm all about turning it around and 2nd chances, and I realize this can be a staple of many mechanic shops.   But, business is business and I didn't get a good feeling about a few of the newer mechanics in the shop.\n\nI gave them several second chances, and communicated my concerns honestly and appropriately.  But that's it for me.  They lost me as a customer.  I'm hoping that they can turn it around, but for starters they are going to need to lose more customers and reduce the extreme volume or expand to a new location.  \n\nIf you're going to use Precision Imports, MAKE SURE THE COST IS DEFINED BEFORE REPAIRS ARE MADE.  ON MAJOR ISSUES GET A SECOND OPINION.", "business_id": "WH0Q0CmYW00vnJpG37O_cw", "stars": 1, "date": "2011-04-15", "type": "review"}
{"votes": {"funny": 1, "useful": 6, "cool": 1}, "user_id": "34gJ_KlP3RM6jotNT6TcDQ", "review_id": "maMhimFilnRkfQI0To72HQ", "text": "I first discovered these grease monkeys on Car Talk's website when I wanted to take my Toyota Highlander in for service at a place other than the Toyota dealership. Precision Imports had rave reviews on both Yelp and Car Talk's websites, so I figured I could trust them.  I have gone in twice and both times they were extremely professional, polite and have fixed my car issues quickly at a reasonable price. They are a little out of my way, but I'll happily drive the extra miles since I fully trust them to give my car the best care.\n\nHere's one example from over a year ago. I took my car into a Toyota dealership for a 30,000 mile check up and they came back with a quote of about $4000 to fix issues with my car that I didn't think even existed, plus my car was running fine! I ignored the Toyota dealership's suggestions. A few months later I drove to Utah, did some off roading and my check engine light came on a day later. I took my car into Precision Imports and they discovered that it was simply some minor alignment issues and fixed it for $45! I asked about the issues Toyota mentioned and they said they didn't find anything like that. Let's see, Toyota told me my car problems about 25,000 miles ago and my car is just fine (FYI: I have over 180,000 miles on my car).\n\nExample two from last week. I took my car into Walmart for an oil change and to check out a slow leak in one of my tires back in February.  They say they can't find anything wrong with my tire and suggest I get a new one. I put off buying a new tire and stick with just filling it up with air about once a week.  My check engine light goes on again. I took it in to Precision Imports for my next oil change and to see if they find anything wrong with my tire. Of course they do. They found a four inch nail in the tire, patched it up and the slow leak is gone. Oh, they plugged in something that Walmart probably left unplugged too. $72 for an oil change, patched tire and to check out and fix the check engine light situation.\n\nI don't know much about cars, but these guys...these are good guys.", "business_id": "WH0Q0CmYW00vnJpG37O_cw", "stars": 5, "date": "2012-04-04", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "GwP7klR69owmP-y1XCuSsg", "review_id": "CU7125vjhyw8U2F979AIjg", "text": "If your looking for a import mechanic in central phoenix talk to Frank. He will always tell you how it is and give you a fair price and they will leave you feeling all warm and fuzzy inside after leaving. You can't say that about any other mechanic in the valley.\n\nThanks again guys!\n-Tony", "business_id": "WH0Q0CmYW00vnJpG37O_cw", "stars": 5, "date": "2012-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jpbXg1yKBl4FurBi5ukseQ", "review_id": "WHcESJppXghnjMXPMYo-jw", "text": "They are the best. I refer people to them all the time. My dad uses them, too. Great honest guys. The only bad thing is maneuvering their tight parking lot. You want an honest mechanic? It's these guys. Ask for Al or Frank!", "business_id": "WH0Q0CmYW00vnJpG37O_cw", "stars": 5, "date": "2012-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "40lLa8qO9Efr2hCLg0YtZQ", "review_id": "YOdxMXgIxLYeGHP9wY2Urg", "text": "AWESOME!!!   These guys can do just about anything!!   I had a Cadillac CTS that the dealership could not find out what was wrong with!   They also wanted to charge me 150 to change a tail light bulb.  I have used precision for my cars in the past, and figured I would give them a try with my American car.  They had my answer in about 20 minutes, and the cost was Very fair...... and always has been, and the tail light bulb I believe was $20.\n\nSo now I own a Nissan Altima Hybrid.  I had something electrical going on with the push button start, and thought,,,, maybe I should take this issue to the dealer as its a hybrid and SOOOO technical.  Frank and Al had me on the road again in about 2 hours and the best part was that the fix was only $120!   \n\nI will never again take my car elsewhere!!  Best well rounded and capable shop that also happens to be honest!!!", "business_id": "WH0Q0CmYW00vnJpG37O_cw", "stars": 5, "date": "2014-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "rHP3dAUKP4v2wNl5-Z2Xfw", "review_id": "_8ynvsBhL1CIX_iSneVaOg", "text": "What repair shop doesn't charge you when nothing is wrong? THIS ONE!! I've taken my BMW in twice for different weird alerts showed up. The first time they charged me a fraction of what the guys across the street would have (I know this because I used to go there). The second time I called to see how late they'd be open, they called me by my name (from the caller ID) - love that. They couldn't find anything wrong, after lifting it. And NO CHARGE. I will be back!!", "business_id": "WH0Q0CmYW00vnJpG37O_cw", "stars": 5, "date": "2014-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "bG-r4zndr1xuon0pHbUrcg", "review_id": "RYh6do5TZrSMjZIU2aqV9Q", "text": "Not only do I live within walking distance to Precision Imports, but they also have a stellar reputation on Yelp so I decided to give them a chance when I had a mystery light on in my six year old Mini Cooper.  I thought it was indicating a brake fluid flush.  Somebody helped me immediately and said it was not necessary, but I should get an oil change.  I asked if he was sure because I was taking the car up north in a few days.  He promised to look over the entire car after he changed the oil.  The estimate for the oil change was $50.  When I came to pick her up, she had an oil change for even less than $50, the indicator light was re-set, and the car made it up north and back!\n\nI have since taken her in a few more times for various lights coming on and thankfully they have found no issues.  They re-set the light and if no actual work is performed, I'm on my way that same day - for free!\n\nI have recommended the shop to a friend who wanted to bring a potential new (to her) used car in before she bought it.  They looked it over - again, for free - and she was thrilled with their service.  \n\nEven though I've had no major work done here as of yet, I feel like this shop is honest and does great work.  So nice to have this business in the neighborhood!", "business_id": "WH0Q0CmYW00vnJpG37O_cw", "stars": 5, "date": "2014-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zHGjtAER42xVMxOu1wQfzg", "review_id": "z1jztWZHbLAnyiahDx_ABA", "text": "Honest and reasonable", "business_id": "WH0Q0CmYW00vnJpG37O_cw", "stars": 5, "date": "2014-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "fVE19YHOPFnTnlneo_wotQ", "review_id": "CligQt6McYQEtu-Iw7_jnQ", "text": "Went here about 3 months ago and poor service and attitude.  Will not return", "business_id": "WH0Q0CmYW00vnJpG37O_cw", "stars": 1, "date": "2015-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vQA1Qz3FeuVCj6D8SiCUcw", "review_id": "jcH3gUxCx8XXWA_8s8D4Eg", "text": "I needed some minor work done on my 2004 Honda Civic several months ago and happened to drive by this place. I brought my car in for a quote and it was 50% less expensive than what the Honda dealership had quoted me. I went ahead and Frank assured me my car would be complete by EOD. Sure enough, I called around 4PM and he said it would be good to go within the hour. \n\nFast forward a few months and my car was overheating. Frank told me that I needed a new head gasket and to expect a $1200-$1500 repair bill. He said to think about it and let him know Monday if I wanted to go ahead with it. My Civic has 180K+ and I asked his opinion - he said he'd recommend doing it, so I did. While they were in there, they also replaced my timing belt and water pump. Sure enough, bill came right in where he quoted $1300. \n\nThese guys are honest and seem to know their stuff about Hondas. I'd recommend this place to anyone. Don't expect the shiny dealership experience. Also, be prepared to follow-up with them about the status of your car. My only complaint would be communication - but that's a small price to pay for quality workmanship and affordability. Still five star worthy.", "business_id": "WH0Q0CmYW00vnJpG37O_cw", "stars": 5, "date": "2015-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "EmukTDo0xmXMrNRfuJoJqA", "review_id": "SoOLzygNNaLYbBZMZFkYOQ", "text": "I have taken my car here for years. They might be a little more expensive than everyone else around them but they are always worth it. Al  and Frank are trustworthy and honest. They do things right the first time, and if they do mess up they do their best to make it right.", "business_id": "WH0Q0CmYW00vnJpG37O_cw", "stars": 5, "date": "2015-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "k4-6lakq7t3kCgbvPxcuvg", "review_id": "sFpsnhdJ5WGjkSRUArRziQ", "text": "I use Volvo Am I for my 2007 XC 70 and I am very happy with their service and prices.  \n\nThe shop is clean and doesn't make me uncomfortable when I visit (sometimes with my kids in tow)...no nude centerfold pictures hanging in the work bays, or leering grease covered weirdos wielding wrenches and blasting death metal on their radio.  And they always get my car in quickly, tell me what it's going to cost me BEFORE starting the work, the prices are always fair and the work is well done.   \n\nAnother big plus for me is that I never feel like I'm being lied to.  Some unethical mechanics think they can take advantage of a woman because it's automatically assumed that we're all ignorant about cars, and some of us are, but I'm not.  I like that they've never told me something outrageous like my turn signal fluid is low, or something that just seemed like they thought I didn't know any better.  I appreciate that I can expect that if they say I need it, I really do need it.  \n\nAnyway, I wouldn't hesitate to take your Volvo here, it's a nice shop and they really know their way around a Volvo.", "business_id": "7P3ECWrdSepztN5A3boTmg", "stars": 4, "date": "2012-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nfcGJdO1yoT8jNmxDIIH5g", "review_id": "TPUJIaghE3Fri0Hq2t5FsA", "text": "I am not really sure why/how they get bad reviews, I chalk that up to a random bad day! My husband and I have been going here for about 5/6 years now!  My only regret is that we didn't find them sooner!!!!\n\nI love my Volvo, but  sometimes the cost to repair/maintain can be a lot. Enter the awesome dudes at Volvo Am I! They are nice, friendly, fast and HONEST!\n\nThey never try to \"up sell\" me on anything,however they do let me know what will need to be worked on and in a timeline so I can budget or prepare for the future. They never treat me badly for not doing all repairs at one and for that I a very thankful of their understanding...\n\nNot only are they understanding, but their prices are reasonable and less than 4/5 other places I have taken my car I the past!\n\nI also loved that they are a small business... But,don't let that fool you. These professionals all worked at the Volvo dealership together back in the day and then decided to work for themselves! I'm telling you THIS is where you need to go!\n\nMy husband and I are in the process of buying a new car. We are thinking of stepping away from the Volvo name for better gas mileage...  However, the thought of having to find an honest,trustworthy,cheap,friendly, local business for car maintenance stresses me out and so, I may buy another Volvo! Lol\n\nNo joke, this shop is that good and so are Volvos! Try them out and compare their prices to other \"luxury import\" shops, you will see and become a believer just like me! :)\n\nAlso, since I have been going there for so long, pretty sure they hooked my husband and I up. We basically saved 200 dollars just because! So thanks Volvo Am I! \n\nKeep it up and thanks!", "business_id": "7P3ECWrdSepztN5A3boTmg", "stars": 5, "date": "2014-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "aZLw7np_luaR9TjQwqNijA", "review_id": "uKF-6RFSD_5TvjUklt4SYw", "text": "I recieved a diagnosis (from a trusted mechanic) that I likely had a bad catalytic converter on my Dodge Stratus.  I saw the positive review on Yelp and decided to try Mad Hatter.  I received a phone quote for $269.00 to replace the CC.  When I brought the car in, Mark (the shop tech) decided to check to make sure the CC was bad before doing the replacement.  \n\nMark spent about 20-30 minutes on the CC, finally taking it down and showing me that it was okay and didn't need replacement.  He had let me know beforehand that there would be a small charge to check it (which I okayed), but only ended up charging me about half of what he quoted because it didn't take as much work as he thought.  In these times, with everyone scrapping for every dollar, it's really nice to know that there are honest mechanics out there willing to help YOU save money.  I will definitely recommend this shop to anyone needing muffler/CC/brake work in the future.", "business_id": "5jqqVt-A8bwwJDj7Ii7tvw", "stars": 5, "date": "2009-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5dSibwi0GihYcTKjA11qOQ", "review_id": "nCxe1x-mThi000SWu3Iq0g", "text": "Great place to take your ride! Went in for an exhaust inspection, the man got my car in and had my problem found in minutes. Very kind and helpful work with a straight up attitude make this the best place around to have exhaust work done. Nothing beats that kind of service.", "business_id": "5jqqVt-A8bwwJDj7Ii7tvw", "stars": 5, "date": "2014-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "Ovpa3S8xD96dLE5eDxcxJg", "review_id": "t0Af97LqjEe-EtQmUvwM8g", "text": "This place changed the way I looked at my car. I swear to God. \n\nI am totally useless in the context of auto repair. I know how to change a tire, but that's about where it ends. \n\nBecause of that, I know I get taken. Often. Until these guys, I would even say always. \n\nMike, who runs Saguaro, is totally honest in his dealings and knows that if he cuts fair deals with his customers they will come back. And we do. Before I ever take anything to the dealership I call them up here and explain my problem. If they can conceivably handle it I take it to them and get it done for literally a small fraction of what the dealership charges for the same task. \n\nDo yourself a favor and try them out.", "business_id": "lgWOnPbDjKrpa-hhugGZGQ", "stars": 5, "date": "2007-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dqen3r4tAD1rP3ziOqQ4_A", "review_id": "h2pCcTaYIIDHJb-L1ckrFw", "text": "This place (and Gary) is A class!!! \nWas referred to them through a friend and I couldn't have been more happy with this referral. Hands down anytime I need anything done for my car I will be going here and I would send friends and family here in a heartbeat!!!", "business_id": "lgWOnPbDjKrpa-hhugGZGQ", "stars": 5, "date": "2015-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m0Oq3vhnWAY8G4-KyKAmgA", "review_id": "whRNI1Ng1n3efNcYbQV1sA", "text": "These guys are amazing. Very knowledgeable, incredibly honest and very much focused on treating the customer right for longterm relationships. \nSay hello to J and Jeff, they will take great care of you.", "business_id": "4OY51VjcxPKO6WGzRfVdVw", "stars": 5, "date": "2011-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7x_veK3owaudG7_8EJCJVw", "review_id": "gDNe5a6T-Eg6nhTox9IiBw", "text": "I took my 4runner into Inman per recommendation to make sure it was safe enough to get my girlfriend and I to Zion National Park.  Jeff took a look and the prognosis was not good, however accurate.  I was straightforward about how much $ I had to work with and in turn, Jeff worked with me.  I appreciate the fact that Inman helps take the stress off of an already stressful situation.  Opposed to the many pseudo-mechanics which flood the market and prey on the uninitiated, Inman legitimately wants to help.  I would recommend Inman to anyone.", "business_id": "4OY51VjcxPKO6WGzRfVdVw", "stars": 5, "date": "2011-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nxVAs0ivaOgupWvj9wJDOw", "review_id": "fetlKuDmlKl8Png9enPYvw", "text": "I went here on the strength of a friend's recommendation and, boy, am I glad I did!  I walked in and announced, \"I have a 13 year old Toyota with 150,000 miles on it and, given all that, I hear that it might need new hoses and belts.\"  Many mechanics would take one look at me, take one look at my car, and see money signs.  Not at Inman's!  They did a FREE inspection and then had a frank discussion with me about when to get the belt and hose maintenance work done.  And the price they quoted was several hundred dollars cheaper than the price quoted by the one other mechanic that I talked with (by telephone).  Inman's certainly earned my respect today and they will earn my dollars in the future.", "business_id": "4OY51VjcxPKO6WGzRfVdVw", "stars": 5, "date": "2011-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zQ33xSjfZu3oQURz9FSqrg", "review_id": "HPicjonIgP48KV4Pqn_7eQ", "text": "I have used these guys for years on 4 different auto's and found them to be reliable and trustworthy.  Not much more to be said.  Since car's can't talk and most drivers identify symptoms by sounds and driving intuition, mechanics are not perfect.  The question is \"are they smart, hones and reliable\" and this shop I give my trust to.", "business_id": "4OY51VjcxPKO6WGzRfVdVw", "stars": 5, "date": "2013-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jFzhRTtsT80v_ufCUOYUeg", "review_id": "gtMiCFJWo20br3bfRJqJPQ", "text": "My first and only interaction with Inman and Sons was not satisfactory. They did a 75,000 service which is what I asked for. My issues is they used synthetic (and expensive) oil for my oil change, changed fuel injctectors and added an expensive fuel additive WITHOUT advising me. Added more then $250 to my final bill which is not the issue. My issue is they did not ask me and frankly feel these decision were mine to make not theirs, which suggests profits over customer satisfaction. Will not be back", "business_id": "4OY51VjcxPKO6WGzRfVdVw", "stars": 2, "date": "2015-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lZsgxfsZtGLIh3ymaOPKMQ", "review_id": "mVpmmCbb5EMT1sunms6Ddg", "text": "It's rare to receive an estimate for auto repairs and the actual bill comes in significantly less than expected!  Thanks for your integrity and honesty!", "business_id": "4OY51VjcxPKO6WGzRfVdVw", "stars": 5, "date": "2015-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Qn8PxVBzFOm9FC9mdbGgbw", "review_id": "w-c_-sC_-1hFjrPX9deD0w", "text": "These guys do great work at a fair price.  I mistakenly got a 'pro' from Craigslist (if you live in Phoenix, avoid a guy named Frank who claims to have over twenty years experience and works out of his garage on Griswald!!!!!) who screwed my car up badly!!!!!  James and Murray fixed it up and charged me a fair price for all the work they did.  I would recommend them to anyone who needs this kind of work done on their car.", "business_id": "2kme0ANeHc20ij71zhx4DQ", "stars": 5, "date": "2012-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nF6u5sgj4CxSULIdaKE-eg", "review_id": "ocFBgZPI6cKHSkYARpL3Ow", "text": "Had to have car seat repaired because seam was coming undone.  Schedule a time with James. They got it done same day just like they promised. Work looks good.  Shop is really cool and old school.  Lots of cool old cars around.  These guys are the real deal.  Almost makes me want to put in a whole new interior just to have an excuse to use them again (but not willing to spend the $2k to have it done).", "business_id": "2kme0ANeHc20ij71zhx4DQ", "stars": 5, "date": "2014-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Q-IH88ZJpg8sXXJnanXfiw", "review_id": "89bUCaDVKE1g_BxpMSibeA", "text": "Had a small piece of my beige driver's seat replacesd due to a small hole beginning from wear.  Beige is SO DIFFICULT to match.   Top shop did an amazing job....replaced the piece and matched it perfectly.  Great friendly staff and finished as promised.    Highest recommendation.  If you need this sort of work done,  look no further.  SERIOUSLY!", "business_id": "2kme0ANeHc20ij71zhx4DQ", "stars": 5, "date": "2015-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "7-ly4LI9XWLXkFiM2vHxrw", "review_id": "N1jkOza54PZJ4SsnXSKp1Q", "text": "These guys suck.\n\nCar was overheating.  We told them what we thought was wrong with the car.  They fixed something else instead and gave it back.  Car overheated again within two miles of their shop.  Way to check your work, jerks.  \n\nWhen contacted, they said the original work was subject to warranty but if we wanted the real problem fixed we'd have to pony up another $400 to take it apart again.  When confronted with the fact that we TOLD them what we thought the problem was and they ignored it, they didn't care.\n\nWe just got the problem fixed at another shop nearby for about 60% of what Atwood charged to NOT fix it.\n\nSeriously, this is a no-brainer.  Let this shady business die on the vine.\n\nedit: three years later, the owner responded to this review without addressing the specific concerns.  no apology for the bad service, or for taking money for not fixing the car.  if your business satisfies a majority of customers and continues to get you referrals, great, but you might want to reconsider how you treat the people whose cars you fail to fix.", "business_id": "5CgGQRXx_3TA8WQiKEmhhA", "stars": 1, "date": "2010-03-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-VzM_yil8HiBrk1khhh2lA", "review_id": "BUHNxBUMqw4tdIFzWZhAoA", "text": "I purchased a supercharger for my Mercedes and Andrew at Atwood was recommended to me to do some aftermarket tuning to solve timing and air/fuel problems.  Andrew was a true gentleman and provided me with world class service.  He even stored my trailer at his house at no additional charge for the time they had my car.   On a return trip he ordered me a missing grill, made me a key that the @$$&^%$)# service manager of Mercedes Scottsdale told me I could no longer get and installed the grill at no charge.  Andrew is a stand up guy and I would trust my AMG to him anytime.", "business_id": "5CgGQRXx_3TA8WQiKEmhhA", "stars": 5, "date": "2011-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EMLEE7T0HScynyuVPw56hw", "review_id": "EMOR-68RGrI2dpqfwmoSjg", "text": "I would not recommend this shop to any friend or associate with a good conscience. My wife's car  transmission failed so we had it towed to Andrew's shop for repair.  Andrew told us he had a great transmission repair company that would provide a remanufactured transmission with a 3 year unlimited mileage warranty within a couple of weeks turnaround time. After several weeks pass what he originally told us when the repair would be accomplished, along with very poor follow up communication and as a result of the excessive delay we incurred excessive rental car expenses we were not prepared to pay.  The next day it failed again stranding my wife. Tow car back to shop and after a few more days get the car back. Now within a short time again the transmission failed putting more undue stress and inconvenience on my wife. \n\nWe are now in a position where we don't trust their competence and feel locked into a situation out of our control. I can't absorb another $1,000.00 rental expense because of their incompetence. \n\nFuture customers beware. Andrew is very like able but the honesty and trustworthiness is suspect.", "business_id": "5CgGQRXx_3TA8WQiKEmhhA", "stars": 1, "date": "2014-05-11", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "JVi-VgQh9COUBicXRc8now", "review_id": "PCIWmEm59edgacEo4AWC2g", "text": "I have given this place several chances to make things right and.they never have.everytime i have brought my.car in for repair,i ended up bringing it back because the problem wasnt fixed and the owner Andrew would ask me to bring it back to fix it right.he even got upset once because i DID bring it back.every time i ended up taking it somewhere else or a dealership to get fixed correctly.so its like paying 2 shops because ATWOOD EUROPEAN cant accomplish the mision.i even referred a few new customers to him when i first started going there and they all had bad experiences as well.ANDREW,IF I COULD GIVE YOU LESS THAN 1 STAR RATING,I WOULD!!!!! i will never refer anyone to this shop or take my own car in ever again.very disrespectful to customers and always tries to upsell something.what a scumbag.", "business_id": "5CgGQRXx_3TA8WQiKEmhhA", "stars": 1, "date": "2014-05-13", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "mLfjeWUJnNiqHEye3I6qug", "review_id": "s0JDzpmaklgAYYobKbykUw", "text": "If you've ever driven down Indian School Road near 21st street you may have wondered about The Toy Box with its assorted classic cars on display in its front window.  Sure, TTB works on a fair number of great old cars but don't be intimidated.  Phil, Andy and the whole crew are a great bunch and work on all types of cars.  You'll get honest service at a great price and, most likely, will make a few new friends.\nThe crew here has worked on my '72 3.0 CS for several years now.  First, it was to finish the restoration I'd contracted with another shop then to change out my carburetor jets so the car would pass emissions.  With an old car, no matter its degree of restoration, there is always work to do and TTB has since worked on my air conditioning unit, suspension and drive train.  I wouldn't trust my car anywhere else.  If you have a classic this is the best shop in town.  But if you're looking for a shop for your daily driver, give them a chance too.  An honest repair shop.  What a concept!", "business_id": "m6vwfpZSuAdsArtbVZ4-NQ", "stars": 5, "date": "2009-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ty3cNT0dEo74yCYqvNBJPQ", "review_id": "AH6XDm4JjWZ6kuzJ8U7bNQ", "text": "Honest, fair price, fast service.\n\nNo BS.  Fair quote.  I got a good price on a radiator.  They look up the estimated time of doing a job in their manual for the part you need replaced and  work from there.  they don't say oh well it's going to be this or that and try to nickel and dime you.  they do things by the book and look out for your best interest.\n\nFather and son operated.", "business_id": "ZogIIx8SdAFedjXDT9jFFg", "stars": 5, "date": "2011-03-17", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "PkAlh1h2Mkq8lmur6j9UxQ", "review_id": "AxKS090SkDwkipqSFw65tQ", "text": "My fiancé and his family have been going here for years. I started going to Hay's 8 yrs ago. Ver trustworthy and very fair prices, just don't expect same day or even next day service as it is a one man show.", "business_id": "ZogIIx8SdAFedjXDT9jFFg", "stars": 4, "date": "2015-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CXhYBa5R70CkowoW5U89ug", "review_id": "8lxhGp-9r7nkAkS5g1yhAQ", "text": "I'm sure they can provide excellent service.  However, i had my breaks changed and it put me out $700.  I thought that was high for changing the breaks and smoothing the rotors. Apparently all the bolts weren't tightened up when they gave it back so i had to return back the next day so they could fix the wobbly wheel.\n\nMaybe that was a small oversight, but before going here you should definitely shop around.  I was quoted $1400 for a timing belt change so i decided to forgo the service and shop around and received excellent service for hundreds less. So if it's not a critical need, shop around and know the market rate.", "business_id": "2fXVpii6fawN7qCL_M2Urw", "stars": 1, "date": "2012-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "UsShQth4ThCaxi5rvxGRKA", "review_id": "1KUh_RUq-ltyYZ6QU-Bz5A", "text": "I love Martin's Auto Repair!!!\n\nI originally went to Martin's when I first moved to Phoenix and my car was overheating non-stop in the summer. I made the mistake of going to the dealership first (I have a Nissan Xterra) and was quoted an outrageous price of $4000+ to not only fix the overheating problem but to fix everything else wrong with my car. Considering my car is 10 years old and only worth about $4000, I was in quite a bit of a pickle. Then, my step dad recommended I look at Garagefly.com and find a trusted auto repair shop. I found Martins and went with them because everyone rated them 5/5 and there wasn't a single bad review. \n\nI took in my car and told them about my experience at the dealership (which was ABC Nissan, by the way!) and after doing a thorough inspection of my car, they were able to fix the problem for less than $350!!! They also gave me a report of everything else they found and gave me a timeline on when the repairs should be done. Now I go to Martin's for my oil changes and usually check an item off my \"needs to be done\" list while my car is there.\n\nThe staff is super friendly and they get you in and out quickly. Couldn't have better things to say about them. They literally saved me thousands of dollars!!!", "business_id": "uKNp1tdMEibbriPE9bhZKg", "stars": 5, "date": "2011-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "ZiSL-0G_x7fclCHAQjra4A", "review_id": "qqCk-pSt6LQakGjfo4nngw", "text": "I met the owner at a Local First Arizona event and love that they are a neighborhood shop that takes pride in their workmanship and customer service. The shop and waiting area is clean, they return calls immediately and I really trust that my car is in good hands. If you want to get your car fixed by an honest and trustworthy mechanic, I would give these guys a call. :D", "business_id": "uKNp1tdMEibbriPE9bhZKg", "stars": 5, "date": "2012-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "1iPwphO6qyB3cYgfljvzlQ", "review_id": "x_f5fZ07ifUMcY4ynLTfXA", "text": "Wish I could have wrote a better review about this place. The mechanic i spoke with Was a nice guy an i felt confident the work would be quick and easy. I had some repairs on my truck. I was expecting it to take a couple of days and was expecting to spend up to a grand. The work was done and the vehicle passed emissions. BUT, within a day of getting the vehicle back the check engine light came on and now my a/c does not work. I popped the hood to see about the battery (as it was suppose to be replaced, it was) and under the hood there were bolts sitting on the side by the battery. I have no idea if they belong to my vehicle. There was also a rag tucked on the other side of the hood. The plastic cover on my neg. battery cable was sitting by the valve cover instead of being put back on or discarded. And the wiring harness which was accessed during the repair was not rewrapped and the wire that was worked on was completely exposed. I wanted to take the truck back but I was pretty soured on the lack of care for the work that was done. I will keep looking for a mechanic that gives me more bang for my buck.", "business_id": "uKNp1tdMEibbriPE9bhZKg", "stars": 1, "date": "2013-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "x0r-IamYgKMgF3v7tJ_PTg", "review_id": "D4MrmFDSRKTzk4jjr77BAw", "text": "I can't say enough good things about Martin's-I first found them through yelp reviews when I desperately needed brakes on my saturn. they were helpful, reasonable, and had them done the same day. recently, I brought my car in again  last week to get it in shape to pass emissions-my tags were seriously expired and the check engine light had been on for a few months. glen kept me informed on everything that needed to be done, had the needed part rush delivered, got me a temporary tag, AND took my car down to emissions for me. it of course passed and my 10 year old car runs better than ever! i would recommend them to anyone needing a reliable, knowledgeable, and reasonably priced mechanic", "business_id": "uKNp1tdMEibbriPE9bhZKg", "stars": 5, "date": "2014-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bjguHKO3WI9svOj1XYcQ6w", "review_id": "HZV9VkYirXiH7yIKv60xgQ", "text": "Service is always top notch, everyone is always very professional and friendly. I don't live far - so I'm always able to get a ride to or from the shop.    I trust them and they do good work.  What more can you ask for.", "business_id": "uKNp1tdMEibbriPE9bhZKg", "stars": 4, "date": "2014-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZJAYnSbP6-38rKCxcNZIGg", "review_id": "OJPpLMiKaWl8VM3XA7J5IA", "text": "Few things in life are more exciting and fulfilling than finding your first love, winning the lottery, or discovering a trust-worthy mechanic who goes above and beyond for you.\n\nDave and Glenn were so helpful to me when I brought my car in for maintenance repairs. Understanding that I was on a budget, they helped make recommendations that were most important for safety first, and why. There was absolutely no pressure to do any of the work, so I can tell they weren't putting their interests before mine.\n\nThey even provided a loaner car for me so I can get to and from work!\n\nAfter the work is done, they walked me through everything that was repaired/replaced. They ran tests several times throughout the day to make sure the repairs were up to their standards.\n\nThese guys will become your friends, and you'll come to trust no one else because they earn it.\n\nBest part? They always leave a cute little treat for you in your car when you come to pick it up. How can you not leave with a smile?", "business_id": "uKNp1tdMEibbriPE9bhZKg", "stars": 5, "date": "2014-05-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ILlvDIix8vuiDW_vS1M0GQ", "review_id": "Fa3nBGytK9iltvOgD8oybg", "text": "Martin's is truly wonderful. I've had my Jeep for 15 years and they take excellent care of it. I've never once felt as though they're making unneeded repairs. Anytime I have a concern regarding my Jeep, they thoroughly examine it and provide me every option so I can make the best decision. Thanks for making me feel like a respected car owner, you always have my business.", "business_id": "uKNp1tdMEibbriPE9bhZKg", "stars": 5, "date": "2015-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "ZZAwT21fnJdrYfz3uz7bSg", "review_id": "6Oo4a08yGHE9ha0zonSsxA", "text": "I have had so many problems with my 2003 Jetta, in return I've met a lot of mechanics that just try to screw me over but not at martins. \nI loved the customer service at martins auto repair.\nDave is wonderful and everyone is so friendly. They told me exactly what was wrong with my car and to bring it in again just to make sure it was handled correctly. I'll definitely make the drive from tempe to here.", "business_id": "uKNp1tdMEibbriPE9bhZKg", "stars": 5, "date": "2015-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3ubxW4FkpUElF8j-4UDbUw", "review_id": "V4UNmOdhzR5ou1BQDbDY3w", "text": "I went to this auto shop about a year ago and they wanted to charge me $1k for replacing valve cover gaskets and other odds and ends.  Well, I just went to Highland Auto in Chandler and they did the work for $376!  They are really friendly at Martin's, but I ended up spending over $700 there and didn't have my original issue fixed.  :(", "business_id": "uKNp1tdMEibbriPE9bhZKg", "stars": 1, "date": "2015-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BNK1R1Qbfz4c3JArT43HDg", "review_id": "wxgLBTtrEbGbpfSpz7GbTw", "text": "The purchase process was fast and easy. In Feb 2013 I bought a 2005 Ford Focus for a smokin deal. Had a small issue with wheel nuts, but other than that it has been a reliable car. I am not the biggest fan of the payment method, wish there was a way to pay online instead of having to call in. That said, the owner has been very professional and gone out of his way to resolve any issues. Jason runs an above board operation and I would recommend my grandmother to these guys. Thank you.", "business_id": "3jBkt2zeO1t0mUUBJMzTJg", "stars": 4, "date": "2013-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2TkNaKKwkkmMqfQWfym1vw", "review_id": "Hw1EcZvqXqOqdvjvdAt5mg", "text": "Recently purchased a car here. Thought it would be decent, due to average reviews and featured on an app I downloaded for recommended dealers. By far not the best experience. They will tell you what you want to hear during the dealing process, and then make all sorts of excuses not to follow through with promises. \n\nHave had issues with the car, drivers window quit working, so they told us to let the guy who was replacing the windshield know. We did, the guy fixed it, we were on our way. \n\nCame time to make our first payment, which they told us wasn't due for another two weeks, and then a few days later was supposedly due and late, and informed us that we owe them now for the drivers side window. And since we were late, it \"threw up red flags\" for them. Really?! So not coming through on your cheap little 500 mile warranty didn't throw up \"red flags\" for us as consumers? Whatever.  \n\nThese people are very shady. Do not let the initial welcoming manner fool you. They are money sharks and will not help you whatsoever in good faith. Shop around and stay away from them. The only reason we didn't give the car back is the 1000 dollars we had already paid. We are just going to go to our regular mechanic now, and deal with them as less as possible.\n\nTo add fuel to the fire, the car blew a head gasket a month after we bought it. They want $2600 to fix it, and will not do anything in good faith. Waste of a lot of money $1700 to be exact (down payment, first month worth of payments and all the towing)... Words of advise...STAY AWAY FROM THESE PEOPLE. There are way better dealers in the valley that will help you. We now have to save up for another down payment for a different car. They can eat s**t.", "business_id": "3jBkt2zeO1t0mUUBJMzTJg", "stars": 1, "date": "2014-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SPaFT7X_wCWysM7J95doXw", "review_id": "Zp0wERX6YY3XAZv6u3-iEg", "text": "I went to Auto Europa, The advertisement listed the SUV with only 185,000 miles. They had been in business for \"50 years\" and I figured for a used car dealership that was pretty good. I did my test drive, it pulled to the left real bad, figured just need an alignment no big deal. We spoke to Lenny about this and he told us that when we go in to do the paperwork he would have them top the fluids off and look at the alignment issues. We get back out to the Isuzu and they are cleaning the inside of the vehicle, and we asked Hector about the aliment issue, he stated we don't have the equipment to do that here. No problem, I'll just take it to get taken care of. I needed a vehicle since I was moving a distance away from work and I could handle that.They all said, no, your good to go. I thought ok, perfect! On the way home, driving up the highway I happen to look down at the mileage read 215000. I called them immediately!   I said I am paying 6000.00 for a 98 Isuzu that I thought had 185000 miles on it, and now I am paying for one with 30,000 more miles than the original paperwork states. I spoke to Jason and he stated that we needed to get the paperwork redone, so to come in next week to get it adjusted. I asked for a break in the price, to no avail. I thought ok, my fault for not looking at the mileage. Two days later the truck is making a horrible noise and it sounds like the it is about to fall apart. I pull over only to find that the driver right front tire was in shreds! It turns out that the tire that blew was the wrong size for the rim. The rest were on their way because they were all dry-rotted. My boyfriends dad takes care of the tire issues, purchasing 4 brand new tires totaling over $460. I call him and go over the fact the tire that was on the front driver side was to big, and rotted on the inside hence the pull to the left. I explained this was ridiculous, first the mileage and now I could have been killed on the highway due to your neglect of tires on the vehicle. He (Jason) informed me the only thing they do to the tires is check the air pressure and that there was tread on it, and said there was tread on my tire. Let it go.It was about a week later, the lo-jack system in the truck starts beeping, I called Jason and he tells me that the payment is due. I told him on the paperwork the first payment wasn't due until the following week, he explained that to was wrong on the documents that we both reviewed and signed and that I needed to still come in to get the paperwork fixed on the mileage as well as the due dates for payments. Frustrated with this place i made the payment, I needed a vehicle to move. We move it's about 2 weeks later and the vehicle is spilling oil everywhere, didn't notice this before, now its all over my new driveway. I take it to my mechanic and he tells me I'm lucky this thing is still running, and goes over the list of things that needs to be fixed on the SUV. Call them again, talk to Jason, tell him about the oil, what my mechanic said and he tells me that they need to look at it to see if it can be fixed, and if it cant they will put me into another vehicle. I am ok with this. I drop off the vehicle at 8am two days later and they look at it and explain it was an easy fix. I'm happy, I explain again that I need to make sure I have a reliable vehicle since I work in Tempe and live in Maricopa. It was about a week later the check oil light came on, we put 3 quarts of oil in the car, two days later it starts knocking and trying to stall, we put 2 more quarts in the SUV. Two days later, it's shaking, sputtering, and stalls, wont start. We get it turned around and to the closest store to add more oil, get it home. Call and ask for Jason, he isn't there we speak to Joe, and Joe connects me with a Tow truck driver to tow the car to Auto Europa to look at it.I am speaking to the tow truck driver explaining  where I live, and the vehicle and he says Oh yea, the Gray Isuzu I know that vehicle.  This wasn't his first time towing this vehicle. I call the next day and they are too busy to look at it, and same comment the following day. Hector tells me its going to take up to 3 days because they have to take the heads in to a special shop. I called Friday the 24th it has been a week and  a half and Hector informs me that the engine is shot, they would have to replace the whole engine. I ask for Jason, he still isn't in. I feel like I am being avoided. I speak to Joe, Joe says well we can put a new engine in, I said I need a vehicle, and explained the conversation I had with Jason about if the vehicle doesn't work then he would put me into another one. Joe then informs me that I need a new deposit for another vehicle, and that when they buy back the vehicle that there will be a remaining 500-1000.00 rolled into the new loan. I explained that, that was ridiculous, why am I paying for a broken vehicle.I had no problems paying for the one I had, but to pay for a vehicle I don't own. No sir.", "business_id": "3jBkt2zeO1t0mUUBJMzTJg", "stars": 1, "date": "2015-04-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SPaFT7X_wCWysM7J95doXw", "review_id": "Vn2YPkjK0HeaTpyKAFNt6g", "text": "Still waiting to hear from the owner after having my isuzu's engine blow. Still no word from him. Was told if anything happened they would get me a new vehicle, no problem. So what I was told was sure you can have another vehicle, with another deposit, and still owe 500-1000 from the vehicle that blew up added to the new loan.... I am now vehicless, lost my day job to no car and looks as if they deleted my original post here on yelp.\nWay to go Auto Europa/ EZ Pay car and truck!!!", "business_id": "3jBkt2zeO1t0mUUBJMzTJg", "stars": 1, "date": "2015-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oDXXW0sTMGp89Rj9HOFu0w", "review_id": "GOjxKrqr2fVPkx_3ycvIVA", "text": "My brother referred by to Johnston's Automotive, saying he finally found a mechanic who's HONEST.  It's nice to be able to drop off a vehicle with confidence that you'll get great service at a fair price. Most recently they were instrumental in getting all my shocks replaced under warranty.  I\"ve had them work on my diesel truck as well as my BMW sportscar and would recommend them without reservation.", "business_id": "sBgB9OLYOOewtw2RdHitzQ", "stars": 5, "date": "2014-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "McrOvo8dMc_O_gK13otuSA", "review_id": "FWpD2Q3i5IkV9uoBBpW1PA", "text": "I tend to keep my cars a long time, well past the 100,000 mile mark. Usually car repair facilities hand me page upon pages of \"essential repairs and maintenance repairs.\" I was pleasantly shocked when I was told not once but several times, \"No, you don't need that. No, that's fine too.\" I have found a new friend in the car repair business!", "business_id": "sBgB9OLYOOewtw2RdHitzQ", "stars": 5, "date": "2014-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "G-A0jYZRRsdotjWA_O3mmA", "review_id": "7EpIft3JLqDrq_uDtsTp7A", "text": "March 4, 2015.  \n\nI do my own mechanic work for over 25 yrs, and it's difficult finding a shop on the rare occasion I have some repairs, that can't be done myself.  \n\nAfter one shop tried pulling a fast-one on me, by telling me they couldn't do an alignment, because my car needed a full front end rebuild, with new ball joints, and tie-rod ends (which was a total lie), I kept looking and found Johnston's.\n\nAll my 1984 Subaru needed was a simple front end alignment, and that's all it got.  Pretty simple, no BS.  What more can you ask for?  \n\nWill recommend them for sure.", "business_id": "sBgB9OLYOOewtw2RdHitzQ", "stars": 5, "date": "2015-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "yy8vNTtESId44OcGyaVnbw", "review_id": "8iBXk0QN83RDTshK--hXsg", "text": "Simply the best automotive repair place I've yet found in Phoenix. Honest, fair, and competent. I've taken three vehicles there for service over several years now and never been dissatisfied.", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2007-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "eJGh4UF0zHIPPLZG1NkpgA", "review_id": "wO-nCN0jVTT_UEZ6om6BEQ", "text": "A very reliable local garage. Bill is all about great customer service, and goes the extra mile. He deflated my fears about \"being taken\" by other mechanics playing on my automotive ignorance. He's a truly good guy, knows his stuff, and will work to save me money if he can find it. I trust Bill, and 25th Street Automotive. Thanks, and we'll continue to bring our wheels into your shop.", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2009-04-30", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 0}, "user_id": "M9cZwNoSKQDUVwO0R8UwIA", "review_id": "MtaMmFA-GI15pwVm884pmQ", "text": "I've been taking my car(s) to then for years.  Super organized system, excellent customer environment, and very level headed and trustworthy diagnosis and advise is always administered.\n\nThey are the BEST!", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2010-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 1}, "user_id": "9PmD9FdQ0bWflFMTr9DAMQ", "review_id": "x1HRVmDCZVt9zxd5OTQBuA", "text": "My car died while I was driving to work, and a search for nearby auto repair places turned up this shop. It had good reviews so I decided to give them a shot.\n\nI had my car towed to their shop using my GEICO roadside assistance, and the guys at 25th Street Automotive had it up and running again within the same day (I had a busted alternator). Their free shuttle took me back to my home for the afternoon, and then they came and picked me up later on when everything was ready to go.\n\nWhen I came to pick up my car, they took the time to point out the fact that they had noticed that my radiator hoses were almost completely worn out (which I could see to be true), but they didn't insist on fixing it right then or there. They took the time to educate me about the issue and the potential costs, but they left the decision entirely up to me.\n\nOne other thing I noticed was that as part of the alternator repair, they had completely cleaned up my battery terminals and painted them with an anti-corrosion treatment. This was an unexpected attention to detail which I really appreciated.\n\nSummary: Top notch, prompt service from friendly, knowledgeable, and skilled mechanics. At no point did I feel like I was being scammed or upsold things I didn't need, and the price I paid for this level of service seemed fair to me. I'll definitely be coming back!", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2011-05-27", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 2}, "user_id": "EML1k3qEIuggzThWVHcTeA", "review_id": "w22gZcZ0LEKptbdjff43CA", "text": "I have been using Bill and 25th Street Automotive from the time they opened.  I wouldn't go anywhere else for car repair.  I find Bill very honest and fair, and he does great work.  He lets you know when certain work is needed, but also realistically gives you an idea of how long you can wait before having the work done which I appreciate from a budgeting perspective.  He never uses the fear factor to get more business from you like some places do when they give you doom and gloom stories of why you'll die if you don't have more work done.  I have never thought he has suggested any repair that wasn't truly needed.  As someone who doesn't know much about cars, I feel fortunate to have found such an honest, reputable business to take care of my car.", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2012-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nMwgC0DuMsBR0V5v4-J8wg", "review_id": "Yo35uYu0JnmZV0p0Z-sPQQ", "text": "Thanks to Yelp, I found this awesome car repair shop.  I have nothing but the absolute BEST things to say about them.  The most professional, honest and effecient that I have ever worked with.  Unfortunately, I just bought a \"lemon\" and 25th St. Automotive took some of the pain out this process.  They are just amazing....I knew that the transmission was most likely shot.  They spent the minimum amout of time and money to confirm this and were more than accomodating.  I would bring another car back here in a heartbeat. \n\nOverall, a it's very dismal circumstance regarding my newly purchased used car, but an absolutely fabulous experience with 25th Street Automotive.", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2013-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "fZwvo8YgAS068OQC_M3kBg", "review_id": "W92lpga8DMgpN3f_NVLQug", "text": "25th Street Automotive is top-notch!!! I took my truck in a nearly a month ago to have my compressor replaced. I had quotes from 3 different shops including the dealer and 25th Street Automotive was the most inexpensive. But price was not the only thing that made 25th a great experience. They were honest and thorough from my first call until I left with my truck fixed. They gave me a ride to work, made sure to cover my seats and floor with plastic to keep it clean and were sure to explain all that they saw while working on the truck. The owner thanked me for my business and was polite enough to ask for future business in a genuine and polite manner that made me feel as if he was truly looking to make a life-time customer. To top it all off the total price was slightly less than initially quoted.\n\nThey are the BEST automotive repair experience I have had in the 10 years I have lived in the valley. I highly recommend them to everyone that needs a good mechanic!", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2013-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "U2VgE98jFRhPzyVyoG6-BQ", "review_id": "sKsdXRzmePO4GQvjakV58g", "text": "I have been taking my vehicles to Bill Conian and 25th St Auto for about 20 years and have ALWAYS been very pleased with both the service to my car and with the customer service. In this crazy age of almost NO customer service, Bill shines brightly  as a beacon of care and competence. It is such a relief to have a business I can completely trust and one that seems genuinely appreciative to have my \nbusiness. I recommend 25th St without reservation.", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2014-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "hWw1FCv7L7DGw0o1wP4R7Q", "review_id": "lIMy_PzUi-wToF7_OogM8w", "text": "I took my 2003 Ford Escape here based on their awards and Yelp reviews. I have been screwed over by several mechanics because I am a young girl and they assume I don't know anything, or can't do research on my own. These guys were amazing! They were very honest and upfront about what was going to have to happen and how much it was going to cost. I am very please with their service and pricing.", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2014-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8M9QPbw9A0A2i1mqLYEJHQ", "review_id": "W3DyCOoknjz1Gg0y3mriaQ", "text": "Friendly and honest.  I had my Toyota Corolla serviced by these mechanics and I couldn't be more pleased.  They did a great job of explaining the issues to me, and telling me what needed to be fixed right away and what matters could be addressed later.  Also, and most importantly, they were upfront about the fact that I could get one of the issues fixed for a lesser price by another shop (they even provided me with the other shop's contact information).  They stuck to the service time estimate and my budget, and still did a great job.  No upselling.  Thank you!", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2015-03-08", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "p8lUmHSegs9LeeQnj8Ylbg", "review_id": "QJBM81UjCUcRp4Pz5cQIjA", "text": "How can this place have perfect reviews?! I just called to ask for a quote over the phone and a guy by the name of Bill answered. I explained to him what was going on with my car and he suggested that I should look for a car repair shop near my work because they were too busy to take a look at mine! Are you serious!? I have never been denied service on purpose.", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 1, "date": "2015-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "o2fmOFmAvnGR-xgiFZ5exg", "review_id": "WOMvfv4CTTx2SAJrWaIWjQ", "text": "I just called and talked on the phone, but he seemed very helpful.  instead of trying to take my money, he recommended that I sold my car \"as-is,\" hopefully saving me a great deal of time and money.", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2015-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "14gx3EW66rQ0fLDqQLApzg", "review_id": "Z-qRbdlC4NaDKQxmNopsVw", "text": "Can't decide what I like best about these guys: their friendliness, integrity, competence, good prices, or solar array on shop roof. Always do a great job, highly recommend.", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 5, "date": "2015-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rqG0g5PagiFbrAGSVzdAvw", "review_id": "s0oQWpUc0CHDpf88P-KTbw", "text": "I took my vehicle to 25th St Automotive for replacement of a water pump and several minor misc items. The total bill came to about $10 less than their original quote, and the price seemed reasonable given my past experience with other shops. The shop was pretty clean and the service was professional and straightforward.  I can't really fault these folks for anything, though there shop is relatively small with limited capacity of just a couple bays. In spite of the fact that I arrived to drop off my vehicle within a few minutes of them opening, I still had to park down the street and walk, as the small number of parking spaces in front of the shop were already full. They called about 2:45 to say my car was done and ready for pickup, which was earlier than I expected, so they appear to be handling their brisk volume of business pretty well.  I'll definitely call these guys again when my car needs work.", "business_id": "65ujBUIwQ3iGBjymj268IA", "stars": 4, "date": "2015-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Hac8HebtWiR0H2WmPg9AOg", "review_id": "7Inhy-g_BqnygtdsPuKkEA", "text": "Definitely make an appt before you go. I liked the low key sales approach. They told me my fuel injector needed replaced but for $89 I told them I would wait and check with my mechanic after reading the other review. Plan on being there for 45 min though.", "business_id": "it7e85D0cwN2W2M1BVKHUA", "stars": 4, "date": "2011-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "yrXCDuHsWLt14ql-aLOCYg", "review_id": "AVaa-ux9gNFy4pT1Ies8sQ", "text": "I got my brakes checked out here and i feel they were very nice and explained everything to me honestly, usually I feel pressured to get more done than what I intended when I go to auto shops but they weren't pushy at all and they even let me use the coupon I had for $50 off. I will def come back here for any further service needs. Nice people here for sure.", "business_id": "it7e85D0cwN2W2M1BVKHUA", "stars": 5, "date": "2012-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QB49hhSLpPMaZ_rqBjP8uQ", "review_id": "Xns46ZxN_-EBgT9A8gQhFg", "text": "Do not take your vehicle if you value your sanity and your money. This was the worst auto repair experience I've had and if I never have another experience like this one, it would still be too soon for me.", "business_id": "it7e85D0cwN2W2M1BVKHUA", "stars": 1, "date": "2012-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lFcbT6QiESHz2ibRPdSwJg", "review_id": "qnNygvfHOdX6g0FM8nimdA", "text": "This is really as good as it gets when you have to experience car issues.  Not only do these guys take care of you in every possible way, from doing superb work to giving great customer service, you feel positive you got the best deal around!  Top that with their warranties and why go anywhere but here? Take the guess work out of taking care of your vehicle by taking it to Terry and Rob! Thanks guys for all you do!", "business_id": "gCaccP5CxQn-j2KCNbD4gg", "stars": 5, "date": "2011-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vDpNMIiwVIBmO8kbucC7oQ", "review_id": "v3NEY9ktJ8tint1JTa_rHA", "text": "I was very pleased with the friendly service here.  I had a coupon for a different location that they weren't able honor, but they did knock 10% for a transmission flush.  Another guy came who seemed like a regular...though I feel for anyone that is a regular at an autoshop!\n\nI mentioned that I was hungry and they referred me to Bertha's Cafe next door.  Laughed that the mechanic are now becoming foodies since Bertha's opened up. \n\nWill return for the quick and honest auto service.  They didn't dry to upsell me on any unnecessary services that my car didn't need.", "business_id": "gCaccP5CxQn-j2KCNbD4gg", "stars": 4, "date": "2012-03-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "5S9qsoHWUcMeahMtBwuX3g", "review_id": "sCvYhBjGhAUGrFMlwthjsQ", "text": "I own a 'bubble car' as my boyfriend likes to call it. Just a common Toyota Corolla S.. When one of my Goodyear tires needed to be replaced, I figured it wouldn't be a problem, considering that it's a COMMON car so there must be plenty of tires in stock before I go on a mandatory 300 mile road trip the next day.\n\n27 calls later to tire shops ranging from North Scottsdale, Fountain Hills, Tempe, Gilbert, to Avondale, my tires seems to be as elusive as the Fountain of Youth. The thought of me lying in the middle of the desert in 100+ degree heat waiting for vultures to nom on me because I couldn't find a tire was starting to become more real.\n\nMy sadistic father, who watched me go through this mid-life crisis finally spoke up and said that there was a really nice guy across the street from where I was this entire time who fixed his car all the time and could probably help me. \n\nLo and behold, I call and the guy who works there looks it up and says 'We don't have it, BUT I can drive and go get one and be back in 10 minutes.' Why did I not get this response the other 27 shops I tried calling?! \n\nBasically, less than an hour later, my car is done and ready to go. No appointments, no '2 days later', just fast service. The guy I spoke with was really nice, charged me only what was quoted without any hidden labor fees (cheaper than fixing it at the dealership), and told me to not be so hard on my father because he was a 'nice' guy. \n\nWe'll see about that. \n\nGiving it 4 stars because I haven't had any other major service done there as others below have, but when I do, which will be very soon as my car brakes are squealing at an ungodly range higher than Mariah Carey's, I will be back to update my review.", "business_id": "gCaccP5CxQn-j2KCNbD4gg", "stars": 4, "date": "2013-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "0qIsBt4EzBDCKrIviV55Ew", "review_id": "yeALt73x8axMce7Yy7DAyg", "text": "These guys do it right.  Check there stats and you will find Jacks Auto Alignment as one of the best alignment locations in Phoenix.  I always suggest my customers at my garage to visit Jacks for assistance.  Just East of 24th St on Thomas Jacks Alignment will quickly align your car to get rid of the shaking you might feel.", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 4, "date": "2008-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Ty3cNT0dEo74yCYqvNBJPQ", "review_id": "jnypn3XUU1_OmtBsQIyE5Q", "text": "stand up guys.  They checked my alignment, basically said I have bad tires and they could align my wheels if I  wanted but wouldn't solve the problem the tires being bad, said there was a deal at costco or they could hook me up with a deal from his friend but advised costco due to their service and if you are traveling there will be a costco and not this local shop to  get serviced for free.\n\nThey didn't charge me anything.   \n\nThey also checked the alignment  manually and not  by computers.  I was  impressed and am impressed  when someone has an old school skill.  Makes the quality of the work better.", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 5, "date": "2011-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "i0A-c2yoHySmFhRV2sDR1g", "review_id": "ja-WBqmv2nt8bsu_buDAOA", "text": "Took my Saturn here and they did a great job on the alignment for $60. It drives straight and smooth. I could not be happier with their service.", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 5, "date": "2012-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YiqS9_jvHXSS0wDcv4uDNg", "review_id": "HCRKM-9e2_7u5UFrxoyMlA", "text": "I took my GTI here for alignment because of the positive reviews on Yelp and various motorsports forums.  Ken worked on my car.  He gave me the details on what was wrong and suggestions on what to do.  I couldn't be more pleased.  The car now drives straight as an arrow.  It's so refreshing to visit a business that's enthusiastic about the service they provide even after all these years.  Jack's has gained another loyal customer.", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 5, "date": "2013-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LosFYB00WF2DAHIg3DTcvw", "review_id": "774qrcB8RmSILWJUzX276A", "text": "Very honest and reasonable prices. I was told by the Lexus dealership that I needed an alignment and they were going to charge me $170. I took my car to Jacks and after a thorough inspection Jack's was honest and stated I didn't even need an alignment.", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 5, "date": "2014-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZNJisB9BZish8l4X_TZ9kg", "review_id": "PqbUGTMJFSbjajwgS9Le3g", "text": "My family have been coming to this place for years.  They are locally owned. One of the very few honest businesses out there. If adjustment is needed they will charge you a reasonable price. If none needed they will charge you nothing for inspection.  Most places will charge you a fee just to inspect it.  Love this place. Will continue to bring my business here.", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 5, "date": "2014-03-27", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "aaHyqSTcpdkismEP0bj0rQ", "review_id": "T88hGfPpqwcCPrxiIknxmg", "text": "Super nice crew. They filled my car up with some break fluid, free of charge, which isn't why I gave them 5 stars, it was their friendly attitudes and the fact that they were incredibly helpful.", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 5, "date": "2014-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "77isqX66EIXtk66ZjWvvaA", "review_id": "cfpgy-J4w2gCpZEYD_I5zA", "text": "I had some \"pulling\" and shaking going on with my small truck. I stopped in to Jacks and they looked the situation over. After a short wait, they pulled my truck onto their rack and evaluated it. They came back to me and let me know that my alignment was good and I needed one new tire. I was in and out in less then 15 minutes for no charge!  I can happily say that one new tire latter they were absolutely correct, it solved all of my steering and suspension problems! Thank you Jacks for the great service and advice!", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 5, "date": "2015-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6Z1Q7cajYda6FD0cSTeZhA", "review_id": "8lV3sS1-RwP9VZlPwxFZgw", "text": "Nice clean shop, with very fast service.  Came in for an alignment and the guys looked my car over in about 5 minutes and said the car didn't need an adjustment and sent me on my way, no charge.  I gave 4 stars because the steering wheel on my car is still slightly crooked when driving straight, so I'm not so sure it didn't need an adjustment, but I'll take it.", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 4, "date": "2015-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vIeHkfLAjVzKkMnE-YAWoA", "review_id": "5BSCoZH6kYFic2t4vmbkyA", "text": "I took my car to AAA at 10th St and Camelback Road to get an estimate for new front and rear brakes for my Altima - $880.  And that included the AAA discount.\n\nI then took it to Jack's on Thomas Road. I saw decent Yelp reviews and their location was convenient.\nWithin 1 hour of dropping it off, they called me with an estimate - $ 362, including tax.\nYeah, I know !  Crazy Good - and a savings of $ 520. \n\nSo, I went ahead - they called in another hour & the work was done. Easy, convenient, quick & very reasonably priced.\n\nI support smaller, locally owned businesses when possible. This is a great find ! \n\n5 Stars for Jack's - I highly recommend them.", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 5, "date": "2015-04-22", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "OCHZ3ek_KJWVZcdMNWOEbA", "review_id": "yRZ0x9Lz427XGJKFQ_Uokg", "text": "This business doesn't put care, soul, and heart into their work. I had to come back within 10 minutes after alignment was done. My steering wheel was still off center (not centered). After I came back they fixed it without even saying Sorry. This is not type of people I want to do business with. I don't recommend this business.\nUpdate* year and a half later I have just got an alignment done again and it seems the job was done properly except my steering wheel was off centered again and upon returning to the shop to have them adjust it; however, without a single word or discussion the owner silently returned my money back and said in my face \"go find someone who'll make you happy\"... I was stunned and left.", "business_id": "e1OD-zIxBjJXPlnYQvhdpw", "stars": 1, "date": "2015-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pYXWo61PkIKYq5W-derECQ", "review_id": "Ruvnj2vk4oE_7Ol6ULxeSg", "text": "I recently went in with a Acura TSX 2004.  I needed an oil change.  Since my car is considered nice, I am always suggested a part I do not need from almost every repair shop I have been to.  This was not the case.  The said my car looked great.  I was even asking them what about this and what about that.  To my surprise he said the car is in perfect shape.  I appreciated the honesty and will continue to go back.", "business_id": "nDJ9Pbt0RF6iXLgVzGyC3Q", "stars": 4, "date": "2011-03-29", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 0}, "user_id": "bIVnclr28abP6XP79jWFlg", "review_id": "eSpNBbd1iEw2nSvBxOazxw", "text": "This place is aweful! I got my brakes done and just 4 months later they were toast. Called to have them fix and they refuse. They took my 400 and now won't honor fixing their crappy job.\nMy advice- avoid this place at all costs.", "business_id": "nDJ9Pbt0RF6iXLgVzGyC3Q", "stars": 1, "date": "2012-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "adkV-Rt2NjIZzh2tmryeWQ", "review_id": "7BYg9-Q_03FPqq6uGcfN_A", "text": "So, this is a long story, but I'll do my best. Brought the girlfriend's Passat in to have the service light checked, a/c checked, and it was making a strange noise. Wheel bearings, ac leak fixed, oil changed and tires rotated. Pickup car, service light still on, and makes a different funny noise. Call up, they have us bring it back, apologizing for the light, and thinking they just need to balance the tires. I thought that was automatically done after a rotation, but hey, I'm no mechanic! Offered a free oil change on her truck as compensation, and since she had brought it in anyway for its own a/c issue, she was happy with that. \n\nThis ordeal lasted over a week, dealing with multiple employees and manager. The first guy that worked on the Passat apparently quit that day, the next guy had to leave because his wife had a baby, etc. \n\nEduardo told her that all her hoses needed replaced and several other things, before he gave her a diagnosis of the problem we brought it in for in the first place. At this point, we just want to pick it up. So we do, and now the airbag light is blinking. Manager (Seth) refused to speak to us and then we were hung up on. \n\nPretty ridiculous. Not sure if this is because we are women or what, but us being female shouldn't have anything to do with the fact they don't seem capable of fixing a problem without causing a new one. Francisco was the only person there worth talking to. He was great, but sadly there were too many other things wrong.", "business_id": "nDJ9Pbt0RF6iXLgVzGyC3Q", "stars": 1, "date": "2014-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YGCr9KZ69narNqHyUTt3wQ", "review_id": "oSEQ82eFe3YuqtHaX1y_pQ", "text": "so i stopped in here only because my car died right down the street.\ni'm not ignorant when it comes to my car but i couldn't figure out why my car started over heating . one of there mechanics helped me push my car into the bay to see what was wrong.  I dealt with Cody, the manager, and along with being very knowledgeable, he was super friendly and figured out what was wrong with my car quick.   they were able to replace my coolant temp. switch that same hour and my radiator fans started working instantly.  ill definitely be going back to this location", "business_id": "nDJ9Pbt0RF6iXLgVzGyC3Q", "stars": 5, "date": "2015-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cj0HFjrVqVdeKmTcr6s6tQ", "review_id": "g-Sp3fL78mQZLAMMCpHz9Q", "text": "We have had our oil changed here for years. Last time We marked our tires and found they had failed to rotate them. We complained and they gave us a coupon for a free oil change.  This time we found all the info for all of our cars had been deleted from their system. They honored the free oil change but had cleaned all the marks off our tires so we can't tell if they rotated. Suspect much?  I think so", "business_id": "nDJ9Pbt0RF6iXLgVzGyC3Q", "stars": 1, "date": "2015-05-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mKAjaoumV6-MZFUTP0Eznw", "review_id": "x0N2d-oizbM7CGE_oZwtSg", "text": "i have lived in Arcadia since 1984, and Tony's has been there all that time also - The Most Reliable Mechanic's Ever.  I have sent dozens of my friends there and they have always been treated right.\nI had emergency repairs this week and Scott and Ron took good care of me.  expert repairs at a reasonable cost - guaranteed work done by ASE certified mechanics.  No BS - just excellent, reliable service from real people you can trust because they have been in the neighborhood for over 25 years.  shuttle service to work and home, too.  Tony and his guys are the Best.", "business_id": "S1q51o5JqD5rzzDq_WD5_w", "stars": 5, "date": "2010-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZmT-oPPEMca8U1Ki78xSvw", "review_id": "sdzmH0XRHCP6fAjNIF0Zbw", "text": "Honest, Friendly and Caring.  These guys educated me on so many repairs/maintenance that I have been over paying for at my previous repair place. They did a fabulous job repairing my vehicle and they didn't gouge me. Thankfully a residential move brought me to Tony's, my new auto repair shop for life :)", "business_id": "S1q51o5JqD5rzzDq_WD5_w", "stars": 5, "date": "2013-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "BiZvuNKi0bs_YwttHhhq4w", "review_id": "0SJDvBnyCLl6TlODBYHiDw", "text": "These guys were fantastic. I have driven by them a million times and never noticed until I got a coupon book in the mail. Usually I'm not a coupon cutter and generally don't pay attention to them but being new to the area and not having a great car place yet, I figured I'd give them a try. \n\nI got a general oil change and check up on my car and they called me to let me know about some work they thought would be good to get done on the car. Nothing huge, but they didn't pressure me to get the work done then and there and even with them! He suggested some stuff that I could do on my own if I wanted. Pretty cool because I hate being pressured into things especially when I don't have a ton of knowledge on it.\n\nThey also have a courtesy shuttle - so not only did they give me a ride home, but they picked me up to pay and get my car. \n\nI will definitely be returning for the additional work I need as well as any general maintenance.", "business_id": "S1q51o5JqD5rzzDq_WD5_w", "stars": 5, "date": "2013-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BiZvuNKi0bs_YwttHhhq4w", "review_id": "OXpytzJvTjTyEqs-qyvgEQ", "text": "If these guys couldn't get any better.....\n\n\nI just received an email with a log in that helps track the work I've had done there...how cool!", "business_id": "S1q51o5JqD5rzzDq_WD5_w", "stars": 5, "date": "2013-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QkyvC01mExl6jvQjvDpWDw", "review_id": "-3DHcFQHV5PtRVlKVULvgA", "text": "AAA recommended Tony's for me and boy they were right. They always do a fantastic job with anything and everything. Most importantly...they're HONEST! We have been taking our vehicles to Tony's for about 2 years now and we are very pleased.", "business_id": "S1q51o5JqD5rzzDq_WD5_w", "stars": 5, "date": "2014-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 3}, "user_id": "-tjest9KLtzl_7iselznuw", "review_id": "OEuQYN12hX0VuFYm-c50oQ", "text": "This doesn't really fall into my 'eat it, drink it, sleep with it, or bet on it' criteria but I had to write a review for them. I first took my car to the dealership to get an alignment. They were going to charge me $69.99 and they told me it would take nearly 3 hours to complete. WTF?! I said. 3 Hours?! I told them to go screw themselfs and left. I was determined to find a place that could get me in and out ASAP. I jumped on good 'ol Yelp and searched car alignment. A few places popped up but Sears stood out, so I went. I walked in and Terrance greeted me with a nice \"Hello\". After getting the initial paperwork filled out he told me my car would be ready in about an hour. I thought I miss heard him and asked him to repeat. Again he stated my car would be ready in an hour. Holy Shit! I was expecting about 2 hours, but 1?! That got me kind of nervous. How good could a job be if everyplace is telling me 2+ hours and they can do it in 1? Well a GREAT place like Sears can. I had just enough time to walk over to Target and buy a few things before I got a call telling me my car was ready. All done in under an hour and for only $70. I will be coming back in the future", "business_id": "cX0BRezhCTm-pkK8_lwWAw", "stars": 4, "date": "2010-03-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "JYGg2Rfbv77HhhSknG8skw", "review_id": "F80WYde9pRAgIJ7JyvL2Hg", "text": "I have never been so disappointed in an oil change! First they took my car and told me they would contact me when it was ready so I was free to do some shopping in Costco next door.  They never called.  I walked back over to pick up my car to find they never touched it and refused to work on it.  They said they heard a noise in the engine and would not tell me what it was.  (I had it checked out at different place).  Sears told me my engine could blow up at any moment.  All that was wrong was the O2 sensor was broken (nothing to cause and engine to blow up).  These guys were just lazy and did not want to do any work.  They chose to scare me instead.  I will never go back to a Sears Auto Center for anything.", "business_id": "cX0BRezhCTm-pkK8_lwWAw", "stars": 1, "date": "2011-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Iycf9KNRhxvR187Qu2zZHg", "review_id": "rRMyYt3Tdjsvjssd7j35Tg", "text": "Took my commuter in for an oil change and was very pleased with the cost and speed that it got done.  The location is perfect as well to just take a walk over to Costco to shop or snack while waiting.  \n\nFYI Check for coupons on their Yelp page before going it might save you some money like it did me :)", "business_id": "cX0BRezhCTm-pkK8_lwWAw", "stars": 3, "date": "2012-04-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x5-yK8bmjQTcMrlWLfgJEg", "review_id": "ca-xz9pUVMmmc6V66aWnsg", "text": "Quick Work, local business, Mike the owner was honest and to the point and replaced our blower motor for AC lickety split for this upcoming HOT weekend-got us our vehicle back the same afternoon.", "business_id": "3r8xc7tYfRsK6-wdf8knlA", "stars": 4, "date": "2012-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "VyYuIY3BN2hdlMx_7dRdCA", "review_id": "OlBQjJK73bmTlif5muQYzg", "text": "Super disappointed in the phone mannerism of the staff. Can you say \"no thanks.\" The story:\n\nI found myself in Phoenix, AZ with two bald tires and I really needed to get new ones. The person on the phone was a JERK. He didn't listen even though I told him that I had the tire size off of my tire. He said, \"It may not be the right size, just tell me what car you have you probably don't know what numbers I need.\" Why? Because I have a va-jay jay? Really!\n\nHe also said that the last person could have used the wrong size... really? I also bought those at a Firestone in San Diego, CA. Nice... talk bad about the people in your network.. makes sense.\n\nSo, I went to a different store where they were awesome. The reviews on this site are spot on for this location. Maybe Firestone should take note that the person answering their phone is an IDIOT and do better.", "business_id": "Q_ntUL08gNFpCHhJALwQFA", "stars": 1, "date": "2014-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qooDq5pr_TnIywcvipR7OA", "review_id": "I5K5rTWWFpModazZI4BGBg", "text": "Fantastic experience. Andy and Ivan were exceptional!!! The operating hours of this location are one of a kind, thank you!!!!", "business_id": "Q_ntUL08gNFpCHhJALwQFA", "stars": 5, "date": "2015-05-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FoicZBlNzNP03vywff1Vrg", "review_id": "AbHNZEXXretizxppm06i6A", "text": "I needed an appointment right away due to screw in my tire and they took me next morning; very friendly and helpful; review my car; explained it all to me with fair pricing and concerned that I (and my car) were taken care of. A much better experience than at my regular dealership. Thank you.", "business_id": "Q_ntUL08gNFpCHhJALwQFA", "stars": 5, "date": "2015-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qIdRUJd-dyGcWtgjqvgeKQ", "review_id": "H_Fj9l2i4LPwxjMD4Eurgg", "text": "Exceptional service and assistance. Ivan was a great technician!", "business_id": "Q_ntUL08gNFpCHhJALwQFA", "stars": 5, "date": "2015-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "v_7GWnUYHuPKtAILkchYRQ", "review_id": "8fEcJZ_1iPeecFtRCua7mw", "text": "I just love these guys. Best mechanics I've ever had. I have a 13 year old Volkswagen that has spent its entire life in the desert. Montz pays attention to how I use my car and tells me when I need repairs and when I can wait a bit. I have come here for three years, have never had reason to question a repair and I trust that they are knowledgeable, use good parts, and only fix what's is needed.", "business_id": "8wF2zj1Np6x7DY5BpJ4C-w", "stars": 5, "date": "2015-05-01", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "2FiNCj5rM3nF0qgaWf86Gg", "review_id": "frjy6p_3v1pM18ESzS2vDw", "text": "This place is now called A&J's Discount Automotive Care. \n\nThese people have done quite a bit of work on my car, from major replacements to minor repairs and oil changes. \n\nAt the time I went to them because they were convenient. They do a decent job but they are very overpriced. You can get equal or perhaps better work done with friendlier service from several auto repair shops in Phoenix. \n\nI do not recommend this place.", "business_id": "Y1ReKMzP5pl76oDUrheaBg", "stars": 2, "date": "2009-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-9yHfTdtM_-nK-4Iplj7Cg", "review_id": "BKVkicfKBKhiDSVo3IhLVQ", "text": "did a wonderful job on my car! Fast, affordable and reliable.  Disregard the negative review, they did a great job.  I will continue to go to them when I need a car doctor.  Amazing customer service! Highly recommend this place", "business_id": "Y1ReKMzP5pl76oDUrheaBg", "stars": 5, "date": "2012-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1X-Ik6PHoxnuGwB8W5hE1w", "review_id": "rssorC0XOsNMyrPNsxauRA", "text": "Take your vehicle here, ask for Oscar. He's honest, reliable, and knowledgable. Good people work here. I discovered them by chance years ago and now take all of my vehicles here. They get the job done right, fast turn around, and at an affordable price!", "business_id": "Y1ReKMzP5pl76oDUrheaBg", "stars": 5, "date": "2014-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mMSWtsCiMkzGtd1aMhh5VQ", "review_id": "9aW-roc-6cefEsC_86Uw9g", "text": "I kept getting suckered by the coupons, but I've stopped going here since whenever they \"fix\" something, I often find myself at 25th St Automotive a few weeks later getting it permanently fixed.\n\nBut, they do free brake inspections and if you make sure they install OEM brake parts instead of advertised specials which WILL squeek badly then BM can be a good option.  For that service alone I wouldn't write them off.", "business_id": "5m1L5l_k2xFTZO3jttmVOg", "stars": 2, "date": "2011-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IC1rNlFJSzEJK8AFfDlfcg", "review_id": "WNQbV-NwMLRgpAeG6EVoXw", "text": "Fast, efficient and honest service. A bit pricey, but the shop nearby would have taken three hours minimum and cost more.", "business_id": "5m1L5l_k2xFTZO3jttmVOg", "stars": 4, "date": "2014-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kG5qfayYnULas_kNgKxwWQ", "review_id": "BXIFIf4u-2A9sa1JBjuJmg", "text": "I feel like my family and I have gave this business a chance (since they've been okay to us in previous years, not to mention how they're less than a few blocks from where we live) but I feel this business is failing. We had taken our vehicle in for a simple oil change (we were going on a trip and wanted to be safe) after getting the oil change, our vehicle started to stall, and not want to start up, eventually we took it back, and to their surprise nothing was wrong with it, I felt like \"Did they even check it?\" Frustrated, we took our vehicle back home (thankfully it started) yet the problems still happened, and Brake masters had no answers. The next time we took another one of our vehicles to the shop since it was having a problem that needed immediate attention, we took it to Brake Masters at 5:10ish (they CLOSE at 5:30) they rejected us, and said we can bring it back in the morning, and that they were closed, I felt that a business is has hours of operations for the customers regardless if they close in 15 minutes or close in 2 hours, they did not even want us to leave the vehicle there overnight. I will NEVER do business again with this company (or this location). We ended up calling AAA and having it towed to their business. I DO NOT RECOMMEND THIS BUSINESS!!!! They come off as nice guys but in the end they're lazy mechanics.", "business_id": "5m1L5l_k2xFTZO3jttmVOg", "stars": 1, "date": "2015-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "K_gNqlirV0kppqCGnfGiOQ", "review_id": "b38_SZaLSsDLbw1_c2bHAA", "text": "Cliff and Craig took very good care of me and my 2008 Honda Civic and made a long-time customer out of me.\n\nAfter having my oil changed at a shop down the street that quoted me in excess of $400 for a myriad of recommended repairs, I asked Brake Masters for a second opinion. \n\nFirst and foremost, the customer service was phenomenal. The wait wasn't long to inspect and clean my brakes, flush the transmission fluid, and replace my air filters. The team communicated often concerning their findings and the cost was much less than the first shop. They saved me a brake job, power steering flush, money, and more importantly, time. I felt as though they valued my patronage and sought to provide the best service possible -- an invaluable yield for any service provider.", "business_id": "5m1L5l_k2xFTZO3jttmVOg", "stars": 5, "date": "2015-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-69HRk_D8Hq3Ki1cagvDcA", "review_id": "4EDsbbXP18t-3Ya1nZorrA", "text": "I went into this shop asking about if they can replace a fuel filter on my Chevy Malibu. The answer i got from the shop attendant was: \"You will have to replace the entire fuel pump assembly with the total cost of $770.\"  \nLOL\nI'm very much offended that they tried to con me. I had my fuel filter replaced before for $70 but all of a sudden it costs $770? \nI'm never going back to this shop again, i don't do business with Con artists.", "business_id": "5m1L5l_k2xFTZO3jttmVOg", "stars": 1, "date": "2015-03-31", "type": "review"}
