{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "bvu13GyOUwhEjPum2xjiqQ", "review_id": "hD8oO6oSGfCvsTKKey1Xow", "text": "If there was ever a \"get your coffee and go\" Starbucks, this is it. Right in the center of the Waterfront, this Starbucks has no sofa, comfy chairs, only table seating. I love the baristas here, But I don't like the location of the building.", "business_id": "3gmBc0qN_LtGbZAjTtHWZg", "stars": 2, "date": "2011-05-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "Od8AiI3NAJ0E18QkzQ2rnA", "review_id": "H8wZCAElfAfJ7hTzMsRhaA", "text": "Let me preface this by saying I am one of those bizarre people who does not like coffee. Given that, I consider it a testament to how absolutely wonderful Tazza D'oro is, because one sip of my friend's mocha and I was in silky, smooth heaven. I ordered the hot chocolate, which was every bit as rich and creamy as a hot chocolate should be. \n\nOn to the food - don't come here if you expect a wide selection of bites to pair with your drink. They only had a few options, but from what I could tell, each one was crafted with love, skill, and just the right amount of sugar. I had a fruit tart (berries and strawberries), which was a delightful combination of tangy and sweet. My friend had a very satisfying chocolate croissant - but to be fair, it's difficult to make a chocolate croissant anything but. I was so impressed that I took home an apple puff pastry and vowed to return posthaste. \n\nThis is precisely the sort of place in which Elizabeth Bennet would while away a dreary day, were coffee shops accessible in rural, Georgian England. I wouldn't suggest coming with a large group; neither the limited seating nor the ambience is conducive to that.  It's quiet and intimate - ideal to catch up with friends or bury your nose in a book.", "business_id": "83_p9vIqOq1TUIf3_GD7bA", "stars": 4, "date": "2015-04-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qDPHTcJ6VC2-O-aX6tjvkw", "review_id": "vzvHBlERk3JLbvChIB7M7A", "text": "My husband and I stopped going here, back in 2010, because of the bad service we were receiving. We used to call the servers \"Whole Foods Rejects\"; they were always cranky and we felt not welcomed, rushed. At the end of 2011, I think they got a new manager, the service has been optimal and we haven't stopped going since. Their food is delicious as well as their drinks and coffee.", "business_id": "PzG0XmAmtXFs6Fdnubf41g", "stars": 5, "date": "2012-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Eq9qSHcnA94JIzfYOWubPQ", "review_id": "gZjant1CpJ-Q8jQLAsKADA", "text": "The place smells awful.   Its non-smoking, but reeks of stale smoke, and when I spend 1/2 an hour there, I leave smelling like smoke.  This isn't an isolated incident, but it really smells every time I've been in there (at least once a month for the past couple years).\n\non the up side: decent coffee, decent assorted snacks (pastries, sandwiches, etc.), great location.", "business_id": "D9sHwmqlNkrVxmX-057i1g", "stars": 2, "date": "2009-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BXaBCikgbP1u9q18krhplg", "review_id": "M3oJFaBCWUHTVh6HtThtdA", "text": "Surprisingly authentic and inexpensive Italian coffee shop in a downtown area. I heard actual Italian spoken here with a news channel from the motherland on the TV. The place was packed on a Saturday afternoon and appeared to satisfy everyone who stood inside. My espresso was just as good as those I had in Europe. Hats off to La Prima!", "business_id": "SWzCFTM7KHc-MncD6xxOYQ", "stars": 4, "date": "2013-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "y9Q2mHM8av_2fiqvvers-Q", "review_id": "Jyipkj-Y26IWOIaX1C4wiA", "text": "After moving from my old house that was located half a block away from Biddle's Escape I was at a loss as to what I would do about my caffeine addiction, since there isn't a convenient local coffee shop on my end of the main stretch in Bloomfield. The Big Idea Bookstore is great but several minutes further on foot which is an eternity in the winter, (California girl here) and I don't consider Crazy Mocha to be small enough anymore. Plus CM only offers soy as a milk replacement which is atrocious in this day and age. \n\nThe Bloomfield Starbucks is much more conveniently located, and it has somehow managed to make its way into my heart despite my preference for small local coffee shops. I think the wonderful Saturday morning staff at this location have a lot to do  with that, as well as the fact that they offer coconut milk! The pumpkin bread, plain bagels, and mini black and white cookies are all dairy-free as well, so there's lots to choose from in the food department if I'm hungry. Yes, it's big business corporate coffee and the hours aren't ideal at this location, (deducting one star for that) but Starbucks does treat their employees pretty well and they've made great strides in the quality department recently. I think teaming up with a San Francisco French bakery and offering cold brew were genius ideas on their part. I'm totally okay with supporting my local Starbucks outpost staffed by genuinely nice people and supplied with products I'm able to safely consume on a regular basis.", "business_id": "E_-4Y9vn-u-dPgp33TLRUQ", "stars": 4, "date": "2015-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "joBozNOc199Yyee-cGlQZw", "review_id": "U-4EUUAg-AZoz2At-r_7zg", "text": "Everytime I go to the Coffee Tree, I am continually amazed at how disgusting the food is. I frequent the one on Walnut street where none of the food or pastries are fresh. I though the food at the S. Craig street store would be different, but i've been there twice and the food tastes gross. I'm eating an egg salad sandwhich wrap and the wrap tastes nappy and the egg salad tastes old. They charged me an extra .50 for a piece lettuce, .50 for a cucumber, and .50 for a tomato.", "business_id": "1qUYk564SajvwTtkNM6KJA", "stars": 1, "date": "2014-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x1tqIO9G1RX3qd6Y4TsHXg", "review_id": "--cf6jo32VAPqZs7XoHOHA", "text": "OK, so I promised I'd be back, and I made good on that promise. Went there this morning to refuel - this time with lattes. I must say our coffee was tasty and since we didn't go for foam, they were about right in terms of the volume. Definitely a great place to stop in for a cup of coffee from now on when I'm making my way to work. Thanks guys!", "business_id": "I2qqSBe5sWwE9pkC6PgmqA", "stars": 4, "date": "2013-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "c1qSD6NRfWkiI4lT9IBesg", "review_id": "hNcnuazkMaY3QZDn4mcqJQ", "text": "Very friendly staff, free wireless, and lots of seating make this a great uptown spot for a coffe break.  The atrium outside the shop is a great sunny spot to sit and read.", "business_id": "3rhh2kvu3F45jD_yCxdW6Q", "stars": 4, "date": "2010-03-02", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 0}, "user_id": "yujTABbdC1Y97qTrq0mw4w", "review_id": "eKqTqPUumnspQCXm4shtfw", "text": "I love Starbucks, and this is a great Starbucks because of the location and friendly staff, and there's a drive through now which is awesome. I never actually go inside because it's so busy all the time and the parking is always full. But it seems like every 1 out of 3 times my drink is either incorrect or poorly made. And when you're going through the drive through you're not exactly going to go back to get it fixed. Very frustrating. I love the iced green tea latte but they never make it the proper way and all the matcha powder gets stuck on the bottom or very clumpy. I understand they are so busy all the time, but I am paying for a quality beverage and deserve to get it.", "business_id": "UdcvNApAUs7Z7NkFSFTl8w", "stars": 3, "date": "2014-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Dzc2m6O4vaXCF4ztKPjTcQ", "review_id": "GpG1uwlm_sdlOUnjkABX-w", "text": "There service here is AWESOME.  I love coming here mainly for the service.  I don't have a favorite drink, but \"Mocha\" is a place where you can be comfortable enough to ask what a particular drink is and you won't get a snippy answer.  So I always try something different and I've liked every one of the drinks I've had.  I'm excited to try their iced drinks now that the weather is warming up.  \n\nI also like that you can now get a little treat like muffins or different breads.  When I'm in the mood for a coffee and sweet treat, they always pop into mind.", "business_id": "0ilWo2kWlmP_Nv-P2rcNOA", "stars": 4, "date": "2011-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AeargRrute0mYXS980sirQ", "review_id": "wWXFKnVaqoTcbtFfuLXFwg", "text": "Such a pain in the butt just to get in and get parked, but I was cold and in need of a warm up for my drive home. I figured it'd be a quick little stop, but it was more than 20 minutes to get back out the door on a Sunday afternoon (3pm ish) and that's just really unacceptable. \n\nFirst I waited in line for 10ish minutes. There was just one mom/daughter in front of me, but it took absolute ages for the guy to take their order and get them settled. At no point did the person working the espresso machine or one of the other two people behind the counter get my order so my drink could be started. \n\nThe ordering process was ok if a little fumbled, but at that point I was already wondering what the hold up was. \n\nI then waited another 10 minutes for my drink. The person working the espresso machine seemed incapable of making more than one drink at a time. Another employee couldn't get a container of strawberry syrup open and eventually three of them were working on it. \n\nIf this is how traffic moves through there when no one is in line, how do they handle a morning rush? \n\nIt's the only Starbucks between campus and heading back to Milwaukee, but I think I'll be settling for gas station coffee in the future - it's not worth going back for this and dealing with the hassle.", "business_id": "zUR94L72x2yUit8mGC2tgA", "stars": 2, "date": "2015-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qR6jQSCWN94STCjsnTU8vQ", "review_id": "ZAFk-WTRXScbaEYYw4YL1w", "text": "Kopi's okay, but there's nothing to really recommend it over any of the other coffee shops. The beverages are better than Espresso Royale, but I'd rather drink at Dunkin Donuts than Espresso. I have friends who really like the atmosphere, but I don't like studying in public, so I can't really say. I do like their baked goods, and the location is really nice, as are the outdoor seats.", "business_id": "yzInxReAkf7r0aRbwj02Yw", "stars": 3, "date": "2014-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5seXO9Jbtu6ypkLP04F0Ow", "review_id": "T5_yVm16z7wXuC5eHmRoJA", "text": "These guys are consistent and super friendly. As a former Starbucks barista I can vouch for them doing things by the book and ensuring that the customer always leaves happy. I actually come out of my way some days because they make the best extra ice, whole milk caramel macchiatos. Keep it up!", "business_id": "dSQh1Hx2BiSrYog4ad740A", "stars": 5, "date": "2015-04-09", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "VmbTDmF6Ib-wWtRzyM1fpA", "review_id": "m5LMBNelsOO4hGJPL9IWdw", "text": "Love Love Love a Hava Java! Their coffee is so good and it is always such a treat to enjoy a latte with my favorite girls! By far my favorite coffee in AZ!\n\nThe staff is super friendly and it is a great neighborhood atmosphere! Also, love the punch cards especially when I get a free one!!\n\nCan't say enough good things about Hava!", "business_id": "2h9LsLPdJ7OvZrYJZhVdAw", "stars": 5, "date": "2009-03-19", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "UNDGnZYW5vN5KK5ZgjZ9BA", "review_id": "P9wwddbie_EPlKf0H_68NA", "text": "great local spot. the atmosphere was cozy and relaxed. the clientele was country club. they have a great selection of different roasts and loose leaf teas.  \n\nI had a large chai tea with 2%. it was a little sweet but very tasty. \n\nthe staff was friendly and inviting. they have a fast free wifi available. \n\nit was not a bad place to get some work done. I didn't have a lot of loud tables around me. \n\nI will put this on my rotation of \"offices\" I frequent. \n\n#supportlocal", "business_id": "2h9LsLPdJ7OvZrYJZhVdAw", "stars": 4, "date": "2015-04-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "rR5W8Bj-IGu6sw1_1v4m7g", "review_id": "BGbKysir7QobZhOKPg9NVg", "text": "Great food, great prices.\n\nNot so friendly for computers; not a ton of outlets, and the internet was a little shaky upon the few times I used it.\n\nHowever, they have delicious knishes and ruggulah, and this little Jewess has to give them mega points for that, as well as their $.25 refills on the daily iced tea, and their amazing photos/books of animals waiting to be adopted. Broke my heart a little, and I almost went home with a 4th fur kid, but I love coffee shops that are actively a part of the community.\n\nMy favorite barista Meschelle doesn't seem to work there anymore, but I love the atmosphere of chill during the day, the books to read, and the drink AND food menus.  Great local, indie owned coffee place. I do wish they had more than one iced tea option, especially since kiwi strawberry seems common, and I'm not so much a fan.", "business_id": "Mb46iSlA4qmTwXf-WrqtQA", "stars": 4, "date": "2010-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "PBAqIiakxI1SV2R0lXew4Q", "review_id": "lGgLG-KAtFqQxcp5mnbMzA", "text": "I didn't get in early enough to get a better selection, but they made up the delicious maple bacon ones for me that had been recommended to me. Yum! And they open at 4. By the way. That is 4 AM", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 4, "date": "2015-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MoxaqGOOp8sxdlPZhDgIuw", "review_id": "jEIxc0Nhb5C5K31gRX5WoA", "text": "Staff is friendly and pretty knowledgeable. Got a cold press iced coffee, which is how you separate the wheat from the chaff, for my coffee money.\n\nSat outside at shaded concrete topped tables. A very enjoyable experience.\n\nIf i lived in town, this would probably be my go-to java joint.", "business_id": "4eFIVmbeCvJGCrhzmd-VYA", "stars": 4, "date": "2014-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 3}, "user_id": "UsULgP4bKA8RMzs8dQzcsA", "review_id": "BaFs8OZOdqR_9hpyL3LpEA", "text": "After my earlier mishap at The Coffee Buzz, I decided to give Seattle a shot. \n\nI never even knew this place was here until I came across it on yelp earlier this week. \n\nIt's a bit dark inside, thy have a pastry case but it needs a makeover, maybe the darkness is what makes it seem uninviting? \n\nI order the same thing here, an Iced Dirty Chai Soy Latte. \n\nThere goes another $5, but at least this time it was worth it! \n\nDamn Delicious, I taste the spicy chai along with the perk of the espresso and it wasn't overpowering either, I appreciated that. \n\nIt was a perfect balance that had me zippin' all day ;-) \n\n4 stars for my drink, although I think they could make the place feel more welcoming by brightening it up in there and offering some more food items.", "business_id": "C5TGxBqOae4uKCtpHGFMEw", "stars": 4, "date": "2009-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "04xW5mhSBaCzpjbcf2VSZg", "review_id": "VhiWMwr3XGFEQIjwCLfokA", "text": "This is a starbucks. How sweet and not like coffee do you like your coffee?", "business_id": "uFR7CpDJlW-gNdmk-zhIGw", "stars": 1, "date": "2013-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uY0iNbXyG5hod5KvD_JtDw", "review_id": "ynONFezcOJG9rEgRb6GXxA", "text": "Drive thru takes far too long and parking is terrible in the morning. If you have the time to wait then the staff is very friendly!", "business_id": "aNlPj3bFJBK69J0OLksAGw", "stars": 3, "date": "2014-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lC4X2crUuxT9Ac9BlOX4Uw", "review_id": "GhyP0UHliWfpVLHjIkBVIw", "text": "Funny, I don't actually drink coffee. But sometimes I love a good coffee shop. High Speed Internet and delish scones, for one thing. Wait that was two things... Anyway, Coffee Rush has a terrific view of the lake and a nice vibe. Although I'm disappointed to hear of Mackenzie's experience.", "business_id": "l1MZjZK2tLxfFRB62lQmsg", "stars": 4, "date": "2007-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "iKDDbFu1lyA8-CVlGLFHcw", "review_id": "jssLrHrHWkJJFut1SwYt5g", "text": "I am addicted to coffee. I know, it's a problem! :D Buuut I wouldn't say I'm an expert. So excuse my own way of describing what I like and don't like. \n\nThe coffee here is the perfect \"strongness\". The taste is perfect for me, strong enough without being bitter and gross. They have a great variety of espresso drinks like mochas, black and whites, mint, etc. All really good. The baristas have quite the showmanship. They are quick, precise, and do some cool tricks as well! \n\nThe atmosphere is okay. Fine to study but not exactly cozy to hang out. There is free wifi which is a plus.", "business_id": "l1MZjZK2tLxfFRB62lQmsg", "stars": 4, "date": "2012-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eRkrYWYXYNcsIzyCkEsTMw", "review_id": "saqZxp8EsAQEw1-hjMza1Q", "text": "I feel like not enough good things can be said about this place. The staff is lovely, and I don't frequent as often as I wish I could, but the gentlemen remember my drink order! Thanks for the personal experience.", "business_id": "l1MZjZK2tLxfFRB62lQmsg", "stars": 5, "date": "2015-03-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fkNlToqwq2HNT15ubLDtNQ", "review_id": "J3uONvL_pveqguD0-qbTnQ", "text": "Service is awesome and their dark chocolate iced blended coffees are to DIE FOR!! Way better than Starbucks", "business_id": "iwzHQ7aBPrxKybarW5q5TA", "stars": 5, "date": "2014-05-11", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "y3d4v0x-vD10hw-O0YKa1Q", "review_id": "XXNMCBc3r-Tpe5tRya7-7g", "text": "Great place for a business lunch or lunch with friends.  Had a fabulous sandwich, grilled ham and brie, and roasted green bean salad.  Nice, clean, friendly atmosphere!", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2009-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Hyf725qMfNI5T-52UK9tpw", "review_id": "qgMuvtqrC9LaVtieI649Eg", "text": "I LOVE this place (Liberty Market)...have been many times for both lunch and dinner.  Big fan of the sweet potato salad for a side. The atmosphere and food are outstanding. They have a great patio and really cool bathrooms (be prepared, they're unisex). \n\nThe location in the heart of downtown Gilbert is also very cool...great to go for a walk after your meal. \n\nI'm a harsh critic...hard to give 5 stars to anyone (would give 4.5 if allowed).", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 4, "date": "2010-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r1jeWJCyZ9xLr-ECuMnQPw", "review_id": "wLy-gUhDHssJ0osFxZuPoQ", "text": "Loved it, great food good selection, goodmluck finding a seat!", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 4, "date": "2011-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8B5pqCDFglMvfW7qj5W8TQ", "review_id": "reayC74c04EiwEFO3ZS61w", "text": "Love, love, love Liberty Market. I've only been here a couple of times but it's been awesome each time. The service is great and so is the food. I recommend the Italia sandwich.  This place is always busy and is a testiment to their product.  Go. Eat. Enjoy.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2011-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_xt9upq-UIMNFFFbklranw", "review_id": "DEYrHyH5gpe0OF70zlfFbA", "text": "The sticky bun is where its at!  Delicious coffee drinks. The  sandwiches are good too. Pressed of course. Staff is always very nice. Lines can get very long during lunch and on weekends but usually move fast. Great place!", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 4, "date": "2012-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m9_1jCgU7mvSkL6oLPJT5Q", "review_id": "ZIyfDwAN9ry_UyaNymv2mA", "text": "Mmmm...rice pudding!! Trust me...it's INCREDIBLE. No really, TRUST ME!!\n\nSo, obviously (well, obviously), we came here for dessert...and oh wow. So good. The line was a little long...and let me tell you it got even longer after we got in it. but it was worth every second of the wait. Aside from the rice pudding, we also had the bread pudding, which was really great as well. \n\nI am so looking forward to my next trip to Phoenix to try some of the delicious looking pizza. Definitely a cool hangout in Gilbert.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2013-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Mb0psF4WQF7gZSuZafVr-g", "review_id": "fp6smdttL4Bahsmwdt27LA", "text": "Haven't reviewed this place in almost 2 years.  I should probably update!\n\nLiberty Market appears to be very popular, always busy. Some nights they have chef's specials.  Tonight was one of those nights, and that's what I ordered (the rib-eye).\n\nFirst, it was overpriced (probably the only reason not to give them 5 stars tonight).  But it was cooked perfectly, and had a nice sauce.  The accompanying potatoes and broccoli (from Agritopia) was very nice.  A solid four-star dish.\n\nThe others ordered a burger (with chips) and a pizza.  They seemed to enjoy them.  The prices on those were also a bit more reasonable.\n\nService was very good.  We were greeted several times between the door and the counter, and a woman I think was likely the owner checked on us later as well.\n\nThis remains one of our favorite American cuisine restaurants with a unique flare.  Not ostentatious or snooty.  A casual elegance.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 4, "date": "2013-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LDRtaMlVVeJ1e5zkKiLxIQ", "review_id": "PtLTDnWmLMhjon7aYqRh3w", "text": "Food here is delicious.  Make sure you try the egg salad sandwich and vegetarian pizza!  Service is sketchy sometimes but otherwise worth the wait.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2014-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8_73fcoqMyrH27GdXJ9g8g", "review_id": "tyA6y9idrOgwFi8XqerDlw", "text": "AMAZING no matter what you eat or drink at what time of the day.  FANTASTIC!", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2014-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pZIPlg99mgdxa5RFLdgeEA", "review_id": "w7d-sOCdFOA0WsIn8nLkKQ", "text": "Food is excellent, but a touch pricey. Still, I go back . . .", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 4, "date": "2015-03-21", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "fdGD4mHVoPEFCUlmWKds8Q", "review_id": "t0ZRGtM3SIahrK71JHf9BA", "text": "Blessed are the hipsters, for they shall inherit the Liberty Market! They bring us BeeGees blaring in the background and shopping carts as decorations.  But the cliches are forgiven. The place has style AND good food.  I ordered biscuits and gravy, a relatively difficult meal to screw up (and yet many do screw it up) and it was stylishly served and very very tasty.\n\nDoes food taste better on a square plate? Does food taste better when sitting on vinyl green booths? The answer is clearly yes....come enjoy....", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 4, "date": "2015-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "NLDDaat42UQXQCOpU4e2TA", "review_id": "XOxvpltqGRQThkWByx46EA", "text": "Hmmm, I think I need to return once/twice more before I see what these other reviewers have seen.  Coffee houses are difficult though because they are SOOO much alike.  House coffee?  Better than Starbucks (but not as good as mine).  I would, agree, however, that the service at Jolta Java is terrific!", "business_id": "I2_yeLfTzXHGwi8an0tL4w", "stars": 3, "date": "2009-03-15", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "usVjrAeJ7uWuoU4EbR8uqw", "review_id": "dVxBo6m-FuV8AinQNxv8zA", "text": "The reviewer who called this the best European bakery got it right.  Amazing breads and baked goods, terrific sandwiches, and European style service - which means brisk and impersonal.  Never rude but never friendly.\n\nThe sfogliatelle is the best in AZ, far surpassing the frozen husks you'll find elsewhere and better that those on offer at Andreoli's (where they don't seem to mind selling burnt goods, and the service is equally 'European').\n\nPrices are a bit higher than mass produced goods, as they should be, but are reasonable for the quailty.  Make a visit, savor the goods, withstand the service.", "business_id": "o4v2m2kwWRVvrwYFjYcKaw", "stars": 4, "date": "2012-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "eXiHAxrnvE64j4wTEOTEMQ", "review_id": "OGr0HczAxbBYIj4d6-9isQ", "text": "This is the Starbucks closest to my work. I am here EARLY in the morning. The baristas know my drink. I barely have to speak which is good because my brain hasn't fully woken up yet. Great location...no drive-through but not a problem walking in as I am there at a time when there is rarely a huge line.", "business_id": "2jCyo55dFgGzYpoIX8TwgA", "stars": 5, "date": "2013-03-10", "type": "review"}
