{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "L9q9mSLtPbdXl9vY_ZfwjQ", "review_id": "Tb2JPdl6G56nSDKsE0z_ow", "text": "This place was really busy when we arrived so it seemed promising. Some of the food was good and others were sub-par.\n\nTwo of us ate the gyro platter which comes with: \nhummus (watery) \npita (store bought) \ngyro meat (I've never had gyro meat like this before, it was ultra thin and had a rubbery texture - also the portion was so small) \nGreek salad (iceberg with sparse toppings and too much dressing) \ngrape leaves (vegetarian but quite good) \nand rice (actually this was the tastiest thing on the platter - it had a nice lemon and chicken broth flavor). \n\nOverall the food was hit or miss. The most disappointing were the pita and the gyro meat. My companion had the salmon and said it was unremarkable. I think diners come for the cake which was eaten by almost every person in the joint. \n\nI also have to agree with some of the other reviewers, this place is disgustingly dirty. All patrons walk through the kitchen to use the bathroom which was really gross. The kitchen was not clean and our waiter had food on his hands when he served us. \n\nEven homemade wine and honey soaked cake won't bring me back again.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 2, "date": "2010-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Wy3vIi5meKekpDL_wJdy1Q", "review_id": "bLbIjq5PfYScCXtdgRBdcg", "text": "Had the chicken kabob and hummus. Didnt enjoy either, hence, the two stars. On the other hand, the bartender was really nice. Might give a second try.", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 2, "date": "2012-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vUjijMGo6KnfNyQfV0Eadg", "review_id": "nFkvsN0w-5YZfnkYtCz1cg", "text": "We will drive from Dudgeon Monroe to the East side for good falafel and gyros. The quality and service at People's Bakery are a great reminder why the (much closer) Biryani doesn't deserve our business. Skip the babaganoush, but make sure to grab a sweet treat for dessert instead!", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2012-03-31", "type": "review"}
{"votes": {"funny": 6, "useful": 8, "cool": 5}, "user_id": "AnH84g9V10x41CXmCvcaFg", "review_id": "S3YKQ1G4Q-hNqQ8YOZRyJA", "text": "Yusef's is my old standby place when I crave middle eastern food, Lebanese style.  The Gyros are excellent, right down to the pickle and the sweet onion... mmmmm.  The portions are generous, and everything is always well prepared.  They serve a hummus dis that I really like... it has beef and pine nuts.  The baklavah is good.  They usually have several different varieties.\n\nThe place has always been run by really nice people, but the new owners are the nicest people yet.\n\nAbout a month ago, I was on the way home from visiting my cousin in the hospital when my growling stomach let me know that no food for 12 hours was not making it happy....  I ran into the store at 6:45 pm.  They close at 7.\n\nThe owners were at the front counter.... \n\n\"You're hungry,\" said the woman looking at me with concern\n\n\"yes,\" I nodded  \"Can I get a Gyro, or is it too late.\"\n\nShe looked at her husband... \"she's hungry,\" she said to him... \n\nHe hesitated.\n\n\"She's hungry!\" the wife repeated...\n\nI knew they had probably cleaned up already and were getting a sandwich even though it was inconvenient.  I was so grateful.  It was the best Gyro I have EVER had...  \n\nI stop there about once a week now, on my way home from the hospital.  I get a few groceries and something for dinner. I always get there by 6:15 though.", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 4, "date": "2008-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "54w6Vv5Ke-HPusac0N69fg", "review_id": "NoT7u9LQZWi9HFf8UR99bg", "text": "Excellent food and service. Very authentic cuisine. All homemade and fresh. Falafel amazing. Chicken kabobs delicious. Rice is gluten free!!!  Truly wonderful service. Will definitely come back!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2014-04-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "VBrGyYgMR_Jye_LQHGaWDQ", "review_id": "p5z8NvnrgRCic42IYwfs0A", "text": "This place was transplanted directly from the Mediterranean to Mesa! Came during a weekday lunch rush. Staff was extremely warm and helpful. I ordered the fish entree. Food was prepared in about 10 minutes and was extremely tasty and authentic.\n\nIt s busy, yet not chaotic or loud. There is plenty of seating space and it is shared with their supermarket. The crowd was a mix of Mediterranean natives and other, giving this place native cred.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xsq2uST0rhcCz30k94bCaw", "review_id": "HxY7PCT3JQtQvKnC9gprvQ", "text": "Great restaurant. Really delicious food and good quality. Place is very clean and owner is a really nice guy. Highly recommend you check out this Tempe landmark (:", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2014-05-22", "type": "review"}
