{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vCbB1R32o2VvLLzTyvbF_Q", "review_id": "ypFh4hhK-P9Fmm20SZ4hng", "text": "The food is the reason to go. Lunch specials are a great deal- about 9-10 bucks for lemongrass soup (spicy broth with cilantro, mushrooms and tomatoes), a spring roll and entree. I would recommend either the red or green curry as both are spicy, flavorful and contain meat and tons of fresh veggies. The pad thai is decent and for those that do not like thai food, there is a chinese menu on the back that my friends contend has been general tso's than the authentic chinese places close by.", "business_id": "Lm_mR5xDF91OeZw97ch41g", "stars": 4, "date": "2009-05-13", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "ZDsneygztCiyFpkwSV0oTQ", "review_id": "Nec5Js3691yWBTzyBG7LJA", "text": "I was SO in the mood for Mexican I could taste the salt water of the Gulf all the way from Pittsburgh. Unfortunately, my favorite Mexican joint was closed, Lot 17 smelled like the day after a frat party, so Thai Cuisine it was.  So - you know when you're really looking forward to one thing, so the next thing will just stink in comparison? That's how a felt. Even as a Thai-lover, I just couldn't imagine anything other than chimichangas, and I don't even LIKE chimichangas.  Well, Thai Cuisine turned my Mexican frown completely upside down.\n\nI started with the fresh Thai rolls; a deliciously fresh spring roll that almost gave Trams' spring rolls a run for their money...almost.  For my main course I chose the day's special - Winter Curry with Shrimp.  A delightfully sweet mix of large shrimp, perfectly cooked potatoes and vegetables PLUS an amazing thai-type of squash similar to pumpkin swimming in luxurious creamy curry, this meal demands a return trip. Terrific, simply terrific (BYOB, btw).  Our server was incredible to boot, so yay for Thai Cuisine.  Kind of a boring title though - might I suggest \"Thai My Hands & Call Me Satisfied!\"  Wait - no, that came out wrong...", "business_id": "sxeuOMBRllOHXJTaUlI9kQ", "stars": 4, "date": "2012-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x0_2_AqZK6la80JPHfZZaQ", "review_id": "EQXHerJM-AP71oYgsKX0cQ", "text": "Went to Thai House on a Thursday around 8PM.  A few others were in the restaurant but not crowded at all.  Like other reviewers, I liked the dress of the servers and the decor of the place was pretty cool.  I sat in a booth by myself and was immediately greeted by the server with a menu.\n\nI ordered a Green Tea Sake...SOOO GOOD!  It came in a little glass bottle and it called Sake2Me.  I plan to buy it!\n\nAs I enjoyed my sake, I ordered the steamed shrimp dumplings.  Totally not what I expected...two roll-like, dough things came out and it tasted like it looked...just like raw dough stuffed with lots of crunchy lettuce-like pieces and tiny chopped meat.  I didn't see any shrimp, not even mini shrimp.  I was thinking they brought me the wrong item but when I didn't eat my dough, the waiter said \"You don't like your shrimp dumpling?\" I didn't have the heart (or the energy after a long day of travel) to say anything except \"I want to have room for my Pad Thai\".  So, I awaited my Chicken Pad Thai hoping it was what I am used to.\n\nThe Pad Thai wasn't bad...not great, but not bad.  Once in a while, I got the taste of mayonaisse but I was starving at this point and it did the trick.  i actually took it back to my hotel for lunch the next day but decided in the morning that the taste wasn't worth the risk of Pad Thai all over my rental car.\n\nI'm not sure if I'll go back to Thai House.  i will certainly look for an alternative next time I'm in town.  If I'm starved and can't find any other place, I'll probably give Thai House another shot...I'll just stay away from anything that says \"dumpling\".", "business_id": "DReLu6HuFOm4p-jYZpgQkw", "stars": 2, "date": "2011-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "c0hq7q12Sz7xlYbYICYnkA", "review_id": "pT1JMaGjSRzzwE6ieK4NsA", "text": "Really good food. Excellent friendly service. The staff were sincere attentive and kind. I ordered the Ga Prow aka Ka Prow Chicken. It was flavorful and spicy with fresh vegetables and basil. The lemongrass soup had fresh veggies and mushrooms. It was also very flavorful and delicious.", "business_id": "f9WqdqHuZtwg41HDLSKaPA", "stars": 4, "date": "2011-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WamxpfK5P_qeZ73NTOWCwQ", "review_id": "0v2M62u_brYAQrdQYnmS4A", "text": "the 1st time I ever had Thai food was here, this place is so wonderful!!! Feels like your at Mom's house being served hot/fresh, delicious food. Sweet Sweet, fast wait staff, lovely environment\nIf only I'd written this review so much sooner *smh* soooo yummy", "business_id": "0lFRJ0q1PU_R4YaLNRWnpA", "stars": 4, "date": "2012-05-14", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "gcyEUr4DXcbjnGRAWFtfAQ", "review_id": "yzhzYb9O_B5zjpb-G_fmOQ", "text": "4.5 or maybe 4.6\n\nFinally got to try Wild Thaiger. By what I have read and now I interpreted the menu, I thought it was just fancy schmancy version of my fave Thai dishes. Since I'm not one to mess with classics, I didn't know how I'd like this spot. Wifey told me that tonight was the Thai New Year and they were going to have live music and dancers, so I figured uck it why not. What an awesome meal.\n\nWe started with the veggie sampler ($12.95) as our appetizer and a big ole $5 Thai beer. The sampler had the corn fritters, veggie egg rolls and tofu in peanut sauce. The corn fritters were other worldly, totally killer, I really enjoyed the tofu and the veggie rolls. What a great way to open up the meal.\n\nFor our meals, we split the Seafood Panang which was shrimp, scallops, mussels, calamari and salmon in a spicy red coconut sauce. The ONLY part I didn't totally love was the calamari, it was waaaay chewy. Every other part was perfect. The shrimp were sweet and succulent, the scallops cooked to utter perfection, the mussels were done the was they're supposed to be not chewy, tender) and the salmon was something to slap my mama over. \n\nThe other dish we had to split was the Merry Mu (grilled pork served with coconut rice and carrot \"relish\"). The pork was perfectly seasoned sliced large pork pieces, the coconut rice was a sticky ball of semi sweet rice (not my bag, but I think some people would like it) and the carrot relish was more like a sweet carrot salad. It did come with this really peculiar (in a good way) green salty/bitter sauce that I kept going back to. I realized a piece of the pork, with some of the sweet carrot salad and the sauce had the total package. Wow. \n\nWe ended the meal with a stiff cocktail (I had this cosmo thing with sake, cranberry and lime juice that I had them serve me in a regular cup instead of the martini glass so I didn't look like a nancy) and wifey had a big ole slice of chocolate cake. Triple decker and all.\n\nWe ended up leaving around 720 or so, and the music was SUPPOSED to start at 7 but we didn't get to see it. Nevertheless, it was an awesome meal and I'm super stoked to have that cool Thai spot within walking/stumbling distance to the casa.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 4, "date": "2011-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "q3Fa0PhTGzRl-05fXHIi4g", "review_id": "ECYE7oKApEjkEMZhTyq9YA", "text": "This was my first experience with Thai food and I am proud to say I am now a believer!  Showed up at 8:30 on a Tuesday night, the hours said they closed at 9:00 so I was a little worried they wouldn't be very happy with us but we were greeted with a smile and taken to a table.  It took a little bit longer than normal for our waitress to come take our order but she was especially friendly so it wasn't too bad.  We ordered the Turtle Island Crab appetizer, I got the Beef Mangone (I didn't want something too crazy on my first adventure with Thai food!) and my friend ordered the Pad Cha Seafood.\n\nThe Turtle Island Crab was amazing!  My only issue with it is that I wanted more!  The wonton crackers were perfectly crispy, the crab and avocado blended together great and the dipping sauce that it came with was sweet with just a little kick.  My mouth is watering just thinking about it again!  My Beef Mangone was equally as impressive when it came out.  The presentation itself was beautiful and once I dug in, the flavor didn't disappoint either.  The beef was tender, the sauce had a bit of a kick but nothing crazy and the veggies were cooked perfectly and complemented the meat nicely.  I was nervous to try my friend's Pad Cha Seafood because it had been rated 3 peppers which equates to \"Thai Hot\" but I was glad I got the courage to do so because it was delicious too!  Everything was again cooked perfectly and the sauce was pretty hot but not unbearable.  I can't wait to go again and find something else to try!", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 4, "date": "2013-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G6spp--JFW-7TZ9-r0AWUQ", "review_id": "Ypgt2s5AzRsRpnD-9_mN0g", "text": "Food was good but soup wasn't hot.  Service was incredibly slow even though no one was in the restaurant but a couple other two tops.  I'd come back but try a different server next time.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 3, "date": "2014-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aKMvjDOzHsoZhfkPlu56Kg", "review_id": "62V5mT5cgKkRpMT5VeIysQ", "text": "I was at wild tiger on Sunday evening, and they were a little bit busier than I think they were prepared for. I was ordering food to go and sitting at the bar and the bartender didn't recognize me or say anything for the first 5 to 10 minutes of sitting there while he took other people's orders. A simple, \"hi I'll be with you in a moment\" would have been delightful. After he took our orders the food took a while but that part was okay. I was watching the kitchen and seeing one of their kitchen workers in OPEN TOED SHOES and one of their chefs dropped a lid on the floor, picked it up after kicking it around a bit on accident and put it back on the can. This open kitchen allowed me to see a whole different side of this venue.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 2, "date": "2015-03-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "ZaPWHZi1qzoHPo7AWbF8Bg", "review_id": "a7KlzRZRWX2jLIOTNstQeA", "text": "One word: phenomenal. \n\nAmazing presentation,  amazing execution, well portioned. Everything on your plate was seasoned and served a purpose to the experience of the dish\n\nTruly a special place and worth the drive from anywhere.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 5, "date": "2015-04-26", "type": "review"}
{"votes": {"funny": 5, "useful": 7, "cool": 7}, "user_id": "4UUIpbOTPmu43wuC2aSGkg", "review_id": "OBoHyvNYF-scROfZnONTow", "text": "Mmmm.... Thai Lahna. \nThai Lahna is the person you spy from across the room that you're not too sure about but then after talking to them you find out that they're pretty damn cool. Yeah, that's my Thai Lahna.\n\nMy group walked into the store front restaurant and were greeted immediately. Some of the crew had already arrived and arranged for a large table to be assembled. Nice! We sat down to look over the menu. I already knew that I wanted to order the pad thai because that's my \"test dish\" for thai places I've never been to. I also selected the masaman curry. There were six of us and everyone got dishes to share. \n\nWhen the food came out, it was a TON of food. We decided to do the good ol' Yelp Conveyer belt (chomp, chomp, give). My pad thai and my curry were spot on, and perfectly spicy. Everything I had was very good. I don't think I had an issue with anything. \n\nSo why not a 5 star review? Simply put it's not the best Thai food that I've had, but it's pretty damn close and the service was a bit lacking. \n\nThai Lahna is a must try if you're in the mood for some savory, spicy food!", "business_id": "wct7rZKyZqZftzmAU-vhWQ", "stars": 4, "date": "2009-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "GrSixRnGIxNUJ1Cn5DNX9A", "review_id": "k6JSPiphf-Hqi4cX5Ax13Q", "text": "Was the first Thai restaurant to nourish me with curries and noodles when I moved down to Phoenix and as such it holds the pole position when the call for massaman arises. Friendly family service offering all of the Thai standards we expect.  Fill up on the classics but don't leave without savoring the Mango with Sweet Coconut Sticky Rice dessert.", "business_id": "wct7rZKyZqZftzmAU-vhWQ", "stars": 4, "date": "2014-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yzG7qvuLG73CvzxDMDizvQ", "review_id": "R5FLOQFoFbnL-ZX49yBtqQ", "text": "Went here one night for take out after going to zumba across the street.  The tom yum was delicious and spicy.  The thai beef salad puzzled me because it had all the cooked part at the bottom and had iceberg lettuce on top.  That was probably a good idea to make it travel, but not a fan of the iceberg.  And when I got back to my hotel room and had no utensils I was annoyed, but the soup was good enough to sip from the cup.  I will probably try it again and skip the salad.", "business_id": "nefBMCGgMPvOnASoyO_X1A", "stars": 3, "date": "2013-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yaX8lKBp15TXDmzvvCk42Q", "review_id": "Yp7Ii1U741roJdEzoaQpVA", "text": "Great foood. Great service. Great lunch specials got more than i expected. excellent flavor. Mom and pop literally work together. fantastic . Thai hot is really hot they dont expect people to order it they are surprised when people do but i like hot. and its hot but awesome. Great job keep it up!", "business_id": "nefBMCGgMPvOnASoyO_X1A", "stars": 5, "date": "2014-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6x0FU0k-31HYps6nAwFDsQ", "review_id": "_R0vyjTJtcYIvDTTweUMZw", "text": "Wish we had gone to our regular thai spot. Went with a group of 4 (Asians) and none of us really liked our food it was such a bummer. We left more than half the food on each plate and didn't ask for boxes. They added gratuity so we ended up paying 100 dollars for about 4 plates of food we didn't really enjoy. Bummed about this place!", "business_id": "nefBMCGgMPvOnASoyO_X1A", "stars": 2, "date": "2015-05-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "eqLyJc0htu8MMpVGHN4bpQ", "review_id": "7C3VECSWFraZtJ7qW31OHQ", "text": "Very good food.  We had the spicy more noodle soup and lemon chicken.  Portions are large.  Interior is remodeled and looks much nicer than when it was Neo Tokyo.  Glad they also deliver!  ---\nAdding more after the last review.  We got delivery from Savor Flavor and it wasn't as good.  Hmmm.  Maybe they need to work on their delivery.  Spicy Korean soup was bland this time.", "business_id": "GBN0-wo_cHLnC_pwoOTIFQ", "stars": 4, "date": "2015-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XNYN12TMBPs13s4Qo9eWdQ", "review_id": "8eEPyhTErLQ_uFpuyUTvwg", "text": "We've traveled the world and search for Thai food wherever we go.  From Bangkok to Myrtle Beach, without doubt we've eaten some great meals.  But there's no place we love more than Thai Basil in Phoenix.  \n\nWhen it comes to delicious Thai cuisine, Patrida and Norman Fite run one of the best restaurants ever.  And, the service?  Exceptional.  There was a time when they had a difficult manager, we'd eat there anyway (it was kind of like going to Seinfeld's Nazi Soup Kitchen!).  That manager has been gone for over a year, Patrida is there many days of the week, and the feeling of Zen has returned.  \n\nWe love you, Patrida.  We're sad we've moved away.  Dinner last night was DELICIOUS!  But food aside, seeing you made our night!  Trust me, if we're ever within a 100 miles of you and Thai Basil, we're eating lunch and dinner at your place until it's embarrassing!", "business_id": "K4DHwck_2ds1wURnmZdFiA", "stars": 5, "date": "2014-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "-l3JUkVxUj2e7Q9u42bzJA", "review_id": "-q_GFbtMz6f1ZvM8Lydvmg", "text": "Note:  We ordered delivery, not dine in...\n\nThe Pad Thai was good, not awesome, and just spicy enough (I asked for middle spice).  The Lard Na was sub par - the noodles came pasted together and had to be separated one by one.  There were eight small (quarter size) pieces of beef.  I asked for spicy, but had to add sriracha from home to get the plate spicy enough.  \n\nThe food was good, but not $11/plate good.  They do, however, have free delivery!", "business_id": "vtQOervVVTXjhvSZQiZ6PA", "stars": 3, "date": "2010-03-11", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "3gIfcQq5KxAegwCPXc83cQ", "review_id": "96iMDEgMMFdsmk7yJKU8MQ", "text": "I went here last week with a friend after waffling between here and Thailicious. Full disclaimer? Thailicious is better, but they have better deals here. They have dinner specials for about 9$ that comes with a salad with peanut dressing, an entree and a spring roll...not a bad deal. Also, the portion is large, I had more than enough for lunch the next day (and the flavors were better the next day too). I had the spicy noodles at a 3.5 heat level and it was spicy, but not burning my face off. My friend had the pad se ew and she thought it was ok... nothing special. At the end, we wanted to try the raved about coconut ice cream, but they brought our check without asking about dessert and promptly disappeared... so that was that. This probably wouldn't be my first choice of Thai in the area, but I would go back. \n\nPS When I walked in, I almost had a heart attack because they had an ATM sitting there... is this place cash only?!?! Oh no!.... No, they do take cards...phew!", "business_id": "vtQOervVVTXjhvSZQiZ6PA", "stars": 3, "date": "2014-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "TZbyfvyV1Bx9H48pwVLaJw", "review_id": "qXM4xIZo2bmIT8M4FFOlKw", "text": "Sad to say I used to like this place, but had to downgrade my review. Repeated inconsistent service and food quality have made this place hit or miss. I honestly thought they must have sold the place or gone under new management, but I spoke to the owner who told me she has owned it for the last ten years. Startlingly, she told me herself a lot of the issues come from cutting corners to save money. Twice we ordered red curry to go which is extremely liquidy/almost soup like. The literally packed it in a tin foil homemade \"boat\" in a typical square styrofoam to-go box so of course I didn't make it back to work with it it spilling out everywhere all over the bag. When I called and spoke to her and asked get about the packaging she first said that is how they always do it. I explained to her we have ordered many times before and it has always come in a styrofoam cup with a lid and she said that they only do that for the entree not the lunch special because the cups are more expensive. I kindly tried to explain there is no way you can expect a liquid to not spill out of a box that is not sealed. Needless to say customer service was not a major concern for her. Let me add hat they also have recently raised there prices again and reduced their portion s izes. The amount of rice is only about enough for one person and they charge extra if you ask for more rice. On a good day the food has lots of flavor and is well prepared which is why I still gave it any stars at all.", "business_id": "RFeDe3fNr14kvUKlVx6_4w", "stars": 2, "date": "2012-03-10", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "vUM21g3cPEdSlI89oDttgw", "review_id": "jfrg3C89rfXt4kIiBoo6Vw", "text": "Ugh!  I'm a huge Thai fan and this place was completely icky.  What I love about Thai food is that it is flavorful.  \n\nI ordered my usual that I get from every Thai restaurant I go to...just see my Yelp profile.  Their pad won sen was flavorless and had some of the weirdest ingredients.  I didn't want to finish it or take it home because it was so lackluster.  My friend ordered their garlic chicken which was just okay.  The amount of garlic they put in it should have been shared with my dish.  Yikes!\n\nIt was merely a place we chose randomly and I don't ever want to eat there again.  There are too many tasty Thai places in the valley to waste my time here again.", "business_id": "kaeF6dd_f_Hd7raszKWAWg", "stars": 2, "date": "2013-03-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8RNm-Oft6BsUWsXIdiLAUg", "review_id": "Ca7rfPivoph7NvzgkwU4VA", "text": "This is one of my old standbys.  Great for takeout or eating there.  Its never that crowded and the food is awesome.  My absolute favorite is the green curry chicken.  If I could be sure no one saw me, I would lick the bowl!  The japanese teppanyaki beef is also wonderful.  The meet is super tender and the noodles are delish.  The malaysian cashew beef and lettuce wraps are also great choices.  I like the varitey they offer, lots of different asian flavors.  I'm moving farther away soon and am bummed it won't be right down the street.  But I'll still make the trip!", "business_id": "H7KzlC0-o1wIhlGg-Me5Ag", "stars": 4, "date": "2009-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wn0TEWkpZMtQrt2l4TvFrA", "review_id": "xybgZ2hFi79jCVQtNj2r1w", "text": "Ever since I've been in Phx, I've been looking for good chinese food...\nFlos is ok, but that's about it. There wasn't anything about the food that wowed me or makes me want to drive up to North Scottsdale again. I will say that the wonton chips are yummy, but that's not enough to keep me going back.", "business_id": "H7KzlC0-o1wIhlGg-Me5Ag", "stars": 3, "date": "2012-05-21", "type": "review"}
