{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Fr12lvqUHN6dE5fJ5mMysQ", "review_id": "7z7dhutekRNgBS69gA_b3w", "text": "My mistake that I went to Namaste India with my cousin. \nPappad were served in the beginning and that was the only moment we could afford a smile! Rest was a complete disaster..\n\nWe ordered aloo tikki and \"much recommended\" samosa Chaat!!  Samosa chaat was cold to touch- looked like a heap of poorly cooked samosa.. worse was the RED CHILLI powder used as garnishing ( we asked it to be a bit spicy- our fault) ..that too in plenty... we could have used that amount of red chiili powder for cooking food for some 6-7 people!! Taste was below average...\n\nwe could barely think of ordering main course after the initial encounter.. Malai kofta is what we ordered besides daal... Malai Kofta looked like stuffed with samosa!! ( Pun intended) ... bland and tasteless.. NAAN were good ..thin , baked properly...out only consolation... No wonder we left half of the  ordered dishes...\n\nWorth mentioning is the fact that..Kohli's store is adjacent and we saw some samosas there..I wonder if the ones we had at namaste were part of the same deal? \n\nPlease beware of this place- you may end up cursing yourself for your visit later on... as we are doing right now...", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 1, "date": "2009-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z5Y8aIWjwyaa0110WAZorg", "review_id": "H7MMPgped5AVWxWc6U1Ktg", "text": "Friendly, kind staff and good service.  I'll go here again and again, for eat-in or take-out.  I don't really have any favorites here...everything is tasty!", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2007-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ieEvibXI7RQH3SNkDxsI8Q", "review_id": "WIngg6NVePeJdm6ZSXl5zA", "text": "Delicious food! The decor is a little lacking, but the food was so outstanding that I have to give it 5 stars. We had 3 types of bread, along with goat mango curry, chana masala, and chicken tikka masala. All of these were excellent, with fresh flavor and nuanced taste. We asked for a spice level of 8, and the spice was spot on.  Flavors were so without being muddled. \n\nI would definitely, definitely return next time I come to Pittsburgh.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2014-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mSCI-yd6d8HsFX0zaGIYmA", "review_id": "70FIl-e343ncKXMZRr7MIQ", "text": "Maharani is one of our best Indian food places for me and my wife. It's not too pricey but classy enough to bring my in-laws when they visit, and I  always anxious to impress. The food is delicious, the wait service attentive. The butter chicken is the best in Charlotte. The only regret is they don't have mango lassi on their menu.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 4, "date": "2014-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uBUGZtTxmaG-8YpUWpU5_Q", "review_id": "FUpn-hTVwdNWNBu-15xewQ", "text": "Even though I have earlier commented on the costliness of their meals, I have to say that their food is very good, eating-wise.\n\nTheir chicken tikka masala  is tasty.  The sauce alone is a meal over their nice rice.  Not much chicken, but it really is the sauce anyway.\n\nSo with the naan bread.  They have the tandoor oven so the bread is cooked with some char and retains its soft texture.  Naan for dipping is excellent.\n\nWhen calling in for a take out order, they tell you 20 minutes, but apparently they do not start cooking your order until after you arrive and have paid in advance.  Their phone rings continually, as there are many who order take-out.  Four people were waiting with me last night who had called in.  All of us had been told 20 minutes and it took that amount of time or longer to actually get your order once in the door.\n\nNot many happy campers last night.\n\nSo...sit down is better with your time than take-out.  Remember to order a bit more so you will leave satisfied.  And if calling in an order to-go, expect to wait at least 20 minutes before you can leave.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 3, "date": "2015-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GVdRbXRU-jzk11FwMy8nug", "review_id": "Hyt9dMA3IClWcQrPTU_YYg", "text": "Ordered online and the food came delivered and some spilled out but it was really good!! I just wish it didn't spill out. My only complaint. So driver, easy on them turns!!", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 3, "date": "2014-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SegEWzRkkMgZLvSCr4byfg", "review_id": "lz3qqvyUkqExX-1Xqk023Q", "text": "I'm not biased when I say, humble little joint but great North Indian food. Have been here for years, buffet and dinner and always come out very satisfied with no issues. Remember, it's all about the food here and not the atmosphere although it is clean and friendly.\nIt may be a bit dimly lit at some of the tables or booths but they will rectify it if you bring it to their attention. The owner Anil is always happy to have you back and he'll make sure you are pleased.\nIt's located in a partially vacated strip mall on the southwest corner of 28th drive and Bell Rd. just one light west of the I-17 frwy. You might still have to squint to spot it from your car, on the inside corner of the elbow. Follow your nose once you exit your car,you can't miss it. Take some home...it's always a tad better the next day..besides you're home too!!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2012-04-26", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "QrOSr8bzAjpIgyNftDLUBg", "review_id": "PzOe3t_bCv7RTOp4ZJxOyw", "text": "Time has not been kind to Flavors of India.  I just went back for dinner after a couple of years of inadvertently overlooking this place.  It appears that the management has changed and FOI is not better for it.\n\nPerhaps the lunch buffet is still a good deal for the quality and quantity of the food they serve.  For dinner, it's offensive to charge $.99 for a side of rice to go with an order of Chicken Tikka Masala.  It's not an issue of the cost, but the principle of the matter.  Obviously, I'm going to order the rice.  Just up the price of all the dishes by a buck and throw us a bone with \"free\" rice.  And nearly $3 for a bowl of soupy Raita?  They need to change the name of this place to Nickel and Dime.       \n\nFarewell, Flavors of India, farewell!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 2, "date": "2008-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gb4VcUNOJsLJ0UvResJSaA", "review_id": "7OsSzp1s5rFXFuFZBGBTtA", "text": "On occasion I crave Indian food. This is not the best, nor the worst I've had but I too concur that FOI isn't at the same level as it has been in the past. The servers and preparers are exceptionally polite and lovely, but the food was not as flavorful and savory and I remember. As I pick at the mango pudding and the carrot pudding (which seems like a dessert that is sweetened and full of butter) I will go over the highlights and lowlights of my culinary adventure- I enjoyed the spinach/cheese mixture; one of my go to dishes. The chicken tikka was ok, and the tandoori chicken was a \"B\". On the flip side, the assorted fritters had seen fresher days and the vegetarian/cabbage dish was not very flavorful, IMHO even with the big caraway seeds. The seeds were huge - to the point I was routinely picking them from my dish. Kudos to Yelp which enabled me to have another helping of mango pudding as I write this. Seeing how there are/were several Indian diners here, it can't be too bad.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2013-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "orqBjz-TCSHn7nLnoWio_Q", "review_id": "5Ioi26pQwc6N-Nw9epuMww", "text": "My favorite Indian spot in AZ! I love everything about this place. The owners have always been super friendly to us. I've never tried their lunch buffet but their dinner service is phenomenal. The chicken vindaloo is my favorite dish along with the garlic naan. I love that you can choose the spice level on anything you order. I like my dishes spicy... Even extra spicy and they always accommodate.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2015-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8cJ-n5BEb1LAR0qFM9zrxg", "review_id": "zA4ECylLvjOsEaXOKQWKtQ", "text": "We returned to Star of India recently to enjoy the lunch buffet on a weekend. The restaurant was pretty empty the last three times we've been here--I hope that's not a bad sign!\n\nThe buffet is somewhat limited as others have noted. There is stuff to make salad, plus about 8 entrees, various sauces, rice, naan, a few desserts, and Indian tea. Everything is quite delicious, but if you are looking to sample a wide variety of Indian cuisine, this won't quite do the trick. The entrees are quite filling though--I really had to press myself to try a little bit of everything. You will leave feeling like you just ate enough to last for two days!\n\nI find the staff to be quite helpful and friendly, as well.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2013-04-18", "type": "review"}
