{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "OH7IB5YVhs41H7x4dHpuNg", "review_id": "NTMbAREsqVF_QQcAf0aJBw", "text": "This is a good fishmonger in the heart of the West End. \n\nA good array of filleted fish (some whole, trout & salmon mostly), mussels, scallops and prawns. The majority of the shellfish has been thawed from frozen (as you'll find just about anywhere these days), however quite a lot of the fillets are fresh. You can also buy frozen if it suits your needs.\n\nI have been in many times now and have been more than happy with both their fish and shellfish - their uncooked king prawns (sourced from Spain) are of excellent quality and size (avg 12-14 prawns / kg) and given the quality, reasonably priced (about £14/kg).", "business_id": "W3THJEcoHZZKgdJJdiFIWw", "stars": 4, "date": "2011-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pMPsr2-5IWBFNPro0CG6zQ", "review_id": "OuJbFZEWwSUqV5PC_I2bpg", "text": "This place was reasonably priced with great live music and locals. Was there on a Sunday night, still very lively and funky!", "business_id": "XeX67II3LlNJ49-sg4gDig", "stars": 5, "date": "2014-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "yFsgPc5zqJJZNBllTf4MSQ", "review_id": "hdkrG-JhhKyOU8-GyGt6hg", "text": "Mais oui, nous sommes maintenant a Paris, non?\n\nPetit Paris is the most authentic French restaurant I've ever visited in Edinburgh!  From the tiny restaurant space, which feels intimate (and occasionally far too hot when it's busy) to the French waiters to the truly authentic menu, it really is like visiting a mini Paris in the inauspicious looking Grassmarket.\n\nThe food is excellent: for main course, I had the coq au vin, my companion had the sausage, and for appetiser the terrine and the escargots.  We were blown away by the food - although it is heavy so definitely go hungry!  The wine was also great - recommended by our waiter, whose service was attentive but not overbearing.\n\nIn general, highly recommend.  Just be prepared for the heat and intimacy - I promise, the food and service will be well worth it.", "business_id": "L5cQjBQu6qnV_grmvk-drg", "stars": 4, "date": "2010-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "MQ1QQ8WVVAI3EZpMyP_6yg", "review_id": "of4KKVEdiRPyGgUu1Z98Lw", "text": "How did I even end up here!?!?! I have not got a clue, but I sat for a good hour or so and thought it was perfectly average.......\n\nThe selection is much what I expected, soup, all day breakfasts, paninis, burgers, scampi and such like! I ended up having a coffee and taking advantage of the free wifi. Coffee was alright, not the worst I have had, but not the best.\n\nI then decided to have the very tempting sounding Sweet Potato and Chorizo soup. What a let down it was. I do not know if it is a Scottish thing, or an Islander thing but I want to be able to stick wallpaper up with my soup! This was a very orange looking dishwater. It did not taste of much..... and more to the point no chunks of sweet potato.... or chorizo!?!?! I ate it all but was not very satisfied at all. \n\nSo basically I would maybe go back, but might avoid the soup next time just incase!", "business_id": "8RXIwWR34JunHKd00UU4wA", "stars": 3, "date": "2012-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-ZOyUKJ8d30debwzj1FN7g", "review_id": "MFUALpO3UDFdTu9uztV11w", "text": "Hamilton's has raised the stakes for what a neighbourhood bar should be like. It's modern and comfortable, it serves good food, the staff are friendly (and attractive), and it's got WiFi. \n\nThis place is owned by the same lot responsible for Treacle, although, in this instance they seem to have got the mysterious alchemy of how to create a decent bar right. I actually managed to spend around nine hours here once; I nipped down in the afternoon to use the WiFi and ended up staying for dinner and drinks. The bar has a great selection of drinks (including my beloved Zybrowka vodka) and the lovely staff will happily do table service and keep a tab for you. My only complaint is that the nachos are a bit rubbish.", "business_id": "KqgeyLdYbfsd9veyR6UGtw", "stars": 4, "date": "2010-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QYS29txRosYV2mGu68Cnhg", "review_id": "nSPTXqvmlbORHh1w2RNedA", "text": "Located on the touristy (and often over priced ) Royal Mile I was surprised by how affordable the drinks were at this place.(and despite the name-pun as well!Sorry couldn't help it!)\n\n We obviously had come an perhaps the wrong night as there was a stag and hen party going on at the same time. Watching middle aged women in very tight polyester tube dressers seductively (aka as drunkenly) pursue the middle aged men who swaggered with a I'm-Daniel-Craigs-sexier-brother attitude , provided plenty of entertainment for us. But despite its surprisingly clean and well decorated interior nothing else made it stand out as a bar. It's central and affordable and won't break the bank. (Sorry!)", "business_id": "zBG2vQ0A6F5HQkv_aeWfAQ", "stars": 3, "date": "2010-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Eshh2wcI4SHdj9UJ024xyg", "review_id": "wBiFMuV4ro_zKdujop6z6g", "text": "The moody candle lit interior and attractive drinks menu seem to be a consistent hit with punters as I always see a busy Bar Kohl.  They claim a large selection of as they put it 'vodka in the freezer' such as Moskovskaya Limon and Wyborowa. I've never heard of them either but they do taste bloody good.\n\nMusic tends to be on more mellow side of hip/hop and house so expect a lounge-esque backtrack. Prices aren't the cheapest either, this is further exacerbated by a complete lack of offers or discounts. For this it gets 3 stars.", "business_id": "QPsNlmETw14k-_RqX-RULw", "stars": 3, "date": "2010-05-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "oSA746-4MCJpWorJkzxqpQ", "review_id": "7utEzlGhAfueMIQPhj7AbA", "text": "I still love this place.  Have been back a few times over a few visits in Edinburgh. And it's still charming with great drinks and yummy food. Whee!", "business_id": "rkk2gLhqB3P5lwaGeBiDqQ", "stars": 5, "date": "2011-04-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XV6347X2iSGMb2gICfyXcA", "review_id": "WkYxICfGaY_G10jCsiVheA", "text": "A real let down after all the hype about it.\nNothing particuarly special and i have seen as good in pretty much any museums science corners.\nThe building is also rather vile/blatent in sticking out in its surroundings.", "business_id": "Rza-FztnKi8YfcSkn1KxgQ", "stars": 2, "date": "2011-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pAZYqb6OuPjlHF7AeGy6uQ", "review_id": "COAxzXfAoJxc_xnNI_mptA", "text": "In need of a sugar rush to propel you up Cockburn Street's hill? Then head to Toddle In, where you can get your helping of old fashioned goodness.\n\nFrom sherbet Dip Dabs to timeless bon bons, Toddle In has a barrel load of jars stuffed with every antique sweetie imaginable. \n\nWhile nibbling on some tablet, you can also pick up a cup of tea, or get some ice cream for the kids. If they're whining about having to walk up 300 steps to get to the Royal Mile, a 99 cone will silence them for the duration. And with that 5 minutes of serenity, you can indulge in a double nougat.\n\nA winner with tourists and nostalgic locals alike, the Toddle In brings back the taste of the 40s to a wide audience. Your teeth might crumble towards the end of the experience, but you can deal with that later. You should do as Toddle In's name suggests.", "business_id": "POabgnQCv-GgefKBD2BZoQ", "stars": 4, "date": "2010-04-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "qXLte7ikUM-__NHU5RaUgg", "review_id": "OXPC3S6Z-VvPx0km-maycg", "text": "The real home of whisky..........!\n\nWow the selection of whisky in this bar is well superb, with staff who seem to know the history of each bottle you can tell them what you tewnd to like in a drink and they will find the whisky for you!! Really awesome!\n\nThey also stock a gin from Islay, one of only two gins that is actaully distilled and its a cracker!!\n\nFriend commented, \" you know its a real pub they sell scampi fries oh and pork scratchings!!\n\nHard to argue with that logic!! In any case a  great wee pub!", "business_id": "xFz5u2Tgv1RYmqYZ9kUFFQ", "stars": 4, "date": "2011-05-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kJ1MpTeVyI4_2IGIcfu_jg", "review_id": "7xfqRLlf_UJNFkau2o-_mg", "text": "Getting to the hotel from the airport is easy: take the tram to Haymarket, then it's just over a block away. Kind of related, a US credit card will work in the tram ticket machines as long as you card has a chip. \n\nLocation is excellent. In addition to the tram, the Haymarket rail station is nearly across the street, plus there's a Starbucks, a Boots, and several restaurants within a couple blocks.\n\nOur room was in the annex on the west side of the street. Fairly old building. The room floor was somewhat uneven. Windows are high up so you can only see out if you stand on the bed. Room heater worked well and kept the room at a consistent, comfortable temperature.\n\nBed was fine; no issues with that.\n\nBathroom had some issues, though. The tub/shower sits on about a 10cm high stand so it's somewhat difficult to get in and out of (especially out since you have to step down quite a ways). The toilet is right next to the side of the sink, so when sitting you kind of have to straddle the sink. Towel heater didn't work. Shower had uneven pressure which would occasionally drop to zero for a couple seconds.\n\nWe didn't utilize the breakfast, bar, or restaurant so can't comment on that.\n\nWould I stay here again? Yeah. The positives of the location, cleanliness, staff, and value far outweigh the downsides.\n\nIf you have *any* type of mobility issues be sure you let the hotel know so you can get an appropriate room.", "business_id": "e8wCD4XNCcxSeTSrAU6xLA", "stars": 4, "date": "2015-05-22", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 4}, "user_id": "-QSNRIxny2I26yJT82OWtA", "review_id": "rzi4xGDUZSr4IcxJokEgwA", "text": "I had an amazing time here. We were looked after by the knowledgeable staff and had great fun looking at all the exhibits and mind bending illusions. I still love the room where it makes one person look tiny and the other like a giant. \n\nThis would be a great place to entertain kids on a wet day! \n\nNo wheelchair access as lots of stairs. \n\nGreat views over the old town and Edinburgh Castle. \n\nCirca £12.95 for an adult ticket.", "business_id": "-UwZsTF1q2xaSm4bI_Azqw", "stars": 4, "date": "2014-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FuFnWMGq3kXwP91fApoCYQ", "review_id": "SSM7N9vtjYOh2tUDxGvSoQ", "text": "vibrant place! very nice \"city\" feeling.\n\nI have been here alot of visits, i have never ate here.\n\nDrinks-different quality every time-from very good to not so good\nAfternoon tea-not so fancy, espacially scones was really poor, price was ok 25 for 2.\n\nStaff are ok.\n\nI do like this place.", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 3, "date": "2013-05-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "AAZZO8ZnS1BE2E1oXyy1uQ", "review_id": "60tI25VbJ-MKSwNdKfFwpw", "text": "one of our favorite hotels in the whole entire world.  great location, especially if you're there for the fringe festival, and room size and furnishings were closer to a westin standard.  as usual of all starwood hotels, the beds were heavenly.  the hotel designer must've had fun with the bathrooms, which are set off with smoked glass...bath tub, separate shower, mood lighting (purple, red, green, plain).  i won't tell you which color we chose.\n\nthe bar has a variety of scotch which was fun to sit ourselves down for a tasting after a long sightseeing day.  we ate at the bar a couple times and the food was really good - we missed american classics like a solid club sandwich and caesar salad.\n\nwe went last spring and the hotel is still on our mind.  i think they just went through some major remodeling so can't wait to see how it looks this summer when we return.", "business_id": "DIlh3Ta7-7tfjKL1apaYHw", "stars": 5, "date": "2012-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OTQ68fm6EtcPD2n0g6Y2mQ", "review_id": "uyRmq1DGUfZHIIzBlFVFXg", "text": "This place describes itself on it's website as \"the place to be and be seen\". Um, no, it's definitely not.\n\n\"Bang average\" is probably how I'd describe this place. I've only been once, and it was for a friend of a friend's birthday night out and they were all meeting in there, rather than going out of choice.\n\nThe first thing that annoyed me was that they're one of the many bars that serve drinks in tiny little glasses, like those ones that old people keep their teeth in at night. When I asked for a bigger glass the barmaid said I'd have to buy a double vodka, the single only came in the hobbit-sized ones.\n\nMy - or should I say our, as everyone in the group was quite keen to move on to the next bar after about 10 minutes - was that there was nowhere to sit. It wasn't particularly busy, it's just that there are enough seats for about 15 people in the whole place. \n\nThe only reason I gave it 2 stars and not 1 is because on my way out I noticed a blackboard describing their full scottish fry-up. Maybe it's a question of how mediocre everything else about this place was, but that fry-up made me think that the Wash Bar does have some good things about it.", "business_id": "ZRYZBtiRjjYqA8ohMoRn-Q", "stars": 2, "date": "2010-05-06", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "Vd4TWXD1uEg23vs0qWC_7w", "review_id": "gO5msqClfOtWb4WeHOSUGA", "text": "The atmosphere is wonderful. The food is meh. Everything that we had was pretty bland. We both had a hot salmon appetizer (mine had like 6 bones in it which was odd) which was ok. Then Sam had sea bream and I had daube of beef, both which were fine but nothing special. We had the rhubarb ginger creme brulee for dessert which was probably the tastiest part of our meal. I'd still recommend it just for the experience but don't expect much from the food!", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 3, "date": "2012-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G_S6EWanJ56vBKOnEED-8A", "review_id": "97pya0RapjpyVUH4VPv1SA", "text": "I had passed Biblos many times and always thought it looked a really lovely, chic, relaxing place to eat but as it turns out, its not that special! \nThe decor is dark and depressing, the staff seemed dazed and confused and miserable as sin, the food was bland and the atmosphere unpleasant! \nSorry guys but I don't rate it highly!", "business_id": "dXPmE2ncXbQTPBVNRODuNw", "stars": 2, "date": "2014-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Eshh2wcI4SHdj9UJ024xyg", "review_id": "m2AJ28oHbhuSAgPICmzNpQ", "text": "Tickets for festivals, tickets for live performances, tickets for comedy gigs...it's all here accompanied by a quick and efficient service. \n\nLocated on Rose St, Tickets Scotland is a reliable vendor or everything tickets. You'll be paying the RRP price, however, and thus if your searching for a cheaper deal the internet is probably your only alternative.", "business_id": "IpXoy28ZBwwaFdoVasrTJA", "stars": 3, "date": "2010-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "zilKRrjiBqwOx9oLFczn7g", "review_id": "JfEc8TGK65jituLKqBi2Ew", "text": "Don't let the name fool you, this place is definitely more tex-mex than Mexican. The margaritas are strong and the food is tasty (regardless of its authenticity). Our waiter was really friendly and was on top of our empty glasses throughout lunch.", "business_id": "uwV0CKF9A5hBjTKLoplphg", "stars": 3, "date": "2012-04-21", "type": "review"}
