{"votes": {"funny": 2, "useful": 5, "cool": 2}, "user_id": "pnIi4DGnSBrBfE6IMqx-UA", "review_id": "YULxh71qYNw55apHC90Pbw", "text": "No pictures!  I knew I should have taken my camera!\n\nMy aunt and I went there today for Mother's day.  I think we must have gotten the lunch menu because everything looked pretty cheap (I've been to the one in Columbus).  My aunt had a chicken dinner (grilled chicken, green beans and potatoes with butter) and I had their Shanghai sampler which had a couple of shrimp, a couple of scallops and a nice piece of salmon, all done perfectly.  We didn't order dessert since my aunt had made my favorite pumpkin pie!  Anyway, dinner was great, and so was the service, thus the five stars!", "business_id": "usSROUMiAgPcxV3Ym0OxMQ", "stars": 5, "date": "2009-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6v9gdMMqB5h5qo3El3g5Dw", "review_id": "neDxNW8jn7t1JTtLze4F_A", "text": "I have mixed feelings about this place. I have eaten there twice. I have enjoyed the flavors of their Shanghai option both times. The seafood has been cooked well. The Sharkfin pie is tasty for dessert. However, both times, I had shrimp as part of my entree. Mitchells is a perfect two for two at FORGETTING TO DE-VEIN the shrimp. First time I ate there two of my shrimp were not de-veined. Second time there was one (I only had two). If you order shrimp take a good look at it. The management has been very apologetic and helpful both times. They truly cared.", "business_id": "usSROUMiAgPcxV3Ym0OxMQ", "stars": 3, "date": "2015-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "254KfTJ5pSoVAqtr2GkA5Q", "review_id": "gRoWiibavnc-8cPvimhqDA", "text": "DIDN'T EAT HERE...this review not about the food.  We went on Friday night around 8pm, there seemed to be about 25% occupancy.  The hostess asked us if we had a reservation, we didn't , and she told us that they were somewhat behind and that we would have to wait 20-30 minutes.  WTF?  We IMMEDIATELY left and frankly its not worth going back again.  shame, the fish was good there. Crappy hostess for sure.", "business_id": "z4cCguoHdU48pj6sXMIzqg", "stars": 1, "date": "2014-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qywVBBmOW9fbqWDi3XO8rQ", "review_id": "dsMSoIySRCBFEireSYkhag", "text": "we went three for st, patrick day. Two harps bottle beers and 12 oyster costs $40.", "business_id": "wHi8ODv7TGmeUB02XoX-mA", "stars": 2, "date": "2013-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "91nIj-xKzCvYdVGKSbu5eg", "review_id": "ZhyxBI1h3wV3wbvB93bz2Q", "text": "Stopped in to get a bite to eat and some drinks before seeing a show earlier in the week on a Thursday. It wasn't very crowded and we were immediately greeted and seated. Service was okay not the greatest but not the worst either. Waitress came off as kind of nonchalant, but she checked on us throughout our meal and according to other reviews doesn't look like they even got that. Kitchen staff was slow in execution especially for not having a big crowd. \n\nI wasn't in the mood for seafood so I opted to try other things on their menu \n\nLOBSTER BISQUE -- \nHuge portion. I didn't expect to get as much in the bowl as I actually got. Although shallow, the bowl is large and you get a pretty decent serving in it. Despite the size, the flavor was lacking as well as texture. I've had some pretty delicious basques before and think it could be improved with a pinch of salt and corn for texture. It's missing something. \n\nGARLIC PARM WINGS -- \nGot an order of wings and they were good. Not an over powering flavor of garlic and not super duper oily. They used real garlic and it was served with it - minced. The wings were deep fried to a nice crispness so it added a little crunch which I liked. Served with common celery and your choice of rand and blue cheese. Not bad. \n\nMARGHERITA PIZZA --\nLooks better than it tastes. This can be easily split between two people - not a single server. The pizza is cooked in a wood fired oven and made very thin so it gets a nice crispy crunch. The crust was actually very good. It has a good texture to it and the lightly char taste you get from wood burning ovens was nice. I typically don't like that taste. Though I enjoyed the crust and what not - there was like no cheese on the pizza so it was way too saucy and lack-lustrous. Not what I would have expected so I was quite disappointed", "business_id": "wHi8ODv7TGmeUB02XoX-mA", "stars": 2, "date": "2015-04-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oZORKM-OWL7gL8gH59znbg", "review_id": "vWEzL9rhk3pcQj5XMqTlmg", "text": "It was a really nice day out so my boyfriend and I wanted to go somewhere where we could eat outdoors. He had never been to Redfin Blues, so we decided to go there. It was Memorial Day, so we expected it to be busy, but when we got there they said there was only a 30 min wait. That was definitely not the case though.\n\nWe sat on some rocks nearby and waited for our buzzer to go off. We waited, and waited, and waited. There were many tables open, which I think was also confusing people that were coming in after us. We waited about 40 minutes and then overheard the hostess telling someone else the buzzers weren't working. So we turned in those. Even though there were a ton of tables open, we weren't allowed to even sit at them to get some drinks or eat chips, etc. We were told that they were pacing the flow of people because the kitchen was backed up, and that was the reason for the empty tables. ??? We were both amazed that we were not even allowed to sit down to get some drinks, it's their money that they lost I guess though.\n\nAfter waiting about 45 - 50 min, we overhear a tablet nearby asking about their food. The waitress tells them the kitchen is really backed up, so their food isn't going to come for about 40 more minutes but she could get them some chips, etc. (They had already been seated and placed their order about 20 min prior) After hearing that, we bailed. I sadly can't even review the food because the wait was so unacceptable, especially since we couldn't even sit down and get water or drinks. When we told the hostess we were just leaving, she didn't seem very apologetic either, all she said was a quick sorry. \n\nI really liked to stop at this place and get some lunch when I was riding my bike on the trail, but my boyfriend said he'd never go back.", "business_id": "41CXLCeB8z2oNdIOvnrzIA", "stars": 1, "date": "2015-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "doI46hR-6n0qMEK52DBIjw", "review_id": "NtXrX0lqzdZQCXnZsayaAw", "text": "Family friendly! While some reviewers may lament the outdated interiors, a feature that was not missed by me, I will merely say that Lombardozzi proved to be the best venue for our toddler that we have come upon in months. Our server did not know the difference between bolognese and meat sauce, but she brought soup and milk for our toddler faster than you can say pronto! She fawned over our daughter and made us feel comfortable. \n\nAdditionally, the owner and chef both came to our table to talk to us. My husband and I felt like we were eating at a friend's house, and that warmth is a hell of a lot sexier than any atmosphere we've gotten in a swanky Shadyside lounge. \n\nWe ordered simple pasta dishes: linguine and meat sauce, and spaghetti and meatballs. The pasta was fresh and al dente; the garnishes were tasteful and classic; the sauces were remarkable. \n\nI recommend this place for the food and congenial service. It would easily get 5 stars if we hadn't sat in the outdated bar.", "business_id": "YTqSkgOiiI9HG3hNH7ovfg", "stars": 4, "date": "2013-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1QNyeXl4AEizT2FWs7gNBg", "review_id": "eCIqJOFRlPiCLH0Y6I6AxQ", "text": "Service and steak fell short of expectations. No doubt this is a nice restaurant but our server was not attentive enough. She was no where to be found when we were ready to order and ready to pay. She did bring our wines out very quickly and made sure our glasses were filled. That I do appreciate. \nThe steak, both mine and 2 other were *bleh**. I had the filet mignon at medium which was cooked to the correct temp. But it lacked flavor. My friend had the sirloin and it too lacked flavor. We were both expecting big bold beefy flavor but it just wasn;t there. I think a burger king beefburger had more beefy flavor.\nThe sides were great! Loved the spinach and mushroom. \nFinally, the cream brulee was very good.\n\nSo, I came for steak and I did not get good steak here. I will not be back. Should have ate at Ruth Chris instead.. and its just 4 blocks the other way..", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 3, "date": "2011-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sqBKFxHXJYt2twzLmdLD3A", "review_id": "EQskP0NSGqdl2yx-ZWswVA", "text": "Very nice evening with few friends. Lobster bisque was creamy with nice chunks of lobster. All the steaks  where perfectly done. Most importantly the service provided was spectacular.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2015-03-16", "type": "review"}
{"votes": {"funny": 4, "useful": 3, "cool": 1}, "user_id": "OXzYyZSHo9Dl6Qd0s_o2Ig", "review_id": "RcIrmTvV2vDrE8p2rga0ZQ", "text": "Pecan-crusted mahi-mahi I love you but DANG you are expensive!!!  Having been at the new location twice now, I do have to say I approve of the decor and beauty of the new place.  White leather booths and soft lighting, who doesnt feel chic here?  \n\nThe service is a little spotty and whose fault is it if we are sat at the worst table in the joint when the place is half empty at 9pm on a Saturday night?  If I was first to arrive of my party I would not have approved but I wasn't the first to arrive so I had the pleasure of watching the scantilly clad escorts stumble to the restrooms all night.\n\nThe first time my friends and I were here the service was exceptionally bad and the food quality was spotty.  This time, things seemed a step up, dishes like the crab cakes that were barely edible before were now perfected (but too much breadcrumbs?) into crabby patties.  The mahi-mahi was light and hot in the center, perfection.  It came with fig risotto - (I could have made a meal just of this!!!)  Two glasses of mediocre Chard and my entree only and my tab was over 50 bucks.  So I do love your new location and decor and food LaVecchia, just cant afford you as much as I would like!  \n\nPer the 'patio' :  yall better hope you are with pretty people because that will be your only 'view'!  Lol!", "business_id": "TLrX4FECQDFz-E45TI_9ow", "stars": 3, "date": "2011-05-23", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "coftFpqseNc0yd2WKsLusA", "review_id": "-a3OgUcQT7LsVaDs_1A8oQ", "text": "I love a good upscale steakhouse and the palm delivers. I have only eaten here twice and will base my review on the bar service/dining experience alone. I sat at the bar on a Sunday night with Shannon the best bartender. She is so personable and just great at her job.  If you go before 7 any day of the week the bar food is discounted to a very reasonable rate. I tried the lobster roll and the steak sliders. Both pretty delicious. We also tried the beer carpaccio off the regular menu because I love beef carpaccio. A lot. A whole lot. The regular diner menu is a bit pricey but that's to be expected with these types of establishments. The carpaccio was amazing and the arugala salad on top of it was delicious. With the carpaccio I wish they didn't put grated parm on it (I felt it cheapened it-just go with the shaved fresh parm and call it done!) and there were no capers. I am used to having capers on carpaccio but to each his own. \n\nFor dessert (which I usually skip) I went with Shannon's glowing recommendation of the doughnuts. Oh. My. God. They are hot and fresh and delicious. Rolled in cinnamon sugar they come with two dipping sauces and some whipped cream. These are made for splitting I would assume because there were a lot of holes. But so good. \n\nI loved this place and I will be back soon. Hopefully to sit in the dining room or at least give a steak a try!", "business_id": "1gKBusJMk66ypwEKF0vOAA", "stars": 4, "date": "2014-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GUt8x1WtNX0GfqAEjIh9xw", "review_id": "q5sfVu5jhCCCvC0BaMYKMA", "text": "I went to Upstream on a Friday evening immediately after work (5:30'ish). The decor is excellent and romantic. I decided to sit at the bar and I have to say that the wait staff was so very pleasant and attentive. After my guest arrived we were given the open to sit at a table. The staff was very familiar with the wine selection and menu. I had the all natural chicken breast which was by far the best chicken breast I have ever had. The only small setback was that I'm a 30 years old energetic, fun loving female, and most of the patronages were 50+ and a bit snooty ( I say this do to the way some were addressing the wait staff...). Perhaps the time of day that I went played a role in the type of crowd I was amongst. However, I would go again, since the food was excellent.", "business_id": "BOp3jcpYy31M85H1DLnEEw", "stars": 4, "date": "2013-03-09", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "6RftcIURvQ1bmzXwXvmeAA", "review_id": "R_WrMgp8y13Lw7DjPhstzQ", "text": "This place is a total disappointment. Not close to being worthy of the prices they charge both food and drink and to top it off, the waitress was constantly rushing us. Will not return.", "business_id": "BOp3jcpYy31M85H1DLnEEw", "stars": 1, "date": "2015-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "01JQIjU6SVSSOq6U5RYsIA", "review_id": "ClPFi0rj7g8eyZ9vm4NURA", "text": "To say it's among the best in Madison would be an understatement. I can say that after one trip if they're at all consistent.\n\nFriends and family have been recommending this place for longer than I can remember. Although I'm in Madison a lot, I only recently got a chance to check it out. I can definitely say I'll make a better effort to get back because this place has earned its good reputation.\n\nI'm into spicy food, so I ordered the shrimp etoufée, advertised on the menu as \"very, very hot.\" I thought it was just right; the etoufée was hot enough to get the nose running a little bit without being overwhelming. The flavor was intense without feeling like you're being kicked in the mouth.\n\nI can't wait to try the rest of their menu.", "business_id": "cpGv6ES2hzPCtCUQgipwXw", "stars": 5, "date": "2015-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SHlkGMta-B3lXzlQBtrUvg", "review_id": "KHTqy45cOp-W6osvCPZjjw", "text": "This is the best Mexican seafood restaurant I've been to.  Yum, yum, yum.  I loved the chips and green salsa.  The draft beer comes in a huge margarita-like glass, enough for two people to share if you don't want too much to drink.    The Camarones Culichi was heavenly.  The service is friendly and prompt.  The atmosphere is warm and cozy, yet also festive.  The prices are extremely reasonable, especially given the quality of the food and the complimentary ceviche before the main entree.  Absolutely everything was delicious.  This place should be packed on a Saturday night, although it's okay with me if just a few people know about this culinary gem.  I want to try their tequila have my next birthday celebration here--drinks, awesome food, friendly staff--sounds like the perfect place for a party.", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 5, "date": "2010-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EGlqOFCbnrAEIvd86BS2_A", "review_id": "uFt5bFpWpYFY9LZzRrZ97w", "text": "This place was good, just not as good as I had hoped based on the reviews.  I would have given the place 3 1/2.  Since I can't, I decided to balance out another reviewer who gave the place 4 stars but also thought it deserved 3 1/2.\n\nPositive notes:  Hot sauce had some bite to it, chips were good, Camarones culichi had a wonderful sauce.  Lots of fresh limes served with the meal.  Full bar.\n\nNot-so-positive notes:  Shrimp in the Camarones culichi was overcooked (cardinal sin for a seafood place).  The shrimp coctail was just ok - good sized boiled shrimp, but not too much flavor.  \n\nIf driving by and hungry I would stop in again, but not if I have to drive too far out of the way.", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 3, "date": "2012-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "q5nFaw9isjD_01PpVAR7hg", "review_id": "V197F-5jqTXkQmAqVrzqiA", "text": "I really wanted to love it, but couldn't.  The food was good, but it didn't pop.  I had the garlic shrimp which had some nice flavor, but it wasn't unique and it didn't speak to me.  The guacamole was good.  The shrimp in garlic sauce was pretty good.  Service was solid.\n\nI might need to come back because the menu was extensive and it could only take one or two excellent items to change my mind on the place.", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 3, "date": "2014-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EDMHQcfkpBZhv2E3-2wKqA", "review_id": "JtGK5CTDLQKvEg_GcRJ8Ww", "text": "This place was ehhh...not impressed. The campechana was really small for 15.00.  The oysters were very small and dirrty. They didn't taste fresh either. 3 Carne Asada tacos plate has no flavor and it really didn't look like Carne Asada either. \nI don't get all these 4-5 star reviews.  The only thing good there was the waitress, who was attentive. \nDisappointed.", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 2, "date": "2015-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gzIK5Hp76w-p4Fo5crE4Ig", "review_id": "ZUQ2ZjaLvLXnYHc5wf3Jag", "text": "Excellent food!! We stopped here on our way through Phoenix to sedona and was really impressed with the food here. I ordered the chicken enchiladas and my husband got the shrimp tacos- both were super good!", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 5, "date": "2015-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iPuiVU0Wbq_p_i_VwrqiMg", "review_id": "m6xcDcLZRHby7mYOpPcW4Q", "text": "I have been here 3 times and have only had the chicken parm with pink sauce and it's the best I have ever had. \n\nThe atmosphere is very outdated - but their demographics are blue hairs, so maybe it's perfect for that crowd!", "business_id": "3CSaqRNvYg7ZdN2zwxwzVw", "stars": 4, "date": "2014-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "_gJnGS0wnZh5NODtXdiguw", "review_id": "Xr1GzucT16LPgR__N7uvhw", "text": "We went there bcz we were starving and I had worked 22 hours that day and had to get my car from my job near the Biltmore...fun rush hour traffic...I was brain dead but that food perked me up let me tell ya.. The waitress was super nice, attentive brought out the drinks no issues...like clock work....The food was the bomb of course I had the baby back ribs and bakes potatoes...it was delish......yummy...scrumches sauce was perfect tangy and sweet and super soft meat...like butter melting in ya mouth", "business_id": "gQjTs4BDNYSu9oJhkEsssw", "stars": 5, "date": "2014-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "IKVsfdmok6R0-A2-mcgWUw", "review_id": "jns6PDH5VD9H4x6KIZUNew", "text": "Loved sitting outside on a Spring night. We had 8 people at the table and decided to get multiple apps, salads and entrees and split them. It was excellent. Loved it all, salads were great as well as the steak. Definitely would go back.  Service was soild.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 4, "date": "2008-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "75ag2Y7YNHDohV7KWArWBA", "review_id": "1t8LNCJ2d113n8dSPsdJ7w", "text": "I consider myself fortunate enough to have had a business lunch here a few weeks back. The food was excellent. Steak and potatoes just what a man wants! It was very well done and finished with a 3 berry cheesecake. Worth the moolah!", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 4, "date": "2012-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "N5EEI8doKzKNxUMtpfcMaw", "review_id": "EEyqwiB02I0UD1nrvrSi-A", "text": "Amazing customer service by a young gentleman, Ryan. He had great recommendations and impeccable service. One of the best steaks that I've had! I had the bone-in filet with the Oscar (crab meat and sauce). I'm not much into chain restaurants, however, I would definitely come back and try another location.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 5, "date": "2015-03-16", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "E_PnFVd5jl0z3yqhqsxurQ", "review_id": "9klB3uBN95STs_133mveDQ", "text": "Since I recently moved, I pass this restaurant on my way to work every day. I decided to take my husband there and try it out after reading the many positive reviews on this website. We hoped the food would be just as good as a restaurant that has also been around for many years in our Colorado hometown where they serve fabulous shrimp, chicken and french fries. I have to say that, although there were many happy people eating here and the staff was incredibly friendly, we didn't think the food was good at all. My husband had fish & chips, and I had shrimp. The breading was SO thick and grease-laden, you could hardly taste the fish. Really unhealthy. Sorry, but we won't be back.", "business_id": "YxMnfznT3eYya0YV37tE8w", "stars": 1, "date": "2010-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UJMLFUm8AtF1fBw_TndCDw", "review_id": "55jEdMpAeeGcwM5_1SBg4A", "text": "Great shrimp that has a wonderful crust.  Always the large gulf shrimp you love.  Just added fish tacos which are decent but the shrimp is really why you come; and the fish is great too.", "business_id": "YxMnfznT3eYya0YV37tE8w", "stars": 4, "date": "2014-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "nP_vZUqkoajeBC4qTV0Mlg", "review_id": "hPQ1wfrVkTs0E745Bhj6sw", "text": "It's my first time in here. As server referenced, we ordered Mariscado and it was BOMB! I loved it!\n\nAll the menu are about  the shrimp, calamari, fish, and seafood. I would like to go back (ASAP!) to try everything else! LOL! Call me if you guys need a company :-p! I am happy to come back again! :)\n\nThe service was fast, although the server couldn't speak English, but she understand English. \n\nThe flavors was awesome, fishy but great! (Off course, it's a seafood restaurant, Duh).\n\nThe indoor decor very ordinary which is a plus because I felt like really in Mexico. From outside looked small but when you enter, it will be enough for everybody.\n\nThis place even have a musician to play the music as your requested, but he just say hi to us and left..lol...\n\nSo, Yes, I would like to recommended this place!", "business_id": "06YP_JnJzns84fOyQ0HA0Q", "stars": 5, "date": "2015-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IBxgFchRh2VblFbqCyvOng", "review_id": "9z0jXncsQv8zDHsXiO2Niw", "text": "Great Food, Great price, Great Atmosphere... \n\nHad a Large kirin, with 99c appetizer mushrooms.. best fried mushrooms i have had in a long long time.. California Rolls and Alaska Rolls also on this trip.. Very good, and FRESH...\n\nWife - Teriyaki Chicken,, very good even though all places only sell breast meat on chicken entrees... Portion size was huge comparative to the lunch pricing..\n\nI had the Calamari Jalapeno salad,, lots of Calamari, seriously was more Calamari than salad,, the dressing is unique and matches very well to the dish.\n\nIced Tea was definitely not china mist or nestle, or lipton,   very good also.\n\n2 appetizers with beer, and 2 full entree's for about 30 bucks out the door.. simply great.... Will definitely be back,, often\n\nThanks!!", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 4, "date": "2012-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PRL9t9kAO-YrdYCbbXIfYQ", "review_id": "kpVVkgmOcb9l4ZBhb34PxQ", "text": "Sakana is the best sushi place I have been ever, awesome specials displayed when you walk in the door, great teppanyaki if thats your thing as well.  Get there early as there is always a line!!", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 4, "date": "2014-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ggjr75J7geUifR5Oska8mw", "review_id": "AI7lPYYVgRn6Npp3b0Qf7w", "text": "Love coming back to this place. Servers are very friendly and service is pretty fast! Food is pretty decent. I always get steamed gyoza and tootsie roll!", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 4, "date": "2015-04-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "i9DSitx1CJCCONWAG1FVnA", "review_id": "iTfwI5Hwd9vNm69gM2DvMQ", "text": "Don't really care for buffets for personal reasons but this one doesn't creep me out as much and the food also very good...the crabs legs bring me back:)", "business_id": "-Ogv7rpcgUHkFaSy3vD8Sw", "stars": 4, "date": "2011-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SoWqOmt6GZcnKgWVn1J9yw", "review_id": "EfWM2Vngw_bWU3eQqfzY8A", "text": "This place isn't bad for a buffet but their food is usually cold when I go grab some. Their bathroom is a whole new story though, it's disgusting.", "business_id": "-Ogv7rpcgUHkFaSy3vD8Sw", "stars": 3, "date": "2015-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "n_VO8TFed-H3kkcbjhy2Pg", "review_id": "xJfAAezUqfg1Mh6PNlbCZQ", "text": "Excellent happy hour special!  Drinks & appetizers.   Dinner was very good.", "business_id": "corPOxxIBRJ7DSpryYvorw", "stars": 4, "date": "2012-03-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Pef1PbO6MlDPcaw6KUfA7A", "review_id": "W4l4FFFDZvm1eB_MYZWOrg", "text": "I love the J.W. Marriott, how could you not?  If you're staying at the resort,  and do not want to leave the beautiful property, this restaurant is a must for dinner! The next closest dining option off the property is Ocean Prime at City North just outside of the Marriott grounds. \n  The food here was very presentable. I really enjoyed my Arizona night out on the patio by the fire. The hotel had live music going out on the patio lounge area of the resort that could be heard at our table.  The attentiveness at the bar was very welcoming and our dining service was spectacular.  I enjoyed the kale salad and calamari as appatizers and the sampler fish trio for dinner. Everything turned out Very nice, but would remove the calamari if I could for another option. I thought it could have been lighter In the breading. \n\nIf you come to dine here for during your stay or just diner, It's a great choice.", "business_id": "corPOxxIBRJ7DSpryYvorw", "stars": 5, "date": "2014-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rWN1pg3mCF2btJWtG6JmJA", "review_id": "LN4l4wklQB0IVBjm-vq9TA", "text": "Not busy at all but took nearly 45 min to get our meal.  Ordered the trout and was shocked to see lots and lots of bones. Hmmmmm. Well asked the waitress about it and she said \"they try the best they can\"  hmmmmmm isn't this a \"fish\" restaurant? \nThey comped the trout but still not sure I would go back.", "business_id": "6Ry-gjGqApTSRZkfdYlLmw", "stars": 1, "date": "2011-05-04", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "4uw7hCPC3owbFuhAkyxrAw", "review_id": "ZcHOmrI0jCM_JUvKSEt6mw", "text": "Consistently a good experience.  Not a fancy place by any means but a great neighborhood restaurant with friendly staff and good food.", "business_id": "k8q3ypIoIzchdp3RoRUsJw", "stars": 4, "date": "2012-05-31", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "rk9Pwyi3nTk2JUAERmd4oQ", "review_id": "d64QVQKA8hogQvqHWsYufg", "text": "All their food is frozen and not fresh. Over priced and the dolly unloads their sewage right in front of the place! Service can be iffy depending on server and management is terrible. Tells customers off all day long. And food had dirt in it...never will I waste money on them again.", "business_id": "bpPVn4nF8YR40BjhO6YP1w", "stars": 1, "date": "2015-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4eAwWdHGeTpmsorTo6XWiQ", "review_id": "FCmaztTERpEgD2GKAPEAEw", "text": "Place is a hidden gem. All things Chinese are at their finest. Looks like a wedding hall because they use it for one at least twice a month. They have the access to some of the freshest seafood / produce/ ect. available, with there location so close to lee's market place which flies in fish and other Asian inspired staples daily. Plus lee's has special selections for near by restaurants. \n\nThey have the whole gamete of edible creatures available. From jelly fish to duck. And there recipes bring them to their best. Everything is family style, so bring friends/family for great food and conversation. There is a bar, but not really a place where your looking to drink. I think it's there just for the wedding/events they put on. \n\nIt is a culture shock. So don't get all weird if there is a language barrier or if you not use to a rotating Asian condiment tray iin the middle of a family style table. That is what makes it so special. If you have issues with that buy Rosetta Stone and get over it.", "business_id": "z4KFTJQsAdxqMZA7Fx0A9A", "stars": 5, "date": "2013-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "r8nui9jtCqLJvU8IJfUZsw", "review_id": "09jTHkWaSum6bwJ0HUv00g", "text": "Great local and friendly staff, not to mention the food is delicious and their menu extensive with quality dishes to satisfy any appetite. Needless to say, we shall return without a doubt.", "business_id": "txCJurIIrE9ZoHu3gZUvnQ", "stars": 5, "date": "2012-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MQfiNBlqE6tN-lopr2_DMg", "review_id": "LfYmCJBtNc8j7oZ4GXxO_Q", "text": "First stop at this Carrabas. We ordered the crusted planko cheese ravioli and the prosciutto pork tenderloin medallions. They were both delicious. I noticed they have s 3-7 happy hour, I'm going to check that out next trip. Left full and happy.", "business_id": "cKxXBvOithS-Ic5KnhEKrg", "stars": 4, "date": "2015-03-01", "type": "review"}
