{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EeOBT-RohoF3yWAG36dTDw", "review_id": "rxK0wsHd_3XqxhlCuqPOgg", "text": "I'm used to going to a private practice in Columbus, Ohio for my glasses needs. But I've moved to Pittsburgh and needed some place economical . I booked my appt online the night before but showed up late.... I didn't know there was a marathon going on . I just wanted to get an exam so I could buy glasses online . The staff was nice and rescheduled me for the next slot. Everyone was nice including the doctor .  Although I didn't initially want glasses 2 pair for 100 bucks and a free eye exam is a great deal. Especially considering I usually spend 300 on glasses after insurance is said and done. My only complaint is the selection wasn't amazing but what so you expect for such cheap prices.", "business_id": "gX96CYY9T3K-jiippnnXDA", "stars": 4, "date": "2014-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "6MQjQ3jfCUUxItIvKadJsw", "review_id": "Wau9JddT_OowZ7ru4QM2bA", "text": "From the previous reviews that I read I know exactly who people are talking about.  I rarely give a one or two stars. The customer service here is horrible.  I feel like everything I say is wrong.  I felt rushed when selecting my frames.  They changed me $10 more than what the price was marked on the frame.  When I pointed that out I got an attitude.", "business_id": "gX96CYY9T3K-jiippnnXDA", "stars": 2, "date": "2014-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "e0ApwXvZreJAJWYy7jv5uQ", "review_id": "tX-rcRwGcGqo3T3Ewqx1Uw", "text": "I didn't even want to give then on star.  \nUnfriendly and unprofessional from the\nReceptionist to the doctor to the sales staff across the way who sells glasses.\nNever again!!", "business_id": "mMA6f_xF9kzTvU9kUCBo9A", "stars": 1, "date": "2015-04-15", "type": "review"}
{"votes": {"funny": 2, "useful": 6, "cool": 0}, "user_id": "4FVd6DBPJuLdptbV8azw2Q", "review_id": "638BO9bmM9kv-kRT-G8YnQ", "text": "I would have to recommend that if you are looking for an attentive, thorough, professional health care provider to keep looking.  This office has been really going down-hilll for the past several years and has hit rock-bottom.  There is always a wait, usually 20-40 minutes past your scheduled appointment time.  They are impossible to reach by phone, and do not return messages or emails.  They charge patients their co-pay even on preventative visits such as biometric screenings and physical exams what are already covered at 100% by most insurance plans.  They also bill the insurance company for a full physical exam, when they aren't actually performing one. Mine lasted less than 5 minutes and the physician didn't even touch me!  The billing staff are as rude as they come, and could care less about anything or anyone.  I know that Blue Cross is currently investigating.  There are SO many physicians in Charlotte, there would be no reason to go here and receive sub-standard rude service.", "business_id": "2yBBmcVEbhrGrk-hAUAfJg", "stars": 1, "date": "2013-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "chQ0bRaDizSLedgm47xhlA", "review_id": "3850LweKnDI9A7G0FhkYIA", "text": "My family and I have been going to this practice for a few years now. I rarely write reviews, however after issues with my Insurance provider I feel compelled to write about it.\nI want to rave about Crystal Caruso within this office as she stepped in to assist me with my Insurance company as I was getting no where after months of conversations.\nShe was able to accomplish what I couldn't after months of working with the carrier.\nThe fact she stepped in to help says alot about their practice and in doing so she was able to save my family alot of money.", "business_id": "2yBBmcVEbhrGrk-hAUAfJg", "stars": 5, "date": "2015-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RPEgOJnmZdVrOdkMkrN1ZA", "review_id": "PqjdX0PiUlm5iU6WfistDQ", "text": "I'm giving a one star rating to this establishment not because of my doctor or the care I have received here, but because of the reception staff. I love my doctor, Dr Colbert, she is absolutely amazing.  I have built a great relationship with her and she is the only reason I am not leaving this establishment. Someone on the reception staff took it upon themselves, WITHOUT my authorization, to change my phone number to a number that has never been associated with me. Because my phone number was changed without my authorization or knowledge it had happened, I wasn't informed that an appointment I had scheduled for 2 months and took off work for needed to be rescheduled because my doctor was sick. Today, when I went into the office and was glad finally able to see my doctor, I noticed on my check-in paperwork they had a different doctor listed, not my usual doctor that I have always seen and who is my primary care provider. I made sure after my first appointment with my doctor that I would always be scheduled with her and put that in my paperwork  so I'd always see her. Again, someone on the reception staff took it upon themselves to schedule me with another doctor against my wishes, without my authorization, and without my knowledge. I'm not sure if the same person who changed my phone number also changed my doctor, or if the receptionist who rescheduled my appointment put me with the wrong doctor. I realize that mistakes happen, it just seems odd to me that I have never had these types of issues at any other medical establishment, ever, especially when there is so much at risk with the medical industry and patient privacy etc.  Either way, I had to reschedule again and will have to miss work again because of the reception staff at this establishment. Again, if I didn't really like my doctor and if I hadn't built a relationship with her I'd seek medical care somewhere else.", "business_id": "iYlGqyRNH5UYQABKsDuuDg", "stars": 1, "date": "2015-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "25QZezonX5pUxfu6QNlE5Q", "review_id": "1_814QbNnZ-hdFd9TpmnLQ", "text": "Stepped off a curb and twisted my ankle. Woke up the next morning and it looked like a ballon. Made an appt to see my doctor. Went on the visit and nothing was done.(in regards to x-ray or examining the ankle) I was told to ice and take aleve. Called back in 2 weeks because I was still in pain and had swelling. I was advised it may take another week or 2 keep icing and taking aleve. I went with my gut and went to a podiatrist and found out I have torn ligaments in my ankle. They are lazy ass hell! Don't waste your money or time. Find another place where the doctors care.", "business_id": "iYlGqyRNH5UYQABKsDuuDg", "stars": 1, "date": "2015-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1x4ebggxOOkZsu5CaBY2JQ", "review_id": "eXVkg_JuqmJcgVEynzxLRA", "text": "I DO NOT recommend this OBGYN...\n\nI have been seeing Dr. Stephens for over two years now so my experiences are based on more than a one time encounter.\n\n1st- Terry, the woman who schedules appts and checks you in when you arrive is awful. She always seems bothered to speak with you whether it be in person or over the phone. \n\n2ndly- The nurse is extremely funny and always in a good mood, however, much of her entertainment is at the expense of the patients. My last appointment, she proceeded to describe and criticize another patients appearance and body which I found to be totally disrespectful and unprofessional of a healthcare provider. \n\nAnd lastly, having previously had my charts from another physician sent over to help Dr Stephens understand what exactly is going on with my health... I would expect her to READ them. I was scheduled for a procedure I DIDNT need to have due to her not reading  the other records that I had sent over... and after all that, they gave me a hassle about refunding my money that I had paid in advance for this procedure to be done!", "business_id": "jmHing2kjywBhQlZKsgD_w", "stars": 1, "date": "2015-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lePr71n07wFDi4kuSn3Lyg", "review_id": "FoZWOCVQQm0zInNZAF0Q-g", "text": "I was guided to this practice when my usual doctor retired from medicine.  In need of a prescription and not having much time to find a doctor,  I made an appointment with Dr. Stephens.  The woman I spoke to on the phone was Terry.  Terry's attitude through the entire phone call was snappy. She cut me off every time I started to speak.  I assumed she was just really busy and didn't let that sway my opinion.  \n\nAppointment day arrives.  I walked into the office and felt like I had entered into my early  90s doctor's office.  Awful old chairs,  the decor was terrible,  and the fluorescent lighting was so bright it hurt my eyes.  I signed in and was given the usual paperwork.  As I'm trying to listen to Terry to see what exactly I'm supposed to fill out,  there are a few people in the waiting area laughing and carrying on a conversation.  It made it extremely hard to hear what Terry was saying.  When I asked her if she could repeat herself she rolled her eyes and sighed.  Oh yeah,  god forbid you have to explain something twice.  \n\nI didn't have to wait too long for the nurse,  about 5 minutes.  I believe her name was Gail,  she was very nice... however, when I was trying to speak to her she also cut me off and spoke over me. The exam room I was in had posters taped to the wall,  it didn't appear dirty,  just kind of slapped together like a dorm room. \n\nEnter Dr. Stephens... she kind of spoke with me about my history,  and then launched into a lecture about me not having insurance. Excuse me,  no matter how well intentioned your speech may be,  it's inappropriate.  You do not know the specific circumstances surrounding my situation. It made me really uncomfortable.... now,  I've had some health problems before,  so having a vaginal exam is not only extremely uncomfortable,  but I'm always anxious during it.  Her lecturing me made me feel even more anxious.  As she started the exam it was VERY,  VERY uncomfortable, and I was trying to convey that to her and she said the standard, \"If you would just RELAX,  this wouldn't be so bad\" and then pushed my leg out of her way.  Thank you for totally disregarding the fact that I'm so anxious I'm drenched in sweat... and thanks for ignoring that I'm trying to voice my state of discomfort by just talking over me.  \n\nI was so glad it was over.  When I went to pay I had to go to Terry. Funny,  when she was taking my payment she was remarkably pleasant.  \n\nIf I have to have any further testing or treatments I'll be going somewhere else.  This place just made me feel so uncomfortable.\n\n***Went to pick up my prescription today,  Dr. Stephens prescribed the wrong pill.  Which is hilarious because in the exam room when I was trying to tell her,  \"It's XYZ, and I think it's this dosage,  but I'm not 100% sure,  it's in my records....\" she cut me off acting like she knew exactly what pill I was taking.  Unbelievably angry. Do not go here,  it's an utter disgrace.", "business_id": "jmHing2kjywBhQlZKsgD_w", "stars": 1, "date": "2015-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "80YJLmQYs6wPDSAe0fE-Jg", "review_id": "K1Z8TDihj8EXjyUoflUBzw", "text": "Very poor customer service in the contact lens department. Rude front desk staff. Will  not go back.", "business_id": "UOLNw0-7GjxomFQiHUXisA", "stars": 1, "date": "2012-04-13", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "ts7EG6Zv2zdMDg29nyqGfA", "review_id": "PjRKAcZomZHUPKTsA-NNgg", "text": "My daughter has had 2 surgeries here and I must say that the staff is above par.  Always timely about getting you back and keeping you on schedule.  \n\nWaiting area on the 3rd floor is nice and sizeable but don't be surprised if you get there and it's packed.  This place does a high number of operations daily it appears.  \n\nThe doctors that work here and the staff joke around with the kids and make them relaxed and try to relieve any anxiety that they might have.  They have a great bed side manner about them.", "business_id": "UOLNw0-7GjxomFQiHUXisA", "stars": 4, "date": "2013-04-08", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "OXzYyZSHo9Dl6Qd0s_o2Ig", "review_id": "cMF3HM8HCFJPqij6q9Y_HA", "text": "Definitely a fan of this place!  I started going here for hearing tests and was very nicely surprised at the professionalism of the staff.  There is a ton of parking across the street in the parking garage.  \n\nMy advice would be to get an early appt because they get slammed with people.  If you are unsure where to go, the front desk on the first floor is very helpful and can direct you.\n\nThe building is very clean and nice and all of the facilities (at least in Audiology) were new and state-of-the-art.", "business_id": "UOLNw0-7GjxomFQiHUXisA", "stars": 4, "date": "2013-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "do-fO-EruYVP_FQPMNWmZg", "review_id": "QUO1AzGHESXLVD7yXZ5WQg", "text": "Be prepared to wait. We were told to be here at 11:15 for an 11:40 appointment. Coming up on an hour wait, ugh!\nAfter waiting over an hour to see the doctor, and to only talk to him for 5 minutes, was very disappointing.  The appointment was for my Mother who was previously told she could undergo a specific eye surgery and then upon arriving and pre-op review, she was not qualified. Not only was the experience in this office disappointing, it was a disappointing day for my Mother after expectations were expected.", "business_id": "UOLNw0-7GjxomFQiHUXisA", "stars": 2, "date": "2014-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XTqky6c9CItKrxSko3G1ig", "review_id": "Fj9pwt-hlgEMihrf5pvrjA", "text": "Billing sucks. We have been over paying for hearing aids for our daughter.  She got them in 2009 and both our insurance company and myself have paid more than the cost of the hearing aids and I just found out that they filed a collection. Noone at Ceenta can explain  the bill. We looking for a new Dr.", "business_id": "UOLNw0-7GjxomFQiHUXisA", "stars": 1, "date": "2015-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vMCIMmJ2sh5W5AddCKaOCg", "review_id": "UsXV21fjug6ve5oEAqz89g", "text": "Carmel Foot Specialists at the Park Rd. office was welcoming, attentive, friendly, and thorough.  The staff made me feel comfortable despite by broken foot.  The doctors and tech staff were willing and ready answer any questions I had.  They even gave me additional numbers to reach them at if I thought of any further questions.  I highly recommend Dr. Kaiser and Dr. Miller for all of your foot needs.  I was in Charlotte on vacation and needed immediate attention.  I was able to be scheduled quickly and get everything I needed.", "business_id": "ByctOq-Af6lAZxROXkXTXw", "stars": 5, "date": "2014-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vMCIMmJ2sh5W5AddCKaOCg", "review_id": "Hgcu6fshOMfwlq2xiqgKLA", "text": "Dr. Kaiser did a check up on my broken foot 5 weeks into recovery. Her instructions were very clear and concise.  Her nurse made me feel welcome and comfortable.  I will be sure to come back if I have any further needs- but with my new orthotics, I doubt i will :)", "business_id": "ByctOq-Af6lAZxROXkXTXw", "stars": 5, "date": "2014-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UgpHzdPm1ciipE41MPX_kA", "review_id": "GMkoSgoYQh9YTH7OU4yrLQ", "text": "Love this place , friendly staff and techs . Dr. Olulade is da bomb! Nice to have a primary that actually cares about you and makes you feel comfy .", "business_id": "siixOX00BhEkUlKg3n06tA", "stars": 5, "date": "2014-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Sxs5kGsRB49UFCt8nt_GDA", "review_id": "LcggKUpVKLo6lVq_7DTB2g", "text": "As a first time patient I was able to get a next day appointment. The wait was short, paperwork not too lengthy (considering its a doctors office), the PA came in to see me promptly, and everyone was friendly.", "business_id": "siixOX00BhEkUlKg3n06tA", "stars": 5, "date": "2015-03-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ybG5P8QlP5rA58yd7NRqDg", "review_id": "RtcTixeT354yflBVb7Gjrw", "text": "I've been a patient and fan of Carmel Family Physians since the early 1990's.  I've been under the care of (the best Physian in my opinion ever ) Dr Daniel Sappenfield. He is a patients doctor. He listens and takes time with you and genuinely cares about your well being. Dr Sappenfield, and the entire staff at Carmel Family are professional, competent and efficient in meeting your health care issues and needs. \nFor existing patients they also offer Sat & Sun appts. \nThen there's the Pharmacy staff that are also the best - you can't beat this team ! \nTwo thumbs way up !", "business_id": "siixOX00BhEkUlKg3n06tA", "stars": 5, "date": "2015-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0MXnlq1M975i0L-K5MeoYA", "review_id": "AFfZnp01hXjjGkgvFM1A6g", "text": "I do not go to the blakeny office but I have dr walker over at the monroe office.  I have to say they are absolutely anazing... I could not have found a better dr or nurse like penny if I seached high and low....theu are personable, down to earth, just flat out amazing.... thank you all for all you have done", "business_id": "1I8gEdZk3itKxzIejjG-aQ", "stars": 5, "date": "2015-05-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bfIu4slt1CEM8DeGIIOqjQ", "review_id": "9n5upgg1kTsJMZ4YUMWBmQ", "text": "I mean Dr. William Larsen's place.  Not just so close to my house, the staff are so friendly, considerate and passionate.\n\nI rarely visit doctors' office and hard to find a good one in Charlotte, nevertheless, my previous insurance did not refer me to this place but gave me a couple that I had never had a treatment as I got lost in downtown or I could not find the place.\n\nFour years ago, my son got a physical for college entrance and we accidentally went to Dr. Larsen's office.  Like them.\n\nEarly this year, I had a serious chest infection, got an appointment quick and had that fixed fast.  \n\nThen my boyfriend was referred by insurance to other place that he could hardly find.  After checking he could go to Dr. Larsen, my boyfriend was so happy with their service. \n\nI just got my physical quick appointment with no hassle and check up the following day.\n\nGood place.", "business_id": "R-ff6qTsHb6HC7wQ2Wl5bg", "stars": 5, "date": "2011-05-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PTmZem7Tb4Ol0kilEpAGkg", "review_id": "zhWb2w2N04JQuXVO1T-3hg", "text": "Fantasic and very friendly staff! The best in Charlotte hands down!", "business_id": "R-ff6qTsHb6HC7wQ2Wl5bg", "stars": 5, "date": "2012-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1x4ebggxOOkZsu5CaBY2JQ", "review_id": "wMYTF2paYbapenLQLH5dqg", "text": "LOVE this practice! \nI have to admit, given the area, I was a bit weary. However, from the ladies at the front desk upon check in, to the nurse, to Dr. Norton, everyone was very customer service oriented, personable and professional. From check in time to being seen, was a total of 15 minutes and I appreciate that I was thoroughly explained to, the process of logging in to the patient websites to view medical records. Also, in being seen, I was not rushed or made to think my questions were irrelevant. Overall, I was very thankful that I gave this practice a try and will continue to go back!", "business_id": "R-ff6qTsHb6HC7wQ2Wl5bg", "stars": 5, "date": "2015-03-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7Q1aukZS-t_S-I8CS5rbTA", "review_id": "LVBMNDTZLZb4jL4BPKPMFw", "text": "I visited this urgent care for a consultation since I had yet to find a primary care doc in the area. The staff and the physicians/physician assistants were great. Courteous, intelligent, and effectively the kind of staff you would want in a medical facility. \n\nExcept the nurse I worked with. She was condescending, requested I wear a gown when I wasn't being examined and without verifying that there was any reason I would need to disrobe. Additionally, she insisted on physically placing my hands and arms in the appropriate positions for blood pressure for the standard oxygen level finger test, and holding them in her desired position until the tests were completed.\n\nWhether her behavior was a reflection of what she assumed I was there for (verification of a negative std test), she came off as judgemental and unfriendly. She did her job, and I'm sure she's quite good at it. But her demeanor and dismissive response to my distaste for needlessly disrobing had the effect of creating an atmosphere where I felt like my personal boundaries were not respected. \n\nI left the clinic with a referral to a pcp and a consultation that solved my issue, but unfortunately my experience with the nurse means I will not return to that particular urgent care, and will hesitate before visiting another location.", "business_id": "6YSHRi2-qYYCiZ1CMXvn7w", "stars": 3, "date": "2015-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "snhkfXlkyvT9NgX16VTPDA", "review_id": "4J_AGtz3cteWFK2Xd3UWJQ", "text": "Great level of personal attention from a great doctor.  Dr. Mozayeni took the time to answear all of my questions.\n\nI went from wearing glasses my whole life to 20/20 vision now.  I would highly recommend that you check them out if you are considering LASIK as they do a free consultation.", "business_id": "Z5HWuClqy4YZzvVrTRUEuQ", "stars": 5, "date": "2009-05-20", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "CAxfOP8lrKOggZSkCaXH6w", "review_id": "-JXm5UIXwIOPgTn_TJ9o2g", "text": "My experience with Providence and Dr. Mozayeni was fantastic. The journey that brought me to laser eye surgery has been a long one. I finally had enough with hard contact lenses, glasses, and waking up pretty much blind. Every step of the process was easy and painless..I mean, except for the part where they shoot lasers in your eyes to cut a flap in your cornea, if you're thinking about LASIK, you should already know about this part. \n\nThe staff was wonderful - efficient and friendly each and every time I went into the office. Dr Mozayeni is one of the most patient and knowledgeable doctors I've come across and I felt like I was in competent hands throughout the process. He's one of the best in the industry and I wanted nothing but the best for my eyeballs. \n\nI can see clearly now..the rain has gone. I can see all the obstacles in my wayyy.", "business_id": "Z5HWuClqy4YZzvVrTRUEuQ", "stars": 5, "date": "2012-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ulSpXpMtRnECdcm-TMPIzQ", "review_id": "fwb6y3jYVv5fOXN5Nd-OPA", "text": "Best Pediatricians in Charlotte.  My children have been going here since we moved to Charlotte 20 years ago. Always wonderful,  always professional,  always accommodating.", "business_id": "b4NC-S522RPFw6CLqqOyzg", "stars": 5, "date": "2014-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rOQJPisPftjQYR1FrxCYBA", "review_id": "YmjEaFxZKsOnt8joD5f24Q", "text": "Appears these guys can not manage their appt schedule. Waiting over an hour yet again. Time to find better service somewhere else.", "business_id": "KgdLtB46PtgXV37IXpuu8w", "stars": 1, "date": "2014-04-22", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "I6C8FWFo9_QukceCMFCCrQ", "review_id": "radTBZ75HcjMnsChcCzzLg", "text": "Curtis Desana is the best doctor ever!!!! He is always attentive, and his bed side manner is superb. I'd never want to trust anyone else with my care.", "business_id": "SYASUMcTwhVB3TnfeoUZJA", "stars": 5, "date": "2015-03-23", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "gJoZrOLkNFauyU6pDkP4nw", "review_id": "Xi7Hvh5l-2wmBk3gUOBhBA", "text": "First this is now novant health. I went to the urgent care care part three weeks ago for what ened up as the flu. The dr looked scared to come in the room and even said he didn't want to get to close. After he read the test was positive he told me he did not want to give me tamiflu as he thinks this will just run its course. After missing four days of work I called back and another dr gave me tamiflu even though it was too late to do much. At this point I had now developed broncitis. She did give me an inhaler but now 3 weeks later I still have it. \n\nWhat really upsets me is I was told they charge a normal dr co pay. I now have two bills one for 350 from the first dr. And one for 750 from the second. Same practice same reason double the amount. I don't get it.", "business_id": "SYASUMcTwhVB3TnfeoUZJA", "stars": 2, "date": "2015-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "KLZ4PABcgoD6TfqGW7vu7A", "review_id": "JEfp6-gXUoAh0A1vfmfqRw", "text": "I recently found out I was pregnant and was researching OBGYNs in my area (Downtown Phx) I tried out this place because it was right near my house and the reviews seemed ok.  From the moment I got to the office I was already turned off and regretted coming here, I arrived 15 mins early and filled out all my paperwork and STILL waited for an hour just to be seen! Everyone in the waiting room was called before I was and I wasn't even seeing my actual Dr, I was assigned a PA instead.  I did the usual Urine sample, and they took my blood and vitals but the PA kept asking me questions I already answered to the nurse which made me notice she wasn't even looking at my file nor had it with her, she was just taking notes on the Patient info sheet I filled out.  She breezed through a low quality ultrasound and I had to ask her for pics which were blurry and barely even worth printing when I saw them.  She explained that I would be going to a different facility in 2 weeks for the ultrasound and then go back to their office for the check up which I wasn't happy about having to go to multiple places but understood.  When she finished I had to ask her about the results of the UA since I told her I felt like I may have a UTI, she told me everything looked fine but they would have to send it out to get those results (I've never heard of not getting UTI results the same day) and that she would just send a script for an antibiotic to my pharmacy which would be ready when I left there and that they would call in a couple days and tell me the results and I could stop taking them if they were negative.  I waited until the next day to go to the Pharm and no script was sent, I called the OBGYN and explained there was supposed to be a script for an antibiotic and they said they would send it over. the next day the pharm called to tell me my script for prenatal was ready but that was all that was sent. I didn't even ask for prenatals since they're over the counter!!!! called the DR AGAIN and had it sent over, still no call from the Dr regarding my results but I thought I would wait another day.  still a week later and 3 calls asking for my results and I had to call THEM to find out that the results had been in and are negative but the PA must have overlooked needing to call and let me know.  I have requested my file and am switching to Maricopa OBGYN, I'm very disappointed in my first prenatal Dr visit as this should be a happy time and your doctor should make you feel comfortable, I hope Maricopa can turn this around and make it a positive experience for me as it should be.", "business_id": "1acmBPmmFDovVSHHzMrJ9A", "stars": 1, "date": "2014-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sfqWLuEx79KLkA7w0sis2w", "review_id": "XUygygc_Yh0_99VgkFWc9A", "text": "Thank you for your reply to this 6 months later. Luckily, I do not have breast cancer and am currently happily 4 months pregnant. The best decision of my life was to move to Paradise Valley OBGYN to Dr. Donnelly and her staff who treats you the way a patient should be treated. I have had top notch care at this facility and I would recommend others try Paradise Valley as well. I have walked out of every single appt so far happy with all of my questions answered, feeling cared for and important. And guess what? Wonderful front desk staff who smiles and is friendly. Also, every time I call with a question the NP calls me back within the hour and will talk to me for 20-30 minutes without rudeness or abruptness. \n\nI'm sad to say that the experience I mentioned in my review here at Central Phoenix was not the only one I had. Any time I called to make appt's or ask a question I was greeted with rudeness and uneducated answers. I don't think the staff here was equipped to answer medical questions nor had any idea who to direct the call to. They once billed an appointment to the wrong doctor and made me write a letter to my insurance to try and clear it up. Another time I asked to speak with someone regarding a medical question and the girl refused to let me talk with anyone. So glad this nightmare is behind me.", "business_id": "1acmBPmmFDovVSHHzMrJ9A", "stars": 1, "date": "2015-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lHZsCZ4KZsxeiixQ1lBxLA", "review_id": "wxDZVHJwSB5QuBrXt73aDg", "text": "I have been a patient of Dr Dedinsky for over 3 years now.  I really like the time he takes during physicals and visits.  He is thorough and practical in his approach.  His office staff are competent, pleasant and efficient!", "business_id": "kHQCZ5UQmNX2KiSU5cUpaw", "stars": 5, "date": "2015-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "El2b3KmAkFpa6Opyq3qTKQ", "review_id": "IfUJHIhoK850GtvKFgPoQw", "text": "I have been a patient for over three years and have never been so satisfied with the service and care given to me. This is by far the best change a person could make regarding their health. Can you say 'COMPLETE' physical?? There's no greater comfort than knowing your health is in good hands and your Doctor has your back. Thanks Doc!!!", "business_id": "kHQCZ5UQmNX2KiSU5cUpaw", "stars": 5, "date": "2015-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jSwy5pL6kw4tW-cfkywOpg", "review_id": "lmwnHnz4wJElSI9336bhZw", "text": "This place works with another doctor service (A2ZHome) and they made the appointment without any knowledge to my father (an 81 year old very sick man).  We got a nice little bill in the mail for $25 because we had no knowledge of this appointment only the robot call the day before that I then called the answering service and told them to leave a message that we would NOT be there.  My father was just to weak and sick to leave the home.  But I guess that doesn't matter.  I have been in the medical profession for 20 year and NEVER got a bill for a no show.  I guess they need lunch money.  Not quite sure how they are as doctors but I know they are not the ones we will ever see.", "business_id": "QC3osgPdEl_TEZA2CtNeQw", "stars": 1, "date": "2014-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tBvrnSCLSpUdCDm5w5GPkg", "review_id": "Fmdg4jlrGX2cL13d2GSnQQ", "text": "The best service you will ever receive at any doctors office, hospital, or clinic in town. If you need Cardio services this is where you should go.", "business_id": "KXt0Iky3ybeLsbY9KC6GSA", "stars": 5, "date": "2012-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EJu5peGoO4tzop0pQtgHgA", "review_id": "YzF-4d6J_cdXmaVfj0gTqw", "text": "I went here last week.  The staff was extremely friendly, including Dr. Harlan himself.  The only drawback was I waited in the little examination room for over half an hour.  My appointment was scheduled for 8.20 and I didn't get seen until nearly 9.00.\n\nIt's always funny when you're at a clinic or something and hear someone screaming in pain.  A guy down the hall was having some stitches taken out and was cussing up a storm.  :)  He walked out before me, so they must've taken good care of him.  :)", "business_id": "78ODNJ0EANVSsbgrwhl3mw", "stars": 4, "date": "2008-04-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3Sj2-4RTYiEM2YK66MNE8g", "review_id": "DK5GRcFXkjFQUlYlEXwxIA", "text": "I am surprised by the reviews.  Dr. Harlan and his then partner saved my badly damaged ankle in 2006.  After recovery and until now I am pain free.  I have been back to see him on a couple of foot issues and after following his advice, I was able to avoid surgeries. He is a serious and busy Dr, some may want more coddling, this is not the place for you.  A co-worker referred me to Dr. Harlan and I unequivocally refer friends, family and colleagues to his practice.  Great Doctor, made my life better, and is listed annually as a Top Doc for a reason.", "business_id": "78ODNJ0EANVSsbgrwhl3mw", "stars": 5, "date": "2015-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8o5YkB_NtvRKum7Wri4mZA", "review_id": "ukPp7ZCEQqwVyIUdBv8pUg", "text": "Dr Stock is AMAZING!\n  What's not amazing is that since he was moved to Mercy Gilbert their bills to us are so much more. For just a regular visit we were billed $500 from just the hospital, that didn't include the Dr fees! Unreal! I would have at least appreciated a heads up that their billing was going to dramatically change. What's worse is that we didn't get the bill until months later, when we had already 2 other visits. I'm scared to get the mail lately in fear of what they are going to bill us next. \n\nWe even have 2 decent health insurers from my job and my husband job!", "business_id": "BXKhaF0EeDnycbqgKzDuJQ", "stars": 3, "date": "2015-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0jH_IgWvWgjyKmrQDN3Tmg", "review_id": "SxrvfToty9zETeNuXWMSVg", "text": "Dr. Austin is an amazing physician.  She is compassionate, caring and thorough.  She is the only physician in her office, which means when she needs to provide more time to patients before you, you will wait.  But guess what, one day that may be you--you may need that extra time.  So I have never once been upset if my appointment wasn't started at the exact minute it was scheduled.  She has been my primary doctor for over seven years and unless she retires, she will be my primary physician for the foreseeable future.  If your treatment requires more specialized treatment, she knows who and where to send you.  As a middle aged man I purposely chose Dr. Austin because she is smart, compassionate, listens, thorough and has never once said \"fully booked\" when I've asked to see her for ANY reason that day.\n\nIf you are looking for a great doctor, Dr. Austin is it 100%.", "business_id": "k7xAg1QhK_8wze3BYWglRQ", "stars": 5, "date": "2014-04-17", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "dj-vs4rukH6dXWVpPOq0_g", "review_id": "GJusps7sJ3pLb6KLlG_Law", "text": "Why would I make an appointment with any doctor for a shot, and only a shot, and wait an hour for my service?\n\n It is a random Thursday, and have waited an hour now. No apologies, no regard for client's schedules, nothing. If they weren't so good in every other regard I would change doctors. \n\nI drive 30 minutes to get here and will not stay if I'm continually left to wait an hour. \n\nAlso, 3 different nurses have walked up to me and called me 3 different names.  \n\nTHEN, they had me wait an hour to get the shot and then tell me I should have peed in a cup (nobody told me that???). I go to pee in a cup and then have me wait another 20 minutes to make sure I'm not a leper. Get it together!", "business_id": "aOtx6bMU5M-Q_cNxhB0wYw", "stars": 2, "date": "2013-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BeysQJOrTVDfNhKVAZ7-HQ", "review_id": "jCA1y5jXXIZL0IQEMoF6eg", "text": "Attention expectant mothers: DO NOT USE!! I was referred to Southwest Women's Care by a friend who was very impressed by the Ahwatukee office location and staff. This being my second pregnancy, I was prepared for the lengthy initial paperwork, long office waits, and moody receptionists; however, I was not at all prepared for complete and utter incompetence. I left my initial visit feeling ok with my OB selection, but in all honesty, I wasn't super impressed with the doctors or staff.  I rationalized the lackluster feelings as pregnancy hormones and made follow up appointments.  If my friend raved so much about them then how bad could they be? I went through my new patient information packet and realized the PA who examined me failed to provide me a due date. Wow! Completely unbelievable! Everyone knows it's one of the most important components of the initial visit. I was able to figure it out using a pregnancy calculator but I couldn't believe the miss. \n\nDuring my visit I also set the expectation I would need FMLA paperwork filled out by 5/29/13--I stressed the importance of the forms and deadlines. The person assisting me said that my deadline wouldn't be an issue and assured me she would personally complete the forms if needed. Well, when I called this morning (5/29/13) to see if the forms were completed the receptionist seemed uninterested in my situation and chose to inform me they had \"7- 10 business days to complete any and all medical forms . . .\" to which I responded \"that is not what I was told at my visit and I need those forms as soon as possible.\" She told me she would check into it and call me back. \n \nThe receptionist did provide a prompt follow up call to let me know that they would be making an exception for my forms. She set the expectation that I would be able to pick them up after the office lunch break and left it at that. I was pleased with the quick response and went to pick up my forms as soon as I could. When I got to the office the front desk could not locate my paperwork and the lengthy wait time left little time for me to double check the forms. Imagine my dismay when I got back to my office to discover the forms were filled out completely incorrect.  There were contradictories, wrong information, and misspellings galore.  There is absolutely no way a medical professional could have completed the documents. When I checked the back signature, sure enough, it was different from the rest of hand writing on the forms.  I am completely appalled that a doctor or physicians assistant would sign off on forms without insuring they were filled out appropriately. \n\nThere is no way I would let someone who can't even take the time to make sure basic documents are completed properly deliver my child.  An expectant mother needs someone who pays attention to details. If this is how they handle the little parts of pregnancy then I don't even want to think about how they handle the bigger parts. I urge ALL mothers to reflect upon this information when considering Southwest Women's Care as their OB of choice.", "business_id": "aOtx6bMU5M-Q_cNxhB0wYw", "stars": 1, "date": "2013-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Pj22o4CxAUKWd0ET4QPVvA", "review_id": "IuY-Cna0SR7Lfe9RvLFejg", "text": "Love this group of practitioners and the care provided.", "business_id": "aOtx6bMU5M-Q_cNxhB0wYw", "stars": 5, "date": "2014-03-21", "type": "review"}
{"votes": {"funny": 4, "useful": 2, "cool": 0}, "user_id": "PShy2RYNadDUhJf4ErOJ7w", "review_id": "y-xFRkH3PrAs3tdCvSauAg", "text": "Total and epic fail.\n\nI've attempted to go to this practice twice.\nI shoulda learned after the first failed appointment- however, the convenience of their location coupled with my laziness made me go in for a second attempt.\nShame on me I guess.\n\nThe first appointment I had with them was \"rescheduled\" about an hour before my appointment to a different day altogether.\n\nThe second appointment I had with them was actually made for the Tempe location (when I specifically asked for the Ahwatukee location), and then when I tried to reschedule something- they didn't have anything with a doctor for another month.\n\nCan't imagine actually being sick or super preggo and dealing with these types of issues!  Thus, I'm taking my vagina elsewhere.", "business_id": "aOtx6bMU5M-Q_cNxhB0wYw", "stars": 1, "date": "2014-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Qy6J2LEww7zoL-vtzwCwYg", "review_id": "Crkc2e7jyij6y4IC098jVg", "text": "My appointment was at 3:30 pm. I've arrived at 3 pm. Now its 3:53 pm and they are busy. I wouldnt consider this a horrible place. The place is clean and they have enough admins to clear the guest area for paperwork but its going slow today.", "business_id": "aOtx6bMU5M-Q_cNxhB0wYw", "stars": 2, "date": "2015-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Sng5pSzcDaAS4vdXQbEeMQ", "review_id": "yhm5Ty4WWS7EbkLNTgzHQQ", "text": "I'll start by saying I went to Southwest Women's Care from 2006 up until a month ago. The facility is clean. My annual exams usually went fine and I was in and out in a reasonable amount of time. \n\nI had an abnormal pap smear for my first time this year and had to come back in for a colposcopy and cervical biopsy. After a week of anxiously awaiting my results, I got a voicemail from the RNC I saw telling me \"I have your results, please call me back and tell them to track me down personally so I can speak with you.\" I called back and they told me she'd just gone into an exam room and that they'd have her call me right back in 10 minutes. An hour and a half passed and I was really starting to let the nerves get to me.. so I called back. Her assistant said she just went into another exam room and she'd call me back. So I waited. \n\nFour hours pass and no call. Finally, I call back a third time and was able to speak with Ms. Scrivner, the RNC who performed my colposcopy and left the message. What she told me was \"You have high-grade cervical cell changes so you DEFINITELY need to get in here for a LEEP procedure, I'll transfer you to scheduling\" Click. That was it. Scheduling picks up and had no idea what was going on--they even asked ME if I needed to schedule a consult or the actual procedure--excuse me, but isn't it the provider's job to know these things?\n\nAnyway, I got the consult scheduled. I knew absolutely nothing about my condition, all I had was the information of \"high grade cervical cell changes\" and how urgently I needed LEEP. The next day I left a message for the nurse triage explaining my situation and telling them I need more info about my results and to give me a call back. The nurse called back and was horribly rude and condescending. She snapped at me that \"these are precancerous cells that are going to turn into cancer unless you come in here and get the LEEP.\" Out of despair and worry I asked if there were any other options. She snapped back at me again, saying, \"These are cells that will turn into CANCER. You CANNOT sit around and do nothing and NO there is nothing else that can be done because the infected tissue will spread and infect more until you have full-blown cancer.\" That was the extent of information I got about my test results, and simply trying to get more information about my condition so I don't give myself an ulcer worrying about it. Of course I had the words \"these cells will turn into CANCER\" rolling around in my head for days, which was pretty emotionally crippling to be honest. \n\nI was so distraught with the way the triage nurse had spoken to me and how rude, condescending, and cold she was, I started looking into different OBGYNs. I called Southwest to request my records be released so I could bring them to my new doctor. I requested only the past 2 years of records, and they were able print them and give them to me in about fifteen minutes. I decided I wanted all of my records, so I went back in and they told me it'd be $15 and they'd call me when the records were ready for pick up. Fine, I understand. Nine days pass and no call. I call back and they tell me anything before 2009 is in storage and they'd have to physically get it, which \"takes time\". I sure wish someone would have told me that instead of letting me sit around for nine days wondering what's going on.. So I told her it's fine, just give me anything you have on hand. She agreed she'd print everything from 2010 on and call me within 2 days to pick them up. It's now been two weeks, Southwest has never called about my records. The only call I've received is them telling me I owe them more money, despite already being sent an invoice and paying for the colposcopy/biopsy that was performed. I asked why they didn't include all of the charges on the invoice they sent and they didn't have an answer.\n\nWhen the time came that I did have abnormal results, the staff and especially the triage nurse were exceptionally unhelpful and rude--they couldn't even provide me the most basic information about my condition. I took my two years of records to my new doctor, who is an MD by the way (never once saw an MD at Southwest) and she took one look at the biopsy, sat me down, and explained everything that was going on. I don't know why nobody at Southwest could do this for me. feel much more comfortable and confident in my new OBGYN's care. My new OBGYN informed me that I did have other options, I guess Southwest just didn't want to offer them to me. I'm upset I didn't make the switch earlier. Long story short, I think Southwest is more concerned with money and getting people in and out without actually giving a damn about the patients themselves. I will not return and would not recommend to anyone.", "business_id": "aOtx6bMU5M-Q_cNxhB0wYw", "stars": 1, "date": "2015-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WEpFzCrF2HJraSvuWZzsqQ", "review_id": "xR-B6tFzpKSJPSdk4k-8lw", "text": "Dr Nagul is excellent. He picked up on some issues that my former docs never even thought to look for; as a result, my health is improving daily. But the practice has some quirks that a new patient needs to be aware of:\n\nDr N doesn't accept marketplace insurance. Copays must be paid by cash or check ONLY, no credit/debit cards (and the receptionist may or may not tell you when you make your first appointment). Everything is on paper, there are no electronic records or prescriptions. Secure, yes. Inconvenient, YES.", "business_id": "HsJiTqIjUqI-t1bnPFcp2g", "stars": 4, "date": "2015-04-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "A99dyhEqcd_yXKPfBWeZHA", "review_id": "wUJRAgy5_2PtjWiO5SRD8Q", "text": "Went here for our first ultrasound and I was impressed with the office, staff, and equipment.\n\nThe location is a bit hard to find as there is no signage outside, but once inside the building, you can easily find their suite on the suite locator by the elevators.\n\nThe morning staff was friendly, helpful and answered all my questions with a genuine interest to help.  She was helpful in putting me at ease.\n\nThe gal that did my ultrasound was very knowledgeable and thorough.  She was not one of those technicians that just evaluates your ultrasound without piping in with comments or facts.  I usually have experienced that at SimonMed (the technicians gather the data but say nothing to you while gathering it.. which can really be stressing since a stern look at your ultrasound can cause you to worry for no reason).  I enjoyed her company and both hubby and I were happy to have had her do our ultrasound.  The Dr. that came afterwards did no additional screening which seemed fine since we got TONS of pictures (even 3D!).  The tools are impressive and I would come here again for the same service.\n\nI recommend this facility based on the pleasant office, office staff, and ultrasound technician staff.\n\nMY ONLY complaint was that this business is SO busy, I basically had to beg the central scheduling office to find me an appointment quickly because their next opening was way later than I wanted... she was mildly helpful but eventually got me in to a farther location after another person cancelled their appointment.", "business_id": "K4yExVqUtW2sRE4grXU8Zw", "stars": 4, "date": "2013-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "CLh1xIZHwriADyaVqLtZ5Q", "review_id": "KnBwT3iwW2ORQ8MJcTtjSA", "text": "I was referred to this clinic from my RE. Worst clinic I have every experienced. They are too big and give patients false hope. I was told they could do certain procedure then the doctor who was suppose to do it goes out of town. They don't know when he will be back, so they will not do the procedure, which is on timeline for the safety of the fetus. Kind of frustrating, when you have to start looking up new clinic and doctors to see to do the procedure. \nYou will never see the same doctor twice. They are very disorganized clinic, I would never recommend it to anyone. Their doctors are smarts but that is about it. Don't rely on them scheduling you correctly. Very Very disappointing.", "business_id": "K4yExVqUtW2sRE4grXU8Zw", "stars": 1, "date": "2015-03-25", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "hGvHc3YnSvAgUhSGEum5cA", "review_id": "pQ2PUjNTT4GMrmJYafWlBA", "text": "My husband and I visited them recently because he was experiencing chest pains.  It felt great to speak with someone who listened patiently and not make us feel like they're ready to bolt out the door the second they walk in the room.  We felt like we were important.  And all are questions were answered to a satisfaction.  Now, that's real doctors work.", "business_id": "9JFmuEuUzt8VSUisejFrtg", "stars": 4, "date": "2013-05-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Dd1JM4375DEl54HueHvxPA", "review_id": "z00Oy3m6dRr8ZwuY7krfbA", "text": "Wow I know this is a smaller research active doctors office, but if other offices ran there business the way these people do I would come to doctors more often.\n\nI have been here multiple times with fellow employee to have blood drawn and we walk in every time. No wait no hassle and every doctor greets you with joy. They are the nicest staff and give you snacks as well after your visit.\n\nTo me when I'm already going through the pain of visits to doctors all I ask when I'm getting bent over ( money wise) is that I don't feel like cattle on a assembly line and I don't wait 4 hours to see a doctor I'm paying out of the ass for! \n\nGood job Pulmonary Associates !", "business_id": "9JFmuEuUzt8VSUisejFrtg", "stars": 5, "date": "2015-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "_Etjw3wIiOO3gfjciOzpCg", "review_id": "FZx1z46tWu1p4KfB9NLfvg", "text": "If you like a doctor who is impersonal then you've come to the right place. I have been going to understanding women for my yearly wellness exam for several years.I usually see the nurse practitioner who was really great.  Then I had to see Dr Keri Sweeten For some tests, after going home and remembering that I forgot to ask a few questions. I called and was told that I would have to make an appt to see Dr.Sweeten at a regular doctors visit fee. I said I just need 5 min of her time will you please have her call me, when they asked her she said I had to make an appt! She couldn't be bothered to take 5 min to call me and answer a few questions about my recent visit and tests. She misdiagnosed my problem and I ended up in the hospital 3 times.\nShame on you Dr Sweeten, your bedside manner is terrible. You have lost a patient.", "business_id": "kOT8AO8e1e3J9pUBJ2C7Iw", "stars": 1, "date": "2014-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2OFDDaFa5QjwAjs_i2GBPg", "review_id": "CasdaC_B6pMnZggAlaDulw", "text": "Dr. Salyer was my doctor and he was great!  He took the time to explain why I was having shoulder problems.  I had x-rays and the x-ray techs were nice and friendly.  I had two cortisone injections and it fixed me right up.  I would recommend Dr. Salyer for anyone looking for a good orthopedic doctor.", "business_id": "a-XWQ4HyxJEctlowO8rXwQ", "stars": 5, "date": "2014-05-13", "type": "review"}
{"votes": {"funny": 14, "useful": 13, "cool": 11}, "user_id": "APLIPfq1Rf8QyhHHk2uAyA", "review_id": "GZTmq4_h5l298HsQM7zYEw", "text": "Ahhhh, yes. Every woman just loves the Crotch Doctor. I am no exception. There's nothing like spreading eagle in front of somebody you just met, who may or may not know what \"gentle fingers\" really means. (Uhm, yeah right.)\n\nAlas, the search for a great M.D. or OBGYN is one of those exasperating yet essential quests in every woman's life. \n\nSo, imagine my disdain when - newly located to Phx - I had to strike out to find a female MD I didn't want to strangle. \n\nLuckily, luck was on my side. \n\nAfter searching for who was covered by my insurance (on their handy-dandy Web site), I found this place - Central Phoenix Women's Health Care Center - and was introduced to Dr. Susan Morton-Pradhan. \n\nI had no idea what to expect. It's like calling a salon and hearing the name of somebody you never met, who could royally f*ck up your hair. But, there's only one way to find out...\n\nThe Center itself is located in a 3-store office-type building on the South side of Osborn, just shy of Central. You are welcomed by grey walls, stale carpeting, a dingy elevator you fear is going to malfunction at any given moment. Yikes. The Center staff is terse, unwelcoming and standoffish. They seem a tad disorganized, having thought my appointment was for something else and demanded I pee in a cup, just after I had rushed to \"empty the pipeline.\" So, I had to drink 17.5 of their half-sized cups of water-cooler water, trying to entice an encore. That's when they ushered me back through the waiting area and said, \"Oh, we don't need a sample... But you can give us one if you want.\" D'oh! \n\nOh, whatever; they do their job. You fill out paper. You sign-in. You wait. You get weighed. You know, the usual. I can deal with shitty staff, so long as my Doctor is the Patron Saint of Gyno.\n\nNow that Dr. Susan Morton-Pradhan has gone to another place, I can review this Center for what it is: A place for women to go when they need their annual screenings, as well as when there happens to be a bun in the oven. (Oops, how did that happen?) \n\nLucky for me, I have no reason to go back, considering my Doctor relocated and, by god!, I'm following her. She's the best Crotch Doctor I've ever had!", "business_id": "eovEq5kDSdf0WF_P_bD2Uw", "stars": 3, "date": "2008-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "swHnG4cpHKfN8l-6BTgAmA", "review_id": "ui_9YclE0ltwyR8mrg-OHg", "text": "I was seeing Dr. Johnstone when I delivered and ended up with Dr. Cyr from Central Phoenix Women's Health Care when I delivered my son.  During the delivery Dr. Cyr was amazing and made what could have been a stressful and scary experience a very beautiful birth experience.  I really can't say enough about Dr. Cyr!  After the birth of my son I immediately switched practices so that I could see her for my follow-up appointment and annual exams.  She has such a great personality!  Every time I went in to see her I felt like she truly listened to everything I had to say, answered every crazy question I had and never seemed rushed, she always took her time.   I feel like I know a little about her personal life and felt close to her.  It is so nice to see a doctor that you feels like a friend and cares about you.  \n\nAs for the office, all of the staff were very friendly and professional.  I never had a bad experience there!", "business_id": "eovEq5kDSdf0WF_P_bD2Uw", "stars": 5, "date": "2015-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "iemswP_ZAZbpjlEJdGlQHQ", "review_id": "_1xM6lqTGjg2JA0T-hARpw", "text": "I used to like this doctor, but now I don't.  The PA who used to examine my moles on an annual basis left, and the new one seems overwhelmed.  After waiting for months for an appointment, I waited 55 minutes in the outer office to have a 5 minute examination. Wonder how much they charged my insurance for that?", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 2, "date": "2009-03-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9-Tfpqie1g91eP2jtkEGvQ", "review_id": "_cstph9N3LvW8ebizV97_A", "text": "If you want kind and caring staff, as well as an artistic and cutting edge approach to keeping your skin young and beautiful, this is the place!!", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 5, "date": "2011-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3qk6Tjrqj-2b-KxO34IyiA", "review_id": "9M8tImkEiEANZfUlITYpag", "text": "I've been going here for vitiligo treatments for the past couple of years. Everyone is great! Appointments are always on time. Top notch.", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 5, "date": "2014-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "rsC9XAwGyCBSPxHmJlNUcQ", "review_id": "one1NUhRIGwVrvRyeXnWyA", "text": "I have had trouble with acne for years, had chemical peels, micro's, used all sorts of topicals and medications, and every face wash out there- one of the aesthetician's- McKenzie, recommended I try adding a Clari-sonic to my routine (which has been working \"okay\" for the last few months) I was reluctant to try it because of all my past acne's relief trials but, her skin was super clear and she told me she used one too. So I ordered and I am so happy I did! I used it for the first time last night and even after the first use my skin felt cleaner, and softer. It pulled out all sorts of build up. The next day my skin was still super soft, my pores on my nose looked smaller, and everything just felt clean. Cannot wait to see how this helps improve my skin in the long run!", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 5, "date": "2014-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FIUlZUvpGrC5stRCUFFwLg", "review_id": "ullGkrhA-f6VTluQta_BbA", "text": "I have put off the dermatologist for literally years, and had four different skin issues I needed addressed. I finally bucked up and called for an appointment on Thursday, got in the very next day, and had every one of my issues dealt with inside an hour. Wow, I'm super impressed with that alone. Then Elizabeth, the PA, was amazing. she did a perfect job, and was very talented in removing a mystery lesion. Her MA Candice was also the best performance I've ever seen from an MA. There was no sales pitch at any time, but I will definitely be a returning customer. While I was waiting, I read the \"menu\" of services, and seriously, I am done, and can't wait to try out more of their services.", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 5, "date": "2015-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_cfkppu33JhdiZknBSM50A", "review_id": "-u0BQ8YJ2M2bKu2bVD8usw", "text": "I went in today and I was amazed to be taken back for my appt on time.  That hasn't happened at any dr's office in years.  The assistant and doctor were both great and they removed 2 moles right there on the spot even though my appt was for a general check up.  I expected them to tell me I had to come back at a later date for that since it seems like most doctors want to get you to come in 3 times for one thing.  A+", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 5, "date": "2015-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "nEvmhkxhXWoSe5BUiEtV9A", "review_id": "l6_Xlc8O2QXSPIbNdvPtqQ", "text": "Front office is very unprofessional and rude. This definitely reflects on the work they do since they don't treat their patients with respect...", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 1, "date": "2015-04-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "-hLgaUThLNda5JL2sMHFFw", "review_id": "mqHJM-9nRzOSZ_HdPvZFRA", "text": "Came in for a mole removal at Central location and had an excellent experience!  The PA was so nice, numbed the area perfectly and I did not feel anything.  She also listened to my concerns about scarring since the mole is in a visible area.  Great experience and I will recommend to others. Thanks PHX Skin!", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 5, "date": "2015-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xUZR2fvh3zNs55JqolimyA", "review_id": "6D5AoE87Q3QboNNCApctPw", "text": "I've known dr. Shindell from pch, he is an amazing Dr. No other like him! He cares about every patient! I had not seen him in year and he fit my son in immediately. He is the best ortho Dr. Around!", "business_id": "epXH-NxReRzcJzpMyBEXNw", "stars": 5, "date": "2013-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vP1-Z02_14sYZC2mr_3j4g", "review_id": "W1sXaNdmdI-ZCgx8Fvlf6Q", "text": "The waiting can take a long time to see the Doctor, but it is well worth the wait. Dr. Corrigan is extremely friendly, knowledgeable, and gets right to the point. Although sometimes it can get annoying with his medical students.", "business_id": "7Y5HNCtQGCIP_28QfjfihA", "stars": 4, "date": "2015-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-tnqzTVlLXsnYQ95IDppQw", "review_id": "5RWh-L3f411sOOw6fNlGbg", "text": "I am extremely disappointed by the customer service provided by this office. I made an appointment to get a referral, waited 10 days, and did not hear anything from their referral corrdinator. It took me a full day of calling the office repeatedly to get them to actually do anything about processing my referral request. If you're going to give your patients the runaround, please warn us ahead of time that your service delivery is poor. We don't all have the time to chase our tails and spend hours on the phone chasing you down to do your job. Absolutely DO NOT recommend this doctor or his staff. One star only because I HAVE to choose one. You guys are what gives the health care industry a bad reputation. Thanks for upholding that belief.", "business_id": "7Y5HNCtQGCIP_28QfjfihA", "stars": 1, "date": "2015-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mNRNO1LliIUqeYHh6hc7QQ", "review_id": "jOHUtS0UB3-fX6O-ZF8icA", "text": "Are you kidding me with this office staff? The Tempe office wait is NEVER less than 45 minutes. Why have an appointment if it's an hour or more that you sit in the waiting room.\nToday, I left after waiting one hour and 15 minutes. RIDICULOUS! Can I bill them for wasting my time?\nDr Carter performed knee surgery. He's a great doctor, but it's not worth putting up with the office staff to see him.\nAlso, good luck having them fill out leave paperwork for your job in a complete, correct, and timely manner. Because of their errors, my paycheck was held up for a month! AND you get to pay the office $25 each time they fill out paperwork. \n\nI've been to 3 other orthopedic surgeons over the years in the valley and none with as poorly managed office as this. Do yourself a favor and find a smaller office where you'll be treated like a person rather than a number.", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 1, "date": "2012-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0s7iTh9hswD7CnZocMXKMA", "review_id": "owQJYRE4IE3Q5Gm679MnuA", "text": "Great experience here. Have you ever been to the doctor and wonder if he cared or even knew what he was talking about?\n\nWell, both of those issues are not apparent here. Dr. Carter and his little apprentice took great care of me. They were very busy, but nonetheless they made me feel like my little knee injury was important and needed their expertise. I was very impressed that they just took the X-Rays right there on site and reviewed them...right there on site. Very impressive and effective. By the way, Dr. Carter is the primary physician of the PHX Suns....so that should tell ya something. Any joint pain, go see these guys. Not one complaint here!\n\nI think the address listed here on Yelp is wrong. It's actually SOUTH of Baseline.", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 5, "date": "2013-03-07", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "8cVFFUaHAnj83XZH-F1iuw", "review_id": "AYGpGYOb7JwCZE3SkFXEhQ", "text": "Worst physician experience of my life. Spent a total of 10 minutes with the spine specialist, and that's only because I had the nurse bring him back into the room to spend more time with me. Got the bill today...$399 for 10 minutes! Unbelievable! I'm in the wrong industry if a specialist can literally not even examine a patient and make hundreds. Shameful.", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 1, "date": "2014-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1JtHnE4hz1jaiyv4Tfo9kQ", "review_id": "PS9Ksu1GKgjPN26qaxHuCQ", "text": "Got bad service from the scheduling people, they schedule patients for doctors who can't even help you even though they know why you were visiting.  And this is after they canceled the appointment on me and then rescheduled me for a doctor who couldn't even help me... Resulted in losing three weeks of treatment.\n\nIf you can find another clinic.", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 2, "date": "2014-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Q1pmHmYIOpaQhdAXceFXkg", "review_id": "NI9dRIuXQQ2j779Fvun5wQ", "text": "Avoid it if at all possible. Dr. Cummings gave me the most poorly thought out, ridiculous diagnosis in about 5 minutes which ended up being very easy to prove incorrect later on. The PT was actually decent and somewhat helpful but I later realized you only see them once for the most port, then they dish you off to the assistants, who don't really know much of anything about your specific issue and were not even there at the consultation. \n\nIt's always the same story w/ these types of shops, they treat you like a commodity. Wish I had never called them.", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 1, "date": "2015-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "ChpTXRbbQt4AWCtB9rTaLA", "review_id": "cC6W5Wrwa7v2gItyonK72w", "text": "Chalk this one up to one of those - I Should have read reviews BEFORE making my appointment lessons.  Honestly- I think of Yelp when we want food or fun- it really had not occurred to me that medical PROFESSIONALS would have scores of negative reviews on here.  It sure does now after my experience at TOCA.  As with many of my Yelp reviews- I have blogged my entire experience in full for anyone that is inclined to read more than the 5000 character limit that Yelp provides you can do that here:\nhttps://gerouxcrew.wordpress.com/2015/04/08/run-for-the-hills/\n\nPros: They took my insurance (Health Net PPO), they had an appointment within a few days (while others I called were booking weeks out) , I had two friends that saw a specific doctor at Toca for a similar ailment as mine and both of them had good experiences.\n\nCons: I could not get in with the Doc my friends experienced so settled for Dr Zoltan.  Had to go to Tempe where their office parking situation is a complete nightmare. An appointment is just a suggested time for when you will be seen- but if you are late they will cancel and bill you. (one thing I loathe about medical establishments)- in my case my appointment was later than it was supposed to be because an older gentleman came in without an appointment and they \"squeezed him in before me being taken back *RED FLAG!\n\nOffice staff: When calling to make my appointment they were ok- when I checked in one lady was super nice and when we left the appointment they were on top of wanting to \"help\" but it was far too late at that point.\n\nDoctor Zoltan: rude, rushed, condescending and disengaged.  We brought MRI images with us to my appointment (I had injured my knee a week prior while doing a fun run obstacle course event--Urgent care X-rays were clean but MRI done by Simon Med was showing that I had a completely torn ACL and  2nd degree MCL tear this is why I was seeking out an orthopedic doctor)  Doctor spent about 3 minutes in the exam room with us, manipulated my knee for a few seconds and then left to read the MRI and report.  When he came back he said he did not think my MCL was torn because I was not showing pain the way he felt I should be showing it a week out from the injury.  He then said my ACL is torn but not completely and is likely a tear I had long before this injury and was just unaware of it. (???really?? that is interesting) Doc wants to do \"aggressive therapy\" and check me in a few months but no surgery at this time- I had to pretty much beg him to stop from walking out the door so I could ask 2 quick questions both he replied with \"yup and sure\" as responses as he was walking away- he then did a little point of his finger and wink at my husband and was gone.  Total direct time with Doctor for this orthopedic consultation was less than five minutes.  PT came in and fitted me for a brace (which I had to request-that was one of my 2 questions) so at least I did get SOMETHING out of this appointment.  Nurse informed us Doc wanted to see me again in 4 weeks and I made it abundantly clear that we would not be returning.  Both the nurse and PT were totally not phased by my remarks or by my husband stating that we felt very poorly cared for at this visit and for the most part they just shrugged us off with forced sympathetic smiles and left the room. Total time from when the doctor walked in to the exam room to when we were leaving the building was 23 minutes which included him reviewing my MRI images, and me getting fitted for a brace.\n\nI will be seeking out another opinion (technically a 4th opinion at this point since both the MRI imaging Xray Tech and Urgent Care doctor read my images differently than Dr Zoltan- who didn't even take the time to explain what he did see or did not see in the MRI when he looked at it.\n\nAfter reading the other reviews on here about the lack of thorough patient care and attentiveness- everything I experienced seems to be pretty typical at this office.  I strongly urge others to seek care elsewhere.", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 1, "date": "2015-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "G6Rv0jJXloZiglqqLGFgBA", "review_id": "fVXHYgDVxL54aKylEBGF0w", "text": "This place is clearly a meat market. Dr. Heber  is so busy he missed the elbow. He missed the problem area due to poor testing.  I mean he missed the injury and settled for less. I was told if I rescheduled appointments he wouldn't see me at all. I tried to complain to the practice leader and never received a return call. I complain many times and no one would listen to me. Oh, he missed my left arm all together. Did I mention this is a meat market. Do not have them perform any procedures if you care about being treated with respect, kindness and dignity. Run! Run fast\n\nThe staff might make it at the post office...maybe.  Thats unfair to postal workers. Sorry. \n\nGo to Dr Leber....he is what you would expect from pro. Az hand and wrist.", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 1, "date": "2015-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z7k2c3J8VSqCHpiqJnEgIg", "review_id": "Yv1kSA8sZkoal3yj-T33Pw", "text": "Check-in was fine, but I waited an hour and a half to see a doctor once I was in the patient room. This is unacceptable. What is the point of making an appointment. Also, the doctor I saw was incredibly rude. I hear he's a great surgeon but he has a horrible bedside manner.", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 3, "date": "2015-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "CmWNL7Sn6tAAPtrnNEn3MQ", "review_id": "ZC-j3y54LMzrhgttwXI6Tg", "text": "Had an appointment yesterday for the first time as a new patient. After an hour wait I saw the doctor. After the doctor realized I didn't need surgery on my arm afterall, he was a complete ASS!  He recommended that I come back in 1 month for a followup to check the healing process of my broken arm. The staff could not have been more RUDE and UNHELPFUL in making a follow up! I actually work for a large group of physicians myself in a large practice and I have never heard any staff treat patients like this! If we did we would be out of a job! Worst customer service ever! Do n yourself a favor and find a different group ! Needless to say, I will NOT return to this office ever again! So disappointed!", "business_id": "oZdqBEQLwl85jEQKL6XMPQ", "stars": 1, "date": "2015-05-28", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "aRlggQmKdaC8K9yAMuFGJA", "review_id": "seKZvNgLIht-NBwMm5C3Vw", "text": "I expected quality care and service but certainly did not get it.  After I went back to be prepped for surgery, the nurse asked what time I was told my surgery would take place? After I told him, he frowned and said they put me on the schedule for a later time by mistake but if they hurried, we'd be fine. The next nurse wrenched my arm in the air  until i screamed in pain and told her to let go. i was there for shoulder surgery. She then said 'wow, it feels like its dislocated'. I said it probably is now.  She then blew out the vein in my hand but continued to dig around with the needle trying to 'get it'. After several minutes of unsuccessful attempts and me writhing in pain, she finally decided to move up top for the IV. The anesthesiologist had the personality of a rock. They finally took me in for surgery. I woke up in excruciating pain. The recovery nurse told me shoulder surgery was one of the toughest to have. I was literally moaning and crying from the pain. She asked what my pain level was and i told her at least an 8! She said she couldn't give me any more demerol, and did I want her to get my husband. I told her no, my little boy is with him and I'm in too much pain. I asked what time it was and she said 10:10. She gave me a Vicodin and left.  She came back and asked me if she could get my husband again. I asked what time it was and she said 10:25 and how about if she helped me get dressed. I gave in and said sure. As soon as I was dressed she went and told my husband to get the car, without asking me if i was ready. She wheeled me to the front door, and was gone the second I stood up from the wheelchair.\nAlso, neither the doc or the anesthesiologist came to see how I was in the recovery room. I felt like they rushed me out so they could use the bed for someone else and they didn't have my pain level under control.  I will never go here again. I'd switch doctors if I had to before using this facility ever again. If i ever need surgery again,, I'm Sticking to Scottsdale healthcare from here on out!", "business_id": "rdc24noiVveKlfifEwVNvQ", "stars": 1, "date": "2014-03-10", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "EbOOSjyRvF_vQOGkKy1DPw", "review_id": "zvgQuXoJWIVlyYHPOMdb1w", "text": "Horrible experience with this guy. Gave me surgery on both shoulders, said he had no idea where I should go for physical therapy, there for I had to go through about 10 different PTs to find one that cared. Both labrum pairs failed, thank you for not caring and making the last 2 years of my life miserable Dr. Zeman.", "business_id": "ZPkomfeRH2pflacWf7U3-A", "stars": 1, "date": "2015-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zemraIXtdaNmeVdtstDjCg", "review_id": "1Z4CsP8szkAuQbHzODFURw", "text": "Just realized today is my 1 year anniversary of my Lasik.. Still PERFECT VISION!!", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 5, "date": "2013-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "P6D9nJkBrx7rhyGtpHxHUg", "review_id": "UufVV0GYs5bQsK_COKw8Hw", "text": "Their commercials got me in the door but their customer service, knowledge and wonderful staff has me going back for my surgery.  Everyone I spoke with was very knowledgeable; they explained everything about the procedure and even offered financing.  \nVery clean, very friendly, can't wait to get my vision corrected.", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 4, "date": "2013-05-08", "type": "review"}
{"votes": {"funny": 1, "useful": 14, "cool": 1}, "user_id": "C7deL5C4qvzDvI59s8hWpQ", "review_id": "MucwrTTadKT9fcBkmR3JWg", "text": "I wish I could rate the facility higher but due to me experience with Dr. Perkins, I can only give them a 2-star rating.\n\nI have since filed a formal complaint to the Arizona Medical Board stating the following:\n\nOn February 7, 2014, I went in for a scheduled PRK Revision Surgery with Dr. Scott Perkins of Barnet Dulaney Perkins Eye Center.  Dr. Perkins was unprofessional in the manner in which he spoke to me during the surgery prep and during surgery.  I have had this same procedure done October 4, 2013 so I am familiar with the process and the experience.  After Dr. Perkins put the numbing drops in my eyes, the next step was to place a sponge like object on my eye.  Unlike the time before, it was extremely painful causing me to squint and twitch in pain.  I said, \"It burns.  Why does it burn?  I know I should not feel this, I am concerned that I do considering you will be putting a laser on my eye next and I feel pain.\"  He exclaimed, \"Oh my god, you are so dramatic!  I have done 15 of these today and no one has been as dramatic as you!\"  I said, \"I am sorry but this is uncomfortable unlike last time, shouldn't you be just as concerned?\"  He then threw himself back in his chair and said, \"Are you done yet?\"  I could not believe the way that not only a doctor but a person was speaking to me.  He then proceeded and was unusually rough in the manner he completed the rest of the procedure.  Once Dr. Perkins was done, I sat up and was escorted to the post-op room where I was crying and beside myself in the experience and pain with Dr. Perkins.  I explained what had happened to the technician and proceeded to check out.  I not only experienced a tremendous amount of pain in comparison to the first procedure done by him but tremendous pain after.  It is my belief that Dr. Perkins did not allow the numbing drops enough time to take effect before proceeding nor did he have the care and concern for the matter.  I am disgusted by his unprofessionalism and the pain he put me through.  It has been 5 weeks since the procedure and it appears that my vision was affected by his poor quality work as my vision is worse now than it was 5 weeks after my first procedure and prior to this second procedure.  I do not believe this doctor should be practicing on such a delicate sense and lacks any compassion and bedside manner.\n\nIt really is such a shame to have dealt with Dr. Perkins because I have had a great experience leading up to surgery.  Dr. Schiff is the pre and post op doctor that has been such a pleasure to deal with.  He is very warm and informative just like the rest of his administrative staff.  After my experience that night, I received a call from their branch manager wanting to address the issue.  She stated she would send me a gift card as some type of consolation.  Three weeks later, nothing.  I sent her an email to verify the address she had for me and after no response a week later, I called her and she said that she sent it to me after we first spoke.  Yeah, maybe it got lost with her response to my email.  Another week, she receives a return on the mailing and realizes that she had the wrong address.  I get the $20 gift card with a note stating, \"Here is another gift card.\"  I was very offended.  She would have gotten a return on the first one since she sent it to the same wrong address IF she in fact did send it the first time.  I was initially impressed by the way K.D. tried to mitigate but then offended in the result.  This is a $4,000 procedure and I suffered a great deal of pain for a $20 gift card that required my constant follow-up.\n\nPlease note, I do recommend Dr. Schiff to inform and prep you for the surgery and his administrative staff, just please ensure you do not get scheduled for surgery with Dr. Perkins.", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 2, "date": "2014-03-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "EoZ12fWTJLYxhiH12UF7hg", "review_id": "3Xxt7TjsMZdIJHE-e4VPtw", "text": "I have been going here for over 5 years and I am always amazed at the level of care I receive.  I've gone to a lot of eye doctors over the years and Barnet Dulaney's doctors never let me down with their professionalism and the friendliness from the staff.  I've never had a bad visit.", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 5, "date": "2014-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nyTDDOnssCVaKhBo_Jad7w", "review_id": "DY4cy0vmHDRnYTo-jk3Q0A", "text": "I would describe this office as a well-oiled machine with a friendly and helpful staff that provide individualized attention so you never feel like you are a number. Everyone has a specialty which they perform in a professional manner. Dr. Perkins was my surgeon and he explained the step-by-step process during the surgery. I found the overall experience as good as having eye surgery can possibly be.", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 5, "date": "2014-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Jrx1fLr5JdqgHdIfMT7wag", "review_id": "7fvn7UZsoStKD8HZlbNzAA", "text": "I went to find out if I was a candidate. Unfortunately I wasn't. But the people were very friendly and professional. I would recommend them to anyone interested in getting lasiks done.", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 5, "date": "2014-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "aIAjAU-6NH583EkQ6E9KRw", "review_id": "PeNp6bntKDkz-91FvBy_Og", "text": "Best eye operation place, as far as I can tell, in Arizona - they handled my second detached retina and did a great job - top notch service with extremely experienced doctors - you may find some place less expensive but not as good.", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 5, "date": "2015-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "illuxKNVCOtdeohxsKv1XA", "review_id": "ZlJknQpgI0qNh2L2YAWH_Q", "text": "Everyone I met was kind, answered all my questions, and when it came to the actual procedure, the staff were reassuring and efficient. I am so pleased with my results. Highly recommended! A+", "business_id": "4R8uKEIwTVzHGLa3Edub0Q", "stars": 5, "date": "2015-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ycHGcjAm1v6CRl7ccdnw7A", "review_id": "U0JOGAbzPCE0dEqb2a6THw", "text": "But the rating goes mainly for the staff. Been with the office close to 10 years, due to past good experiences even fired my specialists and relyed on Dr James and wife Dr Jacqueline Doris for my care.\nMissing test results from labwork dated 10-15-12 are however a bone of contentment with the staff, especially the office manager, who takes quieries through my electronic chart access as an insult(?). Is asking for the test results- all test results- not my patient right? should I not have been advised on later appointments what the results are?\nIf i had some ungodly illness, shouldn't I be informed to keep the rest of the world uninfected??", "business_id": "c_PhRjEIA2jRAvWDWsn4Vg", "stars": 1, "date": "2013-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ePP_QT3wFS0exU_2Ax3SUw", "review_id": "x4V3DGDMeeuLvqUcvujqFw", "text": "Dr. Bowey is fabulous and makes you feel like you are her only patient. The downside is that if you don't have an appt first thing in the AM or right after their lunch break, you have a really long wait time! Have been a patient here for more than 5 years and will continue to be one.", "business_id": "c_PhRjEIA2jRAvWDWsn4Vg", "stars": 4, "date": "2014-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "xZuzRPmvgtninSVS1X2XJg", "review_id": "ZAINYSjy4E1h7D4ntJHhVQ", "text": "I was looking for a new doctor and came across Arcadia Family Clinic. I called to make my appointment on a Monday. They verified my insurance while I was on the phone and I was excited to hear there was an open appointment the next day! When I went for my appointment I had my insurance card and ID ready as they had asked the day before. When I was called up to the desk ( 10 min after arriving) I was told immediately that they don't take my insurance! I told the woman at the desk that they had just verified it the day before. She looked in a folder and said sorry we don't take this. I don't understand how I can sit on a phone call for 7 minutes the day before and be told to come in only to be turned away immediately! I wasted my time at this clinic and they weren't even apologetic about the situation. I hope the next doctor I try is at least compassionate!", "business_id": "c_PhRjEIA2jRAvWDWsn4Vg", "stars": 1, "date": "2014-04-23", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "iemswP_ZAZbpjlEJdGlQHQ", "review_id": "G_3cifY-A82UwzUxhoCctw", "text": "This man knows his stuff. He is a good family doctor. He does his continuing education and research and knows the newest things, despite the fact that he is a family doctor with a very busy practice.  And he doesn't complain about the American medical system, because he used to practice in Toronto and sees both sides. He's smart and he cares, although he has a somewhat gruff exterior sometimes.\n\nI'd give him a 5, except he runs  late all the time because he has so many patients.  On the good side, he has open wireless in his office for the convenience of waiting patients who need to work while waiting.", "business_id": "9zlpLPhXYwK_STi2u8DjxQ", "stars": 4, "date": "2009-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "fIvDzLhs-cXbTKWp8P3eIA", "review_id": "5RZ_Qdb1TMDObxxAa31ceA", "text": "I rarely give 1 star reviews, but in this case I had no choice. I needed an appointment on fairly short notice so when I found Dr. Kramer had an opening for the next day I jumped on it. I made my appointment online via Zoc Doc. I was also able to fill out all my paperwork online avoiding a long wait at the office. Arrive at 3:30 for my 3:45 appointment. The office was filled with screaming children. The receptionist needed my ID and insurance card. I had to fill out a quick consent form which was fine. \n\n45 minutes later I'm summoned back to Dr. Kramer office. I waited another 10 minutes in there before his PA arrived. She then proceeds to ask  me every single question that I already answered online which should have eliminated this long ass process. Finally Dr. Kramer arrives at 5:00. More questions, more examining. His conclusion was that I did not have a bacterial infection. I did however have a viral infection. He prescribed a Z pack. 4 days later and I feel exactly the same. I called his office yesterday and told them what is going on. I was then told that what he prescribed won't work because I did not have a bacterial infection and viral infections go away on it's on in about 6 weeks, but the Dr. needs to see you again. ARE YOU KIDDING ME?????? I asked the lady what he was going to do different on my next visit that he didn't do on the first visit. No answer.\n\nNeedless to say, I will not be returning to Dr. Kramer. If you simply want to give your money away I suggest an organization like PAWS (pets are worth saving) because Dr. Kramer ripped me off and had the nerve to try to do it a second time.", "business_id": "9zlpLPhXYwK_STi2u8DjxQ", "stars": 1, "date": "2014-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9gK9KtgqJawfctRIoWWErw", "review_id": "7wwkv9f8C12AXSmXJ3aa-g", "text": "I hardly give reviews especially one star reviews but I had a horrible experience. 45 minute wait, wouldn't give me any of my prescriptions I have been on for the past 10 years. The office was not well maintained and Dr. Kramer was not very friendly or helpful. I will not be going there again.", "business_id": "9zlpLPhXYwK_STi2u8DjxQ", "stars": 1, "date": "2015-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "gGNAr-cmCQUgA9B0QjVqAg", "review_id": "gCRr4EtJnVJ4Rtea4Q4oPQ", "text": "I met with Doctor Mayy Deadrick a few weeks ago and immediately felt at ease. I can tell that she will be a wonderful family doctor. Best of all, Mountain View is home to several doctors so we should always be able to get in the same day or the day after we get sick. The waiting room felt clean and comfortable too, which is a big plus for any doctor's office.", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 5, "date": "2011-03-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "KqUf3uBah7mdq22dDj3FrQ", "review_id": "BWMR6GdlIZy2udTQ1aPK9Q", "text": "Dr. Gregory Bell is a great doctor,  he took his time and paid attention to every detail. He gave me great alternatives to medications and other options to think about. They also give you a online patient portal to access your medications, order refills etc. I also like that they have their very own lab on site so you can do blood, urine and other types of tests the same day. (Make sure you don't eat for at least an hour before doing this option) the staff was very friendly and I didn't have to wait long at all.", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 5, "date": "2014-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VuEz4exG3lBmVmkPvw2eag", "review_id": "txlOs3S6WlvakPH-Ti5krg", "text": "Dr. Mansfield is amazing. She listens and provides valuable feedback and resources. I just moved t the area, and I was worried about finding a new physician. I'm not worried anymore; in fact, I'm going to stick around even though I've moved to Tempe. Fabulous care.", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 5, "date": "2014-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dQsDU-KcEYNrNgeoYNwdMw", "review_id": "NgFKSSACBKT_-gJlfkgtuw", "text": "No wait, office staff was friendly. I went here because my old doctor no longer takes my insurance and they did. I was prepared to do blood work. Instead,  I walked in, mininamaul wait, but the doctor put on his latex glove and felt my glands and wrote me a refill? Really? No blood work? I have not had my thryoid levels checked in over a year. Okay, whatever.... I will work on finding a doctor who seems a little more vested in my over all health.", "business_id": "yS6tXY9skBQ4eLZLQaDlEg", "stars": 2, "date": "2015-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "YBOyn0hfUNjmbVOFbs0FSg", "review_id": "ziwPxZ7UKW86es0REp7JIQ", "text": "I was blind as a bat now I have 15/20 vision. It's been a year since my operation. Very happy with this place.", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 5, "date": "2012-05-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "lO41PRRijDRBrv1VtKij1Q", "review_id": "T7hJ1Hpu-AfvXj07eZzHtA", "text": "Everyone is very professional and has your best interest as a priority. The worst part for me was trying to sleep that night with constant tears flowing down my face but I dont believe everyone reacts the way I do. I have always had sensitive eyes and allergies. There is nothing better than waking up in the morning and being able to see everything clearly (the few hours i was uncomfortable is worth it). It did take the full 2-4 hours but they do tell you the time limits and personally I wouldn't want to go somewhere that makes me feel rushed with something as important as my eyes.", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 5, "date": "2015-03-20", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "z8Ys-8Myk8ZPpa-BBDh2sg", "review_id": "HZ2czbV9NlmnwSlXHUWZfw", "text": "My husband had Lasik surgery today and he is doing great all ready! His consultant Valerie was so amazing and came out and spoke with us prior to surgery and made sure to answer any last minute questions. The staff was nice and everything ran smoothly. I would and will be recommending everyone who wants lasik to this facility! Thanks so much for everything!!!", "business_id": "s4gUV_zb8EeYosek2GBB4Q", "stars": 5, "date": "2015-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "4zad3D8Tlt7r2OAmgr-xKA", "review_id": "NcDvgfqq_0J2mp3_cYNPNQ", "text": "Hello, I have been going to Dr Riley for almost a year. I moved, Got new insurance and needed a new Dr that was close. As a new patient I was nervous, how ever when I got there the front office ladies were very friendly and the Dr spent about 30 min with me. I had lots of questions and concerns about my health ( it had been sometime since I had seen a doc). I'm approaching 38 and preventive maintenance is now important. I found Dr Riley on YELP, I found all of the reviews helpful. \nThank You To Dr Riley and all the staff at Biltmore healthcare!!!", "business_id": "BZqn7i_Z-MJ1QrxCyjFZSw", "stars": 5, "date": "2014-04-02", "type": "review"}
{"votes": {"funny": 1, "useful": 9, "cool": 3}, "user_id": "fczQCSmaWF78toLEmb0Zsw", "review_id": "THk6Qq8RJEpT_HTigZU4RA", "text": "It's not often that I've had pleasant experiences going to see the doctor, but after just two visits to this office, I'm sold!\n\nDr. Tamara Lieberman and staff have been amazing to work with to date.  The office is centrally located just off of 32nd St and Camelback.  It's clean and the staff is courteous.  I haven't had to wait long either visit, and when I did need to reschedule one of my appointments, it wasn't a problem either.\n\nI had some routine lab work done today and Susan, one of the nurses there, couldn't have been friendlier.  She was professional as well and luckily, the blood draw went super smooth; I hate needles!  I had such a satisfactory experience that I made an appointment for my husband to go see one of the other doctors in the practice for a physical as well.  (Neither of us had been for routine check-ups in quite some time prior).  \n\nIn my experience, good doctors with friendly and professional staff, are hard to come by, so I highly recommend giving this office a call if you're \"apple a day\" isn't enough to keep the doctor away!", "business_id": "5mz8CUNzBGOhrkvRqcWOzA", "stars": 5, "date": "2013-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ctv3fA3hu67sW5xcK5EJMw", "review_id": "-ROO74nvZ-LtWsqAZlg_ig", "text": "I have never needed to go to a heart specialist before, but all I can say is that i'm VERY impressed with the warmth I have received by the staff and doctors here, especially considering how busy they are.  The waiting room may be packed, but you still receive a friendly smile, and you still see your doctor at the scheduled time.  I needed an Echo done of my heart, and all the staff were very personable, and down to earth.  Dr. Cherukuri was my specialist, and I have not met a doctor who was so humble and kind in a VERY LONG time.  I recommend this place to anyone.", "business_id": "gVEtYzzezWoy1Jfvtv3ZLg", "stars": 5, "date": "2014-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PBdpLP3yMHV79Y7EjuBY4g", "review_id": "aHuDioCobUZgi9gX8ErXow", "text": "Avoid this place at all costs. My boyfriend went here for an allergy test. He called ahead to make sure they accepted his insurance and when he left they told him he was all set. Two weeks later he gets a bill for $507! That's AFTER his insurance was charged. \nA call to his insurance company revealed that they charge more than twice the local average for the tests, and his insurance wasn't going to cover the excessive cost.\nSave your money, go somewhere else.", "business_id": "vDftL4Exl7ZcMVx2aPY8mQ", "stars": 1, "date": "2011-05-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "I2ed5IBpz3Ge6WR6nFRvew", "review_id": "33Nykev2qbI49Ha64671uA", "text": "The WORST customer service experience I have ever had.\n They have no courtesy or manners what so ever.", "business_id": "vDftL4Exl7ZcMVx2aPY8mQ", "stars": 1, "date": "2014-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "xXxoYIsbfXFK8BKndCcnZg", "review_id": "VRO89sdnFoEDWMYPvBVl5A", "text": "I was referred to Dr Romine by a friend who is a nurse; can't say enough good about her...my skin cancer surgery was done so professionally, I never had a nervous moment. I required 8 stitiches in my forehead  which even the DR could not find on my recheck 6 weeks later: she did such an awesome job! The entire staff is friendly, kind, and easy to work with. Only drawback is the long wait to see Dr. R--but she is worth it. Have sent many other patients to her and all have been extremely happy!", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 5, "date": "2012-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "THYIqfnLV54VZ_v2hCfq2Q", "review_id": "IvOA5h_zEvDoIypy-mkVqA", "text": "Very thorough, I was referred here for a mole patrol last year and went here for a follow up a year after.  On my follow up 15 minutes later, I was checked head to toe and given the all clear.  No cancer, and they provided an good explanation of some hyper pygmentation on my ankles.  I'm not giving up my ankle socks, but appreciate the explanation.  From this fair skinned man, thanks Camelback Dermatology.", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 4, "date": "2012-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "58YQSpx5Ct8W3HxFhNs-Lw", "review_id": "OmgOWxcYVoOI7nERV1fGZw", "text": "This was my first visit to a derm.  I had an appt with the PA, but Dr. R took the time to come in and introduce herself to me- which I thought was a very nice touch.  I was seen on time and didn't have to wait long.  New office is beautiful and convenient location to my home.  Skin check went well.  I had some little white bumps on my forehead and was interested in retinol for anti-aging purposes.  The PA prescribed me Atralin, but did not give any detailed instructions on how to use or side effects.  I started to use daily and it tore up my skin.  Even cutting back to only 2x a week was still causing breakouts.  Eventually after 6 weeks, I spoke to a friend of mine in FL who is a PA for a derm and she asked what other products I had been using.  All in all, it was not compatible with my current regimen.  \nI liked the office and will certainly go back, but I know to ask for more detail.", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 3, "date": "2015-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wu8irjmbFuV0fNk6ASRNUw", "review_id": "DyEg6ZFT2xQwWpVryl1GvQ", "text": "Doctor Romine has helped me enormously. I've seen her for procedures 3-4 times. I had to reschedule at the last minute, and her staff fit me in a few days later with no problem. She is an extremely busy woman because she has so many patients - but this is a sign that she cares. I've never felt pressured to buy products from Camelback Derm, but I've always been given options and information with the ultimate decision being left up to me. She even called me over the weekend to check in on the results of my procedure. I can't speak highly enough about Dr. Romine and my experience at CD.", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 5, "date": "2015-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IjFrc51IXmMro4ZcxqTMiQ", "review_id": "GikP8x9q-7QBjbXW5XDG9A", "text": "My doctor recommended Dr. Romine.  I was very specific when making my appointment that I would only use Dr. Romine. Thus, I waited over a month and a half for an appointment with her. I reconfirmed my appointment with her the week before when I called to check the address.  I arrived this morning 20 minutes early to fill out paperwork.  When I was finally brought back a PA was going to ask me questions before my visit with the Dr.....not Dr. Romine.  I said that my appointment was with Dr. Romine and she said I was scheduled with a different Dr.  This must be their normal procedure because the same thing happened to my friend there a few weeks ago. I was told Dr. Romine was booked.  When I objected and said I wouldn't meet with the other Dr. The PA left and said she'd see what she could do.  After 10 minutes I went to the desk and asked for all of the paperwork I filled out to be returned.  At this time I was told they would try to work me in.  I decided I couldn't stay at a facility with such poor customer service and underhanded practices. I also called my primary Dr., told her my experience and that of my friend and asked her to not recommend this office.", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 1, "date": "2015-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "4vSGcZyNfIuKYUP6z9Cbyg", "review_id": "P4cJsDD95bWdYwP0xhg_5g", "text": "Haven't been to the doctor in 5 or 6 years, so I thought I would go and get checked out.  My insurance covers preventative care 100% and I have a large deductible for sick visits.  I went, had no health complaints, and the nurse told me I was the healthiest person she had seen all day.\n\nThe practice then billed a sick visit code to my insurance, which applied $130 to my deductible.  I called the billing number, explained the situation, and asked that they bill the prevantative visit code to my insurance.  The billing person told me the doctors pick the code, not the billing people, but he would check with the doctor and call me back the next day.\n\nHe never called.  I left two voicemails for the billing guy, which he never returned.\n\nI appealed to my insurance, who denied because the doctor used a sick visit code.\n\nSooo, my doctor is still sending me bills for the prevantative visit that is covered 100% by my insurance.  The office is yet to explain the \"problem of medium to high severity\" described is the CPT code.  The only diagnosis billed is V70.0, adult well visit.\n\nThis post is probably more about the billing dept, but still makes me mad.", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 1, "date": "2011-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BEcT2wCP-G0LfkKZSlYdzw", "review_id": "-BUUGbyBjzvpwnrA-ROZZA", "text": "Unfortunately, this administrative fee will prevent me from ever going back.  It's sad b/c I feel the care was really great.", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 1, "date": "2013-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GxsCWOvf0HBDLP-c4pvVHg", "review_id": "smNFnowbT51oG_u4duSjZQ", "text": "Dr. O'Clair is fabulous.  She is smart, caring, and very knowledgable.  I feel well cared for and listened to, which is very rare to find I feel today.  Plus they have in house lab, X-ray, OMT doc, and much more.  Not to mention the organized, friendly and helpful staff... Worth the admin fee every day of the week!", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 5, "date": "2013-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mrISE1t45bOurAMnhLWHWA", "review_id": "eB7uCSDZud1qwMJcz1c6cA", "text": "I have seen three different doctors at this office and each one has been fabulous!  Dr. Francyk is amazing, intuitive and really takes the time to listen to your complaints.  I really appreciated how much time he took with me.  I've had doctors that took a rushed 5 minuted to \"listen\" to my concerns and then just wrote me a script and sent me on my way.  Dr. Francyk was different.  He looked me in the eye when I spoke to him and I knew he was really hearing me.  He spent quite a bit of time explaining possible treatment options and I finally feel like I have a doctor that cares and knows what he's doing!!!  I've seen a lot of complaints about the admin fee of $49/year....but if I need to pay a small fee to have a great doctor and staff on my side, I'm okay with that.  I know a bit about health insurance and primary care doctors really struggle to stay afloat.  No wonder most of them treat their practice like a factory, churning out patients every five minutes.  If the stupid admin fee helps give me more time with my doctor, I'm all for it!  Thank you Dr. Francyk for all your help!", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 5, "date": "2015-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "VmDWM4ldX7Ktjm4slajZ-A", "review_id": "8RhxBgMDO9oGoJvI1o34mA", "text": "I have been to different doctors in the past and I have to say I am so pleased that I have found Jennifer Francyk P.a. She takes the time to listen and find out what's wrong. You can tell her and the other P.a. and Physicians are passionate about their jobs and they care about their patients. I have had doctors that don't follow up with me and see how I am feeling. But Jennifer cares and she will follow up with me even when she is not at the office. I HIGHLY RECOMMEND Jennifer and the people at her office. I promise u wont be disappointed with them and their practice.", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 5, "date": "2015-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iv3HgzgRpk-pq1aWvOt4LA", "review_id": "yc7s9AXoCzZAa96jeZxNpQ", "text": "This office charges an annual FEE of approximately  $50 to all of their patients.  Insurance companies do not pay the fee.  It is paid by the patient.  Some at this office have tried to compare it to and equating the $50 yearly fee to a \"gym membership\" when it is really nothing but pure Greed.  I also know of one Doctor in this office who has bad mouthed other doctors within the same office.  Wonder if they have any kind of \"code of ethics?\"  I highly suggest you find a different medical/doctor's office.", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 1, "date": "2015-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "R8-tRQVbiOwqUsaRCbOK3g", "review_id": "p211aKxksiFecu1yI4r5hw", "text": "Southwest Fertility is a wonderful operation of skilled caring medical practitioners who want nothing more than to help you become parents. The entire staff is professional, but not sterile. They take amazing care of you and spend the time that is needed when you have concerns. They have taken outstanding care of my wife and I during our journey. Even if the protocols they prescribed had not worked I still would have felt that I was in the best, most caring hands in the business.\n\nEVERYONE in the office is pleasant, encouraging and sensitive. The front desk people are considerate and pleasant. The nurses were caring, warm and supportive despite our apprehensions at times. The doctors are so very interested and committed to each person and never treated us like a number. Even the embryologist has a warm wonderful personality and was sensitive to our ups and downs while going through IVF.\n\nTruly, if you are faced with choosing a team to get you pregnant these are the people who are committed to your goals. We have done this before and this experience has been totally different. This time we are successful. \n\nThis is your team.", "business_id": "Y68Ysab60gJhX7YBjESgBg", "stars": 5, "date": "2011-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KRvx3YeAa5MZZGDGHLXrIg", "review_id": "Qv0y4veswkGWX_VMca7Nlw", "text": "I respect Dr. Corcoran. I feel he truly gets it. He once took the time to explain to me that doctors work for YOU and if you are unhappy with the care or the service, it is your right and your life so MOVE ON. He is about the most down to earth doctor you can find and I am happy he is there. I guess the only thing I am seeing is is if getting harder to get into him. Well makes sense. As word gets out that he is the man to see, well, he sees a lot of people. He does not rush people out so you may have to wait. So what I have seen a lot of is they try to push you to see Emily the PA. She is nice. And I really think she cares and I really think she is honest with you. But what she IS NOT.... is EVER ON TIME. I have seen her 5 times this year. The waits were 1 hour, 45 minutes, 45 minutes, 1 hour and 40 minutes. She gave me the whole \"I can not control what happens in the day speech. \" Yes I know I am 37, I get it. So I guess I will just warn you. If you do not have the time in your day to wait, you might want to go somewhere else. I am sorry to say this, because she is very nice and she is good at what she does. But I think they are simply trying to make her see too many people. Twice I left the office the whole place was shut down and the lights off because I was the only one left. I was not even able to pay because the desk people were gone. I know it isn't fair to her but I think it is something they need to look into! Also know that the plaza parking is way undersized for how many doctors it servers. It is not unusual to have to drive around 10 minutes to find a spot.... It really is sad. I used to love seeing Corcoran.... Now it is just a chore.", "business_id": "1GXycbqgmD9TfhQFoktSLg", "stars": 3, "date": "2015-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VUZU_PgMtKxhDoAfUIP-SA", "review_id": "vgoTHnt6dfvKMH8phhsT_g", "text": "I will never be back to this doctors office. I made an appt online on Zocdoc.com because it was fast and easy and close to home. First, the staff is not that friendly and they make you feel stupid for not knowing the procedure of checking in your first time being there. \n\nI waited about 45 minutes before being taken back to a room and getting vitals. Although the nurse was the sweetest of all the people there, she seemed flustered and very rushed so I didn't get to tell her the reason I was even there. I then waited another 30 minutes in the waiting room for Dr. Doris to come in. I told him I needed a pre-surgery physical which he proceeded to tell me he didn't know there was such a thing or what my surgeon needed. Basically I just needed a full physical and told him that. He told me he couldn't help me that day and to speak with my surgeon to find out exactly what they needed and to come back. He seemed very rushed as well. He also made some comments that I was a little shocked at regarding my body type etc. and gave me his opinion on the surgery I was getting (I was getting a small cosmetic surgery) - However I don't believe it was his responsibility to do so, nor was it wanted. \n\nI saw the Dr. for 5 minutes and got hit with a $120 bill. I ended up going to a different doctor, asked for a pre-surgery physical and he knew exactly what I needed. I was in and out in an hour. I have also spoken to other doctors asking if they knew what was needed if a patient comes in requesting that, each one said yes and proceeded to inform me what they would have done.\n\nI was very disappointed and won't be sending any of my friends to this doctor.", "business_id": "1GXycbqgmD9TfhQFoktSLg", "stars": 1, "date": "2015-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ul9gej-FN0C780gCg6PbJw", "review_id": "5hdO9NJYL-65PLpmRmBk1g", "text": "I absolutely loved everything about my experience with Dr. Meger. I was very nervous about my surgery and he answered every last question I had- he even let me come in for a second consultation so I felt comfortable. His staff is super professional and friendly- Jovita is amazing! Not only is the care top notch but I felt his prices were very reasonable, especially compared to the multitude of doctors in Scottsdale with less experience/skill. I healed very quickly from my surgery and I'm very pleased with the results- go see Dr. Meger!", "business_id": "H8_d-SvwBz-Sd_ZTK7Kucw", "stars": 5, "date": "2014-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "O9jlCjL-0zFy-Rig8jmzkg", "review_id": "5KzBTInUoAbHmM-Ygn7cXQ", "text": "From beginning to end, Dr. Meger and his amazing staff provided me with the best care possible! If you are looking for the best you should call them now!! Prepare to have amazing results, just look at his before and afters they speak for themselves. I love what you have done for me :) thank you so much!!", "business_id": "H8_d-SvwBz-Sd_ZTK7Kucw", "stars": 5, "date": "2014-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "v38TICfobIKjYtyQuANcBw", "review_id": "g3C_ihB2rMbIveMkg_OnGA", "text": "The staff at Dr Meger's office made me feel so comfortable and were with me every step of the way. Dr Meger's surgical skills are exceptional. I had a Breast Augmentation as well as reconstruction and have never been happier. My only regret is that I didn't have it done sooner. I would recommend Dr Meger to anyone . He is also close to perfect as one can get.", "business_id": "H8_d-SvwBz-Sd_ZTK7Kucw", "stars": 5, "date": "2015-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "aDUtRZEb7jqReffodkKQ0A", "review_id": "oSH82GT5P29KGWQs-JNfgw", "text": "Horrible experience with Dr. Meger. He botched my rhinoplasty (took off way too much from the bridge). When I went to him to and asked him to correct it, he just tried to file down the tip of my nose! I ended up going to a different doctor that specializes in other doctors mistakes and when I asked Meger to refund my money, he would not respond to my letters or phone calls. He wouldn't even do the right thing! Maybe he just needs to stick with breasts! Don't let him touch your face!!! Even if he's received one good review, one mistake is all it takes to ruin your look. STAY AWAY!!", "business_id": "H8_d-SvwBz-Sd_ZTK7Kucw", "stars": 1, "date": "2015-04-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vFND02ZPymohKPCfetGmZQ", "review_id": "ngcRDBkmf4vtngvZscbkYw", "text": "Everytime I go to Dr Meger's office I feel like I am among my friends. It's hard to tell someone your insecure and then what you need help with. This is a group of people that are 100% professional all while being your best friend! I highly recommend that you set up a consult and you will be impressed like I was.", "business_id": "H8_d-SvwBz-Sd_ZTK7Kucw", "stars": 5, "date": "2015-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "K0N64HF7C3ZXivHSfouEsA", "review_id": "R8aPFH0o4qK38LQi-Zh58A", "text": "Great staff and Dr. Merger does excellent work. So happy with my results and I felt comfortable the whole time.", "business_id": "H8_d-SvwBz-Sd_ZTK7Kucw", "stars": 5, "date": "2015-05-27", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 0}, "user_id": "ZGP7zlcJVWAO2dFOI00GZQ", "review_id": "qCR6GY9vKMEAF9Hx-wTMNg", "text": "If I could give less than 1 star I would. I went to Dr. Kwark for the first 5 months of my first pregnancy and it was probably the worst experience of my life. As I said it is my FIRST pregnancy so... maybe for people on baby 3 or 4 she might be a good choice but for me it was awful. She never explained ANYTHING that was happening or that she was doing to me. I never even got information on what I could eat! I had a really really rough start and she never tried to work out what was wrong or help me in any way. She would make vague statements about things being abnormal or odd and I should see this or that specialist and set me to panicking, take mystery blood tests that I never knew what were for or what the results were, and then when I would ask on the next visit she would not even remember correctly... I think she got me mixed up with some of her other clients a few times. She never spent more than a few minutes with me and pretty much avoided any sort of eye contact the whole time. When I filed for intermittent FMLA it took almost 3 weeks to get the paperwork back, the staff in front is extremely rude, and when I started contracting and spotting at 20 weeks I called the overnight emergency service- the Dr. on call took 3 hours to call me back and then could not speak very good english, asked if the baby was still moving (at 20 weeks?... OK) and then said he would have Dr. Kwark contact me the next day. I called 3 times the next day- the first time I was told no message was passed on and to call back, when I called back she was various degrees of busy and would get back to me. I never received a call back and ended up in the hospital because I had NO idea what was going on and was panicking. I ended up seeing 4 different specialists in the time that I was seeing Dr. Kwark before I saw a General Practitioner that explained what was going on, the terms she had been using, said it sounded like she wanted zero responsibility and recommended I get a different OB. Wouldn't you know I'm still sick (thank goodness only a few weeks left) but now I know what is happening with my body and I only have to see 1 Dr. What a concept. This place is a money mill... that is all. Get as many people in and out in a short amount of time as possible. The only good things about ANY person on this staff was the Nurse Assistant who was actually somewhat friendly, pleasant, and human. Final word- STAY AS FAR AWAY AS POSSIBLE.", "business_id": "31wytPjgKJAf0QJov1Y4Tw", "stars": 1, "date": "2009-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lBMCBwbAhfgb5oKqilA7CA", "review_id": "aTDKLfgtM5zg1To83mRgTQ", "text": "I feel very lucky to have found Pediatric Associates. I've heard horror stories from other friends about experiences with their pediatricians so I know how rough finding the right doctor can be. A friend recommended Dr. Padrez so I decided to give him a shot. From our first visit I have felt nothing but confidence in him. He has a great demeanor with my son and I have so far had a very healthy little boy. What I like most about the office is how efficiently they get you in and out on time. There is no need to get there more than fifteen minutes prior to your appointment. Having waited over an hour at other doctor's offices, I thought this was huge. There has been an occasion or two when I've had to wait longer, but both those instances were when my son was sick and we had to come in for a last minute appointment and the doctor's did their best to see me as quickly as they could. When my son is sick, I have had to see some of the other doctor's in the practice and so far they have a;l been great. Dr. Day, Dr. Lococo, and Dr. Kelly have been my favorites aside from Dr. Padrez. The office has a separate waiting area for sick and well children which is another feature I greatly enjoy. If you're looking for a great pediatric office I would definitely recommend trying them out.", "business_id": "lgyBsM93DBchuwU-_l0Sfg", "stars": 5, "date": "2014-03-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bGYhneAbaYL9_G4hMVWG-w", "review_id": "MRwpsDpNcEW0mZvpVSu9Jw", "text": "Dr. Lersch is such an amazing pediatrician. I have brought my four month old here since birth and he is extremely informative, kind and willing to answer any questions. I've never had a bad experience here and that says something because I am very picky with Dr.'s offices especially if they are caring for my daughter.", "business_id": "lgyBsM93DBchuwU-_l0Sfg", "stars": 5, "date": "2014-05-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "5YgereDjIPmHFKkl6syAXg", "review_id": "ZETZXGzuiVgrum9Lrv95kQ", "text": "I have no knowledge of the doctors level of care at their facility, but they came highly recommended to my wife and I as we just had a newborn baby a few days ago. They may be the best pediatricians in the world, but we will never know because they are refusing to see our daughter.\n\nWhat crime did we commit to not be allowed the privilege of being their patient? We had a home birth, with a licensed nurse midwife. We are not insane anti vaxxers or anything like that. Our Licensed Nurse Midwife was in charge of the nurse midwife program for St Joe's for many years and keeps meticulous charts and yet apparently our baby is not appropriate to be seen by this office because she was born at home.\n\nI was half way through making the appointment for our daughter on the phone when the question was asked \"What hospital or birthing center was she born in?\" I responded \"we had a home birth.\" There was a pause and I was put on hold, and a few seconds later I was told \"We are not accepting new patients from home-births\". That was it, no explanation and she hung up.\n\nI am not sure if our dollars spend differently than people who choose to have hospital births, but apparently this office believes so. Without being offered a reasonable explanation I can only assume that this office enjoys a nice financial backslapping arrangement with the hospitals that refer the patient whom they are accepting.", "business_id": "lgyBsM93DBchuwU-_l0Sfg", "stars": 1, "date": "2015-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "kxIs2EkZR8ipVIgg6xyQGw", "review_id": "sQ3v7BFPt4L8vADMYgrb4A", "text": "my mom was admitted here( after an 9 hour wait) as her cardio md works out of here. the ER attending seemed concerned and ordered the usual for her symptoms, but somehow between then and 5 days later, it really went downhill. the 4 north nurses were 'ok', one night nurse was good, the others seemed to write her off. one actually said she refused treatment when my mom did not refuse her medicines, she just requested them to be a little spaced out because given back to back,  they were giving her chest pain. what i feel was really bad (no stars) were the hospitalists (who were several) who didn't order necessary work up tests for her lungs and left it up to her and me to demand diagnostics. as an example, she came in because she could not breathe easily, chest pain and yet it wasn't until day 5 of failed treatments that we had to demand a pulmonary consult.\nIn summary, I have to say that 2 stars for the nurses, 0 stars for the hospitalist, 3 for the ER doctor. Who to blame for the 9 hour wait to be admitted on a monday night? heaven knows. \n\npatients have too much of a choice these days to get such bad service/care. I do not recommend this hospital, perhaps banner may be a better choice.", "business_id": "Z9ogOCIkHasuKVELa8mQ_w", "stars": 1, "date": "2012-04-20", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "0OBAEXK7DY4n1J1ssa_8xA", "review_id": "blOrMO-tmi0BdJdtnl2HWg", "text": "As I write this review, I am less than an hour removed from my visit tonight to John C Lincoln- North Mountain. My husband and I arrived there at 7:30 PM last evening. I was being seen to rule out the possibility of a blood clot in my leg or lung. They asked  me to do the usual registration and things of that nature which I completed in about ten minutes.\n\nWe then sat down and waited for an hour before we were called back to triage. The nurse that was there was friendly.My vitals were taken and I rated my pain about a six on a scale of one through ten. Next, she corrected some mistakes on my list of allergies which were entered incorrectly from my last visit. This is where things went downhill.\n\nShe placed us in another waiting room. At first glance, there were only about four people ahead of me. As such, I reclined my wheelchair and started doing various things on my phone. An hour went by an not a single person was called from the waiting room.  We just figured that they had a critical patient and things would start moving shortly. Unfortunately, we thought wrong! Yet another hour passed and not a single patient was called back to a bed.\n\nAt this point, it is now 10:30 PM and two of the patients (one of whom was having chest pain) decided to leave and seek other hospitals. I told my husband that if I was placed in an E.R. room by 11:00 PM, we were leaving as well. The triage nurse heard this an assured us that I would be the next person taken back.\n\nThirty one minutes later, I was taken back to a room. My husband turned on the TV and we waited for the doctor. A half hour later, the doctor comes in and says that by looking at me, she doesn't think I have a blood clot. I explain to her that just seven days ago my cardiologist told me I had a superficial blood clot in my left leg, and that I was advised to go to the ER if my pain increased or I  had any swelling or redness.\n\nI explained to her that my pain was worse, and I needed to make sure the clot had not moved to a deeper vein and become more serious. She hesitantly agreed to do an ultrasound of only my left leg. Keep in mind both legs are usually examined in order to compare. Furthermore, she stated that if it moved to my lung, I would need a CT Scan, and just because the leg ultrasound was benign does not mean it did not move.\n\nThey did my ultrasound at about 12AM. The doctor came back to my room about 1:15 AM and said the ultrasound was negative for a clot of any kind. Rather than moving on and checking my lungs, she said I was discharged. This frustrated me a lot because if for some reason the clot did move to my chest, it could be deadly.  My husband and myself explained this to her, but it fell on deaf ears.\n\nMy discharge instructions were plain and simple, elevate my leg to decrease the swelling and follow up with my doctor.  I will be doing that tomorrow after I get some rest. Did I mention that it took another half hour to get my actual discharge papers?\n\nIn the meantime, I'm praying to Jesus that there is nothing going on in my lungs! All in all, it was a six hour waste of time and my health insurance's money!! With that being said, I would not recommend anyone go to John C. Lincoln- North Mountain for any reason!!!!", "business_id": "Z9ogOCIkHasuKVELa8mQ_w", "stars": 1, "date": "2013-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "QwO4LVCiPZZdg5URrQfYpw", "review_id": "a_Z6afTinuhXyUeZkXBg8g", "text": "I have been here twice for emergency situations. Once for my wife and once for myself. Both times were on Sunday mornings around 9am 'ish. Both times we were triaged within a few minutes of entering. My wife for an allergic reaction and myself for a broken bone. Both times we were helped very quickly and had a good experience. The nurses were top notch and had a good bedside manner. I am thankful for their medical attention.", "business_id": "Z9ogOCIkHasuKVELa8mQ_w", "stars": 4, "date": "2014-03-18", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "UaO0SRuNQaFjv0JEB8vzBA", "review_id": "qQB8CqhDbHwWCWGkGxS2hg", "text": "The one star is not for my bad experience as a patient, but as an outside observer. I was hired to come take pictures for an on call doctor, and was unable to do so. The main nurse rejected the consent forms and said there has to be a month in process time. So why did I change into scrubs them if you were so sure? The staff was friendly otherwise! However I wouldn't want to get treated by an insensitive, unorganized head nurse. The other Lincoln location's nurses were very sweet with me and went above and beyond to make my experience noteworthy. \n\nAdvice? Go to the Lincoln hospital off 101 and 27th st!!!", "business_id": "Z9ogOCIkHasuKVELa8mQ_w", "stars": 1, "date": "2015-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rVp2IzoeO5l9SjEoKSwhsQ", "review_id": "RInLfcnEZ2QPiTBlw3EAuw", "text": "I have been coming here for years, sometimes you get great service and sometimes not. My ER service was great. Thank you Dr. Crow and nurse Steve!  They were very empathetic and professional. I was admitted for 3 days, having excruciating pain. The 4th floor was doing a good job Nurses Dorothy, Sarah, Wilma,  and techs Ana, Jose,  and Carmelita were awesome! I thought that this was going to be the best service . WRONG! It is really sad how one person can truly damage your experience and quickly change the representation of the hospital for the worse.I never want to go back there again. My last nurse was horrible! She was mean, condescending, and somewhat neglectful. If you hate your job that much, just leave, don't take it out on the patients.  I didn't ask for a lot, but when i ask for a bandaid or meds because I'm  in pain, don't roll your eyes, huff and puff, or give the look of frustration. I don't know how she made me feel like I should apologize. Why should I feel guilty asking for things as a patient? She rushed me out of my room when discharged, and while I was on the phone to call my ride, she proceeded to remove my IV, and she was not gentle. I have bruises from her yanking my arm and trying to rip off my IV. She didn't even ask me how my pain was first, even though I was due for pain meds. She called for patient transport after removing my IV, not gently either. Normally I have an hour before they kick me out of the room for my ride to get here. I barely even had time to change. She said that transport was taking too long, so she was going to  wheel me down to the lobby to wait for my ride for an hour. I have never been treated this way before.  She never did bring me that bandaid.", "business_id": "Z9ogOCIkHasuKVELa8mQ_w", "stars": 1, "date": "2015-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "rVp2IzoeO5l9SjEoKSwhsQ", "review_id": "VHouLzFtSLtGRHQRvCPyng", "text": "I am changing this review from a 1 to a three for two reasons, 1. The staff overall took very good care of me and my experience up to the last day was great. 2. The director talked with me and apologized for how rude the last nurse was to me. This meant a lot to me. Thank you for taking the time out of your busy day to talk to me and try to make things right.", "business_id": "Z9ogOCIkHasuKVELa8mQ_w", "stars": 3, "date": "2015-04-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "t0lo6Nhbi1kZLTynvUFWUw", "review_id": "P3R-_TX006NsO8QZkR2yjA", "text": "I have never been to an allergist until I came here. Worst experience ever. I went in for my appointment which they told me would take 2 hours. Understandable, they told me in advance. When I was leaving they said \"oh, we need to schedule you for another visit to do more testing.\" Turns out they charged me for an \"extended visit.\" This second visit I was told it would take an hour, it took almost 2 AGAIN, because the lady forgot to do the other testing. My total bill was over $500 and mind you I have insurance through a Fortune 500 company. I called and left a message for Gina which she never called after two weeks so I finally called back. She was rude and said she had been doing this for 15 years and would barely let me get a word in. I don't recommend this allergist at all. They said that as an adult it's hard to detect allergies through the blood (which would have been one visit) so they had me do the tests on site. No wonder, 2 visits = more $$$ in their pockets.", "business_id": "ofQCymLeEmWpTQvx3YYwPg", "stars": 1, "date": "2015-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "QaU1IwDNNctOtVR4DANwEw", "review_id": "EdP68NXvVPoMcbIBzBLZzA", "text": "This office was recommended to me by a friend. Unfortunately, I had a bad experience. The office staff is rude and not at all helpful. They seem too busy to be bothered by even the simplest questions. The nurses and doctors don't listen, and did not even give me the opportunity to ask questions even considering that this was my first pregnancy. I literally felt  like I was being pushed out of the office the 3 times that I went. It took 5 phone calls to finally be reimbursed for the money I paid them.\n\nI would not recommend this office to anyone. I have met several other pregnant women who have also switched doctors after visiting them.", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 1, "date": "2010-03-29", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "fPHLPrymsyb6WSFFKoMrTQ", "review_id": "YHHAobc8ddd0Cm7PBvWGvQ", "text": "Camelback Women's Health is my choice for prenatal care.  Why?  Well, I really like the easy scheduling, almost non-exsistent wait time (both in the lobby and for making appts) and my doctor, Dr Gregory De Santo.  \n\nThis location (32nd St) is the 2nd location I have visited and actually, is the closer to my house.  Dr De Santo works between both offices, with Tue and Thur being at this one, I believe.  It's much the same here and has the same set-up and benefits as the other (ultrasound machines, lab in office, etc).  I went to the Scottsdale location for so long but think I'll finish out my pregnancy here.  It's just closer to my house... oh and it has no stairs. haha\n\nHere's my review on the other location.. just thought I'd paste it because I'm lazy to rewrite everything...\n\nNow that I've had a couple of visits to Camelback Women's Health, a review is appropriate.  After finding them on an internet search for prenatal services, I called and spoke to a couple of women.  After answering many of my questions over a few calls, I was ready to make an appt.  ask me what my choice of Dr was and I simply ask them to set me up with the one they preferred... enter, Dr. Gregory DeSanto.\n\nI was always told that picking your maternity doctor was quite the chore.  It's joked about in movies and a matter of stress for many women.  I'm a lil more laid back than the average woman about such matters but, after I met Dr. DeSanto, I really didn't see the need to go to a dozen different doctors and stress.  He's relaxing, knowledgeable and does things himself that other doctors pass off to technicians - like my ultrasound.  He did an excellent job explaining everything he was doing, getting great angles of my lil baby and even showing me the gender before others say they can tell.  It was the most amazing experience to see my lil guy flipping around!!  I'd heard other women say that their ultrasound tech didn't tell them much and actually had them worried by not talking and explaining things but, there was none of these issues with DeSanto.  I'm a fan of his calm demeanor and simple, easy-going approach to things.\n\n* Dr DeSanto is knowledgeable, calming and explains things well.  And Jamie was so helpful with many of my misc. questions and helping me get set-up!\n\n* They have their own lab and ultrasound machine in their clinic so you don't have to run around, wait, or make separate appts for lab work!\n\n* Everyone is friendly enough and it feels like a cozy, comfy environment.  \n\n* There is little waiting time before your appt starts and they must keep gaps in the day because you can get in to see the Dr. in a timely manner.\n\nSee ya there!", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 5, "date": "2011-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "D80OnPLnvmS0_agks37JVA", "review_id": "XPL5-9kPgilQtY9IKqfToA", "text": "I came to this office due to location and it being in my insurance network. Initially my experience was positive, as I worked with a doctor named Stephanie Nguyen who seemed caring and attentive, and even once personally called me to give me test results. \nUnfortunately however I am not reviewing her, but the office as a whole. After she left to go on maternity leave, things began to go downhill. \nUnder her care I was prescribed an ultrasound due to uterine pain. I was not notified of her departure, but simply got a phone call from a stranger saying I had hemorrhagic cysts and polyps and that I needed a follow up ultrasound within 10 days of the start of my next cycle.\n\n Following the new doctors instructions exactly, I called the front desk to schedule my ultrasound, explaining to the receptionist on the phone that I needed to schedule an ultrasound within 10 days per the doctors instructions. The woman on the phone scheduled me for an appointment with the doctor very quickly, and considering I knew they did not always have ultrasound techs on staff (they have outside techs come in from an office called Fetal & Women's Center of Arizona) I wanted to make sure we were on the same page. I verified with her multiple times the time and the location of the appointment, that there would be ultrasound equipment and technicians on duty, and explained that due to my narrow window of time (10 days from the start of menstruation) how important it was to get this appointment done right. The woman's tone was dismissive but confident, and I let it go.\n\n Surely enough however, when I showed up for my appointment four days later the nurse on staff said they could not do my ultrasound and  casually closed my chart saying there must have been a misunderstanding because they did not have any ultrasound techs on duty on Thursdays. I was upset and asked to speak to a doctor. In the end I was treated rudely, dismissed, and told to reschedule my own appointment. \n\nUnfortunately, due to their irresponsible staff, I will now have to walk around with hemorrhagic cysts and polyps for another month (until after next menstruation), with no questions answered. Needless to say, I will never be returning to this office.\n\nLong story short - the staff does not listen, the office has multiple locations and outside ultrasound services which they seem incompetent about keeping track off, I was treated poorly and expected to fix their scheduling mistakes, I drove down to an office location despite their not being the resources necessary to perform my procedure and no one resolved this issue, and I will now have to wait until my next menstruation to discover more information about my ovarian cysts and polyps due to their oversight.", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 1, "date": "2011-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "cM9KhjSrO2NcmhbUvf-FiQ", "review_id": "0LOOu9ahOoEAWw5zlEGXqg", "text": "I had the worst experience of my life back in January. \n\nI booked an appointment with CWH because I found out I was pregnant Christmas day. The front staff was so rude on the phone. The girl I spoke to treated me like I was an inconvenience and how dare I call in to book an appointment. I should have cancelled at this point but I was excited with this being my first pregnancy. \n\nOn the day of my appointment I had to wait over an hour for my appointment to start. Then once I was taken back I had to wait another 30 mins for someone to see me in my room. Tracy came and was the nurse practitioner. She was amazing but I hear she is not longer with them. \n\nNow to the tragic part. I informed them that I would be having my 8 yr old son come in for the ultra sound because we were trying to make him feel like his apart of the process. Dr. Nelson came in. Dr. Nelson has no bedside manner what so ever. He proceeded to tell me right in front of my son that I was going to miscarry. He drop the bomb with little to no bedside manner. He could have asked my son to step out and then tell me. Then he walked out with out explaining anything and basically just dipped out. \n\nObviously I was devastated. I came back two days later to give blood work . Again the front staff was rude and dismissive. The girl told me that they MIGHT call me back the next day and if not give them a call whenever. I don't feel this is satisfactory for someone who is terrified waiting to hear if there baby is not going to make it. \n\nI ended up going with another OBGYN to have my medically induced miscarriage. CWH with out a phone call to follow up with me proceeded to send me a $7000.00 bill for a pregnancy that they deemed was not viable in the first place. You would think it would have been written down somewhere that I was no longer going to need prenatal care after I told them I was going to go somewhere else, my new doctor's office called them, and they DIAGNOSED my miscarriage.\n\nOver all this place is extremely unprofessional and is not a good choice for a first time mom or any mom. They obviously do not have the bedside manner to deal with a difficult pregnancy or with a woman who has to deal with a difficult decision.", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 1, "date": "2013-05-16", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "kGPzMKbcpqk4TuYYa29uUw", "review_id": "q5IX-awE1HWc9KjoAaP-NQ", "text": "My first visit to Camelback was a couple of days ago on the recommendation of a good friend. I was fed up with the questionable, indifferent, and invasive and yet incomplete treatment at my old gyn office. My friend told me so many great things about Camelback over the last couple of years, yet I still stuck with my old gyno thinking things would get better and that their methods were probably the same as every other facility's anyway. But three years and five invasive and useless colposcopies later, nothing had changed. \n\nWell, you know how they say that sometimes you don't realize how bad things truly were until you experience the difference? They're right. \n\nI saw Julie Bergdale, NP supreme and all the hype on Yelp about her is true. The most striking thing besides her kind, smart, funny and compassionate demeanor is that she actually listens, truly LISTENS to you and absorbs your info, even the subtle bits. She wanted to know all about my health history, my concerns, and habits. For the first time since I moved here from CA, I felt like I was going to be cared for properly by my gyno office! (I left my truly awesome gyno of 18 years, Dr., Gerardo Bustillo, back in CA and so regretted it. But now, I think I may have some hope of a great experience again.)\n\nI had to wait longer than at my old place, but that's no biggee because it's only due to Julie spending quality time with each patient. And for that, I'm HAPPY to wait! What good is efficiency without quality? For the first time in three years of living in AZ, I got ALL of my many questions answered. Not danced around or dismissed, but answered intelligently and thoroughly. I'm the kind of a patient who knows my body well and takes the time to read books and studies and asks questions, so I need an office that not only doesn't mind but that prefers well-informed patients. Julie decided to do a full metabolic panel, plus CRP, plus cholesterol (amazing) and a hormone panel to boot based on my family history. This should really help establish a nice baseline from where to work. Sensible.\n\nWhy this was never done at my old office, I do not know. The staff and doctor absolutely hated questions, and as she reminded me many a time, placed the weight of their decisions on predetermined, one-size-fits-all protocols. My last phone conversation with my doctor, (a full 3.5 weeks after a mysteriously painful and stressful biopsy episode that threw my period off by two weeks) was very sad indeed. The gist of it? Apparently everything is the patient's fault at her office, even when monsels solutions may be mixed wrong and cause reactions....Very disappointing, yet not surprising. Nothing had changed. That's when I knew I really had to leave.\n\nBut not to worry. They say many times out of adversity comes understanding and positive change. After coming to Camelback, I know now that my last bad experience served as a painful wake-up call to me about my health and being more proactive and engaged moving forward. For the first time in years, I have high hopes of great care for the future. If the NP is this good, I believe this bodes well for the doctors. \n\nOver all, excellent!", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 5, "date": "2013-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "X9E2FXFFb4aCoMieka1RKQ", "review_id": "EeeyeROTmp4R8fbsfzUPUw", "text": "I recently stopped going here after 4 years. I was prescribed a birth control pill and not told about the side effects, which landed me in the ER for a week.  I talked to the office afterwards and was told it was my problem, and not the doctor's job to advise me.  Yet I still went back, this time for a hysterectomy consultation. I made the appointment approx. 2 weeks in advance, arranged for time off from work, etc. I arrived and paid my copay and waited nearly 20 minutes, only to be told that the office girl had screwed up and scheduled me with an NP instead of a surgeon, even though I was extremely clear about what I was coming in for. I demanded my copay be refunded and left. I do not recommend this practice at all!", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 1, "date": "2014-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FRVtSCjYQ1vPMRK7yz3XUQ", "review_id": "kA31YA2I3sUmvR8KkSPijQ", "text": "Dr. Nelson is awesome! I strongly recommend him. He's very direct and to the point which I'm sure some people don't like but that's my kind of doctor. I had my daughter in January and now he is my go to gyno. I was very pleased with him. I am a first time mom so I had lots of questions and he always answered them.", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 5, "date": "2014-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "9sPv_B3QoNyko7668YkzAA", "review_id": "iaRxEQ7znU9NWlGnfLA2sg", "text": "We were told to get here 15 minutes before our appointment time so we did and paid and then waited, and waited, for more than 30 minutes.  When we asked the receptionist why we've been waiting for more than 30 minutes while most who arrived after us were already seen she said \"well that's just Dr. ???\" as if that's an acceptable reason.\nThen about 10 minutes later the receptionist calls us back over to explain that it will be another 40 plus minutes before we can be seen.  Then she gets rude when we question how they're running nearly 1:30 behind schedule and says \"well you can take that up with them back there or you can reschedule?\"\nOnce we were finally back the staff was nice and friendly.", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 3, "date": "2014-05-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wSODsumy9NKJEvE_xxynXg", "review_id": "1ZQYEwZ2d7W0E6y8LTfgpA", "text": "If you are pregnant stay away. This is the worst medical practice I have ever been to. I came into the office for the first time at 6 weeks pregnant with a subchorionic hemmorage, at the time Dr. Nelson seemed wonderful, but the longer I had to deal with this office the more I realîzed that I had been wrong. \nI came in at 10  weeks for increased discharge with a bit of blood in it, Dr. Nelson seemed irritated that I had scheduled an appointment. during the exam he removes the dirty speculum and shoves it into my face to point out the lack of blood, really rude behavior  considering his office staff told me to come in. I shrugged this off as just an off day for him.\nA few weeks later when I  was around 13 weeks pregnant  I was sent by the office to Labor and Delivery for an exam because my blood pressure had spiked dangerously high, once I arrived  at the hospital my blood pressure had evened back out. Next thing I know Dr. Nelson shows up at the hospital and begins to berate me for coming in to the hospital (even though his office had sent me). In front of my mother in law he says that pregnancy is uncomfortable and that I shouldn't come into the office or hospital  just because I think something is wrong. I later found out from my nurse that  he never comes to labor and delivery unless   you are in laor, he came down just to scold me.\nAt 28 weeks  I called the office because I had some upper abdominal pain, I was told to go to the er, however due to my previous experience I scheduled an appointment instead, I ended up seeing WHNP Amber Swanson, who actually proceeds to yell and berate me for \"non compliance\", then proceeds to tell me that   I have sugar in my urine   and that I  am a terrible parent because Iwas developing gestational diabetes. \nI have a new Dr. now, and I have since found out that Dr. Nelson did not offer us our early  pregnancy testing and many of the   treatments I needed I did not receive, I finally am seeing a high risk specialist and after the treatment I   received I would recommend that pregnant women find a different office it will save you a lot of stress.", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 1, "date": "2015-03-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bGYhneAbaYL9_G4hMVWG-w", "review_id": "omhKiev0F7kwoxUiSL1RYA", "text": "Another amazing delivery by Dr. Nelson. I feel blessed to have had such a great Dr. deliver my two babies. I will be back for number three.", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 5, "date": "2015-04-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cyEeEJ72FDNxbgYh6TW8qg", "review_id": "hneUQ6gna0s8L8kxNxJ6ww", "text": "I had an excellent fast recovery from my Super Cervical Hysterectomy by Dr. DeSanto.  Just still trying to get the hormones regulated.  Once my hormones are regulated, then I would give them a 5.  The patient portal is an excellent way to communicate with the doctor, and staff.", "business_id": "nEaJwY77drRqQkJqcd9LRg", "stars": 4, "date": "2015-05-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MbogV99-KSj_Iy1tLNMZpA", "review_id": "K9VSSDLXGm5_VD5UUXFT-g", "text": "Went to Julie for Botox injections today. I had picked her because of her training by Allergan the maker of Botox. She is very professional and you can tell that she is an expert in Botox injections. Very pleasant atmosphere, no pain and no bruising. They have a special offer running for clients that follow up with feedback on Yelp! I would highly recommend Julie for your Botox injections.", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 5, "date": "2011-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MbogV99-KSj_Iy1tLNMZpA", "review_id": "nikaSImbcFflxUZBgG-sZg", "text": "I went to see Julie at Camelback Women's Aesthetics 2 weeks ago for some Botox. I have had Botox before and am very familiar with it's use. But I found Julie to be outstanding! I wrote a review soon after receiving the injections but am not sure if it posted. I'm so impressed with Julie that I decided to write a followup to make sure that it got posted. Julie is an Allergan certified trainer for Botox injections and it shows. She is super friendly but more importantly she knows what she is doing. Does not try to oversell the product and is very honest on how much you need. The injections were painless and no bruising. I will return when needed and look forward to it.", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 5, "date": "2011-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SJO7x9Qr4FY6yyInxmW_pw", "review_id": "YjRkC_gvDXw6JVerFL5mkQ", "text": "I have no complaints about the quality of the medical care.  It's been very good.\n\nI do have a compliaint about the administrative side of the business.  It seems like whenever I have some test done, I am always told that someone will be in touch when the results are back.  That has yet to happen.  Usually I wait way past the date someone is supposed to be in touch and then have to call.  Half the time they say they don't have the results back yet but it later turns out that they did.  The left hand doesn't seem to know what the right hand is doing.  I'll keep going there for the quality of the care but they could really use a kick-ass practice manager.", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 3, "date": "2013-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QmL4iPF1RBU4xlgelALNIg", "review_id": "lFMSRz2NrM3c1XzTw1gSOA", "text": "I love the fact that I found this office after having a horrendous experience with another OBGYN (Tara brodkin). I don't know how people complain about the waiting time. I've always been helped in time. The ladies in the front desk are very nice and every time I call I've never been put on hold. They ALWAYS answer your questions. I see Dr. De Santo and he's just simply AMAZIG. I trust him a lot because you can tell how knowledgeable he is. He answers all your questions and gives you a lot of ultrasounds to check on baby. I'm so happy I found a doctor I feel I can trust with my first pregnancy. I wouldn't go anywhere else! Even the lady that draws your blood is such a pro. I'm always scared to death to have my blood taken but I swear she takes like 2 seconds and makes it so quick it's impressive.", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 5, "date": "2014-03-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "bGYhneAbaYL9_G4hMVWG-w", "review_id": "itaeIaUHtATsveajL9WsPQ", "text": "There is nothing bad I can say about my experience here. The staff was wonderful, the nurses were wonderful, and most importantly Dr. Nelson was the best doctor I could have ever asked for. He always listened to my concerns and is extremely knowledgeable and reassuring. I wouldn't have anyone else deliver my babies.", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 5, "date": "2014-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0yiMGGZOGEVrbEQBQregXA", "review_id": "5Dcgs17WhzKTItA8rIEkZA", "text": "While office staff seem competent and things move along in a timely manner, I do not sense the happiness or joy of the staff working there coming out through their customer service: minimal to no greeting, same at checkout, with frowns among staff. Perhaps they feel worn, competitive, or restricted, but the energy could be more warm, inviting or welcoming.", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 2, "date": "2014-03-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RGtpTG4mwDbavyLF2VA6-A", "review_id": "C0k9XNERoVp3jq7LGjyxUA", "text": "Horrible phone service from janae, and very over priced.  They tell you that you have to get all these things before you can get what you actually even need to come in for.", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 1, "date": "2014-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 0}, "user_id": "-2r-OO0dtcCQQ3BLYdHXlg", "review_id": "p9I2_QDn8FXRDlZmsYRe-w", "text": "I was referred to Camelback Women's by my primary doctor. I called to schedule an appointment and the office receptionist was not friendly at all. She also had a tone like she was annoyed that I was asking questions... long story short I did not schedule my appointment with them and I can see that others have had a similar experience.", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 1, "date": "2015-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oG7vEqTDs2ocpf3ljyrYbA", "review_id": "BE9Ti5cfT-N0A7UwF2ugww", "text": "Been going here 17 years. Can't say enough good things about them. Great practice. Docs Nelson and DeSanto are so good. Very real and take their role in your life seriously. Every NP has been great. Recently saw Stefanie Davis and was again impressed with the level of care this practice keeps providing. From the phone ppl, to the staff, to the practitioners... a+", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 5, "date": "2015-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "-UDZu8sGloFIAIeFBvqK_g", "review_id": "AZDBp5wdJ7AjJffeKE7Y6Q", "text": "The doctors here are actually really good.  The only thing is that their website makes the claim that they have fewer patients so that they can give quality, personalized care and this is just simply not the case.  It is a factory over there.  \n\nI had two procedures done by Dr. Dyer and he is a great doctor, but he DOES NOT DO FOLLOW UPS AFTER A PROCEDURE.  You will go to his assistant for follow ups and if you're having problems, you still won't see the doctor unless she communicates to him that you really need to see him.  The doctors are too busy to follow up with their patients so they have an assistant do it .  I ended up in the ER twice   I was actually in  the office with concerns the day of or day before and could not see the doctor, only the PA who told me everything was normal.", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 3, "date": "2011-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-O8exEPYgJ6tjHD7sB2QRw", "review_id": "jZMM7X-X6keWQX4fX_fgPA", "text": "A couple months ago, I had to see an ENT and I had called around to a couple of offices and was very pleased right off the bat by the friendliness and sincere concern offered by the staff at Entegrity over the phone. They were able to fit me in the next morning, which was fantastic!\n\nOnce I was checked in and all my new patient paperwork was filled out (very quick process) I had virtually no wait time before Dr Bailey came in. Again, he showed sincere concern for how I was feeling and offered several options to ensure that the treatment fit my needs.\n\nI've had to see him again for a separate issue and the staff at Entegrity as well as Dr Bailey were consistent with their amazing care.", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 5, "date": "2012-04-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kpbhy1zPewGDmdNfNqQp-g", "review_id": "RwTxg7gRLSbgC4RaeeU52A", "text": "I've known Dr. Lykins socially for several years.  When my allergist told me I needed to see a ENT and that surgery was probably inevitable, I broke my rule of not seeing friends for care or services.   \n\nHe was extremely thorough and went through my CT scans with me to show me what was going on.  He also described in detail what the surgery would entail and what I could expect in regards to recovery.  \n\nThey were able to schedule my surgery relatively quickly which was a relief because I had to be on antibiotics until I could get this procedure done.  \n\nSurgery was yesterday and as far as I can tell, it went great.  My pain levels are surprisingly low (about what they were pre-surgery which is exactly what Dr. Lykins said).  \n\nIt's too soon to tell how successful this will be in addressing the chronic issues I've been having but all in all, the experience was great.  I would highly recommend Dr. Lykins and his staff.", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 4, "date": "2013-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "gv6GLZ3-bgSs44PtPJR1Bg", "review_id": "7QzcLFW1FoHfTN2t311LNA", "text": "I debated on reviewing this place after my initial visit and thought it wasn't worth it. About 7 months later I had an experience with them again and realized my initial suspicions about them were correct. \n\nLast year I was diagnosed with cancer in my neck & the surgeon who did my biopsy referred me to this place kind of out of nowhere. I had gone to see him on a Thursday for a follow-up (for what was most likely going to be the last time for awhile) & that Monday I was set to start chemotherapy. He thought it was a good idea to see an ENT thinking maybe they could add something to my diagnosis and/or treatment. I thought it was odd to do this so last minute (If I wasn't able to see the ENT the next day...which I was, I even asked my surgeon if he thought I should delay chemo until after I saw the ENT, but he didn't think that was necessary). He was pretty insistent that I go to THIS ENT office. My dad had just got done seeing an ENT for a throat condition, which he (and I) really liked, but my surgeon said he \"never heard of him\" and REALLY wanted me to go to this office (I looked up info on then ENT my dad saw and he has a very good reputation).\n\nI saw Dr. Bailey the following morning. Honestly, I thought he was a good doctor based on the initial exam I had with him. He was thorough & very personable. Since my appointment was scheduled so quickly he didn't have a whole lot of information going in and said he would consult my surgeon and get back to me. I never heard from his office again, but honestly, I didn't think much of it. I was starting chemo and was focused on that. Unless one of my doctors felt it was absolutely necessary to have an ENT involved with my treatment I was fine with never dealing with this office again (not because of Dr. Bailey, like I said, he seemed good) but I already had enough going on with chemo & eventually radiation. \n\nThat being said, I thought the manner in which I was scheduled to come into this office in the first place (and then never hearing from them again) was kind of tacky & it came across like they were just looking for any reason out there to bring in patients (I also understand that my surgeon also shares some responsibility here).\n\nWell, with chemo & radiation complete I recently had a follow-up with my oncologist and he asked about all the doctors I had seen throughout this whole ordeal. He brought up Dr. Bailey (along with my other doctors), and at first I couldn't even remember who that was since I had only seen him the one time. When I said I only saw him once and that was before I started chemo, my oncologist said since technically I DID see him the one time during this whole process he would fax him my latest report (along with all my other doctors). \n\nYesterday I get a phone call from Entegrity saying my oncologist wanted me to come into their office for a follow-up. I thought this was odd since he never mentioned this to me at my last visit (or called me afterwards to tell me this) so I told them I wanted to contact my oncologist's office before scheduling anything (and find out WHY he would want me to schedule something with an ENT). It turns out that he simply faxed them my report (like he said he was going to do), but never mentioned anything about coming back to them for a follow-up. My oncologist's assistant also seemed confused as to why this office wanted me to come back in after 7 months. If the ENT thought there was a reason to come back in based on my oncologist's report that's one thing, but to say my oncologist asked them to schedule me when he didn't is tacky.\n\nAll this just confirmed my initial thoughts that this office comes across desperate for patients. Like I said, I thought Dr. Bailey was good based on my brief encounter with him (which is why I'm willing to give this place a 2nd star). However, I would never come back here...", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 2, "date": "2014-05-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "NU6n0v1mUwSC02tRrbTHgA", "review_id": "1cLbVLJMfSmspFJQ007GCQ", "text": "Dr Dyer is great, but the office staff brings the word incompetence to a whole new level. The front desk is beyond rude, and their inter-office staff communication is virtually non existent. \nI am pretty much fed up with this offices lack of professionalism and courtesy.\nExtremely dissapointed doesn't begin to describe my feelings at this point.", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 1, "date": "2015-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "r2NdL_2GNog2E3z4u0yjXg", "review_id": "9mNa-c_X58O1aOFV84RI8Q", "text": "When our beloved family doctor \"retired\" , I was so worried about how anyone could even come close to his caring medical skills.  We went through a few replacements and then lucked out with Dr. Chad Campbell.  He listens to our concerns and responds with appropriate treatment.  We like him and hope he stays here forever.  Hey, when your nurse daughter and paramedic son say that they like him - that speaks VOLUMES!", "business_id": "0-KOpYSe9aQTAfM38f47HQ", "stars": 5, "date": "2012-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Okz4yjuyft3hp64TbNmr6g", "review_id": "OwhV9w915phEyoPmSdhCzw", "text": "Dr. Campbell is an amazing doctor. He has a great disposition. He listens without rushing you out of his office. Actually, when he is asking you questions to attempt to determine the solution to your situation he makes you feel like you're his only patient in the world.  I moved here a year ago and feel so fortunate to have found him. His nurse is amazing as well. She is always upbeat and makes you fell better in the worst of situations. \nI feel like I've \"Hit the Jackpot\" with my primary healthcare provider!. I would recommend Dr. Campbell to my friends and family. \nAlso... I don't know how he does it, but there is never a long wait time. This is key for me as I have 3 you children and a very busy schedule. Thanks Dr. Campbell!\n\nSincerely,\nAngela Kisner", "business_id": "0-KOpYSe9aQTAfM38f47HQ", "stars": 5, "date": "2013-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "66VpA-xzwrPNuD8R8zs0Og", "review_id": "8Q_qi488BhQUN3C73AZ8RA", "text": "The PA Courtney was nice, friendly and knowledgeable. I was pleased with my experience.", "business_id": "6r8KHqgmlM3PWVZ7suyQ6w", "stars": 5, "date": "2011-03-24", "type": "review"}
