{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "TckShYnQa0eD3WQxdoE3GQ", "review_id": "welWwHJ6tFJ313_-WkNSPg", "text": "Hello, my name is Neal and I'm an alcoho... sushi addict.  This is one of my favorite places for sushi in Pittsburgh.  I've never ordered anything off the menu, but sushi....err... sashimi actually.  I really like the sushi chefs here.  They are friendly and when they know you are a regular they tend to be very generous.  I probably go here a couple of times per month,, usually on Saturday afternoons.  The fish is always very fresh.  A prime example of this is yesterday I tried to order a type of clam, but Mr. Kim said it wasn't as fresh as he'd like to serve.  My favorite is  white tuna.   The Miso soup is actually surprisingly good.  I really like the location of the restaurant and all of the servers are well trained.  Sit at the sushi bar where you can see the artists at work.  Also, please don't forget to tip the sushi chef.  These guys are pros.  Eat with your hands, sushi is the original finger food.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 4, "date": "2008-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "STSG0FJgGsLF9aI7H92f-g", "review_id": "ZSFHoUIFDrfCHwVb0p7eAQ", "text": "Straight up best budaejigae on the planet.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 4, "date": "2011-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zlcHQII8dyI8I0LHGj8nOA", "review_id": "YDeINrHrm1mfsmPl74yvJw", "text": "Been here multiple times...busy or not busy, service is ALWAYS slow. Tables are available but no one seems to want to clean them. Dirty tables are always present when I come, yeah very appealing. A larger party came after us and got seated first. Rude. Food is ok. Probably the last time I'm coming here.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 2, "date": "2012-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DHuoGx4Ab-AZkw9cKlvN8w", "review_id": "YYmR6iuI-PzhvYWaqUGXNw", "text": "My boyfriend and I were looking for a traditional Korean restaurant in the east valley when we stumbled upon this place. Went in on a Friday night and the place was about half full of customers. We were shortly waived over to a table and ordered our drinks a few minutes later. After looking at the menu we saw that the prices were a little steep so we figured either the portions were huge or the quality would be out of this world. Well.... we got neither. Both my boyfriend and I love bulgogi so I ordered the bulgogi hot pot and he ordered the traditional bulgogi. \n\nFood got to us fairly quickly and we saw that the portion size was lacking. When we tasted the dishes the flavor was very mediocre. Not bad, just kinda blah. The meet was mostly fat and not very tender as bulgogi should be. The flavor was too sweet and not enough spice to it. As for the side dishes that come with the meal they were all just as bland and boring. Most Korean restaurants bring tons of little things to try but here there were only 5.\n\nAll in all the service was good but the food left us unsatisfied.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2014-03-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7ivHxIpD4uEZGdHfJBdozw", "review_id": "LFfrHKPZzYvmLUCPfMiqiw", "text": "Good stuff! Good prices, good portions. Good service. Friendly, family-owned atmosphere.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2015-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SNBJb9xiaRJ0ohHhugwn_g", "review_id": "Ss684KFZsBBHewfiEy74Tw", "text": "The food used to be pretty descent here.  However, quality declined, and prices got higher.  Service is always friendly when I go there.  There isn't much banchan (side dishes), and I probably wouldn't get anything other than SoonTofu soups.  Still, for a place that's supposed to specialize in  Tofu Soup, it isn't as great as it should be.  There are plenty of better places to go.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2007-05-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AgtFQVxo-PGQVsOdY6Nvdg", "review_id": "CSzqxnJW_fWnaWpj6rPahA", "text": "For the price and the amount you can eat you cant really complain. The food was decent but the service was slow. The all you can eat is pretty much what your paying for and the only reason why we go. Dont get me wrong the food was ok but you might wana check some of the utensils  as our was dirty and we had to ask for new ones. Other than that the place is decent. Parking is abundant and not a hard place to find. It sits in eye view if your driving along the main road. Didnt seem very busy when we went but it got later as we were paying.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2011-05-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UZLXznH6Gb-OIGZIGst9uA", "review_id": "We4jnYCeOKRJFkLXhyoJIw", "text": "Consistent and open very late. You can choose from the AYCE menu, where you cook on a grill atop your table or you can opt to sit on the other side of the restaurant and choose something from the menu. They're bulgogi is good as are their short ribs, but I always go with one of the tofu soups, usually the kimchi beef. That's my favorite.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2013-03-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "TjFa1dbcsuCWeR4JrCINqQ", "review_id": "ikbr7IiFp2S2bobe4_QRGw", "text": "FIRST TIME TOFU EXPERIENCE!  My first time eating here and I will definitely comeback You have to get the spicy chicken also Not bad for my first time", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-04-12", "type": "review"}
