{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Nhvkukz5MECqEUQVfh6A6w", "review_id": "BywchRHEvjmYSKorUhyHyA", "text": "In all fairness - I did not see this dentist but did schedule an appointment and waited 15 minutes for them to open.\n\nWhen I look at Yelp reviews, I usually weed out the outliers (the best and the worst).   Unfortunately, there are only two reviews.\n\nIt was my first time at the office.   The office admin (very nice) asked for me to come early (before 9am) to complete paperwork.   I arrived at 8:50.    I waited.   I watched 2 employees walk by me (unlocked the door and re-locked it).    They did not acknowledge me.\n\nThe door I was at had signage (open hours).    I decided to leave because of a review where the staff seemed distracted or disinterested in my presence.\n\nThe office admin (very nice) called me to inform I am missing my appointment.   I explained to her that there were too many indications where this was not going to be a good fit and wished her the best of luck.\n\nI recommend if you see this dentist you go to the front door (furthest away from the parking lot) for the entrance.\n\nPoor recommendation because the staff who walked by me seemed to be distracted which was pointed out in a previous review.", "business_id": "e_U_FnpdKVgNb4mUN2cU_Q", "stars": 1, "date": "2014-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fbDFM2yM0yfyJvvn1OTWow", "review_id": "nCngZ3LBNc-Op02fldRFjg", "text": "Been to multiple chiropractors since suffering a subluxation a year ago and it's funny--each Doctor has a different method of adjustment.\n\nWell, let me tell you..Dr. Prinkey has it down to a science. Completely zapped my pain. I have never felt better leaving a chiropractic visit.\n\nOn top of that, the office is beautiful, and Courtney, the receptionist, is so sweet. Dr. Prinkey is a really cool guy, too. I always look forward to coming in.\n\nHighly recommended!", "business_id": "9b-YnpVt3P5Sk0_yUDaMGQ", "stars": 5, "date": "2015-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DWEJBZOCHHcUhRk-VfgR6A", "review_id": "GeR9PQ7E8F87G5AVMYFtNg", "text": "I had to have a tooth extracted and as many other folks out there I am terrified of the dentist. However, Dr. Smiga sat and talked with me for 15+ minutes to get my mind off of the impending procedure and treated me like a friend not a patient. He was knowledgeable, friendly and patient, all important attributes. Knowing he cares made everything much less stressful and glad to have him as my dentist.", "business_id": "UkylGV_aI3RCZJa9pHL0ag", "stars": 5, "date": "2015-04-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5LtUn33qI6aNb0WwzXe9aw", "review_id": "utpZgi02f5iWBYhXfKHCMQ", "text": "Try the new Crossfit classes with Coach Steffie! You will get your money's worth and then some. I see her almost 4 times a week and I'm fittest I've ever been in my life! The Y is clean, lots of equipment, showers are super clean and kept well. Huge locker room. Hardly ever crowded.", "business_id": "1lk-nBvl-mxV2PXLb29xBw", "stars": 5, "date": "2013-05-01", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "OXzYyZSHo9Dl6Qd0s_o2Ig", "review_id": "cMF3HM8HCFJPqij6q9Y_HA", "text": "Definitely a fan of this place!  I started going here for hearing tests and was very nicely surprised at the professionalism of the staff.  There is a ton of parking across the street in the parking garage.  \n\nMy advice would be to get an early appt because they get slammed with people.  If you are unsure where to go, the front desk on the first floor is very helpful and can direct you.\n\nThe building is very clean and nice and all of the facilities (at least in Audiology) were new and state-of-the-art.", "business_id": "UOLNw0-7GjxomFQiHUXisA", "stars": 4, "date": "2013-05-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rOQJPisPftjQYR1FrxCYBA", "review_id": "YmjEaFxZKsOnt8joD5f24Q", "text": "Appears these guys can not manage their appt schedule. Waiting over an hour yet again. Time to find better service somewhere else.", "business_id": "KgdLtB46PtgXV37IXpuu8w", "stars": 1, "date": "2014-04-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z5SBgJ9QHAwPH1XCJUUfZg", "review_id": "w1tIYlEBA4mL8ydUv8QdTA", "text": "I have been going to this location for a couple of years now. I have always loved the staff they go above and beyond for people. They were able to help me get a last min dr appointment when I needed it. As well as help forward a prescription in a hurry. I am sad to be moving away from the awesome people here.", "business_id": "3FAaEsYznpJoo0fOA1yuBg", "stars": 5, "date": "2013-05-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tBvrnSCLSpUdCDm5w5GPkg", "review_id": "Fmdg4jlrGX2cL13d2GSnQQ", "text": "The best service you will ever receive at any doctors office, hospital, or clinic in town. If you need Cardio services this is where you should go.", "business_id": "KXt0Iky3ybeLsbY9KC6GSA", "stars": 5, "date": "2012-03-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Pj22o4CxAUKWd0ET4QPVvA", "review_id": "IuY-Cna0SR7Lfe9RvLFejg", "text": "Love this group of practitioners and the care provided.", "business_id": "aOtx6bMU5M-Q_cNxhB0wYw", "stars": 5, "date": "2014-03-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "WbeW5OLqTneHbFjkAF8aTw", "review_id": "Axm8YC1vn182_mMn_K0-qQ", "text": "BEWARE!\n\nThis rating is NOT for Dr. Bracken but the dentist who bought his practice, as Dr.\nBracken just retired.\n\nUnfortunately, this new practice just  raised their prices 100% from what Dr Bracken used to charge and without telling you that prior to the cleaning and x-rays service  that my wife went for. I have been going to Dr bracken for 32 years and this new practice is lacking in every aspect of caring for your clients- welcome to the money grabbing health care.\nThe Dr. seemed uninterested  and hurried according to my wife.\nTime to look for an old school dentist ! \nI Don't mind paying a little more for good service and  and realizing we had it very lucky with Dr Bracken but DOUBLE the price and the attitude of this front office sucks!", "business_id": "2BcNZqbEY9x3F2hcs5GUhg", "stars": 1, "date": "2014-03-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "slBs0c4KwcIaxqxaA8RAog", "review_id": "WuIpQ-y8K-L4cSN1FYgjYA", "text": "The Friendship Community Psychiatric Center has brought meaning to my life and it has forced me to escape from  the web of severe depression and bipolar disorder that I have been entangled in for such a long time.  I owe alot to my Care Planner, Erin, as well as my group therapists Linda Cohen, Bonnie, Edna, Dixie, and Andrew.  All of the people that I have mentioned sincerely care about my psychological well-being and in essence challenge me and stimulate me and yes motivate me to work at my recovery.  Granted, I am making gradual improvement in my growth, but I am quite confident that I will make it through my many life issues.\n\nWarm, attuned, and caring best describe the entire staff at FCMHC.\n\nThank you so much!\n\nKen S.", "business_id": "3KwmkeqyC-STUvTcPOxsCw", "stars": 5, "date": "2014-04-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "F4q52-ABDW38MM0hpLl0Tw", "review_id": "WtvONhFV8q6KX2Fle__I8Q", "text": "I brought my daughter in for an eye exam. Dr Kantor was very thorough and the office staff were all very friendly.  I ended up making an appointment for myself.  I saw Dr Frank. He took the time to help me understand the exam and what was going on with my vision. He was also very thorough. I had a lot of questions and he patiently spent his time explaining all the answers.  Then when it was time to pick out glasses I received even better service.  Matt was able to help me find the right frame for my face. I have a hard time deciding what looks good. I am confident that he helped me make the right choice.", "business_id": "gztTQsgq6FJwIoV4P4RNIw", "stars": 5, "date": "2015-04-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "Gr8nyVM_zGY1Zo8PnTj6YA", "review_id": "cpSlM8RN-JTVLWBrMp9png", "text": "Went to the ER having a bad reaction to a medication. It was causing extreme vertigo, muscle twitches and my heart was skipping beats. Got to an exam room and Dr Taylor accused me of drinking, didn't even listen to my heart and told me to leave after I objected to his foul accusations. I left completely disheartened on top of being sick. My GF then drove me to St Luke's where they realized my heart was indeed skipping beats. They admitted me and hooked me to IVs for the night to try and flush out the medication that was causing it. I was released the next day feeling better. IHS is good if you have a cold or sprained ankle. If you need serious help go to another hospital.", "business_id": "p2rwsM4zoQ32jeybGYPT-A", "stars": 1, "date": "2015-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ovpa3S8xD96dLE5eDxcxJg", "review_id": "UAtEhT1FA0bF2SluvP8VbQ", "text": "Sports injuries (or injuries of any kind, for that matter) are no fun. \n\nI had a surgery on my ankle when I was a senior in high school and my sister was in and out of the OR with knee problems for eight or nine years.\n\nDr. Zeman handled both of us and it was as pleasant an experience as it could possibly have been. Mine was a one time and out, once my physical therapy was over my ankle was healthy and it has been ever since. \n\nMy sister's repeat injuries were a result of her continued participation in tennis, and then a reflare from a ski crash. Dr. Zeman was always helpful and courteous, and he even was flexible with his schedule to accommodate us, which isn't common among sports medicine docs. \n\nMost definitely one of the best in the valley, if not country, and easiest to deal with.", "business_id": "ZPkomfeRH2pflacWf7U3-A", "stars": 5, "date": "2007-03-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QfdqvcKtLBr15pMggtAjHg", "review_id": "G2lCLRPdambQe5_5XVu3YQ", "text": "as this has been my first time with a chiro, i really have nothing to compare it to, but i have been so pleasantly surprised with the customer service and the results that i'm showering CAS chiropractic with 5 stars.  they must only hire the friendliest people in phoenix (seriously, not the nicest town, but these folks are MINNESOTA nice.)  they all know my name, where i'm from, and what i do (and ask about such things!) after only a few visits.  \nmy hips feel much better while running, and i can do the elliptical without my feet going numb (a big plus, because that's generally pretty disconcerting).  BRAVO CAS chiropractic!", "business_id": "oMmTeuxyY-wFEstvXCOKaQ", "stars": 5, "date": "2009-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "p739BAAMmQesABp7dR_YEQ", "review_id": "GuGZ04W6Dj_7aVeZRFI_RA", "text": "When I set up my appointment I gave all of my insurance information so they could verify in advance. When I checked in, they didn't have record of the verification. The receptionists are ghetto.  It took an hour before my name was called. The tech taking X-rays had to retake several angle multiple times because she couldn't angle the bite guard properly (I just got out of braces so I have a perfectly functional bite). My previous dentist prescribed me a fluoride toothpaste because of white spots on my teeth due to braces (decalcification). The dentist at Western Dental refused to write a prescription for a fluoride toothpaste. Are you kidding me??? Fluoride!!!!??? I won't be going back.", "business_id": "sxw6uoNBIEo4QctMWx_jgw", "stars": 1, "date": "2012-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wu8irjmbFuV0fNk6ASRNUw", "review_id": "DyEg6ZFT2xQwWpVryl1GvQ", "text": "Doctor Romine has helped me enormously. I've seen her for procedures 3-4 times. I had to reschedule at the last minute, and her staff fit me in a few days later with no problem. She is an extremely busy woman because she has so many patients - but this is a sign that she cares. I've never felt pressured to buy products from Camelback Derm, but I've always been given options and information with the ultimate decision being left up to me. She even called me over the weekend to check in on the results of my procedure. I can't speak highly enough about Dr. Romine and my experience at CD.", "business_id": "tGTw5eeAwLmaSFKLVasb7w", "stars": 5, "date": "2015-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "R8-tRQVbiOwqUsaRCbOK3g", "review_id": "p211aKxksiFecu1yI4r5hw", "text": "Southwest Fertility is a wonderful operation of skilled caring medical practitioners who want nothing more than to help you become parents. The entire staff is professional, but not sterile. They take amazing care of you and spend the time that is needed when you have concerns. They have taken outstanding care of my wife and I during our journey. Even if the protocols they prescribed had not worked I still would have felt that I was in the best, most caring hands in the business.\n\nEVERYONE in the office is pleasant, encouraging and sensitive. The front desk people are considerate and pleasant. The nurses were caring, warm and supportive despite our apprehensions at times. The doctors are so very interested and committed to each person and never treated us like a number. Even the embryologist has a warm wonderful personality and was sensitive to our ups and downs while going through IVF.\n\nTruly, if you are faced with choosing a team to get you pregnant these are the people who are committed to your goals. We have done this before and this experience has been totally different. This time we are successful. \n\nThis is your team.", "business_id": "Y68Ysab60gJhX7YBjESgBg", "stars": 5, "date": "2011-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "4UYKNH4vyRpQXr0BbViAKw", "review_id": "jqNOyeNs5bX_yLNm59pPFw", "text": "Im Uber impressed with their ER. Unfortunately, my mom went here after slicing her finger, to the bone when a glass broke and went into our garbage disposal. My hubby took her to the ER, she had stitches, pain meds and home within an hour and 20mins ( On xmas eve). I literally FELL down a mountain while hiking this morning. Really messed myself up. Once in ER I was rushed back because they thought my wrist was broken and knee possibly dislocated. 9 x-rays, pain injection, wraps on my leg, a sling for my arm, RX meds and I was wheeled out the door in 1.5hrs. AMAZING. Staffs super nice and very caring. Very attentive. They get you in and out. They were even short on staff today!", "business_id": "8rMSbtMFVtEien-2EfFu6w", "stars": 5, "date": "2015-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jLdlCVoQjTgB2n4VwvLc4g", "review_id": "QPFkuFo6-ndbIpIkM_2zbQ", "text": "I have been taking my special needs 4 years old son to see Dr Reach every time he needs an adjustment, we can always get in when we need it.  He's our family chiro now. They are very friendly people and he knows exactly what to do.  I highly recommend them", "business_id": "rwzPmdpWG55_6uEmKl9Aqg", "stars": 5, "date": "2015-05-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MbogV99-KSj_Iy1tLNMZpA", "review_id": "K9VSSDLXGm5_VD5UUXFT-g", "text": "Went to Julie for Botox injections today. I had picked her because of her training by Allergan the maker of Botox. She is very professional and you can tell that she is an expert in Botox injections. Very pleasant atmosphere, no pain and no bruising. They have a special offer running for clients that follow up with feedback on Yelp! I would highly recommend Julie for your Botox injections.", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 5, "date": "2011-05-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ot_p2AOUYxZcGg19o_KbXg", "review_id": "3gSSB2EHeSCOdAvuHe-0OA", "text": "Hi,\nI have been a patient at Dr. Holy's for the last year.  I am also a salon owner in Phoenix of an award winning salon for over 25 years.  In our industry you are trained to look at anything suspicious on the head.  Hairstylists are the only ones that really get a good view of the scalp on a regular basis.  At cosmetology school they  discuss a bit of what to look for as far as suspicious moles go.  I have had a few customers that I have pointed out suspicious moles and they have held off from seeing a doctor and then to finally go and find out it is cancer.\nThe reason why I am writing this is because Dr. Holy has your back ...literally : ).  She looks for anything that may be changing and removes it.  This is what you want.  You do not want to be the person who waits until it is cancer and THEN you take it off.  She is doing her job by getting it off early.  So if she takes something off and it comes back negative lucky you...but I am sure it was moving into something.  She has detected early stage cancers on many of my clients and has helped them greatly.\nDr. Holy is a Harvard grad with a huge emphasis on the healthiest approach to looking beautiful and staying beautiful.  She will recommend products that are organic and pure and tell you about the prescription too and give you options.  In my industry you see a lot of Dermatologists and in my opinion Adriana Holy is possibly the best in the Valley.", "business_id": "6r8KHqgmlM3PWVZ7suyQ6w", "stars": 5, "date": "2015-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "qmto0yhlsGoX7McJqnQaZQ", "review_id": "ZOVMM56ifrApEKRSta-uRQ", "text": "Dr Drury is the best doctor I have ever had in my 59 years of life.  He is sensitive, listens to you and is a great diagnostician. My only issue is that he recently joined the IMS corporate  group which is a terrible mistake. They are generally incompetent, the billings are often incorrect  and billed deceptively to make the most money possible. It is very sad that such an  exceptional physician feels the need to join this pathetic organization. \n\nThe previously wonderful office staff seems to have disappeared as well and you now must deal with rude and disrespectful personnel. \n\nIf you can deal with the disgraceful bureaucratic mess of the office now, then I highly recommend him as an excellent practitioner. Make sure you don't let the office staff and other practitioners mis code your visits. It is all about money now that the corporation is running the show!", "business_id": "Kpl6cUmrYMczTDY_2RnctA", "stars": 4, "date": "2014-05-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wqQ-50Sjf9ol3SYaPbA1YQ", "review_id": "liBNDpcfQ4qTdxC-r4__KQ", "text": "PV Pain specialists (Dr. Wang) rule!", "business_id": "TZzFRsVLKyiVwhLCCcZZSQ", "stars": 4, "date": "2011-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5mvaOdV7nyKCP2Xct7yDTw", "review_id": "_CL89Np0-PbZyObvY86I2A", "text": "Team Dameron is great! Great staff and they keep things simple, which I enjoy.", "business_id": "SC7y-w80q2-85iDDCFuQqA", "stars": 4, "date": "2013-03-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zfD4SwR5texVoniCNn4yPQ", "review_id": "5a6ID_1EFG9nSE1nX2yChA", "text": "I drive almost 30 minutes each to keep using him. That should tell you all you need to know. A lot of chiropractors are nice,  some are good,  I've gone to different chiropractors over the years and Dr.  Kasian is as good as it gets. BTW he also does some acupuncture that seems to be helping me. Very knowledgeable guy. Cares a lot.", "business_id": "CdudUZNZVyXtguq4EDkvXw", "stars": 5, "date": "2015-05-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KPsb8xSgWUMAvDasNlFgPA", "review_id": "W8hsGMFF7utxuRCfyZQO6A", "text": "I was referred to Dr. D from my dentist, As an adult with TMJ I was put on braces for a 12 month term. I am happy that not only are my teeth now straight again( as a teen I had braces ) after only 9 months my braces were removed, but also that my tmj is now better. I can say  my visits with Dr.D and his friendly staff have always been easy, generally quick and the staff is so personable and truly get to know their patients! \nI like that they offer clear retainer options and permanent retainers not to mention they offer the hidden braces!\nSome things that are great: \nTwo offices - San Tan and Ahwatukee\nFriendly Staff\nAn assortment of colors for kiddos with braces\nAlways answer all of your concerns \nThis place is not only adult friendly but great for teens.. They recently did a huge renovation in their ahwatukee office with a new game room and lobby area. I wish this place was around when I was a teen with braces!", "business_id": "iZwSI8fB_xa8nPAkwqhJwg", "stars": 5, "date": "2015-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7op0fmvXG6XydXF_d7kkKQ", "review_id": "zE_YIHpcm-AWcxFl3BdidQ", "text": "Beautiful Spa! I had a Microdermabrasion appointment with Clarine. My skin feels, looks amazing. Clarine is fantastic and I am loving the results.", "business_id": "bEx9DFIivn8qizkOSUHCkg", "stars": 5, "date": "2013-03-30", "type": "review"}
