{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "q7MrNVt1FE23rwtWmPYWHg", "review_id": "bgLHVU09FpJ-uEOFFor6uA", "text": "I heart King's. I've always been a fan and this one was as good as my old one in Monaca.", "business_id": "wJr6kSA5dchdgOdwH6dZ2w", "stars": 4, "date": "2012-05-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "9Ify25DK87s5_u2EhK0_Rg", "review_id": "JqZK87MaXF_81JAuLNSO2Q", "text": "On a random Sunday morning I went in search of a good breakfast spot.  I decided to explore the McKees Rocks neighborhood and came upon Marge's Place.  I hadn't heard much about this place, but after reading the few reviews I could find, I decided to give it a try.  \n\nInside, it's bigger than I expected but still has that down home diner feel.  My guess is that most of the people there were regulars.  The wait staff was friendly to those they knew but also welcoming to me, someone they had never seen before.  I picked a table in the corner so I could observe what I imagine was a typical Sunday morning.  I ordered the breakfast special: 2 scrambled eggs with bacon, potatoes and toast.  Any place that has Mancini's Italian toast already gets thumbs up in my book.  Being in McKees Rocks, though, they really don't have a choice.  The potatoes were thin sliced with onions and very flavorful.  The only way I can think of to describe the bacon is...porkier.  Is that even a word?  I just don't know how else to descibe it.  The combination of foods was served in generous portions at a great price (under $5).  \n\nOne random note: I liked the tables and chairs.  They were comfortable not just for sitting and enjoying a cup of coffee with my morning paper but also very comfortable for sitting and eating.  Good distance between the table and chairs.  That may sound silly, and I thought so, too, at first.  But when I go to a place and the booth is too wide or too narrow, it can hinder my enjoyment.  \n\nNot only will I return, but I will also recommend Marge's Place to anyone in the area.  It was a surprisingly good find.  I like places like neighborhood businesses like this where they make everyone feel like they belong.", "business_id": "r8BwdblCW-ZUES37BL0khw", "stars": 5, "date": "2012-03-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "kB4FK7vCRML_v9dabD2PiQ", "review_id": "GGpi9Hqvlzl15JJ7IQL-BQ", "text": "The Dor-Stop is a great small breakfast restaurant.  Once you enter the doors of pancake heaven you are greeted with friendly staff and the delicious smells of pancakes and meat on the griddle and other various breakfast aromas.  We came Sunday for breakfast and, boy does this place fill up!  \n\nThe Dor-Stop has gained fame from Diners, Drive-Ins and Dives, but that's not what I care about! I just want the food!  So, that's what I did, I ordered the food after ordering my coffee.  Their menu has all of the classics including their signature pancakes, omelets, french toast and eggs cooked to suit.\n\nMy coffee cup and water were kept full and while sipping on my caffeinated beverage, my meal came.  The Dor-Stop produced my order of two eggs over medium, and two large banana, chocolate chip pancakes.  I was speechless once I took a bite of that cakey, breakfast goodness (the pancakes not the eggs!).  The pancakes are really delicious. They have the perfect texture, the perfect taste, the perfect look, the perfect smell... need I go on?  The eggs were good too, I don't want to leave them out, but what egg is going to win again the battle of pancakes v eggs?\n\nBreakfast Breakdown,\n\nThe Food: Delicious!\nThe Value: I believe my two egg combo was $7.99. Breakfast for four with coffee was close to $40. That's not too bad.\nThe Experience:  It's a small restaurant full of happy people! I happened to glance at the table next to us  and saw the breakfast burrito.  It's massive!\nWould I return?: Why, yes. I wish I lived closer so I could eat them every Sunday.\n5 stars?: I've been to a restaurant that claimed to have the best pancakes in the world.  They were wrong. The Dor-Stop has the best pancakes and for not claiming to have the best, they get 5 stars, because these pancakes were heaven sent!\n\nBonus game!: How many times were pancakes and breakfast mentioned in this review? Points to the winner!", "business_id": "2Igiyhi82R8_QaaPplRmCw", "stars": 5, "date": "2012-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "68vjXoLMogT5p1jb8enlVQ", "review_id": "6afhPAbRb7mA6CWXDaWoOQ", "text": "This place takes the (pan!)cake for cozy morning breakfast.\n\nGrowing up in the South Hills, this is where you tried to go every Saturday morning.  Note I definitely said TRIED, as if you arrive after 11, you better be very patient.  This place is small and people love to relax and stay a while.  However, this is one of the few spots I will leave the house for before noon on the weekend.\n\nYou might have seen the spot on the Food Network.  If not, look it up.  The owner and her daughter are crazy endearing.  The focus here, of course, is on the pancakes.  This is the only place I know of that serves pumpkin pancakes year round, and it is for a reason.  These are dense and sweet, enough that even I don't syrup them.  A little whipped butter in a paper souffle cup and a dash of salt (hey, don't knock it 'til you try it), I can clear three or so in a few minutes.\n\nThey also have staple breakfast items, along with the jumbot. At least one of the guys in my party always goes for the ham on the bone/jumbot.  If you can fit this thing in your body, go for it.  The only other unique item to try would be the stuffed french toast.  Personally, between syrupy fruit filling (compote is too kind a word for this ice cream topping inside) and then topped with more fruit syrup, it tastes more like a heavy dessert for me, but I know those who swear by this as their weekend treat.\n\nIf you find yourself on the other side of the Liberty Tubes on an early morning, you need to go get pumpkin pancakes.  You can even call ahead for it to be ready for take out and avoid the mess of hungry Dormont-ers along the Potomac sidewalk, but then you'd miss making new friends with your slightly brash waitress and the infamous specials on the tiny chalkboard.  Either way, depending on your timing, this diner will hit the very top on your breakfast list.", "business_id": "2Igiyhi82R8_QaaPplRmCw", "stars": 4, "date": "2015-03-20", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "GnV8MNKEhHVl27bMVUuQTA", "review_id": "NvzlxUY9tGr3asSjQdJkeA", "text": "I love this place, and I can honestly say that I find myself missing it, now that we no longer living in walking distance in Lawrenceville.\n\nThe sandwich shop is not glamorous, but you're not going to eat there for glamour. You're going to eat there because you can get an enormous plate of breakfast and a bottomless cup of coffee for around $5. \n\nMa Roz will always make you feel at home, and she'll remember you after your first or second visit, so that every time you come back, she greets you with a, \"Hey, where have you been?!?\" motherly scolding. \n\nThe food here is greasy, but it's delicious. Expect to hear some good music, too (Bowie, Creedence, the Dead). In the wintertime, you can warm up by sitting at the counter across from the grill and watch your sandwich come to life in front of you. Just remember, it's cash only.\n\nIf you're coming in for lunch, and not breakfast, I recommend the fish sandwich. It's of Lenten church fish fry quality, flaky and greasy and crispy all at once. Yummy. Just uh... don't come here on a day when you want to eat healthy. Come here for a hangover brunch, or a late-night-prevent-a-hangover snack. You won't be disappointed.", "business_id": "o_wRqOpli9kyZGXlJtLLdA", "stars": 4, "date": "2012-05-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fiKktPFvp0A1dD-qy3uH5Q", "review_id": "2S1QJc_cSWS1L4VZDkh9mQ", "text": "I requested a stay at the Inn on Negley when traveling on business back to Pittsburgh.  I lived in town for 5 years and had not had an opportunity to return in more years than that I am afraid. This place was just what I needed. I sought a more personal experience than a canned commercial hotel could offer.\n\nI was so grateful to get to stay in this pristine, classy, comfortable Inn. The staff was welcoming, sweet, helpful, and kind. The room was lovely. \n\nThe best part was waking up in the morning! Breakfast made me feel like a queen on her birthday. The food was perfect. Gorgeous and delicious. The carefully cut fresh fruit salad, coffee, french toast option, and housemade pastries were top shelf! The  creative meals and fresh ingredients were professionally planned, carefully prepared, and out of this world! \n\nI bought my host a gift certificate for brunch in thanks just so he could share in how fabulous the treatment is. I'd return in a heartbeat.", "business_id": "rUQfZOengMpXFkLvJrNJ3g", "stars": 5, "date": "2014-05-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "0vCEI3ZJF_gXgWHpcR7WtA", "review_id": "GcEvz60cv2NCY5RopQZTKQ", "text": "HOT CAKES.  That's really all I have to say.  I was wondering what the fuss was about, and when I took my first bite, it all made sense.  As for the rest of the breakfast items, they're okay.  I ordered corned beef hash, and it seemed like the kind of corned beef that came from a can.  I could be wrong, but it just didn't have much flavor.  The only annoying thing about this place is the wait.  Get there early or be prepared to wait, outside, for a long while.", "business_id": "TxKmAsKQjND5vbhBdUSyIA", "stars": 4, "date": "2013-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "BwmLOQf6ba50InPaWFcxdQ", "review_id": "-9pBg59DTcg9W_EP_Rsy2A", "text": "The best place for breakfast in Shadyside, especially if you don't feel like being drowned in food at Pamela's. There might be a wait, and don't try to go with more than two others (really, make it a date), but it's so clean and nice and relaxing. The crepes are excellent, I always get the breakfast crepe (sausage and egg) with their soytang sauce, but the dessert crepes (chocolate and orange! banana!) are also delicious. The little salad of greens and orange slices that comes with the savory crepes is a great addition. Go here when you're feeling cosmopolitan.", "business_id": "cmGR1HS9ms233roSllcglw", "stars": 5, "date": "2009-04-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "7ewE_dDxjXNppOj0EhhMIQ", "review_id": "AU718xhZYAfY9JOGdpnc8A", "text": "My soon-to-be-Mother-in-law loves the Dunhill, so we had an awesome dinner at Monticello the night she arrived.\n\nTo tell the truth, I was expecting the worst (Pasta Primavera with Roasted Red Pepper, I hate you). I was more than pleasantly surprised to find several veg appetizers and an inventive vegetarian main on their exclusive menu. \n\nBut, I had to do the obnoxious - ask the chef to put an entree together for me, something I often do at restaurants of this price range. He immediately agreed, asked me a few questions, and disappeared. Not a short time later, a pile of thinly sliced cauliflower quinoa pilaf, garnished with edible orchids and microgreens, and SMOTHERED in a honey-butter broth appeared in front of my bulging eyes. DE-licious, but almost too rich for such a balmy night. He made a point of checking on his creation (which had already found its way into my belly), which was awesome.\n\nService was less formal than I expected, which was fine by me. Very small, old school feel, perfectly dim lighting. This meal reminds me that I have to stop ignoring Uptown cuisine. I hear the brunch is amazing and super affordable. I'll be back.", "business_id": "-Am2JVkb7nwvBAUwSugG0A", "stars": 4, "date": "2010-05-09", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "3GKKLGp99bNoBdJ_TbwYkg", "review_id": "ldjgCcmy3H1ZbF2DvL57CQ", "text": "We always go to Harper's for dinner on Sundays when we visit my grandmother in Charlotte.  It's a great place to go after eating a gigantic brunch earlier in the day since there is something on Harper's menu for everyone.\n\nThe restaurant is warm and cozy and not too loud.  We were greeted and seated immediately.  Despite a brief awkward confusing moment where our waitress thought my grandmother was a lunch regular (which she is) that orders 7 & 7's (she doesn't), the service was decent.\n\nI ordered the steak salad which is delicious.  I'm sure it's not the healthiest salad between the fried onions and blue cheese dressing, but it was definitely yummy.  It came with a small square of cheese bread which was to die for. I'm pretty sure they put honey between the bread and the cheese.  My grandmother enjoyed the chicken oriental salad and my mom polished off her entire roasted vegetable pizza which was HUGE.\n\nThis restaurant is always consistent and good - I look forward to coming back on future visits.", "business_id": "hIQRiE3UsYH7UsrsDwJwLA", "stars": 4, "date": "2013-05-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "x0gFshv4biRbHxpS6kuc0g", "review_id": "VuDm1-F-VeCZ6PbPMCkN8A", "text": "So I knew this place was going to be good when we came here on a Monday morning and it was packed.  \n\nAfter reading over the menu with what seems like a never ending selection of waffles, pancakes and crepes I went for the Kijafa Cherry crepes & Ethiopian coffee. The Ethiopian Coffee came in a french press, so you could probably get 2-3 cups out this one. The Kijafa Crepes came with 3 large crepes covered in cherries and this awesome sauce.  Each crepe itself could have been its own serving. \n\nBut I do have to remember that this is the South...so therefore everything comes in extra large.  I wish I was able eat all of it, but the my body will reject the greasy fatty goodness.  So the one crepe that I was able to eat was yum-tastic.", "business_id": "UzMMpUFwJhwUkHOyeXeWsQ", "stars": 4, "date": "2012-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9EOIIJY6Fv7fBYBapmfuAw", "review_id": "pcwI42DvGh6uA5-DHlWzng", "text": "So good! A lot of older people frequent this establishment, which just confirms the wholesome goodness this restaurant offers.  It's affordable. They have a variety of healthy options and large portions. I had the stir fry which I was able to take home leftovers for lunch the next day.  can't believe I passed by this place so many times before giving it a try. Oh did I mentioned they serve breakfast all day. Yeahhhh", "business_id": "KQqkkg5jaxIbdMIG4MJCIw", "stars": 4, "date": "2015-04-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "4BpZid6JOJeUqqVhPHawyg", "review_id": "Ci68jXKAXQYdHS2WP8z50w", "text": "A completely unexpected find. While on a trip to Madison we wandered into this cafe after checking out the local grocery across the street (it's an odd obsession of ours to check out grocery stores when in a new town). When you're starving and pop into the first place you see, you hope for a sandwich with no mold on the bread and a halfway clean glass for your soda. This was light years beyond that.\n\nI had the special salad of the day. It was delicious, a mixture of greens with just a sprinkling of crunchy celery, and full of huge chunks of the tastiest creamy blue cheese I've had in a very long time. My lunch companion had soup which she declared to also be delicious. \n\nDecor was a tad dark, and since we were there for a late lunch we were the only ones not sitting alone playing with laptops. However, the tchotkes and lending library helped create a friendly neighborhood hangout feel.", "business_id": "ShEYKerTwb2LSORE5o_s7A", "stars": 5, "date": "2008-04-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "H3i80fPlPwuI9Ig1ItVaWg", "review_id": "aZXvyf3xgzlKpDFItcCIdQ", "text": "Come in here quite a bit by myself, usually later in the evenings. Service is usually slow and the wait staff seems to be inconvenienced when you show up during their closing hour and more concerned about leaving work than giving proper service. *News flash wait staff* better service=bigger tip. Keep coming for the consistent food. (Which is ok at best) better service in the mornings as long as you beat the rush, good luck with that.", "business_id": "QF14BFUVHRODxGNVflgm3A", "stars": 1, "date": "2015-05-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2CTCrl-YdeT-4LekCsJSLg", "review_id": "DUyCBAamPQIPQk1lKQytEA", "text": "Yes. It is a diner/waffle house; it's the least original thing that can be said about it but no less true. Comfortable and relaxed, the perfect place to go when you need to ignore the angels of your better nutritional nature and just pig out on things slathered in gravy.\nIf I were in college, lived in Champaign, and needed a late night place to haunt, this would be it.", "business_id": "vBg5V39Vf4eTx1JVgl_5Pg", "stars": 4, "date": "2009-05-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bHCAZYvsh9LkydyBNl2PGA", "review_id": "1pqeW13zT9lt7KVyT87Jvw", "text": "If you go to Sam's, you probably already know what you're going for. It's not for ambiance or subtle flavors or lunch... it's for delicious breakfast food. It's not exactly a new trend to sing the praises of small greasy-spoon style places, but there is a reason for that: no $30 fancy brunch can ever really inspire the same satisfaction that  getting gratifyingly greasy french toast, pancakes, sausage, and hash browns for a few dollars can.", "business_id": "2UAbUSTMsR9G26A8AYO3dA", "stars": 4, "date": "2012-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FFsuViuxEt6rvWPyTMo02Q", "review_id": "5AJiIuAW5jr842UXvBwRpg", "text": "One of my favorites for breakfast or Brunch.", "business_id": "6HKjKhgDLBpuZFNBOCzVQw", "stars": 5, "date": "2012-03-06", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "Pvnmv9Shbr2bPLg4pfZM8Q", "review_id": "JClLujzkHK8qQNhnjLFuIA", "text": "Every time the convo about restaurants in Champaign starts, the mom-in-law mentions Radio Maria. Her praise hits often and reaches far. Tonight, we finally had dinner at the infamous Champaign culinary sensation.\n\nThe food offering was a mish-mash of cuisines - South American, Asian, Mediterranean, Spanish - and seemed to lack a consistent and unifying theme/thread/philosophy. These types of menus are generally red flags for me because they say: I can do a breadth of styles good, but not one style great.\n\nWe started off sharing the mezze plate. Pita was pizza dough-y, but buttery too...strange, in my opinion. Also, I found the couscous bland. Best part was the hummus, which I was wishing they served more of.\n\nFor dinner I ordered the crabcakes, which were more like crabballs. Goat cheese potato pancakes were crisp, but lacked seasoning. Radio Maria's Haitian slaw was flavorless and served merely as decoration on my plate - I hate to say it, but KFC's got better slaw! Positives about the crabballs - they weren't THAT bad and you get three in an order. If you order this, ask for extra garlic aioli (probably best to ask for it on the side). I probably would've enjoyed my balls (but, really...who doesn't?!) more if I had extra aioli.\n\nBeau ordered the adobo pork. Generous hunk of pig, the orange-bourbon BBQ sauce starts sweet on the tongue, then finishes with a kick...flavor was decent, but I wasn't expecting or enjoying this sweet sweet meat (SHOCK, I know!). Jalapeno-cheddar cornbread was interesting in concept, but lacking in execution...I would've never known there was jalapeno unless the menu told me! Like the roughage on my plate, the honey left his chayote-cilantro salad be.\n\nCall me crazy, but I AM willing to try their brunch and/or tapas, but lemme check-in with not-my-bio-mama first...", "business_id": "AB5RgQ0ZnMThdqgFS3cPuw", "stars": 2, "date": "2008-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3eXmgv6XbAlnFrNF7MXWoQ", "review_id": "U4abz91ZGIqyl0TWm-mHEA", "text": "Unique place.  You won't find anything like it.  Has a full resturant and a apas bar.  Great food, and truly excellent service.  Easily the most interesting place in central Illinois.  Really.", "business_id": "AB5RgQ0ZnMThdqgFS3cPuw", "stars": 5, "date": "2012-05-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "rZF3xgKdanZG1yfJdPHBJw", "review_id": "EdeH00-43L7ecWTFuN-i_Q", "text": "Prec. They will customize almost any item for it to fit your lunch needs. Outside seating is available and with the fantabulous sunshine in Phoenix, this is quite a pleasure. I'm not sure how great it would be in the summer with 100+ degree temperatures..but hot damn, a great place in the springtime! Go for a leisurely lunch, it's got the relaxed atmosphere thing going on.", "business_id": "gBcpDl0quCLABsg5OuSFww", "stars": 4, "date": "2006-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "uj79HTtyOdAdd_TaPcdxjA", "review_id": "c8-n8xuUnmmTguKIvR7RfA", "text": "All around great.  Great food, great atmosphere and great location if you work in the downtown area.", "business_id": "9BH18avE46LlHMvJn67MaA", "stars": 4, "date": "2008-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Bymcwh4EHM_MWiYF435gdg", "review_id": "aGQQKZ7YdbB6s7IHUWyt6g", "text": "Umm I'm unclear as to what all the hatery is about. (I know thats not a word) but I can say I enjoyed my meal here, I had a sandwich with soup, my girlfriend had the french toast, both were quite delicious. I couldnt care much for the decor, and many steps that you can trip over, but the service was what I expected. And that is all", "business_id": "SkNUbFJiJtbZjY-S_S0u7g", "stars": 4, "date": "2009-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "JAeTwZWx5MUq2_h7fZLKIQ", "review_id": "IDEDDMtxV7hd7pFHNXBU5A", "text": "I gave Le Peep 4 stars because they have great smoothies!!  This is one of 2 breakfast places I frequent on the weekends.  They have been going through some tough times lately because of the light rail construction, so busy times are hit-or-miss.  Generally around brunch time on the weekends its not too bad, but every once in a while you will hit them at their busy time.  \n\nGenerally I get really good service at Le Peep.  Lately however it has been slow, bad, or not at all.  I used to see the owner there working every time I went in, but haven't seen her in several months, so I don't know if it was sold to someone else or what.  After I stopped seeing her there  is when I started seeing the servers come and go and the service get worse.\n\nI find the breakfast food pretty good, and like I said the smoothies are great.  I have not had anything for lunch there.  I can recommend the french toast or the mini veggie omelet which is awesome!  They have pretty good coffee and their prices are reasonable.  To top it all off, they give you punch cards good toward free meals.  \n\nLe Peep seems to be going through some tough times right now, but I'm sticking with them for my weekend breakfast and I recommend them to anyone in the Central Phoenix area looking for something better than your other choice.....IHOP.", "business_id": "yaTx8l9SrM0qR3Zcdnw5rw", "stars": 4, "date": "2007-03-29", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "fL35GHzclQauHyVr0sjREQ", "review_id": "hxQ83Ftl31QNnXx5s9vQEw", "text": "I have ascended to food heaven.  Dining at Scott's today was like a religious experience.  One that my waistline will pay for but so worth it.  This is hand's down my new favorite place for great deli sandwiches and bagels. No more will I buy my baked goods or luncheon meats at the grocery store.  \n\nDeciding what to get was tough, but I've had pastrami on the brain for days.  The New Yorker sandwich filled that craving and more.  Ridiculously high piles of pastrami and corned beef.  OMG!  I didn't know how I'd ever get my mouth around it, but somehow I did and the flavors and textures exploded on my tongue.  The sandwich arrived with spears of pickles, cole slaw and the cutest french fries.  There was no way I was finishing it all and I happily boxed up the remainder for a tasty breakfast tomorrow morning.\n\nWhile inside paying I perused the bakery case. Lovely Linzer cookies called my name loudly so I left with three!  The kid behind the counter offered to give me another for free but I thought about my waistline and graciously declined.\n\nI look forward to my next visit however now I retreat to my room for a happy Jewish Deli induced food coma.  Sweet dreams!", "business_id": "PxeX1M8WtyPxX1MuuGIh-g", "stars": 5, "date": "2011-04-16", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "vDwoqlM5Y0rhVyqxl8v6vA", "review_id": "2nEYiNpBKt8bIiYsbJ6fWg", "text": "I live in the neighborhood and have wanted to try this place out for a few years. This morning, my wife, daughter and I walked there for brunch. We sat out side, ordered and ate. The food was average, and a bit overpriced. The place was a little dirty.\n\nI am an Asian American, and was born in Vietnam. My given name is Dung, which is an unfortunate name to have in the states, but it is my given name .  After I paid my tab at the counter , as I walked away, the man who tendered the transaction walked to his colleague with my receipt. They said my name out loud, audible to me from twenty  feet away, and half way out the door, and laughed out loud. He then said,  \"hahah, they named their stupid kid Dung!HAHAHAH\".   I've lived with this my whole life, but not so much as an adult.   This was disappointing to me that these men, who represent their business, were this rude and insensitive. So, Scott's Generation WILL be receiving a letter of complaint by me and I plan on filing a letter of complaint to the BBB.\n\nIf you are looking for a food /  restaurant review, this place is overrated. The food is forgettable  and the service, was beyond description.", "business_id": "PxeX1M8WtyPxX1MuuGIh-g", "stars": 1, "date": "2014-03-16", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "TjsABzuLx7k4sQG_L3txgg", "review_id": "eyEWPJaU2RwIareTyt8I-w", "text": "This place use to be nice to eat at.  Now it's a dive!  The restaurant is filthy, I got a water glass with Lipstick on it and our coffee cups had dried cranberry juice on it.\n\nI've been there multiple times thinking \"it's just an off day\",  The last time I went there was a week ago when a friend was visiting from Palm Springs and I have to say, I was embarrassed after taking him there!  They got his order wrong, our dishes were dirty and the waitress seemed annoyed that we even mentioned it.\n\nI will never go there again.", "business_id": "FKHv7FkblONv9qqBndJUrg", "stars": 1, "date": "2013-03-29", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 3}, "user_id": "SscF2gvZFSPE9D-ijmq2VQ", "review_id": "t69jGpmFmeJ0k_vNmVSUxw", "text": "Met up with an SPJ group for networking event. The outdoor ambience was relaxing and just set apart enough for our group. Mini deli sandwiches were prepared for us, and we all ordered drinks from the supremely affable bartender. There's probably 100 different types of beers/wines here...I didn't have time to browse all the gourmet groceries...it was an ideal marriage of tasty food and atmosphere this last day of April. I guess I'll go inside next time I'm here; it's about to get so hot! Edit: they tell me they have misters too, and not just the masculine variety. ;)", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 4, "date": "2009-04-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GCToyOzdSlnT9IjnpJa63A", "review_id": "KVfyHRl8GfsdV0jEW6ZbBg", "text": "Veggie Sandwich = Vegetarian heaven!  SO fresh and I actually ate the entire sandwich and that is RARE!  Tea is fresh and I loved everything about this place!  one of my new favorites!", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 5, "date": "2013-03-20", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "PShy2RYNadDUhJf4ErOJ7w", "review_id": "1TnBoy6w2jNDIw5uf1WxLw", "text": "Loved their food\n\nHas a little bit of an old people vibe though.... a bit dated....\n\nHonestly, the food was top notch.  \n\nI did see a giant cockroach run across the dining room floor though....   Hmm.....  I'm torn on how many stars to give this one.....\n\nHmm.....\n\nI'll give 3 for exceptional food.\n-2 for the huge cockroach.", "business_id": "imvNxppzxkLUPH64pQsDQg", "stars": 3, "date": "2008-04-06", "type": "review"}
{"votes": {"funny": 15, "useful": 17, "cool": 19}, "user_id": "vsXP832M0kOxKpfduD7dWw", "review_id": "M8OvY0y9DbX5u_WjipN0kg", "text": "I love the Wrigley Mansion! \n\nI was there a few years ago for a wine maker's dinner and it was beyond memorable: the food, the wine, the views.\n\nAnd, just last night about 12 of us gathered to celebrate a birthday. The staff were very accommodating and offered us the loft above Geordie's for a semiprivate feel. We didn't have any \"minimums\" or \"room rentals.\" Our server did a great job and got quite the work out going up and down the stairs with our drinks and food! Happy hour runs until 7 and features $5 specialty martinis, which are full size and strength! There's even a tequilla-tini that tastes like a margarita and looks like a Mexican flag!\n\nThe executive chef came up to welcome and thank our group, which was such a hospitable gesture! I told him how I enjoyed the truffle fries and the burger (see Andrew K's review - BTW, I'm the one who screwed it up by saying \"not too much pink\") and he explained how they pride themselves on knowing where all their food comes from. They even dry those apples themselves - in-house!\n\nIt's true that the place was NOT crowded, which works for me because it means I don't have to fight with anyone for a seat to watch some of the country's best sunsets over a cocktail! I really need to come here more often! I will definitely be back!!", "business_id": "yPfvOB63thP5t3pGZPJExA", "stars": 5, "date": "2009-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "Pv7DGHzZ-uqIUdOsqPpsVg", "review_id": "FLyc8W-vSz5GWjNsiFqTUg", "text": "Oh, Wrigley Manson if only I had the means to fix you up and make you the amazing gem I know you could be.\nPhoenix is seriously lacking when it comes to historical buildings and homes. I have always been curious about the Wrigley Mansion so I was excited when we made plans to go here for Easter brunch. \n\nThe brunch was good. Our server was friendly and funny. There was a decent variety of food and it was tasty. My only complaint about the food would be the desserts. They were not labeled, the cakes and pies were whole so people cut their own slices and they became a mess. Overall I just wasn't impressed. I've seen better dessert spreads at casino buffets. \n\nAfter the meal we wandered around the building, exploring the rooms, peeking around corners and checking out the history. The bummer is that it's obvious that the money isn't there to keep this place looking its best. Some of the bathrooms were run down (burned out lights, doors that didn't lock), in one room the curtains were torn, walls and flooring showed signs of wear and tear, and furnishings just looked tired in places. It wouldn't take much to clean this place up and have it look amazing. I'm sure when the Wrigley family lived here it was incredible and it's sad to see such a great home being neglected. I'm sure if they fixed it up they would book more parties and weddings and it could be a prime location in town. \n\nI hope someone will take the time and money to invest in one of our rare glimpses into Phoenix's past. If it continues on this decline I don't think it will last.", "business_id": "yPfvOB63thP5t3pGZPJExA", "stars": 3, "date": "2013-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "DrWLhrK8WMZf7Jb-Oqc7ww", "review_id": "mjJoKNVqi_oIbKhTSHPnLA", "text": "A very good informative tour on the history of the mansion and the man himself. The tour guide pretty much talks nonstop for one hour, but she covers his whole life and we get to see nearly all the rooms and even the bathrooms of the place. Wrigley only spent a few months here a year, but built everything for his tiny sized wife. The views from alot of the rooms are epic and some of the photos of Wrigley's Cubs year's were interesting. The tour is $15 and it is worthy of your time. The mansion has alot of building secrets and if you just spend $5 and wander about yourself then you won't get the true feeling of the building.", "business_id": "yPfvOB63thP5t3pGZPJExA", "stars": 4, "date": "2015-05-30", "type": "review"}
{"votes": {"funny": 5, "useful": 8, "cool": 7}, "user_id": "diDUDx82VePOC1hObkHwMw", "review_id": "9WtDO8NbsgpbIO5JYId9eA", "text": "This place is a solid 5 Stars in my book. We took our N. Scottsdale friend here for her Birthday Dinner based on reviews from some friends on Yelp and were blown away with every aspect of this Beautiful Market Bistro. Once you find the entrance and park your car you walk up to a colorful patio decorated like you would see in a French painting by Claude Monet. You notice everyone there enjoying themselves with a glass of fine wine and a table full of tasty goodies. The inside is interestingly charming and colorfully decorated in the same eloquent fashion. Nice.\n\nWe got there early to avoid the crowds and it was perfect. We were also greeted instantly and told to sit wherever we wanted. The server showed up faster than if I had a magic wand. He informed us of the specials while he got our drink orders going as well as bringing us a complementary plate of some of the best tasting buttery croissants I have ever had before. We asked a few questions and he happily answered us with no hesitation and was most informative.\n\nWe started with the Smoked Salmon Quesadilla with Dill & Horseradish Cream for $10 and it was delicious. For entrées, the ladies ordered Sautéed Salmon with Herb Rice and Basil Beurre Blanc for $12.50 and Beef Bourguignon with Mashed Potatoes for $14. I selected the Seafood Skewer with Pesto Sauce and Scalloped Potatoes for $13 off the specials menu. We were all amazed at how nicely the vegetables were cooked just right. The fresh ingredients, textures and flavors were spectacular with all the dishes. Could not help asking for another plate of croissants to sop up all the extra juices and sauces since I was told by the wife not to lick the plate. When we thought we were done the server brings each of us a small plate of flourless chocolate cake topped with a mini scoop of vanilla ice cream and a drizzle of chocolate syrup. Yummo!\n\nWe had such a great time there and the bill was very reasonable for the quality of the food and the friendly service we received. We will definitely be coming back again sooner than later. Fantastique!", "business_id": "oc0Wl6ktfMLb5VZ2Uz6M2A", "stars": 5, "date": "2013-04-07", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 4}, "user_id": "J72XoQspNBmPsX2iKl2YvA", "review_id": "ts4I3uoEemofCv0aunv08w", "text": "As per usual no disappointment for lunch and great wine selections for five bucks per glass.  We arrive just before 11 to get our favorite spot and order our usual Bruschetta (4 tough choices) to share.  Having tried all ten choices at one time or the other we chose 1,2, 4 and 8.  You will have to visit to see what we selected but please don't occupy our spot.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2008-03-05", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "q0KigjVBtb6dfRjX3QJbsQ", "review_id": "-rwNeFCcpRPGtZLFij0gcw", "text": "It's little gems like this that make me love Phoenix. (Phoenix can sometimes be a bee-ach from hell but if you're patient, she rewards you.) The only drawback to this place is parking. And since I can't get here on the light rail I have to drive. And if I have to drive, I have to park. But when I can't park, it's a hassle. \n\nHowever, once you achieve parking success, Postinos is awesome. I love that it's in an old post office. I love how the garage doors open, like a giant Arizona room. I like the drinks, I like the laid back lounge atmosphere, I like the service. It's a little pricey, but hey, this isn't McDonalds. I remember that I really liked their bruschetta. I've gone to Postinos to welcome friends back to Phoenix and sometimes to say goodbye. It's a great place for both.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2009-05-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5rEuj-G0m8JgdMSSxZ9xhA", "review_id": "K0zWsJ1DXZsjHSeo9dvlUg", "text": "Mmmmmm..... still enjoying my Reisling Buzz, this place was great.\n\nWent here with a group of seven, had a lot of fun.  This place would be a great date place, nice atmosphere.    Bruschetta was amazing, the one with fig, ricotta, and pistacios was my favorite.  The sampler was a great way to try a bunch.  Tuna sandwich was also excellent along with the salad.  \n\nI'm in Arizona for another couple weeks, I hope to make it back!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2010-04-14", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "RyKKn7lV7StxDngkGt_6_w", "review_id": "gM0vmRynUc3tcjgaMfSSVg", "text": "I won't even venture to guess why so many people like this place. But a few notes: no, it is nothing like a European cafe; no, it is not an actual wine bar; yes the service absolutely sucks.\n\nWe came here for a friend's birthday party. Her mother had arranged ahead of time for 10 of us to be there and to have wine brought to the tables and poured and some appetizers brought out while we were waiting for the guest of honor. But before that, let's start with parking. \n\nYou can't park in the residential streets because you need a permit. Fine. I heard they had a valet and there's nothing on their website about parking so, whatever. I head to the valet who asks me if I am dining at Postino's or La Grande Orange. I say Postino's and he says \"Ok, that's $3.\" I asked if they seriously were charging me for valet parking based on which restaurant I was going to and they wouldn't answer. I asked if there was an ATM since I had no cash and they told me there is one but it doesn't work. I got back in my car and drove around looking for a place to park for about 15 minutes. Fantastic.\n\nWhen I get there, about 6 girls from the party are standing at the front waiting for someone to notice them. Finally, a very unfriendly gentleman pointed to two tables and said \"Those are yours. Those other tables where people are eating are also yours but they're not done yet. We told them when they were seated they needed to be done in an hour but they're still there.\" Ok, so now we only have two of our four tables. Great. Finally they seat us at our two tables. Another unfriendly staff member comes over and plunks down a few wine glasses and asks if we want a glass of temperanillo. She pours one of the girls a random taste and then walks away. Upon her return I asked if this was the wine we were supposed to have because it was a Malbec. She argued with me about that for a few minutes until I pointed to the label. She said \"Oh\" and walked away. I never did find out if we were supposed to have the Malbec.\n\nAt this point, the other two tables had been cleared. No one brought any other glasses or put the tables together, so we did it. Also, no one opened the other bottles, and yes they were screwtop, but still. So I opened them. Finally, everyone else arrived. We still only had 4 wine glasses. After trying in vain for several minutes we finally managed to flag down the unfriendly woman and asked for more wine glasses to which she responded, rudely \"We don't have any more.\" and walked away. I had to ask three different rude, uninterested staff members for wine glasses and managed to finally get another few but still, not everyone ended up with a glass. \n\nSeriously? Anyway, the bruschetta came out. While the menu offers a lof of different ones, they are all so deplorably bland and under-seasoned that they felt unfinished. The fig, marscapone and prosciutto should have been good but the poor pig that gave its life was disgraced. Dry, flavorless. Most of the bread pieces weren't even cut all the way through so we were all man-handling the pieces to get them apart. The bread was obviously just grocery store bread and I doubt anything is truly hand-made. The issue is, the quality of their ingredients sucks. They obviously buy the cheapest grocery store crap they can and then mark it up. Everything, even the apples on one of the bruschettas were lacking in any real flavor when they should have been tart and crisp instead of dull and mealy. \n\nAnd as for a wine bar? Seriously. A joke. They have a half of a sheet of paper, one side, as their wine list. No flights, no tastings. But for the audience it attracts who are easily impressed by over-priced glop and wine in a trendy area, they'll continue to do just fine. I will never be back.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 1, "date": "2011-03-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "wFFT3aWlPYP92lFyneonAg", "review_id": "N5vdbo2Rfr2sPk8eX1fkuA", "text": "Having a late night dinner last night at Postinos with two friends passing through town once again confirmed my love for this quaint wine cafe.  Do not pass up the bruchetta.  You can mix it up by choosing four over sized pieces for $12.  I love the arugula/buratta and mozz/basil/tomato but fig and cheese is the winner!  All sans meat but positive feedback on the meat selections.  We shared a generously plated cheese board ($14) and the pub board consisting of fresh pretzel-like bread, spicy nuts, cheese bits and a tasty mustard.  My friend also like their broccoli cheese soup.  I've had the vegetarian panini in the past which I enjoyed although the humus was a little overpowering and messy. I'd get it on the side next time. The salad served with it is phenomenal. \n\nThe wait staff at both locations are great.  I felt bad for walking in 15 minutes before closing last night but I really, really wanted my friends to eat there.  We were greeted with a friendly face and our waiter was very attentive and conversational despite the time. We weren't rushed and were able to enjoy catching up over a bottle of wine and tasty meal on a perfect for patio evening. \n\nDownside is parking. The place was bare last night so that wasn't a problem. Friday/Saturday night is going to be a fight.  Also, they will not take reservations of less than six and WILL NOT seat you until your whole party is available.  Not so good for the group I usually go with but we're all learning to be more timely!  It can be a long wait but worth it!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2011-04-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UXFmzsbt3-vFhryMCA-B6Q", "review_id": "nuDSiylWP1IfU4uBZCvvXQ", "text": "Great. Just great. All the positive reviews say it all.  Great outdoors, and before 5:00, wonderful wine discounts.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2012-03-15", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "J2JfCaiaZku8HgfNceU8Rg", "review_id": "MgLAiq4Hj9E793Hnk0yELg", "text": "Over the last couple of years I have made several visits to Postino, but never for lunch! My visits have always been at night for a glass of wine and a bruchestta, which is clearly what Postino is known for! This time I enjoyed their delicious Bruschetta over lunch with Gabi M. and Lindsey F. I am amazed at how busy this place always is, but not surprised. The service was friendly and timely and that seems to be the standard any time of day.\n\nWe started with an order of the bruschetta and we each ordered entree sized salads, which was plenty of food for the 3 of us. The bruschetta is the perfect starter because of the variety and size. I am not sure if they always do this, but they cut each piece into 3 pieces, making it super easy to share and get a taste of each one! We enjoyed the Burrata and Arugula, the Prosciutto Fig & Mascarpone, the Tomato Jam & Sheep's Milk and the Brie & Apple with Fig Spread bruschetta. All of them were heavenly.\n\nI went with the Italian Picnic salad and it was divine! )field greens tossed with roasted beets, goat cheese, bacon and walnuts topped with crisped root vegetables in herb vinaigrette). Lindsey F. ordered the Mediterranean and Gabi M. had the mixed greens. Everything was lovely!\n\nPostino seems to be a Phoenix classic and it definitely going on my list of Phoenix faves. \n\nI look forward to returning to enjoy their patio over a glass of wine from their fabulous selection and a cheese board.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2012-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Hs5d4_GKTQU83Teof32rdw", "review_id": "Zjf7YrTKa_JP24UQAIOAyQ", "text": "Went here last night for date night. Couldn't have asked for a better atmosphere or better service that just added to a great experience. \n\nWe had been to Postinos before, but never to this location. We sat outside and the lighting of the place was perfect for a romantic night. The service was incredible. I believe our server was Mark. We were in between two types of bruschetta for our last pick and he ended up bringing the other one we didn't order just so we could try it - on the house. It only would have been an extra $4 for us to try, but it was the gesture that really impressed us. \n\nWe will definitely be back again for the food, but we loved the service at this location!!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2013-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "esiQ0ArfEg9KNoe37cwK9g", "review_id": "k2fLd-9FksMThXXzz54t7g", "text": "I love, love, love this place.   The Bruscetta is fantastic.  It is such a great place to go and just relax, grab a bite, wine and chill.  This is one of my favorite restaurants in town.  Try the red pepper bruscetta and the fig & proscuitto it is amazing!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2014-03-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "CYYqPLr23pWQlG3UQFFvCQ", "review_id": "jC4Qzr6Ah1WWVwXFRlQLuQ", "text": "Nice place. Good food tastes fresh and light. No spirits as this place serves only beer and wine. PARKING IS HORRIBLE. Get valet!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2014-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8-mw_aotUGmP0k0s6QKwOA", "review_id": "KIgoHKKn9vHZLP7IwIpxdw", "text": "My favorite of all the Postino locations. The service is always top-notch and the patio makes it possible to believe you're not in the desert. My only suggestion for improvement: make that amazing Roasted Red Pepper Gouda soup a daily offering. Truly the best soup ever.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2014-05-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tdTahKRQiQ56rdDuEwpoEA", "review_id": "Z7UyJr5Vi5AklyseLBsipg", "text": "This place is wonderful. The atmosphere is relaxed. The patio is wonderful on a beautiful day and shaded so not uncomfortable on a 90 degree day like today. $5 wine until 5pm and the selection is magnificent. The bruschetta is just as good as everyone says it is. I had apple & brie, ricotta dates and pistachio, goat cheese and red pepper and artichoke spread on gluten free bread.($16)Totally worth it. It's off the beaten path if you're not a local and totally worth visiting.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2015-04-13", "type": "review"}
{"votes": {"funny": 6, "useful": 6, "cool": 5}, "user_id": "q9XgOylNsSbqZqF_SO3-OQ", "review_id": "n4zKBDfTqrHz9XIyY1bK8A", "text": "Blindly went to Taylor's with a friend on Sunday (had I known where we were going I would have recommended someplace else). I decided to be open minded and give them another try. I ordered an iced tea and the waffle, he got the poached eggs with hollandaise and a coffee. The server took our orders and returned with an OJ for me, forgivable offense - she took it away and brought me back a an iced tea. \n\nThen the incredible wait began... An hour later we finally flagged someone down to inquire on our food. He said he would check for us.. We never saw him again. There was a party of 3 and a party of 6 next to us, they both ordered after us and were almost done with their meal... Both parties were complaining about missing items, I overheard a bagel, a side of fruit and a waitress had all disappeared. At this point I was ravenous and we again went to find our server.. She finally brought our food, and it was horrible. The waffle was dry and tasteless and the poached eggs were drenched in hollandaise, thick greasy hollandaise that looked and tasted like it had been sitting on the plate for ages. \n\nOur horrible breakfast experience lasted 1:40 minutes. Ridiculous. I will not be returning, 3 strikes Taylor's you're out. I left a Yelp card on the table, hopefully they read this an make some improvements.", "business_id": "UxvOXcoCRFRAVhRB0D9imw", "stars": 1, "date": "2009-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Zw2HgpyTgJf-l2yOSWff5A", "review_id": "7HVru7WUmAa1_fw3V-vZ1w", "text": "Had to introduce our OH-IO group out for our wedding to the Maple Bacon Donuts...AMAZING!!!", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2013-03-24", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "y5_vrqIylhXMrejM_-x_vA", "review_id": "_yKEibQc9z2Aq0U1HuS9yQ", "text": "We decided to try this place for restaurant week as they allow you to choose ANY app, entree, and dessert from their menu PLUS a glass of wine for $30. Not a bad deal! \nWe've been to the property before at the Pointe Hilton Tapatio and been to Different Point of View, their other restaurant. This place didn't have the same view but was still very nice inside. It's also built on the side of this mountain so the layout is more vertical with a high bar in the center and table seating below. The decor looks more classic, not hip or trendy, with dark wood, somewhere I expect to see my parents eating.\nWe found the staff very friendly. From the hostess to our server to the food runners, everyone was great. On our servers recommendation we started with the Thai chili calamari and Farmers salad. Both were very good, although the Farmers salad was way too filling for an appetizer. This is more of a lunchtime meal for me as it was topped with avocado and cubes of fontina cheese. I begun to realize nothing would be \"light\" here.\nFor our entrees we ordered the shrimp pasta and the scallops risotto. Both were especially tasty yet loaded with melted butter. The decadence was filling to say the least and I got full quick......but somehow not full enough to pass on dessert. Now how can I be full on regular food but still have room for a whole dessert? Mystery. We ordered the deep dish apple pie with cinnamon ice cream and the chocolate volcano cake. That's right, sweet cinnamon ice cream............melty chocolate cake............excuse me while I daydream...........", "business_id": "Y3a3RkR97J_ReiKgiMXeJg", "stars": 4, "date": "2012-05-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Kdcz7G0l1Fr5SxW3AzGNZA", "review_id": "GWOv4fW-hf8hz4zwN0jzRQ", "text": "Love the bagels.  But . . . Need to have the boxes ready for grab and go. Never seem to have them ready when I get here, thus waiting in line contrary to the program. Bummer.", "business_id": "pNJhovUsGAZ4XqG3lCU-5g", "stars": 3, "date": "2014-04-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6KMcEKXUhUflfi-FL3yLnA", "review_id": "oujqka9cx4FOEW2CpBupKQ", "text": "Decided to come to Einstein's because it was close to the house and I was given a gift card from a student. Big mistake! Customer service was non existent. Not one employee said hi, good morning, what would you like, or thank you. In fact, they all had a look of sheer panic that people would want a bagel on a Sunday morning or they were hungover. We took our bagels to go only to find there a thing spread of cream cheese. I don't think they could have made it any thiner. In fact, we barely even tasted cream cheese at all. I would like to thank Einstein's and their employee for providing me with the affirmation as to why I don't go there. The only reason I gave it one star is because I had a gift card. If you want a good bagel with good customer service, go to Big City Bagels. They are a locally owed business that takes pride in their product and customer service.", "business_id": "IcuPhhH7QCOCT19EDEppEw", "stars": 1, "date": "2015-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "DrWLhrK8WMZf7Jb-Oqc7ww", "review_id": "ThEzWlyMkPoHlJZnttrtLA", "text": "Branched out to the salad world here at Waffle House. Had my second salad there last night and these things are pretty good if your hell bent on staying healthy and Waffle House is your only option. The chicken walnut apple salad was last night's choice and on top of salad mix was a full grilled chicken breast chopped up and walnuts, some apples I believe, dried cranberry and red peppers also. The one salad dressing they include is never enough, so ask for two, but at $7, this salad is a surprise winner and bargain at the House.", "business_id": "sh1-BzB29lIOA2qQ_PxN-A", "stars": 4, "date": "2013-03-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PcTMXEYouXdgkUfJmTbg7w", "review_id": "VGz-aJzrZlUVT85dklvNog", "text": "they have the best breakfast burritos.  they call em \"burro chicos\".  $1.99 I cannot get enough. tortillas made fresh there.  also you get chips and salsa.  their red salsa is the best in the state.  I wish they bottled and sold it.  \n\ncall in your oder because it gets packed fast.  also get a large lemonade it tastes great and the ice they use is like sonics.  \n\nthe service is also friendly and nice.  they keep that place clean.", "business_id": "d2AeNB4xw67E1Bzpo1Pm7Q", "stars": 5, "date": "2014-04-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "NbZcPE2NE1mOGXdYH7vXqg", "review_id": "lJBam1YlPlBWe4ZOX9Q3BA", "text": "seriously, this is the best place in arizona for breakfast. you can't beat the great outdoor seating, fun little market shopping and the mimosas and bloody marys! what makes this place pretty special is that they grow a lot of the veggies right on property.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 5, "date": "2008-04-18", "type": "review"}
{"votes": {"funny": 17, "useful": 5, "cool": 1}, "user_id": "iwUN95LIaEr75TZE_JC6bg", "review_id": "KN551grNx6iMbgarDe9ndw", "text": "Four stars for the food.\nAnother cumulative star for the service, making them a solid five.\nThat was before we checked out.\n\nMinus five for their not having a defibrillator anywhere on site when my heart began missing beats right after their informing me how two cups of turkey soup, one half sandwich, a whole sandwich, two iced teas, a cookie and a small slice of bread pudding came to forty-seven bucks.\n\nI must have appeared to the cashier as a mouth-breather and to everyone else in line when I stood there, frozen, vegetatively reverberating;  \"huh....forty-seven bucks...really...how is that even possible???\n[head shake]\n\nEventually, my friend's laugher brought me back. \n\nBut it was my turn to pay for lunch, so I couldn't tell them to stuff their forty-seven bucks and walk out. This place is in the middle of BFE, with nowhere else to eat except the desert, and I don't care for cactus or rocks...so I sucked it up\nand did the only thing I could do under the circumstances.\n\nI sat there eating my lunch....fixating on how I'd just blasted through one fifth of my unemployment check on a fucking turkey sandwich. \n\nNot going back.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 1, "date": "2012-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xWM7pyZFUAdrVbWGG7Fhiw", "review_id": "bON6SlfAbTOXILZv1DgC2g", "text": "Great little gem!  Stopped for lunch.  I enjoyed the Tuscan sandwich and a lemon bar.  Both were fantastic!!  it was $11ish for the sandwich but the portion was large.  I brought home 1/2 the sandwich.   All fresh ingredients.  All sorts of desserts to sweeten your visit.  \n\nThe atmosphere was super relaxed and anyone of any age would find it enjoyable.    There are picnic tables under the trees and tables with umbrellas.  \n\nI have always said that I don't mind spending money one something that is quality and super tasty.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 5, "date": "2014-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vowYsEJtC2Vq9A1Y-XgLSg", "review_id": "zi9wwWMSz5LpWATVgHu1zQ", "text": "Just attended the bid band special event.  We were disappointed the the picnic basket venue along with the additional production charge for this particular venue.   \nBased on our experience, we will no longer attended their future \"big bad\" events.  There was relatively minimal value.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 1, "date": "2015-03-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ma-FYIYFuXTn3a_w_trYHg", "review_id": "bYf6NeKS2k3-r9NemdEiAQ", "text": "Seriously everything about this place is perfect other than it's closed for the summer. I will eagerly be counting down the days until it opens again in September. Great place for groups and kids and dogs! I loved the breakfast burrito I got. They mixed some type of beans with the eggs to create this eggy-beany deliciousness. I got some apricot preserves and a butternut squash creme brulee to take home and they didn't even survive one day before I devoured them.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 5, "date": "2015-05-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "ZC49A1K-if7KP8VJXoqELQ", "review_id": "NGxjQqAAuQvwJwiIY0rJDg", "text": "I'm voting this little gem as the best breakfast & bagel shop in Ahwatukee!  The staff act like share holders and treat everyone like their thrilled to serve them.\n\nThe food is excellent and I love the newly redecorated space.\n\nWe enjoyed a Two x Four, and a Chorizo Burro and while the Chorizo could have had more heat to it, everything was perfectly prepared right down to the grilled tortilla on the burro.\n\nThanks Nosh for stepping up!", "business_id": "8H1DwdAAgSBtwDeb2R-hmA", "stars": 5, "date": "2013-05-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "exwfqNpOc1Lybh2gO-ApCA", "review_id": "hHYv4GONGt7FRUZQTjCgjg", "text": "Tough critic from the East Coast but this was a great spot for a delicious bagel or bagel sandwich. Sad im leaving tomorrow or I would go back again. Sesame bagel with honey but cream cheese= heaven.", "business_id": "8H1DwdAAgSBtwDeb2R-hmA", "stars": 5, "date": "2015-04-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "hZyULZSVMl4V03Rcj-_Xug", "review_id": "y73nqr1WhUeijJ5oxTEk0Q", "text": "Slow service!  Crunchy pancakes?  What happened mimis? Used to be good.  They also recently changed their menu, with my favorite sandwich gone!  Never again.", "business_id": "NX5YHSIyesufcsI7Rg5NLg", "stars": 2, "date": "2014-03-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "vqsMVqsWZT6XZpq8Tlc43w", "review_id": "T4Y4dpQc5UdHbo3Oj-FUwQ", "text": "LOVE LOVE LOVE\n\nMake sure you get the carne asada tacos with the corn tortillas and red sauce. They are just about the best damn tacos I've ever had anywhere. They are pretty small, even for street taco style, but I don't give a crap. I could pound 9 of those things in one sitting no problem and not have any issues. I also had a carnitas taco, which was good too but the carne asada is hands down the way to go. I also had a carne asada burrito, which was okay, but the flour tortilla was kinda bootsy. Stick with the tacos! Also, the staff here is SUPER friendly and the food comes out in a timely manner. \n\nHere's the kicker... I'm from California and was just in town for biz. I know Mexican food obviously so this stands up to any of the joints around here as well. I ACTUALLY ORDERED 6 TACOS TO GO AND TOOK THEM HOME WITH ME ON THE FLIGHT BACK TO CA. That's right, the tacos are that good. My girlfriend tried them, even a few hours old, and said they were delicious. Of course, getting them right off the grill with the tortillas with a light crisp is the best way to go!", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 5, "date": "2011-03-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E7pQvEw9tf_wxIRMWxCtNQ", "review_id": "VTZgeExSEWAGxmV3xAUeHw", "text": "Big fan especially when I have a hankerin for burrito. Easy to carry out, we love to eat at home with the dogs. A street taco is sometimes just what the belly wants.", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 4, "date": "2011-05-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M0c0BPjz3_Xb8Aiw_R0L-w", "review_id": "Ct_DjuLt8KzD-UimZY7jaQ", "text": "This place is awesome! Very authentic Mexican food. Whenever I am on that side of town we always stop here. My favorite are the carne asada tacos. They have great carnitas and horchata here too! A bit small so if you are going for lunch get there early because sometimes the line is out the door.", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 5, "date": "2013-03-20", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "LuSRB7svpKp0QJxAoMfMBg", "review_id": "yGgnFmccEhxm_ijYt4jX0w", "text": "My favorite taco spot, period.\n\nI usually eat 7-8 (street) tacos in a sitting....the carnitas, carne asada, chicken are my favorites in that order.  Rice and beans finish the job nicely.\n\nI brought a coworker from Costa Rica here.  He didn't like the food in ANY of the local restaurants I took him to because none of the meat had the great flavor he was used to...except for this place.  He was horking down 12-15 carne asada tacos in one sitting!  Insanity, but a testament to how good their food is.  \n\nFive stars, every time.", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 5, "date": "2014-04-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1No5kVLGQ4ipIdtidKwMpw", "review_id": "rz106roNHSHW31x3_jaBxQ", "text": "I was actually looking for a new taco Tuesday spot. Though they had what I was looking for, $1 tacos, I ended up getting the carne asada burro.  It was very good, just big enough to fill me up but not so big that I had leftovers. The meat had beans mixed in with some kind of a smoky chipotle flavor, and bites of red onion and cilantro. I went at lunch time and it was very busy so make sure to give yourself some extra time.", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 4, "date": "2015-03-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z1ZHXezKpYPxevUuGKFpng", "review_id": "fvaUTtOaWeNLbN1JI2P7XQ", "text": "Loved the food and the price.  Great Mexican flavor and very hearty food.", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 5, "date": "2015-04-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ROr4DQ-gxlfUKmiDC-qSEQ", "review_id": "eNpvZnqAC4GPKBYuiWZHuA", "text": "I've been a fan of Cracker Barrel, my first intro to it was back in Roanoke, Virginia where I had the chicken fried chicken, and had their fried apples. I really like their fried apples coz it reminds me of the wholesome, and slightly sweetish tart of an apple pie filling. \n\nAnywho, recently went to brunch at the Cracker Barrel and ordered the Country Boy Special, an $8.99 deal with 3 eggs, a choice of country ham, pork chops or sirloin steak. I chose the pork chops. It also comes with the hashbrown cake, fried apples, grits, gravy and two biscuits. A whole lotta food but worth the deliciousness and calories. \n\nI have to admit their pork chops are tender and yum, I've always heard good things about the pork chops in the past. Apart from that liked the gravy and their soft and warm buttermilk biscuits. I was stuffed, and had to take home my fried apples which i do love alone or with some vanilla ice cream, the perfect afternoon treat! Overall, if you'd like yum country food, this place is good even for a chain!\n\nOh and depending on the month, ask if they have their awesome coca cola chocolate cake... it's YUM!", "business_id": "dGcVT0WGenhh8Np76ta6AA", "stars": 3, "date": "2010-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "H_JsAwjiGEOr_RlZmwfNsA", "review_id": "kSUAuBKc6jNNWShflmvBOA", "text": "There is no way this place can be healthy! But it was a hearty way to start off a busy work week. I had never been to a Cracker Barrel before. Crazy, right? The little shop was interesting. I didn't find anything that I just HAD to have, but there were some cute little things in there. \n\nNow on to the restaurant. It seemed too crowded and I was a little unsure where to enter and exit the establishment. But overall the food hit the spot and I thought our server was very sweet. The dining experience was decent, but I think I'd rather opt for a less cluttered place with a healthier, menu full of local and fresh items in the future.", "business_id": "dGcVT0WGenhh8Np76ta6AA", "stars": 3, "date": "2015-03-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dUDzN6zl3j12zhByOrnF9Q", "review_id": "qK1NyyDLkB9TkU1hr6aN2A", "text": "This place is always busy and if you come to late in the day you may find that the bagel selection is... well, it might suck my after the lunch rush.  The food is good and the manager is friendly.... but I'm always a little disappointed in how often I see the employees talking among themselves instead of getting the orders out.  I also don't like to see how messy the floor is behind the counter- they could use some extra umph in the cleaning department to keep things looking sanitary.  The bagel crumbs and crumpled napkins that often litter the floor behind the counter is a definite turn off.", "business_id": "IYWTOj970XqG2z9Xft_8SA", "stars": 3, "date": "2012-04-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "mnWPXt3Fby6rH_3K6Ini5A", "review_id": "FMIUAp7Xatw8ZFZXb4tcXA", "text": "I love this Good Egg location. The food is delicious, the staff is friendly, and the pancakes are the best around. Great place for breakfast or lunch.", "business_id": "8aPTQeDYOMNEu907WfflCQ", "stars": 5, "date": "2013-04-21", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 0}, "user_id": "i2TRnWtvxxwJuynRKrw35Q", "review_id": "-RIHHFlgj-kDwfB7AJvN7Q", "text": "When I ate here yesterday it was my worst \"dining out\" experience of all time.  Then I went out to eat tonight, so we will say second worst dining out experience of all time.\n\nWe were greeted by a very lethargic and disinterested hostess.  She took us to a booth about 3 feet from the door.  I think it was because she was too tired to walk any further.  Her voice was barely audible, zero eye contact, and a thuggish-looking boyfriend? of hers (definitely not an employee) was hanging out behind the counter waiting for her to come back.  \n\nOur waitress then came along and asked what we wanted to drink before our butts even hit the crappy booth seats.  We both looked at her blankly because we are not \"Diet Coke\" drinkers.  We liked a variety of beverages and wanted a moment to think.\n\nShe left and came back at least 10 minutes later.  Okay, I wanted to glance at the drinks before I ordered - not memorize the menu.\n\nShe was one of those waitresses that thinks you are college buddies.  She tried to take our order without writing it down.  She failed.  She asked a person passing by, \"Do you have a pen?\"  Then she laughed and said, \"Yeah, I can't remember this.\"  Then she repeated our order back to us - wrong.  \n\nOur food came out in a pretty timely manner.  Too bad it was GROSS!\n\nHusband's:  Grease-dripping, flavorless hamburger.  Cold fries that tasted like mashed potatoes with nothing on them.  \n\nMine:  Tomato basil soup so old that the oil had separated from the soup.  The grilled cheese I had asked for without bacon came out WITH bacon.  She caught that.  Said she would have them remake it because it only takes a minute.  It came back out MOMENTS later - cold and with little bits of bacon stuck to it.  How convincing!\n\nAs we were leaving the hostess came over in a timely enough manner, but then literally FELL ASLEEP while she was ringing us out.  Her eyes closed and she was swaying.  She opened them and APOLOGIZED, saying she was \"so tired.\"  Again, barely audible.\n\nFood:  Awful.\nService:  Awful.\nProfessionalism:  Awful.\nCleanliness:  Awful.\nOveral experience:  Awful.  \n\n$30 for dinner for two.  Seriously?!", "business_id": "dbh72sNyNeHUgJqQye9Vbg", "stars": 1, "date": "2011-04-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ikpYORjarQRqd5-obE0fnQ", "review_id": "obqSjKuFRJZlJJHjzxgWUg", "text": "First time going to Denny's. Our server was great, the food was great, the place looked nice. Would definitely recommend.", "business_id": "2D7amHyeakOVlsSywblMkw", "stars": 5, "date": "2014-04-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cGywb-Tkz6uoJgbkfED0Ew", "review_id": "AmKPGU6UwnHXlTTWfBYn6w", "text": "We went for breakfast this morning and had a wonderful server ask for Nikki best service with a smile and food came out so quick I would recommend this location to anyone .", "business_id": "udyeC0A16GWcSas7L5hwHg", "stars": 5, "date": "2015-03-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Irkc0zZLh4Zte5o2Z_i8zg", "review_id": "jGKq9jVXDYZsafESM85PJQ", "text": "Really enjoyed it. We were starving, the three of us left to go exploring without a proper breakfast and by about 11:00am were ready to start chewing on the seats of the rental car. We found this place food came out fast and all was right in the world again. We all had French onion soup, my wife had a grilled cheese, I had a burger and our friend had some kind of chicken sandwich thing. Everything was cooked right, no complaints which is saying something for our hungry little group. The manager came around and gave us a couple free muffins to take home since it was our first time there. We also got a 12 pack of croissants to go that were great, insuring that we had a little more to eat before we left in the mornings for the rest of our trip. This place was exactly what we needed, a nice little discovery.", "business_id": "qLXxp0rpzT4kG9tT3wZwfA", "stars": 4, "date": "2014-05-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "IldNKx5L8unlcv3LBSs-_g", "review_id": "4Vdt5wOsCWoMXGEvWpKWJw", "text": "My favorite breakfast spot in the East Valley. Crackers is hidden away in an industrial park, but it's worth tracking down. You'll forget that you're parked behind a Home Depot once you get inside.\n\nThe staff is professional and friendly, and the wait is usually minimal, even on busy Sunday mornings. This is a fantastic place to take your out of town guests, but please leave your kids at home. They're welcome there, but they annoy me.\n\nI generally order either the breakfast sandwich (canadian bacon, scrambled egg and cheddar on a fresh croissant -- always perfect), or the traditional breakfast, which I transform into Andrea's Personal Breakfast special by making 8 special requests. They'll add pretty much anything to anything (if they have it) and make it any way you want. Amazingly, they rarely get special orders wrong.\n\nThe portions are huge, but the quality is good. Fruit is always reliably fresh, and if you like sweet, unhealthy breakfasts, try the french toast. It's more of a dessert than a day-starter.\n\nLunch is as good as breakfast, though my experience with there lunch is infrequent. The soups are outstanding and a definite must-have for lunch.", "business_id": "2nzUx_M8Szyzsf4CszHasw", "stars": 5, "date": "2009-05-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zwEGISQ6K85t4xOJQ3vOyQ", "review_id": "sJ3u1aIoBsFXFuw7WUi9pg", "text": "The coffee is awesome!!  And so is the breakfast!!", "business_id": "2nzUx_M8Szyzsf4CszHasw", "stars": 5, "date": "2013-04-18", "type": "review"}
{"votes": {"funny": 2, "useful": 6, "cool": 4}, "user_id": "rEPsHBYyuSVm4W3a8u0Wmg", "review_id": "ZITMx9sjaQhx7vY1x24P2w", "text": "One of the best breakfast places here in the East Valley.  Excellent quality, monthly specials to die for and fantastic service.  \n\nWhen we walked in, we were told today \"20 minute wait.\"  Less than ten minutes later, we were at our table.  My point?  Under promise and over deliver = standard operating procedure at Crackers!", "business_id": "2nzUx_M8Szyzsf4CszHasw", "stars": 5, "date": "2014-05-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JAx5qtgCUsv1rDpxEQM68g", "review_id": "W6r262JAc7JYJNnr9BOoRw", "text": "Unbelievable food service and courteous..portions more than adequate everything is done from scratch and fresh. Would come here over and over and over.  HIGHLY RECOMMEND.. Have had lunch and breakfast... Yummmmmmm.", "business_id": "2nzUx_M8Szyzsf4CszHasw", "stars": 5, "date": "2015-05-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "ngqEHNd1cJZVBl0nhR0Khg", "review_id": "oG578rATir5QTK-Riae9cw", "text": "Sorry folks, but this place needs a major renovation. It could be a cool '50s-type restaurant if they would spend a little money to clean it up. The food is greasy, and some of the waitresses are sporting tattoos and multiple piercings - a major turnoff for the food industry in my opinion. Try Big House Cafe down the street if you want a good breakfast at a good price in a clean environment. Pass this one by.", "business_id": "T9BPnYNKtk6B42W0cJJXnA", "stars": 1, "date": "2010-05-22", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 3}, "user_id": "wpu_Nj9orL8HkChgv7peMA", "review_id": "tNf_JNAy5wpg1HE8PF0wSw", "text": "This is a diner modeled after diners in the 50 ' s.  We sat at the counter and all of the staff gave us a warm greeting. Big menu with a bit of everything! We sat at the counter and saw quite a few of the dishes, making my decision that much harder. I had the chorizo skillet and a side of the green salsa.  Great kick in the salsa and love that they use beef chorizo.  Everything was good and fast!  Our server Sophia made our day! She was so sweet and very helpful.  You could tell the entire staff work well together and really liked each other.  Great customer service and really good diner food.  Not crazy prices either, I mean what more do you need? \nDiverse menu, great prices and awesome staff.  Thank you for making us feel so welcome!", "business_id": "kNnk3xy9eb4ym8nljQUGlA", "stars": 5, "date": "2014-03-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Zq_YuMfMNcQdpxi-Wf9OXw", "review_id": "H_8NGQR2RyQ2-S_hbmiz3g", "text": "If you're looking for an authentic Mexican joint, this is a pretty great choice. The service was great, the staff was friendly and the food was super tasty! They even had the nondescript red and green hot sauces, a sign of any great authentic Mexican restaurant.\n\nWhen you order, they bring your drinks out to you once you sit down, along with some chips and fresh salsa. They also sell soda imported from Mexico, made with real cane sugar! You haven't had a Coke until you've had one made with real sugar, let me assure you.\n\nI went with the chicken fajitas. The food came out very hot, the tortillas were quite warm and it was all very good. The chicken was some of the most tender chicken I've ever had, no joke. It was seasoned really well and was just amazing. My girlfriend got the carnitas burro and was very happy with it, but she agreed the chicken is where it's at.\n\nWhen we went in, it was about an hour to close, so the place was mostly dead, which may be why our service was so good. But, they seemed to genuinely want to make their customers happy, so I wouldn't be surprised to see the same level of service when it's busy either.", "business_id": "qgJZUKNVY-LbGKk6XEP3JA", "stars": 5, "date": "2010-03-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HpKLR1mrb634jCnTXQr3aA", "review_id": "WOckISbR5P5g4j2qyKx9qQ", "text": "A cute little cottage close to the Chandler Fashion mall.  When I enter the restaurant I get a homey feeling which scream: Mother/daughter date.  My favorite part of this restaurant is the breakfast food.  Lunch/dinner aren't that great to mention.   However they do have coupons for dinner which give you starter, entrée, and dessert for a good price.  So for that reason only I would go for dinner.  \n \nNow on to the breakfast.  The meals come with your choice of juice and some even come with a muffin.  My favorites on the menu are the eggs benedicts.  For the original: the flavorful ham center the dish.  It's a bit tough for me and the saltiness overpowers the dish.  But it does add a nice contrast to the gooey egg and sauce.  I would say the eggs are \"over-cooked\" for egg's benedict compared with some other restaurant.  I would've preferred over-easy or even over-medium eggs insteads for an eggs benedict.   The hollandaise is thick enough so that it isn't runny that would drench the dish, however still thick enough to have that creamy consistency.  I wish it had more flavor though.   It comes with red skin potatoes on the side.  With just the right amount of salt, it complements the eggs benedict well.  Try the florentine, and crab cake florentine eggs benedict for a twist on an old favorite.   \n \nWake up early for breakfast or brunch for an eggs benedict and shop 'til you drop at the mall after you have satisfied your tummy.  However don't expect too much from this mediocre restaurant unless you have a coupon. :D", "business_id": "-6Roo-EHgSdUa4rP3tWyRw", "stars": 3, "date": "2011-05-15", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "IsvpOkTel_AWtGTAapM6XQ", "review_id": "KHNGptG0u5mkrnSgExcH6g", "text": "This is one of the best places to get breakfast in the area. Service can be hit or miss, but the food always makes up for it. They have an extensive menu and lots of different kinds of omelets. Its vegetarian friendly-a plus, and lots of healthy options. Plenty of unhealthy ones too, so feel free to indulge", "business_id": "oSDf6BHiMlKGZdFFmIo6NQ", "stars": 4, "date": "2012-03-10", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "3ONPPazUH-Q3XblYJIaA1A", "review_id": "nwxUQtPAIxij5rmnDF8urg", "text": "I have been to Wanda's about 4 times since moving here and always enjoyed it.  I wouldn't classify it as an overly greasy , greasy spoon.  I think it's a very comfy place that reminds me of little Mom and Pop's from back east. Since I seem to stick to the breakfast MO... it's been good each time.  They have good diner coffee, nothing exotic, nor was I expecting it.  The waitresses are all very nice, with just the right amount of chattiness to make you feel at home, but not too much.  My breakfast today was a mushroom and cheese omelette + spinach.  My plate of food was huge and very tasty and with Coffee and Tax only $10.  I'll have to stop by here more often.\n\n- Mushroom and Swiss Omelette + Spinach", "business_id": "bEQjf7c-9qkNWgXvriSGZw", "stars": 4, "date": "2012-05-07", "type": "review"}
