{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZDsneygztCiyFpkwSV0oTQ", "review_id": "IUYveEOsY2eiwdGvmcBWcw", "text": "As someone who doesn't wear glasses on a regular basis, I don't really care where I get my only-for-computer-non-glare frames and lenses. That being said, when I scratch my eye and have a splinter stuck in my eyelid I DO care where I go.  When that happened today my options were to pay a copay and a big fat co-insurance bill at an opthamologist's practice OR stop by America's Best to see if they could at least help a little. Not only did they help, but Dr. Robert Runser had me in and out in less than 10 minutes, to the tune of $30 and a free bottle of eye drops.  He flipped my eyelid, grabbed his foreceps and was done with it before I had a chance to throw up. I also go to AB for the aforementioned glasses and have always been welcomed with a huge smile by one of their friendly staff members as well as a quick and efficient appointment.  I can't say enough about this staff or this doctor.  Don't let the big chain name fool you - America's Best provides good service at a great price.", "business_id": "gX96CYY9T3K-jiippnnXDA", "stars": 5, "date": "2015-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0SaYjiFRGbTjXucflO2paw", "review_id": "7I-DJ3cdq9HJl0pfItPZDw", "text": "My regular eye doctor is very concerned about a condition that I have that could possibly be very serious and referred me to Charlotte Eye Ear Nose and Throat for further evaluation by a specialist asap. When I called Charlotte Eye Ear Nose and Throat to schedule a \"first available\" appointment, I was told I would have to wait a week, which I found frustrating but understandable. When I arrived for my appointment I waited over an hour just to be brought back to a room (again, I work in healthcare so I understand). But what made me SO MAD was when I was then told that their staff member who had scheduled my appointment on the phone was \"just a call center person who didn't really know what they were doing\" and scheduled me for the wrong type of specialist. The doctor I was wrongly scheduled to see refused to see me, because they didn't think there was anything they could do to help. My frustration is that I waited a week for an appointment that was scheduled with the WRONG doctor with a possibly serious medical condition for which I will now have to wait even longer to be seen for. When it comes to something which has already caused me so much anxiety and my desperate need for some answers, the fact that I spent a week worrying and waiting for an appointment that never happened and that I now will have to start the waiting process all over again is incredibly frustrating. I understand that mistakes happen, it's just unfortunate when it comes at the cost of patient care. The manager assured me he would call me the next day with an update and try to get me in to see a specialist sooner. He did not. It took several days, numerous phone calls, three voicemails, and an email to finally hear back from them. They scheduled me an appointment with a specialist two weeks out. Then a day before my appointment they called to tell me there had been an emergency and they needed to push me back another month and a half (again, emergencies are understandable and I get that those cannot be predicted or controlled, but essentially I feel that they are just not listening to me, or my doctors, and just don't care). The MAIN problem with this organization is that there is TERRIBLE communication between staff members and doctors. Needless to say, I saw a doctor at Horizon Eye Care yesterday, who is able to get me in to see a specialist at Horizon within one week. I'm taking my business elsewhere. If you are thinking about using Charlotte Eye Ear Nose and Throat for any eye problem, I STRONGLY recommend you avoid that clusterfuck and just go to Horizon Eye Care instead!!!", "business_id": "UOLNw0-7GjxomFQiHUXisA", "stars": 1, "date": "2015-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Uq-31bK7TPLVfqIveY58jw", "review_id": "fxHNtKIuOg1b5ftXzSXBCA", "text": "My daughter has been going to Dr. Plotnik for 10 years and I cannot imagine going anywhere else. He is kind, professional, and takes time for each patient.  All the staff are exceptional as well.  I highly recommend him as your child's eye Dr.!", "business_id": "h3tDZ2TBw7w_W9bA2cR2DQ", "stars": 5, "date": "2014-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "ZiMCaIaUlBmVnNjREY0W6Q", "review_id": "Yp3ZWFGP5D83-V1-gt_7OA", "text": "In all seriousness, if I could give Phoenix Skin 10 stars, I would without a moments hesitation.\n\nPhoenix Skin's attention to detail and commitment to a fantastic patient experience starts from the moment you step into their beautiful, modern, clean waiting room. I have had a battery of treatments (surgery, rashes, dry scalp, mole removal, laser hair removal, botox, aesthetic treatments and on and on...) there and every single experience has far exceeded my expectations.\n\nDr. Laris' bedside manner is second to none. A couple of years ago, Dr. Laris performed an otoplasty procedure on me. He took the time to explain the process and technique and answered all of my questions with the utmost of care. The outcome was not only natural results, but a boost in confidence after a weight that I had carried around my entire life had finally been lifted. From surgical procedures to botox injections (shhh...), Dr. Laris' skillful hands deliver tasteful, natural enhancements that make you feel like a better version of yourself.\n\nHis staff are equally amazing, which is no small feat! From the front desk staff to the nurses and PAs, everyone treats you with the utmost respect. I've been seeing their aesthetician, McKenzie, for laser hair removal treatments for a while now and I can't stop going back for more once I finish an area. McKenzie is very attentive and has a bubbly personality. She's helped me clear my \"bacne\" through a series of peels and treatments. Her services have also improved my quality of life immensely!\n\nLastly, I recommend Phoenix Skin to all of my friends and family. My mother had skin cancer removed from her lip by Dr. Laris and countless friends of mine (including my husband) have been getting their once-thought-it-was-the-best-idea-ever tattoo removal done by Caitlin and their state-of-the-art PicoSure laser. I would highly recommend this practice to you and your loved ones, too.", "business_id": "1_ksgP_VSwFx0yBUAV3T4A", "stars": 5, "date": "2015-07-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "qz0h4yH_l-KvNc7IMKBptw", "review_id": "WILIKoIxBeHjmb1bVwCrEw", "text": "I hate coming here, the receptionist seems mad always, she has a rude tone and makes you feel like you are annoying her.  I only cone here cus I'm leaving in a couple months but lawd this place needs a new crew not to mention dr. Kramer can be a rude one! I can tell he got irritated when he knew I had to be refered out..... read riviews in the end we make him business and his staff gets paid because we the patients bring business.... hmmm maybe they should think about this", "business_id": "9zlpLPhXYwK_STi2u8DjxQ", "stars": 1, "date": "2014-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LABKzJqIEuzXmmik8AUi8g", "review_id": "Fhnrcezk8_D5ikwkubHSFg", "text": "I went to see Dr Cherkuri for an initial visit. I found him to be knowledgeable and empathetic. They looked busy but not rushed. The staff was overall very friendly and seemed to want genuinely talk to you. Overall it was a good experience.", "business_id": "gVEtYzzezWoy1Jfvtv3ZLg", "stars": 5, "date": "2013-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KCcITVNlo_MGFF6kSAqhEg", "review_id": "7FPpuHKCa3QWqUlJQ61PQw", "text": "This is a wonderful office with caring and kind staff. I always felt comfortable with them and I can tell that Dr. Gunnala and her nurses are very experienced and knowledgable. They return calls, call when they say they will, and always had our best interest in mind. They worked with us on the cost as much as possible and were great with working around our work schedules. We have moved and I am so sad that I now need to find a different doctor.", "business_id": "Y68Ysab60gJhX7YBjESgBg", "stars": 5, "date": "2015-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "KLekdmo4FdNnP0huUhzZNw", "review_id": "kafv-yA_QVAa3JqKqCSNOg", "text": "This practice is made up of several orthopedic doctors. I see Dr. Bruns. I have been going to him for years for various things- and am always happy with the outcome. Last year I had 2 total knee replacements (I call them January and June)  and now I am a new woman. I have no pain and can walk without any problems and no limp. Rehab was tough but not compared to living with the pain I was in. At least I knew there was a light at the end of the tunnel. When I go to my appointments I have my questions on my notes app ready to ask and Dr. Bruns is always happy to answer all of the questions I ask him.\n\nI must also compliment his assistant Julie. She is the best. She always explains everything you need to do or how to use anything you are given. I especially like that the practice has their emails on their websites so if I have a quick question, I can send her an email and not wait for an appointment. She will either get me the answer or let me know what to do.\n\nLastly, one of the other doctors in the practice had to have a knee replacement and he chose Dr. Bruns to do it. That says something.  \n\nThere are also 2 offices. One is on the NE corner of 56th Street and Bell and the other is on 7th Street, north of Thunderbird on the west side of the street. I put the same review for that office as well.", "business_id": "PzMU15mDNyXeH8p4_qm9PQ", "stars": 5, "date": "2011-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hpVH_OPOPnkYwBAqQXwz8A", "review_id": "8ZuDTXTuyl9FozojyHbtew", "text": "I read the other reviews and only wish I had read them before taking time out of my own day to show up at Entegrity for an appointment. I had taken my daughter to Dr. Bailey in May and Thought he was a good doctor. He wanted to get another CT scan done on my daughter since it had been over a year and was done in California by another doctors office. The office was to call and schedule but never did. I, in the meantime needed to get in myself and scheduled an appointment. Once at the appointment in the waiting room, the office staff said they needed to verify my INSURANCE. they called my insurance and the office staff lady claimed that my Insurance was not in their network. She also claimed to have spoken to the office manager about it and unless I wanted to do a self pay, I would be unable to be seen that day. I called my Insurance company as soon as I left. They told me that they told the front office lady on phone , that they just needed to fill out a pre certification form and whatever balance they did not cover could be billed to patient. Shady? Yes. Dishonest staff as well as completly unable to follow directions due to they not wanting to actually take the time to do paperwork, also very shady. Plus, the office was only concerned that they  may not get paid by patient if a balance? So many things did not add up. My Insurance made notes regarding matter So I can pursue getting answers.  the funny thing is, I made 2 phone calls to the office manager and she has yet to return the phone calls. I suppose they are only at their jobs to collect their paychecks as they run the Doctors business with potential patients into the ground. I would not recommend going to this office only because of the lazy office staff. I feel sorry for the doctors that will and have lost patients due to the carelessness of employees.", "business_id": "e0B-vLvKxGiGV_pTT7vwcg", "stars": 1, "date": "2014-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_MTCi3kI-Gw6gti2juyyKQ", "review_id": "o8WOTgfNzM9bgXQOthjcJQ", "text": "Avoid this place like your told to avoid carbs, sugar and sodium. Set up an appointment for a physical at 11:20. Arrived 10 minutes early. 2 hours spent waiting and still haven't been called. This place is a joke. Never again.", "business_id": "C-eUCr7R-76YFPpdpMj_vw", "stars": 1, "date": "2015-08-24", "type": "review"}
