{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "b6xBiEt5iQ_HZ41Qh_ZNIA", "review_id": "LljW5C0T-X-wNvU665Ggkg", "text": "Best gryos in Pittsburgh in a little shop with a lot of Pittsburgh flavor! Potomac is street parking with meters, so it can be a little hit or miss sometimes, but mostly its not an issue. They do delivery, always have a game on in the shop and are super friendly. :)", "business_id": "PSlOtPIo28BvWOzdLmRRRQ", "stars": 5, "date": "2010-06-01", "type": "review"}
{"votes": {"funny": 4, "useful": 9, "cool": 5}, "user_id": "6xS41eiB_7MHNjT411-0Cg", "review_id": "_N-EMRda0AtNrsbZCNvtzQ", "text": "This place is a run down, out dated, hole in the wall restaurant with slow service and creepy decor.. and it's fabulous. \n\nWhen you walk into the Christos, don't expect to be greeted- you won't be (unless someone pulled you in off the street). Plan on walking to the back to find someone who may or may not seat you, or you may be told to sit wherever you want.  I would recommend sitting outside, although not your typical \"patio seating\" ambience,  it's (in my opinion) the better option. It's teeny tiny and super old school. The menus are old and messy, but you're not eating those anyway, right?\n\nSo all of that aside, Christos is a really fantastic little family owned authentic Greek place that serves really great food. They serve it slow, but they serve it good!  I ordered the hummus and pita bread as an appetizer  (yummm) and the Greek Pizza as my meal, and it was so good! I really loved it, and you can't beat the prices. My lunch was all of $12, and I ordered a soft drink, an appetizer, and a pizza that came with a salad... and it was good! \n\nThe point to me pointing out all of the negatives first was that you can't ignore the obvious and pretend it doesn't exist.. truth is, all that stuff is true. But if you're prepared for it and willing to overlook it, you will leave pleased. Just keep in mind that it is a family owned establishment- there's no advertising, no sponsors, no corporate funding.. don't go in expecting top notch service, or hip decorations. But do go in expecting genuine, sincere service and great food. Give Christos a chance, maybe it's your thing and maybe you can't get on board, but I will always look past an exterior for good food and to support a local business!", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 4, "date": "2015-08-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "W5s_JkOORSsJh4-JXRTJXA", "review_id": "Ba_0LCY7YBwv529XMq4uvw", "text": "Awesome fish fillet sandwich. I've had many things on the menu but the fish fillet sandwich is my favorite. Everybody is friendly and couple of very pretty waitresses all add to the dining experience. Try to avoid lunch hours as this location gets packed very fast.", "business_id": "8PsQqhrAH5uqJ7HODOmXYg", "stars": 4, "date": "2015-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jAvzJLK7WLffDCrUUx2C4Q", "review_id": "xJbbh0dEXmXtT5NPzyg0kQ", "text": "Great.  Never would have expected greek gyros driving by the place.\n\nWe had great service, all the food was delicious and down to earth.", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 4, "date": "2012-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RYopM3wT5SfJ_5sDr_HPAA", "review_id": "LOCX-elXWaqzI45tv3J8LQ", "text": "The best gyro's in town , I recommend it highly!!!!!!!!!!!!!!!!!!!!!!!!", "business_id": "UrxAu3jjRM_u6iQXDPzkSQ", "stars": 5, "date": "2014-06-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uj-70y8y-eDCbDX67TK7yQ", "review_id": "BQ_56Z9YNhq7DoPcgYQ8_A", "text": "Visited again today (6/4/11) after several months of not eating at Paisley's . I had the pleasure of trying out their Hummus Platter (I usually order the Hummus Sand-which, but it's such a large portion I can never finish it!) and I was instantly in love with Paisley's again! Their hummus was so delicious, full of flavor but not overwhelming, that I had to thank our server for her wonderful service and the amazing food. My only complaint would be that they do not offer wheat pitas (though they can substitute for multi grain bread, focaccia, or sour-dough).\n\nMy sister always enjoys ordering their Tuna Slam Sand-which (excellent mix of albacore tuna, mayo and greens without the overly intense mayo flavor), and my husband tried their Panini Cubano. Both enjoyed their orders, and my husband raved about his panini. \n\nI love Paisley's atmosphere, choice of music and unique decor. The service can be a bit slow, but you can't rush delicious food. The food is well priced and their meal portions are adequate. The best part of their menu is definitely the abundant number of vegetarian meal options!\n\nWe can't wait to go back!", "business_id": "IceZ4BtTz76eppjNWm-c6A", "stars": 4, "date": "2011-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "33vUIil_GCaT92aUaZhRXA", "review_id": "g9eCPcCwC0HUERJPZbf1BA", "text": "I had to bump Zoe's up a star! Their hummus & pita plate is delish & I love the spinach roll ups, I think they're better than the chicken ones. I also bought a refillable cup that I can bring back for 99 cent refills. I usually come here to get a light, healthy lunch, but if you're feeling like some dessert their chocolate cake is freaking amazing!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2011-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0Eck5WWuXkzee6uvqMy6zg", "review_id": "mOWe8tOFvGeETzYSyxWwcg", "text": "First time at Athenian for lunch today.  Really liked it - mom and pop atmosphere.....great menu.....good service.  Got the steak/mushroom pita - it was REALLY good.\n\nI'll be back and I'm looking forward to trying many more menu items.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2011-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "GAEHo1uslNOouKy5k_v3tg", "review_id": "qRD45xIQh7u-nrcArz9tcA", "text": "closed :(", "business_id": "t54zAs7IftAVb9SKcCRotw", "stars": 3, "date": "2012-06-07", "type": "review"}
{"votes": {"funny": 13, "useful": 12, "cool": 12}, "user_id": "C8ZTiwa7qWoPSMIivTeSfw", "review_id": "pIfC0byq7tkxFirDDHMZuQ", "text": "Nestled amongst the many malls along Camelback in the 18th to 24 th Street range, sits Cyprus Pita Grill. A cozy, airy, light filled space with an open kitchen, really hits the target. Again, a fave of John the chef, the beautiful Greek woman in the kitchen smiled at us (ok, she smiled at John). We both ordered the lamb pita and as a side choice, the greek fries. OMG, two words for ya, dee mutha freakin lishus! Man, I'm bad at math. I remember nothing of my math education, except for the crush I had on Mr. Johnson the geometry teacher/football coach/neighbor....and let me tell you he looked good in his bermuda shorts, black socks, shirtless and sweaty mowing his front lawn. But I digress...the fries...heavenly. Fries, cooked to perfection, with lemon juice and feta cheese, oh so good. The pita, was overstuffed with perfectly spiced lamb. Chased with a brisk, refreshing iced tea....a perfect lunch hour for the chef and I. Service was right on...friendly, effecient and professional. It reminded me of a cafe in Mykonos. That I saw on a postcard. OPAH yelpers!\nP.S. I want to dedicate this review to my friend Tod. No one could put away a Dr. Pepper like my friend Tod. Here's lookin' at you big guy...I love you!", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 3, "date": "2007-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pD0yoW4VFnNwHdPKJkVAsA", "review_id": "0c1n9v5mu-AZsobp4RCQ_Q", "text": "Cheaper Greek food than My Big Fat and tastier. Recommend the Greek fries (feta and lemon juice) and the Spartan club. Nice patio seating too. One of my favorite places in the area.", "business_id": "Rg3INE2p4zQYvfMvJduEOQ", "stars": 5, "date": "2011-06-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Mmew2rqnwj8FW3qD9wsaQQ", "review_id": "aL2JVg0LQDx5CbQz4vod9A", "text": "This little place is gold! I visit this quaint little restaurant at least once a week and am satisfied for days. Quality ingredients is key to this restaurant. The meat, vegetables and dressings are amazing. The owners are incredibly sweet and enjoy having their customers in their restaurant. Five stars for sure! Love, love, love this place. The salads are the BEST Greek Salads in town!!", "business_id": "cvb__rYMkj4BMhC3p_FB3Q", "stars": 5, "date": "2013-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KQnq1p-PlWUo-qPEtWtmMw", "review_id": "O4VF-_uIt0sbX2D5fjwEOg", "text": "Sabas Mediterranean is a great little restaurant for date night or family night. The staff is always friendly and can answer any question you might have. \n\nThey also have a great $5 gyro happy hour! Which is an awesome deal because the gyros are very tasteful.  I also really like the falafel.", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 3, "date": "2013-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Kk0J5XpNfpNW9CS5_--YHg", "review_id": "xL2HiZyas3sp8ww1ney1Xw", "text": "My father just raves about this place so he brought me in for dinner. I had no expectations but by the time I left I loved every part of my experience. The staff was extremely nice and always checked up on us. We started with the traditional hummus and pita bread for an appetizer and for my meal I had the falafel pita and it was all fantastic! Being a vegetarian I was pleased to see how many vegetarian options they offered. The vibe of the restaurant was lovely and I will definitely be going back! \n\nJared waited on us and he is an absolute gem! So sweet and so handsome! Everyone should try this cute restaurant out!", "business_id": "qXQ3ZBdwI3GlbR5-eYWqNA", "stars": 5, "date": "2015-08-04", "type": "review"}
