{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "yzdbv1tS8TyTqPVi5arnOQ", "review_id": "VT9fNoke_VBlSCpBxLmPPA", "text": "This place is pretty good. It was my first time at a Morton's. This is comparable to Bob's Steak and Chophouse. Definitely up there. The double filet I had was cooked perfectly and humongous; dayum! The waitstaff and ambiance was nice.", "business_id": "90Fqfzd8zD9AuuNBSv9lAg", "stars": 4, "date": "2009-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ytgLwKzD6B4af5vW56RpJg", "review_id": "58axXkbTRz4AwzAZLlFblg", "text": "So many people have raved about this place so I was so excited to bring my husband for his birthday. We were greeted by friendly staff and walked through the room that smelled of wonderful steak. We were seated and our waiter was very friendly and knowledgeable. Everything was fine until we got the food which was disappointing. I ordered off the special menu and had the corn chowder, a filet and lobster tail, a side of creamed spinach and dessert for about $55. My husband had the cowboy ribeye for $65, the scallops to start and a side of brussel sprouts. \n\nThe corn chowder was ok but not very hot. The scallops which came recommended were ok but they were on a pesto sauce which was simply too overpowering for the delicate scallop. We used the pesto to dip the bread in. The steaks came and were both overcooked. They were supposed to be medium rare but my filet was well done and his was more like medium. We should have complained but we decided to just eat bc we didn't want to wait and didn't think that they would be less well done since they come on a scorching hot plate. My husband liked the brussel sprouts but my creamed spinach was not hot and was stringy. \n\nAgain, the food was mediocre but the staff was extremely friendly. I booked on opentable and told them that it was his birthday and they did bring him a complimentary dessert. I prefer Morton's, Ditkas and Peter Luger's.", "business_id": "0FgwBx7pgmNdUtsd_T8UYQ", "stars": 2, "date": "2014-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dtd-wIGTJl7QVWpCA-3_Cw", "review_id": "zaQ_BouP8u9ETPbUi0GZNw", "text": "Tessaro's gets a lot of press about having great burgers.  They are certainly solid and worthy of praise.  \n\nWe've had ribs and steak there - both were also very good.  But there is something about the place, that doesn't make my short list of favorites.\n\nIt's usually pretty crowded, and the bar/waiting area is limited.  Leads to alot of shuffling around and awkwardness.  Also I'm always underwhelmed by their sides.  I end up ordering potato salad or something else that I'm underwhelmed by.  They have home fries, but I may just be too much of a traditionalist and want a decent french fry.\n\nAs someone that lives in the neighborhood - they do provide a lovely aroma of grilled meat almost every day of the week.  As a result - I am hungry all of the time.\n\nBut...if I want a burger and a beer - I head down the block to Lot 17 and get some options, better atmosphere and sweet potato fries.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 3, "date": "2010-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q7MrNVt1FE23rwtWmPYWHg", "review_id": "b-gWzTYl9xDshsrS_Aoq6g", "text": "Unlike my boyfriend Darren W, I'm not much of a burger fanatic, so when we came here last night, I tried their bbq chicken, and thought it was very good. Very moist and sweet. Also, as a side, I had the broccoli which was perfectly steamed. The service was awesome, and the place has an old-time charm to it. It worked for me. They have no desserts, but I guess that's what Oh! Yogurt's for. :)", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 4, "date": "2013-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ro2jM0RFGriJjbeFZrPGSw", "review_id": "Ygf7XtrjtC3i1bH_awzZOA", "text": "They have a new private function room that is simply amazing, air conditioned, just very well put together. Food is great and since this is a Pittsburghs staple, you have to come and try at least once.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 5, "date": "2015-07-11", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "XeDbXueGKrfMLyIG45QIOg", "review_id": "eSG5pvImJcScD7TtNmu2YA", "text": "Up until this week, I had not been a huge fan of LongHorn and this rating is based solely on this one visit. \n\nYou're probably wondering why I continued to go back if I'm not a fan?!?  Great question!  Well...my husband absolutely loves it so I try my best to do the good wifey thing and indulge him every now and again.  :-)   \n\nThis one time, I am actually glad that he didn't give into my protest and he convinced me to go. Our meal was (surprisingly) outstanding!! Not that I ever thought that the food was \"bad\", but it was just \"meh\" for me (and I hate to pay for \"meh\"!).  However, this meal was anything, but \"meh\". This week we decided to try the \"Porterhouse for 2\" and it knocked my socks off!  It was a great piece of meat, seasoned perfectly, cooked properly (medium rare), and seriously delicious. It came with 2 salads (the reason for only 4 stars for this visit...I will get to that later), 2 sides (we had Asparagus and Broccoli), a bulb of roasted garlic (oh, heck yes!!!) and a small bowl of Sizzling Brown Magic known as \"LongHorn Steak Sauce\". Let me preface this by saying that my husband and I are purists when it comes to steak...we don't over season or typically add any sauces (although we do love a good chimichurri). We like to let the meat speak for itself.  But, SWEET BABY JESUS....their steak sauce was awesome! They prepare it tableside and it's served hot. Let me repeat...ITS SERVED HOT! Who woulda thought?!?  If I wasn't afraid of scorching my tongue, I would have liked the bowl clean...it was THAT good!.  \n\nOne taste of the steak with a slice of garlic and a dab of sauce and the angels began to sing. My husband was so happy (and surprised) to see that I was loving it that he was gitty. He even explained our situation to our server and I could hear him getting choked up (not really, but you get my point) when he uttered the words \"she wants to come back\". (You're welcome, honey!) \n\nSo...if it was so darn good...then why the 4 stars (instead of 5)?  3 words...Warm.Salad.Plates.  Seriously, people...cold foods need to be served on cold plates. Even if the plates aren't completely chilled...for the love of all this is right in the world...don't use warm plates for salad!  The server apologized and said that they were training a new salad person and that she used the wrong plates. I get it, but I wanted to ask why she (the server) didn't notice when she picked them up?  hmmm, oh well...I guess going from the typical \"meh\" to absolute perfection was expecting a lot. It was a blip on the radar compared to the rest of the meal, so I've moved on.\n\nWill I go back...YES, but I will only ever order that same meal again. Hopefully, it will be just a good. Consistency is a difficult ask for even the best restaurants. I will be sure to keep you Yelpers posted!", "business_id": "AUDuCSWYzzRP3H2w7TxtuQ", "stars": 4, "date": "2015-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QHPxy0ypvmdFMVemKp-8PQ", "review_id": "oBjOpo2Z_IxAKhGMssBEfg", "text": "We ordered a bottle of Cabernet Sauvignon from Raymond Vineyards designed especially for Morton's called primal cut and it was boldly delicious and perfect for the steaks we ordered.\n\nSuperb aged four weeks steaks! My husband had the porterhouse and I had the NY strip both perfectly prepared medium rare! We ordered a side of mushrooms in au jus and they accompanied the steaks nicely.\n\nBefore the steaks arrived they served fresh butter and a hot boule of bread that you could smell baking because of the scent of the toasted onion on top. We also shared the Morton's salad which is greens mixed with blue cheese dressing topped with egg and anchovies. All the portions are ginormous and so easily shared!\n\nMy husband ordered the molten hot lava chocolate cake served with vanilla ice cream and caramel sauce which was made to order and ordered when we ordered the steaks. It was divinely chocalatey! He also ordered a tawny port to end the meal. I had tastes and sips of both and they were delicious, and was too full to have my own!\n\nWe enjoyed sitting together in the circular booth and talking and sharing a superb meal  \nmade all the more pleasant with a wonderful waiter and maitre d'.", "business_id": "Lt9o2RmacVY2L-IWLA8uTg", "stars": 5, "date": "2014-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0ytVGmvyKzWb1ur6AiAflg", "review_id": "r1R-CDSerwp5vuWDN1nWQA", "text": "What a great experience.  The service was some of the best I've ever had in any restaurant and the \"Generous Pour\" wine sampling was fabulous.  Our waitress, Michelle, was extremely knowledgeable about the menu items as well as the wine she was serving us...that's a HUGE plus in my book.\nWe started off by sharing their fried calamari tossed with cherry peppers...fabulous!  We then shared the house chopped salad, which was full of great stuff and tossed in a light vinegarette dressing.  I liked more than my wife did.  For our entree, we shared the delmonico steak, lobster mac and cheese and creamed spinach.  We had a problem with the steak because it was way over cooked.  Michelle cheerfully took it back, apologized and brought us a new one along with all new fresh sides.  The steak was just ok and we really should've ordered the porterhouse but the sides were just rediculously good.  She then proceeded to buy us 2 desserts of our choice...carrot cake (special) and chocolate hazelnut cake (on the menu).  The carrot cake was one of the best I've ever had but the chocolate cake just ok.\nThrough each course Michelle brought us more wine tastings and I believe we had 7 overall.\nIt was great night and even though the steak was not a favorite, I would return again and simply pick a different one.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 4, "date": "2011-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-m-CewZZdKFVDShMylzA8A", "review_id": "yOt89SWtdlGjZa9JZUwE8g", "text": "Just celebrated our 39th anniversary here and it was everything we expected. Had the stuffed lobster and it was perfect. Alex was our server and he took special care of us.  We had reservations and our table was ready with heart confetti and candles lit. The chef brought out a appetizer of scallops. After our meal they presented a special dessert with Happy Anniversary written in chocolate on the plate. It was a perfect meal to celebrate together.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2014-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aI1s6-gfNeDpyqBBMBiBkQ", "review_id": "kYx_3hgw1DqVuJQwMGjHKA", "text": "Wonderful servicd\nGreat atmosphere\nWill definitely return all the way from Columbia,  SC", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2015-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-66KLOLocV7m90mEPq0U4w", "review_id": "RAno4FIhQDiFLP6fpBG_7g", "text": "My says \"best crab cakes south of Baltimore City.", "business_id": "1gKBusJMk66ypwEKF0vOAA", "stars": 4, "date": "2012-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zRFYItMOmAOX4a0r393rmQ", "review_id": "2Hh7D4oTtfpRiOJ9wBKrjQ", "text": "This place deserves 5 stars for the service but Iam sad to say the food is just 2 stars if that. I got the lobster and filet otherwise known as the surf and turf and the lobster was just terrible! The filet was also not very flavorful but better than the lobster. The appetizers were so so. I honestly had the best meal of my stay in Charlotte which was a 10$ burger down the street. I'm very disappointed with this place and for 100$ meal for just myself it should have been mind blowing but it just left a less than good impression. Their desserts were the only good part of the meal! I will not be back!", "business_id": "1gKBusJMk66ypwEKF0vOAA", "stars": 2, "date": "2015-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EmpkDgejncKoP9N3HjGptw", "review_id": "P5nibOL8HFdMSTFfTxszig", "text": "Love the kooka wings! I wish they would bring back the spicy new egland clam chowder! I can just eat appetizers and be happy!. I am a sucker for prime rib, and love getting it blackend! This location is so much better than Rock Hill, it is less busy most of the time", "business_id": "NHIWIA3g7oLZ5gW1tpjf8w", "stars": 5, "date": "2011-06-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "c-YCa4qpSM4kwOlZvUM1Gw", "review_id": "whI7XkvUpyoSNxTyRF7gyw", "text": "I love Longhorn Steakhouse.  I like mostly all dishes because I think everything is seasoned really well. \n\nRegarding this visit, we went out as a family (hubby, me, my mother, and the girls). Initially, we were put in small table, but they accommodated us by moving us to a bigger booth, which was more comfortable. \n\nWe got a crab dip for the appetizer and it was a large portion. Enough to go around. I got my standard steak and absolutely loved it. They cook their steak with enough seasoning and to perfection that you don't need steak sauce. Also, their sweet potatoes with the butter and brown sugar are so mouth watering. \n\nOur waitress was very attentive and made sure to bring out my daughters food first, so she wouldn't get fussy. She also brought back crayons for her to play with to keep her occupied.\n\nIt's right off of Harris not to far from 85, so very convenient.", "business_id": "i3HfmM-evIOLpJ2wuTZVKA", "stars": 5, "date": "2013-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1hP5pdjgvzb7Fj4j1sgaHg", "review_id": "K135vlvBYOXb-nc9cEGC_Q", "text": "Eat before you go, nice deck and beer is sometimes cold..good location, really wish this place was better.", "business_id": "Zc2IwSzGY63zkyhfNrr7HA", "stars": 1, "date": "2015-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5xYCtKaioPGEljVLHsUgUg", "review_id": "_kF4nM02pAsawDu-6DBGwA", "text": "Food was ok and would eat it again, had to wait 50 minutes or so for a takeaway order though and the package it came in leaked with no warning that there was loose sauce in it.", "business_id": "JdCFcgw4yk4M1ZRhAhBIag", "stars": 2, "date": "2015-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9P0C4hBTaDWB0GMw9IOSEg", "review_id": "8M-FghRiFDBALfxzl0lY6w", "text": "Whenever I come to town and ask my parents where I can take them out to eat, they choose the Ribeye. Otherwise, I would never go here.\nWhen you walk in, The dated paneling, low ceilings, and sports bar lighting/TVs might make you think you were in a pizza joint or sports bar instead of a steak restaurant. The place is dark and windowless with (rather tacky) Illini sports posters on every wall/surface.\nThe salad bar, which some people rave about, is not particularly large and is poorly designed/located so that you often have to go down both sides to get what you want...which is a lot of trouble considering the offerings.\nThe steaks are OK, but thin for the price and always overcooked. The shrimp is OK, too. The bread, which looks/feels fresh baked tastes like its stale and probably comes from frozen dough.\nThe only nice thing I can say about the place is that my parents like it.", "business_id": "SoyigEmlt4JYwnOqR_cqUw", "stars": 2, "date": "2015-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Xc3Lu-VNHpP8UymBrA-pbA", "review_id": "2ICz1XuT0__6utdXdLr4yw", "text": "Went with a group of 9 (one of them our 2 yr old) here and it was a Friday night so we understood a wait was going to happen so we gave our name and went to wait, they told us a 40 min. wait time, well 30 min. in we heard them call my friends name, went inside and they said no sorry they didn't have enough seats for 9 only 6 so never mind, went outside to wait again and after another 15 minutes my friend went in to ask if our table was ready yet, they said it would have to be another 40 minutes because when they had called our name the first time they crossed our group off!!! Needless to say we told them they were the dumbest lousy people in the world and left to eat at Zipp's on Bethany Home near 15th street, we had a great time and great food there instead!", "business_id": "cjUmPLRT43wN9Z87A9BOpg", "stars": 1, "date": "2014-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "htUqnu_j9CmOqXxilbK4Sg", "review_id": "9CdzrsJHx1Ck1ZjMcy_JOQ", "text": "Okay, how can you not like Texaz Grill? Bad mood? Not hungry? Vegan? Bringing a baby carrier? Then you should probably stay home. Yes, it's a dive in an aging strip mall at 16th and Bethany. Yes, there is lots of junk hanging from the ceiling and walls that a few won't appreciate as low-brow Texas ambiance. And yes, the portions tend to be on the \"enormous\" side so if you're watching your waistline, plan on splitting a meal. \n\nBut rest assured the place is a Phoenix icon and will be 'til way after you're gone. It is texas-style comfort food - nice and simple. The steaks are great - they cut and age their own like a real steakhouse. The prime rib, when you arrive early enough, is superb - and shockingly cheap considering the cut. And I doubt you'd find a better, more authentic texas-style chicken fried steak (and chicken fried chicken) anywhere in town. So big you'll want to share - or take 1/2 home. But is is goooood.\n\nIf you're a newbie to Texas Grill - it's good to know that probably 90% of the clientele are regulars and are likely close personal friends to the staff of many years. This tip is helpful so that you don't get lynched by the surrounding tables for dissing the busy waitress because your water glass gets low. Come to Texaz in a good mood and ready to eat and you'll be fine. In time the staff may take a cotton to you too - but you'll have to earn it.\n\nThere's not a mistake on the menu. One great value is to order the chop steak as a burger (it's not on the menu) and you'll have one of the best burgers in town. If you're a party of one or there's a few open seats - belly up to the bar. Tammy and Cindy are the usual evening bartenders and they serve one of the best margaritas in town - on the rocks (only) and with salt of course. The selection at the bar is simple and basic, but you'll be entertained all night trying to read decades of bumper stickers and fridge magnets. You may even meet a few new friends as the regulars are a friendly bunch (especially after a marg or two).\n\nWhen visitors come to town, you can bet Texaz is always in the mix. Sure we hit Scottsdale for glam, downtown for urban cool, and Barrio or Richardsons for nuevo mexican - but for a fun evening with friends plus good comfort food, you can't beat Texaz.  Watch for us at the bar!", "business_id": "18TUn9oiW0k0yB6lheiOvw", "stars": 5, "date": "2009-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oDarLx0FfoU3XX2bZKSu2g", "review_id": "gQsluQnJs_B1pbnqjPKlMw", "text": "Tex Az is a one of our favorite places to take/meet up with people in Central Phoenix...especially folks from out of town that are thinking that Arizona restaurants should be in a saloon-type atmoshere to be considered \"local\".  \n\nWe take the newbies from out of town here pretty frequently.  It seems alot more \"genuine\" to most than going to a place like, say, Rawhide.\n  \nI grew up on a cattle farm...and KNOW good steak.  The steak we get at Tex Az is well aged and has great flavor.  The cut, in my expereince, is usually great, as well.  No disappointments there.  (try the NY Strip) Presentation is basic, but isn't that what you would expect? You are not paying Ruth's Chris' prices, right?\n\nBest appetizer--Their chili!  it is VERY tasty and very hearty.  Best dessert--the bread pudding.\n\nWhile the chicken fried steak used to be our favorite non-plain-steak entree--we have recently converted to the fried chicken.  It is very good. \nWith both \"chicken fried\" dishes,  the left-over reheating capability is pretty important since you get SO MUCH food...so the chicken wins out on this one..the Chicken reheats much better than the chicken fried steak.  \n\nThe atmosphere is...well...it is UNIQUE...and isn't that what you want in your local saloon/steak house.  :0)  The service is equally as local/quirky.  We consider it ambiance and character. I don't think we have ever wanted for beverages in all of the times we have been there, as a note.  \n\nParking can be a bit challenging on a busy night..but it all adds to the \"charm\".  \n\nWe have likely been to Tex Az about 25 times over the years.  Not once were we disappointed...but we know what we are signing up for.  \n\nThis isn't gourmet--a spear of asparagus would not dare show its face at Tex Az--but it is traditional type hearty Old West fare and the flavor is simple, yet great!!!", "business_id": "18TUn9oiW0k0yB6lheiOvw", "stars": 4, "date": "2011-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "WVbLOKrLChqDP1mAHKNDEA", "review_id": "GhJBOFWsB-Wy2ZFC2cQpEw", "text": "Most recent visit here was for lunch, I need to eat here more often.  My buddy had the chicken fried steak and I had a pulled pork sandwich with cole slaw.  The pulled pork was juicy, smoky and very tasty with the fried onion straws. As for the CFS, I tried a bite and that's all I got as it quickly vanished from my compadres plate. Lunch service time was excellent and the food was great. And to top it off the prices were very good for lunch specials.", "business_id": "18TUn9oiW0k0yB6lheiOvw", "stars": 5, "date": "2013-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CvCW1UsbL78zeuu4eY9TcQ", "review_id": "IKz6olAFWswne8DOqK-NmQ", "text": "I have been eating here for years. Great food.  Portions are smaller than they where a few years ago, and the pricing has gone up. The mashed potatoes and country grave is second only to my mothers. My kids can share the chicken fried chicken. So much chicken!", "business_id": "18TUn9oiW0k0yB6lheiOvw", "stars": 4, "date": "2015-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "73SAuguzLAXAyuHwPacB7A", "review_id": "LIuxg3DuEKaYF2-vNHVjOg", "text": "Love Love Love. Waitresses are superb. Beef Kabobs - scrumptious. Prime Rib (if you get there early enough) is rare (my fav) and generous. The Shrimp cocktail - wow. And what's not to love on Fish Friday - Cod. Waitress' Coby and our gal are more than Outstanding. It gets kinda crowded, but we are a larger group (10+) and love our food and the smiling, quick, smart service.", "business_id": "18TUn9oiW0k0yB6lheiOvw", "stars": 5, "date": "2015-08-10", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "45V7-1r79DEG0HbuaKYIlg", "review_id": "g2V6s1a__FxWUyrr1ssGhQ", "text": "I have only been here for Happy Hours - so this is only a review for HH offierings and experiences.\n\nTwo visits - the first was a party of five, the second a party of six.\n\nSince Embassy provides Happy Hour for guests of the hotel (in another location, I am guessing), there was almost no one in the lobby bar, which is also the bar for Omaha Steakshouse.\n\nDrinks:  I ordered a whiskey and coke ($5.00 well drinks), and the bartender asked if I'd prefer ginger ale.  While I adore a good whiskey and ginger, most bars don't have REAL ginger ale - so I rarely order it.  As a bartender, I know I only make suggestions to change a customers order if we are out of the requested item or if I feel it will make the drink that much better.  I didn't imagine they could be out of Coke - so I am guessing it was a suggestion for improvement and I agreed to it.  GOOD CALL!  Not only was real ginger ale used - the angel behind the bar muddled in some fresh ginger for me, too!  YUM!\nMy companions had assortments of house wines, margaritas and beer.  Everyone was happy.\nThe food offerings are all appetizer sized and perfect for sharing.  And, only $5.00 during Happy Hour!\nThe wings are wings - nothing disappointing, but nothing to write home about.\nThe Buffalo Chicken Sliders were tasty - but the bread was really the standout part of this dish, and I did appreciate the large chunks of bleu cheese in the dressing.\nThe Hamburger Sliders are wonderful!  You can tell they are fresh grinding the meat from the quality beef they use.  The onions are sauteed to perfection and the buns are fresh, warm and the perfect golden brown.  Three to a plate - we had to order a second round of these!\nPulled pork sliders were unremarkable, but okay.  (Like the wings.)  There was nothing wrong with them - and at $5 for three sliders, I have no right to expect an epiphany.\nI can't do our last dish justice.  It's homemade potato chip \"nachos\" with a bleu cheese sauce.  Honestly, despite having shared two orders of these on my first visit and one the second, I don't remember what else is on them but WOW - this is comfort food at its best and I can't wait to go back for more!\n\nThe room is not a typical hotel lobby.  There is a huge koi pond running throughout the lobby, and tall tropical trees.  I felt as if I was in a far cooler and more tropical area  - it was easy to forget I was in mid town Phoenix.\n\nIt seems this happy hour is still unknown - very few other people there for either visit.  But - I happen to adore the lack of loud music and ability to get top notch service - so that's not a complaint from me!\n\nIf they stretch happy hour to 7 instead of 6, I will gladly add on that elusive 5th star!", "business_id": "bewtZL-VV1oeGUdAhHVz6Q", "stars": 4, "date": "2010-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "luUUqt83B54Hk-SDJBYeNg", "review_id": "aWD7mNeYdU8zmdTGubdH3A", "text": "I love The Capital Grille! All of their steak options are great, you really cant go wrong. Whatever you do, you must order the Lobster Mac and cheese for your side!!!!! Its my favorite side dish in the world. Its so rich, creamy, delicious, and has large chunks of delicious lobster meat all throughout. You wont be dissapointed!", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 5, "date": "2011-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "038U5ZOGLlZgwiguNTuWqA", "review_id": "fIFfM3DJV9pk0btYXeKoYw", "text": "Celebrated dropping our son off for college with his mother's birthday. Our server Carolann was delightful. She delivered complimentary champagne and dessert. We will be repeat customers!", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 4, "date": "2014-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-Oz4_yM-0ZRAa1NmIIacGA", "review_id": "7f2bElZFC0ocp4fdFYY3gg", "text": "Dinner last night was fabulous...again! Thanks to Jared for the service that is ALWAYS excellent. The New York was cooked to perfection and the sides were fantastic too! Great food and great service...It never fails!!!!", "business_id": "_BhzcKojv1gjdRINe3Gkig", "stars": 5, "date": "2011-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pOim-Tccfc6Aw0ynGdPmYw", "review_id": "Tg8gRlYHilx8RYPDWWQvSg", "text": "Never disappoints - love their salad with honey mustard and then their sinful sunday.  Filet is what I get here.  Always get good service and never really have to wait for a table at this location.", "business_id": "4mZ__NR8jLD1k0rYpSbplA", "stars": 4, "date": "2012-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S5zDAjR2JDPU6ZLWwVTJ3A", "review_id": "wHqmhkohNO4da3g63KOm7g", "text": "I was so looking forward to going to Stockyards.  I picked the Hubby up a the airport and off we where for a great dinner.  The staff was great , infact everything was really nice.  The Ceasar salad was great, my husbands filet and rice was really good.  I choose the prime rib which flavor wise was terrific, but so tough I couldn't chew it enough to swallow it.  I HATE complaining about food/or sending back, but I really couldn't eat this.... So they quickly brought me another piece, but guessing it was just another slice off the same piece of meat because it to was extremely tough.  I don't want to make it sound like you shouldn't go there, everything about the place was a good experience except my main course...it happens.  They gave us a dessert on the house and we called it good.", "business_id": "7U8TYNW4Mvx6m3zexsO0sg", "stars": 3, "date": "2010-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EthUwROOIvW4MCMEK3kFBA", "review_id": "xLgoKl3eO-K4L6a8WHleWg", "text": "Good food, great service eat their often both lunch and dinner.  Never disappointed.", "business_id": "7U8TYNW4Mvx6m3zexsO0sg", "stars": 4, "date": "2014-08-21", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "WaT_uYq3buTlK-xNFUGOYQ", "review_id": "NpIVpDTCFx7A7NjK1YzmWA", "text": "The food here is a solid 3.  But I'm giving them a 5 because of the following reasons: fried rattlesnake appetizer, an actual working slide from 2nd to 1st floor (how cool is that!), friendly staff, kids eat free, an absolutely huge steer by the entrance (you'd have to pay $5 at the OC fair to see this), and free cotton candy for the kids.", "business_id": "wZwZcte4lcbu51NOzCjWbQ", "stars": 5, "date": "2010-07-27", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "deFp0FK9GqM9duW8Sqvi9w", "review_id": "NtJQZWURedSV1wIy-wND8A", "text": "I don't know if there are words for how much fun this place is, so I'll just give a quick rundown of the evening of awesome. We had to park in the bottom of the hill parking lot but they have a shuttle that we didn't take. Take the shuttle if you aren't wearing sneakers.  We showed up (6 of us) around 7 and were told it would be an hour wait.  After 15 minutes they had a booth for us. We walked past the live cow and got to take the slide downstairs. The hostess waited for us at the bottom of the slide. It was a booth that fit all 6 of us easily and we are not little petite people. The only drinks on the specialty menu had tequila but the das boote was recommended as a particularly girly drink. It is supposed to taste like melon but it tasted like Jello and came out on fire and you get to keep the boot glass! We ordered rattlesnake as an appetizer and it tasted like fried whitefish. It came with the snake's spine?\n4 of us ordered the Cowboy Stuff where you get everything for $22. Then the balloon man Frank came to the table. Even though we were all adults he made us balloon animals. He was fantastic! I got a giraffe with a different colored mane. My friends and BF got a T-rex, a monkey with banana and a motorcycle. I went outside to get a close up of the views and by the time I got back  our table was filled up with cowboy stuff. The sauce on the meat was delicious and the seafood was well cooked as in tasty. The potatoes made me feel as if I had died and gone to carb heaven. The beans were bland and the pineapple coleslaw disturbing but if that's the worst I can say about a place is that two of their sides weren't my favorite then I think it's all right. My friends that didn't order cowboy stuff got ribs. Deliciously tangy sauce with a little bit of heat.\nI was originally terrified by the idea of their live band as usually those are so loud you can't hold a conversation but they had their own section and rocked out.\nThere were a lot of kids around but none I would consider obnoxious. They seemed to burn off their over-stimulation riding down the slide and going up the stairs again. Our server was incredibly fast and somehow managed to see our drink glasses  through all of the stuff on the table and keep them filled.\nBasically it was fun enough we plan to come back within a month to celebrate a friend's birthday with a giant hat and an eclair the size of her head. Well worth it and the views from our table were incredible.", "business_id": "wZwZcte4lcbu51NOzCjWbQ", "stars": 4, "date": "2011-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_rg8SIAg4w2_CsVJNlm7Uw", "review_id": "9XrH-hnewNX-Zm43jHWjdg", "text": "My nieces and nephew are in town visiting so we decided out take them out for a night to remember. Rustlers Roost once again did not disappoint. From the moment we started up the hill to the restaurant they were excited. They loved seeing the bull outside and the cave like entry. \nMy niece looked like her eyes were going to pop out when the giant bowl of Mac & Cheese was put down in front of her. \nThe highlight of the night was our visit to the dance floor to listen to the band and do a little dancing. The guys in the band do a great job interacting with the kids and really made their night by giving my niece their autograph. \nThe reason for 4 stars this visit is because I think the food has gone down a little since our last visit although the beef ribs were  still good. Regardless, we will definitely be back for the view and the band.", "business_id": "wZwZcte4lcbu51NOzCjWbQ", "stars": 4, "date": "2013-08-03", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "9BdeYtS-RIEMw48MeGGUZQ", "review_id": "sXMHrY1GrsHhghUNKI38ig", "text": "Okay I have been coming here on and off for five years.My kids remember the atmosphere and what was awesome food and great steaks. Wait a minute did I say great steaks.?\n\nWhat the heck has happened.?The last two times I have been here since a few years ago have really changed things. I could not even cut my steak. Neither could my son who travelled all the way from Montana to revisit his memories of the roost.\n\nAnd c'mon guys no cotton candy for the kiddies on the Fourth of July. Well I paid for the steak but won't be spending any money here for a long long time.", "business_id": "wZwZcte4lcbu51NOzCjWbQ", "stars": 1, "date": "2014-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4niOPkERFzYg45iNBNx51w", "review_id": "b6Yg0NRx-mNLVX6IoGu2_w", "text": "My wife and I were very disappointed with our experience at Rustler's Rooste last night. We were there to celebrate our 11th wedding anniversary and our visit there was our first experience at the establishment.\n\nWe ordered the big cowboy dinner platter that came with many different options from the menu. Our fried shrimp were burned, the ribs were the same way. The fish kabobs were raw and the beans were cold. The coleslaw, the fresh vegetables and the dipping sauces were warm as if they'd sat under a heat lamp the whole time the rest of the food was being cooked. All of this food was served on a bunch of warm, wilted lettuce that made the dish look unappealing to even eat.\n\nOur waitress did an ok job. She was busy as it seemed like she was attending to too many tables so it took long periods of time to get to us. Not her fault. We should have said something last night but our waitress was so busy that she didn't have time to come over to ask about our meal so we asked for the check and left. \n\nHaving spent $22 per person on this meal we expected much much more. Yes, the view of the valley was great but the meal and the service received a failing grade from us. \n\nI submitted feedback to the restaurant through their website last night and received a call this morning from the manager. I was impressed that he called me back so quickly. He asked if we would give the place another chance so that they could make it up to us and offered us a VIP experience AT A DISCOUNT.  I called my wife and asked her if she would be willing to go back to which she replied \"No Way\". I asked the manager for a refund instead of the opportunity to return and his response was that they do not offer refunds. I appreciate his attempt to make things \"right\" with a discounted meal if we were to come back but pretty sad that they aren't willing to make things right with a refund. \n\nI hadn't planned on writing this review until after speaking with the manager and hearing that they do not offer refunds for a horrible experience and that he wanted to have us back for a DISCOUNT, not a complimentary meal. No need to go back and spend more money on a poor quality meal.", "business_id": "wZwZcte4lcbu51NOzCjWbQ", "stars": 1, "date": "2014-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "8V7NKO0jo_kMTSwVl-I_cw", "review_id": "yXPKDI8EWGiBsTWqgLNtRA", "text": "Dim lighting, good view and live country band on a Tuesday night. The whole table gets warm fry bread which is nice with regular butter and cinnamon butter. The table gets a salad but there's really no taste with the premix dressing. Our food took quite a long time and honestly wasn't worth the wait either. We came here because a friend of ours wanted to try the rattle snake which was over breaded, the pieces were very tiny and it came with breaded cactus which we couldn't tell between the rattle snake or cactus sometimes since the lighting was dim and it tasted over cook. \nOverall the ambience is nice but I don't think we will return for the food.", "business_id": "wZwZcte4lcbu51NOzCjWbQ", "stars": 2, "date": "2015-07-25", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "XxW_WSU13NamMOjg_mXgvw", "review_id": "9OfOpTegPLh2q5yxj3arKg", "text": "I have never had a bad steak from here, and my son loves that he can throw his peanut shells on the floor and I won't get onto him about cleaning it up LOL.. Prices are moderate but the food is great.", "business_id": "Mm8x_jzeLrWlvDEnqhuCBQ", "stars": 5, "date": "2012-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iTOhMql92ANhVwXRC9gp5g", "review_id": "unXC6vOCzx2xeQk8gWxb8A", "text": "First off, I have been around to many restaurants and I live and breathe hospitality.  My wife and I decided to come to this place to dinner because I had never been there. Yes when you walk in there are peanut shells everywhere and country music playing. My kind of place and what else would you expect from a place called Texas RoadHouse.  We were seated within the 20 minutes we were quoted and greated immediately by our server Cathy! She was very attentive no matter how busy she was while the entire restaurant was really busy. The only thing I can say is that this is the best customer service by a server in a really long time.  We are concerned about being in the back corner but our attitudes had changed as soon as Cathy had shown up! She honestly was the best server with placing our child's food first and being on top of it. Cathy is the best and if I owned a restaurant I would be happy to have her as a server or a floor manager. Long story short, my wife and I will be back for another great experience with Cathy!", "business_id": "Mm8x_jzeLrWlvDEnqhuCBQ", "stars": 5, "date": "2015-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "345vgn1bbWR0HA67OaZxHA", "review_id": "3a4SjdKVEdjEq6_8x7PmfQ", "text": "One of my favorite restaurants by far! Some of my favorite dishes: shrimp cargot, chicken fried steak, and potato soup. I also enjoy their carmelized carrots and mashed potatoes..both to die for!", "business_id": "Rus-ewyqLj2D1RlqK-je4w", "stars": 5, "date": "2010-08-06", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "tvPrjtCqQu7sZmf1gcuBqg", "review_id": "Dgj02Bh24ccgfOiZJwLmbQ", "text": "PROS: ambiance was nice, our server was amazing and looked like Jude Law ;)\n\nCONS: food was mediocre at best, limited menu selection. Generally, when a restaurant has a small menu you'd expect it to be amazing. We got a cheeseburger and the chicken tenders. Tenders were okay, but the burger was horrendous. Tasted like those frozen patties you get at the store. \n\nEven though the experience was nice, I go to restaurants primarily for the food, so we probably won't be going back.", "business_id": "Rus-ewyqLj2D1RlqK-je4w", "stars": 3, "date": "2015-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gGvDEE-uFvIMPUhtZ71bWg", "review_id": "13ekCnxpvVok_8TrLN1XYw", "text": "the food was standard, nothing special,  went for lunch,  Server was very lacking , did not introduce self, never checked back regarding meal, did not clean up dishes or refill drinks in a timely manner.  Probably will not go to this location again.", "business_id": "0VyvlA1mZsDoYd3kkRjevA", "stars": 2, "date": "2014-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FLdun6KWwAh-gC8VHVZGCw", "review_id": "V53PMkFpI_g35dgKPscEEw", "text": "Takeout grilled steak, baked potato, salad.  The concept is hot fresh cooked steak meal that you can take out and serve as a family meal without having to prepare or grill.  Dine in also offered but they're surprised if you take them up on it.", "business_id": "jqGb_E1kpR2izyQGNmZ6Sw", "stars": 3, "date": "2006-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xLv1yWsquf6WkSDDSOvZKw", "review_id": "ZTh6gqiu2OHOYFW_ju5deA", "text": "I had eaten here a couple years ago and it was decent food and service. I think the place has gone downhill. When you walk into a place that is empty I'm a Friday night, be afraid. Prime rib was way overcooked and fatty. Veggies were mushy. I was wearing nice jeans and a blouse and I felt overdressed compared to other patrons.  We won't be back.", "business_id": "OjNTZTZ6HYQghJN-3jmwnA", "stars": 1, "date": "2010-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wFVHsKIRr5LFPw_seR-yHA", "review_id": "n00yE8jfqTB5cjcakGPBQQ", "text": "It has been a long time since we ate at Black Angus and first time in AZ. \n\nGreat dining experience. We were across from a VERY loud family and were reseated promptly . \n\nThe manager was wonderful understanding. The server did a wonderful job which enhanced our date.\n\nThe only hiccup was a overcooked steak that was promptly taken care of!  \n\nI HIGHLY RECOMMEND  BLACK ANGUS.  It is a comfortable place with people who want to ensure your experience will EXCEED your expectations", "business_id": "OjNTZTZ6HYQghJN-3jmwnA", "stars": 4, "date": "2015-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ju-rMUfxp-GaxCez3Sv5Xg", "review_id": "Hcyt-3xecW--JEU6eX0ZGg", "text": "Follow-up to previous posting on the Keg Steakhouse in San Tan.  The Kitchen manager contacted me within 5 days of my posting and was very understanding of my disappointment from our visit.  He did provide me with a coupon and his business card to have us come back to this location.  My only issue now is that why wasn't it handled  like this from the start?  I do appreciate the professional manner in which I am now being treated.  I added one star to my previous 2 star rating.  Time will tell...", "business_id": "xMK01ZbVUYLLoyqoeWAIVw", "stars": 3, "date": "2013-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9Qx8r1mkuEB2fwIlbZ5LJw", "review_id": "J7PPJ9iW6NbXMI2jy30a8A", "text": "The rib steak is awesome, so delicious! The waitress was very kind and nice.\nCertainly, will come back next time in town.", "business_id": "xMK01ZbVUYLLoyqoeWAIVw", "stars": 4, "date": "2015-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "sLKOFR5xBHq81CFjSURrEg", "review_id": "EHc2cZh1HAd5vILpx3ACQA", "text": "My wife and I recently went to Flemings for her birthday.  Anytime we decide to spend a bit more on a nice dinner Flemings is our first choice.  You know every time you go there you will receive first rate service and 5 star food.  There is not a bad item on the menu there and the steaks are fantastic.  \n\nThe only thing I would say the location lacks is the bar.  While they do have one, it is very small and gets full quite quickly.  We would love to go there more to enjoy some of the food on the happy hour menu but given how it is set up, we opt for other locations.  The dining room itself is very spacious and representative of a high end dining experience.  \n\nOne thing that always cracks me up there is how they offer to carry my drink for me when walking me to be seated in the dining room.  May have to actually do that sometime....", "business_id": "0ONypOKIhttBz9IJzBE8jg", "stars": 5, "date": "2012-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "K6k3tULQVD7cEnUMytHobg", "review_id": "Bp3utDu3NMuSf-m4J9Lk6A", "text": "My wife and I like this place. A lot.\n\nMost people know about their happy hour, it is one of the best around.\n\nMake sure you get on their email list. Some of their \"off menu\" specials are a good excuse to have a fun night out.\n\nFriendly service and really good food and wine. This place is always a good choice for dinner.\nSteak, lobster, scallops, cooked to perfection or they will certainly make it right.\n\nCheers!", "business_id": "0ONypOKIhttBz9IJzBE8jg", "stars": 5, "date": "2015-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "rLtl8ZkDX5vH5nAx9C3q5Q", "review_id": "vPdSKtycvetpRiwxxfhfkg", "text": "My wife and I attended an event here last night.  They set out a pretty good spread buffet style.\n\n* Bikinitini - this is their new 99 calorie drink.  It was very good light and refreshing.  I'm more of a regular martini guy but it never hurts to try something new.\n\n* Porcini rubbed filet mignon and peppercorn steak - both were excellent, tender, juicy and very very tasty.  \n\n* Roasted mushroom ravioli - HOLY COW!  This was amazing.  This is only an appetizer on the menu though for some reason.  I swear I had about 10 of these things.  Next time I go to Flemings I'm going to get a steak on top of a bed of these raviolis. \n\nAs always, the staff of Flemings was very friendly and helpful.  I will definitely be back.\n\nThe event we attended was through Foodies Like Us (www.foodieslikeus.com).  It was $15 per person and well worth it for all the great food, wine and cocktails.  It was a bit too crowded though.  Anyway, it is a solid group of people that attend different dining events around the valley.  Check it out.", "business_id": "9AbyBqGWHYZC73GlyAuTrQ", "stars": 5, "date": "2010-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "McmMQpeZ__-HXF3VpIIRUQ", "review_id": "Dc22vggyfkiQE5sv6A_PSg", "text": "Delicious Steak and good wine selection last night at Fleming's Steakhouse in Scottsdale, AZ. \n\nI had the New Wedge salad and 5oz Petite Filet. Cooked perfectly Medium Rare. Great flavor.\n\nI'm not a big fan of a la carte pricing and family style service. For me it removes a bit of the personal touch and service I think is expected.\n\nGreat location for larger parties but I probably wouldn't take my date (@amywesttravel) there. A bit loud and not as many private seating options as I prefer.\n\nOverall, good experience and good food.", "business_id": "9AbyBqGWHYZC73GlyAuTrQ", "stars": 3, "date": "2014-06-04", "type": "review"}
