{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "4-3IU5uUH90m21TWbZhhnA", "review_id": "2xCds3bp0wM6nHMz3H65vg", "text": "Alexion's has been around forever.  The first time I went in there, I was 19 years old on summer break from college and working at the ice cream factory up the hill.  All of the union guys from the ice cream factory went in there after work, and I immediately found out why.  MANY, MANY years later, I stopped in there with some fond memories, and once again felt welcomed and valued as a customer, even though they didn't know who I was.  THE SANDWICHES are done Pittsburgh-style, sort of like Primanti's, and they are as perfect today as they were back in ancient times when I first started visiting the place.  Alexion's is a clean and peaceful little place in the Rook Station part of Green Tree, the oldest part of the town.  I recall that some of the sandwiches I got there were ordered at a pretty late hour.  Nothing but good things to say about the place, and I wish it was closer to home!", "business_id": "KayYbHCt-RkbGcPdGOThNg", "stars": 4, "date": "2011-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AVrY4uj14hOBI9yh3iE1KQ", "review_id": "tp2B8UjLUEJjM4Y10gkDOQ", "text": "Visiting from Toronto, I was really impressed! The amount of tickets to be won was incredible. We usually got 200 tickets per play on average. Compared to Playdium here, that's awesome considering I'd win at most 10 tickets with the smallest prize costing 100 tickets. The food is great, the place is clean and the games don't feel greasy or nasty from all the food.", "business_id": "sbW8qHJgzEIH42B0S-3New", "stars": 4, "date": "2013-07-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1Nn58APYG7Qz1tRiqdGCng", "review_id": "U01aVLcVAluYpbLJRGvNpA", "text": "So I have not been to one of these in awhile since I normally have an aversion to chain restaurants, but since I was with colleagues on travel for work and they chose this place I went along. \n\nFirst surprise: decent beer.  I remembered the normal RB Brewery beers were not much to write home about but they had a couple of new styles, including a very good imperial IPA that for $5/glass cannot be beat.  Second surprise: pretty tasty food with a lot more healthy options than I expected.  Recommend the summer salad and the ahi tuna - both were great. \n\nService was a little slow (not sure why) so a 4-star review is downgraded to 3.5. I'll be back next time I'm in Pittsburgh for work.", "business_id": "McikHxxEqZ2X0joaRNKlaw", "stars": 4, "date": "2011-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2Az24juAhTJtmlqr5UWXSQ", "review_id": "_5885--QcKQqHfho_kIc9A", "text": "Stopped in for dinner an bellied up to the bar. The bar tender was quick to get me a beer (the 3 Pepper Ale which was really good) but after that I was totally ignored. Tried to get the attention of the two bartenders for about a half hour while nursing my beer. They seemed to be more interested in changing dollars for quarters and washing glasses. I got feed up, finished my beer, paid my tab and went to Uno's. Glad I did... Got great service and my meal came quickly.\n\nVerdict:  sit at the bar for a beer if that's what you want but if you're hungry and want dinner take your chances at a table.", "business_id": "McikHxxEqZ2X0joaRNKlaw", "stars": 2, "date": "2015-06-08", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "WMTm9HHRA3EewoxTX1Gleg", "review_id": "Oo6nr6J_IOL-txXLCpjhww", "text": "Just okay. Often crowded on weekends for food that while I'm sure well prepared is not the most flavorful.  \n\nThis store is literally NEXT DOOR to the headquarters of Eat N Park so it's a safe bet that this is the best one there is.\n\nStrawberry pies being the exception to the rule.  \n\nThere are better places to eat for the same money.", "business_id": "eznh0XjVtv924K-KYx_ilQ", "stars": 2, "date": "2009-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_wbuJtXPZGT6U1Qg5hV4VQ", "review_id": "JUD0sz9MRWkp_vZhr_Ik3Q", "text": "Great home style breakfast, sandwiches and dinner. Joe has something great going on here. Waitresses have been there for years as well, and they are very good.", "business_id": "ucKQlQvOeJxETLNkpKcaSw", "stars": 4, "date": "2015-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "63Pop3d15pTuHZ7qoex46w", "review_id": "mf7F8yHlrGPFb1pNKMeG0g", "text": "My first visit to the chain in years. Not exactly fine dining but this was open until midnight on weekdays.\n\nI had roast beef sliders and a bowl of French onion soup. The sandwich buns were mushy otherwise everything was fairly good.\n\nService was very good. Meal clocked in around $15 with tip which I think is 3 or 4 too high. Much more extensive menu than Denny's along with a bar if you happen to need a late night fill up.", "business_id": "h3la53L9-OX_HlfeAySh0Q", "stars": 3, "date": "2009-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ipER6Z9Bu3K0z_pXnqQogA", "review_id": "mgZCu14dWaU-FjnoFo05Nw", "text": "Our experiences at the Smithfield were mixed. On the one hand the food was quite good (both Friday and Saturday), but the service was very, very bad.\n\nOn friday, we walked in and ordered coffee. The waitress then asked us what we wanted. I said that a menu would be nice. That pretty much set the tone for our time there. \n\nSaturday, we got menus (different waitress) but the woman was pretty surly and somehow managed to get our order wrong.", "business_id": "A2XkbJ07hrR80t0EFgLikQ", "stars": 3, "date": "2009-08-15", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "nx2PS25Qe3MCEFUdO_XOtw", "review_id": "4hX77HCk-Jprz9G4a3adKA", "text": "Five adults, including three not-small men piled into a Honda Civic on the way to breakfast one Saturday morning.  This had better be good, I thought as we bumped along...\n\nRitters is a good place to go when other highly attended brunch locales are going through their mid-morning rush as it has two large dining areas to seat customers.  You will definitely get seated and served faster.\n\nThe food was good, better than the crappy dinner experience I thought I was going to receive--as Ritters just kind of exudes a 'here-I-am-take-it-or-leave-it' diner kind of vibe.  It wasn't amazing, but it was good.\n\nAlso, I paid for three of the breakfasts (myself and the two larger of the men) and somehow none of us went hungry and the bill was just $15 and some change--for three people!  I even had some food left on my plate.\n\nOur server wasn't awesome...she was clearly unhappy to be receiving another table (I'm not assuming, I overheard her say it to another server).  However, she got the job done I suppose (in terms of water glass refill).\n\nRitters is CASH ONLY so make sure you bring yours! (or someone else who wants to buy you breakfast)", "business_id": "--UE_y6auTgq3FXlvUMkbw", "stars": 3, "date": "2009-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L5EbYOaL_JprJ9idXtsAHw", "review_id": "2nrKx2geSKYNno9EXwimYA", "text": "The fried green tomatoes are delicious- just perfect.  Overall, such a fun, charming, and delicious diner with an extremely accommodating wait staff.", "business_id": "--UE_y6auTgq3FXlvUMkbw", "stars": 4, "date": "2015-07-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8n--xRBQ9eLDi0vpQ5fGFQ", "review_id": "_pYsQ7YaXBd144VQZ9Ee3A", "text": "I've been going to Tessaro's for years. Every trip back to the 'Burgh wouldn't be complete without a lunch or dinner there. It's my go-to place for meeting friends for a meal when we want something tried and true with no froufrou. And I am never disappointed. \n\nI have heard grumblings for the past couple of years that Tessaro's partially cooks their burgers throughout the day and then finishes cooking them \"to order\" so I asked the waitress if I could have a fresh patty, not pre-cooked. She didn't seem bothered by my request. And honestly, I don't know if I would be able to tell the difference. That being said, it still was the best tasting perfectly cooked burger I have had in a long, long time. With all the new specialty burger joints popping up across the country, I still dare any one of them to stand off side by side with Tessaro's. Our usual picks are the Deli and the Bacon-Blue Cheeseburger, but you can pick any burger on the menu and be satisfied, and then some. I also love their home fries. Yummy! The marinated gourmet chicken sandwich is also a winner if you aren't into red meat! \n\nOne of my other favorites at Tessaro's which I have to admit I haven't had in eons since we haven't made it there for lunch recently is the tuna melt on rye. It has been on the menu forever. If you want one, you have to go for lunch as even though its on the lunch menu, they refuse to make it at dinner :( \n\nThe atmosphere here is strictly neighborhood bar/restaurant. Nothing fancy. I am sometimes put off by the way they offer seating (first-come, first-serve) and they will try to cram four people at a table that is meant for only three. If they are not scrambling for tables to seat people waiting, I'd ask for another less cramped table and wait; but on a crowded night, take the first thing available or you could be waiting a long, long time.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 4, "date": "2011-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Iu9HNWqEKIx-auLSu6QeJg", "review_id": "dLGzl634g56j3hKhBc7ROg", "text": "Good place to have a reasonable meal. Cool that everything is made out of an extremely small kitchen that you can see but the food didnt live up to the local hype for me.  Burger tasted alittle bland, and extremely large.   The restaurant is also very \"packed\" tables are very close together. Home fries option but no 'french fries.\"", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 3, "date": "2014-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Qy1X7IfXo65l3fl-CXg8nw", "review_id": "7bMvWRNixe-hzg0yzuJngg", "text": "There are a lot of trendy, high priced hamburger joints popping-up all over the city.  Forget about that mess.  THIS is the best hamburger in Pittsburgh. Period. Don't forget to order the potato salad, too.\nBloomfield is a great neighborhood, maybe the safest in the city. There are a fair amount of eateries here.  Pass them up. Go here.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 5, "date": "2015-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6MQjQ3jfCUUxItIvKadJsw", "review_id": "zdUnvhB6HmvXNaPqjgC8MQ", "text": "Years ago I definitely would have given this Boston Market a five stars.  I now give this Boston Market four stars because of the corporate policy.  Boston Market serves their meals on real glass plates and real silverware.  Once customers are finished with their meals they leave everything on the tables.  During busy times when the dining room often looks messy as tables are often cluttered with napkins and dished which often have uneaten food on it.  I like the old method alot better.  Plastic plates and customers throw their own trash away.", "business_id": "uOwuJJhGaiAzuaDY7-o14g", "stars": 4, "date": "2014-08-19", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 2}, "user_id": "fBdl02j2Yp8glZ_8woQzoA", "review_id": "C96X978XGr7AH4sTSb4l2w", "text": "Typical dive bar. Mostly Mt.Leb locals and families, but smells like an old fraternity house. It has a lot of beers on tap and a great following. I like that it's close to my apartment, but I'd rather stay at home with a bottle then venture to the Saloon.", "business_id": "jJfTh2O3M2Q716akd9Dr9w", "stars": 3, "date": "2014-06-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "JEvkfVPf_DuhX-ntE5L6bQ", "review_id": "16rwPJhbnUEwRgT824fOHw", "text": "Mmm not too happy with my recent experience at Harris grill. I visit Ellsworth ave plenty and I have been to Harris grill on numerous occasions. After working all day, and driving 2 hours to get home I was a little grumpy and wanting a good drink.\n\nMy two friends and I decided on the sangria. I've had it on numerous occasions and it can really hit the spot. The waiter suggested the caraf but HB warned us saying that they stuff it full of ice. The waiter insured us we would get around a glass and a half. We bypassed HB and ordered the caraf. Upon arrival we knew it was no bueno! The caraf was heaping full of fruit on the top followed by way too much ice. Our serving glasses also were heaped with the stuff even though we had asked for lite ice. I asked the waiter to pour for us bc I knew sangria was going everywhere. We ended up with our glasses 3/4 full and a watered down juice cocktail. We all told the waiter that it was pretty awful but he did nothing to correct the insult. Never ever order the caraf!!\n\nTo eat I had the pulled pork sandwhich and a side of mac n cheese. The flavor of the pulled pork was good and the pasta was delish. I will say the pork had some fatty bites that I didn't care for. All in all when the start of  a dining experience starts the way ours did it can be salvaged with the right customer care. Ours wasn't plain and simple.", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 2, "date": "2011-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IB4Oxk8IlNG2K0oH0I9Dkg", "review_id": "t1gvtF0G9g3EqGQXd3XMQA", "text": "I've been to Harris several times before but always seem to forget to Yelp afterwards. However, my last visit left an impression and I couldn't forget to share thoughts with all of you! \n\nWe started with an appetizer of hummus, pita bread and vegetables. I was actually introduced to hummus at Harris about a year ago and judge other hummus selections in comparison to Harris'. It's sooooo good. It's thick, a tad bit spicy and perfect to munch on before and during your meal. \n\nDuring my last visit I ordered the Henny Penny and I was definitely satisfied. From the description, I knew it would have a \"zing,\" but I didn't expect to be a fire breathing dragon (it's all good, though! I like spicy stuff!). They used a certain breading that almost reminded me of a wing-dust seasoning to bread the chicken in and topped it off with vegetables and a delicious homemade mayo that added to the zesty-ness of it all. Of course what sandwich isn't perfected without fries! Yum!\n\nMy only complaint is the crowd. Maybe because it was a Friday night? Maybe because it was during the Pride Pub Crawl? I don't know... I just don't do well with screaming and obnoxious people as I'm trying to eat my sandwich and have a conversation with my friend. We were even upstairs and away from the bar. It's all whatever, though. Between the food and the good service, Harris always has me happy.", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 4, "date": "2014-06-23", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "SfrDwnQpTWNs0R-oewFn4A", "review_id": "Ll7g_rxxpZQpiXz2vFCOdA", "text": "Do you like sports, beer, and fried pub grub and sandwiches? How about Shadyside? \n\nAnswering yes to these questions would probably mean you already know about the Tav, but should you not, this might be your place. \n\nAdmittedly, it's not one of my regular spots, but I'll submit that when an occasion calls for multiple screens of sports, copious amounts of food and booze, and a energetic atmosphere, the Tavern hits the spot.", "business_id": "vSZDiKiF8vf9zt_BcDL7GQ", "stars": 3, "date": "2014-06-24", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "v_jtMYfvtNFZ7AjIprSPEw", "review_id": "vc2DYPkUF9AW3HP3oXEuqw", "text": "If you like waterlogged pasta, runny sauce and food that really is not that good, by all means eat here.  \n\nWater is cold, so that's a plus.", "business_id": "Ln34kwDUNZPLhVhUqauLWQ", "stars": 1, "date": "2012-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oNADWgmNVbwQXD8Fj_9tiA", "review_id": "agjeY6T7K_pF0PzxJL3ROw", "text": "Great BBQ plate, amazing slaw on burger. So glad I found this place right near my house.", "business_id": "jyF0rwmQEIdDWVtP5vlf3w", "stars": 5, "date": "2013-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Vn6amB0qx5wWzdz4tFKf_Q", "review_id": "wy5vrpQTS8yekLJTtAxZ4Q", "text": "We ordered the lobster and shrimp dip. We had to send it back twice because it was too cheeseeeee.. yes!! The chips kept breaking whenever we dipped it in the sauce because the cheese made it to heavy. They ended up taking it off the bill. We then tried the parmesan chicken and bake potato. It was gooood!!! It was enough for two to share.", "business_id": "AUDuCSWYzzRP3H2w7TxtuQ", "stars": 4, "date": "2013-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9yrI-bvraRSe5WQbktSJHg", "review_id": "-FaGIb9snCWH9UjZKtCQAg", "text": "I received a free entree coupon for my birthday from Tony Roma's, so I used to it to get some takeout since I am alone this week and my husband is gone on a business trip. Otherwise I would have brought him with me and we could have dined in! \nI'd never eaten here before, so I thought it would be great to give their food a test run.\n\nThe girl who brought my food out, (hostess I assume by outfit) walked over with a straight face and asked me if my name was the one on the to go order. It was. She handed me the food and still with a straight, almost unfriendly face asked for the coupon. I handed it to her and gave her a tip also. I always tip, even on free food! I was a server for 2 years at Red Lobster. She didn't smile once and gave off a very unfriendly, almost hostile vibe. Really made me sad. She made me feel like crap for using the coupon that the company sent me!! And I gave her a tip!! Its not like she got nothing out of it!\nI ordered the steakhouse burger (was craving a yummy burger since Im pregnant) and fries. The fries were bad. Not crispy but chewy and not very salty. The burger was pretty yummy, but was slopped in the box carelessly. :/ \nDoesn't seem like good customer service. This was my test run, and I know not to go back and take my husband now.", "business_id": "QMZe84KFyZy0IlCBb1v91A", "stars": 1, "date": "2012-06-19", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 5}, "user_id": "ZcEstCa4fDhNXrkZ8_Gh0Q", "review_id": "jL5mbcTUkciHtw7ouYDruA", "text": "Good fried pickles. Good Chocolate Martini. When I moved to Charlotte someone took me here and then I didn't know anywhere else to go yet, so I would go here quite a lot - even took my visiting family here. It's a good bar, joint, eatery, but after I found more stuff, I never returned... not sure why..\n\nI do have fond memories of the chocolate martini...", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 4, "date": "2010-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RxhJMMXcA2aM8VfkGkO59g", "review_id": "twRPt02pjaq-L8bYKVGr1A", "text": "I have visited Charlotte many times but had not been to the restaurant before last weekend. This is the perfect place to go for good food, beer and atmosphere.\n\nIts a real gem, tucked away but worth looking for and is firmly on my list of favorites in Charlotte.\n\nIf I lived in Charlotte I would be a regular.", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 4, "date": "2013-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V0mCFwCzkSWC_-htGIPtjg", "review_id": "0H3o6UxaOdPBUGxqJCtCwA", "text": "Showmars is great for breakfast and lunch.  This location does have the preferred combos of grits...hash browns..eggs...and the meats of choice.  Everything is prepared well.  Seating is never an issue...and i can get in and out in 30 mins.  The restaurant can get busy at times...and timing may halp.  With the various locations...they are pretty much the same on service.  I have to admit....coffee is hottest at other locations than here on 3rd.  But overall....you cannot beat the convenience!", "business_id": "ASwN3Ih0Eh1oH0npLbzVjA", "stars": 4, "date": "2015-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "A0MO8ozPFybC4tytXiv3dQ", "review_id": "bStjuAuUpfr1N4IaHifnCg", "text": "3 friends and I went to Morton's for the National Filet Mignon Day where they serve $1 Petite Filet Mignon Sandwiches in the bar area. We waited for about 40 minutes for a table, and when we were finally \"seated\", we had to stand at a high top table because they had run out of chairs. The waiter was obviously busy and when he came over to get our drink order, we went ahead and gave him a standard order of 20 sandwiches for the table. He brought us our drinks and then left us to converse. Then we waited for our food.\n\n20 minutes\n\n40 minutes\n\nAN HOUR.\n\nWe started noticing that other patrons were receiving their food when they had sat down well after us. One of the guys at our table tracked down the manager because... oh yeah... we hadn't seen our server since we sat down. If anything we wanted another round of beers.\n\nThen the manager came over and gave us some less than thrilling news. The waiter NEVER PUT OUR ORDER IN. He simply forgot, and we had to listen to the manager ramble on incessantly about how crowded and busy they were and this should somehow make us understand. \n\nSide note: had the waiter written the order down, he wouldn't have forgotten! This is doubly important when the manager was falling over himself in a hungover stupor, pleading with us to see from their perspective that it's all okay because of how busy they were. \n\nOur food was rushed out and when we called for our checks, we expected the sandwiches to be taken off the bill (I mean it was $20 for 4 grown men) and he only took off 50%. That saved us each a whopping $2.50. Gee thanks grandma!\n\nThen the cherry on top was that the server (or was the manager handling our table now?) didn't come collect our credit cards, so we had to walk the bill up to the bar so we could get out of that godforsaken place.\n\nFinal note: This was the first occasion I have ever left zero tip for service at a restaurant, but it simply was that bad. I will never go back, and we are telling all of our friends about our horrible experience.\n\nHey Morton's! 1) Write down orders so you don't forget. 2) Don't complain to the customers about how busy your restaurant is when you are providing a deal that is going to fill your bar area to capacity! WE DON'T CARE! It's your job to provide the service.\n\nI wish I could leave a no star rating.", "business_id": "Lt9o2RmacVY2L-IWLA8uTg", "stars": 1, "date": "2015-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1HzVU9uQI0XJ73gY25IDLQ", "review_id": "9je_tjb5cTJe8wGnnIMhUg", "text": "Yes! Yes! Yes! If you are weak at heart...don't come here! Cause you wil experience multiple foodgasms!!! I was a fan before they changed the decor, and now it's that much better! \nMy favorite app is the Artichoke and Crab Dip! 0_0 with the crosctini bread! OMG! Every entree has been deelish! They have it all from burgers, to salmon, to salads! All homemade...and we haven't even gotten to dessert yet (Which is also killer of course!). Seriously! Make sure a bed is near by after you waddle out of there! lol \n\nMelissa was our sever last night and she was super cute and super helpful! Great food! Great Service! Clean and Modern decor! Free parking! Descent Price! You just can't go wrong with this place! \n\nComplete and Utter Satisfaction! Guaranteed to please! Every time! ;)", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 5, "date": "2012-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AmoGRBLnfxFZuCOCuru_Cw", "review_id": "BxVV7ETyfX0pHzTkr38CHg", "text": "By far my favorite restaurant to eat at in all of Charlotte! I refuse to try anything other than their fish tacos! Everyone that I have visited the restaurant with raves about their burgers but the fish tacos are by far the best I have ever had! The beer that is brewed within the restaurant/brewery is also delicious and I make sure to get the beer sampler every time I go so that I do not have to pick just one. The atmosphere is also a huge highlight. Part of the restaurant is a laid back, sports bar type of restaurant while the other half has a swanky feel to it. You can definitely go in jeans and a t-shirt or dressed up for a night on the town and be comfortable. The bathrooms are always cleaned and are regularly checked and the service has never been poor. Sometimes, I consider driving the 2 hours just to go! Make sure to check out this place next time you are in Charlotte!", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 5, "date": "2015-06-30", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "8uOmnlKFYIPkNCn1v8-DVg", "review_id": "yHFnO7EV84YElqD9w7KcaA", "text": "Cozy and welcoming.  This is my impression upon entering Hartigan's.  The menu features typical pub favorites, such as nachos, wraps ad burgers.  I chose the veggie burger without the bun and, dare I admit this?  Tater tots!  Ok, Ms. Healthy likes to splurge, too!  The burger arrived with tomato and lettuce, and there must have been a whole bag of tots on my plate because I couldn't finish them.  Friendly and helpful servers, too.  The only thing that I did not care for was the bar's playlist of current, top forty music.", "business_id": "EwuvZCcVHkICgTbqCEjikA", "stars": 4, "date": "2013-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8FfOxzvenYL8lXs72OFZqw", "review_id": "m3vCwh5-Xat0JgoGnprYzg", "text": "We come to the Charlotte Cafe periodically primarily because they have a good variety of veggies on the menu.  The food is, like I said above, a-ok.  You won't write home about it,  but we find it to be just fine. It's like diner food to me.  \n\nTonight, I had the pork chop, and I've had it before.  It was good, tender, and cooked properly.  I had the collard greens and they were just fine!  Not full of stems like some I've encountered.\n\nThis is an \"easy\" place to go.  Easy to go with kids; easy to take your elderly mom.  Just easy, and not pretentious at all.  I see that others have complained about the service, but that's not what we have encountered here at all.  Maybe we hit the \"good\" days, but the wait staff has always been friendly, accommodating, and our service has consistently been good.\n\nSo, if you're looking for a unique, perhaps romantic, fine-dining experience... go across the parking lot.  But if you want a good meal, at a fair price, with several options to choose from, and in a relaxed  atmosphere - try the Charlotte Cafe.", "business_id": "b856Q36EWKbwbm_XdJER8Q", "stars": 3, "date": "2012-06-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "o3yLp6HGYKBVF5NwHXPDsg", "review_id": "ZQKnKqh8skASocghDAv5ow", "text": "Stopped in here for a business lunch. A bit loud but still was able to speak clearly.  Ordered up some shrimp tacos.  Was warned they had a bit of a kick. They did and they were good!  Really enjoyed them.  Service was dead on too.  Def a place I would go back to again if I was in the area.", "business_id": "hIQRiE3UsYH7UsrsDwJwLA", "stars": 5, "date": "2012-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1aQxz7JoJgZIldX4GFNTug", "review_id": "7r8MhoWF1CVNM7w6k5OoAQ", "text": "Rustys is legit- one of the favorite local places around here to get a burger and fries. Really popular with all the nearby highschool kids from South Meck and for good reason- it's great food at a fair price. Would definitely recommend it to anyone that asked me for a great burger, my personal favorite being their bacon cheeseburger. Has a hole-in-the-wall atmosphere to it and is family owned, something that is becoming too rare of a thing nowadays", "business_id": "WkD7OrSIHLzgOQo9wQHu-A", "stars": 5, "date": "2015-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s8__YQ4ZfODcmWlpCJ1-hA", "review_id": "Y8PeejHPm1G__07UgcMQDA", "text": "Lots of variety and the food is good. There can be a waiting list, but it typically moves pretty quick so don't be discouraged if you see a line if people outside.", "business_id": "UzMMpUFwJhwUkHOyeXeWsQ", "stars": 4, "date": "2014-06-09", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "MB27EijP5npfsUvKUPLPXA", "review_id": "9T6B75R8JHI8sn0Md-pPnA", "text": "Ted's is NOWHERE NEAR Eastland.  It's a stone's throw from McAlpine Park and the train bridge on Monroe Rd.  That's about 8 miles  from Central Ave at Sharon Amity and shutdown forever Eastland Mall.  Don't say no to Teds thinking it is in the HOOD.  It is not.\n\nIf you like the big, greasy-delicious cheeseburger, hot fries, and sweet tea or soda,  Teds is a place you must visit once in your lifetime and their fare is far reaching including great combos, BBQ, salads, pitas, sandwiches, and desserts including eclairs and baklava all made fresh on site.  They sell tees and ball caps too if you want a souvenir.  Located between a small strip center of Latino businesses and a tattoo parlor.  Look for the big yellow sign.   Inexpensive and delicious. Great little place and well maintained.    Andale Andale....hurry.", "business_id": "CESMPxEWnj42f4nTXV3_yw", "stars": 4, "date": "2010-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gQlLuTUG49u3z7bI1ySKmw", "review_id": "YsfDNbSAWFEI27kDKBAdAg", "text": "Situated on the corner of a strip mall, this place is fairly easy to find.\n\nThe atmoshpere is that of a fairly traditional pub. Lots of dark wood lines the walls and the place is covered in saucers, some merely decorative and others representing those in the \"UFO Club\". There is an area for live music, and a couple of dart boards, I did not wander around or to take in the entire place, but I was told that there is an area with billiard tables as well. Really, it's a nice change from some of the Charlotte area drinking establishments that lack character and are littered with TV's...\n\nThe service was terrific. The waitresses are wearing school girl outfits, complete with tiny little plaid skirts, knee high argyle socks, and skin tight tank tops. Somewhat similar to the outfits worn by the Tilted Kilt girls. Quite appealing. Aside from thier appearance the wait staff seem to have at least a rudimentary knowledge of the beers on thier list.\n\nThe beer selection was outstanding, somewhere around 100 taps, and at least as many bottles covering a wide array of styles. If only they planned thier food menu as well.\n\nThe food was uninspired, and fairly plain. Fairly standard chain pub fare, and not terribly well executed at that. Not that the food was bad, just not terrific. And definately not worth the prices.\n\nThey do have some specials, I think they have a couple of days a week where drafts are $3, but overall I found the beer and food pricing to be a bit high.\n\nOverall, I would definately go back. The atmosphere and the extensive draft list are alluring, even if the food is not.", "business_id": "F-e-sWfVd3eCYll3BP1QFA", "stars": 4, "date": "2011-07-13", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "1QNyeXl4AEizT2FWs7gNBg", "review_id": "N0QKo7pvDWLFUzCl9BqAgQ", "text": "Oh yeah.  Even the pubs in Dublin aren't as merry.  Lots of beer and menus is mostly german food.  \n\nThe waitresses are really cute, lots of beer to chose from and the food is good. I had their German plate. It comes with German Potato Salad and it was tangy, warm, and there was some herb in it. Plate came with 2 sausages and a heap of saurkraut. I will likely eat it again.\n\nThis place is wonderful. People are relaxing, the beer is cold and the waitresses add to the fun.", "business_id": "F-e-sWfVd3eCYll3BP1QFA", "stars": 5, "date": "2013-08-18", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "ylTdk2m5D-B82y2vB_Oojw", "review_id": "ypb-prQDBTAONftKW61n2w", "text": "My food was pretty good, got a 4 berry fizz and really enjoyed it! My Boyfriend didn't enjoy his meal as much. He wasn't impressed with the sausage or Ham in his lumberjack meal. \n\nService was great, friendly and talkative.", "business_id": "687wG68J1XicP5YzMqKqFQ", "stars": 4, "date": "2010-07-28", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "31jwdjIsHSmJoZRBwq-3tQ", "review_id": "K4mH1s5n3PcgtiVuO5h_VQ", "text": "Absolutely the worst bar I've been to . After about 5 drinks I realized they purposely made their drinks extremely weak. I spent so much money and barely got tipsy. I told the bartender I was disappointed with my drinks and she literally screamed at me as I walked out of the door ( I still left her a good tip!) I will never ever go there again. Trashy, nasty and extremely rude staff. There was even a fight with some dude broke glass and almost hit us with it and there was no real bouncers- just a few people who worked there who barely stopped him from attacking us. Completely ruined my night-especially the rude bartenders.", "business_id": "IbWfpebkP64zWgc9-ZVtZA", "stars": 1, "date": "2014-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tF49QQ-QfGEf9FPHLCZfrQ", "review_id": "JrG5XN5eTZ7J5xpcE6fwOA", "text": "We were seated in a booth in the bar area on a Thursday evening, and the place was pretty packed. Had a great waiter who was attentive, made good recommendations and brought us our drinks and food quickly. But here's the thing: The place had an unsavory vibe. Overweight single men on one side of the bar, groups of women in tight, revealing clothes on the other. Groups of very drunk patrons in booths. At the end of our meal I asked our waiter what was going on, and he confirmed the worst. He started his description with, \"Have you ever read Dante's Inferno?\" He said the other parts of the restaurant were okay, but that were were seated in was around the eighth level of hell. Great waiter, average food (hey, it's a Friday's, that's all we were expecting) but NOT a family place.", "business_id": "qZ1bDtcercwUw4w7trpVjQ", "stars": 2, "date": "2014-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LDrpATl7viHfGGeUKzPeZA", "review_id": "xpQe4tiCdZuQdmQsgtMErA", "text": "OMG!  The bakery items at Pinecone are AMAZING!   Cinnamon rolls as big as your head and absolutely scrumptious!   The food in the restaurant is great for truck stop food.  We've only come for breakfast but stop every single time we head up to Rhinelander,  WI.  Do NOT miss this place if even only for their baked goods!", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ", "stars": 5, "date": "2014-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rL7XG25E24mErfg9sZ_-wA", "review_id": "dexeF9_xWX_96Zm63Q7zSQ", "text": "We love The Green Lantern. The food is wonderful and the price is great. We have never had a long wait for a table and once we are seated we are always waited on right away. All the staff is very friendly and atmosphere is welcoming. We have taken several friends here for dinner and always have a great time.", "business_id": "rdAdANPNOcvUtoFgcaY9KA", "stars": 4, "date": "2011-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "uSlKnryLlnD3mvmG6DIyCg", "review_id": "86-dCOqgEn-Qf-9cK8H4HQ", "text": "The Hody is a pretty solid local bar in Middleton that often has great live music and decent drink specials.  Thursday nights feature Westside Andy & Mel Ford, and that is always a good time.  There are decent taps, though last time I was there I believe they had removed Esser's Best which was my go-to every time there.  Most of the specials tend toward the $1 shot variety, but I especially like that Capital pints are $2 on Wednesdays and you can get pitchers of Spotted on Fridays for a crazy $5.  I also learned that your second drink before noon on Sundays is free, and domestic taps are 50 cents.  More on that later.  The bartenders are for the most part good, but if you're there on the wrong day they seem to forget about you in favor of talking with the regulars.\n\nThe food is pretty standard: not too fancy but good.  Sometimes the food doesn't come as advertised in the menu.  Once I ordered a Reuben that strangely was lacking Swiss cheese, though I didn't notice until halfway through as it was still a tasty sandwich.  I like the bison burger here, but the last time I ordered this it came sans tomatoes, likely due to the salmonella issue at the time.  Also that day my sister found the Hody Chicken's buffalo sauce to be beyond her tolerance for spiciness.  My sister's boyfriend was suitably impressed with the Hody burger, but he thought that they had left of the special Hody sauce.  It might have just been a bad day, because most of the other times I've been here there were no problems.  I do believe that the overall quality depends on the day you stop in.  Some of the bartenders kind of throw things together, while others take their time and do a decent job.  I haven't been there regularly enough to establish a schedule, so it's been hit or miss for me lately.  I've also tried a few of the appetizers and the onion straws and quesidilla wrappers are very good every time I've had them.  \n\nThe main drawback with the Hody is the regular crowd.  On Thursdays when Westside Andy & Mel Ford are playing the crowd is great - a variety of people, young and old, some dancing to the music, some sitting at the bar or nearby tables.  Other nights the crowd can get a bit too townie for my liking.  It can be uncomfortable, especially when half the bar turns to look at you when you walk in.  Sundays can be the worst.  I think that some of those people nearly live there.  The place is pretty open and there is a lot of space, but it still can get quite smoky.  There is a few outdoor tables along Elmwood, and these are perfect for a weekend afternoon.  I would probably return to the Hody more if it weren't for the small inconsistencies in the food and the slight hostile feeling that I sometimes pick up from the regulars, but overall the Hody is a reliably good time.", "business_id": "xbJ9tdGbcVJIUkNgHSCwZQ", "stars": 3, "date": "2008-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oq0sNYxNoJh1hQM9QrG4PQ", "review_id": "oFb8jitB3Oo1mu1wWRJifA", "text": "Delicious pork sandwich with coleslaw and very attentive service at modest prices in a rustic atmosphere", "business_id": "6oDZ78JiSKjXVLcurCpnhw", "stars": 3, "date": "2013-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "6GAAVGXb7tICeL8Iiv7ORQ", "review_id": "HwfOXLwww4M66cWmAlz5bQ", "text": "Classic diner - without the heartburn! Our family loves this restaurant. My daughter is addicted to the cinnamon roll french toast. My son loves the cheeseburgers and I LOVE the Deluxe salad with amazing french dressing (yes, it's that good!) The ranch is good too (with chicken strips of course!)", "business_id": "MlWXHxdbIODf9GUcvUTfGQ", "stars": 4, "date": "2015-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LBl_A8nVpJhIqBi6NLBuHg", "review_id": "usUBXMlaT4mc_0MN-jkb2A", "text": "The food here is just ok. My children love this place. It's family friendly and works for us at times.\n\nFood- ok. I usually order a guacamole burger which has guacamole, bacon and cheese served with a juicy beef patty. You really can't go wrong with those ingredients. \n\nService- good. The servers usually try to please my children and that makes me happy. My children love to end their meals with a gummy burger from the bar.", "business_id": "1hBOR97oX5Xph3J8Tdob7w", "stars": 3, "date": "2014-07-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W98XXlfqmjZ8y8P-y9yzCA", "review_id": "TSURDSZSXaNztXpCifaf-w", "text": "Went for lunch today.  Mozzarella sticks were barely warm.  Waitress kindly brought out a fresh order.  I had double crunch shrimp as an entree.  Honestly, I've gotten better quality shrimp from my local grocery store's frozen food dept.  The coleslaw served with it was literally inedible.  Little to no dressing and tasteless.  Service was good though!", "business_id": "JdCFcgw4yk4M1ZRhAhBIag", "stars": 2, "date": "2015-06-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "_xf2ECTRftPV4bzK4mGYEg", "review_id": "SIcc0AvxJt6NjQ_TlTlbCw", "text": "Monty's used to be one of my favorite places on the near-east side.   I've long loved their Meatloaf of the Gods, fat and calories be damned.  However, our last 5-6 experiences have been exercises in frustration, with such charming features as a $100 overcharge on my debit card for a $23 meal.  (yes, you read that right).  Yes, the server was new, yes they corrected it, but still.\n\nWe ate there again last night- I'm a firm believer in the power of the 19th chance-, only to leave with a renewed resolve that there are many better options available.", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 2, "date": "2008-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NN21fMW85Mj-_F-RrSawnw", "review_id": "vrg5zhbZ32COyUS_p-OJOA", "text": "I've been coming here since I was in middle school and it was the cool place to hang out on half-days. 6 orders of waffle fries, anyone?\n\nWe went last night for an early dinner and squeezed 7 people into a booth. I got blueberry pancakes (LOVE breakfast all day) and they were okay.  My friend's french toast came with apple butter though, and slathered on top of the pancakes = much better pancakes.  Around the table there were also a few types of burgers, a meatloaf sandwich, a fruit plate, and a whole lot of milkshakes and sundaes. Big let down: they were out  of over half of the mix-ins for the milkshakes/sundaes. You can't have a dirt cup without gummy worms!\n\nOverall, I've always liked it here. Service can be hit or miss. Food is pretty good. Milkshakes are hurt-your-teeth sweet.", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 3, "date": "2011-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "85nylCmAU6lQPlx2gRnQ2w", "review_id": "BGshoRX3p_LgByryqYUGvA", "text": "Stopped in this morning for breakfast and pie. They make great corned beef hash and home fries. The meat is hand cut from locally sourced beef, and all the ingredients are fresh and tasty. \nFor pie my server Kim surprised me with strawberry rhubarb ala mode. Again fresh and delightful.  \nMonty's offers fantastic diner food and a wide range of fruit and cream pies. You can't go wrong here.", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 5, "date": "2012-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1oXsV_I0TeschDfjM3Mr5A", "review_id": "uY6B6hxElN65rKEVUdtkBA", "text": "I have a love/not love relationship with Monty's. I used to love them for b-fast when I ate omlets. Now that I'm vegan, it's kinda hard to love them. Many of the items can't be changed, so if you're not a fan of onions or even allergic to them, they can't come out of items because they are pre-made in batches. They are my last ditch place to go to if Lazy Jane's, The Green Owl or any other place is busy or closed.", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 3, "date": "2014-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sKdjtXax55YvWcBhtarnCg", "review_id": "rrDr_Ziamsn6Y1IxZqLYhQ", "text": "Came here with the gf after a crappy brewery tour. Great good. Got a mushroom n swiss burger that was very tasty. Love these diner type places. Not sure I'll be back as I live in MKE but if I'm ever in the area and have a craving, I'll be sure to stop back.", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 4, "date": "2015-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mqBxSIVvsIiVty7QCNPjuA", "review_id": "Oc7hxiaX7K8EZkkiC5JXig", "text": "We were able to sit outside, on a perfect night. The server was great and very attentive despite having to cover the 6 tables outside. But enough about that, let's get to the food! It was fantastic! I don't normally eat vegetarian dishes but I decided to to try the \"Meatless Meatloaf\". I am so glad it did. It was very flavorful and the sauce had a nice peautnutty taste. The mashed potatoes were rustic style with the skins and very creamy and a very generous serving of broccoli was on the plate as well. My mom had the curry and I tried that and it was super yummy with a nice kick at the end. We were full after our meal so we did not get to try the desserts/malts but everything looked amazing when it came to the other tables. If we lived near by we would be back and I will be suggesting to others that they go here! It is a must do in Madison!", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 5, "date": "2015-08-13", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "XjaAm3x_7u4Otc-DG-buvA", "text": "It's been nearly a year since I've become somewhat of a \"regular\" here, so it's probably time for an update.\n\n+ New ownership/management, effective sometime late last year\n+ Same 'ole Harmony - big bar, plenty of seating, plenty of televisions\n\n+ Decent tap list, ever-changing, although staples remain constant (Cow, PBR, Bells)\n+ Appetizers are where it's at here. Pub chips, curds, etc - all are very good\n\n- Specials are hit-or-miss; some are great, some are a bit less than great\n- Pizzas; I'm not a huge fan of them. Too much cheese, sweet sauce, and just not super stellar. Pricey, to boot.\n\n- Last visit was a bit funky, quite literally. It was quite sultry inside; as if the A/C wasn't on, or couldn't keep up. Then the Harmony's softball team arrived, fresh from an evening of playing... and the place started to funk-up, odor-wise. Adding insult to injury, the bar staff and kitchen became overwhelmed... I sort of agree with Chopper C's assessment of the male bartenders - they're quite surly and often seem very perterbed, especially when the place is busy like it was earlier this week. \n\n+ Pub chips were great, as usual\n+ Marinated salmon Cesar salad was good; salmon a bit over-cooked and grey, but still tasty\n+ Whitehouse Smoked Turkey sandwich was outstanding\n\n- Cash only\n- No Fish Fry on Fridays\n- Odd hours/conditions around pizza availability", "business_id": "KHOHjA8HOcTlFBCtMQFv8A", "stars": 3, "date": "2014-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UJBLaPAI7mL60OCZnld5TA", "review_id": "6LRo8ee2q_Frw06Yv8j5-A", "text": "This place has its ups and downs. For a chain the burgers are generally very good, and the steak fries are tasty with the house seasoned salt. If I could I would always get a burger to go, though, as the dining room is full of loud little kids and tacky crap hanging all over the walls.", "business_id": "4pZeC9W0EIiBTOJMnwG2vw", "stars": 3, "date": "2008-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sfkBY5gAZdw0i32fhgvH-A", "review_id": "5t_s-zrqzWTacKc5sfXTNw", "text": "Service was awesome, but a little pricey for stale rolls.  I generally dislike TV's in a restaurant, and Toby's had a lot of them. The food was standard.", "business_id": "FIR1SRvSAMNTO3VvNaJn2g", "stars": 3, "date": "2014-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gXlRmTqLxc8pgnfXwt0iEg", "review_id": "K7nr8Sb9U8kHaV-98-Gdmw", "text": "Sends out plastic coupons in the mail to enrich themselves at the expense of my planet and the air that I breathe. Obviously could care less about the health of their customers.", "business_id": "R825-NTAI2wG2C4mN-dtNA", "stars": 1, "date": "2015-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 3}, "user_id": "hRflciflE77Ekmg5gGNwiQ", "review_id": "RuKGo-YENh0aI4b2izC5jA", "text": "I always get the beef and noodles or chicken and noodles. Absolutely wonderful, home cooked meal. The noodles are served over real mashed potatoes, come with a side or salad bar, and a roll. I've never had a bad meal here. Since it's so hard to make room for the Apple dumpling- I always get it in a to go box. Makes for great left overs!", "business_id": "Gf9HbiraKNZpxbxwScHBVw", "stars": 5, "date": "2015-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9nyfJOEP7U5kjKrd2o4SEA", "review_id": "oZC4lj6zABAH23Ylr7ovZg", "text": "Service was horrible from the start. We waited for an eternity just to get menus. There was even a wait after I personally had to ask them to bring us menus. The waitress said they are very busy but the place was at 40% capacity. I understand if things are going slow but the amount of time before we even got our menus was a little ridiculous.\n\nSecond biggest problem is that nothing comes out at the same time. We had a party of 6 and 4 menus came out, before the next 2. Only 4 waters came out, before the best 2. All of our burgers came out at different times. Also, between each visit from our waitress, there is a long wait.\n\nNow the food. I got the California burger with onions rings. The burger was extremely bland, you hardly notice there is guacamole, bacon or basically anything. I'd be shocked if they even seasoned their burger patty. Only thing worth anything was their perfect onion rings. Today they had half off burgers, which is the only reason why anyone should try their burgers. At full price, I'd rather go to Burger King or TGIF.\n\nIt's also unfortunate that their 2.00 bud light draft special was broken. I thought they'd replace the deal with something else other than can bud-a-ritas...\n\nIf you really want to try this place come for half off burgers. On a Thursday. I'm thoroughly disappointed.", "business_id": "1T2rnvl67Gk9Uc0gzsCKQA", "stars": 2, "date": "2014-06-05", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "qND0y_3FE2MIRkwocUBu_A", "review_id": "cWLx4o466Mok4Z7g5NxW6w", "text": "Great alcohol. However I was with a group of 3 and we ordered multiple drinks because we are all semi alcoholics and they told us we could only have one drink each. You all have lint butt.", "business_id": "pPWre8lbVAssER6CN0uWMw", "stars": 2, "date": "2015-07-22", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 3}, "user_id": "4ozupHULqGyO42s3zNUzOQ", "review_id": "DZZPg9VBgaR5CQvkNcRPEw", "text": "One afternoon, as the All Stars were about to take to Chase Field and play America's favorite pastime, we stopped into Marjele's for a bite to eat. First of all, it was July and for people like us who live in Arizona, the heat is here to stay and we learn to deal with it. However, for visitors from all around, the 110 degree weather means that they will not eat outside. So we had the choice to wait for an indoor table or take the patio seating that had immediate seating -- and I mean, every seat was available on the patio. The hostess looked at us like we were crazy as we took the patio and we proceeded to order food. Now, contrary to common belief, just because a sports bar is named after an athlete, doesn't mean that athlete frequents there every day. But on this particular day, Dan Marjele happened to walk into Marjeles. The irony cracked us up because we knew that the out of towners probably assumed this is a regular occurrence. And hey, maybe it is! \n\nAnyway, this is the perfect bar to grab a quick and decent bite to eat before a sporting event downtown. The buffalo chicken is delicious, as is the Chicken Teriyaki sandwich and any other wrap on the menu. It's one or two notches above generic bar food and the drinks also flow nicely. They have plenty of TVs inside so even if you don't go to the game, it's still a fun atmosphere to sit and watch the game on the TV. \n\nI wouldn't drive to Downtown Phoenix just to visit Marjeles, but this is definitely one of my choices when I'm looking for a sports bar before or after the game in Downtown Phoenix.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 4, "date": "2011-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XtwoxCRAkJegukDhswvunQ", "review_id": "yJyDT4gf8DuCesbgkF3ibw", "text": "I think there may be some room for improvement service wise. Notwithstanding, it is probably the best sports bar located in the Downtown Phoenix area. Especially if you are a Suns fan! Lots of nostalgia on the walls and Suns regalia. As far as the food: it's pretty damn good. They have all the usual selections for beer, they may be able to improve in that category. But if you have Kiltlifter, you're doing pretty well in my book. \n\nIf you are debating about going here or TK I would absolutely positively go to this joint! Go Suns!", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 4, "date": "2015-07-03", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "vuUddBhwlrVijAAFvK5UTg", "review_id": "wsJL4OYuuhRfw2MTsitbqg", "text": "This downtown Phoenix Hooters has become a comfort spot for me and my wife. We know we can always rely on friendly service, $5 32oz drafts served in ice cold mugs, delicious fried pickle slices and slightly above-mediocre oysters. The wings are pretty good too, but they go a bit overboard on the breading. \n\nWe came here a lot last fall/winter to catch football and hockey games due to our lacking of a television in our house. Basically any sporting event you can imagine will be playing on one of their many flat screens!", "business_id": "qsWxbgQwuomXvMseg23DGg", "stars": 4, "date": "2011-08-17", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "uzTmh1jCveKLvUjcfN-PQA", "review_id": "pLjjU1t-Zs5iZb7yzQDekA", "text": "This place is good, and it has a nice vibe to it. Very laid back. I just wish it was open longer... but that's not really a big issue especially now. \n\nThe food was good, each time I ordered the Fish and Chips and my signature \"Sex on the beach\" my drink was super good! I had about four of them and could have kept on going. I was on a date with my BF he recommended we go because he went with this co workers. \n\nService was prompt and my waiter was super nice. We were sitting on the patio and the only ones out there, but she still made sure to come out often to check on us. :)", "business_id": "2I666dqzs1XB6xigIKa9bA", "stars": 4, "date": "2013-07-11", "type": "review"}
{"votes": {"funny": 1, "useful": 6, "cool": 4}, "user_id": "4ozupHULqGyO42s3zNUzOQ", "review_id": "3_PdW9CHiV4JVk60qCqY0g", "text": "It's not about the food or drinks here, it's strictly about the atmosphere. You can stop in for dinner and drinks and watch the Diamondbacks play while you dine! Located inside Chase Field, Friday's Front Row literally provides a front row seat to the action with floor to ceiling windows overlooking center field. During a ballgame, there are several options for interested patrons. You can buy a general admission ticket for Friday's Front Row and sit at the bar during the game. You can also access the restaurant with your regular Dbacks game ticket and either sit at the bar or at one of the available tables set aside for walk-ins, all with views of the field. If you want a window seat, you can call ahead and reserve a table for I believe around $50 a person but either all or some of that money can be used towards food and drinks, making it worth it in my book. \n\nThe atmosphere is lively and festive. It's a perfect atmosphere to enjoy a game in and it's family friendly. However, adults can enjoy plenty of cocktails. Keep in mind, it is a TGI Friday's so expect Friday's style food and drinks but it's Friday's with a cool twist thanks to the backdrop of a Diamonback's game!", "business_id": "1-1VcGTL3GyCqUpXZLFTZA", "stars": 4, "date": "2013-07-05", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "3JtdBvnY6Wzp22gt5zFwDg", "review_id": "KCfEevgGU6B-8hdMeJ94-g", "text": "Ok, the others are being way too hard on this place.  I had never had a Whataburger before, and I thought it was a great value.  The burger was very edible, and topped with fresh, ecoli free toppings.\n\nThe place was not in the finest neighborhood, but was clean and well kept.  The staff was friendly as well.  I am fatter for the experience.", "business_id": "ixTr1qXUFGTzyaZUuCDDvg", "stars": 3, "date": "2008-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0XqiKDV9W_VpTEkERWsTog", "review_id": "bSzhjBaSs84-Ti29xfCHBA", "text": "Oh my very favorite! \nPoutine! Not at all like the traditional, but oh-so-good and imo, so much better! Sandwiches served on biscuits?!? Heaven! I only wish this place was open for breakfast. \nOh yes, and service? Top notch!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2013-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JlIFNlISvKrjMHgj1PiK1w", "review_id": "BB3WVKk_z361pK4mWjtK4A", "text": "Tried the fried tomato sandwich, jackfruit sandwich, fries, and squash blossoms... all absolutely fantastic! We also really enjoyed the biscuit with jam for dessert. Everything about this place was great, there was plenty of parking and it wasn't crowded on a Saturday night. The chef and staff were friendly, funny, and so much fun. The diner lived up to its name and if I had one last/first/only meal in Phoenix it would be here.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2014-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mHjm4K_GHbRu_B4Xwr-tRg", "review_id": "7FIqxrl3J6R4DlGu2aJoHQ", "text": "Awesome spot! It's like a permanent food truck/ diner combo with plenty of outdoor seating. Strung up lights and eclectic furniture help create a cozy, relaxed atmosphere. Most important, however, is the fact that everyone working here is nice, attentive, and helpful in providing drink & food recommendations. I can personally recommend their old fashioned, house made ginger beer, biscuits, poutine or pulled pork fries, and watermelon salad. Oh and the slaw on the pulled pork fries and some of the biscuits is amazing! Come check this place out!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-06-01", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "P5t2uh8MlQqJ5fEfByZVyg", "review_id": "lVP95SOBZSwIAfvwy1uqFQ", "text": "Food is great. Food is 5 stars. Service is meh. 3 stars for service. The gripe on the service is probably more to my personal taste. The place is very hipster, customers and servers. I think it would be difficult to be an apathetic hipster and provide quality customer service. Nobody was rude or anything, just blah. It certainly isn't going to stop me from being a repeat customer.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 4, "date": "2015-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "XSJ6MDeUfKX-flwUU0zuFw", "review_id": "KC-GrPJ4aRTvyBRP9iC9Ww", "text": "The seating here is mostly outdoors. Be prepared for that. It ends up being preferable though because of the misters and the fact that Phoenix evenings are actually really beautiful, if you're looking. Along with the combination of string lights and decorations, you'll feel happy to be there, experiencing it. \n\nI don't eat meat so I can't attest to their fried chicken (although when I come with friends they always enjoy it), but their fried green tomato sandwich is better than most things in life. And I will happily come back for that over and over. I don't think I'll get tired of it, but if I do, they also have a vegan sandwich with pulled jackfruit that tastes good as well.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-08-18", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "B4wYawXXCI-5GR6FdCAGJw", "review_id": "N8ziIXyURAEq9M12CRmNSQ", "text": "This place used to be better. To be honest, I really don't like the food here, its boring and doesn't taste great. There's also very limited options for food, so I prefer to eat elsewhere and then come here for dessert. The bar seats are not very comfy and are right in the sun so I would sit in the back where it's cooler. They don't have good AC at this place so I don't recommend going here at the hottest part of the day. I do love the ice cream though! They use Thrifty ice cream and literally have like a hundred different flavors for shakes, malts, and egg creams. Plus they have a bunch of specialty sundaes. All in all, its a great place for ice cream in the morning or evening.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 4, "date": "2009-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "bmbJdUhuu2UFbM70u37njg", "review_id": "SN3o3lQ8S2uw9pDB7U9pqw", "text": "This diner, established in 1928, claims to be one of the oldest in Phoenix so it was our first stop upon arrival.  For two Londoners in America this diner was EXACTLY what we wanted from our American road trip.\n\nThe waitresses looked great with their vintage uniforms and cool hairstyles, and they were so friendly and helpful.  There was a lovely relaxed vibe, an old-style jukebox, a soda fountain from which you could have any number of tasty concoctions, and great menu selection.  There's even a little vintage shop tacked onto the side which you have to pass through to use the rest rooms...I loved it!\n\nThis place is perfect for tourists although we did meet a couple of friendly locals keen to hear about our road trip so far, and at least you know you're getting the real-deal in an original diner rather than a tacky imitation or chain restaurant.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 5, "date": "2011-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dRWhriMqMw5NlVzbus0jgg", "review_id": "Lsk5600FdUNW5MfRI_srRA", "text": "The food is absolutely dreadful. I ordered a cheeseburger and it was undoubtedly not only the worst cheeseburger but probably the worst meal I have ever eaten in my entire life. The place has this really strange odor when you walk in, and I should have left when it hit my nostrils. However, I thought I would give it a chance. Big mistake. The service was good.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 1, "date": "2013-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RzS8kWogWc2HZPUZVWfxfA", "review_id": "pyWxyU32yOfrrZBZvUtK6g", "text": "Native Phoenix-er and never been in. Finally went in yesterday. Wife and I had dessert only. I thought it was good and an overload of sugar. Like the decor. Really felt like we were in the 1950's. Waitress was nice and friendly. A bit pricey but I guess the rent in Phoenix to stay open has been increasing as well. I hope they stay in business.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 4, "date": "2015-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kvxh7dP16jVCsVQv3J2dbg", "review_id": "q8Lcvn8yXJE3R5LAc8K4mA", "text": "Don't waste your time. The waitresses are beyond slow, and once they are done flirting with the table next to you, she might  visit your table and then disappear.", "business_id": "hzUOqxpcnYYBgLlrgvjQYQ", "stars": 1, "date": "2012-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5S9qsoHWUcMeahMtBwuX3g", "review_id": "2USBTocZ-fOarX6_OWqwbg", "text": "When it's late and everyone else has closed on a weekday, it's either a trip to Delux or a trip to here. When my wallet is weeping, this is the place to go. Their remodel is great and not so cluttered anymore, the place is always packed because the happy hour beer is cheap, service is able to keep up, and so far I haven't had any major qualms. Everything has been quite a good experience and the food is what you would expect from Applebee's. Not extravagant, but not absolutely horrible. Their sirloin choices are perfect for when I want to keep the calories as low as I can at an Applebee's (I really should be going to Sweet Tomatoes next door, but I lack self-control) and they give generous portions for everything.", "business_id": "cjUmPLRT43wN9Z87A9BOpg", "stars": 4, "date": "2012-07-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "vuUddBhwlrVijAAFvK5UTg", "review_id": "Do-uA-2bp0_Rei3hHqbbPQ", "text": "I love that this Denny's is categorized as a gay bar! Perfectly nicknamed Jenny's, this chain diner is located in a known gay district of Phoenix, so you can imagine my disappointment when my wife and I walked in for breakfast on a Monday morning and discovered a totally normal Denny's! Where were the drag queens and disco balls and the loud techno music? Ok maybe I wasn't really expecting all that... regardless, it had been ages since I've been to Denny's, and not much has changed. The service is slightly above average and the mediocre food is an amazing hangover cure.... however the prices have gone up at some point during the last 6 years.... guess that's inflation for you.\nWe both crushed the Grand Slam breakfast and overtipped our waitress, who was impressively a bilingual white chick! We will definitely be back!", "business_id": "FKHv7FkblONv9qqBndJUrg", "stars": 4, "date": "2011-08-05", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "RSagYdW4yuCkhIAqW926_A", "review_id": "URJyZZasNMNMGJuuHnP_YQ", "text": "If you love going to dives with great food, eclectic decor, and great prices, this place is a must. By food I mean hot wings. The wings here are excellent. The fries were average but the quality of the wings make up for any drawbacks. I wish Long Wongs expanded to LA. On second thought maybe not because I would be in trouble. If your looking for your hot wing fix in Phoenix, look no further.", "business_id": "BT2Vls7h6sWrCKa5gGXbKg", "stars": 5, "date": "2014-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2KyJLMY3jmASmwtnmlBuvw", "review_id": "M974e_huunoXvKYEXMM4oA", "text": "Not quite as centrally located as I'd like (but, that's just me), but a great place with warm, friendly & helpful people -- people who like people (OOPS, off topic song que) -- interesting and tasty menu items [I almost wrote \"tasty menu\", but I go for enough cheap jokes around here without stooping that low].  \n\nThe food is good.  The people are friendly & helpful. The prices are reasonable.  The location is just a bit Northeast of where my mind wanders for a casual place.\n\nI just spotted Tori B's review, so I'll definitely have to consider the brunch!", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 4, "date": "2008-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "OZ6le0aoyMbYKgQ_w4wtIQ", "review_id": "RIp1CmaQ-1eu1A8ajJjXPA", "text": "The first thing I must say about the Phoenix City Grill is that the owner of this place ROCKS!!! All restaurant owners need to take a page out of this guys book. Reason in a second. Let's talk about food first.\n\nI had the baby back ribs and the were awesome. Not quite as good as the baby backs from Houstons but pretty darn close. My girlfriend who loves PCG decided to go with something different this time around and ordered one of their signature dishes. It was some sort of chicken. I do consider myself a foodie so the first thing I was thinking is how can chicken be a signature dish? Chicken is boring no matter what you do with it. Anyway, it wasn't that good and the chicken comes on the bone which my girlfriend didn't like. So, since it was a signature dish, recommended by the waiter, I had to return it. My philosphy is that if something is recommended and is a signature dish and it doesn't give you a mouthgasim, it gets returned. So the waiter nicely takes it back and apologizes multiple times and asks if we would like something else. My girlfriend orders her old PCG standby, the Pork Tenderloin. Wow what a great pork dish. I don't care for pork that much but i must say i crushed half of it, it was amazing.\n\nDo I even need to explain the choclate tort??? YUM\n\nBack to the owner. We arrive at PCG at about 4pm to eat dinner, who eats at 4pm, you'd think we went for the early bird special. We get seated in the dining room and are the only ones in the dining room and no one comes out for like 10 minutes. So we move to the bar  and tell the bar tender we are going to eat at the bar because no one came out to greet us or take a drink order. He apologizes, bvut it was NO BIG DEAL. We weren't mad or complaining or anything. Remember earlier I mentioned the signature dish that got sent back. Well the owner comes over to us and says i understand you have had some issues today and we are like ah no problem the food was great yada yada yada. The owner is like NO BOTH of your meals are on me including dessert. We objected and were like you don't have to do that and he INSISTED. Who does this now a days in the restauran business? Most definately not Donovans.\n\nAnyway to sum it up. PCG is awesome, the owner actually cares about his customers and everyone i tell this story to they are like i can't believe he did that. Go to Phoenix City Grille you won't be disappointed. KUDOS to PCG and especially you Mr. Owner, sorry I don't remember your name. I'll be for some ribs soon.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 4, "date": "2010-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IWCF21myBYma3Cmb_9Z8LA", "review_id": "Qdd5hvF5EE2pXr3lsXeUnQ", "text": "I just happened to be in the area on an early Sunday eve and was looking for something fairly light and something different. I pulled up my Yelp app and this was one of the local places that pulled up. I saw \"griddle corn cakes\" and they looked just right. I ordered for a pick-up and my husband and I went in to wait the 5-10minutes for it to be ready. \nThe bartenders, host, and waitresses were all very friendly and attentive. We had a good conversation with one of the regulars at the bar and got the food. It looked so good, we just pulled into a parking spot and ate it right there. \nThe corn cakes were delicious. They had chicken and cheese, black beans and salsa. I don't usually write reviews every time I try new places, but I must give credit where credit is due. I will be back there again to try some of their other items. Can't wait.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 4, "date": "2013-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "U17WgOK0pM1W_9A64GwQwg", "review_id": "ioR34DBYmDeXfna8grKWLw", "text": "My Husband and I stopped in for a few drinks and apps. I literally can't stop thinking about the Machaca. Super friendly bar staff and if their dinner menu is anything like the appetizers we tried... I'm afraid we might become PCG addicts. Will be back for sure!!", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 5, "date": "2015-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "H8I48jAArQj5IYYBFPDwIQ", "review_id": "WuRUozhzyMWTKAKOVX5Xmw", "text": "So, this is one in the series of reviews I'm throwing up there during my #transientweek adventure during the first week of July thru Southern Nevada and Arizona.\n\nAfter reading all the reviews, damn, I wish i would have tried some food. We came here while plowing thru bars one night in Phoenix. The prices were very reasonable and got smashed off Kiltlifter and shots of Jameson (this seems to be a very disturbing trend). Our waitresses were the bomb. Had a great time. Cool little shindig of an area if you're in the area.\n\nPlus, Jerome is my hero.", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 4, "date": "2012-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "sALB8-F04S9VcZMF_GkGUA", "review_id": "DvdwY_Wu1YU1uDhS7AaDlQ", "text": "A 'dive' bar in the Camelback area? Well. It's actually not that 'divey' . For one. It's really quite a treat. A little gem that is hidden like a dive. I met my love here for a quick happy hour before we headed out for dinner with friends. A pre-game before the real game , if you will. My expectations weren't that high, but that is okay. My boyfriend loves a good divey bar that is not so trendy and yuppie, as he puts it. This to me was just nice and surprising. The bar staff was super friendly. The beer on tap was nice and cold. Peach Ale from 4Peaks is always a win-win for me! 4Peaks Kiltlifter on tap for him. Off track betting on the tele. Pool tables around the place. For 345pm in the afternoon, it was already packed! We didn't want to mess our appetites up, so we only opted for the fried pickles and went half regular and half cajun spicy. YUMMY! Besides, on happy hour they are $3.50; one of the best happy hour menu pricings around and that is important! I loved being happy when I think I may end up turning my nose up at something.. Just goes to show: Listen to Yelp!", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 4, "date": "2014-08-11", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 3}, "user_id": "HOleI3jz1MLNUJ6cc1x0Pw", "review_id": "uL9XGK9ay95SlJBAEONJow", "text": "McCormick's is my new favorite spot for two of the things that make me the happiest: 1) freshly squeezed and mixed margaritas; and 2) a happy hour that features decent and really cheap food. I could go without the uninspired main menu and the fairly stuffy after-work crowd, but I plan to return as much as possible for the amazing margaritas and ridiculously cheap happy hour food!\n\nI first learned about the restaurant when I posted a thread in the Yelp Phoenix talk forums - I was trying to find out where I could go in Phoenix to get a really good margarita (that is, made with freshly squeezed juices and hand-mixed). A few people (thank you, Jim K. and Natalie G.!) suggested McCormick's, which surprised me because old-school seafood places don't tend to specialize in much besides wine, beer, and old-fashioned drinks like martinis and Manhattans. Anyway, I was thrilled to discover that they were right - that is one perfect margarita!  It was refreshing, strong, and the perfect combination of sweet and sour. When we complimented the bartender (who was really nice and helpful) on the margarita, he explained that they use only freshly squeezed lime and lemon juices, sugar cubes or simple syrup, and tequila. Yum. \n\nOn to the happy hour part (happy hour is M-F from 3:30 to 6:30, btw). When we arrived and took a seat at the bar, there were paper menus that featured the list of happy hour appetizers. There were five appetizers that were $1.95 (this time, the choices were: the 1/2 pound burger with fries, blackened fish tacos, fried clam strips, steamed mussels, and a seafood tostada) and several that were $4.95 (pulled pork sandwich, shrimp cocktail, and one or two others that I can't remember). We had the pulled pork sandwich, which was actually surprisingly flavorful, the fried clam strips (crispy and not too fishy), the burger (decent but a little overcooked and dry), and the seafood tostada (just ok). A whole dinner's worth of food for around $11! Even though the food wasn't outstanding, it was definitely solid and along with the margaritas, made for an enjoyable and satisfying happy hour.", "business_id": "MU3i2uEyUBntebU6pEyMbw", "stars": 4, "date": "2008-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IIed4GFtBNbn7HWPy-4VLg", "review_id": "9W5qBikAngLrn9DBwG1cwA", "text": "The food at this CPK is pretty good.  I guess you could say that for any of the CPKs, but they always do a nice job at this location and are very accommodating of any special requests.  I realize for the relatively low price you pay, you're not getting top-of-the-line cuisine, but it's a great for what it's intended.\n\nThe one negative thing I'd say is skip the wine list.  As you can imagine at a strip-center type chain restaurant, it's not exciting, although the staff actually seem to have a good idea of wine pairing in general for those who are new to wine.  I don't drink beer but have been told by fellow guests the beer selection is decent.\n\nThe service at this CPK is pretty good.  There are actually a few servers there that always remember me, even down to what I like to eat, even when it's been six months since I've last been in.  It's very impressive that they remember me and the staff in general (save the host staff when it's busy) is very pleasant.", "business_id": "ut-kla-EA23nJOij_dcL0Q", "stars": 4, "date": "2010-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 3}, "user_id": "Ouus3lC3Xk3YRGx4ptd_4A", "review_id": "oT4NeToCVv-leasRxGXPqA", "text": "I have a love/hate relationship with the Cheesecake Factory and I have been to a few, Palo Alto and SJ, CA, Seattle, WA and now Phoenix, AZ.  Love the food, the portions, vast selections of appys', entrees and desserts.\nHate the wait and lack of reservations.  The Biltmore Hotel called in a reservation for us for a table of 8 for 6:30pm on Sunday.  It wasn't a reservation, nor a pseudo reservation, we ended up being seated at 6:50 pm.  If you don't get there (any of the restaurants early, before 5pm, expect a wait.)\n\nI ordered the Thai lettuce wraps, $15, extremely yummy and enough to share with 5 others and chicken and biscuits, $21, enough for 3 meals.  The biscuits are airy like Marie Callenders corn bread, I got 3 chicken breasts and plenty of gravy.  Friends ordered the Steak Diane, excellent mushrooms, miso salmon, shepards pie, just to name a few.  Everything was so good.\n\nThe downside of our experience at this restaurant was the ordeal of no reservation and our waiter was inattentive, we had to ask for our drinks and appy's.  Had to ask the manager to find out what was going on with our waitstaff and order.  Hopefully, this was not the norm at this location.", "business_id": "2r8jGeuYvMkyP2ik_X-Bxw", "stars": 3, "date": "2007-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qmdRG4PGjDEXazZYuFdDtA", "review_id": "1A5M7eCT-NxiWZrD7LVzQA", "text": "Food is good, drinks are better and the cheese to die for!", "business_id": "2r8jGeuYvMkyP2ik_X-Bxw", "stars": 4, "date": "2012-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Yd2EYrXC2ZtpDi6nOGQbZg", "review_id": "TWzf_c8aVV3jg1u3cCa0KQ", "text": "Tonight my fiancé and I took my parents to Cheesecake Factory to catch up over a slice of cheesecake and a cup of coffee (it was 5:30PM) We got our coffees right away, but had to ask for water twice. After about 30 minutes we had asked for our check and a box from our waitress. 20-25 minutes went by and we asked again, she said \"I'll be right back.\" Another 20 minutes goes by and we tracked down the manager. He apologized and said he would have the check right out to us. At 7:30, an hour and a half AFTER we asked for our check the first time, we had to walk up to the front, wait in line, and ask the manager AGAIN for our check. He apologized and brought it right out. Instead of offering to comp the meal, or ANYTHING, he took the coffee off. Really? Oh thank you for saving me $2.95. I waited an hour and a half to pay you guys. Needless to say, we left a $0 tip. Never going back to this Cheesecake Factory again. Also, we never got our boxes for our leftover cheesecake.", "business_id": "2r8jGeuYvMkyP2ik_X-Bxw", "stars": 1, "date": "2014-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hY83SqqHJlsZQaP9Dv42Tw", "review_id": "P6U05srGNlFkDGA9aiFnvA", "text": "I find chain restaurants repugnant.  The food is over-priced, bland and served by people who are made to say things like \"Welcome to {PLACE}!  My name is {NAME} and I'm going to be your special pal today!  Would you like to try our Loopty-Loo Chicken Snackers?\"  I waffle between snickering and feeling really sorry for the person that has to humiliate themselves for like, $2.85 and hour and probably only averages like, 12% tips.  The feeling passes quickly, as I'm forced to wonder which frozen hockey puck will make it into the microwave and onto my plate.  Typical chain restaurant experience... but not at Chili's!\n\nChili's actually has fresh food!  I mean, it's not fresh like \"that day\" fresh, but it isn't frozen like most chains and they probably got it in that week.  So, it shouldn't be a surprise that the food is pretty decent (for a chain restaurant).  They do have standards (cough) to uphold, though, so if you're looking for something different, don't go to Chili's.\n\nTheir menu is pretty standard - fajitas, quesadillas, ribs, burgers, sandwiches, salads, soups - typical bar and grill food.  I've sampled a bunch of different things and everything was pretty consistent.  Good and flavorful, if not a little on the salty side.  The only thing I really don't like and will never order again is the ribs.  I thought, because unfortunately I remember those baby back ribs commercials, their ribs would be awesome.  They aren't.  They're dry and have very little meat on them.  Don't waste your time because you'll be disappointed.\n\nThe drink menu is pretty crazy.  They have fun fruity drinks, a full selection of liquors and a typical smattering of beers, both draft and bottle.  The drink they're most well known for is their margarita, which, I must say, is pretty good.  I love their Patron margarita and highly recommend drinking at least three of them (and taking a cab home).\n\nThe restaurant itself has a unique layout.  It's a tri-level with dinner seating upstairs and downstairs, a bar and outdoor patio.  I've been seated in all 4 sections and my favorite place to hangout and eat is the bar.  They have flat-screen tv's so you can enjoy sporting events or whatever is on at the time... plus you get your drinks faster!\n\nIf you're looking for lunch or dinner and you don't want fast food or something terribly expensive, go to Chili's.  Out of all the chain restaurants out there, this one is the best.  The Camelback/20th Street location in Phoenix is the best.", "business_id": "kjZJsF1juY_pTOw_A8Ve6w", "stars": 3, "date": "2008-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HnRb2AYr5ixXZpUNnQfSBg", "review_id": "BucpBSqTSwTh3cT0NOyssg", "text": "I eat here or order in whenever I visit my family who live out in Phoenix.  They have tasty American food, competent staff and a great selection of alcohol for beer or wine lovers.  Their steak sandwich is excellent as is their ceasar salad and fries.\n I would say their only downsides are that their prices felt a bit high for the portions that they offer and the dining atmosphere is only okay.  But, if you want a good American meal eat here, you won't be disappointed.", "business_id": "rVUEZpHQfWI_3kt0lBwaxQ", "stars": 3, "date": "2013-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9ebaAGLVIgGKpDLFwmvaiQ", "review_id": "Q4yt_SDpIBCJJHfwf1xy-Q", "text": "Best tucked away spot in Arcadia. I go there for the friendly bartenders, cool crowd and best wings in PHX. You need to order \"The Works\" wings (secret menu) Julio is the cook and he does a great job! You will find JT sitting at the bar usualyy drinking with the patrons. There's a juke box and great daily specials such as: 2 for 1 burgers on Tuesdays. A can't miss spot.", "business_id": "qz4ZOcv-840UjfCEYI4qZg", "stars": 5, "date": "2011-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hgzGSMl2m3ZpbVMnnbHJAQ", "review_id": "ozcVYsjUR4dmOYFRxasNcg", "text": "service is always fantastic.  food is consistently amazing.  i have enjoyed this place for years.  I highly recommend any burger they make, and also every soup they have, especially the chili, which typically has prime rib in it.", "business_id": "To5CjntVFawXM_hpAhvVdQ", "stars": 5, "date": "2012-08-18", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "sdydB8SH3vqhJXB-kjW6Kw", "review_id": "8VYWOggWpZ4jWmn4YnPBhA", "text": "I returned to DPOV for for the 4th time last weekend. There will most certainly be a 5th, 6th, and hopefully many more visits back to this treat of a dining experience.\n\nFor the first time, we were able to enjoy bar / lounge for cocktails before dinner.  It had not been completed when we were there last. It is really beautiful and very easy to get comfortable inside the lounge and to relax with a drink or two before going upstairs for dinner. The early evening was perfect outside,  so we also chose to spend time on the patio area watching the sun retreat for the day.\n\nDinner was excellent. We have yet to be disappointed. The view is really spectacular. We wished we would have been in a couple of days earlier to watch the electrical storm outside. I can only imagine how awesome it would be to observe from the peak. The Lobster Bisque is out of this world. I look forward to it each time I go! The fillet was cooked perfectly.  We also had the lobster and shrimp prosciutto. They were quite good as well.  The service was well paced and table staff is well informed and helpful. \n\nOur only disappointment of the evening was that there was some confusion to the bar tab. We had closed out our lounge tab, However another parties drinks were added to our bill for the dinner in the transfer from the lounge to restaurant. Though it was corrected, the waiter was surely not convinced that the tab was not ours. This left us with a bitter taste in our mouth as we were leaving.  A five star performance fell to a 4 star over this one incident.  My suggestion, close out your lounge tab and take your receipt. This would have been more convincing and clear to the waiter and would have dispelled any doubt.\n\nThough our trip to the Different Point of View is rare for us as we live out of state, we look forward to it each time we trek to Arizona. If you are looking for an upscale and unique dinner experience/ dinner with a great view, take the opportunity to go. Make reservations and ask for  a window seat, the view is really nice!", "business_id": "3Zsjlum5kl5N5KV712aTMQ", "stars": 4, "date": "2008-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "TJCBhah2IxU_1Iu3x9OODA", "review_id": "HjmSSiaiUogGeRI-Foxoqw", "text": "The view for this place is nice and their food tasted not too bad but the price just doesn't justify what you get. They have some of the smallest portions I have ever seen for a pretty penny. The waiter I had was a bit of a prick and I was forced to pay him basically a 40% tip. I dined in a party of 6 and they add a service charge on top of a 20% gratuity for parties of 6 or more. It's ridiculous and so not worth going to. I'm from LA so seeing overly priced food with so so service doesn't get high marks from me. I won't be coming back. You're really just paying for the view. I am so disappointed with this place.", "business_id": "3Zsjlum5kl5N5KV712aTMQ", "stars": 1, "date": "2013-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sTVFjY4eO8PDN6IAYn19Vg", "review_id": "S0AM-D4f-DUDyT2YJw-U3A", "text": "This place is easily the BEST restaurant I have eaten at in Arizona.  The fiancée and I had come to this establishment in celebration of our Anniversary weekend.  The restaurant is perched on a mountaintop inside the mountainside resort, so you will have to drive up a bit to reach it.  However, this place is completely worth it and more. \n\nThe first thing we noticed as soon as we were seated was the view outside the restaurant.  Even though we were seated inside (outside dining area was closed due to heat temperatures), the south side of the restaurant was comprised entirely of floor-to-ceiling glass walls that gave a panoramic view of the entire Central Phoenix area.  Once we were able to take in the view enough to focus on the menu, our server immediately and consistently came to our table for any service we needed.  As we couldn't decide what we wanted to eat, we took the server's recommendation of ordering the Chef's Special which was a five-course gourmet meal with optional wine pairing with each course.  It was not until we were served this that we realized the full extent of the service that was about to be provided.\n\nOur table was waited by not 1, but TWO full-time servers who brought out each course, explained the origin, methods and tastes of every single food item on each course.  In between courses, the restaurant chef (finding out it was our anniversary) sent over complimentary offerings (this was the first time I have ever had chocolate-covered pop rocks).  We literally felt like a wealthy couple that was being pampered and attended to in every single manner. \n\nAfter the meal, we went outside with a bottle of wine and took in the jaw-dropping view of the Valley from the outside seating area.  The only downside of our visit was that this area was closed for dining as the temperatures were too hot, however that wasn't on the restaurant and hence why I am still rating this place as 5-stars.  Our servers graciously took our pictures from various views and locations, and afterwards my fiancée and I sat back on couple of the lounge chairs and took in the night skyline view with wine and relaxed.  All in all, it was the best meal I have ever had in a restaurant and easily the best service the both have us have ever experienced in a restaurant setting.  The after-meal view and drinking was so relaxing we didn't want to leave.\n\nThe only thing that may deter the average customer is the price; this was also one of the most expensive meals I have experienced, however the service and the experience is more than worth the price.  This is the best restaurant in overall ambience, food, service and views in all of AZ.  The view alone from the restaurant is enough to trump most establishments here in the Valley.  If you are looking to take your significant other on an anniversary, birthday or surprise proposal dinner, there is no better place than Different Pointe of View.", "business_id": "3Zsjlum5kl5N5KV712aTMQ", "stars": 5, "date": "2014-07-29", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "VN4RSkI8uUqPbWv19EZizA", "review_id": "tu8DEvoLSJM_pHzmVCHcEQ", "text": "Different Pointe of View offers a dining experience that you will miss the second you walk out the door. My girlfriend and I celebrated our two year anniversary at this fine establishment, and we were nothing short amazed. From the ambiance to the food, it is simply the perfect way to celebrate a special occasion with someone you love. \n\nWe had the perfect table right next to the glass that offered an impeccable view of the Phoenix area. Our server was knowledgeable yet not overwhelming. Every employee was extremely friendly, and the service was what to be expected at such an establishment. From wiping down the table between courses to expertly answering your questions, the staff at DPOV is well seasoned. \n\nMy girlfriend decided to do the three course meal for $40 (an absolute bargain), which included an appetizer/salad, entree, and dessert. I just ordered an appetizer and an entree, and we shared the dessert from her meal. She began with the duck confit raviolis while I ordered the risotto appetizer. We were both stunned at how beautiful the dishes were presented (and this remained true for the rest of the meal). The raviolis were delicious and the accompaniments provided an expertly-balanced course. The risotto, I can't belive I'm saying this, simply needed salt! It was garnished with shaved black truffle, so I was able to overlook the underseasoning. For the main course, she had the prosciutto wrapped monkfish while I order the filet. Her dish came with baby artichokes, fresh-made angel hair pasta, and a lemon caper sauce, all of which were wonderful. The prosciutto was nice and crispy and encased a beautifully cooked piece of fish. The filet was accompanied by a potato gratin, summer mushrooms, and a cherry terragon reduction. The mushrooms were excellent and included morels and chanterelles, so I was very happy. The medium rare prime filet mignon melted in my mouth, and the cherry reduction added a nice bite of sweetness to the dish. For dessert we shared the Greek yogurt panna cotta with pineapple-coconut sorbet. Once again, the dish looked just as great as it tasted. All in all, the food at DPOV will blow your mind away. \n\nAfterwards, we walked out onto the patio and enjoyed the view of the lit up city. If you want a dining experience that will bring happiness to your stomach and enjoyment to your heart, come to DPOV. It's a night that won't soon be forgotten.", "business_id": "3Zsjlum5kl5N5KV712aTMQ", "stars": 5, "date": "2015-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gUu_mxAw54AumnIXJl7A8A", "review_id": "RukWriO88NLawZ3lJwEq6Q", "text": "July 5th while dining at Gallaghers on 7575 n 16 St there was a cockroach in our water. While the waiter was fantastic in handling this disgusting discovery the manager did not bother to come and talk to us and decided that comping one domestic beer and  a 6 dollar happy hour entree was sufficient. In addition, one of the handles on the toilet in the ladies restroom (handicap stall) was broken off the toilet, which did not allow the toilet to flush. Had the manager come and talked to us, I believe this situation could have be solved in a suitable manner. However, now there is a party of five who will never recommend Gallaghers to anyone and will now be  reporting this incident to  the health department.", "business_id": "F-ykHfGY9lWr12OJ_Ofy7A", "stars": 1, "date": "2015-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Flc3YYAVLSMUli78jFZRyw", "review_id": "8w_4_9TQpDcmWJ1rBlyL7w", "text": "Seriously, the charm of this place is the people. It's been through allot in the last couple of years, changing hands and reverting back to the owner who had it for decades. This last loser stole everything of value, defaced the sign and closed the doors leaving an entire staff of loyal employees jobless because he couldn't get a liquor license. It WILL re-open. The bar tenders know how to pour a good drink, the food is cheap and good but the staff and patrons are like family. Think \"Cheers\" in the west. Can't wait to be able to walk in again and welcome back June and Eliot. :)", "business_id": "JImJictLIE48_O1z-l2TGw", "stars": 5, "date": "2012-07-08", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "CjwrNXuVnhYpLfd9cYOQyA", "review_id": "If3Wp1gVrU3Q-CYLjZ6lVQ", "text": "As a diehard Packer fan living in Phoenix, I have been going to Casey Jones' for 4 seasons almost every Sunday.  Each year has progressively gotten worse than the last.  Service is appalling, food quality is dirt poor (except for the wings), everything is filthy, and the hospitality, overall, is terrible.  A week ago I went in; it started the season off on a bad note... I even called the manager over to explain that I am a loyal customer and hadn't seen it this bad EVER.  He didn't have much to say as I gave him some gentle feedback on my experiences, he didn't even apologize or thank me for my loyal business.  I pledged to myself I will never drop another nickel in that place again after that.  Not even for a DIE HARD Packer fan...", "business_id": "vFJmFFfPVhHkC3bWOeZnNA", "stars": 1, "date": "2011-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "N-D-d1Z4UybdlkK1HxlNPA", "review_id": "xBbYcJGwvqTTZgpQiB0iKw", "text": "Hubby and I ate lunch here today and what we had was, for the most part, quite tasty. I had the Hula burger (with swiss cheese, sauteed mushrooms, lettuce and tomato) on a whole wheat bun which was very good. \n\nFries came with the burger (you can sub onion rings or some salads) and were all-you-care-to-eat, like Red Robin. The fries were just OK- they tasted a lot like In-N-Out's. \n\nThey do have veggie and turkey burger options. \n\nHubby chose the veggie tacos which were very fresh, with avocado, corn, black beans, red and yellow bell peppers, and zucchini on soft whole wheat tortillas. On the side was an \"island slaw\" which was vinegar based (maybe a little too much so) but very fresh with cabbage, carrots, jicama, red bell pepper, and green onions. \n\nService was just fine. This is a place we'd come back to, if we found ourselves in this neck of the woods again.", "business_id": "hNVcBhJSD5HyLKMf_Z7TaA", "stars": 3, "date": "2009-07-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "ky9pQ8AKufvZ63IxR41jGg", "review_id": "yFvUcEHTXFaNlP4h-SpISQ", "text": "Well I must say that Boston market has gone through a lot of changes over the years and this one near my apt. is no exception. The drive-thru concept is unusual for this kind of establishment....but it is efficient. The staff is very friendly....and the place is very clean as well. They always have specials and deals for the entire family....rather it is just for two....or an entire group. I guess though it has lost some of it's appeal from the older Boston Markets I am used to.....and that is why I gave only 3 stars. However it is a good place to eat....and the prices are not to bad. Eat, Drink, and be Merry my Friends!!!!!", "business_id": "F5vKD7ajS69CwuFyBVxA_g", "stars": 3, "date": "2011-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kjm2tyhJtczhW-ylQKDnUw", "review_id": "4BluEIQwI-nwk09sMJ_XFw", "text": "Great place - the breakfasts are the best!  Food is down home cookin' and the staff is friendly.  Service is great!  I used to frequent but my schedule isn't as it once was and I miss my weekly visits.  Can't beat this place - no chain restaurant compares!", "business_id": "2RxIERKZi5gjLW76MkFotQ", "stars": 5, "date": "2010-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AVmR5QSYXl2Yyqqo-ffstQ", "review_id": "f5Xpi9sONAJ302dnSBgQ0Q", "text": "Quaint little neighborhood place.  I've been for breakfast twice and lunch once.  Their chicken fried steak was not one of my favorites, but their eggs are always cooked to order, and the burgers are the bomb!  Service is friendly, like a small-town atmosphere.  They do get busy on the weekends - but be patient, they food is worth it!  Plus it gives you time to visit with who you came with, or the folks at the neighboring tables.", "business_id": "2RxIERKZi5gjLW76MkFotQ", "stars": 5, "date": "2015-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "_-Zrzf2QYiw4KHugUTXNYQ", "review_id": "vpO60yCR_fKhTARpp4rcSA", "text": "BOTTOM LINE: I love the soup & sandwiches. I can bring my dog.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 4, "date": "2008-06-13", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "9SZBVZ-mxebOVa1BlWFtWw", "review_id": "CD4oeg7SiPnyt860Fy2i6Q", "text": "Mobile Tip - Hope they hire an organized valet company next mother's day. \n\nReview - Now I've been to The Farm before, having eaten at Morning Glory with girlfriends on a saturday morning a while back.  It was a lovely experience (from the environment to the service - having asked for my \"any style\" eggs to be hard boiled.  They didnt bat an eye at the request.) and I wanted to come back for Mother's Day with my family.   \n\nMother's Day - It's crowded.  I mean like WAY over 1+ hour wait for MG, crowded.  But that's understandable.  It was Mother's Day afterall.  If you want to come here for an event like the Mother's Day Brunch, reservations ARE required.  If you miss out on reservations for brunch, and decide to go to MG, go early!  \n\nWe decided to skip MG and were going to eat at The Farm Kitchen, but we ended up having to leave because Little C ended up having a major asthma attack.  We had used the valet service for parking, which offering valet on a busy day like Mother's Day is great.  BUT only if the service is organized.  We hustle back to the valet stand and I had over the ticket.  I look at the valet stand and there are key piled up everywhere.  No organization whatsoever.  They're digging for my keys, meanwhile Little C has just puked all over me for a 3rd time.  2 minutes go by and J and I ask them a couple times if they could please hurry and find our keys.  They find our keys and one kid runs off.  Next thing I know, the head guy (I'm guessing he was the guy in charge over valet), turns to us and says in a snarky manner...\"I'm SORRY your child is having issues.\"  \n\nUmm...excuse me?!  \n\nThank gawd they found the keys and got our vehicle up in a flash or else I would have had to not only call 911 for Little C's breathing, but for my putting my foot up that guys ass.   \n\nI think if we decide to come back, (which I'd like to go back because the atmosphere, service, and food at MG was great) we will self park across the street.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 4, "date": "2014-06-30", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "joIzw_aUiNvBTuGoytrH7g", "review_id": "Y3LLPLWw-cSdCVTbyZF4Bg", "text": "About the same as the other locations for Rock Bottom in the Phoenix area, but this one is more convenient to a major highway (I-10).  I wish they would stop making so many menu changes, which are often for the worse.  Food has gone downhill in the last couple years, and beers are rather uninspiring.  For convenience sake I might stop here with low expectations, but if you have the time I'd advise that you seek another dining choice.", "business_id": "s_cKw6m0Fw9jZbobRH0YSg", "stars": 2, "date": "2009-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "btTx6B1JDp0cAiGtJ21xsQ", "review_id": "9O62CcFGSXx00gTzmz9huQ", "text": "I've never had a bad meal or bad service at Keegan's. It's one of my favorite restaurants in the area. I'm continually impressed by the consistency of the quality of their food. I feel like every other restaurant I like gets worse over time, but not Keegan's. The food is always fresh, and nothing looks like it came out of a can. The prices are extremely fair for what you get.", "business_id": "SgTjnyElc26gPUghVuCuSQ", "stars": 4, "date": "2011-08-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "T7J9ae0wTskrI_Bgwp-4cA", "review_id": "UjxgNRJNorvTAbghJMr8-g", "text": "It's fine.  I've been here twice in the last week for breakfast because it was convenient.  Had the oatmeal both times.  It was good.  The second time I was brought out granola bits instead of raisins and didn't care for that so had to ask for the raisins.  Iced tea is good and they are nice enough to give you a cup to go.  \n\nBiggest complaint over the two visits was on the second one a family with three young children was sat directly across from us even though the entire restaurant was almost empty.  Made conversation harder and the kids were fussy.  Why would the hostess do that?!?!", "business_id": "NX5YHSIyesufcsI7Rg5NLg", "stars": 3, "date": "2013-06-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "_TFVZLcNaPh6o-gwlMS9Lw", "review_id": "7qsH3oUPkfef3_Ny9jcp1g", "text": "Had a great experience! It's always weird when you walk in and you get 13 \"good mornings\" but it's nice. We got to choose our seating and were promptly greeted. Tameka was our waitress and she was SUPER nice. She has great customer service skills. The food was delicious and cheap, definitely not healthy,but on my budget I can't care today. Definitely recommend", "business_id": "0kZ4aYmqf5fzTt9Yvz8Kvw", "stars": 5, "date": "2014-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y8mozkNVkhjO_uXB7fNsPg", "review_id": "iQ8qkaKC38ki9sR2yeWZpA", "text": "I'd give it a 3 stars just because the bathrooms are kinda dirty and the stalls were claustrophobic, but their food was really good, especially the variety of soft drinks. Even the staff were really nice. Well, let's just say the red velvet bread pudding is actually a slice of the red velvet cake, not the actual bread pudding.", "business_id": "UpYva_zhJ6pRGfdTruIYIg", "stars": 3, "date": "2014-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FYsAZu6zAD0aCGqg4T7eJw", "review_id": "95V68EW-3MpiBL7MBenMaQ", "text": "Time to edit my first review of Island's....The first time I was here we had a not so good experience. However, the company reached out and wanted to improve and boy did they.\n\nThe same group of 9 of us went out with 5 kids under 5 years old and four adults, and we had no issues. We were able to sit in a corner booth, which we actually kind of need for all of us. Our food came out quickly and everything tasted delicious.\n\nThe best part about it was the service and our server. He recognized that the kids were getting hungry and a little out of control. He brought them extra crayons, and was able to get their food and drinks out first. \n\nIsland's made a huge come back in my book and showed that they truly are a, \"family restaurant\" and suits the needs of everyone. It just a cool place to grab a burger and hang out.", "business_id": "e0vubCKi8KD8zC2C6FdbuQ", "stars": 4, "date": "2014-07-01", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "mu6AXWXmUiE2FVw_pYxHdA", "review_id": "nko0r0v1b9Hz6oaf3_h4og", "text": "I LOVE the pretzels! Wish they would bring back the Asiago Dip, but hey, garlic salt and cabs are 2 of my main food groups. Great atmosphere, can always see a game on one of the many TVs, even when my girlfriend thinks I'm paying attention to her! Milk stout is my favorite beer, but the light isn't bad either. Something tells me the others are good too, but it's hard to get me to stray from my patterns. Oh well, I'll leave someone else to review those. All in all, the food and beer is great, and the servers seem to know what they're doing too.", "business_id": "d7V3ykQHqChv0KtXEanKLw", "stars": 5, "date": "2010-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CoQ5qnDp_rLqkBN3U3yxCg", "review_id": "xr-pPsKe487INePfJHqsNw", "text": "Their service was above acceptable, but kind of slow. It was Wednesday night around 9pm and only one section in the restaurant was open for just a few groups. Their business looked very slow there. But I suppose it was a probably typical week night situation.", "business_id": "OmxAvtMyIvCVm16NFIOOUA", "stars": 3, "date": "2012-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "K0Edvn6j6LoonRb4UyY2sw", "review_id": "HxL4EKPjfgXeMK2VNam_OA", "text": "The food was delicious and well worth the drive. The waitress we had seemed kinda grumpy though and not to happy to be there.", "business_id": "iAYzRvyBrSkJDu_XZ-E1zQ", "stars": 4, "date": "2013-08-13", "type": "review"}
{"votes": {"funny": 4, "useful": 2, "cool": 2}, "user_id": "N98mJQDzTjzT216SFVeBDQ", "review_id": "wIWcsmgLlV7ubtJjloa6TQ", "text": "I doubt anyone will read this, but I feel compelled to say that this is the perfect place to go if you have absolutely nowhere to go. The service here, in the afternoons no less, is consistently slow. As fun as unpredictability can be, I don't feel like playing Russian roulette drive thru because the waits here make you want to blow your brains out. One time I pulled in and ordered an iced tea. Just a typical, unsweetened, no lemon iced tea. IT TOOK 13 MINUTES!! I feel like if there's ever a time you could go into a kitchen and learn how to do fix your order and then come out in less time than it took for you to get an order, there's a problem. The only thing I'm unsure of is if its just the employees who are slow or if the inside of the kitchen is actually another dimension in which time slows down and thus making orders coming out of the kitchen take three times as long as any other Sonic takes.", "business_id": "GoEHXcq_nY4jZOx3Ay5gxw", "stars": 1, "date": "2008-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sEuej8RDnGxZl9RWCSabsA", "review_id": "3QPj5UShEzwuhEm--TVBPw", "text": "I love going to this location! The severs are always very friendly and prompt. The food is always great, I suggest the French dip! Jenifer is especially a great server! She is always so happy and makes the experience even better!", "business_id": "dbh72sNyNeHUgJqQye9Vbg", "stars": 5, "date": "2015-07-31", "type": "review"}
