{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FNbm3ycU2BF8C17UFfWzOg", "review_id": "uSoZMwdnhiegEpbXCwWATw", "text": "Good Luck getting a seat, that's all I have to say. The Gab and Eat is famous and infamous. Diner food is what's up and I like it. When I was a roofing mechanic, we'd meet there before work. Although I'm not sure I would recommend it if you're working were there's no bathrooms. hehe", "business_id": "b9WZJp5L1RZr4F1nxclOoQ", "stars": 4, "date": "2007-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "heoc96QXrTbecWVw933qhQ", "review_id": "LL-BS74467h7ORjwRvz0Hg", "text": "Ugh, I hate this place.  People from work drag me here to lunch more often than I would like.  The food is overpriced.  The service is snotty and slow.  I can barely get free in under an hour-and-a-half.  The food is forgettable and the menu sparse.  They're terrible for pick-up too - even when you call way ahead, you're made to wait, and they're surly about taking care of you when you arrive for your food.  You can do better for lunch on the northshore pretty much anywhere.  Try SoHo or Finnegan's instead.", "business_id": "Z101WZaISochG6g7tI2ZVw", "stars": 1, "date": "2011-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "579kIRSGSfAKzVFXuzKG0g", "review_id": "3ObJsRmbhdMDqpS2W-EJsg", "text": "The best hoagies in Pittsburgh...hands down!!!", "business_id": "DzOPHyrG2XuVqKEvHCnN7w", "stars": 5, "date": "2013-07-29", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "3Bz8AQFTYgClqPaX5ndAFg", "review_id": "QdCOoIZsydm1_BnfkDuIIQ", "text": "The food was just OK. Soggy french fries on a greasy cheese steak pattie.  The service was awful, noise, and not helpful for a newcomer to Primantis and Pittsburgh.", "business_id": "NeUf9FyCCIN4MEseNyqkXQ", "stars": 1, "date": "2009-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "63Pop3d15pTuHZ7qoex46w", "review_id": "_BzGjK7dzZywpAVXRqjQ-A", "text": "Oh so good and huge! Each sandwich is both tasty and large enough to feed two normal folks for lunch.\n\nAt the suggestion of the server, I ordered the Kolbassi Sandwich. It came fast and was oh so good! Also free soda refills.\n\nService was good mid afternoon on a weekday, and I enjoyed the whole experience watching the NFL Hall of Fame induction ceremony on the flatscreens while eating.", "business_id": "NeUf9FyCCIN4MEseNyqkXQ", "stars": 4, "date": "2010-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WtRTdWcpvRjBgNb3TMFf2g", "review_id": "9ci9iQR0hnIt45MBr3Y9sQ", "text": "Fries and cole slaw in the sandwich was interesting...pretty good. Don't come here if you don't like messy food. My sandwich kind of fell apart. Also, they don't give you plates or forks or knives (they bring you your food on a sheet of wax paper). I'm not sure if they take credit cards (we paid with cash), and have fun trying to find parking near it!", "business_id": "NeUf9FyCCIN4MEseNyqkXQ", "stars": 3, "date": "2012-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "OtjcLVcF1IVGAL9HJEWo8Q", "review_id": "fZcIyYYh4ld4l-eR9vZH_g", "text": "You can't go to Pittsburgh and not get Primanti Bros.  For my fellow Detroiters it's like not going to Coney Island when friends are in town.    \n\nSandwiches are great - all of them come with coleslaw and frenchfries (ON the sandwich).  They have a full bar at this location.   It was in the high 80's with high humidity so a Blue Moon went perfect with our meals.", "business_id": "NeUf9FyCCIN4MEseNyqkXQ", "stars": 4, "date": "2013-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "n_4fpRmmn6c3lwAtsX3qVw", "review_id": "-v4WyL1n19fXyctZK6Ohsw", "text": "Good prices and a Pittsburgh Classic. Kolbassi sandwich with Fries? Yum. Spicy rub pickles? Yum. Good beer, too. Nice outside seating but beware the pigeons, sit-down and counter service,", "business_id": "NeUf9FyCCIN4MEseNyqkXQ", "stars": 4, "date": "2014-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wQEPGJqrAl5nP07YfnCKXA", "review_id": "BlTY7RZk04N8QaC5h8aQ8w", "text": "Just alright if that. Nothing special. My husband saw it showcased on the food channel or something close and so we tried it while in Pittsburgh. So, I got a turkey sandwich with the coleslaw and fries on it. Sounds interesting but the coleslaw was slightly bitter and I'm used to coleslaw being a little sweet. Too many fries on the sandwich. Trust me on this, there is a such thing as too much of a good thing. Oh, and like 2 slices of meat and a slice of cheese. I thinks it's overhyped.", "business_id": "NeUf9FyCCIN4MEseNyqkXQ", "stars": 2, "date": "2015-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aSZevfRVo7nTq8vZHp902g", "review_id": "9mrlMPc-Z_AyQrRUKb-URQ", "text": "The sandwiches are great and the staff is friendly, but the place is absolutely filthy. Your feet stick to the floor and the tables are dirty. Would strongly recommend a TO GO order.", "business_id": "pvGT62T6Ci1LKOS9DL42pg", "stars": 3, "date": "2014-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "VlXBQX0jHlfcPxqmwSNOpA", "review_id": "FZlGcuwU5ENNlMy5t7VH7g", "text": "AMAZING food. A cute mom and pop ambience. And bottomless coffee and tea! College student affordable and better tasting than any fancy coffee shop sandwich", "business_id": "o_wRqOpli9kyZGXlJtLLdA", "stars": 5, "date": "2015-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f-NRjYJ1nBiiedKnoO6mPw", "review_id": "WBlDjh0qTdjZIcY1zI_85A", "text": "Not sure about the food handling practices here. Man who is ringing up take outs and handling the cash is also going directly to the grill and handling food. When i queried him about this, he grumbled, with downcast eyes, \"i wash my hands.\" Then to demonstrate, he walked to the opposite end  of the counter and he did, but not before elbowing his manager and having s good laugh together. The manager then looked at me and was rather abashed when he saw me watching.  Id suggest you watch your sub being made to see if food handling is up to your standards.", "business_id": "-tcf1WSfc2iNRf75AMW6pw", "stars": 2, "date": "2015-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WU3rRHMzOcM3WLRHv8-k6A", "review_id": "QuwfE1Li1CokOQg3l8ggGg", "text": "Love this place. Some of the best pizza you can get in clt that reminds me of up north. Always got it as take out for a stay in/movie night when I lived on this side of town.", "business_id": "sJtGRBWYUj013nkFA4Hrdg", "stars": 5, "date": "2015-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cs3jBn4NMKBjMU7cy1HdRw", "review_id": "869agFsYYmR_W_yI0DyhiA", "text": "This Jersey Mike's kicks ass!!! The staff is always friendly. Tuesday luncheon is chaos but they people there get you out of there in no time. The #9 cold sub is a steal and their relish has the perfect balance of acidity and sweetness.", "business_id": "6ICGve6UyGPuLaGrKQBVuw", "stars": 5, "date": "2015-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UHNzfXQnTSlDgHWBbpcbuw", "review_id": "yQbd5QV3mUq2bMTZOhghdw", "text": "Really good subs and very inexpensive. Love the cheesesteaks. Almost felt bad for the one employee slinging subs and taking orders for the entire shop. They could easily raise prices by a dollar a two to hire an extra hand to help out.\n\nOverall, great subs, inexpensive and friendly service. Give it a shot!", "business_id": "4-B5ou1FbGVjVEQd3FAoIA", "stars": 4, "date": "2015-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7JWY4YYfCksRDColNRm7NA", "review_id": "_1r207rN60iQ-s5WcVzxQg", "text": "Great little hole-in-the-wall type place. Sandwiches are wonderful, especially the Carolina Turkey Club.", "business_id": "WkD7OrSIHLzgOQo9wQHu-A", "stars": 4, "date": "2014-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J0h_oB2VEhMTlcqKmspjWQ", "review_id": "U_0UKlZ6BdjLyUL1mw12Pg", "text": "I enjoyed the strawberry cheesecake ice cream today from Ninety's Ice Cream & Sandwiches.  A co-worker was kind enogh to bring me a surprise flavor.  I had other opportunities to taste this flavor but passed them up.  You see, my mind says yes but my body says no.  I enjoyed the strawberry flavor with just the right amont of graham cracker crust mixed in.  Also, I heard more about the lunch items offered prompting me to make a visit to this location VERY soon!", "business_id": "M8CC5_9vEvt1yOI2pnkvKA", "stars": 4, "date": "2012-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5dNLTI3_6HzzK0JmMgStTQ", "review_id": "TXy94LcIaF7g6oxY4e62vw", "text": "I've been to a lot of subways and they always have sad employees, but this one was crazy. These chicks working there were so sad I thought they were gonna shed a tear right into my sandwich. I mean they barely talked and looked up. The manager must beat these poor souls in the back before letting them serve the public. I was getting depressed just watching my sandwich get made. No \"thank you\" or \"have a good day\". Just tears and a skimpy sandwich.", "business_id": "Va65srVwxyWNuX2dwF4jEg", "stars": 1, "date": "2015-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qCM5MLHiIaDXpMSG66zkmw", "review_id": "1cq5XRES_KgPeK3j3rs3SA", "text": "Good food but totally overpriced.", "business_id": "cpGv6ES2hzPCtCUQgipwXw", "stars": 3, "date": "2012-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5kgbaMUk-xi7amftP3xj1A", "review_id": "48NsUEl6u1JC6kMnTFEUNg", "text": "FAST DELIVERY.  DRIVERS ARE FRIENDLY.  \n\nGREAT GRILLED CHICKEN SALAD (you can add practically anything to it at no charge).", "business_id": "Uw1DZhEtTmLzMcXmdpR8Pw", "stars": 4, "date": "2011-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "o6BWQrNhpWhoadUCoB9iYg", "review_id": "uJygvmVzJ_0ptAdzZDtQGQ", "text": "U could tell the guy who answered the phone was pissed off. He was so rude, rushed me through my order and was frustrated when I had to go back add something to my order. \n\nI literally was so blown away with how short and rude he was I canceled my order. No thanks!", "business_id": "x5Mv61CnZLohZWxfCVCPTQ", "stars": 1, "date": "2015-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "u9QCaamnGl7T5lGshpsG9g", "review_id": "_p_Tgbo899RlHKD4aQtR5Q", "text": "My favorite lunch place downtown! Stick to any of the pastrami or corn beef sandwiches. My personal favorite is the New Yorker. Pastrami (or corned beef if you prefer) with cole slaw and russian dressing..mmm. Their other sandwiches are pretty good too (I've gotten a turkey sandwich that was good and the deli chix sandwich was ok). \n\nNow, you have to be on your toes when ordering as they move pretty fast, which is understandable considering the big lunch line. Fries are the default and you have to speak up if you want something else. Mac and cheese is good. Salad and fruit are good options if you're trying to mitigate the damage done to your diet from the sandwich.  \n\nI also like all the historical photos of downtown Phoenix and the owners' story. Mix of all different business types, lawyers, etc.. Makes downtown Phoenix feel like a real downtown.", "business_id": "9BH18avE46LlHMvJn67MaA", "stars": 5, "date": "2013-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7ToIE5d3_oyqJ6zyxg1OVA", "review_id": "ojhRoeFlPBrz4Uq9-ZQumg", "text": "Everything I've ever had here is excellent (I've probably eaten here about 10 times).  The \"Grüben\" is my favorite (grilled turkey, swiss, slaw, spicy mustard, rye bread), but chicken roll-ups are a close second.  They offer a great selection of sides, and the fruit is always fresh. The limeade is so worth it in my opinion, though I don't think you get refills on that.  (Note if you buy a big cup you can bring it back for a deal on the limeade.)  Also note that if you check in on your Yelp phone app, Zoe's gives 10% off; every 3 check-ins gets you a free piece of chocolate cake. I'm a fan of the cake as are many others, though my wife didn't care for it.  Oh, and the parking: very tough to get right now with the construction next door. If you wait a few minutes you should get a space in the lot and won't have to park around the corner. (I haven't tried parking in the costume store lot.)", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 4, "date": "2011-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EyOjqPwPKoNVM7p7Eb97Ew", "review_id": "f6pAe29HpW2p5xh6kIqWCg", "text": "I love coming here for breakfast, it's conveniently located and Cipriano is always helpful.\nI usually get the PC eye opener and it's 2 eggs, potatoes, toast and coffee for only $3 you can't beat that!\nIt's a great place to eat it take out and I've always been satisfied with the freshly make food and friendly customer service by owner.\nGet your own eye opener!", "business_id": "If2DUhmWIvlu2JFc_rR-Bw", "stars": 4, "date": "2014-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7ToIE5d3_oyqJ6zyxg1OVA", "review_id": "xTGxBYL1i6_l1zZTQVgrFg", "text": "I can recommend the chicken cheese steak - very tasty and filling. Onions, good bread, chicken, and cheese sauce -- and it doesn't fall apart.  It could use more chicken for the price, but still good. Note that it's very tiny inside - be prepared to squeeze through. They sell Tastykakes at the register, which makes sense, since the company is located in Pittsburgh. http://www.tastykake.com/aboutus/", "business_id": "OoHWabV-ym7_HWlHeXTsVA", "stars": 3, "date": "2011-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "At7cNBShE1OErhavh4Q9Hg", "review_id": "Ia888hPLGrT4Dgf1B1wTPw", "text": "I LOVE Athenian Express. The vegetarian pita with hummus is SOOOO good!! There are tons of vegetarian options, actually, which is awesome. And I love the people there too :)", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 5, "date": "2012-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0oRtnPHtvZIE1UNxCDDTPw", "review_id": "CsmjPNw_8Knmc9u6-NPS6w", "text": "Inexpensive, fast and good. I wish they were open late though.", "business_id": "ZoQAOnEFnyHjSpomtfqesA", "stars": 5, "date": "2008-07-08", "type": "review"}
{"votes": {"funny": 9, "useful": 3, "cool": 5}, "user_id": "nc3cqVN0UuB3m50-CcMftw", "review_id": "XfVeOzivyFIEQCMGJBx8Mg", "text": "When I first moved to Phx and found my first apartment, budget was my Secret Word of every day. Yeah, so I moved into a modest studio apartment at 52nd Street and Van Buren. It builds character. Sure, it was western exposure and I couldn't afford to run the AC. Shows endurance. And I learned to spend what little money I made wisely. Fiscal conservatism rocks! Well, part of that meant finding a cheap and nearby place to wash my chonies and other clothes. Finding good eats was coincidental. Every Saturday morning, I'd set my VCR to record X-Men Generation, loaded up my Sportage with a week's worth of dirty clothes and headed to the laundromat at 48th and VB. Initially, I'd stroll on over to the Circle K during the wash cycle, get something that was certain to introduce me to my toilet after the spin cycle and that was about normal. One day, I bravely headed north and stumbled upon Phx House of Pizza and Subs. Like a mirage in the desert, it called out to me with intriguing smells of delishness. It was lust at first sight. The 2 slices of pizza would keep me filled until afternoon and were amazingly tasty. Truly, I found happiness.\n\nAnd so it was, a Saturday ritual whilest my clothing was being laundered I succumbed to the garlicky goodness that is PHOPS. Sadly, I found love and moved to the other side of town and it seemed I was watching an endearing lover grow smaller in my rear view mirror as I drove on. :sigh: I did know what good, economically-friendly dining was. I shall never forget you.\n\nOh, and honey, if you're reading this: You're way better than pizza. Honestly, I mean that. :kiss:", "business_id": "ZAgPh4v-oOb1g6cdlkKI0g", "stars": 4, "date": "2008-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WUEl6F12moqrNPG2Z3XdxA", "review_id": "-D0X0FfnWMWA3Ws-v3uoTw", "text": "We have been enjoying this Streets of NY Location for years and it never disappoints.  Jimmy, the manager has the place running like a watch and he is usually there and quite attentive, greeting and visiting with regulars.  Today I stopped in for a quick lunch. Was immediately greeted by Jimmy.  Our server (and I am sorry I do no remember her name) come right up and says \"iced tea as usual\"? followed by are you going to have your usual slice of pepperoni with a caesar side salad?\"  I hadn't been in a quite a while, yet she remembered what I normally order.  The salad was cold and crisp.  The pizza was hot and tasty.  Excellent as usual.  Today's experience reminded me why i have been coming here for so long & why I will continue to do so.  Kudos to Jimmy for having a fun and warm place with great food. Sure there are restaurants which are newer and more trendy, but this is a truly a place that feels a lot more like \"Cheers\" than a national chain.", "business_id": "JN2qXIuDXnV2d8WnSqd28A", "stars": 5, "date": "2014-06-05", "type": "review"}
{"votes": {"funny": 7, "useful": 4, "cool": 6}, "user_id": "y9IKf7VckFc-fesWuDwgxg", "review_id": "rdRyOXvS0BNHi6cui-QzvA", "text": "Seriously... everyone wanting to blow Chris Bianco is a little annoying, however, i must say, the sammies are pretty damn good. On my first visit (ya, I was shocked they were open too) I had the tuna. My decision was based on a review I read. We all have different taste so no harm, no foul..I wasn't terribly impressed. Since I'm a die hard Lux fanatic and I live so close I was more than willing to give it another shot.\n\nOne word : soppressata \n\nOne more word: WOW\n\nsoooooo damn good and it literally filled me up in the best best way. Created a nice \"lining\" for my tummy so I could down some brews by the pool all day and still get in to work on time the following morning.\n\nI love you Pane.\nSo Chris B.... a little road head??  whatdoya say??", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2008-08-08", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "LXWAXIeYFIdgd2JVPF-9qA", "review_id": "PGdv5DF2Tm9_f2frCJlumg", "text": "The word on the street was this is the place to get great food... Well it was hard to find a place to park to begin with the line was out the door when you finally get inside you're packed into a small lobby... I do not like to feel confused when ordering something it was a cluster I ended up ordering the Soppressata with Aged Provolone & Roasted Peppers sandwich once I ordered I went to the back to do what everyone else was doing playing with their iPhones thank you once again iPhone for making me feel part of a group lol. Once my order was call I go to find a seat and there were none but one with a screaming kid next to it pass! So I ate it in the car to find out after all that it was just an ok sandwich. I will not be back to this spot anytime soon.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 3, "date": "2011-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dxG7BtyPWD1eM48xqHYbOw", "review_id": "eVofX1NKbVNcIBqa8BUjHA", "text": "What?! I can get the same pizza as Pizzeria Bianco WITHOUT waiting hours?! AND the sandwiches are AMAZING! My husband brings me a mozzarella, tomato, and basil sandwich every weekend that I work, always a treat! Plus, I get to get Lux coffee next door to go with my sandwich :-)", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2013-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "-kIvLyWpY17aRa0vPp-RmA", "review_id": "YmMJHJinrE8W4nx82q6oIg", "text": "We just fell In love with Pane Bianco. How could you not? Well on a very warm summer day my wife and I stopped off at Lux coffee next door for coffee. While drinking our coffee the suggestion was brought up to go try Pane Biance. Why not. \n\nWe walked in and sat at the bar after we made sure we could bring in our coffees. I really liked the old style farm house decor of the restaurant. So simple, yet done so classy. It welcomed you inside. \n\nWe both were not super hungry but decided to share a sandwich. I don't remember the name but it was the only one with Italian meat. \n\nWow, simple, but amazing. We loved it, the bread was just the perfect amount if chewy put soft and the sandwich had flavored thanks to the I taipan meat and onions. Also the sandwich was super big so the 2 if us easily shared and were satisfied. \n\nService from the bartender was very good and polite. I'd love to come back and try more. I'm giving it 5 stars because I know Bianco put a lot of his heart and soul in his businesses and they have never I disappointed me. And for the fact the sandwich hit the spot and we enjoyed the bartenders company. We will totally be back soon to Pane Bianco!", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2014-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "g8p07UJHpSGQgu8ImGWJ5w", "review_id": "1akSuqVqxgU33OSJCrPZ8w", "text": "I've been coming to Pane for months - usually every weekend (live near by). The boyfriend and I always come for the lunch menu - we love the thick crust pizza. \n\nOnly reason it doesn't get a 5 star rating is I HATE chunky tomato sauce. I unfortunately have to remove most of it off. Still gets a 4 star rating because its extremely good food and fresh, fresh, fresh", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2015-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 1}, "user_id": "o8J-ergbGYjrUy85I_rxzw", "review_id": "AWYW1L-i_9EKFZMuGua5tw", "text": "Had a great sandwich here the other week. Got The Doughboy which is turkey, bacon, swiss, and avocado on sliced sourdough, warmed up, and I added a side of chips and a can of soda - just under $8. Also grabbed a slice of cheesecake for less than $2. Everything was really fresh and the service was fast and friendly despite it being busy. There's a reason why this place has been around so long! \nThey also had a full menu of sliced meats and cheeses for those who prefer making their own sandwiches at home - plus shelves of imported products, seemingly mostly from Sweden. It was nice to see some things I haven't seen since I lived in Finland.\n\nI can't wait to come back and try the Turkonberry or the Wild Turkey sandwiches. Both sound amazing!", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 4, "date": "2012-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EAPnfIRyf6JnXIaMccsXOg", "review_id": "0TAtV9DUxckdM2rnraHQng", "text": "Good hole in the wall place.  Friendly staff and clean surroundings.  Excellent chili dogs.  Would come back to support local business.  Really wished they offered Coke products, but I have no control over that...not a deal breaker.", "business_id": "FW2Z4ll4zSOEDAJX9-wBZA", "stars": 4, "date": "2015-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LqMpbjrAR2SZGCyahK-9Gw", "review_id": "6wzS9aZEwDuvSnfTOIm1qA", "text": "I called in an order last week for breakfast.  I ordered corn beef hash with eggs, potato pancake, and bagel.\nThey asked how I wanted my eggs cooked.  I told them fried with whites cooked but yellows dippy.\nThey got the whites mostly OK but the yellows were not dippy.  Had I been eating in I would have told them to take them back and cook them right.\nI have had their pastrami sandwiches and they are delicious.  Next time I will go elsewhere for eggs.  But I will order my sandwiches there or \"maybe not\".\nAlso the owner, Scott, was not very hospitable.  If I were running a business I would be much more friendly and outgoing with my clients.  Everyone likes to be greeted with a smile and a \"how ya doing? and \"come back again\".", "business_id": "PxeX1M8WtyPxX1MuuGIh-g", "stars": 3, "date": "2012-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "juB4dIllPpM4Mt4_x2SErQ", "review_id": "MM5q7DGyJr40VsOiubcYPg", "text": "this place is great for a change from the larger sub chain places. I usually get the same sub each time and its always excellent and doesn't disappoint.", "business_id": "HNusESyB6lEgrf5IUwUr_g", "stars": 4, "date": "2011-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2tyadgcxcaEu5LWgLdwLAQ", "review_id": "Jeo8dQ5aSgIoQIadSAxWxA", "text": "Delicious sandwiches and a little beer & wine bar in the back with a great bartender.  Bob is very knowledgable about everything they carry and what will best pair with your food.\n\nToast the bread and shoot the breeze for a great experience!", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 5, "date": "2011-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VdxZnKDA08HlT6zFLTumjQ", "review_id": "cQehCdViZKKHkM1Zh4bZtg", "text": "I've been eating there for years, it is classic Phoenix! The sandwiches are artfully made to your exact specifications and I love how you can taste every ingredient in every bite. That is their standard of tasty quality! My fave is Where's the Beef with a portion of turkey, ask for shredded cheese! I also like the pastrami on dark rye with avocado, shredded cheese and coleslaw! My favorite place to sit is in the wine room unless the weather is nice, then outside is the place to be!", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 5, "date": "2014-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "rLL7YKSJRyj9cVhiM_Y5pw", "review_id": "2fMicq4iMJmNAcUDCGHk3A", "text": "great pizza i always get the brooklyn and am satisfied everytime. the only thing i think they can work on is their delivery times maybe. not sure why but it takes them a minimum of an hour to get the pizza to my apt even though i live only a couple blocks away.", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 4, "date": "2011-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W_O7__jQQ_gfrqaxF84WgA", "review_id": "1vsIHG6u-2OMv5urFSbhDQ", "text": "I love the food here. It is delicious and really hits the spot when your craving some good pizza. I had never Sat down to eat. Always take out. But I decided to bring my daughter in and sit down and have dinner with her (she is 6)  As always the food was great. Our waitress fabien was fantastic! So accommodating! She was happy and so helpful. I will be back to dine in again with service like that. Well done!", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 5, "date": "2015-06-17", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "2FiNCj5rM3nF0qgaWf86Gg", "review_id": "38TeU9RI0jcANHdBk17GMg", "text": "Grotesque food, vulgar staff, blech.", "business_id": "fmuj7u1gflmEjW-h0v9bwg", "stars": 1, "date": "2009-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zuoeE7GdXXlCgr995ImWfQ", "review_id": "oOLUoRdXvTzcRVrqgOLZ8w", "text": "I have been going to Miracle Mile for years and years, and in my opinion it is still the best deli in town. Years ago, it was even better than it is now (hard to imagine), but it still has all of classics cooked to perfection. \n\nIt is hard to go wrong with anything on the menu, but my favorites are the daily specials. Try them if you haven't already, especially the beef stew on Tuesdays and the fish on Fridays.\n\nThere is not much else to say - if you want cafeteria style deli and you want it done right - this is the place to get it.", "business_id": "fmuj7u1gflmEjW-h0v9bwg", "stars": 4, "date": "2013-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "R9IDGn40u9IxiaNf2CD07A", "review_id": "D3AaGM7qUs2oy9uh-2qz2g", "text": "This review is based on the pastry and the friendly service (Pierre is great) - not the food (yet)\n\nIf you have been to Paris, the taste of the pastries will take you back to the flavors and flair of that great city\n\nI have been in to Au Petit Four a couple times, the first time everything looked so good I ended up with a tray of goods and got about 8 different items - that was a delicious day\n\nFast forward several months later and I stopped in again to pick up dessert for a bbq,  and the desserts were the hit of the event, the mille feuille and chocolate praline dessert were the two favorites, however everything is excellent\n\nThere is really no better spot to get in the greater Phoenix area to get pastry than here, I would highly recommend stopping in\n\nAs of this review I have not been in for food of a non sugar primary ingredient variety, however based on the pastry I would guess the food would follow suit", "business_id": "wftoNIA0Q8nX-Da47psBCA", "stars": 5, "date": "2013-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TYT5m7W0AyZ17XaFtOGk1w", "review_id": "nA3Nl_deFiSuBD1OmgOKiw", "text": "5 Star wings! Absolutely delicious hot wings. But only 3 Star pizza... Not the best crust, but it's still good for the price. I'd definitely recommend this place to anyone in the neighborhood.", "business_id": "VWcaFOSFcDwmFquycBzFyQ", "stars": 4, "date": "2014-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "W_R-gVF8OHNrIhtmyhDnyg", "review_id": "7s-RIXglXkWRzN984LCt0g", "text": "Small family owned restaurant in a strip mall tucked away.\n\nMainly decided to come here because we were looking for a place and in the area with good Yelp reviews.\n\nNot to be racist, all I have to say is beware of white people giving ratings for Asian Food, it is just a different standard.\n\nI would recommend the sandwiches which come on a fresh baguette that doesn't break your teeth when you bite into it. \n\nWe ordered the #18 sandwich - Korean Bulgoki Meat Sandwich and #20 - Spicy Pork Sandwich. I liked the Bulgoki Sandwich which had great flavor but could of used a little bit more meat. Would be nice if you could order double meat like Lee's Sandwiches. The Spicy Pork Sandwich was a bit tangy for me but I am not into spicy dishes.\n\nWe also tried the Teriyaki Chicken Bowl and the meat did not resemble chicken, looked more like a processed meat. Don't know if i would recommend the Teriyaki Chicken.\n\nWe also ordered some french fries to go along with the sandwiches which was pretty good.\n\nThrough some of the reviews people were raving about the Spicy Asian Fusion Ramen so we tried it and when it was placed on the table I started laughing because it looked like the Top Ramen Noodles from the grocery store that you can buy 10 for a $1.  So when we ordered the Spicy Asian Fusion Ramen we asked to tone down the spice,  appearantly they did not add the spice pack that comes with the Noodle package.\n\nIf you go, order the sandwiches, the bread is very good , I enjoyed the Bulgoki Sandwich and would recommend.  \n\nWanted to support small business and especially a family owned restaurant, but you can not serve that type of Ramen Noodle.", "business_id": "GSsq_y2PfYBzn51gAG_c7Q", "stars": 3, "date": "2015-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E1TKY4krbTVIfbxTZXL35g", "review_id": "o2DhfMZi7BP7rrlVEWOENQ", "text": "Food tasted as good as stuff from back east. Owner and server Dona seems to have an attitude but its a sweetheart and serves great food. Best pizza we've had in a long time I definitely would go back.", "business_id": "j0Uc-GuOe-x9_N_IK1KPpA", "stars": 5, "date": "2015-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BVx7_5ox_erPCm2Id3Ncmw", "review_id": "mQN_JjjSZcp1hFN32k4LZQ", "text": "I've been here twice and I loved it everytime. It's light, fresh and packed with flavor. I really enjoy their sandwiches and the pasta isn't half bad except the oriental noodles that was just way too salty. But other than that, very tasty stuff. They have a large variety of sandwiches with quirky little names. Oh and they throw in a cookie! Give it a try I'm sure you will enjoy it and want to go back for more.", "business_id": "S8R5c7-plWe3NtmijYAJvg", "stars": 4, "date": "2010-06-17", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "pQ6ij6cOBRB3yJGHbVZHUQ", "review_id": "0K09l2bbF-mKEM-gDnehSQ", "text": "Above average location. Clean, friendly staff and prompt, efficient service.", "business_id": "PeswraYFyhr33CmAK5oW5A", "stars": 4, "date": "2013-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pI4GGPlQ_leS4Aw_w5X3dg", "review_id": "Ck8ep95AXukz4zE2Jr95ag", "text": "Don't know how this place has 3 1/2 stars it's always been 5 stars for my husband and I. Excellent pizza and amazing wings and the staff is always awesome. Small place with 7 tables with red and white checkered table cloths.  It's a favorite for date night. We drive from Surprise to eat here.", "business_id": "GvwDppcJLm9lso9iS2hSIw", "stars": 5, "date": "2015-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "T_CTAXp6aH5HQhDPc6Kr_w", "review_id": "4Ts5ns4HbKwRvSJm4z_0jA", "text": "From the husband (native Chicagoan):  \"I've not had pizza this good west of St. Louis.\" That said, he had some notes, but who cares? If you are in Phoenix and looking for good Chicago pizza, try Spinato's. I had the \"half and half, double meat and cheese antipasto salad,\" which was excellent. We also ordered a spinach and sausage thin crust pizza--also excellent. Also, they delivered to the Hilton Squaw Peak hotel on 16th St.", "business_id": "YldXB1hRpnE1CWLF3mvgpQ", "stars": 5, "date": "2012-06-24", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "sv1yyjza7t9E3GO7rURJEw", "review_id": "xbIeUYi1Vqxz1IUy79NQuQ", "text": "I have never dined in here, so I can only speak about the food really.  I have ordered carry out and delivery many times from this place and have never had a bad experience.  Everything is always really fresh.  When I have done carryout the employees were always nice and attentive.  The delivery staff is always good as well.  Delivery has taken up to an hour at times on lunch, so just be prepared.  The food is still good, hot, and fresh when it arrives and is worth the wait.  Sign up for their email coupons and you will have a pleasant surprise every year the week of your birthday.  Bottom line, if I were to move from Phoenix and come back for a visit, my first food destination would be Spinato's for the Italian Beef Calzone.", "business_id": "YldXB1hRpnE1CWLF3mvgpQ", "stars": 5, "date": "2013-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "MHTZuj8I_obO_5Y9C9Zv8g", "review_id": "uOZDMbDQIIcwK1bZVp2oPg", "text": "a nice change of scenery.", "business_id": "4eFIVmbeCvJGCrhzmd-VYA", "stars": 3, "date": "2014-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gcyEUr4DXcbjnGRAWFtfAQ", "review_id": "YdkR55KEyCbWEg9ggFPNhQ", "text": "we were staying at the local resort and decided to get a few pies for takeout. We went with the Hawaiian and the Philly Cheese Steak pizza. When you walk in, your smacked in the face by the smell of ooohey gooey cheese and baked pies. Nuff said. Great.  The pizza was pretty good. It's not comparable to Cibo or LGO but this is a different kind of pizza joint. It's more in the realm of Pizza hut, Papa Johns and \nDominos except it KILLS them. can't say too much about great quality pies made at a local pizza spot, definitely a gem if your in the area and looking for a good pie", "business_id": "kxDGexkbP30fBvxVI0CzFQ", "stars": 4, "date": "2010-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0aouU2Yfzvdie87pI12-Uw", "review_id": "yIKaBU5idVX9F6oL5SLX1g", "text": "Love your pizza!!! However Every time I ask for delivery there is either an issue or you're \"too busy\" and have to check. I live 5 minutes away. Don't advertise delivery if it's always an issue. I'd gladly come pick it up without the irritation of feeling like I'm inconveniencing a business. \nPizza is 5 stars!!", "business_id": "kxDGexkbP30fBvxVI0CzFQ", "stars": 3, "date": "2014-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "X3y6Z8cu6A3YgsZ2RYu1Nw", "review_id": "7kgI5ysIPB87vTuZQQK-Ng", "text": "So much closer to authentic Italian/American cooking. The sauce was good, very good. The dough was a little old, which made it a little chewy...., but that didn't take away from the overall pizzaee goodness much.\n    I had a pepperoni, extra mushroom pizza and they piled on the mushrooms. It was such a relief to find a pizza place in Phoenix that resembles a good old fashioned NY pizza parlor. I will be back and am still searching for the best pizza, which hopefully I will find someday, then I can die a happy man. lol", "business_id": "V3lQtk1LgwAEcF9j-BzchA", "stars": 4, "date": "2012-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IUlFmJsKyP9vRvvBHr8NAQ", "review_id": "FofBcoHqln7fsDrMrCLL2g", "text": "I've been feeding my stromboli addiction at Famous Ray's this past couple of weeks.  If you haven't yet had stromboli; it is akin to an giant Italian turnover, (see the photo I posted), filled with the ingredients of your choice.  I'm a meat aficionado so I order mine with sausage, meatball, Philly cheesesteak, mozzarella cheese, jalapenos and garlic; covered in more garlic and a variety of Italian seasonings.  Awesome!  I always have enough left over for a couple of breakfasts, or a breakfast and a TV nosh.\n\nIf you've had stromboli on Mulberry Street in Manhattan; or in Bensonhurst in Brooklyn; you won't be disappointed by the same at Famous Ray's on East Bell Road.  If you've never had stromboli; it is a great alternative to traditional pizza.\n\nThere is some humor here also; each time they bring it to the table, someone always wants to know \"what is that\"?  After all, it does look like a giant phallus.", "business_id": "V3lQtk1LgwAEcF9j-BzchA", "stars": 5, "date": "2015-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tED7n4BqochNQetCxJSfCQ", "review_id": "yxeIkKtuYrxsAkTcs5FnWw", "text": "My favorite sandwich place in the valley.gotta try a chicken carbonara it's a must try. Also if no yelp deals try groupon.", "business_id": "FzKvQFDbB2bimdftxMO55Q", "stars": 5, "date": "2015-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "te4zq6s8b1vp76esPk3UAw", "review_id": "lMD_-ckb5ryOsKEULSKPcw", "text": "I am a big eater. Also from the east coast. This is the closest you will get to a New England steak bomb. If you know what a steak bomb is, you know how hard it is to find a good one out here in AZ. Grinder shops are rare but Uncle Sams offers the best steak bomb I have had in Arizona. It is hot, chopped steak, melty american cheese, grilled onions and raw, peppers, mushrooms, and hot peppers. Get the WHOLE. It is about 16\" of steak and cheese. If it wasn't so expensive I would rate it higher. If you like to pig out this is a great place to do it.", "business_id": "lf42gtgq_2_jPvjfp_K1nQ", "stars": 3, "date": "2012-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0ItqxKwFSTgkifR6Fv13dQ", "review_id": "-wYI--A3JjvLlkv3HkoXjA", "text": "I like coming to this location, but today they were a bit sluggish and the veggie bar was messy as heck. It made me not want to choose my toppings. Im hoping it was just a one day thing.", "business_id": "WPy74Udv6X8dgxK6F9uxCQ", "stars": 4, "date": "2014-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "TgXQJsWCTVE4BFijf0kM8g", "review_id": "SYRR57uat_-dtTQN0ztYxw", "text": "Tasty food at a decent price. Nice local alternative to paradise bakery. Today they had reggae music playing on Muzak.  Not enough seating, and the place was packed when I got there, but otherwise pretty good chow.", "business_id": "j5HLcBru7FEirYJPbKFVWA", "stars": 4, "date": "2009-06-26", "type": "review"}
