{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GLP24FIMxbe7W4Ig6OX4cw", "review_id": "pmcnidvQlRKffx-IXwLtDA", "text": "I've stayed at a couple of Extended Stay sites that I found quite satisfactory and this location proved to be just as good. Excellent place to stay while visiting Pittsburgh. It is just a five minute drive to downtown. Location is in a business park area so it is quiet. \n\nThe rooms contain a nice kitchenette area with a full sized refrigerator, sink, cabinets and two burners. There is no oven which I expected as the descriptions all state \"full kitchen\" so be aware of that. Also they do not keep the dishes, pots and pans, coffee makers, toasters or utensils in the rooms. If you want them you have to request them at the desk during check in. \n\nThe room was clean and well maintained. Cable tv quality is spotty sometimes but not intolerable. The free wifi is usually fast. \n\nThe best part about this location was the staff. The people at the desk were all very pleasant and welcoming and quite willing to assist with any questions or issues with a smile.  I would definitely stay at this location again and highly recommend it.", "business_id": "zgy27FSnvwdINfk5cXBIyQ", "stars": 4, "date": "2014-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k7wYU3nGV7u8ToIye_mCfw", "review_id": "EJzfNE7H0Ab4qSUNgae-0w", "text": "Pros: friendly staff, clean, nice pool and close food. Rooms are clean, bathrooms are nice.\n\nCons: towels were stained, walls were a little rough.\n\nFor the price it's clean and solid, needs a facelift inside as it's aged. But I'd stay here again!", "business_id": "nvrXLcmknaYuiGRquWhwIQ", "stars": 3, "date": "2014-07-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "1ToqCxhANlKXg5m8Mq6HyQ", "review_id": "ceVZM7shUmmRBqS39-UsXg", "text": "Very nice cheap quick bus service to airport. (28X).  but i think i've found out what happens to all the old buses in Seattle, they are shipped to Pittsburgh, old polluting diesel buses seem to be the norm.\n\nthey also run the inclines, which are pretty cool if not old.", "business_id": "1n0n_-Iz0e3iVpH8sereiA", "stars": 4, "date": "2008-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Dc-rkcPg9b4_otIxCfRHjw", "review_id": "XxzmdaPD2GlrcXMzYl-lgw", "text": "Despite being a Marriott-brand hotel, Courtyard Pittsburgh Downtown's service and room qualities were not up to par with the Marriott standard but still charged Marriott price.\n\nI had a bad impression of this hotel before I even entered. I made a two-night reservation for a business trip, but I was stranded in an airport overnight because of cancelled flights. I called the hotel to explain my situation and asked to change my reservation, but the receptionist was not having it. She was completely unsympathetic to my plight and insisted me to pay for the night that I'm not staying. Eventually, I had to get my project manager to resolve this issue. \n\nBoth the room and the lobby were not spacious, although that's understandable given that the hotel was in downtown. What's not understandable was the creaking floor throughout the hotel floor, which amplified no matter how light my steps were. Good thing that I was not living below night owls, but that would not matter because the AC unit was too loud to get a good sleep anyway. Why would a Marriott hotel have an AC unit that's louder than my grandma's AC unit from the 1980s is completely beyond me.\n\nSeriously reconsider if you decide to live here. Aside from sub-par room and service that are unusually low by the Marriott standard, note that the only available parking nearby will escalate the unjust price that you have to pay to stay in this hotel.", "business_id": "uILvDDCgw63_KJsZMO9GvA", "stars": 2, "date": "2014-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rGuk1S7MIU8M9ZE2mulVsg", "review_id": "Q6EJGosmL3tUv0TiG_IgyQ", "text": "If there was a tab for 6 stars I would have given it to the Renaissance.  We had our wedding there  in July.  From the woman who I worked with blocking off rooms for our out of town guests, to the catering professionals who helped me decide what to serve, how to seat my guests, just everything...they were stellar.  I think that is why our event didn't  have even one little hiccup.  They know what they are doing, they do it professionally and with a sense of humor.  I loved working with them.  I would highly recommend it to anyone who is looking for a stunning place to have an event.", "business_id": "A38wziZJdYoijhC5S6uWCQ", "stars": 5, "date": "2013-08-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "yCS_hr75GmRXCFgadFHtuA", "review_id": "dZGoTXN8e1F7aTzAnVzKWQ", "text": "I stayed at this hotel while attending a convention in Pittsburgh. This is probably the best choice for accommodations if you have to go to the convention center a lot since there is an air-conditioned pedestrian bridge link between the hotel and convention center.\n\nI thought the room and beds were comfortable. I wasn't so fond of the cutesy leaf-shaped soap in the bathroom. I didn't like that you have to put your keycard in a slot in the wall to turn on the power in the room. Sure, it saves some electricity (and saves the hotel some money too, I'll bet), but that means you come back to a hot room every time. We ended up leaving a piece of cardboard in the slot.\n\nParking is expensive. The hotel used to offer discount cards to bring the garage parking rate down to $10/day but they stopped doing that this year because of a change in parking garage management. So it's $20/day. Ouch! I parked at the Grant Street Transportation Center for $13/day weekdays and $5/day weekend. It's not bad but still less convenient than if I could park in the parking garage immediately under the hotel.\n\nElevators are slow and the escalators between the lobby and function room floors kept breaking down. However, I'd cut them some slack here because the infrastructure is not built for 4000+ people hanging around the hotel.\n\nAll those problems aside, I thought service was good and this hotel has a good location with walking access to lots of restaurants.", "business_id": "bWWrrsPWuoHuAGUCgH8Tyg", "stars": 4, "date": "2010-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wtsl05RJj5f6YBDQPEwP2w", "review_id": "nqh4Edv_-etq7wQNMUgTrw", "text": "LOVE it.\n We travel through Pittsburgh at least twice every year and have stayed at MANY hotels in the area, from 2-4 stars. The Shadyside Inn has now become our #1 choice in Pittsburgh...for the following reasons:\n1. Location - we like to go out and eat/drink in Shadyside because it's cute, safe and full of good-looking folks.\n2. Price is great value considering the high rent of the area and proximity to Shadyside shopping and colleges.\n3. Generous size of rooms and cleanliness... enough said.\nHIGHLY recommended.\nMinus one star for old plumbing and air systems,but they aren't inconvenient or unpleasant at all, just 'full of character'.", "business_id": "uXuiI-Y998JChGn-ebcSdw", "stars": 4, "date": "2011-07-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uA5QgEtGtwnT_n0JRwEMHA", "review_id": "JXCCLPhPVkYXCbKkSUX94Q", "text": "Let me address the positives first:\n\n  The mansion has great potential since it is a beautiful structure in a secluded location.\n\nUnfortunately, it appears to be very poorly managed.  If I were the owner I would hire a consultant who knows how a B & B should be operated and decorated.  \n\nConcerns:\n\n The rooms were not nearly as clean as one would expect of a B & B.\n\n The breakfasts were nominal on good days.  On bad days (we stayed three nights) the chef was late (15 minutes) and there was no coffee made and no fruit.  The breakfasts were served to the table serially, rather than together, with some diners waiting 5-10 minutes after the first person was served.  The chef/waiter had  to come back to the table multiple times since he forgot the orders.  He also appeared to be glum and possibly hung over or very bleary for some reason.  His chef's coat was dirty and he wore baggy shorts that were not appropriate for the setting.  I asked for cream with my coffee and he delivered it on an obviously dirty saucer.  After observing this behavior, a woman at another table suggested to our table that she should just go back in the kitchen and make the breakfast since things were going so badly.\n\nOne has certain expectations of a B & B's aesthetics and ambiance.  They were not met here.  The owner has a dog which I was told was a Portuguese Pointer.  It may be a fine dog but it barked in a very aggressive manner outside the mansion and in the kitchen area with patrons eating in the dining room.  That is not what you want to hear first thing in the morning!\n\nAdditionally, I opened an embossed packet in my room which I thought were thin mints.  The packet contained a condom and lubricant!  Wow!!  That seemed in particularly poor taste especially since many B & B patrons are older travelers. \n\nOur room had an unprepared hole and a long gash in the wall.  There were no pictures hung in the room to improve the appearance.\n\nThis crew may mean well but they really don't have a clue about operating a good B & B.  I would never return and would never recommend it to anyone.", "business_id": "Ump9ZR6bsyXnHgxWCxcHxA", "stars": 1, "date": "2015-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V7TqSaAOIucvOlJE5gUsIg", "review_id": "FIkSW8xv_i8Ekl59n3FJnA", "text": "Just stayed there this weekend.  There are BED BUGS....did I say they have BED BUGS.   We stayed in room 326 on the 3rd floor, and in the morning my niece woke up screaming \"something is bitting me\", we tuned on the lights and she had big lumps on her back and arms. Moved the covers on the bed she was sleeping in and there were BED BUGS CRAWLING ON THE BED.  \nWe called the front desk and they said maintenance won't be in till 8am and there was nothing they could do.  Asked for a manager and was told \"no Manager works on the weekend.  \nThe toilets were clogged in our room and in a friends room.  The housekeeper Keisha brought up a plunger and told us to take care of it.   Smh.  The worst stay in a hotel ever.   Don't stay there.", "business_id": "ljk9LMGlc8ItupjrSKBoRg", "stars": 1, "date": "2015-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yR04yrpjBf1BH5mTnG54ZQ", "review_id": "g8WBe7o7d0gLTYPG_OIAjA", "text": "My husband and I visited the Dunhill, originally planning to spend our wedding night there. They are historic, quaint, and conveniently located in Charlotte. Walking in to the check-in desk was a breeze. Everyone was very friendly. Walking through the halls it becomes evident this is an old hotel. It really could use some restoring. The hotel room was small, bathroom was small as well (though they've tried to modernize it with decoration & hardware), and just overall underwhelming. The ceiling had many water spots where water had leaked from above and dried the ceiling yellow. They also have a restaurant in the hotel with good eggs benedict, but for the price, I wasn't impressed. Again, friendly, great historic hotel (which I normally love), but didn't live up to its reputation for us. (We visited before our wedding and booked a room at the Ritz, which in Dunhill's defense, was brand spankin' new.)", "business_id": "zwwmnQXk8jhFs4wwU8I4Ow", "stars": 2, "date": "2013-06-26", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "XgIhw-aWaq_Fx3ZVQGjnuA", "review_id": "Ij8S1vWiukanH-GOfmaCeQ", "text": "The hotel staff is great!  The hotel rooms, well lets just say that apparently Marriott now thinks that desks and desk chairs are not needed in a hotel room.   So yep, just spent my last night in a Marriott.  Simply unreal how this formerly customer centric company has fallen to be so mismanaged.\n\nI think that Marriott either does not understand why people travel or just how badly this is going to impact their business once people see they cannot even set up a laptop and get some prep work in before meetings.", "business_id": "fJ72j9pRjLcRzBA_EhB4-g", "stars": 1, "date": "2015-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fa6ESRnjj3n4SIebn2F8vA", "review_id": "_lNa-THXJBUoZLPH80KJ2A", "text": "Need a place in Charlotte to get black out drunk without fear of waking up missing vital organs? Than the Westin Charlotte is the place for you. Was witness to an amateur drunk who passed out. Rather than doing the typical bounce and toss the staff gave genuine care and concern to the help him through the this moment of self reflection. One employee went so far as to ice his neck in hope to help him sober up, if nothing else at least remeber his name. Even when the EMTs arrived and drunk punches were thrown the staff stood stoically ready to show their support for their customer. So, it became a dinner and a show. Five stars.  NERD RAGE!", "business_id": "4nFqPL-glgDm9v7bZptskQ", "stars": 5, "date": "2014-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EnXGx4FdSVlk80BHSha_OA", "review_id": "AYnDkyBJvGHCEDm_2z2fIg", "text": "VETERANS BEWARE!!!\nThis hotel has decided not to service those who have paid the emotional toll of serving their country.\nPlease read on to hear our story.\nMy wife and I made reservations, then emailed Holiday Inn to inform them of our emotional support animal, for which we do have a letter from our doctor stating the need for this animal. When we arrived, we were told that they would not honor our reservation due to us traveling with an emotional support animal. I asked why and they recited the NC ADA rules. Now, we have NEVER been turned away from any establishment in the past, including Holiday Inn And other hotels and businesses in North Carolina. \nI spoke to the general manager on Tuesday and specifically asked if anyone would be turned away in the future with an emotional support animal and he also hid behind the ruling. This ruling does NOT state that services cannot be given to persons with EMS Animals, just the definition. You decide.\nAs an after thought, we drove to Columbia, SC Where the Holiday Inn Express Downtown welcomed us with open arms.", "business_id": "Fi5sQxROyTLp5qDuYKz6bQ", "stars": 1, "date": "2015-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vv1g1qlpo3R4ZJrIJTHX8w", "review_id": "U6dABPpS-zH42ZSLyEINiA", "text": "This hotel is in a good location, right next door to the NASCAR Hall of Fame, and one block away from the convention center. I had a nice two room suite on the 9th floor (so I can't confirm or deny the comments about the stench on the lower floors). The room was clean and comfortable and there was a nice jacuzzi tub in the bedroom. All the staff i encountered were friendly and helpful. i will say that it was a little bit of a walk to get to the \"heart of the action\" in uptown Charlotte..not too far, but in the 90 degree weather a slightly sweaty walk :-)\nI will agree with the other reviewer that said the coffee was terrible..i agree whole heartedly, but since there are so many nice coffee shops in uptown charlotte there are other choices. All in all a solid choice to stay.\n\n\nPark yourself and save the $15", "business_id": "cBoFcjuNaWDQ2MP7GgeSBA", "stars": 4, "date": "2014-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7K2eLx-QKtVIW65hrjUWiQ", "review_id": "ie-5w8YmYzp-FaUvlp_ejw", "text": "Stayed here for one night.   Great location great staff. Perfect location for visiting Charlotte, stayed here for UNCC move-in and wan't a better option than those hotels by the campus. Looking forward to my next visit.", "business_id": "QThlnQ7AvzZwXHKD5DjdCw", "stars": 4, "date": "2012-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iYLtLxjDJ53yo1T8atC6xQ", "review_id": "3BSO7TFk6qOBk_LgQXfUSw", "text": "DON'T STAY HERE. room was not clean had coke bottle and spit cup with cig but ts in it and read of urine.  Crack head central. Canceled reservation and found another place.", "business_id": "k4LL_I27WNAYFWn_Nf6tlg", "stars": 1, "date": "2014-06-23", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 2}, "user_id": "ZuQ87LQYWRw3AHj-jEiQ1Q", "review_id": "ipmaCSVSdWN6zyg-ewkEGg", "text": "The rocking chairs are genius!\n\nThey're perfect for weary travelers that just want to relax especially those of us in between flights. Ahhh genius.\n\nAnd did I mention the food, they have everything you might be craving and some new ideas that will get your mouth watering. \n\nThe staff was polite and helpful. \n\nSome other airports need to come study this airport's success and learn a thing or 20.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 5, "date": "2008-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "R8kIWnvYj6UjzLU3Q-a_Pw", "review_id": "SM5oEBRFKxzUYFvGAYP3fw", "text": "This would get such a good review if it weren't for a strong negative or two.\n\nOverall, it's good.  Quite a few food options.  D and E Terminals are pretty nice (A and B, also, if I can remember correctly?).  The Mexican place in the Food Court isn't that bad.\n\nNo experience with security, parking, or check-in, tho, since it's always a connection from CHA or TYS.\n\nNow, the two things that really are irritating:  Why do I ALWAYS have to fly in on Runway R18?!?!?  It takes a friggin' fortnight to taxi to the D or E gates from here.  Uggghhhhh.\n\nThe other is the distance between terminals.  E gates are spread out like crazy, and if you're walking from A to E or something similar, then good luck.\n\nFortunately, if you fly US more often than DL, you connect here instead of ATL.  Charlotte doesn't get as many random storms, and the airspace/runway traffic isn't as bad, so delays aren't as likely as they are down in the A.  Unfortuantely, if I fly out of here back to CHA and a flight gets cancelled, I'm probably stuck for the night, as I could hop on a shuttle van if flying in ATL instead :/  Oh well.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 3, "date": "2010-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "svDfyraZSfiBT-CvrsycXg", "review_id": "kxTZ3-z7Hlvzyvr4oosgUQ", "text": "As a resident of Charlotte and frequent traveller, I fly in and out of Charlotte at least a dozen times a year. However, I have never travelled *through* Charlotte to catch a connection.\n\n.Daily parking is the way to go at 6 bucks a day. Unless of course, you're going to be gone for an extended period. Twenty-five dollar flat fee cab ride to Uptown.\n\nFor me it's a very manageable airport size-wise, on the smallish side \n( uh, hello sprawling airport nightmares: ATL, LAX, ORD, and JFK to name a few).\n\nIt's pleasant enough in decor with white rocking chairs abound to sit on.\nSecurity is the typical annoyance. No more or less. \n\nTypically, I don't even bother to get to this airport more than an hour in advance, unless I happen to want to catch breakfast at Salsarita's - their breakfast quesadilla is a cheesy, fast-food indulgence that starts my travel day off right.\n\nAs others have mentioned, dire need of more outlets. \nBut I find that's true in most airports. \n( Seriously, what is UP with that? How hard is it to install permanent power strips or docking areas?)\n\nNOTE: All three security checkpoints A,B,C can be utilized in the event of long lines at any one in particular, as they essentially drop you off in a central area. You'll just have to hike a bit more pending where your gate is.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 3, "date": "2011-06-26", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "d1ht6PfHF5cWaxbAF1Hwrw", "review_id": "3XCGIXYuwSNggYdyf2r52w", "text": "Actually one of the best airports I've been too. \nWould I go back? Hell yeah? \nAnytime soon? Hell no.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 4, "date": "2011-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "-69W-wX_i956PER5dx57bQ", "review_id": "xJAALaOaJ5YmubQJVyaiJQ", "text": "I like this airport because:\n- It has jamba juice\n- It has lots of flights and connections\n- It is clean and the people are pretty friendly\n\nMy complaint?\n- walkways are WAYYYYYYYY too narrow for the volume of people walking down each concourse", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 4, "date": "2012-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZVSI_bobVGDo__hsL_dqQw", "review_id": "4a5XMILlSiw_R-gr_sboGQ", "text": "Charlotte-Douglas is a very small airport and it pretty easy to navigate as a result. Security is pretty smooth and I usually only have to arrive 1 hour to 45 minutes before my flight to get to the gate on time. I always check in electronically, however I don't believe they are equip with the smartphone scanners for paperless travel. Not to big of a deal, the electronic kiosks and usually never too busy so printing a boarding pass is quick and easy. \nThe long term parking lots a pretty cheap if you can't arrange a ride and located very close to the airport so the shuttle ride is short. Give yourself 15 extra minutes if you need to park long term.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 3, "date": "2012-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HuIIU6VGcPjZIqWcnutKNw", "review_id": "dVRTeqKs7fmZId8GPKFK_g", "text": "Super crowded! Worse than LGA!", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 3, "date": "2013-06-20", "type": "review"}
{"votes": {"funny": 4, "useful": 0, "cool": 0}, "user_id": "MgXCmbT_XrNYt76pgcE6lA", "review_id": "9LuGbds4XcPit7URGRAoRA", "text": "This airport is scary.  I've never encountered so many people handing out bibles to people on a layover flight.  I now have no interest in flying back.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 1, "date": "2013-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DgUEXCdcWXThaYgNK0rnPQ", "review_id": "it4L66F63eLIZYd1SRfUCg", "text": "Dear Charlotte Airport:\nWhy don't you pay your restroom attendants enough money so that they don't have to beg for tips? After spending money for the flight, an extra $25 for checking a bag, $4.49 for a teeny bag of nuts, and $8.50 for a $5 salad, I just don't FEEL like tipping to use a[n admittedly clean] public restroom. Pay these people decent wages.\nAlso, why do people have to sit on the FLOOR to use the electrical outlets? You lose three stars for these things. You get one back for your superior recycling system.\nYour pal,\nAmanda\np.s. I think you may have fleas.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 2, "date": "2014-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VEtVKHZIEjq_YTd8ZPBu-g", "review_id": "0QQzcT9xkT6Y_EkKVC1dtw", "text": "This airport is having a terrible time with the parking solution right now. they need to get this fix quickly. apparently they are rebuilding new parking decks so in order to park you have to park at the lots across some street and get on a suttle in order to get  back to the airport. so terrible if you are not just picking up and dropping off your friends and family.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 1, "date": "2014-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "iXPZDIRWNWY8Pdbz19deag", "review_id": "vtHnsHQHE1kazTGpdu73TA", "text": "Very nice airport a lot of selections of food we stopped at Sbarro's to grab something to eat.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 4, "date": "2014-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VH1UbPxAYjAzjVs7WMhJEw", "review_id": "FhEabnwROW7KWJoQQdAd1g", "text": "I have no idea how things are on the Departure side of Security.   But, for anyone picking up a passenger here, this is one of the worst airports I can imagine.  Other than a Starbucks (w/o seating) and a magazine shop, and a \"Cafe\", there is nothing.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 1, "date": "2014-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XT5MlvOZBr1BT2EMglA6Mw", "review_id": "VqAmZZ36uBr0dzDMra0rLg", "text": "Terrible airport for a layover. Walking from E40 something over to B6 should not be do laborious and definitely would be hard to do successfully with any shorter of a layover or if my other flight had not landed a smidge early. Not to mention half the moving walkways were not working. Will be avoiding layovers here in the future.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 2, "date": "2014-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ySTnJFACtI0MkCS1tj_6cQ", "review_id": "fJnT3Z9079aKorAV4TPQoQ", "text": "My first time experience here wasn't too bad. It's an airport; there's nothing really exciting when you are shoveling around to catch the connecting flight. I give it five bc there was a lady in the bathroom that made sure stalls were ready for use and cleaned what was dirty. I got lost and a lady was there to my rescue. Yay!", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 5, "date": "2015-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YxxhqdNuuQ5Kl3oo2GxU-w", "review_id": "02x6sd4iObHqtwjB8qJ0DA", "text": "Plenty of chains and local fast food restaurants to choose from and a fair selection of bars. Prepare to walk a decent amount of time across terminals since there's no parallel terminals to send buses or trains through. There are moving sidewalks if you're feeling lazy but since most people don't practice \"people mover\" etiquette, it's more efficient to walk. Exercise is good for you anyway.\n\nThe new addition of the rental car parking deck has eliminated the need for a bus to get a rental. Genius move. Top notch facilities and lots of space leave you feeling welcomed and privileged to be renting a car.  The long term parking, however, is another story.  It's still far from the terminals and require buses. I can't complain too much since I've never waited more than 10 minutes for one in the past year.\n\nOverall, it's just another airport to get you from point A to point B. Give this airport some time to finish construction and renovations and it'll be a 4-5 star.\n\nMy closing comment is that either when departing or arriving, all of the runways are north/south so you have an awesome view of the city if you're on the correct side of the plane.", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 3, "date": "2015-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-eRuUT18nMVrF9TcHIKdlg", "review_id": "APeBAzvHZLjztFGE0dixmA", "text": "I'm happy to call this my \"home airport\" if u fly U.S air or American this is a great place to fly out or connect through because it is the \"hub\" for those airlines,also I haven't seen but friends have told me there are bathroom attendants in the airport restrooms I think this is creepy anyway that is why I give this 4 stars", "business_id": "3Q0QQPnHcJuX1DLCL9G9Cg", "stars": 4, "date": "2015-08-23", "type": "review"}
{"votes": {"funny": 6, "useful": 5, "cool": 2}, "user_id": "AKvEiRlf-6vJnM0uZ1nq3A", "review_id": "06uDhrs5zb-SU0i5j6C0Bw", "text": "I got there at midnight to pick up my rental and the entrance was gated... After checking to make sure we weren't missing another possible entrance, we drove up to the exit and the pleasant employee informed me that they close the gate at midnight and everyone has to come in through this way... You know what would have been nice?  A sign that says that on the closed gate!  Something with a nice, little arrow that says, \"Hey, we're still open, just go right down here.\"  Is that hard?  I guess so.\n\nInside, the woman working at the counter was nice... She had me completely finished in about 10 minutes and I headed out to the car... It was a 2013 White Dodge Dart... I took a nice lap around the outside to make sure there weren't any dings or anything and went off into the night... I heard a weird ping sound while I was driving a few minutes in, but it was directly behind me, so I figured I would just check it out when I got home since we live pretty close to the airport... Ladies and gentlemen, I got home and checked the backseat of my rental car to find an empty bottle of Great Lakes' delicious Commodore Perry IPA!  Look, I understand that it's a delicious beer... I love beer almost any time, but you know when I don't love it?  When it's in my rental car, rolling around in the backseat with a fricking open container charge attached to it! What the H?! Upon contacting them the next day (because the manager wasn't onsite), I found out that the manager would \"talk to the employee\" that cleans the cars, but they would accommodate me when I returned... \n\nThe car worked fine for the trip and it was time to return it... We pulled into the bay... We cleaned the interior and unpacked the luggage, but still hadn't seen a person to check us in... After about 10 minutes, I spotted two employees standing by a door, doing nothing... As I walked by them, they walked into the bay of cars, but only pressed on the hoods of them for some reason and just leisurely walked on to the next... Once I got to the front of the bay, I noticed a small sign that didn't even reach past the height of the hood of the car it was in front of ... It said that they do not have people to check in their cars... You have to leave the keys in the ignition, write down the mileage and check in the car inside... So no inspection upon return, guys?  I'm just supposed to trust that you won't run up some random charge on my card for damage or what not?  Really? \n\nInside was a straight up flustercluck... There is no other way to describe it... About 15 people waiting in line for TWO attendants and one of them ended up being tied up by one lady from France who didn't know she needed a $200 hold on her card... Apparently her boyfriend rented the car for her, but she doesn't have any more money and he won't go to the bank to put more money in the account... But she doesn't understand because this is a once in a lifetime thing and he never does anything for her and she needs him to leave where he is and go to the bank...  But he doesn't... At least not for the half hour I was in line to return this stupid car... The employee listened to her calmly and explained her options, so he gets points for that, at least... Then I noticed two other people come out of the back, walk through the area we were in and head outside... One of them was very clearly identified as a manager... How in the H do you miss a loudly complaining customer and about 15 other people with extremely unhappy looks on their faces packed into your lobby if you're in charge of something?  Oh, I know... You just don't give a f***... That's how.\n\nUgh.  Look, if you want to be open 24 hours, then you need to have enough employees on staff to make that happen as smoothly as possible... Otherwise, just close down and leave that for people that understand that good customer service doesn't only happen during traditional business hours! Oh! And my accommodation made for my possible arrest?  A 10% off coupon for another rental... Let me tell you where you can put that... On my next trip out of town, I will be renting a horse and leaving days ahead of schedule...", "business_id": "eThu9hCL8NOjOxswQ-cFSg", "stars": 1, "date": "2013-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "-K_mS4JilLKcHHjB36h4GA", "review_id": "BHmIgk7HKEdNpN-MD6QagA", "text": "Unfortunately I cannot give Less than One. Their negligence borders on criminally dangerous. \nI, my nephew, his mother (my sister) and my daughter flew into Charlotte. We had prior reserved a Car with Hertz. The line was about 15 people long and the four at the front simply did not move for a solid 20 minutes. People were commenting in line. At about a half-hour the line began to move. We were in line nearly an hour before we were serviced. That's when problems began. The talkative but non-productive rep seemed to be preoccupied with anything except moving the transaction along. I allowed him to 'upsell' me to a larger vehicle and paid an additional fee. After around half and hour, the transaction was finally completed. My sister is crippled and in a wheelchair, my daughter is a diabetic. When we went out to the lot, like a bad movie, the space was empty - No Car. I walked all the way back, my sister et-al waiting in a fumy inside parking lot space, in case the car showed up. When I got to the Hertz Station I was asked \"How long were you waiting?\" apparently it's accepted and standard practice at Hertz to wait in an empty space for no less than 15 minutes. I went back out after I was assured a car was on it's way. After around another 1/2 Hour, the desk person walked out to our parking space. He told me to go back in and they would give me new paperwork for a different car. I did this an finally after another 10 minutes a smaller car than we'd paid for showed up. We took it because we were already exhausted and also had schedules to try to keep.  Avoid this disaster. Others were also walking over while I was in line complaining about not getting the car they paid for, etc. This is as bad as it gets other than physically harming people. Not only this, but they charged for 4 days on a car we'd rented for 3!.   \nSummary:\n*Long line with long waits\n*Long transaction times\n*No rental Car in parking space!\n*Long wait in empty parking space! (invalids no less!)\n*Smaller Car than paid for!\n*More day's charged than used!\n\n\nAvoid this terrible Hertz.", "business_id": "eThu9hCL8NOjOxswQ-cFSg", "stars": 1, "date": "2015-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RfBvpzPhXNJ_DPqiepJyuQ", "review_id": "nRIRZzS_XeXZd3bbJzqcQQ", "text": "Loved how easy the pick up service was, and now having the cars at the CLT airport parking building - it was an awesome experience!", "business_id": "t8Dz2luOZ-4NhT8DPxFdqQ", "stars": 5, "date": "2015-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FUvyGfeOxcpC_l4Onw16mA", "review_id": "3I72bHj3VgshB5EbNfAz_g", "text": "This hotel is stuck in the middle of nowhere. \n\nThe restaurant staff is relatively friendly, but the space/decor is \"budget\" at best.\n\nWe had several problems with the Receptionists. Problems include: not being able to book a taxi, problems over room check-in/double booking a our room, and being rude over the phone.\n\nAlso, our Damn Room Key would never work!?! I had to walk up and down every time to get it to work again..\n\nMy best advice, pay a little extra money and book a hotel in Uptown Charlotte. This place doesn't deserve the business.", "business_id": "g42cM7kIBsP1o3VBkLtHuQ", "stars": 1, "date": "2013-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6xt4XYMXEmt_pXCGH36U5w", "review_id": "RAuOQUMAeghN5g1HFVHM7A", "text": "Pretty happy with this place. Stayed here a week on business. Clean, quiet, cheap, friendly and comfortable. A couple of minor issues like light bulbs fixed immediately and cheerfully. \n.\nBreakfast was standard boring fare but clean and uncrowded. \n\nPerhaps it is worse on NASCAR days but it wax fine for me.", "business_id": "74dAKJ9Lx0cYmb3GOxdFEA", "stars": 4, "date": "2014-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "5CDOfabWcVGI7xtq-o4e_A", "review_id": "dR2OGSVmkgE6mXjfbJoOkA", "text": "this is a nice surprise as a midway point between Atlanta and Central VA. keep in mind there's road construction so it's tough to see the entrance.\n\nvery impressive overall. the joint is nothing much to look out from the outside, but the suites are appointed very well. the full kitchen had a freezer and an ice maker, which is great for travelers who want to keep things cool.\n\nthe bed and the linens were actually above average on the comfort scale, and the dog was quite happy. the $75 pet fee is pretty outrageous IMHO, since other hotels of comparable scale are either free or at $25. Hilton should reassess that policy.\n\notherwise, I'd highly recommend this place as a good stop just off I-85.", "business_id": "DzZfyKpQTNzSFGFSo3HunA", "stars": 3, "date": "2015-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pudbcALQ7gUEkH8x65E33w", "review_id": "cyXCZNtdsdOHT5KemaTR9A", "text": "Very nice campground, clean bathrooms, pleasant and helpful staff, great water pressure, and very conveniently located. The only issue for me was it was so close to the interstate that it was very noisy and the light from the nearby restaurants was very bright.", "business_id": "1xSlXGz5wssA5vVxcUnb4w", "stars": 4, "date": "2015-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Re_-wkpm-NQvJn2CL9Gn7g", "review_id": "xuDZP7G08t2Xnfy7ULfypA", "text": "Service was great, including providing a local 3-mile and 5-mile running maps  Breakfast was excellent. We will be back.", "business_id": "ckLRf3lYn9DxmNxd-mu2yA", "stars": 4, "date": "2012-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zw2jMAnPq1iNr30DiKSzxg", "review_id": "y10NsQTi-qzydCrvirmSUQ", "text": "Worst red roof inn i have ever stayed in. I didnt have any high expectations considering it is the least expensive hotel around but if i am paying $70/night i would at least expect to have a clean room. Our room was stinking and toilet bowl has dried stains on and inside it. It smelled like it hasnt been cleaned for a long time. Bed comforter had dried stains on it as well. It was absolutely gross. Do not stay here unless you are okay with the filth.", "business_id": "GQN1Y9iC8rfxMKKo2lEiug", "stars": 1, "date": "2015-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "f9K-uNCJRE8dXKm-iqF-3A", "review_id": "KS4vyeI3x5Yrrdk5Ry5yKw", "text": "I have stayed here before without any issues. This last stay of 6 nights was a different story. The first night we had loud and rude neighbors. The sixth night and seventh day our room smelled like pot. The cleaning people did a crappy job and the hallway looked like it hadn't been vacuumed in quite a while. I will not be staying here again.", "business_id": "i9JeI7bd1qXGi15FoD45GA", "stars": 1, "date": "2013-07-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pMYa1488Nn9D14a0_aNXrA", "review_id": "cKFnjl6uU6WmevezChatuA", "text": "I expect clean rooms and a courteous staff. That they provided. However, it's 2015, and I also expect an Internet that's fast and functional. This was neither. Literally slower than dial up. I expect more from a Carlson hotel. Really disappointed.", "business_id": "hmYAW7mhIz_o8ArencdkDw", "stars": 2, "date": "2015-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s3p3db5ai1FZ2LFL20RXuw", "review_id": "UdkhCbdQr0PC-iqRdeYtaw", "text": "This place is awesome. Everyone I dealt with was super helpful-from Courtney who helped book my car to the funny, friendly guy who drove me to and from the Enterprise facility. I had a great experience here and would recommend to anyone needing a car.", "business_id": "deLj0wIgJYOPtyJCn8ar4w", "stars": 5, "date": "2014-08-28", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "j2KVhQub5UoKaE7qje31Wg", "review_id": "XsHTNkOgiG0qAZAOzbrdmA", "text": "Rundown rattrap. Low price was the main attraction. Place was noisy, and needs complete renovation. Manager was sarcastic, toward any complaints. Have stayed at other Red Roofs; nothing like this one. Moved to La Quinta next morning.", "business_id": "iHz3Rn0pjAcO46LXv3kuEw", "stars": 1, "date": "2011-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bmzq_nkjYqp8aWn12RJdhA", "review_id": "p-0kqEcVa6S7YVOStGWRKg", "text": "Wanted to ghost hunt but was too drunk and had a blast with naked chicks in the pool. Walls are paper thin...", "business_id": "_yfprBETaYgySkKyl8ZWMQ", "stars": 3, "date": "2010-08-14", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "PTTACvsRCsdawDqRDlW3EA", "review_id": "XIn8WjFhCrYNrJaDSzpX3g", "text": "Other than the convenient location to the Diamondbacks stadium I was not impressed. It's continental breakfast consisted of two types of cereal, bagels and coffee with juices. They put me on the backside in the corner closest room to all the construction. Parking was very limited due to the construction. The window in my room looked into the backyard of someone's home. The AC only covered one part of the room and isn't strong enough to cover outside the bathroom and inside of it. Seeing as it's Arizona it was 110 degrees and the AC is highly needed.\n\nThe customer service was good.", "business_id": "BSGcS1EWEkGP2LS1nOZGPA", "stars": 2, "date": "2010-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eaPzlSDhE5Nemi8rrdfxJA", "review_id": "Q7T-BR2NGCdgLZLKjfZHJA", "text": "Free Parking and Breakfast. Affordable during summer season. Spacious room and ideal location close to Papago area, Botanical Gardens. No complaints, Will stay again.", "business_id": "qIhBNeE64skjowRs6TTwJA", "stars": 4, "date": "2015-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "djV4BQJ1r533tMKwYI1tBA", "review_id": "S5XY_wISTobEfrIdKZaWzg", "text": "This was one of the nicer Residence Inns I have visited.  I was there June 1-3 of 2015.  The room was really nice. The exercise room wasn't amazing, but it had all you needed.  The breakfast was actually pretty good.  They were pouring a local beer & had snacks at happy hour.  I will stay there again.", "business_id": "LO3uvzhh3fUtEQD3AJUxWw", "stars": 4, "date": "2015-06-15", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "c-7doN-Ek_BjzqOmZTi3mA", "review_id": "lAd3aeYyfk8Qgu_xRFYL1w", "text": "We used to always stay here on our baseball trips when we would play Grand Canyon University.  The rooms are really roomy and have a pull out couch that easily accomodated four people.  There was also a big screen TV on a swivel.  The bathroom was a little small, but their room service was really good and they would do a good job of cleaning up the messes we would make.", "business_id": "KQzpjBmnAMXPqipeWTKG0w", "stars": 4, "date": "2010-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XAuBFVTB4WVZ4UL_6Mq4Sg", "review_id": "2Cj1LABeOKAT-JXuKx5hOQ", "text": "4.5 Stars\n\nCame down to Phoenix several times for a business trip and stayed at the Ritz each time. When you drive up, the valet/bellman forewarn the hotel reception of the arriving guest so you are greeted by name when you check in. \n\nGreat service, food and amenities! \n\nThe morning room service waiter (Joey) was very pleasant and have to commend him on bringing my morning breakfast promptly at 5am each day. \n\nEyed some purchases in the lobby store but they were closed. The manager was kind enough to open the store for me after hours.  \n\nMinus 1 star for the parking since it's valet only and I stayed here for over a week at a time, so I had to plan my outings carefully or ask my co-worker who stayed in a different hotel which had self-parking to drive. \n\nPlus 1/2 star for the wonderful Bulgari toiletries!", "business_id": "HLQUH1VAw4KbSV-IhxOPEw", "stars": 4, "date": "2010-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YU-4RDSV-Ska6blimoW0_A", "review_id": "4DwYPtnPmKuGnVERInynxQ", "text": "Good price at $80/night with AAA discount and the 1 bedroom suite was great. I like how all the rooms were connected and not spread out across different buildings. Especially since it is summertime and is quite hot outside. It was nice having two TV's in the room too.\n\nBreakfast was great with all the usual eggs and sausages; and they even have a light evening dinner Mon-Thursday ( but we did not try it). I like the cold juice/water in the lobby during the day/night especially since I visited during summertime.  Location is great too near the biltmore district. Across the street is a Trader Joe an Whole Foods grocery store so it is very convenient to grab a few groceries. My only gripe is the wifi signal was a bit weak. The area was very quiet at night too. I would stay again", "business_id": "AnqXhbdkHHimMBR3UMS1Jw", "stars": 5, "date": "2014-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6cWa7A1-u93b9yc7K7rtvQ", "review_id": "VBklM84-f4w6BeV90ZAXPA", "text": "This place is old, furniture is ugly, rooms are dark and smelly. Add to that the manager was really rude... this was the worst part of the phoenix trip for me.", "business_id": "-nWigG5EhFLjdSgGZthS3Q", "stars": 1, "date": "2008-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "7GYMv8LXlYCX6cFh3OmMEQ", "review_id": "gylajv7n82x3opYa_e5l8Q", "text": "This resort is just as nice as the Four Seasons.  I really like the service.  People are attentive and friendly.  It's a historic hotel, so it has history to it.  T.Cook's is DELICIOUS.  Last night, they had a chef's tasting menu that included a dish he created on Iron Chef.  My mom had that dish.  What really stood out was my breakfast this morning.  I'm not a breakfast person at all; however, my french toast with homemade chicken sausage was excellent.  The rooms are beautiful and clean.  It is still kind of dark with all the lights on; however, just step outside during the summer and you'll get enough light.\n\nThe pool is small and not as nice as some other hotels I've stayed at, but that didn't bother me because as long as my toddler had a good time in there - that's all that matters to me.\n\nI definitely will come back next time.", "business_id": "rLAeltELaGdQKh_LYIllEA", "stars": 5, "date": "2009-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VrFGtKTrwDdatstECAiKIQ", "review_id": "hapI-LaXOjiRO2KLBKEB_Q", "text": "Second time staying at the Royal Palms Resort and Spa. From my first experience, I knew there was nowhere else to stay in the Phoenix area. First of all, the resort is absolutely breathtaking. This is not your average high end hotel, this is a beautiful resort filled with accommodating staff, guest services, amenities, and luxurious rooms.  And of course a fabulous restaurant/bar with an amazing chef and excellent menu.  The pool is also 5 star status, open 24 hours and food/beverage service is available certain hours. It is the ultimate in luxury. I have yet to experience the spa services, but I will hopefully indulge myself in them someday. The rooms feel like you are in a Tuscan villa. Every little details astounds you. We had very knowledgable and experienced waitstaff at the restaurant, Jeff and Miguel are amazing. Each staff member is enthusiastic and friendly. We invited a good friend from the area for dinner and she was so impressed her and her husband are booking  a romantic getaway here even though they live ten minutes away! They are also service animal friendly, and treat service dogs with extra care and respect. I will never stay anywhere else in this area. So glad I got to show my mom and friend the best of the best. This place is a cut above the rest.", "business_id": "rLAeltELaGdQKh_LYIllEA", "stars": 5, "date": "2013-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "CJA57x8bAFiPQw0z1yElpw", "review_id": "ETrE4iIlz5ZYYyzyb2cSwg", "text": "We had brunch here yesterday. The staff was friendly and helpful with recommendations. The food was amazing. The graham cracker French toast was our favorite followed by the lemon ricotta pancakes. I would recommend making a reservation, the restaurant isn't that big. I look forward to visiting again when it gets cooler to enjoy the out door seating and possible a happy hour. Their bar area looked like it would be a great spot to start the evening at.", "business_id": "rLAeltELaGdQKh_LYIllEA", "stars": 5, "date": "2015-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_yAYfwnlbou2OIqSxi7O2Q", "review_id": "dnqfajPoNkFFT2yDYtBn5Q", "text": "We have taken several trips this year and Annette\nWas MOST helpful and resourceful in doing\nThe research and planning for us and several other friends !  We just returned from London and several\nSide trips arranged by Annette were extremely\nSuccessful and educational for us !\n\nAnnette is SO knowledgeable about various cities\nOf the World and how best to enjoy them\nAt a reasonable price !\n\nAnnette is the BEST !  Thank you for doing all that\nYou do for us !", "business_id": "vBRJWnMaAqUyZ1CbwnJXLQ", "stars": 5, "date": "2015-08-21", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "3JtdBvnY6Wzp22gt5zFwDg", "review_id": "DHWxO8HzW7WQII7KxNuO2g", "text": "Very close to a 4 star performance.  The shuttle was there within 4 minutes of my arriving, which was great considering it was 102 outside.  The driver was swift, amiable,  and professional, and offered the passengers an iced down bottled water upon getting in.\n\nThe hotel itself was clean and the staff great.  There was a decent fitness facility for those of us still pretending to give a shit about the status of our physique.\n\nThe shuttles run at the top and bottom of the hour, 24/7, so it's a great choice for the business traveler.", "business_id": "KnRRMCqQQqlyMphif6cTaA", "stars": 3, "date": "2008-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 0}, "user_id": "H6wT2Zcdefr0tpp9YYLQKA", "review_id": "aUXRu8MhV9pKHYooCFlQRA", "text": "I WILL NEVER USE DISCOUNT CAB AGAIN AND WOULD NOT RECOMMEND ANYONE ELSE USE THEM EITHER! I ordered a taxi home Friday night from an app on my iPhone. Got a call confirming that a taxi was on the way. Was standing outside of the bar waiting and a taxi pulls up. Driver asks me, \" You ordered a taxi?\" I say yes and jump in. It was a Discount cab and was dirty and the guy had the AC OFF and the windows down - it was frigging HOT. For SURE not one of those fancy hybrid green cars in their ads. About halfway home (4 mile ride), I get a call from another cab co saying the taxi I ordered was waiting for me at the bar... Dude totally tricked me into his cab. I ask the driver if in fact this was the cab I requested and he starts acting like he doesn't know what Im saying. I say, \"look, whatever - do you guys give free rides back to my car in the morning?\" he says yes and I ask him what I need to get that - he says just call in the morning, don't need anything... I ask for a card and he doesn't have one. Next morning I call and 1st guy says he needs the job number. I don't have one and explain what happened. He says he at least needs the pick-up address. I say I'll get it and call back. I call back with address and lady tells me that won't work. I ask for supervisor and explain the whole thing and he says there is nothing he can do for me as they do see one pickup for that address, but that it had been canceled! So driver not only tricked me into car by making me believe his was the cab I ordered, he also canceled it in the system and pocketed the fare. Nice. And now on top of that, I have to pay another company to take me back to my car. \n\nI'll use VIP from now on.", "business_id": "6InaHoU8KNlDeGP48RqzBg", "stars": 1, "date": "2009-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "fbXyGklF3jZ7hqDetmwDUQ", "review_id": "EGO4BthSBr2mRMhvqr3Jdg", "text": "Giving one star but they should get zero... A friend left her purse in cab after medical appt, several calls and messages left with company but no return call. Another friend was charged $100 for ride to doctors office which was only 6  miles away...Beware! \nI'd use a different company....", "business_id": "6InaHoU8KNlDeGP48RqzBg", "stars": 1, "date": "2014-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "FI6TR9xxKpL8AKxTZanJBg", "review_id": "RcQSv92tIoeDQerD-Me6IA", "text": "Had a reservation for 2:30. Driver comes 15 minutes early, great! When he calls me I say I need a few minutes to get my stuff together & come down as i thought I had more time. I get downstairs in 4 minutes. The security guard at the front door tells me the cab just left. I then get a call from dispatch asking me what I am wearing and where I am. I tell him & say I am at the back building (as does my original reservation, confirmed by the fact that the security guard saw him sitting there). Dispatcher tells me the driver is there and will circle around. I wait for another 10 minutes. It's now past my original reservation time. I call the dispatcher back. I am put on hold. Several minutes later a very rude disinterested lady asks me several questions, just to cut me off when I begin to answer. No apologies for the confusion, no explanation. She finally tells me her computer shows he is one minute away. Cab shows up. I get in the cab and ask the driver where he went. He tells me he was at the front building. Wow. But here is the best part, after all that he tried to charge me almost double what I was originally quoted. Rates to the airport are a different rate than \"street rates\". The driver tried to charge me street rates when there is a sign on his dash that clearly states the airport rates. I tell him I'm not paying double the quoted rate. He refuses to switch it. I have to call dispatch again to get the rate lowered. Then (even though I said I would be paying with a card on my reservation) he tells me I have to pay cash. I don't have the cash to cover the ride as I was planning to pay with a card. We have to call dispatch again to have them run the card. Now I'm about 45 minutes later than I wanted to be getting to the airport. Save yourself the trouble and use a different cab service. What a train wreck.", "business_id": "jn9jfsdyQhfI6Gxp07AbYw", "stars": 1, "date": "2015-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kSyETvyqGhEVwNWbCrIX7Q", "review_id": "e4DP02FqPYyioKILI-cFoA", "text": "Went to check in at the reapid desk and Chris, an older woman, asked us, \"didn't you check the board\" and made it seem that we were bothering her... when I explained that one of the previous agents told us to come to the desk, she held up her hand and said ill wait till your done, go ahead and finish.  Customer service lacks!!!  She said they can't make mistakes that we did something to mess uo the past rentals.  ....  they have left off the insurance,  charged the wrong card and forgot the gps.  Its getting hard to like budget!", "business_id": "FYCVF_1qYm3x5DYCbmmK1g", "stars": 1, "date": "2014-08-17", "type": "review"}
{"votes": {"funny": 4, "useful": 0, "cool": 1}, "user_id": "lPaYMDmJbAnv_3pmZH_inw", "review_id": "JKc8JB3yZ6ijd05dyGLCow", "text": "Why do airports have to be SO fucked up? I mean just to pick someone up is like this huge undertaking.. you of course have all the stupid people driving 2 miles an hour to find their loved one.. then you have the selfish pricks who wont let you over.. so maybe I should be Yelping asshole Phoenix drivers rather then the airport but I wouldn't have dealt with them if the airport layout would have been more conducive for drop off and pick up. Its a real cluster fuck over there!", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 2, "date": "2008-06-23", "type": "review"}
{"votes": {"funny": 4, "useful": 3, "cool": 3}, "user_id": "g0QWJpYSfWKxQiel7gbFuw", "review_id": "5VlgHqk7SaIcMAzY0-9RcA", "text": "From the \"Recycle Bin\" of passiveaggressivenotes[.com]:\n\nPSHIA,\n\nCan you please help your anachronistic airport brethren realize that it is now 2010 and free wi-fi and sufficient power outlets are base expectations and no longer simply pleasant surprises? My home variant in a tech mecca can't seem to figure this out on her own. While I know that you all are not really a utility worthy of or capable of strong positive emotions like love and that the only emotional connection you can enjoy is depressingly based on the negative variety, her selfish needs are still no excuse.\n\nThanks,\nSean \"Pre-3G\" C.\n\n...\n\nOtherwise, in a large, semi-sprawling sentence, it's pretty much just a large, semi-sprawling airport that fits the personality of the large, semi-sprawling city that it is slightly outside with specific amenities proportional to the size of the specific terminal with an anecdotal strong on-time percentage and unsurprisingly sweltering jetways.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2010-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KucBnMrhalzxnD9AWrxwYQ", "review_id": "OBKhlNzC5A7kb5tpuxn5PQ", "text": "Food selection on Terminal 4 B gates suck. Other gates are better... free wifi gets it 3 stars. Better food is needed!", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2010-08-28", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "ntbKUW9qPoZSWolthyQmyQ", "review_id": "rW_dallaprb85VCHo1rBaA", "text": "ummm one problem how the hell am I supposed to know there is a north and south side at baggage claim?!? That was an experience.  I'm so used to OAK; SFO; and LAX guess now that I moved here I better figure it out:)", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2011-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q0SIbZZ8hMFtVP9G6S5Dpw", "review_id": "V27Lu3OfXGx0InVMeBjxcg", "text": "Mid size American airport with very good organization, very straight forward, no hassle. \n\nSecurity is a little slow and priority lane isn't really priority, it's more of \"let's make fun of first class flyers getting pissed\" lane, so let's welcome first class flyers with big giggle!! \n\nMany stores and food quality is okay. Seating areas are limited, at least for the Terminal 3 before security, so be aware. \n\nLots of volunteers working here to guide you to the right place, there may be more volunteers than passengers. Haha.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 5, "date": "2011-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "VFL4LY37bEvyDPobGoxvXg", "review_id": "52e_cBeA2f7PyWmCUgIlxg", "text": "I have been in only about six or seven airports, but this one definitely stands out in my memory as being the nicest.  Due to a missed connection, I had to spend a good 11 hours in this airport on standby for a red-eye to Charlotte, NC.  And while spending that much time in an airport is never fun, if it had to happen, I'm glad it happened here.  There are a lot of options for food.  The lighting is bright and cheery (as opposed to the dismal airport we landed at in Charlotte), and there was free wireless internet (always a major plus for me).  And it was clean!  I never thought I would care about the cleanliness of an airport, but once you have to spend half a day in one, it definitely starts to matter.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2011-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "QjZgwWyBtedDGlvocUcW5g", "review_id": "6GcbP_u1FFqghAgX8y9AZg", "text": "hmmm...looks like Phoenix has made some changes since the last time I've came through!\n\nTheir staff is ALOT friendlier than the staff I've encountered a year or two ago. The change of attitude in the staff made a huge difference.\n\nI don't know if this was always there before, but southwest airlines has a little tv area, (complete with a table and seats) made specifically for kids to watch cartoons and eat. This kept the midget well preoccupied during the 3 hour layover! \n\nThey are also working on a new tram that will help passengers with getting around terminals. \n\nI feel more comfortable in this updated Phoenix airport and I like the direction they are headed to. Keep up the good progress Phoenix!", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2012-06-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "IQu6xzCD6mcqO_R781UpBg", "review_id": "uPekT0-0tngEWpN-DA-j_Q", "text": "Another delayed flight, what's new?  I've used the time to develop an airport rating system mostly compatible with Yelps five star reviews.  So on a scale of one to five stars, with five being A PALACE, \"I'd rather spend time here than at home,\" and one being THE PIT OF DESPAIR (say it in the albino's voice for greatest effect) Phoenix's Sky harbor rates a decent 3.5.\n\nSky harbor is on the small side of large airports and as such one expects a certain degree of difficulty getting to it and finding parking, one accepts this difficulty and plans accordingly (or one doesn't and misses one's flight).  Phoenix is no more or less agonizing than any big airport in terms of getting there.\n\nThe external waiting areas (before security check points) are nice, there are comfy chairs with convenient charging stations throughout and a good selection of shops and restaurants (even a flight museum).  Shy Harbor offers free wireless, the only price you pay is nervous exhaustion waiting for the achingly slow connection.\n\nSecurity can be a bit of an ordeal.  The scanners appear to be some sort of already outdated beta test version that take seven seconds to violate your privacy rights instead of the more usual three seconds.   Upon exiting the scanner there are no seats for passengers to sit on while they gather up their belongings and put their shoes back on.  One small bench does exist, but as of the writing of this review it was hidden behind some temporary walls and a desk.  Lack of seating means people tend to clog up the exit side of security trying to snatch up their things and put themselves back together before moving out of the way of others.   The high point of today's trip through security was Mr. Grumpypants, one of the rudest TSA agents I have encountered in awhile, haranguing the senior citizens for leaving their paper tickets in their pockets.\n\nThe open, modern terminals are clean, clearly marked, and fairly easily navigated.  There are no trams and surprisingly few moving walkways for a town full of retirees (I leave it to you to decide if that is a plus or a minus).   Once at the gate I found that there were wall outlets available but they were located about five feet up the walls and not always next to any seating.  Not exactly convenient, but at least available.  there are a small assortment of shops and restaurants in the terminals but the good stuff is all back past security.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2012-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EXbbC-fymHpjQlvnxx3S0w", "review_id": "LAjP_SrVjyJKYfNkCaV3_w", "text": "I like phoenix its clean and classy.  I dont really have much bad to day...but nothing stands out.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2012-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "N5W520ZJAmSGsIxGDVI-pA", "review_id": "vK4cJu6wVGkZWuPNCkCA5Q", "text": "It's not often that you see a pretty airport but the Phoenix airport has some cook features. Getting to the rental car building was a breeze. I walked outside in the 115 degree heat and got onto a bus that quickly took us to the site.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 5, "date": "2013-06-18", "type": "review"}
{"votes": {"funny": 4, "useful": 3, "cool": 3}, "user_id": "YercioNxdCqxcwlHdeNNlw", "review_id": "bKtTO43yswek0ELQmgQsoA", "text": "One of the worst airports ever, I have not been treated like this at LAX or ONT even in Sydney's airport they asked me not to remove my shoes cuz they are Converse the high top, I mean what could u possibly hide in you converse, not even a pack of gum, but in Phoenix Sky Harbor International Airport the story is different, my bag had to go in twice, even though there is nothing there but bunch of underwear and an iPad .. and after that they had to swab it   and search it, and the lady was so rude saying, OMG underwear in carryon, and I kept quiet .. and went through the metal detector, and beeped OK but they had to pat me down and search my pockets, and the sad part they let some people walk through with out going through the metal detector and they were really on a very bad behavior talking about drugs and street fight while waiting on the line, All that based on the color of the passengers skin.\nSo when they were done searching, swabing and talking to each other, they left my bad open and the told me to take it of somewhere else to put it back cuz \"I'm holding up the line\"..\n\nZero star for the worst shit hole ever\n\nif u wanna be all good about security then you should do that with all the passengers not according to their skin color. \n\nFUCK U Phoenix Sky Harbor International Airport  I will never fly thru u again and none of my friends will..", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 1, "date": "2013-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "HIlrU4ShA10pNwwhc4xSaA", "review_id": "_jjZL1wxa5pZ1tacfocpFQ", "text": "Who woulda thought that what I thought was a small airport would be so nice.  Super clean, clear signage, comfortable waiting areas.  I didn't spend a lot of time here but I did walk through two concourses to catch my second leg to Burbank.  My first visit to this airport and I had assumed it was no larger than my local favorite Burbank.  I was wrong.  I don't think BUR even has a designated concourse?\n\nIn any case, it always nice to have a few rolling sidewalks to get you where you are going especially if you are running a bit late.  Along the way, I noticed a few kiosks selling local Arizona jewelry and there was a lot of local art instead of just drab and dreary walls painted a cool gray or sky blue.  This airport appeared to have a variety of local food restaurants and national vendors instead of the same stale, mass-produced sandwiches provided by a single food concessions vendor.  \n\nI was hoping to grab a local Phoenix Starbucks coffee bug to add to my city & state collection, but didn't see a store.  Because it was so hot here today, the airport was a tad warmer than even Fort Lauderdale but the free wi-fi and charging stations made up for it.  \"Give me a Hamm on five, hold the Mayo!\" [Airplane! 1980]", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 5, "date": "2013-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vrQ3WUUiSPGwzI_zfSQMLA", "review_id": "6P0A5pcWIogtXELq4ROMOg", "text": "Avoid if at all possible. There are an inordinate amount of gate changes at this airport, so unless you are parked next to a monitor to check on their fickle shuffling of the flights, you may miss your flight. The layout is also awkward, the charging stations few and far between, and the food options limited and not very good. Just an unpleasant experience every time I have to fly through here. Never again.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 1, "date": "2013-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "-uGHEXPAkX5txlG3rbDTPA", "review_id": "Y9Zj4JXI9_W828VDfMnv5g", "text": "Generally nice airport to fly in and out of. Only issues are the immense size of it, honestly from check in/checking bags to TSA and then on to your gate can take almost 20 minutes walking alone, and then you have to add TSA time. Sometimes they're rather efficient, but sometimes they only have one lane open for a huge line of people. Hit or miss with them. \n\nApart from the walking and the TSA time, the airport is really nice. Very clean and well maintained, lots of amenities inside as well. Baggage claim is also a huge area, and, likely due to the sheer size of the airport, it takes a while for baggage compared to other airports.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2014-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WEBOUozznIdu0hJHcXDyLA", "review_id": "w-_5c2Pyi1UwFlxqiLIRLg", "text": "Friendly staff, clean and typically pretty quick security lines. They are making an intentional effort to have only local restaurants (at least in terminal 4) and prices are the same as they are outside of the airport. Shame it's my home airport because I'd be thrilled to eat at these restaurants.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2014-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NuuJFX6SwyDo1ubIH0KUjQ", "review_id": "7Q9_rF2zOdyxor_59d9YGw", "text": "I was in this airport for a long time on a layover, because my Southwest flight got delayed 3 hours.  I can't comment on the TSA checkpoints or the baggage cliam area. \nWe were around terminal D on a Saturday evening, when all of a sudden most restaurants and stores started closing at 6. SIX PM, are you kidding me?  It's a huge airport and they close early on Saturdays.\n\nThe food choices aren't terrible, the cafe \"La Grande Orange\" did stay open past 6 with salad, sandwiches, pizzas and burger choices.  The terminals are spacious and somewhat clean.  There are limited areas where you can connect your phone or laptop, as opposed to other major or even smaller airports.\n\nThe bathrooms are clean and smell clean which I think is important for women. I would give this airport 3 1/2 stars overall, but I'll round down.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 3, "date": "2014-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WLilv24IBoo48v4aBP-nEg", "review_id": "dh7nHVBSK6Pby6TMZqB5Eg", "text": "Great airport with free WiFi. Lola coffee is legit. If in terminal c try some cartel coffee.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 5, "date": "2014-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vL9LEngoOjuZ3lqU1mh8zA", "review_id": "l4aIINT9UIZwV41egm7kcg", "text": "This isn't a bad airport, considering how many of our US airports have been neglected (I'm talking about you, DIA!) It's easy to get around, but you do have to like to walk. The airport is clean, well-maintained, and convenient to town. It's a hike to the rental car facility, make sure you allow time for a decent bus ride.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 4, "date": "2015-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UWFklYz9e2cqElOo47tfaw", "review_id": "1dA17PpgNodgOMrMDNNYBg", "text": "The worst customer service I have EVER seen. 3 delayed/cancelled flights today with NO update. When we go to talk to a representative about why we are not boarding and the screen still reflects our flight as \"on time\", she replies \"Oh yeah I guess I should announce that..\".. Meanwhile the board still reflects as on time, and we are being told they are trying to find another plane for us. Because for the 2nd time, they don't have a plane. The second representative we talked to had nothing to say but \"We usually update every 15 minutes, I don't know why we haven't, I can't tell you, I'm sorry\". Seriously? Never again Southwest. Do not reccomend you fly with them.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 1, "date": "2015-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7Lbhd9hfWg7diw8SC2_MhA", "review_id": "RUoQOrcGNqs0-RM5KkCqPw", "text": "It's hard for me to give a full an happy review of this airport. I don't travel as much as some but I do travel often. When arriving at the airport last week, check in was simple and quick. I entered the security check in line, my ID was checked and handed back to me without issue. The lady sitting at that station was nice and friendly. Upon moving onto the next step in the process, there was a woman shuffling and sorting the line into 2 sections. 1 meant to go through the metal detector, the other for the body scanner. She was rude, short with her answers and not very helpful. I'm not sure if it's standard for only men to go through the body scanner, but that's what happened. The woman we passed on to go through the metal detectors and the men formed a line to go through the scanner. I live as a Transgender individual so security check points are usually the most stressful part of flying. I entered  the body scanner, put my hands up as I was told. Waited for direction from the agent standing on the outside of the scanner. Only to hear the woman who was separating the line say \"Dude pull up your pants so they aren't hanging off your butt.\" Now mind you, I don't sag my jeans, I wear jeans that fit with a belt. That belt I had to take off before entering the scanner. So I did my best to follow her instructions, while listening to the guy on the other side say. \"Face forward and put your arms up please.\" So following 2 sets of requests at the same time is a little difficult. I mean if anyone else can pull up their pants, while placing their hands above their head at the same time, please let me know your secret. After leaving security, I visited one of the smaller restaurant and enjoyed a good burger that wasn't to bad in price. I visited a gift shop and found it annoying to pay $2.85 for a bottle of soda, but that is to be expected when traveling I guess. While waiting for my plane, the lady working the gate door began to speak and make overhead announcements, none of which anyone could hear. She did her best to repeat herself but in the end she was forced to stand on a chair and yell to the 150+ people waiting to board the airplane. We heard he loud and clear at that point lol.\n\nAfter being gone for 4 days and returning home. Arrival to the airport was good, the baggage claim was easy to navigate and the bags showed up fairly quickly. I was due to catch a shuttle back to Tucson. I asked the guy at the information desk where I needed to be to catch my shuttle. He told me \"you want to exit through door 2, go across the street and it will pick you up there.\" So I did. 15 mins. later, and now 5 mins. after my shuttle was scheduled to arrive, I was still there. So I asked another guy wearing a vest if I was in the right place. He said \"oh no you are suppose to be on the other side,\" he directed me to go back through baggage claim and exit through door 6 to find my shuttle. I got to the door and same thing happened. So while standing outside the door and rather upset at this point. I called the shuttle company, told them my issue, only to find out my shuttle had already left, and I was considered a \"no show\" because I was sent to the wrong place all together. I was suppose to be at door 8. Thankfully the shuttle hadn't completely left the airport yet, and the driver was dispatched to swing back around and pick up me before leaving. I was more thankful to the shuttle company and their willingness to help me out rather than the airport staff. \n\nSo overall my experience fell short due to the staff more than anything else. I will use the airport again in the future I am sure. It's not nearly as bad as the Denver airport, but it wasn't good either.", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 2, "date": "2015-07-29", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "cYZ-wj3oh4EjdpkyPGMk0Q", "review_id": "LU3-rSJ_V5QqGpyMuc1vnQ", "text": "Between making it next to impossible to locate an available outlet to charge my devises & requiring me to jump threw hoops & watch a advertisement to get any kind of wifi. Sky Harbor rates low with this seasoned traveler. Then there's the poor selection of beer, Four Peaks ? really ? This is the bad taste you want people to remember when they visit Sky Harbor AKA Phoenix. Not a fan of the choices Sky Harbor thinks acceptable ..", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g", "stars": 2, "date": "2015-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "h1lmWTbbkgqVzFhrnWMJVA", "review_id": "-08E_F55xo08s-MW2oiZlw", "text": "Left me at parking lot despite being on time. Did not call to notify they did not see me. Called and got an answering machine.", "business_id": "EW-DCLsUbUF-uHA5sm9c8w", "stars": 1, "date": "2015-08-27", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "fOfn3XczMmQ-WzLLZ_Mz0w", "review_id": "NowosTRS829uzezhmJebIw", "text": "The people that work here were very nice and helpful.\nIt was the first time I've ever taken the bus.", "business_id": "MXFcSmW3m-9IXQEA_7l62g", "stars": 3, "date": "2013-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DrWLhrK8WMZf7Jb-Oqc7ww", "review_id": "oubg58gMPIInfdzZMi2oPg", "text": "Getting ready to check out, but place lost a star due to unusual things. A flood on one end of the 3rd floor hallway knocked about about six rooms for awhile. They are still renovating those rooms over a month later - no cause of flood given. Also, a swarm of bees invaded the laundry room about two months ago and i found a few dead bees in the dryer lint tray before I started my cycle. Now, they also have their third different manager here in 8 months and although Shauna is very good at her job, all the staff is new and seems untrained. They cleared out Tammy and all the other regulars because ESA corporate decided to cut all their benefits and only offer three FT jobs per hotel So, it's another case of corporate greed and they spend tons of money of new signage and an average  breakfast, but they sacrifice quality employees, such a shame, but corporate will never read this review. Kirk is a nice guy and always was prompt on fixing stuff and every year there a crazy bunch of bikers that show up and literally take over the place. DO NOT come here during AZ Bike Week. Disgraceful that staff cannot control them, like who the F do they think they are? Just cause you ride a bike, you can stay out in the parking lot and drink all night. Now, that manager is gone, but very unprofessional. Also, for the last seven days, all the local channels always don't work and the satellite is always searching for them. Room for improvement, but not bad at all/", "business_id": "rI7d_L0BCKemotT9XD5wAg", "stars": 3, "date": "2013-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fEJ0zWi2INL0jKvjBACE5w", "review_id": "w771k-ycMzhte3RccA6Aeg", "text": "I stayed here for a work conference this month. All in all it was fine, nothing impressive though. My co-worker and I got in early, since the rooms were not ready we checked out the lazy river. It was a lot of fun. There was however no lockers or anything to store valuables while you floated down the river. We showered in the gym locker room - probably one of the best gym primping areas I have ever seen - it was clean and had every tolietry you could ever need or imagine. The food during our stay was good. I had a room in the Villa section, not much of a view, but the bed was very comfortable - and really besides being clean if you are there for business all I can ask for is a comfy bed. The bathroom was spacious, but did have a window in the shower that looked into the hallway/elevator... very strange to me. All the staff was very curtious and accomodating. Would not mind staying again for work, but would not book for a personal trip.", "business_id": "I941jBn1KURuN-2wygJ_5A", "stars": 3, "date": "2010-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "tqI9NInrAqQMY_5D1jtqxw", "review_id": "PJjMdS4XkEbtjNTBCL2eQA", "text": "I loved the water park the rooms are good but the customer service is awful. We called for extra blankets and pillows they did not have any. When i called the front desk it took 30 min before someone finally answered. If it wasnt for the waterpark id give it 1 star.", "business_id": "I941jBn1KURuN-2wygJ_5A", "stars": 3, "date": "2012-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nBXMQ4Hpn4iwwyzxBUgPOw", "review_id": "SAfJ-EBbPckajITVGsgefQ", "text": "we always have an amazing time staying in the Villas and enjoying the Oasis!\nthank you Phil!!", "business_id": "I941jBn1KURuN-2wygJ_5A", "stars": 5, "date": "2013-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RXdBqUfNOIvaXYjgs7bgSw", "review_id": "In4t_-uiYEBarAdpuQNeWw", "text": "So far the best place I ever stayed. Everyone is friendly and the food is great! Cool spot  I'll come back.", "business_id": "I941jBn1KURuN-2wygJ_5A", "stars": 5, "date": "2014-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mRHq0kANUS1VTwFkCfMYUQ", "review_id": "0Njg8i6w7nTvckOpZbkZeg", "text": "My family and I stayed here as an over night staycation on a Tuesday/Wednesday and I'm going to say it's 3 stars. It's not a dirty place by any means, but it isn't a 4-5 star luxury hotel. If you're expecting a luxury resort with a huge water park this probably is not the place for you. \n\nLet's start with the positives of this place. The king size room was quite spacious in my opinion having a bedroom with a balcony plus a living room with a pullout couch bed. The lobby hotel was very nice and classy. Even though there is a resort fee it covers a free appetizer in the lobby bar which range from $12-$18. The lobby bar is quite cute I thought and had happy hour from 2pm-6pm. From what I can recall the happy hour included well drinks, wine and draft beers(only had 4). Our appetizer was great as we ordered carne asada fries and our mixed drinks were cheap at $3.75. The water park wasn't huge, but it was bigger than I expected. I highly enjoyed the lazy river my only complaint being too many empty tubes, but such an easy fix! There were 3 slides. 2 of the slides were a huge speed drop which I wanted to try, but didn't. The other side was a slower twirl slide.There is a 48in height requirement. The wave pool was t huge, but decent sized. I can see how it can get packed on the peak seasons. Then there was a side pool with water volleyball. You can get complementary rides to Arizona Mills mall and I'm sure restaurants in that area. You can also call 85555 and have a golf cart pick you up and take you anywhere on the resort. \n\nNow for the negatives. If you're looking for a cheap drinks and food unless it's happy hour at the lobby bar this DEFINITELY IS NOT the place for you. The oasis bar in the water park has many different food/drink options, but you won't find anything under $10. They want $17 for a salad and the cheapest alcoholic beverage is $12 served in a plastic cup the size of a red solo cup. There was only one mini refrigerator in our room and it was full of their expensive items. $9.50 for a airplane bottle of sky vodka, $6.50 for a 12oz can of Bud Light, $4.50 for 16oz bottle of Dasani water and the list only continues. The pull out bed in the couch was what I would imagine a prison bed would feel like. The mattress only had to be a 1-2 inches thick and so old and worn to the point that I could feel the springs in my back. We ended up making a bed with the couch cushions and pillows on top of what we called the \"prison\" mattress. For some reason they put us in a hearing impaired room which meant every time the phone rang or someone rang the LOUD doorbell there would be a flashing almost strobe light in our room. We had cable TV which for being a resort I thought was interesting and it was $15 to rent a movie! We went to Aunt Chiladas which was the Mexican restaurant on site and well it was subpar. We only got soft drinks, chips and salsa and queso dip. The menu was very small and expensive and had odd dishes on it that wouldn't be typical Mexican restaurant dishes. The queso dip had a funky taste to it at first until we had them remake it and then it was much better. The bathroom was very small and nothing extravagant for this being considered a \"resort.\" \n\nI think this is a good family overnight stay. If you catch happy hour at the Lobby bar for some drinks, utilize the complementary shuttle out by AZ Mills mall for food and don't expect too much from the park it can be a good time. For the price of what they charge you would think it would have more \"wow\" factors, but overall I would say I had a fun time. Just remember, don't go into it with expectations.", "business_id": "I941jBn1KURuN-2wygJ_5A", "stars": 3, "date": "2015-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zbUChk1u3J2A3WPKti3aVg", "review_id": "eYVnrRyYlSz5jR5q6Qwymw", "text": "I researched online for the cheapest rate. I was in an accident the day before and would be needing transportation to and from work until my car is fixed. \n\nAs far as small car, all the companies were comparable. I went with Enterprise BC of location.\nI scheduled pick up time for same day at 6pm, which is there closing time. \n\nI got there 15 til 6pm. The staff was friendly. I asked if there were any free upgrades. Hey it doesn't hurt to ask. I really wasn't looking forward to driving a Yaris. \n\nAsk and ye shall receive. They hooked me up with a Chevy Malibu. This car is nicer than I thought. Drives smooth. Picks up and goes. Lots of nice features. \n\nSide note. A main reason for getting the upgrade is BC they didn't have any small cars ready, and it was close to closing. I'm just glad they accommodated me. \n\nI'm happy with the service I received.  It was a quick process. I was there less than 15 minutes.", "business_id": "-5bLhMLNGbIVyoPOVl0yLg", "stars": 4, "date": "2015-08-15", "type": "review"}
