{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "Nhvkukz5MECqEUQVfh6A6w", "review_id": "aDeyo3cswbJIWO_I7zFOlg", "text": "I would have taken a picture of my meal but I devoured it too quickly.\n\nDJ J.   Is correct.    I heard about this place on PBS (What do Pittsburgher's Eat).   They were giving their recipe for the Sausage Onions and Peppers.    We decided to try.\n\nThey only have tables where you can stand and eat.   They make everything on the premises.   We ate in.   I ordered the Hot Italian Sausage Sandwich and some side meatballs.    The food was awesome!.\n\nI recommend you find this gem and get your Italian Fix on (or order some of their meats / products and cook it yourself) :)", "business_id": "9tAbTDdYTASHL7EU1e-OWw", "stars": 5, "date": "2014-08-15", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 4}, "user_id": "jR_zE_9TEcY4_vrTeKNXlA", "review_id": "ZSwfgd5h9-W5FdWrelBjWg", "text": "I love Whole Foods, and I have been a fan for a few years now. I've visited Whole Foods locations around the country, but this Pittsburgh location is one of my favorites. It's a small store, but it feels homey and comfortable.\n\nStaff: Most of the staff members are super friendly and willing to do just about anything to help you find what you are looking for. I had one staff member begrudgingly help me out, but I assumed he was having a bad day or was very busy. Either way, it's nice to treat others with respect. \n\nThe cashiers here are so fantastic. They are never rushing and throwing food into bags. They take their time, ask you questions and treat you like a person instead of another number in a long line. \n\nDeli/Made-To-Order: The deli and made-to-order foods are currently my favorite. Sometimes I would rather spend $20 on lunch here with my boyfriend than go to a restaurant or get fast food. My favorite is the vegan chicken salad on foccacia bread. I adore this bread. It's just the right texture, it's nice and herby and deliciously buttery. Topped with swiss or muenster, it's a super delish sandwich. If I am extra peckish, I get extra veg. chicken salad. Yum yum yum! \n\nThe tomato bisque they have is something I newly tried. I'm very picky about my tomatoes and tomato products. This soup delivers. I wish I could have it every single day. It's so phenomenal! My boyfriend got it today alongside a cheddar biscuit that paired beautifully with the soup. \n\nCheeses: If you want fancy gourmet cheeses, the Whole Foods deli counter might be the best choice. We purchased a small amount of Midnight Moon Goat Cheese Gouda and made the most expensively delicious grilled cheese sandwich. We're grown-ups now, say goodbye to gross American cheeses! The cheese counter is so great because all of the cheeses are labeled with the kind of rennet used in the processing. You can easily find a high-quality vegetarian cheese with just a glance. The cheese experts are also willing to talk cheese to you for as long as you like. \n\nStore Selection: Overall the store has great options, but they don't carry everything that I wish they did. Unfortunately, they discontinued one of my favorite products - Field Roast Deli Slices. They bring in new and trendy foodstuffs though, so it's enough to keep me happy. \n\nWhole Foods can be pretty expensive, but if you don't fall for the tempting packaged foods, you can get away with a reasonable grocery bill! I primarily shop here for special items though. \n\nP.S. Their selection of natural body and haircare is great and affordable. If you have sensitive skin or don't want your products tested on animals, go here!", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 4, "date": "2014-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4mb4BvpcN24nLYgV4uoA3A", "review_id": "wJnTDJ1yQGG08l4WNAQcqw", "text": "The italian coldcut sub was a travesty! Lots of STALE bread with skimpy meat portions, and no hots or flavor. Bread better suited for pigeons than people. I can find better Italian sandwiches back home in Baltimore. We'll feed these to our dogs when we get home.  You get what you pay for. Avoid this tourist trap!", "business_id": "imzKM9-mgN1Yk_RIXx3IgA", "stars": 1, "date": "2014-07-18", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "Mi2RM4vWd2RTZgdm1XGKKw", "review_id": "psZwfF7MOX5LMRKLMZixRA", "text": "I always keep forgetting that Pittsburgh in the winter not just cold but it  FREEZING cold! \n\nanother awesome place on the strip...if you are having trouble finding an authentic Italian market or store around Pittsburgh...look no further! this place is the real deal... owned by actual Italians...I am tired of the American stores that think they sell authentic food/goods from Italy..this place has it all...everything is fresh and wide verity of produce...you can basically sample anything they have to offer... all you need to do is just politely ask ;)", "business_id": "tyXvO1G2qK3MUfaap30auw", "stars": 4, "date": "2015-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "og1G5WbU6yT-MY_BRILKFA", "review_id": "daE6TlpMYnbh9-fnfYwX_A", "text": "The best.\n\nThe cheese counter is heaven on earth.  The workers are awesome - who doesn't want to be called \"dear heart\" while tasting delicious cheeses?  They're super helpful with my weird requests to find the perfect cheeses for every occasion.  I always walk out with new varieties and grab tons of nuts and sauces and oils on my way to the register.\n\nWe also had our engagement pictures taken here (does that show my level of obsession?).  We called in advance and the managers were all very kind - they told us to stop by their office and say, \"Hello\" even.  It was so much fun!  \n\nMy mom also carted several cheeses down to North Carolina to be served as appetizers for my wedding as well.  Seriously obsessed. \n\nI love Penn Mac.", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 5, "date": "2013-07-03", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "uAc_am4OYvj6HhlOpveEcg", "review_id": "eH3rUmc239oyBWXEXsSOBA", "text": "Good selection of gourmet goodies. The guy in the meat/cheese department was helpful and friendly. Lots of bottled water and grab-n-go items.\n\nOn our way our some employees who, apparently, were recently off the clock, were yelling for each other both in the store and out in the parking lot ( \"HOPE, HOPE, HOPE...\"  I guess Hope has trouble hearing?) They were focused on speeding up and slowing down quickly in the parking lot and almost ran into our car.", "business_id": "hODaBUYzv0AbApej_bfZ-w", "stars": 3, "date": "2007-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uYOo1cPQYQgr8pI0fiEV0g", "review_id": "N4QyenKfNSE-xltct7xu-Q", "text": "What do you send to a mother who has decided to drive four 13 years olds and a 7 year old to Florida?  How about 4 huge bags of popcorn?  (Hey, it's not my car!)  A cheese, a carmel and 2 bags of butter should keep them busy for a little while, right?  \n\nIf you find yourself in need of popcorn for car trip or slumber party, movie night or school function, this is the place to get it.   \n\nNo need to call ahead for the aforementioned flavors.  They do have fancy flavors but you need to order in advance.\n\ntip:  Skip the metal bucket and save $20 by having them put the bagged popcorn in a box.", "business_id": "JrlQeSad3Dzf2IV8umZ9ow", "stars": 3, "date": "2013-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "b78znTlrN-YWw5_8MPxZSw", "review_id": "fUefXBDox7zJKMvludolMw", "text": "Great meat market with friendly people. The philly cheese steak brats are awesome.", "business_id": "WxfedycTcbQO_GuXHo9Ypw", "stars": 5, "date": "2015-08-12", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 1}, "user_id": "6nqakbu2zU6fjOmbE83_-A", "review_id": "rLypt5W06D1INLqewoXvoQ", "text": "For years, C-U residents have debated the need for a large-scale, ethics/eco-conscious health food chain such as Whole Foods or Trader Joe's, with various rounds of petitions being submitted to corporate offices. During that time Common Ground has evolved into a true force to be reckoned with--enough to convert even the most avid lover of the national brands. Once a modest selection of vegetables and granola, the co-op has expanded into a full-service store boasting an espresso bar, salad bar, bakery, bulk food section, stock of local produce/meats/dairy, and beer/wine.\n\nPeople with dietary restrictions and health preferences can find all prepared foods labeled in detail (and organic ingredients clearly indicated). A special shout-out to my deli favorites: forbidden rice salad, Cajun spiced tofu, Asian-baked tofu, and sesame noodles. I find a lot of the soups to be under-seasoned, but there are tasting cups set up for you to sample items before buying. If you stay and eat your meal on the patio, there's access to free Wifi.\n\nIn the bulk foods aisle, you can bring your own container from home to fill up (if you don't want to waste a plastic bag). I am obsessed with the nut grinders, which allow you to make your own fresh almond or peanut butter (akin to the coffee grinders you find in most groceries).\n\nWhile products seem expensive compared to the standard Midwestern grocery store, you'll likely satisfy every flavor of \"alternative\" food fad: local, organic, sustainable, gourmet, vegetarian/vegan/gluten-free, fair trade, etc. By virtue of the kind of people who are interested in ethical/eco-friendly food, you'll likely pick up some of the Portlandia vibe, but the co-op also tries to restrain the snobbery (kids get stickers at checkout, most staff are openly warm/helpful, there's an area where you can pick up/donate canvas bags for people who want a re-usable sack, etc.).", "business_id": "Q9eZS4qDdJo1ker0w3wnMg", "stars": 5, "date": "2013-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tNxNMmLZmCF2A_PXcSRVLw", "review_id": "T6O1qpRVfT0mR0LHYC60TA", "text": "I work right down the street from La Tolteca so many of my co-workers visit here regularly. I finally visited...\n\nFOOD\nThe menu has a great variety and is pretty inexpensive. However, my burrito kinda started to taste funny as I finished it up- almost like cleaning solution--- I didn't get sick so I'm not sure what that taste was. \nI like the bakery and the sweets selection and the salsa is pretty good. \n\nOTHER\nWe also use this place to cater meal for our late working employees. The catered food was a lot better than my burrito. \n \nI will give La Tolteca another chance...", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 2, "date": "2009-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "zGz5NI4sscO4_6YYH-qVtA", "review_id": "C8WDu7GCllkrTjlD4kGWdg", "text": "MUY AUTHENTICO!!\nWhen you see los chonchos eating here, you know it's good.\n\nI always avoid Mexican restaurants because everyone does this slap together something that's so standard and has no flavor unless you get some standard bright red sauce. WELL NO MORE!!\n\nMy friend had a Groupon (or something similar) for this place so we went. \nWhen you walk in, you're smacked with the delicious smoke from the FIRE-GRILLED meats they use for your meal! When I smelled that, my anticipation was amplified. You wander past the breads, pastries and cakes, and order from the board and take a seat. Your order number is announced bilingually when ready. Spartan seating, nice colorful tablecloths covered with plastic. Worn floor tile that can take centuries of traffic. You'll see what I mean.\n\nI had the pastor (pork) taco plate with refried beans (slightly runny) and Mexican rice (clumpy), and I accented with selections from the free salsa bar. The salsa bar has whole roasted jalapeños (you might need to peel some skin off) with onion slices (interesting roasted flavor), another section of veggies, then chopped onions, then cilantro, then salsas in descending heat to the right, begining with habañero red salsa on the left! Made me sweat! WATCH OUT, tell your friends, this is no ordinary salsa that you randomly grab and dump on your stuff. Pico de gallo is at the right end, and the MILD red salsa is next to it. The green salsa is DELICIOUS and mild as well.\n\nSin piedad por gringo: Habanero shot challenge! 2 people or more AFTER your meal. Have ice cream ready. Beer or water won't help.\n\nMy friend ordered two tamales, one chicken one pork, both wrapped in different leaves. Definite authentic flavor. We also got Jamaica (\"ha-MAI-ca\") which is a super sweet red hibiscus juice. You can also get bottled Mexican beers for $1.99. DEAL!! \n\nWater is located on the left side of the ordering counter in a self-serve container. \nExtra napkins (you WILL need them) are not readily available, you must ask for your plush paper napkins. Makes sense, they're more expensive, not cheap fiber napkins recycled from cardboard. \nThere's also a small grocery area. You can get fresh warm tortillas, a few veggies, some pork ($3.99/lb), authentic chicharones.\n\nSuper Inside Skinny: That's freshly made molé in bags at the grocery counter.\n\nCool Inside Skinny: 24 pack of Mexican sodas (Coke, Pepsi, Sprite I saw, but there might be others, maybe Fanta?) in glass bottles for $16. \nI usually buy them for a buck each at the gas station on the fly, but there's the real deal right there. Works out to 66.66 cents each as you can see!\n\nSo overall I'm sold and pleased with La Tolteca. \nTHIS is where you want to take your tourist friends when they come.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 5, "date": "2012-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jTNGlIUojQke9xiwb6Sn8A", "review_id": "DtqNm0BXK9hzBSTIY0KrHw", "text": "I just had a fish taco and carne burrito. Started with the fish taco and that was awesome. Next onto the big guy which didn't disappoint either. Great taste and flavor.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 4, "date": "2014-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "kk05snSafuIFK0lsxoMNzA", "review_id": "WZhTE--BKJLQBUmdNVnw_g", "text": "Expensive.  The deli needs a lot of work.  Their pastas and deserts are way too overpriced for the quality. Chocolate mousse tasted like whipped cream with hershey's syrup blended in. Overcooked cold large prawns were so bad I had to return the item.", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 2, "date": "2011-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 1}, "user_id": "o8J-ergbGYjrUy85I_rxzw", "review_id": "AWYW1L-i_9EKFZMuGua5tw", "text": "Had a great sandwich here the other week. Got The Doughboy which is turkey, bacon, swiss, and avocado on sliced sourdough, warmed up, and I added a side of chips and a can of soda - just under $8. Also grabbed a slice of cheesecake for less than $2. Everything was really fresh and the service was fast and friendly despite it being busy. There's a reason why this place has been around so long! \nThey also had a full menu of sliced meats and cheeses for those who prefer making their own sandwiches at home - plus shelves of imported products, seemingly mostly from Sweden. It was nice to see some things I haven't seen since I lived in Finland.\n\nI can't wait to come back and try the Turkonberry or the Wild Turkey sandwiches. Both sound amazing!", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 4, "date": "2012-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zaZD-L-hP55v9RRkcL7nVg", "review_id": "I8OoIh35Tiu9eRnJZUu74w", "text": "Fresh and delicious meat products (no fresh cuts) at really reasonable prices. Their jerky is amazing!", "business_id": "XRBTHOXaJK_AJ2wy5mX_1A", "stars": 5, "date": "2015-06-01", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "2hXL2ExBsgjJNpm6BJy0lg", "review_id": "T4ITKvwQf_6XKxAsRV3cyg", "text": "Just when you thought your kitchen was stocked, one visit to Williams Sonoma and you will think otherwise. I've always enjoyed this store, as they have so many fun gadgets to make your at home culinary experiences so much easier. My husband and I registered here for our wedding, and there's nothing more fun than shopping for all of the quality kitchen items they offer with someone else's money. Not only is it fun perusing all of the items in the store, but the extra enjoyment comes from the delicious samples they always have. \n\nWhat's also great is that they offer free cooking demos every Saturday. I went to the one last weekend, and learned how to make fresh pasta and then got to sample it! The staff here is always very accommodating and helpful. I will return many more times for that kitchen item I never thought I needed.", "business_id": "31bXixwy2GNmRlhpl21reA", "stars": 4, "date": "2013-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0TuOVaf4sM11UUbqGRL-4A", "review_id": "X-QIqcSAS-1Zk4N6tzv-bg", "text": "Whole foods is one of my favorite places to go for a salad bar. Its always clean and fresh. The staff at the store are always really friendly and helpful. Its always clean and I love all the samples they have out. Some stuff is pretty pricey. but the produce and lunch meat are always about the same as other stores maybe a little bit more but you get organic stuff!", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 4, "date": "2012-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KLekdmo4FdNnP0huUhzZNw", "review_id": "fT13mVytIXRF1nN6U-x44g", "text": "No complaints. Always excellent quality. Great service. And when there are crowds due to an upcoming holiday, they are organized to minimize the wait. I appreciate that they anticipate it and make the effort.", "business_id": "4THtcoUYIAW0qBLH7ABG7Q", "stars": 5, "date": "2012-07-22", "type": "review"}
{"votes": {"funny": 8, "useful": 4, "cool": 3}, "user_id": "ZZ43etAB2n_T53YBYtf8Dw", "review_id": "BK6ip0UfvqQk28htorsNbg", "text": "If you go at the right time of the yr everything is in bloom and it is soo pretty. I went there the first time and ate the french toast which is amazing!,\n\nNow heres were they lost a star. I ate breakfast there and I got egg whites and some other stuff. I went back to my hotel, about 3 hours later I had the 2nd worste food poisoning. I was in the bathroom the whole day and couldnt leave the next day for check out. I in no way could drive back w/o using a bathroom in 5 mins.\n\nI lost about 5 lbs so they earned that star back ;)", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 3, "date": "2008-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F4Rg6-plFSyMmPTSCHMF5w", "review_id": "XaLbwUIrVbk5H0mz9JbTUQ", "text": "Food was good but wayyyyy over-priced for what we got.  We're not big on Claim Jumper sized portions but this place had tiny portions for the price.  Ambiance was great & the setting was beautiful.  Staff was very friendly, too.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 3, "date": "2015-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0unKL_WZIW1sVwjxbiyP3Q", "review_id": "YYxaQLeM8T062zyZHWJmGA", "text": "I go here often because it's close to my job. Most of the items I get are fairly decent, but the other day I picked up some nectarines which weren't that good when I got home. Also, as I was looking over the cherries I noticed they didn't seem to be of good quality so I decided against getting them. I don't get much here cause the quality of the produce seems substandard to me.", "business_id": "zZFXEqWY_bE6s_f38RhNMw", "stars": 2, "date": "2015-08-09", "type": "review"}
