{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "4d6gHTch3Mytp02o-tzV9Q", "review_id": "QxR3WHUjmWh5xIyqfJkfsw", "text": "I brought my husband and my parents all to Papa J's last time my husband and I were in Pittsburgh. My parents are really picky about their italian food, usually they drive places in east bumf*@ (tarentum, ligonier...) to get their capital I-talian.\n\nMy pop is kinda grumbly, and getting him to try something new is like pulling teeth. The only reason I got him here was becuase they were on their way to drop us at the airport.\n\nWell, my dad goes back now regularly and that says a lot, considering he lives in Murrysville. \n\nThe first good sign Dad was happy was that he seemed impressed when it was open- it was noon a few days after Christmas. Second good sign was that Dad ordered wine, at it was only 1 pm. Dad, while not a teetotaler, rarely has a drink before 5 pm so I know he was anticipating a good meal. The kicker was that he was so happy he left our waitress a $20 tip on a $50 meal. \n\nCan I say, I live in Texas now and I still relive this afternoon back in December? I had chicken picatta...it was perfect. My dad had eggplant rollatini, my mom had a pizza, and my hubby had basic pasta and marinara. It all was amazing, delicous, and inexpensive. In Austin, you can't get a decent italian meal, much less a decent italian meal for under $50 for four people.\n\nI know there are so many good Italian places in Pittsburgh but I just think back so fondly on this day...when me Dad liked someplace I took him :)", "business_id": "P1fJb2WQ1mXoiudj8UE44w", "stars": 5, "date": "2007-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x5EWOcs7WKtra17g-sJLwQ", "review_id": "XbRJPsx42zk_UZGf-6ZnZQ", "text": "I wound up here the other night after walking down the street because of a 45 minute wait at Point Brugge Cafe.  While my friends and I were leery of the prices on the menu, the owner cajoled us into coming inside and were seated right away.  I'm glad he did!  The menu is rather expansive, but mainly focuses on Italian fare with an occasional jab at the more popular Pointe Brugge up the street: mussels and fries.\n\nIt happened to be lasagna night.  Because I am used to the home cooked variety, I had a hard time shelling out $18 for lasagna.  I selected the wild mushroom and spinach option and it also came with the soup of the day, which happened to be gumbo.  Both were very good.  The gumbo had a very earthy taste along with good amounts of sausage, jumbo lump crab, and risotto mixed in.  Rather than being the layered the lasagna was one giant noodle, the size of the entire plate, stuffed with a generous amount of mushrooms and spinach folded over itself with marinara and cheese.  Didn't get a chance to try dessert.\n\nBoth items I had were rather tasty, and I would easily come back here for a great meal.", "business_id": "ZL6DNzyenFm9Kpz6uADlNg", "stars": 4, "date": "2009-07-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "iTmWHtltCtk0Gm55AOxrUA", "review_id": "bUuwR6HIzEzQEeqhMM2QZg", "text": "When you're in the mood for a good ol' fashioned, nothin' fancy Italian restaurant, you can't beat Minutello's!  My husband Rick and I didn't feel like cooking the other night so we came here for a nice casual dinner.  Man, I haven't reviewed this place in nearly three years and it sure hasn't changed.  Still has that good old basement decor.\n\nMinutello's still has some of the best pizza in town.  Rick and I ordered the Supreme wtih capicola, Italian Sausage, salami, and pepperoni!  Mm-mm good!  Gotta hit that gym tomorrow.  And you know the best thing about ordering pizza, don't you?  It's always good the second day!", "business_id": "Pu5uzlZ05pqVlx6LcZbfgw", "stars": 4, "date": "2010-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cin55EbETGe1mq9ZB3wZkg", "review_id": "v9RxTZvsxW0_xSQ1gBhpKQ", "text": "good food, we had the bean appetizer, seafood diablo, and the flounder...It is expensive but well worth the money, classic.", "business_id": "qUeBDN0D8SC93KeAHhiL-g", "stars": 5, "date": "2013-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "heoc96QXrTbecWVw933qhQ", "review_id": "zctWpdsMPuoD2YtxpTCw2A", "text": "I definitely love this place!  A fantastic example of a little neighborhood restaurant just serving perfect hand-made food and getting it right.  The food is so savory and just melts in your mouth.  You can't go wrong with the specials.  My only complaints (which are minor) are that parking can be a bit of an issue (street parking only) and for the love of god, you need to make reservations (they get a bit shirty with you if you don't).  But these are so minor, I don't even think they affect my rating at all.  The food is phenomenal and the atmosphere is wonderful.", "business_id": "q_BKmbdlYfQJroJVHfYMUQ", "stars": 5, "date": "2011-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "9cCTmiJ7hz35rHIdr8n9kA", "review_id": "f59wOibgXoJIxQ6awm2fFA", "text": "Have mixed Vincent's.  My meal was good (spicy pasta) but service was spotty.  Another in the party had the homemade gnocchi and it was not good at all, \"tastes like dishwater\", was the quote.  Naw, that couldn't happen to homemade gnocchi, after a taste, I agreed!  Just goes to show, it depends on what you order.\n\nOh yea, the parking lot, very big but some customers parked in the entrance on both sides to make it one lane and of course when we were leaving we noticed that one guy was taping his car where it had be hit.", "business_id": "KZXtzoI84iI1CEcAnD7OPA", "stars": 2, "date": "2011-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8lronNRS1zhlZIj8ZbW3jg", "review_id": "hB3TUwYK9ZjFhdOxowmsug", "text": "I eat in Market Square a lot and this is my favorite place to get slices of traditional red sauce pizza out of any pizza place in the area.  I am still partial to Fat Tommy's for white pizza although I haven't ordered white pizza from La Gondola yet.  I have never found La Gondola's pizza slices to be greasy and the crust is perfectly crisped on the bottom and just the right amount of chewy otherwise.  Good quality food and yummy!!  I personally love the crumbled sausage topping.  They also have incredibly awesome homemade Wedding Soup (seasonal I think) - a definite must have when I see that they are serving it.  The staff is always friendly and prompt.  Give them a try!!", "business_id": "DhDNNHZtaBxYNSqJz64ixg", "stars": 5, "date": "2011-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7McRcfMQFEH6HJ6em3hskQ", "review_id": "XgSN8vW3q80VpCdm_vXLKg", "text": "Ordered delivery. The food showed up 2.5 hours later-which is acceptable, as it's (just) within the delivery window specified. However, the food had apparently been prepared within 15 minutes of receiving our order, because it was cold by the time we got it. I didn't listen to the other reviews and paid the price (literally)... if someone else is saved a crappy SW dinner by this review, my meal (or lack thereof) will not have been in vain.", "business_id": "9mwShpTgZofOujt4JfyGmw", "stars": 1, "date": "2014-08-23", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "5lq4LkrviYgQ4LJNsBYHcA", "review_id": "PmtXWxckc2uJcoce9XXlJQ", "text": "Arriving at the midpoint of the lunch hour we were surprised to find the restaurant less than 1/4 full.  With the bar empty and only one section being seated be claimed our reservation and were led quickly to a table near the large glass windows - an excellent view of the river would be our companion throughout the meal.  Meeting our waiter, a friendly man named Chendo we were given menus and a brief explanation of the daily special pastas for the Pasta Trio.  With the restaurant quite slow that day I will note we were very well taken care of throughout out meal - the service staff was excellent.\n\nBrowsing the high ceilinged room, randomly placed bottles and objects, and abundant brightly colored glass panels plus Chihuily influenced chandeliers I have to say Lidia's is a very handsome restaurant - it has that \"wow\" factor of many New York City dining rooms.  While the white paper over white tablecloth aspect of the table setting struck me as odd, everything else felt \"fine dining\" without seeming forced.\n\nSitting and waiting for our meals to arrive we were first delivered one of the better bread baskets I've had in recent memory - Sea Salt Foccacia, Rustic Italian, and Cracked Wheat Sourdough served with two spreads, a Chick Pea Pesto and pureed White Beans with Black Olive, both resting in a pool of slightly sweet extra virgin olive oil.  Served warm the breads were tantalizing and given the size of the portions soon to be arriving it was definitely a chore not to overindulge (a chore I failed, miserably.)\n\nFor our main courses my mother opted for a salad and a contorti while Erika and I chose pastas.  For myselfthe choice was quite simple - my favorite pasta and my favorite protein on the same plate, Gnocchi with Duck Guazetto.  An Italian Stew not unlike Chicken Cacciatore, but featuring duck in white wine instead of Chicken in Red the thick reduction was hearty, meaty, smoky, and laden with vegetables.  Paired with a toothsome yet non-doughy potato gnocchi the dish was not only enormous, but incredibly filling.  While I will admit I ate a lot of bread and helped my mother and sister  with their plates I can say that this was one dish I couldn't finish, it was just too large.\n\nFor Mother's selection she opted for the Roasted Beet and Apple Salad with Frisee and Fresh Goat Cheese plus the Pan Seared Golden Polenta Fritters.  A competent salad with sweet apples balancing earthy beets and pungent goat cheese the dish was brought together by a splash of balsamic and olive oil, ample in size and flavor, very nicely done.  Not fairing quite as well as the Salad were the Fritters - nicely prepared and crispy on the outside with creamy polenta within, they simply lacked flavor.\n\nErika's selection would be the signature Pasta Trio - three pastas plated tableside with unlimited refills.  Admittedly the concept sounds somewhat \"Olive Garden\" but that is before you realize two of the pastas are made in house and one is imported direct from Italy...and all the sauces are made daily in the kitchen, as well.  Served up onto a single large platter the daily selections  would be hand torn Tagliatelle and Pork Ragu, Imported Orchiette with Fennel Sausage and Thyme, and house folded Sweet Pea and Corn Ravioli with Cream Sauce.  Enormous in portion I cannot really fathom anyone requiring seconds of the trio and at a mere $14 the selections were excellent.  Smoky and Sweet the Pork Ragu complimented the al dente Tagliatelle nicely while the aromatic sausage was an equally balanced flavor for the Orchiette.  The most impressive of the group, the sweet pea and corn ravioli, was sweetened only by the vegetal components while the cream itself had notes of cinnamon and nutmeg.\n\nArriving simultaneously and thankfully smaller than the entrees was Torta di Mandorle e Mirtilli - Blueberry and almond cake, blueberry-lavender ice cream, almond crunch, blueberries. .  If a little is good a lot is better seemed to be the theme of this dessert and it worked nicely - the fresh blueberries lacing the buttery pound cake, the flowery accent to the blueberry ice cream, and the crunchy sugared almonds paired with even more blueberries - excellent.\n\nThe second dessert, larger in size but lighter in texture, would be Panna Cotta alla Fragola - Strawberry and ricotta panna cottas, lemon-strawberry sandwich cookies, fresh strawberries.  Served in a 12oz glass better suited for a milkshake the panna cotta was surprisingly springy and well blended with a more gelatin strawberry base topped by an ample creamy layer of whipped cream and ricotta.  Unnecessary but welcomed the lemony cookies were much akin to a shortbread in texture and Madeline in flavor.\n\nHaving heard \"upscale Olive Garden\" comparisons I personally find that assessment far from accurate and would actually go so far as to say that aside from the lack of seasoning the the experience was on par with many fine dining Italian establishments in other cities.", "business_id": "XmdTkxKyJd7TuDLoiic1kg", "stars": 4, "date": "2010-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QMgyRSbAYKvFTJ4LJ_f7yA", "review_id": "Ut78J02ANosfgkxJUv7dNA", "text": "Food was very good.  But the training of the wait staff was Ill advised and needs to be redone. The waiter came back every 5 minutes and asked each individual (there were 4 of us) how everything was, did you want more ravioli, etc. There is a fine line between being attentive and being annoying and our service was way over the line.  Our meal was so often interrupted by either the waiter, the manager, or the support staff that we were unable to enjoy it.", "business_id": "XmdTkxKyJd7TuDLoiic1kg", "stars": 3, "date": "2012-08-19", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "D5ZNR93f6U3L0lpoxol4lA", "review_id": "1Q_OuUx46cwij7lS9jVthA", "text": "A restaurant that has gone steeply downhill...\n\nIt's been roughly 2-3 years since I have been to lidias, an experience in which I remember having decent food and service... Tonight was far different.\n\nOverall, let me say that the restaurant is becoming dated. Colors and decor seem boring and out of style. I didn't get that warm feeling I should in a place where there are white clothes, $12 average glasses of wine (like come on - I looked up the crappy bottle it came from) and waiters everywhere.\n\nThe service was horrible. From hostess crew to the bar to the waitress, it was bad. The hostess forgot about us, then when I reminded him we were waiting (40 minutes - despite a reservation), to which he said \"oh yes, I was just going to get you\"... But he wasn't because we stood there a few minutes while he set the table. Rude.\n\nDid I mention the service was bad? Well, while we were waiting we had a glass of wine each (a steep $13.50 glass each - definitely didn't live up to my expectations). The bar staff wasn't concerned with us and weren't friendly at all. They were chatting to themselves and basically ignoring us.  When we got to the table, it took 10 mins to meet our waitress. Then it took another 15 to order.  Then 50 mins to get our food!!! I had the pasta trio (remember this meal takes no time to cook  - as this is ready made and constantly being served) and my wife had the porkchop. Honestly, we typically enjoy our restaurant food (just read my Casbah review) but our food was really just so-so. My wife's pork chop was fatty and over-cooked (despite the waitress specifically making note of how the chef prefers to cook it medium). My pasta was decent, which I ate, and requested seconds (which is allowed for the trio because they give you very small portions).... However, seconds never came. Waitress didn't even know until I told her politely. Then she blamed new staff working the pasta routes... No good enough reason for me - sorry. \n\nThen the bill.  I ordered the pasta trio for $23 and the waitress asked me if I wanted to upgrade my Salad for $2, to which I approved. However she charged the $36 pasta trio (which comes with desert). I told her this was a mistake and she agreed and ran back with a new check. Now I had a $10 salad and $23 pasta trio. I was expecting $23 +$2 salad upgrade. Nope. So I explained to her politely that I ordered the $23 trio to which she (must have) mistakenly offered me an upgrade. I accepted. However I was told I was wrong and she didn't offer to make this right. Ugh. Seriously you want to fight me on it? Especially when I know I was being appropriately (not like I was trying to score a free meal). Isn't the rule \"customer is always right\"?\n\nFinally, we felt like the whole restaurant clientele has declined. How many people did we see in tie-dye shirt or wearing hats (literally wearing hats at 8:30pm in a fine dining restaurant)? We saw enough to know that this isn't the lidias we expected.\n\nWe won't ever go back or recommend the place.  As far as we are concerned - there is a very good reason that you don't have a problem getting a reservation here (because IT STINKS!). \n\nAvoid!", "business_id": "XmdTkxKyJd7TuDLoiic1kg", "stars": 2, "date": "2014-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nXp_Xhpr3z30aSayztzQmw", "review_id": "2DMw1CSVIzHigh6x3IUTLA", "text": "Pasta trio good, but wait staff was not paying attention so we didn't get the grated cheese in time to eat...until we were half done with pasta.  But, waitress very friendly.  Beet salad good, desserts were tasty.  Didn't disappoint, though the pasta for one preparation was lackluster with red sauce and pepperoncini.  Not my fav, as were the cheese rav and the pasta with sausage/cabbage.  Cannoli delicious!  But, where were you, Lydia?", "business_id": "XmdTkxKyJd7TuDLoiic1kg", "stars": 4, "date": "2015-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "KlnymTd5Odne3dSF7PRKJg", "review_id": "9fVMs1mFMErbI8XzotJ6eQ", "text": "This was really disappointing. I went out with three others on a Friday night to grab some dinner. Unfortunately, we were all pretty underwhelmed with most of the dinner. \nI'll open with the highlights. The potato balls were yummy. Crispy on the outside, creamy and cheesy on the inside. There were easily the highlight of the meal. Also our desserts  were good. We had a chocolate cake, tiramisu and the lemon berry mascarpone cake. The desserts were all flavorful, sweet and yummy.\nThe entrees, however, left much to be desired. The table order a penne Alfredo, penne malfalda, and the putenesca. I ordered the amanda pasta, which was a special. It was sauteed broccoli, zuchinni and sundried tomatoes in their aglio olio sauce.\nEverything tasted like nothing. I'm positive the pasta water wasn't salted. Even the putanesca, which didn't include any tomatoes, had no seasoning, which seems like an impossible feat considering its historically a salty dish. Everything was just bland and disappointing. It literally tasted like the place has given up.\nI likely won't go back, except maybe for some dessert, but even then, it won't be any time soon.", "business_id": "-Nanlb7SYXObqQ6dZ49UOg", "stars": 2, "date": "2015-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gQta9kx5RKLpYk0ywxUDxg", "review_id": "59dG5XL_Am4AhMfGSVsIJA", "text": "I love N.Y. style pizza.  Could eat it every day.  On a recent to trip to Pittsburgh I tried alot of pizza and this was my fave.  One thing about Pitt pizza... it is slightly different than true NYC style:  the crust is not as thin and there's a whole lot more cheese.  As a rule Pitt pizza also has a slightly sweeter tomato sauce.  The sum of its parts is still delicious.\nA delicious close cousin to NYC pizza.\n\nThe pizza I tried in Pitt in my order of favorites:\nFiori's\nPizza Sola (Penn Circle Branch)\nPizza Perfecta\nAiello's (Murray Street)\nBeto's\n\nSave for Beto's, I thought they were all delicious.  Wish I had a chance to try Mineo's.  A Pittsburgh native friend of mine calls this his favorite but they were closed July 5th when I went by their place on Murray... I'll try them next time I'm in the 'burgh.\n\nI can't imagine anybody beating out Fiori's.  Their \"cuts\" (Pittsburgh parlance for \"slice\") were a perfect Pittsburgh version of NY style pizza.\n\nFiori's to me was the best in Pittsburgh because it had the perfect amounts of chew, char, crust, cheese, sauce.\n\nThe place itself has a perfect old school been-in-the-neighborhood-for-years vibe with a couple of tables and booths.  Unpretentious.  Neighborhood.  Open Late.  Perfect.", "business_id": "r8jeeS3k_diihMDSu9IjlA", "stars": 5, "date": "2010-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "i0KLknSgxX8w7W8cxqcyug", "review_id": "I6haJHDDSLJvSnKn_ZBcxA", "text": "My girlfriend is much newer to the area so I try to take her to real Pittsburgh places. Fiori's should be held right up there next to Primanti's as a staple. South Hills icon. \n\nThere's old world charm when you order. Pie comes out quick. It's awesome deliciousness scored me many points with the lady and satisfied my soul for making my not-often-enough trip to this fantastic pizza icon of the City of Champs. \n\nPreach.", "business_id": "r8jeeS3k_diihMDSu9IjlA", "stars": 5, "date": "2014-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "R4crU2OjJ7-qAymiHO2Ucw", "review_id": "MEqi2R9-2gq2zLtbJiJwfQ", "text": "We decided to take a chance on the \"chicago-style\" deep dish. Big mistake. It was basically a piece of thick garlic bread (minus the garlic) with marinara sauce and cheese. Bland as all get out and NOT deep dish. What the heck is wrong with the pizza joints in this city not understanding the concept of deep dish pizza, let alone advertising it as \"chicago-style\" when it clearly is not? Is there some kind of patent on deep dish pizza that I'm not aware of? Why is it so hard to get ahold of in this city?  \n\nThe other thing Bellisarios blatantly lies about is the air conditioned dining room it advertises on the sign out front. It was hotter in the restaurant than it was outside, which in July, is not a good thing. \n\nThere's a reason my rating isn't too harsh. I don't like knocking hometown pizza joints. I'm sure their regular pan pizza is as good as everyone says, so I'll come back and get that instead. Plus I had a plate of near perfect onion rings. And our server was pretty great. So I'll try again, but no more deep dish disappointments. I just can't handle how sad and angry it makes me.", "business_id": "UjJMQguryo1jypomvOCZgg", "stars": 3, "date": "2015-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "o22C4GhMh0mv9ldqPD0f1g", "review_id": "pWY0vArnTbMChTCZvVWMSg", "text": "The most delicious pizza and the best cocktails in the area!! Such friendly staff!! I've always had an amazing experience!!", "business_id": "6-rJjW6ITl5o_FliiNgZRA", "stars": 5, "date": "2012-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CDXATwoG7hr4VN8ffdTzIA", "review_id": "OYB6ZfTZo0jyHjXuQCf6rw", "text": "The bar in the back is gorgeous. Drinks are better than their food. My pizza was okay, nothing yummy. Way too over priced. Go for drinks and nothing more.", "business_id": "6-rJjW6ITl5o_FliiNgZRA", "stars": 2, "date": "2015-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tIN-Az2mTaNZYB2r4Jt24g", "review_id": "oRZghEf87Rng3usT06ll9w", "text": "Excellent Italian food at very reasonable prices. We went there with our two kids and had an excellent experience. The staff was very friendly and I highly recommend it.", "business_id": "xgK6AAhJ-cYBUCSaLzgTuw", "stars": 5, "date": "2012-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rCjwpwrjudEgf12VvfCATw", "review_id": "x1ngyKOiib0BfxBNb2TxAQ", "text": "The salmon over olive oil soaked bread with asparagus was divine. The lamb meatballs over brown butter pasta was incredible. Escarole with white beans in tomato cream sauce was delicious. The house salad was even great. Very reasonable prices for the amazing quality. Very recomended.", "business_id": "xgK6AAhJ-cYBUCSaLzgTuw", "stars": 5, "date": "2015-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZaN4syP4lgkBlKq7QW2GwA", "review_id": "M1ByQAjFet3Daa_fm_5nyA", "text": "I thought the pizza was a novelty. Mega slices you fold in order to eat. My slice was reasonably priced, the crust was my favorite although I didn't care for the toppings as much.  I am partial to Chicago style and the drinks are expensive so the rating is just a 3 star, just average or a bit better - I'd give 3 1/2 stars if I could.", "business_id": "sJtGRBWYUj013nkFA4Hrdg", "stars": 3, "date": "2011-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "4bIXGkoeMczOe6goszBJkQ", "review_id": "JBQy1ap5O_N_Z1vHu1Dfdg", "text": "Oh, so tacky and cliche. That's what makes Buca di Beppo so great. From the Christmas-light-wrapped statues outside to photos of nuns running through the ocean inside, everything gaudy and over-the-top about Italian-American culture is embodied in the restaurant.\n\nThe experience starts with the escort to your table, which takes a detour through the kitchen (where there is also a booth table. In the kitchen.) and around by the Pope Room used for large parties (with a creepy wax bust on a rotating dais in the middle of the table).\n\nFood is served family style. A \"small\" plate will feed 2 to 3 people. Everything is very tasty - I personally love the baked pasta dishes, the garlic bread, and their salads can be a meal by themselves, too. Not a place you want to come unless you are feeling hungry.\n\nMy only complaint is that their only Charlotte location is in Pineville and rather tough to get to for me. But when I'm in the area, a great place to stop!", "business_id": "SVKC_-gIQFkHElZ6bFsE6g", "stars": 4, "date": "2012-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NC5xZisvffiTL1kOFc5vbw", "review_id": "iWEVOyp62BWp8yCcuVRxCw", "text": "Most people are aware that OG is far far from authentic...however it seems that OG has gone downhill in recent years, and has left it up to a marketing team to save them. Upon our most recent visit to this OG in Pineville, They gave me food poisoning. Having worked in the restaurant business for 15 years, I am very aware of what food poisoning is and is not. This was the real deal..my first hint should have been at the restaurant when the couple seated next us were complaining about their food. I doubt we'll ever be back.", "business_id": "4WsTFTH8GgnyFHwrH9nHzA", "stars": 1, "date": "2012-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zycqYaHhEjqIdkAYVSqQIA", "review_id": "Y_sQI_-USkffV2_0CA8zHw", "text": "Oowee. This is some seriously great Italian. If you like your meals to take time, then this place is five stars. The food is five stars. But the slooooow service drops it a notch.\n\nOur server didn't have an extensive knowledge of the beer list. This probably shows my naivete with regard to what you're supposed to order at a restaurant like Luce, but still, a good server knows EVERYTHING, or at least acts like it. Thus, Peroni. [sigh]\n\nMy appetizer was the veal cutlets, just little thin slices of tender baby calf with a dallop of sauce and capers. I'm going to spend a few more months in Purgatory for eating veal, but MAN, it will be worth it!\n\nMy main course was the cheese rolled in pork, the Fraciti I believe it was called (I can't seem to pull up the menu online) with gnocchi. Seriously great stuff. I ended with the custard and berries, which was okay. I wouldn't send it away, but perhaps I was expecting something more after the faaaaaantastic appetizer and entree.\n\nWhew. Again, the only drawback was the 2.5 hour meal. An entire tenth of my day was spent at this restaurant. In some sense it was worth it, just be prepared. Go GO GO!", "business_id": "z24h6ZYnZiWjlDTuLXG9jw", "stars": 4, "date": "2012-07-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1jfIdgtFOPfqn-aPqHkUqw", "review_id": "ZwDcTvT0e1rPLy1Y_dr4cw", "text": "I used to work here about 10 years ago and it was and is the best Italian restaurant in Charlotte. It's not just that the food is unbeatable (I mean, who can have just one of those garlic knots?), but the owner and management are great. We always had such a great time working (it's easy when the food is good, you feel good about making recommendations). We also almost always bought some food before the kitchen closed and took it home! Now, when I come home to Charlotte I always try to get my parents to go there with me! Try going for lunch when the ginormous portions are a little smaller.", "business_id": "MQnNtW1lHS-eid3QNUoUIw", "stars": 5, "date": "2007-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YRnP1CAOUuFOWcKRMPEctw", "review_id": "qWoauuHMD7AUNExVwxLArA", "text": "Food was terrible service was ok. We were told it would be a 30-45 minute wait and it turned into an hour and a half wait. Totally not worth it.", "business_id": "MQnNtW1lHS-eid3QNUoUIw", "stars": 1, "date": "2013-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y2sNh4MMfUHBzT6dLbM7Jw", "review_id": "rQDafmqnouy57GsajaDWBA", "text": "Love this restaurant. You can always expect great service and even better food! We love to get the family size penne a la vodka with shrimp to share. Every server we've had has been very helpful and attentive without being pushy or annoying! Always look forward to going for casual date nights :) \nPS don't leave without ordering a cannoli- or two!", "business_id": "MQnNtW1lHS-eid3QNUoUIw", "stars": 5, "date": "2014-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3coeIhRr6t8CoBJgIfH7pg", "review_id": "vx1W1i6GsbFL5purQDjhPg", "text": "This will be short.  Everything is awesome.  Food, service, atmosphere, everything.  Definitely check it out!", "business_id": "MQnNtW1lHS-eid3QNUoUIw", "stars": 5, "date": "2015-08-05", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "_WjlTMrbeEwNWygD6RoctQ", "review_id": "Kxx5ejiiDu_a2aaMeDWGjA", "text": "First of all let me start off by saying \"I love Italian food\".  So with that being said, I had the WORST experience at the \"World Famous\" Open Kitchen that I have ever had at any reputable establishment. I had previously been to this restaurant and did not really care for the food, but it was a very late dinner so I chalked it up to that.  Present day and needless to say I find myself here again. But since I had purchased a Groupon, I thought all would not be lost because I would get a discount on my meal.  I ordered the Fettuccine with Shrimp; let's just say Lean Cuisine should tell them to stop using their recipe.  Not authentic at all. Yuck! This is the \"World Famous\" Open Kitchen!!\nSo now we receive our bills and because we are in a party larger than 6 per the menu, we automatically are going to be charged 15% for gratuity for our meals which is customary and we were good with, but we were not charged 15%, we were charged 20% and when we asked the Manager about it he had no real reason for charging us more. And I must also mention that he stated that since we were all at the same table (that they put together, mind you) only ONE person could use the Groupon, although the Groupon states one coupon per visit, per person, not per TABLE! And we had three different groups of people at the table with three different bills. After continuous protest He still would not let us use the other Groupon coupons, which was $17 off a $30 value and my bill was over $60!!\nSo on top of the food and service being substandard we also were overcharged for gratuity and were not allowed to use the Groupons that we purchased online. So if you don't mind Chef Boyardee cuisine in an old dark outdated restaurant where they can charge you however much they see fit, than this is the place for you! But don't expect to see me there EVER!!!!!!!!!!!!", "business_id": "MCFxbw9hQYejyvg59T44TA", "stars": 1, "date": "2015-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dEyaKOSbTen__PPQB0V6yA", "review_id": "DOqoaGWsQXCijlTSmpOgZw", "text": "Meal was pretty average but would not go on a Friday night again. Very questionable patrons lots of leather tattoos and women that were overweight with tight clothes can you say cheap hooker!", "business_id": "qZ1bDtcercwUw4w7trpVjQ", "stars": 1, "date": "2014-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_gjPgeRi2lkvl-StNhT45w", "review_id": "m7ULQy0qkqcLsEvptzzPvA", "text": "Very forgettable. Ordered the daily special, chicken caciattore which was horribly bland. Wife had a chicken pasta dish with pesto sauce. I love basil, but they over did it, and sometimes more is not better. It didn't help that the Ac wasn't working while we ate. The food, service, and atmosphere are all overrated and highly overpriced. Even Olive Garden beats this place. I would not recommend at all.", "business_id": "LwSNsn2k6v_Nb2dbhP3qsQ", "stars": 2, "date": "2012-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iKBS0S0l_PZ_iEaKw8W9bA", "review_id": "OcvbTjDFSpYMd259fidrRA", "text": "Went for hubby birthday food was excellent top notch service in a warm cozy place had Pollo alla marsala very tasty hubby had scampi divi Olla said the shrimp were perfect fresh homemade pasta we will be back", "business_id": "q8fD82us6uuGufvI44NoAg", "stars": 5, "date": "2014-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bTR-LOUFoo3H7bEXoDv9rw", "review_id": "nua3vMm6uDOFm54YjyYHhA", "text": "I love Noodles but this location is going downhill fast. They undercook/ overlook my chicken every time. They are also getting good at under boiling noodles!", "business_id": "0oQFFOdPZycIBmGkoBrlbg", "stars": 2, "date": "2013-08-23", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "U2lYSxTNZ2t5_isM_6f1lA", "review_id": "2lzU7u-5azFLr7PbIvXlQg", "text": "Greg is the type of dude who throws a killer party, but doesn't know when enough is enough. Listen Greg, everyone loves to come over and chill out with a keg, okay, bro? Everyone is super impressed that you can have 36 Natty Lights without throwing up, Greg. No, really. There's a time and a place for you, man. That time and that place is college or post-college hangs. Don't throw yourself in a suit, put some junk in your hair, speak a little lower, shake hands a little firmer and pretend we're good buddies all of a sudden. You're Kegger Greg, damn it. And that's the only relationship I want with you.\n\nPizza Hut? You're fine if I'm broke or drunk. You're Kegger Greg. You're a fine once in a while situation that I would never dream of associating myself with in public. You're kind of a disaster sometimes, man. You're fun. You are. But just... just get it together, dude. Do I need an artisan barbecue glaze on my crust? Do I? Do I need to invite Kegger Greg to my wedding? Of course not. Be greasy and awful and ridiculous, Pizza Hut. Be a big sloppy mess, Kegger Greg. And don't, either one of you, ever ever pretend to grow up. You're kids forever, dudes.", "business_id": "pHBQ-dQRwN3z7Rq7iSog-A", "stars": 2, "date": "2015-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lC1UNgZlTmS7UZcTh5dIQQ", "review_id": "OoSZvcwra1AhZf-navBnKw", "text": "Went with a friend recently. Food was typical Olive Garden fare, great soup and bread sticks, and OK-ish entrees. But the service wasn't the best (I am not sure if the bread sticks came out late because they were being baked or if the waitress forgot, but we had wait for about 15 minutes after ordering our food before reminding her - I mean come on, their bread sticks and soup is one of the few reasons I even go to that place !). \n\nOther than that, their smoked mozarella fonduta was pretty good. Nothing much to write about the rest of the experience.", "business_id": "H0D2HYqLd9MRCq68rtbTyQ", "stars": 3, "date": "2012-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hgCqK0LrwrWmUrtFdL_tsQ", "review_id": "081luVKwgU9It7WRHFEksA", "text": "For the price that this Central Illinois establishment charges, one would expect basic restaurant treatment.  I waited for 15 minutes even though I had a reservation.  The host was a snooty, inconsiderate person to which I told him, \"relax, this is Central Illinois, there's nothing to be snooty about.\" And most importantly, the food was over priced, did not taste good and the portions were small.  All in all, not the greatest.", "business_id": "h9xdY1NO4GnNijNChTy-8A", "stars": 2, "date": "2010-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t3YJsQ0rNR2YZy7Tfub2Vw", "review_id": "NHLuoP7L0amj0Zc6T1MTcQ", "text": "Amazing food and staff!! Can wait to go again and try more great food!! Truffle Fries were so fabulous!", "business_id": "h9xdY1NO4GnNijNChTy-8A", "stars": 5, "date": "2015-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ATRinh_36M5fh9pmVcmrvA", "review_id": "LWqknZBFhJUhUVSjC5rN9A", "text": "I don't know what they were shooting for with the decor, but what ever you are hoping your restaurant will look like I'm sure they have a place in there that will mach.\nThe service was friendly and I enjoyed the various surroundings. But the food was sadly not up to par. I could make better spaghetti at home.", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 3, "date": "2011-08-23", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Jo__PBVH5CcxwOGlUksYvA", "review_id": "b2msLVl8iIcJZylG2sjnxw", "text": "Went for dinner me and my 9 years old son\nOrder 1 adult mill and one kids mill\nNo drinks jest whether \nWhen the bill came the whiter whit next to me until I get Har payment and my son was noisy   So I didn't cake so Mach the bill\nWell it was 31 dollar .....\nAnd I also had tip \nWhat A rip off.", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 1, "date": "2013-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AW9hu_GnQK4lNreHFzxYcQ", "review_id": "C6n-QPeZuZ4hEogoDiOqbw", "text": "On a hot afternoon, we were traveling home to mid-city Phoenix from a Diamondbacks day game on the light rail. Hungry, we reached the McDowell Road stop about 5pm and got off to dine at the Old Spaghetti Factory. Upon entering a nearly empty restaurant, it took the hostess girl several confused minutes to seat us. We eagerly waited well over five minutes for someone to bring us glasses of water, which typically happens automatically in Phoenix restaurants in June, when a waitress finally appeared and took our drink and dinner orders. Still no water. While waiting at least another ten minutes, no drinks or water, we observed several, if not many, other employees standing around talking to one another or just doing nothing. Still no water. We then walked out and will not ever go there again.", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 1, "date": "2015-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "agNz_cZBfJYZPN1FaBwv6g", "review_id": "-2GpdoCcnFBeKaMbQox0yA", "text": "Geoff B., I had a similar bad experience.\nI ordered a chicken sandwich at this restaurant without mayo -- after waiting quite a while (I was one of two people in line), I finally received my sandwich. I checked the sandwich outside, just to be sure it had no mayo...it did. I returned, told the man who took my order (perhaps the owner?) that the sandwich had mayo -- he grabbed it from my hands, and gave it to one of his workers, who then came back with it about two minutes later. I thanked him and left. I again checked the sandwich when I got outside, and saw that the bread had been replaced, but mayo was still all over the chicken. I returned to the restaurant and told the man that it still had mayo, the man yelled at me and slammed the sandwich on the counter, insisting the sandwich did not have mayo. I showed him that mayo was still all over the chicken and asked for my money back -- a nicer man from the back of the restaurant thankfully came out and apologized and returned my money. \nPerhaps it's time for the younger gentleman to take over management of this restaurant.", "business_id": "If2DUhmWIvlu2JFc_rR-Bw", "stars": 1, "date": "2010-08-24", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "BuwjlU6D4kcs1aGo7wSM4Q", "review_id": "XakHM23EobVXmAf86k5C6A", "text": "My dad used to work down the road from here oh, (hack cough) 40 years or so ago, when I was ... wait, I'm dating myself. Stop that Janet. \n\nAhem. Anyway, our family ate a lot of pizza here over the years, and I'm happy it's still here. I like mushroom and  black olive pizza... my dad put sausage on his half. Of course he's since had quintuple bypass surgery but I'm quite sure it had NOTHING to do with the pizza he consumed. No, of course not.\n\nI'm  also quite sure we never had pineapple. I wonder when that showed up on the menu?\n\nMy mom used to eat eggplant parm,which was covered in marinara and gooey cheese, and my brother would eat a mountain of cheese ravioli. I remember the portions being really big. And I remember the garlic bread as being pretty good. \n\nI'm headed back here next time I'm in town with my kid so she can check out where grandpa used to take mommy. I love it when places  have been  around longer than I have been.", "business_id": "PEHJjxdw11TGFma9Zhz3ng", "stars": 4, "date": "2012-07-16", "type": "review"}
{"votes": {"funny": 9, "useful": 3, "cool": 5}, "user_id": "nc3cqVN0UuB3m50-CcMftw", "review_id": "XfVeOzivyFIEQCMGJBx8Mg", "text": "When I first moved to Phx and found my first apartment, budget was my Secret Word of every day. Yeah, so I moved into a modest studio apartment at 52nd Street and Van Buren. It builds character. Sure, it was western exposure and I couldn't afford to run the AC. Shows endurance. And I learned to spend what little money I made wisely. Fiscal conservatism rocks! Well, part of that meant finding a cheap and nearby place to wash my chonies and other clothes. Finding good eats was coincidental. Every Saturday morning, I'd set my VCR to record X-Men Generation, loaded up my Sportage with a week's worth of dirty clothes and headed to the laundromat at 48th and VB. Initially, I'd stroll on over to the Circle K during the wash cycle, get something that was certain to introduce me to my toilet after the spin cycle and that was about normal. One day, I bravely headed north and stumbled upon Phx House of Pizza and Subs. Like a mirage in the desert, it called out to me with intriguing smells of delishness. It was lust at first sight. The 2 slices of pizza would keep me filled until afternoon and were amazingly tasty. Truly, I found happiness.\n\nAnd so it was, a Saturday ritual whilest my clothing was being laundered I succumbed to the garlicky goodness that is PHOPS. Sadly, I found love and moved to the other side of town and it seemed I was watching an endearing lover grow smaller in my rear view mirror as I drove on. :sigh: I did know what good, economically-friendly dining was. I shall never forget you.\n\nOh, and honey, if you're reading this: You're way better than pizza. Honestly, I mean that. :kiss:", "business_id": "ZAgPh4v-oOb1g6cdlkKI0g", "stars": 4, "date": "2008-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "cZEVW_x0NKI69Xm55tknBg", "review_id": "BAGRZ5bLntvHVPXekww61A", "text": "Damn good superior quality food. What a gem this place is. The menu is small, sandwiches, salads, drinks. Everything they do is home made, the bread the cheese. The veggies are local and or organic. It has a very original twist, you can't find anything even close in the area. Love it!", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2008-06-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "GyFmGA5UQZ4pXdx1lUH86g", "review_id": "VQW2_RpsXX16Tmtr9oHHfQ", "text": "why did i wait so long to try pane bianco?! i opted for the mozzarella tomato basil sandwich. bread is yummy and rustic - crusty on the outside, soft on the inside - absolute perfection. the house-made mozzarella was some of the best i've ever had. local tomatoes were perfectly ripe and plentiful. the basil was fragrant and flavorful - a real treat. i don't know what else to say except it was amazing. oh and that the yummy, nutty, caramel-y surprise in the bottom of my bag was delish. i'm hooked.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2009-08-06", "type": "review"}
{"votes": {"funny": 4, "useful": 12, "cool": 5}, "user_id": "4ozupHULqGyO42s3zNUzOQ", "review_id": "PGcMhDfW1XXEaLlbnx09xg", "text": "This is the perfect lunch spot. It's perfect for those who need an hour escape from a cubicle, it's perfect for those meeting friends for a leisurely lunch, it's perfect for a solo diner and it's perfect for a casual meeting. A sit-down restaurant lives on one side and a takeout market (with outdoor seating) lives on the other. The atmosphere is very farm-to-table'esque and lets out a fresh breathe of an open and airy environment of fresh products and friendly kitchen. \n\nThe food here is what you would expect from Chris Bianco: pure perfection. The bread is fresh and fluffy, the cheese is creamy and the meats are grade A. The menu is extremely limited, but it still offers something for every appetite. They have a couple salads and a couple sandwiches, but be sure to ask about their daily specials. I had the pleasure of visiting Pane Bianco today for a business meeting and decided to enjoy the special. The special today was a prosciutto sandwich with melted cheese and tomato paste. The tomato paste really made the sandwich. The entire sandwich was filling without stuffing me and delightful with every bite. \n\nI think that it can be hard for individual diners to find a lunch spot that's comfortable for a \"table for one.\" Luckily Pane Bianco is the perfect environment for this thanks to the takeout market and picnic tables in front.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2012-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "HestW1GKSkmUs_vpnauE_w", "review_id": "9OdHzdj9nrE5d06dtH9tug", "text": "Pane Bianco is among the best in the valley when it comes to quality, flavor, and service. I got my order To Go, so I can't speak for the Dine In service, but I was greeted with a smile and got the full first-time rundown from the guy at the front. I ordered the mozzarella sandwich and was so happy I did. Their mozz is made in-house, and let me tell you that makes all the difference. The bread was crispy and the trio of mozz/tom/basil was to the T. The atmosphere is lax and airy, perfect for lunch. They also have an outdoor patio with misters, which always seals the deal for me.\n\nOverall, if you're looking for food that's made with love, go to Pane Bianco.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2013-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "7G8IDtHhNRykIHNBHTIJXg", "review_id": "LS9s_b3Gm20htRESgpJIRA", "text": "Really good lunch spot for takeout (the restaurant is divided into takeout and dine-in, and the dine-in portion is relatively small for large groups). I'm a big fan of the classic mozzarella sandwich and vanilla bean rice pudding. They don't have much on their menu online, but the few items they do have, they do really well. If you order takeout, make sure to call in 15 minutes before your pick up time so that they'll have it ready. Otherwise, you'll be waiting for your takeout. \n\nIf you're going for a market sandwich, I recommend calling in to get their special. It can be a hit or miss. I got a market sandwich without calling once and ended up with a turkey sloppy Joe. It had a great taste but extremely messy and oily to eat.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2014-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "19FkHmJef18CJedDPgJ_yw", "review_id": "ZeGQcZnmxivZeFpnXi8vGg", "text": "I was headed out to Pita on 3rd Ave and got roped into going here by a group that said - \"it's great and in Park Central\"...all I'm gonna say is that it was like cafeteria food. Yeah, like cafeteria food - cold pizza and overly dressinged salad", "business_id": "OkXpdUozVS3vjSRtCoSIvw", "stars": 2, "date": "2011-06-30", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "NFBQGT-YmMCHvTSIEyX_1g", "review_id": "5-x8FfXhyprT79aGfp_dFg", "text": "I used to go here all the time for lunch to get their mini deep dish pizzas that are limited in supply and you better get there early because they go quick...because they are sooo good and they can feed two people almost.  But went there with the family last night and  you know how it can be kinda difficult to satisfy 4 people with the same pizza?  So we often do half and half to make everybody happy...and we've never ran into this situation, they wanted to charge as if the whole pizza had all the toppings...meaning if you get 3 toppings on one side and 3 different toppings on the other side, you better be prepared to pay for a 6 topping pizza...about $8 extra.  So they are off the 'family friendly' list for me.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 2, "date": "2010-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0PGDayleMFEr_AjeqV16bQ", "review_id": "u0TemrC0hcmr7UVwF6TjYA", "text": "Customer service ..food everything about this place is good had the stuffed pizza ..also for dessert i recomend the pizza cookie ..if you try it you will want to go back!", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 5, "date": "2012-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uX0ojmRbNTY0zA5avnW21g", "review_id": "rySMtxT38Bdl2pcloT-yNQ", "text": "I realize I'm one of the many 5 star reviews, but my experience was with their takeout service. Couldn't have been more friendly. The food was as good as ever and it was ready right on time. Love oreganos and the people that work there.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 5, "date": "2013-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "lS1yBzrxGoYY-k2auRMAMA", "review_id": "h1zsW3U7TvqKiMqlWxZGqw", "text": "I love Oregano's! The portions are so big and always delicious. \n\nI've been to this location a number of times and the service is always on point. Great staff! All of them that comes in contact with you says hello or welcomes you to Oregano's.\n\nNice, relaxing ambience; with indoor and outdoor seating.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 5, "date": "2015-07-06", "type": "review"}
{"votes": {"funny": 8, "useful": 5, "cool": 4}, "user_id": "gq_G5VCDziyEV2-bzGuqzw", "review_id": "wxUDG1zvdXpJXTzybQkXsA", "text": "**WARNING: REVIEW PARTIALLY BASED ON BITTER GIRL SYNDROME**\n(you've been warned)\n\nSee, I don't really like this place.\n\nOk, maybe it's because the meal was planned around a gruesome and undue breakup, during which I cried into my soup and everything became tasteless, but THAT IS NOT MY FAULT. It's not my fault I can be simply too awesome for some to comprehend.\n\nMoving on.\n\nI tried it again sans ridiculous relationship errors (that's you, Isaac*!) and I, quite frankly, remain unimpressed. The pad thai is eh, and the soup I revisited was simply as bland as I remember, but without the enduring emotional frustration this time.\n\n*names have been changed to protect your stupid identity. Maybe not. Haha.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 2, "date": "2007-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "F3MuccVKGKuWM34d1epDLg", "review_id": "GWrIpFcXtZJpx6iCHT51fA", "text": "We met some of my wifes co-workers after work here. I just kept dishing out Ramen jokes all day since I wasnt too much of a fan on this is where we would be going.\n\nAfter getting there my attitude quickly changed. They have a very wide assortment of dishes rather than noodles. Everyone but me got the yaki soba noodles with chicken. I tried something else, but dont remember what it was called. It was basically shrimp tempura in rice with some kind of sweet honey type of sauce over it. It was pretty tasty. I also got a rainbow sushi roll that took a very long time for them to prepare. It came after we were all done eating. It was good, and the price for it was decent. The only complaint I had was that the fish was sliced to thick. It was a little on the chewy side.\n\nOur waitress was kind of hit and miss, but she was a delight when she showed up. I would visit it again and definately skip the ramen jokes the next time!", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 3, "date": "2010-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tueZZgG49lLPMj1gRkM2Ag", "review_id": "WAXuTycSzkEVt1rI49r0gw", "text": "What happened to this place. I have not been here like a year, and everything went down the hill. No more banana bread\n\nFirst, Bad Service. We stood up for 5 minutes in front of main door while inside was not crowded. Waiter did not bring us a bread. i had to ask twice. Order was slow. I saw our food waited in the counter at least 10 minutes. I was ready to go and pick it up.\n\nSushi quality was bad. Yakisoba noodle was burned.\n\nWell, I used to go this place alot, but I will never go back again. What happened to Japanese culture - Being fast , efficent and respectful ?\n\nI will never come back, there are lots of nice places in nort phoenix. just go check it out like Tokyo lobby, yen sushi. It will worth a drive, and \n\nSAYANORA Cherry Blossom", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 1, "date": "2011-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "gJaHG7CwWCutVLY-2g1Ewg", "review_id": "B4CQwXmYBuS2SCbCMfnrFA", "text": "Our server Fumihiko, is such a sweet guy. He carefully explained the lunch dishes to me. I love the window table table they gave me. With the cute lil lamp. The dish I had Korean spicy Beef. Dilish..... & Green tea. It's a cute place. Gets packed at lunch, but it's worth the wait. Lunch prices so reasonable ... Bon Pettit . Saaaaaarap (Filipino 4 Yummmm) ..... I know I will be back. It's next door to my addiction Snoh Ice Savery, my summer hang out.... ^_^", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 4, "date": "2013-06-03", "type": "review"}
{"votes": {"funny": 7, "useful": 13, "cool": 12}, "user_id": "--65q1FpAL_UQtVZ2PTGew", "review_id": "PUuzCaLECZ5uHzsIjQTWSA", "text": "I find myself at CherryBlossom a lot nowadays, and that's why I needed to update my review. I've discovered my new favorite menu items, and they must be eaten! So, you should try:\n\nSpicy Gyoza Pot\nCha-shu Ramen\nTanTan-Men Ramen\nUdon Suki\n\nThe gyoza pot is my favorite menu item (and it's on happy hour).  It's simple and delicious. I am completely satisfied with a Kirin and the gyoza pot for dinner. The Cha-shu is a damn good bowl of ramen, and the TanTan is even better if you're up for something spicy. My newest discovery, and the reason I needed to write this, is the Udon Suki. It consists of udon noodles, tofu, green onions, sliced beef, and a poached egg floating in a savory broth. CherryBlossom's Udon Suki is awesome, filling, and awesome.\n\nI have come to the realization that the service is hit or miss at this place, but in my opinion, the food makes up for any shortcomings. Go try some of the dishes I just mentioned and let me know what you think!", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 4, "date": "2013-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_9WdLStCJUKWiQhyCzckoA", "review_id": "UTrdnLIiebXLpJ0RmUgcMg", "text": "Only place in Arizona with authentic cold buckwheat soba noodles\nPrices are too low - \nNeed to add a good ramen with all the fixons to add on and I would stop going to Japan to eat", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2014-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "ASznE0w8Gy29BPulgJ3cWA", "review_id": "mc9sfR7tfZ6M4E84yzIlOA", "text": "Food is still good, but coming off the regular rotation list after tonight.  Was on the bubble with difficult parking and table waits, but tonight was ridiculous.  3 tables that came in after us had their dinners before us, with no explanation.  Table for 2 by the window, came in after us, finished eating and left before our appetizer came.  A shame.  What a way to lose business.  There are other places to go.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 2, "date": "2014-08-09", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "JNRLfJxJ6Nbabc-tNRlLpw", "review_id": "kgS8L33At4fLRvUZkQHqlg", "text": "I love this restaurant's low-key, cool vibe and ambience. Beyond my favorite dish, the Udon Suki, they offer an airy chocolate ganache cake that can't even be described, it's THAT outrageously good. Definitely a Phoenix favorite!", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2015-07-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "WWL9RqOoFZNg9XtH5nclqQ", "review_id": "H1si9WD352Bws-CvL03Qrg", "text": "Love real Italian food, and this was excellent.  4 courses: spinach soup, Caprese Salad, Chicken Saltimbuca, Tiramisu.   White tablecloths, excellent service, sparkling clean restroom.  If we lived in Phoenix, this would be a regular stop.", "business_id": "3CSaqRNvYg7ZdN2zwxwzVw", "stars": 5, "date": "2013-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eMFD4FA8NVAlUAeBl4EVNw", "review_id": "tsw_0e1knb8Y4MFAdt36eA", "text": "I love this place! Great pizza at a great price! This place is clean and for the price can't be beat! Is this place Pizza Blanco? No, but for the location, price and value...well...Delicious!", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 5, "date": "2009-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zuoeE7GdXXlCgr995ImWfQ", "review_id": "XPu3WLsoJ93i0-hL6KwyuA", "text": "Pizza Heaven is the perfect lunch spot. It is such a good deal and very tasty pizza. For around $5 you get a slice of pizza, salad, and drink - and for a small up charge you can get any toppings you want on your single slice. Most places in the area charge way more for pizza of this quality and you can't order just a single slice the way you like it. I'm a fan!", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 4, "date": "2013-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I6LUBiAYZeK7Yn2aU0-2WQ", "review_id": "vXwvY4SbXZ2ZVb_t9uRjeg", "text": "We usually get pizza delivery, but tonight decided to dine-in at Pizza Heaven Bistro.  We were pleasantly surprised to have live music during our visit as well as an extremely attentive waiter.  Service was very quick and the owner even stopped by our table twice to see how we were doing.  The pizza was excellent as always, and my husband liked the wings so much that he ate the whole plateful by himself.  We finished off with the brownie ala mode, which was devoured in a short time.  Overall, the quick service, excellent staff, great food and affordable prices will bring us back again!", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 5, "date": "2015-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qAhm3detB4S8rXVK7wVLMg", "review_id": "gAqa0l6WFN7r9zUGv_y3vw", "text": "We went here to have dinner with another couple that bought a groupon. The food and the service was very good. We will be going back.", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 5, "date": "2015-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "A7v8TX0r0OziLD5u8p6wgQ", "review_id": "UhcbxccVJSPpLVDyDpfwMw", "text": "A coworker took me here and I can't get enough. Whenever I am in the vicinity I make my way over for the Italian beef with sweet and hot peppers. This italian beef is juicy on a big soaking piece of Italian bread...mmmmmm. You can also buy it by the pound for party events.", "business_id": "Tk2dSL0TwQeI_zNJmb442A", "stars": 5, "date": "2008-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MHTZuj8I_obO_5Y9C9Zv8g", "review_id": "MhReeI9PLLs1VN8iBufxvA", "text": "Be prepared to sleep...to sleep deep...and sleep well...and hard.", "business_id": "Tk2dSL0TwQeI_zNJmb442A", "stars": 5, "date": "2014-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TnxCxqjHBlZ3DCoBRGQlJQ", "review_id": "RR8ovbHuv-pEYnu0lOcYeg", "text": "This place is going to be added to my rotation of places to eat! It is a little mom and pop deli full of fresh meat and ingredients! I had both the Italian sub and the meatball sub! The Italian was great! However, the meatball was my favorite!! It extremely tender and the sauce was quite flavorful! \n\n    The other thing that made me love this place were the employees!! They want you to have a great experience and it is important to them. I appreciate that! Pepe is amazing and I will continue to come back not only because of the food but because of her service!!\n\n\nPS- It is BYOB! Well, it's beer or wine. (No fee) \n\nPSS- The setting is extremely casual. Plastic tables with table clothes....but who goes to a deli for ambiance anyway?", "business_id": "T5HYqRADhAL6VPRAacz74Q", "stars": 5, "date": "2013-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5MljrQH3qvVf-rcGILNUYA", "review_id": "OqeUjdpxueGkDSO2Eltuxw", "text": "First time eating here and they were very busy. The service was good not fast and not slow. Really good flavorful pizza not a bad price", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 4, "date": "2011-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gvCo9BMo6uJVb0wzthSTIQ", "review_id": "VDUXBNHWtK8KXBy3PgN4mA", "text": "Food was really good, really nice atmosphere and the staff is great.  We'll definitely be back.", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 5, "date": "2014-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "gq_G5VCDziyEV2-bzGuqzw", "review_id": "Ytla7-Gaai9_qvF-JHlopQ", "text": "Oh this place is wonderful. I feel this way because I am an awful cook but I love eating at home. That said, I am notorious for bringing food home and dishing it out on plates and having a go at it like that.\n\nWell, this is like that, only it's someone else's kitchen. Nothing impressive at all, it's even mildly questionable at times, but the food is so darn good. Bringing the wine and cracking it open, sitting in the plastic bistro chairs, flip flops and a tshirt... eating 4 star italian food. It's really awesome. I've ended a relationship here, and it was the most comfortable public breakup I've ever experienced. Try the gnocchi.", "business_id": "VpW40mznMS43CqdbelX2wA", "stars": 4, "date": "2007-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "CWYHXKPXqP4KgY3TyI54lg", "review_id": "RiA4Oc4rWeL15H0x-ji5FA", "text": "Thanks for the great dinner Rich.\n\nI've eaten at this location dating back nearly 20 years.\nRich took over in 2002 and it only got better.\n\nNow they have beer / wine and a credit card machine!\n\nGreat Rapini tonight.\n\nTj", "business_id": "VpW40mznMS43CqdbelX2wA", "stars": 5, "date": "2010-07-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "ehtcnF3Ebvq23p107LcsuA", "review_id": "0_xJKEWRtJLTcfzR6dHBRQ", "text": "Luca swims wit da marinara...............Hey! Buono! Moto Buono!\nYou have got to get into the Lincoln or Cadi and get over to G's on 28th.  This is the kinda place you find in New York (yes Irene I have been And lived there so fughedaboudid!!!).  Its real small, the people are very kind but curt and will tell you what to do and you will not sit at a table for 4 if you are only a 2 top.  Ok?! Now lets get started.  If you get there when it is not busy you are told to pick your table (remember the rule wise guy!). We declined wine/cocktail or beer, since we (lil ms. longlegs n I) were going to the movies after eating and we did not want to get the tireds n slows.  So we ordered water and ice tea which came in plastic cups (this was why I gave it only 4 stars).  Lil Ms. Longlegs ordered the bruschetta for her main meal (you get to choose which ones you want) I ordered the Eggplant Parmigiana with the homemade pasta.  We thought the bruschetta was adequate (bread was not overly impressive) but the Eggplant was divine.  Sliced thin and very lightly breaded with thin sliced mozzarella and the sauce was very good (a little tame for me but still excellent).  We both thought that for the food and ambiance their pricing was a little on the high side.  We will go back and try some of their other dishes.  This place was on Food Channel which we figured it would be an \"11\" on a scale of 1 to 10.  I give it a 8.2, Ms. L.L. gave it a 9.  Ciao Piasanos.", "business_id": "VpW40mznMS43CqdbelX2wA", "stars": 4, "date": "2012-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "T-C764Lgj4bc4m002vpO7g", "review_id": "WQkIpUd0ci8YFuj8YSy6Dw", "text": "Dined here Monday night.  Great authentic homemade food!  We all loved the salad and our entrees.  DEFINIITELY get the Butternut Squash Ravioli's...do die for.\n\nGreat find and looking forward to going back the next time I'm in town!", "business_id": "VpW40mznMS43CqdbelX2wA", "stars": 5, "date": "2015-06-10", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "El2b3KmAkFpa6Opyq3qTKQ", "review_id": "bpKYIXNy7zkZcQT3obxqyg", "text": "This is one of my favorite restaurants. From top to bottom this is a class restaurant. The owner is very personable and cares about your experience.", "business_id": "PAtgWCLCFRQd_fjnihISOg", "stars": 5, "date": "2014-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "37tloD0P1i7hJaJzEYw15w", "review_id": "srfNyjC9GS5w5prhE-Y87w", "text": "My new favorite restaurant in AZ. This is the kind of place I have been looking for since I moved here. Real authentic Italian food finally!", "business_id": "vvA3fbps4F9nGlAEYKk_sA", "stars": 5, "date": "2014-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 2}, "user_id": "0BBO-d1_Dr16Tc55x--ejA", "review_id": "EWuUG7FiCMNY2cd8RkF6xQ", "text": "Visiting Postino Wine Cafe makes me feel like I am in another city... an urban, metro, pedestrian city such as San Francisco. Its casual, yet sophisticated and quite enjoyable. I recently visited Postino with two friends and had the Bruschetta -- we selected the Fresh Mozzarella with Tomato and Basil, the Smoked Salmon and the Roasted Peppers with Goat Cheese. Thumbs up on all of these yummy appetizers! The clientele is a hip, diverse crowd reflective of its gentrified, charming neighborhood of mid-century ranch homes, and yet just a hop from the Biltmore and Arcadia neighborhoods. Ah... Phoenix is growing up! Wish I knew more about wines to tell you more about that. It appeared to be a nice selection and there were bottles you can buy to take home as well. Parking is a challenge, however I will definitely be back.\nhttp://www.postinowinecafe.com/\n\nUpdate: Postino's is one of many restaurants/bars in AZ that permits concealed weapons without permits and is noted on the Arizona State Rifle and Pistol Association in their CCW Cafe page: http://www.asrpa.com/ccwcafe.html For that reason I am reducing the previously 5-star rating to 1-star.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 1, "date": "2006-07-01", "type": "review"}
