{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "7DeM4C66zVflYNrZn_Vv9g", "review_id": "eMOsKMzq-_teUnZoTw9_kw", "text": "This is one of the few restaurants I frequent in the Waterfront. Why would you come to Mitchell's if not for the fish/seafood? You probably wouldn't. But you can swim in the Great Lakes beer on tap here and have some nice oysters while enjoying river view. Not many places in Pittsburgh offer these types of views while dining (and that's a Pittsburgh mystery to me). The restaurant is never to crowded and you won't get packed in like sardines in a tin can. So you can enjoy a fairly romantic dinner with your loved one(s).  \nThe food is very good but you may have to shell out a few clams of your own ($$$). If you have deep ocean like pockets put your hook into the  sea bass which is always moist and scrumptious at around $29.99. They will cook your food one of several ways. I like my fish broiled, their signature is too salty for my liking. Bread is mmmgood and hot (free). Staff is very  accommodating ie you can request to sample a soup and the servers are pleased to do so. I recommend you try their soups like the seafood gumbo. A bowl of this creamy delight goes a long way...bonus they toss in those little hexagonal oyster crackers as  reminds me of my youth on Long Island's south shore (but that's another story). Salads a bit skimpy and somewhat pricey (approx. $7.95 for basic house salad). Bottom line is Mitchell's at the Waterfront is well worth taking the splash for if you really like a nice seafood dinner.", "business_id": "usSROUMiAgPcxV3Ym0OxMQ", "stars": 4, "date": "2009-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qx9OJp-rAZ_MZz3sYgnZdQ", "review_id": "jgLhwIrxnWgp1teCZNWhgg", "text": "After a long but beautiful day touring Pittsburgh and riding the Duquesne Incline we settled down for a late dinner at Mitchell's fish market.\nWe were seated in a picture perfect spot by the window as requested. Our waiter initially greeted us warmly but the service went south quickly and I trying to wrap my head around - Why?  \nWhat was wrong with the service you wondered. Well.....\n*We had to wait a long time for our drinks \n*appetizers ordered but not received.\n* Requested bread several times waiter was oblivious to the request \n* Dinner took for ever it felt like a century later\n It was good thing we was on vacation so we had time to waste. \nWe observed the other waiters and waitress was busy attending to their patrons. \nOn the plus side the food was divinely delicious!  Salmon, scallops- Super fresh and melted in my mouth.  My husband's dish ordered the Shrimp and Crab Cakes and he hummed  yum to every bite he ate.  Unfortunately service and excellent service should go hand and hand.  If only the head manager who was consistently walking around to various tables talking to patrons would have stop at our table we could have given him the scoop about our lack of service.  On well.", "business_id": "usSROUMiAgPcxV3Ym0OxMQ", "stars": 2, "date": "2015-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "raOFBeWGlAy9nWuMDBn5NA", "review_id": "D2ErgvRyqc6sHM0QP7_xPA", "text": "100 dollars for 2 people.  2 small cups of lukewarm soup, 1 tuna sushimi, 2 waters and 1 seafood pasta, 1 salmon.  It all had no taste!", "business_id": "z4cCguoHdU48pj6sXMIzqg", "stars": 1, "date": "2011-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pLr3bzkR2C27WF3VcsWpXg", "review_id": "jTkUIBVJJUuW8_-laz2N6w", "text": "This a great spot for a Lobster Roll. Yeah the service is going to be a little slow since it seems like it's always busy here. The food and atmosphere is worth the wait.", "business_id": "wHi8ODv7TGmeUB02XoX-mA", "stars": 4, "date": "2011-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oRXvPJ4PkBIevJr-AuNqYA", "review_id": "ftau9PfQHceNrMoUG3tW2w", "text": "Decided to try it for dinner as we were walking around the strip.  Good selection of beers too.\n\nStarted with mussels and they were very good.  Sherry butter sauce w lots of garlic.\n\nWe each had the seafood stew for dinner...tried to get beyond the lobster roll which is their signature dish\n\nStew was full of seafood.  Lobster,  clams, mussels, scallops, shrimp.  Good size portion at reasonable price.\n\nSauce was excellent and had just enough of a spice to have a nice tasting after bite but did not drown out the cream, old bay and sherry.\n\nWe will definitely be back.", "business_id": "wHi8ODv7TGmeUB02XoX-mA", "stars": 5, "date": "2013-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tC62PSePYtPwSKc6Asf7rQ", "review_id": "Y9XAWVmS5xHkIItr2gFDvg", "text": "well all I can say not so good. To start our server very friendly but winey I don't care who didn't show up to prep or that the manager had to take tables.  we ordered two ice teas the lobster roll and the filet sandwich each came with fries and slaw.  Well I went to get sugar out of the sugar caddy to find a blood stained band aid stuffed in it, that should have signaled me to leave, but I didn't. we each got our sandwich the fresh cut fries were so cold and hard they had been sitting for awhile. the filet sandwich was good but my lobster roll was so fishey and the bread was saturated with butter it was dripping. Then halfway through lunching one of the umbrellas from the upper roof top deck blew off into the street. it was almost impossible to pay we had to go inside and hunt down the server, the sink in the ladies room was missing the hot water handle. Overall pretty crappy considering I had this lobster roll about three years ago and it was fantastic", "business_id": "wHi8ODv7TGmeUB02XoX-mA", "stars": 2, "date": "2015-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Co3ydbwnDC8KOtCM2f2BKg", "review_id": "c656oji6CU6bVJiOwOrarw", "text": "It was my Anniversary tonight, a Tuesday. I was so excited to get All You Can Eat Crab  Legs!!! My favorite food of all time!!! But when we arrived at 8:20pm, the very unfriendly waitress said that their kitchen was closed!!!!! BOOOOOOOOOO!!!! Their website, as well as Yelp, states that they are open until 10pm!!! We would've been long gone by then! Very disappointing. Well, we ended up driving a lot farther than we intended, but had a wonderful dinner at Joe's Crab Shack in Station Square. I got my LEGS!!!! And they had $2 Hurricanes to boot!!! Ended up eating a better meal, with cheaper drinks, and we ended up tipping our waiter 30% because he was awesome!!!! Should've just gone there in the first place! I will know better from now on!!!", "business_id": "41CXLCeB8z2oNdIOvnrzIA", "stars": 1, "date": "2014-07-08", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "mXJS_e-zR68eExLhMrxJPA", "review_id": "qhNG8imu8b17JzHecPDRrA", "text": "A Pittsburgh landmark . The service was very good . Local Pittsburghers are the staff so you get the Yinzer attitude , which I love . No BS. The food was good . Try the clam strips , crab balls , and oystetr shooters. The old pictures of celebrities on the wall and old school feel make this worth it.", "business_id": "-KQ283hJkBO12u8XOrlCcQ", "stars": 4, "date": "2010-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Yg6M7mtMTJTgtCpMDcy8cQ", "review_id": "idV-jJCphHmt1HmM4dxnvw", "text": "Awesome food and service.  Family owned homemade itAlian food. They way it's suppose to be. Will go again when I'm in Pittsburgh", "business_id": "YTqSkgOiiI9HG3hNH7ovfg", "stars": 4, "date": "2012-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cSNp8J0qBoODucIUJqceMQ", "review_id": "apB7hDhCWPewGfIDJpmqDw", "text": "Closed down", "business_id": "U_RvpPJNn24oWJo07x2j7w", "stars": 3, "date": "2011-07-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "eHygmz5QgYGdjXYKp2axig", "review_id": "8zaHopRsa5C4D0yl5ZkfTQ", "text": "I'll be honest- we only ate here because we were given a $100 gift card. This made a ridiculously expensive restaurant cost about as much as it would cost us on an average night out. We skipped drinks and dessert (we were really too full of other stuff anyway!) and our bill still came to $114 before tip. I was surprised that the dress code was so casual for such a nice place; my husband and I dressed up (hey, it's not every day that we eat so fancy!) but we saw folks there in shorts and flip flops, too.\n\nWe started with the delicious bread, and calamari. The calamari was spicy, and it would have been better with some sort of dipping sauce, but I guess that isn't classy enough for the Capital Grille! I just squeezed lemon juice all over my plate and it was delicious.\n\nI ordered the citrus-glazed salmon for my entree, with a spinach salad and warm bacon dressing on the side. The salmon was a very generous portion that was very well done. I'm very picky when it comes to salmon and I found this to be fresh and delicious. The salmon also came resting on a generous bed of asparagus, onions, etc. which was an unexpected surprise as we'd been told that all sides were a la carte. I definitely could have skipped the spinach salad, just because I already had so much food and we were staying in a hotel without a mini fridge. But the salad itself was delicious- more of a dinner portion than a side, actually.\n\nMy husband ordered the steak and lobster. At $49 it was one of the more expensive entrees on the menu, yet is was a LOT smaller than my salmon (which was $33). He was disappointed at the size for that price, actually. But it still managed to be large enough that he couldn't finish it, with the bread and calamari he'd already eaten. The steak and lobster were both delicious, though.\n\nThe service was impeccable. Our server, Denise, was friendly and attentive and very knowledgeable. I would highly recommend the Capital Grille for anyone looking for a nice steak or seafood dinner.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 4, "date": "2012-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "uefUy8bio3gxYZIHvQHgxg", "review_id": "0K8QXmWnQYktlYBVti7Nqw", "text": "Once again, Capital Grille is leaps and bounds better than any other fine dining restaurant in Charlotte, NC.  \n\nI absolutely love this restaurant!  Service is spot on, and the food prepared perfectly.  \n\nScott was our waiter and he is outstanding.  Great sense of humor, all the while very knowledgable of the menu.  \n\nMy friends and I came to Charlotte to celebrate our friend's 50th birthday.  We started our evening at a lovely table outside with cocktails.  The pineapple infused martini is heavenly.  The Arnold Palmer cocktail was nice, but I probably will not chose that cocktail on my next visit.  The birthday girl had a tasty Bohemian.   \n\nThe three of us shared a mouth watering ribeye and a side order of lobster macaroni.  I hear this particular side dish is very popular.  We each had a chopped salad.  The salad was a mixture of amazing flavor, but portion of salad a bit large.  None of us finished our salads.\n\nWe polished off our pleasant dining experience with a glass of cognac.  Heavenly!  Then our waiter Scott surprised the table with a delicious cheesecake and a slice of chocolate heaven on a dessert plate!  Scott was great and our celebration was perfect for our friend.  \n\nThe road noise was a bit bothersome, but Charlotte is a happening city and I would dine outside again in a skinny minute.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2014-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "p8gGCMffwUTj-QjQBmhkbg", "review_id": "YBZv8MSA_a1zoe1dG7O4ZQ", "text": "We went for an early dinner, 3pm, and the restaurant was not busy. Our wait staff was professional and courteous, but the food was nothing to brag about and hardly worth the $300 tab (no wine or alcohol).\nThere were five in our party and three of our steaks were not done as we asked. Mine was cooked to the right color (pink center) but it was not hot! I mean, this is a steakhouse, you should NEVER have to send your steak back...\nThe grilled asparagus was excellent as were the garlic mashed potatoes. But that is not what you go to a steakhouse for. We will not be returning.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 2, "date": "2015-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "8KdDd_6boBq9ilWttvxv8Q", "review_id": "umVtda79Z69C9kxYkYU7xA", "text": "been there 2 times.  it is way overpriced and the service is average.  capital grille is much better.  mortons is better. not a big fan.", "business_id": "1gKBusJMk66ypwEKF0vOAA", "stars": 1, "date": "2011-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yns1q1xh5CuQbkHoA2HkuA", "review_id": "rRP7MYzkCPr1RnY8o-fzSQ", "text": "The Palm gets by on a reputation they built. They know how to market to make everything appear so appealing. WAY overpriced and not worth the trip! NOISY, NOISY BAR!! If you want a great steakhouse, go to Ruth's Chris. And manager Joey was a major turncoat despite all of our business because of a complaint we had against someone he clearly thought was more important. We're NOT EVER going back!", "business_id": "1gKBusJMk66ypwEKF0vOAA", "stars": 1, "date": "2015-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B-VN7O5UjCNmu5xkqU1UCA", "review_id": "6BIdArRjOnxWFQyl_MymOw", "text": "To be fair, I generally stay as far away from swanky Southpark as possible except for an occasional trip to Earthfare. However restaurant week and the meat-eater's friend being a chef at Upstream led us to visit this week. We showed up around 7:30 during restaurant week, expecting a bit of a wait. The hostess was very pleasant and offered seating outside on the patio right away or suggested a drink in the bar while we waited. We chose the bar. \n\nThis seems to be more of an older 50+ crowd with a few exceptions. Mostly business casual attire but I didn't feel out of place in dressed up jeans. The décor is traditional Southpark - dark woods and colors. \n\nThe bartender greeted us promptly, presented the wine list and gave us a few minutes to decide. They have an extensive (and pricey) wine list and a handful of specialty cocktails and martinis. Drinks were served and that was the extent of our bartender interaction. He seemed to get in the weeds a bit with all the server orders coming in. Not a big issue as we didn't really need anything else but could be a problem if we were trying to order at the bar.  \n\nOur wait was as promised - approximately thirty minutes. The dining room is a bit smaller than I anticipated but nicely laid out. You have a glimpse at the open kitchen but not enough to gawk during your whole meal and enough privacy at the tables and booths that you don't hear your neighbors' conversations. Our server greeted us, got our new drink order and came back to discuss the special. I must admit, I enjoyed freaking him out by dropping the \"I'm a vegan\" on him. I doubt this is a normal request at Upstream and I wouldn't dream of showing up without advance warning (which we'd done via the friend).  He consulted with the kitchen and came back looking much more relaxed and surprised with how easy it would be to accommodate me. I had the Shaved Athena Melon salad sans ham, tomato risotto sans cheese and a lovely sorbet sampler with warmed peaches. The sorbet, while really good, isn't made in house. Meat-eater had the Smoked Cod Cake and Lobster cakes, Snake River Ranch Wagyu Flank Steak and French Macaroons. He's still talking about the cod and lobster cakes and how good they were.  I really enjoyed all my courses. The salad did need a little \"oomph\" to make up for the lack of salty ham but overall very happy with our meals. \n\nI was impressed with the service. Our plates were removed quickly, our server was present in the dining room but not in the way, courses were served promptly and glasses kept full. \n\nUpstream isn't my normal type of preferred dining or cuisine but I appreciate any place that has excellent service and chefs that know their food and are willing to make accommodations in a gracious manner for special diets.  I know Upstream is part of the Harper's Group but I thought it had enough personality to not be classified \"just another corporate place\".", "business_id": "BOp3jcpYy31M85H1DLnEEw", "stars": 4, "date": "2012-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5W_Dv1E2loDsoXFpi-pqcQ", "review_id": "a14-CKEdqDKQ9FFqCqnlSg", "text": "Yum - I love Louisianne's. A bit fancy for every day, but the food is fantastic, the atmosphere in the restaurant is great and the service has always been good. Very delicious! I can't wait to go back!", "business_id": "koRLvzIl-4fCybOIdk56jA", "stars": 5, "date": "2007-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z_OGLIb5EVhw2OYy1_MP7Q", "review_id": "DaQiwMjj38vlW0TV96BPkw", "text": "My boyfriend and I discuss food often and he talked about his place with reverence always.  Well OMG.. it REALLY is special.  A simple chicken poboy made right..  Dipping it into certain soups of the day (curry chicken and creole cheeseburger were my favorites).  We call them dipping sauces (lol) and have even gone so far as to plan a trip to Madison based on the soups that day.  And their etouffe labelled \"too hot to eat\" actually lives up to its name while still retaining seriously good flavor is another rare find indeed.", "business_id": "cpGv6ES2hzPCtCUQgipwXw", "stars": 5, "date": "2010-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qeVLQCePbacAwFL9mBaRbQ", "review_id": "1s3pQu-W0enn7KUr_cOmpA", "text": "This is our neighborhood spot for ceviche... though if you want oysters go to the spot at McDowell and 18th St... no idea what the name is.", "business_id": "VKxn7zmp8nOYT-ZHFZTjgA", "stars": 4, "date": "2012-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sZRfDzXnDCydlJoFSMuheA", "review_id": "q_QGjB6a6BIqOZGazHY6JA", "text": "The food was amazing and the staff was very friendly. Best place to seafood in Arizona.", "business_id": "NYBx4sdSVrN-I5Q8RfLMPg", "stars": 5, "date": "2015-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DnwHp_A92KvllfaUIdFraw", "review_id": "Ix6YhCe7DQoW-PtrsvDa6A", "text": "Great small and authentic place!  Yeah, as others have said, maybe not the \"best\" neighborhood, but we had no issues.  The place is small, so plan to wait if you come in the busy time.  QUALITY food for sure and mainly seafood based but thankfully for me they have non-seafood items for folks like me who don't care for seafood.\nEveryone at the table loved what we got and would certainly come back again!", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 4, "date": "2013-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "VU6hdnlMeWZ7zBo3N3A-dw", "review_id": "fusKrQg3zXKzsc9I9w6r_g", "text": "Absolutely fabulous!  Why do so many people fixate on the location?  The food was super delicious, Mexican + seafood, where could things go wrong.", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 5, "date": "2014-07-26", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "kNO6w6EIKo8u6GSykOHBLA", "review_id": "dX2Fq0mjOpFeiD7KWuHDqA", "text": "I very rarely give a restaurant 5 stars, much less a Mexican restaurant since I do not like Mexican food.  This place really does deserve all 5 stars.  I ordered the al pastor tacos with rice and beans.  I asked for them to hold the beans.  I loved the rice!  Very different than expected.  The order came with 3 al pastor tacos.  The place was only $8.99!  Perfect!  They also gave us a ceviche tostada before our meal.  Yum!", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 5, "date": "2015-08-13", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "dCQEpt2Xy4MVvxnJk7wHaQ", "review_id": "EvcAhN35PXSuFXhCqjjtfw", "text": "Looking for a new spot down town try this place service was excellent food if possible even better I am a former catering chef and my wife is a personal chef so when we go out we are very picky and critical but we honestly have not one comp lainteverything from the time you enter the place until you leave is on point no wonder they've been around for 28 years  our waiter was Scott and very pleasant and a real pro the wine list is great and with a happy hour daily you can't go wrong strongly recommend that you try this spot asap", "business_id": "3CSaqRNvYg7ZdN2zwxwzVw", "stars": 5, "date": "2014-07-17", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "HOleI3jz1MLNUJ6cc1x0Pw", "review_id": "HJiTRv9Z-0s_JBukP5xr8g", "text": "This place definitely has some downsides (food that isn't exactly innovative, less-than-inspiring atmosphere), but it definitely has a lot of good things going for it too. The service is attentive, the grilled fish is fresh and very flavorful, the oysters are awesome (and we all know good oysters are hard to come by in the desert) and only cost $.95 during seafood happy hour (weeknights and weekend days), and the prices are very reasonable given the quality of the fish. \n\nMy sister and went here for lunch this past weekend. I had four Miyagi oysters (which, again, were only $.95 because it was noon on Saturday) that were perfectly briny and super-fresh. She had the side salad, which she said was good, although the house dressing had a bit of a funky taste. We both had the rainbow trout and the basil cherry tomatoes and rice for side dishes. The fish itself was so flavorful and not too greasy, although she did report that her portion had a lot of really small bones, and the rice side dish was good. I would recommend avoiding the basil tomatoes, though - even though the tomatoes themselves were fresh, they were absolutely covered in black pepper, which made them inedible. Our server was nice and kept the drink refills coming. For $40 including tip, we had two appetizers, two entrees, and a soda and left very satisfied. If you are looking for innovation or trendy atmosphere, you probably want to go elsewhere, but if you want good-quality seafood and reasonable prices, you will really enjoy the Fish Market.", "business_id": "SOHp2b8quJEitFeuO58Syw", "stars": 4, "date": "2008-07-13", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "h7v_M_0-YVpSVZ2WD7FpAA", "review_id": "c9GaeSCZ9rzFCX2vma7oIw", "text": "Based on special WIne Tasting event @ Bar.  {Otherwise i could NEVER see how i could/would dine here - case in point: initially seated in dinning room. Took quite a while to have our (very snotty & uppity) server apporach us.  We inidicated we were doing their special event, and OMG did he ever show he did NOT want any part of THAT with US}\n\nWe (ThankFully) asked to be moved to lounge area which only had 2 other tables being served.  (I just KNEW we would have had a more than terrible  time with Mr. Crabby Pants had we stayed in his section).\n\nWe were promptly moved, seated & served in very quick succession.  Turned out BEST decsion.  We were given professional & informative tastings of wines from Napa & South Africa.  \n\nAlthough this was a fun, different and good little event, and we really enjoyed it, it was NO where near as great an experience that we had at the CG in North Scottsdale 2 weeks earlier, ie: NITE and DAY difference.  (pours were half the size, and they were extremely hesitant, if at all, to give another taste of 1 which u may have liked....\n\nI WOULD go back to N. Scottsdale for a Wine & Dine but i would never suggest getting a \"10\" on the Snob-O-Factor here.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 4, "date": "2009-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hQJPPTEy_iamIVF7nfoFGQ", "review_id": "p8ilP6wzoNwp56TL3VUvbA", "text": "I love the Capital Grille, I love the Dining after Dark special offered by Capital Grille in the sumertime even more. The deals offered if you eat after eight at night any night of the week during the summer are mind boggling. The food is excellent, the service is even better. The Capital Grille's server named Sergio delivers a first class expierence to a tee. I would highly recomend requesting him if you decide to eat here for a special occasion.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 5, "date": "2013-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_Rdh3_nXAczlPBNc4aUw6w", "review_id": "91e9Ke5r4dhqwKmutK__eg", "text": "I had already wrote a review for the Grill in North Scottsdale, but this was my first time at the Biltmore location.\n\nIt is safe to assume that everything was an exemplary five star experience.\n\nWas with a group, so we all ordered the signature Stoli Doli martini which was shaken so well that there was slight frost crystals floating on the top.  Great balance of Stoli and pineapple.  We all loved them!\n\nBread basket came out with pumpernickel and raisin, cheese onion and of course the lavash.  \n\nWe all shared so the lamb medium rare excellent as well as the tuna served with 4 different sauces.  Perfect rare sear with the sauces some being spicy, one being soy and two others that unfortunately I didn't get to try do to my compatriots pounding the tune :)\n\nNow of course one has to have the dessert.  So three were ordered-  first the flour less chocolate cake, always so phenomenal, especially if you like dark chocolate that isn't over sweetened.  The second dessert was the coconut cream pie that was remarkably good and lastly the cheesecake with berry side.\n\nInstead of describing them in detail its sufficient to say less  than three minutes not one damn crumb remained of anything.\n\nService was A+ and made sure we were well taken care of.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 5, "date": "2015-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9ebaAGLVIgGKpDLFwmvaiQ", "review_id": "uIbrzGy37_7fIrpRTOmzMw", "text": "My hubby has been begging me to go here with him for a couple of years now. We finally went last night. Nice hole in the wall spacious fried fish joint. Prices are okay. I went with the Large fried shrimp and chips, side of coleslaw (which is huge) and hubby went with fish and chips and hush puppies. The whole meal cost about $20 including a drink. It was okay.  a little under seasoned if you ask me. Will I be returning?  not quite sure. Maybe try the clam strips next time. Wasn't impressed and might even give it less than 3 stars. I was being a Little generous.", "business_id": "YxMnfznT3eYya0YV37tE8w", "stars": 3, "date": "2011-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UP-6BgAMIl68KVdeHS2Nyg", "review_id": "1DEXjWg0MllHl0wy40kDNQ", "text": "I agree. It looks like a dive from the outside. But at least it also looks like a dive from the inside too. We shared a fish and shrimp and chips along with fried okra and clam chowder. Everything was 'meh'. No real seasoning to the okra breading. Probably frozen bagged chips and my wife refused to eat more than a few spoons of the soup. She did really like the fish though. That was the slightly redeeming factor.", "business_id": "YxMnfznT3eYya0YV37tE8w", "stars": 2, "date": "2015-06-13", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "vb33gUcOIIuYxp-U232jvQ", "review_id": "WL9zewgqb0Nqj9A_tJAmNA", "text": "Excellent quality, great prices and large portions!  All of the staff is very friendly and outgoing.  Definitely one of our favorite sushi restaurants in the valley.  A great spot for lunch.  The Sakana lunch is a great value (sub the California roll for spicy tuna for $1).", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 5, "date": "2009-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Cv0OOVZ4BliYMYlw71KXjg", "review_id": "qNFmVw0HupbZA1FIyLJ4Rw", "text": "This location is so worth the trip!\nThe fish is the freshest I have ever had. \nService was 5 stars and quite frankly the attention to detail is excellent.\nGreat value for the dollar.", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 5, "date": "2012-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VOeVPZUbk-Nzk-Nng7qcYw", "review_id": "aBlgx_QYGTqz8gJq8Yxt2A", "text": "I've been to this place many of times. The atmosphere is old and run down, the service is slow, coming from a server myself, and it takes forever for them to run credit cards. I have been over charged multiple times! The food though it always good! Save your money on alcohol though they can't makes drinks at all here. Stick to the beer.", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 2, "date": "2014-07-22", "type": "review"}
{"votes": {"funny": 2, "useful": 10, "cool": 9}, "user_id": "nc3cqVN0UuB3m50-CcMftw", "review_id": "eFV6Dovl1CL3d6Ef0oqZvA", "text": "When Hoa called and said we were having a reunion of former branch employees at a Chinese buffet, I wasn't at all apprehensive. My normal concerns with such eateries--will the food be maintained at a proper food-safe temperature, is this seafood fresh, how long has the sushi been sitting out, will I be able to make it home before my intestines rupture--dissipated because Hoa knows good Asian cuisine. She is, of course, born to Vietnam and world traveled. \n\nLet's start with my happiest aspect about HKGB: the sushi. No, it's not the best sushi in the Valley, but they make it fresh for you on site. You can stand there and watch it being make, grab a soup or something else to munch on, or just sit at your table and chat awhile. Afterwards, you can head back for more sushi or veer over to the more traditional offerings of a Chinese buffet: sweet and sour chicken, fried rice, crab legs. \n\nNow let's review the not-so-shiny aspect: the price. Yes, it seems a little steep that we paid about $25 per person with tip (and I made only two rounds) but when you factor in the 2 hours we spent there, grazing, catching up, grazing, passing Lisette's daughter around, grazing and making plans to keep in touch, it's really not such an outrageous amount to pay. \n\nIf you find yourself in this part of town, craving Chinese and are wicked crazy hungry, give HKGB a shot.", "business_id": "-Ogv7rpcgUHkFaSy3vD8Sw", "stars": 5, "date": "2009-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mffG4GRv7murB8iPbndNqQ", "review_id": "F6ZjpzvscJZLreQuafSW7Q", "text": "Great variety of food but mediocre. Taste less meet - the Mongolian beef , i didnt like the Cold See Food, steam rice is good. Sushi ok, Mongolian Grill good. 2 persons $26.", "business_id": "-Ogv7rpcgUHkFaSy3vD8Sw", "stars": 2, "date": "2014-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "snBHXvENp0MNfw4wuEbtIg", "review_id": "yu5NmpndtdmSpd0CJLGcEA", "text": "We went to Roy's for a special occasion dinner and started at their Aloha Hour. For $5 each, we got lobster pot stickers (3), Beef Skewers (3 single bites) with Kimchee Cucumber Salad. I had the 1988 with Grapefruit juice, pomegranate and lychee...YUM. My husband had a Mai Tai and wasn't overly thrilled with it. It was all yellow and not overly tasty (just pineappley). We each ordered a glass of wine to take with us for dinner ($5 vs. $15 on the dinner menu...getting it there was much more cost-effective). \n\nThe staff was very friendly. They surprisingly got very busy all at once, so there were some delays in service but we were in no rush so didn't mind. The seafood was very tasty. Portions are on the small side though. One item in my seafood sampler was not as it should have been (stuffed shrimp arrived empty!). The waiter asked the chef about it and tried to convince me it was really there but just on the outside which was irritating because it clearly wasn't. So, the chef gave me a blob of stuffing on the side. A little odd, but at least some effort was made to make it right. \n\nThe Chocolate souffle is certainly worth the $10.50 and 20 minute prep time. THE BEST. \n\nIf you want a little tropical getaway, it's a great place to go. Expect it to be a bit pricey (if not doing Aloha Hour) and portion sizes a little small, but the tastes are very large and worth it and they do make special occasions special!", "business_id": "corPOxxIBRJ7DSpryYvorw", "stars": 4, "date": "2010-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "egTrW0fPFIemJB4gZlMfwA", "review_id": "LnTuAiV_DSO2GxFRIv9QKA", "text": "always a great time and great food. Love this place !", "business_id": "corPOxxIBRJ7DSpryYvorw", "stars": 5, "date": "2013-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HQY1Z3cZWegfxHkrvP2RGw", "review_id": "FzvhNk7nwLkR1XN0hzWDlA", "text": "Living in Texas the past five years prevented us from visiting our favorite restaurant, Roy's, where we have happily spent many an Anniversary and/or Birthday.  Now back in Phoenix, we went to the Roy's at the Marriott where we have been before.  The food was very good.  My wife had Salmon and thought it was the best she had ever had.  I had the Ono and it was good, if not a bit overcooked.  The service was way, way below par.  Normally at Roy's you are showered with greetings from everyone as you walk to your table.  This night....crickets.  We sat outside and since our last visit (6 years ago), they have formed a large, informal seating area to augment the dining tables.  So, as we are beginning our meal, about 8 people plopped themselves down - all having just come from the pool.  A few were very loud and instantly, Roy's became a Pub.  They ordered pool-side food and the atmosphere was shattered.  Roy's invited this by setting up this seating area.  We finished our meals and the plates sat on the table for nearly 10 minutes as the wait staff disappeared.  This is 180 degrees different from how Roy's used to be.  I spoke with the manager and reminded him that we were there to celebrate my wife's birthday and that we wanted to move indoors to have our dessert and coffee.  They obliged us and were apologetic.  \nSo, all in all, the food remained good, if not overpriced, but the attention, service and outdoor atmosphere took a big bite out of the experience.  Sadly will think twice about returning.", "business_id": "corPOxxIBRJ7DSpryYvorw", "stars": 2, "date": "2014-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SIGjXC8FCuX8yGPVD2ZH0A", "review_id": "MbwajWhfoHT93TB00T9M8w", "text": "Great food awesome martinis and great service", "business_id": "k-KhKfLPjBxjSHppWoUyOA", "stars": 4, "date": "2014-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sh9uWS2y_RoVJSaDR7b2eA", "review_id": "lY30JxUFzkKlwkL2x8BmCQ", "text": "I went to this location on my birthday with my honey. I really love the food and drinks, it was delicious lobster. I really enjoy my day there.", "business_id": "k8q3ypIoIzchdp3RoRUsJw", "stars": 5, "date": "2014-07-29", "type": "review"}
{"votes": {"funny": 8, "useful": 11, "cool": 7}, "user_id": "8WQubmP7G0NM3IyzyMnCEA", "review_id": "X44F5EUkYnKz1pWTeUlSzA", "text": "After reading all the reviews here about C-Fu Gourmet being the best place for dim sum in the valley, I am really disappointed to be writing my first 1 star review for the area\n\nWas the service rude and uncaring? The answer here is yes.  Especially the way that push-cart servers call out the food which make you feel like you're in a rowdy tourist market full of cheap knock-offs they're trying to get rid of.  \n\nBut all would have been forgiven if only the dim-sum being served was any good.  However the dishes we ordered reflected a sloppy kitchen that was focused solely on putting in minimal effort and taking every possible shortcut on the food. \n\nDishes that made me ashamed to be Chinese (yes, the level that C-Fu dimsum brought it down to was that bad):\n\n-  Fried glutinous rice:  The preserved meat that was supposed to flavor the dish was MIA. We complained to one of the waiters who replied that \"they probably forgot\" (um are you sure it's not cost cutting for those who don't know any better?).  More over, the proper way to cook this classic dish would be like risotto where you're constantly stirring and gradually adding water just a little bit at a time (except of course everything is being done in a wok)...Here the C-Fu kitchen obviously just shoved the whole thing into an electric rice-cooker and try to stir fry the huge sticky mess at the end by adding in gallons of oil.   \n\n-  Glutinous rice with chicken steamed in lotus leaf:  Once again that electric rice cooker in the back of the kitchen must be working real hard cause the dish lacked the aroma that it would have had if it had actually been steamed in lotus leaf.  Just tasted of sloppy topping of minced chicken and last minute wrapping in the lotus leaf.\n\nDishes I was amazed by (and no not in a good way):\n\n-  Deep fried taro dumpling:  Have never quite had it in that simplistic way before where the filling literally was just mashed taro held together by a prodigious amount of oil\n\n-  Steamed bok choy:  How the heck do you get oil into steamed vegetable?  C-Fu managed to accomplish this amazing feat of greasy steamed vegetable...unbelievable\n\nOn a good note, the Siu Mai was decent.  We did keep on ordering more dishes hopping that something good would pop up...but nope that was it,...so if  you must go to C-Fu for dim-sum...just order order a lot of siu mai and be careful of all the other dishes.  Dinner here was much better. 1 star is for dim-sum only.\n\nNext time I have a dim-sum craving, you'll be finding me across the valley at China Chan's (Glendale) where the short & sweet dimsum offering is cooked by a man who doesn't cut corners and it shows.  That's where I'll be sticking to from now on.", "business_id": "z4KFTJQsAdxqMZA7Fx0A9A", "stars": 1, "date": "2007-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "W_R-gVF8OHNrIhtmyhDnyg", "review_id": "NITkhOG-Z4qBsTnyS197sQ", "text": "Have not been here in quite some time, at one time was one of the better places for dim sum and banquets. The food is still good, but went to dim sum a couple weeks ago and the service was terrible. We had 3 tables and the dim sum carts would not go to all the tables. I don't know why they would not want to go to each table and get rid of their items, are ashamed of the food or do they think they are in a race for how fast they can make a lap around the restaurant. There are too many other good dim sum places to go to rather than this one. Don't go here!", "business_id": "z4KFTJQsAdxqMZA7Fx0A9A", "stars": 1, "date": "2013-06-19", "type": "review"}
{"votes": {"funny": 5, "useful": 7, "cool": 6}, "user_id": "0bNXP9quoJEgyVZu9ipGgQ", "review_id": "-jWFgJj7bItXrWPVKx99ug", "text": "Treated aunt to a belated birthday dinner (three other adults and two children dining; I only had a cocktail and two teensy flakes off of the top of a cheddar biscuit.  BE AWARE that EACH biscuit contains 8 grams of fat, 2.5 grams saturated, and a total of 150 calories.  \n\nThey ordered *Berry-Mango daiquiris http://www.yelp.com/biz_photos/red-lobster-chandler-2?select=d3bUfGn-UZ1bEq99wODlTg#d3bUfGn-UZ1bEq99wODlTg and I a *classic mojito. http://www.yelp.com/biz_photos/red-lobster-chandler-2?select=iNV2KvaH87Oqi9k_JefLFA#iNV2KvaH87Oqi9k_JefLFA  I heard that the berry-mango was a balanced mixture of fruit flavors, but the alcohol was hardly-detectable.  The alcohol flavor wasn't missed at all, though.  Everyone who had them \"ooh\"ed and \"ahh\"ed.  I wished a simple mango version was available, but I'm also glad it wasn't, or else I would never have found out that RL, or more specifically the bartender working that shift, served a TERRIFIC mojito!  My first sip disappointed, but once I swirled everything a few times with the straw, the drink actually turned out to be one of the best mojitos I've ever had!  It's a classic version, made with Bacardi Superior rum, muddled mint, pure cane sugar (don't like ones made with simple syrup-- too sweet), freshly-squeezed lime juice, and club soda.\n\nI would never be able to dine here (aversion to farm-raised fish, intolerance/allergy to whitefish, shellfish allergies, and Blue Bunny ice cream choices contain corn syrup), but I wouldn't mind enjoying a mojito while everyone else dines!  :)\n\n*Berry-mango daiquiri = 350 calories\n*Mojito = 190 calories", "business_id": "txCJurIIrE9ZoHu3gZUvnQ", "stars": 3, "date": "2013-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "aeoL948dq7zXoaSRqQLjqw", "review_id": "ha2AdOUAhvO8bAoCMdMLcQ", "text": "This was the first time I've eaten here and the last! My waitress was really great however the food absolutely disgusting! This place makes olive garden look like a 5 star!\nI started with mozzarella sticks. Cheese melted but outside tasted like old grease. The salad was lettuce, carrots and dressing.  I'm not 4. I asked for onion croutons and tomatoes. Then the dinner. Wow, waited an hour for disgusting food! My chicken burnt and was so dry I couldn't chew it, my alfredo noodles cold, pasty and stuck together, my ravioli burnt, hard and impossible to eat without hurting your mouth because they were rock hard!\nI at this point was furious that I waited so long for this. When the manager came she didn't believe me and said she would check my ticket for check in time. Wow! I am not even exaggerating the hour wait. Then she said next time your chicken is hard and cold you need to tell us so we can cover it in more sauce! What! Is she serious! I let her know I tasted it and did tell you.  And sauce won't help this overcooked piece of meat!\nOn top of all of this the water tasted so horrible we had to pay for soda, and the bathrooms (both of them) smelled like sewer with toilets that were clogged and about to overflow. And our table was sticky and dirty! Geez!\nI wish I never went and will stick to my cooking or rigatonis if I'm craving italian that I don't have to cook. I hope you really consider my review before you eat here. Bathrooms and tables are a good sign of not sanitary elsewhere too!\nThats probably why we were both sick before we got home as well. Just from eating the salad and a couple bites. :(", "business_id": "cKxXBvOithS-Ic5KnhEKrg", "stars": 1, "date": "2014-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vUBWg3dXVCDWvbGwWLrpbw", "review_id": "WWPG1ccPww8WyW4sbniDYQ", "text": "The place is pretty comfortable and the prices aren't that bad. It's more a 3.5\n\nI had the bone in rib steak and I ordered it medium. as most of the times in almost every place I go, they overcooked it :(\n\nThe house pinoit noir was decent and in general the food was pretty good for the money.\n\nThe service was friendly but no refills on the water and the waitress never came back to ask if I would like another glass of wine. I would if she asked, but that never happened.\n\nAll in all, a good place to go, not super expensive and ok service.", "business_id": "xMK01ZbVUYLLoyqoeWAIVw", "stars": 3, "date": "2012-07-02", "type": "review"}
