{"votes": {"funny": 3, "useful": 7, "cool": 7}, "user_id": "JbAeIYc89Sk8SWmrBCJs9g", "review_id": "fBQ69-NU9ZyTjjS7Tb5tww", "text": "THANK YOU ROB! i truly appreciated all the help i received from this agent today who was able to removed the extra charges on my bill that the Pasadena Verizon Store on Lake was charging me on my bill for upgrading my phone.   When i went in i was having problems with my Blacberry and had to switch to the Iphone last week. Rob from the Pennsylvania store who i was connected today was able to look at my bill and all the notes and correct the problem immediately. Great Customer Service! He even set up a FOLLOW UP Phone Call with me On July 5th to make sure the credit goes through on my bill...I can't thank him enough!!!!", "business_id": "HZdLhv6COCleJMo7nPl-RA", "stars": 5, "date": "2013-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "heoc96QXrTbecWVw933qhQ", "review_id": "E2gb87_5k4GWtTAwaYbCXw", "text": "This is a pretty decent Arby's, and given the condition of the other fast food restaurants on this stretch of Ohio River, it practically reaches exceptional.  The dining room is clean and nicely modern.  The service is friendly.  I don't think I've ever had a bad experience.", "business_id": "udZJ8YgsHdqtFDQkyPTV1Q", "stars": 4, "date": "2011-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f9LuLzqLMNJJoV3zmu6dBA", "review_id": "rfU2fhwrHj96_WXnipXbNQ", "text": "I decided to try Pino's due to the restaurant week special and boy am I glad that I did! My husband and I made reservations for four on Friday night. We were seated almost immediately on the lovely outdoor patio area. It was a great night to be outside. Although the restuarant is small, the ambiance is wonderful. I could tell thet the guests around me were enjoying themselves as well.\n\nThe table decided to order the 3 course menu for 30$ because of the large amount of options. We each decided on a different entree so that we were able to share and get a good idea of all the restaurant has to offer. I started off with a mixed green salad with grileld pears, walnuts and goat cheese. The pears had a nice smokeyness about them that complimented the sweet vinagarette. For my entree, I chose the Arrabiata with rigatoni. The dish was very good but much more spicy than I had expected. I feel that they should have informed me of this or explained the spice level on the menu. Luckily, I enjoy spicy food but I was unable to finish the entree due to the spice level. It was slightly less spicy when I finished it for lunch the next day. My husband had the veal and risotto which he loved. For dessert, I orderedthe peach mille feuille. The portion size was enormous and the peaches were ripe and tasty. However, the marscapone filling hardly tasted of marscapone. I had the opportunity to try my husband's white chocolate tiramisu and was pleasantly surprised by the light but still rich flavors. Our dinner guests also seemed to enjoy their choices as well. \n\nOverall, I would definitely recommend Pino's for a nice, romantic date night out in Point Breeze. However, I wish they offered the 3 course menu as a regular feature.", "business_id": "ZL6DNzyenFm9Kpz6uADlNg", "stars": 4, "date": "2012-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "V2NHIojfd-JRk5lmvUE1cw", "review_id": "K2oMI6w3kliD-k-xry8FBw", "text": "I will admit I am completely biased towards this place. I grew up eating their pizza. Crust is soft and fluffy, not chewy. The cheese is a little thicker than the average new york style pizza place. The sauce has spice but not too much. At some places you need a little milk or water to cool your tongue. Their one downside is that they're not always consistent. Some days its just started to turn golden brown others its over done.", "business_id": "OcTG-KzDleuRub-pb6JS3Q", "stars": 4, "date": "2010-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "cMlY-nsvj9DCrv_lLVp5Fg", "review_id": "GPfEXKWr7c8ECaH5WXbQyg", "text": "I volunteer as a dog coach twice a week and i am absolutely in love with the ARL. There are two beautiful babies, whom I have walked for weeks, that I wanna mention (these ladies would be mine if I didn't already have a grumpy Basset and an elderly Shiz zhu @ home):\n\nBunny (my girl!! Bunny ears, and the sweetest temperament):\n\nhttp://www.animalrescue.org/available-pets\n\nHoney (I love her to death, 6 years old, just wants to be loved!!):\n\nhttp://www.animalrescue.org/available-pets\n\nStop by the ARL! It is worth the trip. :)", "business_id": "VkFDer80GOrelWALdgNReg", "stars": 5, "date": "2011-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "G_BvSxt71MqF_x4jgEyqSA", "review_id": "q6G2kS7EH8Z-catuWAqSBw", "text": "I would never have found this place if it wasn't for yelp.  It is somewhat hidden among lots of houses and residential buildings.  I ordered a latte and blueberry scone, both were great!  I wanted to order food but I was told that they do not serve food (even breakfast) until 11 a.m.  I would go back if i am in the area.", "business_id": "83_p9vIqOq1TUIf3_GD7bA", "stars": 5, "date": "2010-08-02", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 3}, "user_id": "KOrggEZ4aa7JzVIuY-Zgkw", "review_id": "Ek5wR0YDZaAzeA5FoMwnkA", "text": "I'm a gym guy. I go 3 or 4 times a week among other workouts and activities. \n\nPros\nAlways towels\nVery clean\nAlways cardio equipment open\nPools/hot tub\nLots of lockers\nFriendly staff\nLots of classes\nLots of free wights\nNext to target and trader joes\nEven during peek hours it's never over crowded\n\nCons\nWhen the old lady's come in they take up all the parking spots some how. But that's not the gyms fault\nOnly one flat bench press\nSince they have pools and kids activities some times kids wonder into the wight areas\n\nSo in the end more pros then cons.\nThis is more just nit picking but as all gyms have them. There are a few weirdos who are members and just take up space more then workout but oh well what can ya do about it.", "business_id": "1xRLO1NM8-3soskp2fEgyw", "stars": 4, "date": "2014-08-17", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "5O9IZEHg7Z7V0St9sKw_hA", "review_id": "NvOUHVYVnmFRN0zR2y5W8w", "text": "I'm a medical professional who would have never gone to a chiropractor...until 2010. A Univ of Penn medical school graduate told me about Dr. Segal.  His down to earth personality and explanations excellent. Jackie his admin everything is wonderful. After 2 months of intense treatment I've had no issues, complete mobility and back to normal. He's not selling nutriceuticals, xrays, devices, etc. He's there for his patients, period. Great great guy.", "business_id": "2i6lkGef2_GMudi6SbRX2w", "stars": 5, "date": "2013-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PWVyz8NMsRvw9BIQOxbTcg", "review_id": "bgxDwhbCsKSHx8yQg_eYXA", "text": "I had my car inspected 2 weeks ago and it was a pleasure to deal with Walter's. They called me when they told me they would, and there were no surprises. It is so rare these days that you discover  a business so honest and so diligent. I would recommend Walter's to everybody;  however,  I'm worried I won't get an appt next year!", "business_id": "WWlNzfSllSQhr4whj0W_ng", "stars": 5, "date": "2015-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KNvmsbGHZFrJnsLI1EEteA", "review_id": "EIx3emyHsGuY8fvU5mHyjA", "text": "Absolutely amazing! Great staff and service! Best music in Pittsburgh, hands down.  Good work guys!", "business_id": "ZDKi3qsO8lSSogrIdbLJKg", "stars": 5, "date": "2011-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "Dcfq4ruNe5WMU7W4eCU55w", "review_id": "HdJXMtZgW__ns4Zj59iMtg", "text": "This place is bright and clean and I've seen staff taking care of machines every time I've been there (different times/different days) so I imagine it's well maintained in general.  Love that there are bus stops directly in front of and across the street AND that this is a 24-hour place.  I usually spend $7.50 every 2 weeks* though I could probably get away with using the single load machines and a few minutes less in the dryer.  I especially appreciate the good spin cycle from these washers as that means less time it has to be in the dryer!\n\nAround here, you can walk around the 'hood while waiting for your cycle to finish (pizza place, convenience store, coffee/ice cream shops next door, Border's bookstore down the block, more shops on Ellsworth nearby)\n\n*I'm a female doing laundry for 1 so it takes a while to have enough for separate whites/color load.  I've also been to The Laundry Factory a few blocks away and I prefer Econowash over The Laundry Factory.", "business_id": "gZEUfwSZDuVtLDWl96kiFA", "stars": 3, "date": "2009-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "RSExP0-Boucr4QyIEzZi0A", "review_id": "bUaPRLK4U7eusIPbw23i6A", "text": "So..... when I think about shopping at Whole Foods, I always create an alternate universe where I think I would be able to shop here. I think: if I made at least twice the amount of money I currently do, I would be able to be a member of the club and shop here. .... but I don't. Thus, I only stop in here on very special occasions when I 1. can withstand the rage I feel when I pull into this parking lot; and 2. I want to either eat at the buffet or buy a very specific item. I would definitely recommend that others stop in sometime to get some food at the buffet. The quality of everything is pretty incredible (though of course it's typically really expensive).", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 3, "date": "2014-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JF7Mnu-Zt2f9_E7b26TFgQ", "review_id": "0zo3QII3ORrU53Z1FLX3KA", "text": "I went to Casbah for brunch, it's a $22 prix-fix, which includes an alcoholic bev, an appetizer and an entree. They use amazingly fresh and yummy fruits and veggies. I had the house made granola which was just amazing! Toasty and sweet, it was nothing like the granola you get out of a box. Also, while the food is totally fru-fru (in only the best way :) and it's a pricey brunch, you get a lot a food. After the great pastry basket, my appetizer, a Bellini and a cup of coffee, I had two bites of my omelette and took the rest in a doggy bag (\"the rest\" included fruit salad, potatoes, and a croissant!)\n\nMy only complaint would be how long everything took. While I love a leisurely meal, an hour and a half for brunch seemed a bit excessive. I go into brunch groggy, then I have coffee and yummy food, and I'm totally amped, ready to face the day! And then I get to sit. And wait. Anyway, it's totally not a big deal, now I'll know to make time the next time I go. Which is for dinner for a friends birthday. So excited!!", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 5, "date": "2008-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BmzYNokqBWJMVl5w0igg_A", "review_id": "sq3jDIasSfQVIlo1SMz_wA", "text": "Very enjoyable menu n staff.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 5, "date": "2013-06-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RPJGvMZnlsQpk0l_QOK_FA", "review_id": "cFSpRCWAR3Iy3DdUH6MMtA", "text": "Casbah has made my Top 10 Favorite Restaurants in Pittsburgh list. My friends and I went here for one of my friend's birthday. The food was simple yet delicious and transported me back to Greece. Upon being seated, they offered complimentary bread with butter and mascarpone spread. The waiter was very knowledge about the menu and recommended his favorites which included the pork chop entree and that soft shell crabs and corn were in season. As a result, my friends and I shared the soft shell crab app. The soft shell crab was fried to perfection with a small side salad of sliced asparagus and basil with tapenade. The only complaint I had with this dish was that there was only one to share between the three of us. \n\nFor the entrees, I decided to heed the waiter's advice and selected the pork chop while my friends ordered the gnocchi and cioppino. What I am about to describe for the pork chop does not do it justice. The pork chop was cooked to the right temperature and did not lost its juiciness unlike most of my experiences with pork chop. It was also huge because it was double cut. The riscotto and braised kale complimented the pork chop well with the braised kale giving the pork chop an herbal component. I did not think I would be able to finish the dish but when I looked down again, everything was gone. I had the opportunity to try my friends' dishes and they were also prepared in an exceptional way. The veal and lobster in the gnocchi added a welcoming heartiness to the dish and the sauce reminded me of a curry. The unexpected combination of the gnocchi and curry-like sauce pleasantly surprised me. Since I have never tried cioppino until that day, I did not have anything to compare it but I was satisfied with the amount of seafood they gave. The only complaint from my friend was that the grilled bread that came with the dish was too hard for her to use to soak about the sauce. She used the complimentary bread instead and loved the sauce.\n\nWhile we were ordering our dishes, we mentioned to our waiter that it was my friend's birthday. He brought out a dish of caramel with \"Happy Birthday\" written on it with dark chocolate sauce for her even though we didn't expect anything from them. I am grateful that they brought that dish out. I do not know if the caramel is on their menu but it melted right away in your mouth. \n\nIf you managed to read all the way to the end of this review, you probably are asking why I didn't give Casbah all five stars and I will tell you the reason. Although our waiter went above and beyond to get my friend a birthday \"plate\", the service overall was not satisfactory. Throughout the meal, he did not come over to our table and took a long time getting our checks to us even though we blatantly had finished our dinner for awhile. I have gone to less delicious restaurants who offer better service.\n\nOverall, the food at Casbah is exceptional. They change their menu based on what is in season. Here's a tip: if you sign up for the Big Burrito emails (the parent company of Casbah at https://secure.bigburrito.com/Register.aspx), you will get a free meal voucher on your birthday which is good at any of their restaurants. When my parents come into town, I will be subtly hinting that they take me here.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 4, "date": "2014-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "psYEq7f4si48EZc6cyZRKA", "review_id": "_lk_szPZyOanNa8ExNYqog", "text": "We were excited to go to casbah after hearing good things from locals and having gone to mad Mex, which was truly great TexMex food. despite trying to be optimistic, we really left unimpressed. here's the breakdown:\ncocktails/drinks- the list was unimaginative and wife's cocktail was neither refreshing, not very strong. the beers offered were not great, one was flat: 3/10\ngnuti- this was somewhat tasty and rich, with well cooked chunks of lobster, however nothing I'll remember tomorrow: 7/10\noctopus- the list of ingredients and fact that it is a Mediterranean restaurant makes you think this would be light and fresh w a salty kick from the prosciutto. but it seemed to be cooked with the prosciutto and/or brown sugar and was overcooked, a heavy lumbering dish that not even fennel could make up for. this was a big disappointment. 2/10\nhalibut-  the fish was well cooked, but the dish was generic, not exciting nor offensive, forgettable. 4/10\nCasericcha (sp?)- this really was the standout. The scallops were cooked well and it was chock full of crab. It was very rich. Nothing about the preparation was special, and it wasnt spicy and it was green with pesto so the name red pepper is somewhat of a misnomer, but for the pure weight of fresh lump crab makes this dish 8/10, even with a pretty high price for pasta of $35.\nDessert- milk sponge cake- small and fairly dry, which again, with name \"sponge\" one would be disappointed to expect a moist cake. 3/10.\nservice- the service was fine, not amazing, seemed like waiter was a little too busy for the higher prices of food. although the ambience on porch was nice, they seemed to have a hard time regulating the temperature, with various times of sweat building on the brow, throughout the meal. 5/10\ntotal: 30/7=4.something and given the price, how good everything looked on the menu and the disappointment of anticipated greatness, I'm rounding down. \nbig burrito is a shooting 50% (props to mad Mex), curious to see how they do in the rubber match.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 2, "date": "2015-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nDcMb_LxWNIlOYtyUMIsiA", "review_id": "6zqR8mkRm36QXO7o0q1wGQ", "text": "Why do vegetarian restaurants think we need \"fake\" meat, this I do not understand.  I had a primavera sandwich which was just ok, but the patty on the roll was just as perplexing as the \"mystery meat\" you get in your elementary school cafeteria. My sandwich came with a boring pasta salad and some tortilla chips out of a bag.  Otherwise the atmosphere was fun, and the wifi was free if you ask for the password.", "business_id": "PzG0XmAmtXFs6Fdnubf41g", "stars": 2, "date": "2011-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gQta9kx5RKLpYk0ywxUDxg", "review_id": "3N2XkLUZXP4SsTGn6wrJpw", "text": "I love N.Y. style pizza.  Could eat it every day.  On a recent to trip to Pittsburgh I tried alot of pizza and this was good pizza.  \n\nOne thing about Pitt pizza... it is slightly different than true NYC style:  the crust is not as thin and there's a whole lot more cheese.  As a rule Pitt pizza also has a slightly sweeter tomato sauce.  The sum of its parts is still a delicious close cousin to NYC pizza.\n\nThe pizza I tried in Pitt in my order of favorites:\nFiori's\nPizza Sola (Penn Circle Branch)\nPizza Perfectta\nAiello's (Murray Street)\nBeto's\n\nSave for Beto's, I thought they were all delicious.  Wish I had a chance to try Mineo's.  A Pittsburgh native friend of mine calls this his favorite but they were closed July 5th when I went by their place on Murray... I'll try them next time I'm in the 'burgh.\n\nPizza Perfectta has a few stools and a counter but really it is a take-out place.", "business_id": "lHP5STO7aomlEQixH8m1aA", "stars": 4, "date": "2010-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0Jhh57RIWGEtsm62Y_2UgQ", "review_id": "GEcUfEOPv7MF7PNFUThiiA", "text": "I've been bringing my cats here for about 30 years. The vets and techs are fantastic. They treat my animals and me with patience, kindness and respect. Dr. Schroth saw my latest two cats through their final illnesses. She was incredibly empathetic. I felt very comfortable asking her questions. The front office staff is also great. I can't say enough good things about this place.", "business_id": "0TvxDhCKPQ-_dDyffEnJQQ", "stars": 5, "date": "2015-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wBbh1J8dndGxlgXT-RkM5w", "review_id": "8IEP6Q4WVAzRK156tNobaA", "text": "If you are looking for hard to find healthy, organic, local food choices EEFC is the place to go.  The largest selection of seasonal fruits and vegetables and a juice bar that is fit for a king.  As a matter of fact that is the name of one of the amazing drinks.\nIf you're looking for supplements, not only is the selection overwhelming  but the staff is capable of directing you to exactly which supplement you should consider to improve everything from hair loss to weight control or any topic Dr. Oz can muster up.  \nEven discussion groups and mini classes are available and free to the public.\nYou won't find this kind of service anywhere in the big box grocery stores.\nThis is a member driven store but you don't have to be a member to shop there.  But if you do you will get even more savings potential.", "business_id": "-iVcmhjfq79QoTWzrb6pKg", "stars": 5, "date": "2015-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GxiQVUJnbqXGkr8cUJ0qPw", "review_id": "-TVFyPK13oTDP5BxUFBsZQ", "text": "What a gem of a place in Shadyside.  It s places like this that makes me miss living there.  Food was outstanding!  Because it was our first time, we wanted to do a little bit of this and that.  2 appetizers, Becky s salad and the special of the eve:  smoked salmon on crostini with creme fresh, a clam dish, forgot name, with the best tomatoe-white wine, I could have drunk from the bowl, broth; Becky s salad (the lemon dressing was out of this world delicious--again, could have drunk it, good).  I m usually not fan of walnut in my salad, but the crumbled goat cheese made me forget about my dislike of it, that I ate it happily.  Good pairing.  The special of the night, we opted for sharing the lamb shank with reduced red wine sauce and simple veggies.  Small veggie selection by american standards--half russet potato, slither of zucchini, and a stem of green onion, but the star afterall was the lamb, and it was meduim perfect, just as I ordered!  \n\"Would you care for some dessert?\", Ramon, our waiter (he was fabulous!) asked.  And so round 3 begins.  Coffee, a chocolate mousse with whip cream, beauty and...  their version of creme brulee.  I thought it had a hint of peanut butter, but not sure.  Regardless it was  so, so divine.\nThis place was busy but we did not feel rushed, unlike most places.  The service was great, the atmoshphere quaint; it s definitely a neighbourhood cafe-- alot of repeat clientele, from what I gathered.  We shall return.\nFinally, on an end note. Cafe Zinho is BYOB, so bring your favourite bottle or magnum of vino.  And they only take cash or personal check, but they do have an ATM.", "business_id": "l_Wey2YC6NvVUIH8vTygGg", "stars": 5, "date": "2014-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "igSbsyeE2C0_17dFt_y_dQ", "review_id": "hwE_EJw0f-UjxGmSAK9tUQ", "text": "Stopped in here after a bit of night time sightseeing of Pittsburgh. My sister and brother-in-law, who are the ones who live in Pitt, had never been here before, so we were all newbies! Huge plus that it's open until 11pm on weekdays. This little place is great. You walk up to the order window, pick from a handful of different soft serve favors and cone choices, and are given your fresh ice cream in no time! I ordered the strawberry soft serve in a waffle cone. HUGE portion, and less than $3! Obviously shocking to me as a native New Yorker, since nothing around here is ever that cheap. My sister had cheesecake soft serve, my other sister had blueberry soft serve, both also in waffle cones. My brother-in-law had key lime soft serve in a pretzel cone! So unique and actually really delicious, having that savory/sweet thing going on. 4 cones of ice cream for less than $12. Fresh, homemade ice cream, with really nice staff. I look forward to my next visit to pittsburgh, so I can enjoy this place again!", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2012-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RZQKyXCUV9gAT3IiLultvg", "review_id": "uQR9Y6fnaxqhc57XHHOLdw", "text": "I don't love ice cream, I'm more of a salty snack girl, but this place is a dream come true. They just came out with their yearly blueberry soft serve magic. The signs on E Carson leading up to Page's tease me to stop in daily on my work commute but I couldn't pass up the blueberry and it did not disappoint! There is something about the friendly neighborhood ice cream joint that opens and closes with the seasons. Page's is a must try at least once a year, even if you don't love ice cream!", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2015-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "3vjxPfzPfO4Q4O16Pt6huw", "review_id": "5LXJQSCeDM-L4i2istclGA", "text": "Wow. \n\nSome of the best Italian food I have had in my life. Everything feels authentic, straight from Italy, and family owned. \n\nWhere to begin? Well the appetizer selection is incredible, my favorite being the provolone fried in truffle oil. The stuffed banana peppers were to die for, and I have had many others that were spectacular.\n\nFor the entree, I have had both the veal chop and the filet. The veal chop is almost as large as my arm (not joking) and was delicious, prepared either of their two signature ways. For the filet, I do not like gorgonzola so I asked them to prepare it a different way (which they are very willing to do and usually announce to the table at the beginning of the meal). It was done is a mushroom sauce that was a perfect compliment to the perfectly cooked filet.\n\nFinally, do not forget to save room for dessert (which will be fairly difficult considering the sheer volume of food that they give you). The tiramisu is amazing, and I would highly recommend trying their gelato. \n\nIn short, my favorite restaurant in Pittsburgh. I would highly recommend a visit, especially with a large group. Reservations help, but not usually required.", "business_id": "qUeBDN0D8SC93KeAHhiL-g", "stars": 5, "date": "2013-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-xPKyCJiK9q1OFZ7GCZwBw", "review_id": "r8lhMYROJvsKgwarORdznA", "text": "Best rates and deals. I now live in Arizona and still bank with dollar bank because I've been so satisfied with the offers and customer service!  Free ATM service nation wide, 1% interest on free money savings account and they give me .10 when I use my debit card.  What more could I ask for?", "business_id": "lItAsttBd6f6VFvVxZSIgg", "stars": 5, "date": "2013-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w3m8sjw9gmOkOHR39FiLvg", "review_id": "N2gfzcvPj22FrpJkysyn0g", "text": "Really great place to go. There was bluegrass music playing when I went which was a pleasant surprise. It wasn't too loud, so you could talk with others at your table. The food and service was great. Definitely want to come back here again", "business_id": "YRDKsBFYP7G0E8BLJKIkvA", "stars": 5, "date": "2012-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E27P-KjXJ9YAhKlgUaWJjw", "review_id": "yM76wHCuBhNFUxo6KQSz7w", "text": "I took my boyfriend, a German-food enthusiast, to Max's Allegheny Tavern last night. We had been looking forward to a night out together for a while. \n\nI think the food was good, but it's hard to say, because all I could focus on was the LOUD -- and I mean LOUD -- woman seated behind my boyfriend and me.\n\nHer profanity-laden discussion with her dining partners was so bad that for the first time in my life, I turned around and asked a fellow restaurant patron to take the volume down a few notches. \n\nThe restaurant was almost empty; I have no idea why the host chose to seat a loud party of five next to a couple having a quiet dinner.", "business_id": "IxQ1ATP_Wg_QujO9nywzcQ", "stars": 3, "date": "2011-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NtvfZmdd8pJ5UsCr9yQs8A", "review_id": "hkbzjrGnM5Gt9nzI4nMdsQ", "text": "Visited Max's last Friday night with friends who'd come in from out of town. As another reviewer described, the whole experience was 'tired'. Service was very good, however. I was hoping for a more colorful, fresh decor, but everything looks aged and washed out. I just got a very 'blah' vibe as we walked back to our table, and it really had a bad impact on my appetite and perception. I had the Wurst Sampler Platter and it was okay. The potato pancakes were dull...I don't think there was any salt in them. The cheese-stuffed pretzels were very good!\n\nThe following day was the 2nd annual Deutschtown Music Festival. The neighborhood is working toward revitalization, and I hope local businesses like Max's will step up their game. I believe the investment will be worth it.", "business_id": "IxQ1ATP_Wg_QujO9nywzcQ", "stars": 3, "date": "2014-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pEzJ0yF1ZPE-bkfRVm9W9Q", "review_id": "JNjgmUI-gbH2LbcxDAingA", "text": "Great european style boutique hotel.  You can not beat this hotel for the money!", "business_id": "hBAcj7X5JHeX2hvmptwH-w", "stars": 5, "date": "2013-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UkRImxxzNGUGrt9OqAc3tA", "review_id": "TlO7_i1LzvI4yK2yb739Yw", "text": "Consider this: my dad, a recently minted Troy Hill denizen, refers to this place fancy dining. And in a way, he isn't wrong.\n\nI like a place with a work ethic and Billy's delivers. They try and get fancy and it works in a blue collar kind of way. I eat all the stuff they put in front of me without complaint as it is neither fabulous nor inedible.\n\nI think a great way to sum up Billy's is the age-old adage, \"you get what you get and you don't get upset.\"", "business_id": "6AnorAMPkTdSDbUkOoV1Rw", "stars": 4, "date": "2015-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z4KyOtQbnhRuQTbx-odv-Q", "review_id": "Ns0CNnijK0hJRdJcUDz_yw", "text": "Complete and total joke. TERRIBLE service. TERRIBLE management. TERRIBLE product. Do yourself a favor avoid this place. Because of the fact this Pizza Hut is allowed to exist by Pizza Hut standard and be the complete shit hole that it is for years I vow to never consume Pizza Hut ever again.", "business_id": "rEKBr81s19Soh3dYj4bcGQ", "stars": 1, "date": "2015-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z23OHfXGW4297sdkjOdDvg", "review_id": "MdxaULRomfaOO9PpA9blBg", "text": "I checked this place out for the first time on a Saturday night. We got seats at the bar just inside the door and thus had a good view of the whole establishment. The atmosphere is unpretentious with a friendly neighborhood vibe - there were obviously lots of happy regulars. \n\nThe food was great from start to finish. We started with the hot antipasto and the greens & beans, which were perfectly seasoned. My dining partner, who has a less adventurous palate, was very happy with her spaghetti and meatballs. I got the halibut special, which was flaky and tender with a delicious apricot chutney, served over arugula. We decided to split a house made cannoli for dessert, which was warm and gooey and just plain yummy. I'll definitely be back!", "business_id": "q_BKmbdlYfQJroJVHfYMUQ", "stars": 5, "date": "2015-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "agnWfEJDWRdUIrxhkJOr8Q", "review_id": "WEzj_6-YCRYAkEDOR6-LTg", "text": "It's hard to beat a mani pedi for $35. I wished they were open later than 6:30. Just don't inspect the salon too thoroughly. Service was quick and satisfactory. I will likely return.", "business_id": "NKT8-CeoqUYIGUeNXBPVVQ", "stars": 4, "date": "2014-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ngDjucUfJtF5qKijDTh_Pg", "review_id": "JRGTa5FG_oLbogL0iSvReQ", "text": "This place is amazing from top to bottom. 2 hours down we are still here.", "business_id": "-Gfj1gA0Ir07zToO-4fBpw", "stars": 5, "date": "2012-07-09", "type": "review"}
{"votes": {"funny": 5, "useful": 0, "cool": 0}, "user_id": "zQftN0Vsh9F0iTy3bIVh1Q", "review_id": "2fUOFKuqGIU6JHNNObUnTw", "text": "Wait, what?  Pittsburgh has a football team?\n\nI hadn't noticed.  Maybe if this whole town showed some pride for their team, perhaps by displaying the team's colors, they could come to be enthusiastic about them.\n\nJust a thought.\n\nAlso: I am entertained that I was able to check into an inanimate object.  More of a concept, really.", "business_id": "5GS5sBSscgcex0IFTDL9Bg", "stars": 3, "date": "2011-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2cqj1MsSgRRgbT-GfXSSaw", "review_id": "SPaKNver9cp77YOCcADinw", "text": "been ordering chubbys for over ten years.  solid pizza at a great price.  one time, steve offered to deliver a pizza over an hour after they closed on xmas eve just because.  doesnt get any better than that.", "business_id": "OIL-eZX8d10jgWPLW-E7zA", "stars": 4, "date": "2012-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "hkos7xpZEsIxAr9c1gs3UA", "review_id": "y5WNAyQcqe_dJojB-PyTaw", "text": "Who doesn't love being able to walk across the street to an awesome dive bar with a GREAT menu!\nMy husband and I used to go to The Huddle once a week... They have REALLY good wings (also wing nights) and food, including daily specials.  The soup was always a must have, with seafood chowder being my favorite.  I always ended up ordering way too much food because it is so reasonable priced.  We'd spend $30 tip included (always at 25% because that's what a good waitress deserves) and leave with boxes of food! Definitely a place to be checked out!!!", "business_id": "wan0X-oHpLgGTPXqaICZCw", "stars": 5, "date": "2013-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eG9O6rIrKDh1CKUH6ecZHw", "review_id": "btMrALcpDpZV5x2CainAqw", "text": "My first experience with this bakery today (June 9, 2012). Picked up a cake for my husband's 40th birthday. Decoration was nice and spelled correctly, cake was moist and nice, buttercream icing lovely and smooth, and overall a great job. The walk in space was a little small and they seemed busy today, but this place seems to know what they are doing. \n\nIncongruously, for no apparent reason, they were also selling a shelf full of bananas in plastic bags (um, OK?) and they sell bottled drinks and coffee too, but they force you to use styrofoam cups for the coffee-- I would suggest reusable mugs be allowed, or something else more environmentally sound.\n\nCounter help and girl on phone were polite but could speak up a little more. Their preprinted order slips indicate a space for \"salesgirl\" to sign, instead of \"salesperson\" so I'd suggest  a change on that.\n\nOverall: Great and tasty and pretty, and suited our needs.", "business_id": "WY6FFxpa6ztwDH5OhS6WDw", "stars": 5, "date": "2012-06-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "ga2GgI8q5jkJ-YbuPSapRw", "review_id": "s2UwcJv6uSI1MXFYvKgGtg", "text": "Not like any other pizza you have ever had. The crust is crispy and the cheese is uncooked. I hated it at first...but now I live it!  You might have to try it a few times. I will keep coming back. And the price is so cheap! $1.45 for a slice? Kidding me?", "business_id": "93UCt9OgWYmypZCpXtUu8g", "stars": 4, "date": "2012-07-04", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 3}, "user_id": "Hkccp-UIGw-L1DAdJfDTEg", "review_id": "jG8Piw3YW8vkHCWLHzebVQ", "text": "Very disappointed with this dry cleaner. Had a small hole in a set of pants by a belt buckle. Came back with hand stitches that were messy and very noticeable. Definitely not worth the expensive prices.", "business_id": "106U0pNBlmR5uekLzOTdBg", "stars": 1, "date": "2015-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "fOrWcGEFNpFxFbpafL-w0A", "review_id": "fWeWfU2d_ziensw5vL095g", "text": "If I could give this place less than one star I would. I recently bought a lamp here which yes, is very pretty.. But the customer service is by far the worst I have ever experienced. I should have known not to buy a lamp here as the one saleswoman was extremely pushy and followed me all around the store the entire time and kept trying to sell me a $400 lamp. As soon as I got home I was unwrapping the lamp shade and noticed that it was cracked. I called immediately and explained that I had received a flawed product. They assured me they would order a new shade and it would come in within 7 days and they would call to let me know when it came in. Needless to say it's been two weeks now and no one has called me about it. I have now called 4 times and every person I've spoken to tries to shuttle me off the phone immediately without explanation. The last conversation I had was with a woman who worked there who told me \"she was just a worker and couldn't help me with what I wanted\". I bought a lamp from there for a few hundred dollars, they sent me home with a broken lamp, they told me they would call and they still haven't and now they act like they have no idea who I am, and the employee tells me she can't help me? I would never give these people my money again. You can find equally nice things at a different store for a better price with people that actually respect you.", "business_id": "ZH_t1lKTDOdPOvyIckDOMA", "stars": 1, "date": "2015-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xPz0a2y9ofqdTKxh81hHNQ", "review_id": "8O1nMZ6rsPZn8LJlJydKFA", "text": "Best breakfast in the city! We come here every weekend to get the famous Bloody Mary bar and the food is awesome too! Rhett and Selena are awesome bartenders and will make your experience here unforgettable!", "business_id": "5Udv4CASAXB2eH66TefWPQ", "stars": 5, "date": "2015-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Zup6D0M2vMOmMLdnIhn1QA", "review_id": "R10aMTLY25krWq3OOxeUaA", "text": "The Jumbot is very good, you won't leave hungry that's for sure,staff is very friendly, the place was packed but they moved people in and out very quick, definitely worth the wait also the banana walnut pancakes rocked", "business_id": "2Igiyhi82R8_QaaPplRmCw", "stars": 4, "date": "2013-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VJxeEFbRljqieXzPQe3eng", "review_id": "BQmv7bZBvfJgyKlSpaGDPQ", "text": "Upbeat atmosphere and very good breakfast! The home fries and banana oatmeal pancakes were sooo delicious!", "business_id": "2Igiyhi82R8_QaaPplRmCw", "stars": 5, "date": "2014-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dkQfTTgRWamzC-wgNAPSOA", "review_id": "eoMz8MvThgUclceklL10Iw", "text": "Loved it! Tasty food and friendly service!\n\nVisiting there from out of town and decided to check it out. We went on a Saturday morning so we expected a long wait but it was only around 15 min. \n\nWe had pancakes, stuffed French toast, bacon and eggs. All were yummy! Prices are reasonable and worth it for the good food and friendly service.\n\nWould make the trip again to go there!", "business_id": "2Igiyhi82R8_QaaPplRmCw", "stars": 5, "date": "2015-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DLu1Bum8EXNE62xno-v0VA", "review_id": "xzOKGHLjresKLy-c5Xs2gA", "text": "I actually don't mind the Arby's chain; I certainly don't go to one on a regular basis, but when I do I usually enjoy the treat that is a so-not-good-for-me fast food type of sandwich and a side of curly fries. Usually what I get from an Arby's is an a-ok fast food variety sandwich that, while greasy, is still very tasty and doesn't leave me feeling sick to my stomach.\n\nThat said, I never truly enjoy the food I pick up from this particular Arby's. Firstly, often when I've placed an order in their drive-thru I've found that I've had to sit and wait for my \"fast food\" for 10 to 15 minutes. After waiting for my food - on the days that I didn't leave the line in frustration before placing an order at all because I couldn't even do so in a reasonable amount of time - I've found that what I've gotten has been mediocre compared to what I've experienced at other Arby's. Common issues I've come across include the lack of sauces when I've asked for them, overcooked food, and so much grease that the sandwich begins coming apart, AND after eating I begin to feel sick to my stomach.\n \nSorry, guys. I may not expect a lot from a fast food joint, but this Arby's just doesn't impress me.", "business_id": "Tb7hQ37UFA2QFaMwjFieQw", "stars": 1, "date": "2013-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZiWheL2uVGu3KHqMPKcJFA", "review_id": "iCS2g7iTlYrq9xULB7K4qA", "text": "Awful customer service, they tell you one price and its COMPLETELY not enough security to cover a small house...., then they charge you a ton to actually secure your house.... Only telling you AFTER it was installed (holes in your wall for keypad and drilling in your ceiling for smoke detector). when you try to cancel it takes forever and THEY ARE RUDE!!! My advice ...... DONT USE ADT!!!!!!! Save your money and give it to an honest company not this awful one!!!", "business_id": "g4jHGmS46NHnb7xp-YPUKg", "stars": 1, "date": "2015-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RjkOUl0iLgHkZd9bVx-BZA", "review_id": "2q_SwqXDvHyxpcaw2NjvCw", "text": "good selection of beers*, but the food is appalling. sysco-truk curly fries and run-of-the-mill hotdogs that don't even have natural casings. puh-leez. if you're gonna put \"dogz\" in the name of your restaurant at least try to serve something better than what you can get on sale at giant eagle. \n\nno joke: I prefer the O. their fries are made out of potatoes and their dogs have real casings. \n\n* and by \"good\" I mean \"good for PA\" where liquor laws are an absurd kafkaesque mess and a lindeman's geuze is about as interesting as it gets (for like $15, natch)", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 2, "date": "2010-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "4tzuxIVry4xkOR9vbpgjrw", "review_id": "rm0UqrJ9UtQszNZVGcgd6Q", "text": "\"Meh\" is kind of how I felt about this place, which I realize is an opinion that seems to go against the grain. I had heard about D's time and time again. Everyone talked about it like it was the greatest place in existence. I had such high expectations! \n\nI suppose maybe I was expecting too much, which led to some disappointment. A few friends and I went here on a Friday night and it was (predictably) packed. We were fairly lucky to get a table almost right away. \n\nI obviously had to acknowledge that the beer selection is impressive. If you can't find it here, you probably can't find it anywhere in Pittsburgh. I had to check out the famous \"Beer Cave\" which seemed to have just about everything. I think I'll make it a point to pick up some brews here next time I'm looking for something unusual or new.\n\nI wish I had more to say, but I just wasn't feeling it. My friends love it so I'm sure I'll be back, and next time I'll make it a point to try the food. Judging by some of the other reviews, that might change my perception of the place.", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 3, "date": "2014-06-05", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "u1InjUR4VyKJQ80qrClbGQ", "review_id": "lExjQHtZhR53EgZO_JEV5g", "text": "Worst dry cleaners EVER.  \n\nNot only do they do an incredibly poor job on the clothes, but the staff are particularly nasty and rude.  The kids who work there are fine, but the older ladies are just plain miserable.  I would rather spend more money someplace else than go back to this hell hole.", "business_id": "1PcoOrAavnik-f_Epp9v0A", "stars": 1, "date": "2012-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pztZ7aZtyx6Bp9O4-yic7w", "review_id": "QkOyyt3rwUiDq29as_aKFg", "text": "Inattentive staff.  Dirty tables, I agree with the other reviews here.  I think the \"Manager\" only hires other smokers, and they spend 90% of their time sitting outside smoking, instead of being prepared to serve customers.  \n\nI go there because sometimes it's convenient, b/c of the location, but last week they left their A/C broken for over a week (in 80+ degree weather).  No additional fans, nothing.\n\nThen when it was fixed, I went in, ordered coffee and an order of hummus/carrot/celery (prepackaged).  Not only was the hummus watery from sitting in that container for several days, but the celery was rotting at the ends, yes brown and rotting.  I showed the kid working there, who was probably jonesing to have his next cigarette, and I asked for another one.  Without opening it I could see at least 2-3 of the other servings of hummus were also all watery and had celery that was starting to rot, just like the one I was given.  I asked for my money back.  You know what was the worst thing, though?  The kid (he knows nothing about customer service let alone food service) put the containers with the watery, rotting celery back in the case, to serve to other unsuspecting customers!  Hello, Allegheny County Health Department?....\n\nThen the ultimate insult: 2 kids came in selling candy bars.  I've seen this there before, but this time, I said to them: \"You know, this is a business, you shouldn't be here.\"  Well, the older of the 2 girls (probably 11-12 at most - where is her mother?) put her hands on her hips and said in a smart-ass tone: \"We asked da owner, we is allowed ta be here.\"\n\nWell, that coffee I spent $2 on?  That is the last money I will spend in that place.  Disgusting.", "business_id": "D9sHwmqlNkrVxmX-057i1g", "stars": 1, "date": "2011-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ytiE9004NGvmLP4lSsRTXg", "review_id": "PRJdz7oP550ZeQEfv70HIw", "text": "My friends and family rave about this place, but I am not a big fan at all. Every time I've gotten a sub, the bread is dry and crumbly (I like my bread to be fresh), and their toppings are limited. I do support small business tho, so if I'm hungry and in the swissvale/Rankin/Braddock area, I'll pick up one to share. But otherwise, I'd rather opt for a sandwich in regent square or on the waterfront.", "business_id": "DzOPHyrG2XuVqKEvHCnN7w", "stars": 3, "date": "2014-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "ZDsneygztCiyFpkwSV0oTQ", "review_id": "7rP6IDWF7tTxwLvogdlHmw", "text": "Benihana.  It's just rolls off the tongue, doesn't it?  No, unfortunately not.at.all...anymore.  From hence forth, all mentions of Benihana are likely to cause anxiety in my usually calm heart.  I hate complaining like this. I really do. But sometimes, you just have to, ya know?\n\nTuesday evening I met a group of friends for a birthday dinner.  The reservation for our party of nine was for 7:00pm.  All but one of our party arrived prior to 7:00, but the hostess was curt in explaining that all party members needed to be present before we were seated, as our chef would be ready to begin meal preparation as soon as we were seated.  Fortunately, the final member of our party arrived shortly and we were seated at 7:05pm.  It was not until 7:40pm that first contact with our server was made. Without any apology for the delay she took our drink orders.  She (name withheld because I don't want to be rude) returned more than 10 minutes later with our drinks, but waited another 10-15 minutes after that to take our dinner orders.  As I was waiting I looked over at the table next to us, who were also clearly celebrating a child's birthday.  At one point the mother (I'm assuming) smiled at me and said, \"I hope you get out before midnight. We've been here over two hours.  We're taking our cake and getting out of here.\"\n\nUpon taking our orders, one of our guests explained that due to a shrimp allergy it was necessary to cook any shrimp ordered by our group in another area (a neighboring grill, etc.).  Our server said that she would have to ask the manager, who came to our table shortly thereafter.  When the manager arrived at the table my guest explained her allergy and his response was that it might be in her best interest to leave.  I'm giving him the benefit of the doubt that he meant leaving the table, not the restaurant, but I'm not certain of this. Following this recommendation he mentioned that she could wait in the bar as the rest of us dined table-side.  I asked him why it was not an option to prepare the shrimp at a neighboring table, but he expressed concern that other customers may require the use of the other available tables.  I understand his point, but the restaurant was near-empty as the hour quickly approached 8:30pm.  Finally, he offered to prepare the shrimp portions of our meals in the kitchen.  I'm not sure why this wasn't initially mentioned as an option, but I'll leave it at that.  \n\nOur chef Tom eventually arrived at our table. He was very pleasant and efficient during the course of our meal preparation.  During his time at the table my Emperor's Salad was delivered, as were the majority of my table's sushi orders.  However, two of our guests that ordered sushi were not served at this time.  In fact, they were not served until a full 10 minutes after the rest of our party finished our meals.  At one point, they inquired about the delay to she-whose-name-shall-not-be-mentioned, who responded that they were \"waiting for the rice.\"  When she delivered their food there was not a single mention of the delay.  \n\nTwo hours and thirty+ minutes after we arrived at Benihana, we left.  From start to finish, the entire evening was a terrible experience.  It was ridiculous to the point that there was not even soap or toilet paper available in the restroom.  Were it not for the kindness and professionalism of Tom (and the awesome company of friends), the night would have been a complete waste.  \n\nMy final thought is this. The food was fine, but because I was feeling particularly piggish on this Tuesday evening, I enjoyed two California rolls from my stash of Costco sushi at home before departing for the restaurant. The difference between Costco's rolls and Benihana's...a toss up - just sayin.  The good news is, this will give my friends something to whine about for YEARS to come...", "business_id": "1vQLTKwmcmZXtNzfKEvMmA", "stars": 1, "date": "2011-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "u7rJ_CFbp4IYeT39fNfVDQ", "review_id": "Sq3pXzS8ZHNujRVfCgQvJw", "text": "You have no idea how badly I WANT to like this place. They are incredibly vegetarian/vegan-friendly. I just haven't been impressed by anything I've ordered there. Even the chips and salsa aren't terribly good. I do like the bar-- they have great sangria-- but that's about it.", "business_id": "hhNlQWaKqGbMPoeZHoL-IQ", "stars": 2, "date": "2011-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "vt23m56xsVzPzkeUw7_IIQ", "review_id": "cKUeJ-MCJrsoikMgHYED-g", "text": "They have a nice selection and the staff is super friendly.  I'd go out of my way to come here simply for their great customer service!", "business_id": "tRhwP2jCg_lI1BrjdscNbw", "stars": 5, "date": "2014-06-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DLu1Bum8EXNE62xno-v0VA", "review_id": "b3RZNEeNDJ-McklhCxMXLA", "text": "I know a lot of people tend to either love or hate Panera; I happen to love it - the You-Pick-2 combo is one of my favorite lunch options. And as luck (good or bad depending on how my diet's going!) would have it, this location provides a daily opportunity to get one of those combos! This location is incredibly convenient for me - both for being relatively close to where I live and for being next to an old bookstore, clothes store, and a few other businesses - and has earned all 5 stars for being a bit better than the average Panera. \n\nOne, I've never walked in here and found a shortage in sweet treats, which is a common problem if I want an afternoon bagel in a lot of other Panera locations. Two, the sandwiches here just taste fresher than a lot of other places I've been to. Three, as others have mentioned, the staff are just nicer here - I have no idea why, but I'm not complaining! Bonus star for this Panera because it's actually made its entire interior comfortable and encourages people to relax and use its wi-fi, which is something I can't say a lot of other locations have nailed just yet.", "business_id": "sNmQJQWEVGheCnw5Tf4Phg", "stars": 5, "date": "2013-06-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "PRsM-yC9MhpiCS9lm9SPMA", "review_id": "j34o05HUM8D9peyw3foqVg", "text": "Best donuts on the east coast. Yeah, I said it.  \n\nAs fancy as Voo-Doo doughnuts in Portland Oregon? No. \n\nHuge line around the block like Voo-Doo? No. Just a steady stream of neighborhood regulars who stop by to pick up doughnuts before starting out their day in earnest.\n\nIt's a good thing this store is a little out of the way, otherwise there would be no doughnuts left for me :)", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2013-07-15", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "ngDjucUfJtF5qKijDTh_Pg", "review_id": "HAA6z8kWDIr83ORXQGpquw", "text": "Umm lol so seriously I read some reviews about this place and was like NOOOO it can't be that bad. HA HA....DUDE! So this spot is like mad cheap but REALLY? \n\nFirst we check in and notice the are undergoing some much needed renovations. Checkin was seamless as it should be. We get to out room #122 and after reading the reviews I know to check the beds immediately. The first bed legit has hair under the sheets...strike 1. As I'm pulling the covers back on the second bed I find two quarters...that's right folks! Obviously left by the last guest intentionally to warn the next occupants that the SHEETS HAVEN'T BEEN CHANGED...let alone checked. I mean really? You couldn't at lease have made it look like you did your jobs?\n\nWe go to the desk and make them aware of the issue. They apologetically get us another room. This room is better its evident by the way these beds were made that the room has been cleaned. The elevator by the desk is stuck on the 3rd floor lol death trap so we take the stairs. Thank God for yelp....You've all been warned lol SERIOUSLY!", "business_id": "Ml6Up5SH9GbJQ8oyIJsj_g", "stars": 1, "date": "2012-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "NFcRpsRQ_NjelYQhiYJ4Vg", "review_id": "-hMkbrOZzGjmKMChF2cbXg", "text": "By far the worst Shellac manicure I have ever had. I went down on my lunch break for a quick mani. First the woman rushed through my \"manicure.\" I'm not sure they have any type of sanitizer for their instruments as she kept pulling things out of her drawer. The manicure was very quick and not at all thorough. Once she started to paint my nails she kept having to fix them because she was in a such a rush. She took off polish that was on the nail and then pushed my hand into the UV dryer. When she went to put the top coat on my Shellac she put the Foundation coat on 2 of my nails before she realized and wouldn't fix them saying they will be fine. During the entire process she did about 6 eyebrow waxes and then would forget where she was in my process. She also kept forgetting to turn on the UV dryer to the point where she walked away and I had to turn it on.\n\nDo not go here. If I could give it 0 stars I would.", "business_id": "OmpbTu4deR3ByOo7btTTZw", "stars": 1, "date": "2014-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "g-6gxOUshpfz82svte-_rQ", "review_id": "nq3CXwskEV9eipIcyxdSNg", "text": "I went to MCN three times for blonde highlights and lowlights, and a trim. Instead of doing a natural looking blonde, my highlights turned out to be a brassy platinum yellow color - the type of color you get out of a box. I also asked for just a trim, but as she was trying to even out the sides of my hair to make sure they were the same length, she kept cutting off more and more until my hair was three inches shorter. I had heard so many great things about this salon and gave it a fair shot... but was very disappointed!", "business_id": "ih6d7hBWss05xXWUznuFaw", "stars": 2, "date": "2014-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9OZH1Ecw-qUkCW5MS0NefA", "review_id": "OO_Frpalj41s78vGky7quQ", "text": "I came here awhile back for lunch after kayaking for a couple of hours.  I ordered the Pittsburgh salad, and it was decent and filling, which is what I was looking for after getting some exercise.  I agree with other reviewers that prices are a bit on the high side, however.  Since I was there on a day when there wasn't a game, there were few other options open either along Federal St. or in the Del Monte bldg.  They have outdoor seating, which is a good way to enjoy the weather on a nice day.  Overall, the food is pretty typical for places along Federal St., but a bit higher-priced.", "business_id": "FtjvnLhh51ZBYEpKAARaFQ", "stars": 3, "date": "2014-06-24", "type": "review"}
