{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0EVJRYAg9G1ZkGhP30jtsQ", "review_id": "gsz7G2AeeoqLQMQ756XXXA", "text": "This staff was very knowledgeable and helpful.  I brought in a hand-me-down Minolta X-570 that just edges me out in time spent on in this world.  I really preferred to get this back to working condition, rather than go purchasing something new (not only to be cost effective, but to own a fully operational 25 year-old camera.)\n\nThe lens had a nasty scratch inside and the film advance lever was also broken.  They were able to fix both issues for a very reasonable price in about a week's time.  I would definitely go back for future issues with my camera.", "business_id": "GiElN3AF8N4ZpfH6PNRjdg", "stars": 4, "date": "2009-07-12", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "Ltmwk7ypB_UFW_TsQtfyyQ", "review_id": "5GsCQHph65BHwy0Gkwii5Q", "text": "Chocolate croissant is all I wanted and all I needed! I am on a diet that allows me to have a cheat day.... just one. So I say, go all they way and have it be absolutely the best! I have been craving a good croissant for a while and wanted the best I could find in Scottsdale or Phoenix. I found it at Au Petit Four. Flaky crust with just the right amount of chocolate it was just what the doctor ordered. The service was good, she greated us, showed us the pastries and we sat while she warmed it (leaving it at just the right temperature). We were then left to enjoy our delicacy (she checked in on us appropriately). \n\nWe didn't try anything else here (and didn't need to) although the crepes looked good.\n\nThe atmosphere is simple and \"family owned\". (The croissant  really should get 10 stars)", "business_id": "wftoNIA0Q8nX-Da47psBCA", "stars": 5, "date": "2013-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "W_R-gVF8OHNrIhtmyhDnyg", "review_id": "7s-RIXglXkWRzN984LCt0g", "text": "Small family owned restaurant in a strip mall tucked away.\n\nMainly decided to come here because we were looking for a place and in the area with good Yelp reviews.\n\nNot to be racist, all I have to say is beware of white people giving ratings for Asian Food, it is just a different standard.\n\nI would recommend the sandwiches which come on a fresh baguette that doesn't break your teeth when you bite into it. \n\nWe ordered the #18 sandwich - Korean Bulgoki Meat Sandwich and #20 - Spicy Pork Sandwich. I liked the Bulgoki Sandwich which had great flavor but could of used a little bit more meat. Would be nice if you could order double meat like Lee's Sandwiches. The Spicy Pork Sandwich was a bit tangy for me but I am not into spicy dishes.\n\nWe also tried the Teriyaki Chicken Bowl and the meat did not resemble chicken, looked more like a processed meat. Don't know if i would recommend the Teriyaki Chicken.\n\nWe also ordered some french fries to go along with the sandwiches which was pretty good.\n\nThrough some of the reviews people were raving about the Spicy Asian Fusion Ramen so we tried it and when it was placed on the table I started laughing because it looked like the Top Ramen Noodles from the grocery store that you can buy 10 for a $1.  So when we ordered the Spicy Asian Fusion Ramen we asked to tone down the spice,  appearantly they did not add the spice pack that comes with the Noodle package.\n\nIf you go, order the sandwiches, the bread is very good , I enjoyed the Bulgoki Sandwich and would recommend.  \n\nWanted to support small business and especially a family owned restaurant, but you can not serve that type of Ramen Noodle.", "business_id": "GSsq_y2PfYBzn51gAG_c7Q", "stars": 3, "date": "2015-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "kk05snSafuIFK0lsxoMNzA", "review_id": "cr3nL1hwNF5XzL1h_OGUtQ", "text": "I had an amazing meal here. Top 3 Italian meals ever. Great service and homemade pastas. Worth the price of admission", "business_id": "MLVKDbuI2xaOJQ4-NZj2MQ", "stars": 5, "date": "2013-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "z7WnKuTCFnWdB9NMTtWI7Q", "review_id": "_jWLdFROqs8BUtQpgKPZaw", "text": "Wow. What a beautiful store. There really is no comparison when it comes to cigar shops in the Valley. Ambassador excels in just about every aspect. \n\nThe best part of the experience is the personalized attention from Mr. Seferian, the stores owner. Mr. Seferian obviously cares deeply about his customers, and knows a great deal about cigars. Highly recommended.", "business_id": "jWzSdxU0IkIAOsT2Rubedw", "stars": 5, "date": "2010-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "TJ-Y-53ofI02KG4W2fbmkg", "review_id": "uXNUe4w-lRWvbAAxqbOAaA", "text": "So, while looking at 101 things to do in Phoenix, I came across this place as #2. It sounded super interesting and top-of-the-line, because it had go-karting, pool, rock climbing and food, which is all a plus!!!\n\nMy family decided just to play a little pool there and we were able to play 5 games within 1 hour and it only cost $7 per hour, which is super cheap in my opinion.\n\nThough I didn't go go-karting, the prices are about $20 - $30 and the races are about 12 minutes long. They have three different tracks and there's super nice.", "business_id": "YO_ngkGvdFKjiQmIP89YZQ", "stars": 5, "date": "2012-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BrDGtR4Xpy-08J4D69cW9Q", "review_id": "JAsru0XDHBOP5hgYLxSSHw", "text": "My sister is having her 70th Birthday at this park July 4th. It should be fun and warm too.", "business_id": "X3icXUyW9vS4UXY6V_MR4w", "stars": 5, "date": "2009-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "muEqvV8Rv73QjaAe478vtg", "review_id": "DR7Ien9ZI3YkAkL9k0gJnQ", "text": "I loved it when I was 4, and l loved it when I was 24. It's a free park with a two dollar mini steam powered train ride. There is also an impressive amount of miniature models and an air conditioned indoor model train museum with interactive train exhibits and did I mention it's free? There's green grass and lots of open space, and monkey bars/ a jungle gym. This is such a cool place for kids. For young adults it may not be worth it, but it was a blast from the past, memory lane for me!", "business_id": "X3icXUyW9vS4UXY6V_MR4w", "stars": 5, "date": "2015-06-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "9E0RFKNOHkDsOTYkwFf5Dw", "review_id": "CyGwjHomT0IKZRnm3X0oIA", "text": "Amazing selection jewelry and  friendly employees who are very helpful.", "business_id": "6nzXPSmJ-ukrk8sl1n15VQ", "stars": 5, "date": "2012-07-17", "type": "review"}
{"votes": {"funny": 3, "useful": 0, "cool": 0}, "user_id": "DrWLhrK8WMZf7Jb-Oqc7ww", "review_id": "NEEg5CO-4ioGyhGeztfpZg", "text": "First half of the $10 corned beef sandwich was good and the Rye Bread was solid as well throughout. The second half though contained a decent amount of fatty pieces which lowered the star value of the place. The other star goes because the fries were limp and undercooked for the most part. Did no tealize it was Chicago style and still don't know what that means really. I'm a NY style person, so I will return to my New York places now. Chicago makes hot dogs - New York is deli king.", "business_id": "TpQMR-JFE5V0UPzTjjuwFQ", "stars": 3, "date": "2013-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "8v6dKRMy__GpliOQDh_j5A", "review_id": "etzh7omsbKrra6mE7Pv0MA", "text": "I used this service for over a year and referred Brent to several people, but a month ago, I had to fire them.  One day, I found my pool was green and called Brent.  He said I owed him money, over $450!  I told him I had paid every month on time the $75 we agreed to, which was to include chlorine.  I had been paying A Perfect Pool with bill pay and he knew this because he was the one cashing the checks.  Although he claimed that he had been billing me for \"extra chlorine\" (wow, $400 dollars of that?  Thanks for asking for my consent on that, also not professional), I reminded him I had been paying him through my bank and not via bills for over a year.  All other pool services and any other professional services call or email or talk to you in person if they need to bill you beyond the monthly service fee.  Never mind I had seen him the week before and he had said nothing.  Brent claimed he left a note on my door (um, not professional).  I never got it. \n\nIf you want to get a surprise bill for $450 and a green pool, definitely use A Perfect Pool.  If not, stay away.", "business_id": "MOEDY_K1ODppExreulA0WA", "stars": 1, "date": "2012-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Vv0wKVg53xLoL5YvSLpLPw", "review_id": "b2HOqdV6-4neGvUzZ1xgBA", "text": "I don't post many reviews, especially when I didn't actually 'use' the business, but this is a special case.  I had a scorpion issue a few weeks ago and had called a number of pest and scorpion companies to get quotes which ranged from a $3000 home sealing to a $200 hunting session that could only happen on Friday nights.  Bret immediately returned my call, listened to the issues I was having and told me he thought the problem was likely temporary due to some conditions on my area and actually gave me a few do-it-yourself tips to try before he came out.  So far so good, but honestly in any trade is a rarity these days and I can promise that when I need professional pest control help Bret and Sonoran will be my first call. \n\nCheers to building your business the right way: by being honest and genuinely caring about your customers.", "business_id": "HuxJUkVzc6xSjgHgGhxSeg", "stars": 5, "date": "2015-08-25", "type": "review"}
{"votes": {"funny": 7, "useful": 13, "cool": 8}, "user_id": "F5NvOP5YeKetvkYo1W4t3A", "review_id": "8Ti91pGgVg8YCuHpq9a67Q", "text": "We took a little vacation over to AZ and this was home base.  We got a killer deal on Expedia and it was a nice stay.\n\nWe were greeted by a friendly lady named Amber who checked us in and told us about all the amenities that comes with our stay.  Free dinner and cocktails between 5-7 M-F.  We didn't partake unfortunately but that sure is a nice thing to offer.  They also offer free breakfast which we did use every single day if not just for coffee and juice.  The food wasn't the best nor did they have the widest selection, but it was free so you cant complain.\n\nThe rooms were nice and spacious.  They had a fridge, dishes etc.  This would be an awesome place for an extended stay.  They had a separate bedroom with a large bath.  The shower was kind of narrow and sloped weird but the rest of the bathroom was nice.  The bed was comfy and they provide you with a shitload of pillows which I love.  The only bad part about the room was the furniture.  The couch wasn't comfy at all, and they had this little old school recliner which wasn't too comfy either.  Dont know what kind of cable they have but it only had about 15-20 channels which was weak.\n\nThe pool area was nice and we swam pretty much every single night.  Only once was someone else out there.  The pool is small, but its perfect because nobody was in it and they always had a stash of clean towels.\n\nThis hotel is located about 5 miles up Scottsdale Blvd from all the hipster hangouts/bars in downtown Scottsdale.  Free parking too.  And free internet.  Overall it was an awesome stay and I would definitely come back again next time we venture over to AZ.", "business_id": "_Q9IEf-8XbQR2eutFVhh1w", "stars": 4, "date": "2010-06-14", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "xZvRLPJ1ixhFVomkXSfXAw", "review_id": "IzWlkSsnk2JyGAujnLckUg", "text": "incredible happy hour at the bar!\n\nthe burgers are delicious as are the bbq shrimp!", "business_id": "9AbyBqGWHYZC73GlyAuTrQ", "stars": 5, "date": "2011-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YfCbZF27kndPKl7Px9lefw", "review_id": "hpJvaNmP1EDdjdqfaOvlHw", "text": "I honestly can't say enough good things about this place! First - the bar is awesome and always packed so don't be surprised if you have to wait for a table/seat at the bar. The hh is amazing and goes til 7 which makes it even better. Most of the time I just stay and eat in the bar because the hh food is just as good as the other stuff! \n\nWe actually did go eat in the dining room though to have a bit more formal dinner. We split the filet, mushrooms, and shrimp appetizer. Everything was fabulous and the service was even better. Really can't say enough good things about this location!", "business_id": "9AbyBqGWHYZC73GlyAuTrQ", "stars": 5, "date": "2014-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EemOQfYk1UL3W3GmVZADFw", "review_id": "KxICjdcNh7i-Bd3xyaNvTw", "text": "Best pizza ever! Hot dogs too! They deliver or you can dine in. Great Chicago atmosphere. It's a must!", "business_id": "n_HvrTuGUgxXJM0yq39-0g", "stars": 5, "date": "2012-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eu4EDnp3n86L5LtZGrb2EA", "review_id": "6sS9SLVzDr3mCTjGUxUSTA", "text": "An impromptu party sprung up in the Dance Studio last night at 10:30 and nothing was open for food, oh what to do? We called Papa John's on Via Linda and ordered two large pizzas. They were delivered very quickly and by a very nice guy - he even laughed at our jokes (always good for a tip). And two large pizzas for less than $24, who can beat that? One regular crust with tomato, pepperoni and olives and one thin crust with ?? (not mine so who cares, haha) were both very good.\n\nWe added a little wine, a little beer, music, and good friends and it was a party! I love Papa John's at home and now found a great place to order late night in Scottsdale too!", "business_id": "KrkeCU444Uh00fuCklyuQQ", "stars": 4, "date": "2012-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MKAC4ER7AqnGZ9dK3qswEw", "review_id": "ikDF0qduApZseo4EpoEWDA", "text": "For me, it's about the people that support the team of doctors or dentists that we use for health care providers, as well as the doctor's themselves. \n\nIt's rare to find a group of individuals that truly care and that want to ensure that every visit at the medical office is a positive one. \n\nI've found such a group. The ladies at Perfect Teeth reflect true Customer Service. They are friendly, knowledgable and honest. Whomever you talk to, on the phone or in person, is clearly working to make sure your needs are met. That's a reflection of the entire organization. They truly care. \n\nI want to thank Christine, Jenny and Megan for always greeting me with a smile and a genuine \"How are you?\". They know what they're doing and they do it well. \n\nThe dentist and the oral surgeon, Dr's Sandhu and Iskandar are polite, funny and also work diligently to make sure they are providing excellent dental care. \n\nThe folks at Perfect Teeth care about me as a patient and as a person. That's important.", "business_id": "zCUdYMgqf2lGrquEGAzZJg", "stars": 4, "date": "2015-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7cAJoqQBmJe_FksnYIuaUA", "review_id": "Y6r_jvqucue6Z7lLz0Vyuw", "text": "My fav go to for fast, authentic Mexican.  Love the chorizo breakfast burrito and the super nachos are great too!  Its fast and always good!", "business_id": "F3tqTcfKnljJcSyyqN0bbw", "stars": 5, "date": "2015-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dwiis_5YagRG7Ol8JSH-Ig", "review_id": "gqg3AHEOiz5Hp1WsPX1YwA", "text": "great fresh sushi and hamachi kama. i spent a half hour talking with sushi chef Sun and Sakana has become my sushi home away from home (Sushi On Oracle in Tucson).\n\nthe service is very accommodating, although one time i went the waitress literally screamed at us and she couldn't pronounce gyoza correctly. but i can live with that as long as the food lives up.  little things like that get to you when you used manage a sushi kitchen...\n\ni had some of the better fresh salmon i've had in a while last night. the yellowtail is very fresh and melts like butter. they have toro, which is always a plus. can't find it everywhere. even though they cater to the americanized sushi (lots of fried shit and rolls, some fried themselves), you can tell them you want to stay traditional and Sun will hook you up. my new sushi spot.", "business_id": "Bjt3rB73dvSDe1XEPEWc6w", "stars": 4, "date": "2010-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "U_wEreNBIS-tR983hOJwkA", "review_id": "TsFNNXwW733AMew3efIzRg", "text": "Best sushi ever. Great prices. Happy hour is really good. Get there early because it is always busy.......for good reason.", "business_id": "Bjt3rB73dvSDe1XEPEWc6w", "stars": 5, "date": "2013-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EjVwC2hnUpxL6n3VLj0ITw", "review_id": "4xxi478KG7TwZ4ilv1YSkw", "text": "Brought the entire family tonight to taste the goodness! Ordered multiple crazy roller coaster rolls. Love the tuna and salmon sashimi.", "business_id": "Bjt3rB73dvSDe1XEPEWc6w", "stars": 5, "date": "2014-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jWpbwcHxQtggzIISVmDGvg", "review_id": "u2x99dbPrkMfCztRDAERNg", "text": "Horrible customer service! I tagged along this afternoon to my husbands 1:15 tee time and they charged me a rider's fee of $17... Just to sit in his cart and watch. He was a single player so it's not like we needed an extra cart or anything!  For that price I could have just played! Ridiculous.  Won't be back.", "business_id": "KHoBFKiWf0pJntUzDQPkgw", "stars": 1, "date": "2013-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BuHLITNSojuC8DrMjFpBuQ", "review_id": "I7Jof0Vr7IMQbD-zTkqPqA", "text": "Chompie's was the other half of our Man vs. Food roadtrip we took after watching the Phoenix show. Hopped in the motorhome the following weekend and had a ball trying out some fabulous eats!\n\nChompie's is a traditional Jewish deli; expensive, huge portions, huge menu and delicious looking pastries.  I ordered a monte cristo, which was fabulous, and my husband had a reuben which he thoroughly enjoyed.  Of course we had to test the Jewish slider that Adam ate on the show, to the tune of $4 a pop!  He had to eat 12 of them in under 30 minutes and after trying 1/2 of one, there is NO WAY I could do that!  It was super delicious but far too filling.  \n\nThe service at Chompie's was great, especially once they heard we were doing a Man vs. Food roadtrip.  Our server was attentive and friendly and she even sent the manager over to say hi and we chatted with him for awhile. He very kindly bought us desert and sent us on our way with a huge pack of bagels and cream cheese for breakfast in the motorhome.  The bagels were fabulous!  We had to freeze some and are still eating them.", "business_id": "IM-9thHqQbBK5tX5MfTzBQ", "stars": 5, "date": "2010-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "V3LFcJ2Xk3Ol-rvgCqRY-Q", "review_id": "zSzrm331NrfRMuYbr3mO_A", "text": "I had to go to Payson and meet a buddy for work, he asked for me to stop at Chompies (Scottsdale) and get a corned beef on rye and a side of slaw. It sounded good so I called the order (for 2) into Paul, he asked me to give it 10 minutes, I gave him 30.\nWent in, order not ready, in fact never placed, so I waited. First I paid, 2 sandwiches and a 2 sides of cole slaw, $33.00\nImmediately I thought they placed an order for 4 sandwiches, nope 2. Since my buddy asked for them , I bit my tongue and proceeded to pay. \nWhen I received the plate, 2 cole slaw (plastic cup the size of a silver dollar) and 2 sandwiches that were about 3 inches high. I first assumed when paying for these special meals the meat would be piled very high, but no. Oh yes, and I got 2 slivers of pickles, limpy and very tasteless. Corned beef, not good, rye bread was ok, lots of holes allowing mustard to squize out everywhere and the cole slaw, just ok.\nThis isnt NYC or SF, $15.00 for a BS sandwich?\nI know the word Jewish deli comes with all the other reviews, sorry, from New York, this place is a poor example of a Jewish deli.", "business_id": "IM-9thHqQbBK5tX5MfTzBQ", "stars": 1, "date": "2013-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0OS1as_5CHdczjzpUJSnRQ", "review_id": "Eb3Vg0w0QzvMojTJIgHuEg", "text": "So having landed at Phoenix Sky Harbour and waiting for my connection out to Prescott, I was asked very nicely if I as a lone traveller would consider being bumped off the flight to allow a guy to get back home to see his sick kid. I was more than happy to oblige and as I'm out her for 6 weeks or so an extra few hours really don't mean that much. So with a $30 gratuity from the airline I thought, what shall I do?\n\nAn then the idea occurred to me that I wasn't all that far from Chompies deli in Scottsdale, a place I've wanted to try for a while.  I hopped in a cab an headed into deepest darkest Phoenix!\n\nSo Chompies is a New York style Deli and I believe they now have 4 venues in the Phoenix area., I wanted to visit this one as its the only one I'd ever known anyone visit. This place was made a little famous when it featured on Man v Food. Id' heard about it prior to that show but it was seeing on there that planted the seed for me to actually make an effort to go.\n\nOkay, this on appearance is just a regular deli and on entry I was greeted warmly. I was shown to a booth and presented with the menu.\nNow when you look around the place you soon realise that the portion sizes are generous even by US standards.\n\nThe menu has plenty of choice sandwiches, burgers bagels and traditional Jewish food too. There's also a kids menu which I have to say sounded pretty good and there was a dedicated gluten free menu too.\n\nI picked Bobs Brisket from the Colossal Reubans section of the menu priced at $14.99 you would be forgive for thinking its a little pricey. However when it arrives it is huge, and I mean huge! It was full of flavour, tender meet, perfect onions and beautiful seasoning.\nHaving seen the size of it I was glad I didn't order a side of wedges billed on the menu as 'full portion sides'.\n\nChompies is the home of Chompies slider challenge which was featured on Man v Food. Its essential 12 sliders filled with brisket, mini potato pancakes and Jack cheese served with gravy and 5lbs of onion strings. Many have tried few have succeeded. At $39.95 its actually pretty good value, and would certainly be worth having as a sharer.\n\nI loved this place, the food was great, the atmosphere great and the prices reflected excellent value, my sandwich and a coke came to $22 (inc tip).", "business_id": "IM-9thHqQbBK5tX5MfTzBQ", "stars": 4, "date": "2014-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pdoPiRAsahmahqFA9gy6BA", "review_id": "et_H0YHtpNkIxnK1_g9AGg", "text": "Unbelievable!  The breakfasts are all cooked to perfection, the bagels, pastrami, coleslaw and breads are all the absolute best quality and taste. \n\nPotato pancakes are a must try - I remember them fondly from my childhood. Hard to find a good latke in south Surrey !\n\nTheir unique eggs Benedictus are all fantastic. I recommend the one on a potato pancake of course. \n\nI am a regular whenever in town as you can probably tell. I have to admit I do factor Chompies in when making a travel destination decision. \n\nSomething here for everyone. My picky 4 year old and wife both love it here as well\n\nEnjoy !!", "business_id": "IM-9thHqQbBK5tX5MfTzBQ", "stars": 5, "date": "2015-08-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "0Fg3bXtWnl9SFALgSqyehQ", "review_id": "zKa4Y3NC-Ed8hK1J0Hh9GQ", "text": "Hands down the best restaurant around. If I were to take one place to a desert island, it would be Houstons. BridgetZ gives me a hard time because it's a chain, but she was also spoiled by living in Manhattan for a while. I still bet she'd put it in her top 5. Things I love:\nHamburger (best in town)\nSpinach Artichoke Dip \nRibs (best I have ever had)\nAhi Tuna Salad (if you are needing to keep it light)\nChicken tenders", "business_id": "jBb5KHHAj4s8hcXVS6QXDg", "stars": 5, "date": "2008-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wZqx1ba606Ollf4KHGZbLw", "review_id": "mpE9UnTq68DftCNiaiTbzQ", "text": "My husband and I go to Houstons as often as possible and especially for special occasions. We have never ever had a bad experience and all the food is excellent. They are very friendly and accommodating and the staff is extremely professional and are able to answer all questions concerning their food. The thai steak salad is amazing. So is the dessert sundae. So is the steak. And the burgers are AMAZING! Even their baked potato is phenomenal. Safe to say if you want good food, go here!", "business_id": "jBb5KHHAj4s8hcXVS6QXDg", "stars": 5, "date": "2012-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "O8ioHuhC6oo0ucMdXIJbHA", "review_id": "66uxv_2SDuyI4SWQTn552w", "text": "always great food and friendly staff.  only negative is the wait!  but well worth it.  Want no wait, go across the street to Remington's at the Scottsdale Plaza and pay 3 times the price for poor quality tasteless food and rude and unfriendly staff.  The wait at Houston's is worth it!", "business_id": "jBb5KHHAj4s8hcXVS6QXDg", "stars": 5, "date": "2014-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "wHKz3EjADr9pvyeZ5lPm7g", "review_id": "Av9MthJN9DCsVQy3wb2wfQ", "text": "One of our go-to places.  We eat here frequently and it's the best if you want consistently high service with outstanding food.  They get it right EVERY time.  I have probably been here 20 times and NEVER had to send something back.  Their Crab Cakes are INSANELY good (although seasonal.. so not always available).  Their prime rib is good, the chicken is great.  I also like their grilled artichoke appetizer.  It's amazing.  Awesome bartenders - so the drinks are perfect.  The staff work together SO cohesively - you would never know whether someone is covering your table or not, because EVERYONE offers to take care of whatever you need.  WE LOVE Houston's.", "business_id": "jBb5KHHAj4s8hcXVS6QXDg", "stars": 5, "date": "2015-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "dXz7Eaw2D-Db1zgH-lXTKA", "review_id": "R8AqEk7NfEquu1QHRIOW8Q", "text": "Ok love, love this place. First time I have ever gone anywhere and when ready to leave was asked did I want to go cups for drinks. We said yes and the waitress got them for us. Iced tea, coffee and soda. The food is great, service great, biscuits and gravy still not as good as Brass Rail. Even on a Sunday right at lunch did not have to wait. WIll go back as often as I can afford the drive and the meal.", "business_id": "68_EJEA9Ibo55EDp3d-nOg", "stars": 4, "date": "2009-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Mjw4NSgefkbryndo0wBOug", "review_id": "g826A2c85Onfv_VD6AYOSQ", "text": "You know it's good when the check out lady at Walmart highly recommends it to two out of town locals. We decided to give it a go and were happily amazed. At first when we walked in we noticed that the decor could use an update, but the restaurant was packed with locals. We were quickly seated, given a minute to order, placed our order and literally within two minutes had our food. Amazing food at fast-food speed. This restaurant landed on our list of return venues.", "business_id": "68_EJEA9Ibo55EDp3d-nOg", "stars": 5, "date": "2014-07-05", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "YN3ZLOdg8kpnfbVcIhuEZA", "review_id": "5mu17PtGl4NZQnQ0AiVFRg", "text": "Friendly most helpful staff ever.  Free attentive water testing, appears to be family owned...  I dig em.\n\nThe final words:  Popcorn machine\n\nNeed I say more?", "business_id": "5ExCFur8Gqt1x278DAvJZA", "stars": 5, "date": "2010-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KjXVm7wglgF7NxIiKltmkQ", "review_id": "uZr1kiFvvrF6hcMNtrKR6Q", "text": "Me and one of my besties had such a relaxing day here. Such a cute place and the pool is a nice touch!!", "business_id": "EaziHWcmjm5nGmPF-CJgQA", "stars": 5, "date": "2012-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8r4vlpolwuBcfK36jDq8cA", "review_id": "-UtOnIo4Q0fX644uoh_W3Q", "text": "So today I ordered 2 pizzas for $5.99 each and pasta. The online ordering process was fine the delivery guy was polite and the order got here faster than last time we ordered. We open up the pizza boxes and one pizza was cut/ sliced as it should be and the other one was not. Now I can cut the pizza myself but that's not what I paid for. We also order on a regular basis and this has never happened. How did this pizza pass quality check?\n\nMind you we only ordered 2 pizzas not 20 for a party. Can you imagine ordering 20 pizzas and only half of them being cut/sliced? Now on a positive note they did call me and gave us a credit for the next time we order and apologized for the mess up.", "business_id": "x2rDXUQhxkUE0DUQ_bFFNg", "stars": 3, "date": "2015-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "41J-D28bvvV0oBnpO6nHrQ", "review_id": "U2FRuhc128Cu4c9HrjoCDw", "text": "Nice place.  We \"pricelined\" a room for $60, so we probably didn't get the absolute BEST room, but it was nice.  Fast checkin.  Excellent clerk.  We mentioned it was our 2nd anniversary and she gave us 2 drink coupons.  We only stayed one night, so didn't really get to check out everything, but overall, I can't complain.  Don't forget your shower cap, because there wasn't one in the room.  \n\nThere were wild bunny rabbits right outside our patio.", "business_id": "CD-2yHTSObgvAhW-pYHfMw", "stars": 4, "date": "2011-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "jqVeTSin5GeRm0ceSg-PBA", "review_id": "4v_YSxf59sk1qo3cB0p4mA", "text": "I took Sophie this morning to Saguaro Vet Clinic for a checkup and rabies shot. It was recommended to me by a friend who takes her animals there, and despite living in Tempe, I made the drive for the vet. I am so glad I did.\n\nAll of the office staff is extremely friendly and does a great job with the patients. The girl who weighed Sophie and did some preliminary checking of her was great - she handled Sophie well and chatted with me while she took Sophie's heartrate and weight. Dr. Ketchmark finished Sophie's physical and gave her the rabies shot (I couldn't look...I know I am a pathetic mommy) and just kept complimenting me on how healthy and great she looks. Plus he clipped her nails for free...I think she was showing up for him because she doesn't let us do that at home!\n\nDuring the week, they only take appointments from 7 until noon, but they are open on Saturdays as well which is nice for the working folk. Sophie's appointment was 7:30 am and we were out of there a few minutes before 8 am. The prices were extremely reasonable - $60 for the physical; $20 for the rabies show - as well. If you are looking for a good vet for your pets, I would definitely recommend Saguaro.", "business_id": "S5ZcvZ7_ZeXXeDxHcEPAlw", "stars": 5, "date": "2009-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8GEVI2ed2dTW4_qYjYLfGA", "review_id": "dDvXlFFy-Y4qAaWQNm61cQ", "text": "Large store with variety but I can get that at another location as well.\n\nThis one has very poor customer service. Long time at cashier check out given there's usually just one counter open. \nSales people on the floor are hard to find coz there are very few n no one really seemed enthusiastic or smiling enough , overall very dull atmosphere for both kids and parents!", "business_id": "2CvVWNI__s1I7ns6w_zILw", "stars": 2, "date": "2011-06-23", "type": "review"}
{"votes": {"funny": 8, "useful": 9, "cool": 9}, "user_id": "fGBQXv5-9eRBjwhm_EL2jQ", "review_id": "P8ebTy_FxXRV7MiP9mxulw", "text": "Not without its inconsistencies, the Scottsdale Hilton Resort is an elegant and beautifully appointed hotel in a location convenient to both Old Town and the local highways.  \n\nThe front desk and concierge service are absolutely top-notch, customer-centric and on their game.  The little details are tended to; good coffee and flavored waters in the main lobby, outstanding poolside bar service, thick cotton towels and robes and clean public areas among them.  In fact, so much attention is given to hosing-down the outdoor concrete that you would never suspect that the area has a water shortage.\n\nRooms were right-sized, neither spacious, nor cramped, and attractively furnished.  Water pressure was good on the first floor, but temperatures were extremely inconsistent and variable.  Beds appeared to be a bit old and not as comfortable as in most Hilton properties.  The available television stations were at least a decade behind current tastes, but high-end LG flat screens were appreciated.  WiFi bandwidth was outstanding, and didn't require constantly repeating a log-in process.\n\nThe Scottsdale Hilton Resort has two restaurants, an independent Fleming's (a top-tier chain steakhouse) and their own Blue Fire.  While I found the food at the Blue Fire to be adequate, I believe that the other members of my family will disagree.  Service is amateurish and slow, while prices are high.  No worries, however, as there are dozens of places to eat within an easy walking radius.\n\nWe checked-in as a family of four, yet received only three sets of towels.  The front desk was apologetic, and promised that additional towels would be delivered shortly.  Three hours later we called again and the extra towels arrived within five minutes.  Yet for each of the two remaining days of our stay housekeeping brought only three sets.  It is an attention to details like this which separate \"very good\" from \"great\" motels.\n\nThere is plenty of free parking, but the campus is very large and long walks may be necessary if you don't park near the closest entry point to your room.  Our room had a locked refrigerator, which I'll assume to be a cash bar feature, yet we were never offered the opportunity to obtain a key.\n\nWe enjoyed our stay at Scottsdale Hilton Resort, and at $119/night found an incredible irony in the fact that the least expensive of the three motels on our cross-Arizona vacation was clearly the best.", "business_id": "ZRrIwqIUMII1b2keMI8QRw", "stars": 4, "date": "2014-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "NkaTRHl-JT97yfPCFpCm_w", "review_id": "XDvzkQ9h20-y0IPKHGXsQA", "text": "Yummy is my description. Love coming here to watch football. Today it's futbol. (Soccer) \nFood is really good and reasonable.", "business_id": "bx5Yc7-_E8wz3Lahpq88mQ", "stars": 5, "date": "2014-06-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DqQS7QjT_7mW4U6HxwNoKA", "review_id": "OAbviJcUmfSDM2foIMcnXQ", "text": "Horrible service and greasy food.  No one waited on us until we had been sitting for 20 minutes.  Then we ordered an appetizer and never got it.", "business_id": "kOh8ZHf8CkFQCwyfDvVJTA", "stars": 1, "date": "2012-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "tHz9cWxwSfcP4qRaPIHvww", "review_id": "UP094ZcS6wqVXIHsG3JAhw", "text": "We desperately needed sprinkler heads at home and were in the neighborhood, thus began our journey into this humungous Home Depot. The outside itself is radical looking - completely different from the regular Home Depot signs/storefronts I've seen before. We entered through the garden section and it was the largest garden section I've ever seen. Flowers, trees, shrubs, etc. dotted every open space like a botanical garden with all the items needed for yard maintenance and care. After gawking, we went inside to wander and stumbled upon the tile/flooring section. (We want new tile but haven't found the right one yet.) During our tile gazing, an employee walked up and asked if we needed help with anything. He was very nice and I asked which aisle we could find sprinkler heads in. He told me aisle 14 and after thanking him and assuring that was all we needed, away he went to help another customer. It was easy to find aisle 14 and get our sprinkler heads. We still managed to wander around some more before checking out. For home improvement stores, this Home Depot really takes the cake. It is ginormous, has tons of items, and the staff is super friendly. I'd definitely recommend it!", "business_id": "PmZ3Ft4aOGpzhpPnF21loA", "stars": 5, "date": "2013-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "e8DXpXcwOPdP25hG2IGwog", "review_id": "mQZ_DRX1uAWqvB0peMkDGA", "text": "Clean on the inside. Looks big but only went inside to get gas so I didn't really get to see how big the whole store was. Somewhat cheap gas for the Scottsdale area.", "business_id": "z7W0sUbrVi2k6R2BR5jtzw", "stars": 5, "date": "2013-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FBb9hihH1hCUz-wCQf4iEg", "review_id": "AiURinvSBFc82xVYeArP3w", "text": "Their meatball subs are fantastic. I know I should try their other food but once I had that sub I was hooked! Pre-sub I enjoyed lasagna, spaghetti, and a nice variety of pickled and pasta salads. The family is great, they will even open the doors if you show up at closing time which we once did. Love the photo of Papa Casella with the Pope.", "business_id": "kEyCMHBnohaWc81omLDfYg", "stars": 4, "date": "2011-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7cAJoqQBmJe_FksnYIuaUA", "review_id": "G6X4a76OzfROgxQyMZXxWA", "text": "I'm giving this a 4 star review because the service was so fantastic, however I found the food to be pretty average.", "business_id": "kEyCMHBnohaWc81omLDfYg", "stars": 4, "date": "2015-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bf4vI1rkkmX4tP0pvw4mZw", "review_id": "pI3rTmk4V_GDmjeoPU0dZw", "text": "Nothing quite like comfort food. \n\nThis Denny's is always clean and comfortable. The food is consistent and the service is always amazing. \n\nThey run our of apple crisp a lot but if they have it order it and enjoy. \n\nAdditionally the revamp of the interior is beautiful.", "business_id": "dPAQrPQn8bzsZqt7QSdKjQ", "stars": 5, "date": "2013-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9MvcUhmwMH9DtM73QRfQcQ", "review_id": "l_-ml76kZcV-tvfNeKjB7A", "text": "I went here for breakfast daily when I was on vacation because of the reasonable prices so that I was able to do some damage at the steakhouses at night!\n\nDon't forget to get your patronage card stamped because after a certain amount I think you get a free one.\n\nThe service was good and the food was Ok but its really hard to mess up breakfast.", "business_id": "GhhpkAkGl4JE_M_Szwegeg", "stars": 3, "date": "2014-07-15", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 4}, "user_id": "fczQCSmaWF78toLEmb0Zsw", "review_id": "C4C3LNyhG_1ZtpJlXMH5NQ", "text": "I knew Sweet Tomatoes was a pretty major chain, and I've visited other locations before, but I just learned that there are 112 restaurant locations in 15 states... that's pretty huge!  \n\nThis location happens to be a lunchtime favorite for my friend Kathy L, since it's close to our office, so we headed over here recently for a filling, somewhat healthy, affordable lunch... bonus: Kathy brought coupons that she found online which discounted each of our meals to just $6.99!\n\nWe both stuck primarily to the salad bar although I have to admit, the soups, potatoes, pasta, pizzas, breads, muffins, and ice cream were pretty appealing as well.  So, the lettuce is a tad bit watery, but the buffet has plenty to choose from and everything is fresh, chilled, and kept clean.  Staff is friendly as well...\n\nThis place is not for anyone looking for a classy place to dine, but if you're hungry and looking to eat on the cheap in a casual environment, Sweet Tomatoes to the rescue!", "business_id": "RbWAL8KYgUp9pNSeLSjXtQ", "stars": 3, "date": "2011-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PmL8qk1tFoOUluBdOLPxFA", "review_id": "OmTbLGNjQosQxE96UYeagQ", "text": "always smiling and happy.\nthey have all the goodies you need when you want to spoil your hairy friend.", "business_id": "Bl7k6FKKEdAwqDm1NpWTQA", "stars": 5, "date": "2011-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "it59nmZvLDEjXU2LMVen7w", "review_id": "MjliQL3YICaULPrWT1CE0w", "text": "Not only does this place have a bar in it - yes an actual bar, they were able to come through when the other Safeway bakery on Indian School dropped the ball.  It is my son's 3rd birthday and we ordered a Planes (the movie) cake 10 days ago. Indian School location called THIS AM to say that the cake was unavailable.  Unacceptable.  Luckily I drove to Chapparral to order at 10:30am.  By 2:30 (or earlier) the cake was ready for pick-up. I will be traveling to this Safeway far more in the future.  Thanks for the safe and the wonderful cake!!!", "business_id": "SK04ABcwoEtvIZ3VOZccPw", "stars": 5, "date": "2014-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "hFG1Lira7tL_PElq6bdAAw", "review_id": "z-Cu1OPnIq7S0XPpConj8Q", "text": "Though I'm not much of a crafter, each time I wander into Micahel's I get totally sucked in by all the strange and interesting doo-dads.\n\nWandering down the aisles, my thoughts usually go along the progression of of what-the-heck to (figuring out what the item actually is) holy-heck-that-is-cool to (looking at price tag) whoa-that-is-so-not-cheap.   \n\nI'll end up with cool odds & ends that I'll end up not using, but thoroughly enjoying myself in the process.", "business_id": "OXJZlVOYZwyrf5cHLmfStw", "stars": 4, "date": "2008-06-21", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "h7v_M_0-YVpSVZ2WD7FpAA", "review_id": "jyGJ2G15Llb3WLf25Ijthg", "text": "WHAT. THE. HECK?! This place has gone to CRAP since new mngt.  EVERYTHING has gone down hill.  They fired all the long-standing bartenders & servers (the ones who knew what they were doing).  \n\nThe last time we went they served our food with PLASTIC forks, paper napkins and PLASTIC plates?!  (surprised our martinis didn't come in sippy cups?!?)  \n\nWill NOT be back, ESP. since the FABBY new ANGEL's & OUTLAWS just opened around the corner - guess who opened it?  The management who kept Devil's running smoothly for 5 years !!  (and the bartenders joined them :-)", "business_id": "M0Pch3_-Gvj45RN1U4I35Q", "stars": 1, "date": "2009-06-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "L0aLRB-OylGJV4mOmq15XA", "review_id": "ztKFXEAp9ssoM_pjpcAgIQ", "text": "I've been going to Dr. Nunnelly for a few years now. The office has always been excellently run as well as the staff extremely efficient and friendly. I love the fact that I can get bloodwork and other stuff done there right on site. In addition to being a dr office, it's also an Urgent Care so I can always get in. Dr Nunnelly has always been right on target with her diagnosis' and resolutions. She found my lack of Vitamin D when no previous doctor had even thought to look! I always refer family and friends to this office!", "business_id": "-wSSZ0v9ca0TuXOLQ0TbfQ", "stars": 5, "date": "2013-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FcnQnV-lVTunG444G-kwRg", "review_id": "ZMlcCyFvpVOoXSyP3Fibng", "text": "I was very happy with my sales person and my purchase. They were not high pressure  and the ring and diamond I purchased were a higher quality and better price than other places I had been. \n\nIt doesnt stop there either, the  warranty plan we recieved was FREE and does not require us to bring the ring in at scheduled intervals to keep the warranty valid (Other stores charged for warranty plans and required the item be brought in every 6 months for a cleaning and checkup to keep the warranty valid) . After about 2 years my wife noticed one of the smaller stones had fallen out so I took the ring back and they replaced the stone no questions asked. Also we can take it back at anytime for a cleaning. \n\nI would highly recommend anyone to at least visit Shane Co. when they are looking for any jewlery item.", "business_id": "BUsmaloKEZeOvXLrSjKWSQ", "stars": 5, "date": "2013-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "drS3ZN6-zA3sr5WM2fG5tQ", "review_id": "tJeX5OgTOWBFZsNNECjxTQ", "text": "Several things on sale. The sales women were helpful and talkative. The first one I talked to was anxious to help me as she apprroached me a few times. As I was leaving the store I saw a shower curtain I was interested in buying, another sales woman approached me and we had a lovely conversation regarding the curtain. She informed me that Pier 1 doesn't do all matchy matchy, they focus on incorporating colors to form a set. Pleasant experience today!", "business_id": "8UC_BhTIcTDcP8OI7EtpLA", "stars": 5, "date": "2011-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gNu8MGdmCLI4jZox-8uksw", "review_id": "VVhF_BhZqLYwiHVIc8x6eg", "text": "Krista is seriously a nail artist! I love how I can tell her a completely random nail design and she can replicate just what I was wanting if not even better! I always get many many compliments after my manicures! But most importantly I am always thrilled at the work she does and enjoy it myself! She is also very patient which is essential to a fabulous manicure! \n\nKrista, thank you!", "business_id": "GKTS7PFoF_GpycUKXDsm_g", "stars": 5, "date": "2014-07-15", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 2}, "user_id": "sQwgFhirdCt6h_g1rbjHHA", "review_id": "Eq0Tqb3idtGRwWRblXI4YQ", "text": "Holy monkeys, I didn't expect this to happen, but my opinion of this place just increased in an explosion of \"YAY\"ness!\n\nI've been going there for some time now... probably nigh on a year. Somehow, in all this time of getting lunches there, I managed to overlook the roasted pork with plum sauce. NO LONGER will I make such a mistake! I feel like I have an orgy of flavor in my mouth right now. Seriously, this is good. I don't know what they did to it. Maybe I'm delusional. Maybe I'm just really really hungry.... whatever it is, I am in love with this food right now.\n\nMmmmm, back to nomming....", "business_id": "aI_RzGMU35cFL1St2HgPkw", "stars": 5, "date": "2011-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IwAqBZ4Uu-aK8l7llpb9OA", "review_id": "WbJrkYKAOlru7t4KsYMt3Q", "text": "Excellent food! My husband and children went last night to get take out food because my brother in law orders all the time! They have best fried rice and kung pao chicken plus my husband said they were very nice and looks like a family run restaurant. I hope they stay in business for long time, I am still depress that Haweli indian restaurant close down. Anyway, try this restaurant, it is the best chinese in scottsdale.", "business_id": "aI_RzGMU35cFL1St2HgPkw", "stars": 5, "date": "2015-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ybKb2vx-ZfnqjDi5tt3hAA", "review_id": "ZURnATtNMDmWs5HyXCx7mg", "text": "My wife and I stayed here for a week last year, and we welcomed the opportunity to come back.  The room is basically a large studio with a large bath.  There are louvered French doors in between the bedroom and the living room, and I just have to be very quiet when I waken since I usually wake up earlier than my wife.  But we love the comfortable set up.  The shower stall is huge and there is a large Jacuzzi tub which neither of us have yet to use (we do have one at home, after all,) and double sinks and lots of cabinet space in the bathroom.  We always get a king bed, and there is not much storage in the bedroom but plenty in the bathroom.  Full refrigerator, no dishwasher or washer/dryer, but we knew that, and there is a toaster and coffreemaker and mcrowave.   DVD player, Videotape player and flat screen TV in the living room, and many recent DVD movies for free at the front desk.  There is an additional smaller flat screen TV on the bedroom wall.  Only tihng a litte different here is the parking--you may not park close to your unit, but the front desk is always happy to give you a ride on golf carts whenever you ask.  The friendly bellmen take your luggage in for you as you unpack and pack your car.  This is a full golf resort, so all of the units look out over the golf course with beautiful picture windows.  There is a huge pool and sun deck and spa, very nice and comfortable for many people.  Only other negative is their effort to sell you a time share--we're getting a little fed up with that when we get trades or getaways via Interval International, and we do not like being harrassed to do that when we make it clear at check in that we are not interested.  In spite of that, we will probably be back a third time, or every year as long as it is available.  We love Scottsdale and this is the second year in a row we have driven 2000 miles one-way to enjoy two weeks in the beautiful desert!", "business_id": "40B5TbtZbiGV4blFR9S6Dw", "stars": 4, "date": "2014-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "PS0lCxjGNeUrKxYSdpW-Aw", "review_id": "ZnpA3ee-PcCAAKHZfDjhJQ", "text": "Fun place for groups! Benihana wouldn't be my first choice for sushi or for going out at all really, but if you have a special occasion for some friends it would be a good place to consider. Pricey food, but I thought it was good. Haven't tried the sushi yet. \n\nBenihana is known for it's tables which are centered around a stove. You get your own chef who comes over and prepares your whole meal for you! They do lots of crazy tricks and entertain the table while cooking. Lots of fire tricks too! \n\nIt's the kind of place you can say you have been to and it;s a fun experience, but you don't need to go back after that.", "business_id": "ishjLG3Sc94ZOelXZZhaIw", "stars": 4, "date": "2007-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "KvWny9qUZJKrqo_LYesgSg", "review_id": "7ii0FbW9TNv4gU2hY8GJ2w", "text": "We went to Benihana because my husband received a $30 birthday certificate from them and my toddler son received his free birthday cup.  We were seated with 2 other families who were also celebrating birthdays with the same certificate.  They were a fun bunch.  Our chef, John was really nice and very accommodating to our son.  He was funny and cracked jokes with us while cooking.  I know it must be a hard job to have to stand there and entertain people and cook and sweat so we definitely were appreciative for him. \n\nThe husband and I both ordered the \"Splash & Meadow\" - which was jumbo shrimp and steak.  Our son had the \"child's\" version of it. Even though hubby's dinner was \"paid\" for, we still ended up with a $74.00 bill.  They added on gratuity that said it was \"suggested\" but had no where to really change it - the only extra line was to add on \"additional tip\".  \n\n\"All of our beef is USDA Choice, aged to perfection and hand-butchered on premise. Served with Benihana onion soup, Benihana salad, shrimp appetizer, hibachi vegetables, homemade dipping sauces, steamed rice, Japanese hot green tea and Häagen-Dazs ice cream, sherbet or sorbet.\"  \n\nI want you all to take a look at this description - and let me say that none of us received hot green tea...and ONLY the people who had the birthday coupon received ice cream.  When we asked if us \"regulars\" could get ice cream, they said we had to pay extra for it when it CLEARLY states on the menu that it comes with our dinner!  Total crap.\n\nAlso, the \"onion\" soup was completely tasteless.  It was just broth with some mushrooms and dried onions tossed in.  I do say that the shrimp and steak was pretty good and even better when dipped in their mustard sauce.  \n\nI probably will not come back again - even if we get a birthday dinner, it's still expensive and it's mostly for the entertainment of the Chef cooking for you that you're paying for.", "business_id": "ishjLG3Sc94ZOelXZZhaIw", "stars": 3, "date": "2013-07-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "p3QX1ZoFOCrin4ojNOVkBg", "review_id": "gsU1JU9uAaVkXQB1mce2Uw", "text": "I was seated one hour ago and a chef has not arrived to cook for us yet. The front desk staff has an interesting strategy of telling people the wait is 4 times longer than it actually is so they can go home early. There are tables of dissatisfied people staring at empty drinks , they've probably had refilled 5 times, as they sit famished and bored waiting for their food. I really wish there were more Teppanyaki choices in N. Scottsdale. I'll remember this visit and how I'm fighting back the exhaustion of being in this establishment for 1.5 hrs and am starving to death.", "business_id": "ishjLG3Sc94ZOelXZZhaIw", "stars": 1, "date": "2015-08-01", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "JCfHBL4zGkPjtKVd9hS_Bw", "review_id": "QqM-_i_rxZR3OVAAQ-kj_A", "text": "A great breakfast certainly has its roots at the Scottsdale and Thunderbird location of The Good Egg (13802 North Scottsdale Road, Scottsdale, AZ  Phone:  480-483-1090).  The Good Egg has 17 establishments located in Arizona.  The Scottsdale establishment is a Heart Smart certified restaurant, so they can truly attest to healthier portions and options for those watching their waistline.  For those wanting to partake of larger portions and delicious food in all of its glory, The Good Egg can surely assist too.\n\nTheir menu boasts everything related to the egg.  One can have an egg cooked to order in a variety of styles (scrambled, frittata, Benedict, omelet).  Looking to \"carbo load?\"  The Good Egg has many choices in their pancakes and French toast department.  If you are looking past breakfast, for lunch they also have various combinations of sandwiches and salad to choose from as well.\n\nEntering The Good Egg, is to enter official breakfast time at your mom's kitchen growing up.  The walls are lined with yellow flowery wallpaper, and rooster decor interspersed throughout this location.  There is ample space both from tables, to booths, to even a small counter section.  If you want to partake of the nice Scottsdale weather at this time, there is outdoor seating on their patio as well. \nAdvertisement\n\nThis morning, I found myself on a mission for a great breakfast sandwich.  Their sandwich consists of your choice of egg (cooked to your order), choice of meat (i.e. bacon, turkey sausage, ham), choice of bread (wheat, bagel, white bread, croissant) and topped with cheese.  Home-style potatoes come with your sandwich.  I built my sandwich with scrambled egg well done, crispy bacon, wheat bread and cheese.  When my sandwich arrived it was of extremely ample portion, stacked high with all the ingredients I requested.  The bacon was especially crispy, not runny at all.  Just the right amount of cheese and bread toasted well to hold my scrambled egg together.  With my sandwich I received about a cup's worth of their home-style potatoes, which were also crispy and diced into small bites. \n\nGoing on a Friday morning to The Good Egg was very peaceful indeed, quick service with a smile, delicious food that will keep one's stomach full for awhile.  Do note that this establishment can get quite busy on the weekends, during their morning rush.  Best to arrive early or after the breakfast rush.  Regardless, The Good Egg is truly worth the wait.", "business_id": "nP9zQBRNSxlnU8BsbqYI5A", "stars": 5, "date": "2011-06-20", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "tHz9cWxwSfcP4qRaPIHvww", "review_id": "wNKF1xou0Tm3JW6xySYn1Q", "text": "This place has some fantastic looking outdoor furniture. When first entering, they have two outdoor displays that really help give you a feel for how to setup your patio. Unfortunately, we were not in the market for patio furniture but wanted to look anyway. I loved all the wood, stone, and metal pieces. Everything flowed together well and they had some nice setups. An employee informed me they have a lot more on their online store, which would help give dimensions and such. I appreciated it this, since I am more of an online shopper but it was nice to see what they had in stock and on display. I would definitely recommend going here if you are in the market for patio furniture. The prices did seem a little high end, but the craftsmanship really stood out.", "business_id": "b3zJrtYqVg4ZXmiLN8V84w", "stars": 4, "date": "2013-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ygt0Bl_OXOV1RSLEskfofA", "review_id": "RVtF74sSZsTZngvwGjtKLQ", "text": "I have been a loyal Lather fan for a couple years now and will continue to be for life!  The store is open and very clean and the service is top notch.  They are so helpful yet unobtrusive which is a rare find for a beauty store.  \n\nThe products are truly fantastic.  They strive to use natural ingredients when possible and everything is such a great value for what you get.  The best part if you are unsure, ask for a sample and they will send you home with anything to try out.  My must haves from this place include:\n\n\"  foaming bamboo lemongrass scrub will knock your sucks off.  Hands down best scrub I have ever had\n\"  vitamin c peptide serum is super luxurious and perfect for daily use\n\"  10 minute brightening glycolic mask will refresh and renew your dull skin\n\"  white clay facial mask is perfect for sucking grime out of your pores\n\" eucalyptus foaming foot scrub with ground up pumice stone will scrub anything off and clean\\soften your feet\n\" almond shave cream is amazing\n\nTIP... Ask to try all scrubs at the sink...what a great treat while shopping!", "business_id": "mAMeCLoTQUf3Zb808deTYg", "stars": 5, "date": "2013-06-05", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "WZCAwPXauKtNoAhHK2-pCA", "review_id": "W4gvoUqtUtnU21WaAohfcw", "text": "I had called the 800 number from the web site last Wednesday to place an order for a fairly expensive bouquet of exotic flowers for my wife for our anniversary.  To make sure I fully surprised her, I set up the bouquet for delivery for this past Sunday, so I wouldn't have to \"run out for a second\" to pick it up.  I live in a gated complex and gave them all the information they needed to enter the complex and find my unit.\n\nOn Saturday, I called back to make sure they had all of the proper information and to call my cell phone if there were any problems with delivery.  I even additionally requested that the delivery occur with what they term the \"second batch\" of deliveries that are supposed to go out at 2PM to make sure we were around, as we were going to get brunch that morning.\n\nSunday came and went, no flowers.\n\nI called back this morning (Monday) and they explained that they attempted delivery but couldn't get through the gate.  I know for a fact they never attempted delivery because I never received the phone call from the front gate.  They added another whopper when they claimed to have called me and left a message when they couldn't get in.  My cell phone hadn't rang all day.\n\nThey get another star for cancelling my order without a hassle.\n\nMy wife will be getting a Tiffany necklace instead which was only a little more expensive (have to make up for being a day late) but will hopefully last much longer.", "business_id": "0QIGfTyDPYd7piDe82m1-g", "stars": 2, "date": "2007-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZHTUQk1PDuw5QSrF6af5ew", "review_id": "xosX7H2bs1W8Cw_QqAmSTw", "text": "We were taken right on time. Everybody was very nice. My daughter gets super  nervous and her fears were eased.", "business_id": "P-VUqVXFRZ_8-2e24C6O6w", "stars": 5, "date": "2015-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RRMYa5HpeQRRUpFpxVLuHA", "review_id": "MsMhjaG2g1cwkf-u5k8jXQ", "text": "Vicky and Tammy are wonderful! Clean, Easy going facility with fair prices and consistent service. It's a bit of a drive for me but they make it worthwhile :)", "business_id": "ABdlmhyM67WAD_dFRKIa7A", "stars": 5, "date": "2015-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "_LsbT_uW0UE6rhsWiAIrsg", "review_id": "Y278ueWWuSukv79s2sOUZA", "text": "great place and the owners are wonderful.  It is hidden, but filled with treasures of all kinds.  Everyone that comes here to shop from all over love it, and, do not want to leave.  COME and SHOP, you never know who you will see.  THE jewelry and clothes and accessories are wonderful.", "business_id": "kNQXfXfe6nd_AJqm2UfXDw", "stars": 5, "date": "2014-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ky5-mOk8-9M-NlLr8Jh8rA", "review_id": "loScr6rj6JvCFSEtKb8WJg", "text": "I love this place and not just because it was the site of my 1st date with my BF.  It's quaint, romantic, and the food is generally excellent though we tend to order the same things every time - truffle pomme frites with 3 dipping sauces including house made ketchup, frisee salad, oysters, and any of their souffles.  \n\nThe bar is fun though it can get loud.  We generally avoid the dining room unless we can sit next to the windows or the mini Eiffel Tower.  Several of the tables have an unpleasant view of the service area and are in the pathway of the restrooms.  Our favorite is the garden patio which has great ambiance with nicely situated tables, twinkle lights, plants, heaters or misters depending on the season.  Very romantic if you're not sitting near some of the loudmouth Scottsdalites who apparently are 'regulars.'  The front and side patios are fun too - great for people watching.  \n\nService is generally good but can be spotty in the dining room. That's the only reason it's not 5 stars for me.  There's a great waitress on the patio - tiny, blond young woman whose name escapes me.  She knows the menu, always has great recommendations and is incredibly attentive to all her tables. Bar service is always fantastic.\n\nSo happy to have this has our neighborhood French place - great food, great ambiance, great people!", "business_id": "GIGI8bJfN6HyPzmEW-QqjA", "stars": 5, "date": "2010-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JujazW5MJRQzQ4vIS8jGng", "review_id": "i5uK2ql8V2TV0itWZ-_3JQ", "text": "When I come to Scottsdale in the springtime I invariably make a stop at Zinc Bistro.  The ambiance is very nice and informal, with a small-scale replica of the Eiffel Tower inside.  The crusty French bread is good with their mussels.  You can't go wrong with their sandwiches and salads.  Don't forget to order some frites.", "business_id": "GIGI8bJfN6HyPzmEW-QqjA", "stars": 4, "date": "2013-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_FrfOUDFmjq8E77Cr7ZOww", "review_id": "qB4KZ855zt2CSu0U0sjKgA", "text": "If you haven't caught on yet, get the mussels! I was very hesitant at first because all I had heard about mussels were that they were generally slimy and hard to swallow. Not here! They were AMAZING! The broth that they are in is easily THE best broth I have ever had! I ate at least two of their bowls of bread dipped in the broth alone! Absolutely delicious.", "business_id": "GIGI8bJfN6HyPzmEW-QqjA", "stars": 5, "date": "2015-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3vML-LnH0dIyHCrqF5xEYw", "review_id": "Npp-Ot7V4agXQ5hR3-1z2g", "text": "Had a wonderful lunch with my sister and friend yesterday. We ordered the calamari, Oriental salad and the eggplant sandwich. All three were delish. Vanilla bean cheesecake was terrific. We all shared. Our waiter was awesome. Always a great time at the Factory.", "business_id": "ewZlgc22xN5NNQ1H7U6Y7g", "stars": 4, "date": "2011-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "d9f92XBgUNv45PTTkJu7Sw", "review_id": "L2hArjFGBmhUocs5FWrKsQ", "text": "We ate here today for lunch.  Although the food and service is good, the cleanliness procedures are bad.  Flatware is placed directly on table top where people put there dirty elbows, purses, even sit there kids and dirty diapers.  Also, I wanted a refill of diet coke and the waitress asked a customer at a nearby table if he wanted tea refill.  She took both our glasses. When she returned,  my diet coke tasted like tea at the bottom!  She mixed my glass refill with a total stranger!", "business_id": "ewZlgc22xN5NNQ1H7U6Y7g", "stars": 1, "date": "2014-07-11", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "rX3BvECGJh8DLy23mgeaKg", "review_id": "robOy6VfyIDdtasXNCV-kQ", "text": "This location of cheesecake factory was reasonably nice.  All the typical things that you would expect.  They have that crazy long menu, even at lunch.  I decided to try something from their low calorie menu today, getting the grilled chicken dish.  Overall, there wasn't anything bad about it, it just wasn't all that great.  No one in our party seemed all that excited about their food, again, nothing really wrong, just their standard faire.\n\nThe service and management at this location were top notch though making it possible to still have a pretty good experience.", "business_id": "ewZlgc22xN5NNQ1H7U6Y7g", "stars": 4, "date": "2015-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "zzNIbMyD6dAGJS-faAlyNA", "review_id": "xZiH63dmFc2C4XO0cwapeQ", "text": "Just moved in a few months ago.  Big thanks to Chase (& management) for making sure my AC was repaired immediately last  Friday afternoon.  So far this place has been 5 star!", "business_id": "vY9XP-H9f6g89H0fPUdlHg", "stars": 5, "date": "2014-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "nWxUEvNLoRH4MHuKL5A7wg", "review_id": "7oK3q9Y2GI1b5iJ7MUqJ1A", "text": "Food is ok. Service sucks. Staff makes me feel like I should not ask for a sandwich. Girl was on her cell phone and did not hang up to take my order.  Is it too much to ask for service with a smile? They make sure you see their tip jar.", "business_id": "8pqdYVXF17grawfgP2fZTA", "stars": 2, "date": "2015-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7UtIV8Gj96aNB3S0cmkpWg", "review_id": "H9Ezl4A39cfTeBOw86vJQw", "text": "With 3 kids in college, I haven't done a lot of shopping the last few years which is probably why I received a \" we want you back\" offer recently in my email. I visited this store on Saturday hoping to treat myself to something while taking advantage of the sale and my welcome back offer. I tried on several things and decided on a lovely white( go with everything blouse).It was full price although there was a store promotion going on this day. I took the promotion price in to account along with my welcome back offer when deciding if the purchase would fit with my budget. However, when checking out I was told I couldn't use my email offer because of the current in store promotion. I would have totally understood this had my offer been a percentage off but it was not - it was $25 off a $50 purchase. I read all the fine print associated with the coupon before I left to go shopping and nowhere does it say it can't be used with another promotion. Nowhere. I didn't make the purchase - So much for welcoming me back Chicos.", "business_id": "S8R2GjXkEaiggIoX-Z4vzQ", "stars": 1, "date": "2015-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "PS0lCxjGNeUrKxYSdpW-Aw", "review_id": "_RJwhodGOT_91lNas2NVDg", "text": "I can't believe I went all these years without shopping here!\nActive Body is a casual women's boutique which is similar to Electric Lady Land minus the snobby sales people. The prices are still moderate to high, but they had a lot of cute designers that are hard to find in the Valley. I was as I mentioned extremely happy with the sales girls who worked there. Most boutiques I have been in lately in Scottsdale are full of sales girls who feel they are to good to talk to the customers, and if you do talk to them they quickly answer and move on. The Girls here were so nice and accommodating, it was the best customer service I have received in awhile! \n\nI would definitely recommend this place to add to your shopping trips, especially if you have some money to burn! Active Body Features, dresses, pants. tops, shoes, active wear, lingerie, and accessories.", "business_id": "7oq94zFeIx169iLXa268XA", "stars": 5, "date": "2007-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ypEj7iKcbYsJs6Lj4mMR_A", "review_id": "HQyo9I-roYmMm6I7HpEIPA", "text": "Customer service was so so. Unfortunately for my girlfriend though, the tattoo work was so so as well. She received one by mark. A simple corvette symbol. The shading is splotchy and the lines are not straight. Disappointing considering how simple of a tattoo it is. Keep shopping.", "business_id": "nb7OvZFB1CoZCj-Yruuk-Q", "stars": 2, "date": "2014-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Wd79xttTkXmaBLSOkwwDIQ", "review_id": "QX7XDOw3xcgmaVNfhIi1dQ", "text": "Let me start by saying I love the food at Flo's. I don't think I have ever been disappointed in anything I have ever eaten there. The curries are a standout for me; particularly the Malaysia Cashew Beef and the Green Chicken Curry. Yum. Well, the hubby hated the atmosphere...too noisy due to concrete and scraping of chairs on said concrete...so if we want Flo's for dinner it is carryout only. One of my gal pals is always up for going out to lunch and loves the food at Flo's, too. We go there fairly frequently. Or should I say, we used to go there fairly frequently. Monday was the last straw. We sit down, with menus to the side and start yakking. A minute or two goes by and before our server has even come by, the food runner plunks down our salads and fried won tons. Now mind you, we have not ordered food yet, let alone DRINKS. Are you kidding me? Who serves the salad course before drinks are even ordered? Tacky. Super tacky. We looked at each other incredulously. Now here comes our \"charming\" server. Who waited on me last time I was there, by the way,  and was every bit as \"charming\". She opens with: \"Are you ready to order\" no \"Hello\", no \"May I get you something to drink\"...girlfriend is cutting right to the chase. I look up and simply say I would like an iced tea. Gal pal Sue replies, \"Yes the same for me\". Then Ms Personality asks if we are ready to order. I say \"No\" as coldly as she asks us. Yuk. What a buzz kill. Okay. Things went fairly fine after that. She came by two more times (with a little less 'tude) and on the third we did order. Of course it came out with lightening speed, and of course it was delicious. It is also such a good deal for lunch with most entrees served with salad coming in at around 7-8 bucks a pop. So, I have a couple of questions: Is the management so bad that they make everybody miserable who work there? And why the rush rush rush? It is a large restaurant, we were there at the tail end of lunch, and clearly not in a hurry. The joint was half empty. I have waited tables and I know that working the lunch shift kind of sucks because you don't turn your tables. But I tip accordingly if I overstay my welcome. Good look doing that at Flo's. We were still in and out of there in less than an hour even with our delay tactics.", "business_id": "H7KzlC0-o1wIhlGg-Me5Ag", "stars": 3, "date": "2010-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Cy0m8kpS3rh9-pJE8gTvoQ", "review_id": "MOZ6zn5_t-yhpBpN_B_EyQ", "text": "First timer. The service was good. We enjoyed the Asian pork and pot stickers. Very reasonably priced. Will have to go back to try more items. It was different than the normal Asian tastes, I liked it.", "business_id": "H7KzlC0-o1wIhlGg-Me5Ag", "stars": 4, "date": "2013-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "3gcWln_pMrg_Qt89BlfEUg", "review_id": "cgCFse0w-wOjm1eTT8Fl7Q", "text": "I have stayed in this hotel a few times. I think overall it's good. I am happy with the golf view. The restaurant is alright.\n\nUpdate 9/7/07 - I stayed over at this Hotel again....really great customer service!", "business_id": "SYqTY48DJa1cYhglvmgvsQ", "stars": 4, "date": "2007-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lMS9mDMkdKZQ79NBot8srQ", "review_id": "Rg5PznxWAVU2Y-_KpE8lmA", "text": "wow!  such a beautiful place!  from the golf course to the bars and outside patio, it's great.  We went there for Infusioncon and it was awesome!", "business_id": "SYqTY48DJa1cYhglvmgvsQ", "stars": 5, "date": "2013-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "68Ci9UgVIVEiCGXy05loLw", "review_id": "x48RYU0oW-Z-5QDG3437yA", "text": "Had very little free time during my recent visit here so I can't really comment on the pool, or lazy river amenities that others have spoken of.  But what I can review is the friendly, personal service that every employee here makes a priority and the clean, functional rooms that you expect from a Westin.\n\nThe resort is large and located in an area of shopping malls and office buildings so it is perfect if walking to either of those is high on your list.  The banquet facilities are large and most open out on to the outdoors which make breaks nice.\n\nThe guest rooms are standard sized with all the amenities that you need including a layering of duvets (perfect cuz who needs a heavy duvet  when it's 120 degrees outside?) free in room coffee, and a bathroom with a stand alone shower which has excellent water pressure and a rain shower option.  Internet access is a daily charge.\n\nIn the lobby bar- there are plexiglass cages that I don't suggest you go anywhere near if you have a fear of snakes.  One has a couple of rattlesnakes in it, the other a Hila monster and still a third a leopard snake.  Fascinating!  And I have it on good authority if you go on a Tuesday around noon- you can see the local herpetological society (is that the right name for those who love snakes?) feed them.\n\nSpeaking of the lobby bar- the bartender , Nick was just a great guy.  He is exactly the kind of bartender you want- affable, knowledgeable and just fun to talk to.  And he pours a good drink too!\n\nI liked the common areas that include fire pits and cushy sofa areas to relax and enjoy a drink.  And the vista across the golf course and water is lovely.\n\nI didn't use the spa or any of the recreational facilities so I will have to review those on another visit.  \n\nSo my headline?  Reasonably priced, comfortable lodging close to shopping where the staff go out of their way to be pleasant.  Yep- I'm a fan!", "business_id": "SYqTY48DJa1cYhglvmgvsQ", "stars": 4, "date": "2014-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lAXxmhn_JHMNNVziHRnvmw", "review_id": "2DJxWgqirOFE-y_pId5RbQ", "text": "Stayed here with my husband for a work function. The staff in the lobby was very pleasant and helpful. The room had beautiful views of the golf course and had a great view of the bagpiper in the evening time. The pools were very nice... Although I didn't care for the faux sand beach. The sand was very coarse and got tracked everywhere around the rest of the pool area. Kinda hurt to walk on it with bare feet. The lazy river is great... Very relaxing. The food and drinks around the pool are a rip off and not that great, but I realize this is Scottsdale and the norm for the area. But still... the food was pretty bad... Reminded me of a hospital cafeteria quality.", "business_id": "SYqTY48DJa1cYhglvmgvsQ", "stars": 4, "date": "2015-07-08", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "qYvz3hKtDlPGcU7r03lWyg", "review_id": "9RwQ9Ueoyv2WZ8S3BqV5yA", "text": "Nordstrom Rack...I heart thee!  Seriously, i'm not a fan of discount stores but how can I not buy designer jeans for $70.00 and cute plastic belts that were originally $75 for $30.  \n\nThis place was super busy for a Friday!  I don't blame them...I would play sick as well to go shopping and get some really good deals.  Just be prepared to wait in a long line to make your purchase and dig through piles of clothing to find your size.  If you are willing to do both, then this is your place to shop.", "business_id": "WowrRUKvjiLX4zT12xU_yw", "stars": 4, "date": "2009-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "uZbTb-u-GVjTa2gtQfry5g", "review_id": "aGq676jRJDcUNpSOY88yVQ", "text": "Good selection of clothes in various sizes and styles. They also have a section of accessories, beauty items, and shoes. Occasionally they will have an exclusive designer sale, where you can find clearance items from designers such as Alice and Olivia, Diane Von Furstenberg, and Proenza Schouler.", "business_id": "WowrRUKvjiLX4zT12xU_yw", "stars": 4, "date": "2015-06-21", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "e8DXpXcwOPdP25hG2IGwog", "review_id": "H_2kWKOs1l7SCqkhBNCKng", "text": "I have fallen in love with World Market so much. I love going in here because every time I see something new I want. The whole store is perfect. It's so need and tidy and always put together every time I come in here. The employees are so sweet and nice and always ask if you need help finding something. I love the food section especially because of all the small little treats and snacks they have that you can't find at a regular grocery store. All of the home accents and decorations are so well made you can just see it by looking at it, I want to buy everything seriously every time I come in here.", "business_id": "0Gu2cpJ5x9ZZfDDHohBY_A", "stars": 5, "date": "2013-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "y4JCKsEm0KlwtmHpZhbA4A", "review_id": "Ez6bgRPApUW3KKs3jVUkIw", "text": "I fully agree with Bil Z. --- the food is a little overpriced and not worthy of 5 stars, but the concept of this restaurant / movie theater makes up for it many times over.  It's surprising there aren't more of these places around.  The food is on par with typical 4 star hotel (Hilton, Hyatt, etc.) restaurants both in terms of quality and price.  The decor is reminiscent of art deco style theaters.  Sound and projection quality doesn't compare to a large chain, but the intimate atmosphere makes up for it.  Here's a tip -- go to restaurant.com and you can usually find coupons for $25 off which can be purchased for $5-$10.  Enjoy!", "business_id": "-fsCfTYEnJ4s6yStgBnQig", "stars": 5, "date": "2006-08-08", "type": "review"}
{"votes": {"funny": 2, "useful": 9, "cool": 8}, "user_id": "gvagj7As9OEDZ_BgufhtEw", "review_id": "qBuUyMqMGFTZ2I3kVTI0Iw", "text": "Want a nice glass of wine while a talented stylist makes you look oh-so glamorous?\n\nWhat I love about Choppers is that even though it is located in N. Scottsdale, the atmosphere reminds me of a chill, urban salon you might find in CenPho. If you are looking for a tame, stuffy salon, this place is not for you. Kelly, the owner, has decked it out in the most rockin gear possible....zebra print on the walls, big tiki heads, red, black, leopard print, old records...you get the idea. \n\nThe stylists are as unique as the ambience. Each one boasts a specialty...you can get your basic cut, color, highlight...or, if you're like me...I went to Hot Red from blah brown. ( YOU MUST SEE AMBER IF YOU LOVE THE PUNK/ROCKABILLY LOOK!!) The place is awesome, the service is great...and of course, the price is right for all you punks/greasers/rockabilly chicks...and the rest who just want the basics...", "business_id": "0nUI6eiZ5uT70qD1Ht9VMg", "stars": 5, "date": "2007-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gaWHlTKOTXMsyf3X8VuplA", "review_id": "ACXIHtgvW5biA9rSsHo_PA", "text": "Excellent ! This Salon is so cool, has great energy, is very unique, and  the staff is super nice. I had a glass of wine while Kelly was doing my highlights, he is amazing I have a lot of hair and  he did an awesome job with the color & haircut. I am so coming back to see him. \"I love this Salon\" I highly recommend Choppers.", "business_id": "0nUI6eiZ5uT70qD1Ht9VMg", "stars": 5, "date": "2015-08-09", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "c-hv-FImXaBssSnfbxdOrQ", "review_id": "UxbRrTWII3QXwvWTMKODTQ", "text": "Everything here is amazing! This place helps inspire great design ideas, and has numerous high quality items to deck your house out with.", "business_id": "N_SN6NXnXo-Ik30xm8sSHA", "stars": 5, "date": "2013-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tDGOpaWUKuxFh18mAVwIYw", "review_id": "_QyU1EujDdpzKWm42FHsnA", "text": "We dined at Arrivederci over the weekend and I wondered if it was the same restaurant I reviewed in December.\n\nWe had reservations and the waiter that greeted us gave us the option of a couple tables - we selected one, and he said no, that was for four people (they why was that an option???) I didn't care to sit at the table for two next to a party of 8 + a baby, so he sat us at another table for four (so if this table for four is OK, why not the other one??)\n\nI was sooo looking forward to that nice, warm fresh herby bread roll...it came, but not so fresh or warm. meh. Not being overly famished, I ordered the cheese ravioli with arrabbiata (spicy) sauce. Flavorful, yes, but not spicy as described. The homemade ravioli were large and flavorful, though. The veal carciofi with lemon caper sauce was good, but not great - the sauce was not lemony at all; the veal was cooked to tender, but again, meh.(we had gone to Nick's a couple of weeks ago and had this dish & it was awesome) \n\nThe place was busy - which I'm always happy to see in this economy. We have seen our waiter when we've been there on previous visits - he's not new to a busy night. He wasn't over friendly but did answer our questions, took our order, brought our drinks then went missing. Until of course, it was time to bring the bill.\n\nIf this had been our first visit, it would be our last. Still, it may be a while before we return - there are many more locally-owned Italian restaurants that will be all to happy for the business.", "business_id": "fmWyI5ec05F8PJpx3eNpLg", "stars": 2, "date": "2013-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HmCOlK-OZSUDgvBGRTQ6tw", "review_id": "lqAWN6fBAVHrJABAyYVoiw", "text": "I've been there twice now and had excellent service.  Had 3 friends with me who all liked their dish.  3 out of the 4 dishes were amazing while the 4th was good but nothing to be happy about.  gemeli was great.  and my chicken f alfredo was great as well.  Bread and pesto was great too for the price you are paying on the meal.  I will be going back more often.  Once a week.", "business_id": "LAnM6eeP_TVMGs97YmdC5w", "stars": 4, "date": "2009-07-28", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "90a6z--_CUrl84aCzZyPsg", "review_id": "4Iqb5UEz-j3Ev8GG2xizrg", "text": "Really nice older couple run this place, they provide next day service when I ask (no extra charge), have the lowest rates in the area, and they also fix buttons/stains for free.", "business_id": "n8xZIU1PZz3Um0QhJnCfcw", "stars": 5, "date": "2012-06-05", "type": "review"}
{"votes": {"funny": 4, "useful": 1, "cool": 0}, "user_id": "801mMnd8E2PGoRB9Nc0UhA", "review_id": "qy5WA44cxEzXVe3ZQcDF1Q", "text": "I'm clunking down five stars on this one. First off, for location. Like the chop and wok, it is right next to my house. This allows for easy stumble home. Second off, the band they have is pretty good. They play the hits, and some dwight yoakam. \nI think its about $7 for a jack and coke. Which, isn't too bad. \n\nThe upside - cougars\nThe downside - everybody else is 50+|\n\nThe owner lady - Gwen (?) she is pretty nice, apparently its her son in the band.", "business_id": "d840tbYJSVn8Fu-n5XRJTw", "stars": 5, "date": "2010-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aAdWc-4NhK0js0szR6ku9w", "review_id": "Kb4r4tq6aF_PrRYbbowpbw", "text": "We have been bringing our dogs to Scottsdale Hills since we moved to the Valley about 4 years ago.  Dr. Besemer and Dr. Kieran are absolutely wonderful, as are all the vet techs here.  \n\nWe have one dog who is extremely anxious with strangers, and they are always so gentle and patient with her.  We really appreciate the bedside manner everyone has with our dogs - it gives us peace of mind that our dogs feel comfortable with the scary vet!  We especially love Dr. Besemer - we can go 6-9 months between visits and he still remembers all the little things about our dogs including their quirks, favorite things, and their more memorable medical situations.\n\nThe facilities are very clean and their pricing is fantastic - you really get \"Scottsdale\" service for not-Scottsdale prices.  We have paid much much more for standard exams and vaccinations before when we lived elsewhere.  They are very forthcoming about their pricing; anything above and beyond a regular charge (i.e. office visit, vaccination costs) they will quote to you.  One of our dogs recently had surgery and we were floored by how inexpensive it was.  \n\nLastly, and one of the most important things, is appointment times.  Their hours are great, and we can easily work vet appointments around our busy work schedules.  But even more, when there is an emergency, they will make sure and fit us in during hours and they have a great after-hours emergency service that they recommend (and Dr. Besemer's wife works there, which reassures you that you will get the best care possible in an emergency situation).\n\nWe recommend Scottsdale Hills to anyone we can!", "business_id": "ul28DO_afdK_gWDLqmudeA", "stars": 5, "date": "2013-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0dU0TTxkJ_Bul4sur5U2zQ", "review_id": "cIaZUKiIzu-XC6k9zCoxww", "text": "There are few times in life when you meet a Doctor and team that care so much about their patients that they put your needs above their own. Douglas family dentistry is like that. Where you can go and feel co.pletely comfortable.\nI have been going to Dr. Douglas for over four years now. Originally, I HATED going to the dentist and didn't  go for over three years. One day I finally got fed up with the pain and made an appointment. \nFrom the moment I came in they greeted me by name and walked me through the entire process. During the cleaning, the girls were very careful to make sure my gums didn't bleed and my head was comfortable. Once the doctor came in he said the tooth cavity was deep and I may have to have a root canal but he would try to save it. Well.....four years later and my tooth is still doing perfect! Their affordable prices also made it possible for me to begin invasalign. \nI highly recommend Dr. Douglas and his team if you want the best smile in Scottsdale.", "business_id": "aCSK6smpWUS1rRiCcS_Paw", "stars": 5, "date": "2015-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JgnDbqW9IjFTQRtp529S0g", "review_id": "Eninuy8TyLvRn-Q0zFeBuA", "text": "Update - after a tree fell over in my backyard and landed on a section of the fence, Marty came by the very next day to assess the damage and replaced the section that had fallen victim to the tree. What's amazing about Marty's product is that it actually held up under the weight of the tree; it just became a little stretched out after supporting 2000+ pounds for 24 hours.", "business_id": "WV_JBM_2QtRn40WDlQaTKw", "stars": 5, "date": "2014-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "VsdK3A7VzyC-tMYC3WUC2g", "review_id": "A573NZtmSpThGRZKJEhdDQ", "text": "There is one reason, that sticks out like a sore thumb why I have them 5 stars.  THEY HAVE MARGARITA BRAND PEPPERONI!!! Seriously this is like the only place in town I could find it. When I walked in and saw \"Boars Head\" brand I was really irritated that an Italian specialty grocery store would sell Safeway grade deli meats. But then I asked and they had it. So amp'ed.", "business_id": "pmIJn8K3offcYUsrFCWAaQ", "stars": 5, "date": "2014-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1E8lXDgdDLB35jSWT49OOg", "review_id": "btfux70HnwzofaJq0e5bag", "text": "Food's pretty good, fairly priced. Great family owned vibe. Had to walk the kid at the register through how to apply my coupon (first time the total didn't change). \n\nHigh chairs but no changing table in the rest room, so next time will probably get the order to go.", "business_id": "AH2pJa2nfvxXkfFP1P-waw", "stars": 3, "date": "2015-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yPiU7f2L6y5t7x83-88NfQ", "review_id": "iI30FSK6t3uesdTbu3OFXg", "text": "Found this restaurant via Yelp, and was very happy with it. Our party of four enjoyed each dish on the table (ravioli Nina, veal saltimbucco with fettuccini alfredo, veal francese with rotini in a fresh tomato sauce, spaghetti bolognese), along with an appetizer of the gnocci. Gnocci were delightfully lush when shared, but might have been overwhelming as an entree. (Yes, there IS too much of a good thing when it comes to rich calories). Conversation at the table slowed as we feasted--- always a sign of tasty dining. The meal was served with bread/olive oil/balsamic vinegar that was readily augmented by butter to match one diner's desires. House chardonnay and chianti were sipped appreciatively.\n\nService got high marks from us, as our server was personable and well-versed in the foods on the menu. A nice touch was that used silverware was replaced for each course -- a small thing that nonetheless added a bit more elegance to the evening.\n\nDefinitely recommend a visit here.", "business_id": "gHKB66up5VluCWT4vuSZpw", "stars": 5, "date": "2011-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Dlbx3QaQMrgjg61fi79-uA", "review_id": "tjOOo6mXOuDWeX7CpTIRnA", "text": "Had a great meal and good wine last night with friends. I have to admit it was the best Sea Bass I have had since moving to the valley. Pretty good bottle of Italian Red was recommended and we really enjoyed it!", "business_id": "gHKB66up5VluCWT4vuSZpw", "stars": 5, "date": "2015-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zMf9E58z2oWb5uFTeL4UBw", "review_id": "nXg7DHCS7LhTG-L4JncrOQ", "text": "Had dinner here tonight for Father's Day. Beyond great service. I had the Father's Day special, that came with a Caesar salad, filet mignon, a side of my choice and a desert all for 59$. The filet was delish, so tender and savory. Mother loved the baked 5 onion soup and the veal chop. Dad had center cut prime ribeye and he LOVED it. \n\nNow on to the waitress, Jane was not only very attentive, but she was hilarious as well. Many very polite servers and I believe managers were always on deck. We, not for a minute, felt unattended. \n\nNow on to prices: for four of us and we each had a full on 3 course meal, as well as wine, margaritas and 3 shots of Hennessy with desert and coffee came out to 430$ including a 50 dollar tip. \n\nWELL WORTH IT! Great restaurant, I'd recommend it to those that love restaurants such as durants, Donovan's, Dominique's, brio etc. quite similar.", "business_id": "_YswYrpv6YdO3R3CP8R8oQ", "stars": 5, "date": "2014-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BiDA7uVJ5igMCsp4ZfpCpQ", "review_id": "L5hXIEh0J4NBLlDsDiN42g", "text": "The scene is definitely better than the food, but I have to give it 4-stars for the happy hour menu.  In total they have over 20 items to choose from - sushi and appetizers, most under $5.  I believe it runs from 3p-7p.  Good looking wait staff and a nice decor.  \n\nAgreed - walking around Kierland is a nice way to work off lunch, or perhaps across the street to the Westin.\n\nWe'll be back for happy hour again!", "business_id": "nk6_ipMkmUvUtq6Xvncf0A", "stars": 4, "date": "2010-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "qHJ-E17xc_ZtJ4T32qc7jg", "review_id": "OI4tny_iCxBgKU7v2Pi7CA", "text": "I Love RA!!  I usually go there for lunch.  They have a great lunch menu with bento boxes, bowls, and sushi or sashimi combos.  I also LOVE the veggie tempura!  They also have a great happy hour menu and pricing.  I come here as often as I can.", "business_id": "nk6_ipMkmUvUtq6Xvncf0A", "stars": 5, "date": "2012-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9lo5EtOfzFM0_Y3Jp5Xhqg", "review_id": "LWvwAtA0gnV68GS8v6MeXw", "text": "This was our second time here, but we mainly returned because I had a coupon.  Even with the coupon however, it was too pricey for what we got.  The server was fine- not too friendly, but did his job.  We started with pineapple cheese wontons which ended up being the highlight of the whole meal.  Next we had the tunacado, the scallop dynamite roll and the chili ponzu yellowtail.  They were all just average- which is really what I feel about this whole restaurant- its just average.  To top it off the restaurant was freezing!  I know its hot outside, but everyone in the place was cold and they did not bother turning the air down as we requested.  There are better places -even in Arizona-for the same price or even less.", "business_id": "nk6_ipMkmUvUtq6Xvncf0A", "stars": 2, "date": "2014-06-28", "type": "review"}
