{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YKDw2WGj-MQjz7eRsb5FHg", "review_id": "fpJ_Bgho7G3E-_WWaMJpjA", "text": "Don Don is a restaurant I find myself missing now and again, it's probably my favorite restaurant in Carnegie. Simple setup, just a small restaurant with a few tables and a TV. Oddly enough I think my favorite thing to eat there is the wonton soup, never had better. The food is average but I always enjoyed eating there, great service and a cheap place to get Chinese food.", "business_id": "SQ0j7bgSTazkVQlF5AnqyQ", "stars": 3, "date": "2010-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aDL8mVwpR6gmpWcfYx15FQ", "review_id": "TsHsyeWPKaqvoEG7Nweg8w", "text": "We hadn't been at PF Changs for awhile and now I remember why....\nThe service was terrible. The silverware was dirty. We waited almost 15 minutes for water glasses to be brought to the table. The waiter forget several things we asked for and above all, the food was tasteless and the portion sizes smaller than lunch sized portions. We were there before the dinner crowd started so the lack of service or food quality can't be blamed on a busy time. Don't think we will be going back there.", "business_id": "JDDeaNfb0JXD1NbznSIC9g", "stars": 1, "date": "2015-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "q7MrNVt1FE23rwtWmPYWHg", "review_id": "VuJ9NFvV5LDO00G3boONuw", "text": "It's pretty average Chinese food. Their egg rolls and dumplings were decent enough as was the Hawaii Five O dish I had was ok too. The service is a little slow as well.", "business_id": "LltDzuzRbAJbSrqD4JH-3A", "stars": 3, "date": "2012-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4vhhjORdUs8pBLeEwlvQzA", "review_id": "amK9svla2hy4P-kjBtBqlQ", "text": "Very good and reasonable prices. Nice size portions. Best shrimp I have ever had in a Chinese restaurant", "business_id": "T4D7wX6GuCYChwRmser-0A", "stars": 5, "date": "2015-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jfvv8uvdSJYa5NWEAloxpQ", "review_id": "5p12qE6HB5b2EgpMUdHy-Q", "text": "Good Chinese food is hard to find. Food is well made, priced right, and portion size was large. No real complaints. We ordered deliver which came super fast. Apparently the owners of China Palace also own Sushi Too which explains why my wife was able to order sushi over the phone even though it was not on their menu. Very Cool.", "business_id": "Q9BXMPu2HnRDMq9X_2rHrQ", "stars": 4, "date": "2013-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "OTpWNXx1pO7YsVKY8fChyA", "review_id": "JBqcoj7vCqSKzmsy6sNBXg", "text": "I love New China. The service is always fast and fresh! The sweet tea is amazing. Yes, Chinese takeout is everywhere but no one can Beat NEW China in Belmont!", "business_id": "JkF2CPy63ivoK1FUqprQ7w", "stars": 5, "date": "2012-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "IaVteN39iChrCllDqENWmw", "review_id": "56kxfV49AflbG0LQ63rqZA", "text": "First for the price and portions downtown I don't know if you'll find better value. All the ingredients are fresh. Service was fantastic. The dumpling sauce is tasty! Would reccomend.", "business_id": "rT-iPtIXMKj3dTcl87lbOw", "stars": 4, "date": "2011-08-18", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "Qe1l1ln6bf_pcWUUuLswFA", "review_id": "vWAfApbansw3QaMKtHTuVQ", "text": "Although the price is right and the fried rice is pretty good, it's severely overshadowed by the \"off\" taste of the beef and chicken dishes.  The beef with scallion is 90% bamboo shoots, which isn't even listed as an ingredient, and the dumplings are incredible hulking globs.", "business_id": "JgGpBGMAb1Nc2Z5jVIwZMA", "stars": 2, "date": "2008-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QWE2fm8mbaGRtfqIsu65pQ", "review_id": "cILwHEbmRkHWQp3uDqOQBw", "text": "Food is cheap.  Service is good. Lots of coupons that make the cheap food cheaper.", "business_id": "G3EsKzy3i-CvrEDjZzTV0g", "stars": 4, "date": "2010-07-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "VhI6xyylcAxi0wOy2HOX3w", "review_id": "fI6cwLX3Kxv4svFI5XNWjg", "text": "On a coworker's suggestion, three of us visited for lunch. For 12:30 on a weekday, the place was barely a third filled. The three hostesses were clearly underworked trying to organize the few customers into tables.\n\nPF Chang's has a special lunch menu if you want to save a few bucks. I had the Almond and Cashew Chicken with brown rice. The $10 meal comes with a bowl of egg drop or hot & sour soup. There was plenty of chicken (not fried! yay!) and a large serving of rice - enough to take half of the meal home in a nice container. The sauce was very flavorful, though it seemed to be a little light on both the almonds and the cashews.\n\nOne friend ordered the Combination Lo-Mein from the main menu and was very satisfied. He said that there was plenty of beef, chicken and shrimp in there.\n\nThe waiter was attentive without being overbearing. He mentioned that each of the staff has their own recipe for the condiments, preparing his own recipe in front of us. If you ask me, it seemed a little silly, but it's part of the charm that is PF Chang's. After the meal, he brought over the dessert tray. The cheesecake and mini-cheesecakes looked good, as did the six-layer chocolate cake that must have been the size of a small football. We declined.\n\nGood service, good food, a decent price for a lunch meal.", "business_id": "4CPrhBc4Ado90fj7PG6jrA", "stars": 3, "date": "2009-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9HXOmav99NVDJon8XbcHxQ", "review_id": "fhNqkTkkIpx14K7631YYuw", "text": "Very disappointing experience recently. The food has always been consistent. But my family and a family friend visited and had one of the worst customer service experiences I've seen in a restaurant of this type. I had to ask three times for soy sauce. When I went to the kitchen to get it myself I was met with a very sarcastic server, and unhelpful hostess, and a manager that refused to take ownership. Very poor experience no one accepts responsibility.", "business_id": "4CPrhBc4Ado90fj7PG6jrA", "stars": 2, "date": "2015-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "Dq4EyXBVZs3qtXCJG7OXFg", "review_id": "qWv51yjV3gZljOqCYq7EZQ", "text": "My hubby and I went to Baoding for lunch because we were near South Park and decided to try it.  The restaurant is very nice inside with comfy booths. \n\nMy first impression of the menu was that it was very Westernized.  I appreciate all kinds of Asian-inspired cuisine but I think I was just hoping for more authentic Chinese. I ended up ordering the Chinese-style steak and my hubby ordered the Firecracker Shrimp.  They were both good but my steak was little on the tougher side.  His shrimp was cooked perfectly. \n\nThe service here is beyond nice and polite. They get 5 stars for their customer service.", "business_id": "s-cFWOk9LXXZCrm4lKpjEg", "stars": 3, "date": "2013-06-23", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 1}, "user_id": "xGogLv6PBMkGMQp8EEWhDg", "review_id": "n3ux_sBv2m1PzCnE-iEqGQ", "text": "we order delivery from here at least once a week, the food is good and the delivery is better :) i love the cashew chicken...mmm..and shrimp egg rolls... sweet and sour chicken is also very tasty! love the fried wontons and chinese doughnuts...yum! :)", "business_id": "2mmxmtwEli9CycpLcVpZgw", "stars": 4, "date": "2012-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "aFTaC-IlOlP_x4BAFXY8wg", "review_id": "c4IikPtEQlpIN-9SAB6cPQ", "text": "Very fresh cuisine! My fiancé and I had several appetizers and entrees. They were ALL good. Generous portions; will definitely be back", "business_id": "i-tKO0n-1Tq6sTFUrhg9-Q", "stars": 4, "date": "2015-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bKtNR9D3YL7wvQ1u0KHI-A", "review_id": "8-8PaEWSY4OFgu1DiJQ8wg", "text": "I order from this place consistently and it is always hot, fast, and delicious.  I am a picky Chinese food eater too.  The portions are huge and you can substitute beef fried rice for your regular rice side!  Great egg rolls which says a lot from the get go.  If you can't make a good egg roll, well, you probably cant make good Chinese food.", "business_id": "QoCjVVy4--QNyVRkzQTCEg", "stars": 4, "date": "2013-08-11", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "9SU4T5EvO3UVy7e-26yCjQ", "review_id": "y5INUyGwV3PK84kKVFvpkA", "text": "This is our go-to Chinese restaurant in the Madison area.  Hands down, it's the best Chinese I've found so far.  I'd give it 5 stars if the prices were more reasonable and the dine-in environment was better.\n\nLike I said, the food is superb.  My usual dish is Cashew Chicken.  It's hard to deviate from that when it's sooooo good.  Other dishes are excellent as well.  What I like about Imperial is that the meat quality is good.  The beef is tasty and tender - not tough or \"questionable\".  The chicken is good as well - not some of the gray chicken-like material found at lesser establishments.  \n\nWe don't dine in often or at all.  It's a little more formal than I prefer, and the experience can take a while.  Just not my preference.  I keep their number in my phone and call ahead for carry-out.  That's the way to go here, imho.\n\nTheir location is very convenient for those of us that work in town and live in the western 'burbs.  The portions they give out are very fair - my cashew chicken typically leaves me with a nice lunch for work the next day. \n\nIf you're looking for top-quality Chinese food, I highly recommend getting take-out here.  If you don't mind a more formal setting and have the time, go ahead and dine in.", "business_id": "SKLw05kEIlZcpTD5pqma8Q", "stars": 4, "date": "2014-07-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oSA746-4MCJpWorJkzxqpQ", "review_id": "Kiredheru8xDykkaOyBQ6w", "text": "This place is both a buffet and a takeout restaurant. For take out, it's great. As a buffet, it's okay. The food is always fresh and the buffet is refreshed constantly so nothing sits out very long. It's nothing fancy, but it's good. Not great. But good. It's a favorite for take out while living out in the boonies!", "business_id": "5uxhIGZlJm9g_zfG_83z5Q", "stars": 3, "date": "2012-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f_nYDPF2NGDmlNKF98h-nA", "review_id": "897edQ3Mx1H23OYntD0KmA", "text": "Good food, consistent taste. Typical Chinese restaurant with some authentic choices. People are very friendly.", "business_id": "9hf_gSaDn3cdLsE6vTsUfw", "stars": 5, "date": "2015-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-C93MHl3n-O_5KU_zGjEgQ", "review_id": "jy7-06ukdKUkvWOi5qMVgw", "text": "I'm definitely a fan of First Wok.  Admittedly, I get the same thing every time: the pork egg foo young combination plate.  For $5.95, you get delicious egg foo young, pork fried rice, and an egg roll, enough to feed you for two or three meals!  Soooo good.  I also like their crab rangoon, which is crisp and slightly sweet, different than many I've tasted.\n\nMaybe someday I'll branch out to try their beef with broccoli, soup, and angel hair specials?  Everything looks and smells so good there!\n\nNote: This place doesn't accept credit cards, so be sure you have cash before you order!", "business_id": "vubRS4bmJ_8yXpn-67wNZA", "stars": 4, "date": "2009-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "_7VcEa3xUpsc9XUTFCqlhg", "review_id": "OxsPZzb1p1N5XoWFwMmnYQ", "text": "Clearly the best Chinese restaurant on campus.  In addition to the great food and fast service, they recently started printing the Chinese menu with translation, so you can get the good stuff without having to know chinese or use the point-at-someone's-meal-and-say-\"I'll have that\"-method.", "business_id": "rE8048_DAh3Z8Tep466wrA", "stars": 5, "date": "2008-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "EI7QpLiJ4XYaUH35XkdndA", "review_id": "GiOwIW8Kdfu3U6Z5dWWDkw", "text": "This place offers solid authentic Chinese food. The register was packed when I arrived and the manager quickly noticed us hiding behind the swarm of people and we were quickly seated with apologies for the wait and noise. It is a slightly nicer place to have Chinese food in Chambana as the decor extends away from the fast food theme of their take-out menu.  My family and I received the 'authentic' blue menu upon arriving (I'm assuming because we are Chinese) but if you don't receive it automatically I highly suggest you directly ask for it.  \n\nThe all inclusive hot pot was one of the best things I had there and can easily be a full meal for a single person as it includes clear rice noodles for some filling carbs.  The shredded Szechuan spicy pork was a close second though it should be noted for people who don't know how Chinese pork is shredded, it is cut into thin slices and THEN cooked versus the famous bbq shredded pork in America which is slow cooked and then shredded by hand.  This leads to a more solid texture in the meat and it great when paired with thinly cut vegetables as they do with this dish. The ziran beef had strong flavors and wasn't drenched in a sauce like Americanized places.  For those who are afraid to try it, ziran means cumin so if you like cumin you will love this flavor of beef.  \n\nThe ambiance is great for large groups as most tables are large and plates are obviously meant for sharing. She does have small kids running around the area but I feel it adds to the homey feel of the restaurant.", "business_id": "M5E7DW8rqI4v37HhD2pzGQ", "stars": 4, "date": "2013-08-28", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 2}, "user_id": "kgyv3ctYEZ0ACslpoakunw", "review_id": "8znG7jU6Lqb5Tkqjfv4v0g", "text": "Fate has great food, but lacks on every other level. I live three blocks away so its upsetting to see a place with so much potential fail.", "business_id": "VsO_rhXi5lgbaGxNwoEZsQ", "stars": 1, "date": "2008-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "8WQubmP7G0NM3IyzyMnCEA", "review_id": "75cHuZ2Bl7iKoz-6BPj0Gg", "text": "Awesome, super authentic Chinese soup.\n \nGourmet House of Hong Kong has a daily soup that's definitely a must try...but please do keep an open palate. \n\nThe soup changes to suit the season..with cooling ingredients in the summer and heating ingredients in the winter.  When I was there, they were serving a mixed root vegetables in a pork broth (note that slightly milky/cloudy color comes from lenghty boiling of pork ribs).  It was the best home made soup, I've had in a long while.  \n\nAlso the beef pan fried rice noodle was excellent with just the right amount of chewiness...but not for those who are afraid of a little grease in their food. If you're feeling especially adventurous, then I'd also recommend the salt & pepper tripe (yup, that's edible offal)\n \nBeware that not everything here is equally delicous or authentic...so unless if you're looking for panda express style Chinese (I personally do crave Panda once in while), then avoid the $5 lunch specials", "business_id": "ykfTh6HI219NoMsWBxulxw", "stars": 4, "date": "2007-06-29", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "E5QyEU6FCQwnTys0S73zNw", "review_id": "JT9xcWgK3UA0hST2o-z7Ew", "text": "first i want to say, i have not been to Lao Ching Hing in a long while. and for reasons that will be outlined below.\n\ni have been going to Lao Ching Hing for probably 9 years if not more.\n\nthe first time there we were waited on by a gentlemen straight of of a old kung-fu movie, long pinky nail, long pony tail. amazing service. the next year or so every time we visited, 1-2 times a week. always great service. remembered the drinks we ordered, awesome. after a year or so, first change up we noticed. faces looked different. the pepper steak got a recipe change, not to our liking either. oh well right. find something else on the menu. lots of great options. tangerine beef, orange chicken, Gen. Tcho, dragon & phoenix, sizzling rice soup, endless list of yummy things. service is on par with before. the waiter always remembered us, in fact always had our drinks on the table before we entered. at this point in the review you should know we go there allot OK. it's the shit...and we tip well. they love us. right?...\nwell i guess at this point 6-7 years go by and it's 2007 we haven't been there in awhile because..well we moved to another part of phoenix and the local restaurants were good. anyways. so we go to Lao to see how things are... well sadly it was not the same. all of a sudden Coca-Cola bought the place or something. advertising on the plastic cups??? never was like that before. seemed like new owner took over and turned it into a comical version of what i remember. didn't seem authentic anymore. and the last straw. recipe changes. i didn't like what i ordered. it was just different and i didn't like it. never returned. :(\n\nnow at this point your thinking. where the hell is the review. well lets face it...this is not a review. it's an obituary to my favorite restaurant. RIP Lao Ching Hing.", "business_id": "2unQHR9uaRxk3dsW6f3MGA", "stars": 3, "date": "2008-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "YK2rodQfBU2Oe9H6jmlTFg", "review_id": "azb_UZXRzrLNbqvJYAHDPA", "text": "Being Asian, I judge Chinese restaurants by the service (which isn't great in amazing chinese food restaurants) and whether they speak the language.  Szechwan Palace met both these needs.  I understand the Asian population in Phoenix isn't as huge so they'd need to have the Americanized menu.  The soup was amazing and we even ordered an extra to go.  Anything spicy that you order will be SUPER spicy so be cautious when ordering.  It's authentic enough for me to want to come back here although I haven't tried any other places in the area yet.  I didn't understand the canned Lychee dessert at all, where's the mango pudding or the almond jelly?", "business_id": "yQONzVpX-DEpGSuKMIov6A", "stars": 3, "date": "2012-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W_FBOKIU2RXqnXISnmy2VQ", "review_id": "HnlP7K2d2NxtuZLmp27NRA", "text": "Just outstanding. The water boiled fish and lamb ribs are especially recommended- just love that numbing pepper!", "business_id": "yQONzVpX-DEpGSuKMIov6A", "stars": 5, "date": "2015-06-27", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 5}, "user_id": "4UUIpbOTPmu43wuC2aSGkg", "review_id": "jq7PwMN9x8lmQcWZ8E0QeQ", "text": "I really like this place. I spent 2 years in Honolulu and used to eat at this great little place in China Town. I have been craving that food since I got off the plane to move back to Phoenix. Well, I found China Chili and I am SO glad I did! The Honey Walnut Prawns are so  yummy! The fried rice and lo-mein noodles are smoky tasting, and hot out of the wok. Is it healthy? Maybe not. Is it non-greasy? Um... not really. Is it delicious when you're craving some really filling Chinese food? Yes. I wish it were closer to my place so I could have it more often, but I'm sure I'm sparing my waistline of more issues!", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 4, "date": "2008-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oXkbuOiN9HDS3WgOQONfRg", "review_id": "mL2oLK9ecibY8fPM0aHOFQ", "text": "China Chili is one of those places you visit when you want something you know you'll like and need to get in and out really quickly.  I started working on Central and Indian School just around the time China Chili closed prior to the lightrail construction, so my first experience was at the new place.  I wish had gotten the opportunity to eat at the original location just to see if the experience was any better.\n\nI have ordered two things at China Chili: the orange chicken and the sesame chicken.  I only order the former now.  I have never had to wait longer than five minutes for an order.  This is good yet slightly unnerving.  It makes me feel as though everything is ready-to-serve in the back, even though the freshness and temperature of the food says otherwise.  The orange chicken is out of this world.  An entire breast fillet is battered, deep-fried, sliced, and covered with a really delicious orange sauce.  If you ask for it extra spicy, be prepared to feel your face melt off.  The consistency of the heat level is a bit hit-or-miss, but when they get it right, you'll be simultaneously pleased and in pain.\n\nMy biggest beef with this place is the wait staff.  Very rarely is service pleasant.  Most of the waitresses are brusque and a bit too efficient for my liking.  When the dining room isn't full, they tend to huddle up near the kitchen and watch the patrons as they eat, usually talking quietly amongst themselves.  It is quite unsettling and makes me feel as though I'm not welcome.  The one exception is one of the very sweet older women who reminds me a bit of my grandma in that she always has a smile and is always so quick to ask if I need a refill.  I don't know her name, but I always hope she's there when I go.\n\nSo, visit China Chili when you're in a hurry and craving the best darn orange chicken you'll ever have.  Also, beware of really terrible parking options.", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 3, "date": "2010-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "7cR92zkDv4W3kqzii6axvg", "review_id": "SvT1tB7ZPtv0AsrWaCfcNw", "text": "Took my daughters here, so the adventures were already going to be limited.\nOrdered the pot stickers, which were delicious.\n\nWe ordered beef, chicken, and pork chow mein, and shared it amongst us.\n\nThe dishes were large, and delicious.\n\nThe spicy relish they provide on the table is amazing.\n\nI have been wanting to go here, and I'm glad I did. I will probably be back.", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 3, "date": "2013-07-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "c6udjafo7ogZESH16qWRyw", "review_id": "-wx0y_D_hsHPUb5PyThmzA", "text": "Short: Great consistent food. Good lunch deals. I get the House Special Chicken. Maybe a dollar or two expensive for the type of Chinese food it is.\n\nLonger: Been going here for years and when I worked nearby I would go frequently at lunch. Their lunch specials are great and comes with soup and a vegetable egg roll. The only problem is that it's maybe a dollar or two too expensive for the type of chinese food it is. It's nothing fancy, just good solid Chinese food. The place is pretty big but is always packed when I go. \n\nI personally get the House Special Chicken. Other good items depending on your mood:\n\nAppertizers: Veggie Egg Rolls, West Lake Soup\n\nSeafood: Almond and Cashew Nut Prawns\n\nChicken: Besides the House Special Chicken, Chicken in Black Bean Sauce\n\nPork: Sweet and Sour Pork\n\nAlso, I get the fried rice which is an extra $1 at lunch.\n\nService is super fast especially at lunch, otherwise, typical Asian service, not very personable and even if they were, it may be difficult to understand so maybe it's better to save for the awkward conversation anyways. Also, I'm not one for overly friendly (fake) service anyways, so it's not necessarily a bad thing.", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 4, "date": "2014-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "wrLFGheJC-OqN2QGZfM6fw", "review_id": "deLby3QRo8HvY5SV1KOHfA", "text": "I absolutely loved it. SO close to where I reside so it's ultra-coo now i'm hooked on their chicken fried rice. Quick service, my order was ready for pick-up in 5 mins! :D satisfied. It was yummy, hot and fresh!! pick-up or delivery only and cash only.", "business_id": "m9k4BhXgNTBTguxvLNUaEg", "stars": 5, "date": "2011-08-15", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "2zRxVpcvfoVBUVJVEsuj8Q", "review_id": "mkX5BaZwU_-LOYnsaIiCnA", "text": "Been goin here for years an the only thing I can say is yummy yummy yum the menu is huge they got what you have a taste for ! Trust me this is noble plan wing spot. Very colorful and has a lot of history and cool item inside! Definitely a place to recommend!", "business_id": "BT2Vls7h6sWrCKa5gGXbKg", "stars": 5, "date": "2015-06-29", "type": "review"}
{"votes": {"funny": 3, "useful": 9, "cool": 3}, "user_id": "wuCszpVPMIMyOCualnZtaw", "review_id": "fssMfZgg3tQAeBcEzyuK4Q", "text": "Nice Little Find\n\n\nFound this location based on fellow \"yelpers\" recommendation for egg drop soup and the yelpers were right, of course,  this egg drop soup could be the best in town. China Village has great lunch prices.   Seating is always  prompt, service quick and the staff is very personable.\n\nThe food is good,the portions are big and the service is awesome. Food is always hot and ready fast.  If you go a couple times,they remember you.\n\nReally good place for a quick bite.", "business_id": "3DMvGD8ZmlMQmhwV66hdSA", "stars": 3, "date": "2014-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Fac1DLrOWZDZd0HKCtsvIA", "review_id": "JZPbI3xbGu9q99lcObddMw", "text": "The chicken curry lunch special was delicious, and service was great.", "business_id": "m9Wqqma30o-hH2fAX7dnug", "stars": 4, "date": "2011-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dqmXlUQyDh6d5U2_Zjb-Iw", "review_id": "SdHOc2fWBQcAYWvEvOfB4A", "text": "We started with hot and sour soup , title had a nice and hearty broth but too much vinegar.next we had chicken lettuce wrap their was eight pieces and  had a salty and tangy  and crisp .next was Hong Kong steak which is  sweet honey flavor this is their best dish.servive was fast and they pay attention to their guests", "business_id": "m9Wqqma30o-hH2fAX7dnug", "stars": 4, "date": "2014-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nn2rgORMZ1S22O5MMUn4Zg", "review_id": "1zEVqcue5KKw2LssK3hIdA", "text": "This place has been a favorite of mine since it opened as a cheaper and faster alternative to Pf. Chang's. I almost always order the Pad Thai and/or the Lettuce Wraps. Both of which are amazing. I always make I stop at Pei Wei when visiting AZ. Oh and the new Soda machine is amazing.", "business_id": "9Vu9KhK2-kBSM-FXvxXGNg", "stars": 4, "date": "2011-06-13", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 1}, "user_id": "jl67C8OhNXD5oMZ0v7RbUw", "review_id": "G3wqta8OwQS-g0n0xicGFw", "text": "I hate giving a chain more than three stars. This one is always super-clean, super-fast and super-accurate. I can't believe how fast the line moves, during the weekday lunch rush. I always feel like I've spent a tad too much for such run-of-the-mill Chinese food, but since I'm pretty sure that the secret ingredient in the Beijing Beef is crack, I spend it anyway. \n\nYum.", "business_id": "wLZ--5d4lXImxrG7VhdTyA", "stars": 4, "date": "2010-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dfFeR2ZCtFt8dPEitZLQ9g", "review_id": "yPcDBYKQg58tqZygTvjjng", "text": "Best Chinese food ever. There's a reason they have been in business for 19 years. Everyone is exceptional, and all items on the menu are delicious.", "business_id": "F3SEkW6v2LJ5y6Ldo5pPaw", "stars": 5, "date": "2015-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2_tOvm9THqfuxiXSxbE7Zw", "review_id": "RRP7MB4H7Qs4OynbqyoxGw", "text": "First, this place has been around forever! That means it must be a good successful family owned place! Usual asian foods. I really like thier hunan beef, sometimes i do chicken instead. I give it 4 stars, because like other reviews, some of the items are bland, you just gotta know what to order!", "business_id": "aozcOaCMwOHG8s-lbZ6_gA", "stars": 4, "date": "2010-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1ZLLYHQDtposu090KY-cRA", "review_id": "oDCW22uBHSC2gZFRr-XCew", "text": "This is the best chinese restaurant we've been to.  You really cannot go wrong.  The lunch special's are worth the money.  $6.45 plus drink.", "business_id": "aozcOaCMwOHG8s-lbZ6_gA", "stars": 4, "date": "2014-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "y2ptVaG2aGfHYMAoqH3zLQ", "review_id": "UnqH80Rs_4mZMyw3SLJ8uw", "text": "I'll make this easy; this is the best Chinese food in Phoenix.\n\nI have eaten here or purchased take-out at least a dozen times, and I have always been amazed at the quality of the food.  There might be flashier Chinese food restaurants in the valley, but I have yet to find one that has better food.", "business_id": "zTfBa__ldlTdbVgSl5h31Q", "stars": 5, "date": "2013-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tB9ClMGtT4dQ2AKhKTM5jw", "review_id": "Wu_F5g174N8ecbXGVZQLjA", "text": "This is and always will be my favorite property of the some I have dined in around the valley. Always clean and a friendly staff. The food is always fresh and hot! Not sure if they changed their prep cooks or their standards but I was a little dissapointsed today. The teriyaki chicken was cut up in all funky sizes...all their food is usually prepared close to bite sizes. Today some I could barely fit in my mouth and some I couldn't put my fork in since it was so small. Maybe I'm too picky? Not sure but that is one thing I've always enjoyed about this place was their prep of the food. Even the orange chicken...golf ball size...yes I know that is what knives are for but I guess I tend to notice little things like that. And way too much sauce over the orange chicken too.\nOk, let me stop badgering them...their food is always delicious and we will continue to go their. Today was just a little off-eh! Everyone is entitled to a bad day here and there. And their spring rolls are always a must with our meal and I enjoy their jasmine tea on ice. :-)", "business_id": "VTFx4ADDP6nPnlcMHB1-Ow", "stars": 4, "date": "2015-07-28", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "rpHzex_bNjgUh0DiEDKwXA", "review_id": "X_7dmn0HI-OBOXDQetdLBw", "text": "So, this place is great! I have eaten in a couple times, but I order for delivery at least once a week. Over the last few years, I have gotten to know this family, and I know how much they put into their restaurant. I think I have gotten just about everything off the menu, and tonight I ordered the Thai Basil Tofu. Now I'm not big into tofu, but this was excellent. I will be ordering that again soon. I have had them cater a birthday, and everyone loved the food. \n\nIf you're in the neighborhood, do yourself a favor and stop in.", "business_id": "oMtqDDzpMcFrQwHfeYc1iA", "stars": 5, "date": "2015-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VD-RoEyU02NGG7655PMfSA", "review_id": "41WPQzevdOGbSAsswIUBcQ", "text": "Okay, so I am a sucker for Panda Express.  You may think it is not Chinese food, but I gotta tell you that their Orange Chicken is to die for.  The store at Thunderbird and 40th Street is fast (usually) and offers hot and fresh food.  Expect to stand in line (out the door) if you arrive between 5-6 p.m. on weekdays.  Overall, a quick place to get chinese food served fresh and hot.  My favs:  Orange Chicken, Chicken with Mushroom, and Mandarin Chicken.  Tip:  if you are on a diet, buy the kids meal.  It comes with one side and one entree, plus a cookie and a drink.  Give the cookie to your kid, order Ice Tea or Diet Coke, and enjoy!", "business_id": "rEC1QrZVEYH8LpowJ_DNZA", "stars": 4, "date": "2010-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LdI_xKBiA2vZOAnh0Eaqmw", "review_id": "BZtgthNRqVF3oB7zO_oQAg", "text": "Great food at a great price.", "business_id": "LGLOtR2e-v74MpB51k8hxQ", "stars": 5, "date": "2012-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ZREDycnu3rhgDvhBdcm4wA", "review_id": "nQ9F8HgfYHl2Q6WIKHHZNw", "text": "This place is just fantastic.  I ate there twice this week.  One day we walked in 3 minutes after they had closed for lunch and they were still so kind to serve us and not make us feel rushed.  The food portions are huge and just fresh as can be.", "business_id": "lAGDe38li38fyf971CslFg", "stars": 5, "date": "2013-07-26", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "4CRwqGJTsi9alR8cnrolgA", "review_id": "EeILZuQtKt8A6KnKfMKCMg", "text": "Wang's Express is a good place to go when you are in a hurry. I havent found much in the way of good chinese food in Phoenix, but Wang's is probably the best. The service is super friendly and they always willing to make sure my lo mein has a little amount of cabbage and onion in it upon request. \n\nThe place itself isn't much to look at and the bathroom as been known to smell like burnt brown sauce. I rarely eat-in though, I usually take-out. The prices aren't bad and they do have some pretty good lunch and dinner specials. \n\nMy boyfriend isn't a fan of their friend rice so he usually orders orange chicken and I tend to toss up between mandarin hot chicken (aka general tso's) and hour lo mein. Unlike most chinese eateries their lo mein is full of yummy noodles and plenty of meat! I also like their wonton soup, it is a bit bland but it does the trick.", "business_id": "KRqtYdnDpwqYfWkFhZYjow", "stars": 3, "date": "2011-06-09", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "d5etAZYtsEWT1FWBsOtsvA", "review_id": "FwXsbmdI7n1q-U8uHT0Msg", "text": "Don't let the outside fool you. The service was attentive and helpfull... possibly to the point of wierd. We ordered and our crab puffs were out in a couple of minutes..and our meals followed another minute later. Egg foo yung was hot and tasty.. the chop suey was loaded with sprouts and really tasty.. the fried rice was outright some of the best I have had. It stole the show and I am not surehow much we could have eaten.. reasonable prices too. If the area and outward appearance intimidate you... good. Go somewhere else and leave this jewel alone.", "business_id": "ayTBDjx-S7TH4maWKBiAFw", "stars": 4, "date": "2014-06-26", "type": "review"}
