{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-PiVf4t_cJ7orn1-H11hsQ", "review_id": "a_JDZpTpmVNrOJHwCg_xVw", "text": "Went upstairs for the BBQ, which was okie. But the guys running it gave us no real clues of how to run the BBQ grills, so we kept burning the grills until they were black with carbon buildup. The food was good, but I think next time I will \"do\" the sushi.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 3, "date": "2008-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "88_PacBkt-EaSgW3kzimkg", "review_id": "SN29kBavlZFP4C33xOflBg", "text": "This is the first and only korean bbq i have ever visited.  that said, i can't wait to bring my whole family here at the end of the month for my birthday!  I had so much fun filling my plate with marinated treats and cooking them on my table!  it was a really amazing and unique  dining experience.\n\nif this place sucks compared to the average korean bbq, I can't wait to try an outstanding one! But for now, in Pittsburgh, I don't know of anywhere else like it.  and I'm in love.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 5, "date": "2009-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5eBYTs1PL2lPy-ng6co5yA", "review_id": "yrB5lMK-uXwfh7rv0n_vng", "text": "Update to my previous review: I've gone here a few times since then hoping to reclaim the initial wonderful dining experiences I've had and all three times the fish was meh to bad. It makes me sad because when it was good, it was truly something special..\n\n\nJust want to voice some dissent to all the negative reviews. I think this is some of the best sushi in Pittsburgh for the price. You can always get a table and the fish is really good. The best thing to get is a combo platter and then ask for no squid or octopus. They will really hook it up. I've never really gotten any of the rolls. I did have some of the korean food and was very underwhelmed. The short ribs are pretty sub-par and if you get the spicy fish salad I think they use almost spoiled raw fish and try to mask the flavor with the spicy sauce. However, if you stick to the combo platter I think its generally pretty great (relative to the other options)", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 3, "date": "2011-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G_BvSxt71MqF_x4jgEyqSA", "review_id": "Fw0xnsL3xORBuahZc4Xvqw", "text": "Absolutely the worst sushi my husband and I have ever had.  It was Gross!!! I don't know why they use so much rice or why the fish wasn't cold.  You couldn't pay me to go back to this place!", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 1, "date": "2011-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "udT5L2wjSQC0AnlFx_pZjQ", "review_id": "s9HCoBztVdsAqO1hq_rGDA", "text": "I've been to Sushi Kim few times over the years and every time I've gone there the food and service hasn't lived to it's reputation of being one of the best Korean restaurant atleat in Pittsburgh.\n\nThe food is okay.. service is mediocre and staff ... not the friendliest :)\n\nSo, if anyone asks me to recommend a good korean or a sushi place... you can say this will definitely not make the list.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 2, "date": "2012-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t5mr9snU8tI7hcjMSCYxLQ", "review_id": "0RgambgaRRpJy-rYHmDwoQ", "text": "Their Korean food is good and the price isn't too bad (compared to other korean food restaurants in the area). Very spacious. They have sushi and Korean bbq there as well. Yum!", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 4, "date": "2013-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YfigZiRSM7spv4Aju4q74Q", "review_id": "KXSkZIKyCsMe6jTC5I_BnA", "text": "Staff are friendly. Sushi is not overpriced although the rolls could be made better. Otherwise this is a decent sushi place for a lunch once in a while.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 2, "date": "2013-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5z6ZXMg3-XO3UmSxpZWBUA", "review_id": "EbW1SIQ561IK_Pc_Eo3bOg", "text": "I ordered the entree that had ground beef with sesame oil and vegetables and I found it to be delicious. I also found the service to be very friendly and thorough. The waitress told me there would be a longer wait time for my dish so I would be prepared. Then after my meal she was apologetic about the wait and service, of which I really had no criticisms to offer. I found the interior to be very decorative.\n\nI've come across the other reviews that seem to be more directed at the Sushi and during non-busy hours. I went late Saturday evening and it was very busy. Also, the price was reasonable. In regards to the food my only gripe was that the ground meat seemed cold, but the rest of the meal was delicious. \n\nIn all honesty given the overall experience, I am being borderline nit-picky to dock a whole star from the rating. Regardless, the food was very good and the service excellent.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 4, "date": "2014-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mlVu_sY_moeXnl4qXoVK7g", "review_id": "i4r_FD6qjIhVmumQagjCcQ", "text": "Tried this place based on reviews in local paper and friends. This place was awful. We asked questions of the server and ordered based on them. Neither was good.y friend said she cannot eat real spicy food and asked them to tone it down. Her meal was so hot she couldn't eat it.  Mine was just disappointing. The only thing I found good was the plain rice. I also thought it was extremely over priced. Will not return.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 1, "date": "2014-07-19", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "lvXyx043PaY6_JBQVZj-Zg", "review_id": "4_QjAQvtnorvYkpQrpzGNw", "text": "Last time I was here was about 3 years ago. I have been avoiding this place since the recent reviews have been very mixed.  Today I was in the mood for BulGogi and my friend wanted sushi.  So at Sushi Kim we arrived.  I have never been here for dinner, only lunch and there is always enough tables and space.  (Perhaps this is the best time to go) We both ordered from their lunch special menu; Sushi sampler & spicy pork BulGoGi & also an app of shrimp dumplings.  Was not a fan of the dumplings but our pork was delicious, tender and spicy and the sushi was a nice mix and fresh.  My friend ordered the green tea ice cream and my sample of it was quite tasty.  We each had a glass of wine and with tip got out of there at around $50.00.  Not bad.  \nTheir menu is extensive and it may be hit or miss here depending on what you order.  I have always had a hit with their BulGoGi, Korean Pancake, Hot Pots and   sushi.  Their service was attentive, but again, we were there for a late lunch and the place was not packed.  All in all, the food was very tasty, service was good and price was respectable.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 3, "date": "2014-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "cQzLh-dCpM-C_cDYycPlww", "review_id": "HE0xB7qs7feniJJBI4KdUA", "text": "I had a pretty negative experience for my first trip to Sushi Kim. I have always heard how great this place was and the patron is immediately greeted by photos and plaque cards of the restaurant's accomplishments. \n\nI was greeted by a non-Asian male, who was very seemingly very timid and shy. After a first glance, I noticed that some of my favorite Korean foods were no where to be found. I inquired with this male as to whether or not there was an alternative menu or whether these very common Korean dishes could be made. He had absolutely no idea what I was talking about. He looked at the sushi menu and just told me to order what he thought was the closest thing.  \n\nKorean barbecue requires either the patron or the server to cook at the table. We had a different server cook my bulgogi. Another non-asian male who basically refused to speak with us. I could tell English was his second language, but he was extremely unpardonable. We sat in awkward silence because of his presence while cooking. \n\nThe Korean fried dumplings were very delicious, I will say that! \n\nI will give Sushi Kim another chance because I know others rave about it.", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 2, "date": "2015-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9T50dd-MJHjMgvo6Dty6kA", "review_id": "7sClSCHO5kwYh360kA3BBw", "text": "Absolutely awesome! Best sushi in Pittsburgh!  I come here every year when I come on by for Anthrocon!", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 5, "date": "2015-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7gCgtAgfdOwszDKF1yoLvg", "review_id": "PZANXflK1aqIqDdlYSXp3w", "text": "We only went for Sushi and it just wasn't that good. The quality of the seaweed and rice were lacking. I really expected more for this place. Fresh fish though which is what counts the most !", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 3, "date": "2015-08-04", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "CX4GcrCCnzfNyAl0cPqGbg", "review_id": "EUVLc3pNoawBVy1brIO_Kg", "text": "I am not always a big fan of Arirang. Somehow I find that their food is kinda bland. But surprisingly there's lots of Koreans eating at this place. In fact, my Korean prefers this place over Dorcas, which I love to go. Oh well, I am not Korean. What do I know? =)", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 2, "date": "2007-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AGOmxrO-YUnltljd0SI08g", "review_id": "7rwshSn0YHfffwmCrNkPcA", "text": "The food's decent, but I've never been impressed by this place.  The only things I can say I definitely enjoy about this place is that 1. it's usually not too crowded, and 2. they have mool nang myun in the summertime.  Mmm", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 3, "date": "2008-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "l3KEW-71UeeZ-6xORiG6PA", "review_id": "UdWUDXd-TGhnLzGeRehReA", "text": "Although they don't provide the best customer service (none of the k- restaurant do), I always come back for their great food. Authentic and affordable, plus no MSG!", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 4, "date": "2008-08-21", "type": "review"}
{"votes": {"funny": 4, "useful": 8, "cool": 4}, "user_id": "04-E5-69Se-vW8heDXI_gA", "review_id": "L6IlrVATOuEhJRZVtplWaQ", "text": "I used to come to this place before I found out about other Korean places around campus. Each place has their own specialties. I love getting the bibimbap and bulgogi from here. In my opinion, the soon du bu doesn't have much flavor. \n\nI started coming less and less because the owner at this place isn't too friendly. Also, once I came to get food and saw them refilling the water dispenser with a tub that didn't look so sanitary...made me lose my appetite.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 3, "date": "2012-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "1K050Vt9StNHXGqQdxSqQw", "review_id": "DWS49Dc9TGSpXbHn17UAbg", "text": "The boss trying to sell me something they want to sell, which sucks. And the food is very low quality in all the Korean restaurant. I have had. Donot come here in Uiuc!!!", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 1, "date": "2013-06-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "k23Uo-4EVB4xFLqUNckNbw", "review_id": "-7TQnw9PLC7j02wwMgwN5w", "text": "Looking for Korean Food? Want Budaejigae? If So, order here! I'm not korean but this is my favorite place for Budaejigae, I've only ordered a couple other things here, and comparatively to the other Korean places in town, this place hands down, has the best Budaejigae. For me personally, I would rather go to woorijib for korean bbq (bulgogi / kalbi) and would definitely come here for the Budaejigae.\n\nCheap and its huge, definitely can't go wrong if you are looking for a spicy noodle meat soup.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 4, "date": "2013-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TsVZ_zpyOxmiOINt3JzoWg", "review_id": "Oxjh3rQestwyYt4l_cFdFQ", "text": "Self service for cost effective. A lot of steam rice. good!!    ,      .       .      .   +.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 5, "date": "2014-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KkfMD7Erl0f1UYsncCbN_w", "review_id": "OXAg6xLOwM9BJuIPliK5LQ", "text": "The food is fairly average, it's not that great. But overall, would not recommend to eat with families or close friends. Maybe for a quick lunch or dinner. The owner is very nice and the place is fairly clean.", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 3, "date": "2015-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "6wpEHXevnaIZp2kUTUfhxQ", "review_id": "9c49je6n2JrBfs30nZDrjg", "text": "Me and my wife love this place. it is so great.  the best korean in arizona.  we always have korean tofu soup since coming for the the bay area. it was hard to find good korean food and this place is it.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2008-06-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "XmIvcLbJY5DgNYe6-R5xSQ", "review_id": "SbZsCp6RziSCAMqUscWY0w", "text": "if you are craving korean food in the middle of the desert aka arizona, Hodori will do.\n\nthe food was your lower end quality korean food.  the restaurant used a lot of msg but that's what makes the food taste good so it was fine...for one meal.\n\nsome of the dishes were outrageously expensive such as jabche (stir-fried vermicelli with vegetables) and hehmoolpahjun (seafood pancakes) for about $15 each.\n\nthe lunch menu was reasonable around $10 per meal [main dish + bowl of rice + ban chan (side dishes)].  the servings were average but refills on the banchans were generous.  the servers were kind and the atmosphere was comfortable.\n\nafter 3 days without korean food, Hodori hit the spot.  however, i'd have liked it so much more if the cook used less msg and patiently simmered beef / pork / chicken for broth.  i'd like to see korean restaurants step it up and preserve traditional quality korean cooking ...even in the middle of the desert.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2008-08-13", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "waD2euOMPTnTzQ0thq3H6Q", "review_id": "-VPquzTzEl08IqQ6-QEDSA", "text": "Pretty good Korean food.... IMO.\n\nI lived in Korea Town, Los Angeles for a few years and would walk to our local souju spots and our local Korean BBQ spots with great frequency, so I ate a lot of Korean food.  This place is about as good as the Hodori in Los Angeles, which I would rate 3 stars, but this place gets 4 being in the middle of the desert with little else to compare.  Hodori, LA is literally surrounded by 100 other KBBQ spots.\n\nAnyway, service is whatever..... nothing special, which is to be expected at a Korean establishment.  Sides are pretty good and they are good about refilling them.\n\nTwo of us usually share one bbq dish and are perfectly full at the end after devouring the meal with all the sides.  Oh, and a good boba spot is right next door... kbbq then boba, ftw!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2008-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "n4PmRYAvx2c6X0-fb9mT9Q", "review_id": "0p7LTaX1w05eXUDdsWx4MQ", "text": "In Short: Better than average food, but awful service.  Try the stew, pretty damn tasty.\n\nUsed to be the best Korean place in town but there have been a steady decline in the last few years.  Quality is a little down but the service seems to have taken a cliff dive without a parachute.  Takamatsu is probably the best Korean in town these days.\n\nThe korean stews in the stone bowls are so amazing, I pretty much go here for that and the bulgogi.  This may not look very appetizing but try the pork salad, it's a behemoth collection of greens topped with pickled pig feed sliced thinly, very tasty.  The accompanying small dishes are pretty delicious too, but they used to give better quality stuff like real fish, and tofu cakes.  I still go here occasionally for the food but I wish they get a clue about customer service.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2009-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "K5ELQJBhgNTexIvKfZdGCw", "review_id": "oZV4OFEV3JE9FlytqPTnFA", "text": "I've tried few korean restaurants here in phoenix. but this place probably has more of my flavors than any other.\neven with their extensive choices of their soon tofu hot pot, it wasn't as good as it is in LA.\ntheir rice dishes and summer specials are good, from traditional stone pot bibimbap to cold noodle soups. I also enjoyed their bulgogis... but found that pork one was too sweet for my taste bud.\none of my favorites were korean sausage soup with pork innards, oyster, pork and nappa cabbage plate with radish kinchi, and monk fish braised in spicy sauce.\nI would not recommend fermented soybean paste stew.\nI found that meat was too gritty.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2009-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E9rN5N6_39vyBVmqwZDqGw", "review_id": "9R2-4ZVgwQaS90JQx2DMCw", "text": "All of the food I have had here is tasty coming from a person who has never had Korean food before. I really like their tofu hot pots, they come with big servings a big ol cauldron bowl. \n\nThe two times I have been here I went in the afternoon at like 2 or 3 I think and the service was slow and unattentive, they didn't take our drink order (though they did bring water) and didn't come back with the bill for a long time.\n\n I imagine like EVERY resteraunt the service is better during peak hours or at least when you aren't the only customer, but it would have been nice to get a little more attention.\n\nThe place is decently large and the dining area is very clean.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2009-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "uZbTb-u-GVjTa2gtQfry5g", "review_id": "w-ORwQsJO3KH4n-hu0ByHw", "text": "Delicious Korean bbq dishes, perfectly cooked with a deep smokey flavor in each bbq bite.  They also have good seafood pancake (haemul pajeon) and decent tofu soups.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2010-06-22", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "ODhV53XhesCBLJVfGsJGNA", "review_id": "XK_m8qX6vERx5Ie_RgNITA", "text": "Hodori is one of my favorite Korean BBQ restaurants on this side of town.  I love everything from their spicy tofu soup to the kimchi pancake!  I've had most of the menu throughout the years and must say that their entrees are so delicious.  Their stone rice bowls are amazing.  The portion sizes here are pretty big so it's always idea to share.  The staff is always super friendly, the place is always clean, and you'll never walk away hungry.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2010-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vC-9ROCPBhWuXtMcBNeDiQ", "review_id": "i2iZ8Hu95F5XDjhdNgbV4w", "text": "\"yummy, authentic, local Korean restaurant!\" - 4/5 \n\nWe were so happy when we found out about Hodori. Since I was first introduced by my Korean friend Kristy to Hodori, I have been dragging J there for at least 4 times now. \n\nWe always ordered spicy tofu + seafood soup, seafood pancake, bulgolgi beef and jap chae when we were there. The service is fast and good. Even though the price is a bit higher but it is worth the price. You won't be too disappointed with Hidori!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2010-07-12", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "I-P1v7sRjDLEfVOndp01kA", "review_id": "tt5wcK7x473gTkuQ9EVBTg", "text": "Got soft tofu soup.\nThey mixed up our order.\nMy bf thought his soup was bland while I was burning up and breathing fire lol.\nThe food was mediocre, aside from the mix-up.\nPriced a lot higher than what its worth.\nSmall portions.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 2, "date": "2010-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "XfUbS8krsXec3nKYA63jrQ", "review_id": "NuHRE_Wkm7tAT8ZiTFS7Cw", "text": "Always outstanding.  Try the pork bulgogi.  Terrific!  It's all authentic, and now including steel chopsticks. The only thing that would be better at a really good place in Koreatown, California would be the side dishes.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2010-07-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "wGWTVSyGBjfJtrO5NjngOA", "review_id": "OcwgYjP3gRtSFM-paqOcJA", "text": "Went to this place as we were passing through Phoenix on our way back to California. I must say I was very impressed, not only with the food but also by the service. We got two orders of Neng Myun, an order of Kalbi, and two OB's. I heard this place is really known for their Soon Tofu, but it was 114 degrees outside so we decided to pass. The dude taking our order was really attentive, nice, and buff. If you're looking for a white table cloth joint, this is not the place for you. It looks like a gutted Mexican restaurant. The place is pretty big with a lot of open space so definitely good for the kids.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2010-07-31", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "GZZs7288ZoIz2hx_vcAVUw", "review_id": "q5cbD_XFym79n3iL6Mh1Xw", "text": "As horrible as this sounds, I'm used to Korean restaurants on the east coast. Translation: Amazingly authentic food + terrible service if you're white. Not that I blame them.\n\nThis place was amazing. Easily the best Korean food that I've ever had. The service was so wonderful and quick that I almost forgot I was a white person in a Korean restaurant. It was a very classy experience even though the place is sort of set up like a cafeteria.\n\nMy only complaint is that I wish they had more Bibimbap options. There were only two. But I suppose that's because there is an emphasis on the BBQ portion of the menu. \n\nThe price to me was worth it.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2010-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-tR44MSwi03h0CE2AQpTDw", "review_id": "xU9KCzTftyB3t_rUj_LPOw", "text": "Absolutely incredible!!  Great service, great food, great prices.  Definitely worth every penny!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2010-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BjwXX-sChcjx2E55B_7rXg", "review_id": "iwc-kcVhqUs1NWquFNoy-Q", "text": "When I ask if tofu can be substituted for Kalbi, I'm not saying, \"Is it possible?\" Obviously it is, and that's what I want, so don't say, \"No, we can't do that\". Yes. Yes you can.\n\nThat micro-altercation aside, the food was overpriced and pretty bland. I (shamefully) dumped half the kimchi sauces in my Dol Pan Bibimbap (which literally translates to stone plate mixed meal.. it's composed of mushrooms, spinach, egg, bean sprouts, and carrots over rice on a hot plate-bowl), which then became palatable, but nothing special. On the upside, the vegetables were fresh and plentiful, but the rice didn't even get crispy, which is the best part of rice in hot stone dishes.. and there was no tofu to mix it with, which means I'll be going elsewhere because a) Dol Sot  is better than Dol Pan and b) No other restaurant tells a customer straight \"No.\"", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 2, "date": "2011-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uO3pavwCb8ylw-aog3Mn6w", "review_id": "3ZuXxRvjQ_7HaTaJ2LE-zA", "text": "A solid 3.5 stars (I'm Korean and was raised in L.A.,  so my standards are pretty high).  Like Mexican and Chinese food, good Korean food is another thing that is hard to come by in the Valley (near Tempe).  The only places that I think are even worth mentioning are: Chodang, Hodori, and Takamatsu.  All three have their pros and cons.  I have posted separate reviews of Chodang and Takamatsu.  Besides going to Chodang and Takamatsu for specific reasons, Hadori is where my husband and I go if we have unspecified hankerings for Korean food.  They have a wide range of offerings and they are all pretty good, and my husband likes their BBQ the best.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2011-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CgsVdvkEAC3aQnQEFOl2hg", "review_id": "J2vMJf4TWDxtJkmZZ_wq6A", "text": "I had heard of this place for a while in AZ.  So i was looking forward to trying it with my the Asian professionals meetup group that I belong to.  \nI usually get the bibimbap but the one in the hot stone pot.  They actually cook it in the hot stone pot and serve it to you that way.  It was really good.  Pretty similar to the way I get in Korea Town back home in Los Angeles. \nYum!!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2011-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uO3pavwCb8ylw-aog3Mn6w", "review_id": "LJ4H8_ByoAcU0R9EkSziuA", "text": "My rating for this place has not changed (3.5), but I will say this.  Looking at some other reviewers comments, I do agree that the level of service and the quality in terms of the freshness of their ingredients and flavor of their dishes is not very consistent.  It would be great if they could fix this.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2011-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "RP_tdcN9KIDfsDwvZ2PPpg", "review_id": "Mz3yOhZRgXmVJL3QrJ4q4A", "text": "Okay, we gave this place three chances, and each time the service got worse.each time took over an hour for our order (and they weren't busy any of the times). The last time we were there, after ordering the seafood pancake, 25 minutes later they tell us that the health inspector is there and they can't make it for us because they shut down a part of their kitchen. You want good Korean food? Don't go here.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 1, "date": "2011-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "i2ckIH_V0wsEDHb23a_avg", "review_id": "J5qVivifBG3RjQsvAikTNw", "text": "Okay, I am half Korean and I love this place. I have been here twice for lunch and had the chicken bulgogi. The kimchi's were all awesome. \nIt does not have the best atmosphere, the service is so-so, but the food is delicious. It reminds me of my mom's cooking. \nI am so glad that I found this place and look forward to being on the East side of the Valley so I can go there for lunch again.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2011-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FG8rE-zMlI8JUMem54CzzA", "review_id": "pDp-vrluq1CK5IOYoanllw", "text": "First off, try the kimchi!\n\nI'd give Hodori five stars, because the food is really great. What ruined it for me was the service. The server, whose name escapes me, was very short with us; maybe it was an off day, but I don't know if that's really a valid reason. We're not a very demanding party of two, so we were a bit thrown off.\n\nDespite that minor setback, the bbq chicken and bbq ribs were take-home-for-leftovers worthy. Which is good, because you definitely pay for your portion. Go during lunch, which I believe ends at 3. Half-price meals, which still totals about $12 a person!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2011-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IpaY0MueAda612hHgDGsrg", "review_id": "QA_6KfVX13vpLAzjxSMDCg", "text": "Out of all the korean bbq resturants in the east side I think Hodori is the best.  Thier Balgogi is flavored really well.  I always have the get the jap chai noodles there.  I'm usually seatted quickly, but it might take a little while for my food to be ready. & the metal chops sticks that when they bang on my teeth are no fun.  But the food is good and that's why i keep on comming back.  It's a great way to eat family style too.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2011-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3zKT-gMYsUmoOT7ffc76dQ", "review_id": "3PgoCqVv8ZppM52S9X658Q", "text": "Most foods I tried here were quite good but not Naengmyeon.\nI especially like their tofu soups. Sundae soup is also what I like.\nThe service was not as good as it used to be.\nGood location (easy to find).", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2011-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fMNBJ4G1fx1MfHzM7E5TeA", "review_id": "TLOlAixl9x9kBUeh3z-MMA", "text": "I'm asian, so that make me a automatic expert on korean food.\n\nThe interior of this restaurant needs a renovation badly. Service is good, but the food is average. Not worth eating out. I order the korean rib...it was average...I believe they pan fried it...ribs are bbq not pan fried....", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 2, "date": "2012-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-2mNBuY67QaGeUznM8Dssg", "review_id": "_-K5y40uUfgutUziZq0SJg", "text": "just moved here from los angeles. wanted some korean food. had the soontofu which was fantastic. definitely recommend it.  there's also a korean market next door which is an added bonus to head to that strip center.  will be going back again very very soon.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2012-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1wMGLaMIH7CcmJ2htS1rmw", "review_id": "ycIz9ys45EhqsR9lJDxUTg", "text": "Super server. One woman ran the counter and the other took care of a pretty good number of lunch customers. I was impressed. \n\nFood was good...not the best Korean I've head, but yummy. Lunch prices are very good, while dinner prices seemed high. I'd have to see the portions to judge for sure. If you like Korean BBQ try the $11.95 meat sampler. \n\nI imagine a lot here depends on who is working on any given day. If they only schedule two people for lunch rush I could see an eitely different review.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2012-06-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "3wWLL2RDEZ9GgU0rNxyyXQ", "review_id": "u63mOkRULWv9TtznYTLEYQ", "text": "Moving away from the Meca of KBBQ in Ktown, Los Angeles, I was on the prowl to find some good KBBQ. The sides were alright and taste \"standard.\" nothing special here. I tried their bulgogi & their beef tofu soup and will say it was yummy and satisfying. I don't think I'll be back especially seeing how pricey their food was (tofu soup was the only reasonably priced item). Thumbs up, but whatevers....", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2012-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "JkV4FjaJS9Ze5koFOBZxCg", "review_id": "DYdrt4VOYceJoSRhEFEa8g", "text": "This is a great place for lunch. The prices and the meal sizes are tolerable. Dinner prices, however, are on the high side, and I'm always sad when the portions are only slightly larger than the lunch at twice the price. I normally get the BBQ pork. It's a bit on the sweet side, but not so much that I can't stand it. The kimchee varies from day to day. They're always bright and refreshing. I started getting addicted to those little salty fishes and then they ran out.  The hotpot (I can't remember the Korean equivalent) for two was disappointing. It was a small portion and was mostly vermicelli with hardly and meat. I have to give this place 4 stars because of the limited options in the area and the great lunch deals. Also, as an aside, I've seen a number of baseball players in here during the cactus leagues.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2012-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QWsDPAFwNgCrUeTNBGVW6g", "review_id": "15dtEf82gP7PPRvcGlVbfA", "text": "Good Korean food but spotty service. If you're not Korean the staff can be less attentive to you it seems. Whenever I go there it always takes the servers at least 5-10 minutes to show up and take your drink orders. Word of advice don't finish your drink too fast because the servers will rarely come by with a refill!\n\nService aside, their food quality is better than most Korean places in the area. Some of the items on the menu may look pricey but they give generous portions.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2013-06-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "TvtARzzT8bvPKLiLEeMIHw", "review_id": "wczE_bT18ttt_C7uKZbHvw", "text": "I live in Scottsdale so I'd say this is the closest, authentically Korean restaurant for me.  I usually love all their banchan (side dishes) and their house spicy tofu soup.  So... Korean restaurants are kind of notorious for having bad service and this one probably tops the list in that category :( ..like you have to hunt down your server for almost everything and I'm Korean!  I'm almost tempted to travel a little further for better service.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2013-06-09", "type": "review"}
{"votes": {"funny": 6, "useful": 7, "cool": 7}, "user_id": "IDHrwv_RCildFvmfWTkj5Q", "review_id": "KAsBrnHaSK_Vq4USsOJemA", "text": "Went here recently with the tour around-the-world lunch group that I organize.   This was a great lunch.  I appreciate a restaurant that understands that a group can grow.   Our group doubled in size from the start and our servers were more than accommodating.\n\nI ordered 2 things at this restaurant for lunch.  I ordered the Haemul Pajeon (Seafood pancake) to start.  I ate a small piece of it and had it packaged to bring home for lunch/dinner the next day.  A very tasty pancake with lots of shrimp and squid in it, onions and other spices.  Similar to an okonomyaki that we frequently see in Japanese restaurants.\n\nFor my main portion of the meal, I had a bowl of the Kimchi chigae  (Kimchi soup)  http://www.yelp.com/user_local_photos?select=piisc06BvMh6csRPY7RvHw&userid=DHQWSHz6b7Jsy-A04m1cIA.  The yelpers that said this was a delicious dish were  not mistaken.  A very well seasoned and delicious bowl of soup that had nice chucks of pork in it and the veggies.  Fellow Yelper and ATW lunch groupie, Dawn K, said she really enjoyed the somewhat fatty meat in the soup.  I personally enjoyed the spiciness!  I would eat this again and I can't wait to have it again.\n\nI wasn't very impressed with their banchan selection.  The side dishes just were not as tasty as I would have liked.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2013-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "D30Zx1lFfgOPsFJDA5WgTA", "review_id": "rviqEeodB5SSoLRtZJlCLQ", "text": "I have been craving Korean food for the longest time and happened upon this place by accident. I'm so glad I did! The spicy BBQ pork with the assortment of kimchi and veggies on the side were amazing! I will definitely be back for more.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2013-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "VCK3eQKToEkmu8jdSEbTwQ", "review_id": "St9sm98YEbRAfwsS4g1vEA", "text": "I am no expert on Korean food, and I will never be. Oxknee soup? How does one eat an animal's knee? Huh?\n\nWhatever. What I had was wonderful. I had beef in very hot, boiling broth with cabbage and carrots. Also had pork, which was more flavorful than I was expecting.\n\nThere's several items on the menu that was completely alien to me, so I cannot vouch for the more exotic items they offer. \n\nBut if you like Korean, and/or want to try something new (and really good!), then check this place out.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2013-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "uoekUV4fZ_-1T54v17tjLA", "review_id": "YGdNhu7sW2qcKR2O9cQ-BA", "text": "We had T1 and 27 for lunch today :-P Friendly and great food. Def will be back", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2013-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "82tSm6A56DMQgE9mSR91AA", "review_id": "1XuZuuBIaIsCX8WZIrbHrg", "text": "Ive been going to Hodori since theyve opened. They use to be amazing at the beginning, but then after it changed owners, it started to go down hill. It was getting progressively worse for awhile, but lately things have changed. Foods been tastier, service is good, and they are always busy. I usually always only get the Beef and Mushroom tofu stew. It usually hits the spot!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2013-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cjcm4fmOYho77NvYX2H3hQ", "review_id": "URFJrI3FPhLsRy8bn-AoYQ", "text": "Too slow. We ordered at 6:50pm and waited for more than 40 mins. So bad. Mg friends and I would not come here again. Waiting is a terrible thing and annoys all of us.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 1, "date": "2013-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "rdHtELJK4vo8DvVeWGiJDg", "review_id": "4PcU1byH7LApX6-G4owt-w", "text": "I've been coming here for a few years now and the spicy pork bulgogi is just as amazing every time! The service is very friendly and the food comes out in a very timely matter. They also make sure your water is always full which is a huge thing for me! I always go with the spicy pork bulgogi but I also tried to kimchi fried rice tonight and it was good but lacked flavor, the fried egg on top was delicious however...", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2014-06-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wajDr3qpwDjwj9rrVv5bng", "review_id": "50w5foY36QDDdNUBh4ct7w", "text": "Awesome service, great food, a bit pricey", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2014-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5NCwhoG7xWmxfR3ciWr-RA", "review_id": "ZVUnxtRB0WUOHRUGyKaMYA", "text": "I've been here a couple of times and always have a great experience.  Their soondubus and other soups are all very good.  I had the oxtail soup the other day--clear white broth, thin slices of meat, and rice noodles--which was delicious and an excellent hangover cure :) The service is great, staff is very friendly and great at making recommendations.  The server brought us out a sweet soy sauce for our meat without us asking for it so we were really appreciative.  The only criticism I have is that their BBQ meats are not one of the best I've had, but I typically don't come here for that anyway because they make up for that in the many other dishes that they cook so well.  Also, Hodori is located in a plaza next to Saketini and a Boba cafe so you have options for places to go to after dinner if you come with a group of friends.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2014-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "znYdiJAwm5EPYk4HRva4EA", "review_id": "i_6hIUHnp4ewUVQ6uwUPgQ", "text": "I think their food is decent and appropriately priced. As in, their food is not cheap, but not crappy either. I never had a problem with service or the food.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2014-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EqHLota09W3y0gF7KkH9ew", "review_id": "Ds29TFOjJ99o9r91AJF-2Q", "text": "The kimchi is usually fresh, prices cheap, and always quality beef and vegetables. Order the Yu-Ke-Jang soup or Jap Chae noodles. You will not be disappointed in the quality of the food. Sometimes it gets busy and I've had our server go M.I.A. a couple of times, but they are always friendly and polite. For a quick Korean food fix this is where my mom and me always go. Love that we can go to Asiana Market and The Street (Boba smoothies!) right next door so we can walk off our food a little bit.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2014-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "6XJfj4qjQlxjT-nPw4MSUQ", "review_id": "JXsJzP6L7OYJq1npkzLaUA", "text": "This is one of my favorite Korean restaurants. Can't go wrong with the beef bulgogli, spicy BBQ chicken, spicy BBQ pork, kalbi (short ribs), chap chae (clear noodles appetizer with red and green bell peppers, onions, and bits of bulgogi beef), kimchi tofu soup. Expect 6 little banchan side dishes. The BBQ dishes are just under $20 - which comes with rice. Chap chae is about $14 and plenty for an appetizer.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2014-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uLl--7BS9Cj6qOY2IqoyiA", "review_id": "hPERzA0RkgrVEI0dFwB31g", "text": "Korean restaurants are all varied, ranging from the ones where you cook your own food, to those where they cook the food in the kitchen and bring it to you. Hodori is of the later type.\n\nWe were a group of about 12, and were seated in a room away from the main stream area. As it turned out, this was good, since our group was a bit noisy.\n\nOne of the dishes ordered was Korean soup. This is brought out boiling in a bowl, with a raw egg dropped into it at the last minute to cook in the broth. Satisfying and wonderful in flavor. Another of our party ordered Bibim Bap. A dish that is cooked in a red hot stone bowl consisting of rice, veggies and meat, with a sauce that you add to your taste. Again, this was an excellent dish.\n\nThe Bulgogi and Galbi are excellent even though they are cooked in the kitchen. An assortment of condiments including some excellent kimchi (homemade perhaps) was served with it.\n\nMy only complaint is that each time I have come here I have ordered an Obi beer, and each time, they tell me they are sold out.  Oh well, if this is the only problem, then they are doing well.\n\nAt the risk of sounding prejudiced (which I am not), I noticed the most of the patrons of the restaurant were Korean. This tells me that the food is authentic and appeals to those who know real Korean food.\n\nService was reasonably fast, and the place was nicely clean.\n\n4 stars", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2014-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zAGVThOg4TaNkMJMaYFAZQ", "review_id": "WFU3TCKhkKGMvop2mIr5LQ", "text": "Best Korean food I've ever had! The kimchi pancake was amazing. Service was great and the Korean dessert place next door was a great place to go after this meal.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2014-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ulu5xAqG290KSS8_msJnzA", "review_id": "EDROFVr4k-JSQtrxspalvw", "text": "We had the kimchi pancake, spicy pork, and galbi. All of it was good including all the side dishes. I just thought it was pricey for all of it. I know it's not LA but still, pretty expensive. Service was good. They spoke English really well so it was super easy to order. Our water cups were never empty so I was pumped about that", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2014-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ejMMRVHW7VEQ-8hvtPwwbA", "review_id": "zSBb0fSAfyOApDmoxn5T-Q", "text": "My best friend and I come here at least once a week, and we can honestly say it's like our second home.  \n\nTheir food is amazing, and I have made it my new mission to try something new off the menu every time we go.  I dream about their kimchi-anything (rice and jjigae), and their soon dubu is some of THE best.  Obviously, though, since they specialize in soft tofu soups, hehe.  \n\nThe service is great, super friendly, and they check on us regularly throughout the meal.  I always leave with a smile on my face and my tummy~.  Anyone who loves Korean food should come here!!!!!  \n\nP.S.  Let it be known, that if I ever need to be in a hospital, I hope it's Banner, since it's literally across the street from Hodori!  Haha!\n\nP.S.S. As an avid fan of kpop, I enjoy that they play music off of band's albums that aren't just the promoted singles~.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2014-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3TsQF2dqHncZMi-VA4pFPQ", "review_id": "lpwFCNmZ6V87UN6C7RVlXg", "text": "This place is truly authentic Korean food. It's even better than the ones in Korea town LA. Their jjaeyook bokeum (stir fried pork with kimchi in a spicy sauce) is the best I've ever had. All their side dishes were good too.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2014-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "g6I0lyk-6fzykGi2_-IXVw", "review_id": "UDcvixfdCM_545bJJi986A", "text": "Wow. Wow. Wow. Wow. \n\nThis is the Korean restaurant of my dreams. This review will be solely based on the food, and not the service. \n\nInstead of water, they serve you Korean Bori Cha. Bori cha is only served in the summer, and it's an non sweetened ice tea. I haven't had bori cha in about 15 yrs. Most Korean restaurants don't brew it (to serve to patrons). \n\nI was really impressed by that. \n\nThey also serve Raw Crab Marinade(Kye JJang), which I'd been craving for a very long time. This is  also a dish you're unlikely to get at other Korean restaurants. It was legit. For someone who was raised on Korean food, but doesn't get it often enough, I was so happy I could have cried. It was well balanced, spicy, and just out of this world. \n\nMy bibim naengmyung was sooo good. I was already sold by the other stuff, but the naengmyung was the cherry on top. It was just like homemade. Their side dishes were generous. We got tofu with soy sauce/chives on top, steamed broccoli, soy bean sprouts, kimchee (which was really delectable), pickled cucumbers, and braised potato. \n\nWe also got the fried gyoza. Normally, these are pre-made from the Korean store. Not at this restaurant; you could tell someone's grandma made these. Instead of the standard 6, we got about 10 of them. The dipping sauce was light.\n\nI live 30 min away, but this place was definitely worth the drive. There were a lot of Korean people in there which told me this place was the place to be.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2015-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "toDSJ0I17ECFu2nFa4phmA", "review_id": "MY0Ce-4NErXUpPblv3dLTQ", "text": "Service is a two, food is a four. We had to ask for water three times.  Oxbone soup broth is extremely bland, but the meat is soft.  The kimchi fried rice is deliciOus and ridiculously hot. The beef brisket with onion soup was a hit for taste buds but the meat to vegetable ratio is heavier on the veggie side. Seafood soon tofu is very tasty but medium hot is very spicy. They were accommodating and took the soup back to dilute the broth to make it less spicy when we mentioned it. I'd definitely go back to try more items off the menu.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2015-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HdmGhwK6acAvyg992L2JgQ", "review_id": "HvlNWLMpAkNWHjbVeQdfig", "text": "Came here like 5 times. Lived about 5 minutes from this place. Great food but its kinda pricey. The service isn't the greatest during busy times because there are not enough waiters and tons of customers. Really popular place. I would take my friends here anytime.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2015-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AmwQ5M5y7BGtMAYi1J4hkA", "review_id": "-yNI3TuLPwEItZsVvnGFdw", "text": "Best Korean BBQ in Arizona! Their lunch special is a great deal and you get a little bit of everything in terms of BBQ =)", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2015-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Pef1PbO6MlDPcaw6KUfA7A", "review_id": "4X83NJ8LcQSKCu_WTy8sUQ", "text": "Ive eaten here plenty of times and always enjoyed myself. I wont order any thing other than a #27, bibimbap during summertime. A light, fresh veggie dish w all the sides is a brilliant lunch or dinner.. I never feel ashamed of myself after eating the entire thing.  Im pretty sure the potato side dish is dessert, i love it. And the cucumbers, omg. Yuuuummmmmmm.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2015-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yUcIdPSbt0236o4niw1kkQ", "review_id": "W-5NKBRtV77C0fgdDjQLtg", "text": "Hodori is my go-to Korean restaurant. It's unpretentious and reasonably priced but serves some of the best yukaejang (shredded beef, whisked egg, green onions, and noodles in a hearty red chile broth) I have ever had. This stuff is comfort food that warms my soul. It is also served with 5-6 delicious varied sides- kimchi, sliced tofu, potatoes in barley sauce, marinated bean sprouts, tiny fishes, sauteed fish cakes, and a couple of others.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2015-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4N3HChlnPEBQJC6lH2juuA", "review_id": "o2t2HlZOdVNG4keYba3zgQ", "text": "I've been to this place a few times.  The service is always less than welcoming. I keep going back because its the only Korean place I have found in the Phoenix/Mesa area.  So I compromise in the service and price department. Plus the food has always been a hit or miss.  The only constant thing I have enjoyed is the Kimchi Pancakes. Overall, a gamble on good Korean food is better than no Korean food ..... I guess. But today in the bibimbap we found HAIR. I really wish this place had great service and good quality food I could count on. When the food is good, its good! But sadly due to the service, the hair, and the high price I may not be returning again.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 2, "date": "2015-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UKp2F46cq5yZSoG2BmENeg", "review_id": "OzCJW3bqTo0GdaU28zGdxw", "text": "Never been disappointed been coming here for years spicy pork and pork tofu soup are my most favorite dishes there.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2015-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MulVGJtX8hGuFcJL9k8tlA", "review_id": "BzL7s1jSG5UcJZTRlJmoHw", "text": "Enjoyed the food. Everything tastes fresh. By far the best korean food in town. Their famous dish is the tofu soup.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2015-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "rG-EHv-muei35ecGYaXRSQ", "review_id": "jtyF0rNUKWRxvDaOz0mEkg", "text": "$20 Bulgolgi was dry, cold, tasteless and onion was raw. They forgot to heat up the cast iron plate.  $16 Spicy Octopus was like chewy rubber and totally inedible. \nVery very dissatisfied with the dinner experience. \nFirst and last time to eat here.   \nThere are better Korean restaurants around.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 1, "date": "2015-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ywuITSi_qoO6V0rFKQNE8Q", "review_id": "2QjyhvHWQ2CBJaXyHjXoXg", "text": "Best Korean place in the area. I suggest you try the menu as most will not disappoint. My favorite is the nakji bokum. The staff is friendly and try really hard to please. I would visit this place again when I visit Phoenix again.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2015-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4zXXcYKTe6QhPrqUMXOI6A", "review_id": "q7xdU1Br4TyhbupYCyHziA", "text": "This place is awesome! Been eating here for over 7 years and I guess they recently made some changes and stepped up their game. It's the little things and I love all of the condiments and side dishes. The new pork belly dish is super yummy!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2015-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I-P1v7sRjDLEfVOndp01kA", "review_id": "tzlCYPxyC7Rm6c7UN2o_tA", "text": "Not the best Korean food I had. Its not as authentic as other places,\nand their recepies are interesting.\n\nDo NOT order Japanese food here.\nOwned and operated by Koreans. It tastes different.", "business_id": "QQvzErQ8Ijdy3SyEmYVG7Q", "stars": 2, "date": "2010-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bie7O0s9bDl-wTq9e0hvHQ", "review_id": "YD5ylkweb5ErHNRkava5bg", "text": "It's now called Hon Machi but this place was awesome. Not the best Korean food but it was good and hey, we're in AZ. Our service was great and the staff was super nice. Definitely will return", "business_id": "QQvzErQ8Ijdy3SyEmYVG7Q", "stars": 4, "date": "2014-06-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "uEG5uD9wMJixGWxaq34IEw", "review_id": "Sw3z8XpJtRDDihDq9yfA4g", "text": "Chinese food is generally speaking horrible for you, but this place bucks the trend. They use healthy fresh ingredients, and don't drown the meals in sauce. I've had the whole menu and can say I've liked everything. Great prices too.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 3, "date": "2008-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "u4VTpUUwzdwoq1gULgOb4w", "review_id": "4ajc104HafcpSTiOOytdmQ", "text": "Searching for for Chinese take-out, I decided to try China Lite.  We enjoyed the food.  It's set up like a sandwich shop (vs. a typical Chinese restaurant), so dining in is possible, but it will not be elegant in any way.  The food tasted fresh, was not greasy and the several dishes we sampled had different tastes and sauces.  That's a terrific starting point for Chinese restaurant goodness, and China Lite passed our test.  We're going to try some of the other places in the vicinity, but will likely return to China Lite.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 3, "date": "2009-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "KSTOdz0lSFCkqBSRNwjERA", "review_id": "JY8fsPAj2kRwRuspJM210w", "text": "I was craving for some pad thai and didn't want to drive too far. I decided to order from China Lite as a coworker had mentioned it was pretty good here. Wow, never again. It wasn't very tasty! The flavor was really off and while it looked a lot like pad thai, it certainly did not taste like any I've had before. I never had pad thai that came with brocolli and zuchini! I should've known not to order thai at a chinese place! If it were based on the pad thai alone, I would've given this place 1 star! But I've been here several times before and usually get the szechuan green beans and really enjoy it so they get some redemption points for that. I haven't tried anything else and at this point, probably wont. I will stick to the green beans when coming here!", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 3, "date": "2010-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E1TKY4krbTVIfbxTZXL35g", "review_id": "uF66XKm2c3FLLwENRk9vWg", "text": "This was my first time here and I will definitely be back. There is a great selection off various dishes and it allows you to eat light yet enjoy the deeper taste that this cuisine offers. I had the Szechwan egg plant with chicken and it was fantastic. The owner was a great guy and the place was clean and well kept.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 5, "date": "2014-07-02", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 0}, "user_id": "4NiqWFJpDV5Th-hVLC2gjw", "review_id": "SlUCKVz1loQb6zhNGvydSw", "text": "As a vegetarian, I have to tell you that I was pretty excited to see a place called \"Tofu Hut\" -- open 24 hours a day, even!\n\nWhen I finally made my way over there with a fellow vegetarian (the only person who could possibly be as excited as I was about a restaurant called \"Tofu Hut\"), I have to say we VERY disappointed.\n\nAs far as I could tell, there were only two tofu dishes on the entire menu.  And they both had meat in them, too.  This was apparently more of a Korean BBQ place than a vegetarian haven.\n\nNot only was its name misleading, I found the inside to be very unclean... When I ate there the first time, I didn't touch my food.  Needless to say, I wouldn't eat there again.  Ever.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2007-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RsS6jUNram-5svM78_fdbw", "review_id": "PKZvxZ5pwQdDg9me3pGJYw", "text": "Tofu Hut is a cute little free-standing Korean place. I come here once in a while for a hefty late night snack. They have yakiniku and lots of topu soups. \n\nWe just went last night for some topu soup. They had a little poster on the wall advertising free karaoke from 11p to 4a above a little karaoke system and monitor. \n\nI ordered the sashimi bibimbap ($10) from the poster next to. \n\nI like ordering things off the wall apparently. I think I got that from Ichiza. \n\nThe server dropped all of the banchan, nothing special, but there was seven or eight different shallow banchan. \n\nMy entree came with a topu soup, the Korean version of miso. The server said my sashimi was \"a white fish, yellowtail.\" They drop this huge bowl of salad greens, daikon, and sashimi. You're supposed to dump some rice in and this spicy, sweet, vinegary sauce and mix it all up. I've never had bibimbap because I don't eat meat too often. It was pretty good. Only the sashimi was still frozen. Meh. \n\nIt was enough to fill me up PLUS take leftovers home. Leftovers is my best friend. \n\nWhen you're ready for the bill, you have to body check the waitress to get some attention. But aren't all Korean/ Chinese/ Viet restaurants like that? No? Dust? Anyone? I don't know. \n\nI like Tofu Hut. Their prices aren't great, but the portions are huge. And they have soju. And soju puts me to bed with visions of sugar plums ... \n\n* off the strip, non-casino", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2008-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p8xnlZsbi2BH_q4zPgpKHQ", "review_id": "1dbLjKlhaMOLme8p1aN7ug", "text": "This place bites...we got seated...and then it took 10 mins before we even got offered a menu and then 20 mins later we didn't even get checked up on...it's just I felt so ignored when we were over there and they weren't even busy...what made me real angry was the fact that the people who were seated after us 20 mins later got served before we did. My friends and I didn't wanna take it anymore and we walked out and yet no one said anything (that place gave THE worst customer service EVER) I will never ever think of going there.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2009-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6jSwhwLGUH00ZTM7t9tRKA", "review_id": "4bNtZFvDN3e6mmCv5Alt9Q", "text": "Since they now have an all you can eat BBQ  option, 4 stars. With tax and tip ----you don't have to tip well, service consistently blows-- about $20. Worrtthhh it. Just have to be a bit proactive with everything...\n\nJust reiterating, with Asian food, my ratings are weighted far more heavily by food than service. And what's not to love about unlimited grilled meat?", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2009-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FW67E8UxmR3sS3G7HrLFJA", "review_id": "Orx_nMa6C_LOAW0YUGR3zQ", "text": "$17 all day for all you can eat Korean BBQ. What a great price. The menu has about 10 items on it, typical Korean fare - except for the amazing rib eye. It is absolutely utterly a work of art. It's rare to get a meat that is so tender and soft it just melts in your mouth. The marinades and sweet tangy flavors will tickle your tastebuds. I am positive I could have ordered 3 or 4 plates of this and a half cup of rice and been in food heaven.\n\nAs for the rest:\nkorean appetizers - very good peanut salt & pepper dip and fish cakes\nrib eye - a bit dry, like pho well done flank, nothing special\nsteamed egg - a fluffy egg similar to that in soups except in one piece. it works really well with meat and rice, I recommend it\nmarinated short ribs - very good, but if you've had korean bbq you've had it 200 times\nmarinated pork belly - fatty and a korean bacon clone, tasty but too much fat\nboneless chicken breast - took forever to cook and was pretty bland, nothing special here\n\nThis place is open til 5am for the drunks in Vegas and has a special cheaper price after 11pm I believe.\n\nDefinitely worth coming to again for the rib eye.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2010-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KYEKYUeThIRmu1nKGeo0Ug", "review_id": "esk-x5p-1qKOfP5idvRd4Q", "text": "Korean BBQ... yum yum yum \n\nI visited this place for lunch today expecting to be sleepy from food coma afterwards. It let me down....\n\nService: it was OK \n\nQuality: could be a lot better \n-Sliced ribeye: good flavor but didnt tatse like ribeye \n-Brisket: cut too thick so still a little chewy at times and didn't look that fresh. \n-Marinated pork belly: dont try it... \n-Short Ribs: way too much fat in the cuts, not trimmed properly, the chewy lining was not taken off. \n-steamed egg: that was the only thing I think was really good. \n\nOnce is enough, rather just wait till I visit LA to scratch the Korean BBQ itch next time.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2010-06-25", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "NXmA2esVKkg8T_5gBnLmQg", "review_id": "z61UEaxx4GHS62gCeGgcRQ", "text": "Hello Tofu Hut, it was so nice to meet you! \n\nChecked out this place and became a fan because hello all you can eat Korean BBQ. Heck yes! Tried it out and became it was love at first bite!\n\nMy bf, coworker and I ate here and whoa we were satisfied after. So we got the all you can eat BBQ which was $16.99 per person for dinner. They do have lunch too for only $14.99! There were about 10 different meats that you can choose from. We ordered sliced ribeye, beef tongue (totally not a fan of it), brisket (oh so tasty), and tripe (it was weird). We totally killed it! \n\nThe service was okay, kind of forgot our rice until we mentioned it again but then again 3 people working on a Friday night umm yea that should explain it. But they checked up on us a few times so yay! \n\nIf your not an all you can eat person and don't like to cook your own meat then they do offer another menu, but it is totally worth doing the all you can eat.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2010-06-25", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 3}, "user_id": "dcaOEKSHIEr8zgsCb6VQFA", "review_id": "n1VbtvK6GbbfJvWc5sjvNw", "text": "There are plenty of choices to be had in this part of LV for good Korean food. Back when I lived here (pre-2009), TH was a regular lunch spot for a bunch of co-workers. Somehow, we managed to make the drive under the Desert Inn underpass from the east side....but it was so worth it - even with that blazing summer sun. In the winter, it was a real treat where you could come here after a long hike in the mountains or Red Rock to enjoy a nice warm bowl of their spicy tofu soup (sundubu). They have a limited bottled beer selection (i.e., Hite and the standard Bud, Miller types, etc), but it's there and makes a tasty compliment for your post outdoor excursions... ;-)\n\nAmbience is bare bones. You might even miss this place b/c it's right across from the main drag of LV's \"Chinatown\" and right next to a tire store and just before Play It Again Sam. However, this place has been here for awhile and locals know it. Occasionally you might even see the owner from Ichiza's eating here as we did one time.\n\nThey have a setup for BBQ (grill, hood, etc) at select tables, but I never tried their other menu items, b/c...well, it just seemed like their specialty was the sundubu. And for that, I've never been disappointed. You basically have your pick of whatever you could possibly imagine to put into that piping hot stone bowl - vegetables, seafood, mushroom, beef, etc. They have it all - even for the vegetarians. They don't skimp on the pickled dishes either - we've gotten refills when asked and they always seem to give us something on the order of 6 choices. The soup comes out with a nice raw egg which is the way I prefer it. I'm not sure, but depending on the time you go, I've had my meal end with the nice cool barley tea. it's a bit inconsistent tho...so I'm not sure.\n\nEither way, good quick service, an affordable lunch price (all under $10 per person for the sundubu) and great consistent food quality makes this an easy 4 star review. If you're feeling adventurous after your hot meal, head over to Play It Again Sam for a true \"local\" experience. :-P", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2010-07-10", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "23zYCcnqfru5jdxnTqjgDg", "review_id": "NNKZzeO6KFhPmQ6LWVcRHw", "text": "Ok so I did have a bad experience at Tofu Hut. But through coaxing with one of my Korean rock star friends I decided to give it another chance. This time for a little something feastllike. Yes All you can eat bbq. Well first off at the price of 13.99 - uhm economically hit wallet was economically happy. It was one of those late night things. But I  had the brisket, tongue and pork belly. those made me really happy. The salad was pretty tasty too. I especially liked a giant bowl of salad with crushed red peppers and onions. All the little side thingies were definitely not disappointed. I guess I didnt like the marinated ribeye so much, It was a little too sweet for me. Just give me the meat with no seasoning so I can dip it in my concoction of sesame oil, salt and pepper and symphonize a ballet in my mouth. Plie, plie.....now arabesque along with the lettuce......", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2010-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wbIU917ctOGp8-NdeVxIWw", "review_id": "nV4kOPK324R7wsBlxYZWHA", "text": "So I didn't try the pork belly which is what I hear is the bomb... so i guess that's why i'm not the biggest fan.  \n\nwe did try the all you can eat which pricing wise.. is great. we ordered the short ribs, chicken, and rib-eye..\n\nthey start you off with a bowl of salad which was very good..  [i actually make the salad at home everyday!]  then they bring out little dishes that included kim chee [i've had better.. wasn't the best kim chee i've had...] pickled radishes, cucumbers... and my favorite side dish:  tofu!  \n\nthe short ribs.. i've definitely had better... and have MADE better as far as marinade.  it's not even short ribs but beef cuts.  the spicy chicken i kinda liked.. [a little bit]  but it was a little dry and not  juicy at all.  i did like the sliced rib-eye which is on the salty sweet side.  \nother than that... i've had better all you can eat korean bbq, but the price was good.  \n\nas far as service.. there's like 1 guy waiting on the entire restaurant., [which isn't that big... but still..]  i don't know how it is on other days since this was my first time here.. but he was friendly and accommodating.  i had no issues with dude.. but he definitely needed some help that day.  \n\nnext time i'm coming with the friends that recommended the place.  i guess i ordered wrong!  but.... eh, as far as coming back because i want to come back.. i'll pass.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2010-08-10", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 2}, "user_id": "haQaMRoN74xRLDoc0gq0Jg", "review_id": "qOl-oBzeBYf96gqCJv4u-g", "text": "Remind me why I revisited this place again after many years?\n\nOh yeah! It must be so that I can briefly say, \"Meh. I've experienced better\"", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2010-08-26", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "TgqfghPMtVj4n7tWxh2mmA", "review_id": "DOlXhCYCRtFmeaoDiBO_MQ", "text": "all you can eat kbbq! i got a yelp guru advice to eat here. and yuummyyy. our party of 6 ordered a lot of meats!! we ordered ribeye, bris kit, chicken thigh, pork belly, tripe (i think that was all) but they give you all kinds of kim chee and rice if you ask for it and salad. the salad was zesty and tasted really good with bris kit. i'm not a fan of pork belly. but i would advise to cook the chicken first because it takes the longest to cook. service could use a little work being that we sat and waited for any contact for at least 15 minutes when there were only 3 other parties there.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2011-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UkY16-axw1VOQUHeSTbafg", "review_id": "qkQAJOuVnM_4j9AhP7JYRw", "text": "Wanna get your late night grub on, go here!  Been going here now for almost 2 years and it's by far my favorite place.  I always end up going after work and it does get packed.  Sometimes the service can be shifty because they have such an overflow and limited staff but be patient because the food is amazing.  Marinated pork belly, korean short ribs, and some of the best salad ever!!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2011-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "P099eYoYjuwAE4PNLPNojg", "review_id": "tcVXGKx9eI4UejYluCVfbg", "text": "love this place. it depends on the waittresses tho. we always get all you can eat korean bbq. sometimes we oder bibibap which is rice dish. it is good too.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-06-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "lZnXyJFo5nOH6f8ZmSdGbQ", "review_id": "Ew0Z9v59nWDnE5rO_Vru7A", "text": "One of the locations my bf and I take our coworkers to is Tofu Hut. We come here every now and then after work for their happy house special $13.99 for AYCE korean bbq. After reading the review from channel 13 dirty dining reports, we were hesitant to go back there. But nonetheless, they got their A grade back, which means everything should be up to health code. Owning my own restaurant, keeping up to healthcode is sooo important. We reserved a table and the same guy and girl who works there is always kind to us. The meat is good and can't complain too much about the banchan cause we only go there to eat the meat & salad. Okay for $13.99, you really cant beat the price, yes their selection is limited BUT their selection contains main meats that we usually only get. Come to happy hour with your friends to share a few laughs, drink, & eat!!! well worth it!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "pAcpqw8hTnO3gjZJfZew1w", "review_id": "vIK3g5wsD9f0hlqW5LrG5A", "text": "service was decent and the food came out quick. my sister and i shared an order of spicy chicken and korean bbq short ribs - both were really good!  the spicy chicken wasn't that spicy but the sauce was tasty.  kinda pricey but it was a lot of food and good of course.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "IFD5TlPsaQVPM3D9ZCjuww", "review_id": "emhdM-miCzNzt6i2hbkrzw", "text": "Tofu Hut is usually a place my friends and I frequent after a night of alcohol binging around town.  We usually come here for their AYCE since they're open late (4am).  We always order the rib eye, brisket, marinated pork belly and the bean paste soup (so good after all that alcohol!).  The amount of meat we consume, $13.99 is very much worth it.  Come here if you're having some late night munchies.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2011-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "C0UY1f2BUUmLdmB3sn5_lw", "review_id": "Xy-KTZADXv69X_bENszXVw", "text": "Driving through China town on a Saturday night about 11. Wasn't really hungry but saw a Fukuburger truck and pulled into the parking lot but now I wanted rice. Come on I'm in China town, I am not gonna eat a burger with all the different restaurants around. Saw this place in the same parking lot, what is this all about, a bunch of tofu dishes? ok I'll try it. \n\nThey offered a pretty small selection maybe 8 Items AYCE for 13.99 (the way we went), tongue, squid, brisket, spicy chicken, 2 types of pork belly, and a few more.16.99 for short ribs or steam eggs. Include a variety of Korean sides and a kinda salty salad. I think drinks like soda and alcohol were extra because they never offered drinks and kept giving us water. The tongue was surprisingly ok, tasted like regular meat.  Spicy chicken and marinated pork belly were good but took too long to cook.  The very first item on the menu, forgot what it was sliced something, but not a good choice for grilling it was in tiny chunks like ground beef but not as packed in and kept falling into the grill openings. If u do get this cook it as one whole piece like a burger and let it burn a bit, easier to flip that way. \n\nCustomer service was ok once we got going. Two other groups were there when got there, the girl told us take our seats, waited almost 15 mins before anything went on. They got our ingredients, etc quickly. \n\nIn comparison to the other self cooking Korean places that I've been to, two other places, it is my #3 choice. Because its cheaper but way lesser selections and have no idea about the drinks.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2011-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Jmkhec-LQhKQKey0k9wmoA", "review_id": "uFwT6KTO24x8U72woHlRcA", "text": "So I know a lot of people complain about Tofu Hut's service, and especially with it being slow (which I completely agree) .. but the food here in my opinion is delicious and one of the better Korean restaurant in China Town. \n\nI've been going to Tofu Hut since before they started having their all you can eat bbq special.. and that was when I noticed the place had picked up a lot more than before. The workers here are all the same workers from the beginning, which is why I think they should really hire more so that 2 women (the normal amount of servers even at 3 AM) don't try to cater to half a side of all you can eat parties and half a side of regular dine ins. It's just too much plates to serve and demands for them to keep up. Every time I go there, I can tell the waitresses are flustered and there's not a time I don't see them run around like crazy. The all you can eat large groups is just too much for them to handle with a small staff.\n\nThe food on the other hand is very good, especially their bulgogi, and tofu soups. Their kimchi beef soup is my favorite because it has the perfect blend of sour and spice. This is the one place where I think their spice levels are accurate, and if you order very spicy.. it will come out very spicy! The only thing that I noticed with their broth is that it is very deep in color (like a deep orange red). Even if you order it not spicy, the color will still be as red which I'm unsure of the cause.. Perhaps its food coloring or the oil they use... But the color almost looks artificial sometimes. (Someone needs to do research on that. I haven't died yet from eating it lol)\n\nTheir bulgogi combo is my favorite. It comes with tofu soup and bulgogi. Bulgogi is their thinly sliced beef, marinated with scallions, onions and korean spices, served on a sizzling iron pan. The meat contains a perfect amount of fat to make it taste extra special when you eat it with rice. Their bulgogi is slightly on the sweeter side.. but not too sweet or salty. It almost taste like Korean kalbi ribs, with the texture of extremely thin sliced beef so it melts in your mouth.. I really think it taste wonderful and something worth trying! \n\nLastly, their sides are also very good. They sometimes serve glass noodles and potato salad, which is my favorite.. They are the only place in town that are gracious with their side dishes and will give you a decent amount even if it is for one person.  If you ignore the service, and concentrate on the food quality, I'd definitely pick Tofu Hut any day.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MpUfVh-leP_otTrYpseaXA", "review_id": "gdjaA29ys75gg1zWmHFjUw", "text": "About a year ago, there was a line out the door at Pho Kim Long across the street and I thought, \"Well, why don't we try something new?  How about that Tofu Hut place across the street with the all you can eat? How bad can it be?\"\n\nThankfully, the experience wasn't bad at all and I've been back a number of times since then.  (Note: This was also my first  Korean BBQ experience.  Thank you, Tofu Hut for being open super late to offer this!)\n\nThis is on the cheaper/lower end of the Korean BBQ spectrum that Spring Mountain offers, (IMO the higher end being Honey Pig, but that's another review altogether.) Their all you can eat specials really do it here with AYCE (13.99).  Tons of decent food with about 12 choices available of meat to cook, about eight side dishes, salad, a pretty rockin' tofu soup, and the whole thinly sliced meat combo.  \n\nMy only complaint is that there is no AYCE for one person, you need to have at least two.  :(\n\nThe staff here, as one review stated, is always flustered because they get huge groups of loud crowds that show up half drunk and the place ends up mobbed and they're unfortunately under-staffed.  The staff here is friendly and I get a kick out of the Korean programs they show on the television, which are usually karaoke or K-reality programs.  \n\nIf you go at night, particularly Friday or Saturday night, this is a hot spot for after-the-club crowd around 1/2/3AM.  So if you're looking for a quiet dinner, I don't recommend it on those particular nights.\n\nMy current favorite thing there is their tofu dumpling soup; spicy tofu soup with some hot dumplings simmering away in there.  Their spiciness level is pretty good, although I could do with a PINCH more for medium.  \n\nI also recommend their bibimbap in the clay bowl as that sucker stays hot for quite some time and you can take your time.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2011-07-12", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 0}, "user_id": "5QHJbL88O2ltmjtq1QB5TA", "review_id": "ZSm7hXxLD5dJXu439LZ3bA", "text": "Food was bland and overpriced. My tofu pork soup cost $9 and had a total of 6 tiny strips of pork suspended in a cesspool of tofu slop. The bathroom was disgusting and had no paper towels. Awesome to realize this having already gone in and washed my hands only to have to open the door with my bare hands THUS DEFEATING THE POINT OF WASHING MY HANDS IN THE FIRST PLACE. \n\nThe water was served in those crappy plastics cups you're accustomed to seeing in china town restaurants. Like my silverish-gray car, it's difficult to determine if these cups are dirty or not, which is ideal for restaurants that have no measure of upkeep  (and ones that have several kinds of STDs on their toilet seats). I never eat at Chinatown restaurants voluntarily and I'm always disappointed when I do.\n\nMy star in this one-star review goes out to our server, who did an exceptionally good job given the mediocrity that surrounded him.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2011-07-20", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "glRXVWWD6x1EZKfjJawTOg", "review_id": "fmMD4J5GEzvU6igAU6AnKg", "text": "Needing some food to sop up the bacchanalia, I immediately thought of meat + rice comfort. \n\nThe BF and I came here for the $13.99 AYCE. This is different from some of the daytime known AYCE KBBQ since it's all table service and not a buffet line. \n\nFor banchan we had- fish cakes, korean pancake, bean sprouts, napa kimchee, cucumber kimchee, chap chae. They serve you a bowl of rice and a large bowl of salad. I wasn't feeling the chap chae seasoning, but the rest of the banchan was good. I liked the lightly sweet and tangy dressing on the salad which went well with all the meats. \n\nFor meat choices you can get- brisket, thin sliced ribeye, pork belly, marinated pork belly, squid, tripe, tongue, chicken thigh. Also ayce bean paste soup. You can upgrade your ayce to include short rib and steamed egg for $16.99. \n\nWe got the ribeye, marinated pork belly, and tongue for our meats. Ribeye had a nice marinade to it which a lot of places lack flavor. Pork belly was with a spicy marinate with onions and pretty good once you let the fat get crispy since they slice it very thin. Tongue is always my favorite- cooks fast and great with salad. Since they plate the meat for you, they sometimes serve a bit more than I want of one of the meats so if you want to taste a lot, ask maybe for small serving. \n\nI was worried about the service after reading reviews, but the service was good. Our water was refilled and refills on food came out quickly. It wasn't very busy, but the guy watching our tables cared to check on people which makes a big difference. \n\nGood late night eats and good value. Definitely will be back.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k8VnoIrFbAWSiHFspTP_tg", "review_id": "-kN0WpFguJ8HSY_lTgnoZg", "text": "If you're expecting great service.. then this is not the place for you. BUT if you are there for delicious tofu soup or all you can eat korean bbq then this is your place. \n\nAll of the tofu soup don't exceed 10 dollars.\n\nYou do get all the little korean side dishes if you just order tofu soup and or all you can eat korean bbq.\n\nI think the all you can eat korean bbq is cheaper than most places in Vegas. If i remember correctly dinner time for all you can eat is 18 bucks or so.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bZC6-0kfo6spj4SVf2NyXw", "review_id": "r0S-bOPSigDQ2wrMAHa1jg", "text": "My recommendation: The ribs and coffee\n\nI would love to work at tofu hut. The chefs have it so easy here. They leave it up to you to cook your own food. I think that's a cool concept that allows you to cook your meat as rare or well done as you want. \n\nThe brisket was so fatty. I felt like I was chewing bubble gum, but the ribs were delicious. They also had this vending machine that gave you about 4 oz. of coffee for 50 cents. I don't even like coffee but I make it a priority to get the milk coffee everytime I come here.\n\nThe sides were pretty good. They gave us a large variety to choose from. I liked the tofu dish they served the best. \n\nThe customer service was at a bare minumum. The lady came around every once in awhile to refill our water cups but that was about it. She didn't even talk (or smile) while she did it. It was very robotic-like.\n\nThe food was very good but I've had better, so that's why I feel the three star rating is appropriate.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2011-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z6mx5OClrvg_C0xBW34kxA", "review_id": "d-pyEKPbhMLcp8NX9IJT8g", "text": "I haven't been here for awhile, but I recently came back for their $13.99 after 11pm special ($16.99 with the egg). \n\nI personally only really like brisket and pork belly. It's not as good as Sura, but for the price, it's not bad. \n\nSince the kbbq side was all full, we had to wait a bit until there was room. We asked for two tables next to each other to minimize wait time (6 of us). \n\nI have no complaints about service. You typically have to call for the servers in Korean culture anyway so just flag them down if you need them. They walk by and clear your plates pretty often so you're good to go anyway. \n\nThe one thing I really like about here that the others don't seem to have is this pancake side dish. Yum yum. I'd definitely come back in the future for more $13.99 late dinners.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7x3-B0yaO_hqXm42VKStzw", "review_id": "2w5sJlvu1VE9lHEr1GAAzA", "text": "I like this spot. \nI mean, it's quite nice to eat at any Spring Mountain restaurant at 7pm  and not competely plastered!\n\nIt's like Honey Pig but, not as expensive and smoky.\n\nAt Honey Pig, I feel like I'm eating ridiculous amounts of food and rice! Prolly because I'm drunk whenevs I eat there so.....that answers the question.\n\nTofu Hut has the typical AYCE or ala carte orders. AYCE are no brainers at these places. At least, this way you can try new things.\n\nWe had the typical bulgogi, cow tongue (my favorite because it's cut so thin and fries so crunchy), skirt steaks (I think?)....\n\nI was told their salad and steamed egg was delish. \nI liked the salad...kinda Asian type of flavors...whatever that means?\nSteamed egg, was literally, just that: steamed egg. I was like \"wth, it's like scrabled eggs...?\" I mean, it IS good but, for eggs.....idk, it was just too plain for me?\n\nI'm just glad I got to try this place because of all it's reviews. For sure coming here again; maybe when Pho Kim Long is busy one drunken night.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "6uugz8picdVrjgmkymurXg", "review_id": "LwB5exbKqob8p_UKR5iAEQ", "text": "I've been here three times. The strange thing is I've never had tofu here. I always get the AYCE Korean BBQ.  Let me tell you, it's really really good!! You get to pick and choose what meat you want to cook up.  Their side dishes are great. I love the salad they offer.  \n\nFor $17, this is an awesome deal for AYCE. After 11, it's even cheaper!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2011-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4cBmT15LGoIuO3VGgKD7Yg", "review_id": "1GF08Vwq5JlcIQzce6cNhA", "text": "I love this place! Cheaper than the KBBQ stops here in SF so I was very satisfied coming here. I've (previously) gotten the buffet here - but my last visit my friends just wanted to get a la carte - which wasn't bad. We got the combination specials which included the side dishes (+unlimited refills of said side dishes). My go to side dishes: fish cakes and the pancakes (whatever that is, IT IS DELICIOUS). Here in SF I don't think we have those pancake things but they were BOMB.COM!! I could eat that everyday. I ordered the spicy chicken bbq. The tofu soup it comes with is really good - if you like it spicy it's not TOO spicy, but it's still good. Korean BBQ is probably my most favorite kind of food... I'll be back whenever I come to visit my best friend!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "ato-_l65dISE3yfTLELHew", "review_id": "Enh9bvW2o_OZlLP8V72QGg", "text": "I was a regular here years ago.  Went back a couple times recently...I still like the tofu soup here.  Everything is not too overly priced like most Korean restaurants, but I do find the galbi to be a little too fatty at times.  where's the meat? =) I do like the side dishes her so overall not a bad place to eat.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2012-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cs37Ohgq7_g3grJNEEUi2Q", "review_id": "iuJrVmp7Ew7kHM-I0cq1ew", "text": "This place is ok. not that big of a fan like the other korean restaurant. service is ok as well. i was just entertained how they serve the soup in a boiling pot, i recommend eatin the calbi there.. I would go back if my friends invited me but If i was to go on my own i woudl rather go else where.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2012-06-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M4hnzQvl17dET5Lo1jGd_w", "review_id": "_yqSUMFkWPsg5Sey3cLzQw", "text": "All you can eat for $16.99 per person. Wow, we had a lot of food! Each table is allowed to pick four items at a time. After finishing whichever item, you can pick something different to try. We weren't able to even finish the food we ordered, so we never ordered more. Everything was really tasty and our stomachs were happy! Too bad you're not able to take the leftovers home. Felt like such a waste of food. Not my first time here and won't be my last.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2012-07-02", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "kZ11FAE4NGbddxOOPeRL5g", "review_id": "Rnh1uPzTEFQuWp6TJWTyBg", "text": "My experience here was solid and I would definitely return. The service was prompt and drinks were consistently refilled. We did the AYCE Korean BBQ and for $17 you really can't beat the deal. The meat was tasty and the portions generous. We had marinated chicken thighs, pork belly, brisket and short rib. Everything was flavorful and fresh. I am not Korean so I am not about to get all snobby about the sides, but in my opinion, they were all fine -- including the kimchi. I will be returning here when in the mood for a filling  dose of delicious meats for cheap.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bMHWWq5Gt8GnFqex8wyEQw", "review_id": "IniH5UOCrIWP7ouSXRzEhg", "text": "Absolutely loved my meal here. We came in on a Thursday night with a group of 12 and we were lucky that they had a table open for us or else we would've waited for awhile. This place was packed! I think that for $16.99 a person it was a steal! We ordered so much food and ate so much it was ridiculous. The service was fast and the meat was fresh and very flavorful. I loved their salad that came with the bbq and the banchan was pretty good too. The service wasn't all that great and the place was a little cramped but the good food made up for it. I'm an out of towner and to see a lot of locals at this restaurant shows that this place has to be good, and it was! 2 thumbs up.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BTPM6UbhsTVE40FRq30Z6w", "review_id": "iikNumjE9xB3DEMgv2dtbQ", "text": "Crap service with mediocre food is not a good business model to live by.  The only thing I really liked was the pot of rice with overcooked rice combined with water.  It gave an almost popcorn like flavor which was unique and refreshing.  My waitress didn't even bother servicing us once the whole time I was there.  So bie it.  As a side note not a single Korean was spotted in this joint while I was there.  If the local Koreans don't eat here well that should tell you something.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2012-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Vlon2bJdT43_1oHSrQsHTQ", "review_id": "MKmuXZMn4iEMlwVOEXw-RQ", "text": "Best deal in Vegas for all-you-can-eat korean BBQ, 17.99 a person. You could get the 13.99 per person deal, but you'll be missing out on the short ribs and steamed egg. Just pay the extra 4 bucks, it's worth it. Even if you're moderately hungry, you'll get your monies worth. From pork belly, to bbq beef, everything is top notch. One of the best things to get there is the steamed egg. Its soft and hot and well flavored. They give you a lot of side dishes and will keep them fully stocked. Oh, i'll be back!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3asH0rYJrmFJXiVgKxZO6w", "review_id": "a2SiBkJn_rzE7_FPRZ8WCQ", "text": "Not all that great but it's just so cheap. Of the stuff we ordered, my least favorite would have to be the marinated rib-eye. The marinade was pretty bad. I also would not reorder the marinated pork belly, as that's cut into strand like pieces, not large thick slices like the regular pork belly. Speaking of the pork belly, not as thick as I like that other places do. The first round of brisket we ordered was good. The second round however was cut so thin that it just kept flaking apart as we tried cooking it. Picking up shreds of meat is not a fun way to eat. This was probably related to the service.\n\nSo speaking of the service, it wasn't that bad if you consider they were seriously understaffed. Every BBQ-able table was filled up, which is a little more than half the restaurant. As far as I could tell, there was one server and one person working the kitchen.\n\nThe orders of meat usually come out in pretty small quantities on a small plate too. Don't know why they did that while being understaffed. The salad mix they give you on the side is delicious, probably my favorite Korean BBQ salad anywhere.\n\nEventually we stopped eating because: 1. it took so long to get our next order of meat and more salad (I think they ran out and kept having to make more) and 2. the grill was so small that it was hard for everyone to keep eating at a good pace.\n\nEven with all the negative comments, I'd still give it 3 stars because it's decent and so affordable.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2012-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "na1bNb0ZTH2XHaywskhiPQ", "review_id": "DDgTnrYirza21FLVyS6JeQ", "text": "This is a great late night spot.  I think they have a great chopped salad and their selection of meat and kimchi is great.  I do feel they have some items I stay away from like the Squid.  Steamed Egg Great, Miso Soup Great and it's all you can eat.  Have to try it", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2012-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fzy5CCuLns6n9IUTsdTI8w", "review_id": "pL6-Q08LKj9BBfQL_-YjOQ", "text": "Went here once on a lunch with my co-workers, one of whom was Korean, and admittedly, his rapid, off-menu orders in korean probably helped make this lunch extra delicious. But I mean, it was already delicious. \n\nWe totally went for the Korean Barbeque, and I can in no way speak to the quality of the tofu.\n\nThe restaurant was clean, smelled wonderful from the moment you walked in, and the staff was all courteous, prompt without being lingery, and polite, even to those of us at the table that had a fairly difficult time pronouncing some of the korean dishes.\n\nFour of us had the all you can eat, beef shortribs, of which I ate an entire plate all on my fat little lonesome, beef tongue, and beef brisket. Because cows sliced as thinly as loose-leaf paper and then cooked on fire are delicious. I think we went through about 3 orders of each. We also had 2 steamed egg thingies, which were wonderful, and some sort of spicy-savory red bean condiment paste thing I didn't catch the name of.\n\n\nPros: \n- The classic bite of salad-bite of rice- chunk of meat combo is just so salty-savory-umami wonderful, It's absolutely cravable. I've never had a preparation of the salad the way tofu hut does it, and it was awesome.\n- Beef tongue.\n- Clean restaurant, awesome wait staff\n- Really reasonable prices\n- I, the whitest person alive, was not offered a fork, since it was clear I had the chopstick thang down. \n\nCons:\n- The atmosphere came off a little bit on the cafeteria side, which is not my favorite, but...eh, also the least important thing to me. \n- The proximity of tofu.\n\nVerdict: I will totally be back, though probably not ever for anything related to tofu.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rhJGxwiWHudQGu5pEaXK5Q", "review_id": "2uckAOGAt6aH8C0hdPT3CQ", "text": "I like this place. I like the atmosphere, food and the price. It's perfect late night hangout. The meat is not the best quality but when you are little drunk it does not matter. everything tastes good. I would recommend this place if you are on a tight budget like me and want to eat up! plus they are opened till 6AM. Thank you Tofu Hut.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WS7G9YRIPmBdaTvdN2w-jg", "review_id": "jYFgYF1FwOHJ3kCd1Vwo7A", "text": "My first time going there n it was amazing defiantly going twice a week!! Yum !!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "XpxK7cAT4R3wQjHOZccasw", "review_id": "fUztaGznpXacQrDBGe1OvA", "text": "First time back in a long time...It's either gotten worse, or I've learned of better KBBQ in town....or both!\n\nWasn't a big fan of the meats truthfully...the only one that had flavor was the Marinated Pork Belly, and maybe the marinated chicken...the rest were a little boring and tough even after a quick sear.  Pic of the meats : http://www.yelp.com/biz_photos/tofu-hut-las-vegas?select=zCo32peMlhCJI_0H7q1SUg#zCo32peMlhCJI_0H7q1SUg\n\nPic of the meats cookin' :  http://www.yelp.com/biz_photos/tofu-hut-las-vegas?select=YuJt74AHAnh24_SqZNedLg#YuJt74AHAnh24_SqZNedLg\n\nThe banchan was ok.  Nothing really stood out, but the servings were plentiful.  When we ran out of kimchi, they resupplied quickly after a request.  Pic : http://www.yelp.com/biz_photos/tofu-hut-las-vegas?select=vHznYxpqkzfUaFttHH7JUA#vHznYxpqkzfUaFttHH7JUA\n\nOnly half of the dining area has BBQ grills, so expect a wait.  Ours was about 30min, around 930pm on a weekday.  Not a big deal to me, just expect it.\n\nThe only thing they really have going for them are the prices.  It's about $14 for AYCE during 10pm+, so they are almost half price of most places.  But unless you can't afford the extra few dollars out on the town, do yourself a favor and look elsewhere for KBBQ.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2013-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vlKJWos3plcFEUP-zNapyA", "review_id": "KyqkrYwiN0AnQfTMBsO3lg", "text": "My friend told me if I want eat good tasty  Koran BBQ,Tofu Hut will be a good option.Finally  we went to try last week.Well, I have to say,it is a good deal for AYCE.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2013-06-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "38JK-SfO9NkAGs1RwlH2Gw", "review_id": "tdLTYikApWm5i-oofqSjTg", "text": "We have dined at this Korean restaurant several times either cooking on the tableside BBQs or ordering kitchen prepared entrees. This night we chose the latter, sharing orders of spicy chicken and bulgogi (grilled marinated beef). The entrees were very good, but the 6 banchans (side dishes) were largely forgettable. I also tried for the first time a cup of mushroom tofu soup that I did not find to my liking.  Prices are moderate when combined with a KSHP discounted gift certificate.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2013-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mgViQiuQG_3d2CmLTNW9rA", "review_id": "XOESdN9yRlJRMCozn539sA", "text": "Ive been here for KBbq before and was not impressed. Today I came for soondubu ONLY because Mr. Tofu was closed and was still NOT impressed. At all. The tofu is all chopped up tiny and there arent really ANY vegetables in the soup either. The banchan doesnt seem that fresh either. \nIf it's up to me I will not EVER be eating here again. It isnt HORRIBLE but it definitely isn't GOOD. Two stars cuz the food sucked but the staff was nice! \nGO TO MR. TOFU! NOM NOM NOM!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2013-07-07", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "GNwyDbDZwNpUggcuKcj2hQ", "review_id": "tM95-k6SqkvLYrMj7MgCDg", "text": "Love eating here! Gets busy around dinner time & wait time can be from 30 mins to an hour. Besides that once you're seated the servers bring the appetizers & meat out to you pretty fast. There's one server here whose name I should really get because he knows mine & my boyfriend's order by heart so as soon as we sit down the meat is at your table. That's what happens when you're regulars! Lol. I recommend the beef tongue, spicy pork belly & the short ribs! Super yummy & worth the $20 for all you can eat.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hnZCjyTvTGMMpfi3Yr8p7w", "review_id": "te3Poc4U2v1bf7V866Nk7Q", "text": "I come here for the AYCE KBBQ. The meat here is better than most KBBQ place in Vegas for almost half the price.  They don't have much of a side order selection but the salad and the sides that come with the meal is good.  The only problem is that half the restaurant is for KBBQ so seating is very limited and it can take very long to get a table when it's busy.  The service is decent.  A server will come around now and then and ask if you want to order more but its hard to get their attention when they are  running around.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2013-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wV4T_2bQ1sOSd8ou8vsg-g", "review_id": "e9jI4I1XxB643GsUDak8gg", "text": "Basic Korean BBQ.\n AYCE is affordable.\nService is okay..\n I really like their salad!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2013-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SDENuRdSeHAxxSbgKRVxqw", "review_id": "idBDjka60AtRXDic8jIa1Q", "text": "I ate here yesterday around noon for the first time. Then came back again later that night cuz that's some bomb.com stuff. Salad is on point. I like how it's open late too. I usually get hungry after clubbing, so this is def a spot for me to go to.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "p_16d0TuLoh9zYVWaI8mRA", "review_id": "MXAPXoTcC_bENCmMW3Z20w", "text": "Tofu Hut... we have a love hate relationship.\n\nService is AWESOME most of the time but sometimes i feel like they forgot i was there.\n\nMeat quality isnt the best but for its price you cant really ask more.\n\nWe always get the AYCE. Just brisket and pork belly. because everything else is meh... \nand dont even talk about the squid...i thought i was going to be seasoned...its not...they throw it on a plate and just give it to you...really?.... wow.. lol\n\nidk how or why i alway6s end up here but like i said.. its a love hate realtinshui[ lol", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2013-07-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m9I0d7mUwEt5cl7IfUF_CA", "review_id": "LpyA-VRxbAKfd9yJJicURQ", "text": "There is only one Korean BBQ place I go to here in Las Vegas that I really enjoy and it is Tofu Hut. The dumb question I asked, because this is a meat meat meat place, is why is it called Tofu Hut? Well, go in to the non-BBQ portion of the place and you will find out. The average price for AYCE during normal hours is $16.00 and  while late at night, the happy hour (10 PM - 3 AM) is priced at $13.99 which is fantastic.\n\nI always come here with friends and the food is always so delicious. We usually get the beef brisket, beef short ribs and the beef tongue. They are very generous with their portions of meat and they always help you change out the grill when they can see smoke polluting our smiles of indulgence. Not only is the meat delicious, but they provide you with the pleasant company of numerous side dishes and this AMAZING salad that I could practically eat myself, allll by myyyyselllf. \n\nReviewing a place like this is somewhat tough, because you basically cook your own food. So no complaints on the meat being over or under cooked, that would be my fault if that were the case. I like the judge the place based on the quality of the meat and the cleanliness and this place, as far as I know, has always been really good with that. I've never looked at the meat and thought it wasn't fresh, because the meat is always fresh and marinated to perfection.\n\nThe one thing that does prevent this place from the all mighty five stars is the service. Sometimes, I feel as if I'm an inconvenience to the people there. I'm not very needy, but if my grill is full of char, I'm going to request a new grill. You can often see the groans and the impatience, sometimes I'm almost forced out of there because the place is small. But in all honesty, I won't stop coming back to this place. It stays with you... as in you smell of Korean BBQ for the rest of the day until your next shower; which for some us, isn't soon enough.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5JqLiB__wOB5vf6tHx-FLg", "review_id": "6XGbTzYjr5_Tc3sE5RsPhw", "text": "The all-you-can-eat Korean BBQ is amazingly good and cheap.  Seating is limited and they only have a few tables with grills, which is a must with the BBQ.  The best thing about the BBQs is the additional Korean side dishes that come with it.  Doesn't look like much from the outside (or inside as well), but the food is authentic.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2013-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dcW9UEseszxkrqAu70sIXg", "review_id": "fK4P94deOkOhpZvenTih3w", "text": "This is my go to AYCE Korean BBQ. Their meat is nicely marinated, their steamed egg is just delicious. We usually get the brisket and pork belly because the others are kind of ehh. \n\nI have a love/hate relationship with the service though. They're super nice, but sometimes they completely forget that we're there even when it isn't busy.\n\nOverall the price you pay for the AYCE is pretty good.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-08-17", "type": "review"}
{"votes": {"funny": 4, "useful": 6, "cool": 1}, "user_id": "QsJ1Fx5tqNwVXU3YPWbYLQ", "review_id": "taU8NEJP8zAq8CFy2Bsk6Q", "text": "Why is this place still open? It is disgusting, unsanitary, and just plain G-R-O-S-S! Not only did they close down a few weeks ago because the Health Department gave them 52 DEMERITS.. 52!?!?! WOW. I'm baffled that this place is STILL open after that short restaurant closure to \"clean up\" after their mess.\n\nOkay.. surprisingly this place USED to be good back in the day when there was a different owner around 2009? After that.. this place should just call it quits.\n\nThe last time I went here was back in 2012. I was excited because I have not been to Tofu Hut since then. When I walked in with my friend, we didn't have anyone to greet us. We stood there for a few minutes before someone came out. Whoever the lady was, was just so rude! She came out and pointed at us and said to sit anywhere. We sat at a table near the front area so they can see where we sat. After another 5 minutes, no one came by to greet us and give us a menu. I had to walk up to ask for the menu. The lady again just pointed to the corner of the table where the menus were for me to grab myself. HORRIBLE SERVICE ALREADY! At this point, I was getting really upset. When someone came by to take our orders, I did not want to get the \"AYCE\" k-bbq. I was in a time crunch and all I wanted was to eat bulgogi (shredded beef) and the house salad. I guess it was my mistake.. I should have cooked my own meat. When the meat came out.. it looked pale already. I didn't think of it then because I thought the food would taste as good as it did when I ate there last. I ate the beef.. and it tasted a little funky. I wasn't sure if it was supposed to taste like that. The beef tasted like it was soaked in beer.. literally.. it tasted like old beer and that it was soaked in it for hours. I thought thats how it was supposed to taste like.. I gave some to my friend to taste and she spit it right out! She said it was old and spoiled meat. Wow... was I too late or what?! I tried hiding the taste with the bland and OLD house salad. After I realized that it wasn't supposed to taste like that, I decided to just leave and get my check. I was so unhappy and STILL hungry that I just wanted to leave and not waste my time at all.\n\nLater on that day... I started throwing up and my ass sat on my toilet for hours... I had FOOD POISONING from Tofu Hut!!!!! I was so upset and felt so disgusted. Ugh!\nI have NEVER been back since and when I ask a few of my friends, they all have experienced bad quality of food and bad service.\n\nI know.. you may think that it has been 2 years since.. and that I should give it another try. Well.. after they re-opened a few weeks ago since their 52 demerits.... one of my really close friends went to eat there with her boyfriend and she found a BUG in her dish! Not just a small bug... but a big bug and she didn't even know what it was! EEEEEEWWWW! After she told me that.. I then knew that I will NEVER go back to this place.\n\nIf you want bad food service, then go here. If you want nasty, bad quality food, then go here. If you want bugs in your food, go here. If you want to get sick, then this is the place to be. This place doesn't even DESERVE a star. NO STARS FOR TOFU HUT!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2014-06-03", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 2}, "user_id": "JP0uq1KK4jimvLgqkulkAA", "review_id": "VCU_7XcD_ypDy1dBju1NQQ", "text": "I am going to defer to the review of Melissa Y, who says it all:\n\nWhat is the big fuss? And Why is this place still open?\n\nAs many who have read my reviews know, my wife is Korean, and we are picky about our Korean BBQ. This place is not worth the time and trouble to cross the street and park here.\n\nThe quality is really poor, the place is dirty, and they seem to have an attitude.\n\nI could say more negetive things, but it would be pointless.\n\nDrive further down Spring Mountain, and give Korean Garden BBQ a try. Much better quality, better service, and oh, it's very clean.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2014-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2JJL5St_34E5BFUFermIZw", "review_id": "nthXhZqm8Z1t4AlFBcJDnw", "text": "I've been coming here for a decade and I love it. Ya I know they were closed down but what restaurant hasn't. Lol. But since the. They really renovated and cleaned up the place. The tofu soup is my fav. And AYCE Korean BBQ is great. Especially for 16.99 just make sure you don't go anywhere except a shower afterwards unless you like smelling like BBQ. Minus one star because the bathroom is still disgusting and they only have 2 high chairs.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0tJ10to8eEMuGAWxnTy_NA", "review_id": "z57_G4-RduPbuV3ahTYpnQ", "text": "I will never go to this place again. The quality of food is very poor and the servis is terrible. I wound not recommend this horrible place.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2014-06-24", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "PRza-zOFj3Hog3-B2tiMog", "review_id": "seKS_mSrDm6kfVf4D2QXMQ", "text": "This place gets my vote for the worst KBBQ experience ever. The meats were awful and poor quality. Also worth mentioning is their horrible banchan. It was not fresh nor did it taste good. I usually ask for seconds or thirds when it comes to banchan too. It made me really miss the L.A. KBBQ joints. The soon tofu was extremely, uncomfortable spicy! It gave me really bad heartburn. I can handle spicy food too.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2014-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V7OgCZu-cMnnU9nUH4yeXg", "review_id": "k5Htbf193aV0ls91o_u3Jg", "text": "Great Korean BBQ for the price. We stuffed ourselves. The staff was friendly and helpful. They were busy and we had to wait, but it was well worth it. Lots of friendly folks come here to dine. Short ribs were awesome. I met the owner at Busy Buggy while he was getting his tire fixed. He was really nice and told me about his restaurant and I told him I would check it out. I am really glad I stumbled upon this place. Will come again. He also owns an all you can eat sushi place across the street I am looking forward to eating at.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CNHf6NcL4idR55LZXoeRqA", "review_id": "tfKgZHFr0T9HIvM9_BuRUw", "text": "Waitress/hostess is horrible.  I asked her in Korean how long the wait was and she COMPLETELY ignored me.  I am used to bad service in Korean restaurants but this is first time a waitress did not even make eye contact.  Food is average.   Wait was long but only because they only have 6 tables with grills.  It definitely is not because of their food.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2014-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VX02b3NV3N0jSSQe-qjwWw", "review_id": "f3Z0LUauOAUaejFHqcFc-Q", "text": "Wow, worst service ever.\n\nFriend recommended this place because of how good the food is. Turns out, he's right. The food is pretty good. They had marinated ribeye slices to pork belly. \n\nWhen the service came around, no one greeted us and we had to \"sign in\" basically. Got seated in 20 minutes, server came around and got her notepad and started to wait for us, well nice to meet you too?\n\nAfter that, she never came back, a different server had to get our orders, refill drinks, and give us our check which was all due in us asking for it.\n\nFood is great, service needs a lot of improvement...", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2014-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "fjzyHyrY3Dr7-263MsNwRw", "review_id": "QmvF16qstXaqHTQJM6Eg9A", "text": "My favorite place to eat when at the WSOP. Affordable AYCE KBBQ and tofu when you just want a light meal.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2014-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3TpeTq_grhQ384PtMhOOCg", "review_id": "StgCg-bfNbwdczkPjiVa4Q", "text": "The food is usually well worth it for AYCE BBQ. If you come between 10pm-2am everything is $13.99 their usual price is $16.99. We also get short ribs and steam egg and with those items no matter what time you come it's $16.99 \n\nIf you never had Korean BBQ before this is a great place to start. I recommend the salad, pancakes, brisket, steam egg. \n\nWatch out for the long wait cause it can take over a hour to be seated sometimes. The place is small, the service is BAD but hey your doing the cooking so their BAD service I've learned to brush off. It has been a hit or miss for us. There are days when the salad and meat is on point then there are days where everything just doesn't taste right. For the most part we leave FULL and satisfied another one of our many once a month spots.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "fxGcNSicSEdnXuhVpufAFg", "review_id": "kMRc0ufDGPKsvakbggHfcw", "text": "Definitely a must try for all you foodies!! The food was great, the meats were tender and the short ribs and marinated ribeye was great! We also had the brisket, it was a little fatty and was not seasoned but paired with tofu huts sesame oil and salt mixture it tasted like crispy bacon! Awesome! The sides were great I like the cucumber,  fish cake, and the kim chee of course were all very tasteful.  The waitress was very nice and I always had a full glass of water. To me this is a 4.5 all day. My only let down was the wait. I Waited for almost an hour and a half to get seated, if you are hungry like I was before going there it was hard to wait but it was worth it. The place is very small half of the inside is the table bbq with the AYCE. The other half is more of like a regular sit down and order restaurant. All in all was a ever pleasant experience and will be back for sure!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-07-13", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "TE-xHFhBuGwCuZ3h-mNcaA", "review_id": "uZ9ImuAWG22GKZj-aqFp7Q", "text": "If you are hungry or very hungry, I recommend you to go elsewhere.\nHowever, if you are NOT hungry or does not mind waiting for A LONG LONG TIME to get service, then go right ahead, this just might be the restaurant for you.\n\nService overall is absolutely terrible. The restaurant is so stingy that they don't give you the appetizer dishes until your main course is completely finished cooking, all other Korean restaurants give out appetizers first thing right after you've ordered food. Also, if you are just to dine there and not going there for bbq, you will wait longer because they will serve the people who goes for bbq first, and then maybe come to you. \n\nFood is so-so. I would go to another Korean restaurant if I were you, there are so many of them on Spring Mountain Road/China Town, why come here and receive such bad service?!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2014-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DtmZ_zhsebNV8P8sCY2XnQ", "review_id": "Aa4DFSeuULo9uGr6AoA6Uw", "text": "We decided to have some soft tofu soup that they should be known for. The layout of the restaurant is one side is the grill tables for AYCE Korean BBQ and the other side is for the non grill area. The grill side was packed with people. \n\nWe sat to have Soft tofu soup and dolsot bibimbap. We had to sit ourselves and get our own menus. After waiting twenty minutes, they finally took our order. They only have three workers working both sides of the room. We order a cold noodle dish which they didn't have. They messed up our order even though I confirm with him twice. It was loud and you couldn't hear yourself. \n\nOverall, service was horrible! Food was bland. I will not be returning at all. In the past, I remember their soup having good flavor, but now, no taste. Again, thumbs down. Don't go.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2014-07-21", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "egUgSkDg5hBOr0yQ9-g9GQ", "review_id": "A029v9zp9OqMPBFBNEuyoQ", "text": "I love their seafood tofu soup! I always order it when I go there to eat with my friends or family :)", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NMKmctXT_3wSEQsyTqd8vw", "review_id": "4FFyr4sKo0UUN6znOL9xGQ", "text": "This place has my favorite Korean side dishes in town. Both the BBQ and the tofu soups are delicious, depending on what you're craving. Service is always quick and you never feel like you're bothering them if you want more side dishes (although you end up so stuffed there's no need to ask for more!) And the lunch time prices are hard to beat for all you can eat.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "tr_phI4Gl6aZw8DUgsh1Xg", "review_id": "x0dm3Olx8jVTj7IruWHj4A", "text": "Love this place. Unlimited Korean BBQ. Nuf said. I always come here when I have time in Vegas because there's not any places around me that have unlimited korean BBQ. Last time I've been here was a few years ago and I'm happy it's still here :)\n\nUhhh but beware- they use other peoples old meats so double check UR meat plates lol", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-08-03", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "ld2WDsFbzGfbuSfigoGc3w", "review_id": "oMdTOgWPQUnsmdIA_SvL9Q", "text": "We went there last night around 12:30am. Tofu Hut was open for another hour and a half. Two families of 6 were seated and immediately after the lady working there told us we were not welcome to eat there after we've already waited 15 minutes to eat.\n\nI'm not sure why exactly we were profiled and there were several open tables.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2014-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gqNgq3K4Q0CzyRG_SNP_UQ", "review_id": "xT-D3hSJet_UWdahShYdgA", "text": "I went for the tofu hot pot(soon dubu) since the place is called tofu hut. But it should obviously change is name to meat hut or bbq hut cause the house specialty is Korean style bbq(which you can't really screw up shine it's just serving raw meat). Anyways I just was underwhelmed by my soon dubu. It was just bland and had no depth.  The broth was not a good meat broth flavor.  Tasted like water and dashida(powdered meat flavored seasoning/bullion) Definitely not my favorite place in Vegas.  I'm not saying it's bad but when I go out for soon dubu, I want the broth to be spot on, not something I could easily duplicate in my own kitchen.  Ya know what I mean? The service was below average at first but once I started speaking in Korean they wised up.  All in all, just average. Nothing spectacular nothing horrendous. :-)  \n\nIt's a hip crowd, lots of young adults.  Early twenties crew.  Not really for families but more for beers, May, and friends.  Gets busy though so if you go, go early and get your name on the list!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2014-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "A0O4WjIrlzked2LM-acQaw", "review_id": "2SUE9RtxukNEwLQ3IPhhvg", "text": "All you can eat BBQ! The steamed egg was the best dish. The marinated foods were really sweet.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2014-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RGCHoFd5ND46cLtdyJHKjg", "review_id": "g9EAq9WbZHqGh_iJQflT4A", "text": "Love this place.  Always eat there last day in Vegas.  Good food.  Nice people.  Service is usually on point.  I always get the all you can eat.  Haven't had anything bad here", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4D6WlcZAycSf_LbOBkli5g", "review_id": "iL9OpOq66ZGWUq584nHnjQ", "text": "Always experience bad customer service here or lack there of. I started going across the street to D.J.K BBQ. Food is better than Tofu Hut and customer service is excellent. I don't think I'll ever go back to Tofu Hut.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2014-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0KJ60u3nruD08s18dF_JPg", "review_id": "0kdzY7LIY5oALcueE2-MAw", "text": "I love  (Korean Soft Tofu Soup) so much it's very common that sometimes I make some at home for myself. But when I go out for tofu soup, by far this is my favorite in Vegas. They have several different varieties featuring pork, beef, seafood or even vegetarian friendly mushroom tofu soup. I usually order the mix... yup, has everything :)\n\nI'm afraid, I can't help you much on the rest of menu as I can't pull myself away from their tofu soup!!!\n\nService is... Korean style. They will bring your drink ans food but if you need something else, i.e. refill or more napkims you just wave or call. It is customary and they won't think you're being rude. If you wait for them to check on your table, you may wait a while.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2014-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FYNNXuxMGj_0Hle8PLZEgw", "review_id": "_eAhGhXyEDsGu2ODnpra3w", "text": "Tofu Hut is just one of those amazing value places that stick in your head every time you're deciding what to eat. There are a ton of Korea BBQ places in Vegas...but Tofu Hut has the combination of price and quality that is almost confounding.\n\nExpect a wait no matter the time of day. They stop seating at 1am, but I would not show up later than 12:30 because if the line gets too long, they will close the sign up sheet. I still don't get why it's called Tofu Hut, but you're going for AYCE Korean BBQ option, and even though the price is cheaper for late night, I'd still get the kalbi which is a little more because the quality of the short ribs is excellent. Other favorites were the marinated sliced pork, marinated sliced ribeye, and boneless chicken thighs.\n\nThe only knock on this place is service, but the quality/quantity of food makes this place a mainstay in our list of late night cravings. For less than 20 dollars including tax/tip....just go.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h9559a1hroxfNTV6-c4wwA", "review_id": "iVALfJTYkidrnUVH0hm1xg", "text": "My cousin and I decided to mark our calendars for an afternoon brunch at a Korean BBQ. This place was recommended - and what a great recommendation.\n\nThe place was small but had a nice quaint decor. The place was very clean as well.\n\nI'm a huge fan of Yakiniku places and I think I'm a fan of Tofu Hut.\n\nFrom the array of small Kim Chee dishes to the nicely cute and marinated meats, even the simple salad with the very addiction asian vinaigrette gave the complete that final touch.\n\nThe waiter was always checking on our table to replenish at the appropriate times - never imposing or to often to be a bother.\n\nThe price was just right for a place like this.\n\nUnlike most Korean BBQ buffets, the food is brought to the table in portions and to as much as your liking, wherein in other buffets, the food and meats are often exposed at the mercy of the dining patrons.\n\n#IsThatSanitary?\n\nStop by for lunch, bring a friend or two, and enjoy some good food & good conversation.\n\n\n:)", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2015-06-13", "type": "review"}
{"votes": {"funny": 4, "useful": 4, "cool": 5}, "user_id": "ZC15ae4FRzjO0rHvV2rh7Q", "review_id": "4R3xklsGpVOzUzuS1q8j1A", "text": "To date, this is my favorite AYCE KBBQ in Las Vegas. Pricing is good, menu is not difficult, and food quality is mostly consistent. I've been coming here forever and I'm just realizing I haven't ever reviewed this place!! Haha \n\nI believe they have 10grill tables (if I counted correctly) so the place is small if you're dining AYCE coz the other side is menu ordering with no table grill. So coz it's small, expect to wait. Especially if you go late night  for they after 10pm $13.99 special. The place is always packed. \n\nThe food quality and service is usually consistent but I do notice at night during the special pricing hour, the brisket slices are a lot smaller than when you come to eat during the normal pricing hours. If you wanna get your fill of meat, Tofu Hut does not go wrong. $16.99 is a price you can't beat and $13.99 for after 10pm is a steal. \n\nMy go to is steamed egg (not included in the $13.99) brisket, and tongue. The marinated rib eye and short ribs are so good in their flavor, but personally too heavy for me and I get full faster. So I'm all about the salad, sticking to only one bowl of rice and making that last, and load up on the meat. Get my money's worth. \n\nKBBQ is not well known in my hometown, so when I have visitors from Jacksonville, Tofu Hut is a must to grub at! best part is I never leave disappointed, just really full lol\n\nWhy 4 stars? Well as much as the great, coz I think they get so busy and turn over tables as quickly as they can, the overall cleanliness and decor is just ehhh... Nothing spectacular. The bathroom is ehhhh also, and menus are very oily and sticky from grill splatters. But these don't stop me from coming and grubbing. But just in case you wondering why 4stars, but otherwise I'm a Tofu Hut loyal.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-06-22", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "TTGuxFIokUvwUoKSJAn1fA", "review_id": "S0EJU1Zq9M2oURxD0SIt4Q", "text": "This place is disgusting. The meat quality sucks and the selection is limited. I asked for radish and rice paper and they don't even have it... The guy told me they don't offer it. What a joke...", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2015-06-22", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "3SvEIK1w8gwM_HiKgz0Qjw", "review_id": "I1ak-loc0kXN38KVCSyWig", "text": "This place is no frills to look at, no decor and very plain furniture. I like places that put a little thought and style in their dining room. I ordered beef bogongi, which came out on a skillet and was served with rice. It was delicious!! My friend ordered tofu vegetable soup, which was cool because they cracked an egg in it and the egg cooked in the broth. The food was delicious, but 3 stars because the ambiance needs some serious attention.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2015-06-23", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 3}, "user_id": "Ybxugb112WN4fc_PsPUu7A", "review_id": "_KEXoF4RaY0bknlM_HPTMw", "text": "After EDC Las Vegas... what do you want to eat? can you even eat? are you hungry at all? Hell yea... after two days of practically no sleep on alcohol and red bull all I wanted to do was eat. \n\nMy cousin Judy had brought my family here as this is Vegas's \"best AYCE Korean BBQ place\". We had waited about 15 minutes for a table of 8 to open up, I do recommend you get there early because it gets packed quick and its a pretty small place. \n\nThe regular korean side dishes and also came with salad. AYCE was $16.99 for everything, they had pork belly, beef tongue, marinated short ribs, brisket and more. Very good price considering it is an AYCE. It also comes with a salad and a bowl of rice, you can get as much as you want. \n\nThe food was marinated perfectly and I loved the brisket with the dipping sauce. \n\nWhy only four stars? Their service sucks. The servers forget easily and are always trying to get you in and out.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-06-26", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "DuR-5xt5kdZKJCVidI5gUw", "review_id": "Hh4Gtf_QyiOLZ3nmWOGKmw", "text": "Tofu hut is very good. The place is small and the wait is usually long which is a downfall because it gets very hot and tiring waiting.\n\nBut it IS worth it. The food is so good and it is so much fun cooking your own food. The marination is great. The salad is super good and the service is also very great.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2015-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EEGMedqFxzZ3XpBSknnUVg", "review_id": "W0WjIgVrMpYjyS_s-JVx0w", "text": "First off this place is hot af!! Not an enjoyable experience when the restaurant is just as hot as the weather outside. Got the all you can eat bbq... Usually this isn't a bad deal unless the meat is poor quality and very fatty ( which it is here ) and now you just got ripped off for how expensive it is. They will up charge you for any left over food. The grill is so weak even on the highest setting that the meat cooks so slow. I'm pretty sure this is a tactic for them because you get full before half the meat is finished cooking. The service isn't that great either. They don't cut your meat for you and check up if you need anything. The sides here are really gross the bean sprouts tasted expired. Checking this place on my list as a do not eat here. Save your time and money this place is not worth it!!!!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2015-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jSTsPcM4BIruq2vuk43H7Q", "review_id": "_7A5o5M7t3RuBKVrIpuVuQ", "text": "I always come here when I get a craving of some Korean BBQ!! not only does the line get crazy but its worth it.. The salad is like crack! LOL!! \nNever a disappointment when i come.. you should try it! but do come early! ;)", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2015-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LB1WfzkQF5RQfbsFtvpBpQ", "review_id": "H2hjqUVLop5CXPPKgzub0w", "text": "It was ok. Food was ok service was kinda slow and table was sticky. I had kalbi ribs and the seasoning wasn't what I experienced in Korea or other restaurants serving Korean dishes but it was good and I ate it. Overall I'd call this place average.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2015-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "2Z8sRKfFi6bx8LxCpwFbeQ", "review_id": "erQdvYtjtcz6NoIEDMo8PA", "text": "Tofu Hut is probably on of the most affordable AYCE Korean BBQ out there. Not only is it cheap compared to others, but their choices are all delicious and they always serve you with multiple sides of different dishes as well as salad which I found oh so good. Whenever I come here with friends we usually get the short ribs, briskets, and marinated ribeye. Of the three, the ribs and briskets are my favorite! I can eat that all day long. \nTheir happy hour starts at 10pm. It's around that time where the waiting list begins to lengthen.\n\n4/5 would eat again and recommend.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-07-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2LD3xe94vFQK712lm5zepQ", "review_id": "iCol1SjtwybYtY2Zqg-_kA", "text": "Food is great & grill your own is fun esp my kids enjoyed it.  However they add automatic gratuity on a party of 4 & yet when u pay, careful bc there's a line for a tip.  It's kinda' tricky, don't b deceived!!!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-07-04", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "PiDZmmycy_mWi65yL2kIiA", "review_id": "-sbvHtwMvgSDz6Z0P6RRKQ", "text": "Love this place. Have come a few times and food is always good.  Gets 4 stars because sometimes service is a little slow. \n\nMy favorite here is the short ribs. Marinated pork is also good,  but a little spicy.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XIdwbElNKuJKJHrKfxIt2Q", "review_id": "ykThjlVoMsgM6D8JQY1zmA", "text": "Decent price for pretty good food. If I go again, I'd stick with the marinated pork belly, short rib and rib eye. The brisket and tongue were sliced so thin it reminded me of Steak-Um. Not much for flavor in those 2 cuts. \nCome with the usual assortment of sides, rice and a salad this is good but went mostly untouched as we chowed on the meat instead.\n\nService was fine, they don't really come up to you much asking if you need something, you'll need to flag them down, but there were enough on staff that it wasn't a problem.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2015-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uvYi5HvubzRfklwYBsUSkg", "review_id": "-pWpq2c_lk5dpZWdmF_VVA", "text": "I've been coming to Tofu Hut for years and it's definitely had it's ups and downs but seemingly the quality is going up. My favorite part is always the salad. I won't lie, depending on which staff was working would depict the quality of the banchan and salad. Recently though the quality is good day and night and no matter which members are working.\n\nPros:\nPretty cheap prices for AYCE. Meat thickness is always consistent and marinated beautifully if they're meant to be marinated. Meat always is fresh and delicious. Sign-in list for AYCE during busy times has helped manage the crowds much easier during dinner and late hours opposed to its early years. They offer a menu of non-AYCE meals that are reasonably priced and taste very good for when you don't feel like cooking your own food. The AC is usually running at a decent rate depending on the crowds - there was only one time in the past few years where I was too hot to eat. Unlimited everything so it's good for big groups and hungry people! The staff is often very nice but sometimes the women don't appear friendly. \n\nCons:\nOnly two restrooms, one male and female, so there will be a wait time sometimes if suddenly multiple people need to use the restroom. The atmosphere is often times going to be loud due to overhead music, people chattering, and the sizzling of the grills. The waiting area is small so sometimes you'll be lining up down the hall or near the door waiting for your AYCE table. The grills may be set too hot sometimes, but if that happens just flag down a waiter and ask them to turn it down and then wait a minute before cooking again (like you would at home).\n\nOverall it's always been a great experience for me at Tofu Hut and I eat here like 15 times a year without regret. I only give 4 stars because I'm counting all my experiences from their opening to today and it's not always been perfect each time.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EJlCUNwHfXtwqebc5mVpAA", "review_id": "nz2Q0ZNqGGR_9baUccezlQ", "text": "Ok for the price. The galbi had very little flavor. Beef tongue was good, but could had been better. The squid was ok. The sides were decent though. But let's be honest we don't go there for the sides. For the price I would try it for the first time, but I probably will not be going back.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2015-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_euhbGl7E5XBxl_diDUdfw", "review_id": "cKMtyt1qBOWc3RP5krwYxQ", "text": "Service sucks!  Waitress didn't even take our drink order.  Waited for an hr for a table when there were available tables.  Food is just at par with other Korean restaurants in town.  Downtown restaurants are better!!!!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2015-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ioe6Iy1luIQh1NCOd3rKbw", "review_id": "QXjOvZs7GWfBWbDUAaOQHg", "text": "Pros: Cheap-ish, late hours, easy menu\nCons: There's probably a long wait to sit down and they MIGHT slice your meats thinner if you order them a second time... :(\n\nI recommend: Anything you like- the menu is pretty short (and hopefully they don't start slicing your meat thinner)! \n\nI think this place is pretty decent with a concise and solid menu. My absolute favorite thing to order in KBBQ is beef tongue so of course, I order that first. My friend and I savor every slice along with whatever else we had and order another. They bring it out and even just looking at them on the plate, it's obvious it was cut much, much thinner. I have a picture of a cooked slice from both our first and second orders that I will post :(. \n\nNow, I get it- it's a business. I am pretty confident in my ability to devour beef tongue to the point where I question if a restaurant will make money off me. However, slicing meat thinner is not the way to secure a profit! \"Just order another,\" you might say. Well, I say thinner cut slices are not as scrumptious as a more hearty slice. Also, it makes it harder to cook on the darn grill. It will quickly MELT if you aren't gifted with the swiftness and grace of a grilling ninja. Therefore, I am sad. \n\nNevertheless, I did enjoy my dinner at Tofu Hut regardless of the sad beef tongue. We ordered almost all the other meats off the menu and they were good. I felt service was responsive and polite and there was almost always a waiter nearby if you needed anything. I would come back, but my quest to find a KBBQ place I absolutely love continues...", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2015-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "85FamdX31IZGjW2rzRFkmQ", "review_id": "T-ecukbd_LtqZ5XX4RxcFw", "text": "My experience yesterday was actually a lot more pleasant than I expected. I feel as though the service really improved since the last time I went there. Every time I flagged down a waiter or waitress, they quickly came and took my order. None of my orders were forgotten about and my requests were quickly fulfilled. They even offered my party a pitcher of water to leave at the side of the table so that we can refill our waters ourselves and not have to wait. I am adding a star for the improvement of service. I'm guessing it has to do with increased competition.\n\nI still am bothered however by the way they seemingly cheat their customers by not telling them the parties over four people are charged automatic 15% gratuity. There still a line for gratuity when you pay for your meal. It's not until you ask them if gratuity is included that they will admit it. I don't know if it is a method to avoid paying tips to their servers since I believe it's usually based off of what is written on the gratuity line but I think it's sketchy nonetheless.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2015-07-24", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 4}, "user_id": "X9Dx3TteosAgpxil5wAhRw", "review_id": "13zJN-BqJwMxKzSz-GTiKQ", "text": "I've been here many times the past two years and I can't believe I haven't written a review yet! I think I would always attempt to write one but kanack attack (food coma) hits me & then I KO, sadly forgetting to submit a review. Therefore, here I go.. finally!\n\nPros: AYCE, $16.99/person (CHEAP!), good customer service, FOOD. \nCons: \"Hut\" in Tofu Hut is the absolute TRUTH; very small restaurant. Wait times could be very, very icky. \n\nThe meats are absolutely delicious. My favorites would have to Marinated Ribeye, Short Ribs (Kalbi) & Marinated Spicy Pork Belly. Banchans (sides) were yummy too and that Steamed Egg doe, mmmmm. Love the fish cake, bean sprouts & jap chae noodles. I always skip the big bowl of salad though; I am not a fan of that. I guess it's the carnivore in me.\n\nI've gone there different times in the day and the most quiet time surprisingly was lunch time on a Sunday. Came around 1130 AM & it wasn't packed at all. I guess wait times are a hit or miss but it's worth the wait and they're open till after midnight so pick your time accordingly. Also, the servers are just great. After dining at Woonam Jung Lee's Korean BBQ & receiving the absolute WORST customer service (Hence, my review on them, grr), Tofu Hut surpasses them by a mile or two or maybe even more! \n\nIn all honesty though, after dining here 324987598 times, I have never gotten any bad service, eaten anything unappetizing & waited too long to dine. So yes Yelp, you are definitely correct: \"Yay! I'm a fan.\" :)", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uQOfW9SQEgaYW9-czdY-NA", "review_id": "PGG7jTsZF8gv211IvxYDRw", "text": "Will not here ever since they got shut down from southern Nevada health district .......for spoiled food and meats not being stored in refrigerator ....I'm giving them 1 star because after they reopened after getting shut down I decided to give them a second try because my gf and I used to love eating here ....thinking that this place should b cleaned after they reopened but as I'm paying my bill I see a roach come from the kitchen never again will I eat here o and the line is crazy long your better off going to the gardens kbbq up the street plus there clean never been shut down...not to mention tofu hut had 50 something demerits u can check on southern Nevada website will show u everything that was wrong you'll prolly get grossed out", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2015-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dfo0UD07WgEn1DaJUIXKGQ", "review_id": "OoWlMitEP6LVt8XIhgrmpw", "text": "My sister took me here for lunch.  We thought there will be a long line as we went on a Sunday around 12:45pm.  We got there, there was no line and there were several empty tables.  It took them still close to 15 minutes to seat us.  \n\nThe food is good and inexpensive compared to the competition.  There is nothing on the menu I would not recommend.  My fave is the pork belly and the short ribs.  Though it took long to get seated, the service was fast after that.  \n\nMy only issue was the vent.  Not sure if only our table but it was not working properly.  So the smoke from the grill were not being sucked out.  When we mentioned it to the owner, she said the AC was blowing the smoke in our direction (huh?).  Aside from this, it was a good experience all around.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q-2pHLZXQdAVUILfu0gOnw", "review_id": "rwvSPEyovpJ4MXUlG9ROjw", "text": "Came here for the first time today for dinner around 7:30. Food was great for AYCE! The reason why im giving it three stars was for the poor seating system and mediocre staff. Other than that the place is good! Would recommend for a fun dinner experience.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2015-07-27", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "EhcZKrQJIS226xdm_qJ71w", "review_id": "q3x8j_3MqMhdOem0rZpUJg", "text": "Solid 3 1/2 stars!\n\nFinally visited Tofu Hut because the wifey & I couldn't decide what to have for dinner one night, and after choosing place after place it was 9 PM!  I thought, \"Wait!  Perfect time for Tofu Hut late night special!\"  \n\nGood thing we left for Tofu Hut right then too.  We got there before 9:30 PM and it was already crowded!  Literally the AYCE side of the place is a HUT.  So few tables!  And yet the regular restaurant side was EMPTY!  We were like the 5th party on the list and were told it may take 30 minutes or so wait.  Just right for $13.99 AYCE Korean BBQ late night special!  Seriously, I would pay the $16.99 if I had to, but given the choice I would've skipped.  For $13.99 Tofu Hut is a steal!  Note, the late night special does NOT come with Kalbi short ribs or steamed egg.  You must pay the $16.99 per person for that.\n\nNow I know this place has been on the news for 'DIRRRTYYY Dining', and yes I know they had a CRAPLOAD of demerits.  But we hangry.  And we grumpay.  E. coli & trichinosis be damned..I'm comin' thru!\n\nWe were seated in a nice corner of the restaurant, away from most of the AYCE crowd.  Servers are fast at Tofu Hut I can tell you that much.  Auto service of banchan right to the table, along with 2 bowls of hot white rice, and a large bowl of Korean salad.  Less than 5 minutes later, our server comes along and takes our drink order & asks us what meats we would like!  We sampled:\n\n*Marinated Sliced Ribeye\n*Brisket\n*Marinated Sliced Pork Belly\n*Beef Tongue\n*Boneless Chicken Thigh\n\nShould have followed the rules and stayed with 4 meats per order!  Shiz, for the 2 of us we got servings of each meat for like 4 people!  And they charge you for wasting too much!  We really had to get our EAT on!\n\nGrilled away our hunger for sure.  Banchan was decent but not the best, and was AYCE as well.  \"She go\" as we say in Hawaii.  Some of the samples:\n\n*Kim Chi (duh)\n*Bean Sprouts\n*Seaweed\n*Japchae\n\nBut whoa, what is up with that simple Korean salad?  That stuff was bomb!  Delicious!  We had two huge bowls of it, which probably contributed to us almost not finishing our grilled meats.  Bite of meat, spoon of rice, bit of banchan, cleanse with salad!  Luckily Tofu Hut does give you a 90 minute time limit to dine.  We used every bit of it, we were slow with the meat sweats towards the end!\n\nWe almost didn't finish all our meats.  We did have to send back remainder of the Boneless Chicken Thigh after grilling a few pieces because it tasted all kinds of OFF.  Like just OFF.  Like I'm not sure if it was sitting too long OFF.  Hell no we ain't getting sick from that!  I don't wanna be on no update 'Dirty Dining' segment!  We ended up just having 4 servings of meat, and believe me that was more than enough!\n\nService was sparse but good when our server came around.  Tofu Hut needs some better ventilation!  With all of us grilling the place was a sauna on a hot summer night.  Guys, please get some better vents!  Also, add more tables to your AYCE!  Even after we left there were at least another 6-7 parties waiting, and another small crowd in the parking lot outside.\n\nTofu Hut is a great, great deal for AYCE especially for the late night special.  The meats aren't the best compared to some other Korean AYCE around town, but the price and amount of food you get is hard to beat.  This place is perfect after a drunken night at the club!  Hey, now that he's broke, you might just find 50 Cent here!  Buy that guy a bottle full of bub!\n\nAIGOO!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2015-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dQgtAtfgLveKfwRZ7U3tqg", "review_id": "arx_qThexo4daoBU5BeSDg", "text": "Literally got to tofu hut @1 am lady says their closed WHEN clearly says 2am it closes...", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 1, "date": "2015-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EWWG3LtuxX0Bt8YhzPszNw", "review_id": "6WdO_Eq0sBXu-WAbjL2zBA", "text": "Was brought here by family as we were visiting Las Vegas. Amazing food and extremely fast service! Some of the workers need to smile more, but other than that... A+!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ddPMDUMiw-aNKQpj0z8ZyQ", "review_id": "0ycqZFzs-iqzVyigf9rp6g", "text": "omg sooooooooooo lit!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2015-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k2RHL8JCA5vLK5kXCmfUyg", "review_id": "XYK5CPm04cu0DSUZHLVcTQ", "text": "Never left disappointed after eating here. I love the short ribs the most and the steamed egg, you cant go wrong with them. They have fast service and they are always around. The only thing I don't like is the wait but the wait is totally worth it. I've shown this place to a couple of ppl and their lives changed haha. Very cheap too compared to other Korean bbq spots. It's fun for dates or group dinners, very simple cooking as well.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2015-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "df4Rtd_A2RAZ_-UEv74skw", "review_id": "D51-XlaxpBv-kO7SI6nGpA", "text": "I don't come here for the kbbq (although I have been once and it was average). The tofu soup is amazing. Service is always fast, tables are always open, food is always good, reliable, and never varies on taste. It's also very cheap and filling.\n\nI stick with a combination plate with tofu soup and bulgogi. It comes with mushroom tofu soup but I subsitute it with kimchi beef. I can't have spicy food so I stick with mild and it's always excellent. However my friend does get spicy soup and says the spicyness varies each time. \n\nThat being said, highly recommended and addicting!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2015-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "06BzfZGCJPFyAhObyunJIA", "review_id": "xJOixyhqyp_9o_Z6wsxfsA", "text": "I've been to Tofu Hut before but this was my first time as a Yelper (I'm not sure if that's a word but I just made it one). Anyways, the wait wasn't too long. You do have to sign in for all you can eat BBQ. \n\nOnce seated, the table came with little dishes of kimchee, bean sprouts, and other things I'm not sure of but we're delicious. They also provide you with steamed rice, salad, and water right away. We ordered the chicken breast, rib eye, short rib, and brisket. Of all four, I enjoyed the chicken breast. It's a bit spicy but deliciously seasoned. The rib eye was the runner-up for me. \n\nI was a little disappointed in their brisket this time. Usually that's all I eat when I go there but this time it tasted different. It didn't really have seasoning or maybe it was the grill making it so bland. They may have changed their recipe or gotten this brisket from a different kind of cow or something because this is not the brisket I remember. \n\nDespite the failed brisket, it was good. I do recommend wearing clothes you don't care about when going because when you walk out of there, you'll be smelling like a walking Tofu Hut. I also recommend going to this place in winter since the grills give off so much heat and will keep you warm during your dinner lol. \n\nWill I come back? Probably. Will I have the brisket? Probably not.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2015-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "ZID88sdAQa1TZtV-jzlvVg", "review_id": "DXEm0z_VenM7Rcu4Iyf-mA", "text": "All You Can Eat late night special -\n\nLong wait, bland atmosphere, unsatisfactory KBBQ, OK service. Probably will not visit again by planning.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2015-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "JxUHQdYNyRRgTybcS-0rCw", "review_id": "xCDblGbY-4CwUuhxhNiPcQ", "text": "Absolutely delicious Korean food with great service and excellent prices.  We ordered two different combos - short rib & chicken each with their own tofu soup, rice and a bunch of different little sides.  YUM!  They have all you can eat BBQ too but we never bother with that (I rather have them cook for me - LOL) their combos are all under $15 sooooo good!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2015-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MUtYPylufqSqBdvvEAsHZQ", "review_id": "F1JrQKzZhygH8boSDfd7UQ", "text": "I like to think of this place as your average KBBQ places. want Korean BBQ but don't really feel like spending that much and have some time to kill? tofu hut is your place! \n\nit's really affordable compared to other Korean BBQ places in Vegas. but because of that, expect a long wait. sometimes you'll get lucky and get seated right away. but if it's the weekend, lunch or dinner time, or if you have a big party...expect about 45mins to an hour long wait. I don't know if the food is worth the wait, but the price definitely is! \n\nbut if you don't want Korean BBQ and you just want some Korean food, there's the other side of the restaurant for that. there's never any wait on that side, so you can seat yourself and eat pretty much right away! I really like their tofu soup there! my favorite kinds are the kimchee beef and dumpling. it's just really good and comforting! \n\nI only gave this place 3 stars because I think of this place as just average. they're not horrible, but they're also not breathtakingly awesome, you know what I mean? but to just satisfy your Korean food craving? it'll do.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2015-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XjfKBr96h6GgrfkR_q6gIA", "review_id": "SO3C31ynHUqReMOpRGHbVQ", "text": "I was introduced to this restaurant years ago, by some Korean co-workers who took me to lunch here. I had the Bi Bim Bap, which was sooooo good. It's my favorite Korean dish to this day- an egg on top of, tender beef, mixed vegetables, spinach, and kimchee, over white rice and hot sauce- that you mix all together, served in a stainless bowl. \n\nWe used to come here for the lunch special- shrimp fried rice- which really sounds weird to get here, but it's really good. They don't offer the special on holidays, so we stopped coming (yet the sign advertising it still stands outside). (I went here with a friend for the sushi special but he didn't like it.) The service is ok. Usually, there is maybe two other parties at most, like the other reviewers mentioned. The server would disappear, maybe to the other side, which is a sushi bar. I also agree with one of the reviewers that this place needs a makeover or something because it looked a little tired the last time. \n\nThere are so many other Korean restaurants now that I would rather go elsewhere.", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 3, "date": "2010-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-3TxtJo7vjXYM3ROugCO_Q", "review_id": "c47_2LPNJPH4N60lx0ua6A", "text": "The food is really good, service is great  our waiter is very personable  and he catered to our kids which was really nice. We had two orders of kalbi ,seafood pancake and 3 sodas which ran us $80. Pretty darn expensive compared to the other Korean restaurants I have eaten at but we cleared every dish served including every little side dish they gave. The interior decor is outdated and the parking lot is not well lit enough for me to feel safe.", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 3, "date": "2012-08-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "tDGcJTkAgU32jDhz_8XwUg", "review_id": "W5rruV39OfssuX6Zv7Xz6w", "text": "Korean Cuisine, best I have found. Highly recommend! Nice dining experience, BBQ in the table. Drink Meal with OB golden lagers. I will be back very soon. $$$  worth every penny. check out", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 5, "date": "2013-06-01", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 2}, "user_id": "UF_K0W97a_FH6X4KskjVBQ", "review_id": "rab4lWf7sB8X-NrrlowFcQ", "text": "Great food, the owners are great. But...There were flying pests. Too many to ignore.\n\nAll you can for a little more than $20 was great. If you ask you can ger fresh wasabi!\n\nBut you'll have to share with pesky little flies and gnats. :-)", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 3, "date": "2014-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4lHh6tuB9C45cs7m_Cj4_w", "review_id": "q3P4MyWbVSSauTU_UVTpTA", "text": "I went this evening with my family that came from out of the country... The service was excellent and the food was as well. They were absolutely sooo accommodating. Tabitha was helpful and made this experience for me and my family a wonderful one. From now on... every special event that involves dinner I will take here. You will not be disappointed in the staff and service !!! I highly recommend this restaurant.  I am a food server here as well and so i think my expectations may be higher than guests that come in... I hope you will choose this place before any other Korean BBQ. If you find a place cheaper, I can guarantee you that you will not have the same exceptional experience,. Thank you Tabitha and to the staff that served us. Great Job !!!", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 5, "date": "2014-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "_yledSdLTSgcMhNujTd1ww", "review_id": "v0JKleCOswStO83TUhBF4g", "text": "Get down here before August 1 for their grand opening special $11.95 for lunch $15.95 dinner, for all you can eat sushi or Korean BBQ, if u want both add an extra $5. The Sushi and Korean BBQ are both decent not extraordinary, but it is nice to be able get both at the same time for AYCE. I would consider the meat slightly better than Sura with more meat selections and better priced.", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 4, "date": "2014-07-22", "type": "review"}
{"votes": {"funny": 6, "useful": 7, "cool": 6}, "user_id": "DcgO7qiYKS2VuAJj2dQpcg", "review_id": "FX2w3WblgeT5SaB5fjkuog", "text": "This 3 star rating is based on what the prices will be after the end of July.  For the current grand opening prices of $15.95 for dinner AYCE sushi or korean bbq and $12.95 for lunch, I would give it 4 stars.  \n\nWe decided just to opt for the korean bbq by itself.  AYCE Korean BBQ and sushi is available for $5 extra which is a nice option that other restaurants in Vegas do not have.  The Korean BBQ and sushi sections are separated.  This is a good thing, since the Korean BBQ area is HOT! I'm a little sensitive to warm temperatures and with all the grills going, it really seemed like the AC wasn't working properly and the vents over each table weren't working properly.  The decor is a little dated and has an old school feel, which matches the location of this restaurant.\n\nThe cuts of meat I feel were average and on par with all the other AYCE Korean restaurants.  The galbi, kobe beef belly, boneless short rib (dinner only) were the best cuts of the night.  The pork belly was pretty average.  The barbeque steak (dinner only) was horrible and a waste of stomach space.  It ended up being tough and dry (and no it was not the cooking technique).  Other options available that we didn't get a chance to try are the chicken, marinated pork, bulgogi, brisket, octopus, intestine.  On the AYCE appetizer menu, there's steamed egg, gyoza, crisped rice, mixed tempura, and chap chae.  The ban chan selection was average with kim chee, cucumbers, bean sprouts, and a sweet marinated dried fish.\n\nSo don't be fooled by the picture of the crystal cooking plate in the pictures, out of the 10 tables that were there, only one lucky table got to use it.  By far it is not the standard.  Most of the cooking plates are these gold colored plates that burn and stick badly compared to the cast iron ones at other locations.  They did change out the plate once for us since I turned it off because it was smoking so badly.  One older asian lady was outraged that she was not given the crystal plate and went up to the staff and complained loudly.  They ushered her back to the table and quieted her....not sure what the response was in regards to one table getting the magical crystal plate.  I did notice the crystal plate didn't smoke and burn like the older gold cooking plates.  So overall, great value for the current grand opening price.  For $25.95 for AYCE korean BBQ and $29.95 for AYCE korean bbq and sushi later....I'd probably pass.", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 3, "date": "2014-07-24", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 3}, "user_id": "kMxakI94AIOvAuQvK82Eww", "review_id": "xqjvfzdrk9_KKRszVCPYrw", "text": "Yes the grand opening special $16 for AYCE krn bbq is great and all but its still not worth it in my book. \n\nFirst off, parking. IF this place ever gets off, where will all the customers park? Is everyone forced to carpool? because there are literally only 20 spots and its a cramped lot. Gotta fix that.\nSecondly, service. Our service didn't suck as bad as everyone else's but it was still bad. I mean the servers try to be nice and all but they did forget a couple of dishes. I also don't mind them cooking for us, however  much of our food turned out burnt. boo.\nLastly but most importantly, the food was just not that good. I really like strong flavors and both the marinated bulgogi and galbi were too bland for my taste. The other meats were also too dry and chewy.. maybe an indication that stuff wasn't too fresh? There was also a lack of variety in the AYCE appetizers. Sure gyoza and the steamed egg are good and all but I wanted more. I mean you're up against all the other AYCE krn bbq places in Vegas.. step it up yo.", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 3, "date": "2014-07-24", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "o0l_yoGMUMPFdTvEkHgVQQ", "review_id": "E1bl46CmC0WdKeGkEWxM4Q", "text": "At the grand opening price of 18.99 for AYCE bbq & sushi lunch I can't complain.  Oh yeah this is Yelp so, I guess I can.  We've had 4 star Korean & we've had 1 star sushi all at the same time here.  Skip the sushi altogether. Stale fish.  The bbq was decent.  Wagyu beef belly, short ribs & spicy pork were good.  Some of the flavors left much to be desired.  There are tons of worker bee's making sure the drinks were full.  Service was funny and pleasant.  We were going to be seated in a booth then a manager said, \"Oh we put them in da tabol, he's a beeg boi.\" hahaha.  Being a pacific islander I don't take offense.  We had our meats placed on the grill for us.  I had to flag them down to, uh, turn the grill on haha.  Growing pains.  They were all trying very hard, so I appreciate that.  Towards the end some actually \"biig boys\" came in and they had to be seated at the other end of our table.  Those guys..  Big haas and bubba immediatly began oogling our grill.  I'm sure our meat felt violated, hahahaa.  This price is validated as they are all new to business,  but after this price goes up we will probably be going back to Gangnam or Wagyu for korean.", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 3, "date": "2014-07-25", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "jQa9J5RWaXtNGYM2G7t3rA", "review_id": "wMVrWRZt2uR7YrtbqqGl3A", "text": "Be aware that if you do not speak the language, you will absolutely be taken care of last.  Such a darn shame because the food was good, when my friend wa$ not getting burned from the grill that was ridiculously close to the seating.\n\nQuite okay though, because as another excuse rolled in, I realized that even at the opening prices,  no doubt would I prefer going over to Tofu Hut. At least there, they will not treat you worse than the table next to you.  They will treat all of you the same.  Bad service? Yeah, it was that obvious.  \n\nI told the nice owner that I would put a review.  \n\nOne server that served our area and a single chef for a weekend night? Hmmmm.....never, ever coming back to this place.", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 1, "date": "2014-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sB6gny9xl3kQwc6wu694Ng", "review_id": "IBbglYsPL_AmxyrGQeaOmQ", "text": "I heard that the owner of the restaurant was changed, so I went there to check out. Parking lot was packed. There was very narrow space to park. Overall, one star is just enough. BBQ section smelled so bad (not enough ventilation) and so hot! I was sweating a lot and I still can smell BBQ from my clothes and from my hair.\nFood was not good too. They lie to customers who don't know what Kobe beef is. They DO NOT have Kobe beef, just cheap junk to eat. Only four side dishes came, tasted so so. Fountain drink tasted metalic, and I saw no bubbles at all. It seemed like there were many servers, but no one checked our table while we were eating although they came back so fast when I asked for the check. \nI had to call the server a few times to get more salad. \nI would never recommend this restaurant. I will never go back. \nBut if you want meat for cheap price, now it's the time to enjoy $15.99 dinner AYCE BBQ. After that it will jump up to $25.99.", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 1, "date": "2014-07-25", "type": "review"}
{"votes": {"funny": 8, "useful": 7, "cool": 5}, "user_id": "kSVYpNWA19wUplbdi0U0Uw", "review_id": "SSF2BH8f5i0EDxOTXba9Zw", "text": "Before you come here, lets get the most important thing out of the way.\n\nGET YOURSELF THE ROSETTA STONE KOREAN LANGUAGE LEARNING PROGRAM OR BRING SOMEONE THAT SPEAKS KOREAN!\n\nApparently, these guys are trying to be so authentic that they hired Korean staff that hardly speaks any english. I asked for a fork and dude says, \"You want spicy pork?\" I said yes because I love spicy pork but at the same time I really wanted a fork because I am chopstick challenged. I dont have any patience to use that crap.\n\nAnyways, I came here because of their grand opening special of AYCE bbq 12.95 for lunch and 15.95 for dinner. Add 5 dollars more if you want AYCE sushi with that. Come August 1st its going up to 20.95 for lunch and 25.95 for dinner. The 5 dollar sushi AYCE sushi option still applies.\n\nKeep in mind that you pick out what you want on the menu and they bring it out to you on plates. It's not like Sura where you get up and get whatever you want and bring it back to your table. \n\nWe ordered Short Ribs, Brisket, Bulgogi, Pork Belly, and Chicken. The short ribs and Barbequed Steak (which they were out of) are only available for dinner. All that we ordered was really good except for the chicken which was kind of dry. \n\nBesides the language barrier as the first major disappointment, im sorry to say that there were more to add to it. One was the parking or should I say lack there of. The parking lot is small and the spaces are narrow. Dont be surprised if your car has a few more dings or dents when you come out to leave. I recommend parking on the street. Next, the grills they have you use are gold colored and are not designed properly. When cooking fatty foods like Pork Belly, there is no place for all the excess oil to drain except the sides of the grill where they can catch fire. Ours did and we had to turn off the fire so they can extinguish the flames. One of the bussers came up and sprayed some kind of all purpose cleaner to put the fire out but it caused it to flare up and almost burn our faces. Im glad I didnt get burned or there would have been a severe lawsuit pending. All they could say was, \"Oh, sorry\". From that point on, our server would come by and mop up any excess oil off the grill with napkins. Really? I dont ever recall any Korean Bbq joint doing this.\n\nI would also like to mention that they have these crystal grills that you can use as well. We were not offered this option and would have turned it down anyway because of my friends that tried it several days ago said it sucked.\n\nSome random info: Hours are 11 am to 12 midnight every day. Lunch is from 11 to 3 pm. Dinner is 3 pm to closing (12 midnight). Makes me wonder if you can sneak in right at 2:45 to get charged lunch price and get dinner items. If you try it and it works, let me know. Lol. Also, dont eat here if you are wearing nice clothes or are planning to go to a nice or formal event. The smoke from the barbeque stays in your hair and clothes. I made the mistake of eating at a Korean barbeque restaurant right before going to a graduation ceremony. Everybody was looking around wondering if somebody was barbequeing somewhere close by and ironically thats what people wanted to eat for dinner as soon as the event ended. \n\nSo in closing, I suggest that if you wanna try this place out, bad service and all, now would be the time because of the promo price. Then, you can decide if its worth any future trips when they charge regular price. For me that's a negative captain. \n\nYelp 2014 365 Review Challenge #162 \"Only YOU can prevent Korean barbeque grill fires\"", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 2, "date": "2014-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "llR9TQ30GZ7a8C8ADBWeDg", "review_id": "X1PrlmbSsOZy8zpkWmSJdQ", "text": "I went here yesterday and I got the best service I ever got at a restaurant. The waiter helped me on the grill constantly checked on me to see if everything was ok, the food was great and so was the service and everything was A++++ pricing was great as well it came out to around $18.\n\nI am going back to Vegas for my Birthday next month I will try there sushis.", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 5, "date": "2014-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UF_K0W97a_FH6X4KskjVBQ", "review_id": "kMYWOA7ivKQEmnLl9fj3OQ", "text": "Have a wonderful lunch today with my team. No wait seating for seven is pretty good at lunch.\n\nThe food was great! Service was spectacular. I will be back. Great dining experience!", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 5, "date": "2014-07-28", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "WZwfmfP5X1gDDeL-M9vzZA", "review_id": "J1zWwGkKtbOfN0jP_J2ujg", "text": "Came last week for the grand opening special during lunch and thought it was ok. For about 12 bucks for AYCE Korean BBQ, the grand opening special is a great value and we thought the meats and some appetizers were really good, although service were a little lacking. Keeping in mind that this business is under new management, and there might be some kinks that need ironing out, I'm giving my experience a 3-star rating which was really difficult because...well...just read my review:\n\nThe interior is a little dated and it is super hot inside, most likely because there are grills on every table and everyone is grilling at the same time. Not sure if the big copper looking vents above each table work because they were silent, but I didn't think we smelled too bad after leaving which was good.\n\nWe got set up with a crystal grill top when we sat down that I thought was pretty cool and it definitely retained heat a lot better than a normal grill top and was non stick as well. I realized after talking to my friends that came on subsequent days that there were apparently 3 different types of grill tops but I think I would still prefer the crystal. I was still able to grill meat 15 min after the flame was turned off by one of the staff...this wouldn't have been possible on a traditional grill top. The secret is to wait until the crystal heats up before placing the meats on top. The staff did not allow us to heat up the grill after switching us out to a clean one and threw all our meat on top of the grill for us while it was still cold. This pissed us off, especially because we prefer to cook our own food and don't appreciate them butting in and grabbing our meat/tongs off the table, especially if they're going to screw it up and do it the wrong way. They also kept trying to serve us cooked meat with our tongs that had been used to touch and flip raw meat, making us a little uneasy. Not sure why they have to be so controlling!\n\nAlso, there appeared to be a language barrier and we were unable to get items that we needed such as napkins, water and sauce refills and additional orders. When the servers came by we attempted to communicate things that we needed each time. They would either have a confused look on their face or acknowledge us and then never return with the item requested. We asked about 4-5 times for more sauce before we got it. Same with napkins. One of the servers even blamed me for Michael K not having a plate even though she was the one that never brought him one! WTF! If I had to rate service alone, it'd be a 1 star rating for sure! Either bring a Korean speaking friend or expect to have to ask 4-5 times for everything you need.\n\nFood quality was better than I had expected and the meats appeared fresh and well marinated. My favorites were the bone-in galbi and pork belly. Just don't let the staff see you cutting meat while it's raw or they will give you a lecture about waiting until it's cooked. Really? With scissors and tongs that have already been touching raw meat? This will also make them want to cook and serve your food for you....if I wanted that then I would have gone to Bennihana or something. \n\nWith all the service issues I am not sure how they'll ever have a good customer service rating...because of this, they're definitely not worth more than their grand opening special and once their price goes back up to normal I would not come back or recommend this place because you'll be here forever trying to grill and eat just 2 plates of meat due to service issues and waiting on your orders, drinks, napkins, sauce, etc.\n\nI also would not recommend doing both sushi and BBQ together...pick one or the other and sit at the designated section. Tony T sat with us in the room with all the table grills and it took him forever to get his sushi orders and some of them were wrong or confused for something else. If you want sushi, go sit at the sushi bar near the front door!", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 3, "date": "2014-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-C2TfyRFnGK6yCSX0kd21Q", "review_id": "0bFec5Xhjgrv-3k0vU5kzg", "text": "Have a really cool dinner tonight, i got the sushi and BBQ. The sushi is fresh rice with a big piece of fresh fish on top,  BBQ are fresh and taste sweet. Server with shiny smile they teach me how to do the BBQ help me a lot, I am happy to having a delicious food in this wonderful restaurant .", "business_id": "vLMFwcFfA2JyFVMDrcFo1g", "stars": 5, "date": "2014-07-29", "type": "review"}
