{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "7QVWvCcgwZgV6SCjw4s9aQ", "review_id": "0IdaNIBbBejT6mGSeGzDOA", "text": "Kind of tucked away and hard to notice, especially being next to the really glammed out Ella's Deli. But worth a visit if you're looking for a good gyro or kebab. :]\n\nThe donuts are alright too. They have a wide variety! Myself, I really rather like their cookies. They also offer homemade baklava.\n\nReally though I can reccomend their sandwiches with a side of the seasoned fries. Quite yummy! Vegetarian options also available such as potato kahbi or falafel sandwiches. And they had a lot of beverages to choose from too.\n\nAlthough the location is not ideal, it's worth a stop if you're in that part of town. :]", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 3, "date": "2009-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "4GYlYNPsfFx6HdPZ-DF6cQ", "review_id": "cghgxHyL8omIyf8SuxIAyQ", "text": "The doughnuts are good (and pretty cheap!), but I really love this place for a quick, cheap lunch.  They make their falafel and gyros fresh, so be prepared to wait a few minutes for them to put 'em together.  There's a small dining area, or you can take your food to go.  The owners are friendly and efficient.\n\nThe only thing I really wish this place would do is make fresh bread and rolls, but it's strictly doughnuts and sweet pastries here.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2010-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "W0L9qw8Ulec-SvnstoOsjw", "review_id": "zImM60mcTGY10hqqALRpJw", "text": "Best Gyros, hands down.  And reasonably priced too.  Good chicken sandwiches.  And their mediteranian entrees are delicious as well.  As for the donuts, they are above average but not amazing.  The owners are so kind.  I like going here.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2010-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "no9odAfwocTruGYGNUVcIg", "review_id": "2jb96dbwVqlS7qza4urlOg", "text": "The food and service attitude is pretty good for the price you pay.\nThey also got all kinds of beverages to go with your meal. They cook it fresh after you place an order. The owners are very nice.\n\nWe had the vegetarian meza. Everything tastes good, though I've definitely had better middle eastern food before. But for the price you pay, the food is well worth it. All the basics are done right, e.g. dolma, hummus, kabob/shawarma, cucumber yogurt, kofta, kebbi, etc.\n\nBut I will mention stuff they could improve a bit more:\nThe red pepper paste was a bit bitter, but taste fresh\nTabouli was a bit saucy (ask them to use less dressing).", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2011-07-07", "type": "review"}
{"votes": {"funny": 5, "useful": 1, "cool": 0}, "user_id": "6kp815UUjK--ukUjmDlSCQ", "review_id": "vq6HsM2Qjvn9dllTzZdjsg", "text": "I haven't had any of the falafel or gyros here.........yet.  I have had the opportunity to fatten myself up that much more by eating some of their delicious doughnuts.  They are really cheap AND really good.  \n\nThe owners are a friendly, older couple who look like they are workin' hard.  I asked if they would be my new parents, and they just laughed, but I was serious.  Will you be my new mom and dad?  Or how about my new granny and papa?  I won't ask for money..............just doughnuts!\n\nI'm toilet trained........\n\n*knocking on glass window*\n\nPlease???", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2011-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YT0iTm2y-Q9CoQhzYnIWSA", "review_id": "dDuJuPs54b5phLMkwFEZvg", "text": "Awesome gyros at a great price... haven't tried anything else yet but I am definitely a fan and will continue to go back (at least for a gyro)", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2012-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "hyxZfJkC3UckkDbzBH9clA", "review_id": "o9kBdeBVmqLiymTCLSgAJg", "text": "The donuts are amazing and super-fattening of course, but then I guess you shouldn't be eating donuts if you are concerned with your weight.\n\nI agree it is by far the best gyros in town, I am originally from Chicago and am used to the quality of gyros found all over Chicagoland, this is cut the same, same thickness, same style, the flavor is similar, but has it's own thing going on. Either way, that Parthenon in Madison is crap, people rave about it, what a joke, they have no clue what good gyros is, take a road trip and go eat at Hubs in Chicago, then you will know finally what great gyros is. In the meantime, if you are stuck in Madison, this is by far the best you will find, don't waste your money and calories elsewhere.\n\nFalafel is good, has it's own unique recipe, works for me.\n\nTan Tan Chicken is very good too, highly spiced, which I like, although not spicy as far as heat is concerned. Comes with an awesome garlic dip, which I've only found in Los Angeles at Zankou Chicken, which by the way is the most incredible middle-eastern chicken ever. They even made a \"Curb Your Enthusiasm\" episode about it in 2011. If you get out to LA ever, you must go to Zankou and get the Chicken Tarna with the garlic dip, the hummus is also the best ever. Almost enough to make me want to move back to LA. In fact...\n\nAnyway, People's Bakery is truly a gem in Madison, amongst all the questionable eateries, which some say are great, others say bad, this one is clearly a huge winner. And it is a real Mom & Pop, literally they made all the food for me, super friendly, down to Earth, real people who deserve to have your business. Go there now!\n\nP.S. I also liked a bunch of other stuff there, the hummus, side dishes, veggie mezza, etc. Probably can't go wrong with anything there.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2012-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "LiQJP-p2xOWxnHDdPmcGbw", "review_id": "w8rt_MEsjxWR0JNn41yhww", "text": "Great place to go for gyros, falafel, and lots of other delicious Mediterranean / Lebanese food that's worth trying. Also, the food is really cheap - you can get a whole huge bag of great food for under 20 bucks. An older Lebanese couple run this place - they are very nice and do a good job. As far as the bakery items, go with twisty donut things w/ the red strip down the middle or the baklava.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2012-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "sd4kstHD9zl4UIG47mSUCw", "review_id": "rGdE_7COel-VXOb4Mgy6IA", "text": "Donuts as BIG as your head!  Fresh Lebanese food made to order made by the friendly owner!  Such was my experience today at People's Bakery.  I don't really understand why the place was so empty today but it was fine with me.  I ordered tabbouleh, baba ghanoush, hummus, pita and a giant donut!   You'd never think we would have authentic Lebanese in a generic looking mini mall in Wisconsin but we do-I feel lucky it's just a few blocks away from my house. \n\nDownside = Styrofoam containers...I might attempt to bring my own next time to avoid them!", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2013-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WKQKNmWL8_FH5vFHYlp8hQ", "review_id": "RSzjibcjjI0kZEW-DtqIYQ", "text": "Went there today with my fiance.  We had the hummus and lamb and the felafel.  The lamb was amazing.  Little pieces cut up and placed on a bed of hummus.  The hummus was very smooth and great texture.  The hummus was good, but Bunky's is still my favorite in town. \n\nThe felafel was good, not too heavy.  Serve in pita bread with a sauce and veggies.  They have a good selection of beverages, they had my favorite Nantucket Nectar and some good bottled lemonade.\n\nAfter our main course we decided to try some pastries.  The baklava was amazing.  It was light and flavorful.  We also had a french glazed doughnut which was better then Greenbush.  \n\nThe lady that works the counter is very friendly.  When we went back to purchase the pastries we only had credit cards, and they have a $5 minimum.  She let us just add it to the tip of our original bill!", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2013-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "C00-yXJR3WJKt8NdCBzqxQ", "review_id": "XrjkdmcShK1LxShRcEqCBw", "text": "So good!!! We went as a group and everyone loved the food they ordered.  The food was very reasonably priced!! Yum!", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2013-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dT9zssrtvlv322dDXUc_tA", "review_id": "Z3DGMKEf2pLbFdmArRY-yw", "text": "Stopped here a few times for the yummy baklava. I've eaten lunch here once and it was fabulous. I had the tan-tan chicken and it was amazing! Moist chicken and lovely flavors.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2013-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lB4hOIAWg2-L3Xmx_vNQKQ", "review_id": "8oU3JrGYTd8L2714dUTMBA", "text": "Herein lie the finest falafel sandwiches in the area, and that's all that's needed to justify my continuing patronage.\n\nThe donuts fill the display cases with colors, and fill the air with intoxicating scents. So many different shapes and sizes, but the freshness and delicacy are consistent throughout. The \"Rapid Dozen\" is a good value, providing a diverse sampling of donut types to take to work, provided they make it that far.\n\nStill, my main inspiration behind the countless visits through the years is the Lebanese cuisine, and specifically the falafel. You will find plenty of tasty dishes, from hummus and babaganoush, to kebabs and gyros, but the incomparable falafel stands above. There aren't, truth be told, more than a few real competitors for Madison's top falafel (Banzo is also great, then it drops off), but those found at People's are really top notch, competitive with any I've had throughout the country.\n\nThe prices and the falafels simply cannot be beat, and the owners are incredibly warm and friendly people who have been crafting joy through delicious food for many moons now. There is nothing to keep me from recommending People's Bakery with the full five stars.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2013-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "a0PfJ18hkhemRlEuMIXYQg", "review_id": "bkz5pUJfy08R81ifUcoDIw", "text": "Their food and pastries are good, but most importantly they had the best baklava I've ever had.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2014-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RvweNJFVkR3ttkWsIBy7nQ", "review_id": "dbIk8Kx0t8Ob4aCwFkVfGg", "text": "I am pretty disappointed with this place.  After it being described as the best gyro in town, I was let down. The gyro is good and it is only $4.50. However, best in town? Eh. \n\nThey forgot my tomatoes. There is nothing really terrible about this place, but it was just \"ok.\"", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 3, "date": "2014-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "eE1dMYBjtTY2U2sNMbMajA", "review_id": "8ZRPde1cpoW-UbwCfBcMlg", "text": "Delicious donuts! I thought the vanilla frosted long john was on par with Greenbush's similar donuts. This should be your donut stop on the East Side. They also serve hot middle eastern food, which I plan to come back to try. \n\nJust make sure you have some time, even if you're just picking up donuts to go. There was just one person working the counter and cooking customers' meals so the whole process took awhile.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2015-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "Uic5YWIA6AymYojHJHBJug", "review_id": "-mfPRE6FMjwlR5r9ejjfsw", "text": "I've been here a couple times for the donuts, which are awesome. But I didn't feel compelled to write a review until coming here for dinner a few days ago - the food is absolutely delicious! It's a shame it's not more obvious from the outside, but the lunch/dinner menu is extensive, the prices are excellent, the people are friendly, and the food is phenomenal. I got a gyro sandwich and it was enormous, delicious, and only $4.50. \n\nI love Banzo, which is the obvious point of comparison for People's Bakery, but I'd probably choose PB given that the food is just as good an a whole lot cheaper. I'll definitely be coming back!", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2015-07-20", "type": "review"}
