{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Cier9mJvWvLutDlVSjlXWA", "review_id": "fSfk63ZDT4rSvZK_N1CVLg", "text": "I've only ever gotten take-out or delivery around lunch time, and Lemon Grass isn't always the most reliable of spots (they've managed to lose an order I phoned in and have sometimes delivered incomplete orders), but what they lack in consistency, they make up for in taste.\n\nBilled as Cambodian Cuisine, their lunch menu gives a large choice of items for fans of Thai and Chinese food as well.  I'll often go with their delicious green curry or satisfying Pad Thai (not the best Pad Thai Pittsburgh has, but the best downtown lunchtime offering I've found).  All lunch specials come with soup (small but fulfilling) and spring roll (tiny but delicious), which makes the price (around $7) a pretty good deal.", "business_id": "Lm_mR5xDF91OeZw97ch41g", "stars": 4, "date": "2006-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "9ifxQMJKNjXBrEpXxd4DSA", "review_id": "Ikbt8CDbTCJbPw0dCI3RiQ", "text": "When I lived in Pittsburgh, I was always trying to find the best Thai restaurant. I failed miserably. So when I visited for July 4th, I had a friend take me to her favorite place. This was it! and I was grateful!\n\nI went with about 8 people and we BYOB'ed which was a fantastic idea. Some semi-sweet white wine went well with the flavorful light Thai food. Most of the table had the curries(I thought the red was the best), but I went with the eggplant with the vegetarian duck. Simply delicious! Highly highly recommend it. The spicy basil sauce was the highlight. My partner had one of the chef specials, which was by far the most interesting, but maybe not the tastiest. \n\nOverall, an affordable, low-fuss, great place to eat. There also seemed to be a steady crowd there when we got there and left. It looks like a popular spot. For good reason!", "business_id": "sxeuOMBRllOHXJTaUlI9kQ", "stars": 5, "date": "2009-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9FGP45E5zLXG1assWL1oVg", "review_id": "90OutufP7oP-46dp0T-8-Q", "text": "Awesome!  We ate here several times and everything was very good.  Good service, clean place, and the noodles...", "business_id": "sxeuOMBRllOHXJTaUlI9kQ", "stars": 5, "date": "2013-08-27", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 2}, "user_id": "M-TwsqjrGVH9-qyw2KcvdQ", "review_id": "0NeedCOapRFjG9M8aqXn1g", "text": "I never quite understand why some people look so miserable... especially when one works at a restaurant, where people come and dine for enjoyment.  I haven't been to Thai House in a long time, and this's my 1st visit to this location, and they still manage to have the same unfriendly, slow, unacceptable level of service as they always had (the one at University area) and apparently known for... hmmm, not sure if that's a reputation you want there Thai House.\n\nTo use up a Groupon, we had dinner there last night.  Amidst it's Father's Day, it wasn't really that busy or crowded.  Somehow we still had to sit around for a LONG time before our order was taken... this was after a seemingly non-busy waiter walked by us numerous times and never even turned his head our way AND after a waitress ignored the heck out of my \"excuse me.\"  \n\nFood wise it was ok.  I had the roast duck with pineapple curry sauce while my dinner-mate ordered the Tom Kha (coconut brothy soup) and the beef Pad Krapraw.  The soup was interesting, since coconut tends to be associated with sweet food items; I personally like it, it's not heavy at all.  My roast duck was a little misleading considering it was more fried than roasted.  The meat was a little over-cooked, but the curry sauce was good enough to compensate.  I had half a fork full of the beef Pad Krapraw... can't tell if it was good but this is normally my fav lunch dish (except I think it works better with chicken or pork). \n\nIn all, this is an average meal (food quality wise), but the service was  unbelievably bad.  When the most impressive part of the dinner is the decor (rich & ethnic without the tackiness)... well, enuff said.", "business_id": "DReLu6HuFOm4p-jYZpgQkw", "stars": 2, "date": "2011-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0X7ZC4ZcG5MShwQAAaMAKQ", "review_id": "lHtbfBqIl6hLi_Zsrlt1qw", "text": "I can't figure our why this place doesn't get a better rating. First of all it's a knockout to look at. Someone went to a lot of expense to make this place look like a Thai restaurant and it shows. Food was good, spicy and different. We had softshelled crabs, They were outstanding. All the tastes were unique. Perfect of course not. We needed bigger spoons to get the sauce onto the rice. The fried tofu was a little bland. Otherwise the food was good. The service was just right. (I hate it when the new waiter at Applebees asks you 9 times mid bite how your burger is) The ambiance is more than pleasant. Thai House is a great stop on a weeknight when you want Thai food and a bit of a treat. Overall, my new go too place for Thai.", "business_id": "DReLu6HuFOm4p-jYZpgQkw", "stars": 5, "date": "2015-08-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "ovRedQAaoQ-haf7IAWdmsg", "review_id": "tDPdcJN4OHbHlNyje_f0Hw", "text": "Great place for a quick bite.  The mango sticky rice was terrific.", "business_id": "3lHBRYjfaMTZeWuQs9vvQw", "stars": 4, "date": "2010-08-17", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "fDGhrZ59p4fV2tBMv5HCXg", "review_id": "rhdCc0Rl0RW8S7WAkJmUXw", "text": "Went to Wild Thaiger for the first time last night and enjoyed every aspect.  Had the Wild Wrap and Dragon Eggs for appetizers.  Both had a really good bite to them without losing all of the different flavors in the dish.  That is something that gets lost at many Thai places, everything is so hot you lose the flavor.  Two of us had the Beef Panang for dinner and our friend had the Salmon dish.  All were prepared very well.  The beef panang was a little different than I have had at many places here in town.  More curry & creamy coconut milk than the light broth based panang we have settled for at other places.  It was by far the best panang we have in Phoenix to date.  The beef was fork tender and the sauce flavor was over the top.  \n\nThe restaurant is very cozy and energetic.  It was 7:30 on a Thursday night and the inside was full, with only 1 table on the patio brave enough to weather the 100 degree heat.  Server was very friendly and attentive.  NA beverages were always kept full and she was all over refilling our glasses from the bottle of wine that had been ordered.  Big bonus points for the kitchen design.  It will not blow you away with tons of polished stainless steel and creative wall decor, but it is an open exhibition kitchen with about 10-12 seats at the bar that look in on the action.  Extremely rare to find in a Thai concept.  Love knowing who is cooking your food and that the kitchen is well kept.  We will definitely be back as this will be our new home for Thai in the valley.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 5, "date": "2009-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "11EVSvb6cy4pRsh1EeTj_A", "review_id": "AR9QTq4X7cOTCC6qqTYbrg", "text": "The staff here seems to resent it when Thais come in. My wife is Thai. As soon as she entered she was met by a Thai staff member. She asked a question about a menu item. The responce was simply nasty & for no reason. \nWe told our friends we had taken there we wouldnt stay & we left. We will never return. There are many other places to go & several not to far from this joint. \nRead Gary Cs review before you waste money here.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 1, "date": "2011-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "D30Zx1lFfgOPsFJDA5WgTA", "review_id": "FC8vdEuo_4Fg62uiQ7Gowg", "text": "Finally, I had a chance to try the Pad Thai. This is the best I've ever had: loaded with lots of sauce, so very peanutty, sweet and salty at the same time. And it had tons of fresh bean sprouts, cabbage, and cilantro that is great when mixed in with the hot noodles. I will definitely order this dish again, but just wished that there were more than just 2 shrimp in it.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 5, "date": "2013-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "pZTZGnTun-1oSy3ovAebwg", "review_id": "5FtiQo8W5mi-3el08uWJXA", "text": "I went to wild Thaiger for dinner with three friends and although the service was good in a clean environment, the food was disappointing. The flavors and preparation is just not authentic. I am reviewing the food with the background of having traveled to Thailand and having lived most of my life in larger culturally diverse cities (NY, Chicago, DC) with close authentic thai food. Here are some critiques:\n\nPad Kee Mao - My favorite noodle dish of all time is supposed to be prepared with thick rice noodles sauteed to a variety of textures, and infused with a dizzying array of spice. Instead, the dish here is made with thin vermacilli noodles and tasted like a lump of wet ricey dough. I even explicitly asked for it to be extra spicy, but there was barely any.\n\nPad thai - This basic Thai staple was presented as a soggy clump of noodles with a watery sauce pooling at the bottom of the plate. The worse part was that despite all of that sauce, it was tasteless except for the peanuts sprinkled on top. There was no hint of tamarind or fish sauce or chili. Disgrace.\n\nTom Yum (chicken) - Again, what we received was a flavorless broth. There was no taste of lemongrass, no curry, and the chicken was dry.\n\nNeedless to say, this was very disappointing. For a large restaurant in a prominent location, the food served up here was worse than some of the shacks I've eaten out of in other cities.\n\nTwo stars for service and cleanliness alone, none for food.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 2, "date": "2014-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AyUid_pHymW74JrE4i9YqQ", "review_id": "Bo6G6GFe9U5Df55xQ7QMQg", "text": "Wanted to try this resturant after seeing it on Food Network....wait was about 30 minutes, dragon eggs were excellent. I've had better chicken pad thai, ribs were very tender and flavorful, the peanut chicken was nothing special. The staff was friendly and the chef was very personable, however, I wouldn't consider going back.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 2, "date": "2015-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zOCAtV3_5QK5SlwGtQdhjQ", "review_id": "mcmcwVGjAR2F27wD-vS48A", "text": "I have a favorite Thai place near my home but I wanted to venture out. What a great find in W.T!! I had the 24k which was delicious but very HOT! So I changed plates with my Sister who had gotten the satay. My mouth burned for a while but the Thai tea calmed it down some. They cannot change the heat level of the 24k, which was disappointing but understandable. My daughter got the curry chicken, it was lovely! \nWe were so full that we passed up the sticky rice with Mango. So I guess we have to go back. Fine with me!!", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 3, "date": "2015-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uNtNvaXxR5z5UO7frcThNg", "review_id": "1I4TO3ffeEoLGMCqwbIbkg", "text": "Yay I am here with a happy update! The past few times I have been back, they have NOTICEABLY improved both timeliness and friendliness, which brings them to a solid 4 stars in my book. \n\nKudos, Thai Lana, Kudos.", "business_id": "wct7rZKyZqZftzmAU-vhWQ", "stars": 4, "date": "2011-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "z86pMT9z-urfTRby8s-8LQ", "review_id": "jTZJGOSHDCSj5HaK5GIOHg", "text": "It's a great place to pop in for a quick lunch, but have an even better dinner menu. I generally get one of the curry lunch dishes and love the soup and spring rolls they serve. Delicious! I'd highly recommend trying this place out if you're in the area.", "business_id": "nefBMCGgMPvOnASoyO_X1A", "stars": 3, "date": "2008-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "oPlI8zmdstHZBFD_Qh6chA", "review_id": "dhxmocQgZuhVpeJ5gw1WQA", "text": "Amazing, if you are looking to taste Thai food at it's finest come to Krua Thai Cuisine. The curry's here are out of this world, with spice levels for all tolerance levels. Very personable, friendly service, easy to grab a lunch on a 1/2 hour lunch break. Highly recommend.. Yellow curry is my personal favorite!", "business_id": "nefBMCGgMPvOnASoyO_X1A", "stars": 5, "date": "2014-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "jdoGEEy5s-5L1O_lNzEi2g", "review_id": "JONQ8apzktPSmw60-TYJsg", "text": "After getting diarrhea from eating the mediocre Mongolian Beef here, I think I would avoid any future contact with this establishment.", "business_id": "GBN0-wo_cHLnC_pwoOTIFQ", "stars": 1, "date": "2008-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Srn0KTbLvnoMQHxE_js8kQ", "review_id": "-wKw-nDgzFXl9yVATwxWtA", "text": "Vegan and vegetarian friendly! The Broccoli Tofu w/ Garlic Sauce is my idea of comfort food, but they will  customize anything on the menu. I love this place!", "business_id": "GBN0-wo_cHLnC_pwoOTIFQ", "stars": 5, "date": "2015-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3tG_wnD9JQLXm8b9XBh5qQ", "review_id": "erh27GohO4wZPHUecPAioA", "text": "We only ever order take out, but I really enjoy this little place. It's got a very neighborhood restaurant, family owned feel - which I love.", "business_id": "K4DHwck_2ds1wURnmZdFiA", "stars": 5, "date": "2015-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5oLghpNAIeYA40RQ6645rg", "review_id": "FmWYC_AlyD8Hv-DXqHYAeQ", "text": "I agree with alot of reviewers that this place was \"awight\". I didn't bother looking at the reviews before I went-I was just following my aunt's suggestion so we made plans as a family (with my parents in town) to eat there. I looked at the menu and was 'thrilled' to find a vegetarian section, and the family didn't consciously find a restaurant that is vegetarian-friendly for me (talk about jewish guilt trip). So I went with much anticipation (a sad symptom of vegetarianism in a meat-eating world when you discover that a restaurant has a vegetarian dish and are quick to assume that the dish will be DELICIOUS. It sucks that you're not able to choose from a variety of selections, but Not ALL vegetarian dishes are delicious. I'm working on this. Smile). Well, the dishes didn't BLOW me away-it was  *half-smirk* eatable. I ordered a hot and sour soup with tofu (Tom Yum), which was good. Then I ate Tofu Coconut Princess with #2 spicy (they have a 5-rating spice scale), and it WAS not spicy at all (and my aunt warned that #2 is VERY spicy), and the tofu was overcooked. Lucikly, the coconut was able to compensate for that. I brought home the leftover for my boyfriend, and he has a very critical palate since he's a cook-he wasn't impressed with it. The dishes are OVER-PRICED for what they're worth if I had to pay (my dad had to foot the bill for a party of 6).\n\nI'm a bit surprised of the awards they've received-what was the criterion? Is a vegetarian on the committee of \"Best of Phoenix\"? That's what I would like to know.\n\nI wouldn't recommend this place to anyone who has high expectations of food.", "business_id": "vtQOervVVTXjhvSZQiZ6PA", "stars": 3, "date": "2009-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ysg-bL8JKUcnJ1ks5RB2pQ", "review_id": "WhuixWQFjov6l1XG1yz75A", "text": "Swaddee is awesome. I love the Chicken Noodles and the Thai Iced Tea. This place can get a little hectic during lunch so go early if you can. When you order they ask you how spicy you want your food, 1-5. I always get a 3, but the spice can be anywhere from a 2-4 which works for me.", "business_id": "vtQOervVVTXjhvSZQiZ6PA", "stars": 4, "date": "2013-07-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Qt6BOpwL1eTQgCzuZzwlxw", "review_id": "eSD3cwYQR4lDee04CtSdCw", "text": "I went to this restaurant on the advice of a neighbor & I was pleasantly surprised. It was really good food. Haven't been back since, but that is only because of the price. A little high for my budget, but was a nice experience. \nThe place seems like a dump when you walk in, but the food is actually quite good. I'd go back if I had an extra $40-$50 for 2 people to eat dinner.", "business_id": "RFeDe3fNr14kvUKlVx6_4w", "stars": 3, "date": "2011-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MIvCXHgE_vcKz7lYS5FPvg", "review_id": "DIV3q-a433-g3aR-qMN81g", "text": "My mom and I stopped for lunch on a Saturday.  The place was pretty dead, but I've been to plenty of empty Thai places that are amazing, so not a big deal.  The decor is kind of strange, but that's nothing new with Thai places either.  We were seated immediately and a few minutes later our server came to take our order.  I ordered the Pad See Ew with fried tofu, spice level medium hot (my go to dish).  I told her I wanted it spicy, but not crazy spicy.  My mom ordered the Yellow Curry (mild) with fried tofu and an iced tea.  Our server wasn't very friendly....kind of short with us.  Seemed impatient.  Anyway, food comes out.  It's like mine had not taste.  No heat, no flavor, nothing.  It was honestly the worst Pad See Ew I've ever had.  My mom never got her iced tea either.  I have my go to Thai places, but I'm always eager to try a new spot but sadly, I'll never return to this one.", "business_id": "RFeDe3fNr14kvUKlVx6_4w", "stars": 2, "date": "2015-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E1TKY4krbTVIfbxTZXL35g", "review_id": "uF66XKm2c3FLLwENRk9vWg", "text": "This was my first time here and I will definitely be back. There is a great selection off various dishes and it allows you to eat light yet enjoy the deeper taste that this cuisine offers. I had the Szechwan egg plant with chicken and it was fantastic. The owner was a great guy and the place was clean and well kept.", "business_id": "aLZoFhOmDtonrWJzUzh8TA", "stars": 5, "date": "2014-07-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "ewnwxqKtpDv8erOIZkCpjA", "review_id": "-0kiG1XnzR0a-h0uAhKeOg", "text": "The Princess and I have been huge fans of Flo's for years, since the original Flo's next to Osco on TPPW before they moved across the street.  This location is our local favorite and try to get over from the NW Valley at least once a month. The Saturday $5 lunch special is truly the best lunch value in the value. I really admire her business acumen for recognizing the need to pack her place during the economic downturn, provide excellent jobs, and still make good money on volume rather than GM%, but I digress.  If the food wasn't good, it still wouldn't be worth $5 and it is.  We love the food and especially the generous discounts during happy hour.  My favorite on the menu is the house chow mein with shrimp, chicken, and beef-extra spice. It is one of my all-time favorite things to eat.  The Princess always gets the spicy ginger beef, kind of a play on mongolian beef, it's excellent as well.  Make sure you get the salad with their amazing, one of a kind ginger dressing, you'll want to take some home (and yes they will sell you a container of it).  Hat's off to Flo's! Fantastic food and excellent service!  Well done!", "business_id": "H7KzlC0-o1wIhlGg-Me5Ag", "stars": 5, "date": "2013-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZX28WgM7y77NpuPWkGBqRw", "review_id": "VZtBPLBhtkC_EkGLK4gD5g", "text": "Mike the manager should be fired! Zero customer service and 100% lack of intelligence. I ordered a house salad, and when I picked it up i was being charged for a $15 salad that had oranges and walnuts and who knows what else..and when I mentioned it to him that it was not what I ordered, his response was \"just take the stuff you don't like out\" once again I said, \"why am I being charged for a more expensive salad that I did NOT ORDER? I ordered a house salad!\"  He once again suggested I take everything I don't like out, but that id still have to pay the price of the more expensive salad because it's what they do! \n\nAfter insisting for 10min, that he had my order wrong, he went to the back and brought back another salad, and said it was the house salad, when I checked, I saw walnuts...it looked like he poked through my salad and just took crap out. I was soon frustrated that I just wanted to get out and pay.  \n\nNow paying was another ordeal! I was also picking up an order for my coworker. When I called and placed the order I had made it very clear that it was to be separate checks...well not with mike at the register!  He suggested that my coworker pay the full bill on her card, because he didn't want to split the check!  That was another 10min of dealing with this idiot!  I mean I have never had such an experience with a more basic individual...Flo's I hope you can do a better job at hiring your managers. This guy didn't even understand basic customer service...sad part is that not once did he try remedy the situation...he was just straight out lazy and disrespectful! I feel bad for the girl in training standing next to him...as a manager you have to lead by example...sad to say this was not the case!", "business_id": "H7KzlC0-o1wIhlGg-Me5Ag", "stars": 1, "date": "2015-08-26", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "sHeD1MXfvJsLSOd9vwQyBQ", "review_id": "r4UVkxakG7JEpYmaYJRjBQ", "text": "So a coworker who doesn't even really eat Thai food recommended this place because some of her friends like it. \"Where is this place?\" I asked her. \"Right next to the AZ State Government Department of Economic Security!\" she told me. Umm. \"What's it called?\" I asked. \"The Siamese Cat\" she replied. So someone who doesn't know Thai food is asking me to come with her to a Thai place with a sketchy name in a sketchy area. What could possibly go wrong? So we wandered around the mall looking for the place because we entered closer to Baseline but it was in the northern corner. Mall is full of \"for lease\" signs - so much for economic security as far as this mall goes. The mall (or maybe the govt?) did shell out some dough for a number of solar panel roofs to provide shaded parking right by the Economic Security building. There's only a few other signs of life other than the Siamese Cat - Merry Maids and Tempe Bloopers. We walk in and there are a few tables occupied. We sit down right near the entrance. We were given soup with cabbage in it for starters. It was alright but a little bland. I ordered the Pad Prik Gaeng and ordered it spicy hot. When the food came I quickly realized that this was a more Americanized Thai food place where they pull their punches when they say \"hot\". The sauce was also really watery. It sort of reminded me of the time when our cafeteria at work tried to make a \"Thai dish\". Very bland. Too bad because the lady that served us was really nice. On the bright side, you get a lot of value. I had that and a thai iced coffee for under ten bucks. So if you're a value type person and are new to Thai food, this may just be your place. Your mileage may vary of course. Mine won't - won't be back.", "business_id": "0hYTkJtgQGu-ysCZnmFZDQ", "stars": 2, "date": "2015-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PEaEBmZ47jq3fNEPICx68g", "review_id": "V6aFlxe4lbUaSSR8GcU2FA", "text": "Gentle people, delicious food, AND excellent prices.  You can find more expensive food but you will have a hard time finding better Thai food.  I drive from North Phoenix past a half dozen other Thai restaurants to eat here.", "business_id": "XguGFMUSEMz4wx_2G-otyA", "stars": 5, "date": "2015-06-05", "type": "review"}
