{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "eUJk55GWVbp-zh1Gqwo47w", "review_id": "_A0G5_30cmxBu8VnZYrXtA", "text": "Best doughnut holes in the world!  This place is a gem.  My Mom used to load up on their doughnut holes for my sleepovers and volleyball tournaments when I was a kid and everybody loves them.  I was just back in the Burgh, visiting from Hawaii, and woke up one morning at 8:30 am.  OH NO - was I too late?! My Dad and I rushed to Better Maid and were relieved to see the \"open\" sign still on.  We enjoyed the doughnut holes all weekend long, with coffee for breakfast and at random throughout the day.  \n\nDo you think they'll start shipping to Hawaii?", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2011-07-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "PRsM-yC9MhpiCS9lm9SPMA", "review_id": "j34o05HUM8D9peyw3foqVg", "text": "Best donuts on the east coast. Yeah, I said it.  \n\nAs fancy as Voo-Doo doughnuts in Portland Oregon? No. \n\nHuge line around the block like Voo-Doo? No. Just a steady stream of neighborhood regulars who stop by to pick up doughnuts before starting out their day in earnest.\n\nIt's a good thing this store is a little out of the way, otherwise there would be no doughnuts left for me :)", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2013-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "J_q8jN623uew8ZzMChXBCA", "review_id": "VcoXLWGLfzty-EwI_tZsjQ", "text": "Remarkable donuts baked old school.  The donuts are fresh and made mostly by hand.  Make sure you arrive early, they sometimes sell out quickly.", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2014-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HSCAIz_sFTgC78hXE-86Og", "review_id": "3beA5b9q8Tfe4itSvWIa7Q", "text": "So there I was, with a soaking wet tent and on my way to the National Mustard Museum. But hey, hard-core mustard fan as I am, I know better \nthan to start the day with all-you-can-sample-mustard, right?\n\nSo the BF and I surfed Yelp to find a decent breakfast stop and Lo, right down the street from our campground was C's, so we figured we'd stop in.\n\nNow, it was Father's Day, which we realized when we walked in, cause the place was packed. \n\nIt's pretty much your standard breakfast food, with some specialty bakery fare. Clean, tasty and fairly reasonably priced. It is not a huge place either, but there was PLENTY of waitstaff to keep things moving. \n\nI had the skillet breakfast, which I was very pleased to find had the option of turkey. (This made me happy, as I like meat at breakfast after a night of rainy camping, but am allergic to pork.) The skillet had turkey, potatoes, onions and green peppers mixed together, with toast and 2 eggs on top. The eggs were perfect, which impressed me, given how crazy busy the place was. I do have one complaint about my food 'tho, the onions, peppers and potatoes were not cooked enough for my taste. In fact, the onions were damn near raw. Luckily, they were finely shredded, so it wasn't too bad, but I take away a star for that .\n\n(BF says his potatoes were underdone too. Not raw, but not quite done enough.)\n\nWaitstaff was very good about keeping coffee filled. And, since it was a bakery, we HAD to at least try a cinnamon roll.  It was a good roll, and they even warmed it up for us. \n\nI noticed that they had a LOT of baked goods specializing with Strawberry and Rhubarb, which is in season right now. To me that's a good thing, even though I'm not big on rhubarb. Tends to indicate a reliance on seasonal (and hopefully locally grown) produce. \n\nIt being Father's day, they had a special on Steak and Eggs and a fresh berry topped waffle special too. Dads got a HUGE complimentary chocolate-covered strawberry, which I thought was nice.   \n\nOh yeah, the eggs with Hollendaise sauce looked and smelled really good...", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 3, "date": "2011-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Y-nr6eaHwP3HF1jV4JKDJw", "review_id": "f4rQwNakPD6xSn1QOe_LMg", "text": "We tried C's for breakfast over the 4th of July weekend. Upon entering, it is obvious that this is a no-frills family-style restaurant. Pretty much gives that \"small town\" feel, which isn't bad by any means.\n\nOur dishes were standard. Not bad, but nothing great. Service was lackluster, even if it was pretty busy...\n\nThis place does look to have an AMAZING baked goods section. Tons of pastries, cookies, and muffins. Plus, all of the breads are made in-house(my darling dear said his toast was top notch).\n\nNext time we stop in, I'll be skipping the menu, and snatching something out of the bakery case.", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 3, "date": "2011-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-FXnYAedXYHnNk8M49yBQA", "review_id": "-n9d_Y87v7vJa2X5w0SBVQ", "text": "If you're ever looking for a delicious breakfast on the west side of Madison, this is the place to go. \n\nMy husband and I were saying on the west side, but didn't want to pay the $20 surcharge at our hotel for meh hotel breakfast. Instead, we looked around at our options, and found that C's was highly rated for breakfast, and not too far away. (Best of all, it was about 5 minutes away from our morning destination, I'm Board!)\n\n\nThe first day we came here, we sat outside. (The gramma/farm decor kind of threw me off.) I had the blueberry pancakes with a side of hashbrowns and coffee, and my husband had an omlette with ham, onions, and cheddar & toast. Delicious - I don't know the last time I had such wonderful food when eating out. Even the coffee (and his pepsi!) were great. They hit it out of the park so hard that we decided to come back on Sunday rather than heading downtown to another place for brunch that we found.\n\nSunday's breakfast, my husband had a repeat of Saturday's, and I had one of their specials - a chocolate/banana muffin, eggs, hashbrowns, and bacon. It was also tasty.\n\nIf I had to complain about anything, it'd be that C's is too far away for me to enjoy regularly  :)", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 4, "date": "2013-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "I8L4kbfAxywRnOI-DSRQtw", "text": "Me thinks not. A nice enough place, but not 4-star worthy. No sir; not over the past few visits since the last review of 2013.\n\n+ I appreciate that it's family owned and locally run. That's totally awesome. Folks are friendly, and they mean well.\n+ Has outdoor seating with plenty of shade; it is definitely comfy out there on a nice weekend morning.\n- Indoor seating space is cramped; difficult to navigate around in, and horrible for larger groups\n+ They take plastic (debit/credit)\n\n- The food has suffered quite a bit as of late. Most recently, omelettes have come out waaaaay overcooked. Fillings seem low-quality; I'd swear the mushrooms may be canned. Poached eggs have come out swimming in a bowl of water, with the whites still undercooked and the yolks \"boogery.\" Ugh.\n- Don't ask for hot sauce unless you want a generic, Sysco \"House Brand\" hot sauce\n- No greens available as a side option\n- Asked for something other than hash browns as a side and were offered \"apple sauce\" (at a $1.99 up charge for some canned variety of apple sauce)\n- Took *forever* to get an omelette and poached eggs during the last visit - more than 45 minutes, despite not being busy. Server never checked in.\n\nIf you're looking for greasy spoon fare, this will do. Not sure why they can't offer some greens, fresh produce, or Cholula/Tabasco...", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 2, "date": "2015-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "595-MHWGrHYfYZHoO_D7AA", "review_id": "abwcB0R0M3H9E2SNo2hAlA", "text": "This is truly home cooking at its best. The staff is abundant and friendly. My breakfast today consisted of the Blueberry French Toast. The blueberries are actually in the bread dough!  Served with warm syrup. Definitely worth getting up early and running those two miles. Open only until 1:00 pm so make your plans to get there!!", "business_id": "B0Vuwn6Hugc-0U5n31YBfg", "stars": 4, "date": "2015-08-01", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "sleEMt44E1StWrjz3mcujQ", "review_id": "lnLI7hRjhS-gmx6BltemyA", "text": "Dude, this alleged 24 hour Dunkin' Donuts DOESN'T SELL DONUTS late nights!  Is it awesome to be really drunk in the middle of the night on saturday and go to get some donuts at the 24 hour dunkin' donuts, and it's OPEN but they DON'T HAVE DONUTS?  NO!!!!\n\nThe drive through is hella fast on weekday mornings, and the donuts are all always exactly like you'd expect from a dunkin' donuts (when they actually sell them.)", "business_id": "xky2rWT8kpsdyJ4YgZB3Jw", "stars": 2, "date": "2007-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wtsl05RJj5f6YBDQPEwP2w", "review_id": "ffS64Yek0-NrdHkTqDluXA", "text": "Hehe.  I love Dunkin' Donuts. Almost never have to wait inline here - great speedy service and they always have what I want ready to go.", "business_id": "xky2rWT8kpsdyJ4YgZB3Jw", "stars": 4, "date": "2012-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jo3UAPe3K5WqIPUVtf3IUQ", "review_id": "vCxFFt2YtajszSrPa4Zqcg", "text": "We go here pretty often and they make good drinks, there service is pretty good except the fact that they don't speak the best english.", "business_id": "xky2rWT8kpsdyJ4YgZB3Jw", "stars": 4, "date": "2014-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BLQXixrG0gT1puIqXs5R-A", "review_id": "_wKdCbC2F8QWO9LZnW5DTg", "text": "No bike rack, so brought bike in.  Did not allow it and could not offer an alternative location.  Usually go in car, but no more.  As I write this I'm at Panerai having a tastey bagel sandwhich.", "business_id": "xky2rWT8kpsdyJ4YgZB3Jw", "stars": 1, "date": "2015-06-13", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "N-D-d1Z4UybdlkK1HxlNPA", "review_id": "7OaoO3J1YXiL7K4mY4BF2Q", "text": "In response to a recent thread about Boba drinks in CenPho, I said that Rainbow served at least 1 flavor- chai- which my husband found to be \"just ok.\" When Hubby asked me this morning if I wanted to \"taste the Rainbow\" for breakfast, I asked him to check on the Boba situation. It turns out that Rainbow listened, and they now will add Boba to any of their drinks. The woman behind the counter said you can call ahead so you don't have to wait. Hubby's vanilla and my strawberry frap that he brought home today were still \"just ok.\" The donuts are still really good, and they finally have some stable hours, 4 am to 8 pm.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2008-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "hFG1Lira7tL_PElq6bdAAw", "review_id": "4HKanitADt216UXkNbLjxw", "text": "Sunday afternoon is not prime donut hours, but the creature needed feeding and Rainbow Donut was nearby.  Sparse selection, but what I got was pretty good.  The glaze wasn't quite Krispy Kream, but did hit the spot and the old fashion is definitely worth going back for.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 3, "date": "2008-07-13", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "ZiSL-0G_x7fclCHAQjra4A", "review_id": "vPHZj1JSfOBcogGNZ9x6xA", "text": "Ahhh donuts, how I've missed you. I haven't had a good donut since I left Houston 3 years ago. I suffered though Dunkin Donuts, Le Caves and even Donut Wheel in Tucson. It was horrid. I contemplated making my own, but it just ain't the same. \n\n I moved in down the street and decided to take a stroll to Rainbow this morning. I was super happy when my donuts were fresh and supernoms. I also ordered a Boba tea which was so good!  I am always  so disappointed when the boba to tea ratio is off, and I must say I was not disappointed today. Perfect! \n\nIt was hard to understand the lady behind the counter but that doesn't really affect the scoring. As long as the donuts are good, I am a happy lady. :)", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2011-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FQGY40BiVMfpiIPxefyBug", "review_id": "_S8VghaInrYlycaexLSZaQ", "text": "Awesome donuts! They remember you after a couple of times and make you feel like an appreciated regular. This place will always be my standard for donuts.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2011-06-15", "type": "review"}
{"votes": {"funny": 5, "useful": 4, "cool": 3}, "user_id": "45V7-1r79DEG0HbuaKYIlg", "review_id": "KtajuzmAq6VeQidx5jqYwg", "text": "One of my roommates was extolling the beauty of Bosa.  I asked if they were as good as Rainbow, but she had never tried Rainbow.\n\nSo - we decided to do a taste test.  Three of us in the house - so we would get 3 different (but like) donuts from each.  The plan was to bring them back home, cut to sample size, and note flavor, texture and overall preference.\n\nThe guy roommate's favorite is glazed raised.  The gal leans to sugar raised and I figured glazed old fashioned is a safe baseline for taste testing.\n\nWe went to Rainbow first.  No problem getting the donuts we wanted.  I also picked up a half dozen donut holes.  Was not thrilled to be charged $0.50 for the box, but c'est la vie.  Girl roommate also got a watermelon frappe type of drink.  A bit sweet for my tastes, but very, very watermelony.\n\nNext stop Bosa.  They didn't have regular sugar raised - used powdered sugar instead.  (I have a hard time trusting that the regular sugar didn't stick - somehow they managed to make it work at Rainbow!)  So the granulated vs. powdered sugar raised would not be as scientific a comparison, but we'd make do.  No problem with the glzed and old fashioned.  We also picked up ham and swiss croissants.  One can never have too much pastry, right? :)\n\nResults - \n     Glazed raised - Bosa was slightly denser and chewier - more mouth satisfaction.  Rainbow was cloudlike fluffy and light.  Great texture, but we didn't feel satisfied from chewing.  Rainbow was slightly sweeter.\n          ~Votes - 3 for Bosa.~\n     Old Fashioned - textures were identical.  Rainbow had a slight lemon (or maybe aspatrame?) flavor in the back end of the tasting.\n          ~Votes - 1 slight lean to Bosa, 2 Draw~\n     Sugar raised - texture of donut was identical to glazed raised above.  (duh - same donut, different topping.)  The gal roomie likes granulated.  The guy roomie preferred the powdered.  I liked both.\n          ~Votes - 1 Bosa, 1 Rainbow, 1 Draw.\n\nSo, Bosa comes out with a slight edge.  And we came out with a slight sugar rush.  I can't help but wonder what our next scientific food research challenge will be!", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2011-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "0qIsBt4EzBDCKrIviV55Ew", "review_id": "Fhv0_RkrlnKUadc_WQ6aZw", "text": "Wow, Rainbow Donuts, what a difference new management can make.   This place has really \"baked\" a new standard for tasty doughnuts in the Phoenix area.  \n\nThe restaurant takes pride in a clean front seating area and a very clean kitchen.\n-Hours, 4am to 7pm\n\n Baking the doughnuts everyday makes the doughs soft and sweet.  \nI also enjoy the bagel or croissant sandwiches.  If you like croissants get their early before they sell out.  \n\nThe multiple shops are not owned by the same person or group.  I work close to the McDowell Rainbow Donuts, so its my favorite. People love a doughnut why not share them with your friends or co works.  \n\n\nSincerely,\nKevin", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2011-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rEC7RWjff8jWlRlty_tL9A", "review_id": "B40yG2k24TAMiX_4iu4H_g", "text": "Doughnuts are legit.  'Nuff said.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2011-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Jz4scLeJk2eki2vXmcETSA", "review_id": "b7vt0SJ-D6bSzw_te2-qsg", "text": "I stopped here to get a donut for my daughter before school. I got a cruler. Best cruler I have EVER had. However, there's a few things you have to be aware of when you go. One, I got carded to use my card which has my maiden name so I had to scrounge up cash and change from my car because they wouldnt let me use my card. Two, I ordered a blended coffee. I watched the Asian lady make it, no coffee went in the blender... it tasted like a terrible milkshake. My daughter got a strawberry frosted nd some donut holes. They were terrible. The frosting tasted like plastic.  The reason I'm giving a 4 star is because the cruler was THAT GOOD. I'm going to give them another try... when I have cash.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2012-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ij82_DOUO_zqni57y20F-g", "review_id": "1vjqArtRdxy0cwfBgoaHQg", "text": "You may want to try Rainbows other location that has been at 51st Ave & Thomas for years.I used to take my grandddaughters there back in the 90's when I serviced the shop when I worked for Ameripride linen.Still \"good stuff \"best to get there before 11 AM when it's warm and fresh.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2012-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zB24KP3SgB0-7akwZrrtCA", "review_id": "UTSf2uArSULcbG-r936U0w", "text": "Great variety, inexpensive and exactly what we wanted on a Sunday morning.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2012-08-22", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 1}, "user_id": "VCK3eQKToEkmu8jdSEbTwQ", "review_id": "9CnRbesM5YAgDbxKqInXgQ", "text": "This place isn't much to look at; in fact it's terrifying. They have Christmas ornaments with lights stung up all year long, which is bizarre. But so what...\n\nTheir breakfast sandwiches are delicious, greasy, and just bad for you. Very enjoyable. If you want a \"feel good\" moment, come here for a breakfast croissant.\n\nAnd now on to the star of the show: Donuts. Made fresh every day. If you come early enough (the earliest I came was at 4am on Valentine's Day!) the donuts are still warm.\n\nI cannot say in just one post how delicious and AWESOME their donuts are. Greasy, decadent, bad for you...something for everyone! \n\nYes this is as good as it gets, folks. Try this place out, either for breakfast and/or donuts. You won't be disappointed.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2013-06-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Sc51Tyz9cPbrVH0F2SWkXQ", "review_id": "rROaBALFU-92r9xknGcS_w", "text": "I was hopeful that this would be a good experience, but The donuts were just ok...  Nothing special...  Nothing to make me want to return.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 2, "date": "2013-06-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "v6DYHVrAAMQ0EcFqtEQ-qg", "review_id": "weQOGaJjFRwf6ykYh3eZsA", "text": "These are really good donuts! Fast service and lots of choices. \nBought a couple of dozen donuts for my co-workers and they loved them as well. My favorite was the plain glazed donut. It was so fluffy! They were all fresh.\nMy only complaint was the bacon donut, I noticed in the pictures that some have bacon \"sprinkles\" were the bacon looks real and crispy but in little tiny pieces and then some just have 4 pieces of bacon placed on top.\n\nYeah, I didn't care for the one topped with 4 pieces of bacon and that is all they had. I will continue to come here and see if I get lucky!", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2014-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "lfqC9lZPVuPiP-M7JM-_Uw", "review_id": "pBannIaojtF9VsEDJkvuiA", "text": "The apple fritter tasted like stale, homemade donut. The lemon filled donut was amazing. The interior is very \"hole in the wall.\" The woman was friendly but tried to pressure me to buy a cinnamon roll I never hinted that I wanted. $2.50 for the two items.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 3, "date": "2014-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "2L4sTgOqCgh8HB0Aljf2yg", "review_id": "9Qyqin82fVSXWCyDaGcjKQ", "text": "Best donuts in town. \nThese locations are all great, but this one on McDowell is the best. Everything is clearly labeled, service is fast, and of course the donuts are great. \nStop by before the morning rush and grab a frosted cake donut. Beats the competition hands down any day!", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2015-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oaTBeZONLc6mRgefhhGb_w", "review_id": "jMBBmoP9jCNjRMZ4EBsh_Q", "text": "By far the Best donuts in Phoenix!!! I crave these and it's definitely worth the drive :-)", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2015-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EnFaQhSKjLS8e9H3ou76zg", "review_id": "A8ETA9NkfLUPxWGyiMgWlg", "text": "They have a wonderful selection of donuts and friendly staff. Today I enjoy bacon maple donuts and chocolate crullers, just delightful.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 5, "date": "2015-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gaPziistQeCyxDApmSmxVA", "review_id": "9gBdi0W5CJjx6xKj2AgMTw", "text": "The food and price was exceptionally good, I was excited due to my hometown not having more than one dunkin donuts within 20miles from my house but the service could have been friendlier.", "business_id": "T-AAN0CizEBOTtHinTuvrQ", "stars": 4, "date": "2013-06-08", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 3}, "user_id": "fczQCSmaWF78toLEmb0Zsw", "review_id": "aOSheh5n1ev1dM10-f530g", "text": "I'm actually tempted to give this Dunkin' Donuts 4 stars for the drive thru alone... but it is a chain and aside from the drive thru, there isn't anything that special or unique about it.  So, three stars it is.\n\nI've actually never been inside this location.  I've driven thru a handful of times for coffee and/or munchkins and I've always been pleased with the consistency of the product and ease / speed of pulling up to the window and placing my order to getting that first sip / bite!\n\nLast visit I had my dog with me and the girl working gave me an extra munchkin as a treat... so sweet!", "business_id": "T-AAN0CizEBOTtHinTuvrQ", "stars": 3, "date": "2015-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JtUSyUMfNgwR_rXB97qB2g", "review_id": "-xnX9w3ihyJFAcYn2MmFuQ", "text": "Thanks for the big ball of raw dough bagel this morning :( wish I noticed that before I got to work for my 10hr day.", "business_id": "T-AAN0CizEBOTtHinTuvrQ", "stars": 1, "date": "2015-07-15", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "mlL6MuK5zU6tGTbV3X0nhA", "review_id": "rIZ0yJxzyzQBHYjwRqkyWw", "text": "decent donuts but horrible coffee....", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 1, "date": "2009-06-21", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 2}, "user_id": "0dgQa81w5it1PMpGpC_L0A", "review_id": "BUgc47Da_vvxHQVY1AM3dA", "text": "Oh, how I LOVE the donuts here!  Seriously, the most amazingly fresh donuts you will ever eat.  I have probably had every single variety offered, and still haven't found one that doesn't meet my donut-snob standard.  My favorites are the pink-frosted sprinkle cake donut, cinnamon crumb in cake and raised form, and the maple bars.  We have called ahead for large orders, which were always perfectly executed.  I only wish that this spot was on my way to work... although I'm gaining weight just thinking about it.  \n\nI'm ONLY taking off a star because their bathroom is seriously disgusting.  Really.  Don't go in there. EVER. \n\nBut, ignoring that downside... this is the BEST donut shop in all of AZ!", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 4, "date": "2010-07-20", "type": "review"}
{"votes": {"funny": 13, "useful": 14, "cool": 12}, "user_id": "tdNV2Wb0LrFpm1Yfov_Klw", "review_id": "bJ81Jk1NUr3hLEcaLFYLkw", "text": "If I were to stop and get a donut here..I am not saying I have, just if I did ..I have to say they remind me of the ones I love from So Cal.  They would I am guessing, have that light greasiness combined with sweetness. Probably they are lightly iced .I bet if I went there I would really like an old fashioned one. Just if I went there.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 4, "date": "2010-08-10", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 3}, "user_id": "GZZs7288ZoIz2hx_vcAVUw", "review_id": "Ys78_PUV-mwxYszaNE25Ew", "text": "There are seriously some mornings in my house where my family will look at eachother ...say, \"Donuts?\" and we all magically know that this donut craving can't be satiated by simply Dunkin. Though these mornings are few and far between because my family has more of a convenience over quality attitude, they do occur. \n\nMy mother discovered Rainbow donuts because she works in Phoenix and before Dunkin had its viral takeover of Arizona, it was the only place to get donuts on the way to the office.\n\nAs far as donuts go I honestly don't think there's a way that Rainbows donuts could be any better. Maybe if they were covered in diamonds and had reverse calories. Everything they have tastes fresh even if it's bought at closing time. The prices are so cheap that I wonder how they even stay in business. The employees are always super friendly. \n\nConvert your donut religion to Rainbow donuts today. See the light. Repent!", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2010-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zUocCf7E6_y64mDL-3FlSA", "review_id": "mpS7R3fqt98mZBTkkX_fRg", "text": "I've been to this location 2 times. While their maple bacon donuts are VERY delicious, both times I have gone to get a Ham and Cheese Croissant. It's right there on their menu-\n(http://www.rainbowdonutscafe.com/croissants.html). Yet both times they didn't have any. So this time I asked \"Do you still make them\", and her response was \"Every once in a while\". WHAT!?\n\nNote to Rainbow: Don't put something on your menu that you don't regularly serve. \n\n\nI won't be heading back even though the maple bacon donuts are yummy.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 3, "date": "2011-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FdxUhQ2orufg_eMgWAoH6Q", "review_id": "8UGbKHQseX7Q1Bt02vPCww", "text": "Yum best donuts in Phoenix.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2011-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "m6p5Pnj5GImTTi6R4Kg7Gw", "review_id": "tOs7nwGN_ENAPcXF-w58Zg", "text": "I stop by here to get my Texas kolaches ever chance I could, they make it so good with either spicy sausage, regular sausage, or ham& cheese. So so sooooooooooooo good (haven't found any other place that have Texas kolaches).  Their ham&cheese croissant are so darn good also. Lastly, can't forget the donuts. They are all so yummy. Great service also, the young ladies working here is so polite and helpful.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2012-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_LsbT_uW0UE6rhsWiAIrsg", "review_id": "NJ1DwdTkKTBds8DWHXGKKw", "text": "great place, donuts made fresh everyday.  the owners are great, it is the best.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2012-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jsyU1y-8jyDSGErg8y2Bfw", "review_id": "EyK0-tm2WoiEy13xuAEXSQ", "text": "5 stars all of the way!  The cute girl behind the counter recommended the maple bacon donut.  It was interesting and not bad by any means but it wasn't for me.  The apple fritter on the other hand!!!!!    It was amazing.\n\nI recently moved to Phoenix and have been looking for a good donut shop like I had at home.  I haven't even been able to find a good cake donut in this town.  I have been settling for dunkin donuts, safeway or frys crappy selection.\n\nI brought donuts in for the office and they were talked about all day.  I have a feeling I will be stopping by very soon to pick up more office goodies.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2012-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "K6JcyAcWcQFYEf-536o3kw", "review_id": "WkzSACPsuf4v6RYJO92MJw", "text": "Tasty donuts in a convenient location. I've had their coffee rolls and other regular donuts and all of them are good.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 4, "date": "2012-07-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Ebi30JkOwUzAI-qRchF-xw", "review_id": "5l_eMetGWLNEfhbtKVKkRw", "text": "It doesn't matter which doughnut(s) you choose, they are all incredible. There is no comparison. Rainbow doughnuts are addicting.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2012-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "aTi0NVrcPJWbN6jAsJVcAw", "review_id": "evavLFWbl3gu7X7gT_bysg", "text": "This place was good for a spontaneous donut craving one Sunday morning...I happened by here when another place was closed on Sunday. It wasn't busy and also didn't have as many donut options as I expected. On this particular day, it didn't look anything like some photos I've seen. \n\nI wanted something creme-filled, but alas -- no luck. I did get a dozen donut holes to go, and yes they were tasty but I was left a little disappointed because I didn't get what I had a taste for.\n\nThey have plenty of parking and a counter inside with TV. No complaints about the service.\n\nIt may be that they were in the middle of making more donuts or getting some more in. I'll stop by again to give it another chance.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 3, "date": "2013-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "l7I6khaGzNsD0f3oykVtYQ", "review_id": "JZtzNi1BAsO5yHgI6077xQ", "text": "THEY HAVE KOLACHES!!! Delicious, perfect savory kolaches, along with the nicest staff ever! I review on Yelp quite a bit and I am just in love with this little shop. I drive here from Goodyear every weekend. So worth it.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2013-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JGCAc1ELELm_P_-FlgX3hA", "review_id": "iUfftI5UdM_NFl8OCJKaAg", "text": "Better than Krispy Kremes sugar-and-air donuts, Dunkin's more cakey donuts, overly greasy grocery store donuts, and Bosa's lower quality. Haven't tried their coffee or other options, so I can't speak to those.\n\nBut like some people mentioned, the availability isn't always the best. Those maple-bacon ones are always gone before I can get to them!", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 3, "date": "2013-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "A1D84JXibvLN2QQ5SK35qw", "review_id": "Pmb4F1Oj3tWLkOHkVbgiFQ", "text": "Great you just have to get there on Sunday before early church gets out its a great shop and great service will be returning soon", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2013-08-17", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "7vCArjyw0t5Hy_q5pXyVpA", "review_id": "RyrN_UHUcWpvqBTkQ-1nDg", "text": "Three words: maple bacon donut. Go here, you won't regret it. It looks like a cute little diner on the inside, with little barstools & the like.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2014-06-01", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "gQm2p1gmBPQ4f1sHxgRlbw", "review_id": "U_-GCdILfYh8fGJ-2VwQvQ", "text": "Bacon maple donut is unreal, seriously off the radar. Was in love at first bite then had another. Place is clean and staff super friendly.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2014-06-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "MCprRVbQZUSlABbl9BEy0A", "review_id": "SReQ45Ynt4c54NgCXw_77A", "text": "So tasty! We went to three Rainbow Donuts locations in one day looking for their famous Maple Bacon donut.  The first two locations didn't have it, but we of course tried some donuts and they are the softest donuts I've ever had, and this was at 11 in the morning, so they'd been sitting a while, and still so soft!  We finally decided on the third place (this location) to see if they had the donut we were looking for.  Her response, \"no, but we can make some for you, when will you be here and how many would you like?\"  \n\nWhat??  That's amazing service.  And the donut lived up to the hype completely!  Definitely will return, soft and delicious donuts!", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2014-06-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "LQ7qcT0TWlNFnLzdohhgPg", "review_id": "SuSD49NJYcvMEfnPPVWMkw", "text": "It is dangerous to live this close to a Rainbow donuts. I have been here more times in the last two weeks than I am proud to admit, but I have tried a variety of items:\n\n- bacon maple donut: delicious, amazing, definitely recommend\n- apple fritter: incredible, fluffy in the middle, crispy on huge outside, chunks of fresh apple, yum! \n- ham, cheese and jalapeño croissant: sinfully delicious, not too greasy, not overfilled, just right\n- spicy sausage and cheese kolache: so tasty! Sausage with great flavor, puffy pastry, gooey cheese - delicious\n\nI would (obviously) recommend any of the items above. Can't wait to try the cherry fritter. :-)\n\nThe staff at this location are super friendly.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2014-07-03", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "cBJqlNzyoJFak3_XRe2bvw", "review_id": "N6qU_QXplQsuHS1gBhjsBg", "text": "I live nowhere near here (thank God!) but have had their donuts from co-workers bringing them in and have been in store. I recently tried the Texas kolache, which is a breaded sausage and cheese pastry. You can get it spicy or not, I chose for the not spicy warmed up. It was delicious! As far as donuts, their glazed is addicting. I also got an iced chai, which was very flavorful and delicious. Restaurant inside has bar seating and a few tables. Staff is also really friendly. Overall winner here!!", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 4, "date": "2014-07-29", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "TR5ypsCA4p5_R2nLNbOvKg", "review_id": "VCDFeJEtQJsSjyzchNfFJQ", "text": "Got in line with my daughter when we observed the lady in front of us returning a few donuts. Expecting the donuts to go in the trash per food regulation, I walked out after seeing them being placed back with the other donuts to be sold (again).", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 1, "date": "2014-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "GPI930zIvXhi5I0gvkAa7Q", "review_id": "NYypLPv-lU7rWThie-p-fg", "text": "Good little donut shop with a large selection and good pricing. I have only been here on weekday mornings, so as the day goes on, I'm sure the selection dwindles. My favorite is the apple fritter. Like another yelper said, it's crispy on outside and soft on the inside with a ton of apples.  I've also gotten the iced coffee (because I didn't want to make another stop). It was good, but for the price, I probably wouldn't get it regularly.\n\nRegular donuts $1.00\nFancy donuts $1.95 (I think....)\nIced coffee $2.35 (or close to that....comes in large only)\n\nDon't quote me on the pricing, I'm going by memory and believe it or not, that's not always accurate.\n\nEasy to access of 7th st, plenty of parking, friendly service.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 4, "date": "2014-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "O35Jo0NU-x880qAHKD1ndg", "review_id": "TkqOg1VmwNfSMxZKvgKzRQ", "text": "We were in town from out of state and decided to stop and buy some donuts. The donuts are quite pricey compared to dunkin donuts and aren't very much better in my opinion. I asked for a iced matcha latte, which had powder lumps all over it and was not very good either, not worth the $5 for a cup. The asian man at the counter wasn't nice either, overall horrible experience and will not come back ever again.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 1, "date": "2015-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rgtBx6RwOYyTNr9onS6ClA", "review_id": "uFDF88IzGdSKFbKZAoRTTA", "text": "Rainbow donuts is the best! They have honest to God Texas Kolaches. We're talking REAL KOLACHES people. The owners are so sweet and welcoming. Amazing. Super inexpensive. Delicious, simple coffee. Come early because this place is amazing and sells out SUPER fast. It's worth it.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2015-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "6khNhFYFO3KSnRAM_9YdQw", "review_id": "ngKRE7XRTjdehHVD4kqs5A", "text": "Sooo good! The donuts are always incredibly fresh and delicious. My favorite is the Old Fashioned. Craggy, crispy outside, soft inside. Oh my goodness. These are among the best I've had. The coffee is pretty tasty, too, especially compared to what I expected. It's robust and flavorful. The staff is friendly and efficient and of course, who can beat the price of $5 or less for breakfast? Try it! You won't regret it.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2009-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cXnWZPcrtHjKXbcNzulg2A", "review_id": "QznCrQwMD2Fi5Hs1GWs3Ng", "text": "If you know of a better donut joint, please let me in on it. This place simply can't be beat.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2011-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "fczXIvJAWwkEZUHGtHADrA", "review_id": "h_r-VmOL7eFwapMGnfBNOw", "text": "Pros: Great Donuts and hot chocolate, Great Service,  Friendly most of the time, Open early, Convenient location, great prices, cleanliness - for the most part, OK Customer service.\n\nCons: in the past I have seen flies - buzzing around the donuts, and they close to early in the day, when I'm out in the afternoon or late at night i am forced to take my business elsewhere - usually a convenient store with suckish donuts.\n\nwhen I start achin' for a donut, this establishment is usually my first choice.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2011-07-17", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "X3y6Z8cu6A3YgsZ2RYu1Nw", "review_id": "Z1-18XprXt6Rh1R3yMyZGQ", "text": "You have to get here early and careful they close when they run out of donuts. This is a great spot for freshly made donuts. The prices are great and the breakfast sandwiches are good also.\n  I was a regular at D.D. in FL until they shrunk the portion sizes... Like we wouldn't notice Mr.Dunkin? Anyhow a huge tiger tail aka. Bow Tie or a giant Bear Claw for only $1.69, you can't beat it. \n  I've been a regular here for about a month, the only down side is if you go around noon your selection shrinks considerably. And don't expect them to be open by three. Enjoy your donuts, but if you start going to often you may have to renew your gym membership!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2012-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dy8HlNt2H81W7-Z9wXUM6w", "review_id": "oh61HK2G0t2Yr6o6PeiTLg", "text": "I was nervous about going to this place because of how it looks from outside. After reading the review I decided to go and I am glad I did because the donuts were SO good I will definitely go back!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 4, "date": "2013-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "i5iPAZUKwKlW96Ai5-cOUQ", "review_id": "de6sKzEvXHbQIyiYUX_Dew", "text": "Ever since we moved into our place a few years back this has been our favorite and only place to go for donuts.  A very popular and renowned donut shop has since been opened in our area, but Rainbow Donuts can't be beat!  After going to the new one once or twice we realized how much better Rainbow Donuts is.  They're always friendly, always delicious, and always a very wide variety of all the flavors you'd expect.  Highly recommended!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2014-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xWJMGELqPMDeYJVEbFG8Zg", "review_id": "i8hqAczqzDVVj0zajIg1mQ", "text": "I found a thin rope in my donut!!! Not very clean, I would say!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 1, "date": "2014-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JWxbGXDYBiPJFAvKdJPNyQ", "review_id": "J_wPnSNdJl5oXjnaDas6lg", "text": "GREAT doughnuts! I stop by on my way home once a week to pick up a bakers dozen (14) from Rainbow.. They are always so nice! Sometimes if you get there too early the selection is minimal although there's never been a bad one. The maple long johns are great and the croissants are hand made and AMAZING!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2014-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aHjWpK1NsZPOYv7KtMxJ6Q", "review_id": "S04ceqNf8v_qMZbtZAB2yQ", "text": "Rainbow Donuts can't be beat.  I've been going there for about 17 years and they have the best donuts ever.  I could eat a dozen all by myself.  I recently visited Portland, Oregon and went to the famous Voodoo Donut Shop with a line out the door and around the corner.  Guess What? Rainbow is better.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2014-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VU6hdnlMeWZ7zBo3N3A-dw", "review_id": "5JZcEWKqQAeOn5At-TgyUA", "text": "My wife thinks the donuts here are too sweet.  She may be right, but she also ate a donut covered in Oreo cookies.  Go figure.  Regular glazed were very soft and fluffy - a perfect donut texture and a notch above Dunkin in my opinion. The red velvet was different, but in a good way.  Only real complaint I had was that the maple-bacon didn't really have much maple flavor.\n\nMake sure you go into the store early.  I arrived just after 10 AM on Sunday and they were nearly cleaned out.  A steady stream of people kept coming in, filling up boxes and not just a couple donuts at a time.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 4, "date": "2015-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SedG-kkjx4V_oIfLcMTSsQ", "review_id": "YIpyrQuUKBHxYAoSlFa_jw", "text": "I was craving donuts being 5 months pregnant. It's a once a month treat. My fiancé and I drove over for a change of scenery. You can smell the freshness of the donuts as you walk into the store. Variety was definitely there. The maple bacon donut-OMG!! THE BEST MAPLE BACON DONUT I'VE EVER HAD HANDS DOWN!! We got there around 8:15am and it wasn't too busy. Check out their Instagram page- _rainbowdonuts to get a free donut! Super friendly staff. I would definitely recommend this place!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2015-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rIz7EJoXfuwcxwk6DOEA2Q", "review_id": "nG4eaJgC6DOx1wuUR_q5jw", "text": "Is it me, or did the prices go way up on donuts? .99 per donut??\nAlso, The jelly ones are alot smaller.\n\nService always good when I go, just LIVID with the price increase, Krispy Kreme here I come!", "business_id": "AhXcP_o5YAmCePKl0jxBXw", "stars": 2, "date": "2011-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nP2HH7Qe5UtSsjeEH3NZuQ", "review_id": "kz7ZVF55k1kX996nP8MwKg", "text": "Oh for the days when the funny guy with the mustache was making the donuts fresh for us! I had an issue with this location limiting the menu selection on a prepaid discount offer, I contacted the corporate office and was reminded that their locations are all franchised. So, FYI there is a much better run franchise 1/2 mile west on Bell!", "business_id": "AhXcP_o5YAmCePKl0jxBXw", "stars": 1, "date": "2012-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EacK6XwZjsTD6QYSIRlJ7Q", "review_id": "IYTdNfjibyEJrcqWBbzN_A", "text": "Definitely Worth The Trip!", "business_id": "AhXcP_o5YAmCePKl0jxBXw", "stars": 5, "date": "2013-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aYdtVrUtHqbn1qoJ98vRqw", "review_id": "g1SClOU8RcZ4-eQ7V3-P2Q", "text": "Had the worse customer service today.  Wanted to treat the kids and grab a coffee.  The music was blasting, only one customer seated and girl at the counter was annoyed and rude.  We were placing our order and 3 more customers came in, the girl told us to hurry she wanted to close out our order and move line.  Told us to get out of the way of the register, walked away and yelled for another employee.  NO SMILE. NO THANK YOU. SHE WAS THE WORST.  We were not happy I didn't need to start my day like this!", "business_id": "AhXcP_o5YAmCePKl0jxBXw", "stars": 2, "date": "2013-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xglGGZEbODjM1PiZDeCVuw", "review_id": "EwZrwg1QLOWs53TC-iRQaA", "text": "Shout of to both Shandi and Elisa who are two of the most polite and friendly employees I've met in awhile! Thank you both for making my visit an awesome one!", "business_id": "AhXcP_o5YAmCePKl0jxBXw", "stars": 5, "date": "2014-08-23", "type": "review"}
{"votes": {"funny": 6, "useful": 5, "cool": 3}, "user_id": "DqQzkxbhm4rEJpsIT3XxOA", "review_id": "gMnsoaRrJm60NwROE4MZiA", "text": "I was excited about trying Dunkin' Donuts for the first time during my AZ stay. \n\nThat is, until I brought an iced coffee and a dozen home for my family, and there was a spider on one of the glazed donuts. Not just chillin' there on it, but actually GLAZED ONTO it. A poor, defenseless spider frozen in time by sugary, sticky icing. \n\nI told this particular Dunkin' Donuts, and they said they were sorry. That's it. They were sorry and they were going to pull those glazed donuts off the shelves for the rest of the day. \n\nI didn't even like donuts that much to begin with, but I'll probably never eat one again. \n\nWow. Thank you so much, DD!", "business_id": "YDeM8-M4GwxyymCoV7Y-Tg", "stars": 1, "date": "2008-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "TQ5eVGOFr_qB5_BbEd3Sow", "review_id": "90MPBdw7plYHl9ciO0n8lg", "text": "Disappointing.  \n\nI was looking for the Denny's near here and came across this, ironically in the same center as the \"My Arep,a\" Venezuelan place I had discovered a couple of weeks ago.  I figured what the heck, I'll get a cheap breakfast here instead of Denny's.  And I know they have good coffee because I buy their ground coffee at Target and WalMart when it's on sale--REALLY good stuff.  But the donut was so much worse than what I've had (seldom) at Krispie Kreme, and the breakfast sandwich was just adequate.  Thank goodness the coffee was still good.  I got the vanilla flavored one and a decaf vanilla for my refill to go.  I doubt I'll go back--to this one or any other if this is a sample of their donuts.  I don't eat them often enough to waste the experience on bad quality.", "business_id": "YDeM8-M4GwxyymCoV7Y-Tg", "stars": 2, "date": "2010-07-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "lu-jws5eBreAbJgVroatUw", "review_id": "z51KrA__BzXzdjoslbVwmg", "text": "I love Dunkin Donuts, but not for the donuts (for that I go to KK or QT).  I love the wraps and breakfast sandwiches.  My somewhat weekly splurge is the turkey sausage egg-white flatbread.  I often get the $.99 egg and cheese wake-up wrap.  For about a buck I get my protein fix for the morning in a tasty tortilla.  \n\nI was a huge fan of McD's iced coffee, but that is like 70% sugar, so its essentially a soda parading as coffee.  DD's iced coffee actually tastes like coffee, cream & sugar, and their hot coffee tastes like coffee - not frappamocalattechino.", "business_id": "YDeM8-M4GwxyymCoV7Y-Tg", "stars": 4, "date": "2010-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GNCh2HzSVYsS12o76qtUiQ", "review_id": "ebx9ywwmjXhtXRFS0b6rfg", "text": "This Dunkin Donuts is very clean and serves great coffee. I don't eat donuts but I do love a good cup of coffee. Their coffee is not only cheaper than Starbucks, but better tasting too. I do know that Dunkin Donuts offers a variety of healthy choices for food as well so if you are in the need you don't have to eat fatty donuts.", "business_id": "YDeM8-M4GwxyymCoV7Y-Tg", "stars": 4, "date": "2011-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V7Q8jzamKLxvjtDrHjdY9Q", "review_id": "EaSyHnKTpgPQU4YhpTS1sQ", "text": "Filthy filthy resturant, the cooler system they used to hold items had mold, filthy booths, dirty windows, run down building, 0 dollars are going back in to the appearance , or equipment I could see from the counter , the ice cream was good, but I coulndt get over how dirty and old the place looked . I would bet DQ, would shut this one down , if they seen this joint!", "business_id": "zvFhC2Lywo6e8UaRTVj7sw", "stars": 1, "date": "2014-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FrADiHZD_A6PVIFOkn36uA", "review_id": "agmKs_9SAMyboM0EzQkEXQ", "text": "Great ice cream! I especially love the mud pie blizzard which has oreos cocoa fudge and coffee syrup in it. Amazing combination!", "business_id": "zvFhC2Lywo6e8UaRTVj7sw", "stars": 5, "date": "2014-08-11", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "NAohdbmsThewbeUkMMBohg", "review_id": "QG77nVsF23SS83u4a2kELg", "text": "My sandwich was fresh and made right when I ordered it. The bread was really good, I mean I realize it was just sub bread but it was super fresh and yummy! A pleasant surprise!\n People at work bring in the donuts all the time and they are always fantastic. The gentleman at the counter was friendly and helpful. I will be back!", "business_id": "oyxtTTQFGwCTkDrXAAPELw", "stars": 5, "date": "2012-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F_oZ3gY4_KVTYib8HujL7g", "review_id": "mPFkHArjFfkkqOtFsPwGeA", "text": "I have been to Eugene and Kim many times as many Florence natives have. Great sandwiches, good donuts (the apple fritters are amazing); the only thing lacking is a great attitude. While the food is pretty good, the service is not. Stuff gets done, but if you want to change anything, say your sandwich or meal, a simple change right? The answer is yes, but not without Eugene (and sometimes Kim), becoming disgruntled. So if you don't like lettuce, tomato, and onion on your sandwich, be careful. If you don't have your card ready in an instant, you'll probably get a disgruntled sigh. Oh, and most of the time, there's nobody to hold up, so it's uncalled for. Otherwise, the food is great. If your a regular or from Florence, you know how the shop operates.", "business_id": "oyxtTTQFGwCTkDrXAAPELw", "stars": 4, "date": "2015-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bmD__9xSpAppGXjFKwbXQw", "review_id": "8q5Y6tRzDa8Xyj0Fj5yMMg", "text": "Head and shoulders above the dunkins and kremes of the donut world. I love placing my order and waiting among the regulars while they discuss current events. The breakfast sandwiches are killer too.", "business_id": "3wkH1sL4tojmaveP1jNiIA", "stars": 5, "date": "2011-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "JkyvCg99SMdfS6OZv2P3RQ", "review_id": "MAYIaFqFwTkSkkAdJtvQEw", "text": "Not the cheapest donut coffee and water I have ever had, but definitely the best cinnamon honey bun I have ever put in my face.  No joke. \n\nI drooled every time I passed this place, the rest of the week.  If you haven't tried it, you are missing out.", "business_id": "3wkH1sL4tojmaveP1jNiIA", "stars": 5, "date": "2013-08-06", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 3}, "user_id": "sMIuJ7kWbDmwTqAwJqh5RQ", "review_id": "ar3V9448UDQCaXS-FGzwJg", "text": "the positive reviews must have been written by people with the munchies. The tamale was decent but the donuts were heavy and the girl at the counter had no clue of what she was selling. They are currently looking for someone who can make donuts. Sign at the door said experience is not necessary.", "business_id": "bZPEg3lCFSbJn_PczJyRBQ", "stars": 1, "date": "2014-07-12", "type": "review"}
{"votes": {"funny": 4, "useful": 4, "cool": 0}, "user_id": "seZUmOBVw9swD9RdBbsFUA", "review_id": "6JX8TweovJr5HwgD9sykPQ", "text": "What a dump in the hood, but darn it they have the best donuts in Las Vegas.  Staff is friendly.  I'm afraid to go there at night, but for these donuts I am willing to risk it.  I just shop fast and remember to lock the car.   Don't loiter around outside or you'll probably get offered something illegal.  Which might be your thing, but I'm just here for the donuts.  Moist.  Fresh.   A big selection.", "business_id": "bZPEg3lCFSbJn_PczJyRBQ", "stars": 5, "date": "2014-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "ftfqdDhI9QD3U7GpWRXSbw", "review_id": "-k4FJD_q41OKVYZ_5t3IeQ", "text": "Diamond in the rough!\n\nDon't let the exterior scare you away. Sure, the sign is missing a few letters, and the neighborhood is not the best. But I promise you, the donuts here are utterly incredible. \n\nAnd oh so cheap! It felt like stealing to take a dozen of those amazing donuts, one huge Texas sized donut, and a large coffee for $11. Seriously?! We just moved from NYC, where a fancy, artisanal dozen from Doughnut Plant in Brooklyn could put you back $30. \n\nThese are better! I swear!\n\nThe old fashioned/sour cream donut is a family favorite, and for good reason. It is melt-in-your-mouth delicious. My mom loves the lemon filled, powdered sugar donut. I'm a big fan of the crunch covered one. But really, they're all perfect. You could probably close your eyes and point to any random one and be happy with your choice. \n\nThey have a gorgeous looking selection of Mexican pastries and breads as well -- we will have to try them next time!", "business_id": "bZPEg3lCFSbJn_PczJyRBQ", "stars": 5, "date": "2015-06-24", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "f_QwW8uaXLQXJXaCYMcCYA", "review_id": "k4ECHWKVGcpbl9oj-t3NRw", "text": "Your typical sugar rush. When we made our visit to this KKD the doughnuts were coming of the assembly line. Mmmm fresh treats for the entire family. We enjoy those free samples. \n\nWe ordered the half dozen because I didn't want my kids bouncing off the walls in the mini van. Nice staff but prices are sure expensive. What do you expect in northern Sin City.", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 3, "date": "2011-08-28", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 3}, "user_id": "Wa5MTuOhTTV7A0A7AmYY9Q", "review_id": "zuspnXa8IXjYWaTTufiH2A", "text": "The question that's been asked millions of times .... \n\nWhy are things that are so bad for you, so damned good?!?!\n\nThe weekend before, I stopped in for some unhealthy goodness at a location in Southern California. They were out of the chocolate filled and I guess I was still craving it because on my trip to Las Vegas this past weekend, I stopped in for one. By the way, only one - thus the pic of only one. \n\nI don't care for this location. Anyway, the service here is nothing like what I experienced in South Orange County, CA. Abrupt and pretty much all business like - if the business didn't include customers that is. \n\nThe parking is somewhat shared in a pretty busy shopping center - 99 Cents Store, Home Depot and Walgreens. Other places too but I don't remember. It's on the corner of Craig and MLK facing Craig. \n\nI did care for the doughnut though. It was so damned good. The only way it could be better was if it came right off the assembly line. Have one, or a dozen - just don't mind the customer service, or lack thereof. Or the Las Vegas, desert heat for that matter.", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 3, "date": "2012-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_F3iTdtp-rx6Fl0h_dLRog", "review_id": "p7Ist93sPCy00jq-jymWvg", "text": "Crappy service.", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 1, "date": "2013-07-21", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 1}, "user_id": "iucKmLE-Q6I6dAI0ttR85Q", "review_id": "crqYlgAy2vTIZBoEkoYwug", "text": "I live REALLY REALLY close to this Krispy Kreme and up until now I had only ever used the drive thru. Today (Fathers Day) I wanted to go grab a dozen glazed and a dozen mixed for my AMAZING neighbor.  I decided to go inside so I could see the different selections of doughnuts. In retrospect I should of just stuck to what had been working because there was only one car in the drive thru when I parked.  Dun..Dun..Dun.. Upon entering the location I got into line but the customer in front of me was being helped by a male employee.  Now please keep in mind it was a holiday so I was expecting to wait. Honestly I would of been HAPPY to wait. My problem was more the fact that after the employee was done helping the man in front of me he literally walked away after making eye contact with me but not even acknowledging my existence. Maybe I worked in the service industry too long but in my view you are supposed to say \"Hi! someone will be with you as soon as possible\". Anyhow by the time (atleast 5minutes) someone did finally help me it was a female. I asked about the \"hot\" glazed because I just wanted to get out of there. She stated they are going to be WARM. Now the HOT sign was on but I said go ahead and give me those. Well guess what? they didn't seal the box with my doughnuts so when I was leaving it FLEW OPEN and in a pursuit to not DROP them all over I smashed some of them. Needless to say the love affair with their addictive doughnuts will CEASE to exist in my world now. I just cant excuse tons of CALORIES a long with a Mood killer!!!", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 1, "date": "2014-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2oHzYceSV4zTHdA7bGmGuA", "review_id": "yVIhIXmp7ww3qlBVz28hNw", "text": "So good!! never disappoints. especially when they are freshly made love the free samples!!", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 5, "date": "2014-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pePCBEzkewJHIAsJuCjE1A", "review_id": "1mIsFOsGNxR845k5Ha4v5w", "text": "The Krispy Kreme website clearly states that this location has their drive thru open at 5 AM. Currently waiting in drive thru at 5:18AM and they are not open. Google states the store hours are at 5:30am but drive thru should be open. The customer service here is awful as well as I have been here before. Ordered a iced vanilla coffee and the person in drive thru charged me for a vanilla latte and explained to me that that is what people normally mean when they order a iced coffee! Nope! Please update hours on the website to reflect when you actually want to open please so no one wastes their time.", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 1, "date": "2015-06-08", "type": "review"}
{"votes": {"funny": 8, "useful": 13, "cool": 11}, "user_id": "11QzsQ-nmRykVvD4agGRPw", "review_id": "eH8Ei1TxuDmPhy-9JcAXVQ", "text": "It's KK I think most people are familiar with it. Only thing worth buying here are the hot glazed doughnuts. I did just recently have a oreo doughnut that was good and and with the right amount of filling but everything else was too sweet. The blueberry doughnut holes are surprisingly pretty good. I like the drive thru but they do have seating inside and of course then you can watch them making the doughnuts which kids love... OK adults love it too! The hot now sign for the glazed is sometimes on when they don't have any fresh hot ones however if you are like me.... when they do have the fresh and hot ones it is very hard not to just start eating them right outta the box in my car. They are so soft and melt right in your mouth. Staff was nice and I'll be back from time to time for a hot glazed.", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 3, "date": "2015-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5Pv7GYvRa1BDlMI8QFLW3g", "review_id": "eE8xyQVCv439GEx9MvB7yQ", "text": "My husband and I went to Krispy Creme this morning, making sure to go when the hot and ready signs were on. We come quite often to various locations all over the valley. we ordered a dozen; they were already out of one flavor, which is understandable. So we ordered raspberry filled, and when we ate it, there was a tiny dab of raspberry filling at the hole only. No other filling in the donut. We wish we would have uploaded a picture. Also I specifically asked for the hot and ready ones to fill my order, and we were given the cold ones, and were not offered the complimentary donut with our purchase. Even after paying almost $10 for one dozen. We were the only person in line, so it wasn't because of a rush. I'm not very thrilled about this experience, and question coming back to this location again. Or any others in this case.", "business_id": "VlUrB8RornqTR1C9hC2s7g", "stars": 1, "date": "2015-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "656sg4vhV2ZKveh_FQFzpA", "review_id": "tssejpjVgL049MjTuHeD-g", "text": "Now this is a doughnut shop!  So many to choose from that I could have ordered 100 of them.  After a disappointing trip to Dunkin' Donuts the other day, got a box of mixed varieties (jelly filled, frosted with sprinkles, orange glazed, boston creme and more...) for $7.50.  The person running the place was very friendly.  Even though it's in downtown, I'd rather drive the 15 or so miles from Centennial Hills than the 2 minutes to Dunkin' \"Donuts\".", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2011-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eyjqD5kaAvtC1uGCMS-Yyg", "review_id": "8Ub3xd-RsWEXjbpp_u5tEQ", "text": "Best donuts in Vegas!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2011-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "1ufUZ2QUWuoyzB8nH1yNEw", "review_id": "_VSeFXZQwNLV3h3BWIytAw", "text": "I should have wrote this review 5 years ago when I discovered it.  I LOVE this place.  My hubby and I were looking for a place to stop on our way out of town, and so glad we stumbled upon this place. \n\nMy favorite is the cinnamon crumb donuts--YUM!\n\nThe family that owns this is always so nice and helpful when we come in.  It is hands down the best donut place in Las Vegas, and everyone I introduce this place to also falls in love.  \n\nGreat service, great prices, and the greatest donuts ever. :)", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2012-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "FTOhrTrwDKkpRAfQ7LOlXA", "review_id": "KWy6CxsjaQPsEFqIebgtoQ", "text": "i don't know how to judge donuts.\nthey were good. \ndidn't taste old.\nthere was a sweet old lady sitting there who hangs out there since \"everyday.\"\nadded to the cute character to the place.\nvery happy with my donuts.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2012-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "uXSIK8SxAqRZWpr8Gm1W-Q", "review_id": "A2fbYO1eJiC_JNOxQo6QNA", "text": "One of my guilty pleasures in life has always been donuts. I have been to many donut shops across the country. If available I will always get a chocolate old fashioned. Then I might also get a cinnamon roll, maple bar or something else that looks good. I have tried many donut shops across Las Vegas in search of a really great donut. The best I have found so far has been Real Donuts on Charleston Blvd. The donuts always seem to be fairly fresh and the taste of the frosting's are always good. One thing they make that I really enjoy is their Butterfly. Weather topped with regular icing or maple it is always good.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 4, "date": "2012-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7C4CAf3XNRfdY5DmOCF7zA", "review_id": "AWZAnBJFe7nduVHk8W9jdA", "text": "I love going here on Saturday morning... great donuts and super friendly staff!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2013-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cK5ctdHmq3XVjXcCTiRyeA", "review_id": "4n9iH_NTJZ0UT_W85B6Wgg", "text": "Oh, dear lord, the maple bars! A coworker used to bring a dozen assorted from Real Donuts to the office every Thursday morning. Fresh, soft, delicious. Best maple bar to ever cross my lips, though I have tried other flavors that were excellent too. I've ventured over there later in the day and the donuts aren't quite as magical, but are still heaven in a box (or bag).", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2013-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "76XTqNQr-DyqD9fZL-dMDg", "review_id": "_4GjmUfWVosTequmG3v9xw", "text": "This is a family owned & operated donut shop....the dad makes all of the donuts which are simply delish. They have a great variety and have always been fresh on every visit. \n\nBrian the son.... Works the counter and has a fun personality always clowning around, (you can really tell he loves his customers) and just having fun. \n\nCan't go wrong here!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2013-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kzSoHL3s0DufehDcRumhGA", "review_id": "vy2FOW2nBxshutb6A7fAdQ", "text": "You've never really had a donut until you've had a Real Donut. You can taste the freshness and Brian is always a bubbly joy to see. Just go here and get donuts for everyone you know. They will love you forever. My favorite: Crunchie Raised, Apple Fritter, or Cinnamon Butterfly.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2014-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "weH3FLsuqqzd3NcaTtNSPg", "review_id": "9nAT5xPBlJR_4-sfRe_Fhg", "text": "I love these donuts. Reminds of a place I used to go back home in Texas. The staff is very friendly.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2014-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Ox7DnjGXOOeCd5LGx23jNw", "review_id": "ryCAttMRHFmmykOIy08m7A", "text": "Oh lawd. Oh no child. This is so good, it's bad. My hips are going to be so mad at me for ever coming to this place. I have eaten 2 1/2 donuts since we got our box which was only 30 minutes ago.\n\nI will definitely be coming back to this place. So close to work and VERY good quality donuts! My boyfriend and I were thinking about going to a different donut place on lunch but we didn't like how greasy they normally are. We were driving around work, seeing what other places we could check out. We decided to drive down Charleston and passed by a place called \"Real Donuts\". We were thinking, \"Real donuts? As opposed to fake donuts?\"\n\nWe stopped in and there was a super friendly person in front. I saw a ton of cake and crumb donuts, my two favorites. Heaven. Already. After looking around, we were asking a ton of questions wondering what we should get. We planned on only getting a few, maybe one for him and one for me. Well, that went out the window real quick.\n\nWe started with a blueberry cake with white icing.. then moved to a bavarian creme filled chocolate glazed donut. After that, it was all bad. We found out that they had a blueberry fritter, my boyfriend's favorite thing in the world. We got two of those. We got an orange glazed cake donut, a crumb cake donut, a crumb covered apple cinnamon filled one... We decided to just go with the dozen at that point and decided to get everyone on our team donuts. We got a cinnamon roll, a cinnamon roll mixed with devil's food cake, some swirly one that I forgot what it was, a chocolate cake donut with chocolate icing, a regular cake donut with chocolate icing. I honestly don't remember all of the donuts that we got but the guy in front ended up throwing another one in for free. Then... we asked about one last donut and he ended up throwing that in for free too! So awesome!\n\nI was weary of the orange-glazed donut but it was so amazing. It tasted like a creamsicle. The blueberry cake donut was SO flavorful, I couldn't believe it. I really am stuffed and my whole team was raving about how good the donuts were. I didn't want to end up eating all of the leftovers, for sake of my hips, so I walked around my office and started handing them out. Everyone was talking about how good they were!\n\nI will definitely be coming back. The service was great. The quality of the donuts was AMAZING and the flavor was perfect. I can't wait to come back and try all of the other donuts we didn't get this time.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2014-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "OoFWl6je_AFgRYPP1yVRLw", "review_id": "vA1pVME2_BI69-nGJxe3EA", "text": "This place is pretty awesome. They make a lot of donuts so much that the next day they offer  20 of them for five bucks. If you are looking for dependably decent donuts and you are in the area; if recommend it. Just be aware it's no Ronalds donuts... This is a good second though..tied with Masters donuts.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 4, "date": "2014-06-29", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "ZPnjxhKUsBDhXEOBKY_n2g", "review_id": "YlQLphqQseS3Y0EZo-pOTQ", "text": "This place brings back memories of my childhood when my mom would take me to the little donut shop on Saturday mornings. I love the little hole in the wall, family owned joints. So much better than chain places. This spot has been on my radar since I saw pics from Terri's donut crawl. I got the maple bar and a regular glazed donut. Both were soft, sugary treats which I inhaled in less than 2 minutes. I don't eat too many donuts for obvious health reasons, but these were probably at the top of my list for donut spots in Vegas. Don't forget your Yelp check in for a free donut. Will for sure be back on my cheat days.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2014-07-17", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "KRI1kCT7SY6XMX9fBALQYA", "review_id": "KGHJuKqk9JdxYH0qNq26Tg", "text": "I'm a little stunned that I haven't been to Real Donuts before because I've spent a lot of time nearby. It took until I had enjoyed one of their creations through a reseller (The Goodwich) that I really experienced the magic.\n\nRegular donuts are $1 each, but nobody is really going to buy just one. More likely options are a dozen regular donuts for $9.50 (max. 2 jelly-filled donuts) and half a dozen donuts for $5 (1 jelly-filled). They have higher prices for fancies ($1.50/$8/$15). I was actually looking for the day-old donuts but missed the boat on it. I guess they must sell out of those close to their opening hour of 4am (your time to shine, early risers).\n\nSo yeah, that blueberry fritter. It was my magical introduction to Real Donuts. It's not apple (which is also good). It's better. Sweet, moist, crunchy, blueberry-y, Not sure what more you can ask for... except a second. I also tried the raspberry jelly-filled donut and the maple cruller on day 1. There is an absurd amount of jelly in the middle of that treat, but thankfully it's not too sweet. The cruller is pretty airy and reminds me of cream puff dough. Almost feels like a healthy option... almost.\n\nNext day, I finished the rest of the donuts off. I guess I got the day-old donuts that I wanted after all. The orange cream glazed donut was okay but didn't stand out. The cinnamon raisin bun was still very moist, and it was sweet without having a huge portion of glaze as you might see as other places. The old-fashioned chocolate donut was pretty average too (note to self: skip). Finally, blueberry fritter #2 was just as awesome as the first.\n\nDefinitely would recommend Real Donuts for people who are in the area or who are donut fans. Haven't thoroughly explored the rest of the Vegas donut scene, but I'm already pretty confident this place will end up as one of the mainstays.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2014-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cH-RV8qS7M5Kg0cENqiU-Q", "review_id": "Sbh1ynRC-4QwFuW2lfM0jg", "text": "Really one of the best places for donuts here in Vegas. I absolutely love the blueberry filled and the inverted cinnamon donuts. They are perfectly sweet to me, since some donut shop donuts can be super sweet. Don't forget the check-in deal for Yelpers. You won't be disappointed in these donuts.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2014-08-11", "type": "review"}
{"votes": {"funny": 7, "useful": 5, "cool": 6}, "user_id": "0RAmuyzHyrxhMSwAX-Hycg", "review_id": "79sUuON3QMBlcSiRrZq4Ag", "text": "Doughnuts. Donuts. Dog Nuts...whatever you call them for the most part, they're all tasty. Well maybe not dog nuts. \n\nLets get real, this place is like a fried dough time machine and I love it. Real Donuts definitely keeps it real; from the wood paneling on the walls to the $1 doughnut, it's like walking into the \"Wonder Years\" TV show. \n\nI originally came here for the inverted cinnamon rolls, but found myself buying up pretty much everything in the display case. The maple & peanut covered cinnamon rolls, cherry frosted french crullers, bear claws, the classic Simpsons doughnut (pink frosting & sprinkles), maple bars, and nearly everything in-between. \n\nNot to forgot my savory side, I also bought a jalapeño croissant stuffed with turkey, swiss cheese, and chunks of my favorite spicy pepper. This was delicious; the bread was super soft and I was told it was made fresh that morning. Sure tasted like it! This treat is a must if your taste buds like to live on the spicy side. \n\nBefore I left I asked about the two giant doughnuts that looked like they were drawn on a board behind the cash register. One is called \"The Texas\" which is a giant glazed doughnut, about 8 inches in diameter?. The other doughnut is called \"The Alaskan\", this is what looks like a 16 inch fried piece of heaven?. I'm not sure, but sadly it didn't matter, \"The Texas\" was sold out and \"the Alaskan\" is made-to-order. Next time, my doughnut loving friends!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 4, "date": "2014-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j5so_bkHsm-kSWl6Ur1ewQ", "review_id": "2XA55QJ7bbOmVGpyooFm7Q", "text": "OMG! So delicious! It's the only place I will ever go to from this point on! I 'm not much of a donut person, (I know.) but this place is just AMAZING!! The donuts taste super fresh and they're really soft, too. The people are just great and very friendly. Love it!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2014-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jJdmIcmLC5X5LI_ljKIflg", "review_id": "iOmDG0YFq5V6BPpOuzQt7g", "text": "Real Donuts is like punk rock in pastry form. They're not generic suburban Krispy Kreme, nor are they some fru-fru fancy urban joint. These donuts are angry and out to kick ass. From donut holes to Texas donuts, the size offerings vary. Plus they're TASTY, moist (yet not greasy), and totally satisfying. The only thing keeping me from giving them five stars is the lack of variety that other donut shops have. Don't get me wrong...there's still a good selection. But I suppose I can sacrifice a cronut or donut sandwich if it means I get to make gastronomical love to RD!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 4, "date": "2015-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WFTnVPC02fJwTrtlY-F9KQ", "review_id": "RAh6sahTs9QfG4HvwBVz3Q", "text": "I tried a Sugared and a Glazed,  both were fresh and delicious. \n\nThey have limited seating,  3 tables. \n\nOffers many types of donuts,  including an Alaska for 9.99. Incase at 1130am I saw 7 types of donuts,  3 fritters,  and croissants. \n\nQuirky employees who work hard.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2015-06-05", "type": "review"}
{"votes": {"funny": 45, "useful": 57, "cool": 57}, "user_id": "2HmHgW3hRYvXYFmQyQtLuw", "review_id": "qrnDOMosxhINgLiL4uv_7A", "text": "Stopping by Real Donuts is a real treat. This last visit I stopped by in the early afternoon and they still had a good variety of donuts available. Inside is small, but it was packed with customers. I like that they keep fresh stuff coming out throughout the day. The workers are always nice and upbeat. There is a check-in offer on yelp for a free regular or filled donut and they are good about honoring it. A half dozen donuts only set me back $5 which is a good price and the donuts tasted great. They have coffee and other pastries available also including a couple of donuts that are larger than normal in size and usually require some notice to ensure being able to grab one, so call ahead. This is a hole in the wall donut shop that's been here for a long time and for good reason. It's not the decor bringing customers back it's the friendly employees, fair prices and most of all delicious donuts in my opinion. \n\nInverted Cinnamon Roll - This one has swirls of devils food cake in it. Easily one of my favorite donuts here. The donut is just nice and soft and has great flavor. I'd recommend getting at least two.\n\nInverted Chocolate Iced - Not swirled with devils food cake or cinnamon like the previously mentioned, but still sporting princess Leia buns covered in chocolate. I wish I had saved this one for the following day with my coffee, it would have paired better. I enjoyed the donut however it was a bit heavier than the nice and soft inverted cinnamon roll and could have handled being dipped in coffee or tea just fine.\n\nBlueberry Fritter - Very good! When I heard they had apple and blueberry, I decided to try the blueberry and my hubby went with the apple which I sadly didn't taste. I loved the texture of the blueberry fritter and I tasted blueberries in each bite. \n\nTwisted Chocolate Iced - I picked this one out because it was covered in chocolate and looked good. When I got home and took it out of the box it resembled a wiener and balls to me. Oh well it was tasty and I swallowed the whole thing.\n\nFilled Bear Claw - Very good. This donut was a good size and nice and soft with a good amount of apple filling inside. They also have smaller bear claws that are not filled if that's your thing..\n\nRaspberry Filled - The outside of the donut was glazed nicely and inside there was a fair amount of raspberry filling and it tasted great.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2015-06-05", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "2JPFJt1TV7P3YIvuOoCvWw", "review_id": "BSwKElVQQPGTd3pLZ_GQ2A", "text": "The shopgirl recommened  \"inverted cinnamon rolls\". I bought Glazed and Sourcream and Chocolate and Chocolate on Coconuts and inverted cinnamon rolls. Anyway, I bought 6 Donuts and price is just $5! What a reasonable price! I love this shop! The atmosphere was a traditional shop. Very Simple and tasty and inexpensive!!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2015-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KcHI7ESpEKhFTBU0TaXurQ", "review_id": "MnQsQDoO5xnB-xBl06-dPQ", "text": "Delicious donuts, decent coffee, and incredibly friendly service. What more need be said?\n\nWell: they have some of the best donut holes I've eaten, and the crullers are to die for.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2015-06-28", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 3}, "user_id": "59bLujt2bBCrjVmCiWWeJQ", "review_id": "_hCtahvmfkX8uQilrvV0Vg", "text": "Stumbled upon this donut shop while my friend and I showed up an hour early for class on an empty stomach. There is plenty of accessible parking out in front. The shop was clean and there was a great selection of fresh donuts. I ordered the chocolate bar and chocolate circle donut. My friend ordered the chocolate crueller. The donuts tasted fresh. Costed $1 each,  reasonably priced. Check in on yelp for a free regular or filled donut. \n\nThey also have a gigantic donut for sale in the glass window. It looked like the size of 4 donuts combined. Would probably come again to try out the big donut,  mainly for photos though. \n\nThe service was top notch here. I usually don't expect much from donut shops since they don't make much and it's early in the morning, but this one was different.  The kind lady behind the counter was very sweet and smiled often. She definitely help make my day a little brighter!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2015-07-07", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "So66cw9s-fLs25pvLdK0Ag", "review_id": "OeRX84E1hft7KPehlCmMZw", "text": "Upon looking for a donut shop, i found Real Donuts on the web and decided to try it seeing it had great reviews. I drive by it quite often on the way to work and it's very easy to find. My first visit I kept my order simple. I will say that the only thing that would have me return are the donuts. I did not care for the service as I felt rushed and unwelcomed from the moment that I set foot in the door despite the fact that all the reviews I read raved about the service being top notch (maybe it was just the day). I ordered donuts for my husband and myself and luckily we both thought that our selection were great prices and tasted amazing otherwise I wouldn't even consider returning.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 3, "date": "2015-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iDdZcGiDKay38bxtRtNsjg", "review_id": "XKMOIVja4gYKv5lY8VmDDg", "text": "Let me first start off by saying, Sage, the girl working the counter was so so sweet and knowledgable about all the donuts and Vegas in general. She is the reason for 5 stars. You just don't find nice people anymore. Everyone is so rude.  \n\nOn to the review:\nGreat, cheap eats in Vegas. We had 4 donuts, 2 were free with our yelp check-ins. Score! \n\nApple fritter - nice texture, apple cinnamon flavor but the icing on top made it to sweet for me. (I don't add sugar to anything so it may be my taste)\n\nCinnamon crumb cake - pillow soft texture, not overly sweet. Good choice.\n\nChocolate sprinkle- I think the kid in all of us just craves it. BF liked it.\n\nRaspberry filled - by far my favorite. The raspberry flavor was so potent and yummy. They definitely don't skimp on the filling. It was bursting out!\n\nIced chai tea was so good. Perfectly made. \n\nOnce again, thanks to Sage for all of the local tips and places to eat! Our bellies will thank you.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2015-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7hWM-K9zpxHDdwTPXAwaKg", "review_id": "UYpO-lDL77p3epdFeoH2Nw", "text": "THE BEST customer service!! Brian is so friendly and helpful! Donuts are good. Not to die for. Brian took the time to look up names of local eateries for us. He was rockin' to Billy Idol. Nice guy!", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2015-07-13", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 4}, "user_id": "Pnwo38HUwb-nR4Og-11C9w", "review_id": "I70-sttViAjDI_CT4S4ejw", "text": "This is a small donut shop with a few sitting places. You can have a big selection of real homemade donuts. If you love sweets, especially donuts, you'll feel like in heaven)))\nThe blueberry flitters and apple flitters are very yummy. I also love the raspberry filled with powdered sugar.The prices are reasonable and the workers are always friendly and helpful. \nThey have a YELP check in offer for a free donut and that is really good. Love this place...", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2015-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "g9ZCTsd6FvEjlF9-CtPq0g", "review_id": "rJXvJW595JbGPN_-C3vTAA", "text": "The regular glazed and sugar donuts were awesome! However not really impressed with the blueberry fritter! We were the only ones in the shop and we were greeted however nothing amazing happened. Nothing stood out to me. Okay service and decent donuts other than what I mentioned in the first sentence.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 3, "date": "2015-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kLSF3P9Hgk0UMyCFDTRNMA", "review_id": "sDdC3HgjkKthEafxQvjf_w", "text": "Amazing !! Ten times better than any other doughnut chain out there ! The Old Fashioned and The Blueberry Fritter are my absolute favorite.  Worth the drive across town and always very friendly .", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2015-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "022kBrpzcod-R6DksUeohw", "review_id": "THtue-SZQ1mO5pHj0FZQJA", "text": "I stopped by to pick up donuts for a staff meeting.  I was surprised to pay $9.50 per dozen.  The quality of donuts surpassed other donut shops.  I highly recommend you give them a try.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2015-08-22", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 3}, "user_id": "HIPERrw2QLhmaeHH9GIdOg", "review_id": "cKETC_1EyojBxmAUzZvp-w", "text": "The decor is nothing special, probably the coffee sort of sucks and the AC is not quite high enough, but who cares: if you are vegan and have been missing out of your sweet friend the doughnut this this the place to go. Lots to choose from; it was worth the $18 cab charge to-and-from the Strip for the $5 box of sweet little friends for my wife and I.", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 4, "date": "2007-07-04", "type": "review"}
{"votes": {"funny": 7, "useful": 2, "cool": 2}, "user_id": "23zYCcnqfru5jdxnTqjgDg", "review_id": "aXoiYStKiXJYcG098GrDeA", "text": "I am a hater. A Krispy Kreme hater. Oh yea....Once in a galaxy far far away. Lakewood, Ca my roommates and I would sit in the drive through just waiting for hours to get that hot creamy goodness to put in my mouth and melt....Now the novelty is gone. After gaining a double chin from the double boxes of glazed donuts.\nI found Ronald's after seeing it in the Las Vegas Review Journal as being one of the best donut shops in Vegas. Ok I thought Lamar's was....but they closed. The only other one I like is Bob's in Farmer's Market. \nRonald's you walk into this quaint strip mall in the middle of the chinatown area of Spring Mountain. Didn't realize it was there but the sign wasn't too vibrant. There was no Neon saying WORLD'S BEST DONUTS!! But there was a lil store with a little old chinese lady...\n\"How many?\" \nSooo many to choose from....and they have vegan? Wait...healthy donuts?  I wanted a dozen but my mouth mumbled....\"just a few\"\nI needed chocolate...plus I got this cinammon thingie....and some cake donuts. Yes this didn't taste like your ordinary donuts. It was more of magic donuts, that I didn't feel guilty eating.  Since then, when I'm in the neighborhood and I do have my sweet tooth acting up. I'll stop in for these fabulous snacks of goodness. Ok well so they don't last longer than a couple days till they get stale...like most nuts. My advice is to individually wrap them. Then nuke it for 15 sec in the microwave when you're ready to chow down!", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 4, "date": "2007-07-08", "type": "review"}
{"votes": {"funny": 7, "useful": 10, "cool": 11}, "user_id": "eBwjQ_Opva2JtYE7qYLYXw", "review_id": "bv0WQ0cnhEc6J-ZBsNGuUg", "text": "Oh, Ronald's Doughnuts, I love you. I never thought I would taste another decadent vanilla cream-filled, chocolate-frosted doughnut after going vegan until I found you. I am so sad that my trips from Utah to California, lately, have been through northern Nevada and not southern Nevada. I am really having withdrawals thinking about you. Next time I am getting 5 dozen doughnuts instead of 3. I am such a glutton.", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 5, "date": "2007-08-10", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "DDbQl6fWTaKjKgsjWqfG5A", "review_id": "bWCeLF3ruxxzwfE7BGQkRw", "text": "Yes, it's been written below (and more eloquently), but it bears repeating: Vegan Donuts ... in Las Vegas. Yep, you read that right. Just to confirm -- and let this sink in -- Vegan Donuts ... in Las Vegas.", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 4, "date": "2007-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DWMBbdPudh0CzlolTjVbgQ", "review_id": "Z-tx4g-wblvooaaJTvyAtw", "text": "Let's get this out of the way....\n\nI am one of those pedantic vegans who like to question people inside out how vegan food really is.  Ronald's know what time it is.\n\nThey keep all of their vegan donuts on the top shelves to stop non-vegan donut crumbs from falling onto them.  When I asked what products were vegan, they didn't bat an eyelid as they pointed out more vegan donuts than I'd seen in my life.\n\nThe shop itself is too cute.  Located in a strip mall a short drive out of the main gambling area, it is usually full of locals ordering take out coffee.  \n\nThis place opens super early, allowing greedy vegan chubbies like me to get 'em while they're hot!", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 5, "date": "2008-06-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "rPGZttaVjRoVi3GYbs62cg", "review_id": "t0-t6q8Ub8Jdt16Dys_ODQ", "text": "Delicious!  I stuffed my face with both a coconut-vanilla cake and chocolate-chocolate cake.  Mmmm!  Breakfast of champions!", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 4, "date": "2008-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VCCriaPM9FazDdHTQcfHXw", "review_id": "1X3FZ-1jlULkdR_hYfyxfw", "text": "Eating in Vegas has convinced me of two things.\n\n#1) The health score / restaurant grade system must be extremely generous, because I can't imagine most of the 'A' rated places in Vegas passing with anything higher than a 'B' in LA -- and probably more likely, a 'C' grade. Unfortunately, I don't think Ronald's is exempt from this predicament.\n\n#2) Las Vegans are afraid of real Vegans. I base this not only on the fact that there's NOTHING for us to eat in the whole city (save Ronald's Donuts and Rainbow's End), but also on the fact that Ronald's doesn't advertise the fact that most of their donuts are in fact vegan. I think they're genuinely afraid if they advertised their donuts as \"vegan,\" they'd lose business because people on the SAD would be too doggone afraid to try them! So they don't tell anyone that their donuts are vegan unless you ask directly. And when you DO ask directly, the sweet lady behind the counter (bless her heart) actually seems to look both ways to make sure that other customers won't overhear her. Sad but true... If only people would smarten up and check their insecurities at the door.\n\nRegardless, I was thrilled to have some yummy animal-friendly donuts during my stay. It's a little beacon of light for tourists and locals who want something tasty and vegan. Many thanks to the kind folks at Ronald's.", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 4, "date": "2008-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sutMg4ttyFvBXbCIagAlEg", "review_id": "ClWgm8N4ldCxIqxjjzIZ8A", "text": "Ronald's Vegan Donuts are practically the only advertised vegan food in Las Vegas. Needless to say we were hungry until we bought a variety box of vegan donuts for CHEAP which became our breakfast for the entire week. I don't even like donuts but those were very tasty.\nAll vegans visiting Las Vegas should go buy a box. Do it or you'll go hungry! :)", "business_id": "w4SGmsvFzqyAIs7CSQ_J-g", "stars": 5, "date": "2008-07-23", "type": "review"}
