{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E5O8wsWiGLqoOVBmG84wcw", "review_id": "boU6hZwK-As9Zf7YHVq4GA", "text": "I love everything about this place. The food is delicious (yes yes, the fish sandwiches, OK, I agree -- but DID YOU TRY THE MEATBALLS?? holy tamoley), I adore the staff, and I love that there are no windows -- it's its own little hermetically sealed 1950s world of delicious, real food and good people. Lots of places try to create this kind of ambiance, but it can't be manufactured. It takes decades of good food and good vibes.\n\nAlso, the food is really good. :)", "business_id": "mVHrayjG3uZ_RLHkLj-AMg", "stars": 5, "date": "2015-07-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PSbFVAJMrG0fvTv-Q9GI6w", "review_id": "vzZPpSvu8N0Yd6UP6bewPg", "text": "The chili dogs rock!  The portions are huge so come hungry.  Big selection of appetizers that go beyond the standard bar food list.  Great selection of draft beer.  Noise level is good for lunch but may be loud for dinner.", "business_id": "1qCuOcks5HRv67OHovAVpg", "stars": 3, "date": "2015-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "VRB9nzZnYWB6WETk_QfIEQ", "review_id": "F2-NgUkU3FkBEIpOGyyRFg", "text": "I have been to Dave and Busters multiple times and i feel its a 2 star place.\n\nI can say the food quality is sub par.  In my opinion the food prices are expensive for what it is and quality.  They do offer a nice bar,but then again the prices in my opinion are a little higher.  Service isn't too bad, but could be better.\n\nD&B is a great place for adults for sure, but the prices for tokes or \"game play\" is a little ridiculous.  Some games charge 6.9 credits to place.  Thats almost saying $1.50 a game and some of those games are addicting where I know most of us keep playing.  \n\nI also thing D&B isn't the cleanest place either.  The bathrooms near the arcade are always nasty in my opinion.  Doesn't seem like they keep up with it.  To me, thats a big factor in rating restaurants.   \n\nAll in all, D&B is an ok place to visit, but not a place i would frequently waste my money.", "business_id": "sbW8qHJgzEIH42B0S-3New", "stars": 2, "date": "2015-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5s0YP_ZMshAYPb0VdSfukw", "review_id": "OrGj5AudmmK-AuPBcDADnQ", "text": "Eh, this place was okay but it was sort of a weird crowd/overall experience for a Saturday night.\n\nBobby and I came here after dinner and sat up at the bar. Tip: if you sit behind the taps, no one will bother to acknowledge you exist. When we moved seats, we were finally asked what we would like to drink after waiting for 5+ minutes in our original seats. It wasn't all that busy, either. Most of the people sitting at the bar were a bit older than we were. It seems that Bar Louie is trying too hard to be trendy with the decor/neon blue lighting/extensive martini list. Maybe I'm just salty about the wait.", "business_id": "EoAY1JSVeJriBzId8lUQwQ", "stars": 2, "date": "2014-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Pc2ezRRHcXUXWXmZutQPeg", "review_id": "fEAmUl0viB6ckDJkCNAegQ", "text": "This place is a keeper! \n\nIt was pretty good. I got the Cajun chicken sandwich with french fries for take out. \n\nI waited at the bar, and ordered a drink while I waited. I had the Caipirinha... Not as good as Seviche's, but then again this is Buffalo Blues.... \n\nIf you need an \"All American\" food fix, this is the place to be.", "business_id": "Ts4xsKPU7FNPPZRj-nRjIg", "stars": 4, "date": "2014-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Jou7l2wJvM7ZgqspikTw9Q", "review_id": "eb1DN3bzWuRTb2Na8IbOQQ", "text": "I came here with a friend for her birthday, and the food really isn't particularly special.  Portions are decent, and I guess the prices are reasonable... if they had better food. \n\nThe outside of restaurant makes me think that the inside will be just as square and boring, but the inside patio area was pretty nice actually.\n\nOverall, I just wasn't very impressed with the food.  If I was offered to eat this food for free, sure, I'd take a helping, but probably not seconds.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 2, "date": "2011-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-aac2zISNpOBTWHQqZIJIw", "review_id": "37pnjUReJ_5KtOPaMqHLng", "text": "I recommend the short rib ravioli! Totally the best thing I've had in a long time.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 5, "date": "2014-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Tohk5YKif0q0giiFiNs7BA", "review_id": "bAjHJ9vBMb7anQ9PU-WbMQ", "text": "You can't go wrong with Casbah. Meals and service are deliciously consistent, yet there's enough experimentation to keep things interesting. My dad and I visited this week, specifically, for Pastafest and - as usual - the meal was nothing short of spectacular. \n\nWe began at the bar where I mentioned a favorite drink no longer on the menu: the Malbec margarita. The bartender was quick to dig out the recipe box and whip one up to sweet and sour perfection. Happy hour prices make a stop at this bar one Shadyside's best options for higher end post-work cocktails. \n\nSeated in the bright (though slightly stuffy patio), we began with Casbah's exceptional calamari. Lightly breaded and fried, the squid was tender and deliciously sauced with a garlicky aioli and the sweet and sour Italian agrodolce (ahhhmazzzing), the combination made for a crave-worthy bite. \n\nPastafest provided tasting portions of some old favorites and chef's creations. We shared three: \n\nGemelli, jumbo lump crab, sweet corn, guanciale, tarragon: sweet and bright, this dish was summer on a plate.  \n\nDoppio Ravioli, eggplant puree, goat cheese, sweet & spicy peppers, marinated fennel: creamy and rich, the sweet and spicy pepper sauce was just the acidic kick the ravoli needed to balance perfectly.  \n\nSheep's Milk Gnudi, pork ragôut, baby kale, grilled scallions, orange sea salt, extra virgin olive oil: gnudi is an all-time favorite and the pork ragout was incredibly tender, a gussied up version of BBQ and pasta salad.\n\nWe ended our meal with the milk cake which was moist and sweet and lovely with the last few sips of wine. The thing about Casbah? I always leave wanting more, which always keeps me coming back.", "business_id": "2SwC8wqpZC4B9iFVTgYT9A", "stars": 5, "date": "2015-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "2UC3rwRm6swuNFt_GhKOhw", "review_id": "TqZFm2zS3nzCFItxlV0nWQ", "text": "I went here for Bluegrass night following Banjo Night at the nearby Elks Club. What a fun night!!! It is a very fun, friendly, music-loving environment. I believe this happens every Wednesday, so definitely check it out! I will be back for sure!", "business_id": "YRDKsBFYP7G0E8BLJKIkvA", "stars": 5, "date": "2014-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rwhOoAM7lfcwKufFXc8NNA", "review_id": "O1TaG_wwZA1XvsRAkbDeiA", "text": "I have a confession to make........the thing I like most about Max's is their bread!!! They are free....they are fresh made....hot and soft...different kinds....and so so delicious!\nI'm not a big fan of German food, but it's just my personal taste. The portions are large and atmosphere is very relaxing and casual. I like it.", "business_id": "IxQ1ATP_Wg_QujO9nywzcQ", "stars": 4, "date": "2013-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RjpL0PplcJcuLvAOG35iVw", "review_id": "UMHgIUvBDzjWUXAIsIk4fA", "text": "I stopped by Max's with some friends during the Deutschtown Music Festival. The place was packed, but we were quickly greeted and did not have to wait long for a table to open up. A quick look at the menu let us know that prices were very fair.\n\nWe tried the sausage and cheese sampler appetizer and it was simplicity at it's finest - fresh, delicious sausage, rich cheeses, and an excellent mustard for dipping. I was really impressed with how such a simple appetizer could convey the quality of their food so well. Delicious!\n\nThe entrees were equally as tasty. I tried a turkey reuben which came on a potato pancake. Obviously, this particular entree was not the most traditional German faire, but, once you took a bite, there was no going back. A variety of sides were available; I tried the spaetzle - also very simple, but delicious.\n\nOverall, this is a great place - cozy vibe, excellent German food (both traditional and more adventurous), and quick, friendly service. My only regret is not having room to try their tempting desserts. We don't get to the Deutschtown neighborhood often, but we will have to make it a point to go back for Max's Allegheny Tavern.", "business_id": "IxQ1ATP_Wg_QujO9nywzcQ", "stars": 4, "date": "2015-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "bvu13GyOUwhEjPum2xjiqQ", "review_id": "-xE4r49FwgZQCxP-Ih8_SQ", "text": "Whenever I'm in Bado's I'm reminded of Nemo's, the fictional pizza joint from Everybody Loves Raymond. My first expierence with this place was two years ago, I had spent the entire day in the waiting room of St. Clair Hospital with my mother who was admitted finally at 8pm, she was fine and released a few days later. But at 8pm I was ready to eat anything and Bado's was on the way home. So I parked and walked I'm and the place was packed. Good sign. So a seat at the bar opened and the Pens were playing. So I ordered a bottled IPA and read over the menu. I needed to power carb after a long day of sitting in a hospital waiting room. The bartender who doubled as a pizza chef told me the white pizza was exceptional, so I took his advice and ordered a medium, figuring I could have it for lunch the next day. What arrived was this wonderfully thick, cheesy, reeking of garlic in a good way, just what I needed, comfort food that instantly made the days worries seem distant. The first bite was heaven, chewy center, crisp bottom, olive oil coating my mouth, ooey, gooey italian cheeses, saltiness from the black olives I ordered as a topping. This was pizza! Two slices and I was full, I drank my beer and paid the bill, and walked out with lunch and dinner for the next day. I must return here someday and have the same pie.", "business_id": "qemCNgjeYGcFsRwxW9x4xw", "stars": 3, "date": "2010-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RjkOUl0iLgHkZd9bVx-BZA", "review_id": "2q_SwqXDvHyxpcaw2NjvCw", "text": "good selection of beers*, but the food is appalling. sysco-truk curly fries and run-of-the-mill hotdogs that don't even have natural casings. puh-leez. if you're gonna put \"dogz\" in the name of your restaurant at least try to serve something better than what you can get on sale at giant eagle. \n\nno joke: I prefer the O. their fries are made out of potatoes and their dogs have real casings. \n\n* and by \"good\" I mean \"good for PA\" where liquor laws are an absurd kafkaesque mess and a lindeman's geuze is about as interesting as it gets (for like $15, natch)", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 2, "date": "2010-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "4tzuxIVry4xkOR9vbpgjrw", "review_id": "rm0UqrJ9UtQszNZVGcgd6Q", "text": "\"Meh\" is kind of how I felt about this place, which I realize is an opinion that seems to go against the grain. I had heard about D's time and time again. Everyone talked about it like it was the greatest place in existence. I had such high expectations! \n\nI suppose maybe I was expecting too much, which led to some disappointment. A few friends and I went here on a Friday night and it was (predictably) packed. We were fairly lucky to get a table almost right away. \n\nI obviously had to acknowledge that the beer selection is impressive. If you can't find it here, you probably can't find it anywhere in Pittsburgh. I had to check out the famous \"Beer Cave\" which seemed to have just about everything. I think I'll make it a point to pick up some brews here next time I'm looking for something unusual or new.\n\nI wish I had more to say, but I just wasn't feeling it. My friends love it so I'm sure I'll be back, and next time I'll make it a point to try the food. Judging by some of the other reviews, that might change my perception of the place.", "business_id": "2X5G4Ujq0s4Wfn4TC7gX0g", "stars": 3, "date": "2014-06-05", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "GIaeFlCLanx17w8rBQAJ5g", "review_id": "R61Lg6eSu0VnaJ7s2S-baw", "text": "Huge, huge \"battleship\" sandwich w Italian meats + bologna, exotic malt liquors, craftsmanship, and a barred window entrance hiding it's charm. Great experience.", "business_id": "DzOPHyrG2XuVqKEvHCnN7w", "stars": 4, "date": "2010-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1oRYv4Q4odLvEtbNGSaTMA", "review_id": "1w5zhjzm5ExyRx48JunW4Q", "text": "Was looking forward to early dinner. Went around 3pm ordered 2 for 25.  I got my salad it was soggy & lettuce was brown only 1 black olive.  Server did offer to bring me soup.  Seemed like left over from lunch rush.  Then breadsticks cold & hard, did bring new ones they were better. Meal was ok large portion.  Dessert you share Really? One more piece would hurt the bottom line.  Was all around disappointed! The one in robinson much better.", "business_id": "zpNGtjBlIkDq_PLGSCPlAg", "stars": 2, "date": "2014-06-29", "type": "review"}
{"votes": {"funny": 3, "useful": 0, "cool": 0}, "user_id": "2VqU7uoDeiE8OUL14Ce5Ig", "review_id": "51EnTMjvjTtIZ3vqIwT6Rw", "text": "Sooo blacked out here that\nWe heckled the guitarist.\nNot sorry. He sucked.", "business_id": "OxIeMVcop5oxBUWANi-1Rw", "stars": 4, "date": "2011-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rjixZ_kurSRdhphHaEpDdw", "review_id": "IoDOy-olpZqikIdCos6yXw", "text": "Beautiful night on the patio enjoying a crab pesto pizza.  Crispy crust and delicious. My companion had the chicken and artichoke pizza which she enjoyed.  Service is very good.  I have the Lemon Ice martini which is very good as well.  A great experience overall.", "business_id": "OxIeMVcop5oxBUWANi-1Rw", "stars": 4, "date": "2015-06-05", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "tAKjY3bQXH51msJbOHYPmQ", "review_id": "sBp0khZdSo6wnf90AFhwNQ", "text": "After a work happy hour a few doors away, several of us were looking for a place to eat, and were having a hard time deciding. I was the pain in the tukkhas, since I'd driven my antique car, and kind of needed to be able to park it where I could see it, plus, I'd really planned the evening to be a birthday dinner for one of the co-workers. We decided to split up, and me and the birthday girl go somewhere, and the rest would hit something within walking distance. Then as Birthday girl and I got to my car, we realized we were parked in front of a restaurant, and Mahoney's won out by default.\n\nWe should have gotten in the car and driven somewhere else.\n\nThe atmosphere was pleasant enough, but the food...yeesh.\n\nEveryone placed their orders, mostly sandwiches of one variety of another, sided with fries, plain or sweet potato, or slaw. I ordered the Reuben hoping for the best, but definitely not receiving it.\n\nMichael's chicken breast with plain fries arrived with sweet potato fries, and instead of just bringing him a side of regular fries, they took the whole plate back to make the switch. Kim's turkey Rachel arrived, and as it was handed in her direction, half of the stuffing fell off the plate and onto the floor. The server took the plate back to the kitchen so that Rachel could be re-stuffed, and for the rest of the evening her initial guts laid right there on the floor. Kim #2 had a fried fish sandwich, which looked a little withered, and then there was my Reuben. More like an Ewwwwww-ben.\n\nThe bread was dry as chalk, and the corned beef had been so overdone, it looked like bacon sticking out of the bread. Dry, dry, dry...and I took maybe two bites of the slaw, and that was quite enough.\n\nThe prices aren't steep, but seriously people, take some pride in what you're handing off to a customer. Would YOU eat that?? Seriously, put that order down on the counter in front of you...and take one minute to LOOK at it...then make one exactly like it for yourself. Are you gonna eat that? If not, um, why would we want to pay for it?\n\nThe service was pleasant enough, and the atmosphere was comfortable enough for nice conversation. But would I go back? Nope. The food, my reason for going to a restaurant, was dreck.\n\nMy apologies to my co-workers for forcing them to try it along with me.", "business_id": "-nfzEVOVvmDSFbxvBsllGQ", "stars": 1, "date": "2013-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9_Kb_GeICcVb3mnAKyskiw", "review_id": "DfeXGTA4vRs5A7OhkAWKfg", "text": "Well to be honest this was one of the worst dinning experiences of my eating career. We sat outside and the service was VERY SLOW. Then my purse gets stolen right from my hand by what I can only describe as a gang of thugs. As if that wasn't bad enough the slow wait staff took about ten minutes to call the police and then proceeded to charge us for our mediocre meals even as they saw me telling the police how my wallet had been stolen under the waitstaffs not so watchful eye. Save your money and your wallet and go to wendy's the quality is far superior to this place.", "business_id": "-Nanlb7SYXObqQ6dZ49UOg", "stars": 1, "date": "2013-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0chBNHPnDsDkvQF3R2743w", "review_id": "lSokT6xI5gRK_NyU40cSTw", "text": "The menu is a problem, everything on it sounds so good!\nLast night, after much deliberation over a couple of pints of the amazing Ithaca Apricot Wheat beer, I opted for the Bleu Burger. A burger stuffed with blue cheese and mashed olives. It was outstanding. Like when you wake up craving the food you ate last night, that good.\nCan't wait to go back and try the rest of the menu.", "business_id": "3zgswf_NfBJpeAoWeTkgMA", "stars": 4, "date": "2015-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "CdADj4ngvz4B1qCU0COCOA", "review_id": "97VBtDJgeVkyyoZAQBh6vw", "text": "Great beer selection, will def come back.", "business_id": "jJfTh2O3M2Q716akd9Dr9w", "stars": 5, "date": "2013-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6-bDIcHbw9-6GPSXk8nevg", "review_id": "viXRznRAo3KvELIwm7rU7A", "text": "Harris is awesome. My friends and I come almost every Tuesday for bacon night. A dollar for a basket of bacon unless you're at the bar, where it's free. The menu is hysterical and will make you laugh all the way through and the drinks are delicious. Definitely a must for anyone who's never been. You'll just want to keep coming back", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 4, "date": "2011-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6bHvullafqeGCYMoR6xlhg", "review_id": "A2XMuxxqkqWagRhGwa9QJQ", "text": "I don't understand why this place is so popular.  I've been there 4 times and each time the food was pretty gross.  Most recently, I ordered a Del Monico sandwich and the thing was dripping with oil.  The beer list is decent.", "business_id": "rgmptwPbBH1wLpiBHcbIhA", "stars": 2, "date": "2013-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hWp_nTaQr-CJFuXlHd9beg", "review_id": "2N-Z-U4N5oeqgjrZ8gw1GQ", "text": "Great food and normally great atmosphere, but today thus music was the nastiest hardcore rap that was just offensive. How many F-bombs can you realistically listen to while eating lunch and watching sports. Dropped 2 stars from what I would last night whenit used to be my favorite place in shadyside.", "business_id": "vSZDiKiF8vf9zt_BcDL7GQ", "stars": 2, "date": "2011-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cmuOdV5XGC4h31ctrXlmdg", "review_id": "FVRAm8XMx3HYDeGYp1fObg", "text": "Should be called crappys. So disappointed in food and its cost. The area and patio earned these 2 stars..", "business_id": "DkX3YoxhH4uADsgVgQThew", "stars": 2, "date": "2015-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "ukrBUZXE5K1J57FI7ve_RQ", "review_id": "KGLGjhXLZvZUIXiFozboAQ", "text": "My dad wanted to go to this place because he saw it on TV. I grew up on in dive bars plopped on stools next to my grandfather as he drank Budweisers. Thus we felt at home.\n\nThis is a dive bar. A real dive bar, not some phony hipster bar pretending to be a dive bar. Yes, its grimy, yes there will be people shaking from acute withdrawal sitting near you. If you have never been to a dive, or are not sure you have been to a dive, you might want to try somewhere else.\n\nBudweisers are 2.25, food is cheap and comes in huge portions. Pierogies are gargantuan, the fish sandwich is even bigger. Standard bar food on the menu with a few nice Polish selections. Service is nonchalant yet friendly enough. An elderly woman in the back does all the cooking by herself. She is awesome.", "business_id": "ufyh6h4GsR-RYY2lC_Iz7w", "stars": 3, "date": "2012-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rgG0JvRxnQjUjQzUn18fHA", "review_id": "3k7vBgA8p8v3AQ-muephpQ", "text": "My mother wanted to take my wife and I out to dinner for my wife's B-day, we were a party of eight, we were assigned two waitresses that had a difficult time getting on the same page. Wrong order, wrong drink refills, and it took 1:49 from the time we placed our order until the food reached the table. A member of our party stated a food allergy, he had to order twice and still received food that contained his stated allergy. Upon notifying the manager we were told not to worry the check was taken care of and he apologized. He suggested we dessert as well, which took another 34 minutes, and arrived with the check. Upon leaving we had to walk by the rear of the building were the waitress and manager were talking and over heard her complaining about us, when confronted the manager apologized again and returned inside. Needless to say we will not return to this location again, and I would suggest that you do the same. We were not the only ones with a grievance as several other \npatrons were given gift cards and comped bills.", "business_id": "4WsTFTH8GgnyFHwrH9nHzA", "stars": 1, "date": "2012-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_yrXRYzrBPyvYL-DAwxUzg", "review_id": "hKSsdN793u2gsX8MvssN9Q", "text": "This place is great for a chill dinner and drinks. A very laid back atmosphere makes it perfect for dinner before heading out or just relaxing all night. It has a bar atmosphere without the crazy drunks and extremely loud crowd. The food isn't 5 star, but you can never go wrong with Fried Pickles and the What It Is. YUM!", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 4, "date": "2010-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E1Wu-YuaNJWgQqSIsW8K5Q", "review_id": "ppQUFo9awP3p-wnzKQ1_bQ", "text": "Great sandwich.", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 4, "date": "2013-06-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "QG_xAsQiuLe4bOOpds3x5g", "review_id": "qJYQyyOdjO7UnrstHRICXw", "text": "Hmmm..... where to start with this one. I'll go with atmosphere, which was the good part. Cool sports bar, pool tables and ample flat screens. Now for the not so good. Our bartender was a disaster- I rarely will ever say that, I used to be one myself and understand that sometimes you can get overwhelmed, or whatever other benefit of the doubt I normally give. But this was pretty bad. We sat at the bar with only a handful of other people, so it's not even like it was busy. We told her were were going to eat and needed menus. My finacee asked for a Sunset Wheat beer, which was on tap. We weren't paying attention to her as she poured, but once he sipped the beer he immediately knew it was a Sam Adams. OK, mistake. But when we looked over at the taps, the two were no where near each other. We flagged here down when she returned to the bar (she kept disappearing) and she apologized, went to pour the correct beer and only got a half a glass out of it. Just a minute, she promised. \n\nLiterally, like 15 minutes later, she finally came back but then ran off again before we could tell her we were ready to put in our food order. We were starving! We finally flagged here down and placed the order. Good thing we ordered when we did, because the food took forever to come out!! By the time we got it we were SO hungry. I ordered the Mahi Mahi over rice, and I wouldn't have finished it if I wasn't starving - the Mahi was really dry, and they added so much spice to the dish that whatever flavor was there was killed. Granted, it is a sports bar, but I've worked in Sports bars before that served amazing fish dishes. If it's not going to be good, it shouldn't be on the menu. After flagging the bartender down (again), we finally got our bill and decided that we definitely would not be back to eat, but maybe just for drinks.", "business_id": "-6JY1T0w4XETux5kGOj84g", "stars": 2, "date": "2008-08-04", "type": "review"}
{"votes": {"funny": 2, "useful": 6, "cool": 2}, "user_id": "3kK-SQ-OGXfhJyJHAlaHCg", "review_id": "rrnMM7FC_PA562yUc-eIAw", "text": "Went in to meet some friends who'd come in from out of town.  Lovely place, admittedly - the restoration after the fire is impressive.  When we arrived, the hostess, when she finally quit talking on her phone, couldn't find our reservation and seemed pretty snotty about it.  We went upstairs, found our people, and spent the next two hours trying to get the attention of the bartenders, to little avail.  The music was too loud for conversation.\n\nSummary: VERY noisy, terrible service.  I'd tell you about the food, but the food we ordered never arrived.  Wild dogs couldn't drag me back.", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 1, "date": "2010-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-XltGYLa9bp_xGE--3uIUg", "review_id": "wIDZpxC1c5UMr7Gv5PeIpg", "text": "I visited here last year and had the time of my life. Talked to one of the best waitresses in the world, Mairead. She's from Cork, as is my father's grandfather. (Yes, I was wearing a red shirt for Cork!)\n\nIf you have any appreciation for the Irish and our wonderful food, you owe it to yourself to visit.", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 5, "date": "2013-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8bwVOeK3Zylt6PnKf-KNnw", "review_id": "s5h13PVnMTXVQKuJZR38Xw", "text": "Our favorite Irish Pub!!  Amazing Food!!  Potato Cakes, spinach and artichoke dip and Fish and Chips!!  Great date night!! All amazing!! Great for live bands when you can catch them!!", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 5, "date": "2015-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mHGxSFGMYj4uDap-fcAvaw", "review_id": "KYoFzZzub8Fq_9fCN3h8XA", "text": "The waitress was awesome. Thanks Victory for telling us your secrets. Rock bottom is a really good chain. the difference is in the service when visiting one of these places.", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 4, "date": "2013-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JA97X6jGqCNDmBS8Dud_Vg", "review_id": "g-IYGZ3WLwZaIw_DJe9roQ", "text": "Would have given 5 stars for the food, but the air seemed to be broken and the service was extremely slow. Half the time our drinks were empty. Our appetizer didn't come out until our food did... So what was the point in an app??? If you can stand sweating the whole time and being thirsty then come eat here because the food is amazing.", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 2, "date": "2015-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "DBWAOaJTnw33rEyDE-ygmA", "review_id": "BE-K8QXI7TOsbCKRpykf6w", "text": "If the star rating could go into the negative, this place would get -1000. The good reviews you see on here most likely can be from employees and vendors. What happened to me and a buddy this past Saturday is something I am pursuing thru legal channels. Dont make a good night go horrific by going in here and getting scammed by the whole staff. They are all in on it and will take you for thousands or tens of thousands. IF YOU GO IN, take a roll of quarters, a exorcist , and not your credit cards. So far managment has agreed to reverse $3400.00 in charges. I am awaiting the other $800.00. They (staff and bouncer) were refusing to let me leave and all I wanted to do was settle a bar tab . A 35$ dance can end up being thousands or whatever number the dancers say , they can do what they want to put on it to scam you and skin you alive. The manager did say \" that's not how we roll and I have reversed the $3400.00 in charges\". They roll people alright.Just because you go in there and have been drinking and they see that, they have a responsibility to make sure you are okay and cognizant. If you aren't and I was not ;that does NOT give them the right to commit fraud and thievery .  I have contacted my attorney and we are meeting with the District Attorney and Channel 9 is weighing in as well. What they are doing is not right and needs to stop immediately. Charlotte does not need to be represented that way to business travelers , much less their own citizens . The explanation I was given was that dancers are in business for themselves (independent contractors) . Well then, the staff there must be \" on the take\" for we were told we could not leave and the bouncer and bartender were right there and I am sure they dont work independent of the club. \nDo yourself a favor and either throw yourself in front of oncoming traffic because you'll pay less at a hospital. I can go on and on but it looks like Action 9 and the District Attorney's office want to look seriously into this matter . This place is a skid mark on Charlotte's underwear. Well, Mr. \" Shout it Out\" is here to help clean this nasty stain. Charlotte Police said to call 911 if you ever have a dispute and don't sign any receipts and call them immediately.", "business_id": "qxaoJ2cd7-cvEPTmSgBAyA", "stars": 1, "date": "2015-06-02", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "sALB8-F04S9VcZMF_GkGUA", "review_id": "83mvmejh8AFQnpcWrdRVOw", "text": "As far as a steakhouse.. eh..had much better..but I do love the bar.. the apps.. this is one of the places that I hang out with my Nascar buddies.. the bartenders are always on top of things..fun and on the ball. A great wine selection.. Food: I always try the filet..and usually Im disappointed.. 3x to be exact.. they cant seem to cook it correctly! I love the spinach salad.. and again, for 'hang time' ambience.. this is the place to start!", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 3, "date": "2009-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yR04yrpjBf1BH5mTnG54ZQ", "review_id": "cPkQrlXmxcImkp-YvBHLEQ", "text": "Pricey but in a great location with great views. Their food is always very-very good (though, in that area, nothing beats Ruth's Chris). What sets them apart from many others is their calamari (has a Thai red pepper-type sauce on it). It's mouth-watering and amazing. You must get it when you go here. I suggest reservations - it's definitely one of the more popular upscale restaurants. They offer a great brunch too.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 4, "date": "2013-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ETCwKbo2RBSDoLtIGW96eg", "review_id": "-E4mLKND47jJpe3zuph2Sg", "text": "The Capital Grille... I'm a fan. \n\nThe menu is one of a basic steakhouse (salads, soups, steaks, seafood). Their appetizers are well made, I particularly like their blue wedge salad, but their onion soup is a close second. On the menu for the second course you have to get one of their signature dishes (Kona crusted sirloin or the Porcini crusted Delmonico with aged balsamic - my all time favorite!)\n\nDrinks and cocktails are good and they have a good wine list. Their desserts are nothing out of this world (but I'm not a dessert guy). The service is clean and proper.\n\nGood place to begin night on the town in uptown Charlotte.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 4, "date": "2014-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hBFZG9bCkrTY7liDKH8Thg", "review_id": "Ov1jkt1S7hfVBGBZ2lJbzQ", "text": "Very cool place to relax and enjoy a good drink.  It wasn't too crowded the night I was there so we had the \"library\" room to ourselves and the service was excellent.", "business_id": "7BVCmaxhvXgEpx7J-SQ4QA", "stars": 4, "date": "2010-06-22", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "2anacZ4aIpnTuPOo4R6wYw", "review_id": "bgwVAFqurLmhVBXodGTutA", "text": "I stumbled into this place on a Monday night while I was attending a conference alone.  I had been wandering around looking for something with good food but not too pretentious.  I scanned the menu and went into Cosmos.  Since it was Monday it was not crowded and the wait staff was very attentive.  I ordered the Greek Salad to start and it was amazing.  The tomatoes were huge and plentiful (a requirement for me), the dressing was brilliant and the presentation was very nice.  \n\nI know this is a pizza place but I am on a no bread diet so I ordered the Chicken Paillard.  again, this was out of this world.  The chicken was cooked perfectly, the potatoes were excellent, the sauce was mouth watering and the side of spinach was so well done.  I made a point of complimenting the chef to the waitress.  No dessert for me but I promised to give a great review of the place and then forgot to do it until now.\n\nI would go back if I am ever in Charlotte again.", "business_id": "e5J3s-xxs1S6PPHJhldBEA", "stars": 4, "date": "2010-07-22", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 2}, "user_id": "lpZtfD-vCqUER1yGKEvUPw", "review_id": "iEJcyokRCgeHQdo12Etjhg", "text": "I vacillated between 3 and 4 stars for the Breakfast Club...but, ultimately, is you're having a) bachelorette bar crawl, b) an '80s night of any kind or c) it's super late and you're jonesin' for some Michael Jackson tunes...Breakfast Club nicely fills the void. \n\nI don't go clubbing. I really don't. Because my alcohol tolerance is (now) that of a 65 year old, sometimes it's just better that I have a drink or two and get home by midnight. Therefore, I'm not going to compare Breakfast Club to any other club in CLT. Plus, it would be unfair. \n\nThe pros: Fantastic '80s music and videos. Plenty of space to dance. The venue is incredibly unique, kitsch-ly decorated and BIG. A really great place to bring a bunch of guys or girls and celebrate a fun decade. \n\nThe cons: Some other guests can be overly drunk and, therefore, douchy. Drinks are expensive for what they are. I recall paying $8 for the tiniest of tiny rail vodka soda. The cover can be high. \n\nIf you're bopping around the Charlotte club scene, bar scene or you're just looking to try something different, Breakfast Club is a must visit...even if just once per year!", "business_id": "Zw-sWBbL3Z9zyZ0ri9UT_g", "stars": 4, "date": "2011-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mr96SkgojI_UYvbtKhf1VQ", "review_id": "CKP0a_z1vxkpeoP4ht5SWw", "text": "Four of us had a fabulous dinner and a wonderful time.  Staff from valets to management were perfectly hospitable.  Impeccable service.  When the manager came by to chat with us, I mentioned that we were celebrating our 40th wedding anniversary, and later he sent a complimentary bottle of champagne with our desserts.  They impressed me by stocking Plymouth martini gin.  The lamb tagines were outstanding.  Calamari the best our son ever had.  Delicious sea scallops and excellent Mediterranean sampler platter.  The lemon tart and mille-feuilles desserts were perfect.  (Didn't care for the Corsican cheesecake, though).  Don't look at the bottom of the bill--just enjoy, and sign.  it's worth it.", "business_id": "eaqJQP6bp7rQJQt5KqfvxQ", "stars": 5, "date": "2011-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "71Gnwsn6XGae6n1PEu72ng", "review_id": "SvSYr2nKA0R6wcNtRjpIfA", "text": "Love this place. Very 1920's cinema feel to it.  Not row seating, but cinema seating.  Think Vegas lounge lizards...with an area for front row standups about 6 people deep. \nBe sure to check out \"The Noises 10\" here. A great local band that seems to place here 6-8 times a year.", "business_id": "eNIDbboNe7W_rAnNHoveEA", "stars": 5, "date": "2007-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "f1HF1i8M7x0Lific1e2I_w", "review_id": "7eQJOOg0TzNJfv6Ko-dzPw", "text": "It looks like a small house in the middle of the community college area of downtown Charlotte. In fact, it's the best live music joint in the whole city. They have great shows, but if you really want the local experience, go on a Monday night to see the Monday Night All Stars. They play whatever the hell they want and it's always amazing.\n\nGreat bartenders. Cheap beer. Pool and foosball. This is a place where you'll see folks of all ages, races, and walks of life dancing together.", "business_id": "Q76FbDBBw4Mm3RZ34cpZfg", "stars": 5, "date": "2015-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "zG4Kkbumn02cnspYaKPeYw", "review_id": "Z7NYtoEuWAWkX_rLIT-ttw", "text": "I had a great dinner here tonight! My party dined on the fried pickle chips, the chicken étouffée, the chicken creole, the bourbon pecan pie, and the oreo cookie cheesecake. Oh we also had the Peach Aloha and Hurricane to drink. Everything was great! We cleaned all of our plates and enjoyed the atmosphere. The set up was nice, albeit a tad cramped upstairs. At times it was a little hard to talk amongst ourselves with the band playing, but this was not a deal breaker because the band took plenty of breaks so that everyone could eat, talk, and relax in peace. I can't wait to go back!", "business_id": "jTGQUWGIVvL-aY03C5BEmw", "stars": 4, "date": "2012-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GrA3BLjRjAKvFYwSqN_4cg", "review_id": "QHEeh7OhkYPEFQIHvgwLnQ", "text": "I hadn't been here for dinner in years. Brunch in a few years as well. I don't know why I haven't been here more recently. Great service and the food was fantastic. I had the shrimp/chicken Diane with a salad. I think what would have made the dish even better was a little char on the chicken/shrimp. We sat on the outside patio and it was a perfect night for this weather wise. The servers were attentive and did a great job with the flow of our dinner.", "business_id": "jTGQUWGIVvL-aY03C5BEmw", "stars": 4, "date": "2014-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L6wv8sek7qi7ncvrEGQc5Q", "review_id": "SMFD4CBaMOH-HyaKhGAktA", "text": "I ordered the Crawfish Étouffée, which I found disappointing. The roux was slightly burnt and very bland. My husband ordered the Gumbo and Diane. Diane he stated was ok, but the Gumbo was a disappointment. Based on first impressions, these dishes are not a due over.", "business_id": "jTGQUWGIVvL-aY03C5BEmw", "stars": 2, "date": "2015-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5VID39LpZ0-XWiiwVB21Hw", "review_id": "fvT1PzMuq_GE9wb0pDa5NA", "text": "Coyote Joes is a WONDERFUL place to enjoy your night and have a good time weather you are into country music or not. There is a live band that is absolutely phenomenal. They play mostly country music but some rock and roll as well. Drinks are VERY reasonable and the staff is kind and friendly!! \n\nBring cash. Tip the bartender. They are great.\n\nThe band members truly love their jobs and they show it. Thank them for your good time, they're the ones who keep ya going! This place has dancing, corn hole, pool, bull riding, great bar (several), live music and a fantastic atmosphere. HAVE A GREAT TIME!", "business_id": "76lSMjkrbLxTWeylGZvjhw", "stars": 5, "date": "2012-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "wGWFzdgnSEe7C6UjoW8Q3g", "review_id": "_TB2OPnKC4zwJc8NQpWy4A", "text": "The first couple times I came here, I had no idea it was a chain. Then one day I was passing through Raleigh and there was another one. Chain or not, The Flying Saucer is a fine establishment for beer drinkers. With a beer selection that appears to approach national debt numbers, it's pretty tough to not find a beer you are interested in. The food is so-so but really, who cares. Knock back a few of your favorites and that soft pretzel with cheese and mustard to dip it in tastes like a gourmet feast. Just for kicks, join the UFO club and after you consume enough beers, you get a personalized plate on the wall or ceiling or wherever there's room these days. \n\nMy one complaint?  Too far from home.", "business_id": "F-e-sWfVd3eCYll3BP1QFA", "stars": 5, "date": "2011-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "M_fxV_d1i6Uu9FlmFf9BcA", "review_id": "9yC51j9HeM7USYn0iRabcA", "text": "Really hate to do it- but last night was pretty awful here. On any normal day you seem to get by with the average slip here or two, which is always amended right away, but this really took the cake. \n\nGlass night- Monty Python goblet. Knew what kind of turn out they were going to have so we made it a point to get there 30mins early. Even with getting there this early, we literally only had one table in the back open. Packed house. \n\nOur waitress, Amanda, came over and took our order right away for the glasses. We had no reason to believe we wouldn't get them as it was roughly 6:40 at this point. Right at 7, glasses were given out to a few tables around us. We sat. And sat. And sat. Finally she came out to tell us we wouldn't be getting ours due to the fact they had only received half the shipment. I'll circle back to this later.\n\nShe also said the manager would come out and speak with us and that we had a free beer on them. Well long story short the manager never came to speak with us and the free beer was only limited to house brews, so if you were trying to pick away at your UFO club with 100+ brews tasted already, that didn't sound like it was happening either.\n\nThe thing that REALLY aggravated me was that the manager, who I didn't know until she was pointed out last night, came around to 5 other tables in the back area and apologized for the mishap. Every table BUT ours! She walked back up front and never came back!\n\nThe entire experience was fairly upsetting for being an avid fan of this place. If what was told to us was true, Amanda did a good job of handling herself, I'm sure that night was a mess for any waitress. As far as management is concerned, yeah, I am still pretty pissed off.\n\nAnd as per the glasses, which is whatever really, when you know your frequent customers see them out on the shelves on Monday, I would use a better excuse than \"we didn't know we only had half the shipment\", that is just pretty lame. Not to mention who doesn't inventory when they initially receive items??", "business_id": "F-e-sWfVd3eCYll3BP1QFA", "stars": 2, "date": "2013-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4vDXWFNYV1_i4JIGihSxjQ", "review_id": "G58yeWvGu3_OkijtNoIcUQ", "text": "Love going to this place. Excellent burgers and wings. Make sure to get the wings charred. Service was great especially by Jordan and Kaitlin, they went above and beyond to make sure our drinks were filled and our food was good. Go here if your looking for great food, awesome atmosphere and great service. Will certainly try to go here every week if I could!", "business_id": "r-pBY6vR_Iu5XhPRvPnquw", "stars": 5, "date": "2013-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1WJYPcpbnZgmpsWI7BFdyQ", "review_id": "Ec7ukepx3PehZ6mQM8jb-w", "text": "First impression, the hostess was nice, if not unprofessional looking. The manager was also extremely unprofessional looking. The restaurant was not clean, sticky tables and dirty looking floors. Our waitress was nice enough, but service was extremely slow. The plus side, the food was so good! Had southwest egg rolls, chipotle honey no less wings, and onions rings! All was so good! My husband had buffalo chicken tenders and Texas fries, he enjoyed all! The new pay at the table kiosk was neat and made leaving quicker and easier! Overall, good experience.", "business_id": "i-cEO98lTS10WH30FyKvGA", "stars": 4, "date": "2015-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-EULmUIxlzRPNdAFC4i3JQ", "review_id": "pudG1q5Z6bq2VgBn-JaK4g", "text": "I....am a wine snob. So having said that, I love this little wine boutique. Very comfortable and inviting interior. Comfortable patio area for nice days. A very good selection of wines from all price and taste ranges. Daily varied offerings of wine by the glass or you can hunt through their wine walls for a bottle of your choosing. A little chilled something available for the beer and bubbly drinkers. Great location and atmosphere.", "business_id": "1wIKHSHPOkywuOkyrXt6dw", "stars": 5, "date": "2011-07-01", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "UgT4W0_TXk1c-ei-Cm0f0A", "review_id": "qZvS06IS4NFyxT7hZmx7FQ", "text": "Food was great.  Hot fresh loved it!  Great beer selection.  Older white bar tender with glasses has a very crass vocabulary.  Will go back when he is not there. Other bartender was awesome.", "business_id": "3xdV-7di_YD3MVqs3Pa7-g", "stars": 4, "date": "2014-07-31", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "20ugCO0X45aww6IuP66tRA", "review_id": "ShB6XIXpHDfw6idbrNzIkQ", "text": "First, the view of Lake Wylie is amazing! The decor leaves a bit to be desired, I can't quite tell if it's trying to be dive, trying to be kitchy, or if it's going for a wild west theme... but it's a bit confusing and the ambiance is only so-so. I went with a group of 13 for lunch and I think our bunch overwhelmed the lunch kitchen staff and servers. Service was friendly but pretty slow. We ordered to appetizers and the only options seemed to be fried or fried... so I had to pass on the appetizers. I ordered a spinach strawberry salad that was mediocre, but nothing super special. I feel lke T-Bones is a great place to boat up to and get a beer/burger \n... but I probably won't suggest it for a group lunch in the future. I would like to try it for dinner on a weekend, my guess is this place is a lot more fun on Saturday evenings!", "business_id": "Zc2IwSzGY63zkyhfNrr7HA", "stars": 3, "date": "2013-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "H7PGXd07GQhq6oc_LqXFdA", "review_id": "rq0ZKVNYjGjmH7mcLXZNAA", "text": "I'll give nearly any business a second chance, but after two of the worst experiences that I've ever had, I am done with this location.  There are plenty of businesses that want your patronage, unfortunately the Landmark us not one of them.", "business_id": "ve8TPUY6IgTsgB3ZHabl-Q", "stars": 1, "date": "2015-07-07", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "uSlKnryLlnD3mvmG6DIyCg", "review_id": "CQh-bhTWVI2xqzcUjjBENA", "text": "At its best the Bristled Boar is a great place to go with friends for an after-work drink or three, and maybe a game of pool or darts or just watch the game.  At its worst it is the epitome of a townie joint.  I've seen both over the last five years.  When I first visited the Boar it was a dive.  My college roommate had a job tending bar and we would from time to time take up his offer of free drinks in return for keeping him company.  The barstools were often filled with the usual regulars, drinking under a thick pall of smoke.  There is a certain charm to dive bars and I'm sure for some the old Boar had it, but not for me.  \n\nFortunately the owner completed renovated the entire bar, and this happened right about the time I moved out to MIddleton.  In place of the dingy walls was stylish wood paneling and tile floors instead of linoleum.  The ceilings were raised and the ventilation was improved, and while it can certainly still get smoky my eyes don't burn anymore.  There is a sand volleyball court out back and bar leagues during the summer.  The jukebox is relatively standard, but there are a few gems tucked in amidst the usual country & hard rock options.  The regular crowd is still around, but a good deal more young people can be found at the Boar these days.  Some nights are vibrant and fun, some not so much.  I can't say that I've tried much of the food.  I know from my old roommate that there is a small grill in back, which was added during the renovation.  The Emil's pizzas are good as always.  All in all the new Boar is a complete improvement over the old one.\n\nThere are still a few things that keep the Boar from being my favorite in Middleton, namely the tap selection.  I am a beer snob and proud of it, so when the only local tap option is Spotted Cow I call foul.  I can't think of another Middleton bar that doesn't have at least one Capital tap, or at least Esser's Best.  What really seals it for me is sometimes the Spotted lines aren't even clean and the beer comes out flat and a bit funky.  Another complaint that I frequently have is some of the bartenders know next to nothing about proper drink mixing.  It is usually the same bartenders that act put upon to even mix a drink as opposed to just grabbing a bottle.  Some of the older bartenders are very good, but you almost have to know the schedule to avoid the others.", "business_id": "c5awCF5eu0ZkxUf_i94uPA", "stars": 3, "date": "2008-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BNjSk71z-sMIq2v6mOk_6A", "review_id": "_Qd-MA1WBcKOh2Jjohilww", "text": "My first Fish Fry!  Yum.  And they make Arnold Palmers too!", "business_id": "6oDZ78JiSKjXVLcurCpnhw", "stars": 4, "date": "2010-07-22", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "S2sR5g_eU__Cr02fycB1PQ", "review_id": "7qjTLGEllVf_41XCy4PP6Q", "text": "Tried to go here twice, both on Friday nights.  They were closed at 9:00 on one Friday night.  The second Friday night, we got there at 6:30 and were told the grill was closed because 'it had to cool down for an hour before they closed.'  So bizarre.\n\nOnce you learn it used to be a carwash, you'll have a hard time imagining it any other way.", "business_id": "NP5ip6oP6O57wjnnEy0P2w", "stars": 1, "date": "2012-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "P6XNh69c0iv_DDUkIdC2gA", "review_id": "pHxwHe_cESsxbYFicxXncA", "text": "Lot's of things going right for this place, as long as you get there at the right time. Great selection of micro brews. Interesting and delicious food. The last time I went in for food and a beer it was lovely. However on previous occasions, I was freezing in winter, or deafened on trivia night. I hope they get a better announcer and a better PA system so customers don't have to suffer through the distortion.", "business_id": "HTplzElel_F_U_qhWuDKdg", "stars": 4, "date": "2012-07-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "tpwXQU2zhsXPz6CywnCrwA", "review_id": "cuQj8BhfW9rzZS_ddsdp5w", "text": "Really good burgers, and cheap drinks.  Typical WI dive bar with good food.", "business_id": "QdSGdvZATzejDkSs435Rdw", "stars": 4, "date": "2015-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "c2VhZXD0DwBgyuYg1orDfQ", "review_id": "t2z17OB-ANvBdV8t1wP4yA", "text": "Karaoke on Tuesday night is so fun! i love this unpretentious, accepting place. The drinks are well priced.", "business_id": "-4PHmmCt_RmAfaE3sDKW_g", "stars": 5, "date": "2014-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "YVsDQFI2mBzTxFnDsGDmHg", "review_id": "GmfW_Tnrs-cQVxxCKZL7WA", "text": "My husband and I are new to the neighborhood. This past Saturday my mom and sister were over to help with some much needed yard work so we took them to the Tip Top for dinner as a thank you. There was a funky yard sale type event happening on their patio that we checked out while waiting for our food. I had the Vedge burger, it was one of the best (if not the best) veggie burger I've ever had. My sister had the gourmet grilled cheese which came with tomato, avocado and pesto...and will probably be what I get on my next visit, it was so awesome. My mom's and husband's sandwiches were equally amazing. The decor and clientele are laid back and funky. With this place being just a stones throw away from our new digs I can definitely see the Tip Top being our go-to neighborhood joint for a great sandwich or relaxing cocktail or beer.", "business_id": "JJFoeKZXgi2_LeECDMkkoQ", "stars": 5, "date": "2015-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0XMC32Lkh6x1Yc9m9sSK0Q", "review_id": "D2x5iuYF8uKi-DL9drob6g", "text": "Bottomless boneless buffalo wings for $10...\nThat's a great deal, but the meat is not that great...\nThe food is good, as can be expected from a national chain.\nI wish Friday's would get away from Jack Daniels sauce.  Jack Daniels is ok for a bar, but STOP putting it on everything.  It's seriously horrible on everything.  Please stop!\nThat being said, I'll come back...  But it won't be my first choice.", "business_id": "ykxf0XiJt-d76dBwfO_yew", "stars": 3, "date": "2015-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TDV2fG_TIVEPO-eYlWpElA", "review_id": "Qb12VIud_tbhJwhIqiPR4w", "text": "Decided to try the fish fry since they have new kitchen cooks and have been advertising it. It was not good. The beer soaked fried cod was 3 round pieces like dog turds. It was not bad. Cole slaw was HORRIBLE in a little cup. You can get waffle fries- about 4 of them, fries, tater tots or sweet potato fries. The worst thing was the \"punk\" waitress. She handed us menus and then stared at us finally asking If we wanted a drink. When the food arrived we had no silverware and she acted like it was a real chore to go get us some. We had to go steal ketchup from another table. When we were half done eating she tried to clear our plates. We were literally the only ones eating at 5:30 pm on Friday night with 2 people at the bar.  No wonder no one was there, she was the worst waitress I have ever encountered. I thought she might have an autism disorder.", "business_id": "yrBo3c3OTKVO4H1ttBxadw", "stars": 2, "date": "2014-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "BcNdlyXsmyYYBMfHq6UFpQ", "review_id": "dQExqD9RGsvMxDFwqje40g", "text": "Say what you will about the smell and atmosphere, I never had a bad time at KAMS.  Ugh the smell - just walk past in the daytime and you wonder why you ever set foot in there at night.  You have to be in the right mindset - to get drunk and have a good time.  If you are in the mood for that, you WILL have a good time.  But if you want to sit back and have a few beers and talk, then go to Murphys or Legends.\n\nSmall dance floor that's crowded when a good hip hop or pop song comes on, but the minute they play country or something slow, it gets empty as can be, til the next good song comes on.  KAMS is always filled with student athletes with the throngs of girls surrounding them.  Drinks are cheap - find a frat guy and he'll buy you drinks all night long in hopes you'll go home with him.  Cheap night out.", "business_id": "RwhUzMEG2tVnZQY9dEuXzw", "stars": 3, "date": "2009-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7JQ8n15WeW4D5AnNulQOCQ", "review_id": "8S4I2v1_zobU1uaOSLsX5Q", "text": "I've been here twice and both times were great experiences for me despite the bad reviews on here.\n\nThis location does get ridiculously packed all the time for some reason.  (Expect at least a 30 minute wait during dinner hours) but after we finally got seated, our service and food was always surprisingly good.  \n\nThe complimentary and delicious bread sticks and salad always came out to our table within 5 minutes, and let's not forget these are endless!  Drinks and food came really quick, surprisingly quick actually considering the huge crowd waiting outside.  Our servers have always been attentive and friendly.\n\nFood is priced very expensive, but I think one knows that before they come here.  If you don't... well then you're in for a surprise.  Everything I've ever ordered though has been delicious and a big enough portion that I have enough for two big meals.  \n\nI don't go here all the time because of the price,  but when I do, the experience has always been great.  Let's not forget that every time I went they were offering complimentary wine, pouring us full glasses of it.  If you don't mind the wait to get seated, I definitely recommend this restaurant.", "business_id": "H0D2HYqLd9MRCq68rtbTyQ", "stars": 5, "date": "2011-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BcNdlyXsmyYYBMfHq6UFpQ", "review_id": "o4gF67X2gAymQP2F62iHdQ", "text": "Aw Murphys, this was the first place I went to when I turned 19 and could get into the bars!  Love this place, totally low-key bar where you just sit, have a few beers and talk with friends.  \"Older\" crowd here too (compared to like Kams or Clybourne - is that still there?)  They also have a juke box, I don't know how many times we loaded Madonna songs :)  On my 21st bday we stayed til close, and they said on the PA \"it's closing time, but we'll let the jukebox keep playing because it's not Madonna\"\n\nFood is pretty good too, we'd go when the bacon cheeseburgers were on special - OMG so yummy and incredibly greasy.  They also have loaded waffle fries that are awesome.", "business_id": "MVH3JOKpQvMTP4jxwBUhkA", "stars": 4, "date": "2009-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SpQVjAfQayqeG2slRX55EQ", "review_id": "2VJA8e4b4LbuhouDvUmbvQ", "text": "I've just moved to Champaign and even though I've only been here a few weeks, this bar makes me feel at home. It has a very laid-back atmosphere, with your combination of students and working adults. If you're hoping to shake your booty on the dance floor, this isn't the place for you. But if you want to sit back with friends and enjoy some non-overpriced beverages, this is the place for you. Even if you go there alone (which is what I do, because I don't know people yet), chances are that you'll meet cool people (provided you're not shy).\n\nThe specials are quite cheap between Sunday and Wednesday. Thursday through Saturday requires a cover, but it's only $1, so can't complain there.\n\nMy only gripe is that the beer garden could use better lighting.", "business_id": "6X7vAFv-Xj1TPcrJK7H2Eg", "stars": 4, "date": "2011-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aSoU3C8Wg5GRs18xNTIPsA", "review_id": "9jYxsT0LZ92L0sJnYvIgwg", "text": "Tons of cute Hooter's girls, but I've been there twice since moving to Champaign and it seems like their wings consistently lack any crunch, even soggy. Everything tastes fine, just missing some texture.", "business_id": "JhEA8qHfNmIh8c6OHXnaYA", "stars": 3, "date": "2014-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ii3jv_y4YDcNSh9x6uuBrA", "review_id": "XCBXxPjuQoAp-PAYvw4v2g", "text": "I had a cheeseburger here, expecting the best burger in Champaign - and it was just okay.  I guess the meat was kind of dry.  Fries were good though, and they gave us soft drinks in the most massive cups ever.   The weirdest part of the experience was the bathrooms, down a decidedly sketchy corridor.  I'd probably try it again, but maybe order a salad next time - they looked really good at the table next to ours.", "business_id": "IUhO58Il7gUEjl1RMEncHA", "stars": 3, "date": "2010-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7SvJ0dXwJbsNhF9rt3Mg6A", "review_id": "vvFEzy44PW3yu4EnSL97wA", "text": "The burger and fries I had at this place were DELICIOUS! I ordered the Motherlode minus the mushrooms with grilled onions added and this burger did not disappoint. The blue cheese sauce they put on the burger was so rich and flavorful, the burger was juicy, and the bun was bread-y sweet goodness! The fries were seasoned very well, but a bit less substantial than I'd have liked (I prefer the medium-cut fries like Five Guys offers), but they give you a lot of them, so that kind of makes up for the thinness.\n\nThe service was good - the servers were very friendly and held conversation with us and kept checking on us while we waited on our food. The only reason I give this place 4/5 and not a perfect 5 is the food took a long time to come out, and when it came out, our buns were cold. This didn't really take away from the burger, but next time I order food, I'll make sure I'm not TOO hungry. Otherwise, I'll order an appetizer or salad prior to my meal so that I will be ok with the longer wait times.", "business_id": "IUhO58Il7gUEjl1RMEncHA", "stars": 4, "date": "2015-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_Y-x3GQDSVHKSigTbSM9VA", "review_id": "bNk1i2IWpX4eYZRdcK3kBQ", "text": "Much better alternative than Kam's and the like. It gets crowded on the weekends and the building is actually pretty nice. I like how it is set up. No more dollar corona nights though...", "business_id": "pA-TU5anRV7T9abf0oTgtA", "stars": 4, "date": "2008-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rQo3lrePdOiNtEs3t8zfQA", "review_id": "RAFfKCgfKbsnu2KYIZ60sA", "text": "Great food & patio", "business_id": "mJxu0USvbwSHcGsmwWh22A", "stars": 3, "date": "2014-06-23", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "oGOlO-Ly9zwYtyOf-OIykw", "review_id": "NWWZafXAfM3HuuvQ-mEiBQ", "text": "You know you're going to have an interesting night when some random dude swipes some of your fries while you're playing pool. ha! Needless to say the first time I went to Esquire there was a bachelor party and it was hilarious to watch the crazy activities. \n\nThe selection of booze is fine, there is even a batch of peanuts to grab and munch on while you're hanging out. I tried their fried broccoli recently, it's soooo addicting. \n\nThe place can be a tad messy, obviously because of the peanuts, and it definitely has a mix of townies and college kids, but it's a pretty fun place to go to for a hang out with friends.", "business_id": "pPWre8lbVAssER6CN0uWMw", "stars": 4, "date": "2011-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pUGA56jZfTtkszfBAVGwKQ", "review_id": "h_Db-u0mZ-8ux-sN27i0oA", "text": "Just your average sports bar. My girlfriend enjoyed the thin crust pizza so that was good enough for me. Pretty large venue with plenty of seating. Friendly service. Very college-like.", "business_id": "6U94ybDpNd0fTL7TIzb5Kg", "stars": 4, "date": "2012-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "brpyJZB4WcUx-Uucdw1y_w", "review_id": "ALg65TvHaRqN11aB3QeRfg", "text": "Food was excellent but did not have a great experience with waitress. Table of 8, we all ordered tasting menu with wine pairings.  Wine came out about 10 min after our food on a few courses which left us unable to experience the \"pairing\" as you should. We politely and discreetly asked her to bring wine out with or right before food and I think that ticked her \noff. After that, she was aloof, barely explained the wine or the dishes we were being served. Water was slow to be refilled. The real kicker was the 20% automatic gratuity she added after tax on our bill! When we asked to speak to the manager, she told us \" he's busy dining with a client\". Say what??? I believe your customers are your priority! We asked a different waiter to see if he could find the manager and low and behold, out he came!  Tainted our experience and maybe our waitress was just having a bad day but when you are dropping that kind of money on dinner- you had better train your wait staff on how to properly serve and deal with customers.  It was a shame because from the chef end- he did a great job of making delicious and interesting food- it's just too bad no one explained it well or delivered it professionally.\n\nJust wanted to post an update. We received a very kind letter from owner/ manager apologizing for our experience and gave us a generous gift certificate to try them again.  We definitely will give them another chance. Again- the food is amazing and we want to see them succeed.", "business_id": "h9xdY1NO4GnNijNChTy-8A", "stars": 2, "date": "2013-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "Y7KS04okqSFAbg1NyImHkQ", "review_id": "upuJ85izvuo-Fkh5wV0S7g", "text": "Two words: Overpriced and understaffed.\n\nI'm not sure if Palazzo is always open \"sometimes\" or just recently reopened, but they've brought back the goth night one Friday a month. Just to clarify-not reviewing that particular dance night, just the establishment itself. \n\nEvery time I have been, the bar has been understaffed. Two for an entire nightclub that is packed? How does that work? It takes forever to get a drink and then it's just generally expensive no matter what you get. There's also a back bar that seems to never be in use. With the amount of people that hang out back there for the majority of the night, you'd think they'd hire a few extra people. \n\nAlso? Maybe invest in some misters for your back bar-it gets ridiculously hot back there when it's packed full of people. It's almost as if this is a bare bones establishment. It's sad because this event is attempting to revive the goth scene yet the venue that it's at (which used to be Tranzylvania back in the day) just plain sucks.", "business_id": "SiwN7f0N4bs4ZtPc4yPgiA", "stars": 1, "date": "2013-08-14", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "ibylT1jObEe-j9XG8dHtyQ", "review_id": "Qr6LxQugUkp3VFgdtdVSFw", "text": "YUMMY! I came here with a group of girl friends, with the recommendation from one of the workers at the hotel we were staying at, and I am really glad we listened. We went in on a Tuesday night and the place was packed, luckily we were able to get the last available table for six.\n\nThere are televisions everywhere, and loud music playing, we couldn't even hear ourselves talk! It was a fun environment, and the food is delicious. Everyone loved what they ordered. I had the teriyaki chicken sandwich with fries, so good! Apparently some dishes were featured on Food Network :)\n\nIf I ever had to go back to Phoenix, I would definitely make a stop here!\n\n-R", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 4, "date": "2012-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "6vyi7zHyBNL4RSVitFm_Vw", "review_id": "jYOWUFmsSL_UXfC0TtCujA", "text": "Great service and even better food. Checked this spot out on a Sunday afternoon and it was well worth it. Great music playing and the ambience was chill. Ordered nachos and gorilla wings (delish). Got a house wine and LIT, let's just say I'm tipsy ;) must check out while in Phoenix", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 5, "date": "2015-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "AJPUucBXwboTp1Xs-s27OA", "review_id": "tm6s5StoSEoRy3OydPYgsA", "text": "Just okay.  Service was good.  Beer was cold.  I'd prefer a good IPA though, which they didn't have.  \n\nFood was just average.  Standard chicken wings.  Sandwich bread was a little stale, fries not very crisp.  Ho hum.  \n\nNice decor inside, and lots of televisions, so it's a good spot for a beer and a ballgame.  Wood smoke from the pizza oven creates a great aroma, so maybe a pizza is the way to go next time.", "business_id": "j8nyAaN_w5t6wYv-ni23sg", "stars": 3, "date": "2012-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "wy9AIj-FTQaH7OAGg3xBfg", "review_id": "QeUikvdow03zTX22opslhQ", "text": "First time at Hooters. Since Sheraton didnt carry channel in my room, I was looking for a place that had the USA vs Mexico gold cup final and this place had it. The crowd was into the game too which was nice.\n\nFood is average at best. I had the western bacon BBQ burger with fries and it was just okay.\n\nService was great. Waitress was super friendly, cute, and a college student. Another college aged waitress stopped by to take away my glass and overheard me talking about disciplining my teenage kids and she joined the conversation with her own story on how her mom took away her cell phone and computer privileges.\n\nAnyways, i was impressed with how friendly the service was. They kept asking if everything was okay, if we needed anything else, extra water, etc. Maybe we got a good table near the food prep area and this made it convenient for waitress to come by often.\n\nThe bottom line is that you go to hooters for the sports, drinks, and waitresses but not really for the food.", "business_id": "qsWxbgQwuomXvMseg23DGg", "stars": 4, "date": "2011-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "nWouNfZD3Pw08RYizxkqcA", "review_id": "LcNEVWD0bv_ggazOc46J_Q", "text": "Hard Rock Cafe is a cool place to go if you're in the area and want to kill time before a concert or a game, but destination bar it's not. The food is average and the drinks aren't anything out of the ordinary. Infact, there's nothing really unique about the Hard Rock aside from the fact that they jacked up the prices because you're dining and/or drinking at the HARD ROCK CAFE. \n\nI'm disappointed that it doesn't compare to others around the world and seems out of place in Phoenix. A Hard Rock Scottsdale would be way cooler.", "business_id": "gkv2XvXpFgiq4Bb2XK7YmQ", "stars": 2, "date": "2007-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j8pXbnZdwfdr_nlkdtnJMw", "review_id": "FAirsCZsJ6JBeFtyDjbtUg", "text": "This place is pretty cool. My first time here was for a coworker's retirement party and she was thrilled this was the place we chose. The food was excellent for me. Can't go wrong with twisted mac and cheese! Even though our party was big, the servers got to everyone quickly and efficiently. Would definitely go back :)", "business_id": "gkv2XvXpFgiq4Bb2XK7YmQ", "stars": 5, "date": "2014-06-22", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 4}, "user_id": "YzNZNgpOy9tthDnczS_ajg", "review_id": "yHgdFKQHdi2AQv_KuJbnHQ", "text": "I love cheese. Really, who doesn't love cheese? Cream cheese, cheesecake, grilled cheese, string cheese, it's all pretty damn good. Cheuvront takes cheese to a whole new level. \n\nMy boyfriend and I took my out of town mom here before First Friday. It was understandably crowded, and the hostess at first gave us a 45 minute wait. Lucky for us, there were 3 empty seats at the bar. The service was quick for how busy it was and when we told the bartender to \"surprise us\" with the three-cheese plate...he did an amazing job. My absolute favorite was a brie called \"Green Hill\". It actually felt like I was eating dessert, it was so good.\n\nWhile we were finishing the cheese plate, a table opened up and the hostess graciously let us know, and even held it open for us while we finished our appetizer and closed out at the bar, which I thought was really nice. For our dinners, Mom had the Niscoise salad (which I probably should have also done, considering I had just finished licking the cheese plate), I had the filet, and boyfriend got the scallops.  All were very good. The portions were on the small side, but we didn't leave hungry.\n\nI haven't been back since,  but I remember looking at their happy hour tent card and thinking it's something we should try, though I can't remember the exact specials.  I'm sure it had something to do with cheese.\n\nAnother thing I appreciate about this place: They have multiple bathrooms, but they don't call one \"Men's\" and one \"Women's\".  I seriously feel like, as a people, we should stop this childish bathroom segregation. I understand large bathrooms with stalls being separate, but for a place with 2 one-person bathrooms to designate one for the \"men\" and one for the \"women\" is really dumb! It's not like you're in there with anyone else! All that happens is the Women's line gets long while the men shuffle in and out like there's a revolving door on the thing. Not fair!", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 4, "date": "2009-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "je0xJ_qIZfaSXkEQKcnKFw", "review_id": "F0mVECGcQZbnEBOSNJE__w", "text": "Wow, I am a bit shocked to see the previous review. I have read some reviews that the lunch service isn't the best but I personally have NEVER had an issue with Cheuvronts. We discovered this restaurant during Arizona Restaurant week last year. I have been for several dinners as well as a wine tasting. The food has always been cooked quite nicely, presented in a very nice way on the the plate. We love the cheese and wine selection. We have become friends with one of the staff who has been with the restaurant for a long time and is always up for making a reccommendation for food, cheese or wine. His name is Todd and he has always been great with us. I really feel that the person who posted the previous review should give this place another chance. I don't know what goes on during the dayshift or happy hour. But the dinner service has never been an issue for us. And I would be the first person to complain if there was an issue. If you do decide to give it another chance, ask for Todd. He knows whats going on, will take care of you and will address any issues. The portions for some items are a bit small and the price can be a bit higher depending on the entree. I would highly recommend this restaurant and it is one of my favorite local places in Phoenix. AZ Restaurant week would be a good time to try this place as you can get a multiple course meal for a good price. Also they do offer wine dinners once or twice a month as well as twice a month wine tastings on Saturday afternoons.", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 4, "date": "2011-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "aTi0NVrcPJWbN6jAsJVcAw", "review_id": "ZRVNU2x7rEyfgQ9BcpNUxA", "text": "Alice Cooper's Town is a mix of good food and rock 'n' roll, and has a fab bar.  Being one of the world's biggest Alice Cooper fans, I also loaded up on Alice stuff at the merchandise area before leaving.  The walls are covered with Alice memorabilia, which is cool.  True Alice fans will also note items on the menu named for his kids.  \n\nLocation is convenient to the arena where the Phoenix Suns play, and I believe may be within walking distance to the Arizona D-backs' ballpark.  Seating is good, and I agree with another reviewer that the make-up is a bit cheesy (especially since they only do the bottom half!) but it adds to the atmosphere.  The locals say you can even catch a glimpse of Alice here when he's not on tour.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 5, "date": "2008-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OI-VGo5ij4TMHVw8xWrKNA", "review_id": "JOJekn4KgzgTcnS8cVZr0Q", "text": "Walked over before a dbacks game. Loved the beer garden, nice draft selection and good tunes. It will likely become tradition before future games.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 4, "date": "2011-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "J4oguWB2tyqBvGJvCBN5hA", "review_id": "DQJ3-y4N1iDtWOvP9k7SxA", "text": "This is aunique place and not much else I have come across is like this. The food was very good, the staff was helpful, friendly and on top of things plus they elicit the \"Alice Cooper\" image in a very accurate way (although they did a not bring me a snake-thank God). Rock N Roll, Food, and Sports are 3 of my 4 favorite things that AC has. If you are thinking of going here or not GO! why deny yourself a very necessary experience in life!", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 5, "date": "2012-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GADYB3y4zQA1Xa-WVVimRg", "review_id": "-9Zbd546bknEeHeyGXc2Zw", "text": "At first I was a little thrown by this place and thought, \"Maybe I'm just coming for the name?\" because the wait was longer than we were told. But the staff was so friendly, the food (oh my gosh the cheese fries! the veggie wrap!) was amazing and our waitress, Bailey, was so attentive, friendly, and informative when we had questions. My friend wasn't as impressed with his food, but he's a super picky guy and I think he went in there already deciding that he wasn't going to be happy. I will be back, but I will go back with the expectation that I'll wait a little longer than anticipated.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 4, "date": "2014-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Aa9wM5uonchu6GMJjs57MQ", "review_id": "39Dk3Hmtv0oPTGD1JVj5Pw", "text": "While on vacation I saw this place on TV and decided to make the drive to Downtown Phoenix and stopped by. The Big Unit caught my attention and boy was it big. It was delicious was able to share with someone else. Seems like a good night spot to hand out and if your lucky I hear Alice shows up from time to time.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 4, "date": "2015-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UL9chyH0a4Pj8J_9M6WSpA", "review_id": "FpXa9IR3o3s9gpcfIN71Zw", "text": "This makes waiting in line for Pizzeria Bianco to open worth while!\n\nI haven't ever sat inside, but it looks really cute!\n\nI love that they serve cider, since I'm not a wine or beer drinker.  The cider is pretty good, but very large!  I almost wish it were smaller because it gets warm by the time I get towards the end of it because I'm a slower drinker.  It also warms up quickly sitting outside in line waiting for the restaurant to open.\n\nThe servers have always been pleasant and I would definitely recommend this place!", "business_id": "JR95uaM82xBUIZ-kQ785iA", "stars": 4, "date": "2010-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 4}, "user_id": "deEtVfAWacIYLdx7PcuOnQ", "review_id": "etVq-oEzOFOggDz3MgHDLw", "text": "Wonderful little burger joint!!  Very simple menu: hamburgers, hot dogs, and (Garfield) fried egg sandwich.  Everything is fresh and the burgers are like a thing from the past (fabulous)!!!!  Very little in and outside seating- most importantly its cash only!  Worth the drive! and an experience you shouldn't miss!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2008-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "u3m_bSY08yZxTI6m-ey9bw", "review_id": "m5tTUVbJOAJeHDetdkKRCw", "text": "Went to Welcome Diner for the first time this past Saturday. They had a veggie burger on special that I really wanted to try, but sadly they ran out before we got there. Instead I got the vegan po-boy sandwich with a side of fries (which i'm so happy I chose). It was so yummy, and super filling! The menu has lots of great comfort food items, including some vegetarian/vegan options. \n\nThe staff was awesome and super friendly. The place has such a neat vibe as well. There's truly nothing like it!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2013-08-18", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "90BhJMUxStPhZdHAnBsICA", "review_id": "7ajYOcbwvkUDQ8dqG-ni0w", "text": "Got the Carol, brussel sprouts, and insanely delicious mac. Melted with different kinds of cheese and blow torched to a perfect crisp. Deeeeeeelish", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2014-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UwzkhcbR0ZbSYEq1-OYgzA", "review_id": "BZEeyR51Q208hb-Z31Uy5Q", "text": "Love this place!  Great biscuits and gravy sandwiches.  I wish that they had more indoor seating for the summertime, but that is the only thing I would change.\n\nPro tip: come hungry", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VuYaaztq76VoQkj5DT3ELg", "review_id": "fOsXoQoXoM6mZZZh_Ya8rg", "text": "Good Food, fun atmosphere. Happy Hour is great, Love to come here late at night", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-07-29", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 2}, "user_id": "NL7OhHvUrQ-MejtbQIhs6w", "review_id": "5ps0rAchLmhzfxrxH7SBkw", "text": "If your looking for a bottom boy this is the place.  Lots of fem Latino dudes here.", "business_id": "0VpsHbGLHDVKIKAi0ZliyQ", "stars": 2, "date": "2013-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DN5GgGgpr4Fy7TFe41QLrw", "review_id": "yAVPaCBYtArqmcfdu2zWaw", "text": "I've been here twice and really enjoy it.  Very beautiful plants and a real nice walk.  Both of my kids also enjoy it.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2009-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uOLg4EeUTAQNHRbcZSXmag", "review_id": "6qfelTMk7rQa8W4wZ2XkmQ", "text": "Nice place to stop on your way into Phoenix.\n\nIt's welcoming beauty of Arizona as you walk through the gardens. Plenty of opportunity to learn and enjoy the scenary.  \n\nI took plenty of pictures and as I took in what Phoenix had to offer gained a better appreication for the cactus!", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 4, "date": "2013-06-08", "type": "review"}
{"votes": {"funny": 5, "useful": 10, "cool": 9}, "user_id": "KJDymAcoPiW_vuqthGxfpQ", "review_id": "YVhnqzS6tAEaTc1c9LTjLg", "text": "Surprised I have failed to write a review for this place! We have been here a couple of times. The first time was with my sisters when they came for a visit and the second was with a school reunion group.  The second visit we were fortunate enough to be there for the Chihuly exhibit, which was just amazing to see, especially when it started to get darker outside and everything was lit up from various angles.  \n\nThe park itself is well structured and has multiple pathways that you can wind yourself through and get lost in the surroundings. They have a variety of native desert plant life and multiple areas have signs with information and most plants have name signs so you know what you are looking at as you go.\n\nThe staff here has always been friendly and helpful when we went. The second visit we had, we needed to pick up \"will-call\" tickets for the rest of the group, and they had a well-organized system and ID'ed us to ensure we could pick everything up.  Everything was handled very professionally and we were happy to have the event there on the grounds.\n\nOverall: A\nA definite must-see for a visit to the Phoenix area, and great exhibits throughout the year for the locals!", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2014-07-29", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 3}, "user_id": "MWt24-6bfv_OHLKhwMQ0Tw", "review_id": "L382cZnohuumiXD7UlbzHg", "text": "For the location of this bar, I honestly do not think it is that bad. It is certainly not a happening Scottsdale bar, but I have been here twice and really enjoyed myself both times.\n\nThe bar is awesome for karaoke. They have a great selection of songs, and there are always plenty of people there to sing away. You have some good, some bad, just like any other place. Both times I went were on a Saturday and everyone in my party had the chance to sing multiple times without a long wait.\n\nThe drinks are well priced and I have never had to wait that long.\n\nThey have a few pool tables and two electronic dart boards in addition to Karaoke.\n\nI thought the point of Yelp was to review things for what they are. If this bar was in Scottsdale, it would be a different story, but its at 48th Street and McDowell and its a Dive Bar. As far as dive bars go... it is definitely a 4 in  my books.", "business_id": "W41CEzdKJe8wdDB-Rd6KJQ", "stars": 4, "date": "2008-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "f5CqKZlqK9Sox9z9wuooCQ", "review_id": "otVoDMEH7sTdiP_Jv4MQSQ", "text": "Celebrity is one of the better concert venues in the valley.  Sometimes the stage revolves and other times they do a 3/4 house show and it doesn't.  Either way, good place to see a show.  The bar downstairs is decent, friendly bartenders.  Dodge is probably my favorite venue but for smaller or mid sized concerts/acts this is the place.", "business_id": "BcBxTyj09Wu-w0KA1QvKTA", "stars": 4, "date": "2009-07-30", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "X_kPh3nt0AJPNPHye2rTlA", "review_id": "tMYUWXoFuLdFecqqP60R3A", "text": "I was introduced to this place by my coworker and friend.  She goes here every single day at lunch and its cute because everyone knows her there!  Anyways, everyone is very friendly!  I have always gone with my friend and each time they are so sweet and they even remembered the type of beer I like.  They have daily lunch specials and their prices are awesome!  They have a great grilled cheese!  My friend has them put their salsa inside, I like dipping it in their salsa!  I had their tacos the other day and they were pretty good!  This place is not fancy and luxurious, but I felt extremely welcome and comfortable.  This place is not my usual scene but it is good!  I will be back on many occasions...very casual!  I have never been at night or during events but I am sure it is crowded!  They have the tvs on the walls and they have pool tables I am sure it is a fun time!  Try it if you are looking for a casual bar to try...", "business_id": "IgaruuknYwCr9afeDYQ_yw", "stars": 4, "date": "2011-06-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "rw1Xw8UKq4xq2Nk9aVvRfw", "review_id": "4XtmAwQbVRrkorfZR1FuwA", "text": "So came here for lunch with the BF since he never tried Applebee's. I haven't been to one in 2-3 years. I was reminded why I stop going, the menu sucks. Anyway we got our appetizer within 8 min then we got our food 10 min later. I got the new pineapple burger which was mostly just meat and bread could hardly taste anything other than that. And it was soooo small. My bf got the mushroom Swiss LUCKILY he saw a long hair strand stuck in the cheese before he took a bite! GROSSSS! We sat there 10 min before our waitress finally came back so we had to wait another 15 min so they can remake his burger that time I didn't want my burger so we just took them both to go. Took about 7-10 min to finally check out. Also I believe the manager past by us and didn't bother saying anything or ask us how we were, If I seen a couple one with food and the other without food I would of asked if they were okay but nope she just walked pass us but checking on other tables before and after us! Anyway what a waste of time and money. Never coming here again.", "business_id": "hzUOqxpcnYYBgLlrgvjQYQ", "stars": 1, "date": "2014-08-28", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 5}, "user_id": "_7el1cOgnfkNfmZKi277bQ", "review_id": "1bAo42-4T922nDmWrX8C3A", "text": "This is more like dungeons and dragons, it is so freaking dark in there. They have some good food, decent service. Nothing stands out just ok. The owner is a goof ball and trys to hit on every women in the place.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 3, "date": "2009-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "c_XZwsOmiy4tc0Mmk_F2xw", "review_id": "nNItyg6Udalz401cJs7-Lw", "text": "Good service, food and prices but a god awful sewer smell permeated the entire place!", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 4, "date": "2012-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XNZXuTcNeIy9_WjENR3luQ", "review_id": "ifRtwEmuSIvXH-g-zKmxKg", "text": "If you're looking for a traditional english pub, you may like this place.  To me, it's was a little too dark and damp and the menu was very limited and a little overpriced.  Seems like a good place to watch a soccer game, even though the TV's aren't that great.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 2, "date": "2015-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TStnpcCDy3irXu63klUTIQ", "review_id": "mwWU71hsbEk_BZlHk06uvg", "text": "Their quesadilla burger gave me food poisoning. 'Nuff said.", "business_id": "cjUmPLRT43wN9Z87A9BOpg", "stars": 1, "date": "2014-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sQwgFhirdCt6h_g1rbjHHA", "review_id": "g8s1RpTCy5SrBbP6vzlokQ", "text": "Now this is the kind of place I could really dig. It's a little bit divey, but still warm and inviting. My first visit there I got a greeting and handshake from the owner. The bartender was all smiles and friendliness. Every single person in there (and it was quite a diverse crowd) was enjoying themselves and just having a jolly old time.\n\nOn top of that, prices are great, they've got what looks to be a pretty nice pool table, and I hear they have steel tip darts. How can you go wrong there? I'll have to make a few return runs up here, for sure!", "business_id": "VC0VbRhQqvXpolK3pFuZPw", "stars": 5, "date": "2011-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oMDSmhe72hjxoR3EAj6sXQ", "review_id": "es6keCTdVlGErn1eZi5BYA", "text": "OK - it all makes sense now.  When I reviewed some of the reviews before going to SunUp for dinner - I was a little confused.  I had been there and the food was good, service good, beer sampler - good.  So why the bad reviews from other yelpers.  Tonight I learned. \n\nWe went with my mom, brother, and my boyfriend.  We sat down and were greeted by a blond waitress.  Not extremely friendly but nice enough, service was decent for the first part of dinner, she was good about filling up drinks etc.  Then she brought the check, at the same time my brother ordered a second beer, so she took the check with her to update.  And then disappeared.  And disappeared . . . Brother's beer was half gone . . . and still she was not around.  I had actually thought we had paid the check and we were just hanging with my brother while he finished the beer - but no - mom had not in fact paid the bill and we waited.  So I look up - and there is our waitress flirting with a group of guys at the bar.  Now I get it - when you are kinda cute and serving beer - a group of guys is likely to tip better and more fun to hang with.  But that does not make it acceptable to neglect a table of four waiting to pay - tip and leave.  \n\nSo I will return - but I will be looking for our prior waitress - she was a sporty brunette - fun - and very good. \n\n(disclaimer in no way am I saying that because she was blond it made her bad - it is the only way for me to identify the waitress, should have gotten her name)", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 3, "date": "2010-06-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Dg1oOOOzNyOK0PnMU1bgJA", "review_id": "z1o6FHtSYYzl28sMtm3e2Q", "text": "Sun-Up..how you always pull me in when I am on Camelback. Damn tractor beam! My favorite place in the Valley to enjoy delicious craft beer (I love the Trooper IPA), a nice meal and good service. I have noticed that some people have posted a few negative things on here about the food and I think \"Everything I have ever had here has been delicious. The quesadilla is very enjoyable, the wings are underrated, the wraps are tasty and the Buffalo Burger is one of my favorites. Oh.. not to forget that the Green Chili Pork is awesome as well. If you have never been.. go now. I mean..just get in your car..or on your Vespa..or hop the light rail..or ride the bus..I don't care..just get there. If you like craft beer and good food. GO!", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2012-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9ebaAGLVIgGKpDLFwmvaiQ", "review_id": "cMegIIsNQ2CM9YSr1XAQPw", "text": "Great service by Emily! Check in & u get $1 off a beer (nice!) ordered the Sun Up salad w/grilled chicken and it was very tasty. I just recommend they serve it in a bowl instead of a flat plate, it was kind of hard to eat. Hubby's fish & chips were great' he chose onion rings instead which were big Ol' amazingness. \n\nWill be back!", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2014-08-08", "type": "review"}
{"votes": {"funny": 11, "useful": 9, "cool": 9}, "user_id": "Z0w6C-21dwt1rXOhmepJJw", "review_id": "E18Bl5PO_WuWEXFiUIsuMA", "text": "OK, so yeah i am goin there!! well actually i have all ready been there and back! this is the place to be, really it is, no not for the drinks but for the view, it's all about the view and the best 10 dollars you will spend in a 3 minute time span... i do not recommend going to the vip, why you ask/ welll, because for 10 bucks your still gonna get grind-ed on, boobs in your face and prob walk out with a load in your shorts.. maybe even a hand up your shorts if you sit on the end against the wall and your a perv an wear super short shorts!Yep, really!! There  all different styles of girls to choose from, tattooed, tits on a stick, average, beautiful, girl next door, beauty is all over the place!! Go, take your girl then go home and do the dirty....", "business_id": "wnOQw4nazfglLxwLogTlng", "stars": 5, "date": "2010-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y58B8MK4mP3eZ1fTFQIosg", "review_id": "I69-znO7OS4j4u1u_bFXqg", "text": "I have been coming to Christos since my grandpa first took me as a kid until now as a college kid taking girls on dates.  For how good the food is and how much you get the prices are awesome, even for a student.  I've gotten everything from pasta, to fish, to the best veal chop I've ever had.  At dinner all the entrees come with soup, salad, and bread which is rare nowadays, and at lunch you get a choice of soup or salad.  I recently found out their happy hour is great with a revamped bar with a big screen TV, $5 appetizers, and great drink specials.  Their service is always great, everything is made to order and they will make any special request happen.  I recommend this place to anyone who enjoys a ton of great authentic Italian!", "business_id": "3CSaqRNvYg7ZdN2zwxwzVw", "stars": 5, "date": "2013-08-29", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 3}, "user_id": "wFweIWhv2fREZV_dYkz_1g", "review_id": "IaKFlT_WG3apPgH6_tYhLA", "text": "If nothing else, you should visit Pomeroy's because there works the world's best bartender, Charlie.  A master of his craft, Charlie may also be the world's best grilled cheese chef.  I've watched him make them, he gives a shit.\n\nHappy hour has 2 for 1 domestics on tap.  You know how some uptight bars won't serve you more than one drink at a time?  Oh no, not Pomeroy's.  They hand you two picture perfect ice frosted mugs filled with your favorite brew and you realize this place isn't for amateurs.", "business_id": "_GS1R0LTwr6h8rMWY_8U9Q", "stars": 4, "date": "2013-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "pv82zTlB5Txsu2Pusu__FA", "review_id": "Xoma9CSgDDd4Dh4i9qtF_Q", "text": "Ahh\nwhat a great place to watch, hear, and feel some live music. The Rhythm Room has an \"electric feel\" to it! It is a great spot for the blues, some really talented blues acts pass thru here on a regular basis. I would say the best time i had here was a few months back when The AppleSeed Cast played, in it's entirety, Low Level Owl vol. I&II. OMFG what a great intimate space to hear such sprawling ear drum shattering prog rock!\nMy face was melted.\nThe Rhythm Room's layout is a little akward for sure, what with that stomach level pony wall that segregates the crowd, it's such a bitch getting stuck behind that thing. Assumably it's to divide up the 21 on under crowds but i wouldnt know, maybe when it was designed in the early 70's or whenever these sort of 1/4 walls were all the rage, personally i'd just as soon knock it down and open up the space. meh no big.\nIf you are a music fan, and enjoy cheap stiff drinks, i'd say this is one of the many great venues in phx that can provide both in heavy doses.", "business_id": "JZJqJadk9pSoCGT7VTwBvg", "stars": 4, "date": "2010-08-19", "type": "review"}
{"votes": {"funny": 5, "useful": 3, "cool": 4}, "user_id": "4UUIpbOTPmu43wuC2aSGkg", "review_id": "Qx6SafaGJq3JXa4IWUcQ_g", "text": "Here's a place to go where everybody knows your name, and most of the patrons happen to be gay. I love coming here with My Gays and just hanging out and having some drinks at a neighborhood bar! The crowd is SUPA MIXED. I mean, where else can you go where you can have a hardened biker boy compliment you on your nail polish choice?! It's awesome! I've also been threatened with the stealing of my shoes, as well as asked where one can buy my lipstick (drag queen). The bartenders are courteous and super funny! My fave bartender is Michael. He's a cutie, and is a great pour! \nSo, whether you're in shorts and a t-shirt, or dressed to the nines, stop in, you'll find a corner to fit into!", "business_id": "lLI8ObL8aCVbkrrtAW0EHw", "stars": 4, "date": "2008-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "sZp_7b83BDTWYeu5Qx0wFg", "review_id": "NYQ3a8TL6XpyrRjxq41Pmg", "text": "One of my favorite places for a bite to eat.  There aren't many gay establishments that serve food in Phoenix - this is likely the best.  Their sliders (I've had them on four different occasions) are awesome.  Three pool tables, typical sports bar, but with a friendly, eclectic clientele.  Staff are friendly, although a little slow with table service from time to time.  Very open-minded and I've always had a ball in the place, no matter what I'm wearing.", "business_id": "7srDFwPPnzBaQoPW55Dc8Q", "stars": 4, "date": "2009-07-30", "type": "review"}
{"votes": {"funny": 10, "useful": 8, "cool": 5}, "user_id": "qwu5B9anH4AlEtau0K-6aQ", "review_id": "b1auVZhkOH-Q_kExWwYeSQ", "text": "So me and my buddy (coworker who is hourly) decide to go to lunch today.  What's the catch?  We don't know where to go.  We decided to go somewhere we haven't tried before that was off the beaten path. Enter Harvey's. Er, well, actually we did the entering.\n\nWe get into the place and it is a narrow bar with a line of tables to the right. We sit. We wait.  Finally, after much gab, the Waitress/Bartender comes up to our tables and says 'Hi' then proceeds to stare at us.  Anticipating the usual question 'Can I start you guys off with something to drink'  I order an RC cola and my buddy does the same.  She recommends the Cheeseburger so thats what we get.  I also ordered a mixed basket because (FOR SOME STRANGE REASON) fries aren't included with the burger! THIS IS AMERICA PEOPLE!!!!!\n\nAlong with the burger and fries, we got a lot of time to chat.  and I mean a LOT.  They sure are generous with time!!! Eventually, I ask her to put it in To Go containers and they give us the fries and cokes free.\n\nAlso, just a side note.  Please eat your food before coming on to Yelp and reading reviews about the food you are eating.  Some of these reviews almost made me vomit... almost.", "business_id": "ntJAKLAq0cXzzdFgPoo0Iw", "stars": 1, "date": "2008-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "q0YJ0QRDq4_Y-2K6dXQwBQ", "review_id": "dGhkPXMWnE097UUcWX9LeA", "text": "I love this bar. It's is a small dive bar with dart boards, pool tables, a sitting area, great food and of course a full bar. They recently painted the pool room and exterior and it is awesome: bright and inviting!!! They also recently put in a third tap and rotate craft beers regularly. Seems to me they are trying to get a younger, hipper crowd in and as far as I can tell it's working (The regulars still come in too!) I would recommend this place to anyone who is craving a juicy burger, a cold drink and/or a great time!", "business_id": "ntJAKLAq0cXzzdFgPoo0Iw", "stars": 5, "date": "2014-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cZEVW_x0NKI69Xm55tknBg", "review_id": "WO1BJPor0oP_ruKkkYe2Kg", "text": "This is a great date spot. it is elegant but not to posh nor will the price leave to bad a taste in your mouth if things don't sizzle after dinner. The lighting is dim so it has a touch of romance to it. You can hear each other talk, small detail. I love good service and this is one place that I have always had great service. I have actually only had great everything here. The food is nothing super fancy or exotic but it is always good, if you order a steak med-rare that is the way it will come out. I enjoy all the apps, in fact I love going for happy hour and just having apps. The location is central and easy to get to, and it is always packed so you might have to wait so grab a drink for the bar and enjoy the scents flowing from the kitchen.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 4, "date": "2008-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "z2syOs-sM7IgKtds57FkQg", "review_id": "fVyA1CxvM0weFpA6DGB4lA", "text": "We love this place.  It's close to home and never disappoints.  I can honestly say, that I've never eaten anything I don't like.  It's always a sure thing.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 5, "date": "2011-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ilSvxFmzNS-kcD55pyiwUA", "review_id": "jmrkXFhUPcNwkNcS58ODzg", "text": "My husband and I ate at Phoenix City Grille for the first time on Friday night and we loved it! As we walked in the door we were greeted with a quality aroma that you just don't get from a typical grill. All we knew is that we had to try the ribs and we were glad we did! I had the crusted fish and it was fantastic! The menu had many different price options and that was nice too because sometimes you just want a burger! I think another reason why we will come back is because I saw many gluten free items on the menu. We have a son with Celiac so finding a safe place to feed him is priceless! Also love the combustible to go box!", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 5, "date": "2013-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sswYaxw2SCb7bVIif2ao4g", "review_id": "uVo1SPw6id4qykcPHU_75Q", "text": "Great food, outstanding service! Nicholas has been one of the best servers we've had anywhere. He was extremely helpful and his recommendations were perfect. I would definitely recommend Phoenix City Grille. And I don't think you could order a bad thing on the menu. We are looking forward to our next visit.", "business_id": "Pfb6VOIiroqDWOebfgWGPQ", "stars": 5, "date": "2015-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2tyadgcxcaEu5LWgLdwLAQ", "review_id": "Jeo8dQ5aSgIoQIadSAxWxA", "text": "Delicious sandwiches and a little beer & wine bar in the back with a great bartender.  Bob is very knowledgable about everything they carry and what will best pair with your food.\n\nToast the bread and shoot the breeze for a great experience!", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 5, "date": "2011-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VdxZnKDA08HlT6zFLTumjQ", "review_id": "cQehCdViZKKHkM1Zh4bZtg", "text": "I've been eating there for years, it is classic Phoenix! The sandwiches are artfully made to your exact specifications and I love how you can taste every ingredient in every bite. That is their standard of tasty quality! My fave is Where's the Beef with a portion of turkey, ask for shredded cheese! I also like the pastrami on dark rye with avocado, shredded cheese and coleslaw! My favorite place to sit is in the wine room unless the weather is nice, then outside is the place to be!", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 5, "date": "2014-08-16", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "gL-JqkiCokGQ8EhUDI927A", "review_id": "YSMTp0KfPtzUcg28JsHnxw", "text": "I dug the atmosphere and cheap PBR. I met up with a friend here and he was surprised by my suggestion because how the area is becoming so posh as of lately.\nHe liked it and how laid back the bar is. \nIts a cool, nice, small dive bar and a bartender was really nice and remembered what you ordered. Very cool", "business_id": "mgllPJA6NQXlJurFWAkqQg", "stars": 4, "date": "2015-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WZJEdsPReU5l6ZddRGMq9g", "review_id": "5DepJwB6Zh0GviEeT8v1gg", "text": "Well it's a dive bar! This is by far one of my favorite places to chill out! I lived in Phoenix for 9 years and now I am in San Diego. This is the first place that I go to for dinner when I'm back in the 602. Their food is amazing! Their bartenders are great especially Jimmy! It's a must try... a great casual experience.", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 5, "date": "2012-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tXhlRAnR3_GoWvewfQni4Q", "review_id": "EGrR7HTQI6eDrXhMWQVp3w", "text": "Armadillo grill is awsome. There is no simpler way of putting it. The food is always tasty, everything on the menu is good. I generally get the grilled cheese and tomato soup, because their tomato soup is the best I've ever eaten. The bartenders and servers are always nice and efficient. It's never been so busy that I couldn't get a seat, but there is always people there. It's everything I want in a neighborhood bar. Thank you armadillo keep up the great work.", "business_id": "CqhsIZ7TzCfJTrZqg5-gqQ", "stars": 5, "date": "2014-08-15", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 2}, "user_id": "vWCksqJJfYjGGdD-yb9qGA", "review_id": "NQUixom-zwLtFrIskU-QkA", "text": "Ok, so what? I do not like this place. I never had and i never will (Probably) To me its just a failed attempt on the \"Cool\" from other big cities - NYC, LA, etc. Sure its dark, sure there is music, of course there is a bar. So, what the hell is there not to like then? Yummm.... i do not know. Maybe tasteless blasting music is 40Db too loud for my aging ears. Maybe fact that i had to wait 10+ min for a drink just to find out that there is no mint for my Mojito does not sit well with me. Maybe few too many women that should be babysitting their grandkids instead of srutting their aging \"Stuff\" around making my old eyes hurt. Or perhaps a combination of all of the above. \n\nBahh! Screw this place. If i did not NEED to go here i would have never set my foot there on my own.\n\n\"I like. NOT!\"", "business_id": "peA3F-PnIfijYr8HuG-A-Q", "stars": 3, "date": "2008-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "q3Fa0PhTGzRl-05fXHIi4g", "review_id": "XwtO_dFR9pJjNQxWxxM31A", "text": "Came back on a Friday night and it was even better.  Friend and I were able to snag a couple seats at the at the bar and had a great time.  If possible try to get Aaron as your bartender, he only works on Fridays and Wednesdays but he was awesome.  He was just asking us what kind of liquor we wanted and creating these awesome drinks for us.  My friend had something with egg whites in it that he loved, another that tasted like key lime pie and I had something called a Sophia Loren that was amazing.  Even the people in the bar sitting next to us were cool.  The atmosphere here is just great.  This is definitely one of my new favorite spots to be.", "business_id": "peA3F-PnIfijYr8HuG-A-Q", "stars": 5, "date": "2013-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "eI8qbxtqcKtVBLHGfgwqXQ", "review_id": "g-mjv11_Sk1U6jirhzPijw", "text": "I was in a group of 4 and we came here on a Saturday. I expected it to be busy and planned on getting there around 930. When I arrived all the tables were occupied, as was the bar, but the hostess was great in working with me to reserve a table for four as it became available. I really appreciated that. I held down the table while the rest of the group arrived. \n\nI started with a blueberry gimlet; a drink I saw on the online menu. When it was brought to me they made it with blackberry saying they didn't have blueberry anymore. Disappointing, but the drink was still very tasty so I didn't think much about it. My so got a Moscow Mule and my friend got a Bellini; both were fantastic. I also had a glass of their Malbec wine which was solid. Our water was always promptly filled. \n\nOverall a very pleasant time. I didn't mind the more club-y music choice - it was a Saturday after all. And it never became as packed as I anticipated so that was a plus. Drinks were great  and I would be back. The only downsides were that some of the couches and furniture looked a bit worn and could be replaced and there was a leak in the womens bathroom ceiling that was just dripping into a pan of towels. Not classy, and not what you want to see going into the bathroom.", "business_id": "peA3F-PnIfijYr8HuG-A-Q", "stars": 4, "date": "2015-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LDFd6clx0b-g8N77HpnWWg", "review_id": "NB3SfmCKSen_c9bcye9nBw", "text": "I think our experience was amplified by the fact we were celebrating a birthday occasion. We had a reservation and a  \"set up\" table for the birthday girl. \nThe service was ok, not great. Slower elderly server who took his time to come around and check on our meal. \nFood was also ok, not great, have had better for less $$$. \nOverall it's good, not great. Will not return, there are better restaurants to celebrate at that have better service, food and value. \n\nNotes to establishment: We are in our early 30's, it's DARK. Hire a livelier wait staff, update your menu from being too traditional and get with the times on cost value. Best Wishes.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 2, "date": "2012-07-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E5Y4V8bXhqiWfKK3SrVEVQ", "review_id": "A8NSrEPFqm7k8LIj3qENUQ", "text": "This place is amazing!  Great food and they make you feel as though you are the only customer in the place.  We come here for all our birthdays and anniversaries.", "business_id": "QdbZyl-LWFS54u93Vjd5SA", "stars": 5, "date": "2015-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JsV1lEjJ9dsHU8PDbIaNBQ", "review_id": "Xm85-y5Qf5EIAPs-efEDow", "text": "Met a friend for dinner. The restaurant has an open feel I really liked. I had the fish and chips, loved the chips, the fish was nicely cooked, my friend had ribs, he loved them. The food is nicely presented the service was excellent. I would easily recomment Keegans to my friends and am looking forward to eating there again.", "business_id": "rVUEZpHQfWI_3kt0lBwaxQ", "stars": 4, "date": "2013-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7CehoiHmes5ak_6FAZx9XQ", "review_id": "n1P8EIIbeL0zea_rHDqySA", "text": "Old Decor. Service from servers who are...weird. The owner did a table touch to see how everything was. We hadn't even gotten our appetizer. The Shrimp Cocktail was large, cold and fresh. The steak that my brother in law had was very large and cooked properly. I had the pasta trio. The gnocchi was good. The other two pastas were below average and I suspect made from a canned pasta sauce. There were 5 of us dining. Some were happy with the experience. Others simply tolerated it. We dined for a special occasion, Father's Day. Avanti had been on our list of \"To-Try\" restaurants. Been there. Done that. Won't do it again. Once you've seen one pink-walled, Zebra coated restaurant, you've seen 'em all. This place is past it's prime.", "business_id": "vvA3fbps4F9nGlAEYKk_sA", "stars": 2, "date": "2014-06-16", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "Wmd152U-ffrRajxKNE1Xug", "review_id": "LysKWfLD9z47xG3h-wwjwQ", "text": "Service and food were excellent. The restaurant is a converted old house and that gave it cool style and character. \n\nOne caveat though...\n\nI would say that the average age of the other customers was about 60-70 years old.  I don't know whether that's normal or not, but all I can tell you is that my girlfriend and I are 26 and 27 years old, and we felt a little awkward.  Not a harp on the restaurant though, just something to think about.", "business_id": "PuHucejs4LG3hSXnrwi9-g", "stars": 4, "date": "2011-07-03", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "_uL7OiQSfNsCd60DrAf7qQ", "review_id": "C-_HF48ODAXz5k141KDKqA", "text": "Since my last review I have become and even bigger fan of the Ice House Tavern. The current owners just celebrated their 4 year anniversary. They thanked their customers with free barbecue and bands. Yummy! \n\nI have frequented on their comedy nigh, Wednesdays, and always have a laugh! Sean puts on a great show. I have also come to find some great local bands; Lost In The Sun, Father Figures, What's Left, Quarter Inch Crown, Odds & Sods, and many more. \n\nI have also become somewhat of a beer snob these days as well. Their beer list is awesome. Beers I have never heard of and love; Dog Fish Head, Franziskaner, San Tan Brewery and more. \n\nIf you are looking for something fun and new to do check out the Ice House Tavern. I hear they are also starting up a team trivia night on Mondays. \n\nWho wants to be on my team? :-)", "business_id": "yb17xHvhDJthJGS10uhFeQ", "stars": 5, "date": "2011-08-24", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 4}, "user_id": "xrHvl1oEoU0l6GGH_nnpGQ", "review_id": "D9CJqg6Hk4hj3VqPkh4B-g", "text": "I love this place, whether it's to meet friends for happy hour or to grab a quick dinner and some wine. The bruscetta is to die for and I have now seen many restaurants trying to replicate. The wine list is reasonable with great values!\n\nI find the crowd to be pleasant and generally professionals. However, if you are generally offended by well-dressed adults, then perhaps you might want to stay away.  This is a great place!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2008-06-17", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "saiZmxzBIowJbMgPBW1Now", "review_id": "999VhEUHghG0YewSlPk26A", "text": "I love coming here for happy hour when I'm in town.  $5 glasses of wine between 11 am - 5 pm everyday.  Nice selection of reds/whites to choose from.  They also have delicious paninis and bruschetta.  Their desserts are also really yummy!  Everything is reasonably priced.  The outdoor patio makes the food and wine even more enjoyable.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2009-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DPo1uZzvRBUnMJnA6XMcLw", "review_id": "l8AcEBGvSWnCITwD4JmFdA", "text": "Another friends birthday tonight. And all I can say about this place is wow. Personally I love wine bars, the ambiance can be so indulgent. Postino's did not disappoint. With a cool cast and crew of waiters and cooks; the atmosphere was like a kool dry place. I do wish there was more seating; but what can you do about that? Bring a smile & your love here and the night will feel forever young!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2010-07-30", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "M_v6YaQreU00t2EK1cgDhw", "review_id": "HkAbL-r8uBDZsuvaMjAxCA", "text": "Their food (great bruscetta) and libations are fine. The crowd is more Scottsdale-ish than at the other location. Also, the crowd is denser and the wait longer. Expect to waste your money in valet; not so at the other location. \n\nThe only problem with both Postino's is their music: it's loud and it's bad! It's an irritation as well aesthetic sodomy. For the sake of almighty Allah, can't you people get in touch with your heritage and the supernal realm by playing classical music? Not only does this music complement the aura of the wine bar, but it's elevated and pulchritudinous to boot!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2011-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "RQCIeawLXYpjJxYVts7DDw", "review_id": "sIyY7OKt4JU7jVGiBSi5Hw", "text": "The turkey panini was delicious and the service was good.  It also helped that Walt Richardson was performing. All and all a great treat.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2011-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-L0i4tIcOIbAq_gPvykkLA", "review_id": "KB3zt-U6i749sifJMxxAtQ", "text": "We went back three Sundays in a row just so I could try more of that wonderful bruschetta. That's not overboard is it? Yanno when you eat something so good you want it again and again until you can get it out of your head? That was me with this bruschetta. The white sangria was the perfect addition. All enjoyed on their magical patio that's not too hot even at 100+ degrees. *sigh* ... ok, someone tell me four weeks in a row is not stalker levels? Can you stalk a restaurant?", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2012-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HDitrG8xK9HnkU9j4d0N7w", "review_id": "QRfUu1a_BFL3KjOGPc1ycw", "text": "Love it all!!  Food, wine atmosphere. Only down side is the acoustics. Hard to have conversation and be heard", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2013-06-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "4AC1ZlAlL8_kYVXX6Tq2yQ", "review_id": "RmFAtpCS7leW7gDJSSqmdQ", "text": "Postino is an essential spot to check out if you are, or ever plan to be in the Vally. \n\nBruschetta. Panini. Meat. Cheese. Bread. Wine. Beer. Can you dig it? Do you have a pulse? \n\nTry to make it during the time they have the special for a bottle of wine and bruschetta board for $20. If you are reading this review right now you probably have the ability to find out when that is, so do it, because I can't remember. \n\nThe Bruschetta board comes with 4 types of bruschetta, you have to order this. I have tried all of them and each is great in its own way but, you must have the Brie & Apples - to die for. \n\nGet the Nine Iron panini. \n\nThe cheese board is my favorite appetizer. \n\nAny or all of that with a Hop Knot and you might just forget you are on planet Earth.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2013-07-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "jBjsY05_jZxvuNwjh11WfQ", "review_id": "XN3Cbt5Lkca0mkeVomFOUA", "text": "This place always has a fun vibe and a great patio. Love meeting girlfriends here for wine and bruschetta.  Good service and nice atmosphere, a true staple.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2013-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gt4WBFzDkordB3IrP06Bcw", "review_id": "dKeDiQDwFCsTCu54cFMCBw", "text": "great bruschettas!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2014-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GjggdVEjRmatV_rQzFQJew", "review_id": "vlurmRpmZ-NvUcJ_KtBrgw", "text": "Everyone loves this place, it's always crowded, and their happy hour prices (wine, bruschetta, salad for $20 or something like that) keep everyone coming back. My fave bruschetta is their proscuitto one, just get 4 of those and you'll be good. What I don't like is that it's hard to get seating and there is a bit of an attitude with the staff, which is rare for Phoenix. Oh, and well after all, you're still eating bruschetta, one of the few things I can actually make myself at home.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2014-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ygZTPe52ZhK9jOBzS8GQ8g", "review_id": "LEuehRf18KbTbzpvBxd1Rg", "text": "Great atmosphere and even better food. Order bruschetta (obviously) and make sure you get at least one prosciutto and fig in your flight! The Italian Picnic salad is amazing- goat cheese... bacon... I mean what more could you want?! The only downside is you're almost forced to use valet parking. Pretty annoying but hey, what can you do? Carry a couple bucks on you for the valet.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2014-08-03", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "AHrK4xiaoZ9iuu2bUQqUiQ", "review_id": "LodukYBSOtlsn8J6uz84Kw", "text": "the place is nice very hipster food  ok nothing to write home about needs a better beer selction with some more euro stuff", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 3, "date": "2014-08-30", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "mbkNNq0IeAFN6Q-1jYA8uw", "review_id": "N40c_5QsK9YxrYcf_O5Ijg", "text": "This has always been one of my favorite neighborhood spots and today I walked into the bar and I thought it was reserved since each spot had a  formal place setting and linen napkins. Felt like going home and changing my chuck Taylor's to dress shoes.  I also noticed that most of the entire staff I know is gone  besides one of my favorite people here Todd. I hope this is not a sign of things to come.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 1, "date": "2015-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "DrWLhrK8WMZf7Jb-Oqc7ww", "review_id": "T2mp48TbaT2UneaGsrZt5A", "text": "Tried out the infamous Taco Thursday and the results were pretty good. The tacos which were served in hard shells were only 50 cents each with ground beef, lettuce, tomatoes and what tasted like salsa out of jar  Nothing gourmet, but if your craving tacos this could be the place - at least once every three months or so. The tacos are normally $6.50 for four and unless they are entirely different looking than on Thursday that is not a good deal. Extra crispy mozzarella sticks at about $6 were good too as the sticks had a bread crumby coating that translated well to the deep friend cheese.", "business_id": "qz4ZOcv-840UjfCEYI4qZg", "stars": 4, "date": "2012-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dqen3r4tAD1rP3ziOqQ4_A", "review_id": "I7oQbhwLqjnxWaBBvOzGKw", "text": "Wanted to head to my favorite dive bar last night and it's closed for a little overhaul. Was lucky enough to bump into the owner and he gave me a quick tour and showed me what he is doing... Keeping the \"Dilly\" theme but just giving it a bit of a face lift (needed) and he said will be open (fingers crossed ) Sept.1stISH. \nIn the meantime go to the NOOK, have a drink, grab a bite and relax.", "business_id": "4vZZjr6IZAk4riT0DB8MbQ", "stars": 5, "date": "2015-08-07", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "xCY9C6KN9xTDzKrow9iivQ", "review_id": "6HAYrc5udaA81TiP-yjopw", "text": "The owner is an East Coast and ASU guy and is a riot. Bartenders are nice, service is good, sometimes can get a bit slow when it's crowded but that wouldn't drive me away., They have bands playing there now on occasion and that seems to draw in a crowd. Oh, and did I mention they have $1 jello shots?", "business_id": "rwT9wCyXNATA36yqcb4JSg", "stars": 4, "date": "2012-07-21", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "puGzwne0ytT_m0N7SLvRYA", "review_id": "DxpavpwfzK4i5Lnmw-DLYw", "text": "I have been to this Gallagher's 3 times.  The food isn't the greatest, but isn't the worst.  I do have to say that the wait staff is very friendly.  It is a good place to go after work to have a few drinks and watch a game.", "business_id": "F-ykHfGY9lWr12OJ_Ofy7A", "stars": 3, "date": "2008-06-25", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "A7DmcDwQsI5b-bHyEbCe6g", "review_id": "m0VuHDtwhoHGUVF9iQwKSQ", "text": "As a bit of a chili head, I have to say that I was very very excited about the atomic wing challenge here. Unfortunately, when we arrived we were informed that no such challenge existed anymore but they still have the wings. My coworkers and I excitedly ordered a round of the atomic wings and the wait began.\n\nWhile waiting for our food, the surroundings finally started to set in. I had noticed a bit of an odor when we arrived but hadn't paid it much mind. As it increased in intensity, I didn't have much of a choice anymore. Apparently, lunchtime is the ideal time of day to pump the raw sewage out and it just happened to run right through the door right in front of me. Not a good start.\n\nThe food finally arrives. This is going to be what makes it all worth it. I smell my wings and there is a little bit of noticeable tang and a some jalapenos on top. I take a bite nervously. Sort of cold. No noticeable spice. At all. Soupy wing sauce that doesn't taste very good on top of wings that I'm pretty sure just came from the grocer's freezer and found their way into Sport Pepper's microwave. Death knell.\n\nThe service wasn't bad but wasn't impressive either. Overall, between the dingy, dark decor, the overpowering smell of raw sewage, and the absolutely lackluster food, I just don't see myself ever being able to justify coming back.\n\nIt's unfortunate. I was really looking forward to this, too.", "business_id": "cTyBfWfmgL3vgRetyfmtyA", "stars": 1, "date": "2010-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QhuESGhOQWnKqwlSrISm8A", "review_id": "6gILIcGbHzK4G5PURgW0Bg", "text": "This place is close to home.  Food, prices, and drafts are all average in my opinion.", "business_id": "kvxrjOmicwb2njvXOJsZRw", "stars": 3, "date": "2012-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hTouxgTRwkjNlS2jniPM9Q", "review_id": "xQiZl1ZcyzTyMrI5bw-rlg", "text": "Great traditional Italian food.  Had the shrimp appetizer in citrus sauce.    It was tangy and fresh.   Tried the homemade lasagna.  The red sauce on it was fantastic.   The garlic bread they serve with dinner was crisp and light.  The only thing they could improve on is a larger pour for a single glass of wine.    Also liked the sweet cannoli. I will be back for sure!", "business_id": "jq_YnMQjcArdBWuwRospFg", "stars": 5, "date": "2015-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DuW3plUP-Y8t7uh1PecZfw", "review_id": "ZG-8b6w_PGaOmq7xyYjDDQ", "text": "Horrible food!!!!! Great Service:) The wings were not seasoned properly. It was not appetizing and probably won't go back to try something different....", "business_id": "PkBkqQpAoeX3Ogo5HBthQg", "stars": 1, "date": "2015-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Flc3YYAVLSMUli78jFZRyw", "review_id": "8w_4_9TQpDcmWJ1rBlyL7w", "text": "Seriously, the charm of this place is the people. It's been through allot in the last couple of years, changing hands and reverting back to the owner who had it for decades. This last loser stole everything of value, defaced the sign and closed the doors leaving an entire staff of loyal employees jobless because he couldn't get a liquor license. It WILL re-open. The bar tenders know how to pour a good drink, the food is cheap and good but the staff and patrons are like family. Think \"Cheers\" in the west. Can't wait to be able to walk in again and welcome back June and Eliot. :)", "business_id": "JImJictLIE48_O1z-l2TGw", "stars": 5, "date": "2012-07-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "KLekdmo4FdNnP0huUhzZNw", "review_id": "D5GDLCTe_dm6lzkgbjFoEw", "text": "I love their cheesesteaks. And I love the beer on tap- it is the coldest beer I have ever had and I look forward to it. YUM! Wish they still had Sam Adams on tap though. ;-(", "business_id": "vFJmFFfPVhHkC3bWOeZnNA", "stars": 5, "date": "2011-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "N-D-d1Z4UybdlkK1HxlNPA", "review_id": "xBbYcJGwvqTTZgpQiB0iKw", "text": "Hubby and I ate lunch here today and what we had was, for the most part, quite tasty. I had the Hula burger (with swiss cheese, sauteed mushrooms, lettuce and tomato) on a whole wheat bun which was very good. \n\nFries came with the burger (you can sub onion rings or some salads) and were all-you-care-to-eat, like Red Robin. The fries were just OK- they tasted a lot like In-N-Out's. \n\nThey do have veggie and turkey burger options. \n\nHubby chose the veggie tacos which were very fresh, with avocado, corn, black beans, red and yellow bell peppers, and zucchini on soft whole wheat tortillas. On the side was an \"island slaw\" which was vinegar based (maybe a little too much so) but very fresh with cabbage, carrots, jicama, red bell pepper, and green onions. \n\nService was just fine. This is a place we'd come back to, if we found ourselves in this neck of the woods again.", "business_id": "hNVcBhJSD5HyLKMf_Z7TaA", "stars": 3, "date": "2009-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XbQxZnXXvmjVv5Ska_Tp9Q", "review_id": "xsAkGrX7qTcLNt8wAGgAeQ", "text": "We enjoyed the food and the vibe!  We dropped in on a Thursday around 6-ish and it steadily got busier; obviously people know about this place!\nThe tacos are truly the best for the price... the wings totally hit the spot... good service...draft beers in pint glasses for a dollar during happy hour 3-6 pm, M-F...we are going back!  Yay, we just found our spot!", "business_id": "-xLwGUmmyKgsTtFOOXzjeg", "stars": 4, "date": "2012-08-16", "type": "review"}
{"votes": {"funny": 6, "useful": 9, "cool": 7}, "user_id": "MUHoBFzwRoXpCpgYSN8KRA", "review_id": "lwyPILYxANVeVwcSXuFE4Q", "text": "I can't give this place more than three stars, because it's just not my scene.  $8 cover on a Wednesday, b/c they have $0.45 drinks before 10p.  I walk in, place is packed.  Even before I walk in, i realize this place is insane, because the parking lot is packed.  Anyway.  A little bit of everything inside.  three bars and a beer tub, or was it just two bars and two beer tubs.  the alcohol was flowing, and people were dancing.  I don't dance, but I'm starting to think i should learn.  it was a little unbalanced out there.  I'm all for balance!  (not really. actually not at all)\n\nanyway, Dottsy pretty much nailed it - the mix of country and hip-hop somehow works in this place.  I told my friend that this place is quintessentially \"Phoenix,\" on several levels.  You'll know what I mean when you get there.  The crowd on Ladies' Night is surprisingly diverse, for the suburbs.  on the other hand, I haven't been to a bar with this concentration of straight people in a long time, so your mileage may vary.  You won't feel out of place if you're not wearing a hat and/or boots, so no worries on that count, at least.  \n\nThe pours were disappointing.  the Newcastle a couple friends ordered, which I thought was a strange call, was 5.25.  Ooof.  i stuck w/ my gin and tonic for $5, which i thought was pretty decent, considering.  anyway my search for a watering hole close to home continues - the music, the crowd, and the prices kinda scare me off, although i will have to investigate how early they start charging cover.  it will be pretty cavernous when it's not crowded, but it is only 3 miles from home...", "business_id": "gOlJQuE3WYeMgXXDKYfdeg", "stars": 3, "date": "2009-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "oXnp_Gn9sdL3dJ_nauxfig", "review_id": "zZlpqGYukrZWfjKn1JcsFQ", "text": "Apparently this is NOW one of our local pubs! Sort of hidden in a strip mall. Its very large inside and had some nice sounding food special although we didn't eat. \nAwesome 4 Peaks Kiltlifter on draft and $3.50 Fireball Fridays! Great service from the bartender, serving drinks with a smile!", "business_id": "VpQZo6KV8CqkIG_MRQ3jiA", "stars": 4, "date": "2014-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "QhuESGhOQWnKqwlSrISm8A", "review_id": "th_5rvsbPKf4j5HHQsIwvA", "text": "Cool dive bar.  Friendly bartender that remembered me and my drink from years ago at another bar.  They let me park my Harley on the sidewalk too.", "business_id": "E-_PkZNDuYxW1zs4XFlVmw", "stars": 4, "date": "2010-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-BQhKu4wgtZQyT3sxkqJTQ", "review_id": "_ipjjXNUvs8fp6qR9WZVcg", "text": "99c breakfast - sat/sun 9:00am-11:00am, with purchase of drink. Tasty,quick n good. In and out for less than 3$.", "business_id": "W_ZcIQiI6waQu1UZxXnKbg", "stars": 5, "date": "2011-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IldNKx5L8unlcv3LBSs-_g", "review_id": "i56ai34urrzhXmnFaxZDwQ", "text": "George & Dragon is a good spot for lunch or some peace and quiet during the work day.\n\nThe wait staff is definitely the best part of this bar and grill. Even though my friends and I come here only about once every four or five weeks, the waitresses always remember us, our drink preferences, and what we ordered last time. Actually, that's kind of creepy.\n\nThe food isn't bad, but it's not stellar either. On the English pub side of the menu, I've had a variety of the pasties, which were excellent. In true English tradition, however, the peas were canned, not fresh. The mushroom pie was good, though it's not my favorite. The fish and chips look great -- not greasy -- but I've never had them. On the American side of the menu, the grilled cheese is good but the sloppy joes have an odd flavor. Best to eat English when in a pub.\n\nThere's plenty of seating in the pub, both in the main room and the back room. There are TVs in the main room, generally showing sports, but a combination of light from outside and a terrible screen make watching the big screen unbearable. Sit with your back to it. The main room also has a pool table and video poker, if you feel the urge.\n\nThis place can be hard to miss, so don't pass it too quickly. They share a parking lot with a motel, and the lot is usually marked with strings of flags.", "business_id": "0Apb1P7RzbQEkeJDuywlPQ", "stars": 3, "date": "2009-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "odmafwvVJEtpzf_yc1JYJA", "review_id": "6dXnSo-HltLl0XT9odmMZw", "text": "To clarify my last view, whst sucks here is the FOOD. The service here; whether at the bar or on the dining floor has ALWAYS been exemplary. A great many of the staff have been here a great many years, that speaks well of management as well. What used to be a great regional chain has lost it's uniqueness due to corporate interference. Go back to the original menu abd quit trying to be Applebee's.", "business_id": "SgGINtDKQgoXoAnQgrDKDg", "stars": 3, "date": "2014-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "CcdJ_VhU_zqe2fL7G3eXug", "review_id": "t2kT5tlJLKD6VO_KH1WZiw", "text": "I really enjoy this place.  The wine selections are nice and they have given me samples to try before I purchased a bottle. The employees have been very interested in customer satisfaction every time I have been there.  This is pretty darn good for having been there several times.\nEverything I have eaten there has been enjoyable.\nThis is great place for date night, but not a first date, since if it doesn't work out you will want to keep this place as one of your gems to go and relax at.  It is also fabulous to go there with girl friends.", "business_id": "Our6bzte5W1wlIeOu9luug", "stars": 4, "date": "2011-06-07", "type": "review"}
{"votes": {"funny": 2, "useful": 7, "cool": 5}, "user_id": "k4-6lakq7t3kCgbvPxcuvg", "review_id": "51cmoe7HMz3TzoU_xcxllw", "text": "I took my staff here for a happy hour retirement party for our boss.  \n\nThe service was prompt and attentive, the ambiance was nice, with soft lighting and non-intrusive music playing in the background, and the meat and cheese platters and bruschetta I ordered were all delicious.  \n\nThis was a hit with the staff and I can easily see coming back here for another event soon.", "business_id": "Our6bzte5W1wlIeOu9luug", "stars": 5, "date": "2014-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fUs5XxOR82Hfrnyl4wi2QQ", "review_id": "5SPtVzOs3acoG2JEN2Z8vg", "text": "Just went there with my family for a late lunch on Wed, 6/29/11.  It was about 2:30 pm and we were happy that they were open and still serving.  We have been going to Ruffino's for over 20 years, off and on, and still like it.  I am writing this review just to give readers some recent feedback.  Ruffino has a limited menu, but pretty decent food and prices.  Nothing outstanding, but decent and worth your time if you want to try their offerings.  My wife ordered their clam linuini, lunch portion, and it was good and substantial.  My daughter ordered the lunch manicotti and that too was decent and substantial.  Lunch does not come with anything -- no veggie, no salad -- just the entree and bread.  I ordered the dinner order of veal masala and it was good and came with veggies, side pasta, and side salad.  The price was fair.  We ordered and shared an antipasti platter to share first, and it came with two kinds of cheese, two kinds of olives, artichoke hearts, ham, procuitto, salami, mortadella, sweet and hot peppers, and about four big leaves of romaine.  Pretty substantial.  So I just wanted to report that it was pretty good and we will go back, but next time on a Thurs, since Thurs is Osso Bucco day.", "business_id": "S3FhtwXuiGMlGdBNtmiiSQ", "stars": 4, "date": "2011-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WWCPFbj5_o8NQdi2p5DwVw", "review_id": "dMYSa0eYXmccoUlkR0NrZA", "text": "Great food and a quality staff", "business_id": "S3FhtwXuiGMlGdBNtmiiSQ", "stars": 5, "date": "2015-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yuPBS3fak77lgwO_9SXVYQ", "review_id": "kH1zPxbBg0irvTkRKtACDw", "text": "Yes, Islands is a chain, but they do a good burger. A damn fine one.\n\nSince my health kick started about 1.5 mos ago, I'm avoiding a lot of red meat, so I opted for a Turkey Lite Burger w/side of steamed veggies. It was a little painful as I watched my friend eat her cheeseburger w/avocado and bacon, but it was victorious.\n\nThe turkey patty was refreshingly moist and seasoned beautifully! The whole-wheat bun was not too dry either (I was worried). Steamed veggies had no salt/butter and just a tad crunchy - just how I like them!\n\nOur server did A LOT of check-ins w/us. Very attentive.", "business_id": "e0vubCKi8KD8zC2C6FdbuQ", "stars": 4, "date": "2014-07-21", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "sZp_7b83BDTWYeu5Qx0wFg", "review_id": "ITuuBGduQkBFfOSFZgCQkQ", "text": "My partner and I have been to Elephant Bar many times, and it never disappoints.  You walk in and are immediately struck by the warm, safari-esque decor.  Giant palm frond fans twirl lazily above, while a cool blue backlit ceiling dominates the heavy wood fixtures.  This time, we went straight into the bar and camped out in one of the over-sized booths.  The restaurant was not as busy as I remember it in the past, and we were there at about 5 pm on a Saturday.  Still, there was a good crowd.  \n\nOur service was impeccable, as the servers were very attentive and efficient.  The food came out fast.  Since it was happy hour, we ordered a bunch of their discounted appetizers.  Sometimes we like doing \"picky food\" as we call it.  We started with the coconut shrimp skewers and the butterflied fried shimp with cocktail sauce.  Both were elegantly served and very tasty, perfectly cooked and quite enjoyable.  The sauce had a nice little kick to it, without being too hot or bland.  Next, we moved on to the Vietnamese spring rolls, which unfortunately were chilled and a little weird, stuffed with shrimp and vegetables.  They were almost a little jiggly, and as I have texture issues with food, I had to be careful here.  The peanut sauce served on the side was tasty and saved the day for me, but I would have preferred the spring rolls cooked, as I'm not a fan of sushi and this sort of reminded me of that.  The vegetable relish in the middle of the spring rolls plate was pretty good, though.  \n\nNext, we shared the hummus, which was also very tasty.  We did run out of the hard pita chips (I would have preferred soft pita but that's just me), but it was so good I finished off the hummus with my fork and practically licked the plate, until my partner slapped me up side the head and told me to stop being a pig.  Finally, I ordered the $3.50 tomato soup, which came looking somewhat oily and liberally laced with sour cream.  It tasted really good, despite the oily appearance, and it was quickly scarfed up.  With beer, our total for all of this was under $30, so I'd say it was mission accomplished in spades.  The prices are reasonable and the food portions are ample but not gargantuan.  Overall, I give this a B+.  Good service helped ticked that up a notch, and we will be back.  Go here, go often, and have fun.", "business_id": "QzXFdjIbFRGhzL83goPPLA", "stars": 4, "date": "2009-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2pQ8XgwDB5w__eUYrjDu2A", "review_id": "byHCTPgERNhU1_0A-JX42w", "text": "Not good.  Service sucked and food was mediocre at best.  Has a local bar atmosphere so if you are a regular they might pay attention to you otherwise good luck.", "business_id": "d-rZazFFYvnjRZUhLTEUZg", "stars": 1, "date": "2011-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jTdrZPuegRgZH3MDsao5hg", "review_id": "jmRd2gpSR_nqDmXySxU6Xw", "text": "I go there for my after work fix, beer and chicken wings. I've never had an issue with the service, wings always come out great and I usually take advantage of their daily specials. My buddy and I are patiently waiting for it to open back up.", "business_id": "G7-NoraGlmzwO0sgs4fbmQ", "stars": 4, "date": "2015-06-09", "type": "review"}
{"votes": {"funny": 4, "useful": 4, "cool": 4}, "user_id": "X5GbNXY_nNoa_vTZDD0aCA", "review_id": "epzYvWcDMwullVkZh1AyXg", "text": "Not that this review will matter because theyre closing, but I just had to get it in.\n\nI love this place. Theres always something going on, whatever day of the week it may be. From live music, to movie nights, to the bloody mary bar on Sundays. There really is something for everyone....or I guess I should say was.\n\nIve seen countless bands perform here and have even sang here myself. The stage is huge. A great jam session stage, if you will. And theres plenty of seating/space for those there to enjoy whatevers going on onstage. Theres even the \"back room\" that has games and more seating if you feel like just listening to whos playing.\n\nOne of the biggest things Ill miss about the Alley is the food. Grandma does it up right. Ive never had a bad meal here. They have one of the best cheesburgers Ive ever had. The service was always slow as molasses at lunch, but that burger was always worth the wait.\n\nEvery single employee that I encountered here was so so nice too. Thats rare in a rockbar. No attitudes.\n\nIm sad to see you go Hollywood Alley, I have lots of great memories of you though.", "business_id": "Cp5_NSJFNgylD5SUdmT8nQ", "stars": 5, "date": "2013-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "loL4TeENgfmnrhZSZU2Hzw", "review_id": "Ee95ISMRJNcKivCqt2e5jQ", "text": "DO NOT HERE FOR KARAOKE!!! the guy dj is aways flurtinh with anyone pretty thing with two lags. He takes forever on song changes. Example, flying out side with some for 10 mins when he has over 15 peo people wanting to sing. So unprofessional. \n\n\nThose stars only go to the bar tenders. They are nice and at notice you at the bar in about 10mins.", "business_id": "hi5xfV28jsGBRWJWoBhDaw", "stars": 2, "date": "2015-06-06", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 5}, "user_id": "RLrzO8HyZ5EwDj2NZVGuzA", "review_id": "lAI--829DPmMXa8EVRTkLg", "text": "If you want to have a nice conversation over dinner, this is not the place to go.  If you are looking for quality pizza, this is not the place to go.  If you are looking for a place with some very unique entertainment to accompany some not-so-great pizza, than this is the place to go.  I love the entertainment.  The restaurant is built around the largest Wurlitzer theater pipe organ in the world (Almost 6,000 Pipes!). The organ controls violins, drums, horns, xylophones, and many other special effects hanging on the walls of the restaurant.  The music is a lot of fun. The organist plays movie scores, TV theme songs, Disney songs, Broadway hits, patriotic songs, and even takes requests!  Don't expect to be able to have a normal conversation since the noise is high volume.  The food is nothing special, so don't go expecting that and you won't leave disappointed.  \n\nThanksgiving through Mid-April:\nSunday - Thursday 4pm-9pm\nFriday - Saturday 4pm-10pm\n\nMid-April through Thanksgiving:\nSunday - Thursday 5pm-9pm\nFriday - Saturday 5pm-10pm", "business_id": "VRxelK__tuQD0KBxx2LzeQ", "stars": 4, "date": "2008-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fhxC6KW-8VmdgK9zhRs6SA", "review_id": "Hz9nWHQUxpIyWmG2T6GHfA", "text": "Always a hit with my out-of-town visitors. The musical show always impresses! I like their pizza. The crust is crispy but easy to chew. It comes out of the ovens in about 10 minutes. When you realize you're getting a theater experience plus dinner, the prices are reasonable.  $20 buys dinner and drinks for 2, with a couple of dollars left to tip the performers.\nThe organists are very professional.  Atmosphere is very casual, like a German beer hall.", "business_id": "VRxelK__tuQD0KBxx2LzeQ", "stars": 4, "date": "2013-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 3}, "user_id": "MReTWeV2A62pqqIbNnFtow", "review_id": "BORPEwpXoT39n2Z1eZ9irw", "text": "This is a great, unique, original place.  My family loves it.\n\nThe truth is, if you read the reviews, they are all spot on in one way or another.  Yes, its cash only.....   yes, they make you stand in a second line to buy drinks, and salad, and ice cream.  yes, the pizza is not drawing Oprah Winfrey to it to declare it the best pizza in America.  \n\nBUT....\n\nThis is the most unique thing you will ever see.  The food is good enough, and priced about what you would expect.  In fact, I think the quality has actually gone up over the years, but pizza is like coffee - snobs abound speculating what makes a pizza great.  At the end of the day, this pizza is pretty good for the family.  No one complains, everyone eats full amounts.\n\nBut unlike other \"unique\" places that are \"unique\" because they have funny pictures of people urinating in the bathroom, or kayaks on the walls or whatever, this actually has an oddly unique entertainment concept.  \n\nWe have tried it several ways, and do note, if you have not been, there is a method to the madness - if you swim with the fish, its far easier than swimming against the school.  What I mean by that is this:\n\nThe place gets PACKED.  When it opens there is a HUGE amount of people outside.  But their business goes in waves.  All the people crowd in, and order pizza at the same time, get drinks at the same time, sit at the same time, and for all practical purposes, leave at the same time.\n\nThe first \"Set\" is all old folks and families with tiny kids.  If you go with this crowd, get there 15 mins before it opens and don't freak when you are in a big line - you will get the seats you want.  \n\nBut, the interesting thing, is that if you go later in the evening, at the end of each set, a large group of people will leave all at once.  This ends up being the best time to go, because there are no lines, and you get great seats.   It's inevitable, if its packed, wait 3o minutes and half the crowd will leave, all at once!  \n\nThe organ itself is massive, and the instruments littered all over the roof, walls and back of the restaurant are controlled in time with the music.  In many cases, you can't really figure out which pipes are playing, but \"big\" songs like ITS A SMALL WORLD, and STAR WARS seem to use every instrument and its amazing.  Kids love it, old folks love it, everyone loves it.  (fair warning, I was one of those people that grew up with this place as a kid, in the 1970's.....  LOTS of great memories here, and my kids get the same experience that I had back then - it hasn't changed that much).  \n\nLater in the evening, things like the Canadian Flag descend and the Canada anthem plays, with lots of people getting up and singing and crying, followed by the Star Spangled Banner and Old Glory, Followed by Mickey Mouse Club flag, etc.  This is the kind of place, that you better stand and put your hand over your heart or you WILL get a WW2 Vet punching your jaw.\n\nWe bring all sorts of family and visitors here.  Do we bring them to show them that we have found the worlds best Pizza?  No.  A great Micro Brew selection?  oh no....  The best music you ever heard?  No (things played on an organ sound different).  But we take them here because when you add up all the small parts, its the most unique thing you have ever witnessed.  It comes off as one of those little niche concepts that some crazy inventor came up with that may work no where else but on this street corner.\n\nBelieve it, people come here to celebrate 50 yr wedding anniversaries and stuff - they read them out loud and its amazing.  This place, with all its random uniqueness is part of the culture of Phoenix and Arizona - which, is why it lands on lists for good dating experiences, etc.  If you propose to your future wife here, yes, you have no taste, but bring your kids here?  Then you are a cool dad! :-)", "business_id": "VRxelK__tuQD0KBxx2LzeQ", "stars": 5, "date": "2014-08-09", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "x1RhqWY9ZeHFmJBD3sEdRA", "review_id": "Q4Lo-X4Iqnrld9DVAjpb8Q", "text": "Love the wings! Our favs are Asian Garlic and Strawberry Hot. Service has always been great and food comes out quick. \n\nBest day to go is Thursday it Wing Night.", "business_id": "zBGfa6Vx4K59v8OR81gzJg", "stars": 4, "date": "2012-06-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "ND0Eo9i4AKPAR9dXs4WV5A", "review_id": "5p0UqKg7Oiwb6Yn2o3-zXg", "text": "Disappointing.  I usually love this place but the hostess was rude and the waitress wasn't the nicest either.  On top of it, I ordered something new-the tilapia and shrimp.  It smelt so bad!!  I tried to get over the smell but it was tough.  Fish was soggy and just not good altogether.  I would suggest a different location? I've never had a bad experience at this place before.", "business_id": "bbmuF6LtbP51bk0Ia0p1rw", "stars": 2, "date": "2014-06-28", "type": "review"}
{"votes": {"funny": 6, "useful": 5, "cool": 0}, "user_id": "A3jj7qoDEhu295hYNFP_Pg", "review_id": "8aHAYKe-t6uLFGd5vZTdEQ", "text": "ok, so at the suggestion of Anandita N, I stopped in at Kay's place for a drink on the way home last Friday night, right before last call.  I rolled in by myself, the place was still hopping, grabbed a seat between a guy that was leaned back against the bar sleeping, and some native american old timer  who was about 3/4 of the way through what appeared to be a whiskey and coke served in a small 32oz plastic pitcher.  I could sense out of the corner of my eye that he was staring at me for what seemed like a good solid five minutes after I sat down.  I did not make eye contact.\n\nThe crowd was pretty ethnic if you will, I felt a bit uncomfortably white walking in there, but nobody seemed to mind or pay attention.  Seemed to be about half the crowd was folks from the reservation, rounded out by mexican, some black guys, samoan/polynesian even.  I was one of the handful of honkies there, which included on old biker dude, and two guys and a girl in their 20's or so.  Most everybody was relaxed and all smiles, just having a good time playing pool and socializing as an assortment of Nightranger tunes played on the jukebox.\n\nThe decor was indeed pretty divey, wood veneer paneling on the walls (is wood veneer paneling even manufactured anymore?), christmas lights strung about here and there, the standard dive bar issue string O' promotional flags.  The drop ceiling looked like it had been spraypainted christmas tree green.  The best part of the bar IMO was what appeared to be a \"karaoke corner\".  Imagine a corner wall mural of Monument Valley, done in the style of a black velvet Elvis painting, with glow in the dark neon colors.  And a coyote howling at the moon. Truly an enchanting sight. \n\nAs far as knife fights and the propensity for violence to break out at any second, I didn't pick up on that last night.  I was thirsty so I pretty much guzzled down my $3 Miller Chill without attempting to make any small talk.   Headed out the door, and that was that.", "business_id": "p8Lx4U-5uvp7TAhT08-wkg", "stars": 3, "date": "2008-07-26", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "LkkuulhHR3XhTwWm73fW-A", "review_id": "KkQ7D8OY7SYZm-7Aucnp7w", "text": "New management has turned this place around. If you can get past the out-dated decor. You are in for a treat! Huge portions, diner style food, friendly service all super quick! This must be why there's always a ton of cars in the parking lot!!!", "business_id": "44Up9Gbs-IKMnt7ULDWu8A", "stars": 5, "date": "2013-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-dndfk1goOEC2sYxklf3yQ", "review_id": "XPtn_mnrOzq-ufrMnz0QRQ", "text": "Dells pizza is the best in town. The crust comes only one way & my favorite toppings are beef with green chiles, the cheese is layered nicely. They have good wings & other bar foods too that are good. The pizza burger is pretty good.", "business_id": "SCMYAkofvwKmI6ChdZFxIg", "stars": 4, "date": "2015-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0JqioLB8jJwCDIvKzmq65Q", "review_id": "L6hVCEb7ASluO-QrGhVOxw", "text": "The food was great, went with me and my girl, and was blown away by the atmosphere, and style of the place. It's not over the top but it's not a hole in the wall, great place to take a first date and enjoy great food and a good environment , Alfredo Pizza was delicious, I highly recommend it to any pizza lover", "business_id": "a9Wk44qJLWoJQT-_H8MB-w", "stars": 5, "date": "2011-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2GE6STh-vgIqUKlShyALeg", "review_id": "rbqQ5FaY_HKUxCSMeb5T_g", "text": "Thanks Chef Chad for the 40lbs. Suckling Pig you prepared for our painting party.  It was delicious.  I recommend anyone hosting a party and NOT wanting to cook to give them a call.  It was a show stopper and tummy pleaser!", "business_id": "a9Wk44qJLWoJQT-_H8MB-w", "stars": 5, "date": "2015-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "MYVgzfsFXMAdByQWUirZlw", "review_id": "JpehFI6QpqozA4C8H3bFPA", "text": "The molasses bread here is to die for as well a the fried zucchini.  While the happy hour selection is limited, the dishes are great!", "business_id": "OjNTZTZ6HYQghJN-3jmwnA", "stars": 4, "date": "2012-07-05", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 2}, "user_id": "9mjItdXixKECanLV6RBIrw", "review_id": "mXPSua_c9qayOHDGqfdAWQ", "text": "This is a good quick-fix gambling spot in the Phoenix area, being close to people living in Ahwatukee, Chandler, Tempe and much of the south Valley. It has the glitz and glamor of casinos, plus the digital sound of slot reels spinning, chiming bells. Mind you, it isn't Vegas, so take it for what it's worth and what it is: a quick-fix. Racketeering laws apparently don't apply to Indian casinos, because more often than not the machines will eat your money faster than a pig would slop, often not even teasing you with even a slight return. It isn't as big as a Vegas casino and there aren't nearly as many around Phoenix, which translates to more crowds. Smoking laws do NOT apply to sovereign Indian nation soil, thus making the environment unsuitable for those sensitive to cigarettes. \n\nThe area has grown from a casino outpost to a full resort, complete with dining options, a hotel, golf course, the new Rawhide tourist trap, a museum and more. \n\nAs an alternative to the flight or drive plus hotel and dining expenses of Vegas, Gila River Casinos function well. However, don't expect the same Sin City scene or to leave a winner. It does, however, make for an enjoyable time out of the house.", "business_id": "O6ogkhJOdaX81sNC9_RAOw", "stars": 3, "date": "2009-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "7zDqr2I0-xpw9HF5Ha54cA", "review_id": "XQQAJPZ678RAenkUEO0mlQ", "text": "Trekked here for lunch one day with some work folk. It left an eh in my mind. Not a bad eh, which is usually a 2 for me, but more like an I'll-come-back-here-if-someone-else-is-dying-to eh, which leaves it at a 3.\n\nI can say that the cornbread is exquisite. It's what cornbread should be. Corn and bread. It's not cornmeal trying to be cornbread. It's not some yuppie metropolitan height of sophistication's chef trying to be country. It's the no shit real deal. I appreciate that. I just have to remember to appreciate it in small quantities.\n\nThe service was pretty on par for it being lunch on a Monday. \n\nMy main dish was the seafood enchilada which was pretty on point, but not as good as the one at Blue Adobe. I was pretty annoyed to see it came with tomato even though tomato was listed nowhere on the menu. I will remember that. I may just return and order cornbread with a side of cornbread.", "business_id": "z1Np8_oQECKWGCwJJ8864w", "stars": 3, "date": "2010-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Uchznb_3tmqIpJTh16iRPg", "review_id": "nSdhywSfgMHEIdVZre49LA", "text": "This restaurant is amazing!  Delicious food and drinks at reasonably low prices.  They also have great servers that provide excellent customer service.  I was glad we dropped in to visit family and they suggested this place.  I wish there were Z Tejas Grills in San Diego!", "business_id": "z1Np8_oQECKWGCwJJ8864w", "stars": 5, "date": "2013-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "T6jYrYQcuEHRMQqQDhQc6Q", "review_id": "Nt35clMgxa9qWHAHqACk_g", "text": "Cornbread!!! Complimentary cornbread after your order. I love their margarita flight, the best is the 6th Street. It's a good place for lunch and one of the best places for happy hour", "business_id": "z1Np8_oQECKWGCwJJ8864w", "stars": 4, "date": "2015-06-09", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "rjsx6_pSqwl0zuiwa_tI2g", "review_id": "Y5a1s8ABeCRbIL8xieh9jA", "text": "I'm fairly new to this area and I'm trying new places as fast as my time and budget will allow - - so when friends suggested we go to dinner at The Keg, I was thinking Sports Bar. I like a good burger and a beer (as long as it is dark), so I thought it would be a fun way to catch-up with my out-of-town friends.\n\nThe Keg turned out to be a great Steakhouse. Way better than a sports bar. The food was fantastic. (Oh, do try the twice baked potato! A winner!)\nGreat steaks, good salads, and veggies . . . we had asparagus and it was done perfectly! We each had the prime rib and it was melt in your mouth perfect. \n\nAnd to top it all off, our service was superb. Our server was knowledgeable, friendly, and there when we needed her and not when we didn't.  \n\nThe Keg is definitely worth a visit or two: when you have out-of-town visitors, when you need to celebrate a life event, when you are hungry for a good steak, when you need to relax over a drink and a meal  . . . . actually there are dozens of reasons to head to The Keg!", "business_id": "xMK01ZbVUYLLoyqoeWAIVw", "stars": 5, "date": "2011-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7bdCfESkLLta4vwxO5tyHw", "review_id": "UMENpOdfwXB424Xyv9O0HA", "text": "Manager addressed our concerns. I respect a company who cares about their patrons opinions and feelings.", "business_id": "xMK01ZbVUYLLoyqoeWAIVw", "stars": 5, "date": "2014-07-21", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "Bh7gtC8Spjy-49mHXbGAvw", "review_id": "en2Rw8zqOGGRG_8F9n8hRA", "text": "When only a serious cut of beef will do, prepared and served by another (instead of your backyard grill)--go to Fleming's. Very nice restaurant with professional waiters, a great menu, and tasty wine list.\n\nAlthough, I've eaten several fine meals at Fleming's, the reason for this recent review is a new discovery: the PINNACLE of hamburgers for $6 dollars at happy hour. A half pound Prime meat hamburger, with smoked bacon, and choice of cheddar, gruyere or blue cheese on a toasted challah bun. Damnation!! best hamburger I've ever eaten. Did I mention 6 bucks at happy hour? Phenomenal.", "business_id": "0ONypOKIhttBz9IJzBE8jg", "stars": 5, "date": "2009-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7igkbKzhTxgRwDGh6dBR0g", "review_id": "E0jDfMtCdastPTYLTam3aw", "text": "This place is so yummy! The spreads they serve with the asiago bread is to die for! I had a ribeye special with shrimp and scallops and it was delicious! I recommend the blue cheese mashed potatoes as a side! It's very pricey... But if you are looking for a nice dinner out I highly recommend this!", "business_id": "0ONypOKIhttBz9IJzBE8jg", "stars": 5, "date": "2014-07-13", "type": "review"}
