{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "UaA5yKEoaA_hFMLGDhQ1wQ", "review_id": "gHlPuGfQtaWWSuQcBLcsfw", "text": "The Doric markets itself as Edinburgh's oldest Gastro Pub and it may very well be true but what one finds there today is at least not what I would call a Gastro Pub.\n\nWe started the evening in the downstairs pub part and it can't say we enjoyed it that much. Went up to the bar to order- asked for the selection of ales on tap. Did talk a bit to the bartender about the different ones and I asked for a recommendation with the response that she does not like beer so they all taste bad to her. Honest but not very helpful, we did however go for a pint of some local ale that was alright. The bar downstairs did however not really feel as if it had anything to do with a place that even tries to call itself a Gastro Pub (slightly worn, both guests and the chairs and tables and not very clean)\n\nAfter the first pint we went upstairs instead and there it looked more like a traditional pub dining room. We were quickly shown our table be our waiter and given menus. Started looking at the selection and I was getting my hopes up. Some of the dishes did sound very nice. Wine list was a bit disappointing as I struggled to find anything by the glass that I wanted. Eventually went for a Shiraz that was not bad but still not what I had in mind. In general I would expect better from a Gastro Pub.\n\nBack to the food - I went for the soup of the day. The day in question it was some sort of carrot soup. It was fairly good, a bit too sweet for my taste but not bad at all. The others in the group went for the Haggis spring rolls and the Confit of Duck Leg. The Haggis spring rolls were disappointing, nothing made better by putting Haggis in a spring roll. The Confit of Duck Leg was good but the marmalade and brioche accompanying it did not really match it.\n\nFor mains we also went for a few different choices. I went for the pork chops and the others went for burger and the Fillet of Sole. It was clear that I made the winning choice - the pork chops had been well-prepared and they were flavorful and grilled just the way they should be. The side of mash and vegetables were  however not given the same expert attention. Vegetables were not fresh and the mash did not feel as if it had been made recently. Still the pork chops were good. The burger was your standard pub burger so the type served anywhere - not bad but not anything different than what one can get at most pubs. The Fillet of Sole was ok, small piece of fish but it came with nice spinach and potatoes but it did not really have a lot of flavor and taste.\n\nAll in all it was ok but not great. Still give it a 3 rating since the food was above average but it is a bit misleading to call themselves a Gastro Pub.", "business_id": "aFVO6hoFlOCN8pKsmJbWjw", "stars": 3, "date": "2012-06-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Yo6WTjxu9mnitbm4639owA", "review_id": "NnfTmSjG2VozIc431DpyFg", "text": "This is just the kind of establishment that live music should be viewed in of a random evening. Anywhere that is similar to an underground, dimly lit cave, which allows you entry to its alcoholic bellows after 1am, is exactly where I want to be. \n\nThe crowd in here is a mix of students, classic rock types, live music devotees and individuals like me who stay out far beyond their bed time, when they should be getting their beauty sleep for work the next day. \n\nBinkies has long been known for its commitment to live music and local bands, and I've seen some really unexpectedly good acts perform here. I like the random charm of not knowing what to expect from whoever is coming on stage next, which is what makes pitching up here for some impromptu gig viewing really enjoyable.", "business_id": "XeX67II3LlNJ49-sg4gDig", "stars": 4, "date": "2010-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ba1inzEfhG0pdjff8MWaUA", "review_id": "e_uE50wcocjoiyRmLDzKDg", "text": "Visited on a Saturday in May. We lucked out and got beautiful weather and the palace was still not incredibly crowded. This is where Mary Queen of Scots lived before being imprisoned. I did not know she actually had three husbands and they show you her actual bedroom, private studies, etc, so it was pretty fascinating. I really want to read about her after doing this tour! There is an audio guide which is included with the purchase of entry and it was quite good, very thorough. I liked you could skip parts, because it did get long. The highlights for me were the beautiful Gardens and the Abbey, both were awe inspiring. The gardens of the palace afford beautiful views of Arthurs Seat, which is nearby. This is a must see if you visit Edinburgh.", "business_id": "F1-S8DkAsFIyrkfTl9MmlA", "stars": 3, "date": "2015-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GQ_9le_MnRYNy_aCJ90wKg", "review_id": "fixG0WxywLq2ekLVuerszA", "text": "Came here for dinner with my husband on Friday and it was fantastic. We both had the fillet steak, blue and it was cooked to perfection - one of the best I've ever had.\nThe nachos and cocktails are fabulous too", "business_id": "QopG-46G0EIeePT8q-4JtQ", "stars": 5, "date": "2014-06-29", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "5Wb9S2KRzavF19g6ATpWjA", "review_id": "pYbdvKvlK_LA0fI9EGfjOA", "text": "You can't beat an arthouse cinema for a bit of chin-stroking. I once visited one in Dresden that literally hadn't been touched decoratively since the 20s, and I always find that any annoyance caused by the poor sound, tiny screens and musty smell are all nullified by the feeling of self-satisfaction that comes over you as you realise you're a clever, intellectual tosser.\n\nMultiplexes are beginning to show more obscure films wih each passing year, so, in many ways I fear for the future of places like The Cameo, but it always seems to be doing well, and with a great mix of old classics, oddities and moderns stuff that doesn't hit the mainstream, it fully deserves to.", "business_id": "vW_krCghxf4GYPRfkgZ06A", "stars": 5, "date": "2010-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cj5QaM5KP1d2pYB63vIpAA", "review_id": "4vQxonDS9SNlXX8jXTeLvw", "text": "It's always exciting gong to the stand! Always good for a belly laugh and a good night out. Come early to get a seat!\n\nStaff are A+ and the food is HUGE portions, so perfect for sharing. \n\nNo stag or hen do's are allowed and is is a comedy club not a night club so attracts a more friendly bunch of people. \n\nWorth going to all year round!", "business_id": "NkyjMfpdpYBKIarzVqY6yw", "stars": 5, "date": "2015-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yegovbbvPSLzaaCOtPprFQ", "review_id": "Oakar1aDtBJxRWoWUJD1Tg", "text": "Slightly pricy for a pub but the food was excellent and the staff super helpful. It was a bummer that they ran out of 2 of the puddings but server very apologetic. Love the story and have been here a few times. Make sure to see the dog statue.", "business_id": "Nq_BMV7kyx9_C3w0Jip6CA", "stars": 4, "date": "2014-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "06g2umoOF_3A4KD-Dxt_hg", "review_id": "FoJxVBeu2X0gzIpG4kZKtw", "text": "Je suis allée a ce pub avec mon pere, la salle etait bondee, donc nous sommes montés a l'etage, mais une serveuse nous a dis que les tables etaient reserves a ceux qui dinaient, mais que nous ne pouvions pas manger la car il etait deja neuf heure... Nous lui avons gentiment si il etait possible de nous garder une table quand le deuxieme etage sera ouvert au bar, puis elle nous l'a refuse categoriquement. Ensuite nous sommes descendus au bar en bas pour commander une bouteille de vin, mon pere qui ne parle pas anglais a essaye de dire au serveur: \"nous voulions boire en haut mais il n'y a pas de place, on va vous prendre une bouteille de vin ici\", puis la serveuse du dessus est apparue derriere le bar et nous a limite hurlé dessus en disant : \" je vous l'ai deja dis DEUX fois que vous ne pouviez pas boire en haut\". Apres quoi nous sommes partis direct. C'est un service honteux, les gens regardent tres mal les etrangers et le pub est super sal, je ne vous le recommande absolument pas, cela vous sacagerais l'image de cette jolie ville! J'ai ete tres deçue et j'espere que cela ne vous arrivera pas! ^^", "business_id": "zpsDyx9wh7LYjtBLTpu_-w", "stars": 1, "date": "2015-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "d2M-B99Mw1FsvUxIZHugIg", "review_id": "ligIFMs2K0RLP6czpnl9TQ", "text": "This cool bar cum restaurant on George IV Bridge in the Edinburgh Old Town is the perfect bar for those wanting a change from the pub without having to pay the cocktail bar prices of George Street.\n\nI haven't eaten here so this review purely covers the drinking experience in The Villager. This is the place I went with friends and family post graduation and was great at meeting the wide ranging needs of everyone there. For the Dads they had Deuchars IPA on tap, for the Mothers they had a deal that runs Monday-Thursday for a bottle of  rose Prosecco for £10 and for the new graduates, well we wanted cocktails and cocktails we had! As well as the trusty staples of Cosmos, Mojitos and Martinis they also had new twists on the traditional and serve a lychee and rose martini or a pear raspberry mojito. I might be criticised for my stereotyping here but I can assure you, this did happen!\n\nThe cocktails range from £5.50 to £7.50.\n\nObviously we were all with parents who were glowing with pride and happy to foot the bill but if you are on more of a budget they have a section on the menu entitled 'Bored with vodka and coke'. This is the section that gives you more interesting combinations of drinks that would cost you the same as the standard spirit and mixer (around £3.50), my personal favourite is gin and sparkling elderflower juice. They say variety is the spice of life and this place is the place to at least spice up your drinks choices and feel a bit more upmarket drinking cocktails and tasty drinks in a nice setting.", "business_id": "rkk2gLhqB3P5lwaGeBiDqQ", "stars": 4, "date": "2010-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "FEqV2eEl3CVmtcMslBsfvw", "review_id": "QjWInNaC8twXbRoBEsgtHw", "text": "An amazing find!  It was clearly our favorite place to eat while on vacation in Edinburgh for a few days.  I did not realize how much of an institution Valvona & Crolla was.  We were so excited to see , that we ended up visiting two other locations and ended up eating at Valvona & Crolla 4 times in 8 days!  \n\nI had a meat and cheese plate for breakfast and it was incredible.  I also had the Papardelle Ragu (at the Multrees location) which was also very good.\n\nThe service at all locations was outstanding.  I've seen some notes about the service being slow and I don't know if that's an American thing.  Most times I've visited Europe, every restaurant let's you sit and enjoy rather than having you feel like they're pushing you out the door to seat the next set of patrons.  Similar to other restaurants, the only time it is \"slow\" is when it comes to the check.  I would highly recommend Valvona & Crolla to anyone visitng Edinburgh.", "business_id": "NLjG1EDhI2Aa71ZoLFqbQQ", "stars": 5, "date": "2015-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hl9fXDbO_F4vwuwLn6j01A", "review_id": "yXjQhGwLm8c30VX099mh-Q", "text": "There comes a time when all pubs start to look like each other, and for this reason the interior of the Antiquary doesn''t differ too much from the norm; it's dungeony, (but at least it's got the excuse of being in the basement floor!) is decked out in dark polished wood and has quite friendly staff. Take into account that the general Edinburgh pub standard is pretty high, and you've got a pretty good quality place.\n\nLocation wise, it's a little bit off the beaten track, particularly for tourists, as it's in Stockbridge, so I won't be making it back there anytime soon! However, they do some good food, particularly breakfast if you'd rather eat than drink, and have some open mic nights, with folk music being the general theme.", "business_id": "71Jz93r-PIkXpAP9Od_YwA", "stars": 3, "date": "2010-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8Qfy1kczrOQ93eHp72HIzg", "review_id": "OgFqcgLJb7E96YSrnHIfoQ", "text": "After having a good experience at David Bann's my vegetarian friend asked me if I wanted to check out Black Bo's. This dinner left me just as full as any other night after I have finished a great steak. Being a meat-eater I would consider converting if I could eat at places like this all the time. \n\nSmall and cozy, the place is unimpressive when you walk in however, stick with it. The food was amazing I started with a vegetable stir-fry crepe with melted brie and cranberry chutney. Then went on to have mushroom and pecan balls, filled with garlic cream cheese, and served with a pineapple chutney. It was to die for. My biggest disappointment of the night was not having discovered this restaurant sooner. Great prices overall definitely worth it, even for those meat- lovers out there.", "business_id": "-rwVxBOV0VNXB12of1N6hg", "stars": 5, "date": "2010-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6ds42aOAl7dGgZraeAlByQ", "review_id": "zZ6YnAp6s0yTuQpsjK6ZKA", "text": "When I first visited Brazilian Sensation there must have been some sort of party. It was the evening, the place was packed, and whatever was happening it had a carnival atmosphere. Despite the odds I found a seat. The result was a wonderful evening.\n\nBrazilian Sensation offers something a little different. A friendly, family owned restaurant that serves real Brazilian snacks and meals. The whole place has an authentic feel, and you get the impression the owners care. It can get a little crowded at the best of times, lunch time tends to be much quieter. You will always feel welcome and relaxed. \n\nI didn't recognise the menu much when I first visited but I would definitely recommend the homemade tropical fruit ice cream, especially on a summer's day.\n\nPrices are standard for Edinburgh and portions are a good size. Reservations are essential from 5pm onwards. Keep in mind that credit cards are not accepted.\n\nFor a different flavour of restaurant, try Brazilian Sensation!", "business_id": "KSaSzOVyWSo4Ma0UkBd56A", "stars": 4, "date": "2010-06-29", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "e8QhVRdQyvWEAX6Mz-JcUQ", "review_id": "kWfbVUbX4YlS2laSLbwyew", "text": "La cosa non è sempre automatica: a volte non basta chiamarsi Hilton per essere Hilton.\n\nOddio, niente di drammatico né sconvolgente...una serie di piccole, trascurabili trasandatezze  o fatti un po' irritanti: tralasciando la arcinota (e quindi non imputabile...come dire...lo sa tutto il mondo) avversione dei britannici per quello strano strumento chiamato bidet, il bagno non era certo perfetto. \nUna strana abitudine che non conoscevo è l'usanza del lavabo con due rubinetti e due bocchette per l'acqua, una ghiacciata ed una bollente,  per cui, se desideri l'acqua ad una temperatura che non sia a 3° e nemmeno a 80° devi mettere il tappo e riempire il lavabo, con la conseguenza che dopo la prima sciacquata l'acqua non è più pulita per cui devi vuotare e riempire nuovamente.\n\nIl tutto in un lavabo a dimensione puffo.\n\nNon pretendevo chissà che, non pretendevo un miscelatore della Grohe ma mettere due rubinetti ed una sola bocchetta di uscita ? No ? Vabbè... \n\nDice...ma c'è la doccia...\nCerto, c'è la doccia ma se c'è il lavabo servirà a qualcosa ?\n\nL'albergo non offre alcuna soluzione di parcheggio...la soluzione più semplice è un parking a 15 minuti di camminata e a 10 pounds al giorno. Altrimenti, parchimetro nella strada per max 4 ore ed alla fine delle 4 ore non basta rimettere una quantità disumana di monetine ma bisogna anche spostarla...magari di 3 metri ma va spostata. \nOcchio che se sgarri 10 minuti la multa non te la leva nemmeno il Padreterno (e infatti l'abbiamo presa).\n\nLa cosa però che mi ha irritato maggiormente è consistita nel fatto che la prenotazione è avvenuta on line, anche sulla base di fotografie ben precise, di un certo fascino.\nSappiamo tutti che chi fa quelle foto è un artista ed una camera, semplicemente graziosa, te la fa apparire come la camera da letto di non so quale personaggio del jet set...ma ritrovarmi in una camera di 3x3 scarsi, soffocante (dimenticavo...le finestre si potevano aprire a ghigliottina solo per 10 cm), opprimente, senza spazio per muoversi, mi sembrava francamente troppo.\nIn realtà quella camera non aveva NULLA a che vedere con quelle viste in foto.\n \nPer fortuna Anna, che non parla assolutamente inglese ma che ha immensa fede nel traduttore del suo smartphone e che, soprattutto, è capace di espressioni facciali che metterebbero sull'attenti un colonnello della Royal Guard, è tornata giù e, com'è come non è, ci hanno dato una camera decisamente migliore, all'altezza delle aspettative.\n\nProbabilmente era accaduto che il ragazzetto receptionist ha visto due vecchietti italiani in difficoltà con la lingua ed ha pensato \"aspetta che quel buco lo do a questi due rincoglioniti\".\n\nCapito male, bambino...non hai fatto i conti con l'Anna !!! \n\nEcco, tutto il resto bene...io la sto mettendo giù un po' dura ma il resto è filato via liscio. \nIl personale della reception, in realtà è stato encomiabile e paziente (ragazzetto a parte) nel cercare di capire il mio english (oddio, quello parlato in Scozia non credo sia molto migliore del mio), il breakfast era più che soddisfacente e il letto comodo.\n\nPerò più di 3 stelle non gliele do.", "business_id": "e8wCD4XNCcxSeTSrAU6xLA", "stars": 3, "date": "2015-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "o7NTwUJ4yHY4gxJPADzrNg", "review_id": "6e9RWP9I0NhZpfzRzhMrdA", "text": "Would eat here again and again. This place deserves every star it gets. Cute, quiet location. Extensive-enough menu. But the food was much more thoughtfully prepared than the location or pricing would suggest. I had the special risotto of the day and it was generously flavored with saffron, and, studded with a tremendous diversity of vegetables, sprouts, and almonds. Every bite was a delight.\n\nA fantastic experience.", "business_id": "WN2QUFWxIiTtUgW-oczrQg", "stars": 5, "date": "2015-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ax1ANDS4fr4n9vxcFiNA3w", "review_id": "SIgQNKCLRUYMG_E_aMevhA", "text": "When your child gets tired of looking at Castle's and palaces, Camera Obscura can be a great break. It's filled with optical illusions and other fun and interesting exhibits and hands-on activities that are somewhat educational but certainly engaging and fun. \n\nThe story of the Camera Obscura, as well as the 15 - 20 minute show inside it are well worth it, but it is a dark room so if you are claustrophobic or afraid of being in the dark, you might want to skip that part. Overall, a great stop for families with kids in the lower to upper elementary ages.", "business_id": "-UwZsTF1q2xaSm4bI_Azqw", "stars": 4, "date": "2013-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l2X7hW8fW6UUmYvHq0AoWg", "review_id": "NULM61esIjHWYiKV-nlVHg", "text": "Wow, wow wow. ich habe bisher noch keine so schöne Bar/ keine schönes Restaurant gesehen als diese/ dieses.\nWenn man in Edinburgh ist und diese location nicht gesehen hat, hat man was verpasst.\nAuch wenn die Preise gehoben sind, lohnt sich ein Besuch hier. \n5 Sterne ohne Einschränkung!!!!", "business_id": "RTKYidJ6nmw0chY3K3zh2g", "stars": 5, "date": "2012-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Yo6WTjxu9mnitbm4639owA", "review_id": "W_PB1BsoRV84-ba9vBfycw", "text": "In all honesty, I don't generally find Lothian Road public houses particularly enthralling, because a lot of them seem to float around the same level in terms of banter and atmosphere. There's nothing essentially wrong with some of the pubs, they've just not got the kind of vibe going on that I usually go for, plus I think there are far superior areas to go drinking in.\n\nSaying that, Shakespeare's is a perfectly decent pub to grab yourself a beverage in, and it's really conveniently located for a pre or post event drink if you're going to the nearby Traverse Theatre, or heading to a gig at the HMV Picture House a few doors up the road. Shakespeare's seems to have been around a lot longer than some of the other places that have come and gone on Lothian Road, or at least changed their name, so it must be doing something right. The place seems to have a good number of regulars in attendance, being your average, laid back pub with no pretensions, which is always a bonus if you're just wanting to relax and have a good gab over a pint.", "business_id": "kzy5m93T7mbZJe9heq4PUA", "stars": 3, "date": "2010-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z6qJ5ZJz979Mpv7eatTIHA", "review_id": "SZVLIq9mMiNop33nl2cVdw", "text": "Situated on The Mound, The Wash Bar tries to give the impression thatt it's the place to be.  In fact, it's not only too far out the way, but also too expensive to be anything along those lines.  I've barely heard it mentioned in two years at uni and only been there a couple of times.\nTo be fair, it's quite nice inside and they have plenty going on in the way of blackboards telling you what's happening.  Further, the decor is pretty nice with shiny wooden flooring and plenty of comfortable sofas to chill out on.  The drinks aren't exactly cheap, but they have a good range and you could definitely find worse places to kick the night off.  \nThey seem to try to attract all the boisterous sports clubs.  However, they're not doing a great job as I'm in the rugby club and I've not heard it mentioned once.  \nThe Wash Bar could be the place to go, were it not so conscious of its own image.", "business_id": "ZRYZBtiRjjYqA8ohMoRn-Q", "stars": 3, "date": "2010-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YlpzPPySUxJsUJHRyRde8A", "review_id": "LvHtUT9Dm6yrzJrs8QcGiw", "text": "Admittedly, I didn't stay here but a friend visiting decided to spend a few nights spoiling herself by spending a few nights near the Castle. Hot damn, if you cut this place open it would bleed sumptuousness and over-the-top Tudorian splendour. I had a snoop around her accomodation - I can't even call it a hotel room, as it came with a shower and a kitchen. Champagne and chocolates, it sure beats Travelodge hands down. Four poster bed, covered in ornate heavy fabric furnishings, austere modernity in neutral colours, the Witchery laughs at you with disdain and waves a hand langourously to send such concepts to the local gaol. With views overlooking the Castle and Royal Mile, there is a price tag to match, but oh boy, I am envious of friends who can spend it. In fact, that is the only reason to drop a star - that common folk like me can only look on in envy.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 4, "date": "2010-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sxXq-U0sgP_0q83BvJzPjA", "review_id": "p4Zl9SQfgk8-Hf4q0N85TQ", "text": "Sadly this is a shadow of its former self. So much has gone downhill -- except the prices -- that this once outstanding spot is now a to-be-avoided tourist trap.\n\nA simple meal for two will cost about £200 with wine but the service will be about what you'd expect of a nando's. Different servers and indifferent other types pop by the table about once every thirty minutes whether you need something or not. \n\nThe Sommelier poured about 200ml in my glass, which I had to send back. The starters were still a good 20 minutes away. \n\nIn short: food tasty but overpriced. Service worst I've ever seen at this price range.", "business_id": "4dIzmqGAhFIcuHfI8CySig", "stars": 2, "date": "2014-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "AuOgUTGbkUL56zbOjutzSw", "review_id": "TceTc18-hFU5FqHfKUkFtQ", "text": "The is a well run pub, right on the corner, right at the beginning of Leith Walk/Street. It gets the people who go to George Street and the People who go to Leith Walk. The menu is good but there is a lack of sit down tables to eat at, just high tables and stools, (unless you eat outside).\n\nThe lounge area downstairs has a bar that opens up later on, and there's a DJ that starts playing from around nine 'til one in the morning. The prices are typical Edinburgh city centre, i.e. not cheap. They have a good selection of beers and the bar staff are very efficient.\n\nI've been here a few times now and the only tip that I'd pass on is not to sit on the couch on the far wall because there is a psychodelic lava lamp spotlight that will shine in your eyes all night in a totally unforgiving way.\n\nThe music that the DJ plays is good dance mixes of favourite tunes, as well as some classic R & B stuff.", "business_id": "vt-Oa0dmsDU2IYeX-Zg6fw", "stars": 4, "date": "2011-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "d2M-B99Mw1FsvUxIZHugIg", "review_id": "sO23c1zfKyJUjKMLiiopQw", "text": "The flyers say this restaurant offers  true taste of India, and if thats true im going to have to put it out there and say I don't like the taste of India!\n\nI was really disappointed with the food here and I wasn't the only one. My korma was kind of watery and way too sweet and the other curries my friends had were equally lack lustre. Maybe I went there on a bad day, the other reviews here are really good!\n\n The staff were lovely and the restaurant itself was really nice so it could be worth going back for the two course lunch buffet they offer for £5.95 to give them another try.", "business_id": "5dUDkaxm5FdQanoNkP86KQ", "stars": 2, "date": "2010-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "evPF39f5HigiUTQa9EPN8w", "review_id": "M_JOj2CGBlSGDqjMlP-3cg", "text": "The Odeon on Lothian Rd has really impressed me, partly because I keep going there on their £5 Mondays! The cinemas seem great, i'm loving the quick ease of purchasing and printing out tickets in the lobby, and the staff are all really friendly an up for a laugh.", "business_id": "T2lP9Ayiua9MOQ-h1F_4yA", "stars": 5, "date": "2015-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6qTm746cdjFyJPYxGrGzwg", "review_id": "IZ_JSB564yBII6UbO3u-1A", "text": "Very elegant pub with restaurant in Edinburgh. We sat on the pub side. Crowd was mixed with a fair share of suits but the place was not snooty.  Food is reasonably priced but 2 to 3 pounds more than other pubs.  Haggis was excellent as well as the pasta.  The place is always packed which attests to it's popularity.  A nice change from the usual pubs.", "business_id": "S-B0LVP2shyyX5Fkhmx30A", "stars": 5, "date": "2013-06-25", "type": "review"}
