{"votes": {"funny": 4, "useful": 2, "cool": 2}, "user_id": "EY2M507w8246POHv37TLyA", "review_id": "-m0UurqLubdV3UdKgx3m5w", "text": "Had dinner here one evening. Ordered the Greek salad with Feta cheese - AND a Gyro platter. plus a glass of lemonade.\n\nSalad was very basic - iceberg lettuce with a smattering of other greens and onions, some feta cheese, dressing - and one olive. Just one.\n\nThen the platter came out - two pieces of Pita bread, several long thin pieces of Gyro meat, hummus, rice - and another Greek salad. Now why the hell didn't the guy who took my order bother to tell me I got a salad with my Gyro platter?\n\nI ate the Pita and Gyro meat along with the hummus and most of the rice. Interestingly enough - this second Greek salad had - drum roll please.....\n\nOne olive! Must be an olive shortage in Pittsburgh. I did not eat the second salad as I was all salad-ed out at that point. I did eat the second olive though.\n\nFood IMHO was just average - it felt more authentic than some of these places that serve you the Gyro meat wrapped up in a piece of Pita with a yogurt sauce.\n\nI got one refill on my lemonade. The older gentleman who took my order was not particularly outgoing or friendly. In fact he was kind of gruff and standoffish - I was very friendly and polite during my visit.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2009-06-20", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "8OvgI9_SZ0_8ZQ535-PEFg", "review_id": "JI4qa4eQxsoyFOyTRk_sJw", "text": "This was one of the most disgusting restaurants ive ever been in.  First decided to sit inside.  There were nats flying all over the place.  So, I decided to sit outside as i had already ordered my food.  However, there were bugs all over the outside patio as well (probably from the standing water with plastic flowers in them).  I ordered a hummus and pita (which they made me think was free but charged me for) a glass of wine, and a chicken kabob.  The food was decent at best.  Then, I go to check out, my dinner was $25.  Better yet the cook who was checking me out had the nastiest yellow finger nails i have ever seen.  I thought i was going to throw up but i was too motivated to get out of there.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2009-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dd0jxaSri5q9ufScWHuy7g", "review_id": "7bW2VQOAwpKeCWRyYUJPwQ", "text": "Christos has European charm along with wonderful Greek food!  The owner is very caring about the comfort and enjoyment of his customers.  The home made wine, red is the best, adds a great touch to the food, although people who want can byob.  \n\nOur favorites are the spanakopita and the exohiko, lamb in phylo dough with a great sauce.  Can't leave withotu tasting the Jackie O desert.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 5, "date": "2010-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "izawilPFdo6mxCbmBKeJpA", "review_id": "9wtzkMwQHXrZQavjbF9fqA", "text": "The food was clearly microwaved (ie the ring around the soup bowl and splatters along the sides). The fish was rubbery. The wait staff, although nice, was very salesy always trying to \"add on\" something in a pushy way. \n\nI asked for my check and barely ate anything. I think the waiter got his ego bruised because he decided to display his \"Best In City\" award right behind my head as I was still sitting at the table... a shame the award was from 2005! I guess a lot changed in 7 years?\n\nDon't bother with this place!", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2012-08-17", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "cSStu8p4Ep1GAokE7UVGLg", "review_id": "PbIrXNeGi7xZiBrd-aX7bg", "text": "WARNING. DO NOT GO HERE.\n\nMy family was visiting my sister in Pittsburgh and we had our eyes set on a specific restaurant, not Christos. A gentleman, I presume the owner of Christos, saw my family and I as we walked down the street. He flashed us his menu, pitching to us why his restaurant was the best and why his food was the best. I could barely tell if he was selling food or used cars. I kindly told him we were not interested. My family, however, was indecisive when it came to getting a restaurant. We ending up wanting to go eat at the restaurant next door to Christos so we backtracked. Again the owner flashed us his menu, sensing our touristy indecision. I again declined and pointed to the restaurant I was heading to. He then ignored me and pan-handled to my two sisters, mother and wife. They gave in to my dismay. As they said \"sure...\" I looked inside the restaurant of Christos at peak dinner hours.  No one was inside.  Absolutely no one. As my family walked in and I rolled my eyes, I thought, well let's give them a chance...my whole family seemed to feel bad for the guy and I like Greek food.\n\nAs we got in, it seemed nothing was going on. We had just came back from kayaking so we needed to wash our hands. They didn't seem to have a restroom but they took my sisters and mother through the kitchen and downstairs to find one. The silence was broken when they finally put music on and suddenly a couple of kitchen helpers came out and looked like they were warming some of the kitchen equipment up.  Were we their only customers tonight? I bet we were. Before I could settle in, he casually asked if I liked pita and hummus. Obviously I said yes. He was asking me so casually when I didn't even have a menu, I assumed it was complimentary when he said he would get me some, but as I waited I found his restaurant on Yelp with my phone and the first review gave them one star and mentioned how the owner didn't tell him the pita was extra.  Great. \n\nThe rest of my family later came back from the restroom (akin to going to a restroom at a grocery store where you're around stock items...except you need to go through their kitchen). They started with salad. The waiter asked if I wanted anchovies or something else on my salad. I was going to say \"sure\" but my wife stopped me and said it could be extra. The waiter, looking like he got caught, verified he was offering all extras to me even though earlier the owner said salads came with dinner. I had to say,\"I just want the standard salad, nothing extra.\" I couldn't let my guard down.\n\nWe ordered some food, priced about what you'd expect.  The pita and hummus I ordered earlier was just barely average so I don't know why they thought it was worth $4. My sister ordered \"leg of lamb\" so I expected to see a leg of a lamb. Instead when her plate came out, it looked like sad slices of ham. Really. We all got vegetables but they were soggy and unappetizing. I saw them earlier in the kitchen sitting in a big pot when I had used the restroom. Nothing here is fresh. My lamb was on the chewy side. My sister's \"leg of lamb\" was left uneaten and she asked if I wanted some. I \"tried\" to eat it but it was too chewy. They then asked for dessert. I wanted to say no out of my discontent but again my family members all said yes, even when they were telling me the food was not great.  I don't have their sense of pity. The desert and salad were the best things of the night, which was kind of sad. \n\nWhen we got the receipt and my wife insisted we check it.  Surprise. They overcharged us $7 from two mysterious items. Their receipt doesn't even list what you ordered. I went up the the cashier to ask them what the two items were. He tried to explain one but he really couldn't. He scratched out the $3 item. I then questioned the $4 charge. Again he tried to explain it but he really couldn't. Again he agreed with me and scratched out the $4.  On top of all this we still gave them a normal tip out of pity. I could tell the waiters were just following orders. I could tell the owner had trained them what to say and how to make extra money.\n\nYou've been warned. There's a reason why this place is doing so poorly.  There's a reason why the whole hour between 7:30pm and 8:30pm we were the only ones in the restaurant. There's a reason why the owner is begging customer to come in. They're cutting corners on customer service and food quality in exchange for salesman tactics, overcharging and tricking you to buy things you don't even know is extra. DO NOT GO HERE.\n\nOwners like this will say,\"But I have to or else I won't make it.\" You know what? Restaurants like yours shouldn't make it. Not to be harsh but it was a poor experience. Change your food, your sales tactics and your fake receipt items strategy. Maybe a long time ago when they started they were real but now they are doing every dirty trick in the book to nickel and dime you.  \n\nWARNING. DO NOT GO HERE.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2014-06-04", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "fMhoyozpOmBk5KSEwCDkUQ", "review_id": "WCFy3Q4Aucc5E9bZQgCTqg", "text": "This place is something STRAIGHT out of a David Lynch film. It felt like I was transported to some sort of alternate reality with the help of a smiling, and overbearing greek man outside a restaurant door preying on the weak and indecisive. Something in the air of this place comes off as so fundamentally strange, and almost, discomforting and nightmare-like. You are going to feel uneasy, is what I'm trying to say. \n\n- They overcharged us, probably intentionally. They don't have itemized receipts. \n- The waiter kept giving us options as if they were... free options that you're supposed to choose. We caught on when we specifically asked if they cost extra.\n- The elusive bathroom felt like we were descending down the staircase to hell. Better than nothing, I suppose.\n- The food.... oh my god. None of our food was good. In fact most of it was outright gross/uneatable. The hummus was decent, but... I can also get decent hummus at Trader Joe's. \n\nWe initially felt bad for these guys. A struggling business is always sad to see. But with all of the strange behavior, attempts to scam us, etc. that sympathy turned into a sense of understanding as to why this place isn't doing so well. \n\nIf the owners are reading this-- I'm sorry if my review came off harsh.. but really, please, rethink the way you are going about your business. I don't want you to fail, I want you to overcome this. Do it the right way, not the scummy way. I know you're trying, but try differently.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2014-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YuWNDnawAz-E9amYCOknZA", "review_id": "CZtcsm21Wdi1F3JTHzHQxg", "text": "Off the path Greek restaurant, in a town with a million restaurants, this was one of our favs. It is homey, great service, good food and outstanding prices. Go there just to meet the owner Christos, a remarkable man who cooked for Jackie Onassis and offers her signature dishes. Fresh, homemade, and authentic cooking. Ask Christos for his recommendations. We loved the Greek coffee, homemade wine, and dessert. And the food was great too!", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 4, "date": "2015-07-22", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "ljGxYz9as2xIvojzh-5Row", "review_id": "AraNiQ8FNHuh792yv_2oPg", "text": "If you like rotting salad, rude staff, greasy food, stupid stories about Jackie Onassis and her favorite dessert then this is the place for you. Absolutely terrible. I cannot say a single good thing about this place, it's just tough to figure out how they remain in business.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2015-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r7kKgGnX3w-mY2hoWdIh3w", "review_id": "SGV9UNFoLyJy18-dtFjBTA", "text": "Australian here travelling from sydney and a lover of Greek food and all Mediterranean Cuisine. After traveling through the states i was after some real home made type food. I ordered some hummos and bread, leg of lamb with rice and vegetables (and of course Greek salad). Waiting for my meal the place looked a little run down but at the same time homely. There are pictures of family and their history all around. The server (who i think was the owner) and the Chef were two of the lovliest men i have met. I ordered my food to go as i had to get back to the hotel. The food was SO good i almost made myself ill trying to eat more. The most DELICIOUS hummos i have ever had. I also got talked into a dessert cake he called the \"Jaqui Onassis\" a Vanilla cake with fresh cream and cinnamon. Also lovely. Not a bad word to say about this place. Don't let looks deceive you!! This place is the real deal.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 5, "date": "2015-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "S1cdgvzcJSgUrGdh3wvz9Q", "review_id": "VuAzoWevG_k1qW0URtZT-A", "text": "Food lacked flavor for every course. Service was very bad even though only 2 tables were being served at the time. The leg of lamb was flavorless strips of low grade meat, maybe lamb. Waiter will try and hard sell at every interaction throughout the meal.", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 1, "date": "2015-08-23", "type": "review"}
{"votes": {"funny": 4, "useful": 9, "cool": 5}, "user_id": "6xS41eiB_7MHNjT411-0Cg", "review_id": "_N-EMRda0AtNrsbZCNvtzQ", "text": "This place is a run down, out dated, hole in the wall restaurant with slow service and creepy decor.. and it's fabulous. \n\nWhen you walk into the Christos, don't expect to be greeted- you won't be (unless someone pulled you in off the street). Plan on walking to the back to find someone who may or may not seat you, or you may be told to sit wherever you want.  I would recommend sitting outside, although not your typical \"patio seating\" ambience,  it's (in my opinion) the better option. It's teeny tiny and super old school. The menus are old and messy, but you're not eating those anyway, right?\n\nSo all of that aside, Christos is a really fantastic little family owned authentic Greek place that serves really great food. They serve it slow, but they serve it good!  I ordered the hummus and pita bread as an appetizer  (yummm) and the Greek Pizza as my meal, and it was so good! I really loved it, and you can't beat the prices. My lunch was all of $12, and I ordered a soft drink, an appetizer, and a pizza that came with a salad... and it was good! \n\nThe point to me pointing out all of the negatives first was that you can't ignore the obvious and pretend it doesn't exist.. truth is, all that stuff is true. But if you're prepared for it and willing to overlook it, you will leave pleased. Just keep in mind that it is a family owned establishment- there's no advertising, no sponsors, no corporate funding.. don't go in expecting top notch service, or hip decorations. But do go in expecting genuine, sincere service and great food. Give Christos a chance, maybe it's your thing and maybe you can't get on board, but I will always look past an exterior for good food and to support a local business!", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 4, "date": "2015-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "SwP6dxmxAHe_T5bar0yV9w", "review_id": "0elCx-eovjNSkO8-Pyd2Fw", "text": "Great family atmosphere... \n\nFood is average. Get the hummus without onions or you'll be overpowered.", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 3, "date": "2011-08-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "24VCi4fDt9cyn9NVLuq6MQ", "review_id": "CLGk2kNoUTebNAqQN7eFug", "text": "We went for Brunch on a fabulous sunny day. We sat on the deck. The waitress was kind and friendly. The Mimosa was extra large, no skimping here! The veggie flatbread was delicious although the olive oil tasted old, rancid....perhaps the bottle sat out in the sun too long, perhaps they do not go through enough. It kinda ruined my  veggie flatbread. We will return to try more...because I want more :)", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 3, "date": "2013-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Qa25c7fF3bN68r2tU-3iiw", "review_id": "ecUOgIs6QQZfxxFO0sRw-w", "text": "This is a great find in Pittsburgh and out of the way.  Located on the back of Mt Washington, you will only find locals here.  First, the ambiance I so pleasing.  It is an eclectic place, tastefully done and offers inside and outside seating.  My favorite is sitting at the bar which is a split bar, like a mirror image.  There is something magical about this place in addition to great food.  The lighting in the main dining room is artful--adorned by CX design lighting like walking into a forest of glowing hanging flowers.\nFor starters we had the humus sampler which was a meal in itself.  I had a hankering for something different and went way outside the Mediterranean venue and right into the meatball hoagie.  I don't know why, but I did and was so rewarded. I am finding the breads in Pittsburgh to be their best kept secret.  My wife had the grape leaves as a diner and it was such a generous portion we needed to take it home. One of our guests had a lamb kabob, that was tasteful but the lamb was a little tough to cut.  I f I get to Pittsburgh again, this is a must.", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 4, "date": "2013-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Kfj0jts_zq1Tvt1ZLUCrrQ", "review_id": "PpZrYBHml_ftqr3EBhww3Q", "text": "Wonderful surprise in the South Hills desert of chain eateries. Romantic interior that's a refreshing throwback, and the best hummus and iced tea I had in Pittsburgh. The kebabs are sizzling, generous, and delicious, and the staff friendly.", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 4, "date": "2013-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p-7k3F4wnULPq9g85KKuBw", "review_id": "Jx5GGPaNZ_K3PNEFxtUmQw", "text": "This is a restaurant that has been there for ions and there is a reason why.  It's not on a main road nor is it very easy to find or get to if you are not from the immediate area.  But, it was a dedicated following.  Why?  Because the food is amazing and the staff is friendly.  The hummus and the tabouli are perfect--the best I ever had.  But, what brings me back time and time again is their She-Crab Soup!  I know it sounds crazy that a mediteranian restaurant on a back road of a Pittsburgh suburb would have the best She-Crab Soup in the whole darn world but trust me....they do.  I go there for that alone (and their martinis....they leave the shaker with you so you can have the dirty rocks!).  My husband loves all of their lamb dishes--the gyros and the gyro salad included.  Their fried zucchini rocks too.   GO!", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 4, "date": "2015-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "eEUioahVwgWIs89C1AsEbw", "review_id": "8lr7D6p-OtNsNsZdztzDrA", "text": "Best tabouli salad ever! Plus you get pita bread with oil instead of traditional white bread before your meals.", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 5, "date": "2015-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y7EpqcBOeD28J8j3-2qcXA", "review_id": "OFHkDDjzTQTROCVr1UpXuQ", "text": "Amazing food and beer selection with both being reasonably priced. The staff is courteous, knowledgeable and give prompt service.", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 5, "date": "2015-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RZQKyXCUV9gAT3IiLultvg", "review_id": "izictyJWDx5KUxAjAAJ3ZQ", "text": "I absolutely love Amels. It's intimate, delicious, friendly, local...the list goes on. I've tasted a variety of delicacies including their fabulous hummus, grape leaves, stuffed eggplant, gyro plate, steak, etc...all of which have been cooked to perfection and amazing.\nI highly recommend reservations, especially on the weekends. Pro tip: if you like to dine a little bit later, say past 8pm, you shouldn't have an issue getting seated. The staff here is very friendly and won't rush you; plan on a relaxed evening!", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 5, "date": "2015-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e7lJwGbdJsrFziQoXKNJ6w", "review_id": "jnvvsceakt9-0enq5e7MQQ", "text": "What a great find (thanks to yelp!). I have lived in the area for a long time, and McNeilly road is simply one of those roads that I never have a reason to travel.  As a bonus, the weather today made seating outside the optimum choice.\n\nI ordered the Moroccan Couscous, which included chicken and lamb, with the fatoush salad.  My companion got the Chicken Taboo, which included hummus, also with the fatoush salad.  Both meals were full of flavor and fresh.  The seasonings, such as saffron, really set the meals apart.  Although we were there during the lunch hour, our meals were dinners.  We are stuffed!\n\nThe parking is very limited but there is a large lot across the street where the Aldi is.  Maybe parking is OK there? We got lucky - we got the lone spot right in front next to their sign.  We walked maybe 10 feet.  \n\nThe outdoor seating is nice, with umbrellas to keep the direct sun off. I did notice ash trays on the tables.  If there were smokers present, we would have eaten inside.\n\nService was quick.", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 4, "date": "2015-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "hHBBVfKXhDD8XAtY7bpM7Q", "review_id": "NflUxvj1eN5WKmtL-Ox_JA", "text": "Very good.  I am part Iranian, so I know my Persian food.  Meat here is cooked perfect...very tender.  Came with a large party once and the owner (who is super nice and accommodating) brought us a sampler of all the meat.   In general, I love to order the ground beef kebabs and lamb kebabs at Persian restaurants and this place doesn't disappoint (I like to add sumac, which is on the table to all the meats and sometimes the rice).\n\nOnly disappointment for me is that they don't have a clay oven to make homemade Persian lavash bread like they do in all the restaurants in Atlanta.  Instead you get pita before your meal.  It comes with onion and feta.  You can ask for mint and eat it with the bread, onion, and feta.  Sounds weird, but that is common in Persian restaurants.\n\nEggplant dip is very good and is a must in any Persian restaurant.  I wish they had more than one eggplant dish, though.  Ice cream is really good.  Baklava is good, but not the best I've had.\n\nDefinitely a must try in Charlotte!", "business_id": "UFvogJEUiLSJwyx2LSz2uQ", "stars": 4, "date": "2013-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "OyzjdoEb6xJcFNNjnpQVxw", "review_id": "d7TZTOD2HJTYiVQvzlPv1g", "text": "I came here one night to see a DJ play. It's an interesting place in a rather blah location. The parking lot is torn up, it's not easy to get to and it's kind of run down inside. The hookah gets overwhelming for me, but there are plenty of couches/chairs in the back. The DJ was good given what he had to work with and he got people dancing. So all of that does not equal 3 stars. What does jump it up to 3 starts is the food. The kabobs were amazing melt in your mouth. They were out of chicken so we got steak and definitely good food. The hummus was good as well. Overall due to location I probably wouldn't come back unless someone really wanted to go, however if you are in the area or live near there definitely give the food a try as it's really good.", "business_id": "UFvogJEUiLSJwyx2LSz2uQ", "stars": 3, "date": "2015-06-22", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "ZYaumz29bl9qHpu-KVtMGA", "review_id": "-Nx7_eCLnhH3QBuqnKgrdg", "text": "As everyone in Madison knows, there are no doughnut chain stores around.  No Krispy Kreme.  No Dunkin Donuts.  Although I know that the best doughnuts in town are from the Greenbush Bakery, sometimes it's just easier to go with the place down the street.  \n\nThat basically sums up the People's Bakery.  When you're too lazy to go anywhere else, they are pretty good.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 2, "date": "2008-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "7QVWvCcgwZgV6SCjw4s9aQ", "review_id": "0IdaNIBbBejT6mGSeGzDOA", "text": "Kind of tucked away and hard to notice, especially being next to the really glammed out Ella's Deli. But worth a visit if you're looking for a good gyro or kebab. :]\n\nThe donuts are alright too. They have a wide variety! Myself, I really rather like their cookies. They also offer homemade baklava.\n\nReally though I can reccomend their sandwiches with a side of the seasoned fries. Quite yummy! Vegetarian options also available such as potato kahbi or falafel sandwiches. And they had a lot of beverages to choose from too.\n\nAlthough the location is not ideal, it's worth a stop if you're in that part of town. :]", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 3, "date": "2009-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "4GYlYNPsfFx6HdPZ-DF6cQ", "review_id": "cghgxHyL8omIyf8SuxIAyQ", "text": "The doughnuts are good (and pretty cheap!), but I really love this place for a quick, cheap lunch.  They make their falafel and gyros fresh, so be prepared to wait a few minutes for them to put 'em together.  There's a small dining area, or you can take your food to go.  The owners are friendly and efficient.\n\nThe only thing I really wish this place would do is make fresh bread and rolls, but it's strictly doughnuts and sweet pastries here.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2010-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "W0L9qw8Ulec-SvnstoOsjw", "review_id": "zImM60mcTGY10hqqALRpJw", "text": "Best Gyros, hands down.  And reasonably priced too.  Good chicken sandwiches.  And their mediteranian entrees are delicious as well.  As for the donuts, they are above average but not amazing.  The owners are so kind.  I like going here.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2010-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "no9odAfwocTruGYGNUVcIg", "review_id": "2jb96dbwVqlS7qza4urlOg", "text": "The food and service attitude is pretty good for the price you pay.\nThey also got all kinds of beverages to go with your meal. They cook it fresh after you place an order. The owners are very nice.\n\nWe had the vegetarian meza. Everything tastes good, though I've definitely had better middle eastern food before. But for the price you pay, the food is well worth it. All the basics are done right, e.g. dolma, hummus, kabob/shawarma, cucumber yogurt, kofta, kebbi, etc.\n\nBut I will mention stuff they could improve a bit more:\nThe red pepper paste was a bit bitter, but taste fresh\nTabouli was a bit saucy (ask them to use less dressing).", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2011-07-07", "type": "review"}
{"votes": {"funny": 5, "useful": 1, "cool": 0}, "user_id": "6kp815UUjK--ukUjmDlSCQ", "review_id": "vq6HsM2Qjvn9dllTzZdjsg", "text": "I haven't had any of the falafel or gyros here.........yet.  I have had the opportunity to fatten myself up that much more by eating some of their delicious doughnuts.  They are really cheap AND really good.  \n\nThe owners are a friendly, older couple who look like they are workin' hard.  I asked if they would be my new parents, and they just laughed, but I was serious.  Will you be my new mom and dad?  Or how about my new granny and papa?  I won't ask for money..............just doughnuts!\n\nI'm toilet trained........\n\n*knocking on glass window*\n\nPlease???", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2011-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YT0iTm2y-Q9CoQhzYnIWSA", "review_id": "dDuJuPs54b5phLMkwFEZvg", "text": "Awesome gyros at a great price... haven't tried anything else yet but I am definitely a fan and will continue to go back (at least for a gyro)", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2012-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "hyxZfJkC3UckkDbzBH9clA", "review_id": "o9kBdeBVmqLiymTCLSgAJg", "text": "The donuts are amazing and super-fattening of course, but then I guess you shouldn't be eating donuts if you are concerned with your weight.\n\nI agree it is by far the best gyros in town, I am originally from Chicago and am used to the quality of gyros found all over Chicagoland, this is cut the same, same thickness, same style, the flavor is similar, but has it's own thing going on. Either way, that Parthenon in Madison is crap, people rave about it, what a joke, they have no clue what good gyros is, take a road trip and go eat at Hubs in Chicago, then you will know finally what great gyros is. In the meantime, if you are stuck in Madison, this is by far the best you will find, don't waste your money and calories elsewhere.\n\nFalafel is good, has it's own unique recipe, works for me.\n\nTan Tan Chicken is very good too, highly spiced, which I like, although not spicy as far as heat is concerned. Comes with an awesome garlic dip, which I've only found in Los Angeles at Zankou Chicken, which by the way is the most incredible middle-eastern chicken ever. They even made a \"Curb Your Enthusiasm\" episode about it in 2011. If you get out to LA ever, you must go to Zankou and get the Chicken Tarna with the garlic dip, the hummus is also the best ever. Almost enough to make me want to move back to LA. In fact...\n\nAnyway, People's Bakery is truly a gem in Madison, amongst all the questionable eateries, which some say are great, others say bad, this one is clearly a huge winner. And it is a real Mom & Pop, literally they made all the food for me, super friendly, down to Earth, real people who deserve to have your business. Go there now!\n\nP.S. I also liked a bunch of other stuff there, the hummus, side dishes, veggie mezza, etc. Probably can't go wrong with anything there.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2012-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "LiQJP-p2xOWxnHDdPmcGbw", "review_id": "w8rt_MEsjxWR0JNn41yhww", "text": "Great place to go for gyros, falafel, and lots of other delicious Mediterranean / Lebanese food that's worth trying. Also, the food is really cheap - you can get a whole huge bag of great food for under 20 bucks. An older Lebanese couple run this place - they are very nice and do a good job. As far as the bakery items, go with twisty donut things w/ the red strip down the middle or the baklava.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2012-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "sd4kstHD9zl4UIG47mSUCw", "review_id": "rGdE_7COel-VXOb4Mgy6IA", "text": "Donuts as BIG as your head!  Fresh Lebanese food made to order made by the friendly owner!  Such was my experience today at People's Bakery.  I don't really understand why the place was so empty today but it was fine with me.  I ordered tabbouleh, baba ghanoush, hummus, pita and a giant donut!   You'd never think we would have authentic Lebanese in a generic looking mini mall in Wisconsin but we do-I feel lucky it's just a few blocks away from my house. \n\nDownside = Styrofoam containers...I might attempt to bring my own next time to avoid them!", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2013-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WKQKNmWL8_FH5vFHYlp8hQ", "review_id": "RSzjibcjjI0kZEW-DtqIYQ", "text": "Went there today with my fiance.  We had the hummus and lamb and the felafel.  The lamb was amazing.  Little pieces cut up and placed on a bed of hummus.  The hummus was very smooth and great texture.  The hummus was good, but Bunky's is still my favorite in town. \n\nThe felafel was good, not too heavy.  Serve in pita bread with a sauce and veggies.  They have a good selection of beverages, they had my favorite Nantucket Nectar and some good bottled lemonade.\n\nAfter our main course we decided to try some pastries.  The baklava was amazing.  It was light and flavorful.  We also had a french glazed doughnut which was better then Greenbush.  \n\nThe lady that works the counter is very friendly.  When we went back to purchase the pastries we only had credit cards, and they have a $5 minimum.  She let us just add it to the tip of our original bill!", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2013-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "C00-yXJR3WJKt8NdCBzqxQ", "review_id": "XrjkdmcShK1LxShRcEqCBw", "text": "So good!!! We went as a group and everyone loved the food they ordered.  The food was very reasonably priced!! Yum!", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2013-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dT9zssrtvlv322dDXUc_tA", "review_id": "Z3DGMKEf2pLbFdmArRY-yw", "text": "Stopped here a few times for the yummy baklava. I've eaten lunch here once and it was fabulous. I had the tan-tan chicken and it was amazing! Moist chicken and lovely flavors.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2013-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lB4hOIAWg2-L3Xmx_vNQKQ", "review_id": "8oU3JrGYTd8L2714dUTMBA", "text": "Herein lie the finest falafel sandwiches in the area, and that's all that's needed to justify my continuing patronage.\n\nThe donuts fill the display cases with colors, and fill the air with intoxicating scents. So many different shapes and sizes, but the freshness and delicacy are consistent throughout. The \"Rapid Dozen\" is a good value, providing a diverse sampling of donut types to take to work, provided they make it that far.\n\nStill, my main inspiration behind the countless visits through the years is the Lebanese cuisine, and specifically the falafel. You will find plenty of tasty dishes, from hummus and babaganoush, to kebabs and gyros, but the incomparable falafel stands above. There aren't, truth be told, more than a few real competitors for Madison's top falafel (Banzo is also great, then it drops off), but those found at People's are really top notch, competitive with any I've had throughout the country.\n\nThe prices and the falafels simply cannot be beat, and the owners are incredibly warm and friendly people who have been crafting joy through delicious food for many moons now. There is nothing to keep me from recommending People's Bakery with the full five stars.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2013-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "a0PfJ18hkhemRlEuMIXYQg", "review_id": "bkz5pUJfy08R81ifUcoDIw", "text": "Their food and pastries are good, but most importantly they had the best baklava I've ever had.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2014-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RvweNJFVkR3ttkWsIBy7nQ", "review_id": "dbIk8Kx0t8Ob4aCwFkVfGg", "text": "I am pretty disappointed with this place.  After it being described as the best gyro in town, I was let down. The gyro is good and it is only $4.50. However, best in town? Eh. \n\nThey forgot my tomatoes. There is nothing really terrible about this place, but it was just \"ok.\"", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 3, "date": "2014-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "Uic5YWIA6AymYojHJHBJug", "review_id": "-mfPRE6FMjwlR5r9ejjfsw", "text": "I've been here a couple times for the donuts, which are awesome. But I didn't feel compelled to write a review until coming here for dinner a few days ago - the food is absolutely delicious! It's a shame it's not more obvious from the outside, but the lunch/dinner menu is extensive, the prices are excellent, the people are friendly, and the food is phenomenal. I got a gyro sandwich and it was enormous, delicious, and only $4.50. \n\nI love Banzo, which is the obvious point of comparison for People's Bakery, but I'd probably choose PB given that the food is just as good an a whole lot cheaper. I'll definitely be coming back!", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 5, "date": "2015-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "I3qt_NaZfu3j5RfCQTiq4Q", "review_id": "EAG9XvIvEEAqrTXev9XHZQ", "text": "The restaurant itself is small place, with a bad lighting. Looks like an old and unloved place by its owner. The owner usually has an attitude towards the customers! He's angry and look fiercely in your eyes, as if you shouldn't be there to taste his cooking! It is not irritating though, I feel it's more funny and something to laugh at with friends! \nIt's a one man show by the way, he is the cook and the counter-holder. Works almost like a fast food, except for the fact  that it is not fast! \n\nNow the food itself. I've had Shawerma here, as well as Falafel and some other stuff which I can't remember their names. By far, the meal you want to order in this restaurant is the Shawerma. Having said that, I prefer the Gyros from \"Zorba's\" which is just 2 minutes walking south of this place. They are more tender and juicy, and the bread in their Gyro is much better.", "business_id": "-1oj6-fkP-iO6OyW8QBqPg", "stars": 3, "date": "2007-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "CX4GcrCCnzfNyAl0cPqGbg", "review_id": "jCQhGWnIg6LW8Zr9dBeKTA", "text": "I always walk past this place but never thought of trying it because it looks kinda shady. It is usually pretty empty, lunch or dinner time. So, I have no clue how this place survives. One day, my friend ordered some falafel and grape leaves wrap for takeout just for the heck of it. She was a little unsure if she wanted to try them and I ended up being the scapegoat. The food wasn't fresh and my friend saw the guy reheating the food in a microwave instead of preparing them from scratch. The falafel ended up a little dry and the little leave wraps were sour. I was not sure if it was supposed to taste like that but I found it awful. Maybe I should try the shwarma instead.", "business_id": "-1oj6-fkP-iO6OyW8QBqPg", "stars": 2, "date": "2007-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "KBbqwqTnnOJT51DHB2-SkQ", "review_id": "faSdsW2s_SaVN0KTy-R2MQ", "text": "This place is fantastic- I eat lunch here at least once a week (have not tried it for dinner).  I know middle eastern food well, and have eaten falafel in many cities.  The falafel sandwich is one of the best I've ever had.  The yogurt salad (yogurt with cucumber, mint, parsley, etc.) is delicious, and the lamb kebab sandwich is also fantastic.  The prices are AMAZING.  This place is so far above most of the junk you find on Green St.- I highly recommend turning on to Wright St. instead of continuing on Green when looking for a tasty, inexpensive lunch near campus.  They also have incredible meat and spinach pies, and a samosa with the most delicate, tasty shell I've ever had.  It's definitely a hole in the wall, but the owner plays jazz, blues, and middle eastern music, or the news, which makes it a pleasant place to sit and eat.  It's a must try.", "business_id": "-1oj6-fkP-iO6OyW8QBqPg", "stars": 5, "date": "2010-07-08", "type": "review"}
{"votes": {"funny": 4, "useful": 8, "cool": 0}, "user_id": "6nqakbu2zU6fjOmbE83_-A", "review_id": "KZkABGTlDcFeKZ9KQLfxiA", "text": "The complaints I've heard about this restaurant are numerous, ranging from bad food to the infamous Soup-Nazi-like owner.  So why did I give it so many stars?  Many people would hesitate before eating at Jerusalem Restaurant, and I can't blame them if they have been spoiled by American restaurant standards.  In defense of these kinds of restaurants everywhere, I would argue that you have to be at least a little adventurous (and patient) when it comes to eating ethnic food.  \n\nI've become a regular customer because Jerusalem Restaurant is just so STRANGE, and kind of endearing in its own way.  I know that there are limitations to excusing poor service/attitude because of cultural differences, but I have never thought of the owner as malicious or incompetent.  Every visit, one of my friends makes an attempt to get the owner to smile (I've witnessed it, and it is a truly uplifting sight).\n\nBelow, I've documented some of my observations while eating there.  I know that these are probably factors that cast the restaurant in a bad light, but personally, these are the type of experiences that have made me come to enjoy (at least for humor value) my visits to Jerusalem Restaurant.  Read on:\n\n* I first came into Jerusalem Restaurant with friends, and we all decided to order the daily combination plate.  When we got to the counter and placed our orders, the owner just asked each of us, \"Meat or vegetable?\"  We all requested meat, assuming that we would just receive whatever he was making for the daily meat dish.  To our confusion, when we received the meals, we each had been given a different meat: lamb, fish, and chicken!  (We learned later that you can just request a specific meat.)\n\n* I have struggled to decipher the numbering logic used at this restaurant; this is the first example.  When you look at the front counter, there are sheets of paper that show a condensed menu, just the most popular items served at lunch.  Instead of writing Combo #1, Combo #2, etc., their items are listed as #576, #708, etc. (not even in sequential order!).  \n\n* This is the second example involving weird numbers.  After you order, the owner will write a number on a piece of scrap paper and hand it to you.  This number is separate from the receipt, so it does not correspond to the price of your meal.  My friend and I thought it over, and we interpreted this as the same system employed at fast food restaurants, where your number is called when your order is ready.  When we looked, my number was 16 and my friend's was 28 (again, not sequential, even when he had ordered right after me).  Then, when our food was finished, the owner just waved at us instead of calling our numbers.  ...Huh?\n\n* Unlike most restaurants, the owner doesn't leave unlimited boxes of napkins at the silverware station or your table.  Instead, he leaves just a few napkins (less than 10) at the front counter, so you always feel bad about taking more than necessary.  Great economic/environmental tactic...?\n\nI'll briefly summarize a few more important points if you decide to try Jerusalem Restaurant:  (1) Order the spiced hot tea in the winter, (2) the restaurant is only open for lunch, not dinner, and (3) no matter how much you're initially intimidated by the owner, he is actually a warm person once you become familiar with him.", "business_id": "-1oj6-fkP-iO6OyW8QBqPg", "stars": 4, "date": "2010-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "AllG7uUNhd8VcSXNkm-8wQ", "review_id": "lsmIufZrcN2_0D3vKQJDEQ", "text": "Of all restaurants in Chambana, this is by far my favorite. I used to go several times as week for either lunch or dinner when I was still in the area. The food is homemade-like, which was always a big plus for me. I prefer to be on the healthy side, and Jerusalem offers that option with the bonus of being cheap. And this fact makes it unique in a college town, where most people are craving for cheap junk food.\n\nI would go most frequently for the \"plate of the day\" #202 with chicken. It is a big tray with an assortment of tasty items. So big, that sometimes you would end up saving half of it for dinner.\n\nI can more simply define Jerusalem as: tasty, tasty, tasty. Totally love it.\n\nAh, yes, the owner. Some people complain about him. Well, after going for so many times, I found out he is a very warm person. He might not give you a fake smile the first time you walk into his restaurant, but he will give you a genuine smile the fifth time you go there.", "business_id": "-1oj6-fkP-iO6OyW8QBqPg", "stars": 5, "date": "2011-07-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6HpldZcA3jg5Fn9agYKMjQ", "review_id": "R039DUGde-tdkuZm0Y0kpg", "text": "I know other reviewers took issue with the interior of the restaurant or the attitude of the owner, but I absolutely love Jerusalem for its excellent food. \nThe hummus is to die for. So creamy! We usually get the dish of the day. All the vegetable dishes I've tried are very yummy (especially the spinach dish), and there are many options if you are a vegetarian. My personal favorite is the fish. It's fried tender and juicy without being greasy and seasoned perfectly with a hint of spiciness. \nThe most important reason why I always prefer Jerusalem to other restaurant options in the area is that all dishes taste like home-made food, prepared according to traditional recipes with great care. It's cheap, but definitely not cheaply prepared!", "business_id": "-1oj6-fkP-iO6OyW8QBqPg", "stars": 5, "date": "2012-08-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "ZANzP-fO7744c_SgdCKVmg", "review_id": "2CtZvVnHLmqqHVVQHdRQ6g", "text": "Not sure I'd evem give them 1 star..false advertising. Menu on Yelp states Lentil soup is made with Olive oil.   Upon driving out of way here I was informed by an authentic looking & sounding Soup Nazi that it's Soy oil.  There will be NO soup for me here!", "business_id": "-1oj6-fkP-iO6OyW8QBqPg", "stars": 1, "date": "2014-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "N1koTSTyiLCD8zH0rHSh4w", "review_id": "Ua4J4Z67L-33B3Ajg_Nxhw", "text": "gotta say that this place failed on the majority. service was slow and rude. the hummus was almost all tahini, no lemon juice, and no seasoning. lentil soup was like chef boyardie chili gone bad.\n\ni dont recommend this place at all. lots of choices in the area.", "business_id": "FltN1Hnw4n7BORXJH1kaeg", "stars": 2, "date": "2008-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "mUUy72UfqmFj_krWclKELw", "review_id": "cjjM7q6UJ-WikOnpzsp8MA", "text": "the food was delightful! i've eaten here twice and enjoyed it! the service was very friendly and good place to sit down with your friends and just yap away about your horrible day. the food will cure away your hard day at the office. if not then just go to taco bell and call it a night. \n\ni also  like the setting inside, it's lighting is a great place to take out a date if both of you are adventurous about trying out a totally different place to eat. HURRY they're closing in October as Bobby Q. stated on his post. \n\nI will try to go there before their doors are shut for good. :(", "business_id": "FltN1Hnw4n7BORXJH1kaeg", "stars": 4, "date": "2008-08-25", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "XBHJCDzNh--mBhJkzyM_iA", "review_id": "UUn_q7PIJNCKUqoUBURmwQ", "text": "I've only been inside once for a jar of Nutella.  I know, kinda strange that I would stop at Yusef's for a jar of Nutella but I live right by the place and every deli has Nutella (and Yusef's did too, see-- I told you).\n\nAnyhow, I like this place for one really odd reason-- my Dad buys cherry juice at Yusef's by the case-- he says it helps his kidney stones.  My dad likes the owner and I think they are nice to him, so I am happy about that.\n\nI would like to try some of the fresh food they make, I'll need to make sure I take mental note to do so.", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 3, "date": "2009-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "a4LJJU26cSE7k12-0sEw0Q", "review_id": "dDr5_k9FtclsoynMvoI6Qg", "text": "Used to be great, now there's a new owner. He smokes inside the store. Menu the same, but the portions are smaller. Sad, I won't go back.", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 1, "date": "2010-07-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rmW6MkNkjV5b-x5kXOQd9g", "review_id": "nQm6VwABjQr6gsoVU4DZBg", "text": "As a lover of Middle Eastern food and being half Lebanese I found this place to be great. I had the kefta sandwich and enjoyed it. Also if you are looking for grocery items they have some great ingredients.", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 4, "date": "2010-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 1}, "user_id": "TTP7l5g4QUVCpQZ9NTAWqw", "review_id": "BX_iL7m8Y6_J3nNFCbp_dw", "text": "Stopped in last night for a take out dinner. I wanted to bring home something different than burgers or a pizza or fried chicken. So I used my Yelp app.... And showed Yusefs nearby with good reviews.\n\nThe owner was a very personable person....and very helpful. Everything smelled wonderful, and it was pretty busy....all good signs.\n\nI order 2 of the falafel dinner plates, and the stuffed grape leaves plate. The only \"side\" for a dinner plate was the split pea soup. It was a generous portion....and VERY GOOD!\n\nThe falafel and grape leave were both generous portions....and delicious!\n\nI want to go back a do a little grocery shopping for some of the unique items that I think you could find only in Phoenix here.\n\nGood job Yusef! I liked it!", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 4, "date": "2011-06-02", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "joIzw_aUiNvBTuGoytrH7g", "review_id": "C4lduID0NZMqzjQuIWlnbw", "text": "Falafel is outstanding here, dark exterior with green interior, and a nice spicy peppery taste that is satisfying.  Cooked just right too for texture.  Fries are a nice side.  Prices reasonable here, plenty of parking, and a few atypical sodas available in the fridge.  Note that there's just a few seats inside, since this is also a grocery place.  To-go will probably be my main strategy for this great Falafel destination.", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 5, "date": "2011-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "61Bz60XBeVm97vZZaLmraA", "review_id": "oYS18w1QIKP27kBgWpcw7g", "text": "Stopped in for the first time not having known for 10 years that we were neighbors.  I'll start with the fact that the owner/operator was extremely polite greeting you when you enter and welcoming you.  I had my 2 toddlers in tow, and this can be intimidating to most small shop owners knowing one bad move can cause chaos from a toddler.  We sat down ordered some meals, lamb gyro, chicken ka-bob sandwich, hummus.  Easy mediteranean meal almost imposible to mess it up.  We walked in at opening so it took 10 minutes or so for food, but the array of goods in the market to shop made the time fly.  With no prompting they took it upon them selves to split the gyru meal for my kids, which was awesome and a super time saver for me.  The flat bread pita was good more authentic to the chew than the buttery mall version (though I like both).  The meat was perfect the lamb tender with a nice sear on it, very generous thickness as well preserving the meat texture.  their tatziki was a chunky version with great flavor and a crisp cucumber crunch through-out very refreshing in the 100+ degree lunch temps we were having.  The chicken was good with a nice subtle flavor and plenty of juice left inside the well grilled meat.  \nThe hummus was traditional and very smooth more dip than spread.  \nOverall I am super impressed, the market has every canned and jarred good you could imagine from SPAM to stuffed Olive leaves and all stops in between.  The deli counter had a simple variety of olives and various feta cheeses, their produce was depleted (possibly because I walked in as they unlocked the doors) or not stocked yet.  I will be returning to shop and to eat again.  The welcoming owner made me feel as though my children will also be dining there regularly.  I will try to work my way through their menu board over the coming weeks, and will try to report back.", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 4, "date": "2011-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZQduSjrBcIYjO1d8IaXxVw", "review_id": "Xn6j2Jis7KIbllqHl9nCfw", "text": "I usually come here once or twice a week. I love their gyros and fries - both very authentic and served Chicago-style. The staff are very friendly and accommodating, and they serve some good desserts as well. Good selection of Middle Eastern sodas, snacks, and other ingredients as well. I'm a fan!", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 4, "date": "2011-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "lOvgjEkecLfVJwJriEjt2w", "review_id": "cJ_QcyR8toGuyXjCf1HXdQ", "text": "Highly recommended for all your middle eastern dietary needs.\nMy husband's family is Syrian and they swear by this place's falafel, hommus and baba ghanoush (sp?). They have every middle eastern candy, canned good, kitchen accessory and obscure food item you can imagine. A fun place to browse. Don't let the exterior and the strip mall location fool you, it is very cleanly and well-kept inside. You can even order some lentil soup and eat it in a booth by the window.", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 4, "date": "2012-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "inxWHYGscfzDQHTPlzGSSQ", "review_id": "ekAQNU6Vs_mZqqEmS51PgQ", "text": "Really good lentil soup.  Great rice.  Lamb combo was ok but everything else was pretty good!", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 4, "date": "2013-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p_CScNk-cdR5jsZQWEqDSg", "review_id": "LGXW5AH6wgM80orSM11_yA", "text": "Great little middle eastern deli market! I was looking for some sumac spice and other items and did not want to drive all over to find em. They everything I needed and had lots of unique items too. Call they will tell you if they have it in stock or not! Great prices for the items I bought today \nSuper nice owner too !", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 5, "date": "2014-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a8rYmiF1N8TMK3Tv1fHLUw", "review_id": "JrkvVNvu6-MPr1WsQp_g2g", "text": "Had the combo plate. The chicken and lamb was amazing, the ground beef was seasoned too heavily with something, but still good. Rica and pita was great, Greek salad was great as well.", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 4, "date": "2015-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z6S10K1CfOeREifEXysBfA", "review_id": "7kkfvwLRZfuSCcTobqg5iw", "text": "Easily the best authentic  Middle Eastern food in town. The market is stellar as well. \n\nHours: 7am-8pm", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 5, "date": "2015-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "sfKMl7ERKuwxIh3HLXUg-Q", "review_id": "dV9yyDyxntmJMG9NovdJHw", "text": "I like the idea of all-you-can-eat hummus so much, that Princess earned almost all its stars for that. The lunch buffet consists of this, about Pita Jungle quality-hummus, which most seem to dig unquestioningly, plus a bunch of meat, a delicious chopped salad and rice and soup. I was a vegan at the time I visited, and had no problem stuffing my face with loads of hummus and rice on naan, with a bit of Sriracha hot sauce and loads of the pre-dressed salad. I think the meat is usually lamb (perhaps chicken, as well). Both times I've gone, my companions have been disappointed in this meat. One said it was too dry, the other that it lacked the proper seasoning (my dad's big on seasonings). I'd believe it, but I'd still go back.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2008-07-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "ZRQdOIIhzrzE6sc3emgM-Q", "review_id": "2s2uFd4GUR6VfhQq9eoFDA", "text": "This is an interesting little Mediterranean restaurants / market. The decor is very simple. The market takes up about 2/3rds of the space the remainder for the restaurant. It is rarely very busy so getting a table at lunch is easy. I used to get the Chicken Shawarma but since the buffet was put in I just stick with that. All the meats are halal if that is important to you. \n\nThe lunch buffet on Friday and Saturdays is a must, the chicken has some kind of spice that just rocks. I always eat way to much of the chicken. Everyone I have brought here just raves about it.  The buffet is simple with hummus, chopped salad, lamb (I don't eat lamb), chicken, rice, and a couple of other dishes that get rotated. They will also bring hot pita bread upon request. \n\nThe only down comment is that the service is kind of slow with drink refills. On numerous occasions I have had to get up and go to the counter to get a refill of water. No fresh brewed iced tea, booo! There is always one guy (the same guy) waiting tables. The food makes up for this.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2009-07-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gxyYVfjVATxvVr1YBFFvLA", "review_id": "DBL1SfvUgwiKvtlEa1WmYA", "text": "The buffet was really delicious, lots of different tasty meats.  The guava juice and baklava were also delicious.  A good meal at a good price.\n\nFor the buffet, make sure you get there early since it gets busy quick!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2011-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "yGzDW3yh4ISdjafyYJC9cg", "review_id": "xT7srp1vNiPhrJ82lXo0kA", "text": "When I was attending the Conservatory of Recording Arts at the Tempe campus I would often run next door to Princess during a break to grab a sandwich. These people rock. Super friendly staff, great food, reasonable prices. Highly recommended!! The chicken kabob sandwich is my personal favorite.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2011-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-q0RFaCkmT6TFxgk0a9dPw", "review_id": "23NT5EF-m15bFFWOwKXwOA", "text": "I had chicken shawarma I got sick to my stomach when I came back to work ( it was a lunch break with a folk). I'm not sure if it's their food? Or maybe this happens when you try a different cuisine for the first time. But I'm coming back I just dont like the atmosphere inside.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 3, "date": "2011-08-28", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "Ac_4U3LDCrNgf6Z9OP3kXA", "review_id": "2nKUTkS5PcZK3Uq7rqdKQQ", "text": "Buffet only on Friday!! And today is Wednesday :*(\n\nI went based on other yelp reviews, and it was pretty good.\n\nNot gourmet or anything, and it is a grocery store, but I tend to like this sort of thing and feel more at home, like you're at someone's house at the table in the kitchen.\n\nI got the gyro plate with a few salads on the side.  It's reasonably priced and they serve it with warm pita bread.\n\nNext time I will ask for more salads and less meat (just my personal preference), but everything was tasty. And the tsatziki sauce was yum yum yum.\n\nI'll come back on Friday and check out the buffet.  (Only 12-4!)", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2012-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "9_dy8otUq7XdZtbunMw8vw", "review_id": "d9EDj-kSf98lVoOBv5q1TA", "text": "The food was great. The hummus was so smooth and creamy and along with the chicken was some of the best mid-eastern food I've had in a long time. Plus, we were able to get a coupon on Groupon which gave us $6 worth of food (that's two gyro sandwiches) for the price of $3! I don't care what else you have to say about the restaurant, you can't find even mediocre food for $3 anywhere! As far as looks of the restaurant are concerned, it is very clean. It's very casual and they didn't focus too much on the decor because, yes, it is a supermarket first and foremost. If that is too much of a problem for you, I suggest take out. All I know is, it's good, clean, and worth the trip out there.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2012-07-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cNfiHUfiwthYvzBx623t9w", "review_id": "0HTHRkvaLiopnttjnPO0Fw", "text": "Love the princess market! The food is good in the restaurant but I mostly go for the market. Very cheap food! Their prices are amazing and they sell halal meat.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2012-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xyuqtuV71y2F3uD9z97jPw", "review_id": "mUYzfK2b12__SHJrO-HkDA", "text": "Ordered the #2chicken shwarma plate and the #9kofta plate to go.\nShwarma: perfectly seasoned chicken and rice with garlic sauce, hummus, salad and pita $8.00. Great price and tasted so good.\nKofta: meat was cooked to perfection, moist not dry, seasoned nicely. Came with rice, hummus and pita, substituted arab salad for the garden salad. $8.00. \n\nThey have great prices, you can eat in the market or take it home.\nGyro, fries and soda special for $5.99 and a buffet on Fridays for $9.99.\n\nYay Amera (Princess)!\nRamadan Kareem!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2013-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5fyzHVC-yixuZnLg8FPYOA", "review_id": "-xKh7wj6i6sUZ9xvEkg-Yw", "text": "MMM MMM MMM Thats what i feel about this place. I mean COME ON this is one of the best Arab Food restaurants i think in the WHOLE USA. I know that might be going a bit over board but of all the restaurants i have been to this is the best. I love the Kabob Combo and gyros from there but the best part of the experience is the customer service. Owner is a really nice man and i think his whole family helps out with the shop. :)", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2013-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "wLuDGMXytNVTF8ZU2gwUEQ", "review_id": "4ClFL-H2LxX1wgrZzyAgVw", "text": "What a hidden little surprise this is! I can't believe it's been here for 9 years! Thank you yelp for discoveries like this! \n\nThis is a very nice Mediterranean little market, they even sell huge bottles of avocado oil for $10! The cheapest I could ever find before this has been $20, so I'm pretty excited about that! \n\nThe deli is great!! The Gyro meat is thicker cut and not dry at all (and it didn't give me heartburn, woo hoo!) I brought a friend and she just loved her gyro wrap. The hummus is fresh, homemade tasting, served with a nice drizzle of olive oil on top.... Mmmm super good... \n\nService is super friendly and helpful. I'm so glad to have found this little gem! I haven't tried the buffet yet, but I'm definitely looking forward to trying it out in the future.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2013-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x1PxZJvRo4tu-ruOXa5MqA", "review_id": "JtJq2pLC1s_E39X3vs1xoQ", "text": "Yes! Great food in Tempe! I was super impressed. The hummus is good and so was the gyro I had. Staff was friendly and food came quickly (we were REALLY hungry). I will definitely be begging my friends to take me here the next time I'm in Tempe.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2013-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6q6ZXl8H5Yry2pI0_bOQCQ", "review_id": "O8I2C4RKm4By8LF8mRhkRQ", "text": "What can I say...Love this place. The food is definitely the best mediterranean I've had in the valley. Chicken Shawarma and lamb shank are where it's at. The hummus is thick and delicious too. Go in not expecting much but awesome food at a very reasonable price.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2013-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "ze-M8X9YnKURCUGeBm3ERw", "review_id": "XvcH6c1Z5nY4PUAN45rwsg", "text": "I am an American born and raised and I have to say the food and service here are really top notch! A great place for anyone to go for groceries and/or dining.\n\nGroceries:\nThe best and most affordable feta cheese hands down. Olive oil, chicken, and those \"Abali\" brand yogurt drinks are absolutely the best here. There are always different treasures my wife and I would find here, definitely do not know what we wouild have done without it!\nRestaurant:\nWe really enjoyed their homemade Baklava, every kind they make is excellent. The gyros are awesome and I am sure the rest is but we always loved the gyros and never tried anything else.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2014-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Pul64713F7_eDZF3a1AKag", "review_id": "MNwVkw5k6GiZDIb4_luN_w", "text": "After trying a number of other Mediterranean places and being somewhat disappointed at every turn, I finally managed to find myself in the vicinity of Princess for a weekend lunch. As with many of the best restaurants in the area, the exterior doesn't look like much, but our fortunes changed once we got inside. The waitstaff was courteous and patient with my questions, and although the food took a while to come, it was absolutely worth the wait. I split a side of falafel and the Princess combo with a friend, and both were excellent. One recommendation for those who order platters here: you can switch around the default sides, for example, having tabbouleh instead of garden salad, or baba ganoush instead of rice, and I recommend this. You get a free baklava (or drink) for checking in, and I love the pistachio. When we went, the owner gave us not only this, but a piece of almond baklava, and another dessert to try. Have some turkish coffee to wash it down with, and you're set. Definitely recommended.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2014-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0lCAj4QokG4byr37S5LdDQ", "review_id": "j3sHsFsI3Buk_QqZCKoFAQ", "text": "Good food, great service!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2014-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rnw3F1ODS77tQsZhYIHOYw", "review_id": "qvZBklHcenYLkVXhdoPWhQ", "text": "A very unique and very tasty experience! I ordered the gyro combo for a very affordable 7.50. They gave generous portions of meat, salad, rice, and hummus. What really made this plate \"pop\" was how well everything was seasoned. You can tell that they put great care into everything they cook. Add a friendly waitress and nice, appropriate music music for the perfect atmosphere, and you've got a repeat customer.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2014-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Hf0dGp1eM94UCPYma-fEOw", "review_id": "hV8nZc2khZZ4ONO-xSoK1g", "text": "My roommate introduced me to this restaurant and I'm so glad that she did! I get the meat combo every time I go. {however I have it modified and ask for two steak and one chicken skewer, because the steak one is my fav :)} I love the Arabic Salad and even their regular garden salad is super yummy and fresh. The desserts are great too! I would highly recommended it, even if its not your usual place just give it a try. It for sure wasn't my usual place but thanks to my roommate I tried it and now love it. Very friendly staff as well!  OH GREAT pita bread!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2014-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5glM3z4nT59kk5DlB3kGOw", "review_id": "74IFeFe7sMQAeqeHx7etTQ", "text": "I am disappointed to say that the customer is not first nor right at Princess. They have forgotten who keeps them in business, it is paying customers. The buffet last night was horrible...picked over, nothing left and the staff (family) on duty could care less, because THEY ate first!!! When I asked for it to be replenished, their response was, \"Kitchen's closed, sorry. \" This was at 8:15 pm, the buffet started at 7:30!!! I am sorry to say, I will no longer be making the 20 min drive and giving my business to this once great family owned business. Unfortunately the service has diminished greatly with the passing of the owner. He would be ashamed how his staff (family) treated their guests. This has been the 2nd time in as many weeks. Sad...because I really enjoyed the food. I hope they figure it out quickly, because at this pace, they won't be around to carry on the family business.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 1, "date": "2014-07-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pC7ogN2MosWWWneWM26AMw", "review_id": "jqW-LhMgrf2KvvIhL6Z1UQ", "text": "Tried this place out on a whim....and was never disappointed once!! The waitress that served us was extremely attentive and had good conversation. It's been a while since I have been to a Mediterranean restaurant (my favorite was out-of-state) and this is now my favorite above all else in the area!! They were extremely friendly and were very welcoming while celebrating Ramadan. I've already picked out my next selection and can't wait to check out the market section on my next visit!!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2014-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MgcaWUR6Uz77Ww-mrkKHZg", "review_id": "hxNT8Asw7DXA6RlWEToc_Q", "text": "The girl that works there is super nice.  Food is pretty good.  :)", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 3, "date": "2014-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0bCuYuRbQpqWGsJ1XiHqjQ", "review_id": "fA23e0Nb5uH4a6cIgPMDLg", "text": "We went here a couple of weeks ago for lunch, I was hoping to try the lunch buffet.  But it was Ramadan, so the buffet is only available after sunset.  Husband and I shared the Princess Combo ($19),  we picked rice, hummus, and Arabic salad for our sides.  The meat was really good.  The Arabic salad is superb, hummus was good, rice got its color from turmeric instead of saffron.  Other people at the table had the beef kabob combo, and the chicken shawarma.  \nOMG!  the garlic yogurt sauce was so delicious, I think it only comes with the chicken shawarma.  I can just drink it up\n\nDesserts are $1 each, bite size.  Which is a great way to try all of them! :-)", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2014-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tRv4I_DW2wIQc2V5-yhjtw", "review_id": "Txjx6CXi8TQzjPoLrV7d7A", "text": "My wife and I have been here a few times and each time the service, and quality food have been excellent.  So far I've had the chicken shawarma and the chicken kabob, both very flavorful.  The hummus and tabouli are also top notch.  I highly recommend this spot.  Almost forgot to mention the baklava was delicious as well.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2014-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "B6MNUY9PeJydOWs9Vw597w", "review_id": "w1ZYf9inWEt1QmxAfs_TOw", "text": "First time having Middle Eastern food, I ordered the veggie platter, which consisted of about 5 different sides. My favorite was the falafel which was crunchy and still warm. The hummus was fresh, along with the Pitas. I also got to try the Asian salad which was really good! For my taste some of the food was a bit too tangy or sour, but other than that it was delicious! The service was good only have two workers not including the cook, so it was a bit slow but they were all nice and courteous. \n\nPs. If you have a sweet tooth the pistachio Baklava was My favorite thing on the menu!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2014-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5glM3z4nT59kk5DlB3kGOw", "review_id": "F5eCfvoTcNzK7IrrAJFsQA", "text": "Great food...worth the drive.  Chicken and humus is very good and the lamb is some of the best I've had.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2014-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 0}, "user_id": "EosKWs-S3-mN6o_rok_LNQ", "review_id": "3V1jGRD0N81XAvD3W0pooA", "text": "In honesty, I feel a little bad about only being able to give Princess three stars.  But this is a perfect example of the fact that to be considered a 'good resturant', even if it is a basic resturant and not fine dining, they can't just throw good food at you and expect return business.  Ambiance and service are important pieces of that overall recipe.\n\nSo I'll start with the food.  This place serves the best, most authentic Mediterranean and Arabic food I've ever had.  The food is fantastic.  I'd say that's a pretty across-the-board statement... everything I've tried here is good.\n\nThe ambiance:  Flat out poor.  It is a combo ethnic grocery store and restaurant, so that is a pretty big handicap to overcome from the outset.  No real separation from the grocery store,  Seating area is crowded even though there is only seating for about 20 total.  The seating is primarily booths (that wobble and aren't bolted down) that look like they are from a 1980's McDonalds.  There are some cafe-style bar-height tables for two scattered about in addition.  During lunch it will get full enough that there will be poeple standing around, eating wherever they can find a bit of space ( a testament to the good food).  Cleanliness of eating area was marginal.\n\nService:  Only marginally better than the ambiance.  The servers, although they can handle orders in English, they clearly prefer taking orders in Arabic.  They have at most two people working tables, and often one.  The server is also responsible for running the grocery store cash register, so if 3-4 customers try to check out at the same time from the grocery side during lunch, they'll spend the rest of the meal trying to catch up.  You'll likely have to chase them down for anything except ordering the base meal and getting that brought to the table (and that might require proactive nagging as well).\n\nCost:  Very affordable for the quality of the food ($9-$12/person).  Runs on par with Spices and other Mediterrean places in the area.\n\nNet:  Not a good place for families, groups, or dates.  Great place for foodies that want cheap, good authentic food.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 3, "date": "2014-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5glM3z4nT59kk5DlB3kGOw", "review_id": "7ObbDAFEor5UYMkmrQUfJw", "text": "I am disappointed to say that the customer is not first nor right at Princess. They have forgotten who keeps them in business, it is paying customers. The buffet last night was horrible...picked over, nothing left and the staff (family) on duty could care less, because THEY ate first!!! When I asked for it to be replenished, their response was, \"Kitchen's closed, sorry. \" This was at 8:15 pm, the buffet started at 7:30!!! I am sorry to say, I will no longer be making the 20 min drive and giving my business to this once great family owned business. Unfortunately the service has diminished greatly with the passing of the owner. He would be ashamed how his staff (family) treated their guests. This has been the 2nd time in as many weeks. Sad...because I really enjoyed the food. I hope they figure it out quickly, because at this pace, they won't be around to carry on the family business.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 1, "date": "2014-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6XJfj4qjQlxjT-nPw4MSUQ", "review_id": "tQ_SdW9ojBbCsfM6E_zF7A", "text": "Found another hidden pocket of goodness- to make you sleep within 7 minutes of finishing your meal!! No kidding! If you're having problems sleeping at night make sure to check this place out for dinner! ;) Your taste buds will enjoy the food and your brain will enjoy its \"powers\" to put you to sleep (like a food coma). But really- the dishes were delectable. \n\nThis is in the NE corner if 101-N and Broadway. With the outside sign a bit tattered, this little market still boasts a dining experience to talk about. Staff immediately greeted and asked whether it was dining in or ordering to go and chose to dine in. To the right there were several tables and booths to choose from. Immediately was given menus and asked if ready to order. Waitress was attentive. Chicken shawarma sandwich was around $4 and the kabob combo (kabobs of chicken, beef, and lamb) with rice, salad, hummus and warm pita was about $12. When asking the waitress what kinds if meat was in the combo she said she doesn't know- and just works there. That was odd because I would have thought that if she wasn't knowledgable about what was on the plate that she could have at least asked the other staff. A skilled worker should at least be knowledgable about those basic popular dishes. Maybe in time. Minus that part everything was exceptional. Baklava was super sweet and delicious. Ended up buying a few more baklava to go!\nOnce you're done just check out with the pleasant cashier at the front, and off to get some powerful coffee or to that comfy bed awaiting. ;)", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2014-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hNdpq7rJQcwrxn-aghSkgQ", "review_id": "Dr0QL3IJ6EKe3sYEvhtbtQ", "text": "First, we were served by the most enthusiastic, nicest, friendliest waitress Lauren. She could not rave enough about the food and she was right. We loved the lentil soup, the labne, the falafel sandwich (spectacular), the lamb shank entree (order 2 of them!) and even the rice is worth coming back for. Our only complaint is that we wish we lived closer but I wouldn't rule out us driving 2 hours for this authentic middle eastern cuisine.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2014-08-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "oquu6i80MMNpr8oDnfex8A", "review_id": "cnXq6CwMhUF_dAF5m1TrDA", "text": "Food is always bomb here so the wait is well worth it. It's such a hidden gem. \n\nIt's usually packed and there is only one or two people working the tables so expect delays. My favorite items are the stuffed grape leaves and the hummus.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-06-07", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "VywwITEGWzFmKdoQQj5hWw", "review_id": "348n8r0du5y0aAw-k1k_FQ", "text": "So happy i found this place. A few tables set up in a corner of a grocery store that had almost every seat taken. Everone was speaking arabic, so i knew i was in the right place. Great food, authentic, and cheap. No hippy gyro shop here. Will be back soon", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Zakk9qNmcR4rskeA0MXqHA", "review_id": "48T9iumJjvMW6vXhFDK48A", "text": "The food here is phenomenal, and the people are friendly and cool. My favorite is the chicken shawarma plate...the rice is so flavorful (and I don't even eat rice!) and they have this garlic sauce...to die for!!! It takes a few minutes to get your food to go because it does have a restaurant side, and they make it fresh as you order it, but it's totally worth it! Love this place!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MjRRY6ZpYDxwbrUYlrs6kQ", "review_id": "Dur4IWs6D02J69yiFTP75Q", "text": "Princess is great! I'm a semi-regular (always take-out) and have tried quite a few things here. Falafel, gyros, tabbouleh and grape leaves are absolutely fantastic. The only complaint I have is in regards to the hummus! I've always found it to be a little bit bland. Some more lemon juice or more spices in general would make it so much better. Regardless, I will be back to this place. It's definitely one of my favorite places to eat in the area.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6FhkqCqJKadKb6pbPUukbQ", "review_id": "Ipy9DfNM1HD5CJD5QKe43Q", "text": "Awesome food, the best I've had of this type for sure.. reasonable price, friendly and helpful staff!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "wh3CpxT6LVd4gl9F6Qld4Q", "review_id": "d2qyDU27W5U1OakgV3PmWA", "text": "I have been to Princess deli several times because it is really consistent Lebanese food and this restaurant had a groupon for a while. The falafel is really good crispy on the outside and green and soft on the inside. The hummus and lentil soup are both creamy and quite delish.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-06-20", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "vcxwfWueY0q66zMbZbQCrw", "review_id": "vLTyCYmFrpu95qJ0KXMpNQ", "text": "I can't get enough of this place!  Best grape leaves I have ever had.  The staff is fun and friendly.  We have started having our meetings here. I would give more stars if I could.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "o5P_9wKtj9SKe0M-gQDeNA", "review_id": "XsIkjEZxHCXJRnfQD0utWA", "text": "Service is all over the place.  Inconsistent.  Aloof.  Partial treatment.  One of the young waitresses caters to regulars.  For example, the other day she went out of her way to hand plastic cups to her group of friends and offered to individually pour them water.  Why not treat  all of your customers that way?  I felt like I was in high school again: extremely cliquey. \n\nI've also observed that one of the male workers gave free desserts to a family and a big block of feta cheese to a couple next to us.  Perhaps they were good friends.  But that's irrelevant.  Again, why not hand out free desserts & blocks of feta cheese to all of your customers?\n\nInconsistent quality of food.  One day my falafel sandwich was amazing - a mind-blowing experience.  But then a month later my falafel sandwich was a dismal disappointment.  There was no plump, well-cooked warm falafel inside of my pita sandwich.  Instead there were tiny bits of cold leftover crumbles of falafel thrown inside a soggy, almost inedible rubbery pita.  I complained to the waitress expecting a brand new falafel wrap to be made.  Instead she came back and handed me a plate of four disproportionately sized falafel; not a single one was in the nice shape of a medium-sized ball - one looked like an elongated, stretched out elephant turd, the other was in the form of a tiny black dot.  Plus it was overly cooked (crispy & burnt).  I'm guessing this was left over scraps from a burnt stove.  She told me to just \"throw it in\" my wrap as she quickly walked away.  \n\nWhat's the point in eating \"good tasting\" food if you're preoccupied with horrible customer service?  You cannot enjoy the food much less digest it properly.\n\nAlso, the establishment seems to exude a certain element of Arabic/Lebanese elitism.  Which probably explains the partial treatment of their \"favorite\" customers.\n\nFYI: I strongly encourage you to go to Haji Baba.  Consistent, excellent quality of food and most importantly: impartial treatment & welcoming/friendly customer service.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 1, "date": "2015-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cReuZBonKC1Uk9lrj6VHyw", "review_id": "bJ1B0iFgk-ClKlNXVeycKQ", "text": "Husband and j went for lunch, ordered the princess platter.  It was more than enough food for the both of us, even took some home. Great food and great service. Best Middle Eastern food in Phoenix by far! \nOnly criticism I have is their Pita was not very fresh, but still good and served warm. Will definitely be back!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Pqt_YcXdtNdil5lWfiPJrw", "review_id": "H9I8hyr5wv1iM3h9s5agbQ", "text": "Best falafel pita I ever ate! all vegan too! it was very fast and very good price 4.86$ you can beat that it going to be my number one for falafel from now!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "htISY1cgFxUOvWuIeQuEFA", "review_id": "olod-hiC3TWG4ZmIGx2G9w", "text": "Was very pleased to shop at Princess. Found pretty much everything I was looking for and more. They also assisted me in carrying my stuff to the car which was very kind. Didn't get the chance to eat there and try their food but will definitely give it a shot next time. Definitely recommend the place for Middle Eastern Grocery shopping! And btw, although it says here that their timings are until 8 everyday it's not. It's actually till 9 now everyday except Sunday where they close at 8.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-07-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gGnT8NMhhRsZDb0lhCkaTA", "review_id": "Fr43bG4UI2mSk1teLKZ3uw", "text": "Been here many times. I have not been disappointed yet. I also love the fact that I can get a half pound of olives while I eat my meal. I've always been treated well there.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t58qGXYZp9nMVFyaZKqvFw", "review_id": "zpqK9I3lTkknBR7cya4ivg", "text": "This place is great!! If you want a very casual, friendly atmosphere, this is the place for you! If you loved your meal, and wish you could bring some of their fantastic hummus, salad dressing, or other Mediterranean delight, you can purchase it at the Deli! There is also a small Market, that is wonderful! Authentic music and atmosphere! A++", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "teO4xBunbWqYpClcc5wxwQ", "review_id": "pBxbVEMBmaiIL-veTFu-rA", "text": "This place has affordable and very delicious meats and food! Their service is fast and very honest people that work here. I love their lamb shanks!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lFZxmlLljmGu1gDSjRzi5g", "review_id": "cHpCprGJ2vWlY0B7tc9dsg", "text": "Had the lamb shank with baba ganoush, hummus and Arabic salad. Everything was delicious. The server was very friendly and the food came out quick. \nWe`ll be back !", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-08-12", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "VC4niV35pN5FTjm6EATukg", "review_id": "B2Q8W-3cZ2cfy6yFKabKVQ", "text": "I have been in this town for a short time this has become my place for Gyros and other meals also, the food is great and the service is fantastic very little wait time.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Qux97E9TsdwM2a8_ikoc8g", "review_id": "IK4e7Z5URTVkGdbRPH-lSw", "text": "Amazing food. Sooo good. Love the hummus and chicken. And the baba ghanoush. OMG.\n\nDecent service. Nothing over the top, but as expected for a small casual place like this. Personally, I find the booths a bit uncomfortable. If I lived closer I'd definitely just get the food to go instead.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-08-18", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 1}, "user_id": "NtR8QjRS4ZIrpOuBgSUZng", "review_id": "Dw8t-jcwrQm0bDbdXPBOcA", "text": "So delicious and very affordable! its a market with the kitchen and dinning area located towards the back. Very sweet staff.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PaLiV3A-WWHnsSY5oy9j2w", "review_id": "SJpbNi5M3LtTHVPvqJam4g", "text": "Everything was yummy and fresh. If you are a middle eastern food fan it compares well to Middle Eastern bakery and some of the other local places. I really liked the fresh flavors of everything that we had. My wife and I ordered a platter and a hummus plate, more than enough food for two for dinner with leftovers for the next day. \n\nThis was a good 25 min drive from my house but I would definitely do it again.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-08-20", "type": "review"}
{"votes": {"funny": 4, "useful": 6, "cool": 4}, "user_id": "uCfdp7AH45qanhjzWhYZsw", "review_id": "pg-9XMdU_fM_7y9KysFRmg", "text": "LOOOOOOOOOOOOVEEEEEEEEEEEEEEEEEEEE this place! \n\nI have enjoyed every single thing I have eaten here and it is totally worth the drive for me from Central Phoenix.\n\nMy absolute favorite thing to order is the chicken shawarma plate with the baba ganoush, tabouleh and the grape leaves appetizer. The chicken is amazingly moist and tender and comes with a side of the blow-your-face-off amazing garlic sauce. The b.g. is defintely some of the best I have had in the valley. The grape leaves are perfectly flavored and lemony fresh. \n\nOh man, now I think I talked myself into heading over there for dinner right about now....", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J4bBMAA4FtNxsvQRvsOyeQ", "review_id": "a8SYw4xJ2P6LfRt6OOUkug", "text": "This place is delicious and so economical! Stuffed grape leaves, falafel, lentil soup, hummus, tea, it's all amazing! We've been here 3 times in the last month!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6Cyb_Oe7s-hmdb5Y7owTJg", "review_id": "pmXOCIxDI6gfvpS2iLAWSQ", "text": "Amazing food, great prices and very friendly service! Great to dine in or take out!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-08-30", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "lPaYMDmJbAnv_3pmZH_inw", "review_id": "YeuywXCSGg2mgNJQJNvhyQ", "text": "I was watching the news this morning, Greece is on fire. The idea of this wonderful country burning down one forest at a time is upsetting and disastrous. This is a country I have always wanted to see and know that it will be years before its forests can recover from the devastation.  As I'm watching this devastating news my tummy starts to rumble and I think, Alladin's. Alladin's will help to make me feel better, I need to connect with the people somehow. Why not with food?\n\nAlladin's Kitchen is a wonderful Middle Eastern restaurant serving up fantastic hummus, baba ganoush as well as other Mediterranean favorites. They also make some of the best stuffed grape leaves Ive had to date. The menu is very accessible as well as priced extremely well. Do yourself a favor and try the chicken shawarma wrapped in soft grilled pita as well as the gyros. \n\ni know eating the foods of the Middle East isn't going to put out the fires and bring back the loss of the nations people but the food did make me feel better.", "business_id": "1zdwPAgiJFJhPeS3YIY09Q", "stars": 4, "date": "2007-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "hFG1Lira7tL_PElq6bdAAw", "review_id": "uPvio5qb4q11nrEoN1qIDQ", "text": "I'm a fan of Aladdin, except when I'm in a hurry.  The owner told me that he prepare everything from scratch.  But it all does take a while.  So go ahead and call in your order for some kick@#$ gyro or chicken shawarma, or just be patient.  Home cooking takes time.", "business_id": "1zdwPAgiJFJhPeS3YIY09Q", "stars": 4, "date": "2008-06-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VzbLmSjRkdWRURoir_4TSg", "review_id": "q_nR2gT1zthYslzmmGOR_Q", "text": "Aladdins is the diamond in the rough. In fact we're getting take-out tonight!\n\nThe inside of the place is all the things everyone mentioned...but the FOOD! Oh, the FOOD. It's to die for.\n\nI do like it better when his salad isn't as spicey, and I am in love with the garlic sauce that comes with the chicken shwarma. His hummus is the best in the city. I promise. \n\nSadly, our other mediterranean choice Sabuddy's is gone so Aladdins doesn't just gets some of our business, it gets ALL of our business! At least when we have a hankering for mediterranean.\n\nJohn & his wife are good people. They talk to you, they know you. When I was pregnant I don't think I ever went in (hubby did instead) & then one day I showed up to pick up an order & he asked me where I'd been!!!! Umm..gestating. Thanks for asking!  Then there was the day his produce shipment was late - so he was shopping at the grocery! Asked about our family and always has a smile. These are very hard working, honest people. \n\nWord to the wise: Do NOT eat if you're going on a date or need to make a good impression - you WILL stink like garlic! The stuff is strong! My husband used to try & hide that he went without me until he realized he brought the evidence home.", "business_id": "1zdwPAgiJFJhPeS3YIY09Q", "stars": 5, "date": "2009-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eMFD4FA8NVAlUAeBl4EVNw", "review_id": "63TveMTHJ36ZbeBkiW1rzA", "text": "This place rocks! The food is absolutely delicious. The Hummus is amazing and only fresh ingredients are used. We try to go there weekly as it is that good.", "business_id": "1zdwPAgiJFJhPeS3YIY09Q", "stars": 5, "date": "2009-08-28", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "3vML-LnH0dIyHCrqF5xEYw", "review_id": "95lZelyHzrO9PsTvMltT2Q", "text": "My husband and I went to Aladdin's today for the first time and we LOVED IT!!!! We started with the eggplant dip/pita (I can't remember what it's called) and OMG, sooooo good. I  ordered the gyro wrap/salad and my husband ordered the chicken shwarma wrap as our main course, very delicious.\n\nWe love hole in the wall places and unlike others, we enjoy good food - served on china or paper plates. It's all about the food, right?\n\nWe will be back again (probably tomorrow).\n\nI recommend this place highly!", "business_id": "1zdwPAgiJFJhPeS3YIY09Q", "stars": 5, "date": "2010-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6khNhFYFO3KSnRAM_9YdQw", "review_id": "EmnZNxmLoUns-UPN8T8pow", "text": "Just found this place recently. Love the fresh food- wow the chicken is great, very heavy on the garlic so make sure you have your breath mints handy if you eat there for lunch on a work day! I thought the place looked clean, despite what some people here have said. Not really what I'd call \"a hole in the wall,\" but just a casual Mom and Pop joint. Perfect for this kind of food.", "business_id": "1zdwPAgiJFJhPeS3YIY09Q", "stars": 4, "date": "2010-08-29", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "nWouNfZD3Pw08RYizxkqcA", "review_id": "OHkVZtMNwwUoSThKHBzb3A", "text": "Byblos has some of the best Middle Eastern food I've ever tasted. Their falafels and Tzatziki are delicious. And the restaurant serves up an amazing tomato cream soup which will have you lapping up every last bite. This is a great lunchtime destination.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 4, "date": "2007-08-07", "type": "review"}
{"votes": {"funny": 4, "useful": 2, "cool": 1}, "user_id": "rPGZttaVjRoVi3GYbs62cg", "review_id": "qni4KT4fcyUBebOAxNH4aA", "text": "This place was so weird!  I had heard good things from friends (and other Yelpers) but I was so disappointed!\n\nMy fella and I went for lunch on a Saturday afternoon and were the only customers there (!?).  We were shown to a table by a unfriendly gentleman who did not smile or greet us in any way. \n\nHe returned to take our order, gave us a cold glare to tell us that he disapproved of our choices, and then wandered off to the kitchen.  We could hear him yelling at the cook to \"make sure to make my vegetarian lasagna WITHOUT meat in it\"... yeah, thanks, I would appreciate that.  Eventually he brought us our food, scowled, and left us alone for the rest of our meal.  What was up with this old man?  Who ran over his puppy?\n\nAlso, someone was fiddling with the music in the place, eventually deciding we should all listen to hip-hop.  :|\n\nThe food was tasty, but the experience ruined it.  I won't be coming back anytime soon.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 1, "date": "2007-08-18", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "fzkO1lGkx8MHhT8S4Rbg3w", "review_id": "bC-nj_nlfN50WFWxNfC4Xw", "text": "On my quest for the best Shawarma in the valley, I came across Byblos. I called in for a pick-up order, and did not get a chance to experience the dine-in. I thought the food was great, a bit much at $12.95, but did not disappoint. When I came in to pick up the order, I did notice the place seemed extremely quiet. I wonder why? I don't get too eccentric with my middle eastern tastes, but Shawarma is a great dish, chicken or beef. An interesting note: Al Pastor tacos, come from this Mediterranean dish. I need to look up the history of this connection.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 3, "date": "2008-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yqipY7MD65WjeozJwoacow", "review_id": "IEVJSIn1gnYf0fOBd0TG8Q", "text": "I went twice to this place. To be honest, I decided not to give it a shot after the first time, but I said it might be a bad first experience. We were a big party the first time so I almost tried most of their starters and some of their main dishes. I did not like how they serve the hummus, tabouli, main dishes, and everything else in very small quantities (unsatisfying at all).\n\nHere are my ratings :\nPlace & Decor: Below Average\nFood: Below average\nService: Average\nPrices: below average ($$ for few food)", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 2, "date": "2008-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rLtl8ZkDX5vH5nAx9C3q5Q", "review_id": "HjVnuBMGxHocv7tjOBau9Q", "text": "This is my absolute favorite middle eastern restaurant.  I have only been there 2 or 3 times, but for some reason I'm always treated like family.  The place has never been crowded and you get individual attention from the waiter/owner.  Everything on the menu from soup to shawarma is top notch.  The only downside to Byblos is that they do not make their own pitas from scratch as they are regular ole store bought ones :(", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2009-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j6nkZ1Ias1q2aQQ1Ikkp3w", "review_id": "Wsu8cECVNKnd_SizfdO7sg", "text": "I LOVE THIS PLACE! By far the best tomato soup EVER! The service is awesome, very nice owners. The hummus is great. I come here as often as I can. Good atmosphere and great food. 5 thumbs up for me!", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2010-07-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "xQdQWpBWKxQ8xhuGOPzyow", "review_id": "F8CL2QpVJ6iEXcd4W7NcRA", "text": "This is my FAVORITE Middle Eastern (or any other kind of  food) restaurant in town! I ADORE Byblos and go there every single year for my birthday.\nThe food is amazing and they have vegetarian dishes as well as beef, lamb and chicken dishes. My personal favorite is the keufta kache kache, along with felafel, tabouli salad and Middle Eastern tea. The desserts are lovely and decadent as well. Highly recommended- family owned and operated- lovely ambiance and great food!", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2010-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kPJW1Aj2vZ033yb7Akx7QQ", "review_id": "xq_PnQ8GUyqTuF1ayCF-QA", "text": "I've been going to Byblos since I was a little girl and my family would take me. The owner still recognizes my whole family and always gives us a warm personal greeting. The food is absolutely fabulous and authentic, and the atmosphere is relaxed without being seedy. It's family owned, and you can always tell you're going to get great service. The hummus with beef and pine nuts is an absolute favorite, and I won't eat hummus anywhere else. The baklava is amazing, done in the old broom handle style. The pita is always fresh and warm, and the lamb dishes are just fabulous. For a nice dinner or a special occasion, Byblos is definitely the place to go if you want great food and service.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2010-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lQfk68vyItVpGIj6XsypUg", "review_id": "V_uHzcPCz1f_sAwrnCaIgw", "text": "I love this place!  The food is amazing and the owners are charming to a fault!  The Hummus, Grape Leaves, Kibbi Akras, and the Lamb Dinner are my favorites!  Highly recommended!!", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2011-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "RiWyLrlbg6EzAXt8O36VAg", "review_id": "DWSZ804w1wOnkng6ZkJItg", "text": "One of my favorite middle eastern restaurants in the valley! YUM!\n\nSister and brother owned, this family restaurant offers a loving atmosphere and handmade and authentic food.\n\nWe have come here countless times, and every time we are greeting lovingly. They treat all their customers with care; stopping by and checking if things are okay. The service can be a bit slow at times, but the brother and sister and always running back and forth from the kitchen, and the table cleaner works very hard, is super friendly, and helps out the owners when they are busy.\n\nI don't think we've had anything from the menu that has disappointed us. The hummus, babaghannouj, fool (LOVE it), and tabouli (taboule) are all amazing to start with or have as sides. Scratch that... all of the appetizers are homemade and delicious. You could make a meal out of all the starters.\n\nBe sure to get some lentil soup with your entree (can be a tad salty sometimes), and if they have some homemade dessert, make sure to end your visit with some baklava.\n\nThe lamb kebabs we always get; you get a ton of food in each entree, including rice and hummus (if you don't like a lot of olive oil make sure to ask for hummus and babaghannouj to be served without olive oil drizzled on top).\n\nFor a good sampling, get a bunch of appetizers to split (vegetarian combo platter is a good place to start), and for the entree the Byblos Mixed grill offers lamb, chicken, and keufta (ground and spiced meat) kabobs.\n\nDespite coming here so many times, we still have many things we want to try. The problem is wanting to get the same delicious meals we got the previous visit instead of trying new ones!\n\nByblos will not disappoint! I would recommend calling ahead to make sure they are open. Lunch and dinner are served, but Tuesday through Saturday they close at 3:30pm and reopen for dinner service at 5:00pm. They are closed Mondays, serve dinner only on Sundays, and usually have a week or two in July/August when they close for vacation.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2012-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IE9wmWPGWx97VehtlRmKKQ", "review_id": "tzPvQD5WYGeIQLii19Y0Ig", "text": "Where can I start with this majestic palace of deliciousness?\n\nDo I start with the cradle-to-grave phenomenal service that I received? Each employee assisting with our meal was gracious, friendly, passionate about their food, and helpful, with a customer-minded approach. The recommendations and guidance were all spot-on and without a spot of condescension or assumption as to palate.\n\nDo I start with the delightful Lebanese beers served cold and modestly priced? Or would it be wiser to start with the hummus plate, seeping out of its serving dish with tender meat, succulent tomatoes, warm, crisp pita, and crunchy pine nuts? Each bite matched the oily, savory flavors of tahini and rich spices with a cool splash of spicy pilsner. \n\nOr do I start by echoing the well-deserved praise of the tomato soup? Like something out of a volcano, the tomato soup etched a crimson, bubbling line along my taste buds, dazzling me with creaminess and soothing me with earnest tomato flavors.\n\nI'd probably have to start there, because it would be wrong to start with the lamb special of the evening: ouzi. Baked after a long bath in deeply soothing marinades, the lamb was moist and full of layered flavors. Dipped into mint chutney, the flavors evolved further, forcing me to helplessly devour every last piece, while catching hints of cinnamon and pepper. \n\nSidebar: my special lady friend had chicken taouk and it was fantastic as well, with a crunchy black grill mark that sealed in a citrus and garlic burst.\n\nAt that point, I was prepared to shower Byblos with hyperbole and senseless praise, damning myself to an eternity as the ferryman of new souls to Byblos, a sort of Charon to their restaurant. But then I ate their Tiramisu and it was the best Tiramisu I had ever had up to that point in my life.\n\nI'm writing this review from inside one Byblos' meat coolers. I haven't left in two days. I've been living in the kitchen, eating their food without rest. And yet, even now, as I pause to digest, I'm not sure where to start next.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2013-06-15", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "wUEp87FqOB9ew27Iz6zk_w", "review_id": "c46ZFVBjCbluuPkQGFXg0g", "text": "I love family-run businesses and I try to support them over chains whenever possible. But this place fell short. I really was torn whether to give it 4 stars, but I felt too underwhelmed to give it anything more than 3.\n\nLet's start with the good: the tomato soup they serve as a side for their entrees is DELICIOUS and creamy and rich. their hummus is also really good! our server was very friendly.\n\nThe not so good: the pitas they served with their hummus were a little hard/dry. they served french fries (the crinkly frozen kind) as a side for their gyro. service is extreeeeemely slow.  luckily we were not in a hurry, but literally from the time we finished our food to the time when anyone came by to see if we were done or wanted the check it was 20 minutes. and when we first sat down to order it was a good 10 minutes before we got water or anyone asked what we wanted to order. I suppose it's part of the charm of being a family business, but just keep that in mind and don't plan on rushing through a meal here.\n\nThe bad: I ordered the greek salad combo with lamb kebab and hummus.  the lamb kebab was literally just 3 chunks of kebab (and I didn't like the flavor). and the hummus came in a tiny condiment cup, but with nothing to dip it into?  I've never heard of eating hummus on top of a salad, but maybe that's what I was supposed to do. also I felt a little pressured when our server kept asking us if we wanted something to drink other than water or if we wanted to order appetizer, dessert, etc. - you get the picture", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 3, "date": "2013-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yhZxCcGyhltqsJN6foL_Wg", "review_id": "5MpedCb36hXn0YB_NYYxfw", "text": "I love this mom and pops owned restaurant. Two of my good friends have been eating at byblos for years and always spoke wonderful things about it. About a month and a half ago my husband and I ordered some food to-go and were pretty happy with our experience. The hummus is wonderful and the falafel is the best I've found in the valley thus far. The gyro meat is a bit thicker and a different consistency than I'm used to, but it was tasty. The soup was really great too. This place got three stars because I think the gyro meat could possibly improve a little, and the inside of the restaurant is really dated.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 3, "date": "2014-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "51xMesGgP3b3pQLnpOj5lQ", "review_id": "9gZkXeQpYoI3sRsCexquVw", "text": "Food is absolutely delicious and also well priced considering the fresh homemade ingredients and the certainly ample portions! Went with my mom and we each started with the soup of the day - lentil - which was creamy and flavorful. It came to the tank at the proper temperature which is important to me with soup. I HAD to try their tzatziki so I ordered a gyro plate (boring, I know) but the lamb was absolutely amazing and very flavorful. The fresh pita was warm and fluffy and I also loved the taboule on the side. The tzatziki, while fresh tasting, is not the best I've ever had. It was good though. My dish also had rice pilaf on the side which I found to be a bit bland but my mom enjoyed it. \n\nMy mom got the special of the day - slow cooked lamb shank. It literally fell off of the bone. She loved it and also enjoyed her fresh pita and grilled veggie medley that came with the dinner. She did not like her rice, but I loved it so we traded. Hers was a mixture of rice, pine nuts, and ground beef. Great!\n\nWould go here again if I was in the area. Place is very cute inside. Only negative for me for the waiter/possibly owner who stood next to the table while we counted our money for the bill and discussed the tip. Very rude and not appreciated. Otherwise a good experience.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 4, "date": "2014-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "R0rJRdM4y8imYnaXYzNlpA", "review_id": "Yb3BUFRgWXEbP1pyCHwqLQ", "text": "Best restaurant EVER! I have been going here since I was two years old. The owners of the restaurant are family now. The service is always personable (even when we bring people that they don't know)! Also...the food is AMAZING. We crave it all the time. Get the tomato soup! You won't regret it! They are willing to help with any kind of diet restrictions :)\n\nEAT HERE! NOW!", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2014-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2PAqIwpqGK2JNFftWlQfnw", "review_id": "IfZhrMZz3pg1hgwbwgOxvA", "text": "This rating is for service. Was greeted promptly and quickly shown to a table where we waited & waited & waited. No water. No service. Left an went somewhere else.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 1, "date": "2014-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vmB4_OZDeID712Hkqhn8wg", "review_id": "EtDfuIRCuJCoYg29w_srQw", "text": "Delicious food, especially the oven roasted lamb, tomato soup, and foul moudammas!  Lengthy menu with something for everyone.\n\nNice atmosphere, not too loud to hear your conversation.\n\nTo top off the good food, the owner and his wife were extremely friendly and kind, with very responsive service.  We'll definitely be going back!", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2015-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zuDY8WxampgTT38CmxzTTw", "review_id": "Dnn6eISbWjsafQKB_JahyA", "text": "3 of us ate a great dinner here. Authentic food, delicious,  friendly owner,  good prices. Full bar.  We loved it.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2015-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_Q4Ks28-Jks-TjFT-YXw_A", "review_id": "HT77gduLwklaySGM3JA-UA", "text": "Our 1st time here.  Warm friendly atmosphere!    I am not a Greek food eater.. the menu was rather extensive.  My son had a gyro sandwich , plain and dry!  My hubby had the full version of gyro sandwich! He rather enjoyed the tomato soup!  I am alergic to tomatoes so I could not eat the soup.  I chose not to eat and I think I might have offended the owners.  I just couldn't eat!  So now, my hubby and son enjoyed the food and we will come back when I am hungry!!   So please come by and enjoy the rich warm atmosphere and good good!", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 4, "date": "2015-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mDzMELsP_F-MQJUSJiT2ww", "review_id": "hIX3p7amtfAJvXrdAruhEw", "text": "Good Food, Mixed Feelings...\n\nFollowing a craving I've had for Lebanese Garlic Sauce, I ended up at Byblos for a much anticipated late lunch. I also brought along a printed coupon they had displayed on their web site.\n\nI had called ahead to ensure that their garlic sauce wasn't the garlic mayonnaise mixture (yuk) I had been served at another restaurant in town as garlic sauce. The person who answered my call to Byblos assured me that there was no mayonnaise in their garlic sauce. I set out anticipating a nice mouthful of savory emulsified garlic, lemon juice and olive oil - or something approximating that - like I always used to be served in my favorite Lebanese restaurant in Minneapolis.\n\nI was seated and provided with water and a menu immediately. I arrived after the lunch rush was past so service was not a problem. \n\nI was going to order the grilled chicken breast lunch plate, which was served with garlic dip, but the owner encouraged me to try the chef's special of the day instead. The special was spinach simmered with ground beef and spices and served with rice pilaf and hummus. It included a cup of their tomato soup. I also ordered garlic dip to go, and a glass of their yogurt drink.\n\nMy soup was brought almost immediately, and was absolutely delicious. I could eat that soup daily! My main course was not far behind. It was good, but left me wishing I had ordered something with punch to it. I was really glad I had ordered the yogurt drink as it gave my meal additional flavor dimension.\n\nI was left wanting something additional, so I ordered the Honey Pudding for dessert. I really don't know how to describe it, but it was fabulous and wonderfully creamy!\n\nI was feeling that I'd had a good experience overall, and before the check was brought I gave the server the coupon I had printed from their website. It read:\n\n\"$5.00 OFF Any Dining Experience of $20 or more.\n- Cannot be applied to the purchase of alcoholic beverages\n- Coupons may not be combined with any other offer\n- Not valid on Holidays or special events\n- Coupon void if altered\n- One coupon per party\n- Expires 07/31/2015\"\n\nThe server took the coupon and a few minutes later, the owner came over and explained that the coupon was only good for dinner. Nothing on the coupon (above) or the website had indicated to me that it was for dinner only, and I had intentionally spent over $20 on food because $5 off seemed a good reason to do so. Of course, he was the owner so his interpretation prevailed. I didn't make a scene over it, but it left a bad taste in my mouth.\n\nFinally, the much awaited garlic dip! I opened it at home a short while later. It smelled nice and garlicky, but was not at all what I was looking forward to. I don't know what it was made from, but it had a texture a bit thicker than hummus. It was sort of like dry garlicky mashed potatoes. There was apparently no lemon in it. I should have asked more questions. So, at this point my quest for garlic sauce remains unfulfilled.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 4, "date": "2015-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0ah1h_VHFfxDCBmVPskx4g", "review_id": "gkEXDUko-FZRLDeK4XDhZg", "text": "First of all, the owners are from Lebanon and are very good hosts. To that end, the service was very good.\n\nI came for the Moussaka, my favorite Greek item. And they didn't disappoint, but not my favorite. They're closed for a few months of the year so the owners can go home, but when they're open, they're worth visiting.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 4, "date": "2015-07-18", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "6VpxYVPYQL24Ya9hEU6XgQ", "review_id": "R1-IJK8x-hxNgU3R4OaynQ", "text": "Wish I could start a global campaign and basically force this place to go out of business.  The owner is a major a-hole.  I could use other colorful language, but I'd rather keep this clean.  Food is totally generic, service is awful, and basically not worth the drive!   You want persian food in Vegas, go someplace else.  We catered a party at this place, was treated with disrespect and felt utterly cheated!!  The owner is very shady, and is out to suck as much money as he can from you!  Wish I could give it Zero stars instead!", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 1, "date": "2008-06-03", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "bMpF5OPrf916Y0Gu13VIMg", "review_id": "6Wmq6tb6SnC4x7jq79vRBw", "text": "We attended the grand opening last night of Habib's new location across the street.  It is a much more nicely appointed venue and very large inside.  The market is actually smaller that the old location but still adequate.\n\nMany dignitaries were in attendance including Mayor Goodman & Sheriff Doug Gillespie.  The beef kabob was terrific along with the excellent chicken kabob.  Add to that good rice tadig, two very flavorful khorish (stews) and a tasty salad shirazi.\n\nA belly dancer worked the room along with a great bevy of traditional persian music.\n\nBeing a huge fan of persian cuisine, I have to say every visit is at least 4 stars.", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 4, "date": "2010-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4HduicQxqt2aUjZeDkY-YQ", "review_id": "yULOAfOLD5-zvQP9q7cEmg", "text": "I go to Habibs every week, it is a pretty big place, very clean, the owner seems to be a very good host, and he seems to genuinely care a lot about his place. I was surprised to see bad reviews on here, dont know why. The service is good and professional, I will admit a bit slow at times, but I think the food is made to order so its ok. Great food and good prices. I usually get the chicken kabob, or the koobideh which is a ground beef on a skewer dinner. They give you fresh bread warmed, which is great. The rice is very good and hummus is too. There are always fresh flowers or roses on every table every time I go I noticed. This is a good place, check it out, I live in Vegas and go to a lot of places too. They take the last order at 9pm so dont get there too late!", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 5, "date": "2012-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "xwrTuRYZOTVdRzlKtvSfXA", "review_id": "PRDZrR9Hq3d2N6ow1ihIvA", "text": "By far the best Persian cuisine that I have ever had in the US!! I was yearning for Persian food so my friend and I decided to come to Habib's. The ambiance was great. The way the restaurant was decorated was very chic and upscale. My friend and I both ordered the soltani, and mast musir. The owner was a gentleman. He came to our table and greeted us just like you would greet a guest in your own home. The food came out promptly. The kabob was tender and juicy. By far the best I have ever had! We live in San Francisco and wish that Habib's would open up a location in San Francisco. At the end of our dinner, the owner brought my friend and I a rose as a gesture of his appreciation. It was very sweet of him. So don't listen to the negative reviews, go to Habib's and see for yourself. Thank you Habib's Persian Cuisine for your great hospitality. When, we come back to Vegas, we will sure be coming back here again :)", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 5, "date": "2012-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PTP6zwTCVDckpWgyNByaKA", "review_id": "XPgxWJKXYKcwXMbXi4FI9w", "text": "Excellent place for family. Good food & service.", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 5, "date": "2013-08-17", "type": "review"}
{"votes": {"funny": 2, "useful": 8, "cool": 0}, "user_id": "GculwQ2NUY_0hh_YOlaQxg", "review_id": "8-eIvlK6ryTqkjrkIvjRWw", "text": "It was 4:00 pm when we got there. It is a very nice place . But Nobody was in the front desk like 5 minutes. A young boy who doesn't know anything about being a waiter showed up. Led us to a table . then we waited like 15 min to be taken an order. \nFinally , after 35 min we received our lunch while it was not fresh.we asked for the owner after 10 min he showed up. The owner couldn't stand to even listen our opinion.\nAny way , i don't recommend expecting good service over there.", "business_id": "QkVSaXjg5475VD3sZixCZQ", "stars": 1, "date": "2014-06-02", "type": "review"}
