{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UD7Y1CqfY6mDmRwIuCf6nA", "review_id": "k12sxczZxOzmISED_rqrAA", "text": "Right, so......\n\nFirst off, hire employees that actually appreciate having a job.  Not ones that are there because they are forced to.  That way, maybe you can actually earn a decent review.  If you start off with a bad experience with an employee, you're not going to get a great review.\n\nI went here midday on a Sunday.  Thought that was a great idea, especially when I got there and there were no cars in the drive thru.  Pull up to the sign to order and wait for five minutes before I am even acknowledge that I am there.  Finally order and pull around, I wait another five minutes.  I could understand the wait if there was someone in front of me, or if the sit down area inside was packed, but there was no one else there but ME.\n\nI'd gladly tell y'all the employee's name, that is if where the name is suppose to be wasn't ripped off.  All I can really say is that she was a real ball of sunshine.  I was made to feel like I was interrupting her day and that I should have just went somewhere else to spend my money.\n\nYou know what really puts me in a tizzy (yes, I just used that word)?  Leaving the drive thru, driving the distance to my house, walking into my house, sitting down to feed my face and find that part of my order wasn't given to me.  *enter angry expletives here*\n\nI doubt I'll be revisiting this location again, I'll drive the further distance from my place the next time I'm craving a taco or two.", "business_id": "JL5B_s1EoN4zIru4JSw4Qg", "stars": 2, "date": "2012-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Gwn-i0NXje_EyjOuhhFTSg", "review_id": "VDsXJglNAk_B_via7FvUQQ", "text": "Food tastes great. I loved it!", "business_id": "hhNlQWaKqGbMPoeZHoL-IQ", "stars": 5, "date": "2014-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pwO1ArGidx-tElfE3uLNGw", "review_id": "c_gRzEA9lH9WzZUUazPHBg", "text": "Try the fish or shrimp tacos. They were amazing! Don't bother having the one with chicken. I thought that was quite bland!", "business_id": "buVALudg30kgkDusqB3yJw", "stars": 4, "date": "2012-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3JW6l0odgStC6vI-ix7h1w", "review_id": "fBejnRWVHNm3QDR3qGH9pQ", "text": "Got carnitas.. good food, large portions.. service was o.k.  I wish it was more authentic.. I'm use to L.A. authentic mexican food..  looking for homemade salsa, mexican cheese and handmade tortillas!!", "business_id": "2VuPoaFPktvtAqTX_Fzc-A", "stars": 3, "date": "2014-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fyVyRZsiRKTQTDRZuLpL7w", "review_id": "qVnEjSf_7H_r1H40OYJMiQ", "text": "Since moving to South Charlotte my wife & I have struggled finding a Mexican Restaurant with great food at a reasonable price. The struggle is over. Monterrey delivered great food, great service at a reasonable price. We are just mad it took almost a year of bad experiences before we found it. To top it off... I Love the Salsa!!!", "business_id": "CxGK5_GoIhG9798zYPsvfA", "stars": 4, "date": "2014-06-14", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "vMiQG3SUOHjLlvwVzSW2HQ", "review_id": "RoJitt-8U6BzrAANY8TSpQ", "text": "Please don't let their dive-y appearance and deserted-motel surroundings deter you from eating here! This place is a gem.\n\nNot only are the staff friendly, quick and on top of their game, but the food is FANTASTIC!! On Sundays I always order their vegetable fajita special: for only a few dollars you get a giant, sizzling plate of vegetables, rice and refried beans, and all the fajita fixings your heart desires. They also have endless chips and (what might be the best) salsa (in the world). Try their queso too, it's quite good.\n\nNow that I live in Ballantyne, I rarely am able to trek to Miguel's but I dearly miss their food, great service and unbeatable prices.", "business_id": "p_HFt0I92MHDNPWvdtyEBA", "stars": 5, "date": "2013-08-09", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 0}, "user_id": "NSznNf38X6FWzu4gB1cNmA", "review_id": "TeUffEahEsB_ZzK3erR9ng", "text": "Tried this place tonight after reading the reviews. We went in very optimistic. We first tried sitting outside but their were wasps swarming in the ceiling. Food was greasy. Salsa was just okay. And, they make their enchiladas with white cheese which is not authentic Mexican. Guacamole was instant. Staff was not friendly. Will not return.", "business_id": "p_HFt0I92MHDNPWvdtyEBA", "stars": 1, "date": "2015-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I9-qaI_sfTJzeG52WZMdkQ", "review_id": "nRX2luO80DjkodA-OaUiKw", "text": "After fine tuning my ordering process, zapata's gets upgraded to 4 stars. If you ask for spicy cheese dip, it will come out slightly green (from puréed jalapeños, I think) and delicious! Also the green salsa is better than the others. \n\nGoat cheese stuffed jalapeño peppers wrapped in bacon is the most interesting appetizer I've seen on a Mexican menu in a while. Definitely worth a try. \n\nVegetarian chimichanga is fried hard and stuffed with various veggies. Enough to split.", "business_id": "rg1-6A-8SKXGh_p-Abbyxg", "stars": 4, "date": "2014-07-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "_X0Xt2z5Q7GESxxRzvy4_g", "review_id": "ZhnoJskY-f6-3uWg6WC01g", "text": "I SO miss working downtown & enjoying the ever so delightful Johnny Burrito!\nTheir burritos are so delicious...but it is filling. (c) Ron Burgandy.\n\nThe regular size burrito is the way to go! Picadillo (spicy beef), lettuce, tomato, pico de gallo & cilantro is my weapon of choice.\nThe chips are always fresh & have just the right amount of crunch, but again...you have to be pretty hungry to eat the burrito & chips!\n\nMind you the space is small & there will be a line at lunchtime.  However, the line moves quickly as long as you know what you want prior to placing your order.  Think of it as a \"Subway\" or \"Quiznos\" type of order.\n\nI defintely put Johnny's up against Moe's, Qdoba, or Salsarita's. Not to mention, you're supporting a small business owner!", "business_id": "iTjwgc3rHS5k3GptqIp2Uw", "stars": 4, "date": "2011-08-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "2BnDDp6K_XCNOPIWPKfS0Q", "review_id": "EPETjJ434U28dbh1OHCXEg", "text": "Arrived late on a Friday night and had no wait time. Staff was very friendly and food was good. I had the Hawaiian quesadilla and would get it again for sure!  Probably not going to be added to my favorite Mexican places, but definitely doable.  Reasonsably priced and great service with an extensive menu with many mix and match options!  Check it out!", "business_id": "She6nAFoCwhUcfdeYWIgzA", "stars": 3, "date": "2011-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YT0iTm2y-Q9CoQhzYnIWSA", "review_id": "qnGwu3ZEEUZKrK2xF-lIRA", "text": "Excellent food and very fast and courteous wait staff.  I always get the chicken burrito made to order with queso on top,  its huge and super delicious.", "business_id": "S4TWo9X6b3gU6uucj4JN3g", "stars": 5, "date": "2012-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "MUdI4JBeHgkil5sChUHZNA", "review_id": "MpAss57S59g7-K0I8uTo3w", "text": "Pedro's is my favorite Mexican resturant in Madison. I miss the one located on the West Side of town, but food is good at any Pedro's location. \nMy favoirte thing is their pressed and warmed tortillas (they are a sweet treat if you butter them and put some sugar on them). They have good complimentary chips and salsa in the dinning area. And anything I have had on their menu is great. My go to order is the shredded chicken burrito. I have even gotten the three pount burrito and split it with my Fiancee. \nFavorite margarita flavor is peach!", "business_id": "wPidHd5FxspPRgVqdEQ-Xw", "stars": 4, "date": "2014-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KBsh9Y0qz9O9uaZqfkSG9Q", "review_id": "c8DQAk5Smd7u1OgnnWwsQQ", "text": "I like El Charro a lot actually. They were understaffed when I went so it was messy but the customer service was still great and so were the tacos. Maize is a little better but the SALSA at El Charro is bomb. The tortilla chips are better here too.", "business_id": "cT9uP_Lr5bz6jhIqZPlLcw", "stars": 4, "date": "2015-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "fkZ_t7co7VxO2jPI9bD5bg", "review_id": "c_4rkfmyc6DgaKRT8bC7kw", "text": "I have been to this place a couple of times once for dinner and a couple of times for happy hour. And I love it. The servers are friendly, the place is beautiful, the best part is the outside patio. The only two negative things are the small bar area (happy hour is only in the bar) and the birds. The birds are cute, very chatty and will join you at your table to try and share your chips.\n\nThe food was great, I got the enchiladas which were tasty and I asked to change the side and the waiter was more then happy to let me do that. A friend got the Tuna salad which she enjoyed. I am not a fish person but she let me try her tuna and it was actually pretty good. The chips that come to your table are okay, I'm not a fan of the sweet potato chips, the texture and taste just do not work for me. So when I go I ask if I can just get corn tortilla chips, and they are happy to do that too. The salsa is a red smokey salsa which is good, but you can ask for green salsa which is just as good.. maybe better\n\nThe best part of this place is the Happy hour. The drinks are cheap and tasty. The best is the Grand Canyon Margarita which a mixture of orange, cranberry and prickly pear juices, its strong and only 3 bucks. The regular margaritas are excellent, on mondays that have a 10 dollar pitcher deal, a friend and I were able to get three each out of the pitcher. Good thing she lives in walking distance to the place. \n\nAnother good thing about the happy hour is the food. The bar has its own list of items in addition to the restaurants main menu. The best thing on that list is the chicken nachos, so good, best nachos I've had in a long time. Another is the cheese crisp with carnitas, very tasty.  Most of the items on this menu are around five dollars, and for five dollars you get a lot of food enough for two. \n\nI would highly recommend this place.", "business_id": "e5kc0CQ4R-PCCDgb274gSg", "stars": 4, "date": "2008-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "T3nizBSxK68NAC9jeL8s6Q", "review_id": "SMFrQSIJvUPgTDao3DxcEg", "text": "I stopped in with my wife last night, as we are both new to the city and were celebrating our anniversary. The food was great. However, the staff went out of their way to go above and beyond my expectations. They were friendly and prompt and the manager made us feel important as patrons.", "business_id": "e5kc0CQ4R-PCCDgb274gSg", "stars": 4, "date": "2012-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "6yTRD8vJA98oB0g2Z9wZvg", "review_id": "byHWFMjXEENQzzzURmtfjQ", "text": "Love. Love. LOVE the happy hour! Happy hour is only at the bar area. I'll be frank, happy hour is great because of this bartender whose name I'm still not quite sure of. The several times I've been, I've asked and he jokes around a lot so I'm not even sure. Alex, Al, Carlos, whatever, you're awesome.\nMargaritas are strong, guacamole is delicious, wings are awesome and most of all...THOSE CHIPS! The fluffier non-corn tortilla ones and sweet potato ones are my favorite. Salsa is a smoky and dark, unique. Coconut mojito is amazing. \nUnfortunately, I'm moving soon and will miss this place like crazy. Canyon Cafe happy hour, you will always hold a special place in my heart.", "business_id": "e5kc0CQ4R-PCCDgb274gSg", "stars": 5, "date": "2015-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "o28wP2ypjf84sABZHNypBA", "review_id": "oclvST4QwvzNC8mrzIIpxQ", "text": "You have NEVER tried mexican food till you've had it here (and I've been to mexico several times)....and if your gonna come and order tacos - then just go to taco bell!\n\nThe menu is extensive, I've tried EVERYTHING from tongue to intestines and I am SOOO not \"that\" kind of eater!  Delish each and every time! The wait staff is helpful and some of them have been there for years (speaks heavily on the quality of management...they must be as good to their workers as they are to their customers). \n\nYou will not be disappointed....if you go for breakfast, you have to try the Machaca Chiliquilies......unforgettable!", "business_id": "BESmH-lmMm34_EefL8X9fQ", "stars": 5, "date": "2010-07-09", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "AZGbse_LZ1p8gCsmWtnfNA", "review_id": "NVxBFpINachnCHFf1FTaGQ", "text": "Best chlliquilles anywhere i have had them.....THE END!!!! I\ntravel 180 miles just to get them no one else compares yet...", "business_id": "BESmH-lmMm34_EefL8X9fQ", "stars": 5, "date": "2013-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZsjBAQiO5lNa_Tzlr3_FlQ", "review_id": "roi3snGo47ccQWzX3enS8Q", "text": "I'm Mexican so I am very particular about my Mexican food, it has to be better than I can cook it for me to pay for it- or I have to be hung over... Either way, this place is the best, I come here just for the tripas but everything is delicious and the salsa is hot! it gets packed so be prepared to wait on the weekends...", "business_id": "BESmH-lmMm34_EefL8X9fQ", "stars": 5, "date": "2014-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h7NuMwL7ZldDMrnCDLqVcA", "review_id": "KHyL-RgPghLlqOpEnNfE0w", "text": "I love this place. The food is AMAZING! \nMUCH BETTER THAN THE CHAIN MEXICAN RESTAURANTS\nI usually go around lunch time and I always get the Shredded beef taco, cheese enchilada plate.\nBEWARE THEY DO NOT TAKE RESERVATIONS \nIf you go during the lunch period of 10:45-1:30 allow yourself 2 hours because there is almost always a 30 minute wait but IT IS WORTH THE WAIT!\nParking is crazy too, the lot is always full", "business_id": "BESmH-lmMm34_EefL8X9fQ", "stars": 4, "date": "2015-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "O6yAy9-DOnaOv-eeF_E7Ow", "review_id": "VJvDfGI8xi-0lom2ncN8pw", "text": "These are the best tacos I've had since moving to Phoenix, and Taco Tuesday makes it a great deal too. The shredded beef tacos are the best, and they'll send you home with chips and salsa too (the hot red salsa is a delight)!", "business_id": "D09yG6Z3gcsh24Qn7Y4gYA", "stars": 5, "date": "2014-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "02mA_muC-5A_Oe_tv8tg0g", "review_id": "2CKxiI0pyKc8ZicHbD0RSw", "text": "A co-worker and I found ourselves in downtown Phoenix trying to catch a view of President Obama leaving the Phoenix Convention Center after his speech to the VFW convention.  After just missing the president leaving, we wandered over to the Arizona Center and settled on Mi Amigo's for lunch.  The service was excellent. Our waitress was Rebeca. The food was so-so. There are a lot of Mexican restaurants in Phoenix, and this one doesn't top the list, but if you are in downtown Phoenix, and confined to that area, it's not bad.  Another Yelper complained about the salsa being weird, but if the standard salsa is not your choice, ask for the smooth hot salsa.  It's excellent!! You have to ask for it.", "business_id": "-lOSaCuBRAvX5JBifx-EMw", "stars": 3, "date": "2009-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iaT-cPPhBB46VfWW8KJBBw", "review_id": "0ZtTcg-e0914uKl0RQ9Nug", "text": "Visited this place right after checking in to the hotel right across the street for a conference. I was STARVING! A co-worker and I love Mexican food, so we decided to give this place a shot. We were greeted by a hostess, showed to our table, and not long after, the waitress came and got our drink and food order. We had to ask twice for chips and salsa. Salsa was a bit chunky...more like pico, and I don't care for chunks of tomato, so that turned me off. I ordered the chicken deep fried tacos. I really wasn't impressed. No flavor. The tortilla wasn't crispy enough. Not a good meat to veggie to tortilla ratio. Rice and beans were good though. Our flight had been delayed and it was pretty late, so when we were ready for our check, our waitress was no where to be found. I'm not sure that I'll ever try this place again if I'm ever back this way...", "business_id": "-lOSaCuBRAvX5JBifx-EMw", "stars": 1, "date": "2014-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ia69zBzyIJdvYipDfkoE1w", "review_id": "8Og-sB2pydl-iwgbJxLSHA", "text": "Pretty terrible all around.  Food tasteless, salsa weak, margs weak and watery.  Atmosphere very loud, ( game night) and still only about half full.  Restaurant very warm ( temp wise) waitress had sweat dripping.  Yum!  Only redeeming quality was patron  shots.  Wouldn't go back.", "business_id": "eK6KGMKqU_4nB9RdayZD7Q", "stars": 1, "date": "2012-08-25", "type": "review"}
{"votes": {"funny": 3, "useful": 6, "cool": 0}, "user_id": "3dno9Y7mtvi2tq6IfMpDeA", "review_id": "LHiXrGE5oa9y61ffO_bFOQ", "text": "There aren't a ton of restaurants and are ABSOLUTELY PHENOMINAL.  This is one and, dare I say, is the best mexican food in AZ.\n\nI've written a fair amount of reviews and this one is likely to sound gushy enough to make my wife jealous.\n\nTheir chips are made fresh.  Not made fresh that day.  MADE FRESH FOR YOU, right when you order them.  They charge $1 for a very large basket.  Salsa is free.\n\nThe only thing I am not a fan of there is their red salsa, but thier green is so damn good and so damn hot.  I pay, but its worth it.\n\nOk, now the beans. Oh my God!  They are so creamy and perfect.  I highly suggest you order a side to go along with your chips.  I live a solid 30 miles from this place and will drive here JUST for the beans.  My wife loves beans so much.  Its almost unnatural.  She could seriously sit down with a plate of beans, thats it, and be happy.\n\nShe get absoluely giddy when she knows we are gonig here.\n\nRellenos.  Oh my God AGAIN.  I can't even describe how wonderful they are.  They really are unlike any other restaurant's I've ever had.  First off, they are huge. Secondly they use a batter that fries up so light and puffy.  So you have this slightly crisy, kinda fluffy exterior surrounding strips of relleno pepper with the most luscious, ooey gooey cheese in the center.  I dump a ton of their green salsa on top and just go to town.  All you'll here from me are moans and sighs or delight once it is put in front of me until I'm done.  They actually continue a god 30 minutes after I leave as I replay the feast in my mind.  WOW\n\nThe chicken enchiladas are perfection, the machaca is oh so good, tacos are cripsy goodness.\n\nHere's my order...  Chips with green salsa and a side of beans while I wait for my a la cart cheese relleno and either a chicken enchilada with green sauce (not salsa) or a machaca taco.  Depends on what mood I'm in.\n\nIf I eat the whole thing for lunch.  I don't eat dinner.\n\nThere are only a couple places that really deliver every time like Rosita's does.\n\nMMMMMMMMMMMMMMMM\n\nDAMN I LOVE THIS PLACE!!", "business_id": "hWhVP-28LYP3llaMlAJ_JA", "stars": 5, "date": "2012-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s83ehs-c7m7Q5NNDTFQa1g", "review_id": "QNB9zJM3O_uNbVXs-BmXrg", "text": "Chips and salsa were really good, but beware the chips cost $1. Not a big deal, they make them fresh to order too. I had been looking forward to trying Rositas for a long time based on the Yelp reviews. My mom ordered the chicken enchiladas and I ordered the machaca chimi both came with rice and beans. My mom enjoyed the enchiladas, and I thought the chimi was okay...nothing spectacular. About halfway through our meal, a baby cockroach crawled across the table. We both lost our appetite and asked for the check. I got my food to go, but just couldn't bring myself to finish it. Definitely disappointed..", "business_id": "hWhVP-28LYP3llaMlAJ_JA", "stars": 2, "date": "2015-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_N-DeS909pOyryxC0mMAjw", "review_id": "ulcex0cnICrm7UZkgefAyA", "text": "What a gem. This place is just true blue delicious.\n\nLet me put it like this, everytime I have gone there for some reason a bunch of Firefighters were eating there. Firefighters love good food and eat a lot but do not make a lot of money. If this place fits their needs then it exceeds mine.\n\nI always get one of the Tortas and usually take a few Churros with dulce de leche filling.\n\nThis place is just genuine.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 4, "date": "2010-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8YhLAmaYNHWSwAADbngtrw", "review_id": "2fD96_qZ2mH8GOyGDw4ANQ", "text": "Good homestyle Mexican cooking. This place has absolutely no frills. It has a huge menu, as well as a small market and panaderia. You order at the front and grab a table until your number is called. I absolutely melt over their sopes (both the shredded beef and carnitas are delectable) and their burritos are massive. Definitely a place with large portions. The prices are OK for what you get, though certainly not a bargain. \nLast time I went they messed up my friend's order. They were very polite and apologetic, and fixed the problem quickly and with a smile. Overall I love coming here. Great Mexican food in the heart of Phoenix.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 4, "date": "2013-06-30", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 3}, "user_id": "Q5dlLCEni_my05az9wIptg", "review_id": "NE8Rizh-PoUwOickgyAOFA", "text": "My friends & I affectionately refer to this place as Mexican Disneyland (I think I stole that from an article on this place or something). Where else can you find bacon dogs, carne asada sold by the pound, bulk cheeses & yogurt, fresh tortillas, 8 or so flavors of agua fresca and chicharrone the size of a \"small person\" under one roof -- besides maybe, Mexico? \n\nMy favorite is the shrimp taco sold in the back of the market at the pescaderia (even though it takes them forever to make) and a large cup of watermelon, cantaloupe, strawberry or horchata agua fresca. It's the perfect meal before a Suns or Diamondbacks game and a hell of a lot cheaper too! \n\nThe produce also seems to be alot cheaper than what I normally see at Fry's & Safeway. Too bad I'm never headed straight home or else I'd buy groceries there.  \n\nAndale! Andale! to Phoenix Ranch Market!!", "business_id": "VXIkI9_EbDbYHeO9IzKjJg", "stars": 4, "date": "2008-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "hfB5Aa8euV8dM0YvP_iLhA", "review_id": "TxPFXVZzZ3QTfBLo1ud4xA", "text": "This place is awesome. Even if you don't need anything, just go here and check it out. It's HUGE and filled with every kind of Mexican food you can possibly imagine. Everything is really cheap and they have TONS of fresh produce. They also have a large selection of hot sauces which I love. I haven't eaten there but my roommate used to go all the time and grab food from the little cafeteria looking area. Highly recommended. Need to try the rotisserie chicken that you walk past on your way in one day. Also, look for the gigantic pig head over by the meat. Disgusting, but photo worthy.", "business_id": "VXIkI9_EbDbYHeO9IzKjJg", "stars": 5, "date": "2013-07-08", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "N-D-d1Z4UybdlkK1HxlNPA", "review_id": "1dbR1qtpDbeR4LNfppAUhQ", "text": "Maybe the current economy has forced Tacos de Juarez to make some cutbacks in the quality of their food, because our recent experience was nowhere near as good as everyone else seems to have had. We live mere blocks from here, so we felt it was about time we tried it. \n\nThe chips and tostada base tasted off, as if the oil they were fried in was a little rancid. The cheese on the cheese crisp was plentiful- and pretty oily. My husband called the cheese in his chile relleno the most tasteless he had ever had, as was the relleno batter. \n\nI ordered a #1, but wanted to substitute a hard taco for the cheese enchilada. I checked the a la carte prices, and knew that the taco was actually less expensive, so I was sure I wasn't going to be screwing them over. I can't tell you how long it took me to try and explain what I wanted to our server. I'm sure there are those who would say it's my fault for not speaking Spanish. Anyway, I ended up getting my tostada and the hard taco, but no taquito, and no rice and beans. Then another 10 minutes of my life went by as I tried to explain again what I had ordered when the server asked if everything was alright, but that really, no one needed to bring me out any more food. I had had enough by that point and knew it would already be a Pepcid AC kind of night. The cook and the server argued and finally the server understood that she had gotten my order wrong. They comped my food, which wasn't necessary, but they insisted. My taco and tostada were just alright. The beans in the tostada were cold, which I am not used to.\n\nWe've had everything better somewhere else, and feel no need to return.", "business_id": "cgNIBHS2mLdbTRiodAT6EQ", "stars": 2, "date": "2009-06-11", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "7pkjLqRLn4UInVwG6FMv6w", "review_id": "ZaqFhwo9o4bsSWObC0HMtg", "text": "this will be short and sweet....\n\nGREEN\nCHILE\nBURRO\nENCHILADA\nSTYLE\n\nIt absolutely does not get any better than Rito's - and yes, as mentioned by others, they do still on occassion make tacos - but they really are not needed when they have the best\n\nGREEN\nCHILE\nBURRO\nENCHILADA \nSTYLE\n\nin town.", "business_id": "Xo9Im4LmIhQrzJcO4R3ZbA", "stars": 5, "date": "2009-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "iPyKkZQbYE7n0rrcw4_2Mg", "review_id": "8WrhoHEzO93YOp-p-rYXWQ", "text": "I have only been here once but I have been dreaming of them ever since. It is real home cooking with care.", "business_id": "Xo9Im4LmIhQrzJcO4R3ZbA", "stars": 5, "date": "2013-06-17", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 1}, "user_id": "wWAePLcwbIDyrFNBQ44png", "review_id": "MfZ20RitMKbaeLAVt02v3A", "text": "I LOVE this place.  I have been coming here since I was a kid. Being mexican I am very picky about the Mexican food I eat outside old my home and compare everything to how my grandma makes it. That being said,  Rito's is by far the BEST place you can get authentic mexican food. I highly recommend the guacamole tacos.  You won't find them this good anywhere else. no matter what I get, I always get a side of rice and beans because they are amazing.  \n\nCon: there are a lot of other people who feel the same way as I do so there is usually a long wait and not enough space to wait. However it is well worth the wait. Everything is made fresh to order. \n\nFYI - I am typing this as I am at Rito's waiting for my order. Looks like my orders up, gotta go!", "business_id": "Xo9Im4LmIhQrzJcO4R3ZbA", "stars": 5, "date": "2015-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jI2a39IUJV7c9tw7rl4cWA", "review_id": "SfWqKFI08g1nZL91yP-TZA", "text": "Love this place. Outstanding ceviche, great chips and salsa, friendly service.  Every time I come to Phoenix, I go here.", "business_id": "NYBx4sdSVrN-I5Q8RfLMPg", "stars": 5, "date": "2015-07-30", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "--65q1FpAL_UQtVZ2PTGew", "review_id": "c-c8l_V4jnBGDknSrYS91A", "text": "Have you ever experienced molcajete? HAVE YOU?!\n\nThis is THE place to have that experience. I say \"experience\" because molcajete is more like a witch's bubbling brew than a meal. Mariscos is a cozy little restaurant in an area a lot of people won't flock to, but it stays busy. All the good stuff applies here... friendly service, great food, Mexican beers, Mariachis (on Fridays, I believe). It's just a great place. And, now that the formalities are out of the way, I can talk about the molcajete. \n\nMolcajete is actually the name of the stone bowl that is used more traditionally as a mortar for salsas and such. As a dish though, it's a beautiful mixture of spicy/tangy sauce, grilled meats, grilled veggies, and cheese. It's one of my favorite Mexican dishes, period. Mariscos serves theirs with tons of fixins (beans, tortillas, salsas, etc.) that could probably fill two people up on their own, but their generous serving is much appreciated when ordering this dish for a small group. It's definitely one of those meals that'll impress people when it gets served. Order one for the table, and you're going to have a good time.\n\nI could spout on all day about molcajete... But, would ya look at that, I have a decent size review already, and I haven't even talked about the restaurant's specialty, seafood. Well, I'll let you read some other reviews for that. I'll just say that I love their tostadas de ceviche de camaron! \n\nGo to Mariscos Playa Hermosa, and enjoy!", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 4, "date": "2013-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "GtG3kX_CWnK0YF5kKYTDGA", "review_id": "y-j47KZTY1BccsBXiCPIIg", "text": "This is the best place for real authentic Mexican food. Not a fancy place but the food is amazing!", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 4, "date": "2014-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AleTc3-ykskoc8Sd-2Z5og", "review_id": "CcODO2pQHWrDppC0du8rrQ", "text": "Every time I come here, I get excellent service and good food!  Love this place. Great ambience, too. Great furniture.", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 5, "date": "2015-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "y9KAS30idSmOXkoE9qCfig", "review_id": "zi9OhcZaLjM1_4ivW-UU_Q", "text": "It's hard 2 find a good Mexican Restaurant but I finally found 1. This little hole in the wall had one of the best GREEN pozole I've ever had. 4 sure going back to try the white pozole!", "business_id": "rAb_wfdKKPPbcIysjYcW4A", "stars": 5, "date": "2014-07-29", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "Ep3anRsVSShs7O4DlEmoWA", "review_id": "rz9tV5vI7qhYFbnIGgWrfQ", "text": "I cheated and read reviews before going, so I knew to order the Nachos Supreme which were really pretty good.  Well, at least, I gobbled them totally down as quick as I could.\nBig serving with lots of toppings, too.\nIf you want jalapenos--and the mild kind in brine like I like--just ask for it.\nGood food, good service...it's ok...not fabulous but ok.\nBeen here since 1945, so they must have some fans out there.", "business_id": "jzPMl-NoB5F2fwoHX3hN8A", "stars": 3, "date": "2013-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lv-93nAjwq47MsD7zH4Jbg", "review_id": "PUVcbcAG-qIJlj4jkr8I7Q", "text": "My wife and I came here after she arrived from a late afternoon flight.  She was on east coast time, and was both tired and hungry.\n\nThe staff here was friendly and seated us quickly.  Our waiter was helpful, friendly, on point, and attentive.  The food and margarita's arrived in a timely fashion, and was very good.\n\nWe were both very happy with our meal.", "business_id": "jzPMl-NoB5F2fwoHX3hN8A", "stars": 4, "date": "2015-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YgcTPwOg71DFCJ_8G-ieiQ", "review_id": "F6V1Eq7RUCjo8qaAc3EIWg", "text": "This location was converted to a \"Central Taco\" on Friday June 26, 2015.  I have a sneaking suspicion that the \"Central Taco\" is really just a front to get rid of the leftover food from Qdoba.  Does anyone know what happened?", "business_id": "WPSM_oTPceoSnwqQWfAsdg", "stars": 2, "date": "2015-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "yZEz7ZHDt9MU7ehH9ecCQA", "review_id": "Z8ZDdD0K24yUxtx7LbW5dg", "text": "I love Juans!  I have been coming here for about 10 years and the food is definitely authentic!  I have always had great service and most of the time is is pretty quick.  I have found the owner, Juan, to be very friendly.  The salsa is great and I haven't had anything I don't like here.  Their refried beans are fantastic and my favorite is their green chile!\n\nI highly recommend Juans!", "business_id": "DeAnVirgOxQnI36V1W158A", "stars": 4, "date": "2012-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "woLuH2ZDH2gUkaG72nFzEQ", "review_id": "XJ1RFeYaSwfl0OPavi6g3Q", "text": "Worst Drive Thru Service Ever!!! Sat for over 10 min such a pain in the ass. Cashiers are rude and still managed to screw up the most basic of orders. I will never come back here", "business_id": "kIvIqHvvFOc6aCutFYIvNg", "stars": 1, "date": "2014-08-21", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "DM5ahDB1rmceyyYEkXmudg", "review_id": "oyajuLG9SrZjols_0nQbbw", "text": "Jordan's is a central Phoenix classic. Owned by the same family for generations and serving local families that have been coming for generations, as well. The service is quick and friendly. They have the best cheese crisp in town and they serve a butter crisp that is totally addictive! (Not sure if it is listed on the menu though) My kids love the sour cream enchiladas!! I love the red chili and I won't even order it anywhere else because it never compares. \nIt has an old school comfortable feel w the big booths and dim light. The dress is totally casual but you'll def see cute older couples w/ their \"fancy shirts\" on for their night out.  I totally recommend going ;)", "business_id": "VlG9qxAc4d0em2djaU__xw", "stars": 5, "date": "2015-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9Tzqb8D0u88dP-k3StDsvw", "review_id": "b-7UK1zbUISKChz2d3_VBQ", "text": "This used to be our go to Mexican place, and we still eat there once every few weeks, but I have to admit its been a little hit or miss the last few years. The service is still pretty good and I still really enjoy my carnitas tacos a lot! We've had a couple instances where we got the chicken salad carbon and the chicken just wouldn't be marinated one night. Or the salsa would just taste a bit off. But overall, it's a really comfortable place with a pleasant atmosphere to get pretty good food.", "business_id": "0K35eGvzVRZEirNo5v_WfA", "stars": 3, "date": "2013-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MWt24-6bfv_OHLKhwMQ0Tw", "review_id": "_ErgsUxbvwin9_mLzPgQkA", "text": "This is really a 4.5 from me. \n\nI have been to several of the Arriba's and have never had bad service or any problems with my food. (I have been to the locations on Camelback, at Arrowhead Mall and off the 101 in N. Scottsdale)\n\nThey bring out chips, salsa and bean dip and it tastes absolutely amazing. The chips are always fresh and they have great salsa. They just keep refilling and refilling them, so my only complaint is that I get too full and cannot eat all of my food!\n\nJamie M. mentioned having trouble finding a vegetarian option there, but I have not had a problem. I normally get the bean and cheese burro topped with queso dip. I have also had the abado pizza with beans vs. beef the taco salad sans beef and the cheese quesedilla. I would eat any one of those items again. \n\nThe red and green sauce are not veggie friendly, but you can easily top your meal with the salsa or their queso dip, just ask for no chorizo on it.\n\nThe margaritas are really amazing too, and HUGE! I think you pay $11 but they are big enough for 2-3 people to share. The cost of the food is reasonable.\n\nThe restaurant itself is pretty fun. They have a cool mexican/sonoran theme throughout and everything is bright and colorful. \n\nIt's one of my favorite Mexican restaurants in the valley.", "business_id": "ib-y5nsfn3unE0lLY1vfAw", "stars": 4, "date": "2008-08-28", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "7AeG4-icp6BtnxiCoQmFRw", "review_id": "YlDqJVCHoIP0H3DmsoNHbA", "text": "It takes a lot for me to write a review and blast a company like this and to be fair, all the negatives come from their Gilbert location; the auwatukee location has always been good.  I've tried Ariba's several times and have been disappointed every time.  In the four of the last five visits, I've found the floors sticky and the tables dirty.  If they pay this little attention to the cleanliness of the front, I'm scared of what I might find in the kitchen.  Although I've always found the service to be slow and the waiters inattentive, Sunday's (8/5/12) experience was one of the worst I've ever experienced anywhere.  I thought I would take some out of town relatives to a good AZ Mexican dinner, but once we received our water/Ice tea, they were refilled once during our visit and that only after flagging down the waiter.  Minor, maybe, but when the food was delivered to the table, one of the meals was missing and I was assured it would be right out.  20 minutes later I flagged down the waiter once again and with apologizes, was told they would get it right out.  Another 20 minutes went by and my guests had all finished their meals before the waiter came by to see if we needed anything else. When I told him we still hadn't received the meal and since everyone else was done, we no longer wanted the meal and wanted it removed from our bill.  Again with apologies, he left and finally returned 20 minutes later with the meal removed.  Annoyed with the slow service I tried to return the bill with my credit card immediately.  I was ignored and waited another 20 minutes for him to return to take my money.  Save yourself a lot of aggravation and disappointment and go somewhere else.", "business_id": "ib-y5nsfn3unE0lLY1vfAw", "stars": 1, "date": "2012-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QcLFBX-sK651R8s4O5jAHw", "review_id": "L4WLANRCjkIqTenoUIPrPQ", "text": "I have been coming here since I was 8 years old so 12 years now and I have never been disappointed! The chips aren't too salty or flavorless-they are always refilled and the plus is that they are free! My drinks arrive promptly and the servers always have my food come out exactly how I ask for it. The ambience is great because it feels like you're in a real authentic Mexican restuarant and the people are always kind and polite. I will never stop coming here! Keep up the great service guys", "business_id": "ib-y5nsfn3unE0lLY1vfAw", "stars": 5, "date": "2015-06-11", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "25QJFdXmXGSvRhU8m33_Iw", "review_id": "1-4AikHOSLOPvOpgCxvVPQ", "text": "My favorite restaurante in Phoenix. I live in Ahwatukee, so it's a drive but its worth it. Great place to take out of town friends and dont miss the downstairs bar. We need more places like this in town, particularly in the East Valley which has nothing but chains.", "business_id": "5kRug3bEienrpovtPRVVwg", "stars": 5, "date": "2009-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RncvGh0Kd2vRr1JADQEcIg", "review_id": "3-_o6C_9q1SldfSQpEatrA", "text": "Unique menu, the best place to go for a fulfilling meal after a marathon :).", "business_id": "5kRug3bEienrpovtPRVVwg", "stars": 4, "date": "2011-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qlYOrPXKm-Sh8MdwHpQMWQ", "review_id": "ZMuEHsun-rkAqWeSld5z6g", "text": "I went here with friends on a Friday night whim.  The wine and food were great and the atmosphere was even better. It is nice to have such a unique place for Phoenix   The ambiance was inviting and cozy.  I would definitely  recommend this place for a romantic evening.  (Be sure to take the elevator down stairs at some point.)", "business_id": "5kRug3bEienrpovtPRVVwg", "stars": 4, "date": "2012-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CbkbRtwzH56NOBovb52eQA", "review_id": "RNhE2Lsm1RqfAtwOx3VQBw", "text": "Fantastic happy hour selection & prices; the restaurant has great charm (even the dimly lit bar in the lower level)", "business_id": "5kRug3bEienrpovtPRVVwg", "stars": 4, "date": "2013-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fG08y0W8z_B6cg6WHPIHBA", "review_id": "DDvZ44zFPBzXQOoHQ7oUKg", "text": "Incredible. Rokerij had an excellent atmosphere, amazing food, and pleasant service. I would highly recommend it and I would love to go there again.", "business_id": "5kRug3bEienrpovtPRVVwg", "stars": 5, "date": "2015-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "rRiBDH2U_IlydXTh2a81Rg", "review_id": "5-AeF-eccwCm8RzIPsyppQ", "text": "fili b's is strictly a late night post booze place-i would never go here during daylight hours. \n\nthat being said, it's actually pretty good and a heck of a lot better than your other 24 hour drive through options. not once have i gotten sick, had a stomachache, or had \"use your imagination digestion issues\" like other people on here have complained about. and since it's one second from my house i've eaten here more times than i can count. no issues ever. \n\ni usually get the chile relleno, arizona burrito, or the country burrito. all are huge and can be easily split with your closest drinking buddy. and it's only proper to douse all the food in tons of red sauce (i always ask for extra and they happily comply) and to get a large horchata to complete the meal!", "business_id": "WzhHlaEyaHE4KIFfcqC_9g", "stars": 3, "date": "2013-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zSUws8DBF4_bg1vkJsE2sw", "review_id": "kU3_8bAduLFddMBOcf-Zow", "text": "Love Manuel's!  Always good food and a friendly staff.", "business_id": "69t2S1u7Rf6qM_c14b42xQ", "stars": 5, "date": "2013-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "YPwFl3RCRwr-kyN-890STA", "review_id": "D_svB-VXYb2SCLJ1v5lBiQ", "text": "Never have had bad service or a meal at Rubio's. I always like the tacos (any kind) or a bean and cheese burrito. One of my quick places to stop in for to grab a bite. Never can go wrong.", "business_id": "edjCywtqffQ8__vM7POZbw", "stars": 4, "date": "2014-08-01", "type": "review"}
{"votes": {"funny": 5, "useful": 1, "cool": 1}, "user_id": "dY1DjSfdl_2EOhBH0Jc-FQ", "review_id": "OmVV4oaLbsOxQmPLnIpAnw", "text": "I like Chipotle but seem to be burrito retarded. Every time I eat there my burrito completely explodes and I'm reduced to dumping it into a bowl and just using a fork.", "business_id": "K2_Hmmo5crTYWiT_1sWnfQ", "stars": 3, "date": "2008-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QyaRZw5vrYkqXMkPd67OLA", "review_id": "58Xgfko1UzHBcWOOCksqfQ", "text": "Kinda rude staff", "business_id": "K2_Hmmo5crTYWiT_1sWnfQ", "stars": 1, "date": "2015-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "imhzJXmP9059R2hJGn9mXg", "review_id": "WzbQ_ETkCueD6UUAKofDYw", "text": "Very good Pacific Mexican food! I had the shrimp ceviche, and a fish taco. Both were very good. \n\nThe shrimp ceviche was on a torte/flat taco, but was served with a large amount of the lime/lemon juice used in the ceviche. This was a little unsettling, and added just a little too much acid flavor to the dish. ***\n\nThe fish taco was great! Well prepared, and served hot. They had great beans as well, and seemed to serve avocado with every meal. Really delicious stuff. *****", "business_id": "7SoGPn8dvce7A1aHdBOGLA", "stars": 4, "date": "2014-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hgzGSMl2m3ZpbVMnnbHJAQ", "review_id": "AARVoNrrRGfXLhYxDfU9eg", "text": "family friendly, divey little place.  a.m. radio and bullfighter paintings complete with red booths and formica tables.  very old school atmosphere.  this place is clean, cheery, and has friendly charming service and staff who remember your regular order, and sometimes your name.  the food is classic old school sonoran style with gorgeous and flavorful sauces and cheese.  the hot sauce is to die for...served in a thumb- triggered, red handled syrup bottle, just like hot sauce should be.  if you are looking for a sexy date night, this isnt it.  but if you want some good old fashioned mexican comfort food with a friendly smile at a good price, this place is it. love it.  i get takeout from here every week and i marvel at how Fast they are!", "business_id": "uevPN8zwJpBpnxRur1jUhw", "stars": 5, "date": "2012-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "QBQlErZajdIyXX84dvFUnQ", "review_id": "MlT9pnmm_O2cJorp8ENzkw", "text": "I have been going here for many years now. The food is always good and you always leave full. The tostada is so big I can barley get my mouth over it to take a bite. The shredded beef tacos are great. I also love the flautas and the chicken fajita chimi. The chimi's here are huge! The beans and rice are great to. So many mexican food restaurants have rice that's tasteless, which is funny cause it comes with every plate they serve. You would think they would put some flavor in that rice, but here they do. Always a good meal and I would recommend it for sure.", "business_id": "ieYiA4L5gk7S3kZYK0l_dg", "stars": 4, "date": "2011-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JDJipU4X-8iS35YQ5i2AKg", "review_id": "G8SeLw2jdfToLLGfwJArTw", "text": "Well to say the least the place is dated 80's 90's look. It has a dirty feel to it. As for food... The chips they brought us tasted bland and were t my favorite. The spinach enchiladas was palatable but nothing to write him about. My partner had the Pollo fondido was dry inside and wasn't  fried long enough either as it was mushy.   We won't be back again as there are many other Mexican places that are much better.", "business_id": "ieYiA4L5gk7S3kZYK0l_dg", "stars": 2, "date": "2015-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "08fQ03TquEkERny-5YcYCg", "review_id": "1YNbkD-WOdjqm7PG53qcsw", "text": "Nasty. Terrible service, hotel food. Save your money or go to via de los Santos up the road!", "business_id": "G9LwkTSdKOyOGqd5BbuIkA", "stars": 1, "date": "2011-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vDgwmj--1XON0TKCTov9-Q", "review_id": "XbzBb22kU7ULBh5mLEsZbw", "text": "Flour Chips are the BEST!", "business_id": "G9LwkTSdKOyOGqd5BbuIkA", "stars": 4, "date": "2013-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8Uuzc8YpvQgGLeB0X-Ferw", "review_id": "AUDg2HgaDkz95OwEZlvlxg", "text": "Myself & family had horrible experience at this establishment. Bad service's not enough waiter/waitress. The food is no where nearly as good as Tempe location. This place is mostly enjoyed by non-locals that don't know Mexican Food. The employees pay better attention to non-locals (folks that are staying at The Point). I rather go to Tempe location which is much better. Never coming back to this establishment. Not recommended.", "business_id": "G9LwkTSdKOyOGqd5BbuIkA", "stars": 1, "date": "2014-08-28", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "Ja8FvcWiWHEXME2vmTPTkA", "review_id": "rWTMH0YQW46eHBPLvY-u2g", "text": "You look at this place from the outside and you wouldn't think much of it, much at all.  Actually, your subconsciousness would probably just have you look past it and not notice it at all.  But like my buddy's friend told him one day, look for the place that looks sort of run down with a lot of cars in front, they typically have the best food.  Following that advice, looking for food, we pulled a U-turn, went back and parked.\n\nWe were going to get take out until we heard the chips and salsa were free.  Budgeting and maximizing caloric intake, you know how that goes.  Place was hotter than all can be (the 2 a/c window units couldn't keep up), but we shrugged it off like the manly men we were and parked our arse.  \n\nThe waitress was really friendly and helpful in explaining all the stuff they make, and the best part about it is that it's made fresh - chips, salsa, guac, etc.  This place is the real deal when it comes to mexican food.  It just goes to show you how most all places bend and give in, abandoning their tradition, just to meet the \"needs\" of the American people.  Or shall I call it ignorance?", "business_id": "PxUQyOAdK8c3P_WnrXuCUg", "stars": 5, "date": "2013-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "gg_OKjOAl_vVmdh5ZETuiw", "review_id": "sISKK6104juZbb_HI5BiOQ", "text": "El Bravo has a typical menu with the regular items you expect to find at a Mexican restaurant.  The success of El Bravo is the quality of the food and their ability to put a distinct mark on Mexican standards.  \n\nI ordered the #6: Chicken Tamale Deluxe Combo that included a shredded beef flauta, ground beef taco (with flour shell), chicken tamale with rice and beans.  The flauta and tamale were fantastic.  The green sauce on the tamale top notch.  The flower taco shell was an interesting experience.  It's the first I've had in the style offered at El Bravo.  I prefer the standard corn shell (also offered at El Bravo) but it made for a nice deviation from my typical taco experience. \n\nMy order took longer than I would typically expect but worth the wait.  El Bravo has a smaller staff and all the food is prepared fresh when you order.  This isn't assembly line style cooking.  You can even look into the kitchen from the counter and watch the magic happen.  \n\nThe dining area is of ample size and fit for the solo diner or families.  The restaurant is clean and the staff is friendly and attentive.  Overall, I can say that El Bravo is one of the best restaurants, Mexican or otherwise, in Phoenix.", "business_id": "flUKBy7WHqYdfOrwU1A2SA", "stars": 4, "date": "2012-08-09", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "C6IOtaaYdLIT5fWd7ZYIuA", "review_id": "_gAXp56NVy4hnvdsTn6FLQ", "text": "Staff 5\nClean 5\nFood 5\nSalsa 5\n\nI like this place and tell myself we should go here more. The place is clean and the staff is great. The food is fresh and tastes great. Not sure why only a 4 but thats where I stand. \n\nI prefer the pork over the beef and the chicken. It just tastes better.", "business_id": "3msnZ6oe0sslHsE1js1QUA", "stars": 5, "date": "2010-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HFzJb1EnBsB6fD5s-9fXUA", "review_id": "EiUpgvoqlUBodp373TSUxA", "text": "This was the most horrible for I've had in YEARS! I'm pretty forgiving but I can't forgive the junk they cooked here. Please don't go, you will be horribly dissatisfied...I went at 12:30pm on a Friday.", "business_id": "gCQuajbLB3hQQbipYpEtYQ", "stars": 1, "date": "2011-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZHDnw0e6Mn7QF-NNAQPF_Q", "review_id": "KI2zD-bP16Mox-O2hYtoOA", "text": "This place is a total \"hole in the wall,\" but it serves the best Mexican food! So far, everything I have tried is absolutely delicious! My favorite is the shrimp burrito - but beware - IT'S HUGE! \n\nThere is very little sitting room so avoid the lunch hour if you can.", "business_id": "Yb2pNCxYR32XKmpirqJqeQ", "stars": 5, "date": "2015-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "sBXm7wsHKkrkcnyYRlZlzg", "review_id": "VyNftB111jM4rSwgYHlpBg", "text": "Great chili relleno! Pork taco on the dry side. I rarely, if ever eat rice and retried beans, but I must say they were both very good at Los Alomos.  I would love to try the breakfast burrito next time, hard to find good ones in this area.", "business_id": "Wxt6FGF4vxsnKYksMZRoiA", "stars": 4, "date": "2011-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "eXiHAxrnvE64j4wTEOTEMQ", "review_id": "DzY2k9A8wkxmLA3NBz6SLg", "text": "I agree with a prevous poster who says this Rubios is the best in the area. The employees are super friendly and nice. Between my kids and myself, we usually make tons of modifications:( hold this, add that etc.)...I always order the chipotle ranch chicken salad (minus chicken and cheese w/ dressing on the side)..they always take my order without batting an eyelash and ALWAYS get it right..my salad is always crisp and fresh and we probably take out from Rubios 3 times a month...", "business_id": "iOITnizWLD3NlKxRtZd5AA", "stars": 5, "date": "2011-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "NbMZqRNdk5L6Un6p68SMzw", "review_id": "N2IBTl9TsCl5m9mmw9xOCg", "text": "The best Mexican food I found for a great price with a fantastic selection. It looks a little run down but don't let that deceive you. I am definitely a repeat customer.", "business_id": "4zBdx_EZFaDFJ9MvqxYNeg", "stars": 5, "date": "2015-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xFG4Ca2HHmbxDTkMlmHnjQ", "review_id": "NIfYV-68KIKVCkZUBFjiqQ", "text": "Very good service and good food! Definitely a fun place for Mexican food.", "business_id": "WxpCYziMlEy8mrEa_VcB1w", "stars": 3, "date": "2011-07-13", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 3}, "user_id": "XTFE2ERq7YvaqGUgQYzVNA", "review_id": "a-Z9le6Gwd8S10Jb82nruA", "text": "I'm normally one to shy away from restaurants that appear (inside and out) as if they're going to give me the worst case of E. Coli/Salmonella/Asbestos/Gun-shot wounds I've ever had.\n\nBut I just don't care when it comes to Carolinas!  Having worked at Sky Harbor for few years I ate here too often to count and never had a bad experience.\n\nJust don't look too closely at your surroundings when you're picking up your grub!", "business_id": "d52zg-S0o940WUCK-nNiKw", "stars": 4, "date": "2008-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OZ6le0aoyMbYKgQ_w4wtIQ", "review_id": "0RE9MyJV3dhPYEX03wJ5lA", "text": "I consider myself an expert on Mexican food and all I can say is Carolinas is the BOMB!!! If not the best, one of the best Mexican joints in PHX. The bean and cheese burrito was awesome and the machaca tacos were off the hook. It's the first time I've had machaca and it is fantastic. Carolinas is a must visit Valley establishment.", "business_id": "d52zg-S0o940WUCK-nNiKw", "stars": 5, "date": "2010-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3s0K-1USEkGnA8de9GRrhQ", "review_id": "CXsNDZipBSte41m2ri9KGA", "text": "I have been eating at this location since I was 11 and now 28.  The food has always been consistent and was my first choice for the food at my wedding.  Honestly every is great but I find myself getting the hard tacos and bean with potato burrito.  A must go for anyone", "business_id": "d52zg-S0o940WUCK-nNiKw", "stars": 5, "date": "2011-07-25", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "lJKYgQvPiwaefvIWFZQjnQ", "review_id": "BpsYbYpIXaVV0nGNcKeWsg", "text": "Yeah, it's borderline ghetto, but the authentic Mexican food makes it well worth venturing outside your comfort zone! All fresh & delicious!!! \n\nDefinitely more of a lunch, than dinner, spot.  Carolina's is far from upscale. Think cafeteria style with styrofoam boxes & plastic ware. No cerveza or tequila here, either, but at these prices you can drink later!", "business_id": "d52zg-S0o940WUCK-nNiKw", "stars": 4, "date": "2013-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hXA-SSp0qMdohIKl8dUuWQ", "review_id": "xzXAO6UyfvLFumYWJIfSDQ", "text": "I just got done eating another shitty taco in Illinois. It made me realize how great  the Mexican Food is in Arizona.\n\nCarolina's is in the holy grail category: it could very well be my last meal on earth and I'd die with a smile on my face.", "business_id": "d52zg-S0o940WUCK-nNiKw", "stars": 5, "date": "2014-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gTWMpx2MzafeTYTSy6MwKA", "review_id": "W3av_eoNo5f1RpYSuYfGcw", "text": "Amazing tortillas great beans, tacos, enchiladas, machaka. My girls love the butter tortillas. They really do have the best tortillas in town. We are there very often.", "business_id": "d52zg-S0o940WUCK-nNiKw", "stars": 5, "date": "2015-07-29", "type": "review"}
{"votes": {"funny": 9, "useful": 5, "cool": 5}, "user_id": "ID0f8slG5-Ch9TlFDrFK1Q", "review_id": "1YvhBWxvdX65Fce01lZOtA", "text": "What's the least you can spend for the most food at PHX?\n\nI don't know, that's why I'm asking. But I do know that it's not at Oaxaca. \n\nMy choices were slim and fattening. I almost just got cold stone for breakfast. There was a pizza place that was serving up wretched piles of eggs and ghastly meat type things. A nice green chili burrito sounded just right for 9am.\n\nhttp://www.yelp.com/biz_photos/v44bpuCu4vM4AmD0_2K1QQ?select=qmsiDowwKWnMgMBtDizE-w\n\n$5.95 after tax, that's what I got. Pretty small, very greasy and somehow simultaneously watery. Only saving grace was that the side of salsa was very spicy. \n\nNext time I fly, I'm just going to bring some power bars and eat cardboard.", "business_id": "3QtWG5sN3HJNBVKn_wHQEw", "stars": 2, "date": "2008-06-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LxJUg7--8tuU448oNm-T0w", "review_id": "Oueeg96TTGIAqbkIDDV06A", "text": "Highly disappointed today. BEWARE non BEEF and PORK eaters... Today, I ordered the 'combination 2 tacos' . Apparently, most food orders are for BEEF instead instead of CHICKEN. Needless to say, I don't eat beef or pork - their website doesn't specify BEEF or PORK - \n\nAnd the kicker is, when I called their establishment to speak with a manager, I couldn't get past the young lady on the phone to leave my comment. \nIt was stated \"that the customer needs to specify CHICKEN with their order\". Granted, I take partially responsibility for that - how about not assuming that all customer's eat BEEF and PORK and ask them their meat preference. \nFurthermore, when speaking with the young lady there was no recommendation to try to fix my order, no apology, no nothing to try to amend this. \n\nAzteca update your website to reflect chicken/beef/pork or what have you instead of assuming that or a great majority of them eat BEEF. \n\nYou live and you learn huh! On a more positive note, my rice and beans were edible and quite delicious.", "business_id": "d2AeNB4xw67E1Bzpo1Pm7Q", "stars": 2, "date": "2011-06-15", "type": "review"}
{"votes": {"funny": 3, "useful": 9, "cool": 8}, "user_id": "Z9qOrLluUTJ_bhZJB0m9IQ", "review_id": "5Cr1mBhJmICtPY9XO_yesg", "text": "omg amazing place! definately try a green-sauce enchilada with cheese, the rice and beans are amazing and salsa reminds me of the authentic places in San Diego...tiny hole in the wall though, so keep an eye out for it...if you exit the 1-10 at 32nd, head south about two blocks, make a left (east) on broadway, its right after 36th street in an industrial area....if you see Napa Auto parts across the way, you found it! :-) they will literally make you ANYTHING you want (within reasonable terms of course!) and they have a good kids menu for the little ones", "business_id": "ZRqpSeZEw6sy8r01TdCudQ", "stars": 5, "date": "2008-08-25", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "i9DSitx1CJCCONWAG1FVnA", "review_id": "2R1Bfc_Ygq_E_tH_jSUxTA", "text": "Ew to poor service and less than desireable food!  No bueno", "business_id": "14NSxaXBNspIVnsrMYJZVw", "stars": 1, "date": "2011-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-46dRMVxrl2I9l35_JtDIQ", "review_id": "oiA_M2mef5B_4CnjOSWNwA", "text": "I'm giving this place two stars only because I enjoyed the chips and salsa. I ordered a combo of a Tostado,enchilada and A tamale. The tostado shell was overcooked, the enchilada was unremarkable and the Tamale had very little meat in it and tasted just like the enchilada . . I honestly had one bite of everything on my plate and then pushed it aside. My son ordered something else and he did not eat his meal either. My daughter in law had a green chili burrito and she loved it. So if you must go to this place try and order that. I wont be going back.", "business_id": "14NSxaXBNspIVnsrMYJZVw", "stars": 2, "date": "2014-08-04", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "rL3dPeKDTybG_ct9OCXGAA", "review_id": "KY5FGBzMFtBOL45BPn1esQ", "text": "I've been a longtime fan of Macayo's so I decided to finally write a review for them. I came here last Friday (7/29/11) for a Birthday dinner and as usual the service and food were stellar. It was really packed on Friday night yet the team still manage to efficiently serve my party of 8 as well as bring out our orders in a timely fashion. My favorites here are the Taquitos enchilada style and if you don't mind calories the Baja Chimi is delicious (one of my favorite guilty pleasures!).  Everything comes with free chips and salsa (there are two or three different salsas, make sure to ask for the spicy one if you're into heat!). Really good Happy Hour too! I haven't been to any other Macayo's location so I am only speaking on behalf of this Ahwatukee location.", "business_id": "aACW1qAdOfgcU8yX61dOFw", "stars": 4, "date": "2011-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gnLYdnBRaTUk4LRSbTl8Ag", "review_id": "_gtnH7ULMkkmOXyDgohd1g", "text": "I have been to this location several times and have always had fresh food which tasted good.  They always have coupons and other discount offers so getting a good bank for your buck is rather easy.  The outside seats are shaded, but plastic, and are close to a main road so noise could be an issue at peak traffic times.   \n\nThe salsa bar had many options, and you can take little cups home with any left overs.  The ingredients taste fresh, and the presentation of the items is several steps better than a fast food place.  There are several choices for fish tacos, and have always been cooked well for me.  I wish they had real iced tea instead of the soda fountain mass produced type.", "business_id": "dD2xiLM1_5Vg0pMvMIPZww", "stars": 4, "date": "2012-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_Q4Ks28-Jks-TjFT-YXw_A", "review_id": "iLvhRZfTr1I32EmZwnADFQ", "text": "I love the Loaded Queso dip!!  So yummmmy!\nThe ground beef enchiladas are great with queso on  top!!", "business_id": "fsxBliRs4rwxRXkZUVy62A", "stars": 5, "date": "2015-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6xMmJeO8SP_a38ceUnlF7g", "review_id": "ei2EwR_nolPR_UGsoNN2Ww", "text": "Real Mexican food and ridiculously cheap prices!  The cow tongue and cheek tacos are amazing.  It is like eating the most melt in your mouth pot roast ever.  It may be a but mushy for some.  Carne asade was good.  Pork wasn't as good.  Arizona Burrito was hearty... lots of potatos cheese and steak.  The green sauce was tasty, the red was not.  Minuto was interesting, but I wouldn't get it again.  Just fill up with delicious tacos for under $1.50 each!", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 5, "date": "2010-07-14", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "SHlkGMta-B3lXzlQBtrUvg", "review_id": "josFSqKarcRWxmki4arKLQ", "text": "Yum, yum, yummy! This place serves amazing Mexican food. Nothing fancy, just high-quality ingredients simply prepared so you can really taste their wonderful flavors. The vegetarian burrito is delicious. Dip it into the yummy salsas, and eat the spicy carrots with fresh lime juice squeezed on top while you wait for your food. This place gets busy at lunch and dinner time, so plan around that if you don't want to wait.", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 4, "date": "2011-08-27", "type": "review"}
{"votes": {"funny": 7, "useful": 12, "cool": 9}, "user_id": "MnDHJvePh4cWMrBgOp0_Ig", "review_id": "jpEPSjQjuffZ1zCFnZEJbg", "text": "This is a great hole in the wall family owned Mexican restaurant. I have not had a bad thing on the menu. Their street tacos are some of the best. You can choose the type of meat you want in them. You can even get all three in the combo different. The Torta is awesome and the burritos are mouth watering.\nService is great. It gets a little cramped waiting for your order because the place is really that small. The prices are good too. Sure there isn't a dollar menu but who needs one when the food is this good. Dollar menus are for places with horrible food.\nIt can get packed around lunch time so be warned. Calling you order in will save on time if you only have an hour for lunch.\nI have been going here for years and will keep coming back.", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 4, "date": "2013-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NR5dGxW2ctHGQeGpzGrrnw", "review_id": "pUQTFOvV6iXeC5AFFwai3g", "text": "Been coming to this place for about 3 years and it seems every time we return it gets worse. Today walking into the place the tables were dirty and there was a smell in the place that said \" i need a good cleaning\".\nI ordered a Carne Asada burrito and when I opened it to add green sauce all I saw was a tablespoon of Carne meat. I took it up and showed the cashier girl. Her response was of bewilderment when she pointed with her pen at the tablespoon of Carne meat. I then explained to her that in a Carne Asada burrito the Carne is the main ingredient not the beans and salsa. They remedied the situation by adding more meat but I should have to go up and show them proper portioning. Another person in the party got nachos with beef. To me nachos mean the chips topped with lots of cheese and whatever else you add as a topping. Well needless to say the nacho chips barely had a tablespoon of cheese on them. Inconsistent food, dirty environment, rude staff and not a positive experience. Many a time I vowed not to return but this was my last visit. Too many places in the area that care about quality of food and customer service. I also worked in the industry so I'm familiar with what a customer wants and expects when they walk into a food esyablishment.", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 1, "date": "2014-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vJZtiMtXJL0GHl8AzsKAFg", "review_id": "hlBvRtqxGsIdc0bc2yrTuw", "text": "Everything here is amazing. So authentic and fresh-tasting. The chicken burrito is my favorite!", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 5, "date": "2015-06-10", "type": "review"}
