{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PUFPaY9KxDAcGqfsorJp3Q", "review_id": "Ya85v4eqdd6k9Od8HbQjyA", "text": "Mr Hoagie is an institution. Walking in, it does seem like a throwback to 30 years ago, old fashioned menu board, booths out of the 70s, and a large selection of food. Their speciality is the Italian Hoagie, and it is voted the best in the area year after year. I usually order the burger, while the patties are obviously cooked from frozen, all of the other ingredients are very fresh. Overall, its a good alternative to Subway, which is down the road.", "business_id": "5UmKMjUEUNdYWqANhGckJw", "stars": 4, "date": "2012-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9mWJQbP8zNm-rT1MBhwLHQ", "review_id": "kzZB06VrEjk7kGxl-K2VYQ", "text": "It took an hour to get our food when everyone else got their food in five minutes. They forgot two of our drinks and one of the employees said a cuss word infront of a child.", "business_id": "W7ysp8GLCBrs0GXIVwAcBQ", "stars": 1, "date": "2015-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "af_Ya8XNB7JYMDAa0cwwsA", "review_id": "X6O3vPZfP6Pn2x9ZpVtWuA", "text": "Terrible place to eat and not very clean at all. Way over priced foe fast food. 5$ for a plain roast beef forget that!", "business_id": "Tb7hQ37UFA2QFaMwjFieQw", "stars": 1, "date": "2009-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F7lvf3GcSOhPqmF7lnAHZg", "review_id": "CFqGsSQ3PQT2SDihxxb7uA", "text": "Worst wendy's I have ever been to in my travels all over the USA. Normally Wendy's is at the top of my fast food list. This particular location is HORRIBLE. AVOID !!!", "business_id": "EZrCQtZxiEo1kkAYt2EQqw", "stars": 1, "date": "2012-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "r3Nh4sW8QZbS5Dseh-jgZg", "review_id": "bFyzC0EfVHc0oiN0UepDrA", "text": "Slowwwwwwwwwww  - I do not normally rate fast food places - you get what you pay for,  My experience at this Charlotte BK was nothing I have ever seen\n\n1.  I ordered 2 combo meals - 25 MINUTES from order to food\n2.  The manager did nothing to help get orders\n3.  One of the cooks (sagging pants and all) was singing Usher songs  at the front counter instead of making food - \n4.  Processed chicken strips do not do well when the sit for 25 minutes - they tasted like s*it.\n5.  No thank you , sorry about the wait, here's a free _______ for the poor service  - \n\nI would have gone somewhere else - but I was like whats the point - the food has to come eventually \n\n\nSTAY AWAY !", "business_id": "X-uPUUV7xPiKivsQzJD-wg", "stars": 1, "date": "2012-06-20", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "A6bPFcUjuuayRBoyybedDQ", "review_id": "lNzBaFG9i1-oOUYYtXZgGg", "text": "By McDonald's standards, this location is downright luxurious! \n\nThe service is great some shifts, and shifty other shifts, but the setting makes up for it.\n\n In addition to the baby grand piano in the corner of the first floor-- there's a fireplace and large TV on the second floor, and a balcony for outside seating.  There are even framed paintings on the walls!  (Well, they're to the caliber of those art show liquidation paintings that cost $5, but I appreciate the ambiance enhancer.) \n\nEspecially fitting since this MickyD's is across the street from Nordstrom!", "business_id": "4kM-mP7z1nP015R2Tlz1Tw", "stars": 4, "date": "2011-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "hSgTbqNYo1-OfEAiXB7h_w", "review_id": "ohJ2OcDCJNtk-62RsRe37Q", "text": "Nearly a Charlotte institution, this is some of the best \"fast food\" around.  \n\nGeorge Cushell, the owner of Showmars has been a fixture in the Charlotte restaurant scene for longer than most Yelp readers have been alive.  He has gotten the concept of good food fast right with the Showmars chain.  This is not fine dining, or anything near it, but, it is good, food, served hot and fast with a smile at a reasonable price.\n\nMy faves are the original pita burger, all the seafood plates, the fish sandwich and the onion rings.  The baklava is as good as my own homemade version.  All the fried offerings are cooked to perfection and come to the table too hot to eat.  \n\nI also like the Greek dishes and the Gyro, tenderloin tips and the souvlaki somoras are as good as any I have had anywhere.\n\nThese restaurants seem to be everywhere and I assume they are all about the same, but the Little Rock location is my \"go to\" location for fast, hot, fried fish, burgers or Greek treats.  I can't see that changing anytime in the near future.", "business_id": "KpJeQaB0ca6k1-Wdduokqw", "stars": 3, "date": "2013-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s10ks7DE9ixCfulcenm-SA", "review_id": "xPFpdhTCbYipzPAWxaBAkg", "text": "I gave two stars because you get what you get at most Subways, without the customer service, there was maybe one person there today that seemed to actually cared even a little about doing their job.\n3 out of the 4 people on the line barely spoke English (including the owner), they act like your an inconvenience to them, especially like today when I asked for Pepper Jack Cheese and they put something else on there and acted like they were angry when I asked them to put on what I ordered.\nThe customer service at this location is probably the worst I've experienced at any Subway, and I've been to dozens of them all across the country.\nI believe the only reason they have as much business as they do is their location, it's definitely not the smiling faces and interaction with the employees that's for sure.", "business_id": "eMFD4FA8NVAlUAeBl4EVNw", "stars": 2, "date": "2015-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "piZI7D8fa-iV68zj2ZzN4Q", "review_id": "ZLIA9AO2ciuAjvs_4_Tvow", "text": "Nasty, hate this place. Don't understand why people are obsessed with nasty fried chicken.", "business_id": "6SWPWj74qF_pEVgDM3-IpA", "stars": 1, "date": "2015-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fb9uFyxJ3pfBqA7sRW3CIA", "review_id": "xZeeaipnXt5nEndcheFnYw", "text": "I just happened to go to the Shell gas station and my son said he wanted wendy's to eat. Now we dont normally eat out often but today I said ok. We got the gas, walked in wendys and instantly I saw how filthy the restaurant was. Then I walked in further towards the cash register and there was this aweful smell. We automatically turned around and walked out the restaurant. My first time there and this was an aweful experience and I will not eat there again. They need to work on keeping the place sanitary especially being a good place....", "business_id": "28YKigLZj0ooXDFVKw_qHA", "stars": 1, "date": "2011-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QIC6eYpIE1jyJlxYwXcb7Q", "review_id": "5W4B93HBUIBLcXLrZvw-EA", "text": "Worlds slowest drive thru. I've been here at least ten times in the last year - guarantee you may have to wait up to ten minutes.", "business_id": "HGzdDbukK8RJEc623kLz5Q", "stars": 1, "date": "2015-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RvweNJFVkR3ttkWsIBy7nQ", "review_id": "tt7hQX5H5DUtIeHaF7Vx5g", "text": "This location always has good specials but their daily flavors are seriously lacking.  Orange Dreamsicle? S'more?  Blueberry?  Eh.  Give me something spectacular!  If they are not going to be complicated then please tell your staff to be knowledgeable.  I have asked questions about the ingredients and been told, more than once, that they did not know.  We are not talking complicated questions.  Does the blueberry have whole fruit or is it folded in (kind of like a syrup)?\n\nOtherwise, I like this place.  Typical Culver's.", "business_id": "FiP9q_YD5vgxu_Sflo5oZw", "stars": 3, "date": "2013-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "QEy_xoEcmL0y6N8YLPUhCw", "review_id": "yibnwtn5mEDj1vauF3xJNg", "text": "This subway is one of the cleanest, and most efficient subways I have EVER been to.  I've only been in the evenings, but I have to say every time I walk in, someone is always cleaning something.  Their employees are friendly and the food under the glass is fresh looking and appetizing and in their own bins.  Sometimes you can go to a subway and the prep area is a wreck. Thats what makes this Subway so great. Everything is in it's place, and orderly and makes you feel like they take pride in their work.  Absolutely I will go here again, and I can't say that about many Subways unfortunately.", "business_id": "Vvh2Hd4SsZjEEfKLNKAEWw", "stars": 5, "date": "2009-08-18", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "GMU3YXV2uSrO_vNY7QNfAA", "review_id": "CA2VN-n7QOOh3mPVn7qqOg", "text": "While the restaurant was smaller and darker than I'm used to, this has nothing to do with my 2 star rating.  I cannot be sure, but my review is mostly based on the manager on the clock at about 12:15pm, right during the lunch rush.  I can understand being new at a job, we have all been there, but why make the newest person on the team (and if he isn't the newest he is just the slowest) run the bread/start station?  There were clearly faster workers further down the line who would regularly go out to the dining room and clean up.  Also, the entire time we were there (more than 30 minutes) she, the manager, was sitting at a table by herself, earbuds plugged into her phone and text book open.  This was the lunch rush!  Not only wasn't she helping, but she was taking up one of a few available tables.  When she was needed she would shake her head unapprovingly and walk over to help.  At any given time there were anywhere from 3-6 people waiting in line to give their order, terrible managerial skills in my opinion.  She was focused on herself and would only take time to help when absolutely needed, or she would take a break to bark orders to the employees who were working their tails off.  We went to this location because it was slighly closer to where we work, but will not again return.  In addition, it would seem their toaster is on too high, both our subs came out hard and crispy.  There is a location about 3 miles west on Mcdowell of this location, I would recommend going there anyday over this location.", "business_id": "ITyAEjIw9ekv0wXpGHQF1Q", "stars": 2, "date": "2014-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Q0tvHsHp4FjO8hDWNHAGJA", "review_id": "ytVGLGxmP1v5Pd52cWT0UA", "text": "I personally like this Taco Bell a lot it's in a perfect location for me.. Inside is not really updated but that's alright it's pretty clean...\nI been going since I was a child..\n\nBut...\n\n\nThe past few times they keep forgetting to get all my items in the bag at the drive through first it was the cheesy roll up missing... Glad my 2 year old didn't miss it, or else that would have been hell.. The next visit my husband gets the nacho cheese chips and they did not put the cheese in the bag.... \n\nTaco Bell sauce packets for the chips I guess... \n\nCome on Taco Bell pay closer attention to your drive through and making sure you get ALL the items in the bag. K Thanks....", "business_id": "5UBAWhxukaPrc_0DalT-3w", "stars": 3, "date": "2014-08-08", "type": "review"}
{"votes": {"funny": 4, "useful": 1, "cool": 0}, "user_id": "oIVsVM8H273aoT1JUmsDIg", "review_id": "b__2-pcp956qWHeBYl5y2Q", "text": "The other night I was craving a Peanut-Buster Parfait but had no desire to schlep inside the nearby Dairy Queen.  I was feeling lazy, bra-less and make-up free.  Easy solution, I thought. Drive a little farther to the drive-thru Dairy Queen. YES!!!  \n\nCentral was eerily vacant of cars, so I made it there in no time. It took a while for someone to take my order and then when I got up to the window, this young kid looked at me and asked if I was \"so and so.\" At first I thought I didn't hear him right so I said, \"What?\" He repeated the name. I ponder it for a moment, and with a scrunched look, I said \"Uh, no.\" \n\nI paid, got my change and drove off.  But I started thinking on the way home: could that have been a secret code? For a drug-deal? Or some cool rave party? Damn! I should have said \"YES!\" I could've had some extra fun with my Parfait!  Oh, well.  It hit the spot. I'll be back again, and maybe the next time I'll remember to say \"yes\" if asked a random question.", "business_id": "zZmhEpiVpRfFQid87-pcOQ", "stars": 3, "date": "2008-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "AmuR7biR9cJzpmIVRoFP1Q", "review_id": "q8fkaFg34cxBJ74OttPjqg", "text": "I have been there 4 times this month and I repeated my order twice and they still messed up. When I was inside to place an order, they just looked at me and started talking to their friends. I almost turned around and walked out. The customer behind me was getting the same treatment. Thank you for your time.", "business_id": "74NT13vpDleoNrkxQdEpsQ", "stars": 3, "date": "2015-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5p8cCKiCbru9FL7HNDYCbQ", "review_id": "oMN51rV6JIHxO4NITNDxpg", "text": "Great food, long lines at lunch but short during dinner, not a very big selection but huge burritos that will fill you up", "business_id": "K2_Hmmo5crTYWiT_1sWnfQ", "stars": 4, "date": "2006-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "g_30vD0px4TIMeeh6LJiIw", "review_id": "Hyy7aW8yCphgsAkxw3oYSA", "text": "I've always loved chipotle. But I really loved it after the took the pork out of their pintos beans. Good going Chipotle!!", "business_id": "K2_Hmmo5crTYWiT_1sWnfQ", "stars": 5, "date": "2015-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "dUAsWWDh5AzwGOGoh3XEeA", "review_id": "dDBonOkgieJFLsWPkQBIjw", "text": "Beware of the inattentive cashier that will stick her finger in your cup. She also went from handling cash to serving food without washing her hands!\nAnd of course my order was wrong since she wasn't paying attention. \nSorry Pollo, you are off my lunch list!", "business_id": "TBTaMIaeDw5B79hXDZBtrA", "stars": 1, "date": "2015-06-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "D5J4mKahKvUBJUTWanZwdA", "review_id": "4PSWrFFiG0RpIwuQ-MmD7Q", "text": "Okay, the 5 stars is for one thing and one thing only. My diet coke first thing in the morning. I don't know why McDonald's diet cokes are so good, but they are the best fountain cokes around.\n\nThis location is nice in the early mornings to get in and out. Be careful later in the day as the drive thru gets very congested due to the location.", "business_id": "Y_dzA9OHRKa0X1cqcRmsaw", "stars": 5, "date": "2011-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KRK6DBYclKajOmMxia-_sg", "review_id": "e6TNodH63acx-3Vq58TIAQ", "text": "Good place with cheap tasty food.", "business_id": "vB3vEjcw9dfHmgP8ac5ZMQ", "stars": 4, "date": "2012-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VsdK3A7VzyC-tMYC3WUC2g", "review_id": "-f7dDQFlRhxJI5RB77x5TQ", "text": "I love KFC. Anyone who left stars less than 4 has to lower their expectations. It's KFC!! Pot pie was awesome. It more expensive than most fast food but still good once in awhile. This review is shorter than most but then again so am I. Lol", "business_id": "nqpUjsD-nUIQCrr15B9W-g", "stars": 4, "date": "2014-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "qfKtIq30I6wzbokZ4IZ7VQ", "review_id": "00LDvRE7Q8X21GV-wVVhng", "text": "Texas native living in AZ.  Arizona has not much love for this gem of a 24hr fast food jaunt. My gal hates this place but I was able to convince her of breakfast at 10am and wahlah! A believer is born. She had a morning taquito and to her annoyance they aren't taquito sin the general sense. They are more like flour rolled burritos lol. \nBut if you are looking for the fat kids shangri-la look no further than the honey butter chicken biscuit. Heck, get 2!!!!! And their oh jay is the real deal!\nOJ!!!!", "business_id": "vWcUrFcweGXAWsil_pfpjw", "stars": 5, "date": "2015-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "LXWAXIeYFIdgd2JVPF-9qA", "review_id": "14Sm7WUBIdqEhyNlFp3fTQ", "text": "I had not been to this location since they remodeled the inside it's really clean and nice... Friendly staff I was impressed. I ordered the chicken finger basket it comes with fries and two pieces of toast... For the sauces I went with the honey mustard and the gravy... I rate the food as followed.\nChicken Fingers - B\nFries - B\nToast - D \nGravy - B\nHoney Mustard - B\nI will be back again for lunch plus I really wanted a blizzard.", "business_id": "fRtuc2k17r6aZMJWEMcXFQ", "stars": 4, "date": "2011-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "qM_KV5Zkdor1x21vCJgF5Q", "review_id": "5jx74Vkp7NZn9Yq2uBi4MQ", "text": "Was an OK kfc location, not that good food, the staff here was really nice and professional unlike a lot of kfc employees at other locations.", "business_id": "72pUqCkncwVVn65cIiX8aA", "stars": 3, "date": "2015-07-28", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "wNqwKWaRjClmcKsoJJRFow", "review_id": "ZVGsS1Yz0g4siqEJM4x2xA", "text": "Give me a Double Double with Extra Extra Extra Extra EXTRA grilled onions and I'm happy camper. Their burgers are always freshly made to order and tasty. Despite some people who hate their fries I like them more and more each time. Again made fresh from fresh sliced potatoes.\n\nI don't know where they get their tomatoes from but I've loved them ever since I was kid a really helped me get over my dislike of tomatoes.\n\nDidn't I mention that their milkshakes are killer too???? I really don't know what I'd do if I lived somewhere where they didn't have In N' Out Burger. Guess I'll be west coaster for life.", "business_id": "byFWmwlVSmUj-AmM6NZYvw", "stars": 4, "date": "2012-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t8NGWJ_8X2XMVaHBy9tprg", "review_id": "VvjlQj45EERz2YaqXhY12w", "text": "This is my favorite subway in anthem. I use to always go to to the one in daisy mtn  but I don't know what happened the kids there just got lazy there or something. The manager there was very helpful and polite. Will be taking my kids here from now on.", "business_id": "xPDbCj9tfp5nnGzYzoCHwA", "stars": 5, "date": "2013-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "op8VqoDqNkfVQgcAiBgNkw", "review_id": "XJkP7SzGyRyYm0Y22cCkqA", "text": "Friendly service and the chicken just came out of the fryer. \n\nOn the other hand, if I was manager, everyone (and including me) would have to take a section of the tiny place and get \"Scrubbin\". \n\nNext time, I will peek and see if its clean before I order again.\n\n.", "business_id": "D0IB17N66FiyYDCzTlAI4A", "stars": 2, "date": "2014-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9X_stx-81S_13sR9On_lEw", "review_id": "mi_hRFKlLVqHEPMKUcIzKg", "text": "Worst service   ever!!!!!!!  Was in the drive thru  waiting for over a half an hour the cashier doesn't even apoligize for the inconvenience . . Then she gives me back almost four dollars  in change  and doesn't  apoligize for that either . . This also is not the first time it has happened to me here but it is the last time", "business_id": "FKoqqNLG47bl_AjMwg3PjA", "stars": 1, "date": "2015-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3CYBUa_H-IQ-H_k6G9tvrw", "review_id": "I0ty-aJCNW-2RuEENHX8dA", "text": "Honestly, the lady kept repeating the wrong order back. It's not even busy and she kept talking so quickly, and gave us a completely different order. After we went in she said she didn't hear that at all. I've been ordering food for years and I have never had this issue. Smh", "business_id": "vKZk6rxGVpOK13rb1OwEOA", "stars": 1, "date": "2015-06-05", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "N4BnjZFAuuAUTjxs93SYlg", "review_id": "Ot2w4_a8rgy8sRNnP6L2_Q", "text": "I'm giving this DQ 4 stars because fast food chains top out at 4 stars.  \n\nThis location is far superior to the one near my house (http://www.yelp.com/biz/dairy-queen-chandler-3?hrid=y2Q2uNjOUzquKVlrPTdGyQ).  First impressions: the lot the building is sitting on is welcoming.  Well lit.  No pawn shop next door.  If you go inside,  the store is clean, bright, and has smiling faces behind the counter (within reason).\n\nI almost always get a Butterfinger blizzard.  They pack the cup full of candy, giving me my money's worth.  Speaking of money... in the drive-thru, they always tell me my total at the speaker (no \"I'll have your total at the window\").  It's a small touch, but it proves that they either can add, or have invested in a register with a computer.  That instills a certain level of confidence.\n\nThe customer service is great.  I always get basic manners like \"please\" and \"thank you\", maybe even \"how's your evening?\".  The service is quick, and they can move a long line along with ease.  \n\nIf you are closer to Arizona Ave and Ray Rd, make the drive to this location instead. Trust me.", "business_id": "kqFQLV63mAYCsY1LSB2OZw", "stars": 4, "date": "2014-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pxq4sXSpiquBV8FZGWyt8g", "review_id": "pAFINAj1pWR0mQS-22nGpg", "text": "Husband picked up dinner from here tonight.  I couldn't believe my eyes when I opened the 8 piece box.  The pieces were so small it looked like a quail.  The entire box, including the box, only weighed 1 lb 6 oz!  On top of that the breast were so dry they had to be steamed to rehydrate them.  This place is definitely cutting corners...off the chicken!", "business_id": "Q_k4Uj85rHv_O9yC-InxqA", "stars": 1, "date": "2015-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LK1POYLdvIBWzbqDxaxKRg", "review_id": "Ti4ovxBy-aufnPraNi7ZJA", "text": "Always predictable, value menu always good.", "business_id": "r5vUrirMWVOHHuTIRXfy6w", "stars": 4, "date": "2012-06-21", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "tfbS4eLs0rFtono6jE6djA", "review_id": "mRNn5HrMgSo6lLxjvVWrkw", "text": "Typical Chipotle. Same layout and choices as all. Always busy, but always maintaining their composure and busting through the lines like a boss. Great food.", "business_id": "Cv4kZH9zN0wpN2Drn0qkLg", "stars": 5, "date": "2013-06-27", "type": "review"}
