{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "SeKrO18C8nqAZ9bWYOyxig", "review_id": "LvOtsQTVKS9oWm7jML4x8A", "text": "By far the worst most unprofessional dentist I have ever experienced her staff is too busy watching soap operas on all the TVs in each room instead of cleaning and she gave me a filling which was too deep which could have been understandable as her son had his pictures delivered from Hawaii and she had to stop 3 times to pay for them and show her whole staff all of them must be nice to have a 14 year old go to Hawaii on her moms dime and have her patience wait to see all of this happen I had to have oral surgery and have the tooth removed because she put the filling in too deep an abscessed tooth was the result I wouldn't recommend her to an ex girlfriend or someone I hate because of the three months of extreme tooth pain I had to deal with because of her lack of care and follow through even after I called and asked them for advice and follow up they simply could care less and did not even offer to reschedule an appointment other than prescribing me vicodin and antibiotics do not recommend and do not go to her license should be pulled!!", "business_id": "e_U_FnpdKVgNb4mUN2cU_Q", "stars": 1, "date": "2013-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6MQjQ3jfCUUxItIvKadJsw", "review_id": "DBYqgcTd3J5hc6_MxbopZg", "text": "I have a MAJOR MAJOR dental phobia. \n\nI made my first appointment with Dr. Petraglia about 10 years ago.\nBefore then - I have not been to a dentist in over 20 years/\n \nMy teeth were not healthy despite the fact that I have brushed them twice a day.\n\nDr. Petraglia knew by just looking at me that I had many dentophobia fears. \n\nHe has been very patient with me as sometimes my nervousness fought the drill.\n\nI have been seeing Dr. Petraglia now for over 10 years.\n\nHe is excellent when it comes to emergency appointments.", "business_id": "G0lLt7xjXUBhWSoQtexoXg", "stars": 5, "date": "2015-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q200TCFOheJfS_MvvwMfJw", "review_id": "mSFfJWC0U_Amw-CTfh_0Mw", "text": "It seems like every time we come to this hospital recently our satisfaction drops. This time my wife had a gall bladder attack. We waited for approximately 15 minutes in the waiting room before my wife was taken back into the main ER waiting room. \n\nApparently they need more beds and have split a conventional room into a double. They have a satisfaction index on one of the walls before the main nurses station in the ER where a thermometer indicates that patient satisfaction is approximately 50%. Pretty sad. Well my wife had an ultrasound and they determined that her gall bladder needed to be removed. She was admitted and the organ will be removed tomorrow.\n\nEveryone has been great so far. We've always been impressed by the quality of the nursing staff. Today there was a very short wait in the ER. We spent about three hours in the ER itself waiting for a bed to open up in the tower. I had to run some errands but when I came back my wife was surrounded by her nurse Rebekah & a parade of folks came by to run various tests on her.\n\nWell the rest of the CMC Pineville experience mimiced the ER experience. The ER doctor wanted to remove her gall bladder so she was given a private room on the 5th floor of the new medical tower. There are plenty of windows that let you see over to Carrowinds & the skyscrapers downtown.\n\nMy wife's surgery took about 2 hours & she had 2 days of recovery in her room before I picked her up late Saturday morning. I can't say that the hospital's food is really any good. I definitely know that what the patients are given is marginal at best. However the cafeteria & the little Caribou Coffee Shop really aren't any better. I had a chance to eat at both & wasn't impressed.\n\nI did think it was odd that her surgeon never came out to talk to me after the procedure.", "business_id": "oU38GVk3Kmw7_LOVLSqqwA", "stars": 4, "date": "2012-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CiUxmK2YbghGAQnhMiV24w", "review_id": "w0sH0pcR_HDOrdpLdlCEkA", "text": "Worst experience I've ever had in my life at the Carolina place mall beware!!! The receptionists are very rude and one of them hung up on me before telling me that maybe she might get back to me? What kind of business are these people trying to run?", "business_id": "DP70v9gay6NeKbFEdHAgKA", "stars": 1, "date": "2014-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "M-TwsqjrGVH9-qyw2KcvdQ", "review_id": "dlY08CBkuw5EZ5tiKTcrUA", "text": "5 stars come from my overall experience with gyms in the past and I personally love Dowd Y.  I just realize I haven't written about it.  Look, I am not a big exercise/workout person. And I remember years ago when I first thought about joining, this place intimidated the heck out of me.  Now that I have been a member for awhile, I highly appreciate what it has to offer:\n1. No annoying kids/teens.  Sorry if I offend some people, but it is hard enough for me to drag myself to workout. I don't want to be babysitting and/or have to listen to some teenage drama.  The general demographic here is young professional.  They have a kids room for the very little ones when the parents are using the Y, but overall no kids running around like the other Ys in the suburb.  \n2. Towel service. They have small towels for wiping sweat as well as bath towels for locker room usage.  Excellent perk!\n3. Great hours.  It opens until 10pm weekdays. It opens early but it doesn't affect me, I am not a morning person :)\n4. Great facilities.  It has so much to offer, from great group classes (at all hours), to pool, basketball court, indoor running track, racquet ball courts and the equipments.  My personal fav is the steam room and sauna. \n\nYes, the parking can be challenging but after a while you can figure out when and where is the best.  Membership can be expensive but they now offer tier membership fees based on income. If you don't make much, you can afford it still.  And the location is very central for people who work or live in town.", "business_id": "b3u-GK6_xj2fJkinzLk_jQ", "stars": 5, "date": "2012-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4n2I4h9gpV54hw0gjyQJ_Q", "review_id": "inLMf0cT15i9IQkAas6x4w", "text": "Dr. Stout is the best dentist I've ever had, and he's handsome to boot (think a young Billy Dee Williams).  Both he and his staff are caring, humorous, and proficient at what they do.  The office is conveniently located to Dilworth, Downtown, Plaza Midwood, Myers Park and Elizabeth/Chantilly.  I have had a couple of emergencies, in addition to my regular cleanings, and they've worked me in immediately.  They feel like family to me!", "business_id": "idP6mIwLoNLCA39RMcSm2A", "stars": 5, "date": "2008-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WBYtL4fLRBt5uB0Jn2G9Ng", "review_id": "yjtjhJB50j0E_PSXz1UnUA", "text": "Northwest Family Physicians is the best!  I have been going there for about 10 years or more. Incredible service all around.   Dr. Larsen is my favorite physician ever. He is very personable, friendly, and professional - - and even in these fast times, ALWAYS takes time to listen intently to every concern (even if I have a list) without judgement - a model for all doctors to follow and live up to.  He's very logical and thorough, so I know there is no stone left unturned.  And it's always clear during these discussions that he is up-to-date on the latest in medicine. I moved to Durham, NC, over a year ago and he's still my primary physician!  Wouldn't have it any other way!  Dr. Larsen's nurses are also great - friendly, professional, and very attentive (won't name names - don't want to miss anyone).", "business_id": "R-ff6qTsHb6HC7wQ2Wl5bg", "stars": 5, "date": "2013-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nmDcdE8LvcJ0vFy9jmctOA", "review_id": "6XCVCzOC9whEm4jsYSjciQ", "text": "Very thorough and pleasant staff.  Dr Callie Maursetter was wonderful!  Knowledgeable, professional and friendly.   I would give this 5 stars except for 1 thing.  First, whatever that contraption is to measure my eye pressure is awful. There is no puff of air but to say you are going to \"tickle my eye\" is the understatement of the year.  Instead of scarring the crap out of me with air this little contraption sticks something in it, it is as terrifying and equally uncomfortable as the dang puff test. If it wasn't for this incident I would have had a 5 star visit.", "business_id": "vP7-03_-_NoNfwfeYADDPA", "stars": 4, "date": "2013-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4ai6prB9Nb0tGldoG06Ugw", "review_id": "n1R8xgifVZwfzia_h5yZEg", "text": "I have gone to Lense Crafters several times. I have always been happy with their service until recently. My son is playing sports in the fall and will need contacts. I scheduled an appointment, then received a call the day before the appointment. \"We can't take new contact appointments after 4pm.\" So I rescheduled the appointment for 3:20. Again, the day before the appointment I received another call. \"We can't accept new contact appointments after 2pm.\" This time I did not reschedule. When I asked to speak with manager, she was not taking calls. I am employed, like most Americans, and have a difficult time getting off early.", "business_id": "R7oNZOg09xgqLzbqzVQxvg", "stars": 1, "date": "2015-06-23", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "XgIhw-aWaq_Fx3ZVQGjnuA", "review_id": "vtVS0yS44LBot00K_Gfx4A", "text": "Some of the late night nursing staff have zero people skills.  Seriously...totally socially inept people.\n\nAlso, when waiting for a family member going through a six hour surgery, it would be nice if the coffee station that is apparently monitored by video surveillance (?) WHY??  actually had cups.  \n\nIt is the little things.", "business_id": "CAD0tKIttOTTgT7TMJa-lQ", "stars": 2, "date": "2013-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r2uOOiSQ_h4injNoh4umKA", "review_id": "sJa-wtTMjOZoGmZk-YXI1w", "text": "I have used super shuttle to and from the sky harbor airport a number of times and have always been very pleased with the service and the value. The drivers have been bright, friendly, and helpful. I recently compared prices with uber, and super shuttle was a much better value, if you don't mind a shared ride. As such, it's better for the environment, too!", "business_id": "JYMlJkfOShT1PEcFyGPpbg", "stars": 5, "date": "2015-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E_iK_Yf-jqJS_jBbobI_dQ", "review_id": "9XrjaYTBzRMv_fRpcH8keQ", "text": "Definitely needs work! But it is better than nothing.", "business_id": "-TIyxSc-lLmJzunje6MD9Q", "stars": 3, "date": "2013-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BVdukOkM33ItRUQdW6AvgQ", "review_id": "BfPTSO6RMIHIomsXkjsnsQ", "text": "I would never recommend this center to anyone.This is not the place to send your loved ones.They completely lack professional courtesy towards those that need  help! I would never send anyone I cared about to this place. My son needed help and did not even have the courtesy to return a phone call..Their lack of concern for those in need is very evident,. My son attended there for two weeks but we had to take him out of the program due to a prearranged vacation.  We were assured there would be no problem getting him back into the program after we got back. This was a false statement because when we returned we could not get him back in even after numerous calls from my son and myself. No response what so ever even though my son wanted to get back into this program. Instead of builing him up they tore him down. What an unprofesssional place. Instead of helping those that feel rejected by everyone in society, they make them feel worse about themselves. This is not the place to send anyone you care about.", "business_id": "3KwmkeqyC-STUvTcPOxsCw", "stars": 1, "date": "2014-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5hIcclyqd9yelg2BlsiXBg", "review_id": "3ZeJvQTxT42SR98dTFlyqQ", "text": "Wonderful experience! All the staff is beyond helpful and great to work with from start to finish.  They're very thorough and knowledgeable.", "business_id": "gztTQsgq6FJwIoV4P4RNIw", "stars": 5, "date": "2014-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "c_wwf6CBduaVpt750ScDlA", "review_id": "5yFS4a3w_3w-aVeePE4-pw", "text": "I love this place! I always get a good prescription, and they have really great frames! I always enjoy getting fitted for frames by Corina who is a lovely person. She gives great advice that you can trust if you are choosing between a few pairs. I always recommend Optical Expressions to my friends. Their frames and selection are great, and I always find something that's perfect for me here. People often compliment my glasses.", "business_id": "RqZctFR39-ZFkBEFTA1GyQ", "stars": 5, "date": "2012-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qY9Bbb1z0swICa4HQEZF7w", "review_id": "ZbRjuPXEI1Kg82DOQ3Lgpg", "text": "I love my dentists. Dr. Adhikari and Dr. Dougherty are honest, gentle and fun. I was in and out with two rear fillings and a filling for a crack in my front tooth in 30 minutes and I was comfortable the whole time. Dr. Adhikari was gentle, made me laugh and I never feel like I'm being over charged. I'm always called and reminded of my appointment, the staff is ALWAYS friendly and their location is convenient. I love my teeth, my smile is what people know me for, and with these two dentists, I feel like I am in the best hands. I trust them completely and am so happy I get to visit them every 6 months!", "business_id": "0eX3fQIVekKGbEISfhcQwg", "stars": 5, "date": "2013-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_Lz4b5QL0K8ndeyz2vxslA", "review_id": "qVFRk3VX9s8Utvw_7LmUoA", "text": "I am a huge fan of Dr. Day, finding him pleasant and professional and NOT arrogant as stated in another review.  The only real issue I have ever had (in 3 procedures) is an employee who says things like \"I need you to\", which is a pet peeve of mine.  Otherwise, I have no issues at all with him :)", "business_id": "oQpq9f0HkS-_8RXlcsMiUg", "stars": 4, "date": "2013-07-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "KqMUO0KFaa2aLPqfHmMQrg", "review_id": "mS1rXq75SDfxMXPAJSpU5Q", "text": "Tried to schedule an appointment today as a new patient because I broke my hand in a motorcycle accident, and was turned down. Receptionist said they take one new patient a day and as of 6/14 they are already booked until July. What? No sense of urgency.", "business_id": "BZqn7i_Z-MJ1QrxCyjFZSw", "stars": 2, "date": "2013-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "H1nxPrmQfK_JJZJQlppFrw", "review_id": "IoEaDY4w0iQwqpQbkg0BJg", "text": "Worst place ever! First time I came here for my contact lens fitting appointment I had to wait 1 hr + and that was with an appointment. No apologies from the staff for the long wait either. Second time I went to finalize my prescription I told the doctor about how the contacts didn't feel right, I couldn't see very clearly. I've been wearing contacts for years. Discovered that on top of all the waiting the doctor and staff are incompetent because they incorrectly ordered my contacts for me and changed my -2.75 prescription to a +2.75.  Do not go here! They suck! This is for the location at 4280 E Indian School.", "business_id": "AJONCMi8dnGWAkD-86FK5A", "stars": 1, "date": "2012-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iyN7w7bAx4MTFmJDU_kidA", "review_id": "nMsBHBw52Vk0pe8kGP1UwQ", "text": "I manage an Urgent Care down the street and refer patients to this office frequently. Especially the new patients in town that have had the same doctor where they came from for 15 years and are looking for a new, well rounded practice and knowledgeable team of doctors that they can trust.  I call to get feedback from them about their experience, just like I do when I refer patients to a certain Orthopedic, Urologist, ENT, Imaging Center ect.....  and all the responses I get are all pleasant,  They like the idea of having x-ray and lab services on site, unlike most PCP offices in the valley that have to send their patients to a different location to receive those services. I have not been there myself so I cant give you a personal account, but from the feedback that I get I never have any reservation in recommending Dr. Wyse and his team of doctors and staff to any patient looking for a new PCP that doesn't treat you like a number and takes his/her time to address all your concerns.", "business_id": "psMQBi2uQVN7c-Sw0xjNMw", "stars": 5, "date": "2013-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gDVSujaf8xwx0vqLrYDHDw", "review_id": "0G9QoBpNKEaz9Ji5OdaYPQ", "text": "If I could give more stars, I would. This is the third OBGYN I've seen since finding out I was pregnancy back in April and I'm so glad I found her. She's an absolute wonder compared to everyone else. I got pregnant with an IUD and have had a rocky start. The first doctor spoke down to me, the second doctor came into the room after my 14 week ultrasound and said, \"Everything looks fine, any questions?\" \n\nI finally made it to Dr. Kwark at week 15 at the urging of my mother and she spent almost an hour to me telling me about the tests that should have been at least offered to me several weeks prior, giving me an exam and giving me expectations for the next few weeks until I saw her again.\n\nI'm not sure why the other reviewer had such a bad experience, but I can tell you that what she had is definitely not normal. I and several people I know go to this doctor and she's absolutely wonderful.", "business_id": "31wytPjgKJAf0QJov1Y4Tw", "stars": 5, "date": "2015-06-17", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "LB7HoDg61yWP2CjrueeJUQ", "review_id": "KztOm9oOlbWaE6F0SDD8_A", "text": "Dr. Nick Warner is great at what he does, concerned about care, not just billing and works harder on me when I'm in his office than any other Dr. I have seen. He is a guy who seems to be aware that he is providing a SERVICE - and delivers it with great skill and compassion. Take it from a reformed skeptic like me and see him for help when you need it. I have also bought massage gift certicicates as gifts with 5 star reviews. He treated me after some stupid cow slammed into me at full speed while I was stopped at a red light and helped reduce chronic and agonizing pain pain I suffered for almost a year.", "business_id": "HtI_uDwZ-obk--VW4JjWHw", "stars": 5, "date": "2009-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "oPzHdfCrduickFJeLViJUg", "review_id": "Dh1d8vQjSyxatnQsSeVtWg", "text": "I wish I could give less than one star. There is no communication between the staff, their attitudes are poor at best, their reception is sloppy and they are commonly overbooked, and they frequently change insurance policies without contacting their patients about having to find a new office. I have never been so disgruntled with an office experience in my life and I would highly recommend finding absolutely anywhere else to take your business.", "business_id": "ZcaBYLRDDY4ecAPDGWBQzA", "stars": 1, "date": "2014-08-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "5vOHKfi32zK9CKirfgksbQ", "review_id": "ess0Hp2Yl5tnqBxe9m8ZJQ", "text": "I had my first adjustment ever done at Kerch Chiropratic and Kim Kerch was able to make me a patient for life.", "business_id": "HpWiJ5iTdOHL7DUBjJOy3A", "stars": 5, "date": "2014-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "ynbYfudmDw3iwZpptU-KrQ", "review_id": "EjsZF92df8lCQmqRLAlL7w", "text": "My grandparents went here, my parents go here, and now I go here.  That should say something in and of itself.\n\nThe staff here that I've dealt with have always been pleasant.  Plus, he's got an in-house lab for all your blood draws and UA's and such.\n\nDr Drury himself is always pleasant.  He takes his time with patients, answering all your questions and never making you feel rushed.  Because he does this with all his patients, sometimes you have to sit in the waiting room a little longer.\n\nOverall, top notch.", "business_id": "Kpl6cUmrYMczTDY_2RnctA", "stars": 5, "date": "2012-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "N6UMFLbwyCTTjXViWcgfCA", "review_id": "p8x3cUXVL46Eeaz-JtJ_NQ", "text": "Unfortunately this isn't a happy review like the others I write. I am a front office patient coordinator for a dental practice, I know what customer service is. This place is lacking, I will not be going back. I was initially referred by my mother, she had raved on and on about how great the doctors were with patient care. It was also 30 minutes closer then where I was previously going, so why not right? Last year my first visit went well. This year, it's been nothing but a disorganized mess. I had my annual women's exam scheduled for a month then the doctor was sick, I completely understood and let the lady know I will need a birth control refill since the appointment is being booked another month out. They said they can do that. A week goes by and still nothing at the pharmacy... So I called the office again and spoke with another woman and let her know what was going on. She said \"no we don't do that. You have to have your pharmacy send a fax request\". Again I explained to her I was told that it would be done and she said \"well that's not what we do\". After I finally went to my annual exam, I needed further testing for an abnormal pap. I got this scheduled, they called 2 days prior to confirm. When I went in there they collected the payment and I asked if your monthly cycle is okay while doing this procedure. The ladies said they didn't know and they will find out. Come to find out it impacts the results so again needing to reschedule. Why wouldn't they mention this when confirming or initially scheduling? They wasted my time. And if I didn't say anything I'd have to pay again due to false reads. That's absurd. I called them before the rescheduled appointment with my new insurance information, cool they accepted it. The day I go in, they don't have my current info. I don't have an ID card and I offered to email it with the lady telling me no. Then after the next results I had to go in for another procedure where they need to get a preauthorization or benefits. Again they don't have my updated insurance? After playing phone tag for 2 weeks, I got them the information and the procedure scheduled. When the day finally came for my 4:00pm appointment I got there at 3:55. I get told my appointment was at 3:40 and they won't see me because they filled the time with another patient. I let them know I had this scheduled for the time that was arranged and that I didn't even get a confirmation call. The office manager didn't do anything to fix the situation and the doctor said she wouldn't see me even though it was their error. The best thing they have done for me was give me a records release form. Let's see if they can get that right.", "business_id": "9xpYUYI4wbNA4XufvVfKzQ", "stars": 1, "date": "2015-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "A85CoBQ6qSX8d1vVlvPgpw", "review_id": "nEs8_6dmVD0xoKMqZn3iyA", "text": "I've been coming to this practice since we moved to the Valley in 1990 and the doctor before Dr. Dameron took great care of my teeth and Dr. Dameron takes just as great care.  I have a small mouth and he's very considerate, especially when performing procedures.  His staff of hygienists and assistants are very nice and pleasant to deal with.  I would recommend this office to anyone in the Phoenix area looking for a dentist.", "business_id": "SC7y-w80q2-85iDDCFuQqA", "stars": 5, "date": "2012-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "chECojA5tp0NzBxMgQIfgQ", "review_id": "juucsoPVDw1cqN-0kYX9YA", "text": "We chose this place because of the convenience that it was close to home and therefore easier to visit my father who had stomach surgery.  My father prior to the surgery was a very lively strong man who never looked his age and was very active.  Unfortunately, due to the surgery, spending 3 weeks in the hospital and relying on pain medication he lost most of his strength and weight.  Thus, the reason for coming to this facility to help him gain his motor skills and weight (getting up to the restroom, walking around, feeding himself, not relying on paid meds).  \n\n#1The first day was horrible.  His room mate had the tv on all night and his call-button wasn't working so he was not able to rest or get pain relief.  When we showed up they simply moved him to another room without acknowledging what had just happened, or apologizing for the inconvenience or that no one had checked on him all night to even know something was wrong.  Good thing he didn't get up or hurt himself.  Since then everything has been very slow. \n \n#2 His physical therapy consists of somebody walking in to the room, asking him questions and asking him to stand up and then leaving.  I saw the gym and they have a great room with lots of awesome machines to help with rehabilitation but it's been a week and he hasn't seen it.  When I've mentioned it to the nurses they've directed me to the social worker who's yet to return my messages.\n\n#3 no information has been given to him nor any of his family members about how well or bad he's doing\n\n#4 the nurse who initially was assigned to him almost threw up when she had to change his colon bag, how unprofessional is that? It was rude considering he already feels bad that he had to go through this procedure and people have to help him clean up.  They tried to teach him but poor guy just had his guts taken out and he can't bend to see, so that is why he's in the facility to help him get better from the stomach wound so that THEN he can learn these care instructions.\n\nI would not recommend this place.  There's only one nurse who was helpful, Elizabeth, she's Spanish speaking and really seems to care for the people who are there.  She addressed our concerns right away and I'm always glad to see her walking the halls and talking to the patients as people.  The other nurses seemed to be there just to get paid.  If you don't like your job then find something else.  The facility managers or owners need to either hire more nurses/caretakers or train their current staff.\n\nDon't even ask about the front desk service.  It's always a young kid playing on their phone, I don't know what their purpose is.", "business_id": "xAQHRZRun9vD-N3OKMxeMA", "stars": 1, "date": "2015-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1lNo1hVxPsTLHWfQoiORSQ", "review_id": "-dlR2wq7x--3ZM49KHYoIw", "text": "Love it! Wait time usually 5 mins if that!!! Wonderful staff. Mrs. Ash is the best =)", "business_id": "NK3S3U6TQtysH_-eqT3bBQ", "stars": 5, "date": "2010-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QudWgDRmV3kUNJZrGOpb0g", "review_id": "K3QslVdNWEWZMJG48hdd2w", "text": "I have been a longtime patient of Dr. Woodland, every six months for about 33 yrs now!  Due to good genes or something, I have only gone in for preventative cleanings and oral exams....until yesterday.  Over the weekend I broke  a molar, so I called first thing on a Monday morning and they were able to schedule me with no delay.  Fortunately Dr. Woodland was able to take care of it with a filling, my first in over 50 yrs.  It was done with great care.  I was very comfortable and appreciate the relationship with Dr. Woodland and his staff and the professionalism and quality care they have maintained over the years.", "business_id": "BNhnxtafzFg5D3aVBxz7jA", "stars": 5, "date": "2014-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qGl1xfS0okKRbSH8vvucGA", "review_id": "zvPZ8kxRbhtPFMqAbFTU3A", "text": "Very thorough exam by Dr. Yamamoto who reviewed my history and progress. Never felt rushed. Nicole was wonderfully warm and professional with her part of the exam. Great team all around as always!", "business_id": "eEv4wrcryRbKSCABicwk4Q", "stars": 5, "date": "2014-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lFVOQSNn0fYsIbOo77n2Fg", "review_id": "adsjiePhFeAVvEWiUF6Yhg", "text": "We are new to the area and chose this practice due to it stating a family business. My kids were scheduled at the same time for 1030 appointments. the front office staff were rude and very short. We were there until 1:30. After an hour I went to the desk to ask how much longer or what the hang up was, I was not even acknowledged until after 5-7 minutes had passed, they were all sitting at the desk. At the end I was charged for a test that was not covered on my insurance for which I was not notified of prior to the visit. Then we were informed that none of frames were with  our frame allowance for insurance,  yet they are listed as a premiere provider through vsp. I did really like the physician however. I will not ever be going back to this practice.", "business_id": "Er5cvsO0iZR_aPmoHElN7A", "stars": 2, "date": "2015-08-04", "type": "review"}
