{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mLQAyhgETUVdXV6OVXXYCA", "review_id": "DKejrlkELvrdPH89RrsYCg", "text": "Great old-school donut shop with delicious donuts.  The even still tie up the boxes.", "business_id": "zhQzX3CxM0tdBXwGUWmxGA", "stars": 5, "date": "2011-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Q6D3W-1jaZhui6yiHSl4Cw", "review_id": "vY__43NdP553-t6osBloXg", "text": "Randonly stopped by here when I was driving in the area.  Its definitely better than dunkin donuts, but really just an average (or slightly above average) donut shop.  I wanted to try the bacon donut that other yelpers have written about, but they didn't have any at the time.  The donuts I did have were not bad.  Hopefully next time I'm in the area they will have the bacon donuts available.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 3, "date": "2012-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "EJaoDaba5ew7Pr1r8fT4NQ", "review_id": "lAJtSlaIl81kDWKHmddedA", "text": "I came in  on an early Friday morning to buy a dozen and a half of donuts for my co- workers. The man behind the counter found it odd I order such an amountapparently, by the way he repeated my order. In my case 1 dozen would have been too little, 2 dozen too many and I didn't want to waste any. That alrady made me feel uncomfortable. Just fulfill whatever order you get, I am customer. It was my first time here, after many, many drive by's. He asked me what flavors and suggested to make a mix, I didn't have a preference, as I just liked an assortment. Again I was frowned upon. Just give me your bestselling flavors...what's the problem. Well, I guess it was once and never again. The donuts were fresh tasting, but the service was far beyond friendly. To bad, you could have earned a new customer.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 3, "date": "2012-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jXp0eFDh_LNO8JfcGlV3pw", "review_id": "ahO9LaKAzTU-kUvsHEjfYQ", "text": "Reminds me of the donuts of my childhood, so good. The first time I went was this past Saturday and they had two trays left at 2pm and I thought that was limited but I got a glazed to try them out. Wow was all I could say.  OK so I went today 6/24/10 and they had only 1 tray left and it was mostly donut holes at 10am and this was it no more to be made today; I was bummed.  But I got a dozen of those little gems and left to eat and sulk about the whole matter at home.  So the moral of this story is get your butt to Rainbow Donuts early if you want a good selection. Otherwise don't say I did not warn you. They are open from 4am to 3pm 7 days a week.", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 5, "date": "2010-06-24", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "rjsx6_pSqwl0zuiwa_tI2g", "review_id": "QRSAk1c_93cyj9DxHsvHCw", "text": "A little angel told me that I would find something in Phoenix that I had seen nowhere else in all my gypsy travels. I was expecting some miraculous happening or event - -  or perhaps discovering a plant or insect that no one had ever seen before . . . but I was prepared for whatever new miracle that happened to come my way. Bring it on!\n\nI certainly did not expect what I found . . . I was out exploring my \"new\" city a couple weekends ago when I ran across a Dunkin Donuts. \"Well, yes\" I said to myself, \" I could use an iced coffee! and maybe a couple of Munchkins.\" As I drove up to park, I noticed a Drive-Thru sign. I wondered what other fast food taco place was nearby . . . when what to my surprise I realized it was a Drive-Thru Dunkin Donuts! Never in my wildest imagination did I ever think folks would Drive-Thru to get D*O*N*U*T*S! It was a miracle, no doubt about it.\n\nI got in line. Yes, there was a line! I quickly picked up my phone and texted a friend back in Denver. \"Guess what I found?\" He's a huge DD fan and the closest one is in Colorado Springs. I told him I was Driving Thru and was buying a small box of Munchkins and did he want to share. I got a text back . . . \"I hate you.\"  I just smiled and stuffed another jelly filled glazed Munchkin in my smiling mouth and I drove away exploring for more miracles.", "business_id": "YDeM8-M4GwxyymCoV7Y-Tg", "stars": 4, "date": "2011-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "5WCqMsO76K8ul7sYFszq8Q", "review_id": "YlFae51gQYAKV1KHkPxcOg", "text": "This place is fantastic. An amazing selection of donuts made fresh every morning by a family of great people. Tanya and Brian are always helpful and smiling and in the back dad is pouring alot of love onto these beauties. Don't Miss- blueberry cake donut, the chocolate butterfly and the delicious crumb donuts(both raised and cake!)\nWhy would anyone ever go to those faceless corporate spots when they're blown away by this little oasis??", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2012-06-08", "type": "review"}
{"votes": {"funny": 11, "useful": 14, "cool": 13}, "user_id": "11QzsQ-nmRykVvD4agGRPw", "review_id": "K44IukBIRcBNKkrXYRgXXQ", "text": "Wow this is a legit hole in the wall donut joint. The donuts are so fresh and the price is definitely right. There is a yelp check in offer for a free donut and when I asked the girl behind the counter if she wanted to mark the offer used she said \"no way sugar we want you to use it every time you come back\" and that's a nice touch. She was friendly and nice about explaining the different donuts to me. The wife and I picked out a half dozen plus our free donut each for yelp check in and it was only $5 which is awesome. The bigger bear claws are filled unlike the smaller ones and both are equally delicious. I'm a fan of cinnamon rolls and really enjoyed the inverted cinnamon roll that ribbons of devils food cake running through it. No fancy donuts here just classic old fashion donuts of goodness.", "business_id": "259TmptwDUjXWgPlKf52Tw", "stars": 5, "date": "2015-06-10", "type": "review"}
