{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w16jpVr-b-0gd6YHwnIarg", "review_id": "pvzOdlulj62eOzpSXhEc9Q", "text": "I judge a pizza joint by their cheese pizza and their pepperoni.  While grabbing a brew at Voodoo, my friends and I were feeling a bit hungry.  Thankfully a menu was available and Capri pizza was just across the street. \n\nWe ordered a small cheese pizza to pick up.  I was pleasantly surprised!  The cheese was not greasy, the sauce was flavorful, and the dough was chewy yet crunchy... what more could you ask for?  We were really impressed with the quality cheesy pizza from Capri.\n\nNext time we'll try the pepperoni and post an update.  I see yummy pizza in our future.  If you're grabbing a pint a Voodoo and feel a rumbly in your tumbly, order something cheesy at Capri Pizza in Homestead.", "business_id": "t_gan0EXAw8csKIeFyazJw", "stars": 4, "date": "2015-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jyU4yKXe63kk-si0OC62JQ", "review_id": "8fdTmdu1JpeF2Jl9Zxz9mw", "text": "This was a Good place to get pizza.  As far as I know they are No Longer Open at this Location.", "business_id": "mIiHJkpK8nZvW_45LlhrbA", "stars": 1, "date": "2015-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kWkgwRxqWD-h260dMTkHUA", "review_id": "VNBZJthpN3_o2Wt2P5xW7g", "text": "I stopped by here today with my fiancé for a quick slice of pizza for myself.  I had noticed this pizza place before and had wanted to try it but never really had the chance before today.  Inside it looked like your normal pizzeria with a counter to order from, a pop cooler, a display dessert case and a pinball machine which was sadly not on. The temperature inside was pleasant as the air conditioner was set to 66 which was a good change from the stickiness outside.  We were greeted almost immediately on entering and I ordered a plain slice.  A few minutes later we were on our way with my slice of pizza.  I was happy to feel that the box was actually hot and so the slice was properly warmed.  Upon opening it I was also pleased to see that the slice was pretty large.  The pizza itself ended up being really solid.  On it there was a good covering of good tasting cheese which did not fall off the pizza when eating.  The crust was crispy and of medium thickness which meant the slice wasn't floppy.  Finally my favorite part was the sauce which had some good flavor to it.  As a matter of a fact you could see the spices when looking at it closely.\n\nThe bottom line for me is that I would eat here again in the future.  I liked the pizza that I had here and may even order a whole one in the future.", "business_id": "lHP5STO7aomlEQixH8m1aA", "stars": 4, "date": "2014-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zk0SnIEa8ju2iK0mW8ccRQ", "review_id": "AKtlRwb9WIADPqbrST3jKg", "text": "Was going to try the buffalo pizza. Tried to call about 9:15 pm Saturday night and they didn't even pick up the phone. They'er menu says that they are open til 10pm  Disappointed again! No longer going to try.", "business_id": "CqHTknOJHZZncWzGtpbNsA", "stars": 1, "date": "2014-06-28", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "ga2GgI8q5jkJ-YbuPSapRw", "review_id": "s2UwcJv6uSI1MXFYvKgGtg", "text": "Not like any other pizza you have ever had. The crust is crispy and the cheese is uncooked. I hated it at first...but now I live it!  You might have to try it a few times. I will keep coming back. And the price is so cheap! $1.45 for a slice? Kidding me?", "business_id": "93UCt9OgWYmypZCpXtUu8g", "stars": 4, "date": "2012-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mXJS_e-zR68eExLhMrxJPA", "review_id": "KCJa2BrfxRBr_703hD9NdA", "text": "Local call this place Camps for short. If u like thin crust pizza , this place is for you . Try  the bacon pizza .. It's fantastic . Cash only place", "business_id": "Cex2R008tMFg8R5fAtf77w", "stars": 5, "date": "2010-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cXZFEVY_mEb0Itn9fyxN5A", "review_id": "5XCgs4JbHa7Er4fQTEMLMA", "text": "I'm usually in Pittsburgh once a year and each time I come to town I typically have Vincents. Their NY Style thin crust pizza is just awesome and the service is typically pretty good. Regular crust is good as well if you want  something a little bit thicker.", "business_id": "KZXtzoI84iI1CEcAnD7OPA", "stars": 4, "date": "2010-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "leZclFG-pH9Nx8YVUkuZcQ", "review_id": "hB9OoHu1YndMwvUBcRm3uw", "text": "I travel to Pittsburgh for work, so I feel like I have tried most of the restaurants in the city. I hadn't tried this place yet and was in the mood for pizza. I ordered the Mediterranean pizza and it was a little greasy but all in all pretty delicious. I would recommend.", "business_id": "nBl_NeArpL08MpoghDiA_A", "stars": 4, "date": "2011-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W7TlJU9hH3qBpIhbdozexg", "review_id": "RVnNenBywgoVp81laHBP9w", "text": "Food was pretty good.  I had the Greek salad and my sister had pizza both good choices here.  Staff is friendly.", "business_id": "SvoJ3Y3uqDfB4iGUaWXh8Q", "stars": 4, "date": "2013-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8eTBUQoUXSNaz_7mqtsvqg", "review_id": "sP9hKpfN-mJryJb745eV9Q", "text": "Wow! The pepperoni pizza was so good I wanted to fill my pillow with it so I could dream about Angelo's every night!\n\nVery tasty crust. Full flavored sauce. Plenty of cheese. Nice pepperonis that curl up a little. Perfect thin crust pepperoni pizza!", "business_id": "PTS4MxQel-xzj5qWxVn3LQ", "stars": 5, "date": "2014-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ejsWs1LOvthk3Ptx4exAyA", "review_id": "9bEEDAfbfpOA585FR9M8Gw", "text": "I only come to Pittsburgh twice a year, but I get so excited to eat the best pizza. Sacramento pizzarias have nothing on Pittsburgh's. Fiori's is the best pizza I've ever eaten. It's local so my dad grew up eating the stuff & so did I until I moved to California. Sweet sauce and thin crust baked to perfection. If you're in Pittsburgh, you must try it. If you live in Pittsburgh, then you already know what I'm talking about.", "business_id": "r8jeeS3k_diihMDSu9IjlA", "stars": 5, "date": "2010-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EDvrXlhzlYgySM6qpt5wKQ", "review_id": "4oo1UxGRKr7haRv8oy15zg", "text": "Awesome pizza.  Italian hoagies are good too.  \n\nIf you haven't tired their pizza you should it won't disappoint.  \n\nLittle costly for the pizza but you get what you pay for and it is worth it.", "business_id": "r8jeeS3k_diihMDSu9IjlA", "stars": 5, "date": "2015-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "go2dZIDfrEBqfsGKnA4m7g", "review_id": "ycRPtXB-WvGVr_OeN3r4fA", "text": "WTF?  How does this place get so highly rated on Yelp?  It's not awful, but it was one of the most mediocre brick-oven pizzas I've ever eaten.  There's much better \"fancy\" pizza in Pittsburgh, and much better regular pizza, too.  \n\nThe antipasto plate was good, but definitely not worth the $15 they charge for it.  Decor's not bad, but the space is a little noisy; service was pretty average, below what I'd expect for a $15/person place.  \n\nLong story short: unless you're in the neighborhood, you can get better Italian elsewhere in the 'burgh.\n\n\n\nP.S. This is yet another Pittsburgh establishment that doesn't take credit cards.  Seriously, is the whole city in a 1995 time warp?  (...Or are all of these places just cheating on their tax bills?  It's a lot harder to hide check and credit card transactions from an auditor.  With cash, you just need to hide a few receipts.)", "business_id": "6-rJjW6ITl5o_FliiNgZRA", "stars": 3, "date": "2009-08-17", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "fBdl02j2Yp8glZ_8woQzoA", "review_id": "RcrMka4-UwWnTGNsi3MORQ", "text": "Delicious, authentic Italian. The best food I had in a long time. Plus, they have a wine bar in a barn behind the restaurant.", "business_id": "6-rJjW6ITl5o_FliiNgZRA", "stars": 5, "date": "2014-06-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "u7rJ_CFbp4IYeT39fNfVDQ", "review_id": "UoX2f__KSQsVE7sgsPgcSA", "text": "Not a lot of places in Pittsburgh do Sicilian pizza. Mineo's does it well. Do not overestimate how much you can eat-- one piece is probably the equivalent of 2 slices of regular pizza. I actually like their sauce, and the cheese is good. If anything there's too much cheese!\n\nThe restaurant itself is kind of shabby. I don't look too closely at the floor and doubt the grated cheese ever sees the inside of a fridge, but it's nice to have this place within walking distance for a quick slice of pizza. The fact that they have ice cream makes it a good place to take kids, too.", "business_id": "sa3xqElJEv97MazozLeszw", "stars": 4, "date": "2011-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nD45YiHzAPub4ofzqf7CTg", "review_id": "6-HR1E1bzKrccwbQv0j7gw", "text": "I've noticed, over the past few months, a steady decline in the give-a-crap department. I understand being busy, but it would be nice to only have the toppings I request. I just found 10 mushroom pieces and 7 sausage pieces on my ham & pineapple. Please slow down & give a crap... Cross contamination is a serious thing.", "business_id": "Ue9LjsXuWms-CMHMxqo3zQ", "stars": 1, "date": "2015-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "O4T_MAY13Hri1MZhJgT20w", "review_id": "YBHvDbBxh8JtW-3njP1Hog", "text": "They do take out and delivery! The pizza is tastier than most delivery places. The 10\" is a good size for an individual pizza. The staff was a lot of fun to chat with and answered any questions we had. We will definitely be getting food from them again.", "business_id": "qYuSoVBS_1i_btLzFefDeg", "stars": 4, "date": "2013-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KLGt1Pn0oyZQ-zam4J5gSw", "review_id": "RH9pq5pc1RkaajpY9HvWmA", "text": "Terrible!!!!   Shoved 7 of us into s 6 person booth in the kitchen and then we were shown every dish on the menu while our food took over 2 hours. Our waitress didn't even bother to show her face the manager had to wrap things up", "business_id": "SVKC_-gIQFkHElZ6bFsE6g", "stars": 1, "date": "2015-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OH71gTLUc2BduDdY069Yog", "review_id": "2ML0TC3MztYZGQUGSGbHsw", "text": "Brixx has some great selections if you know what to order. Their sandwiches can be so-so although I've ordered my fair share and my first week in Charlotte they were a major comfort (Fresh Mozzarella Sandwich). Their salads are pretty nice but their pizza- yum! I've tried all the veggie oriented varieties except the Pear & Gorgonzola Pizza\nwhich is next on my list. The location is perfect for when you're wandering uptown, maybe perusing the library, and hunger suddenly strikes. If you're looking for a cheap slice, you may want to go to Fuel, but if you're looking for something more enjoyable, try Brixx. \n\nOne drawback to Brixx... there is smoking inside, at least the last time I was at this location which has been awhile.", "business_id": "kAid56AY_laxGYslMdsYJw", "stars": 4, "date": "2008-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pht7aDmPvqfO4gT7EJY4Pw", "review_id": "kAfKD_zUT4OzaEgviAe8Iw", "text": "One word, ugh. In dire need of upgrades. Dirty floor, cardboard pizza. Need I say more?", "business_id": "kAid56AY_laxGYslMdsYJw", "stars": 2, "date": "2015-08-10", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "Cfm9NdwP8GZB9lMXt7IdhQ", "review_id": "4059vrZGJPUyob6zMarR_g", "text": "A friend of mine was stranded because of the CLT airport fire, and while this location had on the web that they stopped delivering at 11 PM (and a nearby Pizza Hut refused to provide service, though they were listed as delivering until midnight), they said they could do it, took the order, let me pay for it (so my friend wouldn't have to), and were very accommodating. We'll see if the order comes through, but I can't fault the customer service! UPDATE: The order arrived promptly and was hot. Excellent work, PJ!", "business_id": "z4KtKRuuwU6eJAI68ChE-w", "stars": 5, "date": "2013-07-24", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "UqygoyjAGtjeM7XXRkUU3w", "review_id": "InWOeNwfo2NTdm0LQAPPig", "text": "Karen T. is obviously a self absorbed negative nancy.  Tell me what a sports bar should look like.  The decor is fine and whoever the server was probably reflected the bad attitude that was presented to them.  The food is great here.  The wings and pizza are far superior to those in most sports bars.\n\nFor the record, I don't work here but I am a fan of the joint..", "business_id": "3xdV-7di_YD3MVqs3Pa7-g", "stars": 5, "date": "2014-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "c-xWKWVBMBLBR_25LuQ-cw", "review_id": "8yoZpa8hllfJnh7-nUBmrw", "text": "I've been there a few times and the hubby and I love the place. It's inexpensive, never busy, and the staff is always personable. Our bill is usually less than $25 for both of us.\n\nThe menu has something for everyone. Subs, pizza, wings, Italian, and some Greek picks like the Chicken Pita are listed. The hubby likes the chicken parm. and I like the chicken pita. \n\nIt's worth a visit if you want a quaint non-frou frou local place to have a quiet meal.", "business_id": "-2NCvK5807Nxs9GUb2Eo1g", "stars": 4, "date": "2010-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h93HvPC1tFP8HeczT_ySuw", "review_id": "v7cNLtvfFQ2eiR8m_NeiJw", "text": "Yes, it's the place where we stop for pizza for convenience -- it's on our way home from work, it's cheap, it's simple. Do they always get our orders right? No. Do some of the staff there need a lesson or two in customer service? Absolutely. Am I going to stop going there as a result? No, it's too convenient. \n\nSo, if you're looking for a notch above a frozen pizza, go for it. If you're looking for a cheap alternative to the newly closed Little Caesars, definitely give it a try. If you're looking for your order to be perfect, or gourmet, or a friendly experience, I'd go elsewhere.\n\nCan't beat the 2 medium sized 2-topping pizzas for $5.99 though.", "business_id": "KTqNU4plO23583DYAMGXYg", "stars": 2, "date": "2014-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 5}, "user_id": "2nP4V3CUSU4AylZt-nCE-g", "review_id": "0q9hS9GWxRIYOd8B4g-Oww", "text": "Bucks is a gem without a doubt. If you like good Milwaukee/Racine style pizza you need to eat here. Like order right now here! If you like NYC or Chicago pizza...you *may* be best ordering elsewhere; although I maintain hope that someday you appreciate the awesomeness that is square-cut, thin-crust, pizza. \n\nKeep topping choices to 2-3 at most to ensure crispy crust, tip, pay in cash if possible, and always make sure to bring a 'helper' if ordering more than two as these pizzas are not stackable - but then again my best advice is to park, order, grab a cocktail at Jade Monkey or the VFW, pick-up and go home very happy!", "business_id": "QfCHvy6v39xPH7CvCASlFg", "stars": 5, "date": "2015-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2FrxzRyT4_NmutHS9nfRNQ", "review_id": "-l0A7LpFUYgV3DblddMWTg", "text": "Slow service and bad food. The pizza is just ok. The appetizers are frozen and low quality. Service is always slow and they constantly forget basic things like straws. The family environment is nice for kids or big groups.", "business_id": "MSMdhoUraQ0DLLwmLbM28A", "stars": 2, "date": "2015-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LQA6_s-oGR8BMZw0ojTL-Q", "review_id": "pHcKZEp7ce0cdjTyEvEzLw", "text": "First off let me say that I am definitely a city girl so restaurants like Esquire are not really my type. I have dietary restrictions and I need to be picky. I came here with my mom and sister to grab some food on Sunday. It seemed to be the only place open. I ordered the portabella mushroom sandwich (super bland), my sister got the chicken salad (she said it was pretty good), and my mom ordered the salmon.\n\nOverall the food was nothing special to me however coming from the city to this little suburb area the price for the food was pretty amazing. The salmon only cost $7 and it was a fairly big portion. \n\nThe servers were nice but the atmosphere was too load. I wont be back here but that mostly has to do with the lack of food options.", "business_id": "pPWre8lbVAssER6CN0uWMw", "stars": 2, "date": "2012-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lzu5sYkqKRYDHnGGDlHcWw", "review_id": "3w9IoOVjTTWIZeNG13ZGfA", "text": "I have always ordered pizza from dominos and the delivery have been so so. I'll get my food and it'll be okay warm and okay good. That's also might be due to the fact that I always get the same stuff. But TONIGHT I got something different. I got a hot sub, bacon and ranch sub. The delivery was really fast for once but the best part was that the food was super hot. It he food was so hot that u couldn't even touch it. Never have I ever gotten delivery that was super hot.  It was SO good ;-) extremely satisfied with the service and food. Thank you.", "business_id": "x5Mv61CnZLohZWxfCVCPTQ", "stars": 5, "date": "2014-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8LMW4upaiwDBsDVwttCkRg", "review_id": "ZtVV_jf-7RHqm5jks27z8g", "text": "Awesome  awesome totally hit the spot.were from nm and tried it.it was so good.wasn't that expensive.way better than where we ate in the morning.", "business_id": "JN2qXIuDXnV2d8WnSqd28A", "stars": 5, "date": "2011-06-04", "type": "review"}
{"votes": {"funny": 1, "useful": 7, "cool": 7}, "user_id": "CbtlzjG8Vfvh5cal6N82Nw", "review_id": "j4aX57yJ6ljaVVK-bDG-tA", "text": "The best sandwich I've ever had is hands down Chris Bianco's amazing housemade mozzarella, local tomato and basil sandwich. All his sandwiches are delivered on amazing pane (Italian bread) with ingredients of the highest quality - as at Pizzeria Bianco. If I stop by with less hunger I usually go for the house made focaccia, the pieces are large enough to practically be considered a slice of deep dish pizza. They're topped with a different combination daily and are heated in the wood fired oven before being wrapped up - it's amazing for half the price of the sandwich.\n\nBe warned that seating is only outdoors, but the tables are covered by shade with water misters. So depending on the weather this usually isn't that big of a deal. And if you are really brave you may venture next door into Lux for a cool drink and an escape from the outdoor tables.\n\nThis is a wonderful spot for a casual lunch or for bringing people from out of town. The lines are not nearly as long as they are at Pizzeria Bianco.... yet.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2008-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Kqvfep2mxS10S50FbVDi4Q", "review_id": "Y0LT3MLffmJKFru4YElEXg", "text": "I stopped in here for lunch on the way to a Dbacks day game.  As mentioned by others, the tomato, mozz and basil sandwich is awesome.  I sat outside at one of the picnic tables and enjoyed every bite.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2010-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Wh5pL_iTBOj3R4W7cJWEkw", "review_id": "VHg238vDN1U8U2tj1oAohA", "text": "Tomato, mozzarella, and basil. ENOUGH SAID!", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2012-08-06", "type": "review"}
{"votes": {"funny": 11, "useful": 17, "cool": 13}, "user_id": "8p4at4zdzCpueAmSBaorZA", "review_id": "FagDoOSsG7v58sMGdqp50g", "text": "I have been coming to Pane Bianco since before the twins were born and before they expanded.  I love my fresh Mozzarella sandwich.  I had an appointment in downtown PHX, so I could finally get a fix.  It had been a few months since I had been able to go and get my sandwich.  I do agree with Iain B.  $10 for a sandwich is pretty hefty, but I cannot help but stop by when I am without the twins.  I was able to sit down at one of the picnic tables outside, yes it was hot, but that is why I live in AZ,  and enjoy my book while I ate my yummy treat.  My husband usually gets the Market sandwich, I had a taste of a few, they are really good, but nothing beats my choice.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2013-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sLZuscDKQ96pp-JrJDmp2w", "review_id": "xCGXluPAjh7x2xwZD1UBzw", "text": "I love everything I've had at Pane Bianco. Their food is fresh and delicious and the place is absolutely adorable. I was disappointed that they do not serve their pizzas at lunch time, and I do wish that they had a cheaper side salad to go along with their entrees, but other than those two small complaints this place rocks!", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2014-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "PJKOLtLjDpt9ETrJAPb-YQ", "review_id": "PEva0oPNJghrUh06oPxhjw", "text": "I went to Oregano's when I was visiting a friend in Phoenix. I had looked online to find what was considered one of the best pizza joints in Phoenix and kept seeing Oregano's pop up on lists. So we went. I remember we had a pizza and a pizzookie. Both were good. The pizza was tasty but the pizzookie was spectacular! I only recently discovered that Pizzeria Uno in St Louis has a similar dessert on their menu- thank god!\nBtw, Phoenix was lovely in general!", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 4, "date": "2008-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "xlhOYJz88hseqBnygHVz6g", "review_id": "Hvepnf9mU8uVzhnS5_gJbg", "text": "Well, I went back to Oregano's today because I had a gift card and I am a sucker for free food. After my last experience, I decided to try different food. My friend and I arrived promptly at 11 and was immediately greeted by every employee. We started with the sweet potato fries. They were good, but the aoili was a little spicy and didn't really go well with the fries. Of course the best sweet potato fires are at Delux, but these were pretty good for a pizza joint. I got the stuffed pizza lunch special. It was good, too, but nothing to write home about. Then we got the best part of the meal: dessert. We ordered the cookie pizza thingie. It was great, it came out warm and gooey with vanilla ice cream on top. Overall, this experience was far better then my last visit to Oregano's. Would I eat there again? probably.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 3, "date": "2011-06-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8SQEVAuT0iNmV8pOYoDdTg", "review_id": "nv10FXaSIDBsOEcpmSgRFQ", "text": "My girlfriend and I came on the 4th of July and had a great time. There was a wait to be seated inside so we opted to dine on the patio. The mist wasn't very strong but we were fine in the heat. We ordered the sproccoli stuffed pizza, unaware that it takes 45-60 minutes to cook. Our waitress, Dru, was extremely friendly and attentive and made sure we were comfortable during our wait. We also got a small dinner salad with house italian. It was delicious and a decent portion. Finally our pizza came. It was huge! (we ordered the 10'). We really enjoyed it, but maybe not for such a long wait. However, our time there was enjoyable and the staff is always very welcoming and helpful.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 4, "date": "2013-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "ak5e0BmTRYJ9Xb4bx_LcIA", "review_id": "IgOv_sKsmZy0cs_8dSXF9g", "text": "While I would normally rate this restaurant with five stars, this week's experience was so disappointing that I writing to warn other patrons.  I had surgery Monday and was in pretty poor shape.  The following day friends offered to bring me dinner and the thing I craved more than anything else was an Oregano's Favorite Salad.  \n\nMy friends ordered take out and brought dinner to my home.  Much to my disappointment, instead of the amazing salad I usually enjoy when eating at the restaurant, I got a container of iceberg lettuce with a smaller container of shredded chicken.  NONE of the normal ingredients (other that then iceberg and the chicken) were on the salad.  It was awful, if the iceberg had been missing literally nothing else would have been in the container.  \n\nNeedless to say we were all very disgruntled, but given my post-surgery state, no one was able or wanted to drive all the way back to the location to get them replaced.  We all ordered the same salad and all received the same lackluster container of lettuce.  Sooooo disappointing - I will never again order take out from this restaurant.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 1, "date": "2014-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f2DaPra5riUApMbDHM13nQ", "review_id": "Eh_bjyvO5q27qNAkeSYw0g", "text": "The food was tasty, but my meal was overpriced.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 3, "date": "2015-08-06", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 3}, "user_id": "0dgQa81w5it1PMpGpC_L0A", "review_id": "lw8fdvX4Yzp5lxSvV4zNvQ", "text": "Not bad!  The fam and I went out for dinner tonight, and the Husband was happy to discover that Pizza Heaven not only has gluten-free pizza, but wings and pasta too!  A gluten-free trifecta!\n\nIt is great to have so many options, and the pizza and honey-hot wings were fairly tasty... but it wasn't anything extraordinary.  Just a basic casual pizza spot, where you won't be terribly embarrassed if your 4-year-old throws a temper tantrum.  Umm.. not that that happened to us, or anything... \n\nThe highest point was the service.  Our server was incredibly attentive and took great care of us.  Thanks!", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 3, "date": "2010-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LHDOSzJYOqTBIoOif8mj2Q", "review_id": "UZeAOSvfDHvFiryCL9c3qQ", "text": "Awesome Wings. Perfectly cooked, and nice and hot. Pizza was Brick oven cooked and all of their meats and ingredients are fresh made in house. Check it out!", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 5, "date": "2014-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "h7-lk_BmctsFjcO79G7jWg", "review_id": "QPjVIPvrpPmniS7L6so04A", "text": "I ordered through Eat24 and while the delivery was pretty fast, i was not in heaven with the food.  I ordered the 4 piece wings, spaghetti & meatballs, and Vegetarian Vegan pizza.  The wings were small and overcooked and the bbq sauce was a very dark color that alos looked burned; not very tasty.   Secondly, the spaghetti & meatballs was bland - I had to add my own salt, and the meatballs tasted like they were frozen and not handmade, they were watery on the inside.   Lastly, the Vegan pizza was horrific! I didn't even finish one slice!  The sauce was bland, the dough was tasteless and the slices could barely be pulled apart.  The veggies ontop didn't have muchtaste either and I definitely bit into something bitter.   They threw old wilted basil all over it and it wasn't even fresh green basil - it was gray.  And anyone that know anything about cooking knows once basil loses its color and then gets cooked it will taste bitter.  I feel like I wasted the $30+ that I spent on the meal.  Will not be ordering from here again.", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 1, "date": "2015-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9SEV_ORT3gzUh_aibdhnSA", "review_id": "W4YWzWLBANtO68GS1Q85wg", "text": "Great place to go! We got 10 piece wings for an appetizer along with 5 breadsticks with a large BBQ chicken pizza. Everything here was exceptional. The space is perfect. A nice cozy place with great food. We paid $30.32 for everything.", "business_id": "auorqdHiATGZHVd-sd79ZQ", "stars": 4, "date": "2015-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IwSnmYCT8g7XFCl2Hoe6Yg", "review_id": "THcToWKbHAIxgQ-NZ7hOFg", "text": "Yummy food and nice guys making it", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 4, "date": "2011-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G5IPZRFtuGXVyl6mVPl2Sw", "review_id": "-Np97GP7yQUIIO4TIx5ojw", "text": "I had the Wall Street pizza and it was spectacular. My son had the Moll Street Meat Lovers and it was ok. My wife had the spaghetti and it was alright. Overall the pizza was above average.", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 4, "date": "2014-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "1ROTK8XOMciTdUca-1-xLw", "review_id": "IfXB_dsJqsJz4KA0OTfZ4A", "text": "This place has good vibes all around. \n\nI discovered them through Groupon, and because they're right down the street from me. The restaurant is tucked into the corner of a shopping plaza on Camelback & 20th St, right next to Fry's. \n\nThere are a few different options for dining here. You can order at the counter for a grab and go option. I saw quite a few people come in an pick up orders that they called in. They also offer delivery. Of course there's a dine in option as well. They have a small bar where you can sit, as well as indoor and patio seating too. After coming here twice, I've had an overwhelming feeling that the tables inside are in desperate need of reorganization. It feels a bit too spread out in there. \n\nThe service has been good on both occasions that I have gone. Everyone who works in the restaurant seems to be very friendly and welcoming. I've only been on weekdays and both times I think the bartender was also serving as a waitress which made things a bit held up when the restaurant unexpectedly filled up around 8 PM on a Monday night, but the staff handled it well and did their best to make sure everyone was taken care of.\n\nThey have a decent draft list of beers, about 5 options, with one of them being an NYPD custom beer. Some happy hour specials too which included discounted beers and pitchers. \n\nAs for the food - I have tried a few different things. The garlic knots, bruschetta pizza, bruschetta appetizer, and penne ala vodka with sausage and peppers. All of it was very good. The portions on the pasta are BIG! Not that I'm complaining, I love leftovers. I want to try the dessert because they look incredible and they seem to have a variety of options.\n\nI'm so happy to have a great pizza place like this nearby and I plan to return in the future.", "business_id": "TqHTtjPANCBKGsjGBjDoQQ", "stars": 4, "date": "2015-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "U4C5z-Au3t9kfFxzW4EGTQ", "review_id": "6bWI9R5O0oiXxd1DTlS6Zg", "text": "The food was amazing and the customer service from Courtney was one of the best she is amazing!! Also the manager of the restaurant came out and greeted us as our first time guests and treated us with a special entree free of charge. So after all this restaurant is definitely a 5 star  I recommend this highly", "business_id": "ut-kla-EA23nJOij_dcL0Q", "stars": 5, "date": "2015-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tCmalR4gJQIpajxH2ULNvg", "review_id": "0WxsOJrki61-xCpFZuCPzw", "text": "Had a lovely brunch here. \nLovely omelet with ham and Gruyere cheese.", "business_id": "oc0Wl6ktfMLb5VZ2Uz6M2A", "stars": 4, "date": "2012-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "edHCBnPhZ1qNTKM6HoSGSA", "review_id": "vw-OGCOw7HOX618IZLZbWQ", "text": "I'm not sure what the fuss is about.....especially an overall rating of 4.5. The coffee's good (which is why they get 2 stars). Service is okay and the ambiance isn't quaint when cleanliness is questionable. I stopped by for a weekday breakfast and there were not any patrons in the bistro. I sat myself and ordered off a very limited weekday/breakfast menu. The mini croissants and jam were oily and not airy or light - obviously the result of a microwave. I ordered the \"build your own\" omelet. Looks good on paper but had to be sent back due to the absent Gruyere cheese. Should of just kept the original one since the added Gruyere did not change what would and did prove to be a very blah entree. The bacon was okay but definitely reheated. There is nothing French about this place - the French cook with fresh and tasteful ingredients.....maybe their dinner menu is better.", "business_id": "oc0Wl6ktfMLb5VZ2Uz6M2A", "stars": 2, "date": "2015-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hgU5U7-CoeL0VTYxGiiARg", "review_id": "wDoe9LxgXYD4Z4Xup39TNg", "text": "Order was almost 30 minutes late.\n\nDriver was standing outside of my building and couldn't get in, even though I have specific directions over the phone.\n\nRude employees and told me I wasn't allowed to order from them again. Like I would, everyone working there is a half wit.", "business_id": "jHte0SjUldZeDDZ5py0ZhA", "stars": 1, "date": "2015-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FLtIvthFtPUlc1204LHAJQ", "review_id": "A1UzvnyZDlp6f-QzUDpqkg", "text": "I hadn't tried Pat's in a while so my boyfriend and I decided to order it this last Saturday night. Unfortunately, it was awful. The sauce was missing!! It just tasted like dough. My boyfriend couldn't even finish it and he is not a picky eater. We will never try Pat's again, especially for the price. I recommend Stumpy's or NYPD. What a waste of money!", "business_id": "GvwDppcJLm9lso9iS2hSIw", "stars": 1, "date": "2014-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nX8uAoc0_PgIc1YBhfW7zQ", "review_id": "psal9lDngM1aBNjDAiLVaQ", "text": "Oh my god, oh my god. Where have you been for my entire pizza eating life?  Spinatos is great!  I love the spicy Italian pizza and the ... Mamas spinach is what I think the pizza is called. I have not dined in, but I will be making up for that soon... I promise. The quality of the food and the friendly family feeling service is great. Although not an artisan pizza place like the Parlor or Bianco, this is my go to place for pizza.  Who needs Pizza Hut or any other delivery chain when you have a great pizza place right around the corner.", "business_id": "YldXB1hRpnE1CWLF3mvgpQ", "stars": 4, "date": "2011-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jdf3Djkxa6YQjhyd_YCCXQ", "review_id": "zq22S6f8_-FE8gvJtoZq-w", "text": "We went to Spinato's tonight for dinner. I really can't say enough good things about the food and service. I am from Indiana. There is a pizza place in Indiana and Illinois called Aurelio's. The pizza there is superb. Apparently, Mr. Spinato and Mr. Aurelio worked together in the pizza business, and opened the first Spinato's in AZ together. My mother is visiting from Indiana, and I wanted to taste pizza that reminded her of home. She loved it. We all loved. My mother and I split a medium pizza. My half was Mama Spinato's signature fresh spinach and hers was the Chicago. My husband had a medium Nicole's new favorite. All of the pizza was amazing. Before dinner In ordered a dinner salad. I figured it would keep me from devouring my whole pizza. The salad was also really good. Throughout our meal, our server, Madison stopped by frequently to ask how things were and to see if we needed anything. She was the best waitress we have had in a long time. All in all, it was a great experience. We will definitely be back!", "business_id": "YldXB1hRpnE1CWLF3mvgpQ", "stars": 5, "date": "2013-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kf3sKt6ZooHPbFVW2CYAkA", "review_id": "VB9LwFBnRhm_UoikgRPkYw", "text": "Great wings and great service, was worth the time to check it out, and they had Stella on tap!", "business_id": "rwT9wCyXNATA36yqcb4JSg", "stars": 5, "date": "2015-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rjOQz8t0wIjYz-aN8ePkcA", "review_id": "mpbQaiJjOu2ce1GGwDfLSQ", "text": "The pizza was hand tossed but the crust was perfectly crispy! The flavors were perfect too. I had the small which fed me (Im a big guy) but could have fed 2 people. I also had a 6 piece of hot wings which were very good! I would deffinately go back here again.", "business_id": "kxDGexkbP30fBvxVI0CzFQ", "stars": 5, "date": "2013-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Of50-b8ZDT2JWsh7PLWObQ", "review_id": "OmQoyd-0sy78W_HOvvv-Qg", "text": "We were staying at the Pointe Squaw Peak for a staycation and wanted pizza. This place came up and sounded great! Pizza was delicious and the wings were yummy! We will definitely return again :)", "business_id": "kxDGexkbP30fBvxVI0CzFQ", "stars": 5, "date": "2015-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "n5ZkOH5yiFcL2w1auTCykg", "review_id": "-PpGrkr_5HTBes4ibrQihQ", "text": "My go to place for pizza in this area. I usually get the pizza & wings special but stop in once in a while for just 2 slices. The pizza is cooked just right, not too greasy. Plenty of pizza options and a great selection of other italian dishes. Good prices. Friendly service.", "business_id": "V3lQtk1LgwAEcF9j-BzchA", "stars": 5, "date": "2014-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "T-sxoTvPKWC7LFcY1wTgaQ", "review_id": "PVDNKJzKvbt0zUbFzyTHgw", "text": "Everything here is just ok. Came in right as the lunch rush started, with only one server... And he was trying his best doing rounds and being as attentive as possible. Food was mediocre at best. Seemed like run of the mill ingredients and bread. The pizza crust was was good and fluffy with a bit of bite, so that was good. But the sandwich was boring, I felt like subway was doing more exciting things than them, and I ordered the number one, their signature or something. Again my server was doing his best and treated us well, he could have used some help but the woman behind the counter wasn't stepping up to the plate to help out. Kitchen kept banging food out without issues, my food was correct, as was my son's, and I didn't see anyone's plate get sent back. I think of they used better ingredients, and (now I'm just speculating) a fresh bread from a local bakery their sandwich would've have need amazing. I can see myself coming back for beer and a slice because it's still better than most restaurants in this neighborhood.", "business_id": "rGHktXbee4CErLsMrPqbrA", "stars": 3, "date": "2015-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2kceAwjbj3I9XOeQPF3lMw", "review_id": "2MrXpEeT8J2NFmDrLWAGIw", "text": "Thanks again to my Yelpers. I live like a block from this place and never thought to try it because Pizza can just be pizza sometimes. I LOVE pizza too!. Its hard to find a good joint. \n\nWe went there on Friday night for some pie and maybe some dessert. \n\nGood service. Good people. Good food. We had the Get meaty and the Spicy Italian. Not sure which one i liked better. Both were excellent. Fresh ingredients and it was hot too. The brownie dessert was pretty awesome too. \n\nKen stopped by our table and had a nice conversation with him about Yelp and how we found his restaurant and how I would go home and yelp about Spinato's.", "business_id": "pF7uRzygyZsltbmVpjIyvw", "stars": 4, "date": "2010-08-09", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "9IoWmskJG2sz7hEFAfqV3g", "review_id": "8ULUi4xtSEyjZQTogMBQXw", "text": "We came here one night for pizza and had an unpleasant surprise.  The pizza we had was so incredibly salty that after a piece I just couldn't eat anymore.  My mouth felt saturated with salt the entire evening.\n\nThe waitress was very nice.", "business_id": "pF7uRzygyZsltbmVpjIyvw", "stars": 1, "date": "2013-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iGiRZ8uwfKRYSWQ6Fq_Cew", "review_id": "nKipYLE0iexNbTw5KgW02Q", "text": "Everyone loves pizza and this place does it right! My favourite dishes to recommend are the spaghetti calzone and the bruschetta.", "business_id": "pF7uRzygyZsltbmVpjIyvw", "stars": 5, "date": "2015-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pJzT55DX3p7xuHwQKyMXvA", "review_id": "seJhiUJ4TvTCfe666U6sSw", "text": "This pizza was ordered at my job. Their pizzas are on point. The fennel thin crust pizza was the best pizza I ever have eaten.", "business_id": "pF7uRzygyZsltbmVpjIyvw", "stars": 5, "date": "2015-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6HnWMUP6wUuN74algFeaBQ", "review_id": "zJMnt4RGnfC4oZQ6hc4APg", "text": "Nobody can beat Uncle Sam's when it comes to bang for your buck. This is even more true during happy hour where the prices are insane and that runs from 5-7 & 7-9. Can get very crowded and is a bit old but it never bothered me and I think it adds character. Food is hot and the drinks are cold.", "business_id": "lf42gtgq_2_jPvjfp_K1nQ", "stars": 4, "date": "2011-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_eu3DlHj-bE50Z8wbXj1kw", "review_id": "1SrWNFnjYyX5LO5LcWvePA", "text": "This place is absolute garbage, had some friends in from out of town and all they wanted to do is go here. Haven't been in here in years and always remember it to be really good. So we order our food and the cheese steaks were dry and cold, not to mention the fact I bit into a bone on the second bite so I was done with that. My wings\nwere not any better, they were black on the inside with lots of veins, just gross, frys were cold, service was awful. Typicall teenager not interested in working. We asked for a manager and she came over and we told her about the food and she did take off the cheese steak but not the wings because I ate the 5 that were ok. I told her to look around this place Saturday at 7 o'clock and there are 15 people in here, there obviosly a reason this place is dead. Poor service and horrible food. Would not surprise me to see this place shut its doors. I remember this place always being packed and far better food. So save your time and money and go elsewhere.", "business_id": "lf42gtgq_2_jPvjfp_K1nQ", "stars": 1, "date": "2015-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pNxzP47yVRPH0qwO4sSbAw", "review_id": "_lOiE7OykXyVOAnnNBoGkg", "text": "When I have a hankering for Italian cuisine, I pay a visit to one of my two favorite Red Devil Italian Restaurant & Pizzeria locations (3004 East Bell Road, Phoenix, AZ 85032 / 3102 East McDowell Road, Phoenix, AZ 85008). I traditionally order the large Antipasto Salad, which proves itself to be a full meal for a \"hungry man\" like me. The robust salad is loaded with radishes, capicola, artichoke heart, roma tomatoes, provolone cheese, pepperoncinis, black and green olives, genoa salami and roasted bell peppers. A complementary basket of warm, freshly baked rolls (yummm...) is provided to each table. The restaurants are geared toward hosting parties of all sizes (families, large groups, couples and singles). Parking is readily available and the facilities are clean. Auguri! (Best Wishes)", "business_id": "0gQrhOYWdO0XVZEKtOrvaA", "stars": 5, "date": "2015-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4zlYQ3KRDlxPTAIGex1YwA", "review_id": "Tq6v35DY0PeMVikIOyLDRg", "text": "Always stop by when im in the area.  Great pizza and sandwiches.  Super cold beer..great draft selection..friendly fast staff ....wings are baked not fried..super good flavor... cool lil spot fir a quick beer ir a big dinner...good prices too...even have pacman and centipede lol", "business_id": "u5o4H8h0sIVhqa8Lcusi5g", "stars": 4, "date": "2015-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cQnkPwSCBnjNEuBI7juEzw", "review_id": "LvhfftIdS05cKWA0ZXCmaA", "text": "This is my second trip to Gino's. First trip was absolutely fantastic. Ordered my pie, stopped over, picked it up, and had a great conversation with the dude working the counter.\n\nSecond trip?\n\nOrdered online.  Made a stop at Walgreens being that I was told by the site that it would be 25 minutes.  Stopped in, no pizza ready.  Instead, I was told they didn't make it because I didn't answer the call they made to me.  I checked my phone right there, no missed calls.  I was all \"Alright, dude, no worries, cook me up a quick pepperoni, canadian bacon, and green olives\" which he was happy to do.  Told me it would be 10 - 15 minutes.  25 - 35 minutes later, pizza is done.  Get it home, no canadian bacon.  I even tipped those assholes thinking I screwed something up.\n\nGo somewhere better.  While waiting, I saw them opening giant cans of pre-made pizza sauce.  They may have been around for 40 years, but buying store-bought pizza sauce for over priced pizza doesn't make much sense.\n\nOh, and chop your olives up, you lazy twats.  Like on the first pizza I had from you.", "business_id": "NTgVdfRLbU0aKJH_9h3VCw", "stars": 1, "date": "2014-06-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "_PzSNcfrCjeBxSLXRoMmgQ", "review_id": "NkY4Nn5A_ukKMrUwwv-hVg", "text": "It has been over 1 year since I have been back and the pizza was so good, why did I wait that long????  Four cheese thin pizza!  OMG!!!!  It is cooked (or baked) to perfection.  I literally could not stop eating it.  Nom, nom, nom....  I did share with Lou, she liked it too!  The place is nice, clean, open, and bright.  The service is always great!!!", "business_id": "RYZ08XAToBaN-bS5HHVEhQ", "stars": 5, "date": "2011-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "R_j94nvCGI3GpjLXy0zH0w", "review_id": "B4efy5sl1cujoBqTSWpHCA", "text": "Pizza lovers & pasta lovers this the place for you. The service was good. Portions were large enough to share. My boys had burgers that were to die for.", "business_id": "RYZ08XAToBaN-bS5HHVEhQ", "stars": 4, "date": "2015-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lurznoz_56tPKDziR_dvdw", "review_id": "aozNJeTSE-pOexckKWSn9A", "text": "Excellent place; friendly, family run and great fast service. It's a quaint little restaurant that makes it feel very comfy and homey. \n\nI have only had the pizza twice, and it is very delicious! Fresh, thin crust, and not overly greasy. Price is very competitive.", "business_id": "hgb1RihLYRSpFBjBhn8rZw", "stars": 5, "date": "2010-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "hFG1Lira7tL_PElq6bdAAw", "review_id": "rWashzDeTPpGt-a00HKzSA", "text": "The long line at CPK for a weekend dinner is testament to the triumph  of good location over mediocre food and not very good service by the  frazzled staff.", "business_id": "UpYva_zhJ6pRGfdTruIYIg", "stars": 2, "date": "2008-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y8-O3KMMdWlCP8dqYq40bw", "review_id": "W60iT4U1SQpzOP_nCd60jg", "text": "After ordering pizza from this location at least 2-3 times per month using their on-line website, we decided to order tonight.   We've been good customers and tipped at least $5 per delivery.   I had a super busy day and just didn't feel up to cooking so  I ordered our pizza on line, as usual, and about fifteen minutes later I  received a phone call from a sympathetic clerk saying that she was sorry, we are no longer in their \"delivery boundaries.\"   Way to reward loyal customers Domino's.   Luckily, I found out that we are within Pizza Hut's \"boundaries\" and their pizza was delivered within 30 minutes--cheaper and better.", "business_id": "lOJ4sMs1EIZzqBV7duiO6A", "stars": 1, "date": "2014-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_FBmWTiq37OphKPtLZNfMw", "review_id": "pK9lEmR2afX_ePSptJKuOg", "text": "This is my initial review of this place so it might change with more visits. I tried this place for the first time this past weekend and we had a pepperoni pizza, garlic knots, hot wings, and fries. Everything was brought out quickly and everything tasted on point. I got to give them kuddoes because some places have good pizza and bad wings, but this place had both. Great customer service. We will be coming back!", "business_id": "m3O2EFVs3eo8s40MGGzmsA", "stars": 4, "date": "2014-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mICp2bqrAhs-WwX55KieNQ", "review_id": "CVmDguFL3CXOB4-q_pfXvQ", "text": "Love the ReUnion Thursdays.  It's the best 80's music in the Phoenix Area.  It's great to dance and watch movies on the big screen from back in the day.  Reasonable drink prices and really good food.  I highly approve and I'm glad it's every Thursday too.", "business_id": "Cp5_NSJFNgylD5SUdmT8nQ", "stars": 5, "date": "2011-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "0hKFvWnpaVWbRh53ATIgNw", "review_id": "TkxGxCAqL0LWA19OYlZn8A", "text": "Very disappointing.  First, I really hate that they walk you through the kitchen on your way to your table.  It seems so unsanitary.  \n\nThen, as soon as we sit down, the up-selling starts.  I really, really hate it when a server goes over and over the drinks and appetizers trying to up-sell you.  I can read a menu.  I don't need every drink and appetizer described to me.  Same thing with dessert.  I understand that you see my children and think that by going on and on about the desserts that my children are going to beg and plead to get dessert and that I'll cave.  Nope - not going to happen. \n\nI had the bruschetta and it was such a huge disappointment.  It was chopped tomatoes slapped on top of a huge loaf of garlic bread.  The best part of real bruschetta is the crispy, toasted bread followed by the garlicy tomato topping.  This was nothing more than diced tomatoes with no seasoning on top of a huge loaf of bread - the result was bland and mushy and nearly impossible to eat.  seriously gross. \n\nWe then had the chicken pesto pizza.  Again - gross.  It was positively dripping in pesto cream sauce.  It had so much sauce on it that the cheese on top slid off and the sauce dripped all over the place.  Really, really unpleasant.  \n\nAlso, we were there at 4:30 so the place wasn't busy yet but, the service moved at a turtles pace.  Maybe it was so slow because the server was up-selling every other table as well.  On and on and on.......about the appetizers, drinks etc....  \n\nOverall a huge disappointment.  I will not go back there again.", "business_id": "sllZXXYijYUs-n80uSa96w", "stars": 1, "date": "2011-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "JlGljbltXkHWZONSzhYjnw", "review_id": "iYdg8hd4LwP6DQlMTXYexg", "text": "Little Ceasars has gone back to a simple menu and kept prices down. Really good place for a quick $5 pizza. Staff seemed overwhelmed, but very friendly. Do note, this is to-go only, no delivery or dining room. Would definitely stop here again", "business_id": "NNRUSPcXr3lGpcaaA3-Epw", "stars": 4, "date": "2012-08-01", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Q6H8EfK1mAfQ1nB6GSeMTg", "review_id": "2KfEsnq81BB6kI-i21R73A", "text": "If you're looking for some good old vintage music, this is the place!  Not many organs like this left.  Pizza is average, but that's not the point.  Its all about the organ music!", "business_id": "VRxelK__tuQD0KBxx2LzeQ", "stars": 5, "date": "2013-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7oqsyjcgzchonHTTh7rfBA", "review_id": "F7DKwJTj4BCxIhM9a5JdJA", "text": "Very fun and unique experience. Good pizza and ice cream. Great family joint. Only problem is cash only and sometimes it is tough to get a table.", "business_id": "VRxelK__tuQD0KBxx2LzeQ", "stars": 4, "date": "2014-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TLTS1OM2M2gaXbSbd6k0cA", "review_id": "GfGPi_UcJmmHGGW1KvZEaQ", "text": "VERY RUDE!! My boss ordered pizza for us working late. He had to leave to get some tools and come back. Pizza guy STANK bad and he wouldn't give us our pizza order. When called to get our money back that night a lady said it was already reversed and hung up on me. The next day my boss wanted to know why the pizza charge wasn't reversed like I told him I was told by Dominos. When I called the next afternoon I get a whole different story from a RUDE MANAGER named Amy. Her solution to the problem was to keep hanging up on me and not answering the phone when trying to find out what was going on with getting the money back since we were not given our pizza. This store is not professional and VERY RUDE!!!!!", "business_id": "Xqh9wCLzlt7ChkrV9BdR2Q", "stars": 1, "date": "2015-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SLZK36N9gEn3GtHfyaahfA", "review_id": "0WdZvM-KPvAnB8FezKz21w", "text": "It pains me to have to update my review from 2 years ago to a lesser rating. We have visited this place frequently since the review and this last visit had to be shared. The food and service we received this last time we were there was sub-par. I had a slice of pizza and an iced tea. Husband had chicken parm that he asked for without the pasta. My slice was good. Hot and crispy. Everything else was bad. Tea was watered down and tasted like water. Tap, not filtered water which is the nastiest water in America. The chicken parm was cold and came with more pasta than chicken. A little piece of over-breadded chicken that was sitting on a cold pile of pasta (that my husband asked to do without). Waitress seemed new and was trying her best, but it was a disaster.\n\nSo I guess if you order a pizza to go you will be safe. As for sitting down, I would avoid it until they fix some issues.", "business_id": "WTxfdir4ZTJLA6aq6N6HzA", "stars": 2, "date": "2015-07-05", "type": "review"}
