{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "1ToqCxhANlKXg5m8Mq6HyQ", "review_id": "UyOehgxktu9YRoaLSMYoBA", "text": "Went for lunch, the hummus was good, i had the eggplant which was awfully bland even with a nice tomato sauce.  no beer with lunch though (bogus!)", "business_id": "PxP19Rb88OQKiSMl2oWNsg", "stars": 3, "date": "2008-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "unnvLojxXbPhbqsq39GRIw", "review_id": "zqX_Yx-WNRF2cqFNi2H6Ig", "text": "I live in the neighborhood and I must have driven past Amel's 5 dozen times before saying Hmmmm...maybe I'll try this place out.\n\nI went out for my birthday dinner and would happily go again, and soon! It's a perfect place to grab some food if you are trying to eat a little healthier...it's also a great place if you don't care as there are a wide variety of menu options. My problem was that there was so, so much on the menu that I wanted to order that I by the time the server came by to ask again, I had to throw up my hands and know that I would have to come back many times to get everything I wanted. I also wasn't all that hungry. Always so annoyed at myself when I go to a new place that's actually GOOD and can't eat that much--the worst!\n\nI started with their summer beer on tap (I think it was the Summer Solstice) which was very good, crisp, and flavorful. My appetizer was grilled artichokes stuffed with goat cheese (awesome.) Since I wasn't very hungry, I got a soup and salad for my meal. The fattoush salad was very good and I would happily order it again. The specialty soup was a cold cantaloupe soup and it's why I had to knock off a star. It tasted mostly of sour cream, but outside of that didn't have very much flavor and I really love chilled soups! No one at my table enjoyed it that much, but as far as missteps go, it wasn't a huge one. \n\nEveryone else at the table enjoyed their meals and drinks without complaint. We sat on the patio on a beautiful summer night, which added to the experience. The shrubbery is situated just so, ad we didn't feel like we were right off of busy McNeily Rd. Parking can be a bit of a hassle since the lot is so small and shared with many businesses, but we just parked across the street. Not a big deal.", "business_id": "cESul2ojJOjadz-7BKB5eg", "stars": 4, "date": "2015-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "eE1dMYBjtTY2U2sNMbMajA", "review_id": "8ZRPde1cpoW-UbwCfBcMlg", "text": "Delicious donuts! I thought the vanilla frosted long john was on par with Greenbush's similar donuts. This should be your donut stop on the East Side. They also serve hot middle eastern food, which I plan to come back to try. \n\nJust make sure you have some time, even if you're just picking up donuts to go. There was just one person working the counter and cooking customers' meals so the whole process took awhile.", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2015-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IjafRfMSAQpInLlw-Vi0Cg", "review_id": "UYpZ071u4SkOZ7LEPX7OXg", "text": "Got a gyro here. I was dissapointed. small portions of meat, and a few pieces of lettuce and tomato, and WAYYYY too much sauce....It was pretty much pita and tsziki half the time..I had high hopes for this place. :(", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 2, "date": "2014-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "-JLDeGHE2Oh0hHQuyVuVLw", "review_id": "7_4iH3fh457x_11y20bQXA", "text": "Great food!  They have a wonderful option of dishes to choose from.  Family owned local business with great service and excellent desserts!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2014-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0uVqnhouGRH4dmzIYQkkag", "review_id": "i5zj5QlKtTgYfouMwnYFhg", "text": "The best Lebanese/Arabic food I've had in the metro Phoenix area yet!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-06-21", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 2}, "user_id": "iBO2m9xXivsIbvFnZHsNvg", "review_id": "iJRVMWVrxGtY13EmJ74MEw", "text": "I was looking for a middle eastern eatery so I found the other reviews to be helpful, & tried the place out. Yes, the owner is friendly, and the food was good, but here's what they didn't tell me... \n\nThis place isn't really a restaurant, its more like a fast food joint with tables. Sorry, I'm an adult- I don't do Styrofoam plates with plastic utensils. For dinner, we were the only people in the place. Wifey had a chicken plate, and I had 3 side dishes, all good, with diet Pepsi. Bill came to THIRTY-FRICKIN'-DOLLARS!!!!!!!!@#$%%#$@!&*^!!! For that kind of dough, I would have much preferred to go somewhere else.I'm not a cheap bastard, but I do expect to get what I pay for, like ceramic plates and metal silverware. I am still in search of a decent middle eastern RESTAURANT!", "business_id": "1zdwPAgiJFJhPeS3YIY09Q", "stars": 2, "date": "2009-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3zvGZizJ6kefgGoBNhdBEg", "review_id": "JbqbuoZeQJEDgY9Ws5hMPA", "text": "One of my favorite places to eat in the world! We have been going here for over 20 years and it's food is as amazing as it gets! The service is wonderful, the owners and staff are basically like family to us now. \n\nThe food is to die for. If you want a good place to eat, especially for nice dinners such as birthdays, New Years, graduations, etc., this is the place to go. I recommend trying the tomato soup as well. It's amazing.", "business_id": "Aicnm12Zped8nQFXyRRFvw", "stars": 5, "date": "2014-06-30", "type": "review"}
