{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "oc4Ne7SJo4WGdzbm6jtCXg", "review_id": "L05-qPgrJFnlcDZleJaNQA", "text": "My wife and I have been eating here for many years now. We almost always go for the lunch buffet and have eaten here at least 25-30 times now. The menu items change every time we're here so sometimes we like it better than others and range from really thrilled by the food to feeling it's ok but are never disappointed. The owners/staff are really very nice too and they serve you fresh naan to order. I am writing now after all these years because another Indian restaurant opened a stones throw away and I want to make sure you try Namaste instead. The service and attitude at the other are just this side of rude and indifferent. Yesterday, I had baigan bharta, chana masala, palak paneer, pakora, chicken tandoor, onion naan and masala tea and all were very very good.  I skipped the chicken curry, carrots/peas, rice and tomato soup but thought I would list them to give you an idea of what else they had yesterday.  All for $7.95. I hope you'll stop by and give it a try.", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 4, "date": "2011-07-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "65j7bRPXJUkrUCQ7XGteDQ", "review_id": "YTJTb7FnZdFLwxoSLhgOHA", "text": "There are two Indian restaurants pretty close to each other: Taste of India and People's. People's has better appetizers, and of course they have 1/2 off during certain hours, but Taste of India is better by far at entrees, and their masala tea is delicious. The nan is always hot, like hot hot, steaming hot, burn your hands hot, and perfectly done. \n\nChicken Tikka Masala leftovers are sitting in the fridge right now, calling my name. Everything is good and the portions are beyond generous. What is particularly striking is the pricing. Indian food in Orlando and DC tends to be expensive, and those are my frames of reference, but Taste of India is completely reasonable. Even bizarrely inexpensive considering the quality of the food you get.\n\nThe store front is odd, and the place never looks open, but don't be discouraged from going. Once you walk in you'll be seated quickly and served an onion and a mint chutney. Generally there is a young kid in the far back table playing on a computer or GameBoy.\n\nAt the end of the meal, your tip tray comes covered in an anise and sugar mixture with little pink, yellow, and white pellet things. I'm an addict, but always end up eating one pinch more than I ought, where the flavor becomes unappealing. And as much as I know this, I cannot help myself.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2007-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8ED8BPCXKXZnGsVMyl5Bhw", "review_id": "JdkQxwbS0-bTzJhyQ843PA", "text": "I took myself out on a date to celebrate the end of the semester teaching at ITT at Maharani last night. Before I switched teams to be a fan of Woodlands, Maharani was my favorite Indian restaurant in Charlotte. \n\nI enjoyed Maharani last night again. I had the Vegetarian Thali, which kind of gives you the experience of eating buffet even when the buffet isn't open. The whole meal was a little pricey ($25 with tip), but it was more than I could eat. I had leftovers today!\n\nThe service was friendly and fast, and the food was delicious (if not quite as fabulous as Woodlands). I prefer to go to Maharani when there's a buffet, so I wish it had been the afternoon. It's great for lunch!", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 4, "date": "2008-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "3ZEi3D1JRZsII13V65J9nA", "review_id": "W_kRaasmyNZN7fgd8Eam8Q", "text": "The worst Indian food I have ever had in my life. I never thought it would be possible to call an Indian dish bland, but it is possible with dishes like these.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 1, "date": "2015-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AtEx74m2W-rrgA4AMMSfpw", "review_id": "6I8lvFKy3xRSM5nrJ_O0hQ", "text": "At tha advice of the reviews on yelp, my family decided to try out this restaurant. Excellent food at decent prices.  If you like Indian food, I would highly recommend that you eat here.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 5, "date": "2013-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UeMX4z69M0IW7H9fyWWT8g", "review_id": "QAK3MCa38WMzuj6pcUbtJA", "text": "This place used to be much better, it really has gone downhill in the past year. Perhaps the best comment I can muster is that it's definitely better than Ambar, which  is really not saying a whole lot. But if you must have Indian food, and have no possible way of getting to Race St. in Urbana for good Indian food, then I recommend Bombay Grill.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 2, "date": "2014-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "TN6ZI_NNUw8OAvODoxTKCg", "review_id": "Y9yBAw_Dn-rnxwS7nKyeIw", "text": "Tongue is dancing in delight as my cravings have been satisfied with perfectly seasoned spiciness.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2012-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4aWHmwHU58DqzYFoLW3Q9g", "review_id": "hEVvfCyn31ZHjR_1oveIJg", "text": "Not the best Indian food I've ever had, but it was good.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2015-06-27", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "VCK3eQKToEkmu8jdSEbTwQ", "review_id": "zHTXi6FWyxlZnSbFPUdixQ", "text": "What can I say. The ambiance is fantastic. The restaurant is clean. The service is friendly.\n\nAnd the food...spectacular. I prefer going during lunch for the buffet...which is a rarity for me, since I typically loathe buffets. But this restaurant's buffet is packed full of flavorful choices; from the chicken to the vegetable or potato pakoras. \n\nOn the dinner menu, my first choice is the chicken vindaloo. Just superb. \n\nOn a side note, you should check out their music videos playing on the two tv screens. (Again, this is against the grain for me, since I usually loathe and rant about any restaurant with tv!) Sometimes the videos are so lurid that they're addicting to watch! They're all the same with the same theme: Man falls in love with girl. Girl dances and acts coy. Man sings to woo her. Man gets girl. The end. lol\n\nFlavors of India is a gem. Lunch or dinner, this is the place to go.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2013-07-15", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "sALB8-F04S9VcZMF_GkGUA", "review_id": "BgGam64ua9jPptJRgdDRxA", "text": "2 for awesome service & the best naan ... The rest.. Hands down to a zero ... & I feel bad rating it so low... But I've had wonderful Indian food... Outside of the mother land...& this is just horrible... :-(", "business_id": "vA9aCw2kTgN8p2SLdm2mDA", "stars": 1, "date": "2010-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6K548C1gI4md9i0Pqyh8Xw", "review_id": "MS0hRDqL_Wj-GnTvkQ1ulQ", "text": "I love this place!  The food is Excellent! I always order the lamb korma, medium spicy, and garlic naan and am never disappointed!", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2014-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 3}, "user_id": "jKeaOrPyJ-dI9SNeVqrbww", "review_id": "tmLkGuS1M7283p2LQvz4lA", "text": "I went back to India Gate recently and was delighted!  I swear the taste and quality of everything has improved, as has the service.  Our servers were all very attentive, though not pushy.  Everything was excellent; my party ate every last bite.  I think the prices may have been reduced, though I'm not certain.  I ordered the same: Paneer Pakora (fried cheese appetizer I highly recommend) and Malai Kofta.  Both are outstanding!  I will be back!  My new favorite Indian cuisine in Chandler!", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 5, "date": "2008-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "chi-QC1laIPj2H2fPFTESA", "review_id": "hmDS_g6Lw1JxiaNk1nJvIA", "text": "I love the food- & the staff feels like extended family.", "business_id": "6SMQl2vR37HvjYWwSl1V3w", "stars": 5, "date": "2010-08-08", "type": "review"}
