{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7DeM4C66zVflYNrZn_Vv9g", "review_id": "RKSwdhP-xQLXm6ShTwknew", "text": "This is a tiny Starbucks and it locations like this (although cute) makes you wonder if your really meant to hang out or just grab your coffee and leave. Leaving is always a good idea at this location anyway since you have a nice fountain in the back with benches and it is a central part of the Waterfront Shopping. \n\nStarbuck isn't my favorite coffee chain by any means. Is it just me or do all Starbuck coffees taste a little burnt and bitter? No matter how trendy, cool and upscale their establishments are I can't get around the yicky tasting bitterness of Staryucks regular coffees. Talk about over roasting a bean...Maybe something has changed with their regular coffee but I have not drank it in about a year. I am not one for soy caramel latte foofy stuff. Still I'll give the establishment tres estrellas for the fact that their espresso is acceptable and doesn't taste half as bad as the regular coffee bean.", "business_id": "3gmBc0qN_LtGbZAjTtHWZg", "stars": 3, "date": "2009-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7xH9Qey07WJYq5E1sFxo_g", "review_id": "sZWx2pcHlVZmrwfe0uDdbA", "text": "Maybe Tazza D'Oro doesn't need another review, but I guess it never hurts to lend your voice to the chorus of those praising a good, solid and well-run local business.  \n\nThe coffee selection is terrific.  The baristas are professional and courteous.  No, they are not chatty, but they are polite and friendly.  I'm not there for conversation, but for good coffee.  And that's what you get.  \n\nThe pastries and snacks are fine.  Good variety.  \n\nThe atmosphere is JUST what I want when I need a cup of coffee: relatively quiet, comfortable and calming.  \n\nWhen it first opened (how long ago how?) it was mobbed by some of my neighbors (I live in Highland Park) who adopted it as their private club and often seemed peeved at \"others\" who stopped by.   They've either relaxed or found other obsessions.  The clientele is, as folks said, eclectic and invigorating.  \n\nIt's become our after-dinner spot after a meal at Park Bruges or Smiling Banana Leaf, too!", "business_id": "83_p9vIqOq1TUIf3_GD7bA", "stars": 4, "date": "2011-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wZx9FnJ5ikaRwZgRqSgZkg", "review_id": "o6h_52-fX6y8O3Y0jsLGSw", "text": "right by my house, spicy peanut and cheesy snake are amazing.", "business_id": "PzG0XmAmtXFs6Fdnubf41g", "stars": 4, "date": "2010-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "molS6oaZnEygSiUmkoOy0Q", "review_id": "L25TnXkFDh-TXVXerMuk3w", "text": "I can't believe it's taken me so long to try Quiet Storm.  Weekend brunch was great vegan comfort food. We had VTL (messy, delicious red potato smash with seisage, scrambled tofu, and queso), Country Burrito, and sweet Nyam (corn and coconut spiced pudding cake with banana and sweet potatoes). We started with the vegan nachos which were super tasty. Friendly staff and kid friendly, even on a busy Saturday afternoon.", "business_id": "PzG0XmAmtXFs6Fdnubf41g", "stars": 5, "date": "2012-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "p5RMCOmEwk3N1SfxYqFFRw", "review_id": "E9ZUUoQuVu-V-CXgfNlf4g", "text": "MARKET SQUARE.....The slowest, most inaccurate Starbucks that I've ever seen....how can you write an order on a cup and still get it wrong....I saw 3 wrong orders (including mine) in the 25 minutes that I spent waiting...I was 4th in a line of 10", "business_id": "7ijQJV72aBrEoJCtTBCHxw", "stars": 2, "date": "2014-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "J-52g3nkjcOV4wq5oTRXUA", "review_id": "JsSl_2fcidHbLssaU-wFrg", "text": "After being served their coffee elsewhere throughout town (like the Coca Cafe) we stopped in for a bag of dark-roasted beans.  \n\nAbove a certain level of quality, I mostly can't taste subtle differences among various roasters, but this one does seem a little darker, fresher, more fragrant than the other stuff in my kitchen.  Maybe it's an illusion, I don't know.  But I don't much care.  \n\nWorth a stop for lovers of dark coffee.", "business_id": "SWzCFTM7KHc-MncD6xxOYQ", "stars": 4, "date": "2010-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BhSCNNQ1qtrzEIV4gZD8Vw", "review_id": "LOSckl7im95nVLeJjuadzQ", "text": "Very good coffee, love that they offered free coffee after yoga in the square on Sunday at market square.", "business_id": "SWzCFTM7KHc-MncD6xxOYQ", "stars": 5, "date": "2015-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kTucxiqnRk2Qlh9MC1tRbw", "review_id": "BMcSIUPDC9SBFLZEQ8mUUQ", "text": "Where else but Uptown could you get huge homemade biscotti for $2 and Hungarian-language lessons for free?  I noticed that the sugar container said \"Sugar\", and also \"Azucar\" (Spanish), and... \"Cukar\".  I asked if that was Turkish.  No, said the cute guy behind the counter, that's Hungarian.  (Turkish would have been \"seker\", I learned later.)\n\nI know only one phrase in Hungarian, I said: \"Halvány fogalmam sincs\".  He smiled and said it in English: \"I have no idea.\"  A useful phrase to know, he agreed.\n\nThe coffee drinks here are simple but good.  The names are fanciful; espresso with milk and a Torani shot is an \"Elizabethan\".  Dunking your biscotti into a good coffee, however, is an Uptown pleasure that will cost you surprisingly little -- and the sidewalk tables are a great way to add some Mt. Lebanon ambience.", "business_id": "DJKpwLp4mISNDNDpNz67tw", "stars": 4, "date": "2008-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "RPJGvMZnlsQpk0l_QOK_FA", "review_id": "iDOkH3iD4PZ5-jxlJQCtRw", "text": "The Coffee Tree Roasters is a great place to relax and enjoy your cup of coffee. When the weather is nice, they will open the front window which actually pulls up like a garage door. There is also free wifi so you can get your work done. I also love how they have stickers that I can place on my coffee cup to give it some personality. The ability to add stuff to your coffee is important and having a selection and availability is a good rule of judgement for coffee places. They offer cinnamon, nutmeg, chocolate, and sugar additions as well as simple syrup in a squeeze bottle and water and lemons. This place is my go to for some quiet reading and studying.", "business_id": "1qUYk564SajvwTtkNM6KJA", "stars": 4, "date": "2014-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 3}, "user_id": "C3MHaW2n0GBi5l5TcZuZPA", "review_id": "6N0RoFVEJXLV-UGZGLmf1Q", "text": "One of my favorite non-chain coffee shops in Pittsburgh. It is a small venue, yet there are usually some seats and tables open. However, I did have a lapse in judgment when I visited in the middle of the World Cup. They have a television set on one of the walls, so the place was packed; all the tables taken, seats being shared, and people standing, all fixated at the game.\n\nAnyways, their espresso drinks are great, their ice creams are heavenly, and their staff are very warm and nice. They provide free Wi-Fi, but the password changes occasionally. You need to ask the barista for the password. Speaking of which, the bathrooms also require a key code to enter, and they are different for the male and female bathrooms. Again, ask the baristas for these all-access passes.\n\nOverall, a great place to meet with friends, clients, your visiting relatives, or your next door neighbors. It's also quiet enough to do some studying; however, their choice of music may be distracting occasionally. Bring some headphones just in case.", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 4, "date": "2014-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "afTF61m7-hcOWAZ-FXc86Q", "review_id": "Nm4b-ooqlxy7DK4gOZUKJA", "text": "Im sitting in Caribou right now as I write this review!!  I enjoy this much better than any Starbucks in the city.  Nice staff, leather chairs, and super fast wifi.  The coffee is good too.  Im not the biggest coffee connesieur but it tastes good.  \n\nIt is kinda hidden in the Bank of America Plaza so just keep on walking passed Sbarro and the other shops an", "business_id": "eqA6QOl1VNgPI-_87CwRFQ", "stars": 4, "date": "2010-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Rt31XiuV_nOd9SYRwP6weg", "review_id": "GD6UIVIrTc2NPZ1noaAZsQ", "text": "This store has gone downhill gradually over the last year. The associates are extremely distant and spend more time talking to each other while people are in line waiting to order. I stood in line staring at a Starbucks associate for up to 5 minutes while she stood talking very loudly about something that had nothing to do with work.  The store was also very dirty.  There was milk and sugar all over the condiment station and trash was spilling over. The cleanliness may have been isolated but every associate's lack of care for customers is what really keeps me from coming back.  I used to stop by this location every day but now it's about twice a year. I choose to give my business to the Caribou located feet away.  The Caribou associates KNOW how to treat customers.  The Caribou associates call me by my name promptly, they remembered my usual order on the THIRD VISIT, and are able to laugh and have fun with the Caribou customers while providing stellar service.  Things HAVE to change for me to return to Starbucks otherwise I will continue to visit Caribou where I am treated like a valued customer EVERY time I walk into their store.", "business_id": "Q9j-sZXJI5cqpNo4vJajWA", "stars": 1, "date": "2012-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "M7dQtu04OsFQRQLZqlJlxw", "review_id": "NsM8yriiAqeEYJ5ULDLi7A", "text": "Prarie Cafe & Bakery exists in one of those cafe/restaurant purgatories in which nothing is offensive and nothing is remarkable.", "business_id": "ShEYKerTwb2LSORE5o_s7A", "stars": 3, "date": "2012-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ml27UOLodYiipGlVjrtwGA", "review_id": "LToXYzLiw8Yb8wzOQo5cqg", "text": "If you like a good scalding hot cup of coffee filled to the brim this is the place for you.   At first, I was happy to have a drive through coffee house on this side of town.  I went there, and noticed a sign that read, \"ring bell once for service.\"  I rang the bell and waited and waited and waited, and waited.  I don't mind waiting, but I noticed an employee walking back and forth, and in my opinion she could have open the door and said \" hi I will be right with you.\" I say this because I was starting to think the place was closed.   It's ok I guess.  The employee was nice I just think they need help or a staff meeting on how to run the drive thru.", "business_id": "OYZOzzipfXdWrYe1A2zeKw", "stars": 3, "date": "2015-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "CofJOFwowqlN2B1OV8IWHw", "review_id": "tmCGSPiok7Tzgtnk8nI4pA", "text": "The 5-star rating is because it had exactly what *I* was looking for, which I suppose a review should be based on anyway.  This is a great study or work spot, great drinks, great snacks - but it's no chain Starbucks. That's what I wanted.\n\nThey serve strong coffee and sweet, spicy Chai; the pastries I've had are delicious and perfect.  The ambiance is exactly Madison: creaky hardwood floors, art on the walls, mismatched wooden chairs at the slightly sticky wooden tables.  I've never been in there to see it crowded, which is very nice for studying.  They're also open pretty late for a coffee shop, and a nice vantage point for dashing out onto Atwood for an ice cream cone or a stretching break.\n\nMusic choices are eclectic and perfectly mind-numbing for concentrating on other work.  Staff is definitely friendly and helpful, but leave you alone to get stuff done and assume you know how to handle your business in a coffee shop...no one questioning why you'd dare ask for a quad-shot coffee or an extra-strong Chai. ;-)\n\nI love this place and return there a few times a week.", "business_id": "UV9c6A16IXXA7JmkTor8Tg", "stars": 5, "date": "2015-07-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Wab1GrEJ5g3CYeWWybe-GQ", "review_id": "b--6YWG77ktXfEq2rsttqw", "text": "I love going to this shop every time I'm in Champaign, which is several times a month, and it's the source of nearly all the dark chocolate I eat.  They have products in all categories that I've never heard of, and I love trying a new tea or soup mix now and then.  The chocolate bars and candies selection is awesome, and if you're lucky, there will be some almost or just expired on the sale table at delicious prices.  If you like gourmet dry mixes, (soup, dip, rubs, scones etc) they have a large selection.  As for coffee - I love their selection, and the fact that you can buy as much or as little as you want with the bag it yourself system, and they will grind it for you to the fineness you request.  There is always some coffee brewed and on hand for samples, tho keep in mind you can't purchase a cup, you have to go to the next block for a real, whole cup of coffee.\n\nIf you like imports, there are quite a few - Italian candies, honey, European goods, dozens of tea and coffee accessories, kitchen items.\n\nMill V left a really bad review which I'd like to partially validate, though I entirely disagree with the 1 star rate.  This shop has fresh tea, and it has stale tea.  ALWAYS check the dates on a box of consumables when shopping anywhere!, and avoid teas and other herbs that are sold in clear glass jars.  This shop does have a sale table for the out of date foods and teas with awesome sale prices which I often take advantage of, but not for the tea which really shouldn't be kept past expiry. Personally, I shop online for truly fresh and awesome green teas, tho I do occasionally get a box or canister of something at Walnut St if I've never heard of it.", "business_id": "bmGEYg9Xw9XmCQXgeZ_Pyw", "stars": 4, "date": "2012-08-24", "type": "review"}
{"votes": {"funny": 5, "useful": 9, "cool": 8}, "user_id": "zfuJwHFip_KoJlb9SR-g4Q", "review_id": "x9oisFyDisTjtDLEFFahdg", "text": "Last Friday I visited with my daughter who lives in Champaign.  After lunch and shopping what's next?  You guessed it, coffee!\n\nI have long been a fan of this cafe, it's cozy and definitely has the college town vibe to it even though it is far away from campus. There's a nice little patio, good food for lunch and great coffee!\n\nIt was pretty warm so I had their iced vanilla latte.  I prefer coffee hot, in fact the hotter the better, but in the summer unless I am in frigid ac all day,  I add the ice.  Their coffee stood up nicely to the ice and since I was getting a beverage, what the heck, might as well try some cookies.\n\nI had their iced ginger cookies and they were really good.  I love ginger cookies and these are what I would call ginger lite, delicious but without a zing.  I liked the lumpiness of them and the chewy texture but the ginger was mainstream.\n\nI will be back as I miss my daughter and just coming here would be enough of an excuse for me to head south on 57!", "business_id": "yzInxReAkf7r0aRbwj02Yw", "stars": 4, "date": "2012-08-01", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "WwbJ9F8CqdzdLwgrllGIeg", "review_id": "2FFUGX8yvhrMc4L_ajKyZg", "text": "I order delivery from this place almost every afternoon at work.  They recognize my voice.  The service over the phone is always very good, and they deliver promptly.  There is no minimum order required for delivery, but they do add a $2 deliver fee.  I don't mind this, because not having to get out in the heat on my 30 minute lunch break is worth it to me.  \n\nMy favorite sandwiches are their french dip, chicken cordon blue, and turkey and swiss on a croissant.  Yum!", "business_id": "SfrBXbRdNB_gqPkIgJyKCg", "stars": 5, "date": "2009-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Y_nk4KhoHlkd1WRKCfIhuA", "review_id": "AVQuRzO3KYiAssA74wDUbA", "text": "Have outdoor seating in the front and the back of the store. The seating in the area I was in at 7:30am was extremely cluttered with trash under the tables. You would think in 2 and a half hours someone would of cleaned it up as they open at 5:00am. \nMy drink was as expected. The service inside was good and everyone was very friendly. Inside of store was clean and orderly. \nThe outdoor seating is a nice area minus the garbage. Plenty of tables, kind of a garden setting. Wish there was a Starbucks in my area set up like this one.", "business_id": "TGb6D6zmx1KP4aDDH5Aihw", "stars": 3, "date": "2015-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "8WQubmP7G0NM3IyzyMnCEA", "review_id": "skczTaFh8jDVGzuViIAsjg", "text": "I loved the free wi-fi...but the coffee was just ok.  Wish that they would switch to a different brand of soy milk since the Silk soy has a pretty strong flavor profile.", "business_id": "2h9LsLPdJ7OvZrYJZhVdAw", "stars": 3, "date": "2007-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8scijOselJQ-YK1qGJV-yA", "review_id": "lIY7QN2FIS_8aL1KBeExZg", "text": "Just started working in the area and had a few minutes to chill. And this place was it. .. such an eclectic crowd. .. and it was a crowd. \n\nOlder gentleman requested to stretch me in charcoal as I enjoyed my tea and the place was ever Crowded on Monday mid shift. \n\nThe consumers that came in while I was there were greeted by first name.  Nice\nAnd remembering  the persons order from the time before. \n\nthe pastries were fresh the tea was amazing with multiple choices and rotated out consistent basis. \n\nI was there during a monsoon  downpour and It was not humid in the shop. \nI had a bagel toasted and apricot prickaly pear tea.\n\nVery inpressed will be back", "business_id": "2h9LsLPdJ7OvZrYJZhVdAw", "stars": 4, "date": "2013-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "91Vd0LC3_yPoLe63rWUUkA", "review_id": "2QjGGpJNlLl7Et3bP1JczQ", "text": "My experience was nearly the exact same as the one Dana M described.  Absolutely terrible!  Except she went so far as to say that she had hoped people who used them would bring someone with them.  I was by myself....... and in restrospect, glad for it!  Wouldn't want to subject anyone to such unpleasantness.  OH, and dont' order the berry smoothie.  Mine went down the garbage disposal as it was undrinkable.", "business_id": "e_kbfiEZ87L-ZryMZxvJkA", "stars": 1, "date": "2011-07-25", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "mlL6MuK5zU6tGTbV3X0nhA", "review_id": "rIZ0yJxzyzQBHYjwRqkyWw", "text": "decent donuts but horrible coffee....", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 1, "date": "2009-06-21", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "cBJqlNzyoJFak3_XRe2bvw", "review_id": "N6qU_QXplQsuHS1gBhjsBg", "text": "I live nowhere near here (thank God!) but have had their donuts from co-workers bringing them in and have been in store. I recently tried the Texas kolache, which is a breaded sausage and cheese pastry. You can get it spicy or not, I chose for the not spicy warmed up. It was delicious! As far as donuts, their glazed is addicting. I also got an iced chai, which was very flavorful and delicious. Restaurant inside has bar seating and a few tables. Staff is also really friendly. Overall winner here!!", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 4, "date": "2014-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SzJfzmElS6U36b72o-24QA", "review_id": "vpZaiq72boBjn8qcXKfsLA", "text": "I had never been here before and the barista helped me pick an Amazing iced caramel soy latte. It was delicious and he was super friendly. The atmosphere carries good tunes and a cool casual atmosphere. :).", "business_id": "4eFIVmbeCvJGCrhzmd-VYA", "stars": 5, "date": "2014-07-24", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "73XMmAL2Kofe8yFjp3iiGQ", "review_id": "YIh_b6GRR72ukeoPoV8aJA", "text": "Our experience with Ace has been great. If there is a problem with the machine they are out here the same day and always friendly. The machines take credit cards and Apple Pay.", "business_id": "wb2-TN8B1vXt-cbMBIufuQ", "stars": 5, "date": "2015-06-10", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "jIj45RYKoYuJTKkLsykNnw", "review_id": "Bp9zjOklcfKo6czKyAZXhA", "text": "So this is the best Starbucks in Anthem primarily due to the service. It's fast, friendly, and they always provide consistent quality. \n\nThere is one negative that's horrible enough to excuse the positives, and that is Steve. Steve is my least favorite server I've ever met, and he always seems to be working when I come in.  This review isn't a joke sadly, I've had to deal with his service too long and plenty of people that go to this location have told me about his distasteful \"service\" as well. \n\nThis location receives 5/5, but Steve gets a -4/5, unfortunately averaging it to 1/5.", "business_id": "brDiv7CufBg4bdFfPBY8Fg", "stars": 1, "date": "2015-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "DCZkrSgbUN-5PTUuKWdb_w", "review_id": "i3tzhC-P-mP0v84Qe_Seyg", "text": "My sister and I stopped in her after a movie to enjoy some coffee.  I am a frequent flyer of Starbucks and visit them at least 3 times a week.  I had never been to this particular location before and I will NEVER go back!  The barista was so rude, like, unbelievably rude.  And of course she didn't have on a name tag so....She was thin, brunette, mouse-y looking.  I politely asked her for a couple of waters to go along with my order and she ROLLED HER EYES at me and said \"Yeah ok\".  When I then tried to confirm my order was correct with her, she acted all offended and said \"I'm sure it's right ok?\" again, with a very rude tone.  I've never been treated this way at a Starbucks.  They should be embarassed.", "business_id": "1FkRvL3fj2ERBoddXwanTQ", "stars": 1, "date": "2013-08-02", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "APLIPfq1Rf8QyhHHk2uAyA", "review_id": "Tkv80LQTPGw4K5ydI2KwqQ", "text": "If you happen to find yourself in (G)Old Canyon and need a pick-me-up, head over to Gecko Espresso. They make some pretty decent coffee, I tell ya. No, you won't get impressive service. You may have to ponder the menu for a bit, even if you walked in with just an iced coffee on the brain. \n\nThey do sell a little bit of \"Gecko Cred,\" from shirts to mugs. But, they're more your cheesy truck stop stuff. Not the cool mug I got as a gift a couple year's back. It's a shame. That coffee cup is awesome.\n\nMy afternoon companion got a chai tea, which he drank 1/2 of, saying it was just too sweet. I tasted it. It was rather sweet. The cookie he got also got tossed. I tried that too; it was just okay. Yet, for 2 drinks and a cookie, I paid under $8, which I thought was a near steal, especially since their smallest coffee size is somebody else's medium. \n\nI found the guy behind the counter to be so lackluster. It's like he was hurrying us out the door. What? Do they close at 3 p.m. on Saturday? I wouldn't be surprised. After all, it is (G)Old Canyon.", "business_id": "aR972sxTNRM6mLZdqiPN_A", "stars": 3, "date": "2008-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "038fcAUG3makrkLXRgw52g", "review_id": "iTllG22IWLNquQcnRZpOYw", "text": "I'm seeing that there are a lot of mixed reviews for this place, but I've been here a handful of times now and I really enjoy it.\n\nThe owner is always very very nice when I come in. I actually haven't been served by anyone else on the staff, so I cannot say how the rest of the service is, but my coffee is always made well and quickly!\n\nI also really appreciate the very LARGE selection of sugar-free flavors they have. The lists for regular and sugar-free are almost exactly the same! That's a huge bonus for me! I get enough of a kick from caffeine (especially since Coffee Rush give you a double shot for the price of one) without the need for added sugar, but I also like a variety of flavors. Plus the pricing is cheaper than other shops that I've been to lately. Not by a lot, but by a couple dimers.\n\nAnd the location is also really nice. You can sit right out next to the man made lake and make friends with the local ducks. Just don't feed them any bread, and then you won't have to worry about duck shit ;)", "business_id": "l1MZjZK2tLxfFRB62lQmsg", "stars": 4, "date": "2010-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CxW3kZJ6Q9e0RDfgIZNedg", "review_id": "V9KH-_KOhnG5G-FHS5Q2MQ", "text": "I wish I could give this place better rating because it was cute and local, but my drink was not very good (-1 start) and the broista acted like he might have had a few more shots than he should have that morning (-1). He was really, really hyper and I had to give him the raw sugar from the bar to make my drink. A friend got a caramel macchiato freeze (I think) and it was tasty- though more like a caramel milkshake than coffee, the thing was WHITE. We were in and out in less than 5 minutes with only one person working. Impressive but not in the best way. I was going to use my card but it had to be a charge of 3.99 to use it so I payed cash. I left with a weird feeling like \"what just happened\". It was a whirlwind experience. The seats and tables we all full so they must be doing something right!", "business_id": "l1MZjZK2tLxfFRB62lQmsg", "stars": 3, "date": "2014-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XAGPzb0ESiRzm_RuuRic3Q", "review_id": "-XjhZSCdE6tZZRyNDQAjVQ", "text": "I came in on thursday to do some light reading. I had my phone charger plugged in to the wall and was seated at a table. I hadn't got a drink because I already had to much caffeine . Well one of the baristas came over asked if I wanted anything and I said no thank you. Couple mins later the barista says to me \" Yeah your sitting at my table, using our electricity, you have to purchase a drink to do so\"  now i thought he was joking with me and really he wasn't. I got a shot of espresso and kindly walked my self outta there. Now i get it, but never in my life have i been treated like that. Iv worked for Starbucks well over 4 years (left in 2013) and we would never say something like that to any customer due to the fact that I'm sure everyone has given plenty of there money to the company. i will gladly be never giving my business to coffee rush again", "business_id": "l1MZjZK2tLxfFRB62lQmsg", "stars": 1, "date": "2015-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "leaKp4PYiVda4qN_U9mLiA", "review_id": "fg46PwlhkBshvxfS1aGSJQ", "text": "I am not really a fan of Starbucks but it was the only place I saw open.  The sevice was good and the lattee hit the spot.", "business_id": "yMkXrAbKr3C1BjXIj6CIzA", "stars": 3, "date": "2013-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BYuF8mLZ4i4uoh3UR_yTQQ", "review_id": "5cPfJeieDdORaybHTClJGg", "text": "Always good food... and the staff is really nice. Their minestrone soup is incredible - add some chicken... as is their cobb salad... and their homemade ice cream sandwiches.\n\nIf you belly up to the coffee bar.. ask for Theresa - she's fun, knowledgeable, and pulls a mean coffee... ! =)", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 4, "date": "2010-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qyR0lCqq1-H6q8HAyrG6bw", "review_id": "HW7Z73fXaJyQAH4amopWKw", "text": "I have once again managed to eat at Liberty twice in one day.  I love how the weekends serve breakfast late so when I skip breakfast for Yoga class I can still get my egg fix.  And oh did I.  Love the American scramble and the trick is to ask for a side of gravy for that delicious biscuit.  \n\nHowever it was my dinner experience that inspired me to write an updated review.  A few firsts, sat at the coffee bar and was served table side--very nice.  Had the salmon special with a potato cake and mustard sauce which was awesome, love their specials.  However it was the post meal coffee that was life changing.  I am quite the coffee snob and am rather picky about where and how I have coffee.  Last night I wanted a little something sweet (the chocolate truffle cookie) and a small shot of espresso.  I was first going to ask for the Cubano but the Barista suggested the Cortadito.  WOW!  That little cup of goodness had escaped my radar but now I can't stop thinking about it.  So rich and lightly sweet with a nice foam. I know that it has dairy in it, steamed half and half I believe so nothing but the best of dairy, but for me it is just a small amount so I am willing to suffer the consequences and take an extra sinus pill.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2010-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "WA1cLGGfTyj6bCgfP9mf2Q", "review_id": "FAxH0OVPiwBWQr-s05gCAA", "text": "Love this place! The hubby and I are fans of businesses that stress local and/or organic fare. We have been very happy with the service and food quality every time we've visited. On our last visit, I inquired about the cordalitos on the espresso bar menu and we were given a complimentary order to try. If you order tea, you get an entire tea service complete with your own little teapot. A great place to try, and saves you from standing in line at The Farmhouse next door.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2011-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "WNJ-i3qqu080XkHbiLqzpg", "review_id": "F_6FO6w2x4MIRa79DJCUGw", "text": "I really love visiting Liberty Market.  The food is always good and the sides are rotated so I seem to always try something new.  The first visit to LM I had the Maiden Lane and the slaw was delicious...as a side I had the sweet potato salad.  I have also had the vegeterian pizza that has asparagus and squash.  The pizza crust was cooked perfectly and had a wonderful wood fire taste.  The sangria is wonderful, full of fruit and goodies.  Also the carrot cake is something to have every trip.  So dence and moist.  I would eat at LM every day if I could afford it!  Love Love the Liberty Market.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2011-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Va5125HWa3MmJXNMpXj97w", "review_id": "B7-B7VVlvlSjE2cXDcF9kQ", "text": "Our first visit. Good food, good staff, massive portions. Be prepared for a long wait if it's crowded. Pluses - Fresh OJ by the carafe & tasty sticky buns the size of your head!\nWould probably try again when it's not so busy.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 3, "date": "2012-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6C-Lr15mzNHkpWlkVBzQUQ", "review_id": "wslc4WzdJoqD23NYNC47TA", "text": "I've only been here for breakfast, but i can without a doubt recommend it to anyone. Their potatoes are amazing and there eggs are the right consistency. All in all a wonderful place to have breakfast.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2012-08-22", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 1}, "user_id": "lPyw9VD3gUyPIokCh-PIdA", "review_id": "sn2agFlrsvAYcRnjvqd04Q", "text": "This review is a long time coming from me.  Only having lived in the Gilbert area for about 9 years, I have been able to see much of the old town grow into a more upscale, urban vibe to it that sort of meshes well with the dusty, tumbleweed blowing across the street scene that it is.  Confusing and sort of awesome all in one, the little old street in Gilbert has become a place of choice not only for me, but throngs of east valley residents as well.  There are too many good places to eat in this area and this is a good problem.  \nThe review:\nLiberty has been a place I have been ordering take-out from for over two years now and my actual dine-in experience has been minimal. Parking is reasonable though can at times be difficult with Postino's, Joe's, and Oregano's all smashed together.  Phone-in orders are always courteous, almost always fully accurate with special order types, and the wait has never been prolonged.  The restaurant is clean and just fun to look at.  \nFood is delicious.  I have not sampled the entire menu but it is varied and well thought out.  Pricey?  Maybe.  I have learned that more imaginative and fresh food equals a more premium price and for the most part, I accept this.  \nAs a creature of habit, I can speak on the salmon blt with authority; never fishy, good char on the bun, bacon is always delicious, tomatoes are thick and red.  Sandwiches are clever with designer cheese and excellent breads.  Homemade kettle-styled chips = yum!  \nBreakfast is also varied and delicious.  \nCoffee bar:  This is my favorite region of  Liberty.  I have shed the Starbucks addiction and moved to more local coffee houses that can replicate a good cappuccino.  Liberty can do this to my satisfaction.  The baristas are knowledgeable and friendly.  They will remember your order and chat with you if not too busy.  Adult coffee drinks?  Sign me up.  \nI love this place.  I want to move in to this place.  I dislike people.  Herein lies the problem.  The times I can visit are always peak when there are throngs of \nobnoxious humans and the acoustics are terrible.  Navigating the Yukon models of strollers to a table is an exercise in patience and contortion; space between tables is at a premium.  \nIs this a place to quietly work on your laptop with a cup of coffee? Depends on the time.  Is this a place to get an excellent coffee drink?  Yes.  Food is delicious and the atmosphere is engaging.  \nPros:  Food and coffee drinks; decor and yes, bathrooms have character.\nCons:  (Peak hours) Parking, too much humanity in one establishment, acoustics.  \n  \nThe Joe's chain has another winner.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2013-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m3-FCCxL1LjZ2iN1FGXElQ", "review_id": "K0IU78EK-jlKO_scrqtDDA", "text": "i love liberty market.\n\ni do not love lines but i will gladly stand in one for one of their fantastic desserts.  they have an amazing red velvet cake & cheesecake in a jar.  YUMM.  quality.  \n\nthe decor is modern.  the kind of restaurant that you wish your house looked like if you were a little hipster baby.  does that make sense?  four stars because it can get super packed & the wait takes soo long.  or it feels like a long time.  sometimes it's discouraging enough to give up all together & seek refuge at postinos or dare i say it... oreganos.\n\nstill.  i love this little spot & i definitely recommend it.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 4, "date": "2014-06-26", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "OpN1MhESDpc4_mPpx2Pd9Q", "review_id": "YObva55V7jJsjanavEzSNQ", "text": "Gosh, I wanted to try this place so bad and had such high expectations! Was a little let down. I get real excited when it comes to breakfast, but Liberty Market just didn't do it for me.\n\nOne thing I did like what the atmosphere of this place, it is pretty cool. The service was fine as well. I ordered eggs with fruit and toast and it was okay. Not awesome, not bad. My boyfriend felt the same way about his food as well.\n\nAnother thing I liked about this place is that they have all their treats and goodies on display. It is torture, I wanted one of everything. I could not pass up a sweet potato muffin so I went for that. It was excellent! Had a great flavor to it.\n\nI would come back, maybe for a different meal. Definitely for more baked goods, because that was the best part about Liberty Market for me.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 3, "date": "2014-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_TFVZLcNaPh6o-gwlMS9Lw", "review_id": "sH9z1JUPsoyp5uwtYuao-w", "text": "The food was good. Tasted fresh. Had the \"best chicken\" sandwich; so it was good, buuuut they smoother it in the avocado dressing and the vinaigrette so you look like a slob eating no matter how you attack it. The things I didn't like: 1.) the freaking wait in line and then for the food! DO NOT GO HERE if you need food in your belly right away! 2) it's so gotdayum loud that you cannot hold a conversation without the people that are 7 inches away from you, which leads me to...3) I hate sitting so damn close to complete strangers especially the group that was here tonight. Uppity, better than you attitude. Everyone was visited by the chef or some sever EXCEPT US! The only time we were visited was 20 minutes AFTER I put my napkin over my food in hopes some employee would get that I needed them(there was no way I was going to leave that pricey of a meal to be tossed). \nThe experience really made me not a fan--eh", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 3, "date": "2014-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uFXrezdNbph5QbmvYVmhEA", "review_id": "yhvTEXIPwnzO2RYVUxCGoQ", "text": "Love love love this place! It's my favorite date spot. If I am just getting dessert and coffee or diner , I always leave happy. Service is perfection and prices are good. The restaurant is extra cute inside to boot.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2015-07-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y9iKNisWuHatYvzn-ikP_w", "review_id": "rXaDE2OtJNVZgoLdri9O6w", "text": "I had the pizza and it was brick fired amazing! I look forward to going back and exploring more from the menu. Several great options and the burgers look delicious.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2015-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jFjtM1N5z6P2ZlA7T-0JGA", "review_id": "L3ZCojr08YXgczZCh_gJ5g", "text": "Went to Liberty Market after a morning of hiking/driving for some yummy breakfast as I heard it was delicious! My cousin and I stood in line for some time while the party in front of us ordered their meals. Julie was sweet enough to get our orders in right before breakfast was ending. While eating our delicious food my cousin and I noticed Julie walking around with a smile on her face helping customers. All the employees we came across were friendly and had a smile on their faces! Will be back! Great customer service!", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2015-08-31", "type": "review"}
{"votes": {"funny": 1, "useful": 7, "cool": 2}, "user_id": "palND-kF1qpMLhkcgAnSxA", "review_id": "T19zg5aZdMTN6MRQAyqPEQ", "text": "Jolta Java. I've had you on my radar for a few months. I remember stopping by once a few years ago and had a pleasant experience. This time... Not so much.\n\nThe coffee drink I got was tasty, and I'm very happy that they carry both almond milk AND soy milk for us lactose intolerant folk. This is where my happiness ends.\n\nThis place needs a SERIOUS deep clean. The floor was covered in crumbs, the tables were littered with debris of various food and paper products. The fake plants were dusty and if you look up to their massive ceiling, all the huge pipes are COVERED in dust. It's an asthmatic nightmare. People would finish their beverage or food and then the table wouldn't be cleaned for a minimum of ten minutes.\n\nThe staff were completely apathetic to all of this. It wasn't busy, so they stood around behind the counter either looking at their cellphones, chit chatting, or watching the Olympics. Sad customer service. \n\nThe more I type out, the more I realize that this shop needs more than a cleaning. It needs an attitude and staff adjustment. \n\nI doubt I'll return.", "business_id": "I2_yeLfTzXHGwi8an0tL4w", "stars": 2, "date": "2012-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "orl06jxEC4WHFa7YcpYuhA", "review_id": "Tn20LZseoQ734WcxBdIREg", "text": "I frequently visit this shop as it is a close location and is very quiet in the evenings. However the staff is not very friendly, especially when compared to other local Starbucks. Drinks are typical and the shop is clean.", "business_id": "CK6Vf3ii1Hj-4AlgbS6NJQ", "stars": 3, "date": "2015-07-04", "type": "review"}
