{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z52z_8HzZiyTow9Tk7gBtQ", "review_id": "s0jAPNlttqiyMuQY_SzJ5w", "text": "The best dental experience I've ever had. Came in for a root canal dreading it. Dr. Baker was quick and painless. I didn't even know he'd started and he was all done. Highly recommend!", "business_id": "e7ExjMdmeF95SzrZ--dHcA", "stars": 5, "date": "2014-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "VjIq7uQTNuwt3KoU0sic7Q", "review_id": "NLBtWfzpa7n7Cw4niRxVJA", "text": "I was brought to Buono's from a Groupon purchase.  It's very close to our home and I was hopeful to find some good pizza.  During my first experience a cute young girl was our server.  She was the only server for a whole restaurant full of people and she was also the counter person that took the order.  She was nice and friendly, but our service wasn't fabulous because one person can only do so much for an entire restaurant full of people.  From the point we received our food she came back only at the end to give us a box and I had to go up to the counter to pay our check because we had somewhere we needed to be.  I thought maybe someone had called out sick or something.  The pizza was thin, cheesy, and greasy.  It was good,  but it didn't wow me.\nWe decided to give it another chance, so we went back.  This time we had white pizza and a sausage roll.  Our waitress was the same girl.  The service situation was the same which leads me to believe that they just don't have enough people scheduled to work ever.  The girl who works there is nice and friendly and I saw her and the other 2 kitchen employees that were there running around and doing their best.  I felt bad for them because I've worked in numerous restaurants over the years and I felt like they were set up to fail.  The sausage roll came out 10 minutes before my pizza did.  It's always awkward when you go out to eat and one person is completely finished with their food before the other even receives their.  The sausage roll was the poorest excuse for a sausage roll I've ever seen.  It was doughy and not very flavorful.  If you decide to try this place stick to pizza with marinara sauce. The white pizza was bland and also not very flavorful.  If you decide to try this place stick to pizza with marinara sauce. I would have liked to have had some red pepper to pizazz it up, but our server was unable to come back and check on us because she was too busy.  Also I overheard at least 2 sets of customers that came in to order pizza and ended up leaving because they were told the wait was very long.  I applaud her for letting them know about the long wait up front because that's the right thing to do.  However, I feel like the management needs to hire some more employees because you should never be turning away people because you're too busy.  Lastly, I've seen other people mention this on their review, but we reeked of and oil/smoke odor after we left.  I'm not sure if there is a problem with ventilation but it was unpleasant.", "business_id": "m3O2EFVs3eo8s40MGGzmsA", "stars": 1, "date": "2013-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Kf0NkgbZAkBpkl4To_GhtQ", "review_id": "gd0sQCWunWfWbHnpMbh15Q", "text": "This place was great. I called about 10 minutes prior to see if I could pop in for a quick wax, Ann said yes. I was stoked to get in without a wait. I got there and saw why it was no problem, there was nobody else there! Anyways, the shop itself is nothing special, but that's what I expected. The woman, I'm assuming Ann, was so nice. She asked questions, but not too many. The wax itself was painless and quick. For $15, I couldn't ask for more.", "business_id": "ZvXEc7adhC2N6zQXN_AsLQ", "stars": 4, "date": "2012-08-11", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "ZzXsskFHBYlHigIC0mX9lg", "review_id": "hyV-sgbuofdvxP4A9_hOXA", "text": "01/2012 moved to sw alma school & warner (s end of shopping center)", "business_id": "H-99nG_KfynWPXh84TKj8A", "stars": 5, "date": "2012-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zbllQedquVuXr13E8mLvmA", "review_id": "x9FNDpyAJYcJWhQvyaRefQ", "text": "Horrible college! If you can go somewhere else they are so unorganized and try to find ways to make you attend their school.", "business_id": "XKrEnL9yCtlhhIa6efbtGQ", "stars": 1, "date": "2013-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "9jpNSjHDWCU6yliX213nAg", "review_id": "6Gqkkxqj5mJPjZmpVL6Skw", "text": "Have been seeing Dr. Z for years, but have lost faith in him. Office staff is not the same and forget about being on time as the usual wait is 30 mins or more unless you get in very early morning appts. \n\nHave been on pretty much every drug known to man and to this day, I feel worse off in years.", "business_id": "CcBOox3znUKO0zV464Jv3Q", "stars": 2, "date": "2013-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iX9CLI7gUoWRipMmaspDkQ", "review_id": "XBsGrM9EtIyQ99l3e_K7TQ", "text": "This place is really great! Its like a hidden treasure. Their teriyaki chicken is perfection. They soups arent the best though. I really love the little garden area(:", "business_id": "wc0a0XLhcMkoEQx1TbuhpQ", "stars": 4, "date": "2015-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7H67UajafPlYolAH05XhGA", "review_id": "QXSLlmuXYyfFkDBbUkrhfw", "text": "I love this store. I found it via google for my sister because it was locally owned and operated. She loved it so much, she took me there first after I got engaged. They were able to squeeze me in without an appointment on a Saturday and the saleswoman was full of so many good ideas. She helped me with so many little touches/alterations that I could make to my dress that made it totally my own. She even respected my wishes not to spend a fortune and found me EIGHT dresses (that matched my desired look) to try on under $500! She even fetched an array of different veils, sashes, and brooches and helped me come up with some really good ideas to make my dress a little more conservative without looking matronly. I have never received such lovely service in my life. No joke. I recommended this store to a handful of people already!", "business_id": "tAlfFMduWAEXhT02L9H7HQ", "stars": 5, "date": "2011-06-14", "type": "review"}
{"votes": {"funny": 12, "useful": 12, "cool": 12}, "user_id": "1ylYrKcGNA8MDkhNBTjHMA", "review_id": "kajL0Il2xwh7kbmqkaRBrw", "text": "So met my best friends in the world, Z and Dally, here for lunch today. I drove the 33 miles to Mesa in order to try a sub that I have been told is amazing. So, having trusted Z on many a thing and as he would tell you, always trust him when it comes to food, I was gleefully happy at the end of my eating experience. \n\nThere are a lot of subs to choose from and it took me about 5 minutes to finally decide on the La Canna. Salami and ham with provolone and olives. Get it on the garlic-herb bread. Have the happy dude behind the counter throw on some spicy mustard, lettuce, tomato, onion, oil & vinegar, Parmesan, and oregano. The sub is toasted and doesn't shred the rough of your mouth, which happens to me quite frequently. I was still not satiated after this sub, so I split the White Widow with Z. Marinated chicken, bacon, provolone and ranch dressing. Again another great sub. \n\nThe employees were all in a good mood. Not sure if that was herb induced or not, but it was pleasant. Phylis behind the register was particularly kind. She came complete with the stereotypical stoner laugh. She's cute. \n\nIt was totally worth the drive and I will be back in the future to try something else.", "business_id": "KS2w8ychyieJbUqRa6kCHw", "stars": 5, "date": "2009-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JG5PCcUmJP46MS70H7HdcQ", "review_id": "9i2Do_Cy_JT1gQX2IahRgA", "text": "Best Subs around period.", "business_id": "KS2w8ychyieJbUqRa6kCHw", "stars": 5, "date": "2013-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DrWLhrK8WMZf7Jb-Oqc7ww", "review_id": "ytwC1MU32ffcmj6gJuH6Gg", "text": "Sandwiches are pretty average here, but love the munchies section of the store. Anything they make that involves rice krispies would be a great choice. The goo balls, especially the one with Captain Krunch, was excellent under the right conditions. The rest of the menu plays out a bit different, but the use of spring mix in all the sandwiches really sucks. That kind of lettuce belongs in a salad, not a sandwich. My order was a pretty simple humboldt, but you need to remove that lettuce to enjoy the sandwich better. This chain used to let you add ingredients as you go down the line (after toasting), but now it;s whatever is on the menu you get. Obviously, most customers might be in another mindset in which anything tastes good, but the experienced gourmet 420 people should be thrown a bone as well.", "business_id": "KS2w8ychyieJbUqRa6kCHw", "stars": 3, "date": "2015-06-30", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "Ow8iWYjwgn7DzOU6yCBvXw", "review_id": "wpgFprNL8Um7G5xWZ0YZow", "text": "reviewers bao and helen need to realize that perfection takes time. relax!\n\nthis place is not kidding when they start their name with \"best.\"\n\nlisten to the lizard......", "business_id": "8TGUK7LD3M-vLWml-jLb0w", "stars": 5, "date": "2014-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "I-P1v7sRjDLEfVOndp01kA", "review_id": "MDJ9wR2Y-ocmmMSEuW3ihg", "text": "My man says service is not perfect,\nbut I think its just fine, all is forgiven bc of the wonderful food.\n\nI really like the tempura zyaru soba.\nI don't think I had up to standard zyaru soba in AZ before till I found this place.\nThe chicken skewers are really good here too.\n\nThe tempura is really fresh (Fried prawn and veggies), \n\nCurry Udon was so and so but I have been spoiled by my own recipies.\n\nGotta warn you that this place alwasy looks closed, so don't get fooled by the appearance. Always tug on the door before you head back to another eatery : ).", "business_id": "BBPkwpj9kSeDuy0uOwWHJA", "stars": 5, "date": "2010-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "n4PmRYAvx2c6X0-fb9mT9Q", "review_id": "0p7LTaX1w05eXUDdsWx4MQ", "text": "In Short: Better than average food, but awful service.  Try the stew, pretty damn tasty.\n\nUsed to be the best Korean place in town but there have been a steady decline in the last few years.  Quality is a little down but the service seems to have taken a cliff dive without a parachute.  Takamatsu is probably the best Korean in town these days.\n\nThe korean stews in the stone bowls are so amazing, I pretty much go here for that and the bulgogi.  This may not look very appetizing but try the pork salad, it's a behemoth collection of greens topped with pickled pig feed sliced thinly, very tasty.  The accompanying small dishes are pretty delicious too, but they used to give better quality stuff like real fish, and tofu cakes.  I still go here occasionally for the food but I wish they get a clue about customer service.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2009-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3zKT-gMYsUmoOT7ffc76dQ", "review_id": "3PgoCqVv8ZppM52S9X658Q", "text": "Most foods I tried here were quite good but not Naengmyeon.\nI especially like their tofu soups. Sundae soup is also what I like.\nThe service was not as good as it used to be.\nGood location (easy to find).", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 3, "date": "2011-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "6XJfj4qjQlxjT-nPw4MSUQ", "review_id": "JXsJzP6L7OYJq1npkzLaUA", "text": "This is one of my favorite Korean restaurants. Can't go wrong with the beef bulgogli, spicy BBQ chicken, spicy BBQ pork, kalbi (short ribs), chap chae (clear noodles appetizer with red and green bell peppers, onions, and bits of bulgogi beef), kimchi tofu soup. Expect 6 little banchan side dishes. The BBQ dishes are just under $20 - which comes with rice. Chap chae is about $14 and plenty for an appetizer.", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2014-08-11", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "VJ05maUdbK30dU9PqkOhyw", "review_id": "KBVic1a5SPL3zRHQG5CBrg", "text": "I'm afraid I will have to give this place only one star for being an absolute pain to find and general lack of information.\n\n My mom, sister and I were to have a girly afternoon tea, and the nearest tea room was this place. I came onto yelp, read the reviews, looked up the location in the map. When we headed to the tea room, we ran into a problem. A big problem. Aliens had abducted the business!! Just kidding, but the business was definitely not where the map said it was. Instead we drove around a little and found it on the SE corner of Dobson and Guadalupe!  So we drive up and park.... only to discover that it was CLOSED!!  I'm not sure if you were closed down or renovating, but there was no way for me to find out!   \n\nOh Abbey Gardens~ I was hoping for a lovely afternoon tea but was sorely disappointed. I hope to give you a second chance, but not until I have reliable information on you!", "business_id": "SepzOmKNnbVXkqXeFtoapw", "stars": 1, "date": "2009-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZxGviwXD6W7Buds-VijDXQ", "review_id": "lzqKp1P6xd8vH1CL2jY8-w", "text": "Stopped in for mani/pedi while visiting Phoenix. The experience is full of frantic upselling and side glances from the technicians. My nails were filed into an odd shape and the polish chipped the same day. The polish selection is small and some bottles appear thinned out. I was incredibly disappointed.", "business_id": "Ay-snTeDn4w790I-sBfyjg", "stars": 1, "date": "2012-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "UE1UIi95jSk5tAzOdtnjIA", "review_id": "AWVFCp8IkGrPKYc6anLQBw", "text": "This is one of my favorite bars in this part of town. Unusual location, but a very fun place nonetheless.", "business_id": "Cp5_NSJFNgylD5SUdmT8nQ", "stars": 5, "date": "2007-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "AirVzN1BVQBmq5zY0YMNYQ", "review_id": "xqfrMQkNZwoPW3Fcr9YMHA", "text": "A few of my friends have worked at two of the Tutti's around the valley, so I have been a few times.  When I saw the Groupon a while back, I had to snatch it up!  This location is another example of a hidden gem in a strip mall.  I normally wouldn't expect to find food of this quality sharing a parking lot with a Native New Yorker, but then again that is starting to happen more often these days, and I kinda like it!\n\nWe came early one Friday night and were some of the first people there.  Instantly, we were greeted by the staff and sat at our table.  Our server was cool, very laid back and very knowledgeable.  A bottle of wine and the garlic butter and bread was a great way to get started reading the delicious menu descriptions and figuring out what we want.\n\nAfter asking the server some questions and getting his thoughts I went with the pappardelle with scallops and mushrooms, my boyfriend got the gnocchi.  He was going to get the cannelloni special, but forgot when it came time to order.  Bummer.  Guess we'll just have to go back.\n\nThe instead of a salad to start we got the tomato soup with meatballs; it  was phenomenal!  The gnocchi was like perfect little clouds with a light tomato cream sauce and my pappardelle was delicious as well.  I was able to save a lot of it to eat for lunch the next day (well, minus the scallops, I didn't think those would reheat well, so we made sure to finish those at the restaurant).  \n\nThe only way to make this better is to go with more people so you can try more food.  I would have loved to get some calamari, a caprese salad, or even tiramisu and coffee, but we were just too stuffed.  Yes, it's a little pricey, but the freshness and quality is apparent.", "business_id": "P2i4eojfX61pZn8i7RZZxA", "stars": 4, "date": "2010-07-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yIkrsYI5A2JsoRtWLA-NFw", "review_id": "b6cihsJbdmVdIIVm_X4AIg", "text": "Been coming here a long time. Hit & miss with the instructors but 90% of the time you get a goodie. They handle special needs kids well and reward for good behavior and milestones small & large.", "business_id": "WOgYQltFy-NhgYQzsMEfKw", "stars": 4, "date": "2014-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hPJ96UOLgMAMV-cP-3FJ0A", "review_id": "SBTV5_0qsa-9pcQ-5xavJw", "text": "Stayed here June 2009. Property was clean and well maintained. The front desk staff was friendly and even called 10 minutes after I got to my room to check to see if I was happy with the room. The room was definitely large and comfortable. The hotel is close to the freeways and it is easy to get around the city.", "business_id": "CscJ0RubTHofHvRJhERvXQ", "stars": 4, "date": "2009-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Snr-iImWYYD_a_7Iar3E0w", "review_id": "jBo1J8vOR7Qqv_xdBIZ79g", "text": "I have passed by this place several time just because I thought the name was strange. Well never again. I thought the portions were excellent. The waitress was fabulous and the atmosphere was relaxing. I would definitely bring my family here for breakfast from now on. Oh and the price advertised by the front door says no meal over ten dollars.", "business_id": "8aPTQeDYOMNEu907WfflCQ", "stars": 5, "date": "2013-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "-JFMcLPQxi9D-ltajgwrKA", "review_id": "VaUH4WfaeMFgbJ3Cl0vMUA", "text": "Just received cold pizza and under cooked bread sticks. When we called to let them know we were disappointed , reply was \" well that doesn't make sense\" \n\nAlso we requested red pepper flakes- and when we mentioned on the phone to the same guy , his reply \" we loose money sending them with pizza\" \n\n\nWe will be going on Howiedoing.com to give another complaint. \n\nOur office will not call or order from you again!", "business_id": "erYxGVc1A_bce_S_W7dKgQ", "stars": 1, "date": "2014-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rGkaiOc_eZjPIm0HzqlZNg", "review_id": "nN9dvWllODdPNPHvgSPQxQ", "text": "Loved the doctor/care but I gave it 1 star because our insurance has a $20 copayment for urgent care and $100 copay for emergency room. Since this urgent care is \"affiliated with a hospital\" (their words not mine) \"we charge an emergency room copayment, that is just how we bill\" is ludicrous! Their webste evn advertises lower than emergency Tom costs. I went twice with my sin and paid 160.00 more than I planned. DO NOT GO HERE TO SAVE $$$$$", "business_id": "2bD-KHkntojDT1vqUlRSmQ", "stars": 1, "date": "2013-06-01", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "R54oNI24sya6u8BWzU-Yrw", "review_id": "T4z1BSQ2GFkTTp7YMjqyCA", "text": "I was here looking for some workout equipment. I ended up getting a couple weights and an adjustable bench. The prices were pretty good and I had better luck looking for the equipment I needed than at one of the big name stores. I would have rated this place better if we had better customer service and the place didn't look like a mess. I had to constantly watch my step and make sure I didn't trip over any of the junk that laid all over the store. I would come back though because there was a great selection of new and used workout equipment.", "business_id": "BB9NoCybEJq9xFBQZzqrAw", "stars": 2, "date": "2014-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "wtRd9V3YGIUeVf53qm0Mcg", "review_id": "OCyhx-qX74CNopw8iREB6A", "text": "So grateful for the Endodontic Specialists! \nDespite all the fear I had walking into the office. Dr. Walker and his technician were very calm and very nice. My root canal went very smoothly and they made sure I wasn't in any pain.\nThe office was very professional and comfortable. And I am very grateful for the work they did.\nI would definitely recommend them to anyone!", "business_id": "3M_I_L68pt68TgZ7k7RXjg", "stars": 5, "date": "2014-06-13", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "DUKJnPM09OBipjtJVWwKnQ", "review_id": "i2aKLCTsTvb7TPKx46VEIw", "text": "I recently purchased an albino ball morph from AZ Reptile. He is a gorgeous specimen. I have visited here only 3 times and yes...it smells like reptile shit....duh..there are reptiles in the building and they have to do their business. The animals all seem very clean and healthy. Everyone I have held has a decent temperament and healthy looking scales. John, the manager, know what he is doing and is very knowledgeable. I really enjoy all of the variety of species in the shop. I hope to purchase a female albino from AZ Reptile in the future!", "business_id": "FryWrZBjBYKeW3pE1WW9EQ", "stars": 4, "date": "2014-07-08", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "FHJUj7EHB9nB2czVOzQX3Q", "review_id": "nmmL4vCiE9OVKC17CVlcJQ", "text": "When I was in college I took an internship with a prominent stained glass artist in L.A. For a semester I worked on my piece in tandem with him and was pretty thrilled with what I came up with. Shortly after finishing the piece I stored it in my dorm room, where I accidentally knocked it over and cracked it in three spots. I was devastated. The entire ten years it's been sitting in my storage room, broken, and unfixed. \n\nI wasn't even aware that stained glass could easily be repaired, or that it would even be in my budget to fix it. Finally about a month ago I said \"F* it! I'm getting this thing fixed!\" I'm in the process of moving out of state and figured I didn't want to transport my broken piece one more time. It was depressing.\n\nI googled around and found Tumbleweed Stained Glass in Mesa, very close to my house. I called and told them my situation, they said it was no problem and to take it in for a quote. Fred, the owner, is SUPER nice and told me it'd be no problem to fix my piece. He quoted me a very reasonable $120 to pull it out of the frame (which I only assume is a pain in the ass), replace the glass that was broken, put the frame back on and put screws on the frame so it can be easily hung. I thought that was a killer deal, as I was wiling to pay hundreds to repair it.\n\nI'm very glad this place exists, and am even happier that I have this piece to hang again!", "business_id": "hgjo7W2JkcjjNU9dzt3ctg", "stars": 5, "date": "2012-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-P9SkvexGLSavupPHMxZsA", "review_id": "vTz5kFll2KiE9uuq78FFww", "text": "My cat Boo was very sick and  my regular vet said gave me no hope. I sought out another opinion and the that vet told me to relax it was my worrying that was making him sick.  Some one told me about Alma School Animal Hospital so I called and got in the same day.  Dr. Christian listen, examined him and  found  what she believed to be a lymphoma. She did some test which were inconclusive, She helped make him comfortable and checked him every week  no charge  to me. She weighed him and adjusted his meds.  \n\nBoo did pass. I felt like Dr.Christian and her staff really cared about what happened to Boo and did everything they could for him . \n\nThere office is open in the early evening and every other Saturday. And they actually run a cat rescue out of the front of the office.", "business_id": "XHDwfk0IWsF6XL2_dHEzsg", "stars": 4, "date": "2010-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "c72-ggtAoep7C0T1ikMINw", "review_id": "cSwY3qqZpGL9J-f8L_MVFw", "text": "Best insurance agent in the business!  He has gone above and beyond to make the insurance experience a pleasure.  We are grateful for all his commitment to excellent service!  We couldn't be happier!", "business_id": "tT_WbkspBjYzrnN80MwkFA", "stars": 5, "date": "2015-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8UKAJqWdeJ9Cb_gU6QFGNQ", "review_id": "qavNlkac_yV7R1Rz1wZRuQ", "text": "Man, my visit here was sad.  2 for 25 deal is a great deal if you get good food.  Didn't happen this time, maybe next time.......\nI'm gonna say the reason I am even writing this review is the pasta I received.  It was unforgivable.   Pappardelle portobello Alfredo was the name of the dish, it had three mushroom bits on the whole dish.  IA had to ask for more sauce because it was so dry, and the pasta was mushy.  What a tragedy to have overcooked pasta at a pasta place.  :(    Rosemary chicken needed more sauce as well.\nThe tiramisu was gross.  Tasteless except for the old coffee mush underneath the mascarpone.  \nI am so glad that the salad was good and never ending, otherwise this pregnant mama would have been a bear.  \nI was peeved at the service time, it took 10 to 25 minutes to get water.  What was so irritating about that was that there were four or five servers hanging around the bar shooting the ship the whole time I was there.  \nI called and talked to manager Lisa and she listened attentively and offered an apology.  I appreciate her listening and empathizing so they've got that going for them.  She offered a gift card, so we will give it another try and hopefully it's better this time around!", "business_id": "scVOmQsf5HSY3n9CG06tFA", "stars": 1, "date": "2015-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "9_dy8otUq7XdZtbunMw8vw", "review_id": "d9EDj-kSf98lVoOBv5q1TA", "text": "The food was great. The hummus was so smooth and creamy and along with the chicken was some of the best mid-eastern food I've had in a long time. Plus, we were able to get a coupon on Groupon which gave us $6 worth of food (that's two gyro sandwiches) for the price of $3! I don't care what else you have to say about the restaurant, you can't find even mediocre food for $3 anywhere! As far as looks of the restaurant are concerned, it is very clean. It's very casual and they didn't focus too much on the decor because, yes, it is a supermarket first and foremost. If that is too much of a problem for you, I suggest take out. All I know is, it's good, clean, and worth the trip out there.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2012-07-02", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 0}, "user_id": "EosKWs-S3-mN6o_rok_LNQ", "review_id": "3V1jGRD0N81XAvD3W0pooA", "text": "In honesty, I feel a little bad about only being able to give Princess three stars.  But this is a perfect example of the fact that to be considered a 'good resturant', even if it is a basic resturant and not fine dining, they can't just throw good food at you and expect return business.  Ambiance and service are important pieces of that overall recipe.\n\nSo I'll start with the food.  This place serves the best, most authentic Mediterranean and Arabic food I've ever had.  The food is fantastic.  I'd say that's a pretty across-the-board statement... everything I've tried here is good.\n\nThe ambiance:  Flat out poor.  It is a combo ethnic grocery store and restaurant, so that is a pretty big handicap to overcome from the outset.  No real separation from the grocery store,  Seating area is crowded even though there is only seating for about 20 total.  The seating is primarily booths (that wobble and aren't bolted down) that look like they are from a 1980's McDonalds.  There are some cafe-style bar-height tables for two scattered about in addition.  During lunch it will get full enough that there will be poeple standing around, eating wherever they can find a bit of space ( a testament to the good food).  Cleanliness of eating area was marginal.\n\nService:  Only marginally better than the ambiance.  The servers, although they can handle orders in English, they clearly prefer taking orders in Arabic.  They have at most two people working tables, and often one.  The server is also responsible for running the grocery store cash register, so if 3-4 customers try to check out at the same time from the grocery side during lunch, they'll spend the rest of the meal trying to catch up.  You'll likely have to chase them down for anything except ordering the base meal and getting that brought to the table (and that might require proactive nagging as well).\n\nCost:  Very affordable for the quality of the food ($9-$12/person).  Runs on par with Spices and other Mediterrean places in the area.\n\nNet:  Not a good place for families, groups, or dates.  Great place for foodies that want cheap, good authentic food.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 3, "date": "2014-08-11", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "VC4niV35pN5FTjm6EATukg", "review_id": "B2Q8W-3cZ2cfy6yFKabKVQ", "text": "I have been in this town for a short time this has become my place for Gyros and other meals also, the food is great and the service is fantastic very little wait time.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2015-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "zfD4SwR5texVoniCNn4yPQ", "review_id": "JnuYEsTh_uqSWX4d1yTPNg", "text": "Spent a few weeks in China and My daughter spent 6 months there, so we were looking for a place to give us that \"We're eating real Chinese food\"  feeling...  This place SAYS that, but it is standard stuff.  If you like sweet Americanized \"Panda Express\" type food  (I like my Panda Express too at times), then this might be a place to go.  When we asked for different dishes to see if they had any traditional ones we were told  \"well in China, when Americans show up they give you a different menu...\"  Those of you who have been to China know that frequently there are just a bunch of pictures of food on the wall as a menu, the menus you do get typically are in Chinese, and that the food you get in China tastes QUITE different from what you get here, unless you go to KFC or Pizza Hut....  Our quest continues - I'll post if I find one that is really great!", "business_id": "PNrOTfMmE0CJFV9YwSLzYw", "stars": 3, "date": "2012-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XpLpjmgqkrPLGJBAw5rePA", "review_id": "4nOeCXSPIQ2DHvEYrfhvXw", "text": "Just got my hair cut by Traci today. She was very nice and attentive, and really listened to what I wanted. She did a very good job for a very reasonable price.", "business_id": "JlwJPlkE5E_97sPhqWnmCg", "stars": 4, "date": "2014-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "adbGzWWooOw2C0mqUic10A", "review_id": "OdUyfTz6Pt8LCnbqoW00eQ", "text": "This was my first time eating at this establishment, and normally, when I write a review, I usually wait until my second visit.  But considering the company has been open since 1963, I figured they are doing something right, so I'll write my review now.  Quite honestly, this was the best Mexican food I've ever had in the Phoenix area.  I love the homemade salsa (not to mention, how MUCH you get - they don't use the tiny bowls for salsa like some restaurants do).  Tonight, I had the carne asada chimichanga, and I have to say that it's probably the best chimichanga I have EVER had.  The tortillas are homemade, and it almost looked like the chimi was pan-fried, because it was over-loaded with grease, which is a definite plus.  It comes with guacamole and sour cream, and I think they kind of over did it with it, but that's my personal preference.  I'm not going to ding them for that.  And the Spanish rice tastes just as it should be - almost like mine.  :)  When we arrived, they were in the middle of their happy hour, where your drinks were half-off.  Bonus!  But if you get regular drinks, such as pop, tea, etc., you get a huge glass for it!  Double bonus.  I know, the little things excite me.  I'll definitely becoming back to this restaurant soon.  I think it's better than Serrano's.  The decor is mediocre, at best, but they make up for it in the food.", "business_id": "CuyNmwDOLeMTrbv2c6rNxA", "stars": 5, "date": "2014-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "g-fbtBnKwwbT_5lo5TNkQQ", "review_id": "naor8IH_hRHzWJfPu8EcIw", "text": "Alltown auto are currently taking care of my van and they are doing all that they can for it at a fair price.and they are keeping me updated on all that they are doing there are a good place to go for all your car problems", "business_id": "xeuglE_nXE8saZBJvF2yfQ", "stars": 5, "date": "2015-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nk5CqZnOt6iXE-32tf53TA", "review_id": "KtjMjZOQ70st7-M_Nmbq0A", "text": "Love the bran muffins and scones. Terrific when picked up in the am. Usually they are still warm at 7:00am and freshly baked every day. 1 day old items are usually 1/2 price if you want to save a little money", "business_id": "jKHRI4bg4fP8zQVpE4jsIQ", "stars": 4, "date": "2013-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "rO3WEI9L-_deUR9-JHuNQw", "review_id": "TjnT_50jS9keJItZkPdsig", "text": "When you want to know where to go for poor customer service this place is the perfect definition of it.  Never again will i step foot after our first and last visit to this horrid establishment. Customer service in my eyes plays a HUGE Role. If you are treated poorly what is the purpose to come back with their food not being anything amazing as well. We had come to this establishment for sushi night and sake bombs for the boys.  Their small sake bottle they give you with a huge bottle of beer to match but doesnt match really because theres maybe 2-3 shots worth of sake and the beer with sake should be about 5-8 shots rather than 2-3.  After waiting for our food for a good amount of time passed our huge amount of food ordered came out and was decent but not for the price we paid.  Not A Deal! What so ever.  So as we are still having a good time eating and talking to one another about random things and what not, my boyfriend got up to look at something on the TV since it was close by but not close enough for him to see what the score was on a game so as he got up to look the restaraunt was closing up and we were the last 2 couples in the place putting money in their pockets for the day; the owner or manager in a little button up tommy bahama type looking short asian man had gone up to my boyfriend and said CAN I HELP YOU WITH SOMETHING?! Very rudely said, and my boyfriend responded No, i was just checking the score. The Manager basically cut him off and said WELL THEN LETS GO! so my boyfriend came back to the table and had said i think they want us to go so we closed our check and had hurried as fast as we could. I understand when establishments close it is time to go!  But if its a mom and pop shop or restaraunt i believe in more or better customer service in order to get a tip.  I do not believe i have to tip over 15% if i was treated poorly. My boyfriend is too nice when it comes to tips in my opinion i believe people need to work for their money and just not expect so much from people if they don't try hard enough.  You treat me poorly i don't return or i excpect an apology of some sort.  If not you can expect no more money from my bank account.  \n\nTheir food and service what we paid for was ridiculous. I Will Never Ever Return. I Hope they Shut down. I think if a wait staff is really nice we would have been treated better then this on our first time here.  For what we paid i could have gotten triple the food in other place i know of. And as far as portions go 3/4 of the people that went including myself were still hungry leaving.", "business_id": "42xKe5YcCIKmGiqW0i4aGw", "stars": 1, "date": "2011-08-05", "type": "review"}
