{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1SUsOKqvB57nR6kJmjD1kg", "review_id": "jLEisNoe78aSeQ7iZgS4UA", "text": "I had a full face broadband laser treatment to remove sun damage (brown spots) about one month ago.  During the free consultation, Kim answered all of my questions and made it clear that the spots might come back in a few years, even if I use sunscreen religiously, and I appreciated her honesty so I could make a fully informed decision.  She also explained that the spots would darken temporarily and then flake off in about a week, and that's exactly what happened.  The results exceeded my expectations and I'm very happy with it.  The worst of the dark spots are completely gone.  I still have some lighter brown spots, but they are barely noticeable unless you look closely.  My co-workers thought I started wearing makeup!  On top of the actual results, Kim took time to explain my options but I never felt pressured to buy more/different treatments, my appointments were always on time, and Kim and the staff are very friendly.  The office is clean, quiet, and almost spa-like.  All in all, this was a very good experience and I'm very glad I chose Lasting Skin Solutions to do it.", "business_id": "1IxCNVVW9aKbK3BfQpI7eg", "stars": 5, "date": "2015-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XuavhETwynlnLRu-HOHr_g", "review_id": "YXBklM3RWCGFTUYoCHariw", "text": "Although the staff was friendly and the language was not a barrier for me as it was for others, the food I got was not very good. After I ordered the General Tso's Chicken, the woman turned on the fryer and, without waiting for the oil to heat up, she put in the chicken and my crab rangoon. Therefore, when I ate the food it wasn't crispy as a good General Tso's/crab rangoon  should be. Another thing that I noticed was that the chicken that she put in the fryer was sitting on the counter in the heat. *note: she hadn't fried any in quite some time which is why she had to turn the fryer on. The person that said the food was too sweet was right. Even though the menu said *spicy for my meal, there was no \"zip\" at all. Take it for what it's worth, but I know I will be looking for another restaurant to get my take out from now on.", "business_id": "oX6KamASYXnMIe5kpVhezw", "stars": 2, "date": "2013-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QP-MdjpUFejr9apuAWcfQg", "review_id": "BIrum9wet4nfGA6Vo0BwRQ", "text": "Never been upset with Loredo's.  Resturant is always clean and service is always good.  I prefer their new location in Fitchburg.", "business_id": "S4TWo9X6b3gU6uucj4JN3g", "stars": 4, "date": "2009-07-10", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "vstlH0OXjRsFYPlXOo0Haw", "review_id": "sqeKleJFH7PXycbUg1CI2A", "text": "Not only the worst BK franchise I've ever been to... but probably the worst-managed restaurant franchise I've ever encountered. It's a like a bad (bad) movie...\n\nOPEN ON two guys and a girl in a GREEN SOUL ordering drive through from Burger King on East Wash. They are hungry, but their order is easy. Just three burgers, twp fries, and one drink.\n\nAUDIO OVER (BK INTERCOM VOICE, with a bored lackluster air): \"Okay, drive up to the window.\"\n\nThe CAR pulls up behind two other cars waiting for their orders. And they wait. And wait. And wait. Six minutes later, the first car finally gets their food and drives off.\n\nThe CARS pull up closer. And they wait. And wait. And wait.\n\nA few minutes later, two uniformed BURGER KING EMPLOYEES, one man and one woman, exit the restaurant. They hang out in by the waiting CARS in front of the restaurant. Chatting for a few minutes, then amble back into the restaurant.\n\nThe CARS continue to wait. Minutes more pass.\n\nTwo more BURGER KIND EMPLOYEES, two women, exit the store with a TODDLER in tow, but they are carrying huge bags of BK food.\n\nThe DRIVER of the GREEN SOUL, \"This is ridiculous, we've been waiting over 10 minutes, I'm getting out of here.  Mickey D's is right over there.... Wait... Hey, are those BK employees carrying out FOOD?!\"\n\nBURGER KING EMPLOYEE #1, puts up her arm carrying a huge bag of TAKEOUT and uses her body to physically block the GREEN SOUL from leaving. The TODDLER wanders aimlessly and dangerously around the parking lot.\n\nThe CAR in front of the GREEN SOUL receives their order finally, and drives off. The CAR waiting for food behind the SOUL peels out of line, barely missing the wandering TODDLER.\n\nBURGER KING EMPLOYEE #1 (shouting at the CASHIER through the window): \"How long have these nice people been waiting?! \n\nCASHIER (searching for the order ticket): \"Um... 15 minutes.\"\n\nBK EMPLOYEE #1 (shouting): \"Well, give them two free ice creams for making them wait so long!\"\n\nSOUL PASSENGER #1 (quietly): \"It's okay, we just want the food we ordered.... And, besides, there are three of us. Not two.\"\n\nBK EMPLOYEE (angrily shouting through the cashier window): \"Just get them some ice cream... they were almost going to leave, you guys are so slow. Lucky I stopped them. You're the manager. Manage!\"\n\nA few more minutes pass. One single ICE CREAM is passed through the window to the waiting passengers. Then, finally, a BAG with the burgers and fries arrives. The GREEN SOUL drives off down East Wash. Watching carefully to be sure the wandering TODDLER isn't in the way.\n\nSOUL PASSENGER takes a bite out of his burger, and spits it out into a napkin: \"Oh my god! How in the hell did they ruin a Whopper, for chrissakes!? \n\nSOUL DRIVER: What's wrong with it?\n\nSOUL PASSENGER #1: \"It's cold. And I mean cold. It doesn't taste like meat. It's just rubbery and tasteless... and where's the char-broiled taste? Did they forget to add it? The cheese is in no way melted. There's a wilted mass of white lettuce core shoved in the middle, like a bad surprise. The bun crusty and stale.... do I need to go on--?\n\nSOUL PASSENGER #2, sampling a french fry: \"And my fries are soggy and cold, too.... and no ketchup packets in the bag. And my bun's stale, too!\"\n\nSOUL DRIVER starts to laugh: \"that was so bad, I expected cameras to come out of the door next, 'smile, you're on candid camera!\"\n\nSOUL PASSENGER #1: \"Or 'Punked.\"\n\nSOUL PASSENGER #2: \"We were punked, all right. Let's ditch this sorry excuse for food and order Culver's... the food is always hot and delicious there. And the staff is nice and helpful, too.\n\nThe GREEN SOUL exits East Wash, and on the way into CULVER'S, PASSENGER #1 exits the vehicle, and throws the BK bags of food away in the CULVER'S garbage can. \n\nSOUL PASSENGER #2 getting back into the car: \"Never again.\"\n\nSOUL PASSENGER #1 and SOUL DRIVER: \"Never again!\"\n\nTHE END.", "business_id": "XWDk-pLSbVE2Vvv9Z-zusQ", "stars": 1, "date": "2014-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jcGUFVS_UIrof6huuG2duA", "review_id": "1OVnYHqcrsg9yu8XadaLBQ", "text": "First I would like to start off by saying that I would have given a 4 star but they changed the sauce they use in the lasagna. I've never had a sauce with carrots and celery until now. Didn't like it one bit. \n\nOther then that this is one of the better places to eat on the north side. My wife and I love to hit up the bar for Monday night football. The bartenders here are really great. I don't need to ask anymore what I want to drink because they remember me (makes a person feel liked). Plus, I've never had a skunky spotted cow here. Don't know off they sell a ton of it or what. Beer and food prices are average. Pizza is better than average and topping taste fresh. \n\nI see people like to gripe about the name in crayon on the table. Who the hell cares! I stink at remembering people's names. I go here because it is casual.", "business_id": "ybkWtM1ZnT2ewuquj3A9KQ", "stars": 3, "date": "2014-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mHZmkIAn_CCLBcVobPaAFw", "review_id": "dYWkeHw_Er_SaaLcYAtZfQ", "text": "If I could give zero stars I would. I travel every week for business and rent cars all over the US. I rent with hertz as I'm a gold member and I like the way I am treated. Hertz is known for having the best customer service in the rental car business. I am very disappointed that my review today has to to be negative. I returned a car today at hertz at the Madison airport. When I returned the car I was told the fuel would be 100 as we didn't refill. I explained to the consultant, Javi Mitchell that we had opted for the prepay fuel. I asked her if she could please make the corrections. She told me and I quote \" I can, but I won't\".  I told her how often I rent cars and how loyal I am to hertz. She could care less and was extremely rude. I have never been treated so horribly before. There was obviously a mix up when I rented the car and it could have easily been corrected. Now I am paying 100.00 extra for my weekly rental as someone made an error and Javi decided she didn't want to help me.", "business_id": "bIDAOpeNv4b9qtMHqz3Euw", "stars": 1, "date": "2015-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xOe-ZopdYiu8ijimmtdrnA", "review_id": "1ZSIRY_JEWZt0oPThsdIlw", "text": "All I ever get here are the chicken fajitas and those are fairly hard to screw up.  Anything else I've tired here has been sub-par.  Really, the best thing about this place is the freshly-made tortillas.", "business_id": "wPidHd5FxspPRgVqdEQ-Xw", "stars": 2, "date": "2008-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "cWWNHJw-mBX_cAs04LabKg", "review_id": "nfXGoNd89X63C_xMawOyRA", "text": "Kind of a sketchy area and older machines (similar to the ones I had my old apartment complexes in Berkeley), but I give this place 5 stars.\n\n1.  Soap, bleach, and detergent dispenser ($0.50) each \n2.  Change machine\n3.  Regular washers for $1.50 a load\n4.  Oversize washers for $3.00 a load\n5. Convenience store right next door if you are hungry or thirsty\n6. Huge dryers $0.25 for 9 minutes\n7. THIS PLACE HAS WIFI!!!\n\nAnd the wifi is way faster than my stupid AT&T Uverse internet at home.", "business_id": "Z93nRPr4suUxo63pJR9dkw", "stars": 5, "date": "2013-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "EMootLNjzXIm7DMw1j8ElA", "review_id": "alx6970NK_CXc6cEzsJRFw", "text": "Needed a last minute ride to the airport and used Union Cab's web reservation system for an early morning pickup. \n\nLast evening I asked for a 5:40 am pickup and gave credit card info. Immediately got confirmation with web link to follow status of the order \n\nAt 5:39 the next morning the cab arrived and I was at the airport 26 minutes later. Driver  and car very pleasant and professional. \n\nI was impressed with the efficiency of their reservation and receipt process and I appreciate the fact that they are a workers cooperative but what matters most to me is that they performed as promised.  I will plan on using them for any future cab needs in Madison", "business_id": "5TQQy_x_ArR3_5L5L0fFVQ", "stars": 4, "date": "2014-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AYuf7Fopmel5twxCsOx6_w", "review_id": "MyUYh2GsQc2227W4pY5QLQ", "text": "It's my own fault for continuing to frequent this grocery store.  Rarely are there any baskets for shoppers to use.  Their is no mobile service so we can call home for last minute items.  The prepared food counter looks horrendous.  I wouldn't feed my pets with that food, during the dinner hour no less.  And when I asked a manager about the cracked, dried, nasty corn, she responded that the food is changed out daily.  Seriously??  And they are frequently out of things they normally carry.  If I go in for five items, I will on average walk out with three.  It's the closest store by a few miles for my neighborhood.  I wish a decent grocery chain would just buoy them out already.  They're TERRIBLE.  In fact, yesterday we just walked out without buying anything and then went and spent $60 at Hy Vee because they actually stock their shelves.", "business_id": "ZjwZIQM4TfFO7T7ck7FtYQ", "stars": 1, "date": "2015-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Fs80-3w9XrGwCV0HXe6CYA", "review_id": "Yh7ivlDK4CZeO7I_U-XniQ", "text": "I paid $17.50 for an inside-outside cleaning and was given a dirty car. After agreeing that the car was dirty, the manager refused to have them vacuum it again.", "business_id": "MFANntSgzNkjStqgB2xtHw", "stars": 1, "date": "2012-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "MQsO4ovQ_8GzWEnmUwXMvw", "review_id": "NvluLfTA_RJd11m99kjlIw", "text": "A bit of a run down, yet still clean, hotel. Front desk service was friendly. Room was on the small size. I requested two beds but was told they were out. Our room came with a sleeper sofa so that was fine for the kids. The entry smelled of chlorine from the nearby pool, and the floor was very wet from patrons who apparently didn't feel the need to dry off before going to their rooms. It would have been nice if the staff had mopped it up. Breakfast was good, with several hot options (waffles, eggs, sausage and potatoes). It was very crowded and the poor man running the breakfast could have used some help, but he was very quick to address and needs. The wifi was strong and easy to connect to. Lots of shops and restaurants nearby.  Overall, it was just a so-so hotel. It could use some updating for sure.  Not worth the 2.5 stars Priceline gave it, but it was safe and clean and had a good breakfast.", "business_id": "i9JeI7bd1qXGi15FoD45GA", "stars": 3, "date": "2012-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Mqo-rYo-Dc9aak22lT3RzQ", "review_id": "bll2YSRAc8TSGmLprcW1OQ", "text": "I have to disagree with these other reviews. My husband and I frequent Dexters often and really love the place.\nWe haven't ever had a bad experience with the service and love the food (our faves are the waffle fries, pub chips and the burgers). \n\nThe atmosphere isn't all that, but nonetheless it's a great little neighborhood pub with friendly bartenders, good food and great drink specials!", "business_id": "HTplzElel_F_U_qhWuDKdg", "stars": 4, "date": "2009-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "CRyOc3Njbf0jtRptTs5s2w", "review_id": "wz1m4LJwdv_TcbY3bR-6Cg", "text": "I go here all the time (about 4 times a month) and i have never had a bad meal or bad service.", "business_id": "0oQFFOdPZycIBmGkoBrlbg", "stars": 5, "date": "2013-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a0vp5kQ9beqxiaswsTd22g", "review_id": "-2yupk3l8Zsp7KRYQxJXyg", "text": "BEST burger I have ever had..\nKay served the best drinks and the best burger I ever had in my life . Love this place  ever...", "business_id": "QdSGdvZATzejDkSs435Rdw", "stars": 5, "date": "2015-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Jh2jS3evvGgv5vEiZlf3cw", "review_id": "d-U_8aYCJSPDUR7Qw-Oq-g", "text": "Most things here are great, but the checkout staff is something that needs A LOT of fixing. They are slow, unfriendly, and frankly, shouldn't be in the customer service field if they can't treat a customer LIKE A CUSTOMER. \n\nAnd that doesn't mean kiss a customer's butt while doing your job - just wear a damn smile and say \"Thank You\" every once in a while.", "business_id": "MLD-FXAHLbdiHOcyeoW-Fg", "stars": 2, "date": "2013-06-29", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 5}, "user_id": "5xFKzaWt1A_arxRR_WXC3w", "review_id": "zTz9RB1BwK2gHWRoy2XPjQ", "text": "Was staying for a night close by in Madison and stopped here to get coffee. I wanted to avoid Starbucks, because I find that I learn more about the place that I am staying if I avoid chains. This place was decently, honestly it wasn't much different than Starbucks but the people were nice, it was clean and I was able to sit there for a bit in quiet and read and sit my coffee. I think I was wearing a cardigan in July (the 60 degree morning was chilly for me, coming from Los Angeles!) and they gave me a hot latte when I ordered a cold one (-.-) but were pretty good about fixing the order and bringing it out. I just tossed it up to them thinking I needed to be warmed up in my cardigan.\n\nI later found out that this place is run by some Christian organization, which I would never have known while I was there. They don't do anything to forward religion, just coffee. I doubt it would have really bothered me if there was a crucifix up or something, as long as they didn't try to tell me about religion. \n\nOne of the things I missed living LA having come from Toronto is people can be actually decent to each other. I felt that people here were nice and police without it just being a facade of customer service.", "business_id": "JPFzpR5PvZWqHXQMIZFk2w", "stars": 4, "date": "2015-08-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "DjvVINffcfQcUA75SanlRA", "review_id": "U2lFuwAl0wmTZh_IQOYjLw", "text": "Stopped here on the way home from the Dells because you bastards said it was good and guess what!? I AGREE!\n\nAside from the fact that it was freezing cold in there, I realllllllllly enjoyed the hell our of this place. First of all, the menu is composed of a bunch of awesome dishes; I wanted to order everything on the menu. It was as if they had scanned the portion of my brain that deals with Amanda eating habits and wrote a menu based on the data collected from the scan. Fettucini Alfredo and a turkey dinner!? Blue Plate, you shouldn't have! I'll order both!\nActually, I got a turkey sandwich with avocado on it. I realllllly like avocado. I really like turkey sandwiches, too, and let me tell you Blue Plate did not disappoint. Everything was mad good from the salad to the fries to the sandwich.\n\nCheap prices, good portions... If you're in the area I definitely suggest you hit this place up. Mail me the leftovers!", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 4, "date": "2010-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "aTBMUikidf6qUOk9so8wrw", "review_id": "SNrE6p3l1mvOoZB-BhAarg", "text": "Disregard the sniffy reviews by food snobs; Monty's is great at being what it is, a nouveau diner with an eclectic menu, welcoming to old and young, hipster and square, LGBT and straight,etc. Great breakfast items (French toast,omelettes, scramblers, pancakes) available around the clock, lots of comfort food veg and non-veg dishes (\"meatloaf of the gods\" enchiladas, chili, etc.). Everything is freshly prepared with good ingredients. Not to mention the delicious pies and cakes..coffee is meh but that's par for diners. Prices are reasonable, two can be stuffed for $30. Friendly service by the mostly college student/artsy young person staff. If you're looking for a good solid (but not fancy-shmancy) meal on the E. Side of Madison, can't do better than Monty's.", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 4, "date": "2012-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "eVvZOw4iU8rw0tr5DHXDKA", "review_id": "1RAEhQZrAE0uONPfjlL0ag", "text": "It is absolutely what you want it to be. It embodies the era of diners so well. The food was delicious. I have had the Grilled Cheese and the Mac and Cheese (I added bacon, yum!) both were wonderful. The milkshakes and malts are amazing as well. It can definitely get loud and sometimes there's a wait, but either way it is definitely worth it for this Madison gem.", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 4, "date": "2014-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vo5M1aUer6VWcPiMnGL3IA", "review_id": "DGabLbL4SbXusTIRn1YOiQ", "text": "Excellent food! I had the chicken in a pie that was amazing! The crust was flaky and light. I also had a strawberry shake. It was all homemade food from local growers. I would highly recommend this place. The prices are a little high but the food and atmosphere was great.", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 4, "date": "2014-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "iOq6Y5Q4qGJ4GeBJgBgbCw", "review_id": "xHpKoJinaAtGSCQ2gSOpmw", "text": "I've eaten there dozens of times. Their eggs mornay is the best in town. Kudos to Tim and his excellent staff and the great waitstaff..", "business_id": "fjaQ3Ixkofh8xGhklUtDnA", "stars": 5, "date": "2015-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "NajmNP6fILQEt8pGbZNbaA", "review_id": "Q57Esw3lzrXbdCP2SSOerg", "text": "When I think of \"Hampton Inn,\" I think budget hotel. The decor at this Hampton Inn certainly did not suggest this. With the dark wood furniture, white sheets, classy black & white photographs accompanying the room numbers, and modern lobby, I felt like I was at a Sheraton or Westin. The staff was friendly and considerate too - we asked for a room that wasn't facing the highway and she took it a step further by giving us a room away from the area with lots of kids.\n\nThe free breakfast was also a step up from your usual continental breakfast - it included sausage and eggs that you can make a biscuit sandwich with, among a variety of other usual items. We didn't get to use their pool but it looked nice from afar. The base price was $119 but we had a 20% off coupon through Orbitz.", "business_id": "HYFwjbK7HbvzENF44ACfdA", "stars": 5, "date": "2008-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YT0iTm2y-Q9CoQhzYnIWSA", "review_id": "dDuJuPs54b5phLMkwFEZvg", "text": "Awesome gyros at a great price... haven't tried anything else yet but I am definitely a fan and will continue to go back (at least for a gyro)", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2012-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "sLC3IdsYUjcS-idx6aTE7A", "review_id": "RfwR8sgwkHozFlbk7_f_Aw", "text": "The most chill, relaxing, artistic coffee shop in Madison. Love the outdoor seating watching the bikers go by sipping on an iced tea. Their drinks are great. Service is nice, very polite staff. I also love that it's next to Absolutely Art.", "business_id": "UV9c6A16IXXA7JmkTor8Tg", "stars": 5, "date": "2013-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "u87-xLoPlBDyIhV-z-c8Pw", "review_id": "cWmbmmsoe0bS2I22BTwQ_Q", "text": "I don't have kids, so I've only been to one game where I haven't been in the Duck Blind.  The food's okay - the pulled pork sandwich is good, the burger is okay, the chicken slider is just a little piece of chicken on a bun.  The beer selection is great.  I'm not a fan of the Great Dane stuff, but there's still more than enough to choose from.  Sitting out here is a great place to mingle, but it's rough because I actually like baseball.  The sight lines aren't the best, but can be mitigated if you get there early and are actually around people who know what sports are (wtf would you sit with your back to the field while you doodle around on your phone?).  Getting there early also sets your mind at ease about getting your money's worth.  Let's face it, $33 on a weekend is a bit stiff.  If you don't get there early, you have to pound it, and then you run out of room, and the rest of the night will be shot.  Don't do that.", "business_id": "4N7dN61pyPfcxmKgXWQPfw", "stars": 4, "date": "2012-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 3}, "user_id": "sgkRdA1a1Vymdp83Qbikig", "review_id": "JJJ1ii_tbd8A8OFB9FUnmw", "text": "What a lovely way to spend a Saturday afternoon! ...Although I'd probably recommend going on cooler day. It is a lot of walking and sunshine...so really, regardless of the heat, you should slather on the sunscreen and stay hydrated! \n\nIt takes about an hour to 1.5 hours (going at a brisk pace) to cover all of the gardens on display. Some gardens are nicer than others, and there are a few that are still under construction. My favorites were the Sunken Garden, the Rose Garden, and the Thai Temple Garden. I thought that all of these displays are well thought-out and perfectly executed!\n\nLooovve!! I'll be back in the fall when the leaves change colors. (:", "business_id": "Q3GGB4ZMajP-Qmtdr1cVZw", "stars": 4, "date": "2012-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dRko0-SaRcSaP5gR-5uxuA", "review_id": "S8LRpSs-zCOMS-MrewtV6Q", "text": "Love this place. Their lunch buffet is great. So is their dinner menu. My partner and I went there for dinner on New Years Eve and for Valentines Day, we had so much fun. It is a relaxed atmosphere and they have great food. I recommend the Tikki Masala.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 4, "date": "2009-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hhVKwwMkejIS9f5_OILtBw", "review_id": "hwLGbumCoQwGeRyVTBvf1w", "text": "I went here last night with a group of my coworkers for dinner.\nIt's been a long time that we've been to Olive Garden   The food was pretty good and the wait staff was AMAZING.  \n\nWe had the following: \nChianti Braised Short Ribs (it's was ok, the meat was a bit overcooked/dry not juicy, risotto a bit too much salt.  Veggie seemed overcooked).\n\nBraised Beef & Tortelloni (really good, I was told my coworkers would get it again)\nTender sliced short ribs and portobello mushrooms tossed with asiago-filled tortelloni in a basil-marsala sauce. \n\nCapellini di Mare (really good, didn't smell fishy, pasta was NOT aldente though, a bit overcooked for my taste).\n\nGrilled Shrimp Caprese (pretty good per my coworker, shrimps were not overcooked, pasta a bit overcooked).\n\nBut the overall high rating for this place was more of our waiter Craig D.  Can I tell you, we've NEVER had a wait staff being so attentive for our party of 5.  He knew who got what, the timing of our drinks/salad/soups/main meals were on spot, like clockwork.  He made sure our drinks/water was full, the bread was fresh and warm, salad and soup refills even without us asking for more.  He made us feel like we were in a 5 star restaurant, really.  What great service, next time when we're back in town we'd go back again!", "business_id": "PhdMPqSdLZi6IV8SdnpUAQ", "stars": 5, "date": "2012-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "y_FoL3sc9vdjwwzthw8qBA", "review_id": "BsYmgC-hjTCuLtm7ioHOtA", "text": "I never set foot in the old Tip Top so couldn't attest to the transformation which I hear is remarkable.\n\nWhat I can say is this is my favorite all-around bar. Justin is a good down to earth guy. Even when it's busy he takes time to talk and makes custom drinks. I can definitely say Tip Top has the best mixed drinks in town. Add the tasteful decor and the decent pub food and this is one of the best neighborhood/dive bars in Madison.", "business_id": "JJFoeKZXgi2_LeECDMkkoQ", "stars": 4, "date": "2014-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "XDY6OPZWLIKEjBDCflxvww", "review_id": "3kgrhfHUZ7YDLlCXciAJUg", "text": "I love this place. I'm a competitive powerlifter, so when I'm looking for a gym while traveling I am very focused on the strength training equipment. While Ford's equipment is largely dated, it is functional and there are many options for free weight and machine work (if machine work is your bag). Squat racks are lovely, benches are adequate if a little worn, and there's generally enough room to get your work done. Everyone I ran across in my four or five days of lifting there while in town was absolutely friendly. I normally lift in a large, impersonal university gym in which everyone does his or her best to ignore one another, so I actually found this kind of surprising (and nice). $7/day is a very reasonable rate for daily visits and they have a 15-visit punch card for $90--again, reasonable if you're looking for a travel situation with a good gym. Hours are generally pretty solid throughout the week. Looking forward to lifting there again in a few weeks.", "business_id": "LkFYWBEdmHE05UkfIkK4EA", "stars": 4, "date": "2013-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "T_bpOTgrOkWgsxT4eExbmw", "review_id": "IqTspAY8MJ6Lx8e-MqLX8w", "text": "Horrible food no flavor I went with my boyfriend he had gotten the boneless buffalo chicken wings and I got the shrimp and chicken pasta and we shared the Mac and cheese appetizer bites he had a couple of bites of my food and on the way home I started feeling sick when we got home he felt the same way and turns out he's got food poising I wouldn't go here again!", "business_id": "ykxf0XiJt-d76dBwfO_yew", "stars": 1, "date": "2014-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4c1rkOh-GbHKtkwhQBo_5A", "review_id": "4roqmB_Kyaj4kurtiwX0Vg", "text": "Great BBQ!\nIt's a little out of the way, but worth the journey if you're looking for decent BBQ.\nI don't remember seeing any highchairs.  We ended up bringing in our stroller for our daughter to sit in.\nWhile you have to order your food at the counter, there is a wait staff that will bring your food to you and refill your drinks.\nNo alcoholic beverages... (that's why 4 stars).", "business_id": "HLWtNcf3l-wKb6v9duteMQ", "stars": 4, "date": "2011-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5bxacEO3UsDZ2OFiYJlwVA", "review_id": "Djk4a2LLquvEgBnyYSADNw", "text": "Platter for 1 satisfied my hubby, he is so picky. The baked beans were some of the better beans we've had. The pickles were like grandma made.  The BBQ chicken & ribs were tasty. I liked the grilled pineapple side.  Our only negative comment would be we had to wait a while for server to bring more ice tea. They were very busy.  Generous portions", "business_id": "HLWtNcf3l-wKb6v9duteMQ", "stars": 4, "date": "2013-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "eQSj2Pg6zlybas4UfipmrQ", "review_id": "OtHMNepFL6a_wBHa5Hg9rw", "text": "Fazoli's is not the first place you think of if you want some good pasta. Contrary to that comment, they actually are pretty good. Menu is small which is a plus for me. You're not overwhelmed by so many options that often times are repeats. The serve a variety of pastas, salads and pizza. I like their Chicken and Broccoli Alfredo Bake. The name says it all. Very simple dish with good flavor a even better portion sizes. It comes with a breadstick, however, you can ask for as many breadsticks as you want which is a really sweet deal. Someone comes around offering tables more breadsticks throughout your meal so you don't have to get up and ask for more at the counter. \n\n Price? VERY friendly!!! You can get a complete meal ( entree, side salad, pop and breadstick(s) for less than $9.C'mon! You can't beat that price!\n\nThey also cater which I would recommend if you're office is having an event.\nOverall, Fazoli's is a good place to dine.", "business_id": "XIZ259hZ6Yww3C0o97MgUQ", "stars": 3, "date": "2014-08-03", "type": "review"}
