{"votes": {"funny": 3, "useful": 7, "cool": 7}, "user_id": "JbAeIYc89Sk8SWmrBCJs9g", "review_id": "fBQ69-NU9ZyTjjS7Tb5tww", "text": "THANK YOU ROB! i truly appreciated all the help i received from this agent today who was able to removed the extra charges on my bill that the Pasadena Verizon Store on Lake was charging me on my bill for upgrading my phone.   When i went in i was having problems with my Blacberry and had to switch to the Iphone last week. Rob from the Pennsylvania store who i was connected today was able to look at my bill and all the notes and correct the problem immediately. Great Customer Service! He even set up a FOLLOW UP Phone Call with me On July 5th to make sure the credit goes through on my bill...I can't thank him enough!!!!", "business_id": "HZdLhv6COCleJMo7nPl-RA", "stars": 5, "date": "2013-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "o9XGClSBzCsQxbcCzTPdnQ", "review_id": "-TMo1bwdylczYG1fNdQtpw", "text": "I enjoy this TJ Maxx location. I'm not sure that any TJ Maxx in Western PA has as good of a selection as the Johnstown TJ Maxx, (yes, that's right, I really did say Johnstown) but this one is pretty close. There is plenty of space, and there is a decent homegoods section as well. Not huge, but decent.\n\nThis location always has a few Bliss products, which makes it top notch in my opinion. I mean, where else can you get discounted Bliss products??\n\nI generally don't have a lot of success with shoes at TJ Maxx because they never seem that discounted to me, but I have struck gold at this location several times. Last summer I scored two pairs of Cole Haan wedges for under $40 at the beginning of summer, and I've had success with booties here as well. Great deals on shoes makes me a happy girl!\n\nAll in all, this is a great location, and one that I frequent at least a few times per month.", "business_id": "LQFWH1AKJlXGmEBlIKsBCw", "stars": 4, "date": "2014-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SdQNhy_YaPCsuLetXR5WIQ", "review_id": "wGENKpqlIbR8ZzrEvle_ag", "text": "This is a pretty good HD. It is somewhat smaller than the ones in Ross Park and Monroeville, but they seem to stock most of the same items. Occasionally I do need to go to Monroeville to find specific items, however. With a 1920s house, I spend quite a bit of time here for getting materials for repairs.\n\nCustomer service is about average. Some people are very helpful, others not so much. In general, they seem to be better than the Lowes at the Waterfront. At least HD people know where items are in the store. I can't tell you how many times I've received completely different (and wrong) answers to finding stuff at Lowes.\n\nI would prefer a small hardware store (such as an Ace) closer to me for things like nuts, bolts, and screws. Ace seems to have a better selection than HD does for hard-to-find items. HD has most of the basics covered, however, and probably a little cheaper.\n\nI generally avoid their paint section except for equipment. I prefer the service at a Sherwin-Williams or Masterwork Paint store. \n\nWe've had decent luck with their garden department. We've had to return a few plants that died the day after we planted them, but they have never given us any problems with returns. \n\nIt's a big-box home improvement store, for better or worse. It's a convenient location with a decent selection. 'Nuff said.", "business_id": "qA1PXTv0snTO1gpNPm-Jfw", "stars": 3, "date": "2012-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7KqBzRCpi-HNS2M8DjpXAQ", "review_id": "IHEgk51pbkpIq6Rt5Zww5A", "text": "My husband left for Afghanistan and I received a beautiful arrangement from Dormont Florists with a hand written note from him. Then the next month came with another arrangement and another hand written note. I have received 11 so far...all hand written notes and all amazing arrangements. Josh went to them and wrote out every note, and they delivered, on the first Monday of every month, an amazing arrangement of flowers. The flowers last a week or more and are always top notch. They took pride in each and every one they delivered and I can't express how much it meant to me. Not many florists could pull this off. They were always on time...and it seems as though they knew how much the flowers meant every single month.", "business_id": "nrVJI0fhbjO1eOZZ5gLWqg", "stars": 5, "date": "2014-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "qOwMg5pNHA5G--Iz1HOplQ", "review_id": "Q3ekZ_aqDor_weMFY4a_TA", "text": "While not necessarily an art destination, this small gallery is a worthwhile diversion in the Strip District.  The small space features one or two distinct installations, and in addition to the exhibitions, the adjacent store stocks a variety of handmade crafts.  Worth checking out if you're in the area, not least because the admission's free.", "business_id": "porUqRPcw8GoTSvZoMH0ag", "stars": 3, "date": "2009-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DJHLV2keXWLtHomi0aofyQ", "review_id": "EBJkH3nkcnYRxJ1ICYbqBQ", "text": "I'm an optometrist's nightmare. I flinch constantly, hate things near my eye, and do horrible with eye drops. \n\nAfter a very unpleasant with another optometrist who snapped at me to stay still, I booked my appointment at Heidi Optics because it was near my work and prepared myself for something similar. \n\nHowever, it was one of the nicest experiences I've had with a doctor and the optometrist was incredibly friendly. Their machinery was high-tech and up to date, she talked with me about options for my prescription, and was very friendly I came with my own frames. \n\nI highly recommend them if you are looking for an optometrist downtown.", "business_id": "1qGq_IcIQLEESnVNMQ52xQ", "stars": 5, "date": "2013-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QZtUJwDilqJyxUpaNoOHtg", "review_id": "yNDeBu9sEAa_TCNY5fe8jQ", "text": "sound cat's is awesome.\n\nit's real organized and there's space to move. i think it's mostly new cds but theres a small used section. some vinyl too. \n\nthey also sell concert tickets for shows at mr small's. and garfield artworks. and 31st street pub. and maybe some others.\n\ntheres this boxish thing near the register that fuuull of 7 inches and some odd cds. they have the most awesome artwork and i like to look through them. but i never buy any cause i've never heard of any of the bands...", "business_id": "OmAWp8kUqXrW0umGdZgNUg", "stars": 4, "date": "2008-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "u2F_wCshIRLCKO0Un2R3ow", "review_id": "fuwUP6ryz202tJhyFE1Avw", "text": "As a general store that sells things for generally cheaper this is ok. Just ok. The perks are that is has its own parking lot, a large selection, and a big store space. Also pretty closely located most city neighborhoods. \n\nLets talk about a few \"thrift\" store points 1. Price... the prices here are not low, for what you would normally identify with thrift, part of the thrill for me is finding things for next to nothing. So when I see Walmart and Target prices on almost everything that makes me immediately suspect. 2. \"Charity factor\" I like shopping at places I know are helping others in some way. This store claims to offer opportunities for you to donate your goods so that they can buy them through \"Veterans of Vietnam\" who then resell your donated goods for a profit (google it I did). So there's zero charity factor to this store, its a fairly large chain for profit, profiting off peoples donations. Ha Say that three times fast. \n\nmoving on an example of my problems with their pricing, everything in the kitchen section was 12.95$ really? Even for some plastic japan made unicorn trays, yup. I will pay that for a vintage item I really like but only on payday and only because I am a geek.  Clothing was not priced cheap and I could find nothing by size its all by color which is odd.  Its crowded and many items are broken yet seem to be priced at full I found a kiddie gate, for my dog only to find the bottom latch was broken. \n\nCool linens in the basement still at good prices... bonus for that I found some cool old curtains I want to use to recover my mid century chairs I just bought.\n\nTips:\n\n Cash only! The next time I see one of these signs I am going to look around me and ask the clerk if Christopher Lloyd has shown up with my Delorian yet so I can be transported back to the future. Where they use credit card machines instead of ATM machines from 1985.\n\nAntique factor: 4/5 they do have some old stuff\n\nPicked over factor 3/5 busy shop but they have a lot of stuff\n\nThrift factor 1/5 Over priced.", "business_id": "cKtBFMESwsUWxTv6QjkTGQ", "stars": 2, "date": "2013-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "a4HNHqwmB0DEaNly8VV8mA", "review_id": "Wsv6vu6OiQTMIu0O4YWXdg", "text": "Flowers for my July wedding turned out gorgeous, I'd highly recommend Mt. Lebanon Floral!  (my bouquets/centerpieces were faith roses with cream hydrangea)", "business_id": "IrI9nBmRKIGFYnnmrHeqtQ", "stars": 5, "date": "2014-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cudIRdy0Aycq969tzDMYsQ", "review_id": "m28DoK73XjXFRzDYUKO5cw", "text": "Yesterday I received, without question, the most exquisite bouquet from Toadflax. \n\nMy family had been through a lot this past month, but this arrangement was so colorful, so diverse, so beautifully orchestrated, that it absolutely brightened my day and lifted my spirits for the evening.\n\nI'm hesitant to add a photo, as I honestly cannot get a shot that does these flowers justice.\n\nThank you, Toadflax! You've got my business for sure.", "business_id": "Ig74RHJuf1DbDmJNWQ-HpQ", "stars": 5, "date": "2014-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0LzlRSXLhEsVSWFEvW_5yg", "review_id": "aYeZm1Tm8hT5xfXgHVTvow", "text": "Although this store has great employees, it is in desperate need of a makeover.  It is absolutely ghetto inside.  I don't think they've redone the store since the early 90s.  It's an embarrassment on Walnut.", "business_id": "Lgyc-00L5pAELhjwUjAz-w", "stars": 2, "date": "2012-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F1muesDbOOWjJFlvw30ssA", "review_id": "442jkX9GeTqrzXCjd-L9-g", "text": "A good place to browse but merchandise is way overpriced and not all dealers are friendly, especially the new guy moving in.", "business_id": "xmT5TeUrFPMsE4B0KegIRw", "stars": 2, "date": "2015-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EmNH39JYWqGmAS4iF3l_gw", "review_id": "Kpaxz48MMBqh0L8HVkwHjA", "text": "Most Hot Topics are small & crowded . This HT is bigger & more spacious. I can actually walk through the store without being in someone's way.", "business_id": "67od4r5JHk-zeqX4rKzVVw", "stars": 5, "date": "2015-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pluf_aTM0XNqB0a3tm9k5Q", "review_id": "NdKfcBGgTNG_XqXF51h71A", "text": "Today 6/2/14 I made a appointment to get fitted for a bridesmaid dress. The minute I walked in the staff was super nice. Samantha G. helped me find the exact dress I needed!!", "business_id": "SmxYzoYDxMRMahF-PO7gHg", "stars": 5, "date": "2014-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Hubnerc_hJyF-0vFQ-Jsng", "review_id": "T1lOjr4WIHsyIxFg4ceJ6g", "text": "Great door greeter! \nStore pickup was fast courteous and professional. \nChecking out at the exit very impressed how Christian spoke spanish to the customer in front then English to us. ..to find out he speaks several lamguages! \nNot a rude or discourteous person in the visit!", "business_id": "NRS-Snzp3Izblw2OmmlsuQ", "stars": 5, "date": "2014-07-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "PpkKVodWC0sdn74TbHQLzA", "review_id": "quBLhJ3SUGZ8lr0imGR3gQ", "text": "Very Pleasant Receptionist!!!  Everyone here is always polite (staff) one of the Artists was friendly.  The Receptionist today was a 6 yelp stars friendly and helpful!\n\nToday was my third visit and the Art was OK - A-OK 3 yelp stars - The Exterior gets 4 stars.\n\nThe Interior Architecture (Combination of a burned out Church (Brickwork and woodwork and the Modern visible steel structure and cement floors) - Almost looks like a Architecture teaching tool!", "business_id": "6DDXjYE9g6KVH0qP_jJiUg", "stars": 4, "date": "2011-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "stwkv8R6D0a9C1ixX817Mw", "review_id": "25v2n3bzX8GCZr89vweBpg", "text": "I have never received worse customer service. The lady who is the greeter, has a nasty attitude, the first time I came to this store, I dismissed it as her having a bad day, I have came to this store a total of 7 times. And she has been rude and nasty to me since. I had to go up to her and she was playing some game on one of the Samsung tablets in order to check me in. She has rolled her eyes at me and glared at me while I was leaving. The only saving grace of this store is the actual sales representatives. They are very kind. And the lady who I described is not a  true representation of that store and I felt truly uncomfortable.", "business_id": "wXkcGMmtsDl_FTr1ac-n_w", "stars": 2, "date": "2015-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "0hdkW5qaQs4gTiUnRdadqA", "review_id": "Kjg_B7wY75ROSWUpC6id1w", "text": "Anything you could ever desire in film is available in this store!  Not to mention, it is categorized so perfectly: by country, director, genre, etc.  There was a place like this in Boone called Fat Cats (which also carries vinyl--love it!), but this store carries many more titles in VHS and DVD.  \n\nI found that the staff was very friendly, and movie buffs themselves as well.  I just wish that someone like that guy from Clerks worked there, just to spice it up and add a little comedy.  However, there are thousands of indie flicks (and mainstream too) and the membership is free.  \n\nI think I will pick up the City of God television series next time I am there, because the movie was so damn good!", "business_id": "STcLx0y_X89TsC0m2gVgHw", "stars": 5, "date": "2008-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gowVRmyDQU-Tpfy68NbKpg", "review_id": "r4Le-mE3hoEBPMuozeD1Ag", "text": "I will admit, I am being somewhat unfair and biased here.  For the so called 2nd biggest comic book shop in the USA, I was not at all impressed.  The indie stuff that could be found was a) few and far between, and b) the stuff you wouldn't want to read anyway.  Extremely limited toy collection.  Almost no clothes.  Certain ongoing series were entirely missing.  There was a lot wrong with this place... (not to mention the guy pointed out to me that the checkout hadn't been updated to the modern standard.... but that was no big issue to me)\nWhat made me not give this place a 2 or even 1 star flop rating was the level of cleanliness and friendliness demonstrated in this place.  I would say that this is the most \"professional\" comic book shop I have ever been in; almost office like.  The charm of most comic shops consists of the fact that they are a bit grungy and cluttered; this place was pristine, and it worked.\nThe collection of trades was AMAZING.  That also saved this place.  I have never seen so many in any of the stores I've been in (including both comic shops and big name book stores.)\nThe parking/location weren't very accessible, and it felt out of place for a comic \"community\".... but it did feel somewhat.... appropriate.... inside of the store.  This isn't my kind of thing at all, but for introducing a more business class/forward community of individuals to comics, this place works.", "business_id": "L1OqlH9UzjBK0js4sKs9cQ", "stars": 3, "date": "2012-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "d6BlOQ7hpH3iZZtTvna37g", "review_id": "v2dQL6BmSv8r8Fth7E7yKg", "text": "I've never been overly impressed with Hyatt. I first heard of it when they gained notoriety for selling $1mil worth of sales in one day in the days after Newtown.  It's in a not so nice area of Charlotte (thankfully they're aren't many) and the prices are high. If your local, you're much better off buying online and doing a transfer. The staff is ok, attentive and businesslike, with an undertone of 'buy or leave.' They have a huge selection and a very good website. For most locals, it's called 'High A** Guns.\" The only thing I've bought here is ammo and I don't really see that changing.", "business_id": "gR_Xp2i0M5iR-Ht7EipWqg", "stars": 2, "date": "2015-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QG_xAsQiuLe4bOOpds3x5g", "review_id": "uL72VcxWGZs1qbeUZgA2Kg", "text": "Luna is a great store to browse through - everything I came across I picked up to look at and I found several things I liked. They had great dresses, and I particularly liked their jewelry. In the back they had a sale section with some great dresses and tops. Only thing about this place is that the girls don't seem to be interested in helping anyone or saying hello. I didn't mind so much because I'd rather browse alone, but they didn't seem very attentive.", "business_id": "G9U_t5ClPfexHheBdj5V0Q", "stars": 3, "date": "2008-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dCprR53CkbdtPaQuLQwt4g", "review_id": "gk4071MMzKH3PEB1HWDCzw", "text": "when i first moved to charlotte this store was origanally krogers.", "business_id": "dNnAhFjYuVAo-tZq5Nov-g", "stars": 2, "date": "2010-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PpkKVodWC0sdn74TbHQLzA", "review_id": "eqgAt3M0EM5Wlkhia30gqg", "text": "Used Books!  Most of what they have are used books  The store has been in this location for about a year one of the workers told me.  Many people were bringing in their books to trade - Cool!  I Love used book stores!", "business_id": "1zzOURgQaOiv1Qq-k9lDVw", "stars": 4, "date": "2011-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J0h_oB2VEhMTlcqKmspjWQ", "review_id": "6Phabcv2qXSyiLDcztvfog", "text": "Being that this is the closest club to my location, I do shop here regularly.  I enjoy shopping at Sam's and get good deals on numerous items.  The fruit is especially noteworthy as it is fresh and typically sold in family-sized portions.  On my latest visit, I went to pick up a cake.  I ordered the cake a few days ago then called the day before pickup to confirm the order.  When I saw the cake, the word Toastmasters was spelled Toast's Masters and the club number was incorrect.  I requested it be fixed, with little time to spare, and shopped around to give them ample time to fix the errors.  Upon my return, the box was placed in an awkward location where it could have been easily knocked over.  The club number was corrected but the name was not.  I stopped by customer service to voice my concerns and was referred to the bakery manager but I needed to get back to the office with the cake.  #Disappointed\n\nSTRONG SUGGESTION:  Place your bakery orders in the store and visually review the paperwork to ensure the wording is correct.", "business_id": "e5xJGurgQboeP5AdX29Bxg", "stars": 3, "date": "2012-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "pXTM0MEmK24EO1NQK8zKMw", "review_id": "oril8e7RJUzUifN77YfsIQ", "text": "It's a strip mall near a bunch of hotels off the beltline.  They have a few cool stores like Ann Taylor Loft, Michaels, and a huge scrapbook store.  Other than that, its nothing special and you're probably better off going to another mall in the area for a more extensive selection.", "business_id": "x7pStpT09Tdc8d7oRU0Tmw", "stars": 3, "date": "2009-06-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1oXsV_I0TeschDfjM3Mr5A", "review_id": "P-njgWXdkuBthlDg_A1zzQ", "text": "I was impressed the first time I popped in this location. I didn't have high hopes since I was used to the Northport location. I found most of everything I was looking for and even one type of Japanese Maple I thought I'd never see here in a store in WI. If the drive weren't so far for me, I would shop here more frequently.", "business_id": "1F8xYvUsDyZwLUgZxPcb-Q", "stars": 4, "date": "2014-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oSA746-4MCJpWorJkzxqpQ", "review_id": "bu7qo6Sh6Eo-UkEAn0SE-w", "text": "Earlier this month I got a new phone with Sprint. When it came time for paying my bill, after setting up my online account just after receiving it, i went online to pay. Post log-in the payment page was \"temporarily unavailable\" - for 5 days. So I trudged in to town to go to the Sprint store to make sure that a) my payment wasn't late and b) thatI had a receipt (since Sprint's reliability for payment processing had now been put into question).\n\nThe store was busy and I did have to wait, but I was greeted as I came in and was acknowledged by 2 clerks who were with other customers. When a clerk was free, he happily helped me, made note of my comment about the website (saying he'd pass the info on) and said that if the problem persisted to come in and they'd see what they could do directly from the store. Very kind service! And everyone seemed genuinely nice - a rarity at a place like that. The store is pretty and well laid-out as well, with seats available if you have to wait. So far, I'm liking my new service provider.", "business_id": "pcRVuHC1RXOkLQJ_haePGQ", "stars": 4, "date": "2012-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RvweNJFVkR3ttkWsIBy7nQ", "review_id": "3ujytTlQ2UN83m-UIsO2-g", "text": "Out of the various Marshall's locations, this one ranks at the bottom. A perfect example: Yesterday I walked in to do a return. A cashier was helping a customer and another cashier was talking to the customer. I was the only person in line. However, within about a minute the line grew to be about six people. The second cashier still did nothing. It took her another few minutes to consider jumping on a register to help. My single return and possible shopping trip turned into only a return that took 15 minutes.", "business_id": "wsZbADFzxyn8_UBNRJ8kkw", "stars": 3, "date": "2015-06-03", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "4-F_5hXfiGITOwBRr9cGVw", "review_id": "6AckA74jDIeZhdY3UE2njQ", "text": "OUTSTANDING IN EVERY WAY. \n\nDarlene is the owner and #1 World Champion Queen of the Alteration Universe. I really cannot say enough good things about her. Her friendliness, dedication, and skill are unmatched. \n\nI started taking my dress pants here to be taken up almost 8 years ago when I was still in school at Ye Olde UW. At the time, it seemed a pretty far way to go for an alteration place (ALL the way on the east side LOL). But after the first experience, I would never go anywhere else. \n\nI took my wedding dress here for alterations too. As expected, a fantastic job. Now that I live 3 states away, I still bring stuff with me when I visit and have her ship it back to me! Yes, this place is THAT good. Friendly, prompt service, and very reasonable prices. \n\nDarlene and her staff (one other person who I've never met but must be equally as amazing), are just the BOMB plain and simple. Never had a problem with anything done here. Back in the day Alterred States was just a teensy little store in a strip mall on Northport. Now, she's taken over the big middle part! Just goes to show I'm not the only (extremely fanatic) satisfied customer! \n\nBest spot ever. Take your stuff here. You won't be disappointed.", "business_id": "DPViYrvLCByFRQBl90TLsg", "stars": 5, "date": "2012-07-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "t7yiQG80vW1CYH_SovC2Qw", "review_id": "pEaYo_g3boPQgdeFkKvkWA", "text": "I was very disappointed at the service I got here.  My iphone is 1 1/2 years old and was turning off on me constantly.  I didn't drop it and never had problems before.  I went to the store for help and they checked the battery and then told me there is nothing they can do unless I purchase a warranty on the phone.  I went home and deleted old photos and videos and updated the software and it no longer shuts off.  I just think it's ridiculous they told me there was nothing they could do unless I bought a warranty, when clearly there were simple things I could do to fix it!!!", "business_id": "qt3WwxMYShshHX7UsyTK-g", "stars": 1, "date": "2014-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "sgkRdA1a1Vymdp83Qbikig", "review_id": "_OUpTJRQQFCZpQ91Eqlg4w", "text": "I'm on a Madison grocery store reviewing rage! \n\nMetcalfe's is pretty much Wisconsin's own version of Whole Foods. It has the same brightly lit displays and wide open layout. I think the prices are comparable as well.\n\nMetcalfe's carries all the local goodies (Potter's crackers, Mad Urban Bees honey, etc.) that Copps and Woodmans don't carry. Some items are a little more expensive than other places, but considering the convenience, I don't mind paying a couple cents extra to pick something up at Metcalfe's. \n\nI was looking to pick up some side dishes for a picnic, and decided to stop by the deli to peruse their prepared dishes. I ended up going with the signature potato salad, which a hit at the picnic! I'd say that Metcalfe's would be the place to stop after work to pick up groceries if you are too lazy or too tired to cook for the night because you could always make a pit-stop by the deli/hot foods/salad bar before exiting!", "business_id": "OxR3b_qcMJlzwzGPU5fmdA", "stars": 4, "date": "2014-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rkAgDFTXosJyHpTF0U_aEA", "review_id": "bDMjshVXvgBh5OGNlOMZig", "text": "Its very nicely decorated!  Bought a TV, and a Tempurpedic mattress so far.  Going back for a Rowe sofa and a lamp!  Happy with the service and staff.", "business_id": "0wFlxz_fv9jqb73o0jl0TA", "stars": 5, "date": "2011-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "R7a7l_vthilWUndNU4gAeQ", "review_id": "q-SGdXk4FXUijAbz0kdvdw", "text": "A great place to go for advice, cigars + accessories, a smoke, or just plain good conversation.  The staff is extremely knowledgeable, and when I have gone in and asked for recommendations for pairings with certain liquor, their suggestions have been right on the money, if not a little expensive (though I'm sure if I specified a maximum price they would find me something without problem).  That being said, though some of the cigars I have purchased have been expensive, they've been worth every penny.  There is always a group of people hanging around and talking whilst enjoying a pipe or cigar.  They are always good for conversation, and I really can't imagine many places that I'd rather go.  It is a little cramped, but that's of little consequence.  I just wish they'd carry some smaller humidors.\n\nIf you enjoy a good pipe or cigar, you've got to stop by Jon's.  You won't be disappointed.", "business_id": "Y6jWHVbcWULr00HHYLCRyQ", "stars": 4, "date": "2009-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Si7eXJaNWVjOsAvb9nGFZg", "review_id": "1QHyntHna0AMedXYlRmxDQ", "text": "Amazing Service! I am 6 months pregnant and our AC broke last night, Joe called us back promptly but explained the difference in charges since we were concerned it would break our bank. So we decided to wait on the repair, he told us Mike would follow up with us the next morning, Mike gave us a call, we knew they were busy and they really couldn't get us in today but when my boyfriend explained how hard it is for either of us to get away from our jobs Mike showed up to fix the air...GREAT PRICE....GREAT SERVICE...I would recommend them to anyone and will. As new homeowners we have definetly found a local company that we will call in the future.", "business_id": "AVQQESeyYFE73ojSGtaNWQ", "stars": 5, "date": "2014-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kvo9zmhw-MVCfIZCzUbUpQ", "review_id": "mkAEiPR4lfADkgaLvG6oVw", "text": "Good products, but very, very limited selection compared to their catalog.  I am always surprised that they generate enough income to pay the rent.  \n\nBut here's my beef ... It has gotten to the point that I hate to go into the store. It's like a contest to see how quickly somebody can ask you if you need help ... Today, a 6ft 4in 20-something assailed me \"What are you doing today?\" To which, I rather cooly answered \"Shopping\" and tried to walk by him ... \"Are you shopping for yourself or someone else?\" To which I answered \" Don't worry about it.\" For Christ's sake, don't they teach their help to read a customer ... I am 62 years old, well dressed, and still cogent  enough to shop for myself.  Finally, when I left the store, the idiot asked me \"Are you having a good day?\" To which, I said nothing ... but thought plenty\n\nOK, listen up folks, when you ask me if I need help, and I am clear that I don't, let it go ... I probably do not want to have a conversation with you about anything.  Please shut the f*** up and leave me the f*** alone.", "business_id": "nZd7shef-v4CMNGIR8utNA", "stars": 3, "date": "2013-08-11", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "ApioERn8BQGE-HWEEZMM_A", "review_id": "F0jYaLaaQ2DNVH0le2JA2g", "text": "The owner, Danielle, cops a bit of an attitude if you happen not to be the most snazzy dresser in town.\nIf you happen to walk into her store with flat sandals and shorts, she and her right-hand woman will give you a staring treatment and monitor your every move.\n\nIt's uncalled for, and it's stupid. I don't get it. \n\nHer stuff is very pricey, and I swear I have caught her following me from a distance and \"keeping an eye\" on me just because I like to take my sweet time to look at and compare clothing. Or is it that I get special treatment because I have a bit of an accent?\nIt's demeaning and unnecessary. It's not worth the visit. Bella is more professional.", "business_id": "d-H7FdvcpIE7pQ-Z2Yl_wA", "stars": 2, "date": "2010-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "AsT_XKaBSi-w_3M2SOGD6A", "review_id": "V4xD-SV6g4hhq6oVXdwmOA", "text": "Sarah at Hancock Fabrics has been wonderful! I really enjoy shopping there when she works there. She's sweet and always takes time to help me figure out how much fabric I need.\n\nI also had my sewing machine fixed up there. They outsource the repair to another company out in Bloomington. It was kind of pricey but my sewing machine works like a charm now so I can't complain.\n\nOverall, the service is much there than at Joanne! If you can, check out Hancock Fabrics!", "business_id": "VJRgykgYkYna2MFdqZ5s1Q", "stars": 4, "date": "2015-08-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "04xKqnRGEIl0N8jeQ5ZWuQ", "review_id": "LvzG46iES-e2Aei5YW7INA", "text": "This probably the worst grocery store I've ever been to. It's constantly packed with usually only 2 cashiers helping patrons and as soon as you walk in it honestly smells like crap. I gave it 2 stars because at least the deli people have always been friendly and there isn't much for grocery stores in the downtown area. If you can avoid shopping here  do it you won't regret it", "business_id": "7Z7IkR_-94AjUuDw0fbI7g", "stars": 2, "date": "2014-07-14", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "nWouNfZD3Pw08RYizxkqcA", "review_id": "a4PHHM52wmonbDReJ434IA", "text": "A concert venue without booze? How can it be? Those were my thoughts when I went to a local music showcase here a month ago and realized I was going to have to watch a show without my trusty beer in my hand. The horror!\n\nSince they don't have a bar, the venue attracts that all-ages crowd, which translates to under 21. I'm not a fan of being packed in with the mini Pete Wentz and Avril Lavigne's of this world so I was miserable in this small spot.\n\nIf you're underage, you'll probably dig it here. It is a great place to see the up-and-coming indie rock bands. If you're 21-or-over, just be prepared to do this without a drink in hand.\n\n\n\n\n It's usually packed with a very young crowd and the small venue doesn't serve any alcohol. A concert veny", "business_id": "YRJKTPc7Tkz1cbjGHmOHuw", "stars": 2, "date": "2007-08-24", "type": "review"}
{"votes": {"funny": 13, "useful": 19, "cool": 20}, "user_id": "qwu5B9anH4AlEtau0K-6aQ", "review_id": "F7Zt1Ojlo62JkF7CnW5Vbg", "text": "Have you ever watched those dumb/boring/nerdy space documentaries that tell you lies regarding the impossibility of time travel? Some dude with a talking computer tells you \"...currently, there is no way to deviate from the space-time continuum\"... Lies! I'll tell you how to do it.  You don't even need to buy a time machine on eBay like Kip Dynamite. Just get into your car (no, it doesn't have to be a Delorian) and drive to 7th Ave and Thomas Rd (just south of Thomas on the E side), and BAM! You, my friend have entered another dimension.\n\nYou walk into this place and you expect to see Cowboy Biff sitting at the bar. Unfortunately, all you see is elderlies shuffling about. Well, they must know something that we all don't. Like an old man/woman secret that they only tell their peers. You, my friend, have just learned their secret! Sit down and order yourself a Black Bean Burger. What? You say you don't like vegetarian food? Well, neither do I! Trust me. Do it!\n\nWhile you wait, you can imagine you are your grandpa at 12 years old. Just stopping into the local soda fountain shop to get a smooth refreshing malt. Being a 12 year old in the 1930s, you notice how modern and sleek the decor is in here. Ice cream adverts everywhere... Makes you want to stay 12 forever.\n\n\"Mom, can I have some ice cream?\" Oh, I mean \"Sorry, can I get a strawberry malt with that Black Bean Burger? Ahem, thanks...\"", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 4, "date": "2009-06-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "WIKoNf2V1YKHKtlgX78iKA", "review_id": "Wp3Xt7ujO_bBVHiPTGoAhg", "text": "Historic, yes. Worth the visit, no.\n\nProblem 1: Hosting a political event without warning during the Saturday lunch hour.  No signs on the outside, no warning until we're in and heading for the table, and we realize, \"There's a guy, stumping for Mayor of Phoenix, and he's going to just talk the entire lunch hour.\"  So this means we can either enjoy conversation with our friends or we can sit and eat quietly while an unelected politician tells us why we shouldn't trust elected politicians.\n\nProblem 2: Very dry chicken.  Seriously, I think they stuck a frozen Wal-Mart chicken breast in the microwave and nuked it for 8 minutes or something.  How hard is it to make a chicken sandwich taste good?  So now I get to try to choke down dry chicken and terrible political speeches at the same time.\n\nProblem 3:  The candidate finally quits talking.  Then he takes a photo standing between the waitresses and says, \"It's like beauty on the outside, and beast on the inside.\"  No one laughs.  But then the owner comes up to our table as we're finally getting the chance to talk to each other, and she spends another 15 minutes telling us why we should vote for a certain party and why she wants to move into Phoenix from her home in Fountain Hills.  My favorite line: \"We need to make it harder for folks to drive so that they start using public transportation.\"  But of course, she's not using the light rail on her way in from Fountain Hills.  She just wants the people off her streets when she's trying to drive in and out of the city.\n\nThe only good thing about the whole trip--apart from our friends, who are awesome--was that the waitresses were professional and competent.  They earned a good tip and they treated us well.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 1, "date": "2011-07-25", "type": "review"}
{"votes": {"funny": 1, "useful": 7, "cool": 0}, "user_id": "meXB2eJmWVxYekJqm50RmQ", "review_id": "FshyJBz6tcoZE7Q1ruBxbw", "text": "I love Macalpines it's in my neighborhood\nI get the whole vibe .With that being said \nThey need to get a touch realistic they are becoming over priced its Thrifty ice cream \nNot Ben and Jerry's I'm not complaining \nBut when a Sandwich ice tea and a Ice cream is costing $17.50  then $21.00 with\nTip I  think it's a little too much ..., just saying", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 2, "date": "2013-08-01", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "tBvrnSCLSpUdCDm5w5GPkg", "review_id": "gbIs28xol8QAmeiS6h_Kpg", "text": "I don't know, what I had to eat was just fine.I ordered a Chicken Salad sandwich and potato salad and it was pretty good. I really liked the Potato Salad. It is a fun, interesting and great place to go. Unique antique shops attached with the original soda fountain in the middle. I was enthralled with the history behind the whole place. The Wayne Newton story made me laugh out loud a bit. Yummy Chocolate German Soda. I have not had an Ice cream soda in about 30 years. They have egg creams too for my East Coast friends.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 4, "date": "2015-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aFS79MWa0-zlU7SBpq1MDg", "review_id": "qW8tNZt-UtWXn5JpdeJ17Q", "text": "They do fast work, call you back when they say they will and did a great job. Very friendly in there, too. Very personable.", "business_id": "4anyLAWqWVZh5BFpol9czQ", "stars": 5, "date": "2013-08-28", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "8LAf67lQTjtsS98E55MYrg", "review_id": "sZOLNZP9_yyJWD4_GNk9lw", "text": "Not always the best price and often over crowded but still like Costco. My biggest complaint is that they are in bed with the sleazy company American Express. I so wish they would break that tie then I would give them 5 stars.", "business_id": "XLqnjlLYt0_q_NG7l_BpMA", "stars": 4, "date": "2011-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "A1D84JXibvLN2QQ5SK35qw", "review_id": "3DPWL1ZMouNkYJuOoVy1cw", "text": "great people buy all my gear here and there great", "business_id": "xiwuhksUyPmLwiZY1Dyqvw", "stars": 5, "date": "2013-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "V6rhoTCw7S6H8eHwv2M6Vg", "review_id": "wUx0YTTuZDH7CCHW5N1KJw", "text": "Slippery pig saved our butts.\nMy husband and I both got flat tires on a night out on the bikes, slippery pig was close and open!  Well not open for long, we had to high tail it over there to get the tires replaced.\nThe gentleman who helped us was quick and friendly.  He suggested better tubes that could handle the thorns that are generally in the neighborhoods around there.  We took him up on it and they have worked great so far!\nThe only small gripe is when we were leaving my chain fell off, granted they were basically closing the doors, the guy that helped us out said to bring it back tomorrow and they would fix it.  Yikes.  But once we explained that we would be riding the bikes home he let us bring it back in and they quickly tightened the chain.  No problems since!", "business_id": "42Ai9wcFPE2HZ_aADGXI9Q", "stars": 3, "date": "2012-07-20", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "RyzzI97Vq4IelbSp5wwGtg", "review_id": "pg_C9zlNj8stAMSkD-UC4A", "text": "This particular Walgreens is the closest to me and a short stop after my yoga studio. \n\nPharmacy: Always a line.  The pharm techs are usually friendly but some are incredibly apathetic and do not want to speak to customers.  The pharmacist I've talked to is nice. \n\nPeople are always asking for money inside and outside of this Walgreens. I was approached by a homeless person with a request for some purchases, and people are always just outside the door.   \n\nThe women in the cosmetics area are service-oriented, always ask how I am doing and are chatty while I check out.", "business_id": "HfWkdqxegjiGEXzI8j7Wwg", "stars": 3, "date": "2015-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "CiFzkZzsswAOmPPQnaUFqw", "review_id": "KXOp2F71oD5Koymyn3ZdAQ", "text": "As a professional recording artist and musician, I have visited just about every music store/pawn shop in Phoenix. While Ziggy's may not have the largest most current inventory the folks who run the place are the kindest most knowledgeable people I have ever met in the business. I recently took a bass in to them to have it rewired (I was ready to throw it out) and they fixed it like new for only $15! Ziggy's music is the quintessential mom and pop shop and they clearly love what they do. Huge Thanks Ziggy's Music!!", "business_id": "4Z4_92Lr5E58c9-3L3idhw", "stars": 5, "date": "2012-06-14", "type": "review"}
{"votes": {"funny": 5, "useful": 3, "cool": 2}, "user_id": "jQxxHLXLbFsNYNWNdSjRKQ", "review_id": "EHpwtXCYq8uIlxGjdcRfuw", "text": "DUDE..where is the manga....where are the card tables. .....What the heck is this place doing selling comics! This is outrageous!  And why are you talking to me and trying to help me comic clerk! Your job is to give me a huge sigh and exasperated look as if I asked you to perform surgery. This being helpful and friendly is really bothering me. You guys are just too weird. I need to go back to Atomic.", "business_id": "y9cQ0DBC0qFNgkpTXHzokA", "stars": 5, "date": "2009-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0CDKPyRcun_V9UFJhUxZcQ", "review_id": "kgEfQwEeIQbKvIbs612SzA", "text": "I've been getting my glasses for over 6 years from here and it's such a nice change from big chains. The staff really care about their customers being happy with their choices and they go out of their way to make sure they are satisfied! Patient and helpful, they spend the time to help you make a wise choice.", "business_id": "c8JCwGEj6WMDEpb1Tqp_cg", "stars": 5, "date": "2014-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XmpqbfSu9X7mjwJGUXTrAQ", "review_id": "r0A8Scy83gMN2iZ8sPPiYQ", "text": "I thought maybe it was just me, but I brought a lawnmower in for repair. They called me to pick it up and it was $55 or so for the tune up. They said it was working (they also said it was a piece of junk and I should get a new one).  When I went to use it the next week it still didn't work. I just bought a new one elsewhere. It wasn't worth the effort to argue with them on a mower a friend had given me and that someone had left out in the rain (prior to me bringing it in for repair). I was thinking about bringing my pressure washer in for repair, but seeing as my experience wasn't overly unique, I think I'll take it elsewhere.", "business_id": "oZ5ajWJBFG2HkfYoT3brvg", "stars": 2, "date": "2015-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "f8dilgbBoQLxDgQB_T_qFw", "review_id": "bLHxWPQbNKSHZeznhIzkww", "text": "I really like Central Phoenix Eye Care. They have a clean office with new equipment; they're front office staff is super friendly and helpful (I brought my workday lunch into the appointment because it would get so hot sitting in my car, and they offered to put it in their fridge); and the doctor is kind and efficient.", "business_id": "gztTQsgq6FJwIoV4P4RNIw", "stars": 5, "date": "2013-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lCuQt3OikgWoRWxq-Phzpw", "review_id": "Rl6VFGm87-Qj55BWPApA3g", "text": "No comic book store in the Valley can top Samurai's knowledgable and friendly customer service.  Come for the comics; stay for the fun environment.", "business_id": "HgoYXFi_R2LbzYUDsa79Sw", "stars": 5, "date": "2010-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zQgFeH7nMDwjm8MTlNXLVQ", "review_id": "BMfdRG9BH_YUav0TPsrg_A", "text": "This is a great consignment store.  They are VERY friendly, always greet you as you come in and they have a great selection of things for sale at great prices.  I'm pretty sure you'll find something that suits your kids desires and/or needs. \n\nI have yet to bring in any items to consign; but, will definitely be doing that next time I stop by!", "business_id": "jcWWytqmzMK7gu5zOmxkYg", "stars": 4, "date": "2012-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Mmew2rqnwj8FW3qD9wsaQQ", "review_id": "iPsYZgwnxdfCBTwdwBZDcA", "text": "After returning from my trip from a big city fashion district, my inner creative genius led me to Sas Fabric. Upon entering the location I felt a gush of endless and surreal inspiration. \nWhy the fuss over a fabric shop you might ask? The fuss is over Sas Fabric shop! Move over Joanns, Walmart or any other ratty fabric place because no one beats Sas! An array of funky, bright, subtle, soft, crisp, shiny, and neutral fabrics fill your eyesight welcoming you to explore! My imagination was running wild in here! I felt as if I was at a true NYC fabric supplier! Other fabric stores in Phoenix simply do not compare and carry FAR less unique fabrics. Joanne is also more catered to the grandma crowd rather than the modern D.I.Y. creative soul. I highly recommened Sas for all fabric related projects. I've become loyal to Sas for its quality and superior selection. The staff is also very quick and experienced so they get you on your way to fulfill your creative urges! Five stars :)", "business_id": "nbO0X6SNrZWOoDQS3WQCPw", "stars": 5, "date": "2012-07-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "SZbZdfd1uXmN1aXPn1MGUg", "review_id": "E4Mul023si50pP0mfWQSXg", "text": "Mixed feelings about this one. Most of the time I go in and find a group of nice, helpful employees and a great selection of unique clothing items that can't be found anywhere else.\n\nHowever, I stopped in last week and experienced something totally different. I  walked in with a few bags of clothing in my hands that I intended to sell. There were two middle aged men behind the counter who barely looked up from their conversation to tell me to go sit down and they'd call me when they were ready. I sat and listened to them chat to their friend and, oh boy, these guys were snobs! One was talking about how he would judge anyone who shopped at Kohl's (seriously), the other agreed that he preferred only designer clothing. \n\nI found this ironic, as when I was shopping around I noticed that the quality of the clothing seemed to have went downhill - from cute, unique pieces to standard \"fauxhemian\" goodwill buys. For the first time, I couldn't find a thing I actually liked. They ended up not taking any of the pieces I brought in, which wasn't surprising considering the kind of clothing they were currently selling. I think I'll be sticking to the tempe location after this disaster of an experience!", "business_id": "JmEp4DxBEIrFD-rgbL8bvQ", "stars": 2, "date": "2014-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 3}, "user_id": "gx3ZRjh43OOuavKl_rXvrA", "review_id": "zR3U5g5N9XvFmrhlenymjA", "text": "Four stars for walking out with $5 less out of my wallet.\n\nThe store is massive and categorizes it's items well. There was tons of sales items ( possibly due to the season change ) and I managed to grab two frames for 79 cents each and some washi tape for $1.49. Pretty good deals though the normal priced items were a bit steep. Most items were 30%-80% off. There was no line at the register and was helped by a friendly woman. \n\nIt's easy to get lost in here, because your creative juices get flowing. Happy I could buy some things to decorate my place without breaking the bank.", "business_id": "GrGHVKec258eN1_gtJwS1w", "stars": 4, "date": "2014-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "THYIqfnLV54VZ_v2hCfq2Q", "review_id": "nvGfX9AIEcwa6mAmoUDW5g", "text": "Great sales on men's professional salon liters of shampoo and conditioner for us hair snobs.  They carry Joe Grooming for men,  the shampoo and conditioner work perfect for the desert climate here.  They have a number of colognes for men also bit you can find better pricing else where.  They also have a rewards program based on spending.  Store is clean.", "business_id": "BHFBi9eEQqzh8QaUYyngjQ", "stars": 4, "date": "2014-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BsgXTs_hz4AwgbK0wSIIxw", "review_id": "hBIlc-AsDLINYdcNrollXQ", "text": "This place is good for printer ink and paper but the rest of the stuff is overpriced and the staff are not very knowledgeable or helpful really.  The only think I like about this store is the ability to order movies, music, ink, etc. and pick it up there w/o having to go into the store.", "business_id": "kEqcAtMaC6hcY8Wbi1nxtA", "stars": 2, "date": "2015-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4MnVm1LWQ2ZXso4ORe_fZA", "review_id": "w1dHRPawm2KxvAv-QF47bQ", "text": "CVS is pretty standard, right? Pharmacy, overpriced beauty section (but you sure avoid going to Ulta if you can find what you're looking for there), great sales--on booze, on food, stationery, games--whatever. When I lived across the street, I used to come here at night when I was bored and it wasn't busy. Now, though, there are new employees and unfair practices. On more than one occasion, the employees have held sale items for themselves behind the counter. Today, there were no Connect Four on the shelf, but there was one in the cart behind the counter. When the manager was asked about it, she shrugged and pointed at another employee. I've worked in retail before, and this goes against most store policies. \n\nSo, the next time you get a CVS flyer, remember that if it's okay for the employees to shop the sales for themselves here--then it might be happening all over the place. And if they can put one item behind the counter for themselves, then they can put a lot more for their friends. Prepare to be disappointed. Make the extra trip and hit up Wal-Mart.", "business_id": "h-Ospc-uiMH8TLquTeAr3A", "stars": 1, "date": "2014-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "aFQWSsZE6DvzqcckaC6EmQ", "review_id": "8JRVbmFUjrFDAbB0U6usJg", "text": "Went to this store to buy shoes for my husband and the sales rep was so honest and open that he talked us out of buying that type of shoe for the sake of my husband's back health. We hugely appreciate this type of honesty and integrity and husband said I could buy a new sports bra just so we could support them!! Sports Bra was on sale and is one of the best I now own. We will go back there for everything we need to support a business that puts integrity over profit.", "business_id": "P6H-p8fXbPq8VjO4kLTz4A", "stars": 5, "date": "2014-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fqIZkXTguYNadbx_siQgWQ", "review_id": "l4bFSn859CLtxZ-PaCPomg", "text": "Great service- I had a Gucci watch refurbished for my daughter.  The staff is very friendly- I enjoyed looking at many different jewelry options.  Beautiful silver collection (my favorite.)  A little bit out of my way but well worth the trip for special repair or requests.  I would like to see more of a selection, so 4-stars for that reason.", "business_id": "xaWje-dMVpAEQQMKv9556Q", "stars": 4, "date": "2015-07-12", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "joIzw_aUiNvBTuGoytrH7g", "review_id": "KIveB-ZZwsdbutGKb8JzLw", "text": "Great friendly service here which was quite a surprise at the Biltmore.  I've had negative experiences at other merchants so I had reduced expectations for a jewelry store.  Outstanding selection of brand names for timepieces including Chopard, Breitling, Rolex, and more.  They were very willing to show me several pieces without much prompting.  I can't stand places like Ben Bridge that seem so reluctant to take out a piece for closer viewing.", "business_id": "CBwfqbMvp-_l9Klx1wra2Q", "stars": 4, "date": "2009-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8niBr_UF8OIyiaGgB96KAQ", "review_id": "10OP9wtO473WN-ux6HDrXw", "text": "I love this place,  I don't know why I didn't say so sooner.  They have fixed and found solutions for a myriad of problems over the years.  They even fixed a chair for me.  I had problems with that chair for years and had paid chair repair guys to no avail.  I just now called for some advice on my swamp cooler because I totally trust them and again they were great!", "business_id": "ZDlA4SPGz-fs_mjE6wVWnQ", "stars": 5, "date": "2014-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IY0NXUHoLLomOf1PHJZvQA", "review_id": "BuS7-98ePy5lWfOvptD-Lg", "text": "I needed a classy gift for a shower and this store didn't disappoint. I felt like Alilce in Wonderland...so many beautiful and whimsicle options.  They wrapped my gift so beautifully, I think I had the best gift at the party.  Really impressed with the store, staff and service.", "business_id": "p1W5b0PVWP0Y-ANLmN0wHg", "stars": 5, "date": "2013-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1Zy4W8RWI2WtKDIk3oJprg", "review_id": "f8GACh-b394KNUA79ZWkig", "text": "We just recently got married and I want to thank Darrell and Bonnie for helping my husband (now) in finding the perfect ring. Everytime we have entered their gallery they have always been so accommodating and understanding. Bonnie has a gift in picking the perfect peice for the client! \nEveryone is always so nice and we love the dogs!", "business_id": "PaBjO5u25govLw1m8pI9Hg", "stars": 5, "date": "2013-06-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "2hXL2ExBsgjJNpm6BJy0lg", "review_id": "T4ITKvwQf_6XKxAsRV3cyg", "text": "Just when you thought your kitchen was stocked, one visit to Williams Sonoma and you will think otherwise. I've always enjoyed this store, as they have so many fun gadgets to make your at home culinary experiences so much easier. My husband and I registered here for our wedding, and there's nothing more fun than shopping for all of the quality kitchen items they offer with someone else's money. Not only is it fun perusing all of the items in the store, but the extra enjoyment comes from the delicious samples they always have. \n\nWhat's also great is that they offer free cooking demos every Saturday. I went to the one last weekend, and learned how to make fresh pasta and then got to sample it! The staff here is always very accommodating and helpful. I will return many more times for that kitchen item I never thought I needed.", "business_id": "31bXixwy2GNmRlhpl21reA", "stars": 4, "date": "2013-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cfeO6xo6wTCep7gAjnM-eA", "review_id": "6-aBYEpzmgfMT0UAZmxEMA", "text": "I have nothing but good things to say about Ryan and Sun Valley Stereo.  I purchased a full system setup in 2009 from them for my old 1990 Buick which sounds spectacular.  They custom fitted everything and have always been available to fix things cheaply and fairly as needed.  I will always use them for my audio system needs.", "business_id": "xI_iG7X6BcdLtj57bkUOqQ", "stars": 5, "date": "2015-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "3NlrLWgEsZUyPoCItSxnRw", "review_id": "DEAsFM9Iwg6ITuZjNSSt_w", "text": "Although my review of some years ago was not very good, Apple has seriously kicked up the customer service.  There has never been a time that I've not had the Genius Bar solve the problem.  Kudos to Apple!", "business_id": "l5vzFaqSjvxZiRn0MJeKkg", "stars": 5, "date": "2009-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "W_7aQXf0uC4GKvte4tlewA", "review_id": "qrjWGmTzBMqZIbh8kyeLiQ", "text": "I try really hard to avoid coming into this store.  Everything displayed makes me want to just give them my paycheck.  Sadly my need for food and sleep prevents me from giving them every dollar I make.\n\nI'm happy to see Apple making a come back.  I went to college for Graphic Design and the majority of my classes where on Macs.  I had to transition to PC for my new career and having a Mac at home helps keep me sane.\n\nThey really do \"just work\".", "business_id": "l5vzFaqSjvxZiRn0MJeKkg", "stars": 5, "date": "2013-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8-VLDMz0nAV7dm4tFBSGTA", "review_id": "IkWV7bN2pKf3rImTzhSNJw", "text": "I would give home depot/home services a -10 stars for their horrid business practices.\nA week to get a MEASURE SET UP FOR CARPET...and then another week to get it laid???? ok..the measure window to set up a masure 7 to 9 am..yup..they called at 9 and wanted to measure between 10-12. even though I asked for a PM measure..\nafter several phone calls to the big wigs ..and 16 measure people out there to do this (their demand to measure) could not do it til next monday..then put the whole laying process off even longer....you know what? I CANCELED THE ORDER AND WENT ELSEWHERE ...GOT BETTER CARPET AND ABOUT THE SAME PRICE...GOT THE MEASURE RIGHT ON TIME AND SCHEDULE FOR PUTTING IN TWO DAYS BEFORE HOME DEPOT COULD MANAGE IT...\nHOME DEPOT SUCKS", "business_id": "DC77ROlgfnpxQNFKQbbpnw", "stars": 1, "date": "2014-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r2KPiKG0S3M3w9FvQbm_lw", "review_id": "tvUpfzhBp_z4b2fTVeAucA", "text": "Cute store tucked in by La Grande Orange and Tammi Coe. Parking is a challenge to be sure. They have tons of gorgeous paper and although what I was looking for was a little obscure and not something they had....Lydia took the time to refer me to where she thought I could get it. She had a great solution to another item I was looking for and even emailed me a link to some great ideas. Great customer service and a beautiful product. I'll come back again for any of my paper needs.", "business_id": "mG5WTamjKzje897WkCXiTA", "stars": 4, "date": "2011-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 1}, "user_id": "CAGpXIX6Hz19CpeYQaGEHw", "review_id": "skx02nxLIMGh8fXxcJ1FYw", "text": "Teresa and get team do a great job creating unique arrangements. I love their style as it's very vintage yet romantic. I received flowers from one of my top makeup lines and the arrangement was absolutely breathtaking. The flowers lasted for about two weeks. Of course there were some that needed to be picked out but other than that the arrangement had strong lasting power. I've had a few other arrangements from Teresa since then and I always get tons of compliments.  Her staff is also very friendly and can design whatever your hearts desire. Highly suggest.", "business_id": "Qy1UAXzY6qEr6Ive_lksvA", "stars": 5, "date": "2014-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SU_3BVwlMYu_047vJmmgIw", "review_id": "_dJSwmrVUvSbvhPhhnj1Dg", "text": "Lois in the print center is gold. \n\nAlways helpful, friendly, on top of it, and composed. \n\nThis has become my go-to print destination, even when it's out of the way, because I know I can depend on an easy, smooth experience.", "business_id": "JksZiHb_Vj1tYRTpuTg-uQ", "stars": 4, "date": "2014-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "T-HUEwlRl5d6lun1cZgiCA", "review_id": "NTgW4yTy9GuDuILLd2y9bA", "text": "Best nursery in town hands down.  Very friendly staff and extremely knowledgeable that will spend plenty of time with you to make sure you get what you need.  You won't regret doing business here.", "business_id": "7p0OI2Ld46-EzJkRHGQEJQ", "stars": 5, "date": "2010-07-06", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 4}, "user_id": "GubdNFoDAsiwE6bWIr97cQ", "review_id": "oVQ-weCrGLoG1a5ijRM7NQ", "text": "Pruitts is a pretty big place, you will never lack for a sales associate none the less. There is a huge array of furniture for the whole house; yet I have never found anything I would consider buying. This is not to say the furniture is bad, just not my taste. If this place does fall on your design map, it is a great place to get good deals.", "business_id": "XThGLVVN4oVybmv2gFS1Wg", "stars": 5, "date": "2008-08-22", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "cwVnO3WsdMMldvx9R8HSIA", "review_id": "rC-rteBNOFDnqY-XVNMyLw", "text": "Furniture was great quality, delivered in a timely manner, and the employees who assisted me with my selection were great!", "business_id": "XThGLVVN4oVybmv2gFS1Wg", "stars": 5, "date": "2015-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7o7MF9B9lxcWupE8jiLOaQ", "review_id": "TAaRVmecG1H8HXwkOH1IoQ", "text": "This place is great! I've bought more than a few items here. \n\nThere is always a good selection of items and the best part.. THERE ISN'T CHEESY CRAFT CRAP! I'm one of the people that gets irritated when I see these types of things in an antique store. It isn't a craft store..it's a place for OLD things. \n\nTheir selection of OLD items is great and their prices are decent. The staff is always really nice and they are open on Sundays, which can be a rarity in Antique stores. I don't think this place is cluttered, I think it is laid out well. If you are looking for something in particular, the staff is very knowledgeable about what items are in the store. Overall great place to go!", "business_id": "9ryGi1IxglgxuZEmfDQfAg", "stars": 4, "date": "2011-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uJKzEWZ_HeW_KPY1-edGbA", "review_id": "PlIMI18wLUUZ7mM8pT4WhQ", "text": "Came in at 7:35, still not open even though it should at seven. Really nothing else to say- everyone else hates it, too", "business_id": "KEwv4l2RgiHjkjyYV0TuAg", "stars": 1, "date": "2015-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "Ouus3lC3Xk3YRGx4ptd_4A", "review_id": "cwuNePJjNTR6lleMJF2aXQ", "text": "Went on 4th of July and they were closed for the day.  Bummer.  Next to Hissyfits, children's used clothes.", "business_id": "sz83FiPYmJ0uQFn0cjY9xA", "stars": 3, "date": "2008-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0obYN--CF5i-73VPzkFmnw", "review_id": "q3a6IcHEQFlBDKte1GFvrg", "text": "I shopped around before I took my watches in for batteries and repair.  I have an extensive watch collection and I wanted to ensure they would be taken care of.  \n\nFirst, I called and they were the nicest people on the phone.  Most other jewelers I called sounded as if they were rushed and didn't have time to answer my questions. They were patient and explained everything.  I had to call back a second time, I forgot to ask a question.  I arrived at the store and they were very attentive, listened to my request, as I had some repairs also.  They gave me an AWESOME bulk rate for the amount of watches I took in for batteries and repair.  They called one of the manufacturers for me, for a very unique watch/band combo and was able to get the information the next day.   I HIGHLY RECOMMEND HINRICHSEN for all of your jewelry/repair needs.  I will be visiting them again soon.  They have a great selection of jewelry in the store.  I looked around a little while I was there.  \n\nThey are patient, listen, and follow through.  I am very satisfied with the repairs and battery replacement.  They are close to my home, saved me a trip to the mall.  This is my new neighborhood jeweler.", "business_id": "hD8McD6pHAKF9SMbhi-SSw", "stars": 5, "date": "2014-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M3Ef4amQljYDjhOnP7T8iA", "review_id": "t0pXG0tvshrw-O7W8wtpjw", "text": "Jostens builds a great looking ring of very good quality but their customer service is HORRIBLE!\n\nI called them about an issue of the delivery date being way behind and was told \"I will get someone to call you right back\",  Several weeks later received a call (after the rings were finally delivered) asking if I was satisfied.  Well no I am not satisfied.  If you can't meet your proposed timeline and don't have the courtesy to even return my call in a timely manner you don't deserve my business.\n\nFind another ring vendor!", "business_id": "dL0A8XofOhRncXXkKVu0jg", "stars": 1, "date": "2015-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ciUuzVQZhB2n11H7xAF9Iw", "review_id": "z8MGySuhFzPSeaSJE73v2w", "text": "So I need a haircut.  And in a Costco in southeast Phoenix, where I live, I see this gentleman about my age (senior) sporting a really good do.  I ask him who does his hair, and he gives me the same of Sandy Clark at Salon Boulevard.  I call Sandy and make an appointment for 3:15 on Wednesday June 4. \n\nToday (Wednesday June 4) I roll out, leaving plenty of time for the 20-mile-odd trip, but Sandy's directions are so bad that I spend almost 20 extra minutes trying to find the Salon. \n\nAt 3:15, the moment I realize I'm going to be late, I call the number Sandy gave me; the same one I used for the appointment.  It's her cell phone, and it goes to voicemail.  I leave a message explaining I will be a few minutes late. \n\nAt 3:30 I call again.  I get voicemail again. I  leave a second message explaining that I am cruising the parking lot unsuccessfully, but nonetheless on my way, when I spot the Salon.  It's minuscule, and tucked away in a dark corner with tiny signs to identify it. At 3:35 I am inside. \n\nSandy, however, has left.  Deciding within 10 minutes that I would be a no show, and not bothering to check her phone, she trotted off to do something far more important than attend to a paying customer with a reservation: you know, someone who might easily have become a repeat customer who brings his own friends in.   \n\nInstead, she gets this sucky review on Yelp!, plus warnings to all my personal friends, colleagues and business associates to stay away from her and from Salon Boulevard.  Oh, and on Facebook too.  What her hairdressing skills are like I can not personally vouch for ... but if she loses focus this easily, I guess I'm glad I never had the opportunity to find out. \n\nThe lady behind the counter tried to offer me another appointment with Sandy Clark on some future day, but given the above -- plus I don't see the point in another 40-plus-mile, possibly pointless round trip -- I won't be showing up there again. Ever.\n\nAnd in my opinion, neither should you.  \n\n(Tabitha, where are you? Salon Boulevard needs you!)", "business_id": "z7F5NHgN1iqSaNDbADhvlA", "stars": 1, "date": "2014-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6Aj876KayX9hfsO8a2_BMw", "review_id": "vGXe0x3qOu64T8JNE-i99g", "text": "Excellent store, has most powders that can't be found anywhere else in stock, along with even the obscure bullets from Sierra that I prefer.", "business_id": "o4JSQ3Cw30TtshYMBnKWSw", "stars": 5, "date": "2015-06-08", "type": "review"}
