{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "27aGnUabXY23OH5oilHe7g", "review_id": "yj93YvVcqfAT38dQJkxAkg", "text": "Unfortunately I have to totally agree with Drew. Stay far away from this place if you want consistent, competent treatment. They operate under one Physician, which I would not mind at all, if the nurses and PA's were the least bit competent. \n\nOffice staff is snappy, rude, and never apologetic if something goes wrong. \n\nThey have turnover on nurses worse than McDonalds has on drive-thru service. Which is scary.....one nurse will put you on a medical prescription plan, then your follow up is with a holistic nurse?? Huh??? But that nurse put me on these meds, and now you are telling me to take a herb, that has ZERO proven medical use, and to read a book. But what about the other nurse....why did she get fired. Bedside manor?? Really?? Because you are the one not listening to anything I say, and rushing me out of the room. Sorry to ruin your afternoon by having an appointment.(Spratt)\n\nOne of their own staff has admitted they will only see Dr. Kanelos himself or ONE (Jenny) of the PA's because they don't trust anyone else. \n\nI came here with my 6 month old, so as to have a smaller, \"family\" style practice and not the baby factory I was going to....and now I deeply regret it. Do not make the same mistake.", "business_id": "2yBBmcVEbhrGrk-hAUAfJg", "stars": 1, "date": "2013-06-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "zR9Ekn45cl7P8VcvlQ4m_Q", "review_id": "w213iCRVGZzBSyTDcWj8xQ", "text": "I've been bringing Howie here for three years. From grooming with Jill to playtime with Nancy, Amber, Patti and the entire team, to kennel stays...I can't imagine going anywhere else.  Can be a little pricey is you spoil your pet with all the extras, but aren't our furry friends worth it?\n\nI think the first might is free. Tell them I sent you!", "business_id": "EBuOgJoDgaYCXbqugPTj6w", "stars": 5, "date": "2011-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "-AM5GraCk9j6syn9fT-AhA", "review_id": "WXLCRZHlQBGLk9hDGr9Wzg", "text": "Friendly staff and all but the bathroom was rundown and the wife lifted the slip around the mattress and the mattress was streaked, skanky and old.\n\nI had two girls with me and so we needed extra towels but the housekeeper in the hall told me \"I need a towel from you to give you a towel but anyway we don't have any extra so I can't help you.\" So I walked down to the fitness center and grabbed two towels and the housekeeper looked at me and I looked back at her and i just squeezed by lol.\n\nFunny another reviewer mentioned a flying beetle in the room, we had one of those, too! I got rid of it myself, though lol.\n\nAlso, they have the bistro setup, I just don't like those at all. To get coffee, you have to buy it from the 'bistro' instead of the free coffee setup Courtyard used to have. \n\nFor those of us that are Marriott-loyal, I think the Fairfield Inns are better value. They are just as comfortable, the beds and pillows are just as good- which is really all we care about- breakfast is free, and they tend to be newer.", "business_id": "1xZ7zuLKrcrG65kzlEO66A", "stars": 2, "date": "2014-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "H7PKqDwvC-V08RMj74G8Uw", "review_id": "BUqaGbEHW8n7rgtUEHlagw", "text": "This hotel is nothing special (for my purposes), but the location is great for downtown Charlotte and there were no horrible aspects to it.  \n\nThe bathroom setup is stupid (like many hotels) with no counter for the sink and those old-fashioned separate hot and cold water knobs that make calibrating the temperature needlessly difficult.  The shower pressure was adequate, but there is no place in the shower to put your shampoo, soap, washcloth, etc.  That's just dumb.  Toilet paper sconce is behind you and a pain to reach.  An overall bad layout, design, and decor in the bathroom.\n\nThe room is very dark with just some dim lamps scattered around the room.  There is a desk, but its shape makes it painful to sit at (there was a wooden part jabbing into my legs) and you have to unplug something if you want to plug in a computer, a short sighted setup on their part.  Because I was here for work I was too busy to eat their breakfast or spend any time at the bar, but I did need to get some stuff done in the room and the above features made that difficult and unpleasant.  \n\nAlso, you have to park in a public lot behind the hotel and get your ticket validated by the staff to not pay there, but you still pay Dunhill $12 per day for the parking.  Not convenient, and one time I forgot to get the thing validated and therefore ended up paying more than just paying the garage itself.  Bad system there too.\n\nBut overall the bed was comfortable and the room was quiet and getting around is easy.  As a business traveler I'd still prefer a Fairfield Inn or Holiday Inn Express, but this place is almost as good.", "business_id": "zwwmnQXk8jhFs4wwU8I4Ow", "stars": 3, "date": "2012-06-04", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "ZZjQ2C-MgjEGNCk47LfNLQ", "review_id": "HMjestmbgp41sp92qxeYcQ", "text": "The food is OK, but the selling point is it is one of the few places in Charlotte that has culture and history.  An old victorian building in a neighborhood that feels more like Charleston than Charlotte.  Tired of uptown chains and overprices bistros, head to this place.  Great beer selection and a pub feel make this a great pick.", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 4, "date": "2009-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "u6LzzpykHyoBc2HCrKskuw", "review_id": "CCQQowYhSd487oqA-AMNKA", "text": "I agree with most of the group.  A hidden gem here in Charlotte.  As you sit in the restaurant and watch the horse and carriage go by, you feel like you're in some other city.\nGreat atmosphere and food.\nThis was me and my husband's first date...per my suggestion(he was new to town).", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 4, "date": "2011-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "09hMpTBam1kA6sxJ6NCwgA", "review_id": "4QdcTgZOth5I-4TwjGhxLQ", "text": "Highly recommend", "business_id": "ePP0Eqz8JKSbtdt2phiB4A", "stars": 5, "date": "2015-07-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "IyPdcM5a9RUIM0TmJcWw4g", "review_id": "2yiOeGcBMRYIBhvGGKGKWw", "text": "Still a great museum, but the Civil Rights Exhibit is nothing more than lots of mounted enlarged photos.  Many of which have been displayed many times in other media.  There is a lot of stuff from South Africa's civil rights struggle and a few buttons that can be taken home.  \n\nThere is a small Armenian exhibit with interactive dancing and small intriguing items.  It's a fun exhibit.", "business_id": "udbtIhRXiehLRQoMFKvNXg", "stars": 3, "date": "2015-06-01", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "IVy6QMwiCMycCy-JZl03WA", "review_id": "bW8Sf7iBznJiaxLrC4wC0g", "text": "Although the hot dogs are good, I usually end up getting the Italian cheesy beef thing dipped in its own juice... It comes loaded with meat and never fails to fill you up. Sit outside with a side homemade chips and you'll definitely get your money's worth.", "business_id": "gpCtDCSXIoQx70cq9itfNA", "stars": 4, "date": "2011-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_JUAHGTiXmc8uytRgL-qhw", "review_id": "fRTaRJSYaAfbMtpCgyZNzQ", "text": "We got into the city late and looked for a fast bite. Typical bar food and cheap beer. I had some 2 dollar drafts and had some nachos. The crowd got a bit rough later on through the night.", "business_id": "-6JY1T0w4XETux5kGOj84g", "stars": 3, "date": "2011-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "exvp-M7znsQgyKf43wek-w", "review_id": "efgky_AILxgRj7Bo7baHhQ", "text": "Hoegaarden on tap\nWhen you're in an Uptown mood\nRi Ra is the bomb", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 4, "date": "2011-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W8KRVA8F3rn9odCuhL-9-w", "review_id": "CH-FMfA_Xkl1_K1TWl1kGQ", "text": "The large employee guy with blonde hair was belligerent and trying to start fights with several us last night. He needs to be fired and needs to be some changes made.", "business_id": "WuCcv_Dyd_1B_1-4jwK7sQ", "stars": 1, "date": "2013-08-04", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "ZZjQ2C-MgjEGNCk47LfNLQ", "review_id": "8UIZv3o09gGJg_u4tIOjGw", "text": "Great asian food, excellent service and close to uptown businesses.  The only downside is that during lunch it can be difficult to get a table with the lunch rush.  Arrive early or late in order to get in.", "business_id": "rT-iPtIXMKj3dTcl87lbOw", "stars": 4, "date": "2009-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OOdvVXyWUlWLhQI3TS9eng", "review_id": "q1UcF0gq9jZq7RJpLTkIiA", "text": "LOVE this place! I had heard rave reviews so I finally decided to check it out for some takeout. Soho Bistro is run by the nicest people and the food was delicious. Not too greasy/heavy, and the fried pork dumplings were awesome. The food was ready really quickly, too. Definitely coming back here whenever I want Chinese!", "business_id": "rT-iPtIXMKj3dTcl87lbOw", "stars": 5, "date": "2015-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4bIXGkoeMczOe6goszBJkQ", "review_id": "rFbtWq3ZnO3JV7OE0ZJ3aA", "text": "A hidden gem in Uptown, hidden inside Spirit Square. The Light Factory is a small, but incredibly fantastic museum and cultural hub for photography and film in Charlotte. They hold regular rotating exhibits, summer camps, and adult art classes. I usually browse the current show when I'm in the area or waiting on a performance at McGlohan or The Duke.\n\nAnother very fun thing you can catch is the summer film series, outdoor (weather permitting) screenings of films in Transamerica Square (the green between the buildings). This summer saw 80s cult films...all for free!\n\nCool spot, interesting exhibits, and definitely friendly on the wallet when you need something to do Uptown.", "business_id": "S-JGnMWqetTwpZdzP5tDzw", "stars": 4, "date": "2012-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RfoHE-ChOZ3kohOS7goUpw", "review_id": "NuL1w3_QNIVTEUyR_7gmjw", "text": "Beer! Free parking! Great place to have some good brew. Great bar food.", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 4, "date": "2011-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2hvLvzUEiAf6rcDMmhcelw", "review_id": "QgRTpLWqZETs3xMsmGERfQ", "text": "Ok another one with as many check-ins I have for this place that should be my review. If this was Boston than Rock Bottom would be my Cheers. What can I say about this place. Lets start with drinks.\n\nThe beer is made in house. I love the beer the current brew master has been doing a great job. I look forward to tapping part of the new brews he has made. The Bartends are freaking awesome and very cute(always a plus at a bar). They are super friendly and makes the best drinks in the world.  \n\nFood is awesome. I love the apps and whatever season menu item they come up with. This summer they had a luau with a pig roast. I was great. My favorite item off the menu is the steak cooked texas fire style. Trust me when you smell it you will want it. The salad are really great especially if you are on a diet. \n\nSo to sum it up great drinks, great food, awesome and cute staff. Why are you not there now?", "business_id": "ym9QwkmB5ZKTyj7q5huTDw", "stars": 5, "date": "2014-07-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iR4tPIWNpkuxaRqs_UDFsQ", "review_id": "WeG7lWY026ZV8Pn2eZVQCw", "text": "I have been a customer with Spectrum for six years and the service has always been excellent.  Recently, I decided to purchase prescription sun glasses which were an investment for myself and my insurance company.  Long story short, I didn't use good judgment picking the frames and just wasn't happy with them.  I hesitated before inquiring about the matter since I felt responsible, but when I did approach Eva in the Uptown office, she was wonderful.  She assured me it was OK and that the most important thing was that I be happy with my sun glasses.  She allowed me take several frames home with me to try and consequently, new glasses were made and I am very happy.  In fact, I plan to spend time on the beach with them this weekend reading a good book. Thank you Spectrum and Eva for excellent service!", "business_id": "3agV-iW8yukcXpbHom3p3Q", "stars": 5, "date": "2013-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cs3jBn4NMKBjMU7cy1HdRw", "review_id": "pXNv0jrlHQgn1oNIP33Qvg", "text": "Seafood Noodle soup had slices of pork. The cilantro garnish wasn't even chopped.", "business_id": "utyqO_IVBAN8ULZmi52XaA", "stars": 1, "date": "2013-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fa6ESRnjj3n4SIebn2F8vA", "review_id": "_lNa-THXJBUoZLPH80KJ2A", "text": "Need a place in Charlotte to get black out drunk without fear of waking up missing vital organs? Than the Westin Charlotte is the place for you. Was witness to an amateur drunk who passed out. Rather than doing the typical bounce and toss the staff gave genuine care and concern to the help him through the this moment of self reflection. One employee went so far as to ice his neck in hope to help him sober up, if nothing else at least remeber his name. Even when the EMTs arrived and drunk punches were thrown the staff stood stoically ready to show their support for their customer. So, it became a dinner and a show. Five stars.  NERD RAGE!", "business_id": "4nFqPL-glgDm9v7bZptskQ", "stars": 5, "date": "2014-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EnXGx4FdSVlk80BHSha_OA", "review_id": "AYnDkyBJvGHCEDm_2z2fIg", "text": "VETERANS BEWARE!!!\nThis hotel has decided not to service those who have paid the emotional toll of serving their country.\nPlease read on to hear our story.\nMy wife and I made reservations, then emailed Holiday Inn to inform them of our emotional support animal, for which we do have a letter from our doctor stating the need for this animal. When we arrived, we were told that they would not honor our reservation due to us traveling with an emotional support animal. I asked why and they recited the NC ADA rules. Now, we have NEVER been turned away from any establishment in the past, including Holiday Inn And other hotels and businesses in North Carolina. \nI spoke to the general manager on Tuesday and specifically asked if anyone would be turned away in the future with an emotional support animal and he also hid behind the ruling. This ruling does NOT state that services cannot be given to persons with EMS Animals, just the definition. You decide.\nAs an after thought, we drove to Columbia, SC Where the Holiday Inn Express Downtown welcomed us with open arms.", "business_id": "Fi5sQxROyTLp5qDuYKz6bQ", "stars": 1, "date": "2015-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "55Y3heRCOdXU7rbs0fxaIA", "review_id": "rgQ8CVlxMHBa1cmkwuccQQ", "text": "Prepare for a LONG wait, poor customer service and God forbid you have to use the restroom while you wait 30+ minutes! Unfortunately there is nothing good I can say about TW Cable. Besides the extremely poor customer service when visiting their office, the equipment they offer is outdated, to reach someone in customer service via a phone call, you are definitely going to be dealing with a mess.\n\nThe best DVR they can offer customers is a model that can only record 2 shows at a time compared to other companies that now have models that can record up to 5 shows at a time. The only reason I am with them is because they are the only provider for my home at the moment and satellite is not an option.", "business_id": "vKtMsWeAaThimXGo9Ic_Og", "stars": 1, "date": "2014-06-19", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "0SuIvO9hz82-tuKEe2z35A", "review_id": "Us6R1EDOpWANHHOMrbpOPQ", "text": "I really wanted this place to be a HIT......but instead it was more of  a #FAIL. \nI'm sure that it was because I was booked with a NEWBIE right out of school and her first week in the Salon. So I would give this salon a second chance but book with someone with more expertise. \n\nThe hair stylist was a sweet girl right out of school was I knew was trying so hard. My Trim & Partial High Lights took 3 1/2 hours though!! Additionally the highlights came out very blocky and with some leopard stripes. The color was not put all the way to the roots so I walked out with ROOTS and a $200 bill.  I told the stylist a few times the issues at hand but each time she started crying and I didn't have the heart to pursue the issue. Disappointed that I walked out with roots when I went in there to get a touch up. \n\nWhen I got down to the parking garage and my \"validated ticket\" had only been validated for 1/2 the time and I had to spend another $20 to leave the garage. The Manager heard that was I was unhappy with the new girls attempt and sent me a gift card to their salon. A very nice follow up and great recovery. So I would say, sure - check them out. They seem to have a great product line with all natural Aveda products, they have an amazing location in the Heist tower (except for the parking) and a classy salon. Just be sure to make your appointment with someone with experience.", "business_id": "I9S-4czHzMVfKejCiAuXag", "stars": 2, "date": "2012-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_D7aEG8LqdP8mJHLk9Gp-g", "review_id": "JL1sTZHNrYz0LQ1papmEOA", "text": "The Monticello is a great place to have a civilized breakfast.  They have fresh-squeezed orange juice, a nice Eggs Benedict, and even hearty yellow grits.  It is located in a charming uptown Charlotte neighborhood, near a library and several museums.", "business_id": "-Am2JVkb7nwvBAUwSugG0A", "stars": 4, "date": "2009-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WJvqgKm7qqagozcY0AAsuw", "review_id": "EcwfXswQBFkuMtUe5AoK_g", "text": "This was my first time coming to this restaurant and I came because a lot people and media were talking about it. I took my Mom on Sunday for her birthday. \n\nThe only thing good about our meal was the water, orange juice and corn bread snack. Actually, the OJ was room temperature, so it was 'borderline good'.\n\nI ordered smoked pork chops, home fries and green beans. My Mom order salmon cakes, collard greens and mac-cheese. The pork chops had a good smoke flavor, but they were too salty and paper thin. The fries were over-cooked and soft. The green beans were greasy and tasted sweet. Sometimes, people will add a little sugar to green beans if they accidentally add too much salt; I believe that was the case.\n\nMy Mom's salmon cakes were dry, the collard greens were flavorless and under cooked (probably just stir-fried) and the mac-cheese was dry.\n\nNot only was the food bad, but it wasn't even hot and my green beans had a little solid grease on them (eeewwwww!).\n\nI won't go back because the meal was expensive (w/tip), the parking was terrible and the food was no good.\n\nIt was a total disappointment for me. I was embarrassed for recommending this restaurant.", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 1, "date": "2008-06-30", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "c6vXlUq_RJbxbV2CHGOl_Q", "review_id": "nujFvkPhTom2B9d_yDl-3Q", "text": "This place serves excellent Low Country/Country Cooking dishes at reasonable prices - at least the prices are reasonable at lunch, $7 - $9 for a entree which comes with 2 sides and corn bread.\n\nThe Fried Chicken is excellent, The Ribs are as well, and I love the Salmon Cakes. The Fried Catfish is good, any of the Po' Boys are worth trying. The Fried Green Tomato app is nice, not as tart as some, but still good. The Collards are not to my liking, and  I've tried them twice.\n\nThe Shrimp and Grits are nice, rich and creamy. But, I was disappointed in the Shrimp Creole, was bland and watery. Service here is excellent, even when this place is busy, which it always seems to be. The ambiance is homey, though it can get a little loud.", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 4, "date": "2011-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7olvpm02Oa__3xKMVveppw", "review_id": "-BfiZy6CfG-zFFEyEn-35g", "text": "Highly, highly overrated! I'm from Louisiana, so I'm a tough critic. I ordered Blackened Pork Chops and it was just okay. Also, we smelled like a grease kitchen for the rest of the day. Best advice is to dine outside! Best piece of lunch was the cornbread.", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 3, "date": "2011-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PXLY7Tomx8Wn2xXaT1fT9Q", "review_id": "dRT8vsPsqkyOUsPCT-cJRQ", "text": "The 2 times I've been in Charlotte, I have visited Mert's Heart & Soul.  It is a very fun environment that is rich with history, the food is extraordinary southern cooking, & the service is very hospitable!  I would definitely recommend for anyone & everyone in Charlotte to check it out.  I can't wait until my next visit!", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 5, "date": "2012-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "P2iwQD7VVKNsK5ZaqCpjlw", "review_id": "icuaiJ2ioCj2LUeVQ_RjWw", "text": "This is my second visit to Mert's (the first time Yelp wouldn't let me be great and check in). They decor is artisy and eclectic and includes a diner style dessert counter. (My inner fatty girl rejoices) if you are on one of those \"starve myself of carbs because they are the devil\" diets do yourself a favor and skip this place because the cornbread is a MUST! \n\nI got the fried jumbo chicken wings which were delicious, the greens, which were flavorful but not very juicy like I prefer mine. The only disappointment from my meal were my yams. Basically because I had more juice than potato :-( \n\nStaff was friendly and attentive. I'll definitely be returning for some banana pudding.", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 4, "date": "2013-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dWHC15f2t-33rkesSP7mnw", "review_id": "sPZyPr0pbcLa57ywtHIrmA", "text": "This place is amazing! The cornbread is perfectly buttery and moist, and the barbeque is seasoned just right and is making my mouth water just thinking about it! The staff there was so friendly and personable, and did a really nice job at checking on us- but not being overbearing. I definitely recommend this place if you are looking for a delicious soul food meal!", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 4, "date": "2014-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5FywzUVEUGzH5Sk8xDLacg", "review_id": "GhdScYIpKj9MkI9bps19Ug", "text": "Found this place through yelp because we were looking for southern comfort food and because we were stopping over in Charlotte for the day. Great place!! The food was excellent, every single member of our family agreed that we had a five star meal. Portions are very significant, and the pricing is good. Really wonderful service - friendly and down to earth server. Overall a great meal experience!", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 4, "date": "2014-08-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "sVdIKgVokGNLf_w1vHIP6Q", "review_id": "zHT3-angX1GRsTB89_uS7Q", "text": "I WILL NEVER EAT HERE AGAIN! This was my second time eating here and while the food is not terrible, it's not the best and is way overprice for mediocre. First time I had fried chicken and I honestly can say that Bojangles is by far better. This time I had the shrimp creole and rice and it was not bad but doesn't stand out. The rice was bland and the dish over all had no spice. If you have a party over 4 eating here, forget it because they only have seating for 4 and no good accommodations for larger parties. I had a party of 6 this time and it took OVER AN HOUR for us to be seated. I had visiting family and they tried to sit us at separate tables?? NOT GOOD ENOUGH MERTS! Now the part that any restaurant should have is good customer service and today, their host was extremely poor, rude and had a major attitude problem! This is unacceptable for ANY RESTAURANT! My recommendation is to go elsewhere and save yourself the trouble!", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 1, "date": "2015-07-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "o4wd8u9IvnfhW4QpH4wzTQ", "review_id": "QQyGqTxfjFNH_-BovZPJEg", "text": "Place was packed and after reading reviews, I decided to keep an open mind. There were five people in our party and we were seated beside the register. Waitresses kept reaching over one of our party to get straws(they were sitting right behind the register). I ordered the catfish...it was ok; not completely done but seasoned well. Not sure if it was fried or shake n bake. The Mac n cheese tasted like it was cooked on the grill. Someone in our party ordered jumbo chicken wings and had to request that they be cooked more. A waiter took my MIL plate from the table without asking if she was done. They had to fix her replacement food to go. The cake wasn't fresh. The blackened chops were very good! The beef ribs should be advertised as short ribs. Our server was great; had a great personality. Don't think I will return.", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 3, "date": "2015-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pjRu9-D3K8xTUc7ob3YfpQ", "review_id": "pbVEqE7QlUrzcgXK4IsNWQ", "text": "Went to Mert's for the first time yesterday. I must say, I wasn't very impressed. My husband ordered a chicken breast quarter with green beans and mac and cheese. He had to return his chicken and ask for another breast because it was pink on the inside. Also, I tasted his mac and cheese and it was very bland. Hubby also stated the beans were bland as well.\n\nI ordered the soul rolls and fried green tomatoes. Both were good. No complaints there. Cornbread was good.\n\nOverall, if I have the occasion to eat here again, I will stick with the appetizers.", "business_id": "mpDxBBGywUE6GRRKja3sBA", "stars": 3, "date": "2015-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8KdDd_6boBq9ilWttvxv8Q", "review_id": "7rI3TI154Hih_NXyaCRBSA", "text": "food and service are excellent.  booze are a little over priced , but man is that food good.  went there for thanksgiving 3 years ago, had a prime rib.....  awesome.", "business_id": "NTfUFk8GyOLL1uPbEO-pVg", "stars": 5, "date": "2011-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "543Qa7npTaT6850xztXsfA", "review_id": "4qhU93AO5dZHHSoFfva5WA", "text": "Mimosa grill is getting ready to change and update its menu for summer (June 19) but, I had the opportunity to try their Colorado lamb loin on the bed of spinach with empanadas on the side.  It was seasoned very well, cooked medium rare, and was delicious.  The wait staff were very fast in anticipating my needs before I even asked.  Overall, a very good meal in a relaxed, urban setting.", "business_id": "NTfUFk8GyOLL1uPbEO-pVg", "stars": 4, "date": "2013-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "S9lac_PPAISov03qrHkpMw", "review_id": "_fgKGsjYcnIzzBoRjTDGzQ", "text": "Service was fast and courteous. Shrimp and grits was great... However, the lobster Mac and cheese was \"fishy.\"  The waiter quickly adjusted the bill, so other than a couple of funky tasting bites of food, no harm no foul.", "business_id": "NTfUFk8GyOLL1uPbEO-pVg", "stars": 3, "date": "2014-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "JaGgsAbwAUKvaEw-3v3XJQ", "review_id": "yw8lM0BivzmZhLfeqRNIrg", "text": "New favorite brunch place! My friend was in from NYC for the weekend so I thought we'd try something new and I was impressed. The food was fantastic, especially the French toast. We did the buffet option which was ~20 and you get to pick things off a menu too. Don't forget the mimosas!!\n\nService was great too! Sometimes at buffets the waitstaff tend to stay away, but not here! Our waiter was very attentive and it was appreciated! Now on to my favorite part... Look at the pictures. They say a picture says 1000 words and that couldn't be more true here. Happy brunching!", "business_id": "NTfUFk8GyOLL1uPbEO-pVg", "stars": 5, "date": "2015-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vhpq-cBba2iUTp2s-MmeNg", "review_id": "fDVUZdJ2aFkeVeB_yBzS9Q", "text": "After the bars and clubs close uptown, this is one of the few eateries open, and it seems that half of uptown descends upon this place. Expect everyone in line to be at least mildly intoxicated, and a longer line than Macy's on Christmas Eve. Bear with the wait and crowd, and you'll be treated to decent pizza and wings at prices slightly higher than the competition. \n\nNot bad, but if you're having a pizza fix at a decent hour there are better alternatives uptown. I'm sure they make a killing catering to the late night crowd, but why wouldn't they? Sometimes gluttonous pizza with friends is all you need after a long Friday night.", "business_id": "e8kqqWU9247Nn5VAF5sDkQ", "stars": 3, "date": "2013-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2wYOUzRlY79gPrrosMJhYw", "review_id": "U_wAywhqG9aMmg0aXUsJxA", "text": "The food is pretty good.  The beans and bread they serve is pretty tasty.  I had the gnocchi which was pretty delicious, though my fiancé wasn't so much of a fan of his seafood pesto pasta dish.  We also enjoyed bruschetta as our appetizer, good, although not phenomenal.  We also enjoyed great customer service!  The next time we are in the mood for Italian, Luce will be on our list.", "business_id": "z24h6ZYnZiWjlDTuLXG9jw", "stars": 4, "date": "2013-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "akHqAZvuTPBLQEMRj6dZzg", "review_id": "4qnJcuY8pN0HbzVWb0HROg", "text": "One star. It's only because they won't let me give it zero stars. Read this carefully, if you book your room through a third party, such as Orbitz, they do not guarantee the room that you booked online. Traveled with my brother and booked a two double bed room and when we arrived all they had were rooms with a single king bed. Was told by the front desk I could get a roll away bed brought into the room at an extra charge of $10 a night if they had any available. Didn't matter whether they had any available or not because I had no intention of giving this place any more of my money. I travel often and I mean i travel a lot and this is the first time I have ever had this happen to me. I have stayed in nicer hotels at cheaper prices and haven't dealt with this kind of problem ever. Needless to say I have crossed all Hilton hotels off my traveling list. Also, room was tiny, small fridge, breakfast was not free where as in most places I stay it's complimentary. Bath tub floor was slick, tried to be careful didn't matter because I busted my you know what in the shower. Just an all around poor experience and I will not be back. One last thing, you hear everything that happens in the hallways no matter what's going on and that sucks when you are trying to sleep.", "business_id": "IYNZXcNVXiCVavCrplXPlQ", "stars": 1, "date": "2014-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w0UHRPoxl4BztMGr_SZCag", "review_id": "eQyZmHpyKIhUR81kNlmSxQ", "text": "Missed my connecting flight in Charlotte and was told this was a good place for a late night bite and a beer. Completely true. Spot on. Cool atmosphere, good draft selection and tasty, creative pizza. Hit it up", "business_id": "kAid56AY_laxGYslMdsYJw", "stars": 5, "date": "2012-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "CyTtDrPCaV0VB2EPNeXCIg", "review_id": "UOT7aMPhWT_joI08GVxu5w", "text": "Nice hotel. Good beds. Across from NASCAR Hall of Fame.  Did not notice street noise mentioned in other reviews. Self-parking. Decent breakfast.\n\nShares parking garage with Hampton Inn. Not a problem, except confusing car entrance.", "business_id": "cBoFcjuNaWDQ2MP7GgeSBA", "stars": 3, "date": "2012-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eSrIFjsjl2AGA7kwi_eUyg", "review_id": "03-RvYL38etJPiZII_zXeA", "text": "Classy joint with portraits of old men on the walls.\n\nATMOSPHERE: Clean & classy, resembling a vintage smoker's lounge where deals are made. Enjoyed the finely painted portraits of people of influence from the 1800s. Fine statues of deers and animals got my appetite started.\n\nSERVICE:  I was dressed very poorly and still received the same  business class service as the rest of the finely suited gentlemen. Attentive, friendly, will scrape bread crumbs and keep your fluids topped off at all times.\n\nFOOD: Delicious. Quality assurance department is doing their job.\n\nMENU & PRICING: High end aged steak and fresh quality seafood. Expense it on your company card or stock up on top ramen next week.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 4, "date": "2011-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QxVV5XAQd3S3GI-4qk6sJg", "review_id": "vgjTA0Wg3E_8EzWQl27EPQ", "text": "Again, I have to say this place is fantastic.\n\nI love the staff, the service, and of course the food. Calamari, Lobster, Crab, and yes, fries. All great. And the service is always just about enough. There are places where you'd rather they stop coming but here, they know when you need them.\n\nSo, I gave'hem a great review last time on their Exchange Room and Filet Mignon. Now, I must recommend that you eat out in the sun as well. Yes, they have tables in the shade as well.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 5, "date": "2014-06-25", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "Hg4GF6sHT_9tuHIvrfpkpw", "review_id": "wtl7t4eSJpBN3ZrIMvM8wA", "text": "My husband and I came here Sunday night for dinner during Restaurant Week.\n\nObviously, we made reservations in advance and were seated immediately. \n\nWe decided to order a bottle of wine cause we were celebrating that evening. All the wines are on a tablet, which was really neat cause you could easily scroll through the bottles and filter. We ended up settling on a Zin/Shiraz blend. It was absolutely delish....I wish I got the name of it!\n\nSince we were dining for restaurant week ($35 per person), the menu was limited. However, I would love to return cause I heard their lobster mac was fantastic! I decided on the clam chowder, 8oz filet mignon, and chocolate flourless espresso cake. My husband picked the wedge salad, ribeye (i think it was crazy big like 14 oz) and chocolate flourless cake. \n\nUnfortunately, the clam chowder wasn't anything special. I have a huge love for chowders and this one simply didnt do anythign for me. I took a bite of my husbands salad and it was very good. Our steaks came out next. They were cooked absolutely perfectly! The filet mignon literally melted in my mouth. My husbands steak was seasoned so well. This is definitely where Capital Grille shined! The shared potatoes that came with it were perfect. Additionally, the meal came with shared green beans. I thought the green beans weren't cooked enough, but that is just a personal preference. The taste was excellent though. Lastly, the desserts. Oh my gosh, rasberries, cream, and the fudge like cake. Perfection. That dessert was spot on!\n\nThere was one small incident that I wasn't super thrilled with how it was handled. The waiter brought over our steaks and sides. In the few seconds it took me to grab my fork and knife and almost cut into my steak, my husband (and at the same time, the waiter) realized he brought over the wrong steaks. Like, our entire order was for a different table. Literally, not a big deal at all. Misstakes happen. However, without even an apology he grabbed all the plates, including the veggie sides (that come with all restaurant week meals!) and cleared our table. It was just awkward cause he made something that wasnt a big deal into a scene. Our neighbors sitting beside us literally leaned over and said they couldnt believe he did that and took the sides off the table too. Additionally, I would never complain about this, but the new steak I got was definitely not as nice looking or as large of a cut (not that it completely mattered cause I didnt even eat all my steak anyways) as the one that was accidentally served to me. Felt like I got the reject one! However, it was delicious and we just moved on.", "business_id": "CChwRoYVXA3QZulS8a6xOQ", "stars": 4, "date": "2015-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "0yPetmJpgUxkxCFsr7m6cA", "review_id": "K7ht-zRyLmNmT9fGZEK-nQ", "text": "Have had an issue with delivery problems since June 8th 2015 when my carrier quit because they moved the location for his pick up of the papers which would make him drive round trip over 50 miles. I understood. He was diligent and never had a problem for 7 years.\n\nDid not receive another paper until July 6th. Made numerous phone calls and emails saying the problem was being addressed. To this day I still have issues. It is a crap shoot do I get the paper? Do I get it on time?? Do I get one at all?? Why did the new carrier take the job in the first place if he or she can't deliver on time??\n\nI have in the past enjoyed reading it but am ticked off that I can not get what I am paying and getting aggravated with their service. Next renewal notice I will have to decide if it is worth it--!!", "business_id": "wWTPCZYLaKsDaNGSlao0iw", "stars": 2, "date": "2015-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "-sdiBaiM7R3OZ_CtEEAdIw", "review_id": "BXupFuasoHPmDLnqJyR5og", "text": "Bank of America Stadium is average!  Not great, not bad, just ok.  I'm a big tailgate kinda guy.  They fail, fail fail in that department.  Lot of walking from these private lots to the stadium.   The stadium itself is nice in the inside but just feels kinda gray and dull.  The seats kinda suck.  The pros about this place - tickets are not as expensive as other stadiums in the NFL. Con - that is a long @$$ walk to the upper deck. no bueno\n\nGrade: C", "business_id": "g-Q7G5Q2zHb1BqoF8pq-OA", "stars": 3, "date": "2014-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "54Aydh4aR64rdWa17FW1Jw", "review_id": "bht8B_grDwkl9_97xW4WfQ", "text": "So far I like it.", "business_id": "jmzPbvE_02SzTAjwZCTgYA", "stars": 5, "date": "2013-07-23", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "XTi7LJPw5_izQaMQF4cU1Q", "review_id": "J8Bu5zIz135OUB2tOYmgzQ", "text": "The bagels here aren't as good as everyone said they would be. I actually think I like the Einstein's Bagel's bagel-cream cheese combo better. I personally prefer the plain bagel and cream cheese over the egg sandwiches because the eggs are kind of weird and microwavy tasting. The nice thing about this location is that it's on the 2nd floor of the epicenter and you can get there directly from the Aloft.\n\nThey have some very good deals on breakfast bagels that are CHEAPER than Smoothie King. Damn you delicious expensive smoothies!\n\nTip: I wasted $2 on a very very disgusting and watered down Iced Coffee. Avoid at all costs. Minus 1 star for that.", "business_id": "LUylwiKNsS7_iumytRgAmw", "stars": 2, "date": "2010-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pIIjNEjiGflE6v3D0Lc-HQ", "review_id": "i1Ibzvn3RU26hz4C-L0OyQ", "text": "Took my car in to get a quote on the brakes, my car is a 2011 with only 41,300 miles on it.  They wanted to replace all the pads and all the rotors, saying that the rotors were rusted and quoted me $660 for all four.  Took the car to the dealership who said only the rear brake pads needed to be replaced, I have at least a year left on the front pads.  They also said they could easily machine the rotors to remove the rust.\n\nTypical auto repair shop trying to steal money especially from young women.  DO NOT go to this shop.", "business_id": "7_4OqT_IQbpXlao-4BEyMQ", "stars": 1, "date": "2014-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7Stsj8lniKPph7-CBdyt9w", "review_id": "y1CsSnzATPn1yyf3Aoclxg", "text": "I want to like the Discovery Place more than I do... \n\nAs a kids museum it is okay. There are some hands on things for the kids to try. The problem is that most of the exhibits are old and dated. Perhaps they just need to renovate some of the permanent exhibits to freshen things up and make them a bit more fun. \n\nI do love the Imax theatre. We've taken the kids to see movies like Happy Feet and Undersea 3D. That's a blast.", "business_id": "ZBQWSsUXwixFmm3lpegMiA", "stars": 3, "date": "2007-07-25", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "K7-XcFoYcTk0I8G-eGxsMw", "review_id": "wNFl8YHKIO4LXUIQcT_irg", "text": "Awesome in every sense of the word. We were there for hours. Kids loved it and it is very reasonably priced.", "business_id": "ZBQWSsUXwixFmm3lpegMiA", "stars": 5, "date": "2015-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "NRaFLRI7cIU6JENmBYoruA", "review_id": "co8R6ljYRjM3a_yHNVcOcA", "text": "While in Charlotte, on night two of our stay, we went to the Breakfast Club. I was a little apprehensive about what it would be like based on yelp reviews, but was excited to experience it nonetheless. \nThere was a group of nearly 20 of us, between the ages of OLDER and 21. haha... We didn't have to pay cover, and the staff was amazing awesome to us. The drinks, while a little pricey to Charlotte people's standards, were great for an LA girl's standards ;) I LOVED how they were served in glow in the dark cups (that you could take home if you wanted) and that they were all named after 80's songs. The decor was great, including the neon hand chairs, the hanging rubix cube and the pac man made of red bull cans ;). \nThe dj was pretty awesome, and i especially loved the fact that they played videos. I have to admit that i have definitely not danced that much in a long time. It was totally worth the soreness I woke up with the next day! \nAnother thing I loved was how awesome it was that so many people dressed the part! It was so cool to see an older woman dressed as Jane Fonda, a pair of guys dressed as the guys from Miami Vice, and a Richard Simmons in the mix! I wish we had places as cool as this out here in Los Angeles, where I live!\nThis is another spot I can't wait to get to when I come back to Charlotte next year!", "business_id": "Zw-sWBbL3Z9zyZ0ri9UT_g", "stars": 4, "date": "2010-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 3}, "user_id": "svDfyraZSfiBT-CvrsycXg", "review_id": "3d1wrkJxTQpURtB1UCH9HQ", "text": "Don't let the location in a rundownish, older strip mall fool you.\n\nI live in the neighborhood and had seen this place a few times, before I decided to wander in.\n\nI always get the Italian - what can I say? I'm a creature of habit - and it is delicious.\n\nSeem to be a lot of regulars in here especially during the busy lunch hours\n\nFriendly service, good prices, great Italian sub.\n\nWhat's not to like?", "business_id": "4-B5ou1FbGVjVEQd3FAoIA", "stars": 4, "date": "2011-06-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LFZEPbbOMHJRBLki7V5XNg", "review_id": "ErgNbZMBL_95pNhriPv9mw", "text": "For the price this is a 2 star.  For location this place is a 4 star.  The rooms are small and they even gave me a corner room that said was bigger.  I would hate to see what a normal room looks like.  The corner room has 2 full size beds and is like a triangle.  You do have space but very little and the bathrooms well the toilet and the shower are like touching each other.  You can barely close the bathroom door if you want to do business in private!  The corner rooms also that face 4th street just expect a night of loud music as that side faces several rooftop bars and they play music loud late into the night.  Only saving grace is putting in the AC fan but that is loud as well.  Either music or white noise.  The signature lounge...again...small.  Overall the lobby is nice, nice restaurant and attached to BofA and the center of town with everything in walking distance.  As I said....for location unbeatable.  For a luxury hotel for the price NOPE.", "business_id": "QThlnQ7AvzZwXHKD5DjdCw", "stars": 2, "date": "2012-06-11", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "91nXbD_nzHTLebsj2Fodpg", "review_id": "xo-BvnpyKT4Bpxg6EcHPGQ", "text": "Ultimately, the director of rooms contacted me about my concerns and did give us a free night. I am a Select Member but didn't get any of those perks - the free night compensates us for the free sodas we didn't get.  I did get at least one written apology.\n\nI would have preferred to give a half star increase as I am aware of my relatives' experiences as well. However, those stories are theirs to tell.  I appreciate the effort", "business_id": "QThlnQ7AvzZwXHKD5DjdCw", "stars": 3, "date": "2015-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WV5GyBGihxs_29F-V6CRNQ", "review_id": "1Y4RsFIrHeR3E6tYuPgEcw", "text": "Disappointing!! It is 9pm and we can't get a burger... Because they don't make them this late --- what? We left the Panther's game early! Oh well. We're here and it will be the last time.", "business_id": "376PDtBpGi74Os08TvCkhg", "stars": 3, "date": "2013-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ylTdk2m5D-B82y2vB_Oojw", "review_id": "tAB-zxuP_t43r_0jRkweLw", "text": "We stopped here to eat and spend some time before we had to check into our hotel room after a 3 hour drive. At first we were kinda wondering about the place because of a slightly funky smell in the air, but decided to stay.\n\nOur waitress seemed really hurried and didn't stop for more than 10 seconds to talk to us, often speaking AS she walked past our table, half the time we didn't hear what she said. We ended up ordering our meal from a different waiter.   \n\nWe ordered Monterey Chicken, which came with mashed potatoes and broccoli. The Chicken and mashed potatoes were all yummy and perfect, but the broccoli wasn't nearly as good. They looked old, browning and we ended up not eating any of it once we noticed it.", "business_id": "ePogmFFQkAy68Ne0VVUGBg", "stars": 3, "date": "2010-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "B1kUxAfIAUDpn6ABRcsqKg", "review_id": "YgSuoigBAdcFeq4WWaJOSQ", "text": "Nice to see smaller family owned bookstores around still! This one definitely has that feel, the people working there bring their little dog in, super cute. We went in for children's reading and activity books and left with 4 for a hefty $63, but they do give you $5 off for every $100 you spend, so it was $58. Make sure they put you in their system. Friendly people and good seating area to lounge in in the back.", "business_id": "Ku9PGxJPWFPotM1wOTVCNA", "stars": 4, "date": "2013-06-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2-uR7a5losM7P_PAZdws3A", "review_id": "wbX1cJ8U7f8L58UtOrbllA", "text": "This is your basic college coffee shop.  They had pretty good iced coffee and the atmosphere was nice, but it wasn't anything I hadn't seen before.  It's just your basic hang out spot for some people watching or catching up with friends.", "business_id": "2ZQ3EzJVjPkVCk4HLwKIag", "stars": 3, "date": "2008-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PBNo12uOoy_4j028l06YAw", "review_id": "rdEkXf9YOgUAUrpB1JqwFg", "text": "Fun for the kid and for the kid in you, you're just a big kid after all, right? You can eat a happy meal and regress and ride a kiddie ride and puke. It will be 100 degrees out, you will forget sunscreen, it will be torturous. You will wait in lines. It will be worth it only if you're on magic mushrooms. I fully endorse that.", "business_id": "n9iK0s1dKxv5JLi3u1eTkQ", "stars": 4, "date": "2008-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eM68n2pLhouhLs_AicnqBQ", "review_id": "YLAE6NJuPAGcAg_BSli14Q", "text": "Maybe I love Carowinds simply because it's the closest theme park to me. This is my first time living so close to an amusement park actually. Everytime I come here, the little kid inside me comes out and play. The coasters are awesome and worth the wait. I suggest going during the weekday when the park first opens up. Most rides have very little to no wait. Boomerang Bay is great too. My advice: be prepared to get a wedgie on the black body tube slide.", "business_id": "n9iK0s1dKxv5JLi3u1eTkQ", "stars": 5, "date": "2012-08-05", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "IpcWBzLqCItDmjODH7u3Ig", "review_id": "JgfSi-Z0dwzaJeDYjs9YOA", "text": "If you have been to Disney or even Chi-fil-a this place will disappoint you with their horrible customer service. Perhaps when 80% of your staff are 18 yrs and younger you need to instill respect, courtesy and the customer is always right b/c they just dropped a freakin mini fortune on this crappy amusement park that post hours of operations for stores and restaurants as suggested times. And you only get 1 star because I couldn't leave it blank", "business_id": "n9iK0s1dKxv5JLi3u1eTkQ", "stars": 1, "date": "2014-07-20", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "Kki0QQafSZWdYR0kdVwE1g", "review_id": "JKXnzDiF25-NPfLwYwBajQ", "text": "I live in Charlotte.  I  bought a season pass this year because in previous years i would go 2-3 times and spend more than what a pass cost.  \n\nI think my purchase was a great investment.  I always have one weekday off so I can come when the park is dead...enjoy the water park during the heat...and ride rides at night after the water park closes.  It's a hell of a lot cheaper than a pool membership in town.  At times I have the entire park.to myself.\n\nParking is $15 bucks a pop.....so buying the season pass covers that every time....HUGE PLUS.\n\nBE PREPARED.  FOOD IS EXPENSIVE.  I always bring a backpack with snacks and bottled water.  They never say anything at the gate.\n\nIt's great for people watching.  Lots of trashy people walking around in clothes too small for them.  You will see the occasional hottie too.\n\nOct is Scarowinds. ....\n\nAll in all, i will continue to come.  They are expanding the water park next year.  The  water park is already big", "business_id": "n9iK0s1dKxv5JLi3u1eTkQ", "stars": 4, "date": "2015-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "cPHjBgUO31vXzjjCdMDsYA", "review_id": "aq6cjyhSn2GaJohFPo_jUQ", "text": "I have been going to this practice for yours.  Really liked my primary a lot.  That said, I have noticed that last year or so, they over-bill folks.  I went in for my checkup- the doctor spoke to me about high blood pressure.  No prescriptions were written, nothing outside of a BP test was done, yet they split-coded it as a separate visit/discussion than my annual.  $150.  I thought the purpose of my annual was to talk about stuff like that.  This practice and the associated hospital are there to make a $.  No customer service.  When I went in to discuss, I heard another patient checking in.  This time the attendant let them know anything out of basics annual check up routine, anything else discussed will be billed separately.  Clearly other folks complained and now they CYA at check-in.  I decided to get a copy of my records and find another practice.  2-months later, I get a $30 bill to photocopy my records.  To photocopy people.  Whatever happened to service and treating folks right.  This place looks at you as an ATM.  I wouldn't recommend folks to go here for lousy service, non-transparent billing, and you just never know what a letter from them will hold.  I don't think they really care about your health.  Its just a business model for them.", "business_id": "iYlGqyRNH5UYQABKsDuuDg", "stars": 1, "date": "2013-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "J0h_oB2VEhMTlcqKmspjWQ", "review_id": "bVka1THxdhrFRM_cFmczAQ", "text": "I used to work out at Dowd way back when I had more time.  At that time, I really enjoyed the racquetball court and I would typically have it to myself (trying to perfect my old handball skills).  On this visit, I was there for a seminar.  I had to find my own way upstairs via the elevator to the room.  There were no signs and no one available to assist me.  Otherwise, the entryway was clean and had an open feeling.  The parking lot was full, so I gather there were many people already using the facility.  This parking lot is always full, which is a good thing for the Y.", "business_id": "b3u-GK6_xj2fJkinzLk_jQ", "stars": 4, "date": "2012-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Xt28bNvVFiy3iG2DzsGL7g", "review_id": "i3UziRARxe6Gt2dzrqSUOQ", "text": "Stan is wonderful! He takes the time to build relationships with his customers - he isn't interested in a one time sale, he wants your continued business and proves that ever time you are in the shop. He will work with you to find exactly what you are looking for.", "business_id": "ME3ctO11RLYSTTE1NkLXCA", "stars": 5, "date": "2015-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wGWFzdgnSEe7C6UjoW8Q3g", "review_id": "PFCzl6qSMjmyTcOAmtGdMg", "text": "Took quite awhile between my review of the bar and live music part of Blue and the restaurant side but, here I am and boy am I glad.  Went for dinner with my wife and a couple friends from work ahead of a Charlotte Squawks show and every bit of the meal was fabulous.\n\nIn terms of service, I have to say that I believe this was as professional as I've ever experienced in Charlotte.  From tableside manner to knowledge of the menu, past and present to attentiveness.  Just spot on.  Thank you Scott.\n\nSuffice it to say that everyone was very pleased with what they ordered but I'll stick with what I ate.  Started with the seared Hudson Valley foie gras and it was the perfect, fatty, savory bit of heaven with which to start the meal.  For my entree, I got the whole Branzino which was served with some risotto.  The fish was perfectly moist, simply seasoned and filleted tableside by the aforementioned awesome server.\n\nMy only regret is that I was not able to order my first runner up on the menu, the duo of wild boar and I can only hope that it's still on the menu when we visit next.", "business_id": "eaqJQP6bp7rQJQt5KqfvxQ", "stars": 5, "date": "2013-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9DyCuKS2WKxSZhLCMUg5Ww", "review_id": "a8jC1NkGUM7sr_qnvkxekQ", "text": "Nestled right beside the Hilton hotel and across from Panera bread is a quaint little Chinese & Japanese restaurant. I'd stray away from calling it fusion because the dishes look either strictly Chinese or Japanese. Chinese options include various sauteed dishes with fried meats. Japanese options include all your japanese food fare (so I'd venture to call this a Japanese restaurant that decided to serve Chinese food).  Dinner on a week night around 8pm was pretty empty so no wait for seating. I ordered the rainbow roll and spider roll. Everything was just A-OK.", "business_id": "hBscDTusN57Ai0SnkQK8Sg", "stars": 3, "date": "2012-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4G68oLRY3aHE5XUt_MUUcA", "review_id": "Q2dUw29wl5W7nrnIaovCsQ", "text": "Shroom & Swiss!  Is what I tried the other day at this Arby's.  I was sort of in a rush to get somewhere but did not feel like cramming the usual fast food fare into my mouth.  There was a bit of a line, but it was worth the wait since they make the sandwiches to order and none are left baking under a heat lamp.\n\nThe staff was nice and friendly and the dining room was kept pretty clean.  Ample parking is available for the location..... it's a bit hard to get to, but you end up turning left through a double yellow line if you are heading down Kings (toward CMC) with the BestBuy & Trader Joe's on your right hand side.\n\nThe register displays what you order on an lcd screen right in front of you so there's less of a chance of it getting messed up along the way.", "business_id": "d4t1qlm-mjhBmDUdboq5Uw", "stars": 4, "date": "2011-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KTaXjEAxyTAeIVY6TO2TTg", "review_id": "MEsl5OKfAbyqpcXKK1zNNA", "text": "I can't say my expectations were too high, but I definitely expected better.  My cashew chicken was inedible, and I was only able to eat the fried rice and egg roll (which were fine).  The chicken was so chewy that I could not bring myself to take a second bite.\n\nWill not go back.", "business_id": "JgGpBGMAb1Nc2Z5jVIwZMA", "stars": 2, "date": "2013-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "_X0Xt2z5Q7GESxxRzvy4_g", "review_id": "ZJa7ugCErNwWIni7wgMrKQ", "text": "I really love Melting Pot! The concept is exciting enough, but then all the food, too?! \nHere's what I normally go with - the four choice classic:\n\n- Wisconsin Trio Cheese Fondue - oh my...I could just eat the cheese by itself! :D However, it does come with vegetables, granny smith apples & various bread for dipping. \n\n- Spinach mushroom salad - the spinach & mushrooms always look fresh & that Shallot Vinagrette dressing is so yummy!\n\n- Entree (cooked in the coq au vin style) of ahi tuna, shrimp, sirloin, chicken breast & teriyaki-marinated sirloin. \n\n- Dessert - Flaming turtle. This is just like the turtle candy; chocolate, caramel & chopped pecans. Of course, you get strawberries, bananas, cheesecake, Rice Krispie treats, marshmallows, pound cake & brownies. \n\nWow! So much food, but so worth it. \nYes, it's pricey, so you may want to save this \"big night out\" for special occasions.\n\nThis location is the \"older\" one in Charlotte & not really my favorite one of the two Charlotte locations.\nI've been to this one twice & haven't had any issues - both times I had reservations & they were on time. The staff is always friendly & attentive.", "business_id": "uDoTFFud2mXE3VT1Jt9L5A", "stars": 3, "date": "2011-08-16", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "W6LTsXcY1R76M9EdeN0G6A", "review_id": "SK2Kye1u5dHgjzcjQqpZmQ", "text": "Wanna get pampered, enjoy a beverage and laugh nonstop? Here's your place.\n\nIt's not fancy. It's just a little nail salon in a strip mall. But what they lack in decor, they make up for in service and personality.\n\nSpa & Nail is under new management. I've been here a handful times now since the switch. Always leave happy. My manicures and pedicures have all had long shelf lives. I've had someone different each time. One thing has been consistent though: they spend a good amount of time on your 'cure. (I just invented a word to cover both manicure and pedicure)\n\nThere are a lot of nail salons I have been to in Charlotte where the worker doesn't say a single word to me. Maybe a \"you want them cut down\" or \"pay now?\"... but that's about it. Not here. They have a cast of characters. Super funny. The stories are great. Their interactions with each other and customers are so personable. I love it.\n\nI'm a fan of Spa & Nail right now. I hope they keep this same crew here for awhile. They have great chemistry together.", "business_id": "24VeElGyFWzFz4DVfMiP5Q", "stars": 4, "date": "2014-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "dXKpxouIP8LRvjFWjV0rxg", "review_id": "jNIs0Lxuai5mzINoeJsBfQ", "text": "Usually a great dinner experience... lunch today was a bit of a mess with my roasted veggie sandwich sitting around getting cold and soggy before it was served. However the manager asked how our food was and seemed genuinely interested, so I told him and he took the sandwich off of the bill, despite my protesting that we were fine with paying for it. I know he would have put in another order, but we were done and needing to depart... Anyway, since he made the effort to make things right, we go with 3 stars and will return soon to see if we can bump that up to four or five next time!", "business_id": "MQnNtW1lHS-eid3QNUoUIw", "stars": 3, "date": "2010-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "z_C4kTmHbPw90PpagbTJ-g", "review_id": "hUGY4XRutZi_9jzcaVwUEA", "text": "Maybe we came on an off night? We used to really like their lasagna and pizza. The visit before this one, they changed brands of Gorgonzola and  the pizza was too pungent to finish.  This visit we noticed the menu is getting lighter and lighter and not for the better. Even the rolls were almost stale. Glad we did not get the bread pudding for that probably would have been off too. I will say our server was great and very attentive.  Guess I will stick to a salad, appetizers and bread pudding.", "business_id": "MQnNtW1lHS-eid3QNUoUIw", "stars": 2, "date": "2013-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gVGu5DHk5iI4CQ2tX7ka6A", "review_id": "MrTsmr_92gOUHgguI16LSA", "text": "Incredible Food and service, we agreed it was one of the Best dinners we've had in CHarlotte.  The location and building are very misleading, the food and staff are top notch.", "business_id": "MQnNtW1lHS-eid3QNUoUIw", "stars": 5, "date": "2015-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VDQDZ5aGZB0d1Xt26MhdAw", "review_id": "NKKXKXln7zBCJPJPud8mxg", "text": "This restaurant serves amazing pasta! I recommend the spinach tagliatelle carbonara. The pasta is fresh and delicious. I'll come again and try pizza. I heard they're great too.", "business_id": "MQnNtW1lHS-eid3QNUoUIw", "stars": 5, "date": "2015-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tU06FcyNk_laNKyfY5ON3A", "review_id": "TyTdoHq-h9YLA1Ya9dXIwA", "text": "Went there to rent lighting equipment. Very reasonably priced. Joey was extremely helpful with explaining what we need and how to use the equipment. I've overheard some other conversations and staff seems to be very knowledgeable.", "business_id": "EQDq4hZ45hDEHaWn6yuZyg", "stars": 5, "date": "2014-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8ED8BPCXKXZnGsVMyl5Bhw", "review_id": "JdkQxwbS0-bTzJhyQ843PA", "text": "I took myself out on a date to celebrate the end of the semester teaching at ITT at Maharani last night. Before I switched teams to be a fan of Woodlands, Maharani was my favorite Indian restaurant in Charlotte. \n\nI enjoyed Maharani last night again. I had the Vegetarian Thali, which kind of gives you the experience of eating buffet even when the buffet isn't open. The whole meal was a little pricey ($25 with tip), but it was more than I could eat. I had leftovers today!\n\nThe service was friendly and fast, and the food was delicious (if not quite as fabulous as Woodlands). I prefer to go to Maharani when there's a buffet, so I wish it had been the afternoon. It's great for lunch!", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 4, "date": "2008-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "3ZEi3D1JRZsII13V65J9nA", "review_id": "W_kRaasmyNZN7fgd8Eam8Q", "text": "The worst Indian food I have ever had in my life. I never thought it would be possible to call an Indian dish bland, but it is possible with dishes like these.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 1, "date": "2015-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IzIHqzyiCUCd8e-qXZd7dg", "review_id": "FklVxsDdcZcC5welCKyshA", "text": "I'd like to eat there again, because they had SO many choices, and I want to try their sushi. I got the ginger lunch, which was good, but not as good or flavorful as it could be. It was just kinda meh. But the service was fast, which was nice, and they did a good job of keeping up with refilling our glasses. I'd go again, and next time I might order something with either more spice or a different kind of cuisine all together.", "business_id": "MMNBgMQCdwyVoNaHg0h_QA", "stars": 2, "date": "2012-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m8BMx-_il4ulig_-8zbu8g", "review_id": "O6Wyh5-2Dc9Z_ZC00id3NA", "text": "We tried roti canal. It was good. The gravy was very much like the Indian curry with potatoes which we get in northern India.\nThe satay tofu was something different that we had and was delicious for an appetizer.\nI had a lamb chop dish. The sauce was not that great. More on the sweet side.\nI should say a restaurant with some choice for Asian cuisine", "business_id": "MMNBgMQCdwyVoNaHg0h_QA", "stars": 3, "date": "2015-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S8T8u7McjQzDvTEpMUVtdw", "review_id": "g653vJeAK6N0gmtUKn2d9w", "text": "Tons of comic books here, but lighter on other items.  Come here first if comic books are your priority.  If you are looking for things other than comic books for your inner geek, I would recommend checking out another place instead.", "business_id": "L1OqlH9UzjBK0js4sKs9cQ", "stars": 4, "date": "2015-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "66kGSuUwMTEhnJzDZB5GJg", "review_id": "NIy-UzkEmyKtKnttD9GMmw", "text": "For nights I want a cheap and quick pie, Papa John's is my go-to. \n\nThis review is based on many orders for pickup. I live nearby, so I have not experienced delivery service. I have never had any issues with this location. This is your standard papa johns, everything I have ordered is on par with other locations. My order is always correct and ready when I arrive. The brief interaction with the staff here has been pleasant.", "business_id": "l3mzaesyc90rxXt2d4HpTg", "stars": 4, "date": "2014-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t2AphU3RtUXOrezPFELbag", "review_id": "Xxd_KOt7eUIZX-ImQHYazg", "text": "Bought a voucher on LivingSocial and decided to dine here and I'm so glad I did!! I will definitely eat from here again. The food was fresh and delicious & the service was awesome. The prices and quality of food is well worth it. Great spot for inexpensive vittles.", "business_id": "cibtubYc6gd8T6Y-nPPByw", "stars": 4, "date": "2015-07-22", "type": "review"}
