{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "z5Y8aIWjwyaa0110WAZorg", "review_id": "vlLt_bawrKA6GaUCiJ1Kfg", "text": "To tell the truth, I have never had sushi here, but the Korean BBQ buffet (upstairs) is wonderful!  Lots of different meats and vegetables that you bring to your table and cook there.  The pork is great, there is beef, shrimp, fish, scallops, maybe?  I forget it all, but there is a large variety.  And the experience is really fun if you have never tried it before.  At first we were a little worried that we might not cook the meat enough since they pretty much turn the stove at your table on and leave you to your own devices, with little guidance, but we haven't had any problems.  It is not very hard to do.  I love going here and eating a ton of delicious Korean BBQ!  For $19 a person, it is a great deal!", "business_id": "dHDi4wCcjsOR6vcZ8oOIoA", "stars": 5, "date": "2007-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f1a9KwsObpE54Yp9A1fVoA", "review_id": "uGULdyyLCkHXA3rD-OuB-g", "text": "Restaurant review\nMy first venture into Korean food in Champaign was good. We decided to stop for a quick lunch and ended up at the first restaurant that opened at 11 AM on a weekday. It was easy to order because we were the first customers of the day. They have a nice laminated menu at the desk to chose your entree. It would be nicer if they had pictures instead of a word description of each item. I selected the combo platter of bulgogi which was 9.99. Afterwards it was a long wait of approximately 25 minutes before we got our food. The dish itself came with a large amount of rice and 2 ban chae along with a bean soup. Based on the pictures I could have chose the beef bulgogi paid less and likely gotten the same amount of food except less variety. The bulgogi was well seasoned, but the meat was cut into smaller slices which detracted from it. Prices have gone up according to my wife since she was in college. Overall slightly above average, I will have to find another korean restaurant to compare too.\n\nPro: average price korean food, large portion\n\nCons: long cook time, higher price than average lunch places\n\nHidden gem:\nYour meal comes with rice, soup, and 2 korean ban chae", "business_id": "U8fJ4fEhoFGqxYLK_VNoEQ", "stars": 3, "date": "2014-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "H6fszVMVr0syml5qOmp6RQ", "review_id": "Q6zwIOrPRvDd2NRjTB8dmQ", "text": "It's this simple: the BEST Korean food in town!!! :D\n\nWe always eat tofu soup here and they're the best in town (we tried others), and probably the best I've ever had in my life! :D People at my Chinese church told me their Korean church pastors and friends said this is the best in town too!!! Whenever my friends from other places come visit me in Phoenix, I bring them here, and they all love this place!\n\nWe eat A LOT here so never really thought of writing a review (what logic is that?) and found that the quality is pretty consistent. I think I only encountered twice that weren't very good.\n\nThe spicy beef brisket soup is very nice too!!!! I've been lack of appetite lately (for over a week), not sure why, but when I ate this yesterday, I could eat the whole bowl (it was a large bowl too) and wanted more!! :D It's that delicious!\n\nI hope that they'd have Korean BBQ too, haha :D", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2011-07-23", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "SfOq7kTmpUJs5bqcrmapRw", "review_id": "PAJ2bGD2MrcC-k8HtF_M5g", "text": "Tried this place for the fist time today and I think I'm in trouble. The food was SO good, the staff SO pleasant that I'm gonna be driving back to Mesa just to eat here.\n\nI'm new to Korean cuisine so the waitress suggested the octopus hot plate which was SO good but I couldn't even put a dent in it after devouring the accompanying side dishes!\n\nI'm already making plans on my next visit. It's well worth the drive in the summer heat for food this good!!", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 5, "date": "2014-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B7fXosqTYX_ml2asru0bGg", "review_id": "izz-FGFOISA8gGUYec3JUg", "text": "I've had the food here a few times, a lot of my friends don't like it. But I think their kimchi pancake is pretty excellent, it's very tasty and they always use well fermented kimchi which is key to having delicious rich flavor. So I can at least recommend that. : )", "business_id": "PX3e3qtBx_5VC3vqq47jpQ", "stars": 4, "date": "2015-08-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "-K3ZjROK0ml2P-Rk7ttHzA", "review_id": "cpRp7w4BRBoMrHx0CYACNA", "text": "Yes, they had their tv turned to some show on surgery that had blood and guts everywhere, but I thought it was pretty funny. \n\nI really liked this place a lot and having 14.99 ayce kbbq was a definite plus. \n\nThe salad was delicious, we had about 4 or 5 refills on it. The meat was tasty, especially the rib eye. The sides went together perfectly. We hardly had to ask for refills cuz they were totally on it. They even gave us our own water pitcher so we'd never run out. \n\nI liked that this place wasn't so packed when we went. There were just a couple groups of very wasted people that made for fun entertainment.\n\nI definitely want to come back here. Next time I know not to sit in the direction of all smoke though!", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2010-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gxeNOZ2dUZGV-l583FK_bA", "review_id": "icRUA7wAsOSj1hB17fV2Qw", "text": "I just ate at tofu hut for the first time because its the cheapest all u can eat in las vegas at 16.99.  I have many complaints about this place. So half of the restaurant is all u can eat the other half is sit in. So in total on the all u can eat side is about 8 tables. So first let me start with the side dishes. I am korean so i know my korean food and ive been to many korean restaurants. I have never been to a restaurant whose side dishes were so untasty. The kimchee was way to sour and salty and mushy. The odang was soo mushy that u couldn't even chew it. The korean pancake was way to hard. The clear noodles (chapchee) only had noodles and the only flavor in it was soy sauce. The only thing that was slightly edible was the cucumber. The meat they served was mediocre. It was edible but not delicious. They take FOREVER  to bring the meat. We would keep ordering meat when they would bring us a plate and by the time we got our next round of meat we had already finished the first portion and waited so long the grill got burned. The portions of meat was so small. We ordered galbi they brought us two slices and the slices half of it was just straight fat. They also dont use real galbi they use skirt part of the meat not short ribs. So they charge an extra 3 dollars just to include the galbi in the all u can eat and its not even real short ribs. So even though its the cheapest korean bbq around i will never return to this place i rather pay the 21.99 that everywhere else charges to have a better experience. This place just failed at every turn. Side dishes horrible, meat was mediocre, and service was horrible as well.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 2, "date": "2012-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0cmN8x1SGv63mlVP-eX8tw", "review_id": "Z7k5SzDflBmc8xeDpfmnDA", "text": "I love that this place is open late.  I have come in to do the Korean BBQ before and have come in to just have some spicy tofu soup by itself as well.  Staff is always pleasant and pretty attentive.  I have never had any issues and tend to eat here once, every time I go to Vegas.\n\nThere is a decent variety of meats to grill---and if you're feeling hungry, the all you can eat is the way to go.  I think the banchan varies greatly as it does at all other places, so these can be hit or miss.  The Korean BBQ gets pretty busy during the late nights so be prepared to wait----but since there is an all you can eat option, the wait is totally worth it.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2013-07-19", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "58PgPEDGX8hLNNVbvCc8cw", "review_id": "vUqMKEgZ6IpEzO5VF75bQg", "text": "Came here to meet some friends, who claimed this was Korean BBQ even though it's titled Tofu Hut.  Well, they were right, and the story behind the name is they expanded their business and menu to now include lots of Korean meats.  \n\nThis place was great. The servers were very attentive, the sides were tasty, and the price for AYCE BBQ was very reasonable.  \nWe had a big table, so we got like 4 different meats to start...I like all of them, but the cow tongue was a tad \"organy\" to me.  My favorite was the prime rib steak cuts. \n\nMy only true disappointment is although they serve a chopped salad, they do not have lettuce leaves to wrap the food in.  This is the way I have always eaten it, so I was sad they did not have this option.  But due to the other positives, I still give this place a 5...and I would eat here again....I'll just bring my own head of lettuce.  BYOL ;)", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 5, "date": "2014-08-02", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "JsBUzl5cLR-3KB0sgdmVwg", "review_id": "asMSXKLFd4ZD_UOMA0hRUA", "text": "Late night special:  ayce Korean BBQ $\nIncludes traditional Korean side dishes plus they give you this salad that is just drizzles with this light sesame vinaigrette.  The special thing is that they have steamed egg on the ayce menu too!! (love steamed egg). \n\nIf you haven't it's basically a fluffy egg that was steamed in a small clay pot =] \n\nIf you don't want to do ayce they do have a reasonable priced side menu.  The kalbi plate and bipbimbap is always my favorite.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 4, "date": "2015-07-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rgn4_YNY0VTgVorqnmsZkw", "review_id": "dvskJFV6A6nkys_RIT2XPQ", "text": "Service this time wasn't great. My main complaint here is they're still charging gratuity. Bad service and they still get 15%. They argued with me saying it says on the counter about party of 4. I've tried telling them it's law that they can't charge gratuity automatically anymore.", "business_id": "UKKz4HdQC0aH9j5lLi4u8Q", "stars": 3, "date": "2015-08-16", "type": "review"}
