{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "GSKY-zWTManYbMGXmRDb3g", "review_id": "neWYXBJ4P-LdcHRD9Udt9g", "text": "There's a reason why this place has no reviews.  It's never open...not even at 6:30 pm on a Thursday.  Even though the sign said \"Open\" and the door was open.  I guess I was supposed to know that it was closed.  But all I got was two people screaming in my ear that it was closed like I barely understood or something.  So much for customer service.  Needless to say, I probably won't be back.", "business_id": "GQloL8yRHymE0SGZq-B0zQ", "stars": 1, "date": "2008-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "LYKMElh2u27sPIzoQFaGIQ", "review_id": "EzepW8ya1136vYZZEuBioQ", "text": "5 stars. The food stands up to lots I've had elsewhere (and paid more for). Menu is a little limited.\n\nWe often ordered the mixed vegetable with chicken appetizer and our neighbors would always see it land on the table and murmur covetously.  I don't know if the dish has a Vietnamese name, or if it's not particularly authentic, but I'm pretty sure it's described as mixed chicken and vegetables on the menu.  It's a kind of sweet vinegary slaw with peanuts and root vegetables and it's amazing.\n\nIt's way better than the somewhat over-rated spring rolls.  \n\nAlso, really great service and I, for one, love the seasonally appropriate plastic tablecloths.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2007-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4b7Bul5PCH8v7DxLutkEzA", "review_id": "d4pX9G_bF-QOdT--1TzLTw", "text": "[+] \npho soup \nrice spring rolls \namazing flavor \nwaiter with one hand \ndecent price \nbyob \n\n[-] \navg. ambiance \nwaiter with one hand", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 4, "date": "2011-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lv2KPGPne5OouCoJw3MCvQ", "review_id": "aLnJMh7GxA37tMa0USoTcA", "text": "Great experience.  Took me back to my days in Saigon.  This is literally a mom and pop shop so the service is great.", "business_id": "dxCqGkhtXq-9fYEsX7Mf6Q", "stars": 5, "date": "2015-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "07-vagocs2yZJPGyNLx-lg", "review_id": "qtfUrcCJWQX3EU9C4iW5EQ", "text": "All items on menu are full of flavor.  You can eat inside or outside. Take home is available too. You get a ton of food for the money. I love the matcha(drink). It's the absolute BEST.  Owners husband and wife, so cool, my first time in I was looking for something tasty, new with a good feeling after I ate it.  I asked what do you recommend for a rookie.  Chicken pho soup, spring rolls. That was two years ago. Kid friendly too.", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 5, "date": "2011-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GjggdVEjRmatV_rQzFQJew", "review_id": "omQNas8uihmxBr5mEn3BZg", "text": "Some people think that a non-vietnamese clientele means the food is not authentic or as good as other places. Wrong! I have eaten Vietnamese food in Asia, SF, LA, and Phoenix and Tea Light does a good job making customers happy! The place is modern, the staff friendly, and the BBQ is very tasty.  The pork chop is very good, and so is the bbq pork entree. The boba drinks are good too and when I'm in this part of town, I always make sure to stop by and eat there.  It gets 4 stars b/c of course there is better Vietnamese food, but overall this place is a hit!", "business_id": "L_MtTn4IUBTmQtqqM2iFqA", "stars": 4, "date": "2014-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0beZngJ03EmIQfVcnlVK4w", "review_id": "Es4TcYoWw5cl2V7VQ62tBw", "text": "I had lunch here today. I love the owner, he is awesome. Always friendly and he tries so hard to make everyone happy. I had the raw beef pho and it was very good. Not the best I've had but definitely up there. I also had the spring rolls. A little too much mint for my liking but they were fresh. All of the veggies were beautiful. Fresh and lots of flavor. My beef was pretty good too. The fat had been trimmed completely so I was thrilled. I hate fat. It hit the spot with me and I will continue to go back. The service is great and fast. Overall a nice experience.", "business_id": "juzATNnxyBWEdQoDoKrEuw", "stars": 4, "date": "2011-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z3qVl-1JgYnAe4py6VC5ug", "review_id": "RVP4VXBB1OAsddDcfr6ocQ", "text": "Very good Vietnamese foods. However, the water always taste like breached water. The best noodle soup and fry pork rice dish around that area. Very good price for lunch, especially for people work cross street at Intel. It's crowed over weekend. \n\nOne thing to keep in mind when paying the bill. Double check the total price after tax. They sometimes add extra couple dollars if you don't pay attention.", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2006-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IdfrWOvGmp7F6FYOUHPZsQ", "review_id": "AnXCeZhbBsafQnyAaPjH1Q", "text": "I was spoiled living on top of Vietnam 2 in the heart of the TL in San Francisco, and I never thought I would ever find another Pho joint in all of the world that I could love more, but I have, and it's a short 5 minute drive from my home in Chandler Az. I can literally eat pho for breakfast lunch and dinner, but for the sake of my sanity, I try and mix it up a bit. As soon as I step foot into this place I feel like I'm right back home. Everything about it reminds me of my fave spot in SF minus the small fish pond near the front entrance. I also love the consistency of the dishes here, always satisfying, never disappointing. And their fried egg rolls are pretty bomb too! I think I'm going to go have myself some now! YUM!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2011-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ThuuhiTIdkuYuppe3fJHWg", "review_id": "-xDBZBbOF6_CZhveBJRDVQ", "text": "My husband and I were craving pho last weekend and after an unfortunate experience at another vietnamese restaurant we ended up here. I'm so glad we did! The service was quick and very friendly and the pho was the best I've had in a long time! We will definitely be back!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 5, "date": "2013-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tlQsscjEy0GG3hlBSm40BA", "review_id": "Ujd2Qn7WPZk21dFL4RXVvQ", "text": "In my exploration of phoenix Vietnamese restaurants, there seem to be many types of pho and pho restaurants. Some delicate, some hearty, some traditional, and some that are not really classifiable in a good way. \n\nThe broths I've experienced here are more hearty and filling. You get a good amount of nice, tasty broth, fillings (veggies and meats), and the perfect amount of noodles whether you're dining in or getting take out.  \n\nThe food has always been fresh here and the service always has been fast and friendly. The price is also amazing for the quality and quantity you get. There's really no comparison from all the pho places i've been in town.\n\nFor Pho, this is the place to go!", "business_id": "jJlOPkv4Xl6vxNzr51fnYw", "stars": 4, "date": "2015-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sdUc66dpqO_tP3Lhof23tQ", "review_id": "BkgrRS0SZTfHzCB4Q2wMuw", "text": "Went last night, awesome environment, great art, amazing food if you like Vietnamese, would recommend the seafood soup and the egg rolls. BYOB which I love!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2012-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pTqJ1WjV_Fwfxz1fkga1Tw", "review_id": "6JlP_ODQK7NWUCSm8V4eQg", "text": "Super amazing food!  We had the green papaya salad, rice crepe, wokked beef, fried rice, crispy rice cake.  The crepe was out of this world!  The rice cake was also delicious.  The staff was so friendly.  We will be back!", "business_id": "UIGFrEcoDsw05I1UOrxdOA", "stars": 5, "date": "2015-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RmjagKF7Ws0PFlzLlH9NLA", "review_id": "JjHhEWEJQjt9OZugsCrRvA", "text": "Got into Vegas and by the time we got our rental car and made it to the strip it was almost 11pm. We were trying to get to In & Out Burger and I took a wrong turn and OH MY GOD found this whole area of viet restaurants.... what amazing luck... AND open 24 hrs? Wooo Hooo! The menu included items that I would consider Chinese, but we ordered the vermicelli bowls with egg rolls. I had chicken, and others at my table had shrimp and pork. All were great. Fast service, reasonable/cheap prices, and nice wait staff, not to mention a name that makes me giggle!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2009-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uBeGhyImpBgZ1MfAVEogew", "review_id": "wlomNPM5uRsBsK6Z13MWAw", "text": "I prefer the pho at Pho Kim Long over any other pho restaurant in Las Vegas. Very inexpensive and delish! I don't feel overly full and stuffed. I feel healthy leaving. I've never ordered anything but pho #10. Soooo good!!", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 4, "date": "2010-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IzAHGTkF41fhhZ8pRnGgww", "review_id": "GZvzOXfY01Ast-iCUGkGnw", "text": "HORRIBLE, HORRIBLE experience for my family and I when we ate there. \n\nWe had a total of 11 people, so they had to split us up (we weren't allowed to move the tables closer together). So the breakdown was 5 people at one table (the table I was a part of) and 6 at the other. My table only had a total of 3 orders (I shared with another and one of us wasn't hungry, but just wanted to hang out). Anyways, in the end they combined our orders (even though we were at separate tables and weren't able to talk to each other). As a result, the imposed gratuity was much more expensive. I walked up and complained that they should split up the order into two separate transactions. They gave me attitude since I was adamant about it. WHEN MY TABLE GOT OUR RECEIPT OF JUST 3 ORDERS, THEY STILL CHARGED US GRATUITY!!!! I was at my breaking point but my friends persuaded me to let them go. \n\nOther nuisances:\n- Some people at the table ate there before. They have always had pickled onions. This time when we asked for them, the waiters claimed that the restaurant never had them. Liars.\n- My cousin asked if they had different sizes and they said, \"No.\" Later on, he found out that his friend was able to order a small. Liars.\n\nI reside in Little Saigon, California. All I can say is that the food is mediocre for the price offered (around $6-8). Here, a delicious bowl of pho could sell for $4 for a large.\n\nAs a result, for mediocre food that's a little bit too pricey compared to other pho places, the disgraceful service just tops it all for being BLACKLISTED on my list of \"Restaurants That Aren't Worth It.\"", "business_id": "FV16IeXJp2W6pnghTz2FAw", "stars": 1, "date": "2010-08-18", "type": "review"}
