{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e1W6pOaJbovM-jEosgwOCw", "review_id": "ecfCz1vJVr1dgFCrDchN1g", "text": "I fell in love with this place as soon as we pulled up and saw the lights strung up and  oldies coming from the speakers! \n\nI tried the banana cream pie hard ice cream, their scoops are very generous!! \n\nMy bf got the peach cobbler hard ice cream and that was to die for! We got 4 servings of ice cream for $10, which nowadays is a steal IMO! :) \n\nI'll definitely be heading back with my coworkers this week!", "business_id": "Rjx8GcWuCzfVsKC5iPIcQA", "stars": 4, "date": "2012-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5rvNh0vsHVPJ6S-NoFNXpA", "review_id": "Gziww9Men9ikAzafk2kx9A", "text": "Page's is one of my favorite places to go for ice cream in Pittsburgh. It is a pretty cheap place to go for the amount of ice cream that they give. I'm a big fan of soft serve ice cream so if you are too then definitely check this place out. Their cookie sundae and yinzer sundae are to die for and can easily be shared among 2 or 3 people. The only thing that I wish they would would do is give out samples of the ice cream flavors and take credit/debit cards. They are known for their ice cream but they also have food (burgers, hot dogs, nachos etc) I personally never tried it. But I'm sure it's good as well!", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 4, "date": "2014-08-08", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "fFoRIzbwpMiv3BvfdtdlXQ", "review_id": "4ioYzk0Q_2aIeBZXstaxIg", "text": "the ice cream is pretty good.  not crazy about the set up in here and it's somewhat confusing ordering from the counter.  the single dip cone is around $2.50, double is in the $3.50 neighborhood.  they do give a good amount of icecream and the milkshakes here are thick and good.  just not crazy about the atmosphere here.  it's difficult.", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 3, "date": "2009-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p3MF38R3Htt3ZWyPJMTFgQ", "review_id": "mRiHRnuag0OUyR7050jTlg", "text": "Two of us went to Klavon's this past Sunday and we walked in about ten minutes to 12pm...neglecting the CLOSED sign (Not on purpose, though. We had been going and going for a few hours and thought it was like 2pm). There was a toddler's birthday party going on and all of these people were staring at us. We had no idea why though we soon found out. \n\nThe two people behind the counter were really friendly and went ahead to serve us. I ordered a moose track sundae with marshmallow whip cream while my friend got a malt. Then the young man behind the counter gently informed us they were still closed and others had reserved the space for a birthday party. We looked at each other and scooted on out to the bench outside. Then we laughed and laughed about how we basically crashed a toddler's ice cream birthday party. Whoops! \n\nIt was still very nice of the two people there to serve us. We definitely appreciated it and the ice cream was beyond amazing! We'll be back...during regular hours, that is. ;)", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 5, "date": "2014-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0N4ljypAh4g_aS4m0TmrlA", "review_id": "TTS4BqYnmlK6DNRrO9XPEA", "text": "Jitters has great coffee and a great atmosphere. Its cozy and has a European vibe. There is outdoor seating and the noise level is just right; quiet enough to get work done, loud enough to obscure conversations. The crowd is diverse - groups of locals, internationals, and people of all ages, but everyone is friendly and down to earth. If you are new to the area, I highly recommend it. It is a progressive coffee shop where people sip their coffee and enjoy it. A refreshing escape from the typical grind ;)", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 5, "date": "2011-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "K8B5FoAgHA0PhyUT8pa9JQ", "review_id": "RNir8VCDCPnI9wePXnu5rQ", "text": "I usually do not write reviews. But this place deserves the 1 stars. This location is dirty, fly infected, key toppings seem to never be in stock and the menu/ingredients for the ice scream is inconsistent. There's no health score posted and I believe that I know why. If you are in the mood for ice scream just drive to Marble Slab on Rea Road it's a little bit of a drive but it is completely worth it.", "business_id": "IQbEYPh7OKoUmsI6VoLmTw", "stars": 1, "date": "2015-06-30", "type": "review"}
{"votes": {"funny": 7, "useful": 5, "cool": 2}, "user_id": "lC0KGXmIhyjzghBUlVnkhQ", "review_id": "ZNVRxO3CwgH2IZnermvfDw", "text": "I'm embarrassed to be writing this review. \nWhy, you ask? \nWell it means coping to a number of things: \n\n1. I was at Dairy Queen. \n\nI'll stop there. \n\nNaw, I'll keep going...\n\n2. Even though I'm lactose intolerant, there's just something about a blizzard I can't say no to.  \n3. Yes, even Yelp's lover of local winds up at a chain every now and again. It's usually during a dark period or when I'm leaving a meeting in Sun Prairie and I drive by the only DQ I know of in Wisconsin. \n4. The basis for my low rating is a terrible blizzard that crushed all my blizzard dreams. \n5. The real basis for my low rating is the fact that they took out friers, so gone are the days of crisp \"chicken\" fingers and white bread... seriously why were the baskets served with white bread? \n\nAt the end of the day, the product, and I mean water, maaaaaybe skim milk and flavoring just didn't meet my expectations as blizzards have before. (I told you, I'm embarrassed) Add to this the fact that when it comes to \"Brazier\" all you can get is a hot dog swimming in funky hot dog water and there's little to no reason for me to stop here anymore. \n\nI want to take this opportunity to apologize to Michael's, Culver's and most of all Kopps in Milwaukee. I'll never stray again. You shouldn't either.", "business_id": "RIsEPpt2jM7c_Ko_CyLwMw", "stars": 2, "date": "2013-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RvweNJFVkR3ttkWsIBy7nQ", "review_id": "PsTwauHs26CUPCiL3qBb9w", "text": "I sent this review in and all Dairy Queen said was thank you for your feedback.  Nothing more.  No follow up.  Gross.", "business_id": "QwUHifLjoc5hoxa74jpwGQ", "stars": 1, "date": "2013-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1xXgoz4ZaJjyYvjc4O6-tQ", "review_id": "Yx2krnzJNjMmyDx9u43etA", "text": "love it.  i have been comming here with the rents since i was little, so its nostolgic for me.  i still get the same thing, a scoop of lemon on top of a scoop of chocolate in a waffle cone.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2008-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kd3yd-ZxoZ4q2-8eMD43Qw", "review_id": "hloGQE2ouXLfMat6jJserw", "text": "Good custard.  They can make about anything.  Service is fast although it's a popular place so there is usually a line.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2011-06-03", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "dxl9ZmoFYymlf6q3pQqXww", "review_id": "iN1kfwmtz36G_5F3BAY6Sw", "text": "Wow.\n\nIt's a frosty treat that's like ice cream but... creamier?\n\nThere are approximately two billion ways to make a \"snowstorm\" (just like a Dairy Queen blizzard).  I was advised the lemon version was incredible, but when I ordered it, they were out of lemon.  Curse you, Custard Gods!\n\nI went with a mint chocolate chip snowstorm and it was the perfect treat.\n\nPlease question the sanity of anyone who doesn't enjoy the hell out of this cool throwback treat shack.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2014-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sPpgwnTgA4myuCwwAsPrAA", "review_id": "gNX1Ssw3VNoIeWbCEW_s4Q", "text": "We rode our bikes to Jarling's on a Saturday and I had the smallest serving of a Coffee Chocolate Chip (my FAVORITE 2 flavors!) Snowstorm.  I'm thinkin' that the calories burned on the bike ride were less than the calories accrued with the ice cream!  But it was GOOD!!!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2015-07-01", "type": "review"}
{"votes": {"funny": 4, "useful": 1, "cool": 0}, "user_id": "oIVsVM8H273aoT1JUmsDIg", "review_id": "b__2-pcp956qWHeBYl5y2Q", "text": "The other night I was craving a Peanut-Buster Parfait but had no desire to schlep inside the nearby Dairy Queen.  I was feeling lazy, bra-less and make-up free.  Easy solution, I thought. Drive a little farther to the drive-thru Dairy Queen. YES!!!  \n\nCentral was eerily vacant of cars, so I made it there in no time. It took a while for someone to take my order and then when I got up to the window, this young kid looked at me and asked if I was \"so and so.\" At first I thought I didn't hear him right so I said, \"What?\" He repeated the name. I ponder it for a moment, and with a scrunched look, I said \"Uh, no.\" \n\nI paid, got my change and drove off.  But I started thinking on the way home: could that have been a secret code? For a drug-deal? Or some cool rave party? Damn! I should have said \"YES!\" I could've had some extra fun with my Parfait!  Oh, well.  It hit the spot. I'll be back again, and maybe the next time I'll remember to say \"yes\" if asked a random question.", "business_id": "zZmhEpiVpRfFQid87-pcOQ", "stars": 3, "date": "2008-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KRK6DBYclKajOmMxia-_sg", "review_id": "e6TNodH63acx-3Vq58TIAQ", "text": "Good place with cheap tasty food.", "business_id": "vB3vEjcw9dfHmgP8ac5ZMQ", "stars": 4, "date": "2012-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bUS1Ksx4dbnMVCSbA6skvQ", "review_id": "12lMlh983l3YEOCmv9T4bQ", "text": "Folks are always great and a neighborhood feel. Always clean and they are helpful when we have questions or need something.", "business_id": "OeMFOkAqCjKmVLPSsUDB-w", "stars": 5, "date": "2014-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EYrDkv8H6A28bW97m9GhHA", "review_id": "dsR2PmgT_LuTwjKuQeVImA", "text": "Finer things grinder. Bumbleberry concrete w/almonds, or concrete w/banana, grahm cracker, and cheesecake.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 5, "date": "2015-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7hAKHgcuYXJp4k5FlcuPlw", "review_id": "Yux-ZURwlUMKlVGEcdfBPA", "text": "I've come here 3 times now, and received blatanly unenthusiastic service, messed up orders, and a blizzard ordered extra cheesecake, with less than the normal amount. I'm not going to waste my money somewhere I won't at least receive a little service, let alone consistent food practices.", "business_id": "kqFQLV63mAYCsY1LSB2OZw", "stars": 1, "date": "2015-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "z1rKvHycynvKLvuHYh2WLw", "review_id": "u20CvQiyGOJMJsgEs3Yx_w", "text": "CHRIS Z ROCKS!!!\n\nMy daughter has peanut allergies and we have been to other Cold Stones where the crew members act so put out when you ask if they can clean the stone for an allergy. Tonight Chris Z. actually went out of his way to use fresh utensils and a clean containers to make her ice cream.\n\nI've always liked the ice cream here, but the staffers at this one were really great which made the ice cream that much better!\n\nThanks again!!!", "business_id": "EJzoRTV3IUSxpnxRAzngDw", "stars": 4, "date": "2007-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "2BUJA0Y7ktr9vL_37ss8gQ", "review_id": "VuiQZfbL000BE9glpwqahQ", "text": "It's okay.  We were so pleased when Karen's opened up and visited at least once a month, ordered pre-packs for parties and holidays, and were pleased to support a local business.  I gave up on getting peanut butter as a mix-in when the PB they were using was rancid.  Okay, fine, figured I'd stick with more popular toppings that are probably rotated more often.\n\nThen, out of curiosity, I asked Karen if the cake batter ice cream really did have cake mix in it.  She got really snotty and said she wouldn't tell me her \"recipe\".  I wasn't asking for the recipe, I was asking if it had cake mix in it.  What if I was asking because I was gluten-intolerant?  She just huffed at me and said something about \"flavoring oils\" and \"special combinations.\"  We haven't been back since.  Oh, and I did find out later that Cold Stone's version has wheat flour in it, so I presume her version is cake mix based, too.  Not that she'll tell you that!\n\nBut the roaches?  Gack.  Now we definitely WON'T be back.", "business_id": "Om3WtcK5qgwEW5-CojPMxw", "stars": 2, "date": "2008-08-17", "type": "review"}
{"votes": {"funny": 3, "useful": 14, "cool": 4}, "user_id": "M-cg8raooXZKV8NsNmQGjw", "review_id": "HotWaA6zF0C16B_1S3lDiQ", "text": "If you're going to pass out free \"single scoop coupons...honor them and don't say the coupons are only good for kids scoops. You have it on your signs...Single, Double & Kids...the coupon specifically says \"single\". \nThe ice cream is always soft and melty here. Unfortunately for the kids who work here, if a customer asks for another scoop because they don't like the melted ice cream, the employees have to pay out of their own pockets...ARE YOU KIDDING ME?!?!! These guys probably make minimum wage and you expect them to pay for poorly refrigerated ice cream because you're too cheap to crank up the freezer to a normal level!\nVery disgusted with this BR. It's hard enough for these kids to earn a wage but this is unacceptable. I am boycotting this location and encourage my Yelpers to say something on here for these poor kids.", "business_id": "PMpQAV7glwhKhnHfDa30Dg", "stars": 1, "date": "2013-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gCepLQZzVqsnExy5fQHExA", "review_id": "iV4WvkTfpUPk_xcfZ3JOUQ", "text": "Went to this location yesterday for a birthday cake and there were absolutely no cakes in the freezer--all empty.  Went today to get a non cake treat and the place had no chocolate icecream!  Ordered blizzards ice cream was very melty. \n\nI would love to know who is managing this store. I will drive a longer distance to avoid this location.", "business_id": "SchSiNdLjuRjjrsXFeggWA", "stars": 2, "date": "2015-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "HsKPpfcATrQ5Bb0ab9VQNg", "review_id": "9uX0Sh5F9o1btWWUk0J4Xw", "text": "it's right behind the olympic gardens. heeeeheee.\n\ni tried three different flavors - the banana split, the one with caramel, and a nutty one. i forgot all their names but i like the nutty one the best.\n\nit felt like they were melting much faster than fro yo but it was probably the LV heat. there's no place to sit so we just stood next to the building to eat it. i felt like a bored teen looking for something to do on hot sunny afternoon. then, a bunch of gangsters were heading our way so we jetted from there like our butts were on fire. hey, i dont want to get shot eating frozen custard.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 3, "date": "2008-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "glRXVWWD6x1EZKfjJawTOg", "review_id": "QNv6z5MXaO7EW1LnqBDN3g", "text": "Dropped in with my Yelpie peoples for a cap to our Happy Hour at DCR.\n\nJust went simple with vanilla and butterscotch so nothing too crazy. It was good custard definitely and I like that they have options and many fun seasonal flavors.  Portions are big...the junior definitely filled me up so a regular will be a sharing portion. \n\nShort and simple of it- I'll be back when I'm around the area, but I wouldn't say it's something I'd drive all the way out here for. I think it's a great Vegas institution and a good place to bring some of my visitors for a treat.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 4, "date": "2010-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1AOaOBro84qTkp17S1uimg", "review_id": "oKWc4thy0XFwr4sds8tSBg", "text": "Had a cup of the Swiss Almond last night.  OMG.  Great place, and a favorite of various hip and creative locals, as well as the more daring visitor here and there.  The frozen custard has to be tried to be believed.", "business_id": "uYVdp5LfCbX8S8ytnhdk-g", "stars": 5, "date": "2011-06-11", "type": "review"}
