{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "e6GiLUdbUaPX7-P9QtHrXg", "review_id": "IhLPy_qJqRyGb_vGwHNeaQ", "text": "We decided on Sapporo after reading so-so reviews on Ichiban and Benihana's.  This was a nice surprise. Yes, it is not in the best looking area, and yes, the restaurant may not be as nice as a Benihana.  But the food was quite good.  \n\nWe had our doubts at first.  We went in the middle of a Sunday afterfoon and the place was empty.  And service seemed to be a little disorganized and distracted.  But once the chef came out and got to work, it was great.  The salad and soup were veyr good, the soup being a little more beefy in flavor than what we were used to.  We then had the fried rice and got a HUGE portion.  We needed a little more soy sauce that what the chef used, but he gladly provided more and the rice was delicious.  \n\nThen we moved to the main entrees.  Wife had the Chateaubriand and I had the Tenderloin and Scallops.  The meat, although cooked  just a tad past medium, still melted in your mouth,and the scallops were absolutely the best I've ever had!!  Again, huge portions of meat and vegetables, plus a large portion of noodles. Definitely a plateful.\n\nWe did not get the requisite show you get at this kind of restaurant, but we've seen it so many times, it's kinda boring to me.  Instead, we had a nice conservsation with the chef about the Pittsburgh area.  All in all, this was a very pleasant meal, and I'll definitely go back.", "business_id": "8Nm_jcCYtMXYW0ODSHDiXA", "stars": 4, "date": "2012-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "BOcojc9Sjk5p8MIcU681eQ", "review_id": "wzKYl_YOOyOw0-y-LAC56A", "text": "Great sushi bar. The staff and owner are extremely attentive. Great presentation. Decent price too. And I got to sit next to Mario Lemeuix at lunch a couple weeks ago!", "business_id": "mPlWLIA4pkHMRtlQDm6UyQ", "stars": 5, "date": "2010-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0-IKqUmfUCvTmmt59JXaXQ", "review_id": "DVOfOZ0OTy_Mi-WdakKSEg", "text": "This is amazing sushi.  I have not tried the hibachi but it is nice that they have it for dining with a mixed sushi/non sushi eating crowd.  \n\nThe sushi is spectacular and there is high attention to detail.  The miso soup is made completely from scratch, no cans.  The grated radish and other garnishes are made fresh daily.  There is no hint of staleness in anything.  The bartender is also generous in his pours.  We are never in a hurry when we go for sushi so I haven't paid too much attention to the time it takes but they always bring out the next item as we are finishing the previous.  We have frequented here for a little over a year and always leave very pleased.  \n\nFor the food quality and attention to detail the prices are also extremely reasonable.", "business_id": "mPlWLIA4pkHMRtlQDm6UyQ", "stars": 5, "date": "2014-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "KcNVnifKi1Wgnv7jZ5RGIw", "review_id": "mT-23Xrhx5cnWnmAuMIzvQ", "text": "Delicious sushi, very professional wait staff, but probably won't go back for a few reasons.  \n\nThe restaurant is in Shadyside on the top floor of a 3 floor building.  Get ready to walk up two steep flights of steps.  I hope you have a reservation, because there is no waiting area at the top.  You have to walk aaallll the way back down 2 flights of steps and wait at the bar, then walk back up when your table is ready.  They won't let you sit at the sushi bar unless you order from some special menu.  It was just silly.\n\nWife and I each got a Sushi platter entree ($30).  It came with 8 small pieces of nigiri sushi and a salmon roll cut up into 6 small pieces.  Each piece of nigiri had a different garnish on it, such as garlic aioli, cream cheese etc.  This was a nice touch and enhanced the flavor a good bit.  It really was good sushi, but the quantity was about 4 nigiri pieces short of acceptable for me.  On the plus side, the platter includes miso soup & ginger salad.\n\nI'll say this is a nice place, but it's just not for me.  I'd rather go to Sushi Kim in the Strip, get twice as much sushi for the money and have a table right away.  I spent over $70 here and left hungry.  How can I possibly go back?", "business_id": "Cy9XgM3ZG2jZ1ganvolb6Q", "stars": 3, "date": "2014-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 1}, "user_id": "SZ56K9vxIEid0KoqZjFwkQ", "review_id": "9tifDt50Ca5_RmagSTdAJw", "text": "I finally found some legitimate tonkotsu ramen in Charlotte! It wasn't bland or watery and the pork (chashu?) was savory and delicious. I would definitely come back, though it is a little far out from the city (20 min drive).\n\nYou'll notice that the interiors of this restaurant make a particular effort to imitate a japanese home. There's a private dining room, which appears to be a small compartment with traditional tatami mats, sliding doors and pillows.The owners are also japanese, which is always a good sign in my books if you're looking for some lip-smacking ramen. \n\nThe menu offers a variety of delicacies from Japan, ranging from potato croquettes (with the delicious bulldog brand sauce) to gyoza and even mini fried crabs. Ramen is by far, the best dish on the menu and you even get a choice between the broths, soy, miso, tonkotsu etc.\n\nThe process for making tonkotsu broth is incredibly laborious and takes a lot of skill to perfect. I would say Musashi does the japanese broth justice by delivering the almost-creamy texture of the broth, filled with the rich flavor of pork. The soup also has a great milky-color. Unfortunately the noodles aren't hand made and you can tell they're more of an upgraded version of instant ramen noodles. However, this does not deter from the overall experience of eating a hot bowl. I didn't leave one drop!\n\nThe restaurant serves alcohol, but not past a certain hour (like 9 or 10), so you can enjoy a range of japanese beers and saki. Perfect accompaniment to dinner. Prices are very reasonable and the hospitality is fantastic. Food is served in a timely fashion and everything tastes phenomenal. \n\nI'm already looking forward to the next time I come back!\n\n4/5", "business_id": "Y_OeiGhTm6ZEfZ1UQgM_wA", "stars": 4, "date": "2012-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Q3TmbznzdGXf5gzulqPLtQ", "review_id": "siAd6FobFBHCNf6zaV22gA", "text": "I just started teaching nearby and thought I'd try this place out. Yes, it is bare bones when you walk in, but you should know that by the \"Express\" in the restaurant's name. This is somewhere to get your eats and keep it moving. The portions are HUGE and at a fair price. Service is quick and food it hot. I ordered chicken and shrimp combo. Both were moist, and with broccoli, mushrooms, and carrots I didn't feel so bad about my Japanese craving. I'll definitely return!", "business_id": "va9aHf7SEIfKLnvOmeavIw", "stars": 5, "date": "2014-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nLi6Ih28l0P6niPh7idKww", "review_id": "xS00sI064Db3Fed3aj1-eg", "text": "Far better than it's competition just down the street! I've eaten here many times and have never once had a single complaint! The quality and quantity of the food is fantastic! The sushi is superb! The staff are welcoming and efficient! The only thing I would tweak would be the decor. The carpet should be removed because I've been coming here for years and it's always been the same, and only gotten darker. I realize that seems like no big deal, but I would feel better about the whole experience with a new floor that's easier to clean.", "business_id": "xLZilmaLXY0r-dBFaiLxww", "stars": 4, "date": "2014-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DhpJWvgBLXhLsQyDvVFUlg", "review_id": "GVIX67rT9nbE1J0jDKTXVQ", "text": "Food was great!  Service excellent only bad part was our chef was so boring, didn't talk nothing!  You pay for entertainment too not just the food! First time there I would go back but ask for an entertaining chef", "business_id": "1PSnPPFVfp03iPfJRPWWQw", "stars": 3, "date": "2015-07-19", "type": "review"}
{"votes": {"funny": 4, "useful": 4, "cool": 4}, "user_id": "04-E5-69Se-vW8heDXI_gA", "review_id": "QSOrMz6P86sMXro4sH1dIA", "text": "Came here for my friend's birthday. I heard great things about this place so I had high expectations. Needless to say, I was a bit disappointed.\n\nThe pros: the hibachi chef was very entertaining and friendly. the food was delicious, especially the scallops - perfectly seared with a golden brown exterior and tender interior\n\nThe cons: small portions for what you pay for, the server didn't seem to know the menu at all - seemed really frazzled, asked him several questions that he didn't know the answer to, had to ask for refills on my drink countless times, overcharged my friend's credit card by like $40...wtf.\n\nOverall, the food was decent, service was not great...not impressed", "business_id": "K5PfWwW61Ajommy9xvXdAw", "stars": 3, "date": "2012-06-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "_lA4GgcUKW1f892o5jGhBQ", "review_id": "KSCubtdT6NKBKD7-R1QPJg", "text": "The Blue Fin is a place I have probably driven by 100 times, either coming/going to work or heading to the library. I didn't even realize it was actually open until I got onto Yelp and saw some reviews. So close to my office, I had to try it out.....on a Sunday when it was closed. Oops. Let's try this again, for lunch\n\nThe place ain't big, so make sure you get there early, especially if you have more than 4 people. I also noticed they had their iced tea and lemonade in massive buckets, which is the ONLY way to serve beverages in my humble opinion. Quite like a lot of places in the area, the Blue Fin has a massive amount of pictures of their food up on the wall, so it does make choosing a meal that much more easy. A quick moving line and a 5 minute wait later, I had my teriyaki chicken bowl and was back to the office.\n\nFirst off, this is a pretty big meal for the price. It's a great lunch option for what you pay for. Having said that, it's not great. The rice was a little over-cooked, which I actually like, but some people may be put off by, especially with how sticky it was. The chicken itself was good, but also had been either cooked or sat under a heat lamp for too long. Damn the salmonella, I want my chicken cooked just enough to stop clucking!! The sauce was very good though, and really brought the meal together.\n\nOverall, it's a solid place for the price. I wouldn't go out of my way to go there when I am not downtown, but I am sure to head back during a busy lunch hour. Worth the visit", "business_id": "kaIue7GRCmkPzDeHDBTttQ", "stars": 3, "date": "2010-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "82uKVYpoFPPWCBkLvK_NgA", "review_id": "IB2XXLDU2Whn9uxJYZOBMg", "text": "An overall great place. Good food and very friendly staff. Great customer service!!!!", "business_id": "kaIue7GRCmkPzDeHDBTttQ", "stars": 5, "date": "2013-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TWV4ZYB1_THleG02T42QSg", "review_id": "P-L1kXKZEfWwn1vz2JiG1Q", "text": "The selection of sushi rolls on the menu is second to none in the valley.  I know that I am always getting the best quality sushi and service when I visit.  The staff are always hustling and working hard to make your experience quick, especially during lunch.  This place is always packed during lunch but the wait is no longer than an average lunch time wait anywhere else.  The food is so much better than any other place downtown!  Highly recommend the sushi here!", "business_id": "oSKT5oZX1NWYaHwOWL5lag", "stars": 5, "date": "2014-08-30", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "frEtELnTATd1BOD6Ndh0CQ", "review_id": "Ftj6MpctUKMCwmyvcPcPgQ", "text": "The interior decor is nicer than the strip mall suggests. This seems to be true in Arizona a lot. The special that evening was Cajun shrimp with Anchovy Sauce, but I wasn't in the mood for those flavors as I was eating a bit early. This was to be a light meal.\n\nI ordered the clams in broth. 20 clams in a nice bowl, but the broth was very heavy on black pepper. I would have preferred, buttery or white wine or other flavors, but there were only green scallions to fight for dominance. The clams were ok, but some were gritty. I ordered a spicy salmon roll and that was very good. I liked the roe on the outside of the roll and the roll stayed intact as I brought it to my mouth. My partner got the Ahi with glaze and it was prepared perfectly, although the glaze was heavy handed. The tea was nice. My Raspberry Spritzer had a flavor I couldn't determine and I didn't like it as much as I thought I would. I actually added water to it, to soften the flavor and that's not something I've done often anywhere. The dessert case didn't have all the selections, but from my partners perspective the cheesecake looked nice, but when it was delivered it looked like the flan selection. oops. That tall white thing we saw was a vanilla cake, not the cheesecake. The actual cheesecake was shrunken and covered with a light brown sauce. I tolerated only one bite, it was dry, it was old and it was sour tasting, and we just left it on the table. Yuck. \n\nDespite the 2 stars this visit we will likely return. I think there are better things on the menu and more things to try.  I won't bother with desserts of fancy drinks next time.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 2, "date": "2008-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RyzzI97Vq4IelbSp5wwGtg", "review_id": "-RbkMIyYRooMItFZm2cupQ", "text": "I've been here twice now. Initially, I was impressed at the management of a huge table (we had like 20 people) and the waitress had no problem doing separate checks and was quick upon return with the checks and change.  Yet when I went with just another person, although crowded, the service was not that great. \n\nThe one thing that was odd - some food came out fairly quickly, yet others' orders took forever.  Some of my friends waited about 20 minutes after everyone else received their dishes, and it's not like they ordered something totally different. In fact, some of the orders were identical to the other friends. Then again, we did have 20 people.  During the time I was just with another person, it was a similar thing - my food came out way earlier than my friend's. \n\nI ordered the summer rolls that were quite tasty, and the prices were very reasonable. I ordered miso soup and edamame which were both delicious. My mom ordered the pad Thai and loved it. I was pleasantly surprised at the amount of food one could order for a decent price.  \n\nThe parking could likely get to be a problem. I managed to find a spot, but during busier hours with the other surrounding businesses, I imagine it would be messy.  Also, the only other negative thing was that my mojito was really not that tasty.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 3, "date": "2010-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OV0oZojEkxYO5P2We6_uKQ", "review_id": "yT88fE-ZbHgwj01TLLL_Cg", "text": "I have been going to Cherry Blossom ever since I was little and I keep coming back. I am a very picky eater so any place that can make me want to come back is worth at least 3.5 stars to me. \n\nCherry Blossom seems to have a bit of an identity crisis though because while it is known for its Japanese food, especially the noodles, they sell Italian food as well for the people who are not as adventurous with their meal choices. If it were up to me, I would get rid of the Italian and stick to what they do best: Japanese. \n\nEvery time I go to Cherry Blossom, I find myself reviewing the menu for the millionth time but returning to my home-base anyways: the veggie tan udon. For those of you less versed in Japanese cuisine, vegi tan udon is a bowl of udon noodles with vegetable tempura in it. \n\nAnother thing that keeps me coming back though is that there are numerous vegan and vegetarian choices which is great for a vegetarian like me. \n\nMy last note is that the service is phenomenal almost every time, with the exception of only one waiter that I really dislike. He is extremely dense and not very knowledgeable about the food on the menu, not to mention hard to get along with. He is the only reason that Cherry Blossom doesn't get five stars from me.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 4, "date": "2012-06-18", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "frm67YsEcoZRU1gIqQQj2A", "review_id": "avPjz7p1wEYjX7pxJzWd8Q", "text": "Ramen is a noodle dish near and dear to my heart. There are few noodle dishes out there that can satisfy the palate as well as a solid bowl of ramen. The key to good ramen is the excelling of three primary ingredients: the noodles, the broth, and the protein. \n\nThe noodles here are very well made with good consistency, texture, and fantastic compatibility with the broth. The broth itself has that signature creaminess, saltiness, and thickened smoothness that ramen broth should have. It gives the noodles a fine delicious dressing.\n\nAlas, the cha-shu pork is where the dish fails to amaze. While the BBQ flavor of the pork is adequate, CherryBlossom chooses to go the lean route in the preparation. The result is a piece of pork that is thick and devoid of fat. This flaw is a fatal one. Ramen noodles were designed in such a way that its fullest potential can only be achieved with fatty pieces of meat. In a true ramen dish, one seeks out the fatty piece of meat and treasures every bite as it enhances the richness of the broth and is counterbalanced by the starchiness of the noodles. CherryBlossom foregoes this authentic vision and opts for a healthier alternative. While it still delivers on most fronts, my inner samurai still desires that extra reach of flavor.\n\nOther reviews on Yelp also recommend their banana bread. However, I must condemn their banana bread and anybody else on Yelp who sponsors it. Their banana bread is incredibly dry and has a grainy texture quality to it. The flavor itself is very bland and the banana element is barely detectable. A shame.\n\nHowever, the dinner rolls that do come with your meal are quite good! They have a softness and fluffiness about them that nearly rivals Hawaiian rolls. Freshly baked and packed with flavor. An unexpected surprise!\n\nAt the end of the day, the entire experience was pretty good but far from great. CherryBlossom offers an eclectic mix of different cuisines and dishes. Though the ramen could not satiate, I am willing to return to test the other dishes. To be continued...", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 3, "date": "2013-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "POVio1iSAaPDCsxpp2EmMQ", "review_id": "hIusnBbw4tgwHLytHedv6w", "text": "Satori to Kaigen! (Enlightenment and Spiritual Awakening!)\n\n\nLeaving the shadows of my last job, I embark on a voyage searching for delicious flavors.  Empty stomach, with Kunoichi on my left I joined the stream of the culinary conscious at the doors of CherryBlossom Noodle Cafe!\n\nImmediate greetings, short wait, professional server introduced himself as Joshua.  We had drinks, bread (free!), apps and dinner but passed on dessert with lingering looks back as if to validate the mutual decision\n\nI had studied the menu before but that had been weeks prior.  Ended up ordering the most popular items on the menu.  \n\nKorean Beef : Seoul-ful\n\nCulinary Thought: Flattened, juicy, smoky and perfect temperature. \n\nNinja Eating Plan: Over noodles, with chili paste. It was consumed quicker than a Japanese shrike dives for meals in July..\n\nPad Thai : Rad\n\nCulinary Thought: It was almost to beautiful to start eating.  \n\nNinja Eating Plan: She said it was the best Pad Thai she had ever consumed.  She also noticed a difference in CBN Cafe's Pad Thai noodle compared to all others she has tried.  Kunoichi tend to notice every \"little bit.\"\n\n\nCalpico Beer: Summer Drink of 2013?\n\nCulinary Thought: Refreshing and different.\n\nNinja Eating Plan: Helped to calm down the tongue on several occasions of too much chili paste (hands were shaky after a successful morning mission)\n\n\n\nOverall experience of the Culinary Ninja: When breaking your solemn vegetarian vow it is good to exercise within a week of consuming any meat product.  This Ninja has enjoyed the experience and plans on returning before the first clouds of Winter stretch out over the valley horizon.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2013-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "av6wjklaBgrjGDkQtSHqrg", "review_id": "rraNv5flTMm2Bn1rrsFlhg", "text": "I used to think they had the best tonkotsu ramen in Arizona but lately something changed. It's not as good as before. The soup tastes weaker and the meat is harder and tastes different. Also, miso soup should never come out by its self for Japanese food.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 3, "date": "2014-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0rOIvxlURdppFMU9u5Ep5w", "review_id": "xT9PnO47Gm6WI-TBc5POTg", "text": "Eclectic, fusion, funky, ok but add delicious. Despite the specious history of Marco Polo bringing back noodles from China to Italy, there is no real reason to expect a kitchen to prosper handling both cuisines. These guys do it very well. Maybe the best potstickers we've had, and the hot pots are perfectly seasoned and textured. At One meal we ordered the entire appetizer menu. We were impressed with every dish. Check and see if they have their special raspberry tort on the dessert menu.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2015-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uJKzEWZ_HeW_KPY1-edGbA", "review_id": "gTIhlo5KSR6h2yKveUQsQQ", "text": "If you like noodles, don't walk- run to cherry blossom. We've tried all their Asian noodles, and there's nothing not to like. No idea what the Italian ones are like, but I'll update this when I know. The atmosphere is very cozy- they really made the best of the space which I think was a fast food joint originally. Make time for the happy hour on weekdays for great deals. (Fun fact- they've won three Best of Phoenix awards)", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2015-08-15", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "BGES7BpBbFbQsLCBs2S2vQ", "review_id": "D11IP9hbQV0EGEEFTQIV3Q", "text": "This was one of my favorite Sushi places to date.  You have to be \"in the know\" & ask for the \"underground sushi menu\", the one that doesn't exist!  The service can be a bit slow, the but the staff is friendly.", "business_id": "c0RSs2KYK5Y-ZlSrNq9LyA", "stars": 4, "date": "2008-06-01", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "2hXL2ExBsgjJNpm6BJy0lg", "review_id": "5Tf4MuBRQoYO5EQjE1tEuQ", "text": "We usually go here for their Sunday happy hour. The sushi is good and I've had their bbq pork noodles which have a lot of flavor, but for the most part it's not very authentic. Something different was their sushi ice cream, that was pretty awesome, you cant really go wrong with rice crispy treats and ice cream! The service has been very hit or miss.", "business_id": "c0RSs2KYK5Y-ZlSrNq9LyA", "stars": 3, "date": "2012-06-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "dHrdfQEHx_ktBkuyoHlJGQ", "review_id": "zG_MBZ5vIX9o5WcQ7HuVCg", "text": "First don't tell me I can't sit in the booth when no one is in the restaurant. Service was horrible, we ended up walking out.", "business_id": "c0RSs2KYK5Y-ZlSrNq9LyA", "stars": 1, "date": "2013-08-19", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "Q245Wp3b8YG8MVVHMVT6iA", "review_id": "Nd6ErpKGhP-t6yaC-t0ZFQ", "text": "Zen 32 was my sushi standout in Phoenix, AZ until today. \n\nAfter moving to NYC, I went back home and visited my old hang outs. Some things have changed. \n\nThough Kona Grill at the Fashion Square in Scottsdale was always my fav, I considered Zen 32 to be the best sushi place in Phoenix -- great dim ambiance, a big outdoor patio with misters for Happy hour, and cute canoes on the ceilings. \n\nHowever, today there were not one, but two flies in my Saki-Rita drink. The waitress apologized, but left the charge on the bill, plus the charge for the replacement drink. After much aggravation, the manager removed the charge. \n\nThe floating flies were not the worst part. I was left wondering what eles is floating around the kitchen. There was also a 1/2 inch piece of who knows what in my spicy tuna roll -- maybe it was a scale? A piece of plastic? Hard to tell. \n\nConclusion, go to Zen 32 for the ambiance. Not the food or drinks. Perhaps bring friends you dislike and watch them eat?", "business_id": "NDKkce5Au-o_OhIt5f2ZBg", "stars": 1, "date": "2008-06-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "45V7-1r79DEG0HbuaKYIlg", "review_id": "RhunbCxgjWgFyRoEvJdqfQ", "text": "Two recent visits for reverse happy hour.\n\nA dining buddy of mine gets off work at 9pm.  We've been trying various places in Central Phoenix for late food.  \nZen 32 was chosen as a plan B a few weeks ago.  We were aiming for Postino on Central...but it was a 45 minute wait when I got there at 9.  Neither of us wanted to stand in the parking lot that long.  So I suggested Zen as an alternative.  I think it may be one of the frequent choices from here on out!\n\nBoth visits, Kara was our bartender/server.  Friendly, fast, outgoing, an absolute doll!  \nReverse Happy Hour starts at 10 - when prices drop from \"Holy High, Batman!\"  to the perfect place to eat, drink and be whoever you care to be for around $20.\nWell and Draft for $3!  (Draft includes Stella - which makes my dining buddy a very happy camper.)\nEdamame and Miso for $2, Seaweed or Squid salads for $3.  Basic nigiri for $2-4, Some sashimi $5-6, Select rolls for $3.  Special rolls for $8.\nWhere most places have long forgotten about gratis happy hour munchies - Zen 32 still provides them!\nOn the first visit, hot offerings were crab puffs (okay, Krab puffs) and onion tempura.  A huge platter or California roll also out for the grazing...oops, I mean taking.\nLast night, the crab puffs had been replaced with spring rolls.\n\nTwo drinks, two rolls and a couple of trips to the buffet table...I was stuffed and my budget was not shattered.  Thank you Kara, and thank you Zen 32!  Reverse happy hour here is the perfect place for those of us who love sushi, but can't afford a real sushi dinner on a regular basis.", "business_id": "NDKkce5Au-o_OhIt5f2ZBg", "stars": 4, "date": "2010-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vhxFLqRok6r-D_aQz0s-JQ", "review_id": "nWCj_9i9rmQEOtPIryDbLA", "text": "Shogun.  Not my go-to place for sushi.  The one thing this place has going for it, it's quiet.  The fish quality is good, not A+++ super fresh, but I'll take that over the swarms of college students chanting \"Sake Bomb, Sake Bomb\".  Its a nice change of pace if you want to go out to sushi with friends, have a mellow quiet dinner and go home.  The rolls are generous, they have a lot of them, so read the menu carefully.  The sashimi is good although a bit uninspired.  The presentation is not as pretty as other restaurants, but it does tend to be a dollar cheaper or so for menu items.  Good selection of beer to boot.", "business_id": "r7Ge8_c5Y2TXthb4CSjzaA", "stars": 3, "date": "2011-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XZGAMylo4dKkt59zreRS_g", "review_id": "S2ISr7wvOmUIo6ClSOPJsA", "text": "Great place for late happy hour drinks and food 5-7 pm. Loved the Saaki Bomb and the atmosphere that is fun but equally private and easy going.", "business_id": "r7Ge8_c5Y2TXthb4CSjzaA", "stars": 4, "date": "2015-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EPRsyblhYfDZW6FlCRrUbw", "review_id": "MDWfj2i2yr6QLaKH3DGnAg", "text": "This is my favorite sushi spot.  The price is right, the staff is friendly, the sushi is pretty darn good and the ambiance is nice and cozy.  Great for a date, or even just lunch.  I can walk out full and sakied up for 20 bucks!", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 5, "date": "2011-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Oo1dbXAuTW8PlV-HX4MPvQ", "review_id": "EWJtlQRq9QSfphY5c6P17w", "text": "I go here for the lunch and get the lunch special. It's good most of the time but real watery. I ate some bad sushi and regretted it. I probably won't come here again.", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 2, "date": "2013-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "z_2KOq-4UA_oUmTcdlH41w", "review_id": "bHGFkc4UJ1YH6QF_iik14w", "text": "Came to Sakana in Ahwatukee tonight because we were in the area and I had a great experience at the Scottsdale location. I regret that decision.\n\nThe music was very loud for dining, the galley style dining area in which we were seated was sort of cramped and was the only access to the bathroom so my shoulders were rubbed by people's behinds three times as they passed. The waitstaff started to clean the dining room and flip the chairs as we ate, although there were at least 4 other occupied tables in the restaurant and they did not close until 10:30 (we paid our bill and left at 10:40).\n\nThis brings us to the food; I was extremely disappointed in the sushi quality. We ordered whitetail and unagi to start and the unagi was unusually fishy in flavor and was over cooked. The cut of the whitetail was generous, but not the knife skill I am used to. It was not trimmed on the thin side of the filet and wasn't a consistent thickness all the way through. \n\nAbout this time we were delivered a mug of hot green tea, which was odd because we didn't order any, were told they were bringing us another, then about one minute later a server came by and said sorry and took it from our table. This only seemed odd because when I waited tables I would never think of taking something from a table, even after serving it to the incorrect one. We then had the Roller Coaster roll and found the spicy tuna on top to be mushy and flavorless. \n\nThe best thing about the meal was the tempura calamari. It was crispy and flavorful and not greasy. I expected more based my previous experience, not sure if it was just an off night but the number of issues were off putting.", "business_id": "0vzZ_Bcb02rJljeMU9XkBw", "stars": 2, "date": "2014-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fhk_Hy4QNFxBadk-Ia5YBQ", "review_id": "islGI_8dnu_caiKkwxmxCg", "text": "This place is a great place to eat alone, have a date, meet some friends, or even business. They have greet food, great workers, TV for sports, and even on the weekends live music. KINGofHUD", "business_id": "nBfusVbqwul0BU0Rcrlelw", "stars": 5, "date": "2010-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ffi2s4DOV3RtVBQFkWpRkg", "review_id": "HkE9AqZQ9FDpwlWIWvyuLQ", "text": "Went to RA last night. Their happy hour has always been one of our favorites. We showed up to find that corporate has decided to butcher the happy hour. Not only were the selections minimal, the quality seemed to suffer greatly as well.  We won't be back, especially with all of the other great happy hours in the area. Nice move corporate! Let's see how that one works out for you.", "business_id": "nBfusVbqwul0BU0Rcrlelw", "stars": 1, "date": "2013-07-11", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "w01wzU-HJqO5-bzA1OvsQA", "review_id": "tsOnafq7cltbiMXdUjylmQ", "text": "DOWNHILL!\n\nMe and my wife used to come here all the time, and it USED to be the best. In the last couple of months, this place and everything in it has gone downhill fast. The service is slow, terrible, and forgetful, the food doesn't taste the same, happy hour items that used to be there are gone now, and the customer service is just gone.\n\nAbout a month ago a group of friends and I ate here and we had a server who pretty much screwed up everything, without so much as an apology or a reason why. He looked like a football player or a nightclub bouncer and didn't even seem remotely friendly, he mixed up and messed up everyone's orders, I got one water the whole night, and he pretty much disappeared for a good 25 minutes. I figured, okay it was a bad night.\n\nI went again with friends just the other day, and that was the icing on the cake. Our server this time was nice enough at first, but he forgot to ring up 3 items we asked for and we SAW HIM WRITE THEM DOWN! We got our entree before our appetizers and our soup, and the roll we ordered was also missing, so our appetizers were the last to come out. No apology, no trying to fix out, only an excuse of \"ohh, the kitchen staff must have forgot\"...No, you forgot...you wrote the order down in front of us, you forgot, because you aren't on top of things.\n\nWhat really got me angry? As my friends and I were walking out, the hostess didn't even say good night or thank you, or even look at us for that matter...she was too busy staring at a computer screen. When a group of PAYING customers walks past your host stand and you are standing there...you say THANK YOU and GOOD NIGHT. Totally ignored us. \n\nThis location has gone downhill beyond belief and I will never set foot in here again after these displays of pathetic service and terrible management. I don't know who is running this place, but he or she needs to clean up shop and get things in order, this place is operating like a joke. The servers are forgetful and slow when they used to be good, the host staff doesn't even try, the managers aren't doing anything, and it's just no good.\n\nNever again dude. It's all about Mellow Mushroom across the street, at least they have a good staff.", "business_id": "nBfusVbqwul0BU0Rcrlelw", "stars": 1, "date": "2015-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "UnRqAttCc3uXWfJbm5p1Lw", "review_id": "bxBJGPIltrp098Bz0h7Trg", "text": "I meant to leave a review the last time I ate here this place is truly AWESOME!!! I had a great experience and the food I ate was tasty and there was a great variety. Best Buffett I have eaten at in a long time. Highly recommend!!!", "business_id": "-Ogv7rpcgUHkFaSy3vD8Sw", "stars": 4, "date": "2012-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9SEV_ORT3gzUh_aibdhnSA", "review_id": "JsOnV01XqHSUqAiYWhZJLA", "text": "Although there were plenty of options to choose from, some of the selections were cold on arrival. My wife enjoyed the sushi bar which is made fresh for you, however the fried rice and noodles were cold. Also the little chips that go into the egg drop soup were stale as well. Overall 3 stars for prompt seating, wide selection to choose from, and good atmosphere.", "business_id": "-Ogv7rpcgUHkFaSy3vD8Sw", "stars": 3, "date": "2015-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "19BunjXk7zhd811rF42U7w", "review_id": "3dxhoEVRL5h7A-oix6e0Og", "text": "We made the trek down from northern phoenix to get some authentic ramen.  I wanted to love this place and I wanted it to be worth the trip, but it just wasn't.  The decor is as previously described - you sort of time warp back to the 80's but it is clean and well loved by its owner.  They do have a lot of authentic menu items and a great kids meal, but the ramen was just not that good.  Its downfall was the broth.  Hubby got the salmon chirashi which was also not that fresh.  If I'm in the area, I may give it another try for the don-buris.", "business_id": "BBPkwpj9kSeDuy0uOwWHJA", "stars": 3, "date": "2010-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uSSNAH_IhKJoznEVhonNTg", "review_id": "e1qruieJzTQTVXfhF_Upgg", "text": "More expensive than most of the sushi places in Mesa. They make the rolls look normal sized by adding extra rice using very little fish. I would not go back, very poor value.", "business_id": "42xKe5YcCIKmGiqW0i4aGw", "stars": 1, "date": "2011-06-27", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "06S2wZSxl5-gT4KUQOKm3g", "review_id": "IkeTrb6AGYIXBgsod5yABw", "text": "My wife loves this place,  me not so much. I like a good teriyaki chicken.  This place didn't have it. The teriyaki sauce is runny and just pools in the bottom of the bowl.  The vegetables had seen better days, some were obviously past their prime and the rice isn't what I have come to expect from an Asian restaurant;  It isn't sticky and is hard to eat with chop sticks. Disappointed,  yet reluctantly continue to go for my wife. That's true love there.", "business_id": "Js7xxK2D4Dc0W8XkAzc4cg", "stars": 3, "date": "2014-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "TCTgewnDWIf6YZ-PIDgLZw", "review_id": "KmZ_AQweKH8sZty7PIeTYw", "text": "Very classy and clean facility.\nRelaxed and no rush atmosphere.\nFood and preparation ecxellent.\nStrongly recommend this sushi restaurant.\nFriendly and knowledgeable staff.\nWill be back again!", "business_id": "6syMU43FKGkcbX2957Ga8A", "stars": 5, "date": "2014-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ALK0UKcfrCPdXu5FVGk11Q", "review_id": "8Yng_ztGxnPg8odwyIMDjw", "text": "Great service and pricing, sushi was pretty good too.", "business_id": "rHFWPJML2WlGbad0Tqevxw", "stars": 4, "date": "2013-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "vr8MLK-VE-GEj-qy237rPQ", "review_id": "Ehud5y9Vz0P9JieUHPItRQ", "text": "The food here is really really good. The only problem is that it takes an hour to get your food.  While you see everyone else getting their food. Sucks but it's still good.", "business_id": "5vgmIwBB48fwo_WC8vGiXA", "stars": 3, "date": "2014-06-18", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "iwv2iafHe23KSlwBEKIwFQ", "review_id": "dQ_8l8v7e76dEatVNI3WZg", "text": "If I can give this place a zero star I would. The worst service ever in my entire dining experience. We showed up Friday night and they are semi busy. We were immediately seated. However, it took an unreasonably long time before a wait staff came by to get our drink order and it ended up being the \"host\". Then it took a while before the waitress came by and took our order. We were told that they are out of salmon. Ok no problem. We ordered some sushi. After quite a wait, we received 2 of our 4 items. It was ok, nothing exceptional. Then came the long wait. Finally the \"host\" came by and tells us that they are out of eel. Uh....shouldn't they know before we put in the order? However, he had no clue we had another order as well. We asked what about our other sushi order. He went checked, came back and told us they are out of snow crab also. So we said, ok then can we please have our check please since they have nothing to eat. The guy just disappeared and no where to be found. At the same time we never see our waitress again that night. After we waited, and waited, and waited, we finally saw him reemerge from the back. The entire time we didn't see any other wait staff in the front part of the restaurant. He's still completely oblivious. We had to waive him down and gave him the evil eye. He didn't even acknowledge us. And finally after he ducks in the back again he came back with the check. What a nightmare experience. Plus, we don't even really know how they foods are since they have absolutely nothing.... Will never ever go back again. Never had service this awful!", "business_id": "un3KC2gyMrSG6yqjVRctXg", "stars": 1, "date": "2009-07-07", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "mDS8rlDOcgRT3PMHGz3tug", "review_id": "wwx_R04rrUm0y11QE8TI1Q", "text": "This swanky little sushi bar was just the ticket on a Tuesday evening for Happy Hour. Shhhhh, don't tell everybody or it'll get too crowded. But wait... Tell everybody so they stay open. Everything was absolutely delicious and fresh as can be. We sat at the bar and watched our chef wrap and roll like nobody's business. I can't wait to go back. Best sushi in this area for sure.", "business_id": "un3KC2gyMrSG6yqjVRctXg", "stars": 5, "date": "2012-08-17", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "oAXcmwT2guuyNE9mDOsI7Q", "review_id": "aKySw2pm256JgYXoVTP7wQ", "text": "I have been to this restaurant twice and was not at all impressed my first visit. I would've given this spot 2 stars based on that visit. The service was just okay and the sushi was very bland and not cold enough. \n\nMy 2nd visit was significantly better. The service still was not good, however the sushi was much better. The Citrus Roll was excellent and I highly recommend trying that roll. \n\nMy boyfriend and I were sat in the back room on this visit and it was nice in that room - minus the creepy painting on the wall of a torture room or something?? That painting is hideous and grosses me out. It looks like a room from a Saw movie. Who wants to looks at that while they eat raw fish?\n\nAnyway, the 2nd visit was much better but still I'm not sure if I will be back. I hate it when restaurants are inconsistent in regards to their food. Service I can understand, but I think the food should always be consistent.", "business_id": "un3KC2gyMrSG6yqjVRctXg", "stars": 4, "date": "2014-06-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OPKKAY2Ri2Ww4gaMIcWSAg", "review_id": "C7Ye5UKlNt04gDWHVNeJAg", "text": "Very good quality sushi with a very nice happy hour menu.  The service at the sushi bar was impressive and very personal.  We enjoyed our time here and will definetly be back a number of times.", "business_id": "un3KC2gyMrSG6yqjVRctXg", "stars": 5, "date": "2015-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wvptdtrkr31CGolBff7Tqg", "review_id": "i8_IryNUsQrj-RDz5WCcNA", "text": "I'm so full of their good food right now that I can hardly sit and type this review. \nMy husband went to what I refer to as \"nerd games\" i.e. Dominion etc. so I decided not to cook and take my 15 and 2 year old out to grab some take out. \nMy daughter is an Asian food addict and I feel bad that I don't buy it that often so instead of the usual crap, I remembered that Tokyo House was right on the corner. \n\nI'm SO glad we went. \n \nWe ordered the Orange Chicken, Orange Beef, House Fried Rice and Egg Rolls. The food was DELICIOUS!! The portions were huge. We will have left overs to feed all four of us tomorrow. You can taste the real orange flavor in the beef and chicken. The house fried rice is the BEST rice ever. I actually don't like rice but I would eat this every day. It has huge shrimp, beef and chicken pieces. Perfectly cooked and not too sticky or dry.  The food was piping hot even when we got home.\n\nThe owner is the sweetest, funniest and coolest old Asian man you will ever meet (besides my Sister's husband) :-) \n\nIt was beyond refreshing to have a cheerful and polite person greet you and chat with you in a restaurant. Much better than the sullen, rude teenagers who are just glad to get you away from the counter or who are so fake and valley girl sounding you want to push them off a bridge.\n\nI have lived within walking distance from Tokyo House for over 7 years and I'm SAD to say this is the first time I have gone. I KICK myself for being so close to this GEM and not eating there. I will be going back and bring friends and family too.", "business_id": "l1kqHWtICTNk8TdCNisf5A", "stars": 5, "date": "2011-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V3XipfYV1U4WYbe6Whjzlg", "review_id": "S9Lt6l_nmUPoPT_ZSdUF5A", "text": "I love this place. The man behind the counter is so awesome. He greets you like he's known you your whole life.  The food is great too :)", "business_id": "l1kqHWtICTNk8TdCNisf5A", "stars": 5, "date": "2014-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "tV-CHD0zlQqea54XuogRwg", "review_id": "Oj0MbZUVf7s11DaP_aXX3g", "text": "My husband and children love Temari. Danny & Saki (Sushi chefs) really make you feel welcome. It's family owned and full of regulars. The portions are very generous and the prices are great! We have been going for 4 years and tried other places and always end up coming back here. Great neighborhood sushi bar. Minimal seating, can call ahead to check availability. No reservations can be made. Try the Tuna Poke #7, Playboy roll, Spicy Salmon Skin Hand roll. Yum.", "business_id": "Er20nsiOS6TFHmAE717iTA", "stars": 4, "date": "2008-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ydckcv0ksftOU9-nX0IekQ", "review_id": "NanNwkgomNsqOfyMhIjBfA", "text": "I can't say enough good things about this place!  Not only is the sushi amazing, but the atmosphere and friendly service always remind us why we love it here.  Saki at the sushi bar is very welcoming had helpful when choosing new rolls to try.  Try the Primo and AZ rolls, you won't be disappointed!", "business_id": "Er20nsiOS6TFHmAE717iTA", "stars": 5, "date": "2014-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "xwUvyZ_nwfnVv4P7N3eDiQ", "review_id": "X7vZNMe9swJeYJshTd7dGQ", "text": "After all the hype on yelp, I decided to check this place out.  \n\nWe arrrived at 8PM.  No line on a Tuesday.  When we entered, there was more light outside than inside the restaurant.  I had to totally readjust my pupils - but that didn't happen.  \n\nSo right off the bat, I'll give this place a thumbs up to take a potentially 'ugly' blind date.  Seriously, I couldn't read the menu, see what kind of faces were in the crowd, much less see my childhood friend's lovely face.  I felt dizzy.  \n\nWe ordered the tofu adage, soft shell crab roll, spicy tuna roll, salmon nigiri, and shrimp tempura roll.  We were STuFFED.  The food was very tasty, but maybe a bit too tasty- but that's personal preference.  I prefer light flavor, dainty size bites (savoring the natural flavors), but they serve huge size rolls....... the kind you try to bite in half, but it all falls apart, so you have to put the whole thing in your mouth, and you chew it for 5 minutes - and all this happens as  your friend starts to ask you a question.\n\nAll this was done as if I was blind-folded :)\n\nIt's a decent place.  Romantic for a date, authentic in local but also americanized flavors.  it was very good for the price and portions.  Not sure if I'd make the trip again, but yelp didn't allow 3.5 stars.", "business_id": "Bjt3rB73dvSDe1XEPEWc6w", "stars": 4, "date": "2009-06-08", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "nyHh14Vb9S269-kGKaUelg", "review_id": "yRsvB7hciTso68VH3ARpDw", "text": "I've never been a big fan of sushi. BEHOLD! Sakana! Not only did I love their sushi but my buddy turned me onto SASHIMI. BEHOLD! I now spend about $25 a week fulfilling my sashimi cravings. \nI always get the sashimi plate with blue fin, yellow tail, salmon and anything else they care to put there. All in the raw.....not me, the fish that is. \nLove it. Now, a brief summary of freshness: if your not eating it right after its been caught it ain't fresh. This fish is probably 2 to 3 days from catch. That's as good as it gets here in Arizona. \nAnd no, they are not getting this fish from the Salt River canals. \nDecor is so-so. It's what you would expect from a strip mall Japanese restaurant: nothing special. \nService is fine. Nothing special to report here.", "business_id": "Bjt3rB73dvSDe1XEPEWc6w", "stars": 4, "date": "2011-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zuoeE7GdXXlCgr995ImWfQ", "review_id": "7eB8D_tDyubzstzcPzFeGQ", "text": "LOVE sakana. One of the best places for sashimi in town! Nothing beats the salmon sashimi here. The rolls are mediocre with a few exceptions, but the quality of the fish makes up for it.", "business_id": "Bjt3rB73dvSDe1XEPEWc6w", "stars": 4, "date": "2013-07-27", "type": "review"}
