{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lzu5sYkqKRYDHnGGDlHcWw", "review_id": "3w9IoOVjTTWIZeNG13ZGfA", "text": "I have always ordered pizza from dominos and the delivery have been so so. I'll get my food and it'll be okay warm and okay good. That's also might be due to the fact that I always get the same stuff. But TONIGHT I got something different. I got a hot sub, bacon and ranch sub. The delivery was really fast for once but the best part was that the food was super hot. It he food was so hot that u couldn't even touch it. Never have I ever gotten delivery that was super hot.  It was SO good ;-) extremely satisfied with the service and food. Thank you.", "business_id": "x5Mv61CnZLohZWxfCVCPTQ", "stars": 5, "date": "2014-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "fmMlhRpww761nD-qMyCs0A", "review_id": "3h4ivaF2Kr3Zquh12ZAX3Q", "text": "My experience with Virginia Auto Service has been wonderful so far. I was looking for a new mechanic near my work and heard Mark Salem talk about them on his Car Talk radio show. I found out they had a Groupon offer coming up. I bought the Groupon, took my car in and was very pleased with the technical work and customer service. This feels like a small town auto shop with urban technology. Very friendly. Very clean. Since I was pleased with my first visit, I took my car back for some additional work today.", "business_id": "M-MFa0YErVBbFW2IJhGJmw", "stars": 5, "date": "2011-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zLtM4KKIkiqhDN8i872TBA", "review_id": "NOXJKUPzIfwhK7NIFQ4ygA", "text": "I love the Wild Thaiger, it is the best Thai food I have experienced in Phoenix.  They have plenty of vegetarian options and I have ordered just about all of them, they are all equally delicious.  I love the corn fritters... MMMM", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 5, "date": "2010-06-01", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "JDJipU4X-8iS35YQ5i2AKg", "review_id": "A5Lr4mN5JJWcrdT_ylsQ8A", "text": "Food always great!!  One of the BEST!  But the interior remodel is aweful. The fish tank is such a bad statement. Makes the place look cheap and looks more like other crappy Thai restaurants. Poor choice in a remodel. 86 the fish tank.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 4, "date": "2011-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kW8JIqJ3gInTDdGTQgkg7w", "review_id": "nBH1Pu7vEbMwU6bY5P8QNQ", "text": "Consistently the BEST Thai food in Phoenix!", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 5, "date": "2013-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nP_vZUqkoajeBC4qTV0Mlg", "review_id": "VktaiD22wDbyijlwBqMPLg", "text": "It was my first time experience here. I ordered chai tea and it was great. Then I ordered tom yam goong. The flavor of fish sauce was quite strong. I tasted salty overcome the tamarind. \nI ordered curry and that one the decent one for my taste. Little bit spicy which is I like. The decor was nice, I felt comfortable. The service was fast and great waiter. There is a board sign for cellphone user ..lol...\nThey have Indonesian coffee which I should try next time. \nThe private parking lot was in the back of the building.\nI might go back to try something else next time.", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 4, "date": "2014-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FT93oeEruZ3pUyKXSZ42jw", "review_id": "-tAUy58ckDtIbIKvD2fD5g", "text": "Best Thai food in Arizona hands down! Every single thing is delicious! I had the beef panang, Dragon eggs, pad Thai, hot basil, and there sangrias are a great compliment! I can't wait till I can go there again!", "business_id": "KPoTixdjoJxSqRSEApSAGg", "stars": 5, "date": "2015-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HAivPWurVb8qHYsf0GhHsg", "review_id": "e9LG7yKcjVcIT-GFUmFUug", "text": "I have tried different gyms all over town, and was happy to stumble on this little gem.  With all the big chain gyms you can expect the following:  heavy handed sales tactics, ridiculous arbitrary fees, lots of tattooed meat-heads walking around, loud obnoxious top-40 music, a general look of disdain from the staff, and you're treated like a number not a person.  This gym has none of that.  The pricing is transparent and competitive, the staff is genuinely friendly and you feel like they really appreciate your business.  There was no sales pitch whatsoever.  No loud music, and everyone there seems happy.  There is zero pretentious vibe happening here.  Plus they have great group classes, and the equipment is current and in good working order.  This place is fully stocked for just about any kind of workout you could ever need.  It even has a lap pool, a jacuzzi, a cold-plunge pool, and a sauna and steam room.  Plus they even have spare workout clothes if you forget yours, and they provide free day-use locks for the locker room.  This place blows away anywhere else I have ever worked out.  If I had anything bad to say about it, I would say that the decor (but not the machines) is a little dated, and it's located in a basement, so the ceilings are kind of low and it doesn't have a big open airy feel to it.  But neither of those things is a big deal at all.", "business_id": "werWnE_3k8GYVaMuUcWw4g", "stars": 5, "date": "2015-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qlBipIXCOkNERf0IOd-gGQ", "review_id": "h3Jog2B90qQqVVx00rQsww", "text": "I called and orders three sandwich platters and a veggie platter for pick up the day before I needed them. I show up and no sandwiches! No order! Nothing! They also wrote pick up time wrong on another order so us two customers were fighting to get our orders made first. On top of it all customer service was rude. Bad experience all around! The only reason for the two stars is for the poor deli staff working furiously to make 100 sandwiches in no time flat.", "business_id": "7Z7IkR_-94AjUuDw0fbI7g", "stars": 2, "date": "2012-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lr5_7PqBjjUSooZLaPg1Eg", "review_id": "jxGpsMaSMwvWkBDChJ3srg", "text": "Very nice lunch food. Carnitas are awesome and the white chocolate tamales are a nice finish.", "business_id": "e5kc0CQ4R-PCCDgb274gSg", "stars": 5, "date": "2011-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b7WSqKgL8FhOZwb8yUOetQ", "review_id": "4q6INfYaZYrDB-8lOKMaxA", "text": "After having had some underwhelming meals at our hotel and around the convention district, this place was a BIG treat. The service was spot on, and we knew the meal was going to be good as soon as they brought out their special mixed chips and dark, smoky salsa. After our margaritas appeared (their special margaritas come out with a refill in the shaker), our entrees did not disappoint. Hearty chicken in the enchiladas and quesadilla, and our friend's intriguing 'naked' chili relleno. Portions were beyond generous, and thanks to checking in with Yelp we shared a dessert for free. We chose the banana burrito and had no regrets. Highly recommended. Sad that I won't be back in Phoenix any time soon - I'd definitely come back if this were in my city!!", "business_id": "e5kc0CQ4R-PCCDgb274gSg", "stars": 5, "date": "2014-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "aEVW7Wu3VhsWjsUZRMVxyA", "review_id": "HlXMClgH93ul0yu-f1FtYw", "text": "Folks, if you visit Phoenix and are in the mood for Tex-Mez you must try out Canyon Cafe. I had the lunch portion of the Enchiladas, rice and green salad and it was great. The lunch portion was perfectly presented, portioned and prepared. Jennifer did and outstanding job of serving and I was very happy I found you for lunch. \n\nKeep up the great work!", "business_id": "e5kc0CQ4R-PCCDgb274gSg", "stars": 4, "date": "2015-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "lczLjHO7zIhrmSlOXI3ohg", "review_id": "OwpZVfaCAx9PAGVJI7a8rw", "text": "The Heard Museum is much much bigger than you expect.  Well, okay, it was bigger than I expected.  Especially after watching a tour go around the native artifacts sections.  I kind of followed the tour today and after it was done (~45 minutes) I thought, \"Is that all there is here?  How sad :(\"\n\nYes, I actually thought the frowny face.\n\nWell, then I turned around and saw the gallery that went to Everything Else.  Beyond the native artifacts (which are very cool), there is a wonderful gallery of mixed media art, photography, and activities for kids.  Even the grounds themselves are wonderful to walk around.\n\nThat last part I found out because I was there 45 minutes early.  It opens at 11am on Sundays.  Ah well, it was all still worth it.", "business_id": "SG_gEmEXL4ID6RAEinC5Bg", "stars": 4, "date": "2009-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "puDUWaQPKQMxWE44XjjWQw", "review_id": "ZrLY6fIrPobuzQTfna4nVg", "text": "The Heard is a wonderful Phoenix institution that often flies under the radar. I was born & raised in Phoenix so as a child I visited the museum often on school field trips or weekend activities. It's a great place for kids! The museum is also a must-see for visitors to the valley; Their exhibits of indigenous art and culture are unparalleled. \n\nWhen it came time to find a venue for our wedding it was not the first place we thought of but it should have been.  The Heard was a beautiful, soulful setting for our ceremony and reception.  The architecture and landscape made for numerous photographic opportunities.  We had to force ourselves to stop taking pictures and get married already! Julie, the Director of Private Events was great to work with; very supportive.  All things considered it was also quite affordable. \n\nWe had a number of guests traveling to Phoenix for the first time for our wedding so I was thrilled to have a beautiful cultural landmark to show off my hometown. Its central location off the Metro Lightrail connected to all things hip and happening in the valley was also a huge bonus.", "business_id": "SG_gEmEXL4ID6RAEinC5Bg", "stars": 5, "date": "2015-07-29", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "8hrQV1PDeXhkw3jjpJ_gjA", "review_id": "QssDqs4noVS2YRm3aBRTxg", "text": "Ridiculous expensive drink prices...$16 for a double tall vodka soda. The manager is an A$$. Flip side...cute cocktail waitresses.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 1, "date": "2010-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MHTZuj8I_obO_5Y9C9Zv8g", "review_id": "cv254oqREL15Mav1n0jBTw", "text": "This is never a bad spot no matter the time of day. Seriously.", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 4, "date": "2014-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "NszHFzBLd0mVQ776zck4DA", "review_id": "z5iOFmGvrY0aHEgi_jqS_w", "text": "Another dismal review for this company. I called for a 6 AM pickup to the airport like I had several times previously. Dispatch informed someone would arrive. I waited until 6:10 AM and called again-dispatch then told me another 15 minutes until pickup! I stated that was not acceptable as I had a flight to catch. I ended up driving myself to the airport. Oh yeah, the driver called, as boarding for my plane started.", "business_id": "yR3U7jOgoD0V0sGovuyt0Q", "stars": 1, "date": "2012-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-xPKyCJiK9q1OFZ7GCZwBw", "review_id": "2b7KoJj229jNYeawihlu7w", "text": "So impressed with this hotel!   I live in Scottsdale but have always been very interested in historic buildings.  I decided to stay at the San Carlos just to check it out.  The San Carlos make you feel like you are stepping back though time!   The decor and room are well kept while the historic aspects are left intact.  The lobby and rooms were beautiful!\n\nThe pool was surprisingly modern. It was lite with cobalt blue lights which added a very relaxing feel for our night swims.  \n\nThe staff went out of there way to make sure we enjoyed our stay.   While we were swimming the security guard----I think his name was Denis ---checked on us.   He answered many questions we had about the hotel and things to do in downtown Phoenix!   The staff (Bob at the front desk was super nice too) was very friendly and knowledgeable which really added to out overall experience :)\n\nI can't wait to do another staycation at San Carlos!!!", "business_id": "_yfprBETaYgySkKyl8ZWMQ", "stars": 5, "date": "2013-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iTjvroZGBRWeUhV_4DkH9g", "review_id": "4pLE5CKSwKmS5MMnX9orQw", "text": "Decent food, decent service, but usually very busy. I attend often.", "business_id": "P7wKlbSRsoRrfH3DFOY08A", "stars": 3, "date": "2015-06-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ghoBw5923PH-03Rly2hRJg", "review_id": "rdL3EREXgnLv03ttrt9qUg", "text": "This place is as good as it gets for Mexican food in Arizona! I love the traditional feel of the restaurant (although not in the best neighborhood but not to worry they always have security on site to watch your cars while you eat lol) The food here is amazing, the past two times I have been there I have ordered the ground beef and potato tacos and the green chile stew, both are delicious. I have also tried the enchiladas and the albondigas soup which were also very tasty...If you enjoy Mexican food and are willing to drive to the area its definitely worth checking out!", "business_id": "BESmH-lmMm34_EefL8X9fQ", "stars": 5, "date": "2012-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uv5ufWRlNa12SU8dhGyeWQ", "review_id": "rJ7a7EWNskprz_4LIzLnsQ", "text": "BEWARE: The owner makes all of the staff pay for their mistakes.\n\nIf a mistake occurred, pay special attention to your bill, because the waitress may add on the additional charges without your knowledge. Make sure it's itemized or you'll end up paying for their mistake(s).", "business_id": "BESmH-lmMm34_EefL8X9fQ", "stars": 1, "date": "2014-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wqwHih7XF1BPSdFyK1U-fw", "review_id": "9wxQnV8H2PaDJ23EVdAKsQ", "text": "Friends wanted to eat here before a dbacks game...nwent inside the restaurant and it was poppin in the waiting room... It was a 45 minute wait for a table for four... Friend reassured us that it was worth it so we decided to wait... \nIt was kinda cool waiting for a table because of how many people were going in and out of the restaurant and they seem to have a system all set up.. There were parties of 2, 4, 7 12 and even 14... There were a few parties that was more than 10 people....\nDefinitely a family friendly place!\n\nLooked at the menu and the prices were reasonable... About 8-15 dollars a plate depending on what you order\nService was fast and friendly! \nWe got the our drinks and chips and salsa (free) real quickly! The salsa was pretty spicy for me but still good!\n\nI ordered taquitos de carne asada.. It was delicious I posted a pic.. The rice and beans were so good.. The rice has a little bit of crispyness to it.. And the meat was juicy...pico de gallo was also fresh and delicious!\n\nOnly down side is how greasy the tacos were but what Mexican food isn't greasy right? \n\nI can't wait to come back and try more and maybe take a huge party with me too!\n\nLove the family atmostphere :)", "business_id": "BESmH-lmMm34_EefL8X9fQ", "stars": 4, "date": "2015-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "3gIfcQq5KxAegwCPXc83cQ", "review_id": "PN4Ub2KdZiu9ongdLbAGnQ", "text": "I have been to Phoenix Theatre a couple times to see shows in the large theatre. We went last weekend to their grand reopening, and we got to be the first people to sit in the new seats...woo! The seats are comfy, there really isn't a bad seat in the house to see or hear the show. Last year, the BF and I saw Spamalot and it was good...not the best performance ever, but good. Last weekend we saw Rent, and it was great! The cast was very talented and spot on except one character who I won't name as to not hurt his feelings, but man, they really made a mistake in casting with this one individual. Anyway, this theatre is definitely worthwhile and I would recommend it to everyone!", "business_id": "X9ih9Iotd-VEZ8tTYfoarw", "stars": 4, "date": "2013-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "WD7JsfAdjXjWkdyqTYGuOQ", "review_id": "1KK4E0skoEnMjQkcCVRMCA", "text": "Everything went better than expected!\n\nWe went here for lunch the other day after the original place we picked was too busy. By the looks of it I thought it would be a fast food style Mexican restaurant similar to el pollo loco or something like that so my expectations were not high. I was presently surprised. \n\nWalking in there was lots of room but not very busy. The menu was well displayed. I went with the Achiote chicken salad which was quite good. I spiced it up a little with some salsa from their well equipped salsa bar. Although the salad was good I soon regretted my decision as I sampled my friend's baja fish tacos. I love fish tacos. I REALLY love fish tacos. If my life was a video game their would definitely be a side mission that entailed trying fish tacos at every restaurant in the game. Anyway, the fish tacos were delicious. Everything I could've hoped for. A very classic fried fish taco. \n\nNow I can't stop thinking about fish tacos. Review over. I'm going to lunch.", "business_id": "D09yG6Z3gcsh24Qn7Y4gYA", "stars": 5, "date": "2014-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UUUa3QKthaYPrfkE2aQujQ", "review_id": "Rpy0C7K_NUepTPzCp_U_6A", "text": "Hadn't been before but my fiance has been going for ages.  I had the coconut shrimp, very good and moderately priced.  Very friendly service.  It'll definitely be a place I consider in the future, especially if I'm using the light rail in the central Phoenix area.", "business_id": "kaIue7GRCmkPzDeHDBTttQ", "stars": 4, "date": "2011-06-10", "type": "review"}
{"votes": {"funny": 5, "useful": 5, "cool": 4}, "user_id": "kffxYQVQsEpF1DVlQlcGCg", "review_id": "MFQPld2d6CGEPLP5Vj4WHA", "text": "When traveling in downtown Phoenix, there is always a lot to choose from during the day for food stops.\nOne of the places that has been here for as long as I can remember, yes seriously that long! Is The Blue Fin.\nI remeber thinking 30 years ago ,I wonder how long this place will be here.\n Yet here it stands in 2013 still going strong. Which makes me really happy.\n\nI love when local business can do great!  They have always been great ,very friendly service and fresh food. The panko breaded items are light and feel healthy. All the vegetables I get here are  always crisp and fresh.\nI guess it is because, they take pride in the place. Something you do not always see. I believe that they have lunch specials every week day.\nHowever , they do charge extra for the little things. Like making it extra spicy is like .35 extra and brown rice is a little extra, I mean barley enough to where you would even notice.\n\nThey have soup, and sushi, salad,etc.\nLots of nice cool drinks. If the weather is cooler(below 90) you can sit outside and enjoy the light rail going by.\nWhich also means that you can take the light rail here as well.\nIt is located in the same spot as always, right next to the Phoenix, Public Library.\nWhen in downtown Phoenix, give it a try.", "business_id": "kaIue7GRCmkPzDeHDBTttQ", "stars": 5, "date": "2013-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IkC2BKzADqgPlvaac5gRHg", "review_id": "edBLppBeez0iDkdR6rlx0A", "text": "Coach & Willies is a nicer sports bar with an awesome food menu & is walking distance from Chase Field (really walking distance, as in we managed to walk in 105 degree weather).  The menu is a lot better than most bars & the atmosphere is nicer than most sports bars (aka you can take your parents or kids here & use the bathrooms without being grossed out). I personally really like this place because it's nice to be able to get a real & good meal at a sports bar. We've had:\n\n- Italian Nachos:absolute GENIUS and I can't believe I've never thought of them to make on my own or seen on another menu. This is a must get dish, whether you get the full size as a meal or the half size as an appetizer. It's fried pizza dough that's still soft but firm enough to hold up the toppings, covered in delicious, flavorful marinara sauce topped with gobs of melted mozzarella and pizza toppings. My boyfriend & I are stuck on getting this dish every time.\n- Baked Mac & Cheese: Amazing! The cheese sauce is decadent, thick, creamy, and has a wonderful garlic & southwestern spice flavor. \n- Italian Chopped Salad: Okay. The toppings didn't really taste like anything so overall it was an expensive bed of lettuce.\n- House Salad: Basic but a good choice to balance out one of the heavier meal options.", "business_id": "j8nyAaN_w5t6wYv-ni23sg", "stars": 5, "date": "2011-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "jnMII2mt0V6AM4_oMECyIQ", "review_id": "Hz7RZd6rp9lW3Su-Ylp9lw", "text": "First of all, Johnny Chu should be ashamed to call himself a chef. He is barely a line cook. As stated in previous reviews, he doesn't even taste his own food (which accounts for the wide margin of variety a single dish may have on two different visits).\n\nSo, I made reservations, thinking I may be able to sit at the bar because I arrived 10 minutes early. Wrong. I was ordered to wait outside. Nearly 45 minutes later, and a drink at the bar next door, I inquired about my table. The girl didn't even look up at me to acknowledge I had said anything. After a minute or so of staring at her while she continued to ignore me, she finally said my table was ready. Hmm.\n\nThe food is horrible. I fear those of you who enjoy it, rather enjoy the \"atmosphere\" and come here to be seen. The food is either completely bland (e.g., my curry, which tasted of water with a slight hint of something I couldn't even recognize) or so hot as to mask any possible flavor. By calling themselves \"authentic Asian\" cuisine is just silly. There are so many hole-in-the-wall Asian restaurants that could cook Chu under the table blindfolded.\n\nSo, the rude, nonexistent service, the insanely overpriced food, and to be seen is what you're paying for. If you enjoy being treated like shit and fed food that I wouldn't feed in a troth for pigs--you may enjoy this place and good for you!", "business_id": "VsO_rhXi5lgbaGxNwoEZsQ", "stars": 1, "date": "2008-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "t95D1tnWvAOy2sxXnI3GUA", "review_id": "2x1lh94fVAhk61CmzATI9Q", "text": "Stopped by for breakfast. Sat outside. Promptly served 2 glasses of ice water and a menu. Chose Bacon & Eggs for $8.95. Ridiculous price, but came with beans and hash browns and thick-sliced, very fresh, bakery bread toast. Ordered soda which came half-way through my meal. My server, Jesus, who was very hard to understand, explained it was due to \"macheen broke\".  Food came within minutes of ordering and was decent. Generous amount (6) thick-sliced bacon. Only complaint is, Jesus never returned to replenish my water, or collect the check. Employees do convey an \"anxious-to-serve\" approach, but seem rattled, confused and \"tripping-over-each-other\" for your attention. Nice and refreshing to see, but strangely executed. Friendly, and welcoming. Overall, just o.k.", "business_id": "Y293fHh5SZ0_9BZm4M6BCg", "stars": 2, "date": "2009-08-11", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 2}, "user_id": "s8fJCSltyub39Q1dqzjb6g", "review_id": "Nj74OtmTvhq3hRbgjpUDug", "text": "I have taken a ride on the light rail a few times now and I have some stories!! The first time I rode the light rail I took it from Mill Ave to Phoenix to see the D-Backs and Cubs play. My friends had caught a tram in Mesa so I sat there and watched a few trams come and go before I got onto the one with my friends on it. That was easy enough...there was enough room for me and the ride was smooth and fun (though I can't say it was relaxing)...Any ways. After the game was quite an experience! The tram ride home was a little more crowed now that the game had let out. There were two die hard fans in our car from the two teams who started talking trash to each other...well one of them had a little too much to drink and one thing lead to another and they were soon yelling threats at each other. Right before the drunker one took a swing (in a very crowded car) an older man stood up and shut them both up before someone got hurt...the tension in the air was thick the whole way back to Tempe where the Cub fan got off and punched the window. The friends of the other guy had to hold him back...I mean come on!! \n\nOkay, then I had the pleasure of using the light rail to go to the Circus. Again I was headed to Phoenix but this time I got on at the Washington stop. It was again a fun ride, but I couldn't say that it was a relaxing ride...there was this bum who was asking people for money and I think it would be better with some music playing in the background...any ways the ride home wasn't as eventful as the baseball game crowd, but again, there was another bum asking for money...can people just ride in peace?\n\nI like the light rail - I really do...it's always an interesting experience, but I just don't feel safe on it. I used to take the metro bus from Gilbert to Mesa every day for a while and I felt safer on that then I do on the light rail and the bums who ride the bus don't ask me for money either.", "business_id": "1eWZa9FxbVPpd6jyyKy3iw", "stars": 2, "date": "2009-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ViiaMr4WwPUg1lhshmCR1Q", "review_id": "qFA25GOCEBXaGVIuBZsC3Q", "text": "The food was delivered fast and it wasn't bad.  Unfortunately, it wasn't what I ordered and the staff seemed more interested in getting things done quickly that correctly.", "business_id": "-lOSaCuBRAvX5JBifx-EMw", "stars": 3, "date": "2012-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M6oU3OBf_E6gqlfkLGlStQ", "review_id": "MKWAhGHw_I3o9Xo1e3N1Mg", "text": "The ever climbing prices and dissapearing grillied onions have casued me to not visit here as much.\n\nLuckily the light rail constrtion is a thing of the past and one can esialy approce this location.\n\nThe line to order inside can be a bit akward as there is not much room for it.\n\nOn my last trip I went with the grilled veggie burrito as the cheaper bean and cheese burrito now only exists in my memories. It comes with a few chips.\n\nI do enjoy the salsa bar that has sweet and savory salsas cilantro and little peppers.\n\nThe food is decent but for a $7 lunch there are cheaper better Mexican options out there.", "business_id": "XI-_Y2XRw03mozGx0Z90Gw", "stars": 3, "date": "2010-08-10", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "30C81cUBpoFUucSag18MkA", "review_id": "tWKovMZnUudKFsLG5ijolw", "text": "I don't know what happen to Hooters? My roommate in college use to work for one in Houston so I have frequent Hooters a time or hundred in my life. The quality of the product has no integrity it is so nasty, the wings are never fried correctly they come out bloody and under sauced. I just want some wings once in a while with breading.  iIt is difficult to find.", "business_id": "qsWxbgQwuomXvMseg23DGg", "stars": 1, "date": "2013-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dn5lLgRj87xmJSF4BhHSIw", "review_id": "Ennx8XBgPNaRghTyu6qn1g", "text": "I don't eat a lot of pasta and I don't come here all the time.  However, I think the salad with pesto dressing and the garlic Mizithra (spaghetti with bacon, mushrooms, brown butter and cheese) are very good.  I have heard that the other stuff is good, too.  I have only been here for lunch, so I don't know what dinner is like. \n\nSit in the trolley car -- you can ring the bell!\n\nIt is located conveniently off the light rail stop at Central and McDowell, near the Phoenix Main Library.", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 3, "date": "2011-07-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WKQDXZijePQeBVwbZsy9eA", "review_id": "hGS8uGArs-zroiUpzTewxg", "text": "My girlfriend and I recently ate here, but it wasn't anything I would recommend. At least, not to anyone I liked...\n\n\nThe Expectation:  Her Dad wanted to take the two of us out for dinner, and his wife had suggested 'The Old Spaghetti Factory'. I had never been to the place before, but I know a few of my family have went there on separate occasions with nothing but good things to say. So, I figured we'd try it, I'd say I was even eager to do so.\n\n\nThe Wait:  We arrived for dinner, roughly about 6pm on a weeknight. We were told by the hostess that it would be about \"ten or fifteen minutes\" to seat our table of four. At first, I thought that was a little weird, seing it didn't appear ridiculously busy from the lobby or by the amount of cars parked outside, and it wasn't like we were an abnormally large group. But it was cool, they had what seemed like several waiting rooms with different types of chairs and sofas to sit on, and some cool, old \"stuff\" to look at.\n\n...Twenty minutes later.\nIt seemed like there were at least three different, larger groups of people that came in after us, and were seated before us. I wasn't really sure how that worked, but, just as I was just about to approach the hostess podium to inquire about our wait, the hostess called our party's name and began to walk us to our table.\n\n\nThe Service:  Our hostess sat us at a four top table, located in one of the corners of the main dinning room. She apologized for the wait, noting that the area we' were sitting in was supposed to be closed, but they were making room in order to seat us, she also mentioned that our waitress should be by in a minute or so. It didn't take long for our waitress to come by to tell us she'd be right with us, but then it took forever for her to return and take our drink order.\n\nOne of the least pleasant particulars of the evening was our waitress being super short with us at every encounter. It was like we had done something wrong by sitting in her section. By the time she returned with our drinks, I think we all knew exactly what we were ordering; which seemed to somehow catch her off guard, as if she was stressed to take our order.\n\n\nThe Meal:  I had the Chicken Marsala which came with Mizithra Cheese & Browned Butter, and my girlfriend had the Spinach & Cheese Ravioli. Both entrees included bread for the table, and the choice of soup or salad. I had a Caesar (upgraded at an additional cost.) and she had a side salad with vinaigrette.\n\nThe salads were alright, iceberg lettuce, which was 'meh' and the Caesar came with tomatoes, which I scoffed at, just a little. My entree wasn't horrible, although, it did seem like a pretty measly serving for the price. It tasted just mediocre, - I could've swore the tomatoes/sauce on the Raviolis was canned, whatever it was, it was pretty bitter. \n\nI'm usually not one to complain about the waiting staff allowing you to enjoy your meal in peace, but that was not the case in this instance. The waitress rarely came by the table to check on us, at all. She came by and asked us if we enjoyed our meal, (laughable,) if there was anything more she could get for us, or if we needed to-go boxes, while taking our dishes away. She left us, again, for an eternity. Returning with our check and some small boxes.\n\n\nThe Outcome:  I tried to keep the group positive while we sat, as others around us seemed to be enjoying themselves. But without another, much improved dinning experience, I would probably go elsewhere. Honestly, I don't love/hate/mind Olive Garden, but this place wasn't even that good.\n\nI walked my girlfriend back to our car with a disappointed stomach, and a sad little to-go box, both half-full of mediocre food. - Maybe we can go somewhere good on Friday night...", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 2, "date": "2013-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IiBvD0kzYIMf1SXoW2100Q", "review_id": "lyKzbn5u5zYi-19DFSg9Bw", "text": "Used a Groupon special for the Murder Mystery evening with tickets to the show and dinner. The Murder Mystery show was in a room about 20 x 30 feet with 50 people crowded into this space. The volume of the music and announcements were so loud, we couldn't even talk to half the people at out table! They took our drink order and we didn't see it until half an hour later. The food was HORRIBLE! How can you ruin a spaghetti dinner??First of all, it was cold! Cold spaghetti !! Hardly any sauce! The house salad was taken out of a plastic bag and dumped into a bowl....at an Italian place, they served the salad with only ranch dressing ..... Not even Italian! And no choices offered.  Our party of four will NOT go back. At least 10 others felt the same way.", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 1, "date": "2014-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "36atraD20s_3MwuaBsimSw", "review_id": "4rQbByRZP4H1c-0Y40YJBA", "text": "We were here for The Murder Mystery Show. This review is for the food, not the show. However, if interested, the Murder Mystery hosts were funny,engaging, and well into to murder mystery 80s theme. \n\nWe were pleasantly greeted immediately and taken to the venue room.  \n\nFood: salad drowning in the house dressing. Spaghetti was ok.  Not al dente but not soggy either.  Sauce had some tange but was a bit boring and needed more vegetables. The scoop of ice cream was melting as it was served, the spoons served about two minutes later. Service was ok.  Not great, not poor.  Prices were average. In summary, ok food, ok service.", "business_id": "DlCtdbceo4YNSI53cCL2lg", "stars": 3, "date": "2015-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j9P7re765LHGFetWkOuE7g", "review_id": "G1Yai5Xx6FhgxP4jOfTwUg", "text": "Stumbled on this place while sight seeing on a long lay over in Phoenix. The food was moderately priced and service was quick. The waiter was pleasant. For being downtown the place was very quiet. In fact, the whole of downtown was quiet.", "business_id": "2I666dqzs1XB6xigIKa9bA", "stars": 4, "date": "2014-07-28", "type": "review"}
{"votes": {"funny": 3, "useful": 6, "cool": 0}, "user_id": "Kyc_V-2G77tRfwJsBxwZ4A", "review_id": "M7-ktqahsVP4r0YJKNA37g", "text": "I'm not sure why I even tried giving this business another shot. What a waste of time. \n\nThey advertise for window tinting, so my husband and I decided to go in for a quote and possibly schedule a time to do it. We asked for a price quote from the counter and with the price and the brand of tint they use, we were happy and decided to schedule a time immediately. At that point, the lady at the counter said she needed to call the guy that did the tinting. [sketch moment #1]\n\nShe called and he was apparently able to come in immediately, which at that point was fine, we just needed to run our last errand before we got stuck there for several hours. As we were leaving, we were informed that we had to pay in cash, and couldn't use a card because this individual doesn't actually work for the car wash......we explained that we didn't have cash on us, and the lady at the counter kept insisting that we could just go get some cash. [sketch moment #2]\n\nAfter we left, we had gotten such a bad vibe from that, we decided to not go along with the appointment and immediately called to cancel. During that phone call I explained that we were no longer to to get the window tint (this was within 5 minutes of us leaving there) and THEN, she tells me that they CAN take a card for payment! \n\nWhat the hell kind of business are you running? They also claim to have a warranty on the tint, but if the jobs are being completed by someone who doesn't even work for the car wash, who is in charge of covering any type of warranty? NEVER AGAIN. This isn't breaking bad, stop trying to do shady work.", "business_id": "Li5LOL873Ep8HoPRML18sw", "stars": 1, "date": "2014-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8JbxydMD_NGwSEJOwo7U9g", "review_id": "B9zh6t02OfgFVhv1Ad5KAA", "text": "If you're in a rush this isn't the place for you.... But if you want a good car wash, this is your place!! Very detail oriented and the staff is always nice and all the staff really hussle but do it right!!", "business_id": "Li5LOL873Ep8HoPRML18sw", "stars": 5, "date": "2015-08-10", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 4}, "user_id": "9VPNlcKsL99FvKtz1r9qJg", "review_id": "nAnhzRoToSYekjvDDdujFQ", "text": "Russ suggested My Florist for lunch since we were in the area, but I said, \"well I always go there at night and while sitting at My Florist, see this cute little lunch place across the street that I've been wanting to try, so let's go there.\" \n\nIt's good for a quick lunch and an alternative to fast food (anything is better than the F food).\n\nI got the chicken feta pita, it was okay, kinda boring.  I think I liked the design of the place better than the food. So, ++ for good marketing and design, now if they'd do something more interesting with the menu :)", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 3, "date": "2008-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DwTKScyPaGXMm3D033JzZw", "review_id": "npP_cvO4Gg8ozqmInM93-Q", "text": "The kabob dinner was delicious. The chicken tasted great, the greek salad it was served on was flavorful.\n\n***HOWEVER***\n\nIn an attempt to order, I stood DIRECTLY in front of a woman I presume was the manager for several minutes while she scribbled down a catering order as if her life depended on it. When she finally looked up, she pretended she hadn't seen me walk up (\"Oh, I didn't see you there...\" ...really?!? SO cliche, don't do all that, girl...) and implied I should have tried harder to make myself known. Thanks for the lesson on conducting myself socially , but NO THANKS.\n\nThe cherry on top of that experience was the latex glove I found buried in the greek salad on my second bite. \n\nThe food is good and most of the staff is friendly and attentive, but that woman!! She needs to be Gordon Ramsey-ed right in the face!", "business_id": "trAvQPp7gps0Btk-2AmLpw", "stars": 2, "date": "2014-08-17", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "VBEbhE0ISjg6xowGNiGmgQ", "review_id": "Zd5jqqMZpUpJTuV7FZs_kQ", "text": "Let's see, what do I like most about this radio station? hmmmm...\n\nI would have to say, the fact that they pay me. But I should also mention that it's the best country station in the (well) country. \n\nIt also has the best morning show in town: Dave Pratt in the Morning.\n\nCheck it out, 5am-9am every weekday.", "business_id": "lW8-lFQ-mwG-Wl6iUKoT6g", "stars": 5, "date": "2007-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lYlr9fifus_mkd9iZ1T0Mw", "review_id": "bOihBiLIMegdqsqnS-LGIg", "text": "Terrible service on a Saturday night!? Watch your check. They add 18% without asking and it is hidden in with the meal charges. Don't know how I caught it but will not be back-ever. Oh and the food was bad all around. Spend your money else where!", "business_id": "gkv2XvXpFgiq4Bb2XK7YmQ", "stars": 1, "date": "2013-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Zhn5u6UK0ZmVX3zRoRliZQ", "review_id": "EcReXRT32OVHiZWpNknXkQ", "text": "Well I mean it's the Hard Rock Cafe so what can you say.  I am not really a fan of chains but stopped in for a drink during a downtown Phoenix bar hop.  We arrived pretty early on a weeknight so it was pretty dead.  We sat at the bar and had really good service, all the bartenders were super nice and let us try different liquors.  The one thing I can say for a chain is that it is consistent and you can expect that things will be the same and of an acceptable quality.  The drinks were expected, good but overpriced.", "business_id": "gkv2XvXpFgiq4Bb2XK7YmQ", "stars": 3, "date": "2015-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "OAd-vbR_POac1zHtu-Y2Zg", "review_id": "BScWxmUlaKQ7im2y-UYytg", "text": "This is an expansive convention center. Props for LOTS of bathrooms. And the staff are great at cleaning them very frequently. They also have a food court within the convention center, which is a nice bonus for those of us who attend conferences here where food is not provided. Like other convention centers, though, it is way too cold inside. Brrrr. The friendly and attentive staff make this convention center a step above the rest.", "business_id": "F6BedoYgbAQHqwKX9F0zDQ", "stars": 4, "date": "2015-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uj79HTtyOdAdd_TaPcdxjA", "review_id": "pyr9rprPng844NHxoRd7qw", "text": "I've never actually been here (always had someone go and get it) and the only thing I can rate are their cheesesteaks because that is all I have ever had.  Based on that alone, it gets 5.  It is the most authentic cheesesteak that I have had in the PHX.\n\nShredded steak, melted cheese THROUGHOUT, not just shredded steak on a slice of cheese, and the bread, oh the bread.  That's all.  No cheese whiz, no lettuce, tomato, peppers ... just cheese and steak.  And it's heaven.", "business_id": "OoHWabV-ym7_HWlHeXTsVA", "stars": 5, "date": "2009-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OoFbJbJUXD48mNtQI9EdEw", "review_id": "dHGth1KRofLUlwEbHh74UQ", "text": "As a new downtown Phoenix resident, I went in search of a nearby nail salon. I was impressed with Cali nails, and have been going back ever since. They're a great value and knowledgable about the services they offer. Would come highly recommended to downtown Phoenix-ites, or others looking for a great nail spot.", "business_id": "NdHDqKjNyeocNRShjUPyZQ", "stars": 5, "date": "2012-06-24", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "k2u1F6spBGhgk2JtAe97QA", "review_id": "UaXitz3BwpIBcgWNHfqisQ", "text": "The rice bowls are a yummy quick lunch!\n\nI have never eaten the sushi here because I am super, mega picky about sushi. Raw fish is serious people!\n\nI go in here on my half hour lunch break to grab a steamy hot bowl of chicken curry about once a month. Its not Japanese curry like I was used to eating for the majority of my preggers days, but it will do. Of course I no longer live in Japan either... The chicken is tender the curry is savory, and the rice is well cooked and not dry. You can get hot sauce on the side to spice to your liking. It has a lot of potatos in it, that might be the only thing I don't like about this curry. \n\nI miss Japan... I would even settle for Curry House Coco Ichibanya if there was one here. Okay my mouth is watering which means its time to go!\n\nOh my Naughty Nielly always orders the chicken teryaki bowl and that is pretty good too. \n\nXx,\nReese", "business_id": "oSKT5oZX1NWYaHwOWL5lag", "stars": 3, "date": "2012-07-17", "type": "review"}
{"votes": {"funny": 3, "useful": 7, "cool": 5}, "user_id": "AkLRwgw9ljUqXWyBNzpqXQ", "review_id": "IcOI5CUDnQGg7-dlQCEriA", "text": "Sure do love some Honey Bears!  Cheap tasty eats for us carnivores.  Luckily for me, this location is 5 minutes from my work making it one of my favorite lunch break spots.  I would give it an extra star if it had the cool ambience of the Van Buren location but alas, it feels like a 1980's fast food joint.", "business_id": "q1nDSpmV-FdTBNj6UuZvTg", "stars": 4, "date": "2008-08-15", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "5c4p-A1sLBlpS1cPaMpdBg", "review_id": "HYcQ9YPK0xlap9a3Juw7Hw", "text": "Best beans I've ever had and an excellent BBQ sauce!!  Rib tips and chicken were great.  Coleslaw and potato salad ok.", "business_id": "q1nDSpmV-FdTBNj6UuZvTg", "stars": 4, "date": "2012-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HKByw2CQL1YHrzyrvv75UQ", "review_id": "0OY-zcyQdtlDffNU8iKjPw", "text": "This place has really delicious BBQ. I would have given it a 5 if the chicken wasn't a little dry and the interior of the facility was a little neater and cleaner. I'm not saying it was dirty, it's just the trashy sign on the fountain drink saying not to put stuff in the drain. I also didn't like the \"real\" trash can being turned around so there's no access to the door and a large \"kitchen\" grey trash can sitting right beside it. All in all a good visit, but not a 5.", "business_id": "q1nDSpmV-FdTBNj6UuZvTg", "stars": 4, "date": "2014-06-15", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 4}, "user_id": "YzNZNgpOy9tthDnczS_ajg", "review_id": "yHgdFKQHdi2AQv_KuJbnHQ", "text": "I love cheese. Really, who doesn't love cheese? Cream cheese, cheesecake, grilled cheese, string cheese, it's all pretty damn good. Cheuvront takes cheese to a whole new level. \n\nMy boyfriend and I took my out of town mom here before First Friday. It was understandably crowded, and the hostess at first gave us a 45 minute wait. Lucky for us, there were 3 empty seats at the bar. The service was quick for how busy it was and when we told the bartender to \"surprise us\" with the three-cheese plate...he did an amazing job. My absolute favorite was a brie called \"Green Hill\". It actually felt like I was eating dessert, it was so good.\n\nWhile we were finishing the cheese plate, a table opened up and the hostess graciously let us know, and even held it open for us while we finished our appetizer and closed out at the bar, which I thought was really nice. For our dinners, Mom had the Niscoise salad (which I probably should have also done, considering I had just finished licking the cheese plate), I had the filet, and boyfriend got the scallops.  All were very good. The portions were on the small side, but we didn't leave hungry.\n\nI haven't been back since,  but I remember looking at their happy hour tent card and thinking it's something we should try, though I can't remember the exact specials.  I'm sure it had something to do with cheese.\n\nAnother thing I appreciate about this place: They have multiple bathrooms, but they don't call one \"Men's\" and one \"Women's\".  I seriously feel like, as a people, we should stop this childish bathroom segregation. I understand large bathrooms with stalls being separate, but for a place with 2 one-person bathrooms to designate one for the \"men\" and one for the \"women\" is really dumb! It's not like you're in there with anyone else! All that happens is the Women's line gets long while the men shuffle in and out like there's a revolving door on the thing. Not fair!", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 4, "date": "2009-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "je0xJ_qIZfaSXkEQKcnKFw", "review_id": "F0mVECGcQZbnEBOSNJE__w", "text": "Wow, I am a bit shocked to see the previous review. I have read some reviews that the lunch service isn't the best but I personally have NEVER had an issue with Cheuvronts. We discovered this restaurant during Arizona Restaurant week last year. I have been for several dinners as well as a wine tasting. The food has always been cooked quite nicely, presented in a very nice way on the the plate. We love the cheese and wine selection. We have become friends with one of the staff who has been with the restaurant for a long time and is always up for making a reccommendation for food, cheese or wine. His name is Todd and he has always been great with us. I really feel that the person who posted the previous review should give this place another chance. I don't know what goes on during the dayshift or happy hour. But the dinner service has never been an issue for us. And I would be the first person to complain if there was an issue. If you do decide to give it another chance, ask for Todd. He knows whats going on, will take care of you and will address any issues. The portions for some items are a bit small and the price can be a bit higher depending on the entree. I would highly recommend this restaurant and it is one of my favorite local places in Phoenix. AZ Restaurant week would be a good time to try this place as you can get a multiple course meal for a good price. Also they do offer wine dinners once or twice a month as well as twice a month wine tastings on Saturday afternoons.", "business_id": "muCl5p-9ut1sY0aKeUeRhw", "stars": 4, "date": "2011-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "aTi0NVrcPJWbN6jAsJVcAw", "review_id": "ZRVNU2x7rEyfgQ9BcpNUxA", "text": "Alice Cooper's Town is a mix of good food and rock 'n' roll, and has a fab bar.  Being one of the world's biggest Alice Cooper fans, I also loaded up on Alice stuff at the merchandise area before leaving.  The walls are covered with Alice memorabilia, which is cool.  True Alice fans will also note items on the menu named for his kids.  \n\nLocation is convenient to the arena where the Phoenix Suns play, and I believe may be within walking distance to the Arizona D-backs' ballpark.  Seating is good, and I agree with another reviewer that the make-up is a bit cheesy (especially since they only do the bottom half!) but it adds to the atmosphere.  The locals say you can even catch a glimpse of Alice here when he's not on tour.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 5, "date": "2008-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OI-VGo5ij4TMHVw8xWrKNA", "review_id": "JOJekn4KgzgTcnS8cVZr0Q", "text": "Walked over before a dbacks game. Loved the beer garden, nice draft selection and good tunes. It will likely become tradition before future games.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 4, "date": "2011-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "J4oguWB2tyqBvGJvCBN5hA", "review_id": "DQJ3-y4N1iDtWOvP9k7SxA", "text": "This is aunique place and not much else I have come across is like this. The food was very good, the staff was helpful, friendly and on top of things plus they elicit the \"Alice Cooper\" image in a very accurate way (although they did a not bring me a snake-thank God). Rock N Roll, Food, and Sports are 3 of my 4 favorite things that AC has. If you are thinking of going here or not GO! why deny yourself a very necessary experience in life!", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 5, "date": "2012-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GADYB3y4zQA1Xa-WVVimRg", "review_id": "-9Zbd546bknEeHeyGXc2Zw", "text": "At first I was a little thrown by this place and thought, \"Maybe I'm just coming for the name?\" because the wait was longer than we were told. But the staff was so friendly, the food (oh my gosh the cheese fries! the veggie wrap!) was amazing and our waitress, Bailey, was so attentive, friendly, and informative when we had questions. My friend wasn't as impressed with his food, but he's a super picky guy and I think he went in there already deciding that he wasn't going to be happy. I will be back, but I will go back with the expectation that I'll wait a little longer than anticipated.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 4, "date": "2014-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Aa9wM5uonchu6GMJjs57MQ", "review_id": "39Dk3Hmtv0oPTGD1JVj5Pw", "text": "While on vacation I saw this place on TV and decided to make the drive to Downtown Phoenix and stopped by. The Big Unit caught my attention and boy was it big. It was delicious was able to share with someone else. Seems like a good night spot to hand out and if your lucky I hear Alice shows up from time to time.", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 4, "date": "2015-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zBoXY4OG9Td4jctdmbbG2g", "review_id": "Bowbwg2vEGT-H59YbEtK8Q", "text": "I had lunch there today with a co-worker. I was buying so I told him to get what ever he wanted.\n\nFree chips and salsa - not bad, chips are large and best of all - free, get all you want\nSalsa - good mix of chili's with typical salsa ingredients\nTwo taco plate lunch special - ground beef was boring and bland, taco shells not so good\nRice - Did not eat - not appetizing to me\nBeans - Not bad, had yellow cheese on them, edible \n\nService was first rate - Amy is a rock star.\n\nSo So lunch. I would not order the two taco lunch again.\nI do like their Albondigas soup and ordered a side of soup to go. Thanks", "business_id": "eK6KGMKqU_4nB9RdayZD7Q", "stars": 2, "date": "2015-08-27", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "4CgusCZkipvUhvBZrRD46w", "review_id": "xGVg8qAtV-GXcm-nK3OueQ", "text": "Of course the Billy Joel Concert on June 1st was super-awesome featuring probably one of the most creative musicians to ever be born on this planet.  Those fingers on the keyboard were nothing but utterly amazing not to mention listening to those great lyrics that he created.  But let's talk about the US Airways Center AND the selling of beverages.  I could understand scamming people into buying a 10.50 beer because you ARE at a concert and that's what you do.  BUT------ BUT-----  $6.00 for a bottle of water??? That is beyond the pale of greed--- People in Phoenix heat NEED water before they dehydrate.  The body in these Phoenix temperatures is in a constant state of dehydration even after being in the arena.  I would pay 3.50 for water still knowing that the greed factor is in play, but realizing that my body (our bodies) need water.  So scam up the beer, the liquor, the food (that's a whole other review), but don't scam the water. Not in PHOENIX.", "business_id": "uFJwKlHL6HyHSJmORO8-5w", "stars": 1, "date": "2014-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "K1s6vkiMqAZEX0bssMDBmw", "review_id": "r5sncsCqxrDlGKw_TA1ejw", "text": "Fridays at a ballpark. Typical Friday menu. Giant beers. Prices are actually pretty good considering you'll get less quality for a higher price at the park.", "business_id": "1-1VcGTL3GyCqUpXZLFTZA", "stars": 3, "date": "2011-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wcljOCE-hWHmMpqGFeegJQ", "review_id": "_2kfuORbRxr3E2nCcjuKfA", "text": "Love the food! The staff is good too, only downside is that they don't have highchairs... or at least that's what we were told. Just for that reason, we won't be back unless it's a \"date night\" - having to chase a toddler who doesn't like to sit still (unless in a highchair) during dinner isn't an enjoyable experience.", "business_id": "1-1VcGTL3GyCqUpXZLFTZA", "stars": 3, "date": "2015-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Z7p7FlOI-5d079b_zLioMw", "review_id": "BwflKotDgRMa1KWOc1QYTw", "text": "Charming! \n\nI was delighted to find out there wasn't a two hour wait to get served here, unlike next door. *!!rawr!!*\n\nHaving a bar next door to an insanely busy and popular restaurant where the wait is usually 2+ hours (under the Arizona sun) makes this place essential. Drink a beer or some wine and contemplate if you want to spend a good chunk of your evening waiting in line for a table. I'm only in Arizona for family trips, so there's nothing wrong with waiting in line, passing the time people watching, and maybe getting a little drunk. I don't have any place I need to be.\n\nMinor complaint: I wish they served pizza inside.", "business_id": "JR95uaM82xBUIZ-kQ785iA", "stars": 4, "date": "2007-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Dw0b16ira4GoAm0wlWlYQA", "review_id": "I_lvcb1hzAJ7flTvnVfRHQ", "text": "Feta gyro, how i love thee! \n\nAthenian Express has an entire wall dedicated to menu options, and I just can't get myself to try anything different. The prices reasonable, the food fresh and tasty, it's a great lunch spot downtown. I visit, and will continue to do so at every opportunity. If i were to change anything, it would be to open for dinner and fix your soda fountain. But I am one happy customer! Lightrail accessible and parking in rear.", "business_id": "odhXwWaYZvD_icIN6f_DbA", "stars": 4, "date": "2011-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rDtxgae1nUeawSGwOpgDiA", "review_id": "1jAB8j9R2Un9FufbjbaT0g", "text": "This place is awesome.  So much fun for the kids!", "business_id": "MwmXm48K2g2oTRe7XmssFw", "stars": 5, "date": "2011-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "dMC5pB1A2APaB-MepItZEg", "review_id": "UHnGAAl99Y_mrab5v0a8GA", "text": "We were very impressed about how modern the Arizona Science Center is! The exhibitions were really interesting and seems to be a great place to visit as a family!", "business_id": "MwmXm48K2g2oTRe7XmssFw", "stars": 4, "date": "2013-07-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fVhDdUdgYP57w5uf1wZaCg", "review_id": "X6k0G9qwL5WY-YZhbIBSdg", "text": "This is definitely a place for families with kids under 10. I've been to many science museums across the US and have walked out completely amazed by the exhibits and \"special exhibits\" that you pay extra for. After my first time to this particular museum, I was left wondering why I was charged $26 to see a \"special\" exhibit that consisted of pictures, a few real artifacts and a single mummy.  After being thoroughly disappointed we walked the rest of the museum, which consisted of various sparse exhibits geared mostly towards children. I'm glad there's a place like this to bring kids to help them learn, but I don't see how this museum differs from what I image the actual children's science museum features.", "business_id": "MwmXm48K2g2oTRe7XmssFw", "stars": 2, "date": "2014-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ioTuTA_pI-ZgiM4uISDQPg", "review_id": "dFTA7W1Zoqg2Px3UpTx_iQ", "text": "I like this Subway.  It's newly remodeled and if you go after 12:30 you beat the lunch rush.,  It's always been clean when I go in and the workers seem to stay, not a super high turnover.  They are always super nice too.", "business_id": "ldIxXmxD3Cku0vODGYb9dQ", "stars": 4, "date": "2009-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "k3wv0bv0qMQ5iS3Q9vguHA", "review_id": "qSc0Oiexm-zeiE-5Kk1eLw", "text": "I read the reviews on here, so I was excited to try this place especially since it's so close to my house.   After eating there once, I doubt that I will ever go again.  I always judge a Mexican restaurant by the beans, and theirs didn't taste good.  I ordered the machaca (shredded beef with onions, bell peppers and tomatoes) tacos.  They came without any cheese.  WHAT?!?!?  How can you give me a taco without cheese!  The meat was OK but the taco itself was very greasy.  My husband ordered two enchiladas, one machaca and one chicken.  He liked the machaca but took two bites of his chicken and didn't like it.  I have to admit their horchata (rice milk drink) was good and a good size.  I know there's better Mexican food out there, so I'll keep searching...", "business_id": "hWhVP-28LYP3llaMlAJ_JA", "stars": 2, "date": "2008-07-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "rRiBDH2U_IlydXTh2a81Rg", "review_id": "KpSppx7LnMzMz-IpzvQ7iA", "text": "my fiance and i are huge fans of mexican food and there's rarely a time that we're not in the mood to eat it.  when a friend told me they served a speciality frozen horchata drink, i knew we had to check it out.\n\nthe frozen horchata is served as a cocktail, and you have the option of getting it with either rum or vodka.  we opted to try both, and they were amazing! i definitely preferred the drink with vodka since it didn't take away from the flavor of the horchata like the rum did. after finishing his drink, my fiance ordered a jamaica margarita with chili on the rim.  i had a couple sips of it and it might have been better than the horchata! \n\nchips and salsa can really make or break a mexican place for me, so i really appreciated that their chips were hot and salty while the salsas (red and green) were spicy and delicious.  \n\ni ordered the chile relleno, and it came out super hot and covered in tons of cheese. i really enjoyed the flavors of it, and was sad that i could only eat about a third of the meal.  the standard bean and rice sides were also really tasty and better than i've had in a while. \n\ni will be definitely adding this place to my regular mexican restaurant rotation!", "business_id": "hWhVP-28LYP3llaMlAJ_JA", "stars": 4, "date": "2013-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e-GOQDdx_pPSi_dHJ87oKQ", "review_id": "uS83c6Clakr4xmoSneSHbw", "text": "Rosita's is THE mexican food restaurant when you're near the 10/51 interchange. Everything is great -- the food, the atmosphere, the service. The salsa is excellent but watch out for the verde, that stuff gets caliente. Fortunately their glasses of water are plenty large.\n\nTie for favorite items are the shrimp chili rellano plate and the two ground beef and potato tacos. The taco shells, like the chips, are freshly prepared and topped to the brim with lettuce and cheese. Just a very legit mexican dining experience.", "business_id": "hWhVP-28LYP3llaMlAJ_JA", "stars": 5, "date": "2015-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kBaItLrRUKJ6_K5xzNo7_w", "review_id": "xMKoEzmCuJ5mpWDtHPTsqA", "text": "Not too bad for fast food. Burger comes with mustard & pickles which I always ask them to leave off. More reasonably priced than some other drive thoughts. My daughter likes their chicken strips.", "business_id": "ixTr1qXUFGTzyaZUuCDDvg", "stars": 4, "date": "2015-08-19", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "KGQu1on15VSK27U0oGtefg", "review_id": "65unC_2O13ORMj8Yc86S1Q", "text": "I love, love, love this place. Does parking suck? Yes. Do they get busy at LUNCH hour? Duh. Is it small? Yes. Is it fun, locally owned with fresh ingredients and nice people that run the place? Yes, Yes, Yes and Yes. \n\nSo to me, it's worth 5 stars and $7.82 for a wrap and side.... \n\nI see complaints that ppl think it's expensive, me thinks not. If you go to any other lunch time \"quick bite\" place you'll pay about the same amount (or more), unless you're talking about a franchise fast food spot. \n\nThis place is right around the corner from where I work so I like to zip over here when I've forgot lunch or too lazy to make it. I almost always get the Turk 182 b/c I love artichokes and the Muenster cheese. I decided to branch out and tried the Sherry A'More. YUM! I don't think the food is bland, and I like flavor. I don't think they all taste the same either....the garlic rice in some of the wraps is great, and I normally don't like rice in wraps. \n\nEvery time I go here the people are ALWAYS nice, even when getting eye rolls, sighs and rude comments from customers. Service is HUGE with me and goes a LONG LONG way so I can easily look past small inconveniences of parking and a small restaurant and the occasional mistake of the order taker...", "business_id": "ZoQAOnEFnyHjSpomtfqesA", "stars": 5, "date": "2009-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "t31V7uAI6ZDUltn_Kd_xyQ", "review_id": "IUcISk-IZuUBsBlRf5TumQ", "text": "I have been here numerous times. Every time \"John\" is there he finds a way to insult either myself or my wife. Dont get me wrong, I love their selection of books and other wares, its just \"John\" that turns me off of the place.", "business_id": "35fKolVRrf2ulODyHw04cQ", "stars": 2, "date": "2013-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "69n2pM-TbaxrwwTRUwL1mA", "review_id": "em5DMSsljH-KdC3iZXE90w", "text": "They messed up our orders, they took forever, and the place is a little dirty. It's my belief that a restaurant or business should never express their political views, which this restaurant has failed at (signage). It was nothing too special. Tortilla's were good! But that's not enough to bring me back.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 3, "date": "2012-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2AbBZM7n9EMwa0nK1yl0CA", "review_id": "soPRN7wOnE6WHR0m7mH-yA", "text": "I've been here a few times and each time has been good. This is not high class dining - it is down home Mexican cooking. They use some mixture of gas and charcoal - as you step inside you can see some smoky haze. The prices are low and the food is good.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 4, "date": "2014-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "698_Zx0Nz7LqnSR-yUmqzw", "review_id": "6Rf99EYHdE8mLOZFpb2HRw", "text": "I have been a loyal customer here for 15 years. The staff and food are great. The prices cant be beat, especially during lunch hours. A great variety of food from seafood to vegetarian to meat and poultry dishes. This is truly a Phoenix gem!!", "business_id": "ykfTh6HI219NoMsWBxulxw", "stars": 5, "date": "2012-06-29", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 5}, "user_id": "DBvnnmCGMQz-qnMsg2uFOg", "review_id": "pDdZCyphE_V2RqGkFCXsGQ", "text": "If you're looking for the unique, quirky, off the beaten path side of Phoenix, come to the Welcome Diner.  With 9 stools around a bar near a hot kitchen, it is a small place with a lot to see.  The cooks are very friendly and talkative, and will give you their opinion on their dishes if prompted.\n\nTry the classic cheeseburger, fries, and soda - it's definitely a favorite.\n\nThe Welcome Diner is definitely small, but worth the wait (if there even is one.)  It is truly a treasure to the historic Garfield district.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2007-06-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "v26k4Bzy9GiLLlSmDk8LfA", "review_id": "4NMB53gQZO19HKPPd_cR2g", "text": "The wife and I ate dinner here tonight and we got the veggie sandwich.  It was amazing we were both blown away.  Will you please put this on the menu?", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2013-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "z5g5Lclwt13_BO0BStohMA", "review_id": "zHW2qKaCoOVvt_cm1AJW4w", "text": "The closer I move to Welcome, the fatter I'll get. Everything is that good. I reminds me of little food bars in New Orleans' Irish Channel. And save room for a cocktail or punch. \n\nIndoor seating is super limited, so be careful in arizona summers", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2014-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5nBfnnIqNh1cK7_nScrIcw", "review_id": "YlsjSCsBuyZSgvQ2zLXMXQ", "text": "I heard a lot of great things about this place and was super excited to check it out. I ordered the Bumblebee (fried chicken, biscuit, honey, mustard) and my husband ordered the  PB&B burger (burger with peanut butter and bacon).  My dish came with a few pieces of sweet watermelon and his came with a side of slaw. We first experienced a peanut butter burger at rehab where they also add grape jelly and sriracha and my husband has been on a PB burger roll ever since. He thought his burger was very tasty and ate his whole plate. I liked my biscuit dish but I think I was expecting something a little more....substantial? The chicken was really great and moist but it felt like there was something missing. I think I was expecting it to be slathered in honey/sauces but it was certainly worth the price ($8.50). I'd definitely come again but I think I'll try another dish next time.", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 4, "date": "2015-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nZieuZ3qBH_1NoyKMMKRSg", "review_id": "kU1bm2tIUK2KEPyugb0KJw", "text": "This little gem is tucked away in a quiet neighborhood near downtown Phoenix. We happened to be driving through on the I10 and I am so glad that we stopped. The service was friendly and had some awesome recommendations as it was our first time. Everyone loved their orders, their homemade biscuits were AMAZING. The fried green tomato sandwich on a biscuit, out of this world. It was a quick detour for some of the most memorable flavors on our trip!", "business_id": "tb24fvNJfHhyKEXkKn12Xw", "stars": 5, "date": "2015-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 4}, "user_id": "U040XsrqbEV27c-SIUhObQ", "review_id": "MRCTD1xoOo3uxjObu2pkfQ", "text": "here's the word from a trusted friend who recently went:\nvery\nlatin\nit was yummy and fun\nawesome music\nfun dancing\ngood crowd\non a scale of 1-10?\n11", "business_id": "0VpsHbGLHDVKIKAi0ZliyQ", "stars": 5, "date": "2007-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7pkjLqRLn4UInVwG6FMv6w", "review_id": "6QHjZHdA5J2ELYY6R9uN6A", "text": "Don't pass this place by!!!  Several selling points:\n\n1.  It will make any day of the week a staycation!  \n2.  Agua Frescas - fair warning - you will be hooked in no time!\n3.  Best and cheapest lunch in town!\n4.  The meat counter is the best in town - like the butcher your mom grew up going to - not \"supermarket-ish\" at all\n5.  THE FISH MARKET - OMG!  if you have ever lived near a coast with fresh fish markets - you will be as close as you can get to that in the DESERT!  Not to mention the Ceviche assortment ready to be packaged up and taken home - or eaten right there!\n6.  Fruits and Vegetables - great prices\n\nI normally wouldn't recommend going grocery shopping while hungry - but at this place it is a must!  Try everything - and take more home!", "business_id": "VXIkI9_EbDbYHeO9IzKjJg", "stars": 5, "date": "2009-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lT8vDFmWTWWSvo4QLJt_Uw", "review_id": "kTgPlnGoqRvPl8OnVgG7QQ", "text": "The carne ASADA tacos are delicious. .. And the price aren't bad at all... But, if in a hurry expect to wait there is never a sorry line to pay for your food.", "business_id": "VXIkI9_EbDbYHeO9IzKjJg", "stars": 3, "date": "2014-07-08", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "K0YMZcrmKRPEQtvkxIebzA", "review_id": "Q93l4ZD90pM1vQ4D9HmFHQ", "text": "I'm so happy to have found this place. And it's in my neighborhood! Everything is very reasonably priced and the staff was very helpful. My little maltese mix is quite a chewer which means I'm always having to buy new toys. I've saved a bundle here! I've even purchased a toy for $3 that I've seen for $15 - $20 at the pet store. They have a huge assortment of toys, grooming products and treats so you'll have no problem spending the required $25.", "business_id": "Dj3i6a_vboALYTRKTmBABQ", "stars": 5, "date": "2009-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NqnBDuqZqwr8d6KcoVO8VA", "review_id": "e8xvvPYdpNqHTusS16nc-Q", "text": "I think people need to remember that Ryan's caters primarily to professional groomers, trainers, kennels etc.  The fact that they allow the general public to come into the warehouse is a bonus!!!  For the people who grumped about the hours, lighting, having to leave personal items up front.....this isn't a general retail pet store people it's a warehouse.   Me personally I really appreciate Ryans...I can buy my supplies for my grooming business and get it today. I can also get supplies for our kennel, toys, treats crates, beds .... thanks Ryans for doing such a great job.", "business_id": "Dj3i6a_vboALYTRKTmBABQ", "stars": 5, "date": "2015-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Jz4scLeJk2eki2vXmcETSA", "review_id": "b7vt0SJ-D6bSzw_te2-qsg", "text": "I stopped here to get a donut for my daughter before school. I got a cruler. Best cruler I have EVER had. However, there's a few things you have to be aware of when you go. One, I got carded to use my card which has my maiden name so I had to scrounge up cash and change from my car because they wouldnt let me use my card. Two, I ordered a blended coffee. I watched the Asian lady make it, no coffee went in the blender... it tasted like a terrible milkshake. My daughter got a strawberry frosted nd some donut holes. They were terrible. The frosting tasted like plastic.  The reason I'm giving a 4 star is because the cruler was THAT GOOD. I'm going to give them another try... when I have cash.", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2012-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "AX9RoaxW2E2XZjV9HW22RQ", "review_id": "lg0lcsFoiVg-r7lJEjBpkg", "text": "I have never eaten El Salvadorean food before!  I was looking for something different and saw the reviews!  I called a friend from El Salvador and he suggested the Pupusas with cheese!  THEY WERE YUMMY!!!  Its my new favorite food!!!  I will be back!  Thanks!", "business_id": "rbiRLiFTG098z9JaK3Nshw", "stars": 5, "date": "2009-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WflEF3597OItD39ygq9C8A", "review_id": "8PPyVbWo4bO5KnplGBvapQ", "text": "This organization is AMAZING! I mentor a child from this program and am so happy they connected the two of us! There is so much to learn from a child. Check out New Pathways for Youth if you are looking to mentor or give a donation. They are wonderful, along with their employees.", "business_id": "pf04_HoTlCMStImb3OMkig", "stars": 5, "date": "2013-07-31", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "ERzdkFewW7plgD5XInPguA", "review_id": "D9c6p9ABJonJ_BGBRXZ4ug", "text": "The sign on the door says they close at 9 pm. The hours posted on Yelp says they close at 9 pm and we get there at 8:30 and the doors are not locked. We go inside and the the lady mopping the floor tells us they are closed. This was extremely disappointing since we had driven from Glendale to eat there. Unfortunately we will not be returning and we will not recommend this restaurant to anyone ever again. Because they chose to waste my time I will go out of my way to share my experience with anyone willing to listen.", "business_id": "cgNIBHS2mLdbTRiodAT6EQ", "stars": 1, "date": "2014-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "t8vH6ubd-6i9DTisZaQdgg", "review_id": "7nZbtpveOJ2Sx6K_hHU4dQ", "text": "Perfectly complimenting their slightly funky, slightly hip 'historic' Phoenix neighborhood, Coronado Cafe is the place to go for comfort food with a modern twist, with an easy laid back ambiance.\n\nCoronado's quaintness offers comfort like a proverbial pair of old slippers.  The service here is always spot on, even during the busy lunch rush.  I am impressed that each service experience at Coronado is a friendly smiling face.  I always leave feeling that not only are the coolest Phoenicians (diverse, individualistic, interesting, intelligent, versus Scottsdale snobbisms) at Coronado, the wait staff is a reflection, or vice versa, of the clients.\n\nI tend to often go back to the meatloaf.  I would offer that although perhaps a tad on the salty side, a wonderful, flavorful staple, presented on top of perfectly prepared smashed potatoes.   Who said there is not heaven on earth?", "business_id": "5-X03Zc0nN7U5eoe8uFUdw", "stars": 4, "date": "2008-06-21", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "9VgJTJvUyoyuUPRxGSlPhA", "review_id": "4rmSH_RCM6GPWvHzrxmbGw", "text": "I am sorry to have to write a review like this for a local restaurant.  I am vegan.  I had a lunch reservation for Coronado Cafe, but decided to call ahead of time to work out any kinks in the preparation (e.g., no butter, no refined sugar, no smuggled in eggs or milk or cheese).  When I called, I thought I was lucky to have reached the owner.  I was quickly disabused.  She quipped that I should have taken the time to look up their menu online.  (By the way, of course I had, but they don't label!)  When I told her that the menu doesn't tell me everything I need to know for my diet (e.g., the butter or sugar issue), she got really exasperated and whined, \"I'm trying to help you.\"  I said that was great and I'd like the help.  She then said that they have several vegetarian items, which again I explained might not be vegan (a vegan diet is more restrictive, so just because it's vegetarian does not necessarily mean it's vegan).  I asked her, for example, to ask the chef if the veggie burger was vegan, and she said,  \"I'm the owner and I know everything about the menu.\"  So I asked her if the veggie burger was vegan and she said, \"I don't know.  Is a veggie burger vegan?\"  I said, \"Some are; some aren't.\"  She said, \"I don't think this is a place for you.  Don't come.\"  I didn't.  And I won't ever.  \n\nTo sum up:  The owner is rude, unhelpful, unknowledgeable about food -- and to top it all off, she refuses to talk to the chef (who could easily answer food prep questions).  Two thumbs down; two thumbs way down.", "business_id": "5-X03Zc0nN7U5eoe8uFUdw", "stars": 1, "date": "2013-06-07", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "m7vtKWpZ9wdEQ95wJxrMrg", "review_id": "ColXwwK8oT7G4hKpBgLXXQ", "text": "Americana of the mid-20th century fascinates me and stepping into this soda fountain is like stepping back in time to that period. The decor is fun to look at, and it's nice to be able to browse the merchandise (furniture, trinkets, and other stuff) while waiting for your meal. I ordered the black bean burger - not a 1950s dish to be sure, but tasty and substantial. The strawberry milkshake I got was rich and plentiful; I wish I could have finished it but I was too full from the burger. Definitely worth the visit.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 3, "date": "2009-07-01", "type": "review"}
{"votes": {"funny": 6, "useful": 2, "cool": 2}, "user_id": "BjwXX-sChcjx2E55B_7rXg", "review_id": "fqHoxh6F5goGoU9yf81olg", "text": "Here's a sample experience at MacAlpines:\n\nWow! A real, old fashioned soda parlor! Whoa, look at all this vintage stuff! Hey, check out the menu! Oh hell yeah I love this kind of candy, I haven't seen this in forever! Oh maaan 99 flavors of soda what the whaaat! \n\nMmm.. pina colada soda, wait, the butter pecan is even better! No, taste the margarita! Wait, they're refillable! AHHH!!!! VANILLA COKE! BUBBLEGUM! MORE BUTTER PECAN! HEY THERE'S CHOCOLATE! GIVE ME AN IRISH CREAM FLAVOR! PUT CARAMEL IN IT! ANOTHER CARAMEL, THIS TIME WITH CHOCOLATE! WE HAVEN'T EVEN TRIED THE ICE CREAM, WE NEED THIS ONE WITH ICE CREAM IN IT. MORE ICE CREAM YUM THRIFTY ICE CREAM!!!!!!!\n\nHoly shiznit, that soda.... 'twas nothing but awesome... I don't feel so good.\n\n*passes out in the car*\n\nArrives home.\n\n*passes out for fifteen hours*\n\nAwakens with a hangover more vicious than the Thursday following Wine Wednesdays at ASU. Remembers MacAlpines fondly while taking 3 Ibuprofen. Goes back to sleep.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 4, "date": "2011-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "niY4L9_jflP_epUx5pBhqA", "review_id": "sgndKI8BObEZ5y_BhZMMbg", "text": "There are so many delicious float options!  The staff is friendly and I definitely felt like I went back in time. I didn't try any food so can't say much about that, but the float was awesome with extra soda and lots of ice cream. Cute antique store attached.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 4, "date": "2014-06-19", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "66oDhsKSB_eSrhCKiERDow", "review_id": "C5-F3Sd74t5Yc4qgnfDBdA", "text": "First of all, this place is ROASTING!  It's horrible.  How can an ice cream shop be so hot?  Looking around I don't see any air condition vents.  Don't tell me they have none?  It got a little better as I sat at the bar with fans aimed at me, but I am still in wonder at how they have lasted this long while being that hot inside!\n\nThankfully I'm just getting a root beer float.  I was offered water before it arrived.  The float's glass was nicely chilled, and I appreciated the tiny little chilled metal pitcher of extra root beer to top it off.  Ezra The ice cream had a nice strong vanilla extract flavor but was unfortunately icy (ice chunks within it).  Several of the wait staff asked me how it was as I consumed it, so I would say service is good here.\n\nI am not a fan of the big blazingly hot non-air conditioned room of clutter when you walk in.  All but two of the booths were filled, and one of those was not bussed (dirty glasses on it), so the space could definitely be reconfigured to be more profitable by putting in more seating.  I sat at the bar, the furthest away from the broiling area surrounding the windows, but ended up sitting in front of the employees' hand washing sink.  The bar top itself is some type of weird old plastic material that is fades in many areas and cracked at the edges.\n\nOverall it was a very decent float that was undoubtedly a step above Dairy Queen or A&W's soft serve version in quality.  The $6 after tax and tip price (I hadn't looked at a menu when I popped in and ordered it) was eyebrow raising though.", "business_id": "R6aazv8FB-6BeanY3ag8kw", "stars": 3, "date": "2015-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1Y0FNejhQg47mBpTK0EDEA", "review_id": "YCOEU5yU7vkRqod6DN4CTQ", "text": "Since I moved to San Francisco, I have sometimes contemplated going to Phoenix, buying as many Rito's burritos as I could afford, and bringing them back to my freezer for emergencies.  I LOVE this place.  This is real Mexican food.  They serve salad with the Mexican food here in the bay.  If this place opened up on Geary in SF, there would be lines around the block!  Have a Red Chili and bean burrito enchilada style with a taco.  You will come back.", "business_id": "Xo9Im4LmIhQrzJcO4R3ZbA", "stars": 5, "date": "2010-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "47YykOaEUcO8zTpC3O5iOg", "review_id": "sPnNklFxYuVFHzDjZF7jyA", "text": "Can you say burrito? Can you say waiting in line to taste the green chili yumminess is TOTALLY worth it? YES!! It's a hole in the wall in the middle of a neighborhood, but don't let the appearance distract you from the finished product! It's fabulous!!", "business_id": "Xo9Im4LmIhQrzJcO4R3ZbA", "stars": 5, "date": "2013-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ORprb2pJxjzjJOsuEch0bA", "review_id": "5gs6ecgac-i9D-Ekgp1-vQ", "text": "I got some tacos at a taco stand in Rocky Point once that were the best tacos I've ever had.....until now!\n\nI got two Beef and Guacamole tacos. Unfortunately they were gone before I could snap a pic of them to go with my review. \n\nThey must handmade their tortillas because the shell on these things are phenomenal. Light and crisp, excellent flavor. Totally worth the price and the wait.", "business_id": "Xo9Im4LmIhQrzJcO4R3ZbA", "stars": 5, "date": "2015-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "p7dvahRPZIWL7T6pFA_0dg", "review_id": "Z0vlR2n57CSOtz20IkDZcQ", "text": "If you like FRESH seafood and also enjoy spending very little such as $25 for TWO DINNERS this might be a place for you! \n\nSmall converted older Phoenix Ranch style house converted into a cheerful Seafood Restaurant that had live music when we were there, located among a row of row of other Mexican Restaurants. (that were rougher looking)\n\nWe had the spicy marinated fish and the diablo shrimp.\n\nThe Marinated Fish had essence of vegetable threw it and was cooked to perfection being very light moist but not falling apart also skinless , lacking fish taste meaning being sweet and fresh instead . The fish was topped with a spicy red sauce that was a perfect spice heat and topped with fancy cut lightly cooked celery for texture . This dish came with salad garnish , beans , rice , tortillas and the fish was elevated up on the plate by the use of fries .\n\nThe diablo shrimp come with a similar set up but are topped with onions and the spice heat is more of a challenging 10 out of 10 instead of the expected heat of 7ish . (this dish had good flavor but is not for everyone)\n\nat the time of this review this is a cash only establishment but a sign is posted that they will except credit cards soon .\n\nWe were Five Stars satisfied with meals and service , we'd return .", "business_id": "NYBx4sdSVrN-I5Q8RfLMPg", "stars": 4, "date": "2011-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "HnjYDB1ZtIZ1oQI0eW18TA", "review_id": "ml1IKedKqd6mmT-XkQN3gg", "text": "If I lived near this restaurant I would be there all the time. They make the most refined yet homey sauces (especially the camarones culichi, or shrimp in green poblano sauce is addictive), serve freshly fried puffy tortilla chips, delicious ceviche tostadas on the house, and perfect shrimp tacos. The atmosphere is warm, festive and neighborly, no pretensions and the prices reflect this. There is a full bar, huge draft beers with lots of lime, and very hospitable service. I haven't enjoyed such a wide array of flavors, amazing Mexican style seafood outside of Mexico, even in San Diego which comes close.", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 5, "date": "2011-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iWnu2qv0RhXM3wE-zs4h3Q", "review_id": "XkvsGY_BhEUBxqKKT3Lq0A", "text": "Fish tacos were perfect. Crispy. Flavorful. Excellent salsa. Didn't like the margaritas otr. Had an odd taste. Service was slow and didn't get guacamole after 2 requests. But the topper was the outrageously loud mariachi band, amped up to really kill your ear drums.", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 3, "date": "2013-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QTR42Jd_k_AKLNAoKH4Syw", "review_id": "NfPK_xB6wl9InRDBKHkbfw", "text": "Outstanding seafood restaurant. Was craving something different and this restaurant delivered. Do yourself a favor and try the house special.", "business_id": "Cp6JGY5YIRncTV_My9nf9g", "stars": 5, "date": "2015-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 6}, "user_id": "cB30-Og37dzCWFCFzI_ChQ", "review_id": "__esH_kgJZeS8k3i6HaG7Q", "text": "I am not usually a fan of botanical gardens. They seem too precious, too \"perfect\" to be of much interest. And, let's face it, flowers and plants are beautiful things, but when you pay to look at them in neat rows, something is lost.\n\nThat said, Desert Botanical Gardens is an exception to this garden cynic. Many of these cacti look like they are from another planet, like something you would see in a sci-fi film and say, \"wow, it's too bad those crazy plants don't exist.\" They sprawl out on the ground, weaving and turning every which way, or compose huge bizarre formations high off the ground. I never knew such bizarre life forms existed, or that some cacti look like trees.\n\nThe gardens are full of windy paths where one is also likely to find a family of quail, lizards, or a jackrabbit or two. Various species of bird can be seen here as well, especially at dusk. I especially love watching the birds fly in and out of nests they've made in the upper arms of cacti.\n\nThis place never grows old. It's a great introduction to the desert for people from out of town, and because the cacti have been collected from around the world, a cool botany lesson for us all here.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2007-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "jhXZSe0pLgW1b6m6Te8Icw", "review_id": "Z0Fha58VoDMapCShPhkINw", "text": "I've been here twice and actually enjoy the trails regardless of the insanely 108 degree temperatures. There are cafe's, rest areas, water fountains and restrooms strategically placed on the grounds. \n\nI however get bored easily with tour guides - and the one we had the second time was not very exciting - no disrespect to her because she was just being informative - but standing in one place in that heat just made me impatient. \n\nSo my fiance and I walked around each trail and did \"photoshoots\" - So I suggest that when you go during the summer - make it fun as far as pics. We didn't get a chance to go at night - but a day here was well spent. \n\nNote: There is a butterfly section in the garden but don't get your hopes up - we didn't see any during the summer.", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 4, "date": "2012-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XMcDtOy-4j0wDcKt98GEbw", "review_id": "N27pfOvm_tTasYDIuMV5kg", "text": "Amazing place to visit.  A must do,  actually a lot of shade out on the trail.  Would go again to see other exhibits", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2014-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "96PerhWe_t7uXN65YGbddw", "review_id": "7Ih-tNPFaBF1ivTqxByxPA", "text": "More than a year ago, I heard about this garden during a trip to Scottsdale.  In my mind, the question formed quite clearly:  \"What kind of a botanical garden can they possibly have in the middle of the desert?\"  As a Missouri native, I still have a great deal to learn...and this experience was most informative.  \n\nJust as with so many other delightful surprises, I found that Arizona can (and does) host gardens every bit as captivating as those in other states.  Despite great variance, they are beautiful in their own way.  This was a very novel encounter for me, as I found myself immersed in a land of cacti and thick islands of stalwart plantings yielding flowers of unexpected beauty.  Tiny creatures (lizards and geckos) darted here and there beneath some of the plantings, offering amusement to visitors.  Birds fluttered amid the trees, and butterflies came to sample the sweet nectar of the desert blooms.\n\nThis was both a beautiful experience and an educational moment that I've continued to build on.  My knowledge of gardens had been far more limited that I realized, and even after exploring tropical and \"classical\" botanical gardens across the Eastern United States and the West Coast, I still have a LOT to learn about what a successful garden can actually consist of.  \n\nYet even for those who wish to simply relax and drink in the peace and serenity of this magical wonderland, this will prove an ideal venue for quiet reflection and enjoyment.  Children also were enjoying the cacti and the lizards, and there was plenty of room for a diverse assembling of visitors to use the gardens in their own way, at whatever pace they found best.  There was also plenty of shade in most spots...a definite consideration given the terrifying Arizona sun!  \n\nI will make it a point to come back here during future trips.  What a fantastic place this is!  I loved it!!", "business_id": "qMkIbQFrROSnPaQ7at85-w", "stars": 5, "date": "2015-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eaPzlSDhE5Nemi8rrdfxJA", "review_id": "Q7T-BR2NGCdgLZLKjfZHJA", "text": "Free Parking and Breakfast. Affordable during summer season. Spacious room and ideal location close to Papago area, Botanical Gardens. No complaints, Will stay again.", "business_id": "qIhBNeE64skjowRs6TTwJA", "stars": 4, "date": "2015-06-30", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "tlSSQwfHYJany7wPoTH46A", "review_id": "41OkzMzI0otkc9OQgn1Cpw", "text": "I think I just don't like El Salvadoran food. It's either that or I accidentally consumed the cardboard and polymer display models in lieu of my actual entree. That was some seriously dry, bland food. Even tossing some watered down hot sauce on that pile of bland meat and carbs didn't really improve the edibility. I had the appetizer platter and the chicken with white rice and weird white sauce with a dry side salad. It was a bland, white platter of food. Plus, what's with the side salad of iceberg and radishes? Is it garnish? It's not dressed with anything and, you know, tastes just like a pile of lettuce. \n\nMaybe I'm just an ignorant prick. Maybe I ordered the wrong thing. Maybe I just don't like El Salvadoran (although I love just about everything else Central American). \n\nThe pupusas were crazy delicious though. I would totally return for these. (And only these.)", "business_id": "q2SZa5g85758iW1L9sSL1g", "stars": 2, "date": "2010-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "JjweKRcu8DeYTah_KHsT2g", "review_id": "Wapk3lYALEkzFeFAcTl4pw", "text": "My car was overheating and the closest place I could think to take it was this Pep Boys. Let's make a long story short...they quoted me almost $700 because \"all of my hoses needed to be replaced\" along with my thermostat and a coolant flush. Not to mention they were going to charge me EXTRA for a warranty on the parts which is absolutely ludicrous. After talking to a trusted mechanic (who doesn't live in AZ) I took it for a second opinion to Shadow Mountain Auto Service. It was a bit of a drive but I made it. After all, they're yelp reviews are nothing but raving fans. A trusted, hard working, friendly auto business. Not only did they quote me $300 less than Pep Boys but they told me they couldn't find anything wrong with my hoses. It seems to me that Pep Boys DOESN'T do everything for less or even with integrity, for that matter.", "business_id": "9a-MZdxZ28o4j1pXI22btw", "stars": 1, "date": "2013-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "MxzyUZmLKSNdIZzOaSsGng", "review_id": "tRF3Yj7BOIMfUs77nYp9Fg", "text": "Let me start out by saying this place was amazing when I first moved here a year ago, but then things started going down hill fast. I have nothing, but good things to say about Tomas and Carolyn as they show amazing customer service and treat people with true professionalism. Unfortunately though they do not run the property! \n\nProblems I have had here include:\n\n1) Poor and extremely unprofessional help along with lack of integrity from apartment head Donna.\n\n2) Very slow response time for maintenance requests.\n\n3) Very poor AC units! I live in a 1 bedroom unit with my air set at 79 and am paying $210 a month. This may be due to the horible insulation and sealing of the apartment.\n\n4) Horrible plumbing. The toilets don't flush well due to horrible water  pressure.\n\n5) Rates change constantly here and they are always adding new charges.\n\nI started out paying $723 and now am at $998 a month. And this place has not improved the living conditions worth raising the rent costs.\n\nI could not in my right mind recommend this place to anyone. By far the worst apartment complex I have ever lived at.", "business_id": "T9p5rNXbxOYYIbdUOznXyQ", "stars": 1, "date": "2014-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "A7q0D5K9DLN47e284rAYGg", "review_id": "RjDVKwZHl_QtQRc42bvyVQ", "text": "Some the best Indian food in the valley. I am reluctant to give five star on any place, always being the explorer, but I would go 4 1/2 because there is not damn TV and the atmosphere is excellent", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2011-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3TsQF2dqHncZMi-VA4pFPQ", "review_id": "vCjWQOHVJ8kHdeLBm5dEmQ", "text": "We were here for their lunch buffet. The chicken tendori? was very tender. Coconut dessert was good. Everything was bit too salty.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2014-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qw96miMUpAhFLjdQmdVkoQ", "review_id": "yjC07bm12OVrevKoG4mkHA", "text": "We arrived at this hotel late at night and were met by a very nice receptionis, I think his name was Noe. \nOur room was simple, but nice, clean and pretty big. It was nicely decorated by Rosario, with a few dosens of towels! Hahaha that reminded me of a cruise!!\nI love having a complimentary breakfast at the hotel, and they had it here. Simple but fresh and good. I have no reason to give this place less than 5 stars.", "business_id": "CfzoA3TQ8YQcFTOncJFbQQ", "stars": 5, "date": "2015-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hGitwL2Ixiq3C6mJyQrlPw", "review_id": "HMybH10gVV3V6iP8tQHtXw", "text": "Just had the best meatball sub ever from here, take-out. This place always has people picking up and dining in. Old-school Italian still appeals.", "business_id": "PEHJjxdw11TGFma9Zhz3ng", "stars": 5, "date": "2009-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AsAVFV7riBpkFyFwv6IR7A", "review_id": "7-moOiytnPWZblAxRcLj5Q", "text": "Great food and a good family atmosphere. Too bad they don't open on Sundays. I would imagine that Sundays could be one the most profitable days so I don't understand the concept behind it.", "business_id": "PEHJjxdw11TGFma9Zhz3ng", "stars": 4, "date": "2014-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k5U-0FBwvWUob8dlT6RvmA", "review_id": "AkO_ND04TuKCK9BuTKa_Rg", "text": "\"Men of Soul\" Saturday: June 25, 2011 7:30am.\nFreddy Jackson \"You are my LAdy\", Peabo Bryson \"Tonight I celebrate my love\" feat Roberta Flack (but on of his back up performed Roberta's part) & Jeffrey Osborn \"On the Wings of Love\". Truly it was one of the memorable concerts my wife and I have seen.", "business_id": "BcBxTyj09Wu-w0KA1QvKTA", "stars": 4, "date": "2011-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bkC4Agy7KZiYLLGAp7wT0A", "review_id": "HZiU21wcUGOoUMTWdIiqng", "text": "Found Sun cellular after they were on the news. I had an iPhone 4s with a broken screen. The owner was very polite and and explained everything. The repair was completed as promised definitely recommend them.", "business_id": "4anyLAWqWVZh5BFpol9czQ", "stars": 5, "date": "2012-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "eYQRLJ5I9JaCWUbrJUAtzw", "review_id": "suUQ-r_pHax3I0klybce2Q", "text": "Unfortunately, my good luck has worn off. I recently renewed my lease with Courtney Village and I regret every minute of it. Can't wait to get out... 15 months won't come soon enough :(\n\nI have listed the PROs and CONs- judge for yourself:\n\nCONS:\n-The cost of rent is extremely high for the area\n-You don't have the option to opt of door to door trash service AND you have to pay for the trash compactor. This comes to a CRAZZZZZY $25 a month for trash. That's more than my water bill!!!!\n-$40 per animal is INSANE and they can't even keep the bags stocked for you to pick up poop\n-The sprinklers go off right when you get home (3:30-5:00pm rotation) so you can't even walk animals or check the mail without getting sprayed \n-One of the treadmills in the gym is almost always broken\n-Children (I'm talking 10 year olds jumping and splashing) are always in the hot tub when you're trying to relax and there's no sign to say they can't be\n-The gates seem to be broken at least 2-3 times a month and they just remain open so anyone can come in\n-There is only one assigned parking space per apartment so there is hardly ever open spots anywhere near the buildings \n\nPROs:\n-The staff really does try and be helpful when you have a question\n-The office is open on the weekends to pick up packages, ask questions, etc. \n-They provide new air filters when you need them\n-Maintenance staff is super friendly\n-A lot of tenants have animals and I love hanging out at the dog park with them all\n-They have fun community events with free food\n\nI would not recommend this place unless they fix some of the major issues listed above. Happy apartment hunting!", "business_id": "bVRoCoXu2jIyqbZRT_isWw", "stars": 2, "date": "2015-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Gwyct4fcpLcLrEK43chwQg", "review_id": "yQ0RUPCFZspJyuowXlQpFg", "text": "Delicious! Ribs, chicken, mac and cheese! It's all so good!", "business_id": "xfk9eY8gmwn8qsbyd-W6lQ", "stars": 5, "date": "2012-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UVkWC0B4DY5Y6Wgf6o4OzA", "review_id": "hUdfYKYo9HRmIkj7typenA", "text": "Seriously. This place is dirty and old. It made me lose my appetite, but I was in the door now and my stomach felt compelled to order. No one was inside when I came in at 530pm. Just the cashier and her creepy boyfriend. The cashier wasn't exactly friendly either. I just got the mac n cheese and shredded bbq chicken sandwhich and can't even eat it because of how utterly disgusting the place looked. You know how you can't eat someones homemade food because they look dirty and their kitchen is gross, well that's how I feel about this place. The cashier \"made the food\", there was no chef in the kitchen. I think what I ordered was just leftovers heated up. I used to go to the one in Central Phoenix all the time and loved it, but this one is filthy. I'm afraid to eat my food. And now my tummy is growling.", "business_id": "xfk9eY8gmwn8qsbyd-W6lQ", "stars": 1, "date": "2015-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "jhXZSe0pLgW1b6m6Te8Icw", "review_id": "_3ggc-4wKTqaGLaNQ3krWA", "text": "My fiance and I went to the Zoo lights during the Christmas Season. It actually was very nice - most animals were not out but the lights, environment, walk, music etc made it enjoyable. The trails were all lit up and there were even mini light shows at certain areas. The snack/food prices were pricey but hey - it's expected right? \n\nThis is a good night walk place with your \"other\" and the fact that it's at night (away from the 110 degree day temperature) - got me sold. Loved it.", "business_id": "1Ap6ZNCvyLLKHP0wvCk9yA", "stars": 4, "date": "2012-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Sdj97Asyp2P8MIP1etB6ug", "review_id": "35q_3_KUa0GUGICcjDwoHg", "text": "What a great zoo! There is plenty more to do here than just watch the animals. We have a toddler and going to the zoo is now an entirely new experience... the petting zoo, splash pads, and playgrounds. We even became members for $85 for 1 year plus 2 guest passes. This zoo can be enjoyed all year round!", "business_id": "1Ap6ZNCvyLLKHP0wvCk9yA", "stars": 5, "date": "2014-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "v51GWUUsD8CmC94QMllTsg", "review_id": "OkJ3L0PGhRHuS5duA4ypmQ", "text": "Just signed my last lease I'll ever have here. This will be year 3 living at Palazzo Townhomes.\n\nI'll start with the positives:\n- Garage! Very hard to find an apartment, town home, or even house with a garage in phoenix.\n- Fake wood floors\n- Fairly spacious, however there are multiple floor plans. \n- Kinda quiet at times, as long as the mariachi music from the guetto behind us isn't raging on the highest possible setting.\n- Close to the airport, eateries, and job locations. I actually love how close it is to places I go.\n\nFloorplan for where I'm staying:\n1st level is the garage. Very narrow stairs going up with 3 or 4 leagues on the right for pictures or nicknacks. There are like 20 steps! pffu that sucks with a large set of groceries. Anymore than one person in the entry way is way too crowded. 2nd level is the kitchen which divides the living room with a high long counter. The entire 2nd level is fake wood. Patio which fits 3 people comfortably, coming in single file is the only way. Another set of huge narrow stairs going up to the 3rd level. This level has the bathroom (basic one sink, toilet, and shower) also a little it bit closet with a mini 1 inch knob, washer and dryer located in its own closet? Has fold out doors, one shelf above. Also the water heater in its own closet, good luck storing anything in there. And finally the bedroom with the smallest possible walk in closet (ours came with broken shelves).\n\nNow let's talk about the negatives:\nThe biggest problem I have with this place is the management. If you read the negative reviews on yelp or Google almost all of them in my experience are honest and realistic as to what people have unfortunately gone through. Management has changed 3 times since I've been here. The ONLY person who was worth anything here was Alecia (not sure if I spelled that right) she was the manager who we originally signed our lease with. As much as I wish she were still here, good for her for finding a better job. \n\nThis place is a total joke. Denise replaced her, who yes was cold hearted. She is the rudest woman who has ever worked here other than the short haired lady named Emily. Neither of them gave a two cents about anything, not your mail (which they grunted to get for you every time, not to mentioned they lost my packages multiple times and lost my neighbors christmas presents for like 4 months they didn't get them till about April when their lease was fortunately up). I hated Denise and Emily. Trying to get rid of my first major ant problem was a complete nightmare! Clickers for the gate have to be directed right next to the code box, but the office people won't tell you that. The new manager Carlie has hasnt been here very long buts its the same story, noone knows anything about what's going on.\n\nThe pool is always closed because noone understands how to use the chemicals so it become an insect infested highlighter green mess! Yuck won't ever go in there! Gym has the basics, very small....there always seems to be a group a over confident guys blasting rap, slamming and cracking weights  (not to mention the gym mirrors, that's why there's a camera in there now-also the remote is always is sing for the tvs. There is a movie theater apparently that has never been open, haven't even seen it before. 24 hours maintenence lie. The maintenence men don't really know what they're doing and have barely any of there own tools. They ask to use ours. The dumpster is overflowing onto the surrounding areas all the time and many residents are lazy and leave leaking bags filled with who knows what all over the ground. They've even hired a special cleaner to come by and spray chemicals to clean off the copper stone near it because of how unsafe the left overs were that stained. A couple apartments were being finished when we first moved in from a recent fire that took place, probably was a good sign that we shouldn't have signed a lease here.\n\nIn all honesty if it weren't for the horrid management, this place could actually be luxury living. The place itself minus some of the cheap aspects is pretty great and has soo much potential. \n\nThe office staff has needed and still completely needs to go.\n\nI don't mean to offend anyone with this review however this is my personal opinion about my experience here, I'm sure there have been other people who have had a great experience, it was for me too in the beginning...things have clearly changed since then.", "business_id": "tbV2PnTuo7xo1O0RVFzhdg", "stars": 2, "date": "2015-06-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PMGq7FKtKQeIaUyUZnz1_w", "review_id": "jc0v0T2gXmvoG2gTHva8AQ", "text": "Like Taco Bell, but not as fancy. Thirty-nine cent tacos apparently don't provide enough income for decor.", "business_id": "_gXpjRIjb5fv5f5IVGXvsw", "stars": 2, "date": "2015-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2IiAxEvyFzNiAlWx0v6EMw", "review_id": "Z2STixvqtt432bs3kT_wog", "text": "Such nice docents and the museum itself is first class - a really fun activity if you are visiting Phoenix, especially for kids.", "business_id": "fKwCjTBOmwcbl4XtYRZToQ", "stars": 5, "date": "2014-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "9SZBVZ-mxebOVa1BlWFtWw", "review_id": "22R-qyeYKU1Zml1WSxdGzQ", "text": "I grew up living right around the corner from a Phoenix House. J and I went a few days before I had Baby C. Pizza was decent. Nothing like Streets or Grimaldi's, but better than Little Cesear's. Wings were average. \n\nAll in all, a good place to stop in for a quick slice for lunch.", "business_id": "ZAgPh4v-oOb1g6cdlkKI0g", "stars": 3, "date": "2012-08-03", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "bwmXfjwrogAaGqV33kSVpQ", "review_id": "0aa1MmR7KR0CtbgmRBRe1A", "text": "Phoenix has a large but scattered population. I'm not sure why developers picked this location for a Chinese Culture Center.  It doesn't make sense to me as the area around Dobson might seem more appropriate.\n\nThe center seems like it'd have potential if it gave incentive for small businesses to set up shop and stay.  I've heard the lunar festival held here charged admission and was dismal.  It's now not much more than a nearly-empty strip mall with \"Asian\" architecture.  I live up the street and would rather drive to Mesa/Chandler for anything Asian. Sad because I hoped Phoenix could do better.", "business_id": "PsuvqWNmLBU8ABkch2d9vA", "stars": 2, "date": "2013-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "kpAGBNgXaKir_jHGHvLCmQ", "review_id": "MGvbtDpIAcPbGoTA3k0SXA", "text": "If you have a Mercedes, you need to take it here! Being new in the area, I wasn't sure who to trust. I made the mistake of taking it to the dealer for an oil change and came out with a $300 bill. Seriously? It's oil and a filter. \n\nI tried this shop and found the owner worked at the dealership for 20 years before opening his own shop. Wow, nice people, and great service. He fixed what I needed and recommended a few things (the same things Firestore mentioned when I took it there for new tires and brakes, so I knew it wasn't an up sell.) I called around and M B Motors still had the lowest price. M B Motors fixed my car in a timely manner and showed me everything they did. \n\nTheir hours are early in the day 6:30 - 3:30 so it's convenient to drop off before work, but a little difficult to pick up. Nothing that would effect me taking my car there. Who wants to work on hot cars when it's 110 degrees out!\n\nI feel much better now that I have a place to take my Benz, especially being a single female and not knowing much about cars or what to do.", "business_id": "0Xnduj9w6aYHOtN_RlHUng", "stars": 5, "date": "2012-07-10", "type": "review"}
{"votes": {"funny": 6, "useful": 8, "cool": 6}, "user_id": "waD2euOMPTnTzQ0thq3H6Q", "review_id": "K9LGTnNKRrbvvpaUjsFmVw", "text": "If you like spicy food, this Sichuan spot has your name written all over it!  Known as one of the Four Great Traditions of Chinese cuisine, Sichuan food can be described as spicy, hot, fresh and fragrant. \n\nWhen you are seated, if you are white, they will give you the \"Whitey Menu\".  Politely ask for the \"Zhangguó cài dan\" or \"Chinese Menu\" and you will be presented with a nice, leather bound, menu filled with the best this place has to offer.  I have tasted about 9 dishes from this place and each one was excellent. \n\nA word of warning, their hottest dishes are the \"Water Boiled xxxxx\" dishes literally drowning in mouth-numbing Sichuan peppercorns and can be a challenge for even the most seasoned spicy food lovers.  I believe they have toned it down a bit (I was actually told this by a 10-year vetran of this spot) and the last time I had it, it was significantly less spicy, but still about a 9 - 10 on a 10pt spicy scale.  Previously it was essentially inedible to my Nordic tongue, this last time it was enjoyable.... so buyer beware.\n\nI was going to go 4 stars, actually about 4.5, but given the fact that there is not a better Sichuan spot in AZ, it gets 5 stars.  Go, eat, enjoy.", "business_id": "yQONzVpX-DEpGSuKMIov6A", "stars": 5, "date": "2009-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lS1yBzrxGoYY-k2auRMAMA", "review_id": "cY4-FFZqxY0HEdH8upgOuQ", "text": "I occasionally crave Chinese food, but we're in Phoenix...which isn't as culturally diverse as one my think. However! I've been to the Chinese Cultural Center (COFCO) for festivals and shopping.  Szechwan Palace is situation in the foremost corner of the Center.  One can dine in or take out.  Most of the patrons were Asian, which is a good indication that the place serves authentic food.  Don't come with high expectations though, this is not a posh place, by no means.  But the food is delicious! I was able to get a respectable glass of Riesling too.  Service is seriously lacking. The waitresses are in no rush to serve.  I waited over 10 minutes after I was seated for someone to take my drink order. I gave the order for drink and appetizer at the same time. The appetizer came out ten minutes before the drink finally came.  I thought to myself, \"this is going to be a loooong evening...\"  The good food justifies the long waits. ...I guess.", "business_id": "yQONzVpX-DEpGSuKMIov6A", "stars": 4, "date": "2014-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 5, "cool": 4}, "user_id": "MWt24-6bfv_OHLKhwMQ0Tw", "review_id": "oa9TyCJBLCC3NkRSE1NPIw", "text": "Canton Wong 3 has the best delivery Chinese food I have ever had.\n\nI have had the family bean curd, ma po tofu, egg fried rice, veggie chow mein and the veggie egg rolls.\n\nThey have never messed up my order, normally take about 45 minutes, and the drivers are always nice.\n\nThey take CC over the phone and they ask for your ID when you get there to make sure its your card. Good fraud protection :)\n\nThey leave you with coupons, and the food is already reasonably priced.\n\nOnly complaint is they are closed Monday and I think they close at 9, so if I want late night eats I have to go somewhere else.", "business_id": "9tefv6uPxoHhp_OlQQJVXA", "stars": 4, "date": "2008-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "bkR1tRtCi5ZG4qbdYM-LYg", "review_id": "jKBx3_aONFfeS3cj6d685w", "text": "Costco, I love you.\n\nMy family and I have been going to this Costco since it was \"Price Club\" --- whoa, that's a long time. At least 15 years. \n\nThe service here is consistently wonderful-- and what is even more amazing is that there are employees who are still there after all of this time. That tells you something.\n\nCostco is the best pharmacy around. So much cheaper than other pharmacies. They get my vote every time.\n\nBut today, I am giving a specific shout out to the two wireless kiosk phone guys. I had a couple of questions about my contract, which they answered. My phone had started to die while I talkd to them, and I asked if they had an extra charger that I could borrow while we spoke. Sure enough, they plugged it in, answered my questions and gave me some extra information. A+ for customer service on that one. My phone lasted just long enough to get me home. When I need an upgrade for my phone, I will DEFINITELY be coming back to visit them.\n\nPS: The Kirkland brand cranberry and macadamia nut cereal is delightful.", "business_id": "XLqnjlLYt0_q_NG7l_BpMA", "stars": 5, "date": "2013-08-26", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "1N-u1aavQN5hTUEPQOySyA", "review_id": "-kyn-riO7HA8hphkqYwpyQ", "text": "I have no idea why some of these people rate it so low. I discovered the Drummer about 6 weeks ago. It's clean, great food, & friendly people. The cook makes everything in front of you (If your sitting at the bar). Great drink specials, televisions everywhere, a juke box you can play from your phone (via an app), pool, darts, those stupid golf video games.....truthfully everything you want in a bar. Oh and if you go, get the wings and opt for them to be grilled too....holy smokes are they good. \n\nMy one beef with the place, is they don't have the Boxing/UFC events. Hopefully that changes soon.\n\nSigned,\nA Double D Regular :)", "business_id": "IgaruuknYwCr9afeDYQ_yw", "stars": 5, "date": "2014-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "_bdPHlLBNrjvk_hXcCZqcg", "review_id": "nNxy_am-R-QOFB3dzSPhnQ", "text": "Very nice family runs this place. I have been coming here for years and they have always been nice to me. They slice the meat instead of serving pre-measured. They know practically everyone that comes in.", "business_id": "_8Y-XNHmQ76xmxUQIrn0sA", "stars": 5, "date": "2015-07-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "rw1Xw8UKq4xq2Nk9aVvRfw", "review_id": "4XtmAwQbVRrkorfZR1FuwA", "text": "So came here for lunch with the BF since he never tried Applebee's. I haven't been to one in 2-3 years. I was reminded why I stop going, the menu sucks. Anyway we got our appetizer within 8 min then we got our food 10 min later. I got the new pineapple burger which was mostly just meat and bread could hardly taste anything other than that. And it was soooo small. My bf got the mushroom Swiss LUCKILY he saw a long hair strand stuck in the cheese before he took a bite! GROSSSS! We sat there 10 min before our waitress finally came back so we had to wait another 15 min so they can remake his burger that time I didn't want my burger so we just took them both to go. Took about 7-10 min to finally check out. Also I believe the manager past by us and didn't bother saying anything or ask us how we were, If I seen a couple one with food and the other without food I would of asked if they were okay but nope she just walked pass us but checking on other tables before and after us! Anyway what a waste of time and money. Never coming here again.", "business_id": "hzUOqxpcnYYBgLlrgvjQYQ", "stars": 1, "date": "2014-08-28", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "ef7eJrSr7chDjDth0-k2HQ", "review_id": "V6fCt95NQlrwiy0tA099lA", "text": "I was here the other evening for a meeting (which by the way was set up in the middle of the main dining room, instead of off to one of the side aka quieter areas..making it near impossible to hear anything) and I did not have any of the food, so I will refrain from commenting on what I did see...eh.\n\nI did; however, order a house margarita, and noticed on the menu that it came in two sizes.  I was not asked what size I wanted, just given the larger $2 more size... how clever.  I asked for it with no salt and it came with the most salt I have seen on a margarita EVER!  Ok, fine, whatever.. I wiped it off.. It came with two straws  (so you drink it faster. and order more..HA! I am on to your tricks... no thanks!)  As for the actual taste of the margarita....BLEH... blandest ever.. didn't even really taste like lime or sweet n sour, or the like.. it reminded me of these really gross margarita \"pouches\"  (think Capri Sun) that I bought once while in Cali on vacation... they were so gross that I ended up freezing the rest as ice packs for my cooler!  I am not sure if this margarita had much tequila in it either... so for my $8 I had a goblet of wasted calories....sad.\n\nThe service is another low point.. once our servers realized that only 4 of our party of 10 were eating (always a pisser, I speak from experience..but still people) they were pretty much imaginary for the rest of the night.. It took about 10 minutes after I was ready to leave for me to see one of the  servers, and he promptly told me that he couldn't get my check, but as soon as he saw the other server he would let her know.. 5 minutes later she made an appearance... sigh.\n\nI have heard not really great things about this place, and based on my experience I doubt I would go back to give the food a try.", "business_id": "jzPMl-NoB5F2fwoHX3hN8A", "stars": 2, "date": "2011-08-04", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "4MnVm1LWQ2ZXso4ORe_fZA", "review_id": "Bxil9GaRmU8eaXfp4LvhAw", "text": "I thought I didn't like Macayo's. Typically, I'm not a fan of chain restaurants, and because of the heavy Hispanic/Chicano population in the Southwest, we have a multitude of Mexican restaurants to choose from.\n\nBut it was good. I went with a group of friends recently. I monkey see-monkey do-'ed and ordered what my friend ordered. The cheese enchilada was tasty, and the beef tamale with baja sauce. Oh yes. Das ist gut. I mean, muy bien. \n\nI went again a little over a month ago with a dear friend during lunch, and it was even better than the last time. We were cozied in a booth in the back, with a darling older blonde lady as our waitress. She was chatty and pleasant. My friend ordered a margarita in one of the fancy mugs for him to take back to Utah. I ordered a conconutty margarita, which was mighty tasty with lots of coconut on the rim and in the drink, as well as a hefty chunk of pineapple inside, as well. Excellent!\n\nThe waitress was attentive but respected our space. The chips and salsa were uber fresh. They were so good, I could have come just for chips and salsa + a margarita. The food came very quickly, piping hot and the presentation was just so. Our lovely lady loaded us up with napkins (not gonna lie, I am a napkin hog), and we got to it. I ordered the tamale with baja sauce, and it was heavenly. We took our time to eat and sat in the booth with our food babies for awhile after we finished. The food was great and it was a nice experience. Looks like I need to chill on my chain restaurant snobbery, because I'll definitely be back.", "business_id": "jzPMl-NoB5F2fwoHX3hN8A", "stars": 4, "date": "2014-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0FtlTCPyKB4rjuM7mK02Kw", "review_id": "N-ZvMamJk1kug13CYTOEaA", "text": "I ordered a premium bouquet from them through TeleFlora. Was initially disappointed because it was not what I paid for. They replaced it with a super bouquet without hassles the next day. I was very pleased at their customer service.", "business_id": "72INqF4dYTHdCoUoePIuSw", "stars": 5, "date": "2014-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_nzzJAaD6ZEk1c7YzeYx4g", "review_id": "4kmaBGCNf3ZAF2uSHmrk7A", "text": "Awful service! Grease saturated food! Do yourself a favor and order across the street. The quality of food is that of a school cafeteria and they constantly get your food order wrong and upon asking for the correct order the 'manager' becomes extremely rude trying to avoid correcting the mistake. All I wanted was a simple breakfast and instead I left frustrated with no food and no refund...", "business_id": "I4L_MJOZsnux3xCU2bLP8Q", "stars": 1, "date": "2015-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2eC5ojclkRR3_f_xsNtWEA", "review_id": "xj01_706KcH2OKySVlchvg", "text": "Great custom bakery! We ordered a chocolate cake for a big birthday cake, with some tweaks to our specifications, and the results were delicious. We were served by Marina Padilla, who did a terrific job for us. Thanks, Marina!", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 5, "date": "2013-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mDzMELsP_F-MQJUSJiT2ww", "review_id": "9z6eRMK4v6WFcxTvJMiDyw", "text": "Good Broasted Chicken\n\nI went there because I wanted the broasted chicken. After I had been there a few minutes, the server finally brought me a menu, but it didn't have the broasted chicken in it. It took quite a while for me to get her attention to let her know that I needed that part of the menu. The chicken, when it came, was excellent. I also had a slice of pizza that wasn't bad. I would have thought that the manager (I assume) would have stepped in to speed up the service. All in all, I got what I went for even if the service was a little off.", "business_id": "JN2qXIuDXnV2d8WnSqd28A", "stars": 3, "date": "2015-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 3}, "user_id": "N1koTSTyiLCD8zH0rHSh4w", "review_id": "v9-4z_u63VqWWVAA38Lz7Q", "text": "very fresh, friendly, and fast. not much else to ask for in a sandwich shop.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 4, "date": "2008-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lfL5TwtLEysByWl-aHu3-w", "review_id": "k97Qz0O1myM15naVqpv5Bg", "text": "LOVE the mozzarella, tomato & basil sandwich!!! They use local vegetables and make the mozzarella and wood-fired focaccia at the location. Simplicity at it's best!\n\nDefinitely a local favorite!", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2010-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "rjsx6_pSqwl0zuiwa_tI2g", "review_id": "bfahqLnHt5t0J7r0p3LfaA", "text": "Once again I stumbled (well, actually a friend introduced me) onto a delightful establishment. My taste-buds are still quivering from the gastronomic pleasure of this weekend lunch. \n\nNot only was the food incredible, but the service was superb! And we got a little inside info - they shall be serving beer and wine soon - how soon? Maybe already.\n\nI plan on making this a stop on every trip I make into central Phoenix. It was unbelievably satisfying. \n\nP.S. Share the flour-less chocolate cake with your dining companions. It was a perfect ending to an absolutely perfect meal!", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 5, "date": "2012-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cdDVlatq0NxUNfnBLSwjCg", "review_id": "KJPIcXrJi4WCW18bfAjAWA", "text": "I came her for lunch with a co-worker. I was disappointed with the lack of options (I'm a picky eater). We both got the soppressata sandwich and a bowl of veggie soup. I LOVED the soup, who know I would actually eat cauliflower and like it? The sandwich was good, but I'd rather have a pizza- which they only do for dinner. I was able to score a bottle of olive oil so I can roast my veggies- awesome! If I'm around here I'll be back, but I won't go out of my way to eat here.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 3, "date": "2013-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rTpltf-1biQ83jhZvuj_Pw", "review_id": "WebCADwiRdwhIaBoPImVJQ", "text": "Make sure you ONLY speak ENGLISH at this restaurant or they will throw you out. Racism is alive and well here.", "business_id": "-AAig9FG0s8gYE4f8GfowQ", "stars": 1, "date": "2014-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "T5cxFv5ZU1vnT018KC9NPg", "review_id": "zvcXVTb7OaqRnH1uVPIKmA", "text": "The fish and chips is where it's at. The coleslaw is pretty much the best i have ever had. The shepherds pie is excellent as well. The best pub food in Phoenix by far.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 5, "date": "2007-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8KmHPVzyBW45_tXX8zU5mA", "review_id": "39sbDo6vxj-1_O0UIIpVRQ", "text": "Slay the Dragon! You can request a drink card with every type of beer available and if you try one of each, you get a free shirt, LOL! Me? I stuck to Guinness by the pint and had the Cornish pasty and sausage roll - both delectable but kind of small for the $6 price tag. It's a pub in every essence of the word - they have free darts (that's right, FREE!), a juke box filled with classic rock hits at 25 cents to a dollar per song, and 50 cent billiards! They also host World Series Poker tourneys! The service is super sweet (although they get REALLY busy sometimes) but the joint is really laid back and friendly!", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 4, "date": "2011-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YnbAEwnP_Oz6RX0LYFwyMw", "review_id": "9HYq0xQaGvKyPyr40lEvwg", "text": "A cool place to sit and have a few drinks and chat with friends, it's not too loud to have a conversation. The beer selection is good and the drinks are strong so I felt I got my money's worth if your into pubs it's a good place.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 4, "date": "2014-07-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S3UHNa8tV83AHhX9959ruA", "review_id": "P0weh4hHg4_38LgdTXKriA", "text": "A popular and busy pub on a Saturday night. A young crowd mostly men watching sports and drinking beer. However we were an older group there for the food. My fish and chiips was a generous but tasteless plate of heavily battered fish and chips. Would not recommend the food.", "business_id": "3xEB9FyFXolq1b_Qn_BFtg", "stars": 3, "date": "2015-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4ZaWYcNb1dZsFwgj2ri78g", "review_id": "NcPn0I1GFUhr-93YCAxezA", "text": "Today I received a new style and cut at Salon Estique.  I love it!  When I was done, I told my stylist that I also needed to change my look to match the new style.  She referred me to Makeup artist /Aesthetician Sarina Pruitt.  Not only did I get exactly what I wanted but Sarina also showed me how to achieve the look in 15 minutes when I do it my self.  I wanted something natural so I could wear it everyday to work.  The eye shadow, blush and lip gloss was so natural and beautiful that when I went shopping after ward a stranger said I was glowing.  She asked me what kind of makeup I was wearing.  I told her I just had it done at Salon Estique by Sarina.  I suggested she call and make an appointment and told she would not be disappointed  because I sure wasn't!", "business_id": "VAHiEHdVPlG2DVG3YO6C7A", "stars": 5, "date": "2015-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "y5_vrqIylhXMrejM_-x_vA", "review_id": "DVetN53GgYdq6jR4sYfQDw", "text": "A friend brought me here to try bikram for the first time. The studio is a good size....but then again what do I know in terms of yoga studios? The dressing room is cute, a couple bathrooms. The yoga room was a little stinky but what do you expect for hot yoga? Everyone's sweating their ass off in there, it's going to be a little stinky. \nI attended two classes, both instructors were great, and seemed enthusiastic about teaching. They made newbies feel welcomed but not singled-out which is very important. \nIt was cool! Got me interested, enjoyed trying something new!", "business_id": "5EyT-ZbhJR6LwtVaPyE3bg", "stars": 4, "date": "2011-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "o9qVoftkxrFwC6W5PImouw", "review_id": "CbsoDPZxW9we6AzUQrWbfA", "text": "5 stars to you, Gentlemen. Like many bike shops, these guys love to talk all things bike. Nice group, lots of good natured banter making even a new transplant to the area feel welcome (especially after some douchebag fixie hipster a**hole stole my handlebars last week. yes, my /handlebars/ honestly, who does that? next teenager i see with an emo haircut, skinny jeans walking around my apartment with an allen key and wire cutters is getting a serious beat-down).\n\nBut I digress. They hooked me up, always looking for ways to save me a few bucks and I appreciate the personal service and attention to details.\n\nShop here.", "business_id": "42Ai9wcFPE2HZ_aADGXI9Q", "stars": 5, "date": "2009-08-29", "type": "review"}
{"votes": {"funny": 9, "useful": 4, "cool": 4}, "user_id": "o1HQEND6cg-4SK0Z1ASBMQ", "review_id": "oPEQvngyPNrF8D840E3OoQ", "text": "I had high hopes for The Eggery. \n\nNot because I thought it had potential or was even that hungry.\n\nFor me, the notion of an egg-themed restaurant sounded like the result of  insanity. The kind of mad science you see in comic books and Discovery Channel shows about hunting ghosts. \n\nMy brain had conceived this idea of an egg-obsessed madman, ceaselessly forging egg-based delights so that he may share his much-too-specific love of eggs with the world.\n\nUnfortunately for me and my imagination, The Eggery is not insane like Bizarro or Dr. Weird. \n\nNo, it's a \"Kevin Costner movie\" kind of crazy.\n\nThe menus look like they haven't been changed or updated since the 80's. Which would normally be refreshingly retro, except the 80's weren't necessarily a good decade for eggs. Come to think of it, I don't think eggs and time travel are compatible. \n\nThe omelettes look more like accidents than exquisitely prepared dishes. \n\n\"You got chopped up ingredients in my eggs!\"\n\"You got eggs in my chopped up ingredients!\"\n\"...are you thinking what I'm thinking?\"\n\nThe Eggs Benedict looks like it's mocking you. \n\n\"Hahaha, you could've gotten this same dish at Hometown Buffet, and it would've tasted better, too!\"\n\nThe Eggery has no means of separating their pancakes from their competitors so they just make them bigger. \n\nIf you can help it, avoid ordering the sausage.\n\nIn fact, if it's not made of eggs, don't bother. They won't make it right.\n\nYour sausage will be overcooked, your hashbrowns will be burnt, and your coffee will taste like they used the toilet water. And the carafe of coffee they give you is usually only half-filled.\n\nAnd don't bother complaining to the manager. After all, he's probably the genius who assembled this crack team of apathetic, inattentive doppelgangers posing as a wait staff. Dude probably doesn't even know what eggs Benedict is supposed to look like.\n\nFuck this. I'm going to Denny's.", "business_id": "SkNUbFJiJtbZjY-S_S0u7g", "stars": 2, "date": "2008-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DD04nMRVg0fBGHCX3uCLwA", "review_id": "O-_0Go1yuBDOOfclcQJ8Sg", "text": "I love this location, very clean, helpful staff.", "business_id": "HfWkdqxegjiGEXzI8j7Wwg", "stars": 4, "date": "2013-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "itWDC1MoquLplv0uIn36xQ", "review_id": "Z0djI43ioC2NAE5WH9vNbw", "text": "I chipped my front tooth!!\n\nGoogled \"Phoenix dentist.\" Had a consultation at a different dentist office, very uncomfortable.\n\nWent to Dr.Bracken, on a referral, and could not of been happier.the person who referred me has been going to Dr.Bracken since she was 6 and she is now........well, older.\n\nThe office is nothing fancy but very welcoming. I have been told that the front desk ladies are the doctor's  sisters. i was also told not to be late for them..\n\nMy appointment was at 845 and I was back in the chair at 835. As the dentist was informing me of what he recommened for my teeth he was also flossing my teeth!\n\nWent in the next day. Tooth fixed, looks just like the neighboring teeth, and was very affordable.\n\nGive Dr Bracken a chance and you will not regret it.", "business_id": "2BcNZqbEY9x3F2hcs5GUhg", "stars": 5, "date": "2013-06-26", "type": "review"}
{"votes": {"funny": 33, "useful": 16, "cool": 19}, "user_id": "C8ZTiwa7qWoPSMIivTeSfw", "review_id": "ZshAz0vrOJ5rHqgd5KeGXQ", "text": "OK people. Let's face it. If it was called Cleveland Market, nobody would go. But throw in a trendy city's name and \"Oh, it must be fantastic.\" After all Boston does have the Celtics. And they gave us Kristin and Jared. But can they pull off fast food. Yea, kinda sorta. It's nice to have a fast food option that is a \"square meal.\" No burgers or fries. Roasted chicken, that holiday green bean casserole everyone loves but is too afraid to admit they eat it, mashed taters (gravy sucks ass though)...all pretty descent. We even tried the sirloin there, cooked medium rare, but WOW, it was like $12! So, I'm sure it's not even a Boston based company. And we all know it's nothing like a market. But three stars for dependable, un-bunned food! Oh. The cornbread? Seriously, it's \"crack\" good. I'd knock over school children just to get an extra one. As they say in Boston, \"cheers.\" I know. Lame. Now, go get some cornbread!", "business_id": "cIwMq5KNq0ASQzoTP1dE9Q", "stars": 3, "date": "2008-07-08", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "aTlHCohiT4ggRcMl3RQlXQ", "review_id": "7yywzuMwfsNVDq174N5L6w", "text": "Good for a cheap date. Food is okay, service is good!", "business_id": "cjUmPLRT43wN9Z87A9BOpg", "stars": 3, "date": "2011-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "30_Nxu14gBrYlz-WsxKUsA", "review_id": "RPm4oeLkcKa5USrmUoeesw", "text": "I usually looooove this Applebee's. I'm a regular usually here at least twice a month. Tonight though, ughhhhhhhh-nnoying, our server, Alex was so incredibly inattentive. It took very long to have drinks ordered after being sat. Then I didn't get to start my meal for exactly 1 hour and 2 minutes (I timed it). Also, the water glasses tasted awful and due to how we were NEVER given attention to for over 40 minutes, they stayed at our table until we finally said something. To top it off refills were NEVER offered until after our food came.Even when the food came we were never asked the infamous \"how is everything, ladies.\" Thankfully, Neill Courtney (The Manager) came and explained the entire situation and deducted our bill. Absolutely amazing service on his part.", "business_id": "cjUmPLRT43wN9Z87A9BOpg", "stars": 2, "date": "2015-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Ia9D08hVd-RlqN1-wBo_Lg", "review_id": "kiU8gs7-_b6EXqPL8DpAYw", "text": "I just stopped in and got the Manhattan special to go. It was piled high with Boars Head Pastrami served nice and hot. It was fantastic.\n\nThis place reminds me of the east coast mom and pop delis I grew up with. It has a huge selection of sandwiches and subs so there's definitely something for everybody. I'll go out of my way for a sandwich here. Definitely gonna be my regular spot for a quick delicious sandwich.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 5, "date": "2015-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S9KDHWSoUGG3z4j1cTMoFA", "review_id": "dltK-dw9384vAtzNp5NO_A", "text": "I found this place quite by accident, my friend was looking for a Chili's where we could meet for lunch.  She gave me this address and I was delighted  to find China Chili instead of one of the run-of-the-mill, not even Mexican food Chili's.  \n\nI ordered the House Chicken and was given the choice of spicy or not.  I opted for spicy, it was delicious. \n\nSo many people have complained about the decor, it was simple and to be honest I did not notice what, if anything, they had hanging on the walls, and I really don't care!  I'm there to eat and enjoy the company of my friends.  The food was great, the service was good considering how busy it was for lunch and the prices were reasonable.\n\nI've recently relocated to Phoenix from the east coast and where I came from there was one decent Chinese restaurant in a 50 mile radius.  China Chili is better than the best my town had to offer.", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 4, "date": "2010-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jWvzAN1czxypi-GM1KY62g", "review_id": "dhswPtqUr_rSliDQXVLofA", "text": "China Chili, is quite possibly, one of the best Chinese food resteraunts you'll find in Phoenix.  I've been to a couple of places in the Chinese Cultural Center Plaza (the closest thing to a \"China-town\" you'll find in Phoenix),  but I still am drawn to China Chili.  \n\nThere service is fabulous and the food consistent.   We started our meal with a Chinese beer and appetizers (potstickers, and Veggie-rolls).   The orange-chicken meal was fabulous and all the servings are for two, possibly three people (i.e. easily shared).  I also tried the Sweet and Sour Chicken....so tender and yummy.\n\nWe never feel rushed or packed in.  We were there on a Friday night and there was a steady stream of customers, but the service or experience did not suffer.  \n\nHighly recommend.", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 4, "date": "2012-07-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tGSBO4GQF4XcYiGbfaVmBQ", "review_id": "iDakbUT_OSIjXBY_jvrKrA", "text": "Comida China chingona. Came in here on Friday night, busy night. Wait staff was friendly,  environment was nice, delicious food. Even though they were busy they were friendly and fast, only thing is I couldn't understand anything they say. Order the orange chicken- best orange chicken outside of China.  Don't mind the older gay crowd, they like comida China chingona too.", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 5, "date": "2014-07-18", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "uCfdp7AH45qanhjzWhYZsw", "review_id": "CxNfBqgnIHABKwAvEwXYrg", "text": "China Chili is my local go-to Chinese lunch special by work place. The lunch specials are very reasonably priced and they give you huge portions and extras like comped soup and a spring roll. The service is efficient and incredibly fast. The food itself is decent- nothing to get super excited about but good enough to fill you up without being super disappointing. It is best to come here for lunch rather than dinner because they do so much volume at lunch that the food is always freshly made by the time it gets to your table.", "business_id": "-3WVw1TNQbPBzaKCaQQ1AQ", "stars": 3, "date": "2015-08-20", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 2}, "user_id": "4sIK_74UwkKU9YQXIfgCdg", "review_id": "hg0dm-Q5dvM9eyReZn-hjw", "text": "I don't play the guitar but I always had hear about Ziggie's. so one day I just stopped in.    I appreciated the owner not treating me like I had an eye in the center of my forehead when I told her the same.  I ended up stay for a half hour or more and just chatting.  I watched how she interacted with people who came in and knew what they wanted done.  Overall it was was really positive considering I didn't understand half of what they were talking about.\n\nZiggie's reminds me of the stores I use to go to where things were personal.  You got to know the owner so when you went in, you weren't a stranger.  If you play the guitar or a stringed instrument, it is really worth your time to check this store out, I believe.\n\n4 stars instead of five because my whole review is based on just a feeling I got about the store.  if I was a guitar person, I believe it would easily be a 5.", "business_id": "4Z4_92Lr5E58c9-3L3idhw", "stars": 4, "date": "2015-08-05", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "WtHx2gPVQPbacy_HGW2n_Q", "review_id": "8zDF4Z9c8NBUaihBPaZ5qg", "text": "Giving Hanratty's 5 stars as a 'dive bar,' even though its a huge step above as far as we're concerned. The service is top notch - Megan and Terry are excellent bartenders by any standard. Unlike the typical 'dive,' this place is always clean - especially the bathrooms. \n\nWe spend a bit of time here each week ;) and the service never waivers. Love the pool tables and darts, and there are several TVs and plenty of adult video games. It's also a great place to just sit and have drinks, and whether you're a couple, just a few friends hanging out or a group, you can't go wrong. It's the kind of place where you can hang out and be yourself in a relaxed atmosphere, which is why we love it.", "business_id": "VC0VbRhQqvXpolK3pFuZPw", "stars": 5, "date": "2013-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1PWFPOmqvLx3sGKuuKQr9Q", "review_id": "MCe0pSf3A7z2nllP01MNFQ", "text": "Super friendly, brightly lit, great atmosphere.  These people have EVERYTHING.\n\nThis store is loaded with sheet music and song books, and you can get your guitar strings/picks/instrument cables here, as well as a selection of neat straps, metronomes, capos, etc.  They also have a lot of unusual percussion items and other instruments here.  And if they don't have it, they will order it for you.  Just ask.  They can find it.\n\nIf it's musical, and I can buy it here, I would rather come here than anyplace else because just walking in is a pleasant experience.", "business_id": "sS0CSU89WwFtOiARbckgbQ", "stars": 5, "date": "2010-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qeljTFFJaZE-HJ6RKx0iFg", "review_id": "BRnGbXAdHqir_4yayW283g", "text": "I've stopped through this DQ throughout the years when I craved an Oreo Blizzard or the double cheeseburger meal. The thing I would say is that this location has never gotten my order wrong. And if you know fast food joints, you know that almost NEVER happens. \n\nI would also note that despite the fact that they can sometimes be a bit slow at this location, they always have given me fresh and hot food. Nothing ever feels like it has been sitting. Even the fries are always piping hot. \n\nAs far as the location goes I would say that the drive thru is cramped and coming out on to Central Ave to Missouri Road headed northbound can be a major challenge. Sometimes I've had to go through the neighborhood to get to the next light because northbound AND southbound Central Avenue can be hectic during the day (and even at night). \n\nOne final note, the employees always are young. Which means they aren't perfect. However, they are ALWAYS friendly and get my order right. And that's what I judge them on. \n\nBravo teen DQ kids, OWN that summer job! Lol", "business_id": "zZmhEpiVpRfFQid87-pcOQ", "stars": 4, "date": "2014-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eRtjFnsx7yj3s8kd2Jdjew", "review_id": "ryzMFRiUUcnIUNgVH1t_sw", "text": "I've only eaten here once and once is enough. I ordered a tuna on multigrain, which wasn't very \"multi\" (they were out of sourdough). The sandwich I received was a mess. The tuna was bland, just globbed on the bread, not spread out and topped with shredded lettuce. It's not a taco ya know!?!  It came with a pickle and I could of gotten tomato also. And all that for $5.50 (with chips and a vitamin water almost $10). The food was awful and the price outrageous for what you get. Worst excuse for a deli I've ever been to. Don't waste your time here. Your better off going to the mall across the street, or even starving!", "business_id": "OCmmPs_5NBt65ZY7OuG-lA", "stars": 1, "date": "2015-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "hebAltnR9VqynQs_VWXBrg", "review_id": "Vo6I7JYOxKUcLjwXzEy2FQ", "text": "Very reasonable and very fast. I run a shoe store and have taken some customer repairs to them. Always friendly!", "business_id": "_kpUIXl923FQS3eghdb8Cw", "stars": 5, "date": "2013-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "2KyJLMY3jmASmwtnmlBuvw", "review_id": "tCMaXodLZ-CG_GlFxJq48A", "text": "Their slogan says it all:  The Best Little Brewhouse in the West!  Terrif food!  Great service! Reasonable prices.  Nice combination.\n\nBeer is brewed on-site. It's on-draft, & they *even* have DRAFT RootBeer!  [YUM!]\n\nBTW, if you can't get 2 meals out of their Kobe beef burger, metinks you're eatin' too much!   :-)\n\nOnce, when the soup-of-the-day was lentil (I love lentils) in a tomato broth, it was so good, I had to order another bowl to take home (it was great right outta the refrig!", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 5, "date": "2007-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "--65q1FpAL_UQtVZ2PTGew", "review_id": "zHQ00iEVHWhJyOSpYI-BfQ", "text": "I'm a big fan of local craft beer and I'm happy to live within walking distance of this little place. Most of their beers are alright, but they have some serious winners on deck if you enjoy hoppy ales. Their seasonal selection is also almost always stellar. At the point in time I am writing this review, they have a high-strength ale called Risky Red. It is fantastic! There is a limit of two per visit due to its high alcohol content (9.7% I believe) but two could put some folks on their asses, I'm sure.  \n\nFood is alright most of the time, and if you hit up their happy hour (which runs 3-6 and all day Sunday), you can get some decent bar food for cheap. Not only that, but you get $1 off all of the beer! So Sundays you can probably find me here enjoying a day drink. \n\nIf you're in the area and want a drink, or if you want to pre-game before a long night at Rosie's, this may be the place for you. Go ahead and try it, and hopefully you can get a taste of the Risky Red while it lasts.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2010-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "X5GbNXY_nNoa_vTZDD0aCA", "review_id": "UhC-TP921dJE-ZGRpK1FJA", "text": "Lets start w/ this: this place comes up on you quickly. If youre not actively looking for it, you may miss it. And when Camelback is busy, itll be a chore trying to get back to it.\n\nThis place is not as tiny as you think, it has different rooms. Ive been by the door near the 1st bar and all the way at the back bar across the patio. The staff is great,we've never had bad service here, and its usually very busy.\n\nThe food here is good, not as good as some other breweries that serve food, but also definitely not like your average bar food.\n\nThe beers here, I dont so much enjoy. The Vanilla stout was good, but everything else was kind of bland. I should mention that we got samplers the 1st time we came as to try everything, They did, however, brew a special cherry beer for the AZ Girls Pint Out group that was awesome. Seriously, if you ever see that they have Cherry Buzz on tap, get it.\n\nI wont be coming here again, but I encourage those who like craft beer to check it out. You may find something you like.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 3, "date": "2013-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5CF0df3qlgZgxEBK48DlyA", "review_id": "wGSIBxJpiPRWc0qwcxj_ow", "text": "Ignore the 'wait to be seated' sign and grab a table or head to the outside patio. Love love this place. If you come in fairly often (1-2 times a month like me) they remember your meal and drink preferences.   Service is always spot on and I've never had a bad meal here. Wish they'd bring back the salmon Reuben though. That was my addiction!!", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 5, "date": "2015-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0CDKPyRcun_V9UFJhUxZcQ", "review_id": "kgEfQwEeIQbKvIbs612SzA", "text": "I've been getting my glasses for over 6 years from here and it's such a nice change from big chains. The staff really care about their customers being happy with their choices and they go out of their way to make sure they are satisfied! Patient and helpful, they spend the time to help you make a wise choice.", "business_id": "c8JCwGEj6WMDEpb1Tqp_cg", "stars": 5, "date": "2014-08-31", "type": "review"}
{"votes": {"funny": 3, "useful": 7, "cool": 4}, "user_id": "lhvFynuv5pyc4XdFNebqGg", "review_id": "jucupc0GDso28bouhl4cOQ", "text": "This is a wonderful church in central Phoenix.  Pastor Dan Yeary is so kind and caring and has a story telling type of preaching so it's easy to understand.  It is Biblically based.  Even though, it's a large church there is something for everyone and every age.  There are so many small group Bible studies available.  People are friendly and they even have greeters in purple vests in the parking lot to assist you.  Sunday Bible studies are at 9 am and church begins at 10:30 in the main sanctuary.  All are welcome!", "business_id": "A0EZxGt3hm4mo2bTjCzJ7g", "stars": 5, "date": "2007-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QA0QYsUHyNkL8GyUOiVEAQ", "review_id": "shFvFyneLsmPwd20p06cPQ", "text": "Five stars.. Love this place! A great neighborhood gem that my sister introduced me to. They give the best foot massages, do a great job polishing, & are all so sweet and accommodating! Check it out.", "business_id": "f9WABGuw1OBfO_lw5HFiJw", "stars": 5, "date": "2014-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YVRFQrclz1Z6Qei_eAuubg", "review_id": "1k0RqC-tEE8dNtziMk8GCA", "text": "I just visited this place to have a drink with my boyfriend and it was horrible! I would give it 0 stars if I could. We sat ignored for over 30 min and had to flag down a very very rude waitress. Took another 30 min to get drinks. Girls were ok and that's being very nice. I would never go back and spend money here", "business_id": "wnOQw4nazfglLxwLogTlng", "stars": 1, "date": "2015-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XDVABSG5JRXry3Dm45vnyA", "review_id": "d052XkQ3lzIpsvqIVeQ99w", "text": "Superior to taco shops and even less expensive.", "business_id": "DeAnVirgOxQnI36V1W158A", "stars": 4, "date": "2011-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "c3v2KY4B8ak_HuKN2ywfzQ", "review_id": "45YnpXzXtj-OizwClOfMzg", "text": "One of the best Mexican places in Phoenix. Family run, authentic, cheap and delicious.", "business_id": "DeAnVirgOxQnI36V1W158A", "stars": 5, "date": "2015-08-19", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "NFBQGT-YmMCHvTSIEyX_1g", "review_id": "5-x8FfXhyprT79aGfp_dFg", "text": "I used to go here all the time for lunch to get their mini deep dish pizzas that are limited in supply and you better get there early because they go quick...because they are sooo good and they can feed two people almost.  But went there with the family last night and  you know how it can be kinda difficult to satisfy 4 people with the same pizza?  So we often do half and half to make everybody happy...and we've never ran into this situation, they wanted to charge as if the whole pizza had all the toppings...meaning if you get 3 toppings on one side and 3 different toppings on the other side, you better be prepared to pay for a 6 topping pizza...about $8 extra.  So they are off the 'family friendly' list for me.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 2, "date": "2010-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0PGDayleMFEr_AjeqV16bQ", "review_id": "u0TemrC0hcmr7UVwF6TjYA", "text": "Customer service ..food everything about this place is good had the stuffed pizza ..also for dessert i recomend the pizza cookie ..if you try it you will want to go back!", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 5, "date": "2012-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uX0ojmRbNTY0zA5avnW21g", "review_id": "rySMtxT38Bdl2pcloT-yNQ", "text": "I realize I'm one of the many 5 star reviews, but my experience was with their takeout service. Couldn't have been more friendly. The food was as good as ever and it was ready right on time. Love oreganos and the people that work there.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 5, "date": "2013-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "lS1yBzrxGoYY-k2auRMAMA", "review_id": "h1zsW3U7TvqKiMqlWxZGqw", "text": "I love Oregano's! The portions are so big and always delicious. \n\nI've been to this location a number of times and the service is always on point. Great staff! All of them that comes in contact with you says hello or welcomes you to Oregano's.\n\nNice, relaxing ambience; with indoor and outdoor seating.", "business_id": "ML1RJdeZ7bbfMrHvJ7m99A", "stars": 5, "date": "2015-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Zb4A8XuoSqnGyI-GZOz4hA", "review_id": "OcLsc24NQHZhlz_R_U1XNg", "text": "I have shopped at this Ace location a number of times.  The staff that work in aisles are terrific.  They are kind, friendly, and exceptionally helpful.  Then when it is time to check out the staff working there are arrogant, impolite, and kind of rude.  Call me old fashioned, but I believe that I should be thanked for spending my money at any business.  They apparently do not believe in that at this location as they never say thank you.  I will limit my visits to this location to a minimal number from now on.   There are many hardware stores in the area who do appreciate my business that I will patronize.", "business_id": "-PisznY2s13FyX3tASY4aA", "stars": 1, "date": "2015-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 5}, "user_id": "ApOSzkrrEza21WGcgLXkxQ", "review_id": "0i50QQFr7W0B37V02NyQRA", "text": "My husband & I are addicted to Cherryblossom's ramen. Mr. T is Japanese & I lived in Japan for @4 years, so take my word it's authentic.\n\nThe mix of foods is not so strange if you're familiar with restaurants in Japan. The ramen is Hakata style, made with a pork broth & may be heavy/oily for some people, so why not please everybody? Be sure to ask for \"Cha Shu Ramen\" to get a few more pieces of pork. (extra $)\n\nThe salads are also fantastic; warm lightly fried (10?)Shrimp on a fresh spring mix base with mango dressing,  Shanghai Duck salad, and the Chicken Caesar was perfect, not heavily dressed like some \"roadhouses.\" \n\nMr. T & our daughter loved the Eggplant in Miso Sauce, & even the California Roll was good.\n\nIt's said Japan took the best of each country's cuisine. So there are French pastries, German beer, Italian pasta, and Indian curries. Save the banana bread for dessert if you can, or get one of their pastries. I've never have enough room.\n\nIf you like good WHITE bread, buy one of the Pullman loaves on the table by the front door. My first extra 20 pounds in Japan came from the good bread! (No whole grain breads were available 30 years ago!)\n\nI think it's too small for groups over six.\n\nMaybe we'll see you there.\n\nAdded 11/18/07\nI think that their menus are not all alike, so if  ramen isn't on the menu you receive, you can still order it. (It's posted in Japanese on the wall.) For the basic, ask for \"Hakata Ramen.\" For extra pork, ask for \"Cha-shu-men\" or \"Cha-shu-ramen.\"\nEither way, there's really not much pork in it. That's why you need a delicious shrimp or duck salad.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2007-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "_LEQt7oTVjiaXyVHK_MM7g", "review_id": "6YUyz_87bLUi4MWTZ9sA1Q", "text": "I think enough has been said about Cherry Blossom so I'm going use this review to pledge my love for Zaru Soba.\nWhen I was 18 I spent nearly a month in Japan in the Sister City exchange program. It was during the summer and my host mother would always make cold noodles with dipping sauce, a very popular dish during the humid summer months. I nearly fell out of my chair when I first tried the Zaru Soba at Cherry Blossom, I was instantly transported back to my incredible time in Japan. \nCold buckwheat noodles, a light soy-based dipping sauce and a little fried panko fish on the side, the perfect dish for when it's hot as sin outside. A little banana bread to start doesn't hurt either!\nSay what you will about the service, I often only go at lunchtime when there aren't that many people but I have found the service to be unintrusive and very polite. \nNow if only I could find a place in Phoenix that serves Japanese pancakes....", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 5, "date": "2009-07-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "ZiSL-0G_x7fclCHAQjra4A", "review_id": "XQqvGziKWMC8k-KhysMMOQ", "text": "We saw great reviews on Yelp and decided to try this place out. It looked a little iffy with its strip mall location but we decided to throw caution to the wind. \n\nAfter sitting down our drink order was promptly taken and filled. After waiting a while (a bit too long), our order was taken. While we were exact in our order, the waiter fumbled and made mistake. We called the mistake to the waiter's attention and he said that this would be taken off the bill. It was not. \n\nThe sushi was C grade. Passable but not anything I would return for. \n\nOur order came with a green salad that resembled bagged salad. The miso soup had iceberg lettuce in it. Quite surprising and added nothing spectacular to the dish. \n\nMy ramen was poorly executed, with undercooked noodles and only a few pieces of meat floating in it. I was really disappointed as I have had really great ramen at a handful of other restaurants around the country. I was looking forward to this japanese staple, but sadly left most of it in my bowl. \n\nI find it odd that this restaurant serves both italian and japanese food, Maybe if they focused on one type of food the flavor and presentation would improve. \n\nWe will not be returning.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 2, "date": "2011-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "NxnbYuW6vbemy3PJIDnQLA", "review_id": "ZD9rO9ZFFvg5zx-e83Suzw", "text": "This was a bit of a disappointment. Sushi rice was way too sweet, and the pasta was overcooked. Overall food was ok but worse than I had expected given the 4 star rating and seemingly authentic menu.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 3, "date": "2012-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Pk2eZjSvgKoXGXzu2rrbsA", "review_id": "j8ZaaGuUhDijTDPD-UCw6A", "text": "You have got to be kidding me...absolutely unable to eat any of the four dishes ordered for lunch today. I read the below reviews and wondered if I was in the same place...mumbles the waiter couldn't have been less help if he had stayed home today.\nThe broth was flavorless, the noodles like a pile of jelly. The fried pork was so over cooked I couldn't chew it. The cold noodles were indeed cold, as they tasted like they were cooked 3 days ago and stored in the fridge. And the miso soup? Me so wished it was good, as I was starving when I left.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 1, "date": "2013-07-16", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "rxyZ2tWhKWIx2CEMs5H1Ow", "review_id": "753GNXMmlh7VXfZfvedxuQ", "text": "Yum Yum Yummmm! \n\nAfter seeing their prices and ratings online, my husband and I knew we had to check this place out. Aside from the just really terrible hostess situation, it was a great experience.\n\nThe hostess situation was almost a laugh because it was just ridiculous. We walked in at 8, two hours before close, and one hostess was hunched over the counter doodling. She barely looked up at us, then looked over to her partner, who also barely looked at us and did not say a word. She grabbed two menus and motioned for us to sit down at the closest table, which happened to be sandwiched in the corner of two other populated tables. This is awkward for everyone, since the rest of the place was empty and we had to do that weird \"scoot around each other\" move any time someone wanted to adjust their chair. The silence of both hostesses was the most unnerving, though. \n\nWhatevs, the food was great and our server was great and our bill was cheap! We got the sushi combo with a spicy tuna and an Alaskan, and even though I omit avocado due to an allergy the rolls were a good size. We also got the chicken pad thai and took home leftovers. All was well, and we will surely be back.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 4, "date": "2014-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WBZXNbaf1hmID5VgGAIX0g", "review_id": "hW5Szm7Kmm2YiyJ_zQ52Kg", "text": "The restaurant features a menu as eclectic as its directionless, yet somehow a bit charming, decor (picture a British phone booth facing a red-brickwalled hallway and Japanese elements mixed in throughout); it's a blend of Italian and Asian pasta dishes, from which I've only ventured through the Asian portion of the menu.  \n\nThe Asian noodles here can be outstanding and the selection is one of the best in central Phoenix, but there's not much more reason to come here.  My favorite is the beef udon suki, with chewy, thick noodles and lots of beef and flavor. The ramen dishes are passable, although not the best in the Valley (noodles are a little too thin and a bit overcooked, broth is a bit lacking in flavor, although still robust and meaty enough to be pleasant).  Skip the tantan-men, which is billed as a spicy soup and tastes like little more than that:  spice in soup.  As for rice dishes, the katsu is decent, but avoid most of the appetizers:  shrimp shumai were mushy and flavorless, the Korean spicy rib lacked the spice, richness, and tenderness you'd want from a dish with that title, and the gyoza are less than noteworthy.\n\nThe lunch special is another great reason to come here:  for under $10, you can get a filling combination, like your choice of noodle soup with inari or a California roll.  Although the sushi isn't a reason to visit Cherryblossom and the California roll isn't something I'd jump at ordering even at my favorite sushi joint, it's a great deal.  And when you're really there for the noodles anyway, how can you beat that?", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 3, "date": "2014-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "mDzMELsP_F-MQJUSJiT2ww", "review_id": "ptl2kFnjRYzrCn-vqVyxzA", "text": "Great Steamed Shrimp Dumplings!!! Great Service\n\nWhen I arrived I was immediately seated. Kenny, my server, took care of me right away and was helpful and attentive throughout my meal, making sure of the quality of what I was served.\n\nI LOVED the Shrimp Shumai (steamed shrimp dumplings). They were light and flavorful and served on top of a swirl of spicy Chinese mustard. \n\n I wasn't so crazy about the texture of the Ramen noodles (seemed more like rice noodles), but that aside, my Cha-shu (Hakata with extra pork) was very tasty, and a generous portion. \n\nI ordered the Korean Spicy Beef to go and it was delicious warmed for dinner later in the evening. It was mildly spicy and nicely seasoned. \n\nOverall, I had a great experience. I'll be going back again, but skipping the ramen noodles next time. The prices seemed reasonable for the quality and quantity of the food.", "business_id": "AkOruz5CrCxUmXe1p_WoRg", "stars": 4, "date": "2015-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "N1koTSTyiLCD8zH0rHSh4w", "review_id": "uZjBn8mbea-t8VlmcRwirw", "text": "I had been researching getting a new DSLR for months for shooting video and pretty much knew that the Canon 60D was what I wanted. Went to Foto Forum to see how prices were and was surprised to find that they were selling the 60D for $100 less than BH and Amazon. Also Greg the salesman took an hour to talk with me about various cameras and lenses. He has decades of photography experience and was great at giving me feedback on what I was reading online.\nI bought the 60D with the 18-135 kit lens and a number of other items that will help me get started with getting serious about taking pictures and video. I hope they are around for years to come.", "business_id": "VilxIfmahfOhMcIaGK8Www", "stars": 5, "date": "2011-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "7pJePwn8indandJlTnSkiA", "review_id": "izzZpKVEpWgrZ0EBBVE_7w", "text": "This place SUCKS....Stay away!  The 7th St location is a scam shack.  I went in for \"just break pads\" & they found $1,500 worth of things to fix. As I left quickly w/ no work done I had a new scrape, scrape sound every tire rotation. I took my Tundra to a real mechanic & he said everything is fine for quite a few more miles.  But that funny new sound???  It was due to the \"Just Brakes\" boys taking a crow bar (or some other tool) to the inside of the wheel  & pinching a spot down  so it rubbed on the drum.  They must think I'm dumb enough to turn right around after a couple blocks & have them fix an emergency they just created.  Give ME a break!", "business_id": "6jsv1cp0Gd26X0BiE2tmTw", "stars": 1, "date": "2014-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9h8jwZ8xwNMK92v4-89ZkQ", "review_id": "NO8SbFqTu4EpHK3krCuOKg", "text": "Honestly, they couldn't have made it easier to buy the car I wanted. Steve and the rest of team gave me  excellent customer service. I never felt pressured the entire time. Very efficient as well. For the first time in my life I actually felt good about the deal I got.", "business_id": "E3sONi8kCTBL96OjzpgBsA", "stars": 5, "date": "2015-08-11", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "B-fqMDFNcwHR6jECRMWRHg", "review_id": "MeRzl50xyniNigIW14fbGQ", "text": "Just had the most delightful dinner at Christo's!  I found them to be so accommodating and friendly. They made me a special salad with blackened salmon to my specifications. Delicious! Thank you Stephanie!", "business_id": "3CSaqRNvYg7ZdN2zwxwzVw", "stars": 5, "date": "2014-07-18", "type": "review"}
{"votes": {"funny": 2, "useful": 8, "cool": 4}, "user_id": "N-D-d1Z4UybdlkK1HxlNPA", "review_id": "34DijCywed1g0ye7oQ6Znw", "text": "I stopped in at Karsh's today for the first time. The service I received was super friendly, and the young man behind the counter insisted I try a raspberry rugelach. It was pretty tasty, so I took home a loaf of seedless rye (one of my favorites), a black & white cookie, and 2 cupcakes. \n\nBefore I moved to Arizona, I worked as a bread baker in a restaurant, then in a bakery much like Karsh's, and then finally managed a bakery that made all natural and premium products more like Tammie Coe/MJ Bread. So I recognized immediately what Karsh's was using. Both cupcakes were made from a mix. The fudgy frosting is a commercial product. I know. I used it. The white frosting is made with vegetable shortening, not butter. The black & white cookie was like no black & white I have ever had. It was so thick and cakey- not at all a crisp cookie. Neither my husband nor I cared for it. The rye bread barely tasted of rye, although it had a decent texture. It was pretty heavy on the white flour. I've had better from Fry's.\n\nFor me, Karsh's was a big disappointment. IMHO, locally, no one's bread matches MJ's and no one's baked goods match Tammie Coe's.", "business_id": "vaqmESluryt5i4Wbkb6KRA", "stars": 2, "date": "2008-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fOfn3XczMmQ-WzLLZ_Mz0w", "review_id": "4eegdIocuHsw1XqTcvg2cA", "text": "I like this place.\nPlenty of pool tables.\nLots of beer. Even caguamas of your favorite Mexican brews.\nThey have that old golf arcade game too.", "business_id": "_GS1R0LTwr6h8rMWY_8U9Q", "stars": 3, "date": "2013-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RULFYOEhCYdfR2104p75AA", "review_id": "0i4uZZvxHeBZ5mBgI_ZWYg", "text": "I have been to EVERY barbershop in central Phoenix and NOBODY can cut a fade like Arthur (the shop owner). I have lived in this area for the past 4 years and get my haircut every 2 weeks. I know all they barbers in all the shops and they all know each other as well. I went to the others because they were cheaper and there was a wait to sit in Arthur's chair. I was cheap and impatient and my results were less than dazzling hair cuts. I'm not saying they were all bad but no one comes close to having the skills of this man here at this shop.\n\nps these guys work six days a week! give em a break for being closed on national holidays as well as traditional jewish holidays.", "business_id": "vLlPTJV2KInOg6AIvNCf2A", "stars": 5, "date": "2011-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BXmS1GcUQIFTceRhBXDg1A", "review_id": "5t-zFMOqaCyANLc2BxiToQ", "text": "Great selection of homemade sausages and smoked meat. Nice samples. Prompt, courteous service. Great value!", "business_id": "XRBTHOXaJK_AJ2wy5mX_1A", "stars": 4, "date": "2015-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "juETsil28wzqAuve28NZKw", "review_id": "sQVyQOo1zis7Z7gTdoAIqw", "text": "Went there this past Saturday for Big Petes new CD release.  Always fun.  Waiting 15 minutes for a drink however is too long.  Older female bartender strategically ignores you unless she is bored.   Door guys were cool.", "business_id": "JZJqJadk9pSoCGT7VTwBvg", "stars": 2, "date": "2009-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f5DSsK2w-b0xQVyz8lZACw", "review_id": "UGb1Hrx47FuVJ-wFGDxNeA", "text": "This is a regular hang out - I have to see a show here at least once a month. On 7/3 I made the trip down to see Phoenix Legend Hans Olson perform with a full band for his annual birthday bash. Great show. In all of the years i have been coming here I can't think of a bad show. Oh sure there were bad times, fighting with my spouse, car issues, drank too much/not enough but the bands have ALWAYS been solid. You can count on the Music, great service from Lynsay and the place to be a dump. Love it. Free parking. Couple of tips. Sometimes you will find a food truck there. Check the web site before you come down if you are hungry. Sit in front of the little wall/bar and the acoustics are much much better.", "business_id": "JZJqJadk9pSoCGT7VTwBvg", "stars": 5, "date": "2013-07-09", "type": "review"}
