{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "WMTm9HHRA3EewoxTX1Gleg", "review_id": "CtxqLHFB80H64X62p_N0Bw", "text": "The food is good and its CHEAP.\n\nI mean REALLY INEXPENSIVE.\n\n$4.00 for a burger and fries. Add a coke and its like $10.00-$13.00 for two people.  Seldom if ever crowded. \n\nService can be a tad slow but hit or miss.\n\nThey also do breakfast and its a great alternative to waiting at eat and park.\n\nTry the shakes, they're great.", "business_id": "6ilJq_05xRgek_8qUp36-g", "stars": 4, "date": "2009-06-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "Lia6Tarlci3Z5aw8cM6JTg", "review_id": "QF5KN7OiAce1j-SeeYGe3A", "text": "A group of us traveld here to go kenneywood park across the road but we decided not to after what we drove throuhg to get there so we atleast decided to get somthing to eat and man where we happey to get out alive. We where the only normal people in this place. The kids next to us who where only 14 where bragging and saying that they went to jail 2 times in their life. You had people selling their food outsdie the resturant. after seeing that we quickly left and hid in our cars with the doors locked. While we where in there my friend got hit on by 2 girls and they gave him there numbers while the other young guy across the table yeld dont do it dont do it. Must I say more? bottom line is dont go if you are normal and get the hell out of that area cause if you call a shank a happey meal toy then that is the resturant for you.", "business_id": "CL3tZqbYT7B5zgewKCS6-Q", "stars": 1, "date": "2012-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6Gv9l_TMCfBpBhUiodBdUA", "review_id": "fezgpPV1vqfwcFen6FIvTg", "text": "This was my first time at this location and we were referred here my a friend at work.  We walked in and the service was great.  We had some jokes with the staff and they made the experience fun.  The food was fantastic and the sandwich was huge and a great value for the price.  The decor was fun with old pictures and lots of Steelers stuff in the walls.  Also a ton of pictures to look at on the walls!   Great experience and great people and great food.   There are also lots of shops and fun things to do close by.", "business_id": "J011r7mUV1QhgLJ7GkrtMw", "stars": 5, "date": "2015-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8n--xRBQ9eLDi0vpQ5fGFQ", "review_id": "_pYsQ7YaXBd144VQZ9Ee3A", "text": "I've been going to Tessaro's for years. Every trip back to the 'Burgh wouldn't be complete without a lunch or dinner there. It's my go-to place for meeting friends for a meal when we want something tried and true with no froufrou. And I am never disappointed. \n\nI have heard grumblings for the past couple of years that Tessaro's partially cooks their burgers throughout the day and then finishes cooking them \"to order\" so I asked the waitress if I could have a fresh patty, not pre-cooked. She didn't seem bothered by my request. And honestly, I don't know if I would be able to tell the difference. That being said, it still was the best tasting perfectly cooked burger I have had in a long, long time. With all the new specialty burger joints popping up across the country, I still dare any one of them to stand off side by side with Tessaro's. Our usual picks are the Deli and the Bacon-Blue Cheeseburger, but you can pick any burger on the menu and be satisfied, and then some. I also love their home fries. Yummy! The marinated gourmet chicken sandwich is also a winner if you aren't into red meat! \n\nOne of my other favorites at Tessaro's which I have to admit I haven't had in eons since we haven't made it there for lunch recently is the tuna melt on rye. It has been on the menu forever. If you want one, you have to go for lunch as even though its on the lunch menu, they refuse to make it at dinner :( \n\nThe atmosphere here is strictly neighborhood bar/restaurant. Nothing fancy. I am sometimes put off by the way they offer seating (first-come, first-serve) and they will try to cram four people at a table that is meant for only three. If they are not scrambling for tables to seat people waiting, I'd ask for another less cramped table and wait; but on a crowded night, take the first thing available or you could be waiting a long, long time.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 4, "date": "2011-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Iu9HNWqEKIx-auLSu6QeJg", "review_id": "dLGzl634g56j3hKhBc7ROg", "text": "Good place to have a reasonable meal. Cool that everything is made out of an extremely small kitchen that you can see but the food didnt live up to the local hype for me.  Burger tasted alittle bland, and extremely large.   The restaurant is also very \"packed\" tables are very close together. Home fries option but no 'french fries.\"", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 3, "date": "2014-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Qy1X7IfXo65l3fl-CXg8nw", "review_id": "7bMvWRNixe-hzg0yzuJngg", "text": "There are a lot of trendy, high priced hamburger joints popping-up all over the city.  Forget about that mess.  THIS is the best hamburger in Pittsburgh. Period. Don't forget to order the potato salad, too.\nBloomfield is a great neighborhood, maybe the safest in the city. There are a fair amount of eateries here.  Pass them up. Go here.", "business_id": "vgXE1I7c9ElcfYyZfQiN1Q", "stars": 5, "date": "2015-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q7MrNVt1FE23rwtWmPYWHg", "review_id": "xuNGK8DV0OfkUNbkjNxQ4A", "text": "Loved our server Jaime!\n\nLoved their Brew Pub Pretzels!\n\nLove their Take Two Seasonal Menu, the Green Goddess Wedge Salad, and the  Lemon Shrimp Fettucine!\n\nRocky Bleier was there! Yay!", "business_id": "PFAOxw4Gl8gm7PGWvohCWg", "stars": 5, "date": "2013-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kAvCvGsy6yS5tjaXUL99-A", "review_id": "veJT2jNbL807sxUtv4gxzg", "text": "All I can say is.. \"wow\". My husband is from Chicago and we were uncertain how close these Vienna dogs would come to the \"real thing\". We went with family and shared several dogs including the polish dog, Vienna dog, Carolina, and Chili Cheese dogs. All of them were EXCELLENT.\nThe owners made a point of visiting our table while we were there, which made a great impression.\nThis is the best place to visit when you're craving a good dog!", "business_id": "gpCtDCSXIoQx70cq9itfNA", "stars": 5, "date": "2015-07-05", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "UQ7HSUx_Zxje1MSAeZ8eAw", "review_id": "UifD7Qy8L_aZOS6AEAy_BQ", "text": "AWFUL experience today! I went through the drive through around 5pm today and to my surprise there weren't many people in line. The line was 3 deep, 4 with my car, and yet I was stuck in line for over 20 miinutes! I finally gave the lady my order. \"The Ultimate Chicken Grill PLAIN, just the sandwich please\". As I waited in line to reach the window to pay for my order the car immediately infront of me jumps out of line and speeds off! Poor guy was so frustrated about his wait that he drove away leaving his food behind. \n\nI am now at the only window that is in use and get ready to pay. She asks me what I ordered. Again I said \"The Ultimate Chicken Grill PLAIN\". She looks in the bag, asks me for my money, hands me my change and I drive away thinking about the yummy sandwich that is in that white bag. \n\nI make it back to the office and when I open up my bag it is not PLAIN like I asked for and clarified at the window! My sandwich was dripping with sauce and had EVERYTHING on it! I'm on a new diet and cant have all of the nastiness that was all over that poor chicken sandwich! I was now a little angry and hopped back into my car to have them correct their mistake.\n\nWhen I got there I explained to the young lady what the problem was and she was very nice. She turned out to be the only pleasant person during my whole experience. She asked the staff to fix the problem and as they were fixing it I could here them arguing with eachother about whose fault it was. Personally I dont care who messed up!!! The fact is that I am starving, upset, and now in a hurry, but all I hear is what sounds like a teenage he said you said going on. \n\nI'm very disappointed in this Wendy's because I have never had a problem with them. The only reason they received two stars was because they DID fix the problem and my new sandwich was piping hot. Other than the freshness of my sandwich I was extremely dissatisfied.", "business_id": "biNr0NdUU_dPXgWEhGJNZg", "stars": 2, "date": "2013-08-02", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 1}, "user_id": "GHfjoofGTd3uuQy9otIflg", "review_id": "Yn7bv7B2DUnN2RAgPDsc1g", "text": "This McDonald's has a confusing as hell Drive Thru route. You have to circle the entire building to get to the Drive-Thru section. I was so hungry for my fatty indulgence that I pictured myself accidentally running over a patron as I high-tailed my way around the corner to get to the drive-thru lane. Yeah, this location looks all fancy-shmancy but they really, really disappointed me.\n\nI got a nugget meal to-go, only to go home and find that they forgot the SAUCE! Nuggies with no sauce? I wouldn't wish that upon my worst enemy! I looked at my receipt and it was right there-- \"S&S sauce $0\". But, there was no sauce. I tore through my bag, hoping that it was hiding under the fries, but there was no sauce to be found.  I could have broken down in tears right then.\n\nFor that, I will not return to you. You have forsaken me.", "business_id": "4kM-mP7z1nP015R2Tlz1Tw", "stars": 3, "date": "2012-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HxxPa0ZvrqU6JlcLJGbxtg", "review_id": "bCD7dmN-0oD2ZLlklTr6MA", "text": "The Gyro was surprisingly good. I have been to 3 different locations. The food is pretty consistent and pretty good.", "business_id": "hlME5-P2CudNDCUSIX2cxQ", "stars": 4, "date": "2013-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "LM3o6Wq8qAwAWZt37FMUIQ", "review_id": "2j0goa8p9VfFZZ3w7Nhazw", "text": "Ashley was friendly & checked on her customers fluidly. I grabbed a couple of beers & a quick convo while I waited on some calzones (yum!!!) to go. Great way to start my weekend!!!", "business_id": "3xdV-7di_YD3MVqs3Pa7-g", "stars": 5, "date": "2015-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hToSCVEg2CfejHYst9cRhA", "review_id": "68q8P2kAzjI4zoPvM1b1Qg", "text": "I can't believe I am writing a review for a McDonalds, but we recently drove through here the other day for a diet coke......as others have said, they are fast.  It a 50's style retro McD's but the customer service is excellent, and the drive through was wicked fast.", "business_id": "uga5g16PncJOtY7Sc3A05w", "stars": 4, "date": "2015-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dRko0-SaRcSaP5gR-5uxuA", "review_id": "WDCUR5LCp67AW6_-OzvVJQ", "text": "I got so sick and was throwing up after eating there! I have never been back since. And normally I never get sick to my stomach. I don't trust their food. And it is so overprized and overrated.", "business_id": "1hBOR97oX5Xph3J8Tdob7w", "stars": 1, "date": "2009-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "xdgtecTsDvxfKwaCKaRFcw", "review_id": "tPY7j7UPXgyLQB31LdAeIQ", "text": "I really dig this place. They are really fun with lots of parlor games and posters from the nineties of girls in Bud Light gear. It's definitely more of a townie bar, so the clientele is pretty interesting: think people who prefer beer to their spouses. The sign says 'great food', which is true as long as you like fried foods that don't have particularly much to do with fresh food.", "business_id": "YlznKuAxnd7j3QfXFzoIog", "stars": 5, "date": "2015-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ClPrkKSD-P3EItATSN_29A", "review_id": "jRCOCamzo_SoVGyYtaB8oA", "text": "Really bland tasting food, and annoying atmosphere, as well as annoying staff. The food has nothing unique about it. I wish the fries were good so \"bottomless fries\" meant something to me. The table we sat at was REALLY close to another table (there is a row of crammed tables) and the people next to us were eavesdropping the entire time. Quite uncomfortable, but the only seating available. They brought out an entirely wrong burger to me, but gave me a $20 giftcard since they messed up, so that was cool.", "business_id": "4pZeC9W0EIiBTOJMnwG2vw", "stars": 2, "date": "2011-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 6, "cool": 3}, "user_id": "l53FUDHRHLg7BQ89KgAtxQ", "review_id": "LVCOpH5lsNPnqQ0hL0mj0w", "text": "Sunday. 6:20pm. Downtown following another amazing Mercury victory.  Hungry.  Group includes toddler. We'd like to walk to food but it's warm so we can't walk far.  It's sad how few options actually presented themselves.  We tried Coach and Willy's first, but as of 6:10 their kitchen was closed.  So, we were led back to Hard Rock Cafe.\n\nI've been here several times after games and all for the same reasons.  It's close. We didn't feel like parking again. The food is ok.  Think Apple-bee's for a few bucks more.  But service unfortunately has been a regular issue.\n\nOne of the last times we were there we advised our server that we needed to be out the door in 45 minutes.  We asked what food we could order to ensure that it would be fast.  To his credit he checked in the kitchen.  After immediately ordering a sandwich and salad, the food arrived 5 minutes before we were supposed to walk out the door with no apology (and a server who hid from us for most of that time). We were 15 minutes late leaving just trying to get to-go containers and our bill.  \n\nThis time - our service was actually wonderful.  Our server was great.  Happy, conversational, refilled drinks much more than usual though the place was quite busy with post-game activity.  The problem came when she had to leave to move her car. You see, with D-Back and Merc games, parking was expensive and full so she had to park several blocks away where the gate closed promptly at 8pm, which we totally understood.  And even though we all saw her handing us off to the manager after handing us the check (she pointed to our table several times) no one came to our table.  Well, after flagging down a hostess, a bus boy and another server who all said they would look for the manager, and we did see them scurrying around looking for the manager, it took 25 minutes to find her and have her walk over to the table.  That's 25 extra minutes with a toddler who was getting tired. How much did we love that? Finally, as our waitress walked back into the building 30 minutes after she left, we were finally paying our bill and leaving the table.  She was so apologetic.   She was wonderful.  The fact that we heard from several folks there that waiting 20 minutes to FIND the manager was not out of the norm was scary. \n\nThey have such an amazing location in the heart of the action after events.  Their food is decent enough that I'd be willing to grab something there again purely for convenience if only I knew what to expect when it came to the service.  But unfortunately - I can't.", "business_id": "gkv2XvXpFgiq4Bb2XK7YmQ", "stars": 2, "date": "2007-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Hlgu3BrCsuJOCPkKdL9PcA", "review_id": "z6qwL2Z-Vmgmrl5WPpb88g", "text": "Bartender and server were very friendly and helpful, very over priced, the Sandwich was extremely dry", "business_id": "gkv2XvXpFgiq4Bb2XK7YmQ", "stars": 2, "date": "2014-06-12", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "3JtdBvnY6Wzp22gt5zFwDg", "review_id": "KCfEevgGU6B-8hdMeJ94-g", "text": "Ok, the others are being way too hard on this place.  I had never had a Whataburger before, and I thought it was a great value.  The burger was very edible, and topped with fresh, ecoli free toppings.\n\nThe place was not in the finest neighborhood, but was clean and well kept.  The staff was friendly as well.  I am fatter for the experience.", "business_id": "ixTr1qXUFGTzyaZUuCDDvg", "stars": 3, "date": "2008-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E7Cx6hTn5JA0_rsjMhv-ZA", "review_id": "Kb3f-OyazalS24tEKdbu7w", "text": "Pretty average, nothing too fancy. Just good people, good food, and a helpful staff. A little speedy for the quality and portions.", "business_id": "hzUOqxpcnYYBgLlrgvjQYQ", "stars": 3, "date": "2015-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "f5DSsK2w-b0xQVyz8lZACw", "review_id": "RZpOSiq0_iZB9nNhzBY7mQ", "text": "Been there a ton of times over the past 30 years. Same great burgers and fries, people, choice of bud and bud lite...  Its a dive. Great place to go for lunch but maybe not the best place to impress the ladies. 8)", "business_id": "ntJAKLAq0cXzzdFgPoo0Iw", "stars": 5, "date": "2012-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4IxHjaLEKtLiIGRMUT8plQ", "review_id": "EZ9YmOZzpxpMoEMVq2edrg", "text": "I love me some dive bars!\n\nDecent wings at best.\nBut the burger, yep, the burger was good!\n\nFriendly service. Really dark. Fun atmosphere.\n\nI'll definitely check it out again though!", "business_id": "ntJAKLAq0cXzzdFgPoo0Iw", "stars": 4, "date": "2015-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QN4xNZ1_AzEaqEYHYk8FBg", "review_id": "AH53JpdQEaU6ml2G5LRn5g", "text": "Great wings...cool place to chill", "business_id": "qz4ZOcv-840UjfCEYI4qZg", "stars": 4, "date": "2010-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "z1c8uQv7tfgrP4-sVggbTA", "review_id": "OtU2089YIxTTaicmA-4PfA", "text": "Delicious sliders for a great price. Also, it's just a few blocks from work. Also, eating there makes me feel manly. Enough said.", "business_id": "iNvY0zAlaD_ye7Z6rHu-Ug", "stars": 4, "date": "2008-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "dQDHLSMNtRtgdtHdAtO4PQ", "review_id": "XiCGerJgunZVXo_Tc33kXg", "text": "East coaster who misses White Castle in total heaven! This place is great! Definitely worth a trip! \nI had the cheeseburger sliders, minus the mustard. SO great!!!", "business_id": "iNvY0zAlaD_ye7Z6rHu-Ug", "stars": 5, "date": "2011-07-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Qzxt48iXX0Ievaiu9N1h6A", "review_id": "SonWDCog1gnixyszKD0JUA", "text": "Great Hot dogs, amazing chocolate banana peanut butter shake, and garlic fries are awesome. You would think I'd weigh a lot by the sound of it. lol \nThis place is a Dive that is a best kept secret. The owner is a down to earth hippie kind of guy. He's always accommodating and friendly. :-) We frequent this place often and have always enjoyed the food.", "business_id": "iNvY0zAlaD_ye7Z6rHu-Ug", "stars": 4, "date": "2013-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UdFFbZnPUPZMrZyx7cb0Tg", "review_id": "ma_0XVJV5UpP3hvWkyrItw", "text": "This place is great!  If I want breakfast (served until 2pm!) it's hard to come up with something that sounds better than the Brass Rail.  It's cheap and it's straight forward, delicious breakfast!  I've had the eggs/bacon/hashbrowns/toast meal, which is hard to beat, and the pancakes, which I scarfed down without giving a second look a the appetizer that I had ordered (which was also very good).  What more could you want than delicious, traditional breakfast, very low prices, and friendly service?  Try it!", "business_id": "RIeWXLMHZQlYprYt1x2f1w", "stars": 4, "date": "2010-06-29", "type": "review"}
{"votes": {"funny": 3, "useful": 0, "cool": 0}, "user_id": "ElpDvo770IaMeTDkFviTHQ", "review_id": "-vXRQn69zHrU6q16z6uagQ", "text": "This is my third visit and my last. The drive through is always slow. today after 5 mins waiting I honked horn and talked to the speaker. nothing. At 8 mins tried again. Then left. As I drove by I could see 5 to 8 people inside playing around not doing their jobs. so off to Wendy's across the street. They were super fast, courteous, and we're happy to be doing their jobs. So very unlike the horrid sonic that we will never return to.", "business_id": "beSNHSvR9kjE_5vXJ_tlfw", "stars": 1, "date": "2014-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aTlHCohiT4ggRcMl3RQlXQ", "review_id": "Cmr9UTXekH4IKQR27Q3Yiw", "text": "Food is good but the service is brutal. Although I must say last time I was in it was good. But I've been coming here for years and the service for the most part is bad. The wings are really good, espically if you ask for extra crispy. The cheese steaks are okay. Happy hour is very cheap. Overall its an above average sports bar.", "business_id": "lf42gtgq_2_jPvjfp_K1nQ", "stars": 4, "date": "2011-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TxHrnB4acZIwgUXWMpyEOA", "review_id": "sK6pjGTaJ2uJnSfUPlUv2Q", "text": "Uncle Sam's cheese steaks are great... but don't try anything else.\n\nI thought I'd try a stromboli which is rare to find here in AZ as an ex-east coaster.  I walked in and placed an order to go which is also probably a bad idea due to the fact that the person taking my order didn't listen.  An additional mistake is not checking my order and catching it before I left but I ended up with a calzone which has ricotta cheese which I hate.  I had two bites and threw it away.  The crust is tasteless and somehow the steak tasted so bland outside of that fresh roll.  May not be back for awhile.", "business_id": "lf42gtgq_2_jPvjfp_K1nQ", "stars": 2, "date": "2015-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3gOsJTTe6_NXV8SU6iBlgw", "review_id": "cv3723WAv4SGAhpU_JaDvg", "text": "Typical Wendy's grub. Certainly better than BK and McD's but still nothing to write home about... I bumped the rating up a star (2 to 3) simply because of the location, fast service and reasonable prices (for an airport). Expect 2 star food with 3 star service in an airport, but nothing more.", "business_id": "A-8Q15fZHKGn3dLjazNwHw", "stars": 3, "date": "2011-06-16", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "WQFJ8_V1lao4oZ_FKbk5Zg", "review_id": "gW2dHI-OFVceLZ62sw9o8w", "text": "I'm a dollar menu whore.  One chicken sandwich please.  Here's your $1.09.  NEXT!   They want $1.98 or something ridiculous for a large soda. Next time I'm bringing my own $.25 can of pop.\n\nThe food is Wendy's.  Better than average fast food burgers (or $1 chicken sandwiches) I guess.", "business_id": "NhdIZvpM11d720SskLvRpA", "stars": 3, "date": "2011-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "L6ySq_or6HJIHD1vtMT4Rw", "review_id": "1-aRkBgbnlnbv8BEu4Mjqw", "text": "I went here with my sister yesterday. I loved the atmosphere, the food was great, and our server Chad, was awesome. I may be a bit \"old\", but the noise was too loud for me, but otherwise than that, everything was good!", "business_id": "e0vubCKi8KD8zC2C6FdbuQ", "stars": 4, "date": "2012-07-07", "type": "review"}
{"votes": {"funny": 3, "useful": 7, "cool": 2}, "user_id": "WehCZQtQu96-VL6RawV_BQ", "review_id": "4GtiAmudxO68SFuLWZAkWQ", "text": "I've been a diner at Island's for a very long time and they have never failed me. You always know what to expect when you walk in the door. I love a restaurant that can be so consistent for so long! \n\nSome of my favorite dishes include their burger (always a good choice), their quesadilla, the tortilla soup (my favorite!!), the cheese fries or plain fries, the chicken tenders, their Shorebird sandwich (LOVE), their BLT, and their Yaki Tacos. \n\nAs you can see I've tried a lot of their menu options and have enjoyed them all. Island's is a reliable, yummy restaurant that the whole family can enjoy. I will always be a customer!!", "business_id": "e0vubCKi8KD8zC2C6FdbuQ", "stars": 4, "date": "2015-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gasR8YInP8cPgeQYKijgfg", "review_id": "T0UMBEMdz9zBtrAmFWF8Bg", "text": "It is an American icon and the staff at this location has always been super friendly.", "business_id": "byFWmwlVSmUj-AmM6NZYvw", "stars": 4, "date": "2015-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "K0Edvn6j6LoonRb4UyY2sw", "review_id": "HxL4EKPjfgXeMK2VNam_OA", "text": "The food was delicious and well worth the drive. The waitress we had seemed kinda grumpy though and not to happy to be there.", "business_id": "iAYzRvyBrSkJDu_XZ-E1zQ", "stars": 4, "date": "2013-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KYeLSM3MQpirmHukVV5Iow", "review_id": "33HpUiB0o3eOWK6ij0Z6IQ", "text": "When I get a sweet tooth and decide I want something ice cream-like, this is near the top of my list.  Frozen custard is a notch above ice cream and frozen yogurt, in my opinion.\n\nThe great thing about Nielsen's is the mix ins.  My favorite is butterscotch.  Pumpkin and Cap'n Crunch are also great.  Heck, just thinking about it makes me want to go get some.\n\nThe only thing I don't like about this place is the non-dessert options.  I don't really care for their regular food.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 4, "date": "2010-08-31", "type": "review"}
{"votes": {"funny": 5, "useful": 7, "cool": 6}, "user_id": "waD2euOMPTnTzQ0thq3H6Q", "review_id": "HKzHK0sFFCOFK15lxIUNKQ", "text": "I love this place, and if you went there, you would love it too.\n\nOne of the (many) things I miss about Southern California are the (usually)Charbroiled Burger spots that blanket the entire area from Ventura down to San Diego:  Legends like the o.g. Astro Burger, Galaxy Burger, Douglas Burger, Tam's, etc.   These burger joints served awesome burgers, great grilled sandwiches (Patty Melts, anybody?), and almost always, a great, greasy breakfast on the cheap.  Oh, and they made their food proper.... American Cheese on all burgers and sandwiches, thousand island on the burgers, no up charge for grilled onions, yadda-yadda-yadda, you get the point.  Sadly, AZ seriously lacks in these types of establishments.\n\nEnter Giant Hamburgers.  While their burgers aren't charbroiled, they're wonderful.  Their Grilled Ham and Cheese is out of this world (just remember to order it \"plain\" with only the ham and cheese on buttery, grilled sourdough... YUM!).  Try an open-faced chili burger, or maybe even a gardenburger, if you like retarded shit.  Their Chili-Cheese fries are a real treat, especially since they melt a few slices of American Cheese on top instead of that bullshit cheddar some places use.  Thirsty for something sweet?  Try a hand-made, uber thick shake.  Still hungry after all that?  Have a jumbo slice of homemade pie.\n\nWait!  What if it's 9am and your stomach's not ready for Chili Cheese Fries?  No problem, their breakfasts will surely satisfy any cravings you might have.  Sold as a Single, Double, or Triple, their egg combos come with eggs, hash browns, toast, and your choice of chorizo, ham, sausage, hamburger patty, bacon, or steak for an additional charge.  Don't want eggs?  No problem, they've got pancakes and the best looking biscuit and gravy plate I've seen in years.\n\nYou order at the counter and they bring the food out to you as you're chillin' in 50's-style booths enjoying the music and ambiance of an old school diner.  The place is always busy and the staff is always very friendly, but not in an overly friendly, obnoxious way.  A Triple breakfast plate will set you back about $8 with tax.  Burger, fries, and a drink will get you for about the same.  They are more than willing to substitute or customize your order however you want it, usually at no charge.  \n\nYou will enjoy this place, trust me.", "business_id": "AoO0FJyUm01lmIJJTcPWEQ", "stars": 5, "date": "2009-06-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "oKX-QfUJAGekWrlyxdUJJg", "review_id": "a3D5RVF34nj-GwcKVzU09Q", "text": "Simple and Perfect. If your looking for a good burger like you use to have at cook outs or at home this is the spot. Pure beef, nice and tasty and simple. No fancy pants addons or spreads. My cheese burger with bacon, jalapenos, tomatoes and onions was perfect. Just what I wanted. Top it off with some very crispy and delicious fries and a REAL Strawberry shake and I was in heaven. \nWe took home large slices or Lemon Meringue and Coconut Creme pies. Very good, though to be honest I only ate a few bits because I was still full 5 hours later.\nYou can't go wrong ordering anything here.", "business_id": "AoO0FJyUm01lmIJJTcPWEQ", "stars": 5, "date": "2014-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xm7p3mwDnS5zR6jJKRMfOw", "review_id": "MGkOb0jNWhtPmwA4yqbbHQ", "text": "My husband was in the mood for a hamburger, so I looked up burger places near us. We looked at the reviews and thought we would try it. You order at the counter and then they bring you the food. I can honesty say this is my new favorite place for a hamburger and will be bringing friends there. My husband wants to try breakfast next. Thank you for the great food and service.", "business_id": "AoO0FJyUm01lmIJJTcPWEQ", "stars": 5, "date": "2015-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nDQwe1OZLY83Xjew_EcdEg", "review_id": "tfNSkLMxKw23aGlcdJs6MA", "text": "It's a good place to eat,burgers are good. We come at least 2 twice a month (or three ) The atmosphere is awesome love it. Friendly staff on point on everything. By the way they will sing on your bday..", "business_id": "-GYx5GAx_-4XEsn7mFwdkA", "stars": 4, "date": "2015-06-18", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "fglrdduR59GBnhci5qApiQ", "review_id": "SSaDAmOM7S3Q4edJfZA6vg", "text": "Eating here right now.  It is very good. We haven't been in a long time. The atmosphere is really nice. It is very clean and decorated nicely. The employees are nice and friendly and welcomed everyone as they entered.  The food is very fresh.  The fries are yummy. The grilled chicken sandwich with bacon is delicious. Very nice lunch.", "business_id": "-h1WpfgqAmJcJDqyXXJ2og", "stars": 5, "date": "2015-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KBpoIbLAQcEfMbmPIWFpiA", "review_id": "zzfbC65yhvbJgaOsw_8qWQ", "text": "Went through the drive through and their service was cordial and professional. The burger was exactly as I order - I just waited a little longer for my food than I expected I would have to wait. No real complaints here though!", "business_id": "z8DlBX3FNJUgCVFHN2BPnQ", "stars": 4, "date": "2014-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JwaxWcEG0R_uHAxmbjyIiw", "review_id": "GuK7wQYn_XVfiACv72517g", "text": "So disappointed. The burger was nothing like the photo. Why is this called a gourmet burger????? Bottomless fries but the staff never comes back after delivering the initial order. Water glasses empty, fries empty, right under an air conditioning vent. We were so excited to try this place and it was a total bust. Hope you have a better experience. I will not be rushing back to this place.", "business_id": "zoHCkEiIKfXiLTKUqKEojQ", "stars": 2, "date": "2014-06-15", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "3BddvFu894h9jHKneItueg", "review_id": "k1XMy_c0eMZewIa10LeYQg", "text": "Despite any bad or lower rated reviews, of which there are a few, this place was bustling with business last night.  \n\nOccasionally (like all the time), I'm a tad opinionated on where I'd like to be seated.  Never by the restroom, preferably a booth, and not crammed next to another group if there are more comfortable open spaces available.  This has more to do with my personal preferences and less to do with this review but I just felt I'd throw it out there.  \n\nI asked to be seated up on the raised level just north of the bar when the waitress began to lead us to a table on the floor level.  It was no big deal, she accommodated us easily.\n\nHappy Hour up until 7pm, I believe.  $2 domestic drafts.  My wife got a Blue Moon for $2.50 and I had iced tea.  We also had an order of a dozen hot wings and fried cheese curds. \n\nThis place is definitely a bar serving bar food.  Every plate that I saw delivered to a customer looked pretty tasty and piled high with food.  I saw some super looking Nachos, a huge burger with a pile of fries, somebody even had what looked like a burger patty with a side of cottage cheese and fruit.  Even that looked good.\n\nOur server wasn't the most attentive but he got our drinks out pretty fast and when our food hit the table (brought out by a different server) he was there to refill my iced tea and to bring my wife another beer.  You can't really ask for much more in a bar.\n\nThe wings were great.  We didn't order suicide but instead opted for hot and they were okay.  Not super hot but not super mild.  The cheese curds were new to both of us and they were okay.  Sort of just like breaded, fried chewier cheese but none the less tasty.\n\nIn the end we paid $22 bucks for two beers, two apps and an iced tea.  Not bad.  \n\nOh yeah, you're supposed to just throw the peanut shells on the floor after eating them.  This felt weird for some reason even considering that the floor was covered with peanut shells.", "business_id": "7-4FxYXhNUS2lhpUb_q5-w", "stars": 4, "date": "2010-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UyN7-9vEF93XZavxvsZTDQ", "review_id": "rQ8x5r-R15IjstVFSIA8QA", "text": "First off...try the meatloaf and soft pretzel sticks..sooo good lol....I've been here quiet a few times and its been a pretty good experience...drinks are a little pricey when comparing to a place like Native New Yorker but its still a good place to hang with friends", "business_id": "7-4FxYXhNUS2lhpUb_q5-w", "stars": 3, "date": "2014-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "5LPg2zyHQrjzQSkbMSthiQ", "review_id": "pM2lmh0YL3bwb2lvEl8lHg", "text": "During the day this place is acceptable, just to be served by a great guy named Ralph. He is a very cool senior with such a big heart.\n\nThe reason for the one star is that the service is so bad. If you are in a hurry go to the drive thru, that is where they focus their attention and pretty much ignore the guests in the lobby. However, you will get your food fast, just accept the fact that your order might be wrong.\n\nThis McDonald's is very close to our house and we sometimes stop in late night to get ice cream from the drive through. The service at night is beyond bad. They always have a difficult time giving back the correct change, the orders are wrong. \n\nThe one thing that really stands out is the way they shove your food order at you in the drive through. We like the ice cream cones, you would think that if I am in the drive thru in my truck and I order ice cream, that you might want to take a little bit of care in making the cone. Like clock work, they start handing me ice cream cones ( shoving at me is more like it) the cones are dripping and the ice cream is falling off the cone. I really don't want melted ice cream spilled all over, I asked for a napkin, the girl replied \"there is paper around the cone\" \n\nFor some reason, I keep thinking the service will be better at night, it never is.\n\nIf you want some late night entertainment, go though the drive thru at night. You must bring your sense of humor,Don't say, I didn't warn you.", "business_id": "9dZ1Ql35BMbqoO4yebgxdQ", "stars": 1, "date": "2013-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "woXhdtL9ds78_mz8mOY4Vg", "review_id": "IGbRlkcMPwZFu7jsYM5HFA", "text": "So it's been almost a year exactly since I first tried Flancer's and have been back several times. \n\nThis time it was my choice for my bday dinner and so it was me and my fiance dining. And lo and behold it was time for the pot roast sandwich special again. Had to have it, loved it as much as last year. \n\nRushing ahead though. I have never had Flancer's pizza so rather than do a regular appetizer, I had a slice of cheese pizza. The crust was perfect. Heck, the whole slice was perfect. Definitely must order a whole pie at some point. \n\nFiance ordered the green chile bacon cheddar fries for an appetizer. So decadent and good. An instant favorite. \n\nBack to the pot roast sandwich. You can't beat tender pot roast with cabbage and crunchy thin pieces of onion on Flancer's bread. I had sweet potato fries this time and they are just as good as the regular fries. \n\nFiance had the baked chipotle fettuccine, which has become a favorite for him. As good as ever though he said next time he's trying something else just because all of their food is so good. \n\nI'd signed up for Flancer's email club and had an email for a free cobbler dessert since it was my bday. It was strawberry/apple cobbler and again, perfection. Not too sweet so that eating it with the delicious vanilla bean ice cream was just right. \n\nAnd to make our night even better, even though we didn't have a party of 4 that would have gotten us a free appetizer too, our server talked to the manager and they gave me my pizza slice free because we had such a good order. (Ordering a bunch of food finally paid off. Yes!) \n\nBottom line, I just love Flancer's. The service is always great, the staff is so friendly and the food is incomparable. \n\nWell done, Flancer's. Well done.", "business_id": "JMOK_Sy6aSOZwd4qgkX7hg", "stars": 5, "date": "2010-08-13", "type": "review"}
{"votes": {"funny": 3, "useful": 5, "cool": 3}, "user_id": "clTYUJCL-rHnVIS2WePRwA", "review_id": "St11g8md2SaTUQYka0zVhw", "text": "This is ONLY about their wings, and I've heard that everything else on their menu is fine, though I've had several people tell me that this place is racist, unsolicited.\n\nAnd trust me, we wish we never came here.  Their wings were the absolute worst wings I've ever had, it was a nightmare of wing-eating and the absolute nadir for our site.  We've been to shitholes and dives and crackdens in search of wings, but the worst ones were right here at Flancers.  \n\nWe wrote a review and apparently some people weren't too happy with it and kept telling us their sandwiches were great, but we didn't give a shit.  We didn't review a sandwich, we reviewed barely-edible wings.", "business_id": "JMOK_Sy6aSOZwd4qgkX7hg", "stars": 1, "date": "2012-08-11", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "cbW9WYgqERAuNITk0Xko7A", "review_id": "Z299rh7HQMeRLDAqWHlTDA", "text": "Ended up here one afternoon about a month ago, and never got around to writing a well deserved 5 star review. I order a half sandwich and let me tell you it was wonderful. This place is noisy and crowded, so if you're looking for a quiet lunch this is not the place for you.... Food is great. wait staff great.", "business_id": "JMOK_Sy6aSOZwd4qgkX7hg", "stars": 5, "date": "2014-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "T3PEAptAiqXVkNtnulBsNA", "review_id": "ilVRc6wYLnt7bIViwk9V0Q", "text": "This is another great little sports bar where you can feel very comfortable taking your kids. I always hesitate about \"bar\" restaurants, they are a risk for bad language and bad behavior, but NOT this place, they are awesome!\n\nMenu is very diverse from Mexican to Italian, from wings (really good too) to a fantastic beef dip! The girls that wait on you are attentive, beautiful and very good at what they do.... Go and enjoy.....", "business_id": "_TWT58PWunYIyPgpz1fuog", "stars": 5, "date": "2010-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ov4waJDk87ZHCVnAmyJKVQ", "review_id": "oA7ojKHDdoTTEF2CwHG2UA", "text": "I drove past a Whataburger in Lafayette, Louisiana for years and never bothered to stop in (it was right in front of Sam's Club). I didn't know anyone who had ever eaten there.\n\nMoved here and finally decided one evening I would take the plunge, since In-And-Out was further than I wanted to drive. And I reallllllly wanted a decent burger.\n\nTHE GOOD\nThe patties on my burger had a good flavor and the beef didn't seem overly fatty. \n\nThe onion rings (which I think were prepared fresh for me) were pretty decent. Even though it was a large order, I wanted more.\n\nThe malt: not half bad! Now bear in mind that Lafayette, Louisiana has one of the only (if not THE only) Borden's Ice Cream Shops left in the country, conveniently located just off the campus of University of Louisiana at Lafayette. It still makes REAL malts, shakes, etc. So I'm spoiled. But it was good to taste the malt; I find shakes bland and seldom order them.\n\nTHE NOT-SO-GOOD\nThe overall burger taste was bland, uninspired. If there was mustard, ketchup or mayo on the burger, I couldn't find it, at least not enough to enhance the flavor. The chopped lettuce fell out of the burger with each bite, making more of a mess than I would have liked. And the lettuce was bitter.\n\nThe fries: again, nothing special. The large serving was plenty--I didn't finish them. And since I despise cold fries, the remainder went out for the birds to nosh on the next morning. Got the spicy ketchup. What's all the yelling about with that? Ketchup with a little (tiny) kick. Meh. (And I was given all of three containers of it.)\n\nOverall: I can now say I'm no longer a Whataburger virgin. But I wouldn't make a special trip just to go to one again.", "business_id": "Y7UZz1U8FhWKuoPp-_z5Dg", "stars": 2, "date": "2013-07-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4uxuFp9vXnLd5oA63cDBoQ", "review_id": "kZjMmMLBWB6udJQFtCagVA", "text": "I really enjoyed todays food at Red Robbin.", "business_id": "AgJbkqR-wre409if4fTbWQ", "stars": 4, "date": "2013-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "K-_t6bktuFjs-4Lzve9eAQ", "review_id": "Uyn7lMT41Qf6NXrG4RLFkw", "text": "My experience with this Johnny Rockets has been \"meh.\" there is usually ample seating, so getting a table never takes long. I come here a lot for several reasons unrelated to the quality of this establishment and despite coming at all sorts of different times, my experiences are consistently poor. It takes long time to get our food (never ordering anything special) often longer than 30 minutes. The quality of the food is ok (maybe 3 stars) and the waiters are also average (3 stars). But often the wait staff is inattentive to drink refills and other key things (like order taking or checking in). So I'm dropping them down to 2 stars. Also, as a side note, when I have onion rings substituted for fries (at an additional charge) they give me a pitifully small number of onion rings--like 5 medium sized ones.", "business_id": "7NN40EKNb_KaqemxxSH8Wg", "stars": 2, "date": "2013-07-15", "type": "review"}
{"votes": {"funny": 11, "useful": 11, "cool": 10}, "user_id": "Oq3jMOJPcKcxde2cAqjxiw", "review_id": "pbu3NoOT_glG2x8lKmvntg", "text": "Thank god for Ted's Hot Dogs!  There is nothing better in life than a charbroiled hot dog with tasty onion rings and a soda.  My cohorts at work turned me onto Ted's and I kept it secret from my wife.  Yes, I'm that cruel.  Then one Sunday morning we were watching one of those Top 10 Hot Dog shows on the Food Network or Travel Channel.  She said to me, \"I wish we could have a great hot dog today.\"  I broke down and wept, confessing my multiple sins of all the times I tip toed to Ted's to enjoy a chili footlong dog and an all beef dog with the works. She, loving me, immediately hit me a couple of times about the head, and said \"Get dressed bitch - lunch is on you.\"  Now, if you ever meet Marie, you'll come to know that she is sweet and understanding, but on that day, I found one of her few limits.  Needless to say, we had a great experience at Ted's that Sunday.\n\nREMEMBER:  They only take cash.  No debit cards, no credit cards, no bartering.", "business_id": "jJhNOhuGpIsJX5SEUFFWYQ", "stars": 5, "date": "2008-07-05", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 0}, "user_id": "tE8RAfys0AmBb8gsKFqN7g", "review_id": "j8FSgGO2VgFUuBLQheT_dA", "text": "OMG wtF 35 dollars for hot dogs, and they wanted 5 more for the chili! \nIt gave me the runs and I will never go back!", "business_id": "jJhNOhuGpIsJX5SEUFFWYQ", "stars": 1, "date": "2010-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0im6WIvEj7MWfJSLCuZYaQ", "review_id": "ZqK_tFlQNiyFqiajg4ADPg", "text": "This is my kind of restaurant.  Very simple menu of things you would eat off the grill.  Burgers, hot dogs, brats all cooked over a charcoal grill.  There was a bit of a wait in line, but the price and taste of the food was worth the wait.\n\nGreat place...will be back", "business_id": "jJhNOhuGpIsJX5SEUFFWYQ", "stars": 5, "date": "2011-07-18", "type": "review"}
{"votes": {"funny": 11, "useful": 13, "cool": 12}, "user_id": "IDHrwv_RCildFvmfWTkj5Q", "review_id": "BpINCFkkjHDMoVK8O6WhJQ", "text": "I came to Ted's last week to meet up with the lunch UYE group, but I was a little late and they were on their way out.  So, I waited in the line, alone, to order a dog to go.  The funny thing, they call to you from behind the grill to place your order.  As they were calling for my attention, I looked around over my shoulder as if to say, \"Oh, you're talking to me\" when the cook was calling for my attention... haha, that's something you should look out for so you're not caught off guard if its your first time around the block.\n\nI got the beef dog with ketchup, mustard and a pickle.  They grill the hot dog on an open flame.  The dogs don't taste \"grilled\" enough for my tastes, but it was ok.  I really enjoyed the onion rings that I ordered on the side.  Very tasty.  \n\nI won't miss this place if I don't go back.  But if someone wants to go, I'll meet them there.  No problem.", "business_id": "jJhNOhuGpIsJX5SEUFFWYQ", "stars": 3, "date": "2013-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "15sKxwysNE1jDpz45T3QIQ", "review_id": "RF9xV_ANR9Qs1l-QRXjrfA", "text": "Got to admit, this place is somewhat of a dive. But this is the BEST hot dog place in the west. And im not the only one to think thag way. There currently ranked 8th in the usa. Best hot dogs. Charcoal grilled with whatever toppings you want!!!!", "business_id": "jJhNOhuGpIsJX5SEUFFWYQ", "stars": 5, "date": "2014-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "l9GGMi-zf2ZTbHbW8wrkTw", "review_id": "-kj7rMwXfWYFxD2daAjd6g", "text": "Our first visit here, we came because of the great reviews and weren't disappointed. They have great music, throwback atmosphere was enjoyable and service was prompt and friendly. \n\nThe burger was definitely better than your typical burger. It had a soft bun, and it was served nice and hot. You watch them make your burger and choose toppings as you go. The horseradish mustard was a definite plus!   Toppings were fresh. Bacon was cooked perfectly. \n\nFries were good-shoe string style. Onion ring style isn't what we prefer but many enjoy the crumbly coating type - we prefer beer battered. \n\nWorth a visit if you're in the area.", "business_id": "jJhNOhuGpIsJX5SEUFFWYQ", "stars": 4, "date": "2015-06-13", "type": "review"}
{"votes": {"funny": 3, "useful": 0, "cool": 1}, "user_id": "15J3D1xNze1NbO2SoqAQfg", "review_id": "RKxpXG5M0lfHDZIVndP73w", "text": "This is McDonald's, you know what to expect and they deliver it consistently. If you're writing a bad review about McDonald's, you may lack self control or are just a cranky person. McDonald's is a great place to indulge in unbelievable french fries and tiny wonderful cheeseburgers, but only a few times a year.", "business_id": "edC8euBdO5hxRHRs3RIvZg", "stars": 5, "date": "2013-06-09", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "rki9kgnq2ADkC8sM0wwnww", "review_id": "Tjay4r0bumULHeJ1z9ipOw", "text": "I went in for a late lunch. The place was nearly empty, and my waitress was very nice. It was happy hour with drink specials and half off appetizers. I got two apps and two beers for only $12. All this said however, I don't think I'll ever go back to Applebee's. I went all the time for lunch about ten years ago, and boy the food quality has gone down a LOT. Everything was disgustingly salty and greasy. I have felt sick all day. Pick up your game Applebee's!", "business_id": "9pGs5hcA-13x5o97XcMt_g", "stars": 2, "date": "2014-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "441f-HT2kYoButncns44kg", "review_id": "nDNtdz-fiMe_sJ6_ndBBgg", "text": "This location needs serious help. Middle aged guy that takes orders has to be on drugs. I've never seen such crazy frantic behavior from someone who is in charge of handling cash!  Then there is the older guy who is an absolute dear but I don't know if he can't hear or what but I always have to repeat my order a hundred times. The only reason I go back is because I like croissants and they are close to my house.  Another place, like Wendy's,  that even though I always order the same thing it is somehow always a different price (maybe the tweaker is supporting his habit, IDK). I've never been inside and I'm betting if I did I would probably never go back.  Ignorance is bliss.", "business_id": "saDJPEJvnionK0PZwSF9FA", "stars": 1, "date": "2014-08-21", "type": "review"}
