{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FNbm3ycU2BF8C17UFfWzOg", "review_id": "uSoZMwdnhiegEpbXCwWATw", "text": "Good Luck getting a seat, that's all I have to say. The Gab and Eat is famous and infamous. Diner food is what's up and I like it. When I was a roofing mechanic, we'd meet there before work. Although I'm not sure I would recommend it if you're working were there's no bathrooms. hehe", "business_id": "b9WZJp5L1RZr4F1nxclOoQ", "stars": 4, "date": "2007-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QLCLF1xQqBZP4iMYlhtiUw", "review_id": "P53B9yIUkdEBvXpinN4cYg", "text": "While the Dor-Stop is a cute place on a nice tree lined street, I'm not sure what the big fuss is all about. The food was only fair and they don't even have real cream for your coffee. It's that nasty fake nondairy crap. It also gave me the heebeegeebees due to the \"Christianesgue\" motif.", "business_id": "2Igiyhi82R8_QaaPplRmCw", "stars": 2, "date": "2012-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "CiCmxCruMvbXtjQP5FhbLg", "review_id": "aj0JvlBNpBfmr5pNzuNrKg", "text": "Folks this is very overrated.. they had Guy's Diners Drivein and Dives there only because Guy's parents knew owner. This is very avg food at best. Its nothing special.I wont go back.. Very small and uncomfortable. They have a large sign in window to play on Guy's visit a number of years ago. Dont fall for it.", "business_id": "2Igiyhi82R8_QaaPplRmCw", "stars": 2, "date": "2014-06-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GS1TU8AaJ8ZXtd8aaqEQbA", "review_id": "8jBWbq_RxhL0dpYUiJc6Gg", "text": "Been to a lot of places in the burgh for breakfast. This place is the best. No questions asked. Pancakes are to die for and the Guy Fieri jumbot is insanely delicious. The place makes Pamela's and DeLuca's look like the McDonald's drive thru.", "business_id": "2Igiyhi82R8_QaaPplRmCw", "stars": 5, "date": "2015-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "W6axXzZrvnkf9lqd4wIx7g", "review_id": "OC-hPmHM-gyhgFYmzu8AKw", "text": "Repeated my order 3 times and it still got screwed up. I had a feeling something was going to be off and sure enough....", "business_id": "uwiD9jxs09xxXG0by_xKuA", "stars": 1, "date": "2015-07-24", "type": "review"}
{"votes": {"funny": 4, "useful": 15, "cool": 12}, "user_id": "TYdOKKLtA7LITxV7Y2_wjA", "review_id": "573Bc4U4dhXQ6WnBEWbg_g", "text": "Without a doubt one of the nicest places I have ever had the pleasure of laying my head...\n\n...having wine and cheese...\n\n....or breakfasting.\n\nThe Inn on Negley is gorgeously appointed.  The individual rooms, all named for varieties of apple, are spectacular.  We were in the lovely Northern Spy.  The bed was wonderfully comfortable, the linens unbelievably soft and luxurious.  L'Occitane bath products smelled divine.  The Shadyside neighborhood outside of downtown is quiet but still conveniently located to all the Pittsburgh doings.\n\nBreakfast each morning, cooked by the hospitable Chef Jackie, is pure pleasure.  Each night on your pillow a menu card appears; check off what you'd like in the morning, what time you'll be eating, and drop it off in the dining room.  The next day, Jackie is ready and waiting with a fresh fruit plate, the pastry of the day, and fantastically strong and flavorful coffee.  Omelets and fritattas are made with local produce and eggs.  Irish oatmeal is served with milk from a nearby creamery.  Toast bread changes daily but is always whole-grain and delicious.  Breakfast meats are lean and filling.  \n\nAfternoons, iced tea and cookies are set out, and in the evenings wine and cheese served.  Enjoy them in a rocker on the front porch, relaxing on the back deck retreat, or in the privacy of your room.  \n\nStaff is not only eminently professional, but warm and gracious.  Heidi at the front desk was beyond helpful in making suggestions for what to do in the city or where to eat (I will be forever indebted to her for recommending what was probably our best meal of the trip at Soba).  If you ever find yourself in Pittsburgh, lodgings can't get much better than the Inn on Negley.\n\nThat's probably sufficient gushing.", "business_id": "rUQfZOengMpXFkLvJrNJ3g", "stars": 5, "date": "2011-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "SRs6FLNxRL7XotkkrZrkhw", "review_id": "oAGso5l9U_k8EvBl4G0a6Q", "text": "Best Breakfast in town for a cheap price", "business_id": "TxKmAsKQjND5vbhBdUSyIA", "stars": 5, "date": "2010-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aE2D1U8BG8k2uOtXukS1JA", "review_id": "wYpAOqIEbHPwZP2DDLW0CA", "text": "Great place for brunch. I love the breakfast specials", "business_id": "TxKmAsKQjND5vbhBdUSyIA", "stars": 4, "date": "2013-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gH1AY1x_pGr-oP_UhqXFbg", "review_id": "M2Mvo_4R_bbhSeHLpaZPPg", "text": "Outstanding breakfast! Had scrambled eggs and chorizo hash....yummy! The hash was nice with a bit of spice, eggs were fluffy and cooked to perfection. Just be aware that they only accept cash.", "business_id": "TxKmAsKQjND5vbhBdUSyIA", "stars": 5, "date": "2015-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YKHcKqW2jsFbjYFhdAIF8Q", "review_id": "nPHB6jGWEaW9CUXTzkYrDQ", "text": "Best breakfast in Belmont....love love love the White's", "business_id": "cbLaFQJOfzDy_TxMkPee9Q", "stars": 4, "date": "2013-06-30", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "cCO4Y-Uca1MDcIjdOt5VkA", "review_id": "4_Q15K5Rvf-R26jrAjtEmw", "text": "The singularly worst dining experience I have ever had.  Service was extremely slow.  We were repeatedly served raw chicken.  A complimentary basket of fries offered to keep our hungry children happy during the repeated food returns was added to our bill.  On the third plate of raw chicken we decided to leave.  We asked for the raw and inedible items and the fries (that we had not ordered) to be removed from our bill.  We were willing to pay for the drinks and few edible items and the manager harangued us.  Then the owner showed up and after harassing us for awhile took the entire bill away and made a loud bizarre speech about what a great businessman he was.  Meanwhile other tables were also experiencing issues and walking out.  We handed our poor waitress, who was the only seemingly competent person in the place, a generous tip, walked out and ordered carryout from a different restaurant.  The entire experience was bizarre from start to finish and the manager and owner's behavior was like something you'd see on \"Kitchen Nightmares\"", "business_id": "b856Q36EWKbwbm_XdJER8Q", "stars": 1, "date": "2010-07-01", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "eK5xstU6CPK-SyfDuMZNQw", "review_id": "Jvtuwn_XrXijX1v99oAGDw", "text": "Let me tell you gents this place is totes av (average). Really not much to say. If you like food you'll probably be able to eat some of it here. My friends at the table insist that I rate this place as \"good average\" but that seems meaningless. Also $2 beers of which I've had about 6.", "business_id": "hIQRiE3UsYH7UsrsDwJwLA", "stars": 2, "date": "2010-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wGWFzdgnSEe7C6UjoW8Q3g", "review_id": "0sXzqSxFODCIGj5yoKhFKg", "text": "Only been here once but, that one time brought me the best scrambled eggs I've ever had in Charlotte, maybe anywhere.  Moist and fluffy and exactly what I have in my minds eye when I order scrambled eggs but almost never get.\n\nPancakes and sausage were boss too.  5 Stars until I show up again and they happen to offer less than the aforementioned perfection!  As always with my reviews of fine South of Uptown locations, my only complaint is that it's too far from home.  Any of you getting the idea that I need to pack up the family and move?", "business_id": "UzMMpUFwJhwUkHOyeXeWsQ", "stars": 5, "date": "2011-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "181fWsw2T4fMwkI8s4j3qQ", "review_id": "5WfxYvqtYXpvy9Jo_W2X9g", "text": "Service was great! I recommend the omelettes, and the French toast is pretty decent. Our server Melissa was very attentive and extremely nice. Will be coming back for sure!", "business_id": "UzMMpUFwJhwUkHOyeXeWsQ", "stars": 5, "date": "2015-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z4kLIPeX_lE1pUCxfgC_3Q", "review_id": "aX6TGtj6vL0kjhMcFwa1Lw", "text": "So tasty! They recommended a bagel for me that is beyond wonderful. Fantastic customer customer service, delicious food and great coffee!! Wonderful experience. Hope to come back soon", "business_id": "zOY-W35waCcBWDmjX7_MFQ", "stars": 5, "date": "2014-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DAYx7CpojTLZ6CJ-X-yCgQ", "review_id": "G-UhbgLHVVGzZ-7DYJe4Dw", "text": "Had breakfast at Three Sisters a few days ago while at Middleton for a meeting.  Very \"down home\" place.  Mexican flavorful dishes along with midwest-country favorites.  I had some eggs and the Mexican hash browns.  Great way to start the morning.  Friendly staff knew the customers and welcomed new-comers.  Patrons here ranged from seniors in high school to senior citizens.  Very congenial.", "business_id": "X47o6R2rWiqGqvBtC7VS3Q", "stars": 4, "date": "2013-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "eQSj2Pg6zlybas4UfipmrQ", "review_id": "7CXcYoChL_fUpNENYzcbnQ", "text": "I really like CB for a good breakfast meal. I still think the Original Pancake House trumps them...They are in a league of their own but the CB does provide good quality and breakfast for a excellent price. You can feed a family of 5 and everyone be full for a great price. \n\nBeing someone who doesn't  eat pork and this being a breakfast country restaurant, I am very pleased that they have turkey products like bacon and sausage. The menu is very large as they have  two, one for breakfast and the other for lunch/dinner. \nService has always been good when I've dined there and the staff has good knowledge of the menu. \n\nI reserve 4 and 5 stars for upscale and gourmet restaurants but is give the CB a solid 3 stars.", "business_id": "QF14BFUVHRODxGNVflgm3A", "stars": 3, "date": "2014-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lmzyA38QR3GJ4MP4uErFGg", "review_id": "AVYO0b_LZBLItLF0CFKn0A", "text": "Outstanding breakfast!  Eggs so fresh you'd think they had the chickens out back.  C ordered corned beef hash and was delighted to find that they mix in grilled onions.\n\nHighly recommended.  An institution in Champaign.", "business_id": "vBg5V39Vf4eTx1JVgl_5Pg", "stars": 4, "date": "2010-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "VS89OpdxlLsD7tLtmqjcUA", "review_id": "VqJ4-vX-Io18vjytFGWUtQ", "text": "Cheap and delicious. Try the french toast.", "business_id": "2UAbUSTMsR9G26A8AYO3dA", "stars": 5, "date": "2015-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aGAhoz0xXGaeDznMzC68tw", "review_id": "vbgerjb_4fG3s3O0PHP71A", "text": "Definitely a nice little breakfast place with delicious food. I would recommend this place.", "business_id": "6HKjKhgDLBpuZFNBOCzVQw", "stars": 5, "date": "2015-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WwsJZEwwTSf0g_3qlBjUIA", "review_id": "0NFXdE1yjuPXIWOau_-VkA", "text": "I visited Radio Maria nearly 4 years ago with some friends after a Salsa dance lesson, and I  could not remember the name of this place for the life of me. I am from Danville/Champaign  area, and I drove by this place all the time in the daylight, and I never even noticed it. It's definitely for \"friends\" after hours.\n\nI remember I had the Arancini....holy crap was it DELICIOUS!!! \n\nThe vibe was chill and trendy. A bit upscale for my liking...but eh, to each his/her own. I personally believe the restaurant needs to do more food advertisement, because I think the only thing that either my friends, acquaintances, or myself believe the reason that this place gets any business is because their bar service on the patio after dark.", "business_id": "AB5RgQ0ZnMThdqgFS3cPuw", "stars": 3, "date": "2012-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XOKy3A0DCZuzeglHZw76XQ", "review_id": "RgnIjWacovYf7C6zm0LpUQ", "text": "I had a boss who was obsessed with this place.  They have good hummus and I like the fried plantains.  Otherwise, it's fine.  Brunch is the best time to go.", "business_id": "AB5RgQ0ZnMThdqgFS3cPuw", "stars": 3, "date": "2015-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iTjvroZGBRWeUhV_4DkH9g", "review_id": "4pLE5CKSwKmS5MMnX9orQw", "text": "Decent food, decent service, but usually very busy. I attend often.", "business_id": "P7wKlbSRsoRrfH3DFOY08A", "stars": 3, "date": "2015-06-21", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 5}, "user_id": "8RzsGBVrqLWLCE8sOSYQkw", "review_id": "mbnMRbl5PT65gngj0kvBtA", "text": "Prior to dining there, I was unaware that they are the same company as the Good Egg.   Of course, had I known, I would have driven a stake through my eye rather than dine here.   This is because, as the previous reviewer noted, dining at the good egg is like playing chess with yourself:  The sort of thing you do only in times of absolute desperation.\n\nGiven that, my expectations withered to McDonalds levels once I sat down and figured out about its nefarious affiliation.   However, I was mostly pleasantly surprised, a feat which isn't hard since the bar was set somewhere below sea level.   I had a bacon, egg and cheese sandwich.  The cheese was a tasty brie and the bread a thick and fluffy sourdough.   The eggs were bland and shitty (read: from a can) but the bacon and cheese made up for it.   \n\nAt 7.50 for the sandwich, it's far from a bargain but it wasn't a complete waste of money.  The service sucked as my server struggled to refill my soda just once.   When she finally did (well after dropping our check) she did at least put it in a to-go cup.  I like the message implicit there--\"get the fuck out,\" don't you?\n\nSkip this one and go to Denny's at least the suckage won't surprise you there.", "business_id": "SkNUbFJiJtbZjY-S_S0u7g", "stars": 2, "date": "2007-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "922TKMD60Oor4uHsPjL5Hg", "review_id": "4tc2spK4zoZhUvshyv2uHQ", "text": "I had the pleasure of eating lunch here today and it did not disappoint! \n\nWe split \"The New Yorker\", a delicious and very large corned beef and pastrami sandwich. The meat melted in your mouth and had the perfect amount of flavor between the meat, Russian dressing and creamy cole slaw. \n\nThe french fries weren't the best and the sandwich is rather pricey but overall I give this place four stars. I am looking forward to a return trip very soon!", "business_id": "PxeX1M8WtyPxX1MuuGIh-g", "stars": 4, "date": "2010-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QDJTVsUzhkYOGhLsyBLbUg", "review_id": "jDJnN-5kmasUtUg3Bk9UUw", "text": "Best breakfast sandwich ever! I may be biased because 1) I love bacon, egg and cheese sandwiches on a fresh made everything bagel almost more than life itself and 2) any legit east coast, Jewish deli, complete with that East Coast attitude makes me feel like home... But seriously, their bagels are amazing, they fry their eggs to order perfectly (easy, medium, hard), and the cheese is a perfect consistency every time! I've also had their brisket sandwich and their pastrami - both of which do not disappoint in any way shape or form. \n\nScott's is definitely my go to when I want a little taste of the East Coast!", "business_id": "PxeX1M8WtyPxX1MuuGIh-g", "stars": 5, "date": "2014-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "ZUx-B52hGRhmeUDVukmjrg", "review_id": "lIlya10muCWpzqGcg86fqw", "text": "This is a nice treat I allow myself once in a while. I love the garlic bagel. (Truth...I wish Einstein's did not put sesame seeds on their garlic bagel but they added that years ago and I don't think they will ever switch back.)\n\nThe service here has always been quick and they almost always give just the right amout of cream cheese.", "business_id": "KNIw6kwf8LZkrS1lEnaLiw", "stars": 4, "date": "2012-07-16", "type": "review"}
{"votes": {"funny": 2, "useful": 6, "cool": 1}, "user_id": "jt8jtEY1K6TD1FBzYa7HGw", "review_id": "zbq1tBqfEJhjLF3fdmK_8Q", "text": "So, I've been going to this place for years, not b/c the food blows my mind, but rather it hits the spot. Plus, I love sitting on the patio drinking wine when the weather is nice with my best gal. \n\nAnyhow, my other best gal, my mom had never tried this spot. I  thought Duck would be great for a quick casual lunch. She's a vegetarian so we ordered the Where's the Beef sandwich to share. It took about 20 minutes to make the sandwich, which feels like an eternity when your hungry.\n\nWhen I glanced at the sandwich I thought perhaps they had added some portobello mushrooms to it. Turns out, the dark brown layer was actually rotten avocado. REALLY!!!!??? I mean come on! Avocado is like prime rib to vegetarians. How can you F this up? It was truly nasty. It got me to thinking, if someone actually put this into the sandwich, what else would their low standards allow them to place into an unsuspecting victims sammie. It's not like they make them with blindfolds on. I was really grossed out.\n\nWhen I brought it to the manager's attention, she didn't seem that bothered by it. They remade half a sandwich for me, and that was that.\n\nIt was annoying b/c I left feeling that Duck & Decanter takes for granted the fact that loyal customers will stick with them no matter what. Well, not this one.\n\nPlus, that place needs a serious dusting. Yuck.", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 1, "date": "2011-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8eBP2hoUO6ZWNmCX8f3wtQ", "review_id": "DiqSYUXUqFxzOK2226mEtA", "text": "One of the great staples in Phoenix, the Duck is one of those places I've been going to for years--as have most Phoenicians.  You cant go wrong with their huge selection of gourmet deli meats and cheeses.  Their basic \"nooner\" sandwich has been around forever and we always get great service.  \n\nOf course, the wine bar/pub area is kind of a locals secret getaway with a huge wine cellar and some tasty beers on tap--especially during fall patio time.  If you're ready for a sandwich that is a cut above your standard deli chain, I would recommend trying the Duck.", "business_id": "HIiVx2mseVWKtx8TKfWC_A", "stars": 5, "date": "2014-07-30", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "saLlX6WK6rSy6eShPxnkzA", "review_id": "mVKvxfcuEiR0ZyFbyJ329w", "text": "Last weekend we went to Wrigley Mansion for the fabulous Sunday champagne brunch and it certainly did not disappoint! This was my 4th trip to the Mansion for special occasions, and I was sad to see how empty it was compared to the previous times I had been before! We had a 1PM reservation and by 2:30 we were pretty much the last table in the place.\n\nHowever, the servers were wonderfully friendly and helpful and the food stayed replenished the entire time, which I appreciated greatly since it was such a quiet day. \nThe best parts of the brunch are the endless champagne/mimosas and the variety of the buffett, especially the seafood and omelet stations. Last year we decided to try a different brunch spot and it was not even close to Wrigley. Plus, it is so reasonably priced! (around $40 a person) \n\nSo in summation, if you are looking for a great brunch with killer views, look no further.", "business_id": "yPfvOB63thP5t3pGZPJExA", "stars": 5, "date": "2009-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "qR09EUhlR6g_NU6u5gbI8A", "review_id": "jER89s55__KBd0mYBXe5ow", "text": "Excellent food, delicately prepared and presented with class in a gorgeous setting.\n\nThe atmosphere of the restaurant reminds me of a Lyonnaise or Aix-en-Provence cafe. Frequented by more mature locals, it is quiet and composed, an excellent place for conversation. It's a little rustic and by no means formal; the service is inviting and just standoffish in southern French fashion. Best for smaller groups, no more than 4-6 people.\n\nI've tried two dishes here, the Coq au Vin and the Salmon, and they both blow me away in terms of flavour. The portions are intelligently small, and each meal comes with some of the best mini-croissants I've ever tasted and a rotating dessert. \n\nThe only fault I can find are the prices; at $7-$10 a meal, I feel almost obliged to use the tip keep from feeling guilty. An absolute steal, hidden away.", "business_id": "oc0Wl6ktfMLb5VZ2Uz6M2A", "stars": 5, "date": "2009-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "CxVeGNLyF8Gj-8lyVASUyA", "review_id": "yFerTCYW_VxhUGqWPmyNVw", "text": "Absolutely Amazing!!!  Perfect sized portion.  I had the sautéed salmon. In a very light cream sauce.  This was a wonder find while on a trip from Vegas!", "business_id": "oc0Wl6ktfMLb5VZ2Uz6M2A", "stars": 5, "date": "2014-07-19", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 4}, "user_id": "54wr4oNkJsvaHM1U5n4iUA", "review_id": "j3nGE8hkYIYWR4OfOaYrDQ", "text": "This place gets a Phoenix 5. Probably lower if it were in a better city.\n\nPostino is probably the best wine bar in the Valley, next to Kazimierz in Scottsdale. I like Kazimierz for its olive selection. Postino wins on happy hour wine selection (5$ any glass) and bruschetta.\n\nI'd recommend this place to anyone who wants to drink a strong selection of varietals. Other wine bars seem to fall short on interesting, new and lesser known varietals.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2008-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f5CqKZlqK9Sox9z9wuooCQ", "review_id": "hDC7Ogsbzc_PblZjS3FhHA", "text": "Went back just to see if it was as good as it was the last time.  It was.  This place is worth a stop.  We took friends and they loved it.  The bruschetta and antipasta board are great.  Wines by the glass also very good.  Go, go, go.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2009-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UKEoR821QJ6kTXzaNMSQJw", "review_id": "A4djV4Ct0GayhamBjRIpzw", "text": "When I visit an other place for dinner, this is the benchmark. I love the food and service is always top notch. You have to pay to park, but its worth it. Work your way through the menu, its a great way to spend the summer.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2010-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w6-zZDRByCDBge6ROqMoJQ", "review_id": "cS2MaX35FVK-NfB8vsOJhg", "text": "Came here twice and loving it. Great place to take friends out for drinks And chill. Or on a hip date.awesome  food and price. Favorite is the smoke salmon brushetta.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2011-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "tmTxuDadTVc-KFyhvPuseQ", "review_id": "uc3rajsn0i5uhDLefww_yA", "text": "My friend and I decided to meet up on Sunday to catch up and decided on Postino's because of their day time drink specials and their Sangira Sunday deal.  I know they are a busy place so I went a few minutes early to grab a table since my friend was driving from N Scottsdale.  \n\nThe Hostess was friendly and told me it would be a 15 min wait for a table so I headed to the bar to grab a drink.  15 minutes pass and I see others that came in after me being seated.  20 minutes pass and I ask the hostess how much longer it would be.  She told me that she couldn't seat me because the rest of my party hadn't arrived yet.  I said yes I am waiting on 1 other person but I came early to get a table while she drove down.  The hostess told me they were busy and can't let people just hold tables all day for their friends.  She rudely said she would seat me now since I complained and lead me over to 2 lounge chairs with 2 wobbly end tables pushed together to make a table.  The idea was cute but made for an awkward eating experience since I was leaning forward and bending down to enjoy eating my lunch.  I had specifically asked for a table so I wasn't sure if we got seated at this table because I had complained as there were other more eating friendly tables available.\n\nThe whole ordeal was very off putting so my friend and I stayed for a bit and then went to another restaurant", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 2, "date": "2011-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wIi2J1UGRB2G_3vu5eNK3g", "review_id": "lkTSpazh41pZ2CVPruj-Mw", "text": "I didn't think I could love anyplace as much as Postino Central... but I stand corrected.  After finally making it to the Arcadia location, I must say that I loved it equally, but differently.  \n\nArcadia seemed a little more comfortable with a relaxed vibe.   The perfect spot to have a casual chat and some noshes, without having to get all done up or break the bank.  \n\nMy favorites are still: bruschetta board (especially prosciutto with fig & mascarpone), mixed greens salad, and the salted caramel sundae - all are perfect for sharing!\n\nthe parking situation is a bit of a nightmare.  The valet is free, but only if you are going to LGO... So as a Postino's patron, you will need to pay $3 for this service.  you might be better off in the free parking across the street near the Arcadia Room.\n\nTIP - Be sure to sign up for their email list for birthday & anniversary specials!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2012-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HtJ0M0ZjxY3S6u-60xApCg", "review_id": "0RlfFS6bWxW_htkdbQMU8w", "text": "Simply the best bruschetta in the world! arugula and prosciutto fig & marscapone is my favorite but all of them are worth trying at least once in your life. Can't wait to return to Phoenix one day and come back for more.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2013-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "b55NYJJavY4rXXx8V3HaFQ", "review_id": "0Ox078ubMnMDGzHVYb-QZQ", "text": "1 star is taken away due to the parking situation .  The food and atmosphere are good.  I've been here for brunch on the weekend when the doors are open and they have live music.  It's a good time.  It's a great place to grab a glass of wine and some bruchetta and hang out with a group of people.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 3, "date": "2013-07-11", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "O3F9oWq1WAVdw7v6RMTBAA", "review_id": "Hdpek2MAjR8naBcifzn03g", "text": "I totally 100% agree w Serianna T.\n\nI have felt the same way about the seating, and parking and mediocre foods... Postino and LGO are complete cluster F***s for anyone who plans on driving there. I also feel like the general atmosphere is trying so hard to be relaxed and casual that it is stressful for the guests.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 1, "date": "2013-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mn5cKM_fYVwLlqFx7BqDtQ", "review_id": "5XaAaJWWetrZRPFEI1G0sQ", "text": "It is a very nice place but they kinda have you waiting for a little long after you're sat down.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 3, "date": "2014-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "EFYd4BUZFPWVDky2P1oRvA", "review_id": "0eQ4Bh8ny80k0FPWES_etw", "text": "I came here for lunch with a girlfriend last week and I have one thing to say:\n\nErrmahgerd, the bruschetta.\n\nI can be pretty picky when it comes to quality of food while I'm dining out. If I'm paying for it... I want it to be good. Anytime I visit Postino it never disappoints! Great atmosphere and delicious wine. Plus friendly service and fresh food. What more could you ask for?", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2014-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8tFQHdpmO6Ydwy3OP7N8zQ", "review_id": "w2sA2bQsXTkBQX1LKb-_rg", "text": "Great neighborhood joint can't beat the bruschetta and a cold brew to relax and unwind.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2014-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "557_S400_TnnSLKo-r3lHA", "review_id": "HW7ywv0OyPs9jEoMLtRGQA", "text": "The absolute best! I've been here MANY times and I've never had a bad experience. They always get our orders right, the staff is friendly and attentive and, most importantly, the food is always divine! You really can't go wrong with anything that you order. Enjoy!", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 5, "date": "2015-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "77jywQZVdlLgY9ebZYQfQw", "review_id": "K5Nnwlisl2pcKlnGFULY2g", "text": "This location is the original Postino and they are definitely doing something right. The food is excellent and they are almost always busy. \n\nIf you're unsure of what to order, you can't go wrong with a bruschetta board. You get to pick four different types for one board. Get are great for sharing and you can't beat the price. Their raspberry chicken salad is incredible. It has a lot of flavor and isn't drove in mayonnaise. There are a number of sandwiches and salads that you can mix and match during lunchtime. \n\nIf you're looking for a beer or glass of wine, you can get one for only $5 before 5 p.m.  It's a great spot to meet friends and they have a nice outdoor patio that is great most of the year. Just remember it can get a bit noisy.", "business_id": "SDwYQ6eSu1htn8vHWv128g", "stars": 4, "date": "2015-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6l1PGyH1vwmh28cavv3gzA", "review_id": "faRzeX_Dj4ty6nwz33nLTQ", "text": "If your into over cooked eggs and your hash browns drowning in oil accompanied with a server with a chip on her shoulder, then this is the place for you.\nI will never return and i recommend you reconsider before going and dropping the money they are asking for this sub-par food. Go to Denny's, your food will be prepared much better and taste just as equal with probably better service. At you wont have toworry about your server reach over you and across the table to pick up your straw wrapper. I mean really! Ask me to hand it to you, DON'T reach across!", "business_id": "UxvOXcoCRFRAVhRB0D9imw", "stars": 1, "date": "2011-07-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "Ebi30JkOwUzAI-qRchF-xw", "review_id": "5l_eMetGWLNEfhbtKVKkRw", "text": "It doesn't matter which doughnut(s) you choose, they are all incredible. There is no comparison. Rainbow doughnuts are addicting.", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 5, "date": "2012-08-22", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 4}, "user_id": "ysBQMZiuZ7VSu_YAh-lE0Q", "review_id": "TECcRoTXgETX1nR-eGCx5w", "text": "My husband and I came here for Restaurant week.  I really like the location for the Restaurant and the atmosphere too. \n\nNow for the food, it was not all that great. First the appetizers were ok, my husband ordered the chili and it had no taste what so ever and he traded it for a salad.  When the salad came out it was drenched in salad dressing. :(  I ordered the Mac & Cheese and it was not that bad tasting.  Then the entrée's came out and I had the Filet and my husband had the Short Ribs.  The Filet was well worth the $30.00 for Restaurant week and the Short Ribs were very fatting.  \n\nFor the dessert, the Deep Dish Caramel Apple Pie and the carrot cake was amazing.", "business_id": "Y3a3RkR97J_ReiKgiMXeJg", "stars": 3, "date": "2013-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qHFq2Yda2w4EQ6r_tSAwOg", "review_id": "t6gxaNQlneHiDIdSrq9OZQ", "text": "My family and I go to IHOP, but we always request for SEAN!!! Hostess says he's always requested and that's because he makes your day and welcomes you like family. He calls my son muscle man and my son always enjoy remember him. I have the same thing all the time and Sean already knows it. So long as he's there and my server we will continue going. Wish there were more awesome people like him!!!", "business_id": "p1ntTC9-CI6x5Y_nUoo6Ag", "stars": 4, "date": "2015-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VD-RoEyU02NGG7655PMfSA", "review_id": "bBHmLeaqk1n9b3W5lA-cHQ", "text": "This is a good place to go for breakfast or lunch.  I don't recommend their dinner entrees.  I think their pricing is high, but comparable to Coco's or IHop (around the corner).  Overall, very fast service, and hot food.  My favorite is their BBQ Burger.   They have good chili too.  Breakfast is the best -- especially their french toast.  The only negative is the lack of large group seating.  This location has booths, so they cannot put tables together (Camelback and Scottsdale can).  Also, they tend to seat people rather oddly which can leave a large group waiting for a long time.", "business_id": "DfLML2IlhUqztTBURxOAxg", "stars": 4, "date": "2010-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "omF7xEzrgRFtCw8_EKq6Gw", "review_id": "TCD0hOHFVDTVmfZuxEzvIg", "text": "Greasy, low quality, disgusting food. \n\nIt's getting 2 stars because the waitress was friendly and the menu doesn't pull any punches: the pictures look exactly like what you get. But what you get is pretty bad. \n\nA friend ordered breakfast patties, they were maybe slightly larger than quarters. The hash browns had the consistency of greasy noodles. The signature waffle was just ok, but nowhere near good. \n\nHow these chains are all over the country I have no idea. Sorry, America.", "business_id": "sh1-BzB29lIOA2qQ_PxN-A", "stars": 2, "date": "2014-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b2DKC4kC8-QeSeGZ_MF3XQ", "review_id": "Zv4X7nsbr18CBxkn8-w5Og", "text": "Who knew this place was here. Located in South Phoenix in an area you wouldn't expect it.  Great for it's picnic type atmosphere and good old school healty food.  Don't forget to try the desserts as they are heavenly.  Summertime it is a great breakfast place on Saturdays but arrive early or you may have a wait.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 4, "date": "2010-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1WahYK6Lkd66LYCV8mL1bA", "review_id": "T4y3ozPF-CTv846pzQLmHA", "text": "Never would have thought to put squash, asparagus, corn and eggplant inside an omelette. It was however one of the best omelettes I've had. My wife and I definitely plan on returning to this great location for the ambiance and food.", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 5, "date": "2015-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "VP7yztt_xjKulYRFc5V2GA", "review_id": "u3dk_5CtplGvdYUGdIBONg", "text": "Great bagel place!!! The breakfast sandwiches are on point!! The staff is always friendly and efficient. Give it a try you won't be disappointed. It's the best bagel spot in the Tuke.", "business_id": "8H1DwdAAgSBtwDeb2R-hmA", "stars": 5, "date": "2013-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r-vQtb7d50IhNxC-Lvyu9A", "review_id": "2_guFzQfVbBWH6TjX-y06Q", "text": "The food here is incredibly awesome! I ordered the South Mountain Burrito. I can't begin to tell you how delicious it was. My taste buds were in heaven!  I will also say that my biggest pet peeve is having your food arrive cold. NOT the case here. My burrito arrived literally hot off the grill just the way I like it. You gotta come here. I assure you that you will not regret it!! Bring the whole family!! Enjoy!!", "business_id": "8H1DwdAAgSBtwDeb2R-hmA", "stars": 5, "date": "2015-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8Y58xwPu-PhkyqzFiGQ-JQ", "review_id": "n9qKNXO47OQbP3vDtOAq3g", "text": "Freshly made and delicious. Also, a good price!", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 5, "date": "2010-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "60t3AGDYeZF5be-yc4IqZg", "review_id": "9JgMATj9DvzIbGokilS6fA", "text": "The BEST veggie burrito ever.  One of the freshest most delicious burritos ever. Something I look forward to eating, every time!!", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 5, "date": "2011-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "U2kTz-j7flBvoplxEFGkcQ", "review_id": "YO71XpqhJe_xXjunYAXp7g", "text": "This place has some really good food. I got the Bombero burrito with chicken (you can choose your meat) and some carnitas tacos. Both were excellent, but the Bombero burrito is what made this experience great for me. It has some unique flavor and good textures and taste. Highly recommended. Also, the prices are reasonable. I think it was $5.25 for the burrito and $1 for the tacos (but the tacos had special summer pricing.)", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 5, "date": "2013-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GRDbM_RysPtVT2lLlN1IGw", "review_id": "32-IKVVYtBAfMaeNJLqmPw", "text": "Oh my goodness, where do i even start. The steak tacos are probably the best tacos i have EVER had. The first bite and i was in love. The meat is full of a delicious, juicy, smokey flavor. Unfortunately i was only in town visiting, i live in California which means that i would have to drive 6 hours to get a hold of these tacos.", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 5, "date": "2014-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QnjsgcuF9gyaachH0F8Q-g", "review_id": "RFJM70xEt-e1RGfGWGlWBg", "text": "The carne asada and carnitas tacos great!   Would definitely go back and try something else next time.", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 4, "date": "2015-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VDyedSHK4N-zpVLKTNNEDg", "review_id": "C7_JWEnMITG_yXnxzIJ5bQ", "text": "This place is amazing.  The food is truly authentic and offers a wide variety of good, home-style Mexican food.  Los Taquitos was featured on Diners, Drive-ins & Dives and is constantly busy.  My favorite dish they offer is the carne asada sopes; I also really enjoy the ceviche. However, they do cook up a mean breakfast burrito.", "business_id": "rDvz5jX65gpfONFu7er9Tw", "stars": 5, "date": "2015-08-26", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "5jerNBtV7fZRzXuo3a4Gwg", "review_id": "ndUdJtFrcBJzmFIIgz10Dw", "text": "Was in town from Boston, and had my first Cracker Barrel breakfast here.  \n\nYes, it's a chain.  Yes, it's kitschy.  The environment is very \"olde-tymey\" and cute, but the food is pretty great!  The servers were terrific, the coffee good, and the juices (both OJ and grapefruit) were fresh squeezed.\n\nFor *less than $4* you could get some hash brown casserole (baked with cheese and onions mmm), a bowl of fried apples (buttery, not too mushy, and tart enough to balance the sweet), and two flaky biscuits.  Unbelievable values on the menu.\n\nHad the pancakes on another visit - perhaps a touch too buttery, but absolutely delicious, just the right balance of hearty and sweet.  Good bacon too!\n\nClassic food, delivered simply with a smile, for a great price.\n\nIf I lived nearby I'd be coming back, a lot.", "business_id": "dGcVT0WGenhh8Np76ta6AA", "stars": 4, "date": "2008-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pmpBO2mZMj2iTKuDTyUiQw", "review_id": "sIGLiidKyfSXP2kNv1sJUQ", "text": "I'm not a breakfast person it's usually my least favorite meal and I don't usually mind skipping it......but this place makes me LOVE breakfast. Great food great service and not over priced and I love the atmosphere!", "business_id": "dGcVT0WGenhh8Np76ta6AA", "stars": 5, "date": "2015-07-12", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "joIzw_aUiNvBTuGoytrH7g", "review_id": "WsQKK7rd9PQIdjc0H-A0TQ", "text": "Tight parking here with the Albertsons traffic & carts.  Reasonable line wait times, though staff isn't fully trained with the slightest menu modifications.  If the menu says Egg & Cheese bagel sandwich, they shouldn't freak out if I want pepper jack instead of the American/Cheddar default.  Prices seem to be going higher at Einstein's in recent years and now it feels like a premium over fast food places, donuts, and almost a direct competitor to a sit down meal at IHOP or similar.", "business_id": "IYWTOj970XqG2z9Xft_8SA", "stars": 3, "date": "2011-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eia5Qt8pfrPNvYH-7Ht-Bw", "review_id": "CLIUBj3kMD4I_Rz7NhS7Mg", "text": "Great omelets. Good food all around. Pretty friendly staff and reasonable prices. It's a good breakfast place for sure.", "business_id": "8aPTQeDYOMNEu907WfflCQ", "stars": 4, "date": "2013-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "NqoaK7KuK20O8t5nLLgPLg", "review_id": "ESxs7Zdzzi-w1jsRym--Nw", "text": "Came here to pick up a pie we ordered. We love their pies and order them occasionally to have for get togethers, parties, etc. \n\nThis restaurant is your typical All-American place. This day, it wasn't particularly busy, which made it easy for me to get in and out with my pie simple. The holidays, this place gets PACKED and so does the requests for pie, so if you choose to order their pies for the holidays, be sure to book in advance because they sell out fast!", "business_id": "dbh72sNyNeHUgJqQye9Vbg", "stars": 4, "date": "2013-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MNWDDSmni5qUjMUHqeWZkQ", "review_id": "IIr33rZ7M8Ccagr4SGPNKQ", "text": "My group of 7 of went into the restaurant and Corinne pulled together a couple tables and took good care of us.  \nThanks to Corinne from all of us:) Corrine is an EXCELLANT server.", "business_id": "2D7amHyeakOVlsSywblMkw", "stars": 4, "date": "2014-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rjy5YPCjrxfOJPtPT3Mt-g", "review_id": "izL8edXxARB7T_vdnf_ANQ", "text": "We walked in and no \"hi\" or \"good morning\"Sandrah looked at us at least 3 times and never said anything...didn't even say someone will be right with you..finally a guy came and said how we were doing and be right with us..he didn't come back a oriental young lady helped us about 10 minutes later because she asked if we had been helped..talk about customer service!!!", "business_id": "eONS7DP6U9BV3lkqGAUbOg", "stars": 1, "date": "2015-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SzjLBHFdt7O35r2sVGxMfg", "review_id": "5j-W15W7ic_gvwOmSp7M_w", "text": "Had the turkey, Brie sandwich. Delish!!!!  Waitress was awesome. Great place for lunch.", "business_id": "qLXxp0rpzT4kG9tT3wZwfA", "stars": 5, "date": "2015-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Nn17z9x-R5ihcp_J53LUrw", "review_id": "6fPmae4D-PiEcAJTTycUGA", "text": "Love this restaurant! It has become a favorite. Great variety of choices offered for breakfast. Fast friendly service. Food is amazing! Large portions and great home style cooking. Never bored with breakfast again because this place has creative options and so delicious!! Highly recommended", "business_id": "2nzUx_M8Szyzsf4CszHasw", "stars": 5, "date": "2011-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4iAjtohAkJvMw6fVcXR_1w", "review_id": "VnXZ11Q0VzHtATIfUmT9IA", "text": "Waitress was nice.  Had a late breakfast, crowded.  Pretty much any breakfast item you can think of. . .on normal country fare.   Bacon was thick sliced and flavorful.  The menu speaks for itself as far as deliciousness goes.  A little bit of everything.   They have quite the dessert list as well as selection of beverages.\n\nI'm not  a big breakfast fan, but it was delicious.", "business_id": "2nzUx_M8Szyzsf4CszHasw", "stars": 5, "date": "2013-06-01", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "pjgqvBD1c-UEvu8rv9IPjA", "review_id": "WQ9iDwt6PknUuqKEzr27-w", "text": "The Butter-finger Waffle is delicious! Must try it!", "business_id": "2nzUx_M8Szyzsf4CszHasw", "stars": 5, "date": "2014-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QtQI951OZuHGAn09pabXPQ", "review_id": "KM106WfeX8FT6QJN_YC7-g", "text": "Nothing fancy, but it is good local food and friendly service. Went here for breakfast and got the huevos rancheros with the hash browns. The green chile sauce was pretty tasty. Price was not too bad either.", "business_id": "KhFYSO342maSRhu54zDxAA", "stars": 4, "date": "2014-07-31", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 3}, "user_id": "TQ5eVGOFr_qB5_BbEd3Sow", "review_id": "QJnRVEIqJ4jnpZuHru6X5A", "text": "This was my Mother's Denny's.  She loved to go here!  She wasn't much for experimenting with wild exotic food like me.  She always suggested either Floridino's or Denny's, or take out from Boston Market.  We always had good meals here.  One of my fav's was the shrimp skewers, which I got more than once.  I think they were only $5.99 or $6.99 for 10  shrimp and two sides.  It might have been from the senior menu.  Whatever, it was always delicious and just the right amount of food, well cooked and well-flavored.  The service was efficient and friendly also.  Pretty consistent, which was probably what she liked.  No surprises.  \n\nI miss going there with her.  (Sniff)", "business_id": "OedV_QX8aD7MeLqshhWkCQ", "stars": 4, "date": "2010-07-02", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "8OngbccOf7zrpmjHJU-M2Q", "review_id": "mdrKSARu7FTSG0KNUB2UbQ", "text": "High praise for an exceptional establishment. My compliments to the chef for all the great meals I have had the pleasure to enjoy, and cheers to the top notch service from a very friendly staff. An extra air high 5 to the awesome waitress who was kind enough to bring me my order while I waited outside with my pup. You guys rock", "business_id": "kNnk3xy9eb4ym8nljQUGlA", "stars": 5, "date": "2014-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "nEqJcObZggihFtRsJhcSnA", "review_id": "G8kfrqdJYX8Cx6RnS4ivnQ", "text": "One of my favorite taco shops.  Don't be fooled by the rough exterior as the inside is the inside is very clean and nicely decorated with colorful mexican tile.  You order from the counter and take a seat where the friendly staff will soon deliver fresh chips and very good salsa.  Your food will also be delivered on a real plate - not wrapped in paper or in a styrofoam box like many of the other area taco shops.  \n\nThe Al Pastor and Carnitas are top notch.  I usually go with Al Pastor tacos but sometimes like get Carnitas into the mix.  I'm normally not a huge fan of ceviche however I really enjoy Mucho Taco's ceviche tostada.  The beans are excellent and I've had a really good chicken soup here as well.  Other reviewers have mentioned the Horchata and I'm looking forward to trying that on my next visit.  According to the server all of the aguas frescas are made fresh on-site, so if you're looking for Horchata Ole! (or Orange Bang! for that matter) you'll have to try somewhere else.\n\nAlmost forgot to mention that the prices are very reasonable.  My only complaints with Mucho Taco are that the taquitos are a little small and that Al Pastor is not available in a burrito (only tacos and tortas).  I would recommend this restaurant to anyone who is looking for cheap but tasty mexican food in a casual environment.", "business_id": "qgJZUKNVY-LbGKk6XEP3JA", "stars": 5, "date": "2011-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "TGrvLZuUixzBY8B5GMxYxQ", "review_id": "-EPXT1vH71EyiqG6YL8W3A", "text": "I am rating this a \"one\" because the service was so very bad! They weren't very crowded but it took forever to get our food, the waiter didn't apologize for the delays or anything. \nThere were three of us, my husband ordered a basic turkey burger and it was so bad he couldn't even eat it the waiter saw that he didn't eat it and never asked if it was okay or anything. The other two meals were average the muffin was great!\nI wouldn't go back the that location, may try a different location to compare.", "business_id": "-6Roo-EHgSdUa4rP3tWyRw", "stars": 1, "date": "2011-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "VPXgY9lGJF3XC4ZpusxNuA", "review_id": "OKeO5GS7aVXwcuUfYrv-tQ", "text": "This place is way better than Denny's or Ihop.  I like the fact that they have some healthy options.  You have to try the oatmeal.  Even if you are not a fan of outmeal, this one comes with everything... brown sugar, raisens, nuts, etc.  It is sooo good!", "business_id": "oSDf6BHiMlKGZdFFmIo6NQ", "stars": 3, "date": "2010-06-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6Ie7O44elEjOMmTkto1rFA", "review_id": "rvmOcfQIQbcmURIL00cCmQ", "text": "Overall, good breakfast place.  Def worth the charge for the meals and they even offer a generous military discount!!  Wife got the eggs Benedict and gives it a 3 out of 5, not too much flavor she said and they used regular sliced deli ham vs traditional Canadian bacon.  I got the traditional eggs with bacon which was well cooked and not soggy.  Also got blueberry pancakes which were great, I give mine a 5 overall as it was good for the location and atmosphere.  Coffee was ok, not unique but fresh and hot, wife's ice tea was cold and fine, can't really goof that up.  Overall, we'd go back if in the area but not out of our way per say.", "business_id": "oSDf6BHiMlKGZdFFmIo6NQ", "stars": 4, "date": "2015-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "HpHIRyT6jL2eY46FGDfxvg", "review_id": "Nmf9WiJScNAUAKQ9wQRsYQ", "text": "This place is awesome!! If you want some good old fashioned breakfast food at decent prices stop here. All of the good was tasty, the service is amazing, and everyone is friendly. What more could you want? Keep in mind this places gets super busy on the weekends!", "business_id": "bEQjf7c-9qkNWgXvriSGZw", "stars": 5, "date": "2014-08-27", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kFTTt5Ny21viUUsjc-uFPw", "review_id": "YuRYf68bO4l1n49u951QKg", "text": "About as authentic as it gets. Great chicken tacos and that small hole in the wall feeling a lot of us like when looking for \"tru\" mexican food. I've been back several times. Never a fishy taste with their fish tacos, and service at the window is pretty quick if you're in a hurry.", "business_id": "CRvVvR6aE1eWVRtzQ0UC6g", "stars": 4, "date": "2009-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "m8kaHU2-IpjH3E9nKRi3jA", "review_id": "_BS0z1tn6OSSo4LIuUp7FQ", "text": "Not going to lie, was not super impressed.  \n\nUsed a yelp deal for breakfast, the lady who took our order then walked back and made the food.  \n\nFeel like I could have made the food better at my house.  \n\nProbably won't be coming back any time soon.  \n\nObnoxiously playing spongebob on the tv extremely loud, even though there were no kids there.", "business_id": "CRvVvR6aE1eWVRtzQ0UC6g", "stars": 2, "date": "2014-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8-2W5CmkDl9vrkxRpkiPRg", "review_id": "abxg6zkpk-xU2FS88b5tlw", "text": "Great place, delicious breakfast, relatively cheap. Sad that they don't use real maple syrup, but their cinnamon buns are amazing and their scrambles are top-notch.", "business_id": "7WGBi29_vj_7RcPVxpLNHA", "stars": 4, "date": "2009-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7knTjXA1lNJw7AMIIJi4YQ", "review_id": "2eAOaDLe2NayfRE2tJ9p-Q", "text": "My wife and I went to The Farmhouse Restaurant this morning.  \n\nI had some kind of egg scramble with:  asparagus, spinach, sundried tomato, and cheese.  It was pretty good.\n\nMy wife had a belgian waffle with fruit.  \n\nThis is a good breakfast place.  It reminds me of a place in Chicago (Logan Square area) where I am originally from called Lula's.  \n\nThe food was good for breakfast.", "business_id": "7WGBi29_vj_7RcPVxpLNHA", "stars": 3, "date": "2012-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "gBkF5qeWYDxn_JiD7805Ww", "review_id": "J2LTtNkigOW5aYQCcDYXGg", "text": "Great food, the wait still sucks so get here early to avoid a long wait in the heat..", "business_id": "7WGBi29_vj_7RcPVxpLNHA", "stars": 5, "date": "2014-08-03", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "90a6z--_CUrl84aCzZyPsg", "review_id": "GtJCtQqZVXYRSP-ASXMASA", "text": "Good solid deli fare. I have tried several sandwiches and they have all left me satisfied. I suggest they invest a little in the atmosphere if they want people to dine in (maybe they don't).", "business_id": "TpQMR-JFE5V0UPzTjjuwFQ", "stars": 4, "date": "2010-06-30", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "uBp2Jmip2qXQ0iWHUDY9sQ", "review_id": "LPO6QGn4mbiqGqy7m0BpuQ", "text": "Chompie's has far and away the best bagels in town. Not the cardboard-tasting, dry, processed junk you get at Einstein's. Chompie's actually taste like the good bagels you get in New York. Plus, they're still the only place in town that sells salt bagels and they're kosher. Unfortunately, it only gets 4 out of 5 stars because it's too pricey and the dining room is pretty boring.", "business_id": "IM-9thHqQbBK5tX5MfTzBQ", "stars": 4, "date": "2008-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "WBth5OOvugUKkLHJme_JrQ", "review_id": "V6wbNtRgMJisDa4J2ZcZyw", "text": "Chompie's used to be one of my favs, i used to eat there all the time a couple of years ago, today i went to the shea location, which i always used  to goto & it was pathetic..ordered the \"aaron\" sandwich, the sweet potatoe fries were so bad & soggy even the waiter said, taste those & tell me if they are good before i said anything..they replaced & still were horrible..the bread tasted stale..there was literally a smidge of cole slaw instead of actually having cole slaw on the sandwich..it was just horrible..i wasted my time & my apetite on junk..oh ya plus $25 for a bad time!\n\nps: the place is looking pretty run down & didn't smell too good inside (which another reviewer also mentioned)\n\ni'm not sure if management changed or what.....how ever the service was good & the manager came to ask me if the food was good after the waiter told her about the fries being so bad, but i just said, yes all is good thanks...didn't want to sit and complain!", "business_id": "IM-9thHqQbBK5tX5MfTzBQ", "stars": 2, "date": "2012-07-23", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "GCetDiw1yuYtSfMwq0Ailg", "review_id": "iyWm6oYmdiqATto6O4gyhA", "text": "A NY style Deli with an entire gluten free menu. I'm pretty sure I died and went to Heaven. Sadly though, I was too hungry the morning we came here, and they actual made homemade gluten free waffles, but I was not feeling it that morning. :(\n\nI went with an omelet and gf bagel which was still epic that I could have a bagel. \n\nThey have every option you can possibly imagine and as usual, huge portions. But for a very reasonable price. I wasn't hungry until dinner time. \n\nDef a cool place to check out for good eats.", "business_id": "IM-9thHqQbBK5tX5MfTzBQ", "stars": 4, "date": "2013-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Gy_KBORlzm3bLfAWLUH9uw", "review_id": "vS0zbQpVYlaVIERn5ke9uQ", "text": "Disappointing. The waitress was exceedingly aggressive which I figured was part of the ambience of a New York deli. Rude, aloof, absent, angry. So, I rolled with it. Another waitress delivered our food and I had to flag a busser to get a cup of coffee. There was zero table side service.  Our waitress was at the front counter gabbing for most of our visit while patrons squirmed. She did finally show up with the check. Table for 3. The grilled cheese was a quesadilla! Tomato slices were not ripe. Scrambled eggs were okay.  Hash browns were a pile of brown mushy, Luke warm potato slices which were not edible. Better bagels the deli at McCormick Ranch or the one in Fountain Hills. Chomp is is closer to home. But, they won't see me again", "business_id": "IM-9thHqQbBK5tX5MfTzBQ", "stars": 2, "date": "2015-07-03", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "g9s_yIDg9uA3RufY8-cqtA", "review_id": "cNCWEnskhf7EHyOhtRIRAA", "text": "Oh Randy's! I have lived next to you for the past two years, and am kicking myself for not stopping in sooner.\n\nLiving in Old Town, we are lucky to be surrounded by many local, unique places for a bite to eat. Normally on a weekend morning we'd venture to The Good Egg, the Breakfast Club or the Pancake House. A few months back we decided to stop by Randy's, and we are SO happy we did.\n\nFirst, it is a no frills type of place. Lots of seating, the food comes out quick, the menu is basic, and it's a cash only place. Everyone that works there is busy, but friendly. The food is good, basic and filling. The prices are fantastic for the value you get. We typically come for breakfast, but this past weekend we enjoyed a delicious late lunch, and even stopped by later that evening on a bike ride for a scoop of ice cream.\n\nI love going to Randy's, I like the food, like the people, like how normal it is. Two thumbs up :).", "business_id": "68_EJEA9Ibo55EDp3d-nOg", "stars": 4, "date": "2010-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "47Q8E43e1mGoGblsfyTyow", "review_id": "Hw02CLCL6dTvG3z7Jc5uQA", "text": "Our first visit was memorable and enjoyable. Our server Debbie treated us with gusto; the service was very speedy; the food was delicious and affordable. We will return even the location is not on our flight path.", "business_id": "68_EJEA9Ibo55EDp3d-nOg", "stars": 5, "date": "2014-08-10", "type": "review"}
