{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7DeM4C66zVflYNrZn_Vv9g", "review_id": "RKSwdhP-xQLXm6ShTwknew", "text": "This is a tiny Starbucks and it locations like this (although cute) makes you wonder if your really meant to hang out or just grab your coffee and leave. Leaving is always a good idea at this location anyway since you have a nice fountain in the back with benches and it is a central part of the Waterfront Shopping. \n\nStarbuck isn't my favorite coffee chain by any means. Is it just me or do all Starbuck coffees taste a little burnt and bitter? No matter how trendy, cool and upscale their establishments are I can't get around the yicky tasting bitterness of Staryucks regular coffees. Talk about over roasting a bean...Maybe something has changed with their regular coffee but I have not drank it in about a year. I am not one for soy caramel latte foofy stuff. Still I'll give the establishment tres estrellas for the fact that their espresso is acceptable and doesn't taste half as bad as the regular coffee bean.", "business_id": "3gmBc0qN_LtGbZAjTtHWZg", "stars": 3, "date": "2009-06-10", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "fwsJGulnozT2U6FefsLiFw", "review_id": "5XzkZUgPDNZ3WfZss6C-NQ", "text": "Nothing special. Just like Applebee's, Chili's or Fridays. Stick to the bar food (burgers, sandwiches, pizza, wings and salads) and you will be okay. \n\nThis was our second attempt at trying Rock Bottom on Fathers Day. The first time almost ten years ago. We went in the early afternoon and they had already ran out of steaks. How do you do that on Fathers Day?! This time we went around 12 noon and beat the rush.\n\nMy wife got and loved the Berry Bash Sangria. She just said it had too much ice in it. Our daughter got the root beer float which she love and I started with a Mango Ice Tea, but later switched for a raspberry ice tea as the mango ice tea wasn't sweet enough.\n\nWe started off the the Kobe beef sliders as our app. It took at least 15 minutes to get them. You get three sliders and they were very good.\n\nMy wife got a small greenhouse salad with Jalapeno ranch dressing to start off with which she enjoyed and the lobster & shrimp enchiladas as her main entree. She complained about how salty it was and the fact that there was no lobster in it at all.\n\nOur daughter got the kids burger and fries. No surprise there.\n\nI ordered the New York Strip with mashed potatoes and it came with green bean as well. My strip was cooked perfectly and has a decent taste. Longhorn has a much, much better quality of steak though. The green beans were pretty good and my mashed potatoes very bland and pretty average. \n\nThe kitchen sounded like an live episode of Hell's Kitchen. The waiters were repeatedly asking for orders at least 5 to 6 times. The kitchen was backed up the whole time we were there.\n\nOn a different note, our waitress Susan was very good. Come here for drinks and the bar food. Skip everything else.", "business_id": "McikHxxEqZ2X0joaRNKlaw", "stars": 3, "date": "2013-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "56qmH8ZKwnWX8ulrkrVtnw", "review_id": "XnQZUMxl9wp9Rixh7dJJMw", "text": "Good beer, food and service. Arrived on a Wednesday night for business and sat at the bar. Bartender was attentive and nice. Food was great. I had the Bison Prairie Burger. It was cooked perfectly and the flavor and fries were great. I'll be coming here again on my next business trip.", "business_id": "McikHxxEqZ2X0joaRNKlaw", "stars": 4, "date": "2015-07-29", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "hmlfPZC9HNwX2b3YFvYACA", "review_id": "FfJXwB27P7TS702NYDeE_Q", "text": "Got a key lime pie from this place. It was horrid. Icing was stale cake thick, crust was not even crunchy or had taste, and the key lime was weak. Pie looked it it was sitting out for a day or 2.", "business_id": "7wT532x2Qz5Hw9BqtBapqw", "stars": 1, "date": "2014-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dw1zh9oNtZSSdhn9lrVdvA", "review_id": "XeCja41y1lgsJxijPpDrKA", "text": "This is where I learned what good espresso tastes like. If you make it to Highland Park, stop there and get some great neighborhood atmosphere.", "business_id": "83_p9vIqOq1TUIf3_GD7bA", "stars": 4, "date": "2011-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "JWtFuKaFXn_l5h-qKZWZuQ", "review_id": "8CJnT9xgh6qpCORDmz-Jwg", "text": "I can't even. \nPerfectly delicious food, reminds me of a true French bakery. Delectable cakes, pastries, chocolatey things, as well as savory quiches, breads, and their signature little marinated ham sammies. \nI used to be a regular here on Saturday mornings and would spend $20-30 bc I'd get 4-5 things to last me through the week. Ha! That never worked out. It lasted about 3 days. \nThe last time I went, the person working the counter was really unfriendly. But hey, maybe they're trying to really nail that French bakery vibe :)  No matter, the baked goods redeemed this cranky lady.", "business_id": "YMEtEsUDQKOYJOcE5Fx3gQ", "stars": 5, "date": "2014-06-03", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 4}, "user_id": "jR_zE_9TEcY4_vrTeKNXlA", "review_id": "ZSwfgd5h9-W5FdWrelBjWg", "text": "I love Whole Foods, and I have been a fan for a few years now. I've visited Whole Foods locations around the country, but this Pittsburgh location is one of my favorites. It's a small store, but it feels homey and comfortable.\n\nStaff: Most of the staff members are super friendly and willing to do just about anything to help you find what you are looking for. I had one staff member begrudgingly help me out, but I assumed he was having a bad day or was very busy. Either way, it's nice to treat others with respect. \n\nThe cashiers here are so fantastic. They are never rushing and throwing food into bags. They take their time, ask you questions and treat you like a person instead of another number in a long line. \n\nDeli/Made-To-Order: The deli and made-to-order foods are currently my favorite. Sometimes I would rather spend $20 on lunch here with my boyfriend than go to a restaurant or get fast food. My favorite is the vegan chicken salad on foccacia bread. I adore this bread. It's just the right texture, it's nice and herby and deliciously buttery. Topped with swiss or muenster, it's a super delish sandwich. If I am extra peckish, I get extra veg. chicken salad. Yum yum yum! \n\nThe tomato bisque they have is something I newly tried. I'm very picky about my tomatoes and tomato products. This soup delivers. I wish I could have it every single day. It's so phenomenal! My boyfriend got it today alongside a cheddar biscuit that paired beautifully with the soup. \n\nCheeses: If you want fancy gourmet cheeses, the Whole Foods deli counter might be the best choice. We purchased a small amount of Midnight Moon Goat Cheese Gouda and made the most expensively delicious grilled cheese sandwich. We're grown-ups now, say goodbye to gross American cheeses! The cheese counter is so great because all of the cheeses are labeled with the kind of rennet used in the processing. You can easily find a high-quality vegetarian cheese with just a glance. The cheese experts are also willing to talk cheese to you for as long as you like. \n\nStore Selection: Overall the store has great options, but they don't carry everything that I wish they did. Unfortunately, they discontinued one of my favorite products - Field Roast Deli Slices. They bring in new and trendy foodstuffs though, so it's enough to keep me happy. \n\nWhole Foods can be pretty expensive, but if you don't fall for the tempting packaged foods, you can get away with a reasonable grocery bill! I primarily shop here for special items though. \n\nP.S. Their selection of natural body and haircare is great and affordable. If you have sensitive skin or don't want your products tested on animals, go here!", "business_id": "wfCLz9-aeShbPB7CaTY-qQ", "stars": 4, "date": "2014-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WxvD8BG-DUklbDxQNdt5qg", "review_id": "7pYvT-LbWcmnuJ8ReURqug", "text": "I've been back to Quiet Storm many times. I can accept the hit or miss service since it's pretty cheap and casual. That's not really an excuse for bad service, it only somehow softens the blow, but why be mediocre? \n\nThe environment is comfortable (unless you sense the servers don't want you there). The music ranges and is appropriate for the environment. It's never too loud or aggressive. Free wi-fi helps and the milkshakes are slammin! The food is inconsistent, but often good. The Black-a-dilla is my favorite. \n\nI really want to like Quiet Storm, but it only merits 2 stars. Their food, service, and hours are inconsistent. It seems they often close early. \n\nOwners, please stick to your business hours. It's not like you're open that late to begin with! Perhaps everybody wants to go home, I don't blame them for that, and you may have run out of a few things, but try to imagine the disappointment of trekking out there to enjoy your favorite shake or snack and then being turned away.  \n\nOR, If you believe this is an acceptable business practice, it would be less infuriating if you simply changed your hours to '9am - until we feel like it.'  This way there are no set expectations and we can't really begrudge you for it. \n\n...My vote is to just stick with the hours you created.\n\nThanks!", "business_id": "PzG0XmAmtXFs6Fdnubf41g", "stars": 2, "date": "2011-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "bEyGMTOF8gcAwjNz_qXv-w", "review_id": "fvW4q-VEXuAt7g0Elu6Nng", "text": "There is nothing better than a neighborhood market, and Frick Park Market fits the bill. Come here for grocery staples, a great homemade sandwich (get the breakfast sandwich, any of them!), or just to hang out. The owner will be there & is happy to talk to you.\n\nThe best part about the market, though, is when the kids get off school & come into the store for candy & soda. You can tell that the business is connected to the neighborhood and that everyone gets along. Pittsburgh treasure!", "business_id": "EPILrBqmgQxd-R1gZ1EWJg", "stars": 5, "date": "2011-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "2udm_LKOG3wpYb31YgkjyQ", "review_id": "Px0OwLdWW8nhCDWuSlpYdA", "text": "I've been coming to Page's since I was a kid and at 25 I still get that \"YAY ICE CREAM!\" feeling when I go here.  Their soft serve ice cream is great and their Hawaiian Ice/Slushes come in several different flavors.  The dips on their ice cream cones are very good and very popular as well.  However, my favorite thing to get their is their Artic Swirls which also come in distinct and fun flavors (I really enjoy the Banana Cream Pie).  Did I mention the great prices and friendly staff?  \n\nThis place has been a staple of the South Hills and it never fails to attract a large crowd of people.  You can't go wrong with Page's!", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 5, "date": "2010-07-14", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "g23fX1wynH2Ar5VAfGrwLA", "review_id": "dAwpz2ZMhbXHlQy9sXRebg", "text": "If you're in pittsburgh, this is a must stop for ice cream. Personally, I get a Southside shake almost every time. It's a milkshake & a sundae. Pretty cool, right? I've had their version of a DQ Blizzard (what they call them, I can't remember right now, sorry) but it was delicious. I got it with chocolate ice cream and Reese's cups. The possibilities are endless, seriously. My bf has had their chocolate chip sundae & the brownie sundae. Their cookies and brownies are both amazing and soft and tasty. They have food also, which I haven't had the opportunity to try at this point but I have heard good things. The prices are more than reasonable. The parking is ample but it's sporadic, kinda just park where ya can, no designated spaces etc. the other down side is that there is ALWAYS a line. Unless it's raining etc. The line gets insanely long but it's almost always worth the wait !", "business_id": "2PfavOTufsPCRdYm-bFcpw", "stars": 4, "date": "2014-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cGitg_2_o4PuS9zcthRSPw", "review_id": "A0g8ng0TtkCSp9UP6oJ3Mg", "text": "The owner is an amazing guy. The place isn't open all week but the beer is super cheap which is an excellent fine.", "business_id": "zq--BGVHu7_fb1VHEwg2ow", "stars": 5, "date": "2014-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_uUlWKhPmjFUUxOSS-EP_w", "review_id": "CJpaqtGtmguHEl456Bz2sw", "text": "One of the best pastries I've had in my life I got here. I think it's called a \"French bearclaw.\"", "business_id": "WY6FFxpa6ztwDH5OhS6WDw", "stars": 5, "date": "2012-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "pztZ7aZtyx6Bp9O4-yic7w", "review_id": "6JoU2tOemoiaNW0cMOdCTQ", "text": "My guess is that \"Ruth K.\" was put up to writing a nice review by the staff or owner.  Regent Square deserves a better coffee shop, run by someone with good business sense.  What kind of a \"business\" only prepares food (chicken/tuna salad, hummus) once a week?  Does chicken salad hold a week in your fridge?  Also, whenever they lose an employee, they just shuffle their schedule and close at 6 pm for a few months.  They should be open till 10 pm as it is, with all the foot traffic in the neighborhood, especially in the summer. My guess is they see this place as nothing more than a loss leader for the bar they own next door.   Otherwise you would think that since opening in 1995 they could at least take the time to slap a coat of fresh paint on the place!\n\nBTW, Katerbean did go smoke free before the Allegheny County ordinance went into effect, but the place to this day reeks of stale smoke.\n\nAdded note: looks like my previous review was somehow deleted.  I'll just say I received an order of hummus that was watery and had rotting celery in it.  Tried to get another and 3 or 4 of the orders in the case were all in the same condition. I asked for a refund, and afterwards watched the kid working there put the other containers back in the cooler to sell to other customers. That was the last straw.  I won't spend another dollar there.", "business_id": "D9sHwmqlNkrVxmX-057i1g", "stars": 1, "date": "2011-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "p5RMCOmEwk3N1SfxYqFFRw", "review_id": "E9ZUUoQuVu-V-CXgfNlf4g", "text": "MARKET SQUARE.....The slowest, most inaccurate Starbucks that I've ever seen....how can you write an order on a cup and still get it wrong....I saw 3 wrong orders (including mine) in the 25 minutes that I spent waiting...I was 4th in a line of 10", "business_id": "7ijQJV72aBrEoJCtTBCHxw", "stars": 2, "date": "2014-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h7vH8sqE_2ODi7fnbhB6wQ", "review_id": "fdSG1Y9aE36pLD6uXEQARw", "text": "These are super good tacos, burritos decent too! Tons of lime juice, cheese and fillings. The market can be pricey but they have harder to find items. I go for\nthe taco stand primarily. Top authentic taco contender in the burgh.", "business_id": "buVALudg30kgkDusqB3yJw", "stars": 5, "date": "2012-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jfvv8uvdSJYa5NWEAloxpQ", "review_id": "OAAsUr4efz9f69nUCHs8sA", "text": "The coffee is excellent and fresh (they do like 10 roasts). Lots of choices and freshly roasted peanuts. I wish the service was a little better because I really want to love this place, but they are always impatient with me as if it were a deli counter with 50 waiting people even when I am one of the only customers. As far as fresh roasted coffee in Downtown this is one of highlights of Market Square.", "business_id": "J7I85lTCEGr9-qp6AXPUjQ", "stars": 4, "date": "2012-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "12xOwSIut8ydWVRGaWjRsA", "review_id": "-2clWDMIGuT80w9bqby0qQ", "text": "This is the best out of the downtown location Au Bon Pains. The manager Keith is very friendly and the rest of the staff follows his lead. It's not as cheap as fast food but their email club sends out a lot of coupons in addition to often times receipts having survey coupon offers. Thai Peanut chicken wrap is my new go to item for lunch which comes with a free breadstick. The bagels and pastries are pretty tasty as well. Good lunch spot to dine in or take out.", "business_id": "shrMOQmX_SX-KualwYoAzA", "stars": 4, "date": "2015-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pcYHD-hTU0Ukcb9--UhY8w", "review_id": "w74oYkvqlEoSsoA8_abvcA", "text": "Great place.  Love the old school vibe with no fuss.  They roast some really tasty espresso beans, but at times the shots in the store can be a little off.  I usually just buy the whole beans for home since I have a Vibiemme HX machine and a Mazzer grinder in my house.  Go with the Miscela, it's great.", "business_id": "SWzCFTM7KHc-MncD6xxOYQ", "stars": 4, "date": "2015-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "yWSSnsbTeusmrASKB6h6Dg", "review_id": "qW0oZGMNNhYXV2Wk5u1ALw", "text": "I've wanted to go here for the longest time, but lack of time and transportation has prevented me from going there. Then, a few days ago, my coworkers and I decided to head down here. It was around a 15 minute walk from downtown, which is not bad at all. \n\nWalking in here was sort of like revisiting my childhood. I saw all the array of foods I used to eat when I was a child, and the plethora of noodles, fish, and dumpling arrangements. It made me super happy. I ended up getting some dried anchovy fillets because I snack on that stuff all the time and it's my salty snack go-to. Next time I'll probably get some noodles and miso paste for my soup days.\n\nEverything here is really cheap, and if you are a student you get a discount! Just make sure you flash your ID when you check out.", "business_id": "lVB0HB2PxC9OTtMcz0wagA", "stars": 5, "date": "2015-06-19", "type": "review"}
{"votes": {"funny": 7, "useful": 11, "cool": 11}, "user_id": "bhZ13wN_5lQrKX278AP_aw", "review_id": "vsK4f3YF_4f0gma5DJkWyA", "text": "Mon Aimee Chocolat is a chocolate and candy store located in the heart of the Strip District.  This shop does have some unique and delicious chocolate, and if you are looking for anything European, this is the place to come.  The holiday themed chocolate are also very lovely.  They also have an assortment of candies for the non-chocolate eaters in your life.  This products are pricey overall.\n\nHere is the primary issue with Mon Aimee Chocolat:  The owner is rude.  However, if you return the same attitude as she displays, she will pull back a bit.  But I would NEVER spend my hard earned money in this shop after a few interactions with her.  The help, while friendly, is a bit dysfunctional as well.  Just not impressed with the customer interactions here.", "business_id": "gFT2yXDXJ1qfuGOSfSU5Bw", "stars": 3, "date": "2015-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "22-6yC05pgWbLupHZTjQig", "review_id": "W-b5RvG4k2Od3A6ziD61yQ", "text": "Stepping into Klavon's does give me a feeling of stepping back in time. \n\n1920's?! That's almost over 100 years ago. Maybe that's the good old days where you can find soda fountain together with medications?? \n\nThe staffs here are just like grandmothers too... Sweet smiling ladies taking our orders while my friend just could not decide what she wanted? Ice Cream Float? Ice Cream Sundae? or that Super Bowl Sundae ($25) that comes with 8 scoops of ice cream plus all the fixings!\n\nHere at Klavon's the ice cream selections are more traditional too. You find your good old, Vanilla, Chocolate, Strawberry, Peanut Butter Fudge.. 15 different ones to choose from. And make sure to request their special flavoured whipped cream!\n\nMy scoop of Toasted Almond Fudge ($2.80) so nutty and smooth. \n\nKlavon's Twenty-Eight Ice Cream Parlor is definitely neat place for a little time out if you are in the area! The experience will put a smile on your face!", "business_id": "kj3qws3WSMgOotUeACSdFA", "stars": 4, "date": "2012-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "7DeM4C66zVflYNrZn_Vv9g", "review_id": "jSCO8RQPkvu17n0qeiARkA", "text": "My favorite bean in the Burgh! I have had many a cup of coffee hear and none of them bad. They roast much of their own beans and have an ample selection. Well worth trying.", "business_id": "HmG9zkBtRwttGE291q9b6g", "stars": 5, "date": "2009-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "_ZuylBniwr0G3xoZ5-IhNw", "review_id": "Ef0Sny5Dp-2Vqhh5S5Oeeg", "text": "Pennsylvania Macaroni Company, you are one of many Pittsburgh landmarks that I always knew was there, so I never bothered to investigate. One day I made the trek in to inspect the wares because someone on a talk thread had tipped me off that Penn Mac Co might have the hot sauce selection I so desperately craved.\n\nUpon entering you're greeted with all sorts of goodies. Bulk dry foods, cheese, barrels of bulk olives(MMM), meats, boxed items, olive oils, etc. The smells are strong and all of the tastes are equally, if not more so. \n\nAfter inspecting the cheese(and contemplating the benefits of a Cheese of the Month club), I rounded the bend and lo and behold, a beautiful selection of hot sauces! All different kinds, I inspected them all until I came across... Iguana Golden Habanero! This sauce is my favorite, a total all-star, and I just got a bottle of it imported for my birthday! As you can imagine, that was a costly endeavor, but here at Penn Mac, it is a mere $4! Incredible. There are a ton of other novelty sauces and whatnot if you're a fan, I recommend taking a look. \n\nAs you exit to the back, there is some produce and a few lanes of registers. It was late on a saturday(They were about to close) and there was no line. The place is a treasure and it's definitely worth stopping in, chances are you'll find a few items you didn't know you needed, or didn't think you could pick up in the Burgh", "business_id": "niW0ggRVPW5fafcfImdK7w", "stars": 4, "date": "2011-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vOz8Tgfe9ujzb4Tjw_boZg", "review_id": "ouNE-Vt72-NwxxmbxFeCgg", "text": "Friendly staff member showed us the fresh coffee beans and the massive roasters one morning. Amazing coffee", "business_id": "TASUnYvk_nvTUyKtroCJSA", "stars": 5, "date": "2010-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f9LuLzqLMNJJoV3zmu6dBA", "review_id": "6bHxEhmv4nun19TUTlZHZA", "text": "What can I say about Groceria Italiana that hasn't already been said? \nPLEASE OPEN ANOTHER LOCATION! The south hills needs a place like this. If I didn't live so gosh darn far away, I'd be here multiple times a week. \nI stopped back to Groceria Italiana after a food tour in Bloomfield a few weeks ago to pick up a few things for dinner. I decided to purchase the special- sausage ravioli because the owner had informed us that everything is made in house. Even the suasage is ground and tested in house before putting into the ravioli. I also left with marinara sauce and pepperoni bread. \nThe pepperoni bread was light, fluffy and delicious. \nThe ravioli is easily the best ravioli I have ever had. Each little pocket of heaven was hand made and was slightly different in shape and size from each other. The tall tale sign that they were pressed by hand. We followed the directions on the box and BAKED (not boiled) them in sauce. I've literally thought about those ravioli every time I have had italian food since. If you are anywhere near this place, stop in immediately!", "business_id": "DsxLIr-b6WlDn9YNsVBu_A", "stars": 5, "date": "2013-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_cNmoZtIujk_p7pQmkJJlg", "review_id": "Ri87OFVYHKeWqavaJNZpXA", "text": "Pitaland is the best run business in Brookline (with las palmas a close second).  The café is well staffed and the food is delicious.  I love the breakfast flatbreads and falafel for lunch.  In a slew of mismanaged bars with little to no fresh food offerings on the Boulevard, Pitaland is a savior for us locals.  Support them with your business!", "business_id": "gCiKiqPGAC_ZVt5bBcwnrw", "stars": 5, "date": "2013-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6vW1fzUfy8kYPaXAFQxjuw", "review_id": "w932ot_BorS_go9Z7LA0DQ", "text": "I like Uptown Coffee! They're like the \"little guy\" to the one down the street but they've got a much cooler vibe. They have a bakery on site and have some killer treats. I just wished they would brew their ice coffee a little stronger. I hate it when coffee joints just stick a batch of regular coffee in the fridge. It needs to be brewed via the seeping process, people!!! That way, I can stop paying for the shot of espresso, which is sometimes \"one toke over the line\" for me. Friendly staff, though. Beware: they get nuts around 3:30 when the local grade schools let out for the day. Nice folks, good coffee.", "business_id": "DJKpwLp4mISNDNDpNz67tw", "stars": 4, "date": "2009-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IySYeabq_KwKH-4Fu4lKyw", "review_id": "YhHtyWeBDLPT-0514HpZoQ", "text": "I have recently become a coffee shop bum (and my reviews are beginning to reflect this) but I enjoy this place. It definitely is busy (which is a good sign) but can be difficult to find a comfortable seat. The drinks are great and the staff is really friendly. \n\nTheir late hours are ideal for students or those that just run better late at night. The fireplace and quiet room are cool additions to an already pretty neat space. \n\nThe only thing I wish was a bit better was the wifi situation - luckily I was able to get a bunch done without the need for it. Definitely going to keep coming back here and enjoying the space/drinks!", "business_id": "1qUYk564SajvwTtkNM6KJA", "stars": 4, "date": "2014-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tVtPlo4-Dan1i6RWQB9cxQ", "review_id": "sFH6QhJD2tlcsR591WawgA", "text": "I love their muffins.   They are smaller, inexpensive, and really sweet.   Lots of great berry muffins.", "business_id": "yWVY1Bq19lDxu3BP7_96EQ", "stars": 5, "date": "2010-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l_szjd-ken3ma6oHDkTYXg", "review_id": "U5PbPJe0jx-s3XP9Rx-C6A", "text": "What I like about Prantl's is that it has a little bit of everything, but most of all homemade goodness.\n\nLooking through past reviews, many talk about the Almond Torte and various other items, but I've happened to visit around holidays or busy mornings when my goal is to get in and out...leading me to try other seemingly less-hyped items. And boy have they been a great choice!\n\nOn my first visit it was Easter and I wanted to bring a treat for the family. The staff member who helped me suggested the cinnamon bread. It was probably one of the best decisions I've ever made. Not only was the bread fresh, but the cinnamon sugar was throughout the entire bread. There wasn't one piece, or complaint, from anyone about it lacking flavor (as cinnamon breads can sometimes be as you get to the middle of the loaf). As the holiday went on, many family members were grabbing it instead of a cookie or other treats around. I did also grab a few \"Almond Torte Bites\" instead of the full torte to give it a try as well. Even though they are good, they are VERY sweet and not what my tastebuds are looking for. I was very glad to have gotten the bites instead of the larger cake itself.\n\nMost importantly, the staff was super helpful, patient, and attentive even though the store was in full swing, with a line basically out the door.\n\nMy most recent visit was today for #nationaldonutday! There are a lot of options, but there is something about the traditional glazed donut that takes the cake. I don't remember the last time I had a truly good homemade donut like this - it literally melted in my mouth. There's also something nostalgic about it that makes you feel like you're reliving a moment in your grandma's kitchen. It's something that's going to keep me coming back for a Saturday morning treat with my coffee!", "business_id": "yWVY1Bq19lDxu3BP7_96EQ", "stars": 5, "date": "2015-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RSExP0-Boucr4QyIEzZi0A", "review_id": "y8mk0jlBVV_-Rbm66YMDfQ", "text": "A great little neighborhood coffee that's located two blocks from my new place in Shadyside. I'm pretty sure that this place may quickly become my new place to work, and I'm surprised that I never discovered this place the last time I lived in the neighborhood. The people who work here are really nice, and what I love about this place is that most people who come in are regulars. The staff know almost every patron by name (which again speaks highly of the staff). The venue is cute and homey right at the end of the Walnut Street stores. A part of me wishes it was a bit bigger, but I think it would probably lose a lot of its charm if it was built up like the Coffee Tree Roasters across the street. One minor setback I have here is that you have to walk a ways through the building to get to the bathroom, which is a little on the gross side (however the bathroom is for the entire building, so this is probably more of a reflection on the other businesses here as much as for Jitters).  Anyways, the coffee here is good, and you get your second cup for free! I look forward to becoming one of the regulars here.", "business_id": "yYyWwqPiLJO7eWRt0g_PBg", "stars": 4, "date": "2014-07-11", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "L99Y3EMkQJy945Iscs7YGw", "review_id": "0vJXuDZ0d4-5pc91e83B4g", "text": "After I got engaged, my mom asked me what kind of bridal shower I wanted. I told her I want a formal tea party.\n\nMost of my family lives in Pittsburgh, so they took it upon themselves to plan the tea party. They chose The Inn on Negley for afternoon tea.\n\nIt was everything I wanted and more!\n\nWe had a side room with a round table that sat the 8 of us. It was very private. When the food came out I was amazed! There were little cucumber sandwiches, chicken salad sandwiches, crostinis, 2 types of scones, cheesecake, strawberry shortcake, and little bundt cakes. There were enough for 1 piece for everyone. The food was so delicious and filling! I usually don't like scones and think they're too dry, but these ones were perfect!\n\nEveryone gets 2 different kettles of tea. Each kettle is about 3 glasses. For the first kettle, I had Wedding Tea (naturally) It was delicious! The second tea I had a vanilla cream. This was great too! I think everyone enjoyed all of their tea. My mom got a chocolate mint that she said tasted like Andie's Candies.\n\nI thought the building and some of the rooms were so beautiful! My family loved the tea and whole experience. We decided to make it a tradition to come here every few years.\n\nI definitely recommend it!", "business_id": "rUQfZOengMpXFkLvJrNJ3g", "stars": 5, "date": "2015-06-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0LzlRSXLhEsVSWFEvW_5yg", "review_id": "aYeZm1Tm8hT5xfXgHVTvow", "text": "Although this store has great employees, it is in desperate need of a makeover.  It is absolutely ghetto inside.  I don't think they've redone the store since the early 90s.  It's an embarrassment on Walnut.", "business_id": "Lgyc-00L5pAELhjwUjAz-w", "stars": 2, "date": "2012-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WzaaorVCmUTQvu4mScunNg", "review_id": "fSw6hKQrnv7oMOaByvNb9g", "text": "I personally believe that this is one of the nicer GE in the area. For some reason the inner-city ones seem dark and dingy. Also, I was at the Waterworks last month and they are renovating this to make it a Market District. If you don't know, now you know ;)", "business_id": "AK8T92URfkOUoTAVd7l2EA", "stars": 4, "date": "2014-07-29", "type": "review"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "56q3IlHgoo2F5JF5mp_N0A", "review_id": "NAhcPGd2xm4q32qxVEzNYg", "text": "Local coffee shop vibe in the middle of uptown!  I frequently will walk further to go here, and like the feeling of getting away from the little too comfortable Starbucks line. \n\nI find their selection of coffee choices to be very good. They have all kinds of flavors and the employees will help you customize things that aren't exactly as they are on the menu. \n\nThe location is good but it is a little darker because it's more of an interior location. There is seating inside the cafe but also a number of tables in the larger corridor that I prefer. Or take it outside to the Green!\n\nEither way, go support a local chain and feel better than giving your money to the big guys!", "business_id": "5j704vZBOmW88yJLhnCOEA", "stars": 4, "date": "2015-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "QG_xAsQiuLe4bOOpds3x5g", "review_id": "AlU6Ok7lPWz3MPWEzeAy3A", "text": "Finally! I've found a good smoothie place in the area! The smoothie I got here was awesome, and (gasp) made with real fruit!! They've got so many selections to choose from and they all sound delicious. I got one from their 'healthy' menu, it was called Blueberry Heaven - it was blueberries, banana, Protein Blend & honey. I couldn't drink the thing fast enough! Total brain freeze, but so worth it. My second choice would have been pomegranate punch, which had apple juice and soy protien, and for my third it would probably be the Go Goji, which had kiwi and mango in it. \n\nThey also sell Luna Bars, Clif Bars and other power bars and healthy snacks. Reasonably priced, really clean, and friendly staff. I will be going back for more smoothies!", "business_id": "5dn_3KLiTl2vVe8O91pJ6g", "stars": 4, "date": "2008-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "cxTh9xxqbs-m8Paq6jAumg", "review_id": "5y8WGYLrLrQifOeif_vUKQ", "text": "I'm going back to shopping at Bi-Lo because not only do they offer double coupons-they have Fuel Perks! For every $50 you spend, you get $.05 off a gallon of gas redeemable at a good number of locations in the Charlotte area. That adds up fast along with weekly gas perks specials (i ex spend $10 on Purina products, get $.10 off a gallon). This Bi Lo is a questionable location but it's the closest Bi Lo in the area and surprisingly clean with helpful staff. The po po is patrolling this place like crazy.......in daylight. I kinda want to go at night to see what it's like. It may not have the ambiance of the Teet but it offers cheaper prices which is mighty fine with me.", "business_id": "GVMx0qWOJIJTuVAGeg71UA", "stars": 3, "date": "2011-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "XTi7LJPw5_izQaMQF4cU1Q", "review_id": "XnlIh8yrGzRT1a1nBLlZ4A", "text": "I hate Bi Lo! \n\nI love Harris Teeter! This isn't my favorite one because it's a little dated and the salad bar is just meh, but the service as usual is good and they have a huge variety of foods. \n\nTip: They have a salad bar and deli, it's not that good but it sure beats Bi-Lo.", "business_id": "gfQriEp9aqLZgMhRSU5KJw", "stars": 4, "date": "2010-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r3WABphQBHtBiIserGdSXg", "review_id": "jNehNUqWHzuF0s6CaU_hnw", "text": "Just stood in line while two cashiers discussed bad customer service at another location without even acknowledging my presence! How ironic! Well for that wonderful example of 'customer service' you get one star. And you don't even deserve that!", "business_id": "nxU6e-9vmVFO6cEz_o-tVw", "stars": 1, "date": "2015-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "K8B5FoAgHA0PhyUT8pa9JQ", "review_id": "RNir8VCDCPnI9wePXnu5rQ", "text": "I usually do not write reviews. But this place deserves the 1 stars. This location is dirty, fly infected, key toppings seem to never be in stock and the menu/ingredients for the ice scream is inconsistent. There's no health score posted and I believe that I know why. If you are in the mood for ice scream just drive to Marble Slab on Rea Road it's a little bit of a drive but it is completely worth it.", "business_id": "IQbEYPh7OKoUmsI6VoLmTw", "stars": 1, "date": "2015-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-SaMZahYCx_hmrh1xBTNsA", "review_id": "kN7w-kiSJHZJLZOwLolQeg", "text": "We came in with our children and were treated extremely poorly by the manager \"Jenny.\" Our toddler had a tantrum and we tried to calm her down and ended up taking her outside. As my husband was leaving I heard her exclaim something under her breath. Then my son asked for a lid for his drink and she wouldn't speak to him even though he said thank you. She was very chatty with the other customers who notably didn't have children. This is obviously not a child friendly establishment and we were not welcome there. \n\nAs for the food, it was just okay. I had the \"skinny\" and it was obviously low calorie but I'll blame myself for that. The bagels were chewy and my son could hardly tear his with his teeth. He's five. Coffee selection includes caffeinated and decaffeinated - there are no specialty coffees. \n\nWe're not from this area but I wouldn't come back anyway. Never insult someone's children. If you're a single adult looking to pay extra for chewy bagels with fancy names and then still make your own coffee and sit in a 55 degree restaurant then go for it. Otherwise this is a competitive market and I'm sure you can do better.", "business_id": "zOY-W35waCcBWDmjX7_MFQ", "stars": 1, "date": "2015-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7_IZ1n-2Iest0GzLaUm3kw", "review_id": "yG25P9BQezWnxF0rQWmhAQ", "text": "I really enjoy the bean dip that they make here. If I come in and there isn't any I will ask and they will make it for me. Purchased some over the 4th of July weekend and it was a crowd pleaser. I also like shopping here when they have sales. I'm anticipating the opening of a new store closer to Berewick.", "business_id": "yP20Y-TVGZ2sUNGGLzJ5Fg", "stars": 4, "date": "2015-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7_IZ1n-2Iest0GzLaUm3kw", "review_id": "IXiR1zSqSkCoVyF4ph6d_A", "text": "Love this place, I have been here a couple of times now. I don't mind taking the trip from NC came in handy during Fourth of July, we didn't run out of liquor or beer.", "business_id": "2-M1_ok4NZ-fSF6SbBsp1A", "stars": 4, "date": "2015-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hyAMhpe0hSdZIu88byeCLw", "review_id": "ig8qtUhhbL6BPMb9mY-Vaw", "text": "Such a cute place!! I was there for breakfast, and had eggs, bacon, homefries, toast and a pancake. I like variety, what can I say?? Eggs were good. Bacon and toast ok. Homefries were kinda greasy, but tasted awesome. Totally looked like they would be gross, but were delicious. Pancake is where it's at. Seriously. Just perfect. \nAlso, I believe they make their own pastries. Several coffee options, too. \nThe outside seating is so cute, too. I was there on a weekday morning, so there wasn't a whole lot going on, but it was still fun to sit outside on a perfect day, and watch the traffic and people go by.", "business_id": "ShEYKerTwb2LSORE5o_s7A", "stars": 4, "date": "2013-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6TR2pruDxl0x6_x99QWKWA", "review_id": "KyFDuwvio6-TR5ZUHgpWqQ", "text": "This is my favorite Culver's location in the Middleton/Madison area. The service is speedy, and the employees are nice.\nEveryone loves Culver's. Their butterburgers are amazing, and their custard is even more delicious. Even though I'm way past that stage, I always get a kid's meal - can't pass up that free scoop!", "business_id": "kiAsweI4sOjDzGyz3Y_HsQ", "stars": 4, "date": "2015-07-13", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "O7Qnaecq57Qcerc480SaUA", "review_id": "Mghypyk2p6W8ICf6qspkHA", "text": "I'm puzzled as to why this is such an attractive spot for parents to bring their young children. It doesn't seem to matter if it is in the afternoon or evening, especially on a Saturday, the handlers enjoy their beer while ignoring their kiddos zipping around, climbing on trees and being loud. Two episodes pretty much told me they didn't want my business; having a charity event involving squirting toddlers with a water hose and watching a family bounce a ball around. There are terrific parks in both Madison and Middleton for these kind of activities, but oddly a beer garden is the best place for these sorts of things.", "business_id": "Wn8NhS-L1ck6jbTjX88Kkg", "stars": 1, "date": "2015-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Vht5jLt3DZQflGrkfHlzxw", "review_id": "gseFTtK1B91nk9jDMOqIQA", "text": "Dead and went to heaven cheeeeeeeeese and fudge my goodness how can you go wrong, a must if you're in da area. USA all da way!", "business_id": "jpxlSFhdrtbNyxS6vB036A", "stars": 5, "date": "2015-06-13", "type": "review"}
{"votes": {"funny": 6, "useful": 1, "cool": 1}, "user_id": "lC0KGXmIhyjzghBUlVnkhQ", "review_id": "Hu8vjjcCM6qYPmbIlrh_AQ", "text": "The bastard child of two sexy Culvers.", "business_id": "q83uB6EGF6y2MuR-7VZPRg", "stars": 2, "date": "2013-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y8vHIC3IklOxasWjEK8rsQ", "review_id": "6Z50JWG8_6fxabeR6HqzNw", "text": "I have been to Cool Beans a couple of times thanks to a co-worker. This is a great place to grab a cup of coffee with a friend or meet for a work meeting. The coffee is great and I usually buy the endless cup as I stay for a couple of hours. The food is great as well. The sandwiches are definitely something to try.\n\nThe staff are very friendly and the atmosphere is cozy. There are tables and chairs throughout and then there are some comfy chairs if looking for a more relaxed seat. If you are in Madison on the East Side this a great place to go.", "business_id": "JPFzpR5PvZWqHXQMIZFk2w", "stars": 4, "date": "2013-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WKQKNmWL8_FH5vFHYlp8hQ", "review_id": "RSzjibcjjI0kZEW-DtqIYQ", "text": "Went there today with my fiance.  We had the hummus and lamb and the felafel.  The lamb was amazing.  Little pieces cut up and placed on a bed of hummus.  The hummus was very smooth and great texture.  The hummus was good, but Bunky's is still my favorite in town. \n\nThe felafel was good, not too heavy.  Serve in pita bread with a sauce and veggies.  They have a good selection of beverages, they had my favorite Nantucket Nectar and some good bottled lemonade.\n\nAfter our main course we decided to try some pastries.  The baklava was amazing.  It was light and flavorful.  We also had a french glazed doughnut which was better then Greenbush.  \n\nThe lady that works the counter is very friendly.  When we went back to purchase the pastries we only had credit cards, and they have a $5 minimum.  She let us just add it to the tip of our original bill!", "business_id": "Ryq600aoE3h8_qRQGIed9A", "stars": 4, "date": "2013-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Kqvfep2mxS10S50FbVDi4Q", "review_id": "cWRlx88-iyLMAj_v6uSnTQ", "text": "Being from out of state, I'm not a custard expert.  However, even an idiot knows that this place is good after just one taste.\n\nI enjoyed the black forest flavor of the day.  Creamy chocolate and cherries.\n\nMake sure to walk through the back parking lot, through the grassy area and down to the lake to enjoy your treat.", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q", "stars": 4, "date": "2010-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-hwN2juKYn-KTxa2WBYLnw", "review_id": "MZoX3bh2eOdhmC78aPMjug", "text": "I have received some very good coffee here, to their credit.   But no drive through sucks and they still have too small of a seating area like most SBs.   There is a Peets right across the street and I believe a Steep n Brew just down the road.   I'm going to try there from now on and see who can win my business.", "business_id": "zUR94L72x2yUit8mGC2tgA", "stars": 2, "date": "2015-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "RvweNJFVkR3ttkWsIBy7nQ", "review_id": "MQKmPqUKwPuRJyo4NlHE6g", "text": "I sent this in to the online feedback site and the owner of the store called me.  He was so apologetic.  Joe is really nice and I hope this customers are reading this.  He embodies a hard worker.  He was honest and direct.  Unfortunately, for him his workers leave him unable to compete with bigger stores.  \n\nSo for Joe, give the store a try.", "business_id": "229b4Pen_-XsyZ3Y2ktxGA", "stars": 3, "date": "2013-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "C9OYoifK_gAW9TS3ZGJMAQ", "review_id": "4ZAd-qsWP9k4Op276_Iw3A", "text": "Miller's isn't bad--but it's nothing special either. If you're on the west side of campus and you're too lazy to make the trek to Riley's (but have no intention of just settling on Miller Lite or whatever you can find at the BP)--that's what Miller's is great for.\n\nIt's a clean and friendly store, but their wine, wine cooler, and overall selection is kind of average. It's better than what you might find at a gas station, but it's not anything phenomenal.\n\nThe prices are fair for what they have. Overall, not a terrible place, but if you want something to write home about, you're better off somewhere else.", "business_id": "TccRMp6gd1MgWy6hP44hGQ", "stars": 2, "date": "2010-08-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5nbNsKfBhusQo7iOyopDqQ", "review_id": "RxWoPg78e3k9Q1v_Cm20Gg", "text": "So good! The hostess mints are magical. That's all I want now and forever. Caramels and pecan clusters are also the jam. If you're in the mood for chocolate, don't think twice.", "business_id": "cMJL8kZOF0VsYMhM2DKkBw", "stars": 5, "date": "2014-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xN72Gb6RXrUIMLVYOfo2RA", "review_id": "o4AFOoqbaHWhoMI7qDBeYg", "text": "The owner and his wife are delightful and very helpful. \n\nThey can provide literature that helps increase your understanding of various supplements and conditions. \n\nThe prices seem reasonable and the selection is impressive!", "business_id": "KFbxRthy3tKt-oi1Jp7XdQ", "stars": 5, "date": "2010-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kltu5MyodHXondt_qvdAHw", "review_id": "3ZfGWp4SBGH49zxGUVO72w", "text": "Ok...I had my first bad Kopi experience today...the Thai Tempeh panini was just...disgusting.  It was gooey, there was way too much peanut sauce, and it was on regular sliced bread (I tend to think of paninis as being made from a more substantial bread like ciabatta or something).  It definitely was not worth the $5 I paid for it, and if I'd paid the full price ($7) I would have complained.  Lesson learned: don't get the Thai Tempeh panini.\n\nI've yet to have a bad drink from here, and it remains a great place to hang out.  Still a great cafe as far as I'm concerned, but evidently not everything on their (food) menu is as tasty as their drinks.", "business_id": "yzInxReAkf7r0aRbwj02Yw", "stars": 4, "date": "2011-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wtsl05RJj5f6YBDQPEwP2w", "review_id": "ffS64Yek0-NrdHkTqDluXA", "text": "Hehe.  I love Dunkin' Donuts. Almost never have to wait inline here - great speedy service and they always have what I want ready to go.", "business_id": "xky2rWT8kpsdyJ4YgZB3Jw", "stars": 4, "date": "2012-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HqaXK9toBpQdcz-0-rVwKw", "review_id": "GnDZPn_6fPV36fBGwAFXpg", "text": "A unique treat in the CU area. The setting is quaint, the custard wonderfully creamy, and the toppings decadent...a perfect place to go with friends or on a date. I only wish it were closer to campus. I highly recommend the lemon custard.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2007-07-03", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "oH_EeAPfH3QJzR9xNWmuvg", "review_id": "cj3MvnTENJCCbYrEdwDfGQ", "text": "I live closer to Champaign, and have been enjoying the Jarling's Custard Cup there for a few years now. I recently also visited their Danville location. I understand that there is some kind of \"rivalry\" between fans of each of the two locations, kinda like fans of the Cubs and Cardinals. But, I'm sure it's all good fun, because as far as I can tell, both locations have excellent frozen custard deserts.\n\nJarling's is the first place I ran into the idea of \"cold fudge\". It's just like \"hot fudge\", except that it doesn't melt the custard. Brilliant!\n\nSeveral flavors of frozen custard are always available, in just about any conceivable configuration. I've always found the service to be friendly at both locations, and the treat to be just the thing for either a hot summer day or warm summer evening. Bring friends. There's really nothing like sharing an experience like this with friends. That's how I first learned of this place, when friends from work invited me along for a Friday afternoon \"meeting\".", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2010-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "JgHGyWS2emyHq6aq144SLQ", "review_id": "WXDDDNqEoNnm-wV2SWGfkw", "text": "So good!  I've tried key lime custard, chocolate ice cream, and a blueberry milkshake.  The milkshake was amazing!  Definitely worth a stop.", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 5, "date": "2012-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zU-DNyUlkBeL-3t7IJDdAw", "review_id": "JOqL_ljjyBzbHUln0u46gQ", "text": "This place is a nice little gem in Champaign. It is a great place to stop on a hot day for a nice cup of custard. There are so many options on the menu, so it is easy to find something that you will like. I suggest the vanilla custard with cold fudge. It is absolutely delicious. Who knew that cold fudge would be better than the classic hot fudge? There are plenty of seats outside, and there is a large parking lot. I have never been there when it is busy, but I have heard that the lines can sometimes be up to an hour long. The only reason that I am not giving this place 5 stars is because the service is kind of slow. There have been times where the person helping me will take a long time getting my custard made, but I realize that when it's busy, sometimes it can be overwhelming. Anyways, I would definitely recommend this place, and I can't wait to go this summer!", "business_id": "ciRNik0_EdguibEypTspFA", "stars": 4, "date": "2015-06-06", "type": "review"}
{"votes": {"funny": 6, "useful": 5, "cool": 2}, "user_id": "JgDkCER12uiv4lbpmkZ9VA", "review_id": "pFFGx970oIy_T_OPjgExXQ", "text": "This place is a JOKE! I have been shopping here for years since both my current and previous residences make it the closest market to me. \n\nThey always used to be open until midnight, but nooooo they decided to start closing at 10PM... WTF! I used to always go after work at 10:30 and they would talk about it being the 1030 rush where it would get really busy. What shit for brains thinks it is a good quality idea to close up before your daily rush?\n\nAlso the place ALWAYS has long lines. It is not that it's really understaffed, it just seems like most of the employees are fucking off somewhwere. I know most of them by name I shop here so much, and they are not a good group of managers. \n\nAdditionally, they close the deli counter at like 7PM.... seriously, wtf is wrong with this place?\n\nOh and did I mention some illegal (I have proof he was illegal) backed into my car there and the security guard (not a safeway employee but still should maintain professionalism) told me that it looked like it was my fault. \n\nScrew you safeway!\n\nSee you tomorrow.\n\nEdit, forgot to add how they are always out of their HOUSE BRAND water. Seems like half the time I go there they don't have it. And yes, I agree with other reviews there are always some hotties in there.", "business_id": "7Z7IkR_-94AjUuDw0fbI7g", "stars": 1, "date": "2008-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "KHx6t3aN-bUzcv79viBv6A", "review_id": "vg7wonithYkH6ExNDuWpNw", "text": "My Mom and I took my Grandmother out for tea for her birthday.  Tastefully tacky is how I would describe this tearoom.  Refined clutter is another.  The outside looks promising, a cute Victorian style house.  When you get inside you are met with all kinds of \"old style\" wares for sale, a fir tree and dried plants.  Yuck.  And what is up with a plant in the bathtub of the bathroom.  There were things for sale in just about every crevice some with a \"made in China\" tag displayed, how classic Victorian.  And in the second room, you are met with a whole bunch of clutter catch on wide display.  In fact, there was paperwork, calculators, etc. covering their bar area.  Make an effort people!\nService was very uneven, our server was wearing a black outfit and skull socks.  A bit out of place.  And she made us box our own food.\nThe teapot from which we were served was cracked and looked like it had seen better days.  And the room temperature needed some adjustment for a Phoenix summer day.  Also, they had a random radio station running playing everything from country to Cyndi Lauper - not what you expect at tea.  We had to ask our server three times to turn it down.\nHowever, at this price point, the food was decent and well presented.  We had leftovers to take home.  We had taken my Grandma to the Ritz Carlton last year and next year I would rather spend the extra money and do the same.\nNOT MY CUP OF TEA!!!!!", "business_id": "gBcpDl0quCLABsg5OuSFww", "stars": 2, "date": "2008-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cg4em4uXe5ab5qH7pB01gg", "review_id": "oQZ3A_iMyLgOCjtldCqnoA", "text": "It's a taqueria in a Latino supermarket.  Nothing special but you have choices. \n\nThey will have just about everything you may like. It's not gourmet and some things are just sitting in the pans but at least you can look at what you want.\n\nI'd go back if I just needed something quick....", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 3, "date": "2010-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6b2M5VFW6e0STe0N92pYkg", "review_id": "LYfjwc-6MzTMSnq8Cx8-hg", "text": "Tried this place out of the blue looking for a new lunch spot and I was impressed. They have a huge selection of food with some fantastic smells when you walk in. Everything is charcoal grilled and tastes pretty authentic when compared to most of the other mexican places I've been to around the valley. Great value for what you pay, and the market/grocery store side of it is pretty interesting too. I'll definitely come back here.", "business_id": "apCfJVnRyaw6oVUBKujpUQ", "stars": 4, "date": "2013-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "4oqxuazr5bvGLNaFugGexw", "review_id": "arFH2uSQZhFlYlsaSp9hVw", "text": "I love this place. It is right down the street from my house and I stop in there several times a week. Everyone there knows me and has what I usually purchase on the counter before I even walk in. Amazing customer service, great options for beer, wine and even produce. It is so much easier and better than circle k or anything else around since it is smaller and I don't have to wait in a 20 minute line.", "business_id": "fAJvlRFhdYJlMyG-CA4ErQ", "stars": 5, "date": "2013-07-02", "type": "review"}
{"votes": {"funny": 4, "useful": 9, "cool": 3}, "user_id": "JkMOQaMjlBHMqp6gj-hL3w", "review_id": "AQB03ZmfOUe4IJlLY5Zlvg", "text": "Hello Ranch Market, nice to finally meet you ! Since moving to my new hood I have fallen in love with this store. They have things I have never seen before anywhere else. I am so overwhelmed when I go here, I am in sensory overload.\n\nMexican bread is 5 for $2, bolillos are 6 for $1, tons of seafood, fresh chorizo ( which I have been eating everyday for a week ), tons of snacks packaged by Ranch Market for super cheap, you can get a meal for 4 people for $10 ( carnitas, rice, beans, tortillas ) and tons of other specialty items. The atmosphere is fun and inviting and everyone is friendly. This store has inspired me to create new dishes at home, like my homemade beans and chorizo. \n\nGo here, eat some of their prepared foods that are inexpensive and delicious OR get some fresh ingredients and make something yummy at home.\n\nSee ya soon Ranch Market.", "business_id": "VXIkI9_EbDbYHeO9IzKjJg", "stars": 5, "date": "2011-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "0qIsBt4EzBDCKrIviV55Ew", "review_id": "Fhv0_RkrlnKUadc_WQ6aZw", "text": "Wow, Rainbow Donuts, what a difference new management can make.   This place has really \"baked\" a new standard for tasty doughnuts in the Phoenix area.  \n\nThe restaurant takes pride in a clean front seating area and a very clean kitchen.\n-Hours, 4am to 7pm\n\n Baking the doughnuts everyday makes the doughs soft and sweet.  \nI also enjoy the bagel or croissant sandwiches.  If you like croissants get their early before they sell out.  \n\nThe multiple shops are not owned by the same person or group.  I work close to the McDowell Rainbow Donuts, so its my favorite. People love a doughnut why not share them with your friends or co works.  \n\n\nSincerely,\nKevin", "business_id": "Xobu8FzHN0KUm5Lw3swypA", "stars": 4, "date": "2011-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vP1-Z02_14sYZC2mr_3j4g", "review_id": "cdqUmxADOED5GOr5Yk-j-g", "text": "Place looks decent from the outside but once you enter the restaurant, there are flies flying around everywhere and the place seemed old and filthy. The wait to be seated was not too long considering it is Father's Day, however the filth was unbearable. I'm talking about nasty smushed food stuck in between menu pages, seats are covered with crumbs and greasy finger prints, water spots on silverware, tables don't get wiped down with sanitation towels and I can go on, and on-but you get the point. Never going back! I'd rather starve...", "business_id": "SZvYxcvYYVRue9MXcEDjsA", "stars": 1, "date": "2015-07-09", "type": "review"}
{"votes": {"funny": 4, "useful": 2, "cool": 3}, "user_id": "Ak2jlINPRk9dWWazWUW2hA", "review_id": "cCG4NAPth_KDXXZ0Rl-6hQ", "text": "Am I the only person that CONSTANTLY gets static electric shocks at Costco???\n\nCostco is pretty much the same where ever you go in the valley.\n\nWhere are the vegetarian options??  Thats nice you can get a 20 pack of Italian sausages, but where is the multi-pack of tofu??", "business_id": "XLqnjlLYt0_q_NG7l_BpMA", "stars": 4, "date": "2008-08-22", "type": "review"}
{"votes": {"funny": 6, "useful": 3, "cool": 2}, "user_id": "7e1XAK4j95x-ibEy4qFKYg", "review_id": "I-w2qvmw4v6bpkbNmh2hfg", "text": "Maybe I'm doing it wrong. Maybe I'm just taking crazy pills (you can buy a bottle of 10,000 for $6 at Costco)... but I hate this place. \n\nI break out in hives every time I think about having to go here... So then why do I go here, you may ask. The same reason as everyone else. The same reason listed in all of these glowing reviews... to save a little bit of money.\n\nI come here for almost the same thing every time. Diet Coke, allergy meds and giant bags of frozen chicken breast. Those are my three go-to items. Every few months there's the toilet paper, paper towels, laundry detergent... blah, blah, blah. You know the drill.\n\nWhy do I hate it so...? \n\nPretty much for the same reason I have a deep disdain for Walmart. It's chaos. And in true Walmart fashion, I actually saw someone wearing their pajamas here the other day. \n\nPeople walk around here lulled into some kind of trance by price savings and free samples. It's maddening. In the parking lot, in the store... waiting to turn INTO the parking lot... people are crazy. They completely stop paying attention to what's going on around them. I've been touched inappropriately by shopping carts, nearly run into by cars. It's insanity. \n\nOh and by the way, speaking of parking lots... why the hell aren't there more cart return areas. I think I've seen two... It's generally a game of, can I find a spot to hide this cart, or should I just walk it to the front of the store. \n\nAnother thing: A lot of people talk about the great fuel savings... I've never purchased fuel here. Wanna know why? Because every time I come here, the line for fuel is no less than 3 cars deep per lane! No thanks. I'll pay 10 cents more per gallon somewhere else. \n\nAs I sit here typing... anxiety level rising, I wonder to myself... are the savings really worth it? And for now, sadly, the answer is yes. But one day... One Day Costco! I will be free.", "business_id": "XLqnjlLYt0_q_NG7l_BpMA", "stars": 2, "date": "2014-07-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-jgGsPzZ4W2TyGh7KOwl9Q", "review_id": "p6ubPsm9bmO6GPuiWDZlPw", "text": "AJ's is caught somewhere between a chain supermarket and Whole Foods.  The produce section is nicely stocked and includes some harder to find fruits and veggies and the prepared foods looked pretty good.\n\nI was definitely impressed with the wine, beer, cheese and meat counters which all have great selections.\n\nA good place to fill the gap and get your common grocery needs with the specialty items typically found elsewhere", "business_id": "Mng1FUcW-xRSdsDkowQm2Q", "stars": 3, "date": "2011-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DD04nMRVg0fBGHCX3uCLwA", "review_id": "O-_0Go1yuBDOOfclcQJ8Sg", "text": "I love this location, very clean, helpful staff.", "business_id": "HfWkdqxegjiGEXzI8j7Wwg", "stars": 4, "date": "2013-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ll-ILdELsRg-iZ5jSzB1vA", "review_id": "rIUnHNjF5JwjR6dWT0iOzw", "text": "Y-U-M! I can't wait to go back to this little gem. Try the \"Tyler\" it was delicious. They have so many menu options, I'm going to have to make several trips back to try everything. The shop itself is very small, quaint, clean and family owned. The owner was kind and helpful, I can't wait to go back.", "business_id": "UWrB5H3G-hhiHMy3iKV2ew", "stars": 4, "date": "2014-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "2KyJLMY3jmASmwtnmlBuvw", "review_id": "tCMaXodLZ-CG_GlFxJq48A", "text": "Their slogan says it all:  The Best Little Brewhouse in the West!  Terrif food!  Great service! Reasonable prices.  Nice combination.\n\nBeer is brewed on-site. It's on-draft, & they *even* have DRAFT RootBeer!  [YUM!]\n\nBTW, if you can't get 2 meals out of their Kobe beef burger, metinks you're eatin' too much!   :-)\n\nOnce, when the soup-of-the-day was lentil (I love lentils) in a tomato broth, it was so good, I had to order another bowl to take home (it was great right outta the refrig!", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 5, "date": "2007-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "--65q1FpAL_UQtVZ2PTGew", "review_id": "zHQ00iEVHWhJyOSpYI-BfQ", "text": "I'm a big fan of local craft beer and I'm happy to live within walking distance of this little place. Most of their beers are alright, but they have some serious winners on deck if you enjoy hoppy ales. Their seasonal selection is also almost always stellar. At the point in time I am writing this review, they have a high-strength ale called Risky Red. It is fantastic! There is a limit of two per visit due to its high alcohol content (9.7% I believe) but two could put some folks on their asses, I'm sure.  \n\nFood is alright most of the time, and if you hit up their happy hour (which runs 3-6 and all day Sunday), you can get some decent bar food for cheap. Not only that, but you get $1 off all of the beer! So Sundays you can probably find me here enjoying a day drink. \n\nIf you're in the area and want a drink, or if you want to pre-game before a long night at Rosie's, this may be the place for you. Go ahead and try it, and hopefully you can get a taste of the Risky Red while it lasts.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 4, "date": "2010-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "X5GbNXY_nNoa_vTZDD0aCA", "review_id": "UhC-TP921dJE-ZGRpK1FJA", "text": "Lets start w/ this: this place comes up on you quickly. If youre not actively looking for it, you may miss it. And when Camelback is busy, itll be a chore trying to get back to it.\n\nThis place is not as tiny as you think, it has different rooms. Ive been by the door near the 1st bar and all the way at the back bar across the patio. The staff is great,we've never had bad service here, and its usually very busy.\n\nThe food here is good, not as good as some other breweries that serve food, but also definitely not like your average bar food.\n\nThe beers here, I dont so much enjoy. The Vanilla stout was good, but everything else was kind of bland. I should mention that we got samplers the 1st time we came as to try everything, They did, however, brew a special cherry beer for the AZ Girls Pint Out group that was awesome. Seriously, if you ever see that they have Cherry Buzz on tap, get it.\n\nI wont be coming here again, but I encourage those who like craft beer to check it out. You may find something you like.", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 3, "date": "2013-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5CF0df3qlgZgxEBK48DlyA", "review_id": "wGSIBxJpiPRWc0qwcxj_ow", "text": "Ignore the 'wait to be seated' sign and grab a table or head to the outside patio. Love love this place. If you come in fairly often (1-2 times a month like me) they remember your meal and drink preferences.   Service is always spot on and I've never had a bad meal here. Wish they'd bring back the salmon Reuben though. That was my addiction!!", "business_id": "3UMcsN9IjoeV8JZvC4apag", "stars": 5, "date": "2015-06-20", "type": "review"}
{"votes": {"funny": 2, "useful": 8, "cool": 4}, "user_id": "N-D-d1Z4UybdlkK1HxlNPA", "review_id": "34DijCywed1g0ye7oQ6Znw", "text": "I stopped in at Karsh's today for the first time. The service I received was super friendly, and the young man behind the counter insisted I try a raspberry rugelach. It was pretty tasty, so I took home a loaf of seedless rye (one of my favorites), a black & white cookie, and 2 cupcakes. \n\nBefore I moved to Arizona, I worked as a bread baker in a restaurant, then in a bakery much like Karsh's, and then finally managed a bakery that made all natural and premium products more like Tammie Coe/MJ Bread. So I recognized immediately what Karsh's was using. Both cupcakes were made from a mix. The fudgy frosting is a commercial product. I know. I used it. The white frosting is made with vegetable shortening, not butter. The black & white cookie was like no black & white I have ever had. It was so thick and cakey- not at all a crisp cookie. Neither my husband nor I cared for it. The rye bread barely tasted of rye, although it had a decent texture. It was pretty heavy on the white flour. I've had better from Fry's.\n\nFor me, Karsh's was a big disappointment. IMHO, locally, no one's bread matches MJ's and no one's baked goods match Tammie Coe's.", "business_id": "vaqmESluryt5i4Wbkb6KRA", "stars": 2, "date": "2008-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BXmS1GcUQIFTceRhBXDg1A", "review_id": "5t-zFMOqaCyANLc2BxiToQ", "text": "Great selection of homemade sausages and smoked meat. Nice samples. Prompt, courteous service. Great value!", "business_id": "XRBTHOXaJK_AJ2wy5mX_1A", "stars": 4, "date": "2015-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "A-jjRYTVlUrL6Z7wIIzZIg", "review_id": "kaiQx5dp5y03-O6g6BckJQ", "text": "Awesome store they have absolutely everything! It's amazing and staff is so nice and helpful", "business_id": "XAaXT0e70-USVYVKcnljsg", "stars": 5, "date": "2014-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y76b3SuhzkXUzyvQbZEEBw", "review_id": "0sMv0JH3BMWKYj7QUNaTpQ", "text": "My favorite Starbucks in AZ so far...  I love the couches!", "business_id": "TGb6D6zmx1KP4aDDH5Aihw", "stars": 5, "date": "2012-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bwo_j9OGpZN60T5HxKOTeA", "review_id": "_aUDQYAitIamweUPAvNbeA", "text": "This should be a four- or five-star place. But the service brings it down. The bagels are excellent, and there's nothing wrong with the food. But the staff leaves the coffee too long - it always tastes burnt / bitter / terrible (just go next door and get a Starbucks). They also take no interest in the cleanliness of the place - I have never seen someone come out and wipe down tables or sweep up debris. Staff turnover is high and competence is low; they tend to have an attitude.", "business_id": "KNIw6kwf8LZkrS1lEnaLiw", "stars": 2, "date": "2009-06-27", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "WgX4RZT2nbqXcJclDWHWYg", "review_id": "S6K4EEnMk6CSJInAZ6LV8g", "text": "Went with my boyfriend for an adventure day breakfast. I got a cheese danish & he got an (apple) pillow. AMAZING!!! The cheese danish was the size of my face and very tasty (as was his apple pillow that I got to try a bite of). DEFINITELY going back to try lunch sometime! And we only paid $7 for our pastries, my coffee, and his water & apple-mint drink.", "business_id": "jSEcE8AY-mzGq9EOiyrtng", "stars": 5, "date": "2010-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4Lh-jqwYtXrZFJMw6q8C7Q", "review_id": "NjCehKgivcXfG0O_-N8L1w", "text": "I went to Niccoli's on Thursday, July 3rd, 2014. We order 2 sandwhichs which we ate their, our sandwhichs were good. We also purchased a Jar of Hot cherry peppers , Imported parmaggina reggiano cheese, a package of pasta and our bill total was almost $80.00 . Well both my parents were Italian immigrants and homemade foods were a staple in our house. This is were my expierience went bad. The so called imported cheese was flavorless and it was the worse cheese I ever had and it costed  $27.00 for 3/4 0f a pound. What a descrase and what a rip off. The jar of peppers for almost $12.00 was tastless and already opened. I have never been so upset that people would purposly deseve hard working people out of their money a sell a infarior product and claim its something else. Shame on yo Niccoli's Deli. Maybe you can fool people who don't know better, but you can't fool a New Yorker who is born to 2 Italian immigrants. I will never go their again and would not reccomened that Deli to anyone.", "business_id": "T5HYqRADhAL6VPRAacz74Q", "stars": 1, "date": "2014-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NNdfPF-UhvLB8FxbsuSC5A", "review_id": "2lOVH3EP-R-qiK2ezogoJQ", "text": "This location does not accept Groupons, stay away from here and go somewhere else.  You'll have a headache by the time you get out of the store.", "business_id": "aeRyndix1wheBlff2FBsMg", "stars": 1, "date": "2014-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "obUfwBM9RA-PtjB5QDUABw", "review_id": "gr4RD0K0hFAMgsk32HQSlg", "text": "Don't bother, especially if you want an order to go. The sandwiches usually come with fires or sides like coleslaw or potato salad. Unfortunately, to go sandwiches are accompanied only by a miniature dollop of slaw. Likewise, the grilled chicken salad is lettuce, chicken, 2 cherry tomatoes, and 3 slices of cucumber for the outrageous price of $9.00.", "business_id": "fmuj7u1gflmEjW-h0v9bwg", "stars": 2, "date": "2012-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "78akFsTwDcO0i0NlDZX3SQ", "review_id": "pL84-FPiBbgXV9I2eSP87Q", "text": "I dig Cheesecake Factory. I've been here a bunch of times and never had a bad meal there. My last visit was for lunch with my friend and her 3 year old daughter. As soon as we were seated our server brought us bread and fruit for the kiddo. Portions are ginormous -- we had the Asian Chicken Salad and the fish tacos and went home with a full bellies and doggie bags.  The cheesecake rocks - I recommend the chocolate chip cookie dough. Yum!", "business_id": "2r8jGeuYvMkyP2ik_X-Bxw", "stars": 4, "date": "2008-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_h2h6TX5xhhWFIPMnpMd3g", "review_id": "2e09yiKyKGdZWyQ7lk14VQ", "text": "I guess The Cheesecake Factory doesn't really require a review but here's my two cents. I was a bit irate when they axed my favorite dish, the crispy spicy beef. Fortunately it was quickly replaced by my new favorite, the gumbo. I'm not really sure how a kitchen can specialize in every cuisine known to man but they manage to pull it off somehow. If i have one complaint, it's the excessive use of butter, which I can taste on my lips after every bite of almost every item on the menu. Then again, butter makes it better right?", "business_id": "2r8jGeuYvMkyP2ik_X-Bxw", "stars": 4, "date": "2012-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Jz0Gg9rzSTm-AogWvITR2Q", "review_id": "e1poTyuKF6KbDTUqKyC8ZA", "text": "National Cheesecake day.  What a concept!  So finally I got to try cheesecake from the factory - at one half of the listed price.  I went by myself and ate my treats in private because I didn't want anyone to see what a junkie I could be over cheesecake. \n\nCheesecake!  Instead of 8 bucks, I paid 4 for a slice and decided to get two.  Yes, two slices for the price of one.  Ordered the plain slice because I wanted to taste it naked and also the Dutch Apple Caramel Streusel.  And you know what, I even asked for a slice of their carrot cake which was $8 (full price because it wasn't national carrot cake day).  \n\nIt was national cheesecake day - did I mention that already? - and I couldn't wait to taste what I thought would be the best damn cakes in the cosmos. \n\nNot!  Not!  Not!  So ssaaad.\n\nI must have set expectations too high, because I was not impressed.  My naked cheesecake tasted like it was thinned out.  The dutch apple tasted better with better crust too, but not enough for me to give accolades.  And the carrot cake tasted like it didn't have regular flour in the mixing.  I can't really describe it, but  you know how there are sharp notes and flat notes in music?  Well maybe there are sharp flours and flat flours in baking, and this was made with a flat flour.\n\nI dunno.  Didn't finish either of the 3 treats.  Needless to say, I won't be considering any of the other flavours.  Not even on next national cheesecake day.  \n\nHowever, I may be back for a salad or salmon rolls.", "business_id": "2r8jGeuYvMkyP2ik_X-Bxw", "stars": 3, "date": "2014-08-10", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "54wr4oNkJsvaHM1U5n4iUA", "review_id": "MPcCUby1nqjQSP-ZoT2Agw", "text": "A rare authentic gem in Phoenix. This is the best french bakery / bistro in the Valley. The owner is from Lyon and has been here with his family for 10 years or so. His french pastry chef is extraordinary. Very unique find - imported directly from France as well. He's probably 80 and has prefected so many of his recipes. All of the pastries here are truly awesome.\n\nI haven't eaten here for lunch. But, the after dinner or before movie treats here are very good.", "business_id": "wftoNIA0Q8nX-Da47psBCA", "stars": 5, "date": "2008-07-06", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "UoBfwbXaixelZBghbJ2cSg", "review_id": "Zb6LDlO3s9gjsNRR6dbhkA", "text": "As a vegetarian and sporadic health nut, I just love TJ's. They have a nice array of inexpensive fresh produce, including my beloved broccolini, for 40% of what Safeway charges. Huge selection of frozen veggie-friendly dinners, good for my on-the-go household. Greek yogurt, cheap. Nice beer selection with lots of cheapo wine. I try to buy all my supplements here too, as they seem to be a lot less expensive. Yes, I'm all about saving cash on groceries and whatnot.\n\nThe downside? It's not one-stop-shopping; a trip always requires supplementation with another trip to a \"regular\" grocery store. This particular TJ's is teeny-tiny-small, and always chock-full of obnoxious and/or oblivious people who wield carts like weapons. My favorite is the woman who thinks it's an awesome time to teach little Jimmy how to push his own wee cart and comparison shop, and lets the little bastard cruise all over the store willy-nilly. I'm all for giving your kid responsibility, but a) you still have to, you know, keep an eye on the kid and b) a super-crowded claustrophobic nightmare like this place after work is not, repeat, NOT the time to do so.", "business_id": "Sy-hmzSH1OmWpHmAfZtxRA", "stars": 4, "date": "2009-06-22", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "gx3ZRjh43OOuavKl_rXvrA", "review_id": "RJpoMVdohQIunW_ONax8Gg", "text": "This is the best Trader Joe's I've ever been too and it's crowded for a reason!\n\nI've been here a couple of times this past week, addicted much? From their fresh flowers, produce, meat, snacks to drinks I don't think I've gotten something here I didn't quite like. Hell, even the frozen meals are ... what's that term again? Bomb (dot) com!\n\nThis location is packed, so you may have trouble going through the aisles but it's all worth it. TJ's has great prices and great products. I love their little sample stations and I was graced with being able to try their Spiced Chevre and Gluten Free Blueberry Muffins which were so amazing I grabbed the Chevre ASAP!\n\nThe workers here are so incredibly amazing and helpful. Whenever I'm staring into the products neatly, lining the shelves I'm approached and given recommendations if need be. The cashiers are awesome as well!\n\nDefinitely will be coming here for all my cheap grocery needs and fantastic customer service. Don't forget to bring your eco friendly bag! :-)", "business_id": "Sy-hmzSH1OmWpHmAfZtxRA", "stars": 5, "date": "2014-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RQCIeawLXYpjJxYVts7DDw", "review_id": "Py2h03neMMkqwMiWGvLtdA", "text": "Great coffee and friendly people makes for a 5 star experience", "business_id": "2h9LsLPdJ7OvZrYJZhVdAw", "stars": 5, "date": "2011-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "77jywQZVdlLgY9ebZYQfQw", "review_id": "-nb04gY2jRC57tGMaQMOLg", "text": "This place is really great. It is run by locals and the coffee and tea are excellent. They have free Wi-Fi and you can sit there and work as long as you like. It can get a little noisy, especially in the mornings when a lot of people in the neighborhood like to hang out. They also have frequent user cards and you get your 10th drink free!", "business_id": "2h9LsLPdJ7OvZrYJZhVdAw", "stars": 4, "date": "2015-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z1lPtIHU7bRoIvuVa01H5w", "review_id": "7upz_KigacCbmr8lE8h8Mw", "text": "Used to special order birthday cakes from Karsh's, but service and execution is consistently better at Barb's. Prices recently went up - my last custom quarter sheet ran about $70 -  but they'll make you a delicious cake that's a work of art or a fun conversation piece. \n\nNot Charm Cty/Ace of Cakes \"wow\" factor, where money is no object, but these are experienced bakers who care about your satisfaction and who seem to enjoy a good challenge. They'll consult with you, discuss options, take the necessary time to get it right. I've always been pleased with their final interpretations.", "business_id": "vv1uvJRBUqi707TA5GuhCg", "stars": 4, "date": "2009-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "zKyJDKJwAfWGB4HKXp9snw", "review_id": "CJ72PL1lNjeZuUZyUAf7UQ", "text": "I'm surprised that this place only has a handful of reviews, but I guess that happens when your regulars are a bunch of Yelp sales people who can't write reviews.\n\nI frequent this establishment bi-weekly and always get a legit sando. Not too many Deli's in Phx that are that classic Deli/Convenient store combo like you find on every few corners in Cali, and this spot nails it. I usually stick with the Ham & Turkey Club because their bacon kills it, nice and crispy, crunch.", "business_id": "gxuVySgACHDqJlwmelFHLA", "stars": 5, "date": "2012-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_6wM6y9DIaTWF3FLNt8Njw", "review_id": "cJlmGleecf7vjroMPbIcqA", "text": "I stopped here for some Hawaiian shaved ice and I ended up buying a water bottle. It's been a long time since I last had some shaved ice but I really enjoyed it from here. Piña Colada is the way to go!  The syrup is all natural, none of that scary artificial stuff. Denise was very friendly and welcoming. She actually takes the time to shave the ice and is not stingy with the flavoring. As I waited around I noticed the different water bottles from liters to gallons. One caught my eye of course, perfect size for my workout days. She even took the wrapper off, rinsed and filled it with ice cold water.  AND, I can stop in at any time for a 35cent refill. Can I do that anywhere else? Nope. Thanks Denise.", "business_id": "OuRFI9c8s73i9whoTApxdQ", "stars": 5, "date": "2013-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lYblpGhSnlIZ0uKBdVRARQ", "review_id": "IzFb4T6JrpV3tWN-lyLZwg", "text": "Easy to find location, timely & friendly service,  tasty bagel sandwiches, strong coffee & a generous military discount. I'll definitely be coming back! Free wifi and ample seating, perfect for a study session or conversations.", "business_id": "5Js9G0axfWhbYlB9UgXLww", "stars": 5, "date": "2014-08-03", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "b9XdpPlzZCVimhNb0z8CNA", "review_id": "UdhrWTq2MfOGn-Cz0N1WOw", "text": "I have to say that I really enjoy eating at Sacks.  It's definitely one of my top two lunch spots for yummy quick eats.  I've sampled quite a bit of the menu and my second favorite sandwich is the O'Keefe.  It's basically chopped chicken, sautéed mushrooms, melted Swiss, avocado, lettuce, tomato and honey mustard served hot on a soft baguette.  The honey mustard gives it just enough tang to really bring out the flavor of the seasoned chicken.  My only \"beef\" with this sandwich is hot lettuce.  I'm sorry, but there are some things in this universe that were not meant to be, and lettuce being served on a hot sandwich (or on a hot Mexican food plate; more on that later) is not one of them!  \n\nMy most favorite sandwich here is the Symphony.  I like to think of it as a turkey club with a twist.  It's loaded with fresh turkey breast deli style meat, bacon, avocado, tomatoes, LOTS of alfalfa sprouts, cream cheese and mayo on wonderful 12 grain bread.  I usually hold the mayo, because that's just the kinda guy I am.  You might say, that's how I roll. But I say, I'm just not a mayo kinda guy...\n\nThe best part about lunch at Sacks is the silver dollar sized warm chocolate chip cookie you get with your sandwich.  And yes, it's been reported that the Tiki sometimes eats the cookie first, but having no photographic evidence, you can't prove it and I'll plead the 5th.  And speaking of tiki's there's a really cool Tiki at the Tutor Time just a few doors down to the north.  Check it out!\n\nOkay, I said the cookie was the best part of lunch at Sacks, but I lied.  The really super dooper best part about lunch at Sacks is the Market Spice Iced Tea.  Some days it's too weak, some days it's too strong, but on the days that it's just right, it will blow your socks off, so you might want to bring an extra pair, just to be safe!\n\nMy only dislike about Sacks is that is can get pretty loud at lunch.  It's usually crowded between 12-12:30 so I try to go early or after 1 pm.  And don't forget, you can always call ahead and take it to go!", "business_id": "S8R5c7-plWe3NtmijYAJvg", "stars": 4, "date": "2009-07-08", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 3}, "user_id": "EJu5peGoO4tzop0pQtgHgA", "review_id": "ozvCg-LnSHSiZLEqwKwQ-Q", "text": "We went here for some live music a few weeks ago.  It was nice to see other people in there.   My order did get mixed up (latte instead of a chai latte), but I won't hold it against them :)  (I drank it anyway).", "business_id": "Mb46iSlA4qmTwXf-WrqtQA", "stars": 4, "date": "2008-08-02", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 4}, "user_id": "F9T6m1YdRFreyKDufcyoOQ", "review_id": "KbAeU6CaoN5OQ-zFEn5aIQ", "text": "Any place that makes a BLT with avocado is tops in my book because bacon and avocado might possibly be my favorite two food groups. (Yes, they are their own food group.)\n\nBeyond that this place is super charming. I loved everything about it. From the novelty candies to the delicious dessert case to the kitschy toys to the kitchen items. I actually thought this place was initially called \"La Garage\" because it was such a mish-mash of cool stuff.\n\nI imagine if I lived in Phoenix I'd be here quite often.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2008-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "BaOUXRuhIu-wvk7KPsPnjQ", "review_id": "SQ6z8lGa9YY3w6eg9Igjxw", "text": "Great place for meeting friends.  Good eats.  The english muffins are amazing!  Highly recommend this place.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 4, "date": "2009-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qI0DRRJyKrockWlVk3g7uA", "review_id": "HkRI9ZoG1SBfypREFofBxA", "text": "So I am in Phoenix for the first time on a business trip and as I am going to my meeting it is lunch time and I pass by the usual fast food options like the golden arches, KFC, Dominos, Taco Bell and secretly hoping to find something better but I am running out of options as I draw perilously close to my destination without any food.\n\nI entered a residential area and I thought all hope was lost for lunch but I saw a sign that just said \"Grocery\" so I figured I could get a sandwich not expecting anything better than something that came out of 7-11 or one of those rotating vending machines.  BUT, instead I walked into a delightful sandwich/restaurant which some tasty options from a real kitchen.\n\nI had the Tuna Salad on 9 Grain and it was probably one of the best tuna salad sandwiches I have had in a long time.  It has thin slices of apple in it that really makes it sing.\n\nLa Grande Orange - thanks for saving me from the drudgery of fast food.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 4, "date": "2010-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "mEaSom1N-bnr7C9V8s9WGg", "review_id": "jaXwy_IDPWSeNNQqrnWQPQ", "text": "I've been here twice. The food is pretty good; service is awful. The first time I was there it was very crowded. I was just getting a pre-made salad and a drink and apparently was in the \"wrong\" line. After waiting my turn and finally getting to the cashier, she rudely told me I was in the wrong line and wouldn't ring me up. SORRY. Did not know that, being my first time. \n\nI had a similar experience with snotty cashiers the 2nd time I went. It's always over-crowded but I guess the yuppie a-holes love this place. I won't be back.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 2, "date": "2011-06-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Hb49IsEZltm85wLz3uMrmw", "review_id": "tqv7P7PjGgUouCkEuWRqQw", "text": "Their pizza and salads are some of the best that I have ever had. I have had their pepperoni pizza, the margarita pizza, tomato and italian sausage pizza. I have tried all of their salads and they awesome! I make a stop into this tasty terrific joint ever few months. Best time to go is a little before 5 to avoid the dinner crowd which can give a wait upwards of 25 minutes. I do not recommend the Sangria as it has no flavor! There is a small gelato parlor that is connected to the restaurant for a sweet treat after dinner if you have space in your belly.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2011-08-09", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "9qCPmT6ovJjxL4tJB4ANCg", "review_id": "xL7WVFX35N7dKhiuxrz1yQ", "text": "I've always have gone to LGO after Postino and to get a dessert. I finally can now say I've had food that wasn't sweet.\n\nThe commuter sandwich was great. The muffin is awesome and the meet, egg and avocado really makes this a great sandwich for breakfast or brunch.\n\nThe one down side is the parking and trying to secure a table because of the popularity and good food being served here!", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2012-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hQJPPTEy_iamIVF7nfoFGQ", "review_id": "9fyFViJop-9Gb_Am1ESYgg", "text": "The commuter sandwich is a great way to start off a Saturday or Sunday morning. I get mine with bacon, havarti, and avocado. It is consistently great. Everyone I go with is a fan of whatever they get. The only thing that I have ordered that I was not a huge fan of was the guacamole BLT. The atmosphere and vibe can't be beat and there is always great people watching.\n\nI recently just tried dinner at LGO for the first time. I have always appreciated their breakfast but now I am a giant fan of their dinner as well. Quite possibly even more so than the breakfast which is saying a lot. I got the avocado pizza with prosciutto. After completely devouring it, I must say it was one of the better things that I have ever tried. We also had the quinoa and kale salad that they split onto two plates for us without asking which was really nice. The salad was very tasty top it off with a bottle of wine and great ambiance. It was a really nice evening.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2013-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nzDUtI9Ov7RdGOgCP40uJA", "review_id": "8-bmdyPL7jvpgDrIH5VeyA", "text": "Very fun atmosphere. I love the store portion, lots of cute unique items. The food is freaking delicious. The desserts are amazing. The only reason I didn't give a full 5 stars is it is a teeeensy bit over priced. Ok not so teensy. It is overpriced. We paid A LOT for 2 english muffin sandwiches(Which we loved and still dream about) But jeez louise! Its an english muffin sandwich! It didn't come with any sides or anything! This is a good place for a date, maybe a good place if you want to splurge a little bit for a fun dining experience.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 4, "date": "2013-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bcjsPIrWKCbcQZosgA39jA", "review_id": "TYVS7Q9H2vlwkBdihws_4w", "text": "Food was delicious! Figuring out the layout and how to order was the hardest part! We enjoyed our meals! Everything was fresh and delicious!  \n      I LOVED the shredded kale and quinoa salad and spicy shrimp roll we picked up from the refrigerated \"pre-made\" case.\n     My friend ordered the Daybreaker (omelette made with egg white, turkey, avocados, grape tomatoes)  and French pancakes (crepes)  topped with strawberries, bananas,  and creme fraiche. Everything tasted fresh and amazing.  \n    We also took 6 English muffins To-go as well as several baked items. Among the bakery goods, we chose an apple cookie, some type of decadent double chocolate cookie,  a lemon poppy seed almond muffin, and a salted brownie. Each of them were delightful! I honestly don't remember which were vegan or gluten free because my friend chose the baked goods. Nonetheless,  I was pretty impressed with the flavor and textures! \n   I've GOT to return with my husband to get his growler filled, enjoy some 4 cent sangria, try a pizza, and grab another six pack 9 those amazing English muffins!  Looking forward to our next visit! \n\nIf you love fresh, local,  and tasty, or you need vegan, and gf options....you must try LGO! :-)", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 5, "date": "2014-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5GIFaWq2GxeBOUD4LbvGPA", "review_id": "wp1bIvgHxga_JVhVO899_Q", "text": "This place is delicious!! Complimentary valet parking. Whoot!! Came here for an early date night dinner and ordered some of their baked wings for an appetizer.. I don't like BBQ and these wings had some homemade BBQ sauce with some hot sauce. Which I clearly didn't see in the menu. So when they arrived I could literally smell the BBQ on them so I asked the waitress and she told me it was mixed in I told her I don't eat BBQ and she kindly took them back and brought some hot baked wings instead. The wings were good but in some areas they were burnt and i didn't like that taste but my BF did. Lol the wings also didn't have much sauce but the waitress brought us extra without asking. Score! \nOur pizza... Was delicious! It's a must try. The crust is just right ugh mouthwatering. Definitely will come back.", "business_id": "R8VwdLyvsp9iybNqRvm94g", "stars": 4, "date": "2015-07-26", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 3}, "user_id": "fczQCSmaWF78toLEmb0Zsw", "review_id": "aOSheh5n1ev1dM10-f530g", "text": "I'm actually tempted to give this Dunkin' Donuts 4 stars for the drive thru alone... but it is a chain and aside from the drive thru, there isn't anything that special or unique about it.  So, three stars it is.\n\nI've actually never been inside this location.  I've driven thru a handful of times for coffee and/or munchkins and I've always been pleased with the consistency of the product and ease / speed of pulling up to the window and placing my order to getting that first sip / bite!\n\nLast visit I had my dog with me and the girl working gave me an extra munchkin as a treat... so sweet!", "business_id": "T-AAN0CizEBOTtHinTuvrQ", "stars": 3, "date": "2015-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JGCAc1ELELm_P_-FlgX3hA", "review_id": "iUfftI5UdM_NFl8OCJKaAg", "text": "Better than Krispy Kremes sugar-and-air donuts, Dunkin's more cakey donuts, overly greasy grocery store donuts, and Bosa's lower quality. Haven't tried their coffee or other options, so I can't speak to those.\n\nBut like some people mentioned, the availability isn't always the best. Those maple-bacon ones are always gone before I can get to them!", "business_id": "ytcm2DXuJWKPTqCtr6uJ4A", "stars": 3, "date": "2013-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y1_8PbBPTzC2hie9_pEY8A", "review_id": "PcYOa2uFTgmrKTAZRYV02w", "text": "These people are wonderful! Not only did they repair a cake that I accidentally ruined but went out of there way to fix it. The cake was prepared for a special birthday party and they went beyond customer service to repair it! By the way, the cake was outstanding.", "business_id": "Rd5SDxM3S9QUvRayhqZl4Q", "stars": 5, "date": "2013-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "u9QCaamnGl7T5lGshpsG9g", "review_id": "Lb7qA1S500YH7uUZD8-h9A", "text": "I've been here several times and have never been disappointed with my coffees and lattes. All expertly made with quality beans, and not super caffeinated with a side of jitters like you get at Starbucks. Nice enough patio, but something about the layout of the inside is not feng shui, could be a little cozier. I wish that they had a drive through, because then I'd be there all the time!", "business_id": "4eFIVmbeCvJGCrhzmd-VYA", "stars": 4, "date": "2014-07-23", "type": "review"}
{"votes": {"funny": 8, "useful": 11, "cool": 5}, "user_id": "lPaYMDmJbAnv_3pmZH_inw", "review_id": "TJexA7yWxaTAc9ra4gGpgg", "text": "Overpriced and rude.. I wont give this place (or the asshole attendant) another cent of my money. \n\nThere was a spot on my hood so I was using the squeegee to get it off (it was less then the size of a dime) when the attendant runs out and tells me to stop using the squeegee on my hood. His reasoning, that the next person to use it expects a clean squeegee.. this doesn't make one bit of sense.. what would be the difference of me cleaning dead bugs off of my windshield or from the hood of my car? Nothing. Whether I used it on my hood or on my windshield the squeegee is getting dirty. \n\nAll it takes is one rude asshole to alienate a customer which he did with flying colors.", "business_id": "cl5gr18l4R00NnQbVtgJ5Q", "stars": 1, "date": "2011-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KLekdmo4FdNnP0huUhzZNw", "review_id": "Ou19W05YxZoZGsnVsda-Hw", "text": "Cleaner than any other QT I have ever been to. Very well stocked. Pleasant experience each time.", "business_id": "5kA00AnMdSjiwjowEIR9Qw", "stars": 4, "date": "2011-07-31", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 4}, "user_id": "vsXP832M0kOxKpfduD7dWw", "review_id": "PWlZKL_kBDgTfPSN_uKJUQ", "text": "I'd been holding off on a review because I love this place so much and I didn't want to let the cat out of the bag and have the demand foil my ability to enjoy weekly wine tastings, but I think it's time to share the good news. \n\nCave Creek Wines has a great tasting/wine class on Fridays. They start at 6 p.m. and it's $10. \n\nHere's what you need to know: \nIt's casual. The most popular question is often \"what is the alcohol content in this?\" If you get there too late for the sofas or tables, you will be seated in white plastic lawn furniture accompanied by TV trays. \n\nThey can only seat 45 people. The tasting starts at 6 but people start getting there as early as 4. Depending on what they're tasting it could be full before 5, certainly 5:30. You can find out what they're tasting by subscribing to their email blast or reading it here: http://cavecreekwines.com/discussion (You can also read about the other fun stuff they organize here). \n\nFair warning: There's no warm fuzzy apology or begging you to come back another time if you get turned away. \n\nYou can bring your own snacks and buy a bottle (or glass) to enjoy while you stake your claim to seats for the main event. There are quite a few regulars but they are welcoming and friendly. Don't be afraid to share your snacks with them. \n\nShortly before 6, Bob (of Bob & Lisa, the owners) will make an announcement that the food is ready. You can help yourself to bread, olive oil, cheese, grapes and, usually, some hot item like brisket, ravioli or meatballs. Though, sometimes it is a cold item like pasta salad. \n\nTasting starts promptly at 6. Make sure your cell phone is off and plan to pay attention or you'll get teased. Another warning: there will be a joke of some sort. \n\nUsually it is a distributor doing the presentation. Sometimes, it's the actual winemaker. \n\nEach of the 6 generous pours, (probably close to 2 oz. each) is introduced. You will learn something about the grape varietal, growing conditions, the winemaker, the region, the process... and, by tasting it and hearing the explanation so close together, over time, you will learn to discern what you like and why you like it! You can and should ask questions! That's how we all learn!! \n\nFinish your pour before they come around with the next one. There's no waiting. You snooze you loose. And, for God's sake, it's not like it's a full glass - no dumping! If you don't like it, surely someone else near by will finish it -- at least offer! ;) \n\nThe wines that are tasted are 10% off that evening. \n\nOne last tip on how to find it: it's on the northeast corner of Cave Creek and Rose Garden. The first light north of the 101. It's behind the Shell station, and the most visible sign simply says \"WINE\" in red letters. \n\nSeriously, it's a great value. I've been going for about 3 years. For about 2 of them, it was my Friday evening ritual. I learned a lot as a result. I'm grateful. I'm paying it forward...", "business_id": "bo7pxmvcRlZURzhfmIL4zw", "stars": 5, "date": "2010-08-16", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "DrWLhrK8WMZf7Jb-Oqc7ww", "review_id": "4UZZ6uBLeeMuyXB5k40w_A", "text": "THey screwed up my favorite salad - at least today. The smoked mozzarella pasta salad entered the realm of the inedible and found its way into my garbage can. If I lived closer, I would have returned the poor excuse for lunch. The issue was that they undercooked the main ingredient - the pasta. The tubes were hard and the salad was loaded down with so much mayo that it seemed like i would have been eating mayonaise salad had I continued down that path. Also, the Hatch chiles they claim that they put in the salad could not be tasted and the cayenne pepper kick that identifies this salad was not there either. My first week in Phoenix has provided lousy pizza, food poisoning, bad bagels and now my favorite salad has been tarnished forvever. With the size of the bowl of salad in their case, plenty more people will likely end up angry the next 2-3 days.", "business_id": "wepFVY82q_tuDzG6lQjHWw", "stars": 1, "date": "2012-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "abJSf-tb51e9fcdMeDv8dw", "review_id": "GvSO5LvPVrYNVvS_MkPoGg", "text": "Is this a hidden gem?  My friend told me about Food City and I think I owe her big.  I do not have a garden and love avocados, tomatoes, garlic, limes, and fresh herbs.  Prices have skyrocketed at other grocery stories sometimes with avocados retailing at $2.50.  The prices here were insane (and in a good way)!\n\nWhere to begin?  \n\nPineapples - 3lbs for 99 cents\nAvocados - 4 for 89 cents\nCilantro - 89 or 69 cents\nGarlic - I think close to the same as the avocados\nLime - 4 for 69 cents\n\nFresh restaurant style tortillas and chips for bargain pricing.\n\nTres Leches cake that was out of this world!", "business_id": "dr3FmOSZ_Iy2WyPnS5ABOA", "stars": 5, "date": "2014-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KLekdmo4FdNnP0huUhzZNw", "review_id": "FCuZdTIAMWPg1gMDpqSusw", "text": "Haven't had a bad meal here yet. The salads are large. Large enough to share or have half and save half for later or lunch the next day. My favorite is the Thai chicken. My husband and son are addicted to the focaccia deluxe sandwich. They love the Parmesan pesto spread that have on it. I bring home a tub of the spread (sold sep) and a bag of the toasted bread for dipping when I have company. The baked goods are also excellent. All fresh and baked on premises. My favorite is the butterscotch ranger cookie. Darn. Shouldn't have told you. Now they will be out when I go!", "business_id": "j5HLcBru7FEirYJPbKFVWA", "stars": 5, "date": "2010-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Av6-ZyIAi44dvTqAehnRLg", "review_id": "0mUr72qFIApAdUXVivzpwA", "text": "Breadcrafters! What is this??  If you don't know, then come check this place out!!  This place is so amazing to come eat breakfast, lunch, and even for dinner if you wanna just come and grab it... come in and indulge your self with some homemade luv'n cookn' especially their breads, and omgoodness,  the is Santa Fe breakfast burrito, is da bomb, everything is all fresh and homemade!  Their salads, their soups, their desserts, organic teas..... i have not been disappointed yet, so if you do not have time to enjoy.... then call in your order for pick up or call in for catering and they will cater to you!   If you do not have time during week days then come out on the weekends, a guarantee to your satisfaction! !  Right across from PV Mall, SE side of Larkspur and Tatum, literally across from Wendy's, the not so healthy foods!", "business_id": "j5HLcBru7FEirYJPbKFVWA", "stars": 5, "date": "2014-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "FcyyFonYR4PrvFFxxXY3YQ", "review_id": "2IPrfD6wcABlHo5nMT7aeQ", "text": "Fun dive bar. I basically only go on Tuesdays, either to perform or watch the standup comedy, so it may be different on other nights. The $1.50 tacos are big and tasty. The beers are cheap but I'd prefer my dive bar drinks stronger and cheaper. Papa T, who runs the Karaoke, is cool character, and the singers seem like they have a lot of fun...\n\nSome people complain about the service but if you just introduce yourself and be proactive you should be fine. I've never had any problems. \n\nThere are always a few bikes out front, but definitely not enough to qualify as a biker bar. Either way, the clientele is cool...Again, this may just be Tuesdays...", "business_id": "-xLwGUmmyKgsTtFOOXzjeg", "stars": 4, "date": "2011-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yg_zpkRP1rNGPK5-sfd67Q", "review_id": "jkUoY2ysPoM9IvNDlfNHCA", "text": "My wife & I love this place !  It my be the best place in PHX for taco's no lie !!  Tue is the nite to go !", "business_id": "-xLwGUmmyKgsTtFOOXzjeg", "stars": 5, "date": "2014-08-17", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "XBHJCDzNh--mBhJkzyM_iA", "review_id": "UUn_q7PIJNCKUqoUBURmwQ", "text": "I've only been inside once for a jar of Nutella.  I know, kinda strange that I would stop at Yusef's for a jar of Nutella but I live right by the place and every deli has Nutella (and Yusef's did too, see-- I told you).\n\nAnyhow, I like this place for one really odd reason-- my Dad buys cherry juice at Yusef's by the case-- he says it helps his kidney stones.  My dad likes the owner and I think they are nice to him, so I am happy about that.\n\nI would like to try some of the fresh food they make, I'll need to make sure I take mental note to do so.", "business_id": "doEZAj-NSnoEMOJl5yXcNw", "stars": 3, "date": "2009-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xWJMGELqPMDeYJVEbFG8Zg", "review_id": "i8hqAczqzDVVj0zajIg1mQ", "text": "I found a thin rope in my donut!!! Not very clean, I would say!", "business_id": "YQKZafMWvIVXfLrM_QjQ1Q", "stars": 1, "date": "2014-07-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-L0i4tIcOIbAq_gPvykkLA", "review_id": "rVtHvBB5pFMvO2XVy-dCaQ", "text": "I have started to go out of my way to shop here. The produce is consistently some of the best around, the deli meats are quality, and the meat case is inspiring. I bought a pack of pork spare ribs the other day and decided to try my first barbeque with my new grill - wood chips, smoke and all. See what I mean?  So good!", "business_id": "hHE4OHAc8dONTV8QsGLbWg", "stars": 4, "date": "2011-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PS0lCxjGNeUrKxYSdpW-Aw", "review_id": "81vlZCExeOlv1jRoUTWBDA", "text": "Sure if you have a crazy craving for a weird pie Marie Callenders would be a great place to go, but other than I wouldn't recommend it. The food here isn't great, and I would even consider it overpriced for what you get taste wise. Also the real reason I wanted to review this place is the service here is just awful. I have only been there about twice in the past two years, but both times the service was just REALLY bad. I mean these servers were weird and did not know what they were doing.\n\nPlease Marie Callenders start screening your employees!", "business_id": "0QRvOpNbrHfik3wBupGFmg", "stars": 1, "date": "2007-06-22", "type": "review"}
{"votes": {"funny": 3, "useful": 7, "cool": 4}, "user_id": "kGgAARL2UmvCcTRfiscjug", "review_id": "I02zOgIXqJZ4AoirwLoEzQ", "text": "Have only tried their Muffins here.  I was in a rush to get to my gate and they happened to have the shortest line.  The service was very slow even though there was only one person in front of me....crazy.  The person working there was friendly though.  The Muffin was so/so.  I was expecting much better since I've had their Cookies at one of their Scottsdale locations and they were phenomenal.  Oh well, will have to give it another shot sometime.\n\nReturn Factor - 64%", "business_id": "Cm1jT60fxb1DjwpqjWJ8EA", "stars": 3, "date": "2011-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "omJn7cgDDrLCsaQ8GXeNdw", "review_id": "NPjlmvepIY_ZG54-0VyAfw", "text": "Good food!", "business_id": "d2AeNB4xw67E1Bzpo1Pm7Q", "stars": 3, "date": "2013-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "zGnNbnu-PSLzlQTjF_Dxhg", "review_id": "8bVFL1O2j7_2oc8YxkTtDQ", "text": "For years, I have been shopping at \"the fruit barn\" (my name for it.). It's about 15 minutes away from my house so I have been extremely inconsistent in making it my go to place for produce... Until recently.  I have been making it a conscious decision to get nearly all of my produce here now. I also buy my bread, raw honey, and dates here. Why do I make the extra effort? Because the fruit barn is that incredible. Here are just a few examples of why I love this place...\n\n1. The staff is über friendly. Anyone who says otherwise either came on an off day or a super busy time.\n\n2. The prices are incredible. Some of the prices may be comparable to grocery stores, but never higher AND a lot of the prices are MUCH lower. \n\n3. It is a small local business. I love that I get to support this business and they are providing my family the best quality products they can. Grocery stores don't do that.\n\n4. After I shop there, I feel happy. Sounds crazy right?!? Have you ever been to Walmart? You know how you feel when you leave there... frustrated, exhausted, like you never want to go back? This is the exact opposite. In fact, I often call my husband to tell him how much I love the fruit barn when I am on my way home from there.\n\nSo if you have the luxury of living nearby (or just being nearby), go there. You will get some great produce at fantastic prices and you may just leave happier.  And if possible bring CASH.  They do accept credit and debit cards, but charge slightly higher prices if not paying with cash or check.", "business_id": "1xoySA9Lzh3lwJeWJsq2Jg", "stars": 5, "date": "2013-08-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6anYEIYMB5N-6v1EgWdo_w", "review_id": "ih19sjkbn-GhAMJ8xpkNxA", "text": "A really charming feature of the Phoenix Metro area is the Farm at South Mountain.  Located  a couple miles north of South Mountain, it truly brings out that Midwestern nostalgia that has a very simple comforting feel to it.  \n\nOur destination at the Farm was Morning Glory Cafe.  With all outdoor seating you would expect it to get a little toasty, but the its completely covered by gorgeous trees that not only shade, but provide a picturesque surrounding.  \n\nThe food is all grown on site and the quality was great.  I had the Italian Omelet with mushrooms, cheese covered with marinara sauce.  It was delicious and the perfect size serving.  \n\nTheres so much I didnt get to explore on site, but for breakfast, I can't think of many better places.  Give it a shot!", "business_id": "MLcXtnpzygZvQ9BtseLLlw", "stars": 4, "date": "2013-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 3}, "user_id": "HOleI3jz1MLNUJ6cc1x0Pw", "review_id": "x3ed-ntkVY7_Dtxue79fXA", "text": "I've never been a huge fan of bagel sandwiches. I've always preferred just getting a toasted bagel and cream cheese when I frequent a bagel shop. However, the Nosh Bagelry not only has really, really good bagels and cream cheese (with lots of flavors to choose from for both), they also have affordably-priced and delicious bagel sandwiches. My husband and I tried the Nosh Veggie sandwich and the Nosh French Dip. The Veggie was standard but delicious, with veggie cream cheese and a bagel of my choice (I chose onion, naturally), and for only $4.99, I also got potato salad and a pickle. I know the French Dip ($5.99) sounds strange on a bagel, but it was surprisingly really good. The roast beef was decent, and the garlic bagel he chose added a little something special. One delicious touch was that the bagel was buttered; this, along with the au jus, made it rich and flavorful. I will definitely return here for either breakfast or lunch if I'm in the area.", "business_id": "8H1DwdAAgSBtwDeb2R-hmA", "stars": 4, "date": "2008-06-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "_TFVZLcNaPh6o-gwlMS9Lw", "review_id": "UjFmXv236dwakcU2BxeaYw", "text": "I like the food here...it is gross to watch the girl making the breakfast sandwich without TWO gloves and using the exposed hand (just hoping it's clean. Cross contamination must not be a big deal).the owner seems to have favorite customers. He has a bunch of younger girls working which is fine but as I stood in line I witness what looks like cattiness and 'tude...not towards the customer however. My only recommendation: call in your order, add an extra 5 minutes to their pick up time and you Will be good. Breakfast burrito and pancakes are always a good choice here\n\nADDITION: we waited for our order to be called (they call by name) they call our name and totally ignore us giving our order to the guys sitting right next to us. When we go and ask if he had just said \"Kevin\" the owner , without even looking up, completely dismisses us \"no I didn't say Kevin\" but then walks over to the guy and says \"are you Kevin?\" He says no and LUCKILY (or else shit would've hit the fan) the dudes order was exactly our order so their screw up was easily fix. Sooo clearly customer service isn't their strong suite", "business_id": "8H1DwdAAgSBtwDeb2R-hmA", "stars": 4, "date": "2014-07-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KpCUBxJfqwC2srtOCtl28g", "review_id": "Is777YxdKe0oozuZ49os2w", "text": "Best place for a bagel breakfast, and perfectly brewed coffee every time. I have been to several Einstein bagels in Az and Cali, and the Ahwatukee store is the best!", "business_id": "l4ymgiD1WnsSrwxWWk7a3Q", "stars": 4, "date": "2013-07-08", "type": "review"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "rX3BvECGJh8DLy23mgeaKg", "review_id": "-08Ej-BC1Enc88e_xfGl6Q", "text": "A cream cheese icing filled red velvet bundt cake...ahh, it just soothes the soul.\n\nOk serious now, Nothing Bundt Cakes is a really reliable place to get little cakes in a variety of flavors. Obviously, our favorite is the red velvet, but there are other choices too.  This style of bundt cake is pretty dense, more so than say a cupcake, but it has a real good flavor and they mix in chocolate chips.  Of course, the icing is good to, real light and fluffy, tasty too.  We haven't tried anything else, so I can't speak to the other flavors, but they look pretty good, we just like their red velvet and get cake so rarely that its hard to try anything else.", "business_id": "vPJ4iCOSuxCxHPtb18gwWw", "stars": 4, "date": "2015-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2A1_Thu5gkicZkfltQCXWQ", "review_id": "SRFZul2rwfKCUiNJadHFOw", "text": "When we were thinking of moving away from this area the first thing i thought about is how much i'd miss seeing and talking to many of the employees here. They see me just about everyday of the week, they get to hear about my life, watch my kids grow and it just felt like we would have been moving away from family. Thats what i love about this store i feel like it is apart of our family thank you very much.", "business_id": "Scy5uuSnzk4JcR8h6lctxQ", "stars": 5, "date": "2013-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pveHfyX1YuLhZ8K0rnvNKA", "review_id": "rb5FrTowZ5W5Aw1ZiuwOuQ", "text": "Slowest service ever. Three people at the cash register and only one person making the actual orders.", "business_id": "JJGkhOmfOFamPbCAaRKPPw", "stars": 1, "date": "2014-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2URwvKJRHf68V1UncLVaZg", "review_id": "uMSpfrDgXmuUbu_VlRLXYQ", "text": "Love the lobster & shrimp enchiladas!", "business_id": "d7V3ykQHqChv0KtXEanKLw", "stars": 5, "date": "2013-08-24", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "jIj45RYKoYuJTKkLsykNnw", "review_id": "Bp9zjOklcfKo6czKyAZXhA", "text": "So this is the best Starbucks in Anthem primarily due to the service. It's fast, friendly, and they always provide consistent quality. \n\nThere is one negative that's horrible enough to excuse the positives, and that is Steve. Steve is my least favorite server I've ever met, and he always seems to be working when I come in.  This review isn't a joke sadly, I've had to deal with his service too long and plenty of people that go to this location have told me about his distasteful \"service\" as well. \n\nThis location receives 5/5, but Steve gets a -4/5, unfortunately averaging it to 1/5.", "business_id": "brDiv7CufBg4bdFfPBY8Fg", "stars": 1, "date": "2015-07-11", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "jjed-fUFJE1QxMIzi1AvFQ", "review_id": "CXdPmAp4dgEU0eeExRSqDg", "text": "Conveniently close to my house. Staff is super friendly and the wait isn't too bad. My chai tea latte, sweetened green tea or frapps are made to perfection.", "business_id": "Vpg_FMSzMTBPvzpwbbRa7Q", "stars": 5, "date": "2015-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xyuqtuV71y2F3uD9z97jPw", "review_id": "mUYzfK2b12__SHJrO-HkDA", "text": "Ordered the #2chicken shwarma plate and the #9kofta plate to go.\nShwarma: perfectly seasoned chicken and rice with garlic sauce, hummus, salad and pita $8.00. Great price and tasted so good.\nKofta: meat was cooked to perfection, moist not dry, seasoned nicely. Came with rice, hummus and pita, substituted arab salad for the garden salad. $8.00. \n\nThey have great prices, you can eat in the market or take it home.\nGyro, fries and soda special for $5.99 and a buffet on Fridays for $9.99.\n\nYay Amera (Princess)!\nRamadan Kareem!", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2013-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6XJfj4qjQlxjT-nPw4MSUQ", "review_id": "tQ_SdW9ojBbCsfM6E_zF7A", "text": "Found another hidden pocket of goodness- to make you sleep within 7 minutes of finishing your meal!! No kidding! If you're having problems sleeping at night make sure to check this place out for dinner! ;) Your taste buds will enjoy the food and your brain will enjoy its \"powers\" to put you to sleep (like a food coma). But really- the dishes were delectable. \n\nThis is in the NE corner if 101-N and Broadway. With the outside sign a bit tattered, this little market still boasts a dining experience to talk about. Staff immediately greeted and asked whether it was dining in or ordering to go and chose to dine in. To the right there were several tables and booths to choose from. Immediately was given menus and asked if ready to order. Waitress was attentive. Chicken shawarma sandwich was around $4 and the kabob combo (kabobs of chicken, beef, and lamb) with rice, salad, hummus and warm pita was about $12. When asking the waitress what kinds if meat was in the combo she said she doesn't know- and just works there. That was odd because I would have thought that if she wasn't knowledgable about what was on the plate that she could have at least asked the other staff. A skilled worker should at least be knowledgable about those basic popular dishes. Maybe in time. Minus that part everything was exceptional. Baklava was super sweet and delicious. Ended up buying a few more baklava to go!\nOnce you're done just check out with the pleasant cashier at the front, and off to get some powerful coffee or to that comfy bed awaiting. ;)", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 4, "date": "2014-08-16", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 1}, "user_id": "NtR8QjRS4ZIrpOuBgSUZng", "review_id": "Dw8t-jcwrQm0bDbdXPBOcA", "text": "So delicious and very affordable! its a market with the kitchen and dinning area located towards the back. Very sweet staff.", "business_id": "4rr-CJp0jMKr-kg9wnrTdw", "stars": 5, "date": "2015-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0bCuYuRbQpqWGsJ1XiHqjQ", "review_id": "EeywUtBvrQ3KKdWNmyjJpg", "text": "We will not be coming here in the future.  I read some reviews before deciding to go here on a Friday night w hubby, we wanted something sweet.  Based on a review by a former employee, we got a banana split to share since it has 3 scoops of ice custard.  We were very disappointed when it came.  The scoops were a third size of Baskin Robbins.", "business_id": "9B_rnGpDieUnMr7szjuaQg", "stars": 1, "date": "2014-07-15", "type": "review"}
{"votes": {"funny": 3, "useful": 0, "cool": 0}, "user_id": "AeucYo8J-rZjcq09Wuqsjw", "review_id": "71IJLg-plQkwd4LQIUBF5A", "text": "If you don't love TJ's then im sorry but something is wrong with you and you deserved to be high fived in the face...\n\ncheap priced healthy fresh not your normal run of the mill food.(say that 5X fast)\nand the hummus selection is awesome!", "business_id": "4EeLblEpJc2VeBowa94YPQ", "stars": 5, "date": "2011-06-28", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "-9cIpMOoSBIm5lQ1tM4plQ", "review_id": "uSHAK75nGxnZvM8_Lb2D2w", "text": "Not sure how many Starbucks I have visited in my lifetime... many.  This will be a new favorite when I am up in that area.  Loved the layout - really big inside with high ceilings and tons of room and tables (where you don't feel crammed in).  \n\nZippy fast on not only getting customers through the line, but just as fast delivering your drink - made to order and tasting as it should.\n\nBathrooms clean, nice outdoor seating area.", "business_id": "1FkRvL3fj2ERBoddXwanTQ", "stars": 4, "date": "2015-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OaRIs6CvDlxPL44ya7stpg", "review_id": "ugzbO5yu7i_3nmzYsGC3Lg", "text": "If you love long lines and only 4 or less lanes open, then this is the place to be. The lines are long and the cashiers are usually old people who take their time with everything.", "business_id": "OdXjGy_iU6MpbDUmXDU8pw", "stars": 1, "date": "2014-08-04", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "_PzSNcfrCjeBxSLXRoMmgQ", "review_id": "YCGhWUhLSXeAMScg9ZpLXg", "text": "Normal layout of a free standing DQ.  The staff is so friendly!!!  I got the small smore blizzard...  OMG...  Party in my mouth...  YUM!!!  And the place is CLEAN!", "business_id": "kqFQLV63mAYCsY1LSB2OZw", "stars": 4, "date": "2013-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fg5WFBIz_GCW7bX0ebmnyQ", "review_id": "s6tUBy5Kb3LdVYGgjT78Ug", "text": "I went there for the first time about 2 weeks ago. I had the blueberry cheesecake with cream and it was the bomb. Love this place!", "business_id": "KHeM4cO2DWK1C09zWCFLFQ", "stars": 5, "date": "2013-08-14", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "APLIPfq1Rf8QyhHHk2uAyA", "review_id": "Tkv80LQTPGw4K5ydI2KwqQ", "text": "If you happen to find yourself in (G)Old Canyon and need a pick-me-up, head over to Gecko Espresso. They make some pretty decent coffee, I tell ya. No, you won't get impressive service. You may have to ponder the menu for a bit, even if you walked in with just an iced coffee on the brain. \n\nThey do sell a little bit of \"Gecko Cred,\" from shirts to mugs. But, they're more your cheesy truck stop stuff. Not the cool mug I got as a gift a couple year's back. It's a shame. That coffee cup is awesome.\n\nMy afternoon companion got a chai tea, which he drank 1/2 of, saying it was just too sweet. I tasted it. It was rather sweet. The cookie he got also got tossed. I tried that too; it was just okay. Yet, for 2 drinks and a cookie, I paid under $8, which I thought was a near steal, especially since their smallest coffee size is somebody else's medium. \n\nI found the guy behind the counter to be so lackluster. It's like he was hurrying us out the door. What? Do they close at 3 p.m. on Saturday? I wouldn't be surprised. After all, it is (G)Old Canyon.", "business_id": "aR972sxTNRM6mLZdqiPN_A", "stars": 3, "date": "2008-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "g6o9v8UNa_zCTYOwt4I0Cw", "review_id": "YsIKhMhRnrYqbqVzOv6eww", "text": "This market in a word is fantastic. I was directed here by my boss after she found out I had to buy loads of veggies for my dogs dehydrated food. In my particular case, I prep the food as soon as I get home and start dehydrating right away. Some of the comments that I noticed was that the food spoils quickly, that is true of what I had seen, which is why prepping the food as quick as possible is great. Just a few days ago we went in and bought over two dozen packages of strawberries for 3 for $1 and chopped and blended for strawberry \"ice\". Had we left the strawberries in the fridge for a while yes they would have gone bad quickly, but as they were we hardly had to remove anything for bruising. \n\nAnother tip is to pay attention to the prices, some items have amazing deals each week: 99c for a  head of cauliflower this week last week it was 1.99. Some items are a great deal and other as kind of iffy but it is always worth popping in for the weeks veggies. \n\nAll in all stop in and you wont be disappointed!", "business_id": "zZFXEqWY_bE6s_f38RhNMw", "stars": 4, "date": "2015-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lNy8SwuAyq4O2oosW-uGUQ", "review_id": "_sG04GdhBlrgjIWIgsshLg", "text": "I just moved to Phoenix, and the first thing my parents tasked me to do, was to find a great place for ice cream for when they visited.  I did a search here on Yelp, and found Angel Sweet.  A few days later, I found myself finally walking in, not really sure what to expect.\n\nThe amount of flavors they had was impressive.  There weren't 100 flavors, but they were very diverse.  They are very willing to give you samples, so don't be afraid to ask.  I tried the Coffee and the Super Dark Chocolate, but I pretty much wanted to try them all.  However, both were extremely good.  I was pleased to see they had a 4 oz. kid size, which was perfect.  Not too much, not too little.\n\nThe store was clean and tidy.  In fact, when the employees weren't busy scooping ice cream, they were cleaning.  I like to see that type of pride in work in the food service industry.\n\nI will definitely bring my parents here next week.", "business_id": "XWpkTxBLgRXxl7g2Hw62Qg", "stars": 5, "date": "2012-07-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "DoeLGirAfKmrivyKe1u6Ow", "review_id": "wsRiLz9NX4tI3ou3FGRtqQ", "text": "The service at this location is unbeatable!", "business_id": "H74aYRotUzWjAm8CEExOrg", "stars": 5, "date": "2013-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XPnlMN5HCsmSfD-JzRcEKw", "review_id": "xfpvc47tG1ai0fnTB4WqBw", "text": "Outside patio with fans and a mist system by the lake a nice hang out spot, except for the smokers.  Coffee is tasty with a lot to choose from.  Staff very friendly and helpful.", "business_id": "l1MZjZK2tLxfFRB62lQmsg", "stars": 4, "date": "2011-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SoWqOmt6GZcnKgWVn1J9yw", "review_id": "I7aFaH4niRq5wjEUW1wwSQ", "text": "This place is awesome. Great scenery to sit and hang out with close friends and family. Their drinks are to die for, and plus they are so much cheaper than Starbucks! Talk about a win-win. I always order the chai tea here and it's great. Perfect hint of sweetness. They even taste better than Starbucks as well. I wish this place was a lil closer to my house because I would be going there every single day. \nThe workers are also nice, they aren't robots that are forced to talk to us about coffee. These people honestly care about how your day is going so far and they always start the discussion as well. They also give out great drinks if you haven't decided yet.", "business_id": "l1MZjZK2tLxfFRB62lQmsg", "stars": 5, "date": "2014-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nIticQDzh6riUgLgFELD9Q", "review_id": "G_Xyx82ENstRhJR7ouDHmg", "text": "Love it, Love it! Just moved to Arizona 2 weeks ago from Cali and this is definitely great coffee and  the staff supper nice. Monday's is double stamp, if you want to know what I'm talking about you need to ho in and try it.", "business_id": "l1MZjZK2tLxfFRB62lQmsg", "stars": 5, "date": "2015-08-20", "type": "review"}
{"votes": {"funny": 4, "useful": 5, "cool": 4}, "user_id": "EoTooNBcxu0Hy0-XeZI8aw", "review_id": "e4sih3xvsGWqyBRPiKvogg", "text": "I love Lee Lee, but so many bad Asian drivers in one centrally located spot -- truly my peeps at their finest. I just wait until an hour - ish before closing time and everything is fairly quiet and sometimes they're putting out veggies for the next day. WOO HOO! Forget the early bird, I'm a night owl.\n\nAs for the \"weird smell\" as one yelper described, I ignore it. Truth is, I'm used to it and I know it's the same smell of any asian market, hell even parts of Chinatown in San Francisco. I've smelled worse things while traveling the world. Lee Lee's your typical Asian market (shout out to 99 Ranch in the Bay Area!), but better organized than other markets I've been to. The aisles are clearly marked - Chinese, Indian, etc. If you can't navigate it, then how you navigate the roads here makes me wonder if you should be driving at all.\n\nSince I'm hard pressed to find inexpensive Filipino food here in the valley, I find I have to make it myself. Lee Lee's carries all the stuff that I need to try (really, it's try, but never accomplish) and replicate my mom's dishes.\n\nIt's also really nostalgic for me as well when I go down the cookie/candy aisle and see things like the Strawberry Pocky sticks or the chocolate Pocky sticks...It reminds me of going to Japantown in San Jose on Sundays after church so mom could get the ingredients for her menus of the week. But what really makes Lee Lee a winner in my eyes is the desserts from Goldilocks Bakery as well as their assortment of breads.\n\nI'm a total starch slut, so seeing Pan de Sal and the Filipino desserts makes me happy. I buy a few things and then put them in the fridge so I can munch on them during the week.\n\nI also love their frozen food section as well - you can find such a variety of frozen potstickers, Indian food, sea food...it's a wonder one even thinks of going anywhere else.\n\nI like Lee Lee's a lot and their selection of fresh fruits and vegetables is one of the better places in the valley...unless you support your local farmers.\n\nService can be rude, but I don't expect hearts, flowers and puppies in places like this. It is what it is - an Asian market.", "business_id": "5KG0A3WlC7K3DAXtrIFFjg", "stars": 4, "date": "2008-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "8npiO5nwqI5JvhG_bGxLug", "review_id": "cP9hcFkZnNKaxD7o-KZxpA", "text": "just to let everyone know, because it does not state it on their site that they do accept food stamps or ebt!!!!!!!!!!!!!!!!!!!!!!!!!!!", "business_id": "5KG0A3WlC7K3DAXtrIFFjg", "stars": 5, "date": "2012-06-08", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "T209KcK7jVlTmuBWZW511A", "review_id": "5g_NiHATEGENUM54f7E_Lg", "text": "WELCOME TO ASIA!!! Ok, not really, but the moment you step inside Lee Lee Market, you'll feel like you've been transported to a different part of the world. This place is my go-to spot when I'm shopping for ingredients to make an Asian meal. They are slightly unorganized, but every aisle is packed full of unfamiliar goodies. Granted, some of it I will never buy (pig heads, chicken feet, live catfish, and what is that crazy looking fruit!?!) but you are guaranteed to come across something new every visit. Definitely worth an hour or two of your life to wander through the store! \n\nIf you're looking for a specific item, call ahead or go straight to an employee for help. While items are grouped together by type (cookies, fruit, noodles, spices), not everything is organized logically. Sometimes you'll find foods stored together by country (Vietnamese foods, Thai foods, etc), but certain ingredients will be in another part of the store. Ask for help if you're unsure. Large selection of beer and booze that is reasonably priced. Produce is always fresh and you'll find a much larger variety than an American supermarket. If you eat a lot of rice, buy in bulk (giant bags are right by the entrance).  \n\nThey have a jewelry store inside the supermarket, but I've never purchased anything there. One section of Lee Lee Market has trinkets, home decor, and traditional oriental items that you can give as gifts. They sell bamboo arrangements, as well as individual (living) bamboo stalks if you want to make your own. Another area of the store carries mobile phones, international calling cards, and other electronics. You can also purchase cooking tools, cutlery, and dishes.", "business_id": "5KG0A3WlC7K3DAXtrIFFjg", "stars": 4, "date": "2015-08-28", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "EReAHJGuV788PxfaAFd0kQ", "review_id": "gBFWFXkonoFp9f0AI5wkIA", "text": "It's...a Target.  It's right across the street (Frye) from the Chandler Fashion Center and will most likely have what you're looking for just in case you don't want to clod through herds of scantily clad tweens and moody teenagers or your run of the mill mall sheep.  \n\nOther than that, and on a more serious note, they have pretty much everything you'd expect from a big Target: pharmacy, photo, grocery, everything else, and alcohol (including some local craft beers!).  \n\nWhat else do you need, right?", "business_id": "DcML-4f7oib19ed67Ruv6w", "stars": 4, "date": "2011-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oGR0GPIbYOitJaa-VsvaFQ", "review_id": "QhVsQKaCQv8RWQT6i0myFw", "text": "Great happy hour sushi lunch..  Danny the chef is the friendly as well as the manager and front of store staff. ( Carolyn ,Loretta ,) keep pouring  the china mist tea.. :).. good ownership too.. Always there checking on the biz.. \nI travel to all the locations in Phoenix , Scottsdale and this location is the friendliest of the bunch.", "business_id": "oOo0xGOVq7cYTP1fORdoFg", "stars": 4, "date": "2012-07-29", "type": "review"}
{"votes": {"funny": 6, "useful": 5, "cool": 5}, "user_id": "858j9ZH9itvgeK5JPPvkZA", "review_id": "TrKcNnmpL21MhEuhGptCwg", "text": "OK, this is just wrong. The first review is from someone who's not from the area? People! Wake up! \n\nThis awesome candy store has many things a kid would love. I turned into one when I went at it. \n\nThings in it:\n\n1) The customizable M&M dispenser, so you can have your own choice in what color M&Ms you get. No more guessing! \n2) The Jelly Belly jelly bean dispenser, bins of M&Ms. I got a bag of toasted marshmallow, cotton candy, bubble gum and buttered popcorn. Words cannot describe how it was a cross between a big O, a big shadoobie and a horrible accident and I ended up in paradise (Willy Wonka version). \n3) They have candies I haven't seen in a while: chocolate coins, pop rocks, pixy sticks, wax lips, ring pops, salt water taffy. The list goes on! I gained a couple of pounds just typing this review up! \n\nSo, if you're in the area, and you heart heart heart candy, this is the place to go. Oh, and people of the Phoenix metro area, I better see some reviews when I get back here, or I will not be very happy. Okay?!?", "business_id": "4jaExIpQYRBzxqk9jaYlow", "stars": 4, "date": "2010-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6OWHDbEq23f24Vki_veHBA", "review_id": "J4XRyxdnj2A6kU3LHS7iQg", "text": "At the last minute, I changed my birthday dinner local from Oregano's to TCF. No hate against Oregano's, but I wasn't really that hungry and wanted cheesecake as opposed to a pizookie for dessert. \n\nSo we made our way to Chandla and our group of 6 was quickly seated, with no reservations mind you. Our server was very sweet, though it seemed she wasn't so well-versed with the menu quite yet. Most of our group ordered off of the small plates menu. I got the chicken samosas (I had no idea what they were, and neither did our server) with the caribbean cooler to drink. Both of which were delightful. Everyone else seemed pleased with their dishes. \n\nFor dessert, they came over and did the birthday thing, and I had the RED VELVET CHEESECAKE WHICH IS SO GOOD OMG. I can't wait to have the other half that is sitting in my fridge as we speak.", "business_id": "78IaYCf9ktUep4UhhjXbTg", "stars": 4, "date": "2010-08-01", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "1_rY2lQjm2u-kkKOaKrLLQ", "review_id": "UihqFKIIOA3M95FkD0uP-w", "text": "I wish I could have gave this 0 stars but I can't first thing there was a hair in my food and everyone has only ate a little of there food and had to stop cuz we was disgust my one friend Alex was sick from it them we got the manager and she only was gonna say sry then we was like can u take all this off and she only took the noodles off although we a couldn't eat our food it seems like everytime I come there there's a problem or hair in my food and I think it's because we ask for our food crispy when I ask Chrispy we get a hair when we don't no hair plus very rude customer service NEVER EAT HERE", "business_id": "78IaYCf9ktUep4UhhjXbTg", "stars": 1, "date": "2014-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0V4nNYIDKjhnxdxpt6QV9A", "review_id": "Q7oINM9yj4fWOkuV7dlRpA", "text": "I have only been to one other Cheesecake Factory. And it was for my senior prom in LA, so it's not too memorable.\nThis was our first time at this location, and we LOVED it!!!! We went for lunch, and were seated straight away.\nWe loved everything from the food to the service!\nOur waiter, Tom, was awesome! Super cool, chill dude. I love when waiters are just themselves around you, no weird vibes like they're trying to play it cool or be fancy. So ask for Tom!\nFor the food, I have Celiacs, so I had to get GF. But man that was probably the best tasting gluten free meal I think I've ever had at a restaurant! We got the farfalle with roasted garlic, I think? And it was just amazing! You couldn't even tell it was GF! I can't express how AMAZING that was. And Tom even said that most of their pasta dishes (and burgers) can be made gluten free. Uh major bonus!\nAnd of course I got the chocolate Godiva cheesecake (cause it's the only GF option). But man it was wonderful! Very rich though, so you gotta love that intense chocolate taste!\nI just wish it were closer, as I live in North Tempe. \nBut I will most certainly be coming back!!!", "business_id": "78IaYCf9ktUep4UhhjXbTg", "stars": 5, "date": "2015-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vSQWhas8isAgwb_iQ1-4Jg", "review_id": "LnGRAMl9eI9XMJOVbcxW3g", "text": "This is a perfect place to go for lunch. Every soup salad and sandwich I've had are delicious and are made with quality ingredients.", "business_id": "U9iWs_XQ88IEj_Cgawyz4w", "stars": 5, "date": "2015-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WcnFWEVx9HO4eplGqvvr1w", "review_id": "SIzwYE9i47taLGRxVV_UKg", "text": "The wings here are excellent.  I rate them at the top now that VooDoo Daddy's is no longer in business.  \n\nTheir other food items are good as well.  Nothing too special, but very above average.\n\nThe wait staff has always performed to my expectations.\n\nIf you are a fan of rootbeer, this is the place for you.  They brew their own, and it is magnificent.  It's got a good bite to it.\n\nThis place is able to accommodate different types of customers.  They have an outdoor seating area, they have a large bar equipped with flat screen TV's and surrounding bar tables, bar stools, & booths, they have their general dining area wrapped around the middle of those two areas.  \n\nI'd come here for the wings alone.", "business_id": "IMGW6y8wHQCfr_6k-YXg_A", "stars": 4, "date": "2010-08-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "c7AyEUnJewJoV1Kdx5bm6g", "review_id": "SefVaRAtHCkTNjiZ1gZA2Q", "text": "I really like going to BJs when I am in town visiting my family. They have a HUGE menu so everyone can get exactly what they want. But much like the Cheesecake Factory, everything on the menu is not great. In my opinion, the pizzas and pasta dishes leave much to be desired. The sandwiches, soups, burgers, salads, and appetizers are very yummy. My favorite is the clam chowder in a bread bowl. So. Good.\n\nThis appears to be a great place for groups.The staff is very accommodating, and attentive, and the restaurant is very big. Friday and Saturday nights are generally packed with people, understandably so with the good food, relaxed atmosphere, and the beer/drink menu. If possible, I would call ahead or be prepared for wait a bit.\n\nAs I mentioned before, this place has an extensive beer and alcohol menu. My dad and uncle love this place for the beers, and I love this place for the cocktails. I have not been for happy hour, but I hear it is great. \n\nDefinitely A-OK place for lunch/dinner in Chandler. I think as far as places go in the area, this is top notch.", "business_id": "IMGW6y8wHQCfr_6k-YXg_A", "stars": 3, "date": "2013-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6yTkDWCDGGH_5-Pr165WUg", "review_id": "N4ci3c3u-9eJc4Ipj9E4tg", "text": "We love to come here for Happy Hours, $6 personal pizza is good deal. The pizza is great and servers are attentive. The fried calamari is good too. The only complaint I have was I feel rushed. Although she said\" no hurry, I'm just going to leave the bill here\" as soon as my pizza arrived.", "business_id": "IMGW6y8wHQCfr_6k-YXg_A", "stars": 3, "date": "2014-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZZpXfbQn0nU22OGDW15TRA", "review_id": "krY06GkWncCzQgOV1KdH1w", "text": "This is a last resort store now.\n\nWe've been shopping here off and on for several years... and since the remodel it's almost impossible to navigate the store.\n\nTheir re-model made the aisles much smaller than they were before.  Now you can only fit 2 carts next to each other at a max. There are tons of stacks of random food/items in each aisle - another thing to avoid hitting.  \n\nThis Fry's is always out of so many things: organic milk, organic produce, cheese and the selection changes it seems weekly. I think they now carry less than they did before the remodel and now they just have larger quantities of certain items.  5 rows of ketchup in 3 different size but no Ken's sun-dried tomato salad dressing...?\n\nAlso they re-modeled the produce area... again... and now it's harder to find items, bags and where the labels are with pricing etc. \n\nThat and they got rid of the nice greeter who was there for years. I mean, you're doing poorly so instead of listening to your customers about why they don't shop here anymore they fire the greeters? Logical.. obviously. \n\nSince it's 'hit or miss' with this store I've been shopping a lot elsewhere where I know they will have certain staple foods(milk) in stock. \n\nThat and the crowd... I'm not sure if it's because it's a Fry's or Kroger but sometime when I'm here I feel like I'm in a Walmart. I understand if you just got out of the pool and are stopping by for a quick item or two... but put pants and a shirt on first.", "business_id": "9e4-DYABr1mVEw85ErdBMw", "stars": 2, "date": "2012-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NLn2xQGILVTpLUPiZLXUZw", "review_id": "emAo_MQjx0qqryaWFzSn_Q", "text": "Very friendly staff,  daytime girl on Mondays and Tuesdays is great. (no name tags)  ice cold beers and golden tee. Come on down.", "business_id": "xuEsUDFIWIEnBXvj1EBXlw", "stars": 5, "date": "2015-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "3FLvP7zGP6fEe3lJK5AwYw", "review_id": "bVAZYpZk_l9anpq0pdtZ4A", "text": "A few days ago I was in the vicinity of Liberty Market and decided it to give it a shot. I ordered the Tower Burger with St. Pete's Blue Cheese and Bacon. The burger was juicy and tasty. The added blue cheese and bacon made it even more scrumptious. The burger was accompanied by fresh Kettle Chips and three distinctly different dipping sauces. \n\nWhat sets Liberty Market apart from other places with a great burger is the great service. All the employees were friendly and engaging. Definitely looking forward to enjoying more tasty meals there.\n\nOh and I don't forget to try the Ice Cream Sandwich. It consists of phenomenal vanilla ice cream sandwiched between Liberty's Chocolate Chip cookies then rolled in almonds, toffee and chocolate chips. It is out of this world.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2009-08-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rPQ6OB412BEeNgWt4E_9xQ", "review_id": "eHTOaZvS2-YVjClHk928wg", "text": "My wife and I go here all the time - one of our favorite places.  The owners are great and very appreciative.  The food is really good and Chef Dave is always experimenting new dishes.  If you have a chance, try to catch one of the new Community Dinners.  It's an experience not to be missed.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2010-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "E7pQvEw9tf_wxIRMWxCtNQ", "review_id": "t2TUPXBMe2c0AlCFd46B3A", "text": "This is how it goes each and every time I go to Liberty Market. Note to self: SAVE ROOM FOR DESERT. Honey can I try some of yours..... just a bite..... as I start my way through the white wood fired pizza, oh what did you get? Can I try some? I wish they had a sample platter of EVERYTHING....OK save room.....yummmmm...did I just eat that entire pizza? Yep! Oh I'll take a slice of the red velvet cake......... can you put that to go?........... Honey where's your fork?", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2011-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8fn6Oe3s8sTSp_eX6w9x8g", "review_id": "5kjXotc45_dDZR856yVuMw", "text": "Great food, I love the roast beef sandwich.  The deserts are also excellent and BIG.  It's nice to have some non-chain restaurants in the neighborhood.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2011-08-02", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "yiHkeSEzTZWLnWUsgSUvDA", "review_id": "ZuRuaf5MfsAt7CUbRCJK4Q", "text": "Completely in love with this place! \n\nGreat location in downtown Gilbert - the parking that is very close to the restaurant is a bit limited but there is a large lot about a block away. \n\nThe restaurant feels vintagey and was a foodmarket years ago, so it is maintaining that feel but providing a modern/industrial look. I don't love the tables and chairs, definitely not the most plush but serviceable.\n\nThere is a counter - complete with a bakery case - where you place your order, When it is busy you have to wait in line and are assigned a table - during slower times you just sit wherever you'd like. \n\nThe staff are all really nice and helpful.\n\nThe food is delicious. It is a bit expensive for a fairly casual place, but the quality makes it worthwhile. My favorite meal is breakfast - the demi breakfast, pancakes, and bakery items are all amazing, especially the blueberry scone! I always think of scones as being dry and not very flavorful, but theirs are exactly the opposite: moist and tasy, served with a ramekin of whipped sweetened cream. My husband and I always split one with our breakfast. \n\nDinner is great, too - my \"go to\" is the Flatiron Steak with Mr. Pibb Marinade and Fresh Veggies, super good and a perfect portion ($19) Don't leave without dessert! The Red Velvet Cake or Ice Cream Sandwich are perfect to share (the ice cream sandwich is made with two big chocolate chip cookies and vanilla icecream, cut into quarters) If you're too full, get a Salt River Bar to go (Salty and Sweet gets me every time) \n\nThey have some cool local beers. mimosas for brunch, and good coffee - their Peppermint Mocha (which is a seasonal Christmas drink) is my favorite.\n\nWeird note: Don't miss the bathrooms - each bathroom has a different theme with decorations and a specialized soundtrack (farm, recipes, Tuscany). Very fun.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2012-06-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MPNFtwa6OGZcMJoB6b90iQ", "review_id": "cTOfFgmVBZRIEC6gMw-dOA", "text": "This place is so cute, I wish they had this in California. I would come here for breakfast lunch and dinner if I could. I thought the salmon plate was very good since there was plenty of salmon with a little bit of mixed greens and bread. It was funny because when I got here a local tv station was interviewing the chef here so it was cool to see that happen live. I would come back since this place reminded me of a casual place to have any meal. I would love to try this place for lunch.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 4, "date": "2012-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OmbzD5Zb5nxWdplPumY_Kg", "review_id": "o_GVfqeKb9XA4fMswcQHgA", "text": "Honestly, Liberty Market has to be one of the best things that has ever happened to Downtown Gilbert.  Their espresso drinks are wonderful (the cortado is to die for), their scones are amazing, their pizzas are delish, and honestly they have the best minestrone I have ever had in my entire life. \nThe wine and beer selection is okay.  I wouldn't go here if I was out for drinks in particular.  The only exception is the Irish Coffee, which is mighty fine.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 4, "date": "2013-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RULYwBcFuDiD71ObRNstzw", "review_id": "mv2qhjmSms8t7uYVnfFz2A", "text": "Burger of the week is the green Chiles. It was amazing!  Takes me back to visiting new Mexico where all my family is. Love it!", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2014-06-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Zir_cLHcW5N5EseUWJopVw", "review_id": "vW9Y8SDcXMvkOa5h5r3ZFw", "text": "Love coming here - I've never had anything bad, ever. And just discovered that there are journals by the bar to peruse and write in. How cool is that? Today - Hawaiian pizza with lemon berry bar. Super tasty. I'd take a picture but I ate it too fast!", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2014-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7WXCLGK6ziUsNeRqa9RWQw", "review_id": "9HA3Ml4ZuGMe-dbNZhhwGw", "text": "First off the ambiance and staff really help make this place top notch. When you are ready you place the order and then are seated if it is busy they give you an number and assign you a table it is very convenient so there is no confusion on where to sit. I have eaten here a few times and have ordered breakfast, lunch and dinner at one time or another they have never let me down. They always have amazing weekend specials that are well thought out and executed by the chef.  If you like coffee or love coffee like me you have to visit the coffee bar for anyone of the drinks. We will definitely  be going back on a more regularly basis. Oh and I cant believe I almost forgot to bring up the sweets and pastries they are the best I have ever had and once again the pastry chef has specials that are out of this world...", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2014-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1d7bPSZCmJ5vaOFKsQr0xA", "review_id": "MGhcYwkKEn8fWBCoLaCDeQ", "text": "My favorite place to go for breakfast.  Go early so you can be seated promptly.  They assign your table as you are waiting in line to order.  I actually think they have a great system and don't mind having to wait.  Blueberry scones are sooo good, portions are extremely satisfactory, liberty potatoes are tasty, love their decaf, everything is delicious.  Nothing disappoints.  Have always had a great experience.  This place beats any other breakfast place on \"restaurant row\" in Gilbert.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2015-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bf9VxeIqP7Vwif7iYMerhw", "review_id": "hohxeVFgOO0ZVkLL001dGw", "text": "Another home run by Joe Johnston. Been going here since they opened in 2008. It just keeps getting better. Great breakfasts with excellent coffee. Also great for lunch and/or dinner. Try an amazing wood fired pizza made in their Renato oven!", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 5, "date": "2015-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pzkt3mAPlWXjZt-DpcsMgQ", "review_id": "R1joxDb5MvphChwBoXmj9A", "text": "The service is appalling and the food mediocre at best. Food servers with facial hair that makes it's way into the painfully average food. The food is not worth the hour 10 minute wait. Snooze is a much better option.", "business_id": "L9UYbtAUOcfTgZFimehlXw", "stars": 1, "date": "2015-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "LfVLstJpy76p_s5LvN9wsw", "review_id": "GNIxrK5fy7bZ4pKT1FSGMg", "text": "Even though I moved back to Gilbert from Queen Creek, I continue to go to this Safeway because I really like the pharmacists there, they are very friendly and very accommodating. Most of the time I can get what I need on my grocery list, but there is the occasional time that I will need a specialty item that I'll have to drive down to AJ's for. I do have a few issues with the store, one being that there are never enough cashiers on hand. It seems that every time you get in line to check out, there is only one register open and 10 people in line. Also, I cringe when I have to go to the deli counter because the service is usually atrocious. Nine times out of 10 there are a few workers behind the counter, but rarely do they look up at you, or if they do acknowledge you, you will end up waiting until they are done slicing their meat or mixing their salads or whatever else they're doing that is more important than waiting on the customers. I don't find that to be the case at the meat and seafood counter. I have always experienced the meat and seafood folks to be very friendly and helpful, and answer any questions that I have about cooking fish or how to season things, etc. Overall I continue to shop at Safeway because I like the family friendly store, I like getting discounts on gas, and it's a well maintained and clean location.", "business_id": "CxgFoyQl_EDf2uyVnU1Gsw", "stars": 4, "date": "2013-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s0kHFvGmzNtrRwjN6stShw", "review_id": "tE5fD0wvp3yxSUTDottvjw", "text": "This is my second time here and I tell you the Half Hog deal is amazing. My dogs love the pig ears we get. Bosko & Domo will be happy to know a handful is coming home. Worth the hour drive out of my way. Thanksgiving Pork Shop your the best.", "business_id": "oyzi74AxIx4Ln9R597F9kw", "stars": 5, "date": "2014-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UPtysDF6cUDUxq2KY-6Dcg", "review_id": "ocmPFYPRJICk4r-6ATnZEg", "text": "The farm is awesome but if we are rating the food I would have given one star. I forget what they call their cafe but it really is not that great. \n\nThe farm itself is fun though.  There is always something going on.  Fall time it is the best - our kids have a blast on all the little rides, and the food they cook from the farm (pulled pork) not the cafe is really good.\n\nIt is a little pricey but I suppose they got to off set costs.", "business_id": "1V8f3A7p3HV2r0BgAbqvaw", "stars": 5, "date": "2009-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "HMMm7LFFEOoMMonk32mEhg", "review_id": "bJuEvj58okwKI3hoX_hgrw", "text": "One of the best brownies ever. Period. And the chocolate chip cookies were awesome also.  I drove past this place since i didn't know what I was looking for.  Set in a small village looking area on the east side of the street, the building is small and well decorated.  The staff was very friendly and sweet.\n\nThe chocolate brownies tasted like they'd just been baked moments ago.  They come individually wrapped which makes it a great gift for others.  The cookies don't come wrapped but they won't last long after you take your first bite.  They do have ice cream and I was very tempted to have a sundae if everything else was that good.  I just might have to stop in this weekend.....", "business_id": "xKV873WMxM0EJ7NTtu4Qhg", "stars": 5, "date": "2008-08-07", "type": "review"}
