{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dGP3vyPGCaOhSoHvjpyodg", "review_id": "vVo6FrXsB5h5XbDsCDCnhA", "text": "Loved the food! The food has a home made feel to it! \n\nYes, the old lady seemed rude. but we did not deal with her.  The cook (guy in apron) was very friendly and kept coming back to us to see if we need anything.", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 4, "date": "2012-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "95aJcrdsd9WQpp0wNJDhtA", "review_id": "UVvFPBmigzviIW8ZrEYChQ", "text": "I regularly order takeout from Namaste and am never let down.  The food here is consistently good, the portion sizes are larger than most other Indian restaurants in the area, and the prices are on par with what you would expect from similar restaurants. Don't let the location or allegedly unfriendly old lady (she's actually quite sweet) deter you from dining here--or at least ordering takeout, which is what I primarily do.", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 4, "date": "2015-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qGq-ThM2PBMfa5SA5XKjdQ", "review_id": "qCbSOoqEtmP2-RosNP7wXw", "text": "Lunch time...we opted for the menu vs. the buffet for my family's first time indian...I ordered for them, knowing what they would like.\n\nMy issues:\nHoly Sh!t was it expensive for lunch!!!!\nThe old woman was NOT nice.  AT ALL.\nGobi Manchurian for an appetizer was small and 12.50! what?????\nhowever, perhaps the best I've ever tasted...I just refuse to ever pay that ever again for that portion.  Crazy.\nIn addition, each entree was $11-$12 and only came with rice.  I paid $2.50 additional for each order of naan.  Also crazy.\nThat said...for 4 people, my lunch tab came to $70.  SEVENTY DOLLARS.  For an appetizer, 4 entrees, and naan.  No drinks.\nSo, I will never be back.  Which is sad, really.\n\nHowever....the food was damn good.  We had chicken vindaloo, good and spicy, and chicken tikka masala, mild with a good sweet taste.\n\nHey Namaste....hit me up if you ever work on your prices and customer service....I'll give it another go.  Until then, I will be sticking with Cafe Dahli.", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 2, "date": "2015-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_HClWJAcSIFXS7yX0xValw", "review_id": "5uSQUdnxG1O_pR7TOw9Hdw", "text": "I really really enjoyed the food, it was rich flavored food, hot, fresh, and delicious. I think I'm going to pick up food from there whenever it's possible for me.\nThank you guys for this great food.", "business_id": "n7G2XFGvmS3duDJ4AzjKiQ", "stars": 4, "date": "2015-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-DB39x1W62_OiShDYrSfdg", "review_id": "oh90Ere3wmj3u8Obnmoh7w", "text": "This place is crazy! It's an Indian restaurant located within a Days Inn. I love it because it's so quirky. Go for the buffet. Don't bother with the menu. The buffet is just as unique as the location of the restaurant. They usually have several vegetarian options and some meat options also. \n\nWhat makes this buffet so different is the fact that it has malai kofta, pickled toppings, and self serve mango lassi. I have never seen any of the above mentioned items on a buffet.\n\nThe taste is not the best and sometimes the food comes off as warmed over, but it is good and so much fun to stop in and stuff your belly with as much or as little as you like, all while sitting in such an unusual location.", "business_id": "8tBfgYCI6Fz9xrSYCYCYXA", "stars": 3, "date": "2009-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "y3zerFCOqhXcmzSXtpKLfg", "review_id": "3aTr2qk03xjOuQ1UmS49GQ", "text": "The hotel has a little listing for Maharaja which includes some pretty specific and weird hours, none of which include Mondays. I called on a Monday to confirm and got a dude saying they close 9ish. I showed up and they have a menu that states pretty simply, 11am - 10pm 7 days a week.. Buffet closes at 9:30.\n\nThey didn't speak about, point to or even half heartedly gesture to the menu. I was immediately pointed to the buffet and told \"have whatever you want\" or something similar. There were 6 veg options,  4 meats (biryanis and curries), nan, poori and bhajis, kheer and pleasantly hot gulab jamun, average (free, unlimited) lassi, some good chai,  and decent chutneys and lemon pickles.\n\nMeals ends with mukhwa, but the candy and plain fennel seeds are kept in seperate bowls. The emphasis on customer self-reliance here could be construed as bad or lazy service, but I appreciate the lax environment.", "business_id": "8tBfgYCI6Fz9xrSYCYCYXA", "stars": 4, "date": "2010-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BOcojc9Sjk5p8MIcU681eQ", "review_id": "oPubj6eIPx70HQ2vhkE6Gg", "text": "Good, quick, tasty Indian food. They always have the buffet going and it's great to stop in and grab a quick belly stuffing. It's tucked inside a days inn of all places but location is of no concern. Very wide range of food and sides. So, so good. Decent prices too. Always friendly.", "business_id": "8tBfgYCI6Fz9xrSYCYCYXA", "stars": 4, "date": "2010-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1ZO_MHI5CJ-LEH_jU4Qy2Q", "review_id": "qftbHPIkb1G7XfPXiRLqtw", "text": "Two words: Chicken Mango. There is nothing like it in any Indian restaurant I've been to before or since. \n\nOther than that dish, Peoples is pretty typical of small Indian restaurants. The buffet is alright, the portions are of average size and the service is reasonably good.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 4, "date": "2007-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "WjopORV2YaHqdRqtDzQ9bQ", "review_id": "QkgvHrr0nAnYwGvWSaA8Kw", "text": "I've only eaten the lunch buffet here, which is cheap and pretty decent.  Maybe it's an unfair assessment, but I wouldn't go out of my way for dinner here based on what I've eaten at lunch.  The food is good, but pretty far from what I consider \"authentic\".  The chai is the real standout, I always get some, even in hot weather.\n\nBottom line: a great place for a quick, tasty lunch, but I'd search elsewhere if you've got a real craving for Indian food.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 3, "date": "2009-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TtShekSOnfL-56maxx-rTw", "review_id": "K0y3QsXhz-wWlyeFxjezGA", "text": "People's Indian is a solid traditional Indian place. Offerings are standard, but well done. I like their bindi masala and vegetable korma. In meat offerings, their lamb is really quite good.\n\nTheir lunch buffet has a solid selection of both meat and vegetable dishes and includes samosas, which not all buffets do. Also included is chai, which is good (if overly sweet).\n\nIn general, it's one of the better local Indian places. The service is also pretty consistent and pleasant (unlike, say, India Garden where the service is consistently horrific).", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 4, "date": "2010-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "cisz1Gf7_QhGS3TsC8JH-A", "review_id": "wP2yHH1a4khGU2WUSlv1iw", "text": "I just wrote a bad review so I want to counter it with a good one. People's Restaurant easily wins the top slot on Kelly G's list of the best Indian food in Pittsburgh. The restaurant itself is small and no-frills (Indian shabby chic, you might call it), but they have a big table in the middle suitable for large parties. Their lunch buffet is smaller than India Garden's but slightly more delicious. Greg B. and I get take out, add a bottle of wine, and have romantic dinner parties-for-two on our front porch. Perfection.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 4, "date": "2012-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UnGPr6ZnGe9YOSZRopnS5g", "review_id": "uC4uQqosg_O-Xmk8q5RTpA", "text": "At first glance I wasn't too impressed with the buffet, I thought it'd be another botched attempt of authentic Indian food. While the selection is not that impressive, I would say that the quality is pretty damn good. \nI debated for a long time with my friend about the food going back and forth between a 3 and a 4. I ended up going with the 4 due to the Indian tea that they had - hard to find at any buffet!. \nThey aren't trying to wow you with exotic ingredients or fun twists, it's almost as if you're sitting down at someone's house and eating what they'd eat on a regular basis. Plus you're paying around 9 dollars for a buffet, I mean- let's get real. You get what you pay for.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 4, "date": "2013-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9Phphp3zWwp7TXOk2ZEzOA", "review_id": "HpvRd8aa4b_lLLcrC2gKGw", "text": "Hadn't been here in a few years and remembered I enjoyed it in undergrad, especially for late night half off. Called in advance to make sure they were open until 10 and had half off like they used to. The woman who answered the phone said yes to both so I rushed over. The portions were small, but I assumed it was because it was half price so I shrugged it off. The tomato sauce was chunky and generic, the raita side dish was 4 spoonfuls big, and the chutney dips were cold and bland. Assuming this was due to the discount, I didn't complain. Receive my check to find out it was all full price. Despite the woman telling me on the phone that it was half off, it was buy one get one half off. The woman on the phone was the same as the hostess. She admitted it was she who answered yet refused to accommodate her mistake. I don't normally feel compelled to complain but that is ridiculous. A subpar meal and subpar service in addition to false marketing. Never going back despite the fond memories I had accumulated when in school. Completely ridiculous.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 1, "date": "2013-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6ndcdXMIa2CYvBWpdOsB7w", "review_id": "Xhmxv_YnNhgyHEUs1va_SA", "text": "This is closer to home-cooked Indian food than your average Indian restaurant. The lunch buffet is yummy. The chai is absolutely delicious!\n\nI am there almost every weekend for their lunch buffet. Yes, it is that good!", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 4, "date": "2014-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Ec1c6oI9EeGkfISarmo_1Q", "review_id": "0Wjzw0CQS02eNSIOueWK_g", "text": "My boyfriend and I went for dinner last night. I had been to the lunch buffet and it has always been alright. However, the dinner experience was wonderful.\n\nWe both got combo meals, he the chicken curry and I the fish curry. The fish in the curry was salmon, which was a little unusual and not quite as good as other fish you could curry, but I was also made aware of that when I ordered. For the price we both left very full. The waitstaff was very helpful. When I ordered a \"10\" on the spicy scale, he asked if I wanted \"American 10\" or \"Indian 10\". After finding out that \"American 10\" = \"Indian 5\", I was steered toward the \"Indian 7\" which really was perfect for me. (In previous trips, we had both thought the food a touch mild, but knowing there was an Indian heat scale fixed that problem right off).\n\nIt was a wonderful dinner, and I can't wait for our next trip!", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 5, "date": "2014-07-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V8_RB_WJAq96VnUKrd4l1A", "review_id": "mZ-f9pGWqVhbkBq9kWVOvw", "text": "Prices are excellent, food is EVEN BETTER. I am a vegetarian, and found the selection and quality to be just as good as Indian restaurants charging double the price. I attend a convention annually in Pittsburgh, and \"People's\" will definitely be on the \"must visit\" list for future years.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 5, "date": "2014-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1EJWnLyUGqh2E2nAoL5Zzw", "review_id": "sXbgzaSej5Gl_fYZA0wPGA", "text": "This place use to be good back when they opened. People there are roaches at this place, the food will make you sick and the sauces are full of cornstarch. We'll never return. Sorry Peoples", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 1, "date": "2014-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "veXe0b70eNJtWt4KSawZ3A", "review_id": "FNjKNfb2iLqKHWwf4KCLTA", "text": "Had delivery from People's last night and was pretty happy with the experience. We ordered Shahi Kofta, Roti, Chicken Tikka Masala, Naan, and Samosas. My only complaint is that the Roti was kind of burnt. Otherwise, the food was solid and the spice levels were good. Delivery took about 50 minutes, which I think is reasonable for a weekend.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 4, "date": "2015-06-27", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "70pn0axXnZu0TAbZzktAPA", "review_id": "ehp-k8gXJJ1NcvL7h9uK9g", "text": "My first and last experience:\n\nWorst delivery service.\n\nMy food order was given to someone else waiting for another food delivery in the apartment lobby without even asking which restaurant she had ordered from.\n\nDelivery guy was rude, and said that the girl in the lobby was Indian and thought she was my girlfriend, instead of apologizing.\n\nNever ordered from here again.", "business_id": "PhIGoo9g6GBrqgH_6yZXXQ", "stars": 1, "date": "2015-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "H6aWqu6rz08NJH1kN3s5Pg", "review_id": "3z9mzWUB4iRFVkmzzKsZeA", "text": "When I lived in Bloomfield, I came here once a week for almost 2 years. One of my all-time favorite Indian restaurants ever. The food is consistently delicious, the Chicken Tika Masala is one of the best I've ever had, and it's comfortable and quiet when you dine in. Not too spicy unless you request it that way. (I usually ask for an '8' which is perfect, but not as hot as it sounds) Take out orders are huge portions, which is an added bonus if you asked me. Service is very friendly and on top of everything else the prices are very reasonable. I would go out of my way to stop in Pittsburgh to eat here again anytime.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2008-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "wNtyBJa_qaRYUew_TWplgw", "review_id": "5aM7XfERuCMbbgMsm53FBw", "text": "Just got back from trying the lunch buffet at Taste of India, which was pretty good and a definite value.  It is $7.95/person and includes a drink - soda, mango juice or mango lassi.  The buffet has the usual chutneys and raitas, naan, vegetable pakoras, fresh fruit (mostly watermelon), salad, chicken fried rice and plain basmati rice, 3 chicken dishes and 3 veggie dishes.  Today there was tandoori chicken, chicken tikka masala and a plain old chicken curry, channa masala, alu palak, and alu green beans.  There were also gulab jamuns.\n\nMy favorite was definitely the alu green beans, which disappointingly is not on the menu.  The chickpeas were good, but I thought the alu palak was disappointing.  (I am generally disappointed in palak paneer at restaurants since I have an awesome recipe that I make at home all the time.)  The watermelon chunks were an awesome palate cleanser, and the gulab jamuns were great.  Total for two people came to $17 before tip.\n\nThis is a nice little place, and at lunch almost everyone there is Children's Hospital staff.  Parking is a little hard to find since the residential streets are permit only.  But I really like this place and it's definitely worth it.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2009-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TtShekSOnfL-56maxx-rTw", "review_id": "_cTz9iA3GgVh8rKasjP5IA", "text": "The Indian food here is perfectly decent, but nothing mind-blowing. The lunch buffet comes with a lassi or mango juice, which is a nice touch, but the other offerings are standard. \n\nThe owners are very sweet and the service is fine. When I've waited for take out before after I walked in the snow I was given warm tea while I waited, which was very kind.\n\nOn the whole though, the food is pretty lackluster. A little further down Penn Ave, I prefer People's Indian.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 3, "date": "2010-08-25", "type": "review"}
{"votes": {"funny": 4, "useful": 7, "cool": 4}, "user_id": "g2JhDtn0eevsIi-cG-P6kg", "review_id": "bQWYBg848Da7JkthPFGZaA", "text": "Let me explain to you something. I didn't know, until I moved 12 hours away from here, what a magical place Taste of India really is. I also didn't know, that when I fly into Pittsburgh, I would directly be driving from the airport to pick up take out before seeing my family. Helllooo! Here is your daughter you haven't seen in over a year, she comes reeking of curries and spices every-single-time! \n\nCan we start with the fact that the service here is spectacular?! My friends and I have been coming here for years. The owners are cute and funny and we are terrors when we are there because we bring large parties and we are so excited to order an entire table of plates.\n\nWhat fills our table? \n\nBooze, yes, they have beer.\n\nBread: Chapatti (Yummy Whole Wheat Goodness!)\n\nVeggie Options:\nPaneer Jalferji (Cheese and Veg)\nDal Sag (Lentils)\nPaneer Makhni (Cheese and Peas)\nChana Masala (Duh)\n*Personal Fav: Malia Kofta (These little fried vegetable balls with creamy tomato sauce and almonds!) --Haven't found this one anywhere else as good as theirs! Ah! I am drooling thinking of it. \n\nWhat do they do to this freaking food? I just don't know. Go soon! Ask for spice level of 7-8 if you want to tantalize your taste-buds with some fiery food and if you would like to ship me a container of the Malia Kofta I will be more than happy to message you my address.....\n\n\nOh, and my favorite date in Pittsburgh? Taste of India and dancing at Brillo Box. So iconic. So Pittsburgh.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2011-06-15", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "5kdP7u5eO-jU7WWTKsyLcw", "review_id": "j3gryXEtxHxtInrCIzD1IQ", "text": "I love Taste of India. Maybe I am biased because it is in walking distance from my apartment. In my mind, the food holds up with some of the better Indian restaurants in DC. I mostly get paneer or chickpea dishes and they've all been solid. Good atmosphere, service, etc. If you just want solid Indian go here. Simply put.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2011-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "HcxrH5LvWMOhJIv64iSqpg", "review_id": "ZSjecWygJ_s1ygyIF_ejNA", "text": "Delicious, rich indian food. This food cannot be compared to typical Indian buffets.\n\nWe get the staples: palak paneer, dal, chicken tiki masala and chole. Every time our food is perfectly spiced and deeply flavorful. \n\nThe service is prompt and attentive. \n\nWe drive two hours to go here; this restaurant never disappoints.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2012-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mcx0u8xZocB-_P44MZ-OSg", "review_id": "o_Iv7DJ0EDDirCUN_8Jbwg", "text": "I have been to Taste of India several times, and every time they have never disappointed me. The service is great and the food is amazing. We were seated promptly, orders were taken, water replenished as soon as I was close to being empty and food came out right away. The food are delicious, proportioned and well priced. I always have the chicken tikka masala and butter chicken. I also had their garlic naan, beef and lamb curry. So if you're in the mood for some good Indian cuisine, Taste of India is a great choice.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2012-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tzznMGvCxebFkWELwj9GtA", "review_id": "aOdbBWBtQb9AzJXhc-JXSQ", "text": "If you really know and like Indian cuisine then food here gonna be flavorless and bland for you. Tandoori chicken doesn't taste like one etc. Decor is tasteless and old. Carpet looks really dirty. I'm definitely not coming back.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 2, "date": "2013-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4RH04JE-zI--niWNpi5uOw", "review_id": "94Ybo5sg6dQZfniDvXAXKQ", "text": "Just had dinner there. We started with the Pakora then I had chicken biryani and my fiance got the tandoori mixed grill. We got the paneer naan and the garlic roti.\nThe Pakora came out and was well portioned and the price was right for $4. Plenty to eat and the plum sauce was very good.\nChicken biryani was perfect. Gigantic portion and was customized to the spicy level of 6 that I asked for. Ended up taking more than half home. Tandoori mixed grill was a big portion and tasty but the chicken was just a little dry. Next time we were hoping to order something like a curry to eat with the rice that came with the dish.\nEverything was very tasty and the portions were ample sized . Wish I had room for dessert. Will definitely be coming back to eat or get carry out soon.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2013-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jfvv8uvdSJYa5NWEAloxpQ", "review_id": "tTqnEBQfs4UZZCPgth2hqA", "text": "Good Indian food is tough to find. We ate their on a quiet weekday night. Service was friendly to the point that I though we might be friends. The portion sizes are big, food is well prepared, and over delivered on taste.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2013-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "zYdFH6R1fKGJWgqcYEg5bw", "review_id": "6dg7lSt_wgquhH8EKBEFjA", "text": "This is the restaurant where I bring people when I want to impress them with the great Indian food in Pittsburgh - twice now, I've gotten the special meal for two, and not only is it flavorful and well-spiced (I feel like they're great at matching the spice level you request - and other people dining with me agreed), it's a good value - so much food that you can easily make another meal out of the leftovers.\n\nThe lamb dishes are delicious; I've had the Boti-Kabab Masala and Lamb Sag, but I really enjoyed the vegetarian dish I had, Hariyali Handi (vegetables in spinach), so much so that I've had it both times and may not be able to stop myself from ordering it again. My real yardstick for greatness, though is the samosas: when you order the special meal, they come along as part of the deal - it would be easy to take less care with a \"throwaway\" item, but they are quite simply the best samosas I have ever had, slightly spicy, super-crispy, and big enough to share.\n\nThe bill comes on a tiny tray filled with sugar crystals, caraway and coriander seeds and colorful bits of candy - I've seen similar combinations at other Indian restaurants, but it's artfully presented, and as with the rest of Taste of India, it leaves me charmed and satisfied, just as an excellent restaurant should.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2013-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "n2pWWeHk2l4KURCdkn4zfA", "review_id": "xewYXrDM5_5GU_md50uWyA", "text": "Not fancy but great Indian food at a really reasonable price. The eggplant was particularly yummy.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2013-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "X6ImyAC4PY9193zQzxUCtg", "review_id": "NtWMgSQLQH89UzCYURgQaQ", "text": "I would have to say that this is some of the best Indian I've had in pittsburgh so far. The staff were friendly and attentive. \n\nThe chicken korma was delicious. It had almonds and raisins in it, which complemented the sauce nicely. \n\nThe check comes in a tray with candy coated fennel seeds. We didn't know it was edible until our server said to try some. I liked it because I like black licorice. Also, our server explained that it helps to cleanse the palette after a spicy meal. \n\nThe prices were on point. The seats and tables were new and comfortable.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2014-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5eSrkbuBUPmKzJhea-RXDw", "review_id": "dqyQ08bggHX1tNjMYRAjaw", "text": "I absolutely love tikka masala, but I've been struggling to find one without chicken. This is the first time I've ate at taste of india. I ordered take out and got the paneer tikka masala and it was incredible! The sauce, paneer, everything. My friend ordered  the chicken tikka saag, I tasted a bit and it was wonderful too! \n\nOnly thing I wasn't the biggest fan of was the aloo paratha nan. It seemed to lack flavor and was a bit rubbery in texture. However we ordered regular and garlic nan as well and they were both wonderful-totally made up for the aloo paratha!\n\nNeedless to say, this will now be my go to for Indian food in Pittsburgh. Awesome, awesome, awesome.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2014-07-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1EJWnLyUGqh2E2nAoL5Zzw", "review_id": "GAG4BKWLhNv_hXOrS7fn0A", "text": "Best Indian in the Burgh. Love the dinners at Taste of Indian. Go with a large group so you can order lots! \n\nThe lunch buffet is good but I am not a fan of buffets (just saying) the bathrooms are clean and the family keeps the place spotless.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2014-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Busd-EqlahjpSm_yK0RPAA", "review_id": "bE6hly_6B0nq9eQCs_v3aA", "text": "I rated 4 stars only because of my husband. He loves that place and orders take out pretty often. Last time we decided to stay inside and I wanted to taste spicy dish.  Usually I don`t eat spicy food as I often suffer from my stomachaches. But sometimes I crave it so much and that was that time.\nI asked about \"4\" (scale of spiciness between 1 to 10). For non-indian people 4 is suppose to mean that it`s a slightly spicy, less then medium. That idea was in my head. But when I got my mango chicken I could barely taste it. It was sooooo spicy. I felt myself like a dragon. For me it was 8 or even 9. I was not able finishing my food. And didn`t even think about enjoying it:(((( \n\nWhy do they ask about how do we want our food if they have only 2 option - no spicy or super hot spicy?", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 4, "date": "2015-06-20", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "P2v4DwkBZ8Vi_T67qprGlg", "review_id": "I1_-pUYGyV-XLTjjGkJ8qg", "text": "I have been to this place this weekend with my fried family. We expected some authentic Indian style food. We ordered chicken biriyani, lamb biriyani, peas pulav and Chicken Pakora, Gulab jam. Biriyani was awful it's taste less. Full of racines. This restaurants is definitely not for South Indians. Maintainance and service was good but food is completely tasteless. Chicken pakora is at best. Papad is awesome. On Biriyani and pees pulav we Wasted money.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 1, "date": "2015-07-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zKygnBYYJY9kjMyI-GytZQ", "review_id": "1r1jbN4cptzf9WbaDbhe5Q", "text": "The problem is inconsistency.  Sometimes a dish is very good, other times not so good.  Dal Makhni last night was like soup--all liquid, little dal. Lamb Curry lacked flavor when in the past it has been wonderful.  It appears that there are different cooks whose approach to dishes can be radically different.  I'd like to be able to count on a consistent product.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 2, "date": "2015-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ro2jM0RFGriJjbeFZrPGSw", "review_id": "mWsnvK13i1tgsL6aniQC9w", "text": "Great space, and convenient to where we live. Food is on point. We missed out on the buffet. But, either way. The food is great.", "business_id": "LN3OCT1xOedbf65xKzFSNw", "stars": 5, "date": "2015-08-16", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 0}, "user_id": "7ewE_dDxjXNppOj0EhhMIQ", "review_id": "fbAJxsWuzUuqrr5eSPpgpA", "text": "Solid Indian fare. I was high from all the butter fat I consumed at dinner for, oh, three hours. These guys use a LOT of ghee in their preparations.\n\nSamosas - really, really good. Extremely flavorful. Even the dough is spiced.\n\nBajii/Pakora - good, a little bland. \n\nNaan - also stellar. Perfectly prepared, garlic and plain alike.\n\nThali - overpriced. This is a smaller thali than I'm used to, as it includes only three dishes, no lemon pickle, no daal. Rice is pretty bland (where's ma cardamom!). Vegetable Masala was the stand out here, although if I ate an entire entree of it, I think my heart would explode (WHOA butter). $18.\n\nMushroom Mutter - solid, nothing exciting. $12. Despite the flavors in this dish being subtle to the point of bland, it was neon orange. Hmm.\n\nThere's a short Indo-Chinese menu here that I'd like to sample from - maybe next time.\n\nWould I come back for the much-more-reasonably priced lunch buffet? Possibly. Will I continue to drive way out to Woodlands when I'm craving Indian? Most definitely.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 3, "date": "2010-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7gAKXYdqYu5LfmpAHVSHVA", "review_id": "GqRII6zRrrrqwQEG4xm68w", "text": "Best Indian food I have had in Charlotte, although an odd location/ambiance.  The clay pots meals, cooked to 600 degrees and immediately served, are fresh, flavorful, and delicious.  Good prices as well.  Drink list could use some work.  The garlic naan is very good.  They give you a salad to start but that part is a bit of a joke.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 3, "date": "2010-07-18", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "pd8TEz1RuhNFr-o1vdCSmQ", "review_id": "n0oUOJQZUsUPatOL9XwQ-w", "text": "Having lived for 3 years in the Silicon Valley, home to some of the best Indian/Pakistani food I've ever had, finding a good local restaurant is always a high priority.  Tonight we tried Maharani.\n\nWhen I crave Indian food, it's not about the ambiance or the service.  It's all about curries, rice, naan and spices.  While Maharani is a decent restaurant, its food is nothing special.  I ordered my usual round of chicken tikka masala, mutter paneer and veggie samosas.  The samosas were crispy but the filling was very pasty and far too pureed.  I could barely finish my serving of mutter paneer; it was extremely earthy tasting and the paneer quite bland.  That said, the chicken tikka masala was pretty enjoyable and had a wonderfully rich tomato curry sauce.\n\nWould I eat here again if I'm in the area?  Only if Meskerem isn't open.  Time to find a better Indian place, I'm afraid.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 2, "date": "2010-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x22P6OJwAqVNLeJONJVB4Q", "review_id": "hXy8KM-kPcI2QFiJYDn8Tg", "text": "ate there recently for dinner, it was wonderful. i ordered the goat curry and was excited to try goat for the first time right after i found out it is the most consumed meat on earth outside of the US BUT the table of 12 Indian gentleman behind us had ordered it all....which led me to believe these guys know what they are doing. instead i tried the lamb and it was perfect. i really liked the candor of our waiter \"andrew\", which was not his name but he called himself that with a grinning smirk; i told him i had ordered kingfisher lagers before and would love to try another beer since they had a few indian beers, he told me to stay with the kingfisher. also, once he told me the goat curry wasn't available i ordered tandoori lamb, he assured me it was good but encouraged me to try the curried lamb since i originally ordered goat curry. my ladyfriend ordered a veggie dish and loved it, we got some bread as well, she ordered some REASONABLY (which is becoming more rare these days) priced wine. all in all the food was very good and the service was near perfect, i like when a waiter can read what you are looking for, makes reco's on that judgment and nails them. i will be going back to maharani frequently for both the food and smiling faces that provide you perfect service.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 4, "date": "2011-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6its8hVFX7tA_i45-JR3DA", "review_id": "1Qodc6tTk14COQFGN6BywQ", "text": "Terrific food here. I asked for hot(spicey) chicken curry and it was terrific and very spicy. The service is fantastic, my server watching my table constantly, ready to refill or get anything you need.  A first class experience!", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 5, "date": "2011-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "248ZWxTJ7f7JKaZwrarPYw", "review_id": "_lTVjd-6Jo3LwomHa2tONA", "text": "I'm still trying to learn my way around Indian Cuisine, and so far I'm still on the fence.  Today we went with a friend who was a fan of their lunch buffet.  I thought it was a great way to try out more foods.  Still, nothing rocked my world.  While I couldn't tell you the names of all the foods (if I really LOVED something it might be different), I know I did like the peas dish, which I believe from looking at their menu is the mutter paneer?  I also see the dish is $12.95?  For peas and cheese?  At least I know that I CAN eat a variety of Indian food if I go to another restaurant.  As for the service, while it was very quick, it got to be a little bit uncomfortable as the waiter was hovering in the dining area right by our table, ready to grab our plates as soon as we cleared them.  Not a bad experience overall as it it's fun to try new foods, but nothing a crave to go back for.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 3, "date": "2012-06-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "v2G6VK2qvxKak9I7bVNJOA", "review_id": "W6afl1GH63NG2fbo15E4IQ", "text": "Have been twice for the lunch buffet.  If you are new to Indian cuisine, this may be the way to go.  Costs roughly $10 if my memory serves me correctly.  All dishes are labeled, so have no fear.\n\nSamosas were great - flavorful but not too heavy.  Naan was OK - I've had much better.  Their version was a little too thin and crispy for my liking, but hey, it's really only there to balance out the spiciness of the other dishes anyway.  The Butter Chicken is by far my favorite dish.  Ever since having this dish at Maharani, I've tried tracking down the butter chicken sauce at local grocers, with only moderate success.  Good stuff.\n\nService is OK, but you have to expect just OK service when you're eating from the buffett.\n\nThere are better Indian restaurants in town, BUT, this place makes for a decent business lunch if you want something outside of the norm.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 3, "date": "2012-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "xsv-G_gRw5exn4s450p20w", "review_id": "L9lgTEINcjT9dZIe3UdL6A", "text": "Best Indian buffet in Charlotte IMHO.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 4, "date": "2012-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JokTJ9gp2gyvWiyaIdLXbg", "review_id": "gUHwZ_1Tx9InRJNuLqlcaQ", "text": "very avg lik most other indian restaurant !! though its decent compared to the price (9 bucks buffet )!!", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 2, "date": "2012-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7jWS3ZC5x8eImK0R999_5Q", "review_id": "T7CG86ctYePgTGRb_DXbLg", "text": "I've been to this place a couple of times.I recommend the mixed maharani tandoori entree that consists of shrimp, lamb, chicken, and salmon served with a salad and rice. All of the meat has a specific taste/texture and the naan bread is delicious. The service is very attentive and accomodating.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 4, "date": "2013-06-02", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "yvlU1IzAqn1qK-pIlHW1ug", "review_id": "vRaJE7gis01me5DyS2He9Q", "text": "I came back here with a coworker for the buffet lunch and went back twice and walked/waddled out of the restaurant. HUGE improvement from my first review. So glad!", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 4, "date": "2013-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yA1jknl1bJOJOHm6dmhYFQ", "review_id": "D7DRsetpR9yxsmNxiVRscg", "text": "This place was good for Charlotte. They did spicy and naan very well. I would come back after I have tried other clt restaurants!", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 3, "date": "2013-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eW5OhMlPcjVNQRVyjh885A", "review_id": "2qBK-ejDj3x-nXfVqitREg", "text": "Really rude and non Indian people.....I have never had such a bad experience with any restaurant let alone Indian.....god bless them. I would be interested in seeing how long they can stay in business with this attitude.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 1, "date": "2014-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "dhlKRKGCAP7I8wxNZqu4fg", "review_id": "t4W3r7zzaH3Tzfq_1kNaBw", "text": "Was very disappointed with level of quality and service. Ordered to go and gave clear instructions to have two separate meals. Each with naan and rice and utensils for work. Arrived to find one bag. One rice and one naan. I pointed this out and they fixed it but they forgot the naan. Looked at $35!!!! Bill and saw they double charged for the naan too. The vindaloo chicken was not spicy enough and very oily. The employees spoke very little English and that was a huge barrier. They also seemed arrogant and rude. I am thinking that most of these reviews are fake or people do not know what good Indian is. This was the worst Indian I've had in Charlotte. At twice the price. I now know why this place is always empty.  I have also tried the lunch buffet and while the price was better. The spice was horrible. All bland, boring curries and an always empty naan bin. Had to ask to get naan.  This place is PERFECT if you have money to throw away and want mediocre Indian.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 1, "date": "2014-06-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F_vfkp7ph0ESTif2i6PDgA", "review_id": "kXub6qRmBDrf4i_Z77YK6A", "text": "I guess when you grow up eating authentic Indian food, the bar gets set pretty high.  Maharani was not at all what I'd hoped for.  The food was bland, under-seasoned and the woman working the door seemed not to care much that we bothered walking in.  \n\nThe decor is old and drab, the entire place having a rather sad mood.  Someone needs to wake up, update, and start cooking with passion.\n\nLife is too short.  Go elsewhere until that happens.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 2, "date": "2014-07-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sxyVjsudEOMLGms0Jf5kVg", "review_id": "pK8h42DWqQ5aZ_pK-8lgLA", "text": "This is easily the best deal for great Indian food in Charlotte. The food is maybe one notch below Copper (upscale Indian location in town) but the price is about three notches lower. They do an especially great job with the classic dishes, and they'll adjust the heat level to your liking, making it a safe place to take guests with little or no experience with Indian food. Staff is friendly and very attentive. This has become my go-to place in Charlotte for Indian food and I'm there more often than I'm comfortable admitting.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 5, "date": "2014-08-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vUtoLobpYw3ZJATISa8Izw", "review_id": "CkEJRpmkzMJ8jwyi8JDYAQ", "text": "Good indian food. They do not compromise on quantity as well as quality!", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 4, "date": "2015-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "N4WGj3T1dpRsHrXq8BYvbw", "review_id": "uA4mdr-s_KFxDGdUlItQ2A", "text": "We went on a Saturday for the lunch buffet. Food was good. Nice veg and non veg options. Wish they had better dessert options.\nWhat's more the staff were very friendly even to a non regular like me and my family. They were accommodated nicely to our requests when we went with our two small kids.\nBill was 11$ each. Definitely will return. Must go place for Indian restaurant.", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 5, "date": "2015-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NPGkr90axmGYs2OkvmgfBg", "review_id": "0BVTBR3YYjXZHCI7TCJ-vg", "text": "This place is awesome I've been quite a few times since moving here, and I'm a huge fan of Indian food. This is definitely my favorite and I've tried a bunch of Indian restaurants in FL. Highly recommend!", "business_id": "nuCgH96Tfe6CFXznvmKdhA", "stars": 5, "date": "2015-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_ma5L1ypUiIp9p-UdeyVLA", "review_id": "chcvnEcxD9wBYwg5qxJHXA", "text": "The lunch buffet is probably one of the better Indian meals in Charlotte.  Dinner can get a bit pricey.  Service is adequate.  Atmosphere is better than most Indian restaurants in town.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2008-08-27", "type": "review"}
{"votes": {"funny": 5, "useful": 5, "cool": 1}, "user_id": "N9gCadark-FgudRE20JZcQ", "review_id": "io_u60AvEX7iY4YaoUBe8w", "text": "Reasons I will never go to this restaurant again:\n\n-Out of all the empty tables, the waiter (a creepy, older man) sat me at the table against a wall right next to the door, pretty much isolated and alone.\n\n-The waiter tried to find out where I was from (my ethnicity), where I lived, whether I was working that day and whether I was on my lunch break, whether I was married, and whether I lived alone or with my parents. \n\n-When I was getting food from the lunch buffet, my waiter would pop up from behind me and point to the last dish I got and say \"This, very good.\"\n\n-When the waiter had nothing to do at the moment, he'd stand against the wall across the room and just stare at me. \n\nI felt extremely uncomfortable there, and the buffet was not worth its price.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 1, "date": "2009-08-13", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "7W_Ve1DnGa4uFMbeyC2J6w", "review_id": "-y9-Iwijs8Yy4dL_7N3P8A", "text": "My friend and I went last night to Bombay Grille. We started with samosa (she ordered and oh boy what a good choice). They are very filling and come as two big pieces. I ordered chicken palak. It's quite tasty but a little spicy for my taste. Next time note to self to order only #2. Luckily, the waiter was very prompt in refilling my drink. The garlic naan was sooo yummy! I can eat that for dinner with the sauce of Chicken Palak. I wish this place only 10 minutes away from my home...", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 5, "date": "2011-06-08", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "4G68oLRY3aHE5XUt_MUUcA", "review_id": "r-ujeJUSrsM3nTkzwf7yTA", "text": "When my stomach says \"Indian\" food for a meal, this is probably one of the first places that pops into my head.  I live in Matthews, but I still make \nthe trip to Pineville for this food.\n\nThe dining area is a bit dark for me, but gives the place a unique atmosphere for a dining experience.  The servers are in all black and are very quick and attentive to re-fills (especially critical when eating spicy food since you may need some emergency cooling chugs).  The servers do a good job of telling you what dish is what as well.  Hopefully one day I can be pretty good at ordering and being familiar with certain dishes.\n\nThere are a ton of vegetarian options on the menu.  I tend to lean toward the carnivore side of the menu, but I tried the Palak Paneer and it was excellent (if you enjoy spinach and cottage cheese).\n\nI'm hoping as Charlotte grows to be more diverse, more places like this show up on the map.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 5, "date": "2011-07-25", "type": "review"}
{"votes": {"funny": 1, "useful": 9, "cool": 5}, "user_id": "ytxqyAM8f46YVrGLr2BMKg", "review_id": "Kma0oH1xG03MxV72PXPtrQ", "text": "I've been coming to Bombay Grille for more than 6 years now.  It never fails to surprise me every time that I pull into the place that it somehow keeps the lights on and stays in business.  \n\nNow let me be clear, I'm surprised it stays in business because every time I go there for lunch, it's dead.  Shocking really at any buffet, but especially at a buffet where the food is as good as it is here.  \n\nIt's really really good.  The naan is fresh, the Chicken Kormi and chicken curry are delicious.  Any time they serve lamb, consider yourself lucky - it's amazing.  \n\nTo top it off, they often have rice pudding available to finish off the destruction of your blood sugar.  It's great!  The only problem is that it usually has to sit on top of two plates of delicious food and soup which means your stomach is about to overflow.  \n\nThe service is also respectable, and it seems as though the same 4 or 5 guys are always working, so if you're a regular, they'll recognize you.  \n\nThe only reason it's not a 5 star place is the decor and cleanliness.  I'm not saying its dirty, but it's not sparkling, and the dimly lit dining room doesn't bestow confidence in germaphobes.  \n\nI would however recommend this place to any foodie type who knows that sometimes you have to look past some of the details to find the gems.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2012-06-04", "type": "review"}
{"votes": {"funny": 3, "useful": 4, "cool": 3}, "user_id": "9P_5UGjc3t3Bo_yJ5A7iAQ", "review_id": "2QhcgDJrAhnpNL2B2xbTaQ", "text": "I really enjoy coming to Bombay Grille for a filling and satisfying Indian dinner. I love the chili naan and the samosas they offer and they have a large menu that has traditional Indian food as well as an Indo-Chinese section on the menu. I have also been there numerous times for their lunch buffet (more on the weekends so gather up some buds and go during the work week). The buffet has never been totally the same and you can get in and get out fast, even though I dont mind hanging there smelling in all the goodness. Enjoy!\n\nhttp://www.bombaygrille.com/charlottemenu.html", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 5, "date": "2012-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r2tFWrC-KjCekm2q5o6w2w", "review_id": "fzeL2RmlPaaRx08CcaTSWA", "text": "First time eating Indian food.  Great staff great food.  clean.  All around excellent.  Can't wait to try it again.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2012-08-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BzuPVv25b6e5MQwHfFp5HQ", "review_id": "UcYjULjPmH7clBS525RShg", "text": "Loved the lamb madras and the Peshawar Nann. The lamb was cooked well with just the right amount of spices. The peshawar nann was something I never had before. It was filled with shredded coconuts, cherries and cashew nuts.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2013-07-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "64JC-e9lcmBJ3iWi4PeQKw", "review_id": "ZB-uUnr3JucZS48jZJuTAg", "text": "No, I haven't been to India. No, I'm not going to india, YES, I love indian food! This is one of the top indian restaurants in Charlotte. I've only ever eaten their buffet ($9.95 weekday) and thats just fine with me. I love to try a little bit of all the different flavors, and then wash it all down with a mango lassi. If you live anywhere in South Charlotte, its worth trying. It isn't a fancy place (if that's what you are looking for), but it's fine, and the food is why I keep going back!", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 5, "date": "2013-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V1OY6rcgcfSLnLdZNtI_-Q", "review_id": "PKHntTdbgOkhYZtR7rVTsg", "text": "The buffet has all of my favorites & is delicious. The curry chicken, biryani chicken & jambhar soup were my favorites.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 5, "date": "2014-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "F60RFMCuuA3yW-V7OYW6Pg", "review_id": "1WekWQpr3xsW7bWPzqeELA", "text": "I frequent this place for take-out as the food is pretty darn good. It's a little expensive for dinner ...takeout for two usually runs us about $55 but its too yummy and their are so few decent Indian restaurants in Charlotte that I deal with it. Portions are not very large. The rice seasoning is particularly good, garlic naan is also fresh and so delicious.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2014-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ecnF-zjCn81vY7nz45UY-g", "review_id": "zGbVM1QzcY4lBwb6N4H0Ow", "text": "Decent lunch buffet...a little larger choice selection would have been good, but not bad overall.", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 4, "date": "2015-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WGwlY1bY1qHZc-HL-tFziA", "review_id": "xm1xrJrj34myl50rgNMVFA", "text": "Thoroughly enjoyed my first visit to Bombay Grille. The buffet had a wide selection and the flavor was second to none. Eaten Indian cuisine all over the world and Bombay Grille is one of the best. The staff were very friendly and courteous, and the price - wow - exceptional - looking forward to tasting their A La Carte -Awesome!", "business_id": "4zr5_OOjwTdOEE7d_181RA", "stars": 5, "date": "2015-08-27", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "RgRn7tjpAvLZy3y4S992eg", "review_id": "FTJdRmmVYdAGbefuvslehQ", "text": "I was really sad when the Loop Grill closed, but now that I've tried Bombay Cuisine in it's place, I am happy!  The buffet food is fresh with many meat and vegetarian options, at least two kinds of rice, two soups and some kid friendly dishes with Indian spices.  I loved the food and some of the dishes were pretty spicy yet delicious.  There are also some 'Indian tapas' choices which I may try next time, but the buffet is inexpensive and worth every penny and more!", "business_id": "ULvDCr7r9sMU1iSwgTHXsA", "stars": 5, "date": "2009-08-06", "type": "review"}
{"votes": {"funny": 1, "useful": 5, "cool": 2}, "user_id": "Qe1l1ln6bf_pcWUUuLswFA", "review_id": "uXazuond5fysvGJjavqXiA", "text": "This location is on the Southeast corner of Park Road and Woodlawn next to the Starbucks.  There are three Bombay Cuisine's in town now, even though it doesn't currently say so on their website.\n\nYou can order an entree but why do that in these hard economic times when they have an amazing buffet that includes a soda fountain drink!  There are four sections to the buffet which by far is the greatest value.  The chicken is nicely cut and the ground lamb and pea curry is rich and flavorful.  The Tandoori chicken which is bright red, isn't spicy at all but the curries all have varying degrees of hotness.  \n\nIf you've never had Indian food before, this is probably the best place in Charlotte to try it.  You can sample 8 or 10 curries and they also have a little salad and some dessert items.  I can't even pronounce half the items on the menu but they taste fantastic.\n\nMy only complaint is that sometimes the bread (naan) is fried, not baked, which makes for a much heavier meal.  When it's baked it's fantastic.  When it's fried it's just ok.  And sometimes the rice is a little undercooked (crunchy).  But overall a great, affordable addition to Charlotte restaurants.", "business_id": "ULvDCr7r9sMU1iSwgTHXsA", "stars": 4, "date": "2009-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "o-ELjRFSkN_FSyoRLF0DSw", "review_id": "0ylsb5Y0MRXa7J9wlE2X8A", "text": "Restaurant is closed.", "business_id": "ULvDCr7r9sMU1iSwgTHXsA", "stars": 1, "date": "2010-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dRko0-SaRcSaP5gR-5uxuA", "review_id": "S8LRpSs-zCOMS-MrewtV6Q", "text": "Love this place. Their lunch buffet is great. So is their dinner menu. My partner and I went there for dinner on New Years Eve and for Valentines Day, we had so much fun. It is a relaxed atmosphere and they have great food. I recommend the Tikki Masala.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 4, "date": "2009-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zEHcZ7V911uwOD2IzieiQg", "review_id": "lrVTMw7KkuajKw5KtukJ1g", "text": "This place had its awards placed up near the entrance, so they can say they're awesome. But, these awards are outdated. Remember one that was dated back in 2008. No 2010 yet. ha.\n\nHad the Tandoori chicken and the Lamb curry. The lamb curry was awesome, although not enough lamb chunks.  The tandoori was excellent and spicy.  Had a side order of naan too. Delicious! But expect to pay a good amount. Its quite good and the awards don't lie.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 4, "date": "2010-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Dzc2m6O4vaXCF4ztKPjTcQ", "review_id": "bDTn97mR2WnsGIgxwzGRjg", "text": "Pretty good lunch buffet, theres alot of vegetarian choices if you stick to a certain kind of diet like myself.  I eat only Halal meat.  I haven't asked if any of the meat on buffet was halal only because I don't want to make a fuss.  I will however call ahead and see if they are serving any Halal meat before I decide to dine for dinner.  Sometimes they have Chicken and Goat but sometimes only goat.  \n\nAs far as authenticity goes, I can't personally say because I am not south asian.  That being said, a friend of mine who is complains alot that there is no authentic south asian restaurants in Madison.  This how ever does not take away from the tastiness that I have experienced at Maharaja.  \n\nThey have satisfying dishes that come in satisfying portions.  If you dare to go to the spicy side of the spectrum they are constantly filling your water, which is awesome.  You don't want to be left without water when the burn becomes too much.  You can ask for not so spicy though ;)\n\nThe only not so great thing I've ever had here was the Cheese pakora, they kind of seemed like they were pre made (as in frozen) and not fresh. That was the only thing, ever, in all the times I've been to Maharaja.  \n\nBoth east and west locations have awesome service and tasty main dishes.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 4, "date": "2011-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jX3ot_N3XZBir46DHrswCg", "review_id": "lQE-CRIo39b8L9GIDsoMGw", "text": "I was in town on business and had a free night so I decided to give Maharaja a try. I had the Mulligatawny Soup, Garlic Naan, and the Tandoori Chicken.  The food was really good (awesome Naan!) and the portions were quite large.  The chicken was out-of-this-world and I could not finish it all. \n\nThe only negative was the service. I dined on a Tuesday evening at 6:30ish. It took a long time for my waiter to take my order. Though the place seemed relatively full. There were only two waitstaff.  When i arrived, there seemed to be several employees outside smoking. Also, My waiter was not of Indian descent, which is perfectly fine, but he did not speak English, thus my questions about the menu and what he recommended went unanswered. It also took a long time for my food to arrive. From the time I sat down to the time my food arrived was almost an hour. \n\nAll-in-all, I would go back again because the food was very good. I would have given 4 stars, save for the awful customer service.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 3, "date": "2013-06-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7rExeUPqtOEcpKuyokb6Eg", "review_id": "49VU8guZQH3pLVOqb9l2bg", "text": "I went here at the suggestion of several people who told me how great the food was. I admit my experience with Indian cuisine is limited, but for the most part pleasant, so I thought it was worth a try. \n\nThe food was outstanding! I ordered Aloo Ghobi. Really flavorful and spicy. I don't know if this is commonplace everywhere, but since I moved up from Texas it's been really difficult to order a dish and be satisfied with the level of heat. Here they asked if I preferred mild or hot, when I said hot, they asked how hot, I said very and they definitely delivered. My husband ordered the tandoori chicken which is a very generaously sized portion. It comes out on what looks like a small griddle, steaming, with peppers and lemon slices. They also brought out a big bowl of white rice along with some Naan bread that we asked for. All in all, it was a very satisfying experience and we will definitely be going back!\n\nService can be a little slow, but the staff are very attentive and helpful. They're also really good at refilling drinks, I know it seemed like our server kept refilling my glass every time I took a sip.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 5, "date": "2013-07-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LnAxeGjNEyGLDEjkOgeSMQ", "review_id": "GsD01wp8N_Aw3RNJExaTtA", "text": "I can't say enough good things about this place!  My husband, son and I go there at least once a month and it is always delicious and they take such good care of you!  Some restaurants look at you when you walk in with a little one and grimace they are always joking with our son and making him, and us, feel very comfortable!  The food is SOOO good - not a bad thing on the menu!  If you're looking for a great Indian meal in a great atmosphere with fantastic staff this is the place!", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 5, "date": "2013-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Sjz8AK54jEh9McFTW9erEw", "review_id": "JsuhgbXKUEYF7ng6fg8Yjw", "text": "Our family went to celebrate a birthday with an Indian dinner - there were 6 of us in our happy group.  We have been going to the Maharaja for years, to enjoy the lunch buffets, Valentines Day, birthdays etc.  Tonight the food was good, but the service was an issue.\n\nTo start, we could see that the staff had changed.  The service took a long time, even though there were only 5 tables with customers and six wait staff.  The server did not understand English well enough to properly place the order, so there was extra wine for one person.  Also, the glassware and flatware were spotted, with some that needed to be sent back.\n\nThe service had really changed for the worse.  The server would clear one dirty plate, then wander off, return five minutes later to get another and so on.  The Manager or owner really needs to train the staff.  They were all working, but seemed unclear as to who was responsible for what duties.\n\nWe also ordered ice cream and a special birthday dessert, while very tasty - the service was vey slow, at least 10 minutes from the time the ice cream was ordered to served.\n\nWhat really put us over the top was when they refused to accept their own $50 Gift Certificate that they sold to me in June towards the $160 bill (not including tip).  It had only been approximately 6 weeks. Apparently, this location has been sold.  The old owners still own the location on Odana Rd (same name), but not this one.  Therefore, they would not accept their own gift certificate and told us, we could use it at Odana Rd.  \nInterestingly, they still kept the Best of Madison sign on the door for the old ownership,  they will need to take this down.    Again, we were surprised at the business decision about their own gift certificate.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 1, "date": "2013-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "wjY2kntD9UHozywG0JWDsA", "review_id": "9YiE2aRlXkhYjDXbzC5lKA", "text": "Authentic Indian in Madison, Wisconsin.  Score!", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 5, "date": "2013-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ksxtoLnnNXIv7_5GA5DUEw", "review_id": "CFvvRQpoQ-2zdqvNv-Qv6A", "text": "Good food, reasonable price for the lunch buffet and very attentive service. I'll be back.", "business_id": "jqo3Ljexof9sA8PhSTwEjA", "stars": 5, "date": "2014-08-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HqaXK9toBpQdcz-0-rVwKw", "review_id": "qJBQfq7FxkbjRcYFVHwVPA", "text": "There is a long standing debate between my friends and I over the best Indian restaurant on Green street. Unlike Chinese food here, there isn't much competition, so it's basically Bombay vs. East and West. East and West is completely vegetarian and leans towards Southern Indian style snacks, whereas Bombay Grill has heartier food  and has a more formal dinner.\n\nI think some of their dishes are a little overspiced, but the Tandoori chicken is absolutely divine with a crisp skin and the perfect amount of seasoning. I only wish it came with more chicken and less of the lentil side and gigantic naan. Don't get me wrong, the naan here is great, but more of that chicken would be better. \n\nThe service is quite slow and it is pretty expensive, so I reserve going here for when I really need a treat.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 4, "date": "2006-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ii3jv_y4YDcNSh9x6uuBrA", "review_id": "E8wvZ7os98ma9IuDUCSejg", "text": "This is probably my favorite place to eat in C-U.  I come from Boston, the land of 100 Indian restaurants.  I fell in love with Indian there, and was very wary of moving to a tiny midwestern city.  However, Bombay definitely hits the spot.  I like the typical curry dishes, chicken tikka masala, samosas, naan - all are great here.  My husband is a bit more adventurous and he has never been disappointed.  Granted, it's not better than many of the places we've been to in Boston - but it's way better than I expected for around here!  On the down side, it's pretty small and very crowded around lunch time.  Good luck finding space for more than just 2 at noon!", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 4, "date": "2007-06-21", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "CX4GcrCCnzfNyAl0cPqGbg", "review_id": "IGHyKu_TThvjtdCXievGyQ", "text": "I was a little reluctant to try this place out but after getting a thumbs up from my Indian friend, I finally gave in. It is quite a small place with 20 or less small tables. I was there with 5 other friends and found that it is particularly hard to find a table that was big enough to accommodate all of us, especially during lunch time.\n\nI was surprised when I tasted their food because I thought it was gonna be really bad. It turned out to be okay although it wasn't excellent. I love their paneer makhani because the sauce was wonderfully creamy but oddly, the paneer tasted like tofu to me. I also had their lentil curry and briyani rice but that weren't as good. You have a choice of a huge naan or rice for lunch specials I think. I'd go for the NAAN if I were you.\n\nExpect to spend at least $7 or $8 for vegetarian dishes and more for meats. For the amount of food that they give, the prices are a little steep in my opinion. It's usually the naan that fills me up, not the curry.\n\nUpdated 5/10/08:\nI was there for dinner and I realized that it was a completely different experience in the evening. For lunch, you order your food and pay at the cash register. When the food is ready, they will serve it to you in styrofoam plates and plastic cutleries. For dinner, it becomes a sit-down restaurant with table service, cute waitresses, and food served on china and silverware. A stark difference, eh?", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 3, "date": "2007-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4omuU-xWbf3ty7vrMfbP3Q", "review_id": "T5W4HyQD0NcLAFWOyYMrYA", "text": "I got food poisoning here.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 1, "date": "2009-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BZjl6W41tc5E2wWyvJ23gQ", "review_id": "PdMC7Ez2u22RqcgUkOBUrA", "text": "Let me start by saying, I NEVER had a bad meal at the location on Green Street.\n\nHowever, the problem started when Bombay moved into the old Basmati's restaurant on 1st.\n\nFor all intents and purposes, this restaurant is Basmati's all over again.  The decor was exactly the same.  The waiters seemed to be the same too.  However, would we still have the same bland food that made Basmati my least favorite restaurant?\n\nWell, yes and no.\n\nEven with an expanded area for cooking and serving, the food is identical to the location on Green Street.  Wait, no, not identical.  The main courses cost about $3.00 more than on Green Street.\n\nOf course there's the addition of alcohol on the menu, but the location on 1st doesn't afford you the great meal at a low price that the Green Street location was so good at.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 2, "date": "2009-06-12", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "-C93MHl3n-O_5KU_zGjEgQ", "review_id": "oIYuY_pmC3lXyETUuowb7Q", "text": "Totally solid, no-frills Indian food.  The lunch specials are affordable and come with rice/naan (THE LARGEST PIECE OF NAAN YOU'VE EVER SEEN), salad, and a veggie pakora - for under $10.  Yes, please!\n\nI've only been to the 1st Street location once, but from what I've tasted, the food is basically the same here.  Creamy chicken tikka masala (my fave, I'm a gringo, I know) with crispy, buttery naan, mmm.  I tried my boyfriend's Lamb Saag dish and loved it also.\n\nWhy is the lunch so affordable?  Because it's a really small place (the tables are tightly-packed in), there's no waiter service, and your meal is served on Styrofoam.  This is Indian food for poor college students.  If you want a more relaxed, \"restaurant-y\" atmosphere (and don't mind paying a few extra dollars), head over to the Bombay Grill on 1st.  But if, like me, you are in grad school and up to your ass in student loan debt, this is the place for you.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 4, "date": "2009-07-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9f3InRLGUVYDsQx5VT_BPg", "review_id": "-eLmorIxW1Z66_TzxhKdKQ", "text": "This place has a great variety of food! Go here for lunch! The portion is bigger and it's cheaper. You get a salad and a small appetizer with your entree during lunch, but you have to pay for it during dinner. The naan here is absolutely to die for. the only complaint i have about this restaurant is that you will walk out of there smelling like the food. The odor is not the most pleasant so I wouldn't suggest wearing your sunday best.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 4, "date": "2010-08-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oJk4au1iKQvaBnuta6lQhw", "review_id": "_o2IR129JpJmmafCKDT6ow", "text": "This place is Awesome! Chicken saga is tender and flavorful. Coworkers really like the jelfrese. Don't miss the cheese or garlic naan! YUM!", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 5, "date": "2010-08-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AllG7uUNhd8VcSXNkm-8wQ", "review_id": "qW8jMaeegzJj7ZyJOOGwTQ", "text": "Tasty food. My favorite was always chicken makhani. Sometimes the manager would give me additional nan (some kind of pita bread but much more tasty) for free. The price is low and you will always end up as full as it gets.\n\nSeating was sometimes a problem because the place is kind of small, and it is so good that it gets crowded.\n\nI moved away from Chambana to the south west. I have been in some other indian restaurants but no one compares to Bombay Grill regarding taste. I miss it.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 5, "date": "2011-07-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IXFGCmgnB8YY-jtPCaNYeQ", "review_id": "O-Ht5KDLGvcdZ6luy3RL-A", "text": "I think for cheap Indian, it's hard to do better given its city (C-U).  It's not top shelf Chicago/big city Indian or anything, but it's very good.  In particular, I think this location is better than their sit down restaurant, as it serves very similar food but is noticeably cheaper.  I've had a lot of different dishes here and wasn't really disappointed with anything.  Particular favorite is the saag paneer and spicy chana aloo.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 5, "date": "2011-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UO5eCeTNpnUekttaryBCNw", "review_id": "VzPm15ZwmebwEumGiSCfyw", "text": "I've been to Bombay Indaian Grill a couple of times now and everything I've had there was delicious. I've gotten the Bengan Bartha (spicy eggplant) and Aloo Gobi (cauliflower with potatoes), both of which were very tasty with a side of naan bread. The only reason I'm giving them 3 stars instead of 4 is because the food is overpriced: $10 for a small cup of stewed vegetables and naan bread... Pretty ridiculous if you ask me.\n\nOverall, I like the food there but because I don't like feeling ripped off, I probably won't come back too often, unless I'm in the vicinity and have an extreme craving for Indian food.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 3, "date": "2012-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e41iCt8CwlD66IZENs1zgg", "review_id": "KxhFwZNE0Oe9YQB0nhp6jg", "text": "Service was fast.  Prices are very reasonable.  The food is good by Champaign standards and OK by larger market standards.  I had the Chicken Vindaloo which had a nice flavor but was lacking in heat.  The naan was nice but just slightly burnt.  \n\nI would go back if I was in champaign and jonesin for some indian food, but i wouldnt seek it out as a fantastic restaurant", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 3, "date": "2013-07-02", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "A9oNZkfedFK1ZMeJ0Qo6xA", "review_id": "nUgprVuvc3L1bzgIkNJ0lg", "text": "This is the best Indian food you'll find in Urbana-Champaign.  Growing up in India and spending more than a decade in New Jersey, I have had luxury of trying out Indian food at many places (incl. home!!).  The taste of the food is authentic, not too spicy, but not at all bland.  True art of Indian food is to use variety of herbs and spices in a way that it enhances the taste of food, but doesn't dominate the overall taste. Many Indian restaurants either are afraid of using spices or carelessly overdo it.   Bombay Grill nails that aspect, so it gets five stars from me. \n\nBesides the taste, the food isn't that expensive for an Indian restaurant standard.  We tried weekday buffet last week.  For $11 + tip + tax, it had enough varieties.  Some really good, some right on mediocrity, which is very common with buffet. Their butter chicken and tandoori roast chicken are worth trying.  Saag paneer is phenomenal for those interested in vegetarian options.  Lunch buffet had probably the best naan I've tried in many years.  They are freshly baked and new ones keep coming worm and fluffy from the kitchen. Judging from the buffet food, I can confidently say that a la carte items would be a bang for your buck too!!\n\nNext time will try dinner and see if it's equally satisfying as the lunch buffet.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 5, "date": "2013-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f1a9KwsObpE54Yp9A1fVoA", "review_id": "9rwRzE9SBPh9_t0qLqYE1A", "text": "Restaurant review\nHmm Indian food selection is very limited in Champaign so I was excited to eat at Bombay again since my medical school days. I had only been here once with my wife for dinner and the food was pretty spicy. The lunch special seemed enticing for 7+ dollars depending on what you order. I wish I took a picture of the menu, maybe next time. The chicken curry I ordered took a bit of time to prepare but it came out piping hot. The curry was not spicy at all which was perfect. It was rich and creamy with ample amount of chicken. The naan was simply the largest naan I have ever seen. It was perfect with the curry. You also get a potato pakora. No salad though as mentioned previously. All and all great, but if you could pay a dollar or two more for buffet at someplace else I probably would go with that for variety. The only downside of this place is that they use plastic ware and plates, but I guess this is a college town after all and I have to lower my standards. \n\nPro: large menu with lunch specials, large naan, not too spicy curry\n\nCons: plasticware, slow service\n\nHidden gem: \n7+ dollar lunch specials with large naan or rice and potato pakora", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 4, "date": "2014-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "q0XqCjIefzm_dA5qmTcFzw", "review_id": "nbYNyw5c-2DdVNvcbY1v_w", "text": "Food was pretty average.  Waitress was pleasant.  I ordered the mixed grill.  It was all chicken.  Where was the mix that was on the menu?!?  $15.99 for grilled chicken and a few grilled onions is not a bargain.  No rice. Burnt naan.  I will return to Puran in Bloomington:)", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 1, "date": "2014-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZuifwOgjVFAXsbYrcuK7NA", "review_id": "p4P83mwfmcGRWPxkKXOoxA", "text": "I love the food in here! But the price is a little expensive compared to another Indian grill on green street.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 4, "date": "2015-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kEQnFhmElRs4Zscmc2FIrw", "review_id": "KCwTLqBXzGGCQfgBzs__mA", "text": "Brother took the malay masala chicken , i took the lamb biryani, the seller is very friendly! Very welcoming!  \nI didnt finish the lamb biryani, perfect flavoring \nThe malay masala was good too!\nHe gave us a naan on the house too", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 5, "date": "2015-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cYZsY2z7eJqT5ArhJWg_6w", "review_id": "KVQVLoZopilDNUZfn1-vwg", "text": "Ordered the a spicy chickpea/potato dish with a side of rice and a soda. Soda was completely flat and lukewarm served with a couple of ice cubes that looked like the server had scooped it out from the bottom depths of the freezer. Rice was stale, cold, and hard. Chickpeas and potatoes were incredibly hard and seem barelt cooked at all. Meal came out to nearly $20. Definitely not worth you money or time! Incredibly poor food quality. Doesn't seem like they put any effort into their food or service.", "business_id": "1tK0k-vRgGFC3oSZNUJ58Q", "stars": 1, "date": "2015-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "7zSppEZd2C6ASpNeBebxAA", "review_id": "3t17h0KI_LebX9eoCwliyA", "text": "When I think of subpar service and waiting in line for a table for absolutely no reason, I think Basmati. It's rarely crowded and yet, you end up waiting for a table EVERY time. The staff means no harm - they are have a sweet disposition - just more on the easy going side and have no ability to move quickly.  \n\nThe complaint is the temperature of the food. Nothing I have ever ordered has been sizzling. Perhaps because the food waits on the kitchen counter before it is picked up and delivered to the table. The food itself is just OK... nothing has a distinctive aroma.\n\nI say, go for the buffet on Thursdays or Sundays. Buffets are exactly that subpar to average quality food at an inexpensive price. \n\nTip! Check in the back of the Yellow Book for a 50% off your entree coupon when you purchase one entree at full price.", "business_id": "mtQHSFxx35emKstqMxp9Cw", "stars": 3, "date": "2007-06-11", "type": "review"}
{"votes": {"funny": 9, "useful": 14, "cool": 12}, "user_id": "C8ZTiwa7qWoPSMIivTeSfw", "review_id": "u_xtPd5LZl2TM2qITWAa6Q", "text": "First off, I must say, friendly smiles upon entering an establishment goes a looooong way for me. Family owned and nurtured with love comes through at Indian Delhi Palace. I've eaten in a few times and mostly had take out. Service was always right on, attentive not intrusive. Take out packaging is an art in my book. So often, things are forgotten, mispackaged and spilled and well, sometimes just tossed in a bag. Here they do it right. Garlic naan bread in house is better than to go. Unfortunately they wrap it in tinfoil and it sweats and loses any of it crispy outer crunch. Chicken tikka marsala has just enough cream and spice to hit all my F spots (you know like a G spot, only F for flavor!). Saffron rice is fluffy, flavorful and fantastic. Rickie loves their sauteed okra...generally not something high on my list to order but yowza Potsie...dee - lish. Samoras, tandori chicken all A's all around. And you can't beat a tall, cold Himalyan beer while waiting for that to go order and they always provide me with some papadum and a tangy, sour, spicy dip. Remember a smile goes along way with me!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2007-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "9KHQDPM5M7sHUTUSBboNgg", "review_id": "KD13xPNPlUxasUjCc35kmA", "text": "The food is good... The service is good. Again this comes from an Indian who did eat at EVERY possible Indian food restaurant in phoenix!!!\nTry the kheema(minced lamb) naan-its extremely filling. The butter chicken is good, and the portions are decent enough! Its family owned and operated so that is always a good sign!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2007-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "JgDkCER12uiv4lbpmkZ9VA", "review_id": "xGMUqZvVtivHNlBZ6Kmjrw", "text": "This is my favorite Indian restaurant in Phoenix. The food is always the best tasting of places I've been to, and probably the least \"watered down\" in terms of spice. The place is modeled to look like a little taj mahal which is kinda goofy, but it's very nice inside and out. They have a delicious buffet for lunch with a menu that changes almost daily, unlike a lot of indian buffets where they have the same items for a week on the buffet line. The service is always good, even the first time I went I ordered chicken curry (I'd never had indian food) because it was a safe bet. The man asked me if I wanted an order of naan or rice and I didn't really want to order anything else. He said \"well how are you going to eat the curry? with a spoon?\" and brought me a basket of bread on the house. He knew I was trying something for the first time and wanted me to enjoy my experience. I've been back quite a few times and tried just about every other Indian place in town, and this one is still by far the best.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2008-07-01", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "izOUjRwXReNSYtIl_AUR9w", "review_id": "BfFKToeGDLpwF51yk76MHQ", "text": "Finally, another Indian restaurant in Phoenix worth praising (Udupi is my other spot) -- we stopped in after work this evening for a quick bite, expecting the usual bagged frozen veggies in watered-down curry.  What we had was a hearty, flavorful, fresh, vegetarian meal. There is plenty of meat on the menu as well.\n\nMy wife and I both ordered the Vegetable Korma, which was full of fresh veggies in a rich, aromatic curry. We tried two different breads -- one was doughy and stuffed with cauliflower and the other was a crispy whole wheat. They were totally different from each other, yet both were fantastic.\n\nEach staff member was friendly, responsive and never devoid of a smile. A nice, intimate atmosphere, perfect for a quiet and economical meal.  I will certainly be back soon... and will consider becoming a regular.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2009-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kJyR4gT1pfCcNjEY9-YMoQ", "review_id": "E2pO-J-b2tr3ax64FmGAow", "text": "I poped in for a quick lunch yesterday knowing they would probley have a buffet. they are'nt overly cheery to have you as a customer not that there rude there is no emotion at all....so i was told to take any table and off i went to the buffet you better be ready for chicken because thats the protien du jour one of the chicken dishes was quite tasty the other tandori was dry the spinich dish was good along w/the naan the food was not bad but when i paid it was 11$ a bit pricey....no...alot pricy for the selection of dishes.....maybe there dinners are better but i most likly wont return to find out", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 2, "date": "2009-08-06", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "hIWlVkf-N1Yzj7I-dfF7qA", "review_id": "eVPffwr-SO2ctH3ASDSobQ", "text": "Avoid the lunch buffet.  Excellent Chicken Tikka Masala.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2009-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_oNqrg69OsmK8gNaqew7hQ", "review_id": "N-I4tbeT08rcEyeJBtAsYw", "text": "Tasty and reasonably priced food and beer. A little hard to park but worth the maneuvering. And they have a rocking grocery store attached to it so you can make your own!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2010-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1g8Crb6WGQUsA2l2X3yVGA", "review_id": "xOdvKSQs35nZKQSaEJRVDA", "text": "As good as it gets.... I went there years ago and never went back.... My stepson's girlfriend took us there and we absolutely loved it.... Being of Indian Punjabi origin, yes I am very picky and finicky about my tandoori food. This was fab.... It was like being in Delhi.... Really....", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2010-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_EfzVg1nt_dWCYgpcgn9BQ", "review_id": "7P_heIlU9uY7XXgq_1weKQ", "text": "So I had a toothache.  Heard that clover oil worked.  This lead my search for a local ethnic store and I voila: The Indian Delhi Palace.  They actually have a small grocery store attached to the restaurant.\n\nAs I entered the restaurant my world was curry.  My toothache disappeared and I wanted to sit down and grub. \n\nBeautiful decor:  Very Indian, nice table sets and even nicer glass goblets and interesting utensils.  \n\nService was excellent.  The curry chicken was DELISH.  Everything is A la carte.  So be prepared to pay for rice as a side dish.  \n\nI could've sworn the mango drink was freshly made.  Great companion to the spicy dish.  Ah the sweet and spicy.\n\nBetween my date and I everything came up to about 30 bucks. \n\nIf we had came in just an hour earlier it would've been 20 because of the buffet.  Oh well next time.  And there will be a next time.\n\nCheck out the grocery store as well.  They cater to those who want to prepare their own Indian variations.\n\nMy hunny promises he will be my guinea pig.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2010-08-21", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "Ry48Bta6spNowOkiMNC_xg", "review_id": "_EuK618cCd0g7prFHdGdJA", "text": "Lunch at the Dal House\n\nFor the ignorant, like me, there's a small plate for one or all of the several salads, a large plate for the entrees, and small bowl for the desserts.  Those tiny salad plates get full of everything fast.\n\nMy favorite feature - the store in the east end of the building.  I want to go back and pick upf a little henna for my Friday night henna painting parties and some of the foods that made my mouth water, for instance, cilartro and ginger.  \n\nYou can have lunch however you like.  Spicy or not hot, meat or veggie.  Delhi Palace serves a good lunch buffet.  Speaking of service, I hate to whine and I realize it was a Lunch buffet, but I felt forgotten more than once.  It was one of three reasons.  My server was either a new hire or the bosses son, or human beings of the SIkh persuasion focus on service to humankind.  I got the bosses son.  My tough naan came in the middle of the meal while people around me were breaded while in the buffet line.  My ice tea was almost forgotten.\n\nThis place has beautiful decor.  A romantic place for a darkened corner meal for you and that special someone who loves Indian food.  You could curry up some real heat in this place.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2011-06-15", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "A7q0D5K9DLN47e284rAYGg", "review_id": "RjDVKwZHl_QtQRc42bvyVQ", "text": "Some the best Indian food in the valley. I am reluctant to give five star on any place, always being the explorer, but I would go 4 1/2 because there is not damn TV and the atmosphere is excellent", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2011-07-20", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bir11D2hYWIHk8aAHAUfPA", "review_id": "nJoDrp0hMu8uN07Xqp7-Tg", "text": "Excellent food, very authentic. We love the garlic naan and every main dish we have ever ordered have been flavorful and delicious.  We like the fact that each of us can order our own degree of spiciness.  The atmosphere is charming and the service has always been warm and friendly. We highly recommend the Indian Delhi Palace.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2011-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "h3TnHCqFga0VgPO390PjKA", "review_id": "TYhulrSMMjk-EQzAmSuKtg", "text": "I like. I don't get over here that often, but when I do, I always have a good meal. With restaurants that vary their spice levels according to your taste, it's always nice when you find one where your medium hot corresponds to their medium hot and so on. Too many times I've ordered 4/5 for spicy and gotten a 2/5 of 6/5 (yes, that's a thing that can happen). Their naan is delicious, always served hot and fresh baked. The Madras Shrimp are great if you can take the heat, if not, the butter chicken is everything butter chicken should be. Mango kulfi for dessert! Or gulab jamun, as fun to say as it is to eat.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2012-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "TR39Z_41pR680CaLye-aXA", "review_id": "tsLno1jU2tZ8e9dEya-jOw", "text": "Food is always great and the service is very attentive... We'll go back another day.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2012-07-18", "type": "review"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "2KNPtV5E44vAiEr5BvMkUA", "review_id": "R0s4THo61RA5xbEsAp5drA", "text": "One word... CHICKEN TIKKA MASALA!\n\nOk...it's one word if you say it like I do. I like to say it fast so I can hurry up and get past the ordering part and on to the eating part.\n\nThis place is awesome. I ordered samosas, garlic naan, mixed grill (tandoori oven cooked variety of meats) and chickentikkamasala *giggle*. The mixed grill was good, but the naan and the masala was the highlight. I had to slap the hubby's hands to keep him from eating the whole thing...ok...by 'slap' I mean I may or may not have skewered his fingers with the fork, pinned them to the table and gleefully devoured the tender saucy piece of chicken as he sniffled something about needing an ambulance...we're so playful. \n\nDISCLAIMER: *No hubbies were actually harmed or manhandled before, during, or after the consumption of the delicious items procured from I.D.P. The improvised narrative describing the dinner-eating portion is fictional...the tastiness of the items we ordered is factual.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2012-07-25", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "ZKo18Z7ardK2O-UkwqvKxA", "review_id": "w_5AFC7zxv8X5A7kCriCEQ", "text": "Excellent food, great staff - it's family run.  Good atmosphere.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2012-08-06", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "zGz5NI4sscO4_6YYH-qVtA", "review_id": "kg1GO6smFjhng6IoIYVNkQ", "text": "Haven't been here in ages, but went with a friend on Sunday.\nThe weekend buffet is when to go -- more items than weekday.\nI would give this place 5 stars if it had a few more items, but all the dishes are good! Nice atmosphere, nice tables, and attentive service.\nI'm actually awarding 4 1/2 stars.\n\nMy inside skinny: \nThe carmelized onions with the tandoori chicken are yummy!\nThey also have a goat dish that's very good ---- WATCH OUT FOR BONES, CHEW CAREFULLY. Sometimes the bones are obvious, sometimes small.\n\nThis is one of the best Indian restaurants in the PHX valley, and they have awards on the wall to prove it. I'm not the only one saying this. I think there are only a few places in the valley for Indian food for me (but I haven't been to every one in the valley) -- this place, The Dhaba in Tempe on Apache, and one other that has a great buffet but I haven't been there in years because it's far away. Somewhere in Mesa perhaps?", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2012-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_58L-OEjsLOtI3LIUpbZHg", "review_id": "9yI3cfKS61rOymR74uNNxA", "text": "Had the Sunday buffet which had quite a spread much of which tasted just fine. Three different types of desserts. The samosas were not kept warm which was a bummer. I also should not have to ask to have my water filled or wait some time for plates to be cleared. Service was not as attentive as I would like but the food was pretty good.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2013-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "A-yR4oTFKmDVnegSyVur1Q", "review_id": "VxM4lzZFPfVQnlhza4q_UQ", "text": "As I'm crusin' from PHX airport to my hotel, I randomly see a sign for this Indian restaurant and immediately hit the brakes and make a U-turn to stop in for lunch!  I had my doubts, really I did.  I don't ever do Indian buffets because its guaranteed to disappoint me so I opted for the regular menu.  Delicious shrimp madras is what I got (extra spicy) and garlic naan...yummy, yum, YUM!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2013-06-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "M6oU3OBf_E6gqlfkLGlStQ", "review_id": "FqqXjKNpKrcfsfV3JAyAeA", "text": "Good flavors, good service, Interesting dishes odd pakora.\n\nWalk in and you will see nicly set tables with table cloths and cloth napkins. There is a buffet with plates behind. This makes it a bit confusing as to which end to start at.\n\nI started with some pakoa and mint chutney. The pakoa was the low point of my meal as it was oddly hard as if it were fried twice.\n\nMoving on the the food at least the veg items. There was a Palak dish which had great spice as well as some cabbage dish that was miss labeled  and full of great flavor and textures I went back for more. The chana masala was also quite good spiked with many fresh veggies in sauce. \n\nI am a big fan of their naan bread, it tasted as if it was made in a fire tandori, it really complemented the meal.\n\nIf you are in this area of town give it a try.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2013-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "u_ecQBLnT9I1183SMCstaw", "review_id": "WK4q_zfFe23qE0j_-Ev2xw", "text": "we discovered this place while wanting to meet up with some friends on a friday after work. the actuall resturaunt looks great but the location is in a rough neighbor hood in ph. the food was great i'd definetly go back for the shrip curry ... the one negative.. i didn't appreciete the waitors smug comment about how much food we were ordering... last i checked we were paying for it so i think we can order as much as we want.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2013-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "98wn8JhJ08goRq1EFm_DFA", "review_id": "qizM3i1r0uxpBeYvzvlQFw", "text": "Based on the reviews went here for Lunch, they had Buffet with one Meat and 3-4 vegetarian dishes for around $10. \nTried palak paneer but the paneer(cheese) itself  was missing the dish, it was like having chicken curry without chicken. Long story short the food lacked the taste that you find in good Indian cuisine...", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 1, "date": "2013-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "hECLdMisz3esNaUpPTGxfA", "review_id": "Vq-fNE60yx8rUAE7usU_zQ", "text": "I've been here twice on trips to Scottsdale and the food is pretty good, but the service is terrible! \nThe waitstaff is not attentive or helpful in the slightest! For the price, I would expect better service. The lunch buffet is better than dinner because you don't have to rely in the waitstaff.\nThey seem to have a fly problem, flies kept landing on my food, my face, and one got stuck in my water.\nIf you've got endless time to wait for you food and can handle a waitstaff that acts like they have better things to do, then this is the spot for you!\nOtherwise, go elsewhere.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 2, "date": "2013-08-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sfnf-luT6Ptra-5-SBfyGg", "review_id": "fAwZlSBwYh_XhQQ0PG96KQ", "text": "Needed a spot close to the airport. After reading reviews was skeptical but since we were going early gave it a shot. The food was fabulous and the big shocker was the service was excellent! Many reviews found the service horrible. We were very happy with our meal here and would return.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2014-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "idOT0D1sMQQL7qmjpoIxAA", "review_id": "nBo0VIY4t3OIYDftH_nrkg", "text": "Been here almost a dozen times. Good service. Open later than a lot of Phoenix restaurants.  Never crowded or noisy.  We are always trying something different and have never been unsatisfied.  Every dish is full of  intense flavor.  A must try!!!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2014-06-24", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UMW8ADMdzQcvfwwe-Mdq1A", "review_id": "ppA9BetA27OPJB92BixeIQ", "text": "Yes I would say this place is good. Service a little slow maybe but the quality of the food was very good. Nice atmosphere.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2014-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zu3Z0V-58GFJ4Huftntv8Q", "review_id": "armlCxpHBveG3pQbSZ41dA", "text": "Stopped in for lunch on a weekday.  Service was excellent in giving advice on what is popular and what we might enjoy, they were spot on. Food was delicious and timely. I'll gladly be going back.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2014-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "eJvpf8Z2xLY4kCwdRSDP4w", "review_id": "7Cxy08SGEFOZjwhyjO7PrA", "text": "For those who have come here and ordered anything lower than 7 on the spiciness scale, you shouldn't be eating Indian food in the first place. The Chinese buffet is down the road. \n\nThat aside, my boyfriend and I have been here twice and have been blown away both times. We order the samosas, lamb vindaloo, chicken tiki masala, a veggie dish I can't remember the name of, garlic naan, and basmati. The first time we ordered a spice level of 8 and the second time 9. I'd prefer somewhere in between. \n\nThe food makes it to the table quickly and is full of flavor. The two times we've been there for dinner, the service has been friendly and attentive, so I'm confused by the yelpers who bag on the wait staff.  We spent about 50 dollars on a ton of food (half is in the fridge to be enjoyed tomorrow as well) and it's always worth it. \n\nThere's also a small market with a wide selection of authentic spices, marinades, chutneys and other ingredients so you can attempt to cook Indian at home.\n\nWe crave this restaurant constantly and would recommend it to anyone who thinks they know good Indian food!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2014-08-13", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nL4QufiB7bmRrP-oV14L4Q", "review_id": "HOjLU_N6lYzTu-DdYHkidw", "text": "My first time at this restaurant was on a bad date.  I didn't drive at the time and since we were meeting at the restaurant, I took the bus and walked for about half an hour in the summer heat to get to the restaurant.  By then, my date had taken the liberty to order my meal.  The entree itself was a little pricey but scrumptious even with the terrible company.  (Might I add that he even asked if he could take my leftovers home.  Seriously, what?)\n\nAnyway, since then I've been back way more times than I could count - with much better company.  Generally, I go for their weekend buffet which at $10ish per person, I say is a pretty damn good deal.  They don't have a huge spread for their buffet, but their items do not disappoint.  Their chicken tikka masala is by far my favorite item there, and goes perfect with the rice or the naan they bring to your table.  The fried vegetable fritters are amazing and I'm always a sucker for their desserts, especially these things that resemble donut holes but are drowned in syrup.\n\nOh and be forewarned (and this isn't at all a bad thing) that you might fall into a food coma after this buffet, so plan to get a cup of coffee or some other less sedentary activity so you don't immediately pass out the moment you reach home.  Trust me, I've fallen into that trap too many times, even when I thought I ate less than before.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 4, "date": "2014-08-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3TsQF2dqHncZMi-VA4pFPQ", "review_id": "vCjWQOHVJ8kHdeLBm5dEmQ", "text": "We were here for their lunch buffet. The chicken tendori? was very tender. Coconut dessert was good. Everything was bit too salty.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2014-08-28", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "jCq_2CuPW8bU_hGctRmUDQ", "review_id": "UzRUsdYdj3NaYVVQfb8iQA", "text": "I had the chicken korma. It's was very good. It just reminded me that I don't have Indian food nearly enough. It is always so flavorful and good. \n\nService was good and prices were reasonable.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2015-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qOsfwkrizljHP3HDfiDLyQ", "review_id": "xv23ucoidTYPdeWG-8ZDVg", "text": "I haven't eaten a lot of Indian food so when I cam across this place on yelp, I was like cool, they have a buffet. Let's see what this is about. I went for lunch, it was like eleven dollars. The decor was nice but the food, not so such. It was okay, flavor wise but the buffet was small. There wasn't much to choose from and what was there was kinda old, looks like it was sitting out for a while. I basically just at the chicken Marsala and rice, which I enjoyed. Everything else just looked unappetizing due to the presentation. Maybe they do a better job for dinner, I don't know.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 1, "date": "2015-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "iLpa3WcoQc50Pj0iAzQt2w", "review_id": "ZQACtgDPJryIC9g7UJU5uQ", "text": "Had a craving for Indian food in the area and decided to try this place out. The ambiance was very Indian-themed and provided a nice environment. The host and the staff were inviting and friendly but not talkative, which was perfectly fine.\n\nAs for the food, I had the lunch buffet which included a sampling of the goat korma, aloo matar, tandoori chicken, and chicken tikka masala. They also provided a fresh piece of buttered naan bread on the side which was good but not amazing as it was a bit doughy than how I usually have had my naan. The chicken tikka masala was good but the chicken was slightly dry. The tandoori chicken was great as it was flavorful and moist. The goat korma was decent, as it was pretty similar to the lamb korma's that i have had before. The aloo matar was also very tasty.\n\nOverall the meal was enjoyable and the buffet was quite fresh as none of the dishes tasted old (I cannot say the same about copper kettle's buffet). The price is reasonable a for the amount of food.\n\nAs for comparisons, I believe The Dhaba is better quality and flavor wise but they don't have buffets and they are pricier than most Indian restaurants. Copper Kettle had better naan but this place has them beat in freshness and cleanliness.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2015-06-28", "type": "review"}
{"votes": {"funny": 5, "useful": 4, "cool": 3}, "user_id": "Z-TW_TppnxT4TkFeavNaQw", "review_id": "qj9CcYpf_tdGoLonGvSMFA", "text": "This place was absolutely loaded with flies.  That almost made me leave.  But we totally loved the food. The chicken tikka masala and the tandoor chicken were off the hook. The garlic naan was fantastic.  As a result, this is our new favorite place for take out.  No flies that way...they were the most aggressive flies I've ever seen.  They had no problem getting right up on us and after the food", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2015-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j7xDae0R0b1JM22XQrGTUQ", "review_id": "ss-mNKzhW5oklni0DTwCrw", "text": "Simply fantastic. A buffet every day!  A great way to get even with otherwise high prices. \nThe food is delicious. Prepared with live. \nAlways a variety and taste freshly prepared. \n The folks are warm and friendly. Service with a smile makes dinning all the better. \nConsistently great eating. Yummmm!", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 5, "date": "2015-08-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1ZBEYNkb43eK4KaJFI_i-g", "review_id": "OIB-I4Qj9IIm19XL7t8_4Q", "text": "It is probably the best Indian food I have tasted in the Phoenix metro area. However, I have not been to many establishment since relocating. Indian food was more accessible in the Washington DC area. \n\nThe place is clean, and the buffett options were limited, however, they went straight for the staples. Rice, Tikka Chicken Masala Chicken, Paneer, Pakoras, and a few other items. I will consider this place every few months. Its not my go-to spot.", "business_id": "_RBUU1y4yJrK0SPAd8z0-w", "stars": 3, "date": "2015-08-19", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "9KHQDPM5M7sHUTUSBboNgg", "review_id": "MF2ZOGpm43zXL911UeY1CA", "text": "Now this comes from a foodie Indian..The management just changed...and the food got worse. The food got worse but the service got a little better than earlier. The butter chicken is way off and was sweet and the Buffet wasn't that impressive. Although,I would recommend you go there for the buffet, because of the varieties offered.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 2, "date": "2007-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Bwo_j9OGpZN60T5HxKOTeA", "review_id": "a6bIk3RG2tt2fVw9iyHgmw", "text": "Lunch is a great deal at Flavors of India: buffet style with an excellent variety of food. Dinner is more expensive. Their food is very good except for anything with beef in it. Honestly, you can't expect a culture that believes cows are sacred to know how to cook beef for American diners. Theirs is boiled to the texture of tough shoe leather every time. So, avoid the beef. Everything else is delicious and you can't go wrong.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2009-06-27", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 3}, "user_id": "b9XdpPlzZCVimhNb0z8CNA", "review_id": "skammzN3vlO4q0k9Wy7nPA", "text": "I have to start out this review by saying I never had Indian food before I ate here, so I didn't feel I could give it a fair review until I tried a few others around town first.  Well, now that I have, I have to say that \"Flavors Of India\" is the best Indian Food in Phoenix, bar none!\n\nFirst off, when you walk into an ethnic food restaurant, and the place is filled with people of the same ethnicity, and the place is really quiet because everyone is busy enjoying their food, you know it's a good place to eat.  \n\nIs it a bad thing when the host/manager recognizes you when you walk in... and remembers your order?  You'd think we eat there a lot or something.  I've found my favorite dish is the Chicken Tikka Masala, medium spicy and if you like shrimp, the Shrimp Tikka Masala is just as yummy!  We usually order a side of the Paneer Kulcha (unleavened bread stuffed with Indian style cheese), which is wonderful to sop up the extra yummy sauce after you are finished.  Portion sizes don't appear to be too large, but we always have leftovers.  And it's always better the second day too!\n\nThe service is top notch, the food is excellent, and the best part of the dining experience is the Bollywood music videos playing on the flat screen!  Dinner and Entertainment all in one!  FTW!!!  I can't wait to go back!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2009-07-12", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "LB7HoDg61yWP2CjrueeJUQ", "review_id": "RTSQgNYkD5he8JdmfP8KuA", "text": "I try to judge a place by how good it is at what IT does and what they do they do well here. In terms of quick and affordable buffet Indian eateries they seem to have it down. \n\nI work in the area and often need a break from the Biltmore and Esplanade fare. When I head over here I tell the guys in the office and I always have a couple jump to go with me. The guests' first reaction is the same every time; we pull into the strip mall and skeptically get out eyeing the place which is unassuming on the outside to say the least. We open the door and walk in and you get the inevitable, \"Wow it smells good in here\". You are shown your table and asked for your drink order and then asked to help your self. You will find 8-10 entree dishes + salads, chutney and desert waiting for you that has all been consistently fresh hot, well prepared and thankfully light on the heavy cream that all Indian places pour into every dish to make the, um... crackers eat exotic foods. They bring fresh Naan bread (included) to your table and have a full menu available as well. \n\nThe place is owner run and they are polite and attentive. Indian movie dance scenes run the background on a TV set a volume that does not interfere with your conversation and you can get in and out quick between meetings if you need to. Your guests who picked carefully on their first trip return to the table with a second, full, plate and eat until they complain they ate too much because it was so good. Lunch for 2 with iced-tea is about $22 - quite deal as well.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2009-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "GjYhx_UBsndqJ5O0P7y3cw", "review_id": "yocR8nKsKvvhXkqDQGUHyg", "text": "This is my new favorite Indian restaurant.  Anywhere.  I had the lunch buffet, which was delicious, and after that I have mostly ordered Palak Paneer with naan and rice.  Their's is fantastic!  So delicious!\n\nI love this place because it tastes so good, and because it is close to home, but the reason this place stands out among its peers is the service.  This place has really, really good service by any standard.  Waters get refilled promptly, waiters are helpful.  Orders are accurate and the staff is really friendly.  \n\nYay!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2009-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "0JC7aBkxhV8by4iVGCU5Wg", "review_id": "_zmYkf8WziDDAbr_0tOSRg", "text": "When I lived in Phoenix this was the favorite destination for Buffet of anyplace in town. Always economical and delicious. Reasonably good service and air conditioned. The dining room can be quiet and intimate when the place isn't in buffet mode and is reasonable for a date.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2009-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gcyEUr4DXcbjnGRAWFtfAQ", "review_id": "hVaiH5vtRHABEJq-N86slA", "text": "so the wife and I love to get Indian buffet at this place. The food is always fresh, the service is always good and BONUS*** They always play those Indian music videos with everybody dancing!!!  \n\nI prefer doing the buffet thing because I only know a few dishes that I like. It's about $10 a person, and you will not leave hungry. The Tandoori chicken here is the best I've ever had and they have plenty of vegetarian dishes, if that's your bag. I sometimes get buffet takeout, and eat Indian food all day for about $10. If your looking for some good Indian food or never tried it and are looking for some variety, this is the place!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2010-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UDBHTE-ynXC1bdmxtErvZQ", "review_id": "-uUDMj7GqD41jz85EDJrVA", "text": "Recently got take out (chicken kadai and onion kulcha) and was a little disappointed. The meat was a bit fatty which is not OK!!! And, while this is supposed to be a spicier dish, which I would normally love, I found it to be spicy but not entirely flavorful. The onion kulcha was fine. Considering it's proximity to my apartment I may check it out again (perhaps stay away from the meat)?", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2010-08-07", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y_ZITL9cYCKgBgDCwUQrow", "review_id": "3UvVKx-DAJNFPbWb1F4Whg", "text": "I have been here a few times, but mainly at dinner.  Dinner Has always been great, great waiters and staff, with a LCD TV playing almost famous famous bolywood movies.  LOL  It cracks me up when they dance.....LOL...anyhow, Great vegetarian choices for people who eat there veggies, but trust me, I am a MEAT eater,  Chicekn Tika masala, Little dry but still good.  My favorite is there Palak Paneer. Great for the vegetarian.  I have also tried there lunch Buffet for 11.00.  I give a Thumbs up..  Good, serve yourself, and pig out!!!!!!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2011-08-07", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "fPHLPrymsyb6WSFFKoMrTQ", "review_id": "Ke9URuDN373Gu4oUmnEi3Q", "text": "Flavors of India serves up a decent lunch buffet.  I've been there a couple of times though and it seems some days, the food is better than others.  Also, I wish they offered a bit more selection.  I've teetering between a 3 and 4 star but because of the reasonable price and friendly service, I'm bumping up to a 4 star.  I'll have to go again to make a final decision. \n\nSee ya there!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2011-08-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QAIlJ9oEgCsKUQmfl6PH5g", "review_id": "tQl6oe51DVYaKYborXq8HQ", "text": "I love Indian food although I cannot eat it everyday since the spices and my stomach don't get along very well. But when I do get my monthly Indian fix it better be good taking into consideration the next couple of won't be pleasant for me. Flavors of India does the trick for me and their food and flavors are awesome and unique.  Keep up the good work guys.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2011-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WBth5OOvugUKkLHJme_JrQ", "review_id": "EMjq8wzvFbZOAw3kQaUEdw", "text": "Been into Indian food lately, a friend suggested this place..i was skeptical because its hard to find good indian food places..however once i tasted the food i was delighted, i have finally found my favorite indian restaurant in Phoenix. The food is very flavorful & rich..", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2012-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "p4SNP70HYUpK_wXhRpIcFQ", "review_id": "f_0pZWupvbOntEwTXRrcdQ", "text": "This was the Indian restaurant I would often frequent when I lived in Phoenix. The three stars I give this place reflects my mixed feelings about it. I tend to gravitate to Indian restaurants that offer excellent lunch buffets, as it gives you the opportunity to sample multiple dishes. The buffet offered at Flavors of India is just okay, but often a little on the bland side. I do enjoy their samosas, vegetable pakoras, and tandoori chicken, but most of the entrees offered at the buffet are underwhelming. The story changes, however, when you order items from the menu and ask for them on the spicy side. Their mutter paneer and aloo gobi are excellent and nicely spiced. My personal favorite here is the baigan bharta, which is spicy fire-roasted eggplant with onions and peas. The taste of it is just out of this world. This is a great place for take-out, where you can order items to your specifications.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2012-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1H63by0ymeX_lDybScYJsA", "review_id": "FRnPBu46L7KbUZEfahEO3A", "text": "Being an Indian i would definitely know what Indian food should taste like, and this one is no way near to the original, Young guy is the son of the actual owner (who is nice guy) is extremely ill-behaved,  gravy we ordered was full of water and tasted like crap. First learn to talk decently with your own country men, later comes serving good  food.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 1, "date": "2012-07-06", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "R-cydGC72RYuOZ1noWGxlA", "review_id": "UyC1ysONee5v1bCBoMMqJg", "text": "These one star reviews don't ring true to me and my wife. We LOVE this place.\n\nGreat service and food, period. It's a little pricey, but not horrible.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2012-07-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SfOq7kTmpUJs5bqcrmapRw", "review_id": "6QcU3FWAMA_AMZldU-edJQ", "text": "Absolutely the best in Phoenix - my opinion. \n\nTry the yellow Dal, Chicken Biryani and Aloo Mutter in medium. \n\nYou can thank me later!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2014-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "D5MMGcBvh7Ljd06JLtFW-g", "review_id": "Gf4SrtDwIc03FESIg6ilZQ", "text": "Always delicious! Lunch buffet is so yummy, fresh and full of choices (meat & veg). Dinner menu is hard to choose from due to the extensive variety. The chicken tikka Masala is rich and flavorful. Definitely a favorite. Garlic naan is also a must! The atmosphere is clean and open, and the wait staff are attentive and sweet. I lololove this restaurant!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2014-07-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qKqvVFP6PmxlS7-u0xjs3g", "review_id": "_OpQqLLh-jTm7T4_uAuOow", "text": "I've been eating here for years over multiple owners.  The service has always been good, lunch buffets fantastic! When I worked in the area I stopped in once a week for lunch or dinner and always had a very fresh and flavorful meal.\n\nGreat place to stop for good Indian food.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2014-08-09", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1lSFhUewKa22FwhXuVgFdw", "review_id": "9BaP53FcwjzTzk9kQ7u90g", "text": "I had a \"bogo\" from my credit card points and was looking for something other then the usual burger type restaurant to try out in Phoenix. Flavors of India popped up and I went with a friend. The decor was nice, service as well and the food ok but I was perhaps hoping for something a tad tastier. It's not located near me and therefore not one I would put on my \"let's drive to xyz\" for dinner but if you're in the neighborhood it's good enough to make it your \"local Indian restaurant\". Look forward to discovering more in the Valley and seeing if I was wrong in my first assumptions.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2014-08-10", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fZtZ_Mm5QmXspGer_d9sog", "review_id": "4tjVgQ4LcAPnzilkkQV53g", "text": "I have eaten here many times but I wasn't so impressed when I ate there for lunch the other day.  I guess the thing to remember about this place is to get there early.  If you don't, you will be waiting for food and nan.  My wife and I got there at 12:30 and every container was at the bottom or empty.  Asked the lady what was up and she said that everyone came in at once. Uhm, yeah, it is called a lunch rush.  Really pissed me off that she said that.  Waited for food and waited even longer for the nan.  Even though the service was really lacking this day, I will be back because the food is good.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 2, "date": "2014-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rFaALavcyel3yXa4wvoC4Q", "review_id": "SA9K1RpmIjMHB04SYVLBPQ", "text": "i come to your restaurnat and was nice feeling,", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2015-06-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AcROL2Z_NDN0QpkqztcA-g", "review_id": "Hfk3KScV6xhA9qXin8MYOg", "text": "First off I enjoy this place because they do a Buffett during the day for $10 plus tax. I have only had the diner service and it is 15-20$ per person. We shared 2 entres and had naan. Everything was great good flavors here and pretty much in par with other restaurants. Maybe they could include the cost of rice instead of charging extra? Maybe some people don't eat rice with there meal but most of us do. Anyway next time I'm back will be for the Buffett :) good price...", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2015-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "dfFeR2ZCtFt8dPEitZLQ9g", "review_id": "hbMK7gX5oeSfhgyrDPyLkA", "text": "Substandard at best. Garlic Nan was a regular nan, and out of the 4 pieces, 2 were like hockey pucks. Of course I was charged for the garlic nan. Won't be back!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 2, "date": "2015-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AaZd1lrLiQ49-VSnqswrrA", "review_id": "icjsj3e_Ub20kf37elS6_w", "text": "Excellent and fresh food. I ordered the chicken curry medium hot. Mind you, India and Pakistani food medium (hot) is Hot! Goodness gracious. The curry cleared up my sinuses for sure. Next time, I will order mild. Other than that my food order was good.\n\nAlso the customer service was excellent and friendly. Great customer service at any establishment is super important to me. In addition, the delivery of my food order came out in adequate time! Something any customer can appreciate. \n\nThe only things I didn't like about the establishment, is, it needs a renovation and/or makeover. The resturant's decorations appeared 1990ish! \n\nKey B's Recommendation: To appreciate good customer service. Also prompt delivery of ordered food. Desire to eat something different, I recommend the Taste of India!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2015-06-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pNLmiYbQ1owDOV15fliUGg", "review_id": "GgWmiBVTumGNtxhOwVTEgg", "text": "I have never had anything here that was not excellent. The staff is friendly. The atmosphere is great. There is something for everyone and the food is not too spicy if you do not want it to be.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2015-07-15", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GnTuA6khkDdtvy1Aj-paiA", "review_id": "0wRCN2PsMuzy1-GsohZhNg", "text": "Not bad for lunch buffet.  Limited options. The sag chicken was quite good. Rice pudding had a different spice to it. Not sure I loved it. The chicken Makhani was good. Found the mushroom mutter to be a surprise. Nice and spicy. Tasty.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2015-07-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "i0vcHqpCSu6Nv5e0TR-Fcg", "review_id": "LMRH5ShuV05mURQ0gNq3PQ", "text": "I had a very good dinner here but the subsequent lunch buffet left something to be desired. Just the most of those were very dry. Also I was in a rush and even though I had not gone back for seconds when I asked if I could take a to go box I was categorically refused which did not leave a great impression with me", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 3, "date": "2015-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qA2bpjEKbOMGkseygB5yfQ", "review_id": "dKPJTp6LqZDEtmhRHv62ow", "text": "Great food, and excellent service as always! This place is always so welcoming and friendly.  They always take great care of their customers to make sure everything is perfect!", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2015-07-31", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FsirPxL_YFlkQN9r10Qf1w", "review_id": "LqOoTpGBfZdjar2XJQJUlg", "text": "I really never cared much for food of India until my friend invited me to go and eat at this wonderful place I tasted the food it was a high quality food for a very affordable price that food is out of this world the only Indian restaurant I really would go to most of the time or invite friends is flavors of India the best I highly recommend this wonderful restaurant you won't be disappointed I know I wasn't disappointed", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2015-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QE_Swh76QFdzRQpYf2Jz3Q", "review_id": "vraHVGJIa42-piJYTwuQVA", "text": "Not happy with this restaurant at all. Placed an order for take-out, and every single dish had an issue. We ordered paneer & potato masalas and palak aloo. Unfortunately, the best part of our meal was the plain basmati rice. Our masalas were made with the most disgusting over-microwaved potatoes I have ever consumed. The sauce was pretty good, but a little too sweet and since the potatoes were rubbery, tough and dark, it made it difficult to eat. The palak was even worse. We had to keep removing some ingredient that was woody and fibrous from the sauce. It was under salted, extremely bitter and tasted more like ginger and cream rather than spinach. I love ginger, but this was so overwhelmingly bad. For some odd reason, the potatoes in our palak were not microwaved like the masala was. I know that the paneer & potato masala is not on their menu, but I'd much rather them say that they cannot make it rather than give me something so awful. I'd expect so much better after paying $60 bucks. Sucks since this is the closest Indian restaurant by far. I'll just have to drive the distance next time. Boo.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 1, "date": "2015-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "G_8mzb8qikrDSV78MDYPiQ", "review_id": "VMkXJbM3F5cBPD29ZeFXwA", "text": "Ordered take out so I cannot say anything about the service. I got chicken tikka masala, vegetable pakora, garlic naan, and side of raita. \n\nChicken tikka masala was delicious---especially for here in Phoenix. It's hard to find good Indian food around here. This is the best in the surrounding area. \n\nVegetable pakora was pretty good. \n\nGarlic naan was a bit soggy. Could be better if you ordered it in house.  \n\nRaita was flavorless---I'm from Chicago so I've had some really good ones. Wasn't bad. Just not worth the money. Maybe ok if you need to cool down the spice in your meal but not if you're adding flavor. \n\nOverall would have given 5/5 if just judging on the chicken tikka masala, went down to 4 because of raita and naan.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 4, "date": "2015-08-22", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pNxzP47yVRPH0qwO4sSbAw", "review_id": "5yvvptbn2Jy9bTJaxKCzow", "text": "I said goodbye to a good friend over lunch at the best East Indian buffet in Phoenix, Flavors of India (4515 North 16th Street, Phoenix, AZ 85016). The buffet menu, which is known to change throughout the week, consisted of Basmati Rice, Tandori Chicken, Chicken Masala, Chicken Curry, various vegetable dishes containing spinach, lentils, potatoes, onion, fresh tomatoes and green beans, fried green chilies, mint chutney and Naan Bread. The menu items were served from traditional copper pots. This exquisitely flavorful lunch was capped off with fresh mango pudding and fried yogurt balls in cardamom-infused rice pudding for dessert. The staff provided exceptional service, even though the lunch was buffet style. The facilities were clean and presented an atmosphere of Indian culture. Parking was readily available.", "business_id": "LYyGQgL60VKdV-p_9OxmWQ", "stars": 5, "date": "2015-08-28", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "BsPxyog2Q55Imu-5Ed-Gmg", "review_id": "eBpmENujrvnzLYvgfWiSwg", "text": "The food here is good, but it didn't knock my socks off (or in this case my flip flops).  My group ordered quite a few dishes to share, I chose the Chicken Vindaloo and each dish was good but I've had better. They really don't do spicey very well, but I can take a lot of heat, so I guess it is all in perspective. The place is very clean, the staff is friendly, and their appetizers were fantastic.  I will probably come back, but there is no sense of urgency.", "business_id": "vA9aCw2kTgN8p2SLdm2mDA", "stars": 3, "date": "2009-06-23", "type": "review"}
{"votes": {"funny": 3, "useful": 1, "cool": 2}, "user_id": "5-2JHDnSsoSaoRKDHPeTtQ", "review_id": "19gP6AHX9nyVnW57H4A7Ww", "text": "The only reason I'm giving this place 2 stars instead of 1 is their naan bread was fantastic.\n\nI'm hungry and craving some Indian food, so I stop in.  I'd eaten here a few years ago and thought it was pretty good but not great.  So I go in and the lady at the counter who is none too welcoming tells me to go sit \"whereever\".  So I do, assuming she will bring me some water and then I'll go to the buffet.  But I'm sitting there for a while, about to just go to the buffet when she comes over and rudely says \"You can go get a plate.\"  I'm wondering if I've offended her in some way but as I haven't really said or done anything, I figure not.  As I go to fill up my plate, I (and the entire restaurant) hear her yelling into the kitchen and the tone was not friendly.  Someone yells back, also not in friendly or joking tones.\n\nNow, I look at the items in the buffet, and it looks pretty sparse.  Granted, the place hadn't just opened, it was after 1.  But still.  Rice, a chicken korma, a spinach dish, a vegetarian dish, maybe two sad pieces of tandoori chicken, no onions or lemon with in.  But, I figure, maybe they had a lunch rush and maybe I'm spoiled into having a larger variety.  I check out the \"salad\" part of the buffet, pretty standard stuff.  The food was very bland, even for me who doesn't like really spicy.  All the food seemed to have a similar flavor to it.  Then I tasted one of the relishes- bad idea- I had to spit it out it was so noxious.  I'm not even sure what it was,maybe something with olives (my husband is constantly amazed that I will eat things I don't recognize) but it was bad, bad, bad!  Inedible.  Heinous.\n\nAt this point, I'm really wishing the waitress/greeter would bring me the water I still haven't received so I can get this awful taste out of my mouth.  She comes over and I politely ask her for water and if the buffet comes with naan bread which I see other customers eating.  She says yes and stomps away.  She brings me water finally and a few minutes LATER I see her order some naan bread from the kitchen.  So I'm done with my meal and eventually she brings the bread, which, I will say right now, was outrageously good.  So good I'm considering going back even though the meal itself was pretty terrible and the service worse.  I go back to the buffet, convinced I've maybe missed something- like the really great milky tea or rice pudding some Indian buffets serve, but no.  I'm out of luck.  To top it off, I go over to pay, and I compliment the lady on the naan bread, to which she says nothing but tells me to wait there.  I wait while she and several others clean up the entire buffet!  After they are done, she comes over and does me the favor of letting me pay.  \n\nI couldn't really believe this experience, it was almost comical.  Like one of those restaurants where it's their \"thing\" to be rude to the patrons....well, I  will probably not be going back here even for the naan.", "business_id": "vA9aCw2kTgN8p2SLdm2mDA", "stars": 2, "date": "2010-06-05", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uiovo8vnijBz0i5tsA1mmw", "review_id": "XF3s-C_wRzEsXbUe7rPM0A", "text": "I'm an admitted Indian food neophyte, so take this review for what it's worth, but I did really enjoy the food at TOI.  Ok, so the server wasn't super \"warm and fuzzy\" and didn't slap on a ridiculously fake smile the entire time, but he got us what we ordered in a timely manner and was somewhat pleasant about it.  \n\nParking was abundant and the atmosphere was kitschy, but it was clean.  The portions did seem a bit small, but let's face it, Americans are used to wheelbarrow sized portions!  I definitely had enough to eat and it was really good.\n\nI would definitely make a return visit to TOI.", "business_id": "vA9aCw2kTgN8p2SLdm2mDA", "stars": 4, "date": "2011-07-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1RD8H1qiyWa0NkqcqaLhlQ", "review_id": "zKsTRG8kjmfdRLSkEljXIg", "text": "So sorry to see the recent sub par reviews. I frequented Taste of India from 00-06, and would have given them 5 stars for food, service, ambiance and selection of Indian beers. Bummer.", "business_id": "vA9aCw2kTgN8p2SLdm2mDA", "stars": 3, "date": "2011-08-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I_PrqJxL12Tf_8X0KBpI3Q", "review_id": "zgDyqRM5c3sxyp_YiqPUwA", "text": "I love this place and it's by far the best Indian food in the valley that we have found.  The owner is always there to greet you with a smile and you'll be amazed by how many of the patrons he knows personally.  \n\nThe dishes are wonderful with plenty of food to be taken home.  I would highly recommend this hidden gem of a restaurant.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2006-06-13", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Qp1AJD1cdTf7JVY9mXixBw", "review_id": "9xaECjk3h4YbGVlzTSYWwA", "text": "This small, dark restaurant is in the Ahwatukee area, in a shopping center with a Trader Joe's, Safeway, and other stores.  It is in the corner, on the same side of the shopping center as the Trader Joe's.\n\nWe go here periodically because they have decent food, and I like the staff - very friendly.  It's nice to get some saag paneer (great texture, fluffy & creamy - try it) for take-out.  They use canola oil, which saddens me, as I like ghee (I like my saturated fats & olive oil more than certain vegetable oils).  You can get decently spicy food here (that's \"extremely HOT\" to some of you) or skip the heat entirely.  They use good spices and make good sauces.  They don't make the most awesome Indian food I have ever had, but it is good, hearty, and comforting.\n\nIt's a good place for children, if there is something on the menu yours like (and who doesn't like ras malai or rice pudding?).  It can be good for groups, but I would call ahead or make reservations (not sure if they take them).\n\nI appreciate how they gave me decaf tea & warm water (not just \"no ice\" water, but room temperature water) when I asked.\n\nRecommended: any of their tandoori dishes; a vegetable curry that may not be on the menu but comes as a side in one of the special dinners; saag paneer; mango lassi; their relishes.  I'm good with anything on the menu.  Try the lunch buffet.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2007-07-07", "type": "review"}
{"votes": {"funny": 3, "useful": 3, "cool": 3}, "user_id": "4UUIpbOTPmu43wuC2aSGkg", "review_id": "6HHrqne1BNj6S-OoeDf8eA", "text": "So I just got back from taking a solo trip over to Star of India.\n\nI was craving some comfort food, something simple, but yummy, something that would cheer me up on a cloudy day. Something that would make me feel less loser-ish because my lunch buddy had taken the day off and I had to eat solo....cha-ching... Star of India fit perfectly! \n\nI chose to do the buffet because it had everything that I liked. I don't claim to be an expert of Indian cuisine, but I love the sauces and gravies and the rich flavors that are used. \n\nThe naan was HOT and fluffy and I scooped up everything with it!\n\nLike I said, this place is nothing fancy, but it was clean and my waitress was friendly. Plus, it made me feel a little less loser-ish.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2008-07-14", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "DBCgOkxxF3AhSKDAqQcR7g", "review_id": "x1VuEJw4AJiufqqjf3zmRA", "text": "After going back a few times, I can say I love the chicken dishes but have always found the lamb to be fatty and tough. That and service varies... one waitress was pretty rude, wouldn't answer our questions and even asked \"are you sure you want to order that?\" Um... yes? Maybe? I don't know? Do I?!?!?!?", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2008-07-14", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 1}, "user_id": "8cJ-n5BEb1LAR0qFM9zrxg", "review_id": "2-_dWswSNrC8_gxDc-4zNA", "text": "Revisited this place right at 5:00 when they open for dinner. They seemed a bit unprepared, like all the staff had not arrived. So, for the first 15-20 minutes we had what seemed like a \"fill-in\" server who did not know the menu.\n\nI was all good though... had the Chicken Saag. It was fan-tastic. My parents ordered other dishes and we split two orders of naan among us. They pimp drinks here a lot--must be a high margin item for them. The only disappointing thing about the saag was that I asked for it spicy and it was not spicy. I mean it was Cleveland spicy, not Punjab spicy.\n\nAs an aside, this place is always good for people-watching. We had the pretentious neo-hippies next to us who couldn't be bothered to have their children sit down to eat, lest their creativity be stifled.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 4, "date": "2010-06-23", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "LXWAXIeYFIdgd2JVPF-9qA", "review_id": "6hfJkOJ9WvNWiydtWKWw6Q", "text": "I have been by this spot many times and I needed a place to eat lunch so I stopped in... I entered the restaurant and was seated right away. But then I sat there for a good 10 minutes and watched the workers walk around  then I got to see the owners little kid decide she was going to sit with the consumers in the booth a head of me... Then the kid started crying and it just does not need to happen I was kind of shocked please leave your kids at home if they are not working at the restaurant.  I ended up getting up and asking the staff if I could just get the lunch buffet. I got a bit of everything to try I enjoyed the rice and the chicken dishes... The fish dishes on the other hand not so good the fish puffs were cold and not good and the one fish dish super fishy tasteing. The bread was really good that came with the meal... So all in all I would say I will not be going back anytime soon nothing to write home about.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 3, "date": "2011-06-19", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "T_if8B9EQVI6vP1u24PafQ", "review_id": "pgsTM6P1LjzGjl4A60LRzA", "text": "This is the second best Indian buffet I have ever been to (behind Mayouri of Bellevue WA). While the actually buffet only has about 10-14 dishes, each one is really great! Service was good too)", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2011-07-12", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "kIuPlXoAZjDzb97jYFketQ", "review_id": "Ba5HOTdNI_OCWjsQNBl47w", "text": "I'm really surprised at all the good reviews of this place. We have been trying to find a good Indian place in the area and chose here because of the good reviews. The bottom line is that all of the food was extremely bland. We got the vegetable samosa,  shrimp vindaloo, Bangan Bhartha, and garlic naan. The vegetable samosa's crust was very hard and didn't flake off like I'm used to, the filling was average (this was the best tasting thing we got). The shrimp vindaloo was in a very watery bland sauce that reminded me of italian tomato sauce. The Bangan Bhartha was just unbelievably bland. The atmosphere of the place was not bad and the service was pretty good. I didn't even want to keep eating after the first couple of bites.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 1, "date": "2012-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "bgj6OYutYN25iFOs5yLh4g", "review_id": "ld0AdVszJdY1tmPVCkyObw", "text": "I returned to Star of India last night for the third and final time. I had a Groupon and hoped that maybe they would have gotten their act together since the last time I was there about a year ago. Nope. The service is still lousy. It took 40 minutes to get served two very standard dishes - tandoori chicken and the baingan bharta. So nothing fancy, no fish that had to be specially cooked, no changes to the recipe. A couple who came in after us was served 15 minutes before us. The tandoori chicken did not taste like tandoori and was just covered in onions (probably 2 onions) and the baingan bharta was bland. I had half a dish left and didn't want to take it home. I won't be back.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 2, "date": "2012-06-06", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "BFzp34CongI8FAnFrC4WNA", "review_id": "rYVdtS5JEJSP0KJFz5iZEQ", "text": "My wife and I love Indian food. We've tried every Indian restaurant in the Ahwatukee area, and this is our favorite. When you come, remember that this place is family owned and operated; it's not a chain with five bussers and six servers running around. For that reason, service is not as quick as Chile's or Outback. \n\nThe food is authentic, fresh, and the restaurant aims to please. The owner always comes by and greets us, and if there's anything wrong they fix it immediately. The prices are fair, not cheap or expensive. \n\nFor best results, order a la carte expecting to share each item. A curry or two, some samosas, and a meat or veggie entree will be more than enough for a couple, and you'll come away with about a $40 bill. There's also a Groupon out there right now, $12 for $24 I believe.  \n\nGood for: Foodees, couples looking for something different, casual meals, and a weekday night out.\n\nBad for: Snobs.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2012-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "xyWUirftVkipMmUIBp-yVg", "review_id": "qyPytsmXBqYVrypONlhiTQ", "text": "I don't understand how people can like this place.  Maybe I'm spoiled from growing up with fresh Indian food daily but this is the worst Indian food I've eaten in the valley.  NOTHING was fresh.  Everything tastes like it came thawed out of the freezer.  The samosas were so old and stale the green peas were a strange brownish green color and the minced lamb was dry as sand.  The lamb dish we ordered was so over cooked it felt like beef jerky chewing it.  And to top it off the chutneys looked and tasted like they came out of a jar from the grocery store.  If you truly like this food do yourself a favor and try ANYTHING else and you'll realize how subpar it is.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 1, "date": "2012-08-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wwLx_iMap98-Bw2aDjdvtA", "review_id": "v3WF9rNHwgUBAmVwZUD8Nw", "text": "I've lived in Ahwatukee since 1999 and have eaten at Star of India quite a few times.   I've always found the food good, but not great.  \n\nRecently, I went with a friend to the lunch buffet and was very pleasantly surprised at how much I enjoyed it.  Not sure if anything has changed there or not, but there seemed to be more variety of food to choose from, and more flavor.\n\nI tried to ask the waiter if there were new owners or a new cook at the restaurant, but he only spoke Hindi.  No matter... the food was great and I'm looking forward to heading back soon.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2013-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zp5uqP5YgUoTf3zP2Xx2ww", "review_id": "MkcCCERl7Mb5NcyadtYRLg", "text": "Star Of Indian in Ahwatukee is a gem! The food is excellent & very fresh. I have never eaten anything there that would make me think otherwise. We usually eat our favorite dishes every time we dine there but whenever we try something new it is always a wonderful surprise. The service is excellent, the owners are very nice people and are always willing to go the extra mile to make your visit a great eating experience. I've eaten at other Indian restaurants in the area but none compare and it being so close to where we live (The Foothills) it's a perfect place for us. You must try it once for yourself !!!", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2013-06-10", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "2tRyExv67j1X8LaO581Wjg", "review_id": "FHqpP6bMMXarBS__MmJhYA", "text": "How can anyone give this place more than 3-stars?\nThe food is overly buttered.  My naan is always burnt.  I ordered dahl and it was burnt. I have been here to eat and ordered take-out three times and each time I am disappointed with the taste of the food.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 3, "date": "2013-06-22", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "nP_vZUqkoajeBC4qTV0Mlg", "review_id": "xZg0L3A-K5LLJ8tH2TkIww", "text": "Lunch buffet until 2.30pm.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 3, "date": "2013-07-18", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "rn3kE2LSki7EM8Lklh47zg", "review_id": "MDGY-GalW5dqQnVibRaEKg", "text": "My first experience with India food was not very pleasant. I went to a buffet and the food was just horrible. After that, I tried a couple of other places and just couldn't become to like Indian food. Well, I must say that Star of India really changed my perception of what Indian food should taste like. OMG....they make the best Chicken Tikki Marsala, I always get it spicy by the way. Very good garlic naan and love their vegetables ( potato and cauliflower ). Staff is super friendly and very welcoming whenever I step in the restaurant. I usually get take out and they give me something free to try. Absolutely love this place!", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2014-08-03", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YSfesz6joBJVmVVEt4lJMw", "review_id": "rQZ8wHrssiIMutsN4fQ0kg", "text": "Very disappointed about the Star of India restaurant, on Chandler Blvd!  A view years ago, the food was rather good, well spiced, like true Indian food.  - I had the fortune to have a friend (from Bangladesh) once, who cooked original Indian food for us.  Furthermore, I went for years to good, additionally upper scale, Indian restaurants in Europe and America.  Therefore I know, to distinguish between good and not good Indian meals.  -\n\nYet, the last two or three times, when we went for lunch buffet (in 2014/end 2013) to the Star of India restaurant, we were each time disappointed!  Therefore, we decided now, we will definitely not return anymore.  (But looking for a better restaurant in the Phoenix metro area.)  Paying $10 + tax for a unsatisfactory meal - while you want to go out to eat something special - is not worth it, as well as very,  very disappointing!!!\n\nHere how just recently, on a Saturday, the food for lunch was:   Although the restaurant was fuller than I'd ever seen it, the food was terrible to bland!  Additionally, I see many containers of eight main dishes on the buffet line almost every time not even touched, but full to the rim.  (While I saw in other restaurants with good Indian food, that they had to replenish each dish over and over again during lunch.  Because each lunch time the restaurant is so full that they need to work to keep up with the demand!)  Even the Chicken Masala at Star of India was almost tasteless, as well as runny.  The spinach dish was terrible!  It tasted like chemicals, appearing like a paste - and with almost no Indian cheese in it!  The rice desert was not worth mentioning, bland!  Therefore, of all eight(!!) main dishes, I only had one single one - the Vegetable Masala  with Indian cheese - that was good, tasty.  (... Many dishes tasted like they were watered down or something like this, so that the spices do not come through any longer!  ... The main dishes ran apart when being put on plate.)\n\nThe service is nice, polite.  But the restaurant itself, including restrooms, are very dirty.  Also, the walls at the tables still spilled full with food spills.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 1, "date": "2014-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "llx4tgoq8J6HCmhV6SmZIg", "review_id": "xtxsYlnXBmYBfaVJ9lMrWw", "text": "Preet and crew always take care of you! Best dishes are paneer tikka and naan. Dessert get the ras malai", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2015-06-06", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uVK_AMPkQ7mWSu_VUdix5w", "review_id": "fYlLx-LH657hDhP7PXYkgg", "text": "We have been coming here for many years and it is absolutely wonderful. We have our favorites but everything we have had is great. We have also often ordered take out. I simply can't say enough good things about the food and the people that work there.\nPlease enjoy.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2015-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "wBdAk50jrmREnn7DkYQT_A", "review_id": "x_vHtJZ6_VtQrmqY1xEAUg", "text": "Star of India has some of the best food around. I've never had anything here that I didn't like, the chicken Korma is a particular favorite. Owner-manager(?) Preet is incredibly kind and welcoming, my husband and I are regulars here now and he always comes over to our table to say hello and talk with us. We also usually get a dessert on the house too ;)", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2015-06-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "nwobB_-ZQ5EYtXGuASsGng", "review_id": "tPfNM5SGlrawzkLSPn5zlQ", "text": "Good food..good service. It's hard to find authentic indian food here in the valley and though it isn't really  authentic. .it's fairly good.\nThe owners hustle to provide service and are courteous.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2015-06-26", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "l99DXQE7wXYx1pk1BLdMbQ", "review_id": "gTaQzqAmTgE0pvHjSUGLRA", "text": "I've been eating here for about 8 years, it's the best Indian food around in my opinion. When I first started going there, I thought they were a little rude, but that isn't the situation at all, not anymore at least. They have a delicious lunch buffet that's both vegetarian and non, and I love it all. Don't be afraid of the green stuff, it's delicious, it's spinach with goats cheese. They use to bring out fresh curry chicken but now they just bring out fresh naan, which is freshly made. The table cloths are a little long, be careful when you get up cause you can take the whole table with you.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 5, "date": "2015-07-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "i9W5E_b-8k2PYWXhVe_tyw", "review_id": "UUnI-G04jlwIRYhYaM05Xg", "text": "First visit and not impressed. The reviews seemed to suggest a different story, albeit, I only tried the buffet. The basmati rice was almost tasteless, the chicken tikka masala had very little flavor and the chicken was a tad overcooked. I tried the samosas, but again tasteless. The grilled chicken was dry too. Don't think I will be going here again.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 2, "date": "2015-07-11", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jH4DSPVxzFioYaZQ4syKZw", "review_id": "J2q0HHRMRFAxtoAqjpN7GQ", "text": "Ordered some food to-go last weekend and was told it would be ready in 15-20 minutes. Showed up about 25 minutes later and was told it would only be a few more minutes. Well, I ended up getting my order 50 minutes later and not the 15-20 that was initially told. Such a waste of time! The food was good, but the to-go order portion size is smaller than eating in-house...also, didn't get a side of rice like I do when I've had this dish at a sit-down before. Such a disappointment.", "business_id": "d_8bMNQd0mesbEUeq1U2kQ", "stars": 2, "date": "2015-08-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "kVYRVCTyN6kb-HqNOhWDDg", "review_id": "TAmryFs14mQYhvDkVP66Mw", "text": "Wow. Great food . The chicken tikka masala is the best and the saag paneer is awesome too. Best Indo-Pak restaurant in the Phoenix area and Arizona hands down. They also have a location in Tempe .", "business_id": "H-99nG_KfynWPXh84TKj8A", "stars": 4, "date": "2006-07-30", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "DOJM58OkGSsIdk2qCUZnLQ", "review_id": "0ZL_sP8oMFUOsAnAMA8hiQ", "text": "If you want spicy, this is where you need to be! The food was excellent, service was also very good. I had the Shrimp Balti with rice, and the chicken with mint sauce. Just all around yummy- and I will be back to try more things!  I was fine with the spice level, but if you aren't a fan of spice then even the milder dishes might be too much.", "business_id": "H-99nG_KfynWPXh84TKj8A", "stars": 4, "date": "2009-06-12", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "LrPrLrs6UW8BEJ1xzpfnkg", "review_id": "-tdOaRXvsemeZuE53rqMRA", "text": "I've eaten here several times and I think the food tastes very good. The buffet is the only way to go here because the meals are overpriced and  portions are small,  Now the service is horrible, inattentive at best , I don't feel welcomed and the servers I have had were flippant and the last time argued with us regarding the tea, we were served tea that was old but he insisted it was fine. Kinda aggravating. So if you are just looking for some good indian buffet, with out service not a bad place.", "business_id": "H-99nG_KfynWPXh84TKj8A", "stars": 2, "date": "2010-06-29", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "GZZs7288ZoIz2hx_vcAVUw", "review_id": "eaESs-IFHO3YbAt2OSvQIA", "text": "I feel that I'm cursed with the fact that I'm a small girl who has a boyfriend with a large appetite. He always wants to go to buffets and I always feel like it's a waste because I usually can barely finish off one plate.\n\nWe came into Kopper Kettle since it's right next to one of our other favorite restaurants. The service was extraordinary. The manager/owner asked us if we had ever eaten there before. We told him it was our first time and I had eaten indian food before but he was new to it. He then took us around the buffet and explained each dish to us, what was in it...the level of spicy...and what it goes best with. It was the nicest thing ever because my biggest fear in restaurants is mystery meat since I can't eat pork or shellfish. \n\nThe owners wife was our waitress and she kept our drinks filled and was constantly asking if everything was good or not. Which by the way IT WAS. I've had a lot of indian food but their buffet really took the cake. It was wonderful. \n\nAt the end of our meal we were surprised however, because the total for two buffet dinners was almost forty bucks! The food and service were amazing but forty bucks seemed a little steep to me. Maybe if I was a normal American who could wolf down four plates and then go back for dessert it would be worth it...but whenever I go to buffets I feel sort of ripped off since I can't take anything home and I barely eat.  \n\n\nOverall~\nFood: Amazing\nService: Amazing\nAtmosphere: Amazing\nPrice: Disappointing", "business_id": "H-99nG_KfynWPXh84TKj8A", "stars": 4, "date": "2010-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LmCkhilB78gPm8uIU5nCWQ", "review_id": "_YqGfxbalxxMf-s0v8-qSA", "text": "I am not an expert on Indo-Pakistani-etc food, so you can take my review with a grain of... spice.\n\nTHE FOOD\n\nI've been here twice so far and would like to think that my delicate taste buds are getting accustomed to the spiciness. I have not tried the buffet, just the table service. The portions are reasonably sized and food comes out quickly. The mango lassi is a must if you are a weakling like me for just about any of the dishes. If you are truly weak, asking for \"mild\" might still be too much for you, but then you probably should've tried Arby's instead. I tried Tandoori Chicken Tikka the last time I was here.\n\nSETTING\n\nEvery time I was here, the number of guests was pretty low and I had a choice of booth or tables. The spacing is reasonable, the lights are just right and there are no funky smells coming from the kitchen, so I would say the place is exactly what you'd expect for the price.\n\nSERVICE\n\nAttentive and not overwhelming. Even towards the end of the night when the waiter obviously didn't want to wait any more, everything was served swiftly and water refilled just in time.\n\nOVERALL\n\nI will definitely come back, the mango lassi has my heart. I wish the prices were a bit lower, but there are no surprises in what you get for your money.", "business_id": "H-99nG_KfynWPXh84TKj8A", "stars": 4, "date": "2010-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "WcnFWEVx9HO4eplGqvvr1w", "review_id": "qhTa8JWTuQ8Majzw2lk_6A", "text": "In the mood for Indo-Pakistani food?\n\nCome here on a weekend and you will not be disappointed.\n\nEach and every time my daughters attend a weekend birthday party, my wife is the one that takes them.  Where does daddy go?  I go to Copper Kettle for a lunch buffet.\n\nI am very fond of the seemingly endless combinations of flavors and textures Indo-Paki food presents.  I am no stranger to spicy food.  I love it and it loves me.  Whenever I get a chance to go to Copper Kettle, I am in my \"happy place\".\n\nLet's say you are a first-timer.. All you need to do is tell the server and he/she will take you on a tour of the buffet tables and give you an impromptu education on the cuisine.  I know this because a few years ago, my wife felt very inquisitive and asked about the dishes they were offering.  She found the waiter to be very helpful.\n\nThe best way to can \"break the ice\", experience and learn about another culture is to eat their food.  Give this place a try.  You'll be glad you did.", "business_id": "H-99nG_KfynWPXh84TKj8A", "stars": 4, "date": "2010-08-26", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GTUe4jQB9wVX90M4g6q4FA", "review_id": "Yejc9wDZeLeVXRNnYARmGw", "text": "this should be  -5stars\n\nfood was terrible to put it midly. \nbiryani was stale and dry. the rice must have been on the heater since morning tasted bad and rice as bone dry and hard.\npakoda was a joke was not properly fried and tasted of batter.\njamoon tasted of oil after first bite. chicken tikka was sweet. the only eatable dish was naan and ginger chicken. they charged 11.5 for buffer wasnt worth even 2 dollars. please look else where for good food.\nfor good biryani try sabri nehri on devon in chicago", "business_id": "H-99nG_KfynWPXh84TKj8A", "stars": 1, "date": "2011-06-11", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nP_vZUqkoajeBC4qTV0Mlg", "review_id": "VHqpLZ3X0sQ66IYf-MtdNQ", "text": "The food was great! I loved goat and lamb curry ( I forgot the name of the food).\nThe price was quite high for lunch buffet that open till 3pm (its about $12). Its the same price if you go to Pasific Buffet but you can get more choices ..lol.\nThe only thing that less interesting was the service. The guy who working as a cashier served us that time. He didn't smile, didn't answer everytime we said thank you (I mean, you should be polite to customer, at least, right?!), and he didn't care about our water drink until we asked for it. Even with those experienced, I like to give 4 stars just because the food was very very yummy! Delicioso!!!\nI would like to go back (but might be in different time.lol..who knows, I might get another waiter that more friendly than that man..lol )", "business_id": "H-99nG_KfynWPXh84TKj8A", "stars": 4, "date": "2011-06-13", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "d66FhQQZzFDKxklh6t63RA", "review_id": "BrwrjbhYumZKdSQiGcwj4A", "text": "A very, very nice Pakistani buffet.  Every single thing we had was delicious and seemed very fresh.  The service was perfunctory (it's a buffet) but friendly.  And quite a bargain at $11.50 per person.  Highly recommended.", "business_id": "H-99nG_KfynWPXh84TKj8A", "stars": 5, "date": "2011-06-25", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ih8pG-QxzbtwTWAL9NzP8g", "review_id": "1GLudzwnILFMLU1CbnvSWw", "text": "Awesome food, fair prices, great service, very authentic...they are great for kids and will modify the spice to your taste.", "business_id": "H-99nG_KfynWPXh84TKj8A", "stars": 5, "date": "2011-07-24", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "ZzXsskFHBYlHigIC0mX9lg", "review_id": "hyV-sgbuofdvxP4A9_hOXA", "text": "01/2012 moved to sw alma school & warner (s end of shopping center)", "business_id": "H-99nG_KfynWPXh84TKj8A", "stars": 5, "date": "2012-08-12", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FjDJcEFfPa9eHxmU32vcLw", "review_id": "gxoeeo5pW7UfI6niJqk1lQ", "text": "It's been many years since I've been to Copper Kettle and I really loved eating here.  It  used to be a favorite place of my ex-husband's and mine.  However, when they moved to Alma School/Warner, I had ever intention of going, and was looking forward to going in the fall, however, I saw that they were closed.\n\nGlad to hear they have another location, but near ASU is a bit far, so don't know when we will try this new location.  \n\nI remember their food being so good and the beef just melted in your mouth.  Loved the Lamb Briyani.  That is one of my favorite dishes.  \n\nAnyway, the buffet wasn't too bad before, but dinners can be pricey and I remember sometimes the wait was a long time.  Said was really nice, but he's probably not there anymore.  Most of the people that worked there weren't too friendly, except for t-2 college students that worked there.  \n\nAnyway, miss their food.", "business_id": "H-99nG_KfynWPXh84TKj8A", "stars": 4, "date": "2014-08-23", "type": "review"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "BexqMBJU4xgXy5DQPdsjiA", "review_id": "_3F-4qjURCsGT-_n1QV3KA", "text": "Only been there a couple of times, but the food has been consistently good.  Not great but good.  Prices were reasonable and the staff has been attentive.  Worth giving it a shot.", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 4, "date": "2008-07-21", "type": "review"}
{"votes": {"funny": 3, "useful": 2, "cool": 0}, "user_id": "LTX9pmF-zXPYB4wE8b9RZg", "review_id": "xtLSJc_Tkxgic4syiXn3WA", "text": "I was on a date with my daughter, dammit.  Here's how it works:  every other Wednesday each of us takes a daughter out to dinner.  That way we get to have dinner with each of our daughters once a month.  It's a great opportunity to check in -- hopefully they will open up at some point.  Anyway, this time my oldest picked Indian.  I was thrilled.  Usually they both pick Chinese and, much as I like it, it does get tiresome.\n\nMeanwhile, back at the review, we ordered the meat appetizer.  This had a couple kinds of chicken, a meat samosa and lamb kabob.  It was fine, not bad, not brilliant.  My daughter got chicken tikka masala, her favorite.  I tried a ginger kabob at the waiter's suggestion.  These, too, were fine.  No fine dining but not bad.  At this point I didn't realize that they nickel and dime you so I was still oblivious as to what this mediocre food was going to cost me.\n\nThen we went to the bathroom.  We were nearly done and my daughter asked me to accompany her.  That's where we saw it -- the cockroach.  It was easily an inch long before you got to the antenna.  To be fair it was dead.  But at some point it had been alive and had had plenty of time to grow oddly large.  Now I realize that I'm new to PHX and there are palmetto bugs here but I used to live in an old brownstone in the city and I know a cockroach when I see it.  It was right under the empty toilet paper dispenser.\n\nI told the waiter that the toilet paper dispenser was empty, hoping that he'd see the roach and know that I saw it.  I paid the bill and left, intent on warning yelpers everywhere.", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 1, "date": "2008-07-23", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7tA04v45dzG8tADZGLrCzA", "review_id": "TkpbKJb15daQecXgaKdzgA", "text": "Last week I had this mad hankering for some Indian food and I thought I would give the India Gate a try since it's right down the street from my office.  It's a pretty typical Indian buffet; they have Indian rice, chicken curry, chicken tandoori, ground lamb, and enough vegetables to satisfy any of your vegan friends looking for a buffet.  I went as soon as they opened at 11:00 and everything was hot and fresh.  Service was decent, I didn't understand a word they said but they brought me naan without requesting it and kept my water glass full.  I wouldn't say this place blew my skirt up or would win any awards, but if you are looking for a quick scoot in and scoot out for some Indian food, it will suffice.  Quick tip: go out to their website to get the coupon for the lunch buffet before you go.", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 3, "date": "2009-07-04", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r1yKgEmu7cJgw4u1MnId-A", "review_id": "Zxv_WWWgku9LDHsnWZsUtA", "text": "I tried the lunch buffet here today.  It wasn't bad, and it was better than an Indian place I tried in Ahwatukee two weeks ago.  The rice, Dahl, Garlic naan, and ground lamb were all good.  The Chicken korma was a bit bland for my taste and the sauce was pretty thin.  The pakoora was a little tough as was the gulab jamin.  Overall, not bad, I would eat here again, but I will continue to search for a better indian place in the East Valley.  The lunch buffet was $10.91 with tax, service was decent.\n\nc", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 3, "date": "2009-07-09", "type": "review"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "9VPNlcKsL99FvKtz1r9qJg", "review_id": "Fi80XIat0BXRUaH6fLqOHA", "text": "I was staaarving today at lunchtime so when my husband suggested the Indian buffet, I was so down! Everything was really good, I haven't had vegetable pakoras in years, so yummy. The only thing I'd say was lacking is the decor. The first room you walk into is fine, but then there is another huge room, that's half empty. It's kinda weird. \n\nI'm happy to hear that they are going to start offering a dinner buffet starting in September. The waiter also said that the dinner buffet will offer more variety that lunch, including some seafood. YAY.", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 4, "date": "2009-08-10", "type": "review"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "zZSG1Zh4OHGKTNEaGQ_VSA", "review_id": "2oPwSQcsp4c-tVKZ04gz_g", "text": "The review is for the buffet only. I visit often since it is near my workplace.\n\nThe food is just all right but lacks the variety. I wish they add a few more dishes (like seafood or lamb) rather than those tasteless sweets.", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 3, "date": "2009-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mFtXb1t9-CbPZMnHEsRrkQ", "review_id": "8-2EPOl_1EpCERo7mehhng", "text": "I went to India Gate with my boyfriend and had a great experience. The interior design was pleasant, the music was energetic, and the servers were extremely nice and helpful. We ordered paneer pakora as our appetizer and cheese naan. Both were undoubtedly delicious. For drinks, my boyfriend ordered the Merlot while I got the Cabernet Shiraz Indian wine they offered. The Indian wine was a real treat and the Merlot wasn't too bad itself. I don't remember exactly what my boyfriend got for his main dish but it contained shrimp and he loved it. My main course was the vegetarian dinner: Soup, two curries, daal maharani, rice, raita, naan, and kheer. While everything tasted perfect, my favourite was definitely the vegetable soup which consisted of lentils, numerous vegetables, and just the right amount of spices and herbs.", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 4, "date": "2010-08-25", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "pIm17SVRo8IdhGoBD4qbnA", "review_id": "RfZGuOfgk2bzaxrv-bUjFQ", "text": "I'm starting to get the hang of Indian food, and as George Costanza would say: \"I'm Loving It !\".  So when a friend suggested an Indian buffet, I was all over it.  India Gate is great, not pretentious or over the top, with a good sized menu, oh but I didn't want the menu Georgie, I wanted the buffet.\n\nIt had all of my favorites like palak paneer and matter paneer, plus some new favorites like the minced lamb and green chutney.\n\nI love their lunch buffet and stop by at least twice a month, but I was unimpressed with the lamb vindaloo entree from the menu. The lamb was tough and had gristle. Boo Gristle... Hooray Beer!", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 4, "date": "2012-07-12", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "lAngRi4lwBIHmjCBVLd-8Q", "review_id": "87W-NgtauuTjqRVQag89RA", "text": "Let's see, yummy , yummy, yummy and , yummy.  What else can I say.  I'm a sucker for Indian food and this place did not disappoint.", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 5, "date": "2012-07-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1n_5FMQjbT7be4kz9zVU_A", "review_id": "Egf4qlYTjX0_UY8XMN2O6w", "text": "Atmosphere was good. Service was good. That's about all. They are pricy ($40 for two people and small portions) and they either overcharged or charge for all parts of the meal (ie rice). All in all, won't be going back.", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 3, "date": "2013-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Ki71iAFTxsPPQfX430c99Q", "review_id": "IbZATXO5sRuFLoKKiYVnkg", "text": "Decent buffet, chicken can sometimes be dry. I like the way they make their naan", "business_id": "wy_R4crNr1BH0CP87y9UHQ", "stars": 3, "date": "2014-08-04", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "36FJRLnHuzlDY8tcEk7VHw", "review_id": "XniWQ2_N1fCuk6seGUVEIA", "text": "Best Indian food (highly recommend the Shahi Paneer) I've eaten!  Overly courteous staff, great prices, friendly atmosphere.  I've eaten here for the past year or so at least once a week and the menu never gets dull or boring.  Their Matar Paneer or Aloo Matar is to die for.  Additionally, try the veggie pakoras as a nice appetizer.  If things get too spicy, cool off with a delicious Mango Lassi.", "business_id": "6SMQl2vR37HvjYWwSl1V3w", "stars": 5, "date": "2007-08-03", "type": "review"}
{"votes": {"funny": 2, "useful": 5, "cool": 4}, "user_id": "EoTooNBcxu0Hy0-XeZI8aw", "review_id": "WU81FDGLMnLzPIcijMyXQQ", "text": "When hubby and I first landed in Mesa, we were had a fierce craving for Indian food. We pulled up google and did a search which led us to Royal Taj.\n\nWe had literally been in Mesa for a few days and were used to Indian food in Britain. We found this place ok, but not as flavorful as we would have liked.\n\n...Two Years Later...\n\nAfter lacklustre Indian food and mindbendingly tasteless curries from different places, I decided to give this place one more try. It's also ten minutes away from my house.\n\nI will have to change my mind about this place - the curry is wonderful and their tandoori chicken is just barely made on this side of heaven.\n\nI will recommend Royal Taj to anyone who wants good Indian food.\n\nThis is my favorite Indian place - until I find a new one.  :D", "business_id": "6SMQl2vR37HvjYWwSl1V3w", "stars": 4, "date": "2008-08-11", "type": "review"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "6WJHk3E4PLt0-EXakw5Kdw", "review_id": "dCCxpIYQSuXwQV_QyOtNug", "text": "I was totally jonesing for Indian food, and since none of my friends like Indian food, I decided to go solo.  That's always an awkward thing, but I was undeterred in my quest!\n\nI've been to Royal Taj many times, and it is consistently good.  The naan is fabulous, the chicken tikka masala is always tender and delicious, and the palak paneer is incredible.\n\nIt's not one of those places to go if you're looking for outstanding service or ambience, but the food is always great!", "business_id": "6SMQl2vR37HvjYWwSl1V3w", "stars": 5, "date": "2008-08-31", "type": "review"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "jQxxHLXLbFsNYNWNdSjRKQ", "review_id": "nvBIgRxtO1dt01pyEw2K7Q", "text": "This place is proof that Phoenicians are more about style than substance. Like another poster mentioned, the place is empty and it shouldn't be because the food is delicious. Yes, it's a hole in the wall but its also safe: think Broadway and the 101...we are not talking Maryvale here.\n\nThe food is wonderful. The chicken tikka masala isn't a cheap gravy soup. There are actual pieces of boneless white chicken breast. The sauce has a perfect red-orange color with a nice creamy consistency. And unlike 90% of Phoenix Indian restaurants, they didn't overdo the tomato in this curry so it's not sour and has a nice buttery and smooth flavor. The saag paneer is thick and uses real spinach; it's not a Campbell's cream of spinach soup with some mirchi. And the malai kofta is arguably the best in the city. The kofta balls are not hard and doughy and the sauce has a nice creamy texture. It's a difficult dish to do and if you want to see if an Indian restaurant is legitimate, order the malai kofta. If a place butchers that dish, leave because if they cant do that dish well, you know it's not a real Indian restaurant.\n\nThis place is a true mom and pop joint. No, this is the real thing meaning the pop cooks and the mom waits tables literally. I love that. But if you are Joe Phoenix and are expecting to eat at a Scottsdale'd up PF Chang's version of an Indian restaurant, go to Dhaba up the street, if you actually want good food, go here.\n\nThe service is friendly but the problem is the mom is the only server. Suprisingly she is faster than 3 or 4 teenage servers at most Phoenix restaurants but still, I have to be objective and find something wrong right..so there you go, slow service.\n\nNonetheless, this place is charming because it's anti Phoenix. It's a family owned restaurant. The ambience is sincere. You genuinely get the idea that you are dining to a home cooked meal. Yes, the place could do more in regards to the ambience. It really reminds you of an 80's restaurant but I could care less about that other stuff. I'm about the food and service. I always get treated like I'm the owner's kids and she treats everyone like that and the food is wonderful. What more could you ask for?", "business_id": "6SMQl2vR37HvjYWwSl1V3w", "stars": 4, "date": "2009-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "T7J9ae0wTskrI_Bgwp-4cA", "review_id": "uO5ssI7McznLbrHaih64Nw", "text": "Not overly impressed.\n\nWhat is the crispy flat bread they bring with dipping sauce before your meal called?  It was really good but they only brought 2 pieces for our table of 4.\n\nMango Lassi- Delicous\nYogurt Salad- just okay\nGarlic Naan- really good\nBangan Bharta- could be spelled wrong?  The eggplant- Worst I have ever had in any Indian Restaurant.\n\nAlso, I ordered my entree mild to medium.  Others at our table ordered very hot temperature.  I believe mine was the spicest of all.  Hate when they mess that up!!!", "business_id": "6SMQl2vR37HvjYWwSl1V3w", "stars": 2, "date": "2009-06-28", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ac7U2NcSRZ0k9C-Xq0dZog", "review_id": "6DLBE8abysJycqyDBP97xg", "text": "My girlfriend and I were craving some Indian food so we looked up this place on Yelp and decided to hit it up while we were in Tempe. We ended up getting the lunch buffet, which was overall just OK.  The Saag Paneer was disappointing, while some of the curries were way too salty.   However on the plus side the garlic naan and the chicken tikka masala were delicious and the chicken tandoori wasn't bad.  Also the service was very friendly.  It may have just been an off day but I can only only give it 3 stars.", "business_id": "6SMQl2vR37HvjYWwSl1V3w", "stars": 3, "date": "2009-08-22", "type": "review"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "_8eGLKjVpGK_mxwM8mlOgA", "review_id": "2c9droeZib_KKZGD-ZLB7Q", "text": "I had to give a star because it's mandatory, but this place should not get one at all. \nMy friend and I ate here one night, we were practically alone in this dead restaurant. After the way were treated and the food I can see why it was dead. \nThe waitress took about 5 minutes to ask us what we wanted to drink, then took about another 10 to take our dinner order. She told us that rice was not included with our meal and that we had to get it on the side at and extra cost, but the whole meal had rice so I don't know what she was trying to do. After she dropped off our food she came back and was trying to make me put my food on to another plate and got mad when I said no. Then about 20 minutes later she came back and asked if I wanted a box for the rest of my food and I told her no she got mad and didnt come back. We had to go up to the cashier and explain our order to him, right after we did that she finally came over and tried to get in the middle of everything. \n\nThis was the first time I ever had this type of food and at this place, I don't think I will ever try either again.", "business_id": "6SMQl2vR37HvjYWwSl1V3w", "stars": 1, "date": "2010-06-18", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qLT-xqFCoVlIwreGS7GjuQ", "review_id": "U8kYSvjK1dbry-TmyEwe9Q", "text": "I keep looking around for a good Indian places, and this is one of two which consistently delivers. Star of India, in Ahwatukee, is the other.", "business_id": "6SMQl2vR37HvjYWwSl1V3w", "stars": 4, "date": "2010-07-17", "type": "review"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "38t4_TFlLsX_MeiBMltM-Q", "review_id": "NzCsu5Zzgxsme29DKDNbmQ", "text": "glory be to tandoori eee\n\ni heart this place so much, and that means more than you. raj rani is the cutest, i swear she is hopped up on ginkgo biloba because you can come in with a party of 6+ and she never forgets the who's and the what's.\n\n appetizers are meh....but the chicken fraizee and chicken tikka are sexlectric. get the tikka and you will understand. \n\nspecial naan is flipping good as well, but i usually go with onion kulcha or pudina parantha. the bar is shiny and someday i will drink to drunk here...but i will not over do it because the last place you would want to be flailing around would be the ladies room stall. yes,it is still there...it's gone from disgusting to endearing. my favorite transition, actually.  i have come here hungover..it's a miracle really. sweet lassi will cure many an ailment.\n\nthe sticky balls are delish but if you go during buffet hours your balls will be hot, i prefer them chilled, better for the syrup. \n\ni highly recommend this place...i wish they were open for breakfast.", "business_id": "6SMQl2vR37HvjYWwSl1V3w", "stars": 5, "date": "2010-08-30", "type": "review"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "7C-jyTrOX-iJ-MrSJuh-8A", "review_id": "czuC_isOdxtXUPfV_ORHiQ", "text": "They are only getting three stars from me because while the food was delicious, the service was abhorrent. We were seated and the waiter explained the menu a little to my partner who has never eaten Indian food before. When we were ready to order, we had to flag him down to come take our order and he seemed like he was really pained to take our order and did not say thank you or anything. It took forever for us to get our drinks and we had to remind him to bring them to us. \n\nThe food finally came and things are a little expensive here, rice is not included and the portions are small. The flavor of everything is spot on and genuinely authentic though. I ordered the matter paneer which is  green peas and homemade cheese cooked with spices (8.95). My partner ordered the lamb fraizee which is lamb cooked in special gravy with onions, tomatoes, bell peppers, tossed in an Indian skillet (14.95). The naan and garlic naan was to die for and is only 2.00 and 2.50 respectively. The atmosphere is intimate and quiet so this makes for a good date spot but the service was inexcusable. \n\nNo one came while we were eating to see how anything was and we had to flag down the waiter to fill our glasses with soda. We ordered a lot of food and enjoyed that portion of it but when it came time to leave we also had to flag the waiter down to get us our check. We left with no thank you or any acknowledgment. I think the waiter was one of the cooks so maybe he needs more work on customer service. I will try Royal Taj again however and then post my updated review it was that good.", "business_id": "6SMQl2vR37HvjYWwSl1V3w", "stars": 3, "date": "2011-06-01", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RyKKn7lV7StxDngkGt_6_w", "review_id": "SGv_owUfIcNmaMG-hRcWdg", "text": "I went here the other night after a nearly 18 month absence (not because of anything wrong with this place but because I had graduated from law school and wasn't in the area as often) and am glad I did! \n\nI remembered why I love this place: the service is friendly, the food is good, the prices are fair. It wasn't very busy on a Thursday evening so I had the pick of any table I wanted. One of the owners bustled over with water right away and took my drink order. I wanted a Blue Himalayan beer but she told me that they were out but she made a suggestion of a similar beer, the Flying Horse, and it was prefect with the food. I ordered garlic naan, basmati rice and chicken vindaloo. The flavors are all great but here's what I love about this place: when I say \"Indian hot, please\" they bring it to me Indian hot. She only raised one eyebrow and repeated back \"Indian hot?\" And when I nodded, she smiled and away she went. \n\nI loved the spice on my vindaloo and the beer that she suggested worked well to cool me down as I was eating. I love that the heat doesn't hide the amazing flavors in their dishes. The portions are generous and I had a good dinner and a large lunch out of my meal. The lamb saag is also excellent and I have had their biryanis in the past as well. This is a solid place to go and I am glad to have rediscovered it after a long time away.", "business_id": "6SMQl2vR37HvjYWwSl1V3w", "stars": 4, "date": "2011-06-04", "type": "review"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "6PHSvn_G2Bh5ZEVT6mMwaA", "review_id": "XazwI5Lkx40xhKybOQopZg", "text": "YUMMY!! I loved this place!! The food was out of this world AND  they have a HUGE menu with tons of veg options.  I would recommend this for anyone that loves Indian -- especially good for first timers.  You can get the sauces in mild if you don't like it too spicy.  The staff was soooo sweet and polite.  We went last night for the first time and even though I had an allergic reaction to one of the spices.....(I think it was cardamom) and had to get wasted on benadryl when I got home I am still DYING to go back ASAP!! We will definitely keep going back again and again.  :0)", "business_id": "6SMQl2vR37HvjYWwSl1V3w", "stars": 5, "date": "2011-06-07", "type": "review"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "3gIfcQq5KxAegwCPXc83cQ", "review_id": "j0D6pQ8W29FW8lA0lbYO6A", "text": "I came here tonight with my friend on one of our worldly eating adventures. I thought it was very good! The place isn't super fancy inside or out, but the service was fine and attentive and the food was good. We shared the lamb vindaloo (spicy) and chicken tikka masala (medium) along with some rice and garlic naan. So first they brought out the indian equivalent of chips and salsa... it was a crispy thing with a green, spicy sauce and a purple sweet and spicy sauce which were both good. Then we got the food. Well, I was not a huge fan of the lamb. I thought it was spicy, but didn't have the flavors I really enjoy in Indian food. It was just kind of spicy and boring. The tikka masala was delicious, however. It was creamy and flavorful, with just a little spice. I would probably order it spicy next time. The naan was good, but nothing super special. When we were done, they brought out a little free dessert which was like a pancake puff ball soaked in syrup.... pretty good stuff. I thought the place was pretty pricy, but that's kind of the way it goes with indian food. Overall, I thought it was a good experience and I would definitely come back.", "business_id": "6SMQl2vR37HvjYWwSl1V3w", "stars": 4, "date": "2011-06-08", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OxvnYH2G4tmea-qCfDMs5A", "review_id": "bVyKbW7kXHM90V_NCbWGGw", "text": "I got food poisoning from the Lamb Vindaloo, the naan was hard and tough and we ordered one mild and two medium dishes and all were pretty hot. The lamb (which I have just about everywhere) was pretty tough too and not that great, so I only ate half. Good thing because the food poisoning may have been worse... Avoid! Service was good though.", "business_id": "6SMQl2vR37HvjYWwSl1V3w", "stars": 1, "date": "2011-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_FBmWTiq37OphKPtLZNfMw", "review_id": "gBAMuKm-Wp_q0F_78H3w-A", "text": "This was the 1st time trying the Royal Taj. We choose this place because of the overall reviews from Yelp.com. The overall experience started out good. The lady was very helpful in explaining some of the dishes and making suggestions. Throughout our meal, she did come by to check on us. We waited for the bill to come which took a while, and while we were waiting we noticed that this place must be good when actual Indian people go there to eat indian food. Ok, so fast forward to the lady finally coming back, we asked her to split the bill, she replied that she would \"be right back\". 20 minutes later, we spotted her just chit chatting with what I assumed was her husband. We sent up my brother to check on the bills to which she replied \"ok\", as if we never had asked and if she had no intention on doing anything about it. 10 minutes later, both the lady and the guy comes out and says ok, come up and let us know what you ordered. So our party had to come up in chunks to tell them what we ordered so they could split the bill. Very unprofessional. My suggestion for this place is to keep the owners out of the dining room and hire some professional waiters and waitresses. So overall it started off good but once we asked to split the bill, it environment turned really sour. Ending our night on a bad note. It's probably good if you just call in your order and take out.", "business_id": "6SMQl2vR37HvjYWwSl1V3w", "stars": 3, "date": "2011-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HAIhdvH8nxvjLyY2VlYpVQ", "review_id": "erP_81ef4l3gg-Gm4Rujrw", "text": "I work right around the corner and have driven by Royal Taj a zillion time, but never went in for lunch the other day and WOW it was good.  For a lunch buffet...excellent and I am not a buffet person!!!  \n\nAnd!  The staff is simply wonderful...If you guys read this, thank you again for your incredible food and kindness.", "business_id": "6SMQl2vR37HvjYWwSl1V3w", "stars": 5, "date": "2012-07-14", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "T_kXYOujy6xvkfOezNYf9Q", "review_id": "A4ALh9uidmCHFaVOlwFdWA", "text": "We went for lunch buffet, the food was just ok. Not many people were there and the ambiance too was not good. Being an Indian, definitely  I have tasted better food, the options for vegetarians were less and even did not taste so well.", "business_id": "6SMQl2vR37HvjYWwSl1V3w", "stars": 2, "date": "2012-08-16", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "q3U0L9fyTW2Inw4fvQh5dA", "review_id": "lzsToQ--_dBwjxdS4q6Fig", "text": "My husband and I go here at least once a week. The people who work there are very nice and remember our orders.  The food has been hit or miss in the past, but lately it has been quite yummy. It is fairly priced and they generally have it out to you shortly.We are vegetarians so there are plenty of great options for us. My husband gets the muttar paneer and sweet naan and I get the garlic naan and the dahl. They are both quite delicious and even better when mixed together!  I like the music generally, sounds like traditional Indian music. The ambiance is ok, the place is clean and there is hardly anyone in there.", "business_id": "6SMQl2vR37HvjYWwSl1V3w", "stars": 4, "date": "2012-08-21", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WrZ5jcP4MKO8oYNqHS6MWw", "review_id": "xxoDsjaqoed23FieT8EA1w", "text": "I had to bump this up to a 5 star rating after trying the delicious Shahi Paneer!", "business_id": "6SMQl2vR37HvjYWwSl1V3w", "stars": 5, "date": "2013-07-17", "type": "review"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "ptlhm1iLTMeKgdIYBgSsgw", "review_id": "bdlMiP2PCAjOBgRNOhzpMw", "text": "Like most of the reviews have already stated... no one else was in the restaurant. I don't understand how they stay in business, and I assumed the restaurant portion of the building was merely a front. \n\nI did not enjoy the atmosphere of this place, at all. A nice woman took our order, then went to the kitchen to make it, I assume. The food was decent, actually pretty tasty. I ordered the vegetable platter, it was about 15 dollars which was twice as much as what my friend got, for half as much food. I didn't care, I thought it was pretty delicious. \n\nI don't think I will go back because I'm fairly sure I can find a decent indian food place with a slightly better vibe.", "business_id": "6SMQl2vR37HvjYWwSl1V3w", "stars": 3, "date": "2013-07-29", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "AN0Gba_psXS0hEm8Qqtxbw", "review_id": "hj2xsXuMrtfhRYLxAoxA9Q", "text": "Royal Taj has changed hands and changed its name to Nandini.  The food offered at the buffet was excellent.  Savory sauces and more dessert options than before.  Plus new paint and remodeling.  Give it a try!", "business_id": "6SMQl2vR37HvjYWwSl1V3w", "stars": 5, "date": "2014-06-02", "type": "review"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "c8JiT_EiU4IUAvEeSWZS3Q", "review_id": "D1FUttSZYS3smEdPXU_sXA", "text": "Love this place, my boyfriend and I come here often because we just crave that chicken tikka masala they are famous for. The server is old and sweet, always quick to laugh and smile. Good for authentic food and a traditional atmosphere. Don't come here looking for fast food but for flavorful food and an experience.", "business_id": "6SMQl2vR37HvjYWwSl1V3w", "stars": 5, "date": "2014-07-08", "type": "review"}
